{
  "url": "https://voxday.net/2009/09/26/nfl-must-face-facts/",
  "scraped_at": "2026-01-08T23:07:48.423486",
  "title": "The NFL must face facts",
  "date_display": "September 26, 2009",
  "date_iso": "2009-09-26T16:30:00+00:00",
  "date_from_url": "2009-09-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I love the NFL.  I am delighted with the league right now, not because both the Vikings and Meerkats are 2-0, but because their customer service has been excellent.  Last week, NFL Game Pass slowed down so much that the early games became unwatchable partway through the second quarter.  I assumed it was my Internet connection, which I’m planning to change at the next opportunity.</p><p>However, on Tuesday, I got an email from the NFL taking responsibility for the problem, apologizing for it, and giving a one-sixteenth refund.  It was totally unexpected and very well done.  So, someone in the NFL organization clearly understands customer service.  And perhaps whoever that is should be put in charge of dealing with <a href=\"http://men.style.com/gq/features/landing?id=content_10980\">the developing problem of head trauma</a>, because this is an ugly situation that the NFL has, unfortunately, not handled well for fear of lawsuits from former players and their families:</p><blockquote><p>[Dr. Omalu] wrote a paper detailing his findings. He titled it “Chronic Traumatic Encephalopathy in a National Football League Player” and put it in an envelope and sent it to the prestigious peer-reviewed journal Neurosurgery. He thought NFL doctors would be pleased when they read it. He really did. He thought they would welcome a finding as important as this: scientific evidence that the kind of repeated blows to the head sustained in football could cause severe, debilitating brain damage. He thought they could use his research to try and fix the problem.</p><p>“I was naive,” he says now. “There are times I wish I never looked at Mike Webster’s brain. It has dragged me into worldly affairs I do not want to be associated with. Human meanness, wickedness, and selfishness. People trying to cover up, to control how information is released. I started this not knowing I was walking into a minefield. That is my only regret.”</p><p>Nothing was welcoming, nothing was collegial, about the NFL’s reaction to Omalu’s article that appeared in the July 2005 edition of Neurosurgery. In a lengthy letter to the editor, three scientists, all of whom were on the NFL payroll, said they wanted Omalu’s article retracted.</p><p>“We disagree,” they said.</p><p>“Serious flaws.”</p><p>“Complete misunderstanding.”</p><p>The scientists, Ira Casson, Elliot Pellman, and David Viano, were all members of the NFL’s Mild Traumatic Brain Injury committee. In tone their letter to the editor struggled to remain calm, but everyone could read the subtext: We own this field. We are not going to bow to some no-name Nigerian with some bullshit theory.</p></blockquote><p>There’s a few lessons that can be drawn from this article.  First, it proves that the next time anyone tries to snow you with talk of scientific purity, they’re nothing more than lying science propagandists.  Scientists are bought as easily as anyone and far more often than most.  Second, it’s apparent that for all it is pretending Dr. Omalu doesn’t exist and his theory is “flawed”, the NFL knows he’s probably correct and are attempting to do as much as they can to solve the problem without being sued into oblivion by every ex-player who ever knocked a helmet against another player’s helmet.  Third, it completely destroys Sam Harris’s ludicrous and entirely unscientific theory about how those who engage in what he calls “magical thinking”, (in other words, all religious individuals), are somehow rendered incapable of properly performing science.</p><p>And fourth, it should help those of us who are fans of the league to understand why the league is encouraging the refs to throw flags on what look like normal helmet-to-helmet action.  I’m as opposed to turning the league into two-hand-touch on the quarterback as anyone, and there’s nothing better than seeing a DB lay the smack down on some diva WR, but I really don’t want to see any more players ending up like John Mackey either.</p></div>",
  "content_text": "I love the NFL.  I am delighted with the league right now, not because both the Vikings and Meerkats are 2-0, but because their customer service has been excellent.  Last week, NFL Game Pass slowed down so much that the early games became unwatchable partway through the second quarter.  I assumed it was my Internet connection, which I’m planning to change at the next opportunity.\nHowever, on Tuesday, I got an email from the NFL taking responsibility for the problem, apologizing for it, and giving a one-sixteenth refund.  It was totally unexpected and very well done.  So, someone in the NFL organization clearly understands customer service.  And perhaps whoever that is should be put in charge of dealing with\nthe developing problem of head trauma\n, because this is an ugly situation that the NFL has, unfortunately, not handled well for fear of lawsuits from former players and their families:\n[Dr. Omalu] wrote a paper detailing his findings. He titled it “Chronic Traumatic Encephalopathy in a National Football League Player” and put it in an envelope and sent it to the prestigious peer-reviewed journal Neurosurgery. He thought NFL doctors would be pleased when they read it. He really did. He thought they would welcome a finding as important as this: scientific evidence that the kind of repeated blows to the head sustained in football could cause severe, debilitating brain damage. He thought they could use his research to try and fix the problem.\n“I was naive,” he says now. “There are times I wish I never looked at Mike Webster’s brain. It has dragged me into worldly affairs I do not want to be associated with. Human meanness, wickedness, and selfishness. People trying to cover up, to control how information is released. I started this not knowing I was walking into a minefield. That is my only regret.”\nNothing was welcoming, nothing was collegial, about the NFL’s reaction to Omalu’s article that appeared in the July 2005 edition of Neurosurgery. In a lengthy letter to the editor, three scientists, all of whom were on the NFL payroll, said they wanted Omalu’s article retracted.\n“We disagree,” they said.\n“Serious flaws.”\n“Complete misunderstanding.”\nThe scientists, Ira Casson, Elliot Pellman, and David Viano, were all members of the NFL’s Mild Traumatic Brain Injury committee. In tone their letter to the editor struggled to remain calm, but everyone could read the subtext: We own this field. We are not going to bow to some no-name Nigerian with some bullshit theory.\nThere’s a few lessons that can be drawn from this article.  First, it proves that the next time anyone tries to snow you with talk of scientific purity, they’re nothing more than lying science propagandists.  Scientists are bought as easily as anyone and far more often than most.  Second, it’s apparent that for all it is pretending Dr. Omalu doesn’t exist and his theory is “flawed”, the NFL knows he’s probably correct and are attempting to do as much as they can to solve the problem without being sued into oblivion by every ex-player who ever knocked a helmet against another player’s helmet.  Third, it completely destroys Sam Harris’s ludicrous and entirely unscientific theory about how those who engage in what he calls “magical thinking”, (in other words, all religious individuals), are somehow rendered incapable of properly performing science.\nAnd fourth, it should help those of us who are fans of the league to understand why the league is encouraging the refs to throw flags on what look like normal helmet-to-helmet action.  I’m as opposed to turning the league into two-hand-touch on the quarterback as anyone, and there’s nothing better than seeing a DB lay the smack down on some diva WR, but I really don’t want to see any more players ending up like John Mackey either.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-26T15:30:00+00:00"
}