{
  "url": "https://voxday.net/2009/09/05/obama-voters-vs-wnd/",
  "scraped_at": "2026-01-08T23:05:53.229778",
  "title": "Obama voters vs WND",
  "date_display": "September 5, 2009",
  "date_iso": "2009-09-05T14:30:00+00:00",
  "date_from_url": "2009-09-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Megan Mcardle, <i>who voted for Obama</i>, <a href=\"http://meganmcardle.theatlantic.com/archives/2009/09/leaving_the_lunatics_behind.php\">likes the idea</a> of boycotting the largest independent right-wing news site:</p><blockquote><p>This strikes me as a very good idea.  If the right ever wants to get back in power, it needs to start policing its lunatic fringe.</p></blockquote><p>You’d think a woman who calls herself an “econoblogger” would be capable of doing basic math.  I have no idea why anyone pays her any attention whatsoever, considering how reliably clueless she is about politics and economics alike.  Her analysis is on the level of those who believe that the Republican Party must abandon social conservatives  order to seek the support of one-fourth that many social moderates.  Rockefeller Republicanism isn’t a viable political strategy, it’s little more than evidence of historical ignorance and innumeracy.  It’s precisely the same incompetent strategery that advises embracing John McCain and rejecting Sarah Palin.  And it’s the same sort of ideological “policing” that saw the Republican Party reject the only presidential candidate who foresaw the financial crisis and the failure of the occupation in Afghanistan, Ron Paul.</p><p>Commenters there have already pointed out the obvious: there is zero evidence that an ideological “lunatic fringe” harms the mass appeal of any political movement.  And there is actually a fair amount of evidence to suggest that a hard-core ideological element tends to help the core cause by making the base look like a more reasonable and moderate compromise.  As William F. Buckley learned to his obvious chagrin, ban the Birchers and the next thing that happens is you’re the one labled a crypto-Nazi.</p><p>As for the boycott, does anyone seriously believe that seeing some Obama voters and Republican squishes pointing fingers at WND in an attempt to curry favor with the moderate Left is going to harm it in the slightest?  Considering how unpopular the present Republican leadership is <i>with the Republican Party base</i> already, it’s more likely to underline the independence of WND and assist its continued ascendance on the Right.</p></div>",
  "content_text": "Megan Mcardle,\nwho voted for Obama\n,\nlikes the idea\nof boycotting the largest independent right-wing news site:\nThis strikes me as a very good idea.  If the right ever wants to get back in power, it needs to start policing its lunatic fringe.\nYou’d think a woman who calls herself an “econoblogger” would be capable of doing basic math.  I have no idea why anyone pays her any attention whatsoever, considering how reliably clueless she is about politics and economics alike.  Her analysis is on the level of those who believe that the Republican Party must abandon social conservatives  order to seek the support of one-fourth that many social moderates.  Rockefeller Republicanism isn’t a viable political strategy, it’s little more than evidence of historical ignorance and innumeracy.  It’s precisely the same incompetent strategery that advises embracing John McCain and rejecting Sarah Palin.  And it’s the same sort of ideological “policing” that saw the Republican Party reject the only presidential candidate who foresaw the financial crisis and the failure of the occupation in Afghanistan, Ron Paul.\nCommenters there have already pointed out the obvious: there is zero evidence that an ideological “lunatic fringe” harms the mass appeal of any political movement.  And there is actually a fair amount of evidence to suggest that a hard-core ideological element tends to help the core cause by making the base look like a more reasonable and moderate compromise.  As William F. Buckley learned to his obvious chagrin, ban the Birchers and the next thing that happens is you’re the one labled a crypto-Nazi.\nAs for the boycott, does anyone seriously believe that seeing some Obama voters and Republican squishes pointing fingers at WND in an attempt to curry favor with the moderate Left is going to harm it in the slightest?  Considering how unpopular the present Republican leadership is\nwith the Republican Party base\nalready, it’s more likely to underline the independence of WND and assist its continued ascendance on the Right.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-05T13:30:00+00:00"
}