{
  "url": "https://voxday.net/2009/09/18/propped-up-on-credi/",
  "scraped_at": "2026-01-08T23:07:00.365159",
  "title": "Propped up on credit",
  "date_display": "September 18, 2009",
  "date_iso": "2009-09-18T14:15:00+00:00",
  "date_from_url": "2009-09-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A number of European economies are nearly as <a href=\"http://business.timesonline.co.uk/tol/business/economics/article6839660.ece\">awash in debt</a> as the USA, and in some cases such as Estonia, Ireland, and Spain, their asset bubbles were much worse:</p><blockquote><p>The dire state of Britain’s public finances were laid bare today as the Government unveiled new figures that showed public sector net borrowing swelled by a record £16.1 billion in August. It was the largest increase in the amount of new debt held by the UK Government since records began. With the recession continuing to eat into government tax receipts, the Office for National Statistics said that public sector net borrowing hit £16.1 billion, up from £9.8 billion a year ago.</p></blockquote><p>I can’t stress this enough.  There is no recovery.  As Bob Prechter’s observation suggests, most observers are looking at the entire picture at too small a scale.  There is a growing amount of evidence to suggest that he is correct and that we are not looking at two – and potentially three if the W-shapers such as Roubini are correct – distinct recessions since 2000, but rather the development of one very large depression.</p><p>Don’t forget that GDP is simply a metric, it is not the economy.  The economic theory behind it is focused on unemployment, not some abstract and subjective statistic.  And unemployment has been consistently rising around the world regardless of what the credit-inflated numbers report.  The governments <a href=\"http://bloomberg.com/apps/news?pid=20601102&amp;sid=aqeTAJ5shNg0\">are taking increasingly massive gambles</a> in desperate attempts to stave off collapse, and I don’t need to remind the regulars here of the unreliable track record of government in anything it hopes to accomplish.</p><p><i>In what may be the biggest financial gamble in 87 years as a sovereign state, the [Irish] government will spend about 28 percent of the country’s gross domestic product for 2008 to become the owner of loans for property developments that are plunging in value….  The strategy is designed to keep alive Bank of Ireland Plc and Allied Irish Banks Plc. In April, the government said NAMA would take on about 90 billion euros of loans.</i></p><p>Meanwhile, a little closer to home, it looks like <a href=\"http://www.calculatedriskblog.com/2009/09/iowa-attorney-general-option-arms-are.html\">the next wave of mortgage meltdown is nigh</a>:</p><blockquote><p>Payment option ARMs are about to explode,” Iowa Attorney General Tom Miller said after a Thursday meeting with members of President Barack Obama’s administration to discuss ways to combat mortgage scams.</p></blockquote><p>This is the inevitable – absolutely inevitable – consequence of the $29 billion in adjustable rate mortgages that reset and magically transform from low-interest loans into high-interest ones.  Another $67 billion will reset in 2010. The amazing thing is that these Option ARMs going to blow up and drive tens of thousands of homeowners into default even though interest rates haven’t risen appreciably.</p></div>",
  "content_text": "A number of European economies are nearly as\nawash in debt\nas the USA, and in some cases such as Estonia, Ireland, and Spain, their asset bubbles were much worse:\nThe dire state of Britain’s public finances were laid bare today as the Government unveiled new figures that showed public sector net borrowing swelled by a record £16.1 billion in August. It was the largest increase in the amount of new debt held by the UK Government since records began. With the recession continuing to eat into government tax receipts, the Office for National Statistics said that public sector net borrowing hit £16.1 billion, up from £9.8 billion a year ago.\nI can’t stress this enough.  There is no recovery.  As Bob Prechter’s observation suggests, most observers are looking at the entire picture at too small a scale.  There is a growing amount of evidence to suggest that he is correct and that we are not looking at two – and potentially three if the W-shapers such as Roubini are correct – distinct recessions since 2000, but rather the development of one very large depression.\nDon’t forget that GDP is simply a metric, it is not the economy.  The economic theory behind it is focused on unemployment, not some abstract and subjective statistic.  And unemployment has been consistently rising around the world regardless of what the credit-inflated numbers report.  The governments\nare taking increasingly massive gambles\nin desperate attempts to stave off collapse, and I don’t need to remind the regulars here of the unreliable track record of government in anything it hopes to accomplish.\nIn what may be the biggest financial gamble in 87 years as a sovereign state, the [Irish] government will spend about 28 percent of the country’s gross domestic product for 2008 to become the owner of loans for property developments that are plunging in value….  The strategy is designed to keep alive Bank of Ireland Plc and Allied Irish Banks Plc. In April, the government said NAMA would take on about 90 billion euros of loans.\nMeanwhile, a little closer to home, it looks like\nthe next wave of mortgage meltdown is nigh\n:\nPayment option ARMs are about to explode,” Iowa Attorney General Tom Miller said after a Thursday meeting with members of President Barack Obama’s administration to discuss ways to combat mortgage scams.\nThis is the inevitable – absolutely inevitable – consequence of the $29 billion in adjustable rate mortgages that reset and magically transform from low-interest loans into high-interest ones.  Another $67 billion will reset in 2010. The amazing thing is that these Option ARMs going to blow up and drive tens of thousands of homeowners into default even though interest rates haven’t risen appreciably.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-18T13:15:00+00:00"
}