{
  "url": "https://voxday.net/2009/09/24/rebel-moon/",
  "scraped_at": "2026-01-08T23:07:35.891865",
  "title": "Rebel Moon!",
  "date_display": "September 24, 2009",
  "date_iso": "2009-09-24T09:01:00+00:00",
  "date_from_url": "2009-09-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It <a href=\"http://www.space.com/scienceastronomy/090923-moon-water-discovery.html\">is science</a>:</p><blockquote><p>Since man first touched the moon and brought pieces of it back to Earth, scientists have thought that the lunar surface was bone dry. But new observations from three different spacecraft have put this notion to rest with what has been called “unambiguous evidence” of water across the surface of the moon….  Finding water on the moon would be a boon to possible future lunar bases, acting as a potential source of drinking water and fuel.</p></blockquote><p>The novel had many flaws, but <a href=\"http://voxday.net/mart/Rebel%20Moon.pdf\">it’s still lightweight fun</a>.  My favorite scene is <i>Aboard Assault Shuttle LST(N)-14, 7 November 2069, 06:00 GMT</i>.  The OC and I would write a much better book were we to do it again, but nevertheless, it has its moments.</p><p>Speaking of books, I just learned that <a href=\"http://www.amazon.com/Summa-Elvetica-Casuistry-Controversy-ebook/dp/B0028RY0WW/ref=ed_oe_k\">Summa Elvetica is now available on Kindle</a>, in case you’ve got one.  My fiction writing would appear to have improved a bit in the twelve years that separate the two novels, as the latest review gives SE five stars: <i>“There have been a few fantasy authors who have “role reversed” fantasy races (Orcs as protagonists, Dragons having just cause against humans) which I always enjoy, but I haven’t read an author yet who elevates the intrinsic meaning of the races in this manner. Not even close. Aside from an unfortunate naming convention, the work is unburdened, brisk and deep. But I guess if LOTR could survive the Saruman/Sauron “confusion”, Summa Elvetica will have no problem rising in standing over the years. Especially if Beale follows it up with more tales of spiritual controversy in the realm of “true” medieval fantasy. A riveting tale, well-told and driven by, and to, greatness.”</i></p><p>I’m delighted, of course, to discover that some readers regard the book so highly, and very much appreciate the time that they have taken to post reviews on Amazon.  However, I would also like to point out that the naming convention to which I think the reviewer is referring, however unfortunate, is not of my invention.  The confusing similarity between the two major characters’ names merely reflects the fact that one owns the other.  Roman slaves were often named in the possessive form of their owner, for example, Caesaris belonged to Caesar.</p></div>",
  "content_text": "It\nis science\n:\nSince man first touched the moon and brought pieces of it back to Earth, scientists have thought that the lunar surface was bone dry. But new observations from three different spacecraft have put this notion to rest with what has been called “unambiguous evidence” of water across the surface of the moon….  Finding water on the moon would be a boon to possible future lunar bases, acting as a potential source of drinking water and fuel.\nThe novel had many flaws, but\nit’s still lightweight fun\n.  My favorite scene is\nAboard Assault Shuttle LST(N)-14, 7 November 2069, 06:00 GMT\n.  The OC and I would write a much better book were we to do it again, but nevertheless, it has its moments.\nSpeaking of books, I just learned that\nSumma Elvetica is now available on Kindle\n, in case you’ve got one.  My fiction writing would appear to have improved a bit in the twelve years that separate the two novels, as the latest review gives SE five stars:\n“There have been a few fantasy authors who have “role reversed” fantasy races (Orcs as protagonists, Dragons having just cause against humans) which I always enjoy, but I haven’t read an author yet who elevates the intrinsic meaning of the races in this manner. Not even close. Aside from an unfortunate naming convention, the work is unburdened, brisk and deep. But I guess if LOTR could survive the Saruman/Sauron “confusion”, Summa Elvetica will have no problem rising in standing over the years. Especially if Beale follows it up with more tales of spiritual controversy in the realm of “true” medieval fantasy. A riveting tale, well-told and driven by, and to, greatness.”\nI’m delighted, of course, to discover that some readers regard the book so highly, and very much appreciate the time that they have taken to post reviews on Amazon.  However, I would also like to point out that the naming convention to which I think the reviewer is referring, however unfortunate, is not of my invention.  The confusing similarity between the two major characters’ names merely reflects the fact that one owns the other.  Roman slaves were often named in the possessive form of their owner, for example, Caesaris belonged to Caesar.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-24T08:01:00+00:00"
}