{
  "url": "https://voxday.net/2009/09/01/so-give-it-back/",
  "scraped_at": "2026-01-08T23:05:34.516365",
  "title": "So, give it back",
  "date_display": "September 1, 2009",
  "date_iso": "2009-09-01T10:46:00+00:00",
  "date_from_url": "2009-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If Hawaii’s pagan abos want to <a href=\"http://www.splcenter.org/intel/intelreport/article.jsp?aid=1081\">return to living in grass huts</a>, I see no reason why they shouldn’t be permitted to do so.  They have the same right of self-determination that everyone else does.  Let them reclaim their queen, their sovereignty, and their old way of life.  But then, don’t permit them to immigrate to the mainland when they belatedly realize that they miss that whole haole “technology” thing either:</p><blockquote><p> *  The last day of school has long been unofficially designated “Beat Haole Day,” with white students singled out for harassment and violence. (Haole — pronounced how-lee — is slang for a foreigner, usually white, and sometimes is used as a racial slur.)<br> * A non-Native Hawaiian student who challenged the Hawaiian-preference admission policy at a wealthy private school received a $7 million settlement this year.<br> * A 12-year-old white girl new to Hawaii from New York City needed 10 surgical staples to close a gash in her head incurred when she was beaten in 2007 by a Native Hawaiian girl who called her a “fucking haole.”<br> * A vocal segment of Native Hawaiians is pushing for independence to end the “prolonged occupation” by the United States and governance by natives.<br> * Demonstrators shouting racial epithets at whites disrupted a statehood celebration in 2006.</br></br></br></br></p></blockquote><p>Needless to say, none of these would qualify as “hate-crimes”, since they’re not directed at anyone on the official victims list.  The reality is that very few minorities actually believe in equality or diversity or multiculturalism; for the most part, they simply make use of those ideological concepts in order to obtain more government largesse.  Only those who happen to be in the sizable majority have the luxury of feigning belief in the equality myths.  It’s ironic, of course, that those who understand pagan abos don’t like seeing their lands invaded by European Christians are completely incapable of understanding that the same holds true for Scandinavian-American Lutherans being invaded by African Muslims.  I wonder if we’ll be able to convince the Hawaiians to take Obama with them when they depart the Union?  After all, he <i>was</i> born there, right?</p><p>As evidence that the equality myth was always about obtaining power, not equality, I give you <a href=\"http://www.telegraph.co.uk/comment/personal-view/6117831/Women-need-loos-and-we-need-them-now.html\">this woman’s insane demand</a> for equality through inequal distribution:</p><blockquote><p>If as many women as men use the loo in any given public place, and they take longer over the deed, we should be allocated more lavatories. In Britain, however, the rule remains that the number of appliances in women’s loos must equal those in men’s.</p></blockquote><p>Now that is the true voice of the “equality” advocate.  Meanwhile, the rational observer wonders how a property-owners decision regarding the number of restrooms could possibly be considered a legitimate concern for the national government.</p></div>",
  "content_text": "If Hawaii’s pagan abos want to\nreturn to living in grass huts\n, I see no reason why they shouldn’t be permitted to do so.  They have the same right of self-determination that everyone else does.  Let them reclaim their queen, their sovereignty, and their old way of life.  But then, don’t permit them to immigrate to the mainland when they belatedly realize that they miss that whole haole “technology” thing either:\n*  The last day of school has long been unofficially designated “Beat Haole Day,” with white students singled out for harassment and violence. (Haole — pronounced how-lee — is slang for a foreigner, usually white, and sometimes is used as a racial slur.)\n* A non-Native Hawaiian student who challenged the Hawaiian-preference admission policy at a wealthy private school received a $7 million settlement this year.\n* A 12-year-old white girl new to Hawaii from New York City needed 10 surgical staples to close a gash in her head incurred when she was beaten in 2007 by a Native Hawaiian girl who called her a “fucking haole.”\n* A vocal segment of Native Hawaiians is pushing for independence to end the “prolonged occupation” by the United States and governance by natives.\n* Demonstrators shouting racial epithets at whites disrupted a statehood celebration in 2006.\nNeedless to say, none of these would qualify as “hate-crimes”, since they’re not directed at anyone on the official victims list.  The reality is that very few minorities actually believe in equality or diversity or multiculturalism; for the most part, they simply make use of those ideological concepts in order to obtain more government largesse.  Only those who happen to be in the sizable majority have the luxury of feigning belief in the equality myths.  It’s ironic, of course, that those who understand pagan abos don’t like seeing their lands invaded by European Christians are completely incapable of understanding that the same holds true for Scandinavian-American Lutherans being invaded by African Muslims.  I wonder if we’ll be able to convince the Hawaiians to take Obama with them when they depart the Union?  After all, he\nwas\nborn there, right?\nAs evidence that the equality myth was always about obtaining power, not equality, I give you\nthis woman’s insane demand\nfor equality through inequal distribution:\nIf as many women as men use the loo in any given public place, and they take longer over the deed, we should be allocated more lavatories. In Britain, however, the rule remains that the number of appliances in women’s loos must equal those in men’s.\nNow that is the true voice of the “equality” advocate.  Meanwhile, the rational observer wonders how a property-owners decision regarding the number of restrooms could possibly be considered a legitimate concern for the national government.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-01T09:46:00+00:00"
}