{
  "url": "https://voxday.net/2009/09/02/stay-home-september-8/",
  "scraped_at": "2026-01-08T23:05:40.231709",
  "title": "Stay home September 8th",
  "date_display": "September 2, 2009",
  "date_iso": "2009-09-02T14:15:00+00:00",
  "date_from_url": "2009-09-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While it would be much better not to put them on the Yellow Bus of Doom at all, I encourage parents of public schoolchildren to refuse to subject them to <a href=\"http://www.docstoc.com/docs/10582301/President-Obama%E2%80%99s-Address-to-Students-Across-America-September-8-2009\">this melodramatic bit of Orwellian weirdness</a>:</p><blockquote><p>President Obama’s Address to Students Across America September 8, 2009 PreK-6 Menu of Classroom Activities: President Obama’s Address to Students Across America</p><p>Before the Speech:<br>• Teachers can build background knowledge about the President of the United States and his speech by reading books about presidents and Barack Obama and motivate students by asking the following questions:<br>Who is the President of the United States?<br>What do you think it takes to be President?<br>To whom do you think the President is going to be speaking?<br>Why do you think he wants to speak to you?<br>What do you think he will say to you?<br>• Teachers can ask students to imagine being the President delivering a speech to all of the students in the United States. What would you tell students? What can students do to help in our schools? Teachers can chart ideas about what they would say.<br>• Why is it important that we listen to the President and other elected officials, like the mayor, senators, members of congress, or the governor? Why is what they say important?</br></br></br></br></br></br></br></br></p><p>During the Speech:<br>• As the President speaks, teachers can ask students to write down key ideas or phrases that are important or personally meaningful. Students could use a note-taking graphic organizer such as a Cluster Web, or students could record their thoughts on sticky notes. Younger children can draw pictures and write as appropriate. As students listen to the speech, they could think about the following:<br>What is the President trying to tell me?<br>What is the President asking me to do?<br>What new ideas and actions is the President challenging me to think about?<br>• Students can record important parts of the speech where the President is asking them to do something. Students might think about: What specific job is he asking me to do? Is he asking anything of anyone else? Teachers? Principals? Parents? The American people?</br></br></br></br></br></p></blockquote><p>Obama has transformed from amusingly incompetent evil to downright creepy with this overt attempt to further build his cult of personality.  Yes, please do explain why is it important that children listen to their <s>masters</s>elected officials.  And writing down “personally meaningful” phrases?  In the immortal words of John McEnroe, “you cannot be serious!”  But, on the positive side, it would be hard to imagine a better demonstration of the infantilization of the American Left.</p></div>",
  "content_text": "While it would be much better not to put them on the Yellow Bus of Doom at all, I encourage parents of public schoolchildren to refuse to subject them to\nthis melodramatic bit of Orwellian weirdness\n:\nPresident Obama’s Address to Students Across America September 8, 2009 PreK-6 Menu of Classroom Activities: President Obama’s Address to Students Across America\nBefore the Speech:\n• Teachers can build background knowledge about the President of the United States and his speech by reading books about presidents and Barack Obama and motivate students by asking the following questions:\nWho is the President of the United States?\nWhat do you think it takes to be President?\nTo whom do you think the President is going to be speaking?\nWhy do you think he wants to speak to you?\nWhat do you think he will say to you?\n• Teachers can ask students to imagine being the President delivering a speech to all of the students in the United States. What would you tell students? What can students do to help in our schools? Teachers can chart ideas about what they would say.\n• Why is it important that we listen to the President and other elected officials, like the mayor, senators, members of congress, or the governor? Why is what they say important?\nDuring the Speech:\n• As the President speaks, teachers can ask students to write down key ideas or phrases that are important or personally meaningful. Students could use a note-taking graphic organizer such as a Cluster Web, or students could record their thoughts on sticky notes. Younger children can draw pictures and write as appropriate. As students listen to the speech, they could think about the following:\nWhat is the President trying to tell me?\nWhat is the President asking me to do?\nWhat new ideas and actions is the President challenging me to think about?\n• Students can record important parts of the speech where the President is asking them to do something. Students might think about: What specific job is he asking me to do? Is he asking anything of anyone else? Teachers? Principals? Parents? The American people?\nObama has transformed from amusingly incompetent evil to downright creepy with this overt attempt to further build his cult of personality.  Yes, please do explain why is it important that children listen to their\nmasters\nelected officials.  And writing down “personally meaningful” phrases?  In the immortal words of John McEnroe, “you cannot be serious!”  But, on the positive side, it would be hard to imagine a better demonstration of the infantilization of the American Left.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-02T13:15:00+00:00"
}