{
  "url": "https://voxday.net/2009/09/18/they-do-ruin-everything/",
  "scraped_at": "2026-01-08T23:07:02.172390",
  "title": "They do ruin everything",
  "date_display": "September 18, 2009",
  "date_iso": "2009-09-18T17:15:00+00:00",
  "date_from_url": "2009-09-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or at least, <a href=\"http://www.telegraph.co.uk/news/newstopics/politics/lawandorder/6202506/Lap-dancing-has-become-part-of-working-life.html\">they try</a>:</p><blockquote><p>86 per cent of London lap dancing clubs in London provide ‘discreet receipts’ for expenses claims, allowing fees to be reclaimed without reveal what sort of establishment the money was spent in.  Kat Banyard, the Fawcett Society researcher who wrote the report, described the sex industry as “a major threat to women’s equality at work” and said employers have failed to halt the trend.</p><p>She said: “The sex industry is increasingly targeting the corporate market, with lap dancing clubs marketing themselves as ideal venues to host meetings and client entertaining. Yet lap dancing clubs are a form of commercial sexual exploitation and fuel sexist attitudes towards women. Their use in a work context discriminates against female employees and undermines women’s status at work.</p></blockquote><p>I don’t think Ms Banyard understands that declaring women are inferior, and, like children, incapable of making their own decisions, undermines women’s status at work and everywhere else far more than the ability to write-off lap-dancing expenses.  If it’s acceptable to write off entertainment expenses, then who is Ms Banyard or anyone else to decide what is and what is not entertainment?  No doubt this is somehow tied to the whining of professional women who don’t like it that the men in the office may occasionally go out and have a good time doing something that they don’t want to do.  But they won’t be happy until the government institutes a law requiring all extra-office socializing to involve knitting or reading <i>Twilight</i> novels.</p><p>The irony, of course, is that the main reason strip clubs have become the entertainment venue of choice for professional men is that their traditional men’s-only clubs were outlawed by the same sort of women who are now pushing to make the strip clubs off-limits.  Gentlemen, the feminist demands will never end, so your best bet is to refuse to give in from the start.</p></div>",
  "content_text": "Or at least,\nthey try\n:\n86 per cent of London lap dancing clubs in London provide ‘discreet receipts’ for expenses claims, allowing fees to be reclaimed without reveal what sort of establishment the money was spent in.  Kat Banyard, the Fawcett Society researcher who wrote the report, described the sex industry as “a major threat to women’s equality at work” and said employers have failed to halt the trend.\nShe said: “The sex industry is increasingly targeting the corporate market, with lap dancing clubs marketing themselves as ideal venues to host meetings and client entertaining. Yet lap dancing clubs are a form of commercial sexual exploitation and fuel sexist attitudes towards women. Their use in a work context discriminates against female employees and undermines women’s status at work.\nI don’t think Ms Banyard understands that declaring women are inferior, and, like children, incapable of making their own decisions, undermines women’s status at work and everywhere else far more than the ability to write-off lap-dancing expenses.  If it’s acceptable to write off entertainment expenses, then who is Ms Banyard or anyone else to decide what is and what is not entertainment?  No doubt this is somehow tied to the whining of professional women who don’t like it that the men in the office may occasionally go out and have a good time doing something that they don’t want to do.  But they won’t be happy until the government institutes a law requiring all extra-office socializing to involve knitting or reading\nTwilight\nnovels.\nThe irony, of course, is that the main reason strip clubs have become the entertainment venue of choice for professional men is that their traditional men’s-only clubs were outlawed by the same sort of women who are now pushing to make the strip clubs off-limits.  Gentlemen, the feminist demands will never end, so your best bet is to refuse to give in from the start.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-18T16:15:00+00:00"
}