{
  "url": "https://voxday.net/2009/09/07/time-will-te/",
  "scraped_at": "2026-01-08T23:06:00.688568",
  "title": "Time will tell",
  "date_display": "September 7, 2009",
  "date_iso": "2009-09-07T14:15:00+00:00",
  "date_from_url": "2009-09-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bernanke and company don’t have the gold standard to blame <a href=\"http://www.telegraph.co.uk/finance/economics/6147211/Barack-Obama-accused-of-making-Depression-mistakes.html\">this time around</a>:</p><blockquote><p>There are “troubling similarities” between the US President’s actions since taking office and those which in the 1930s sent the US and much of the world spiralling into the worst economic collapse in recorded history, says the new pamphlet, published by the Institute of Economic Affairs.  In particular, the authors, economists Charles Rowley of George Mason University and Nathanael Smith of the Locke Institute, claim that the White House’s plans to pour hundreds of billions of dollars of cash into the economy will undermine it in the long run….</p><p>The study represents a challenge to the widely held view that Keynesian fiscal policies helped the US recover from the Depression which started in the early 1930s.</p></blockquote><p>The most important thing to keep in mind is that according to those widely held views, neither the financial crisis nor a continued depression next year is even supposed to be <i>possible</i>.  If, as they insist, the gold standard was responsible, then how are such similar results even theoretically possible in its absence?</p><p>Obama and the Congress are making things worse, of course, but they can’t possibly be blamed for next year’s economic downturn.  That’s been in the cards for years, if not decades.  My primary concern isn’t the extended downturn itself, but rather the state’s customary resort to war as a distraction for an angry populace.  For those interested, the IEA paper, “Economic Contractions in the United States:<br>A Failure of Government”, is available for download <a href=\"http://www.iea.org.uk/files/upld-release166pdf?.pdf\">in PDF format</a>.</br></p></div>",
  "content_text": "Bernanke and company don’t have the gold standard to blame\nthis time around\n:\nThere are “troubling similarities” between the US President’s actions since taking office and those which in the 1930s sent the US and much of the world spiralling into the worst economic collapse in recorded history, says the new pamphlet, published by the Institute of Economic Affairs.  In particular, the authors, economists Charles Rowley of George Mason University and Nathanael Smith of the Locke Institute, claim that the White House’s plans to pour hundreds of billions of dollars of cash into the economy will undermine it in the long run….\nThe study represents a challenge to the widely held view that Keynesian fiscal policies helped the US recover from the Depression which started in the early 1930s.\nThe most important thing to keep in mind is that according to those widely held views, neither the financial crisis nor a continued depression next year is even supposed to be\npossible\n.  If, as they insist, the gold standard was responsible, then how are such similar results even theoretically possible in its absence?\nObama and the Congress are making things worse, of course, but they can’t possibly be blamed for next year’s economic downturn.  That’s been in the cards for years, if not decades.  My primary concern isn’t the extended downturn itself, but rather the state’s customary resort to war as a distraction for an angry populace.  For those interested, the IEA paper, “Economic Contractions in the United States:\nA Failure of Government”, is available for download\nin PDF format\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-07T13:15:00+00:00"
}