{
  "url": "https://voxday.net/2009/09/03/two-bad-wars/",
  "scraped_at": "2026-01-08T23:05:43.985550",
  "title": "Two bad wars",
  "date_display": "September 3, 2009",
  "date_iso": "2009-09-03T08:40:00+00:00",
  "date_from_url": "2009-09-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The neoconservative Republicans have been trying to push both the Afghani and Iraqi occupations as necessary “good” wars in the national interest.  The supposedly antiwar Democrats, on the other hand, tried to distinguish between the “good war” in Afghanistan and the “bad war” in Iraq.  The Democrats had it half right; neither war was necessary although taking out the Taliban was justified by virtue of their public declarations of war on the United States.  But, there was never any justification for the so-called national building that excused eight and six years of military occupation.</p><p>Now that <a href=\"http://www.washingtonpost.com/wp-dyn/content/article/2009/08/31/AR2009083102912.html\">George Will has voiced Republican doubts</a> about the ongoing wisdom of attempting to maintain a post-war peace in Afghanistan that is bloodier than the actual war, the usual suspects are out in full throat attempting to decry his belated recognition that continued occupation of foreign countries is detrimental to American interests.  Here is <a href=\"http://corner.nationalreview.com/post/?q=MmE0MTEzODI4ZmQ1MDhhMjYyODY3YjM3MTc1YjcxYzk=\">one particularly egregious example</a> quoted on NRO:</p><blockquote><p>Here is a disturbing fact to ponder: If George Will were commander in chief, we would, under his leadership, have begun and lost two wars of enormous consequence. The damage to America — militarily, geopolitically, and morally — would be staggering. The boon to militant Islam — militarily, geopolitically, and in terms of morale — would be incalculable. Yet nowhere in his most recent column does Will even begin to grapple with what surrender in Afghanistan would mean — to that country, to Pakistan, to jihadists around the world, to confidence in America’s word and will, and to our national-security interests. And while Afghanistan, like Iraq, is a very difficult undertaking, declaring defeat at this stage is unwarranted and terribly unwise. If General David Petraeus thinks the task is hopeless, then I will take a hard second look at the war. But if George Will declares it hopeless, I will simply take a hard second look at his record.</p><p>Mr. Will has earned the reputation as one of the finest columnists alive, and one of the better ones our country has ever produced. I have admired him in the past, and I learn from him still. But on Iraq and Afghanistan, he has been wrong, unreliable, and unsteady….  Now, like then, America needs spirited realists, not defeatists. We need individuals who believe a nation must be willing to fight for what is right even when it is hard. We need people who are going to resist the temptation to eagerly support war at the outset and then prematurely give up on it.  What we need, in other words, is what George Frederick Will once was.</p></blockquote><p>This is blather, sheer <i>ad hominem</i> blather.  The staggering damage to America and the incalculable boon to militant Islam was made the moment that it was decided to stay in Afghanistan and Iraq rather than smash the offending regimes and return home.  Historically and militarily ignorant individuals like Mr. Wehner and Mr. Kristol fail to recognize that Osama bin Laden’s entire strategy was baiting the West into the sort of war that it could not win.  The British Empire couldn’t win this type of war, the Soviet Union couldn’t win it, and the United States will not win it either.</p><p>To argue the necessity of a bankrupt republic’s military occupation of two foreign nations is irresponsible in the extreme.  The fact that George Will is late in recognizing the realistic limits of military power does not mean that these limits do not exist.  And no general is ever going to kill his career by announcing that the situation is hopeless, especially when he has complete air supremacy, sea supremacy, and a numerical advantage.</p><p>Bill Kristol’s <a href=\"http://voices.washingtonpost.com/postpartisan/2009/09/no_will_no_way.html\">newfound love for argument about national security</a> is more than a little ironic, considering that neither he nor the rest of the neoconservatives slavering for war with Iran, Pakistan, and Russia as well as Afghanistan and Iraq have ever bothered to engage in anything approaching a rational argument about it in the past.  Back when the general perception was that things were going well, Kristol preferred action to talking about the obvious long-term strategic problems.  Now that things are going poorly and those strategic problems are becoming obvious to everyone, Kristol suddenly wants to talk rather than act.</p><p>America and its allies are going to end their occupations and withdraw, sooner or later.  If the dwindling number of those who support the ongoing wars think that the ramifications of such a withdrawal are negative if America chooses to withdraw now, they should consider how negative they will be if America is <i>forced</i> to withdraw instead.  The longer that American troops are forced to continue their pointless occupations, the more likely it is that their retreat will be a forced one.  An immediate end to the occupations is definitely in the national interest of the American people.</p></div>",
  "content_text": "The neoconservative Republicans have been trying to push both the Afghani and Iraqi occupations as necessary “good” wars in the national interest.  The supposedly antiwar Democrats, on the other hand, tried to distinguish between the “good war” in Afghanistan and the “bad war” in Iraq.  The Democrats had it half right; neither war was necessary although taking out the Taliban was justified by virtue of their public declarations of war on the United States.  But, there was never any justification for the so-called national building that excused eight and six years of military occupation.\nNow that\nGeorge Will has voiced Republican doubts\nabout the ongoing wisdom of attempting to maintain a post-war peace in Afghanistan that is bloodier than the actual war, the usual suspects are out in full throat attempting to decry his belated recognition that continued occupation of foreign countries is detrimental to American interests.  Here is\none particularly egregious example\nquoted on NRO:\nHere is a disturbing fact to ponder: If George Will were commander in chief, we would, under his leadership, have begun and lost two wars of enormous consequence. The damage to America — militarily, geopolitically, and morally — would be staggering. The boon to militant Islam — militarily, geopolitically, and in terms of morale — would be incalculable. Yet nowhere in his most recent column does Will even begin to grapple with what surrender in Afghanistan would mean — to that country, to Pakistan, to jihadists around the world, to confidence in America’s word and will, and to our national-security interests. And while Afghanistan, like Iraq, is a very difficult undertaking, declaring defeat at this stage is unwarranted and terribly unwise. If General David Petraeus thinks the task is hopeless, then I will take a hard second look at the war. But if George Will declares it hopeless, I will simply take a hard second look at his record.\nMr. Will has earned the reputation as one of the finest columnists alive, and one of the better ones our country has ever produced. I have admired him in the past, and I learn from him still. But on Iraq and Afghanistan, he has been wrong, unreliable, and unsteady….  Now, like then, America needs spirited realists, not defeatists. We need individuals who believe a nation must be willing to fight for what is right even when it is hard. We need people who are going to resist the temptation to eagerly support war at the outset and then prematurely give up on it.  What we need, in other words, is what George Frederick Will once was.\nThis is blather, sheer\nad hominem\nblather.  The staggering damage to America and the incalculable boon to militant Islam was made the moment that it was decided to stay in Afghanistan and Iraq rather than smash the offending regimes and return home.  Historically and militarily ignorant individuals like Mr. Wehner and Mr. Kristol fail to recognize that Osama bin Laden’s entire strategy was baiting the West into the sort of war that it could not win.  The British Empire couldn’t win this type of war, the Soviet Union couldn’t win it, and the United States will not win it either.\nTo argue the necessity of a bankrupt republic’s military occupation of two foreign nations is irresponsible in the extreme.  The fact that George Will is late in recognizing the realistic limits of military power does not mean that these limits do not exist.  And no general is ever going to kill his career by announcing that the situation is hopeless, especially when he has complete air supremacy, sea supremacy, and a numerical advantage.\nBill Kristol’s\nnewfound love for argument about national security\nis more than a little ironic, considering that neither he nor the rest of the neoconservatives slavering for war with Iran, Pakistan, and Russia as well as Afghanistan and Iraq have ever bothered to engage in anything approaching a rational argument about it in the past.  Back when the general perception was that things were going well, Kristol preferred action to talking about the obvious long-term strategic problems.  Now that things are going poorly and those strategic problems are becoming obvious to everyone, Kristol suddenly wants to talk rather than act.\nAmerica and its allies are going to end their occupations and withdraw, sooner or later.  If the dwindling number of those who support the ongoing wars think that the ramifications of such a withdrawal are negative if America chooses to withdraw now, they should consider how negative they will be if America is\nforced\nto withdraw instead.  The longer that American troops are forced to continue their pointless occupations, the more likely it is that their retreat will be a forced one.  An immediate end to the occupations is definitely in the national interest of the American people.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-03T07:40:00+00:00"
}