{
  "url": "https://voxday.net/2009/09/12/united-self-destruction/",
  "scraped_at": "2026-01-08T23:06:26.566294",
  "title": "United self-destruction",
  "date_display": "September 12, 2009",
  "date_iso": "2009-09-12T18:30:00+00:00",
  "date_from_url": "2009-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://globaleconomicanalysis.blogspot.com/2009/09/bakery-union-win-battle-loses-war.html\">This union implosion</a> would be downright amusing if it weren’t for the cost to the short-sighted workers’ families:</p><blockquote><p>Workers at the Stella D’oro cookie factory in the Bronx were still in shock Thursday as the news sunk in that the business had been sold and was moving to Ohio…. The strike ended in July when a National Labor Relations Board judge ruled Brynwood had negotiated in bad faith with Local 50 and ordered it to pay lost wages and benefits.  Brynwood then said it would have to sell the firm.</p></blockquote><p>I realize it is hard for children and liberals to understand this, but jobs don’t come from the magic job-creation fairy.  Or the government, for that matter.  Yes, many businessmen, especially the mercenary executive class, are scum, but not even scum can stay in business when they don’t make a profit.</p><p>As a general rule, a business that threatens shutting down or moving in the middle of a depression is probably not bluffing.  Especially one located in a high-cost, high-tax area.  And speaking of self-destruction, <a href=\"http://dailyreckoning.com/evicted-from-your-brand-new-clunker/\">this news</a> doesn’t come as a massive surprise:</p><blockquote><p>One out of four auto buyers using this program [Cash for Clunkers] is having buyer’s remorse as they just signed-up for so many new payments they cannot afford.”</p></blockquote><p>Here’s something to consider.  If the average car loan is around $25k and 690,114 new car loans were made via the C4C program, <i>that $17.3 billion is equal to two percent of total consumer loans.</i> Since consumer loans dropped $20 billion from March through June, it will be interesting to see if this gigantic one-time credit injection shows up in the statistics.</p></div>",
  "content_text": "This union implosion\nwould be downright amusing if it weren’t for the cost to the short-sighted workers’ families:\nWorkers at the Stella D’oro cookie factory in the Bronx were still in shock Thursday as the news sunk in that the business had been sold and was moving to Ohio…. The strike ended in July when a National Labor Relations Board judge ruled Brynwood had negotiated in bad faith with Local 50 and ordered it to pay lost wages and benefits.  Brynwood then said it would have to sell the firm.\nI realize it is hard for children and liberals to understand this, but jobs don’t come from the magic job-creation fairy.  Or the government, for that matter.  Yes, many businessmen, especially the mercenary executive class, are scum, but not even scum can stay in business when they don’t make a profit.\nAs a general rule, a business that threatens shutting down or moving in the middle of a depression is probably not bluffing.  Especially one located in a high-cost, high-tax area.  And speaking of self-destruction,\nthis news\ndoesn’t come as a massive surprise:\nOne out of four auto buyers using this program [Cash for Clunkers] is having buyer’s remorse as they just signed-up for so many new payments they cannot afford.”\nHere’s something to consider.  If the average car loan is around $25k and 690,114 new car loans were made via the C4C program,\nthat $17.3 billion is equal to two percent of total consumer loans.\nSince consumer loans dropped $20 billion from March through June, it will be interesting to see if this gigantic one-time credit injection shows up in the statistics.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-12T17:30:00+00:00"
}