{
  "url": "https://voxday.net/2009/09/19/what-he-said-2/",
  "scraped_at": "2026-01-08T23:07:07.757768",
  "title": "What he said",
  "date_display": "September 19, 2009",
  "date_iso": "2009-09-19T14:30:00+00:00",
  "date_from_url": "2009-09-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Scalzi attempts to explain, again, <a href=\"http://whatever.scalzi.com/2009/09/15/on-the-asking-of-favors-from-established-writers/\">why established writers are seldom interested</a> in reading the work of those hoping to break through the publishing barrier:</p><blockquote><p>Dear currently unpublished/newbie writers who spend their time bitching about how published/established writers are mean because they won’t read your work/introduce you to their agent/give your manuscript to their editor/get you a job on their television show/whatever other thing it is you want them to do for you:</p><p>A few things you should know….</p></blockquote><p>It’s ironic that Scalzi has to point this out so often, considering that he does more for beginning writers with his Big Idea posts than any writer not named The Original Cyberpunk.  My reasons for not reading unpublished fiction are a little different, however.  First, I simply don’t have the time.  I don’t even read much good published fiction these days; I prefer to spend my reading time on history and economics.  For example, yesterday afternoon I was reading Bernanke’s <i>The Great Depression</i>, about which more will be said anon, and finished with Demosthenes’s <i>Orations</i> as the nightcap.  I’m not saying I don’t plow through my share of mind candy, having just read Conn Iggledon’s four <i>Emperor</i> books last week, but unless a novel is particularly good or original, I find that I’m less interested than I used to be.</p><p>Second, after two spells on the Nebula novel jury, a year participating in the Critters Workshop, and six months working as the de facto gatekeeper for a fantasy publisher, I never, ever, want to read any new writer’s unpublished fiction ever again.  Still less do I feel like arguing with a writer over why my opinion of his writing, which he sought out in the first place, is wrong.  If you think much of the fiction that is published today is pretty awful, you’re correct.  It is nevertheless markedly superior to the stuff that is being rejected.  I don’t care if you think your first scribblings are brilliant or not, the probabilities dictate otherwise and I’m quite willing to swap the chance to be the first to recognize an unpublished masterpiece for the privilege of not having to read three dozen attempted crimes against the reading public.</p><p>There are some talented writers out there who are just beginning their literary careers.  I occasionally read them over at <a href=\"http://www.thefridaychallenge.com/\">the Friday Challenge</a> and wouldn’t mind publishing two or three of them someday if I ever find myself in a position to do so.  If you want advice and constructive criticism, I strongly recommend participating in the activities there.  However, since I don’t use an agent and at least half the publishers in the States and UK would rather chew off their fingers than sign a publishing contract with my name on it, you’d probably be much better off not doing things my way anyhow.</p><p>Now, I have certainly had the benefit of help from established writers such as Bruce Bethke, Joel Rosenberg, Lois Bujold, and Pat Wrede.  But keep this in mind.  At the time the OC was kind enough to look over my work and tell me to throw away my second novel attempt – which a few of you may be interested to know was set in the world of <i>Summa Elvetica</i>, albeit a version sans religion – I was already a nationally syndicated columnist.  The lesson is: if you have the talent or the ambition, or preferably, both, and you are willing to be persistent, you’ll eventually find a way.</p></div>",
  "content_text": "John Scalzi attempts to explain, again,\nwhy established writers are seldom interested\nin reading the work of those hoping to break through the publishing barrier:\nDear currently unpublished/newbie writers who spend their time bitching about how published/established writers are mean because they won’t read your work/introduce you to their agent/give your manuscript to their editor/get you a job on their television show/whatever other thing it is you want them to do for you:\nA few things you should know….\nIt’s ironic that Scalzi has to point this out so often, considering that he does more for beginning writers with his Big Idea posts than any writer not named The Original Cyberpunk.  My reasons for not reading unpublished fiction are a little different, however.  First, I simply don’t have the time.  I don’t even read much good published fiction these days; I prefer to spend my reading time on history and economics.  For example, yesterday afternoon I was reading Bernanke’s\nThe Great Depression\n, about which more will be said anon, and finished with Demosthenes’s\nOrations\nas the nightcap.  I’m not saying I don’t plow through my share of mind candy, having just read Conn Iggledon’s four\nEmperor\nbooks last week, but unless a novel is particularly good or original, I find that I’m less interested than I used to be.\nSecond, after two spells on the Nebula novel jury, a year participating in the Critters Workshop, and six months working as the de facto gatekeeper for a fantasy publisher, I never, ever, want to read any new writer’s unpublished fiction ever again.  Still less do I feel like arguing with a writer over why my opinion of his writing, which he sought out in the first place, is wrong.  If you think much of the fiction that is published today is pretty awful, you’re correct.  It is nevertheless markedly superior to the stuff that is being rejected.  I don’t care if you think your first scribblings are brilliant or not, the probabilities dictate otherwise and I’m quite willing to swap the chance to be the first to recognize an unpublished masterpiece for the privilege of not having to read three dozen attempted crimes against the reading public.\nThere are some talented writers out there who are just beginning their literary careers.  I occasionally read them over at\nthe Friday Challenge\nand wouldn’t mind publishing two or three of them someday if I ever find myself in a position to do so.  If you want advice and constructive criticism, I strongly recommend participating in the activities there.  However, since I don’t use an agent and at least half the publishers in the States and UK would rather chew off their fingers than sign a publishing contract with my name on it, you’d probably be much better off not doing things my way anyhow.\nNow, I have certainly had the benefit of help from established writers such as Bruce Bethke, Joel Rosenberg, Lois Bujold, and Pat Wrede.  But keep this in mind.  At the time the OC was kind enough to look over my work and tell me to throw away my second novel attempt – which a few of you may be interested to know was set in the world of\nSumma Elvetica\n, albeit a version sans religion – I was already a nationally syndicated columnist.  The lesson is: if you have the talent or the ambition, or preferably, both, and you are willing to be persistent, you’ll eventually find a way.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-19T13:30:00+00:00"
}