{
  "url": "https://voxday.net/2009/09/28/what-kind-of-war-president-is-this/",
  "scraped_at": "2026-01-08T23:07:57.818551",
  "title": "This is a joke, right?",
  "date_display": "September 28, 2009",
  "date_iso": "2009-09-28T18:41:00+00:00",
  "date_from_url": "2009-09-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This disinterest in communication not only smacks of reprehensible irresponsibility on the part of the present inhabitant of the White House, <a href=\"http://www.washingtontimes.com/weblogs/back-story/2009/sep/28/us-commander-of-afghanistan-only-talked-to-obama-o/\">but outrageous farce</a>:</p><blockquote><p>“I’ve talked to the president, since I’ve been here, once on a VTC ,” Gen. Stanley McChrystal told CBS reporter David Martin in a television interview that aired Sunday.</p><p>“You’ve talked to him once in 70 days?” Mr. Martin followed up.</p><p>“That is correct,” the general replied.</p></blockquote><p>I’ve been an advocate of bringing the troops home from the occupied countries since 2004, but even if I hadn’t been, they must be brought home immediately now.  If the titular Commander-in-Chief can’t be bothered to even <i>talk to the freaking commanding general</i>, this farcical pretense of playing at war must immediately stop.  American soldiers deserve far better than to be shipped off to play mercenary globocop / political pawn while their so-called commander ignores them.  Every military family with men stationed in the theater should be furious about this incredible abdication of responsibility.</p><p>There was never any serious doubt that the war in Afghanistan would ultimately fail, but this is downright insane.  It also appears to conclusively settle the question about Obama’s fitness for office.  And if you know anything about military etiquette, you’ll recognize that Gen. McChrystal is flashing a subtle, but perfectly clear signal regarding his opinion of his civilian superior here.</p></div>",
  "content_text": "This disinterest in communication not only smacks of reprehensible irresponsibility on the part of the present inhabitant of the White House,\nbut outrageous farce\n:\n“I’ve talked to the president, since I’ve been here, once on a VTC ,” Gen. Stanley McChrystal told CBS reporter David Martin in a television interview that aired Sunday.\n“You’ve talked to him once in 70 days?” Mr. Martin followed up.\n“That is correct,” the general replied.\nI’ve been an advocate of bringing the troops home from the occupied countries since 2004, but even if I hadn’t been, they must be brought home immediately now.  If the titular Commander-in-Chief can’t be bothered to even\ntalk to the freaking commanding general\n, this farcical pretense of playing at war must immediately stop.  American soldiers deserve far better than to be shipped off to play mercenary globocop / political pawn while their so-called commander ignores them.  Every military family with men stationed in the theater should be furious about this incredible abdication of responsibility.\nThere was never any serious doubt that the war in Afghanistan would ultimately fail, but this is downright insane.  It also appears to conclusively settle the question about Obama’s fitness for office.  And if you know anything about military etiquette, you’ll recognize that Gen. McChrystal is flashing a subtle, but perfectly clear signal regarding his opinion of his civilian superior here.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-28T17:41:00+00:00"
}