{
  "url": "https://voxday.net/2009/09/28/wnd-column_28-7/",
  "scraped_at": "2026-01-08T23:07:54.153285",
  "title": "WND column",
  "date_display": "September 28, 2009",
  "date_iso": "2009-09-28T07:30:00+00:00",
  "date_from_url": "2009-09-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=111232\">Evolution, Economics, and Evil</a></b></p><p><i>The Mind of the Market: Compassionate Apes, Competitive Humans, and Other Tales from Evolutionary Economics</i><br> Michael Shermer<br> Rating: 7 of 10</br></br></p><p>It is no secret that I hold a rather low opinion of various books produced by a few well-known atheists. Without exception, they are riddled with factual ignorance, easily demonstrable illogic and fraudulent appeals to science. While Michael Shermer is every bit the atheist that Sam Harris or Richard Dawkins are, his scientific expertise happens to be applicable to his subject matter and his approach is entirely different. And unlike the New Atheists, Shermer makes intelligent use of both science and logic in utilizing various aspects of evolutionary theory to consider <i>homo economicus</i>.</p><p>By the way, something that I didn’t manage to work into the column was Shermer’s articulation of “Darwin’s Dictum”, which he developed from a letter Darwin wrote to Henry Fawcett.</p><p><b>“About thirty years ago there was much talk that geologists ought only to observe and not theorize, and I well remember someone saying that at this rate a man might as well go into a gravel-pit and count the pebbles and describe the colours. How odd it is that anyone should not see that all observation must be for or against some view if it is to be of any service!</b>“</p><p>Shermer writes: <i>“This quote was the centerpiece of the first of my monthly columns for Scientific American, in which I elevated it to a principle I call “Darwin’s Dictum,” as identified in the final clause: all observation must be for or against some view if it is to be of any service. Darwin’s Dictum encodes the philosophy of science of this book: if observations are to be of any use they must be tested against some view—a thesis, model, hypothesis, theory, or paradigm. Since the facts never just speak for themselves, they must be interpreted through the colored lenses of ideas—percepts need concepts. Science is an exquisite blend of data and theory—percepts and concepts—that together form the bedrock for the foundation of science, the greatest tool ever devised for understanding how the world works. We can no more separate our theories and concepts from our data and percepts than we can find a truly objective Archimedean point—a god’s eye view—of ourselves and our world.</i></p><p>I found this to be an intriguing perspective, especially in light of the vociferous claims of science’s pure objectivity made so often by those who fetishize it.  It tends to raise two questions, of course.  In service to what, or to whom?  And by what standard are competing interpretations of the same facts to be judged?</p></div>",
  "content_text": "Evolution, Economics, and Evil\nThe Mind of the Market: Compassionate Apes, Competitive Humans, and Other Tales from Evolutionary Economics\nMichael Shermer\nRating: 7 of 10\nIt is no secret that I hold a rather low opinion of various books produced by a few well-known atheists. Without exception, they are riddled with factual ignorance, easily demonstrable illogic and fraudulent appeals to science. While Michael Shermer is every bit the atheist that Sam Harris or Richard Dawkins are, his scientific expertise happens to be applicable to his subject matter and his approach is entirely different. And unlike the New Atheists, Shermer makes intelligent use of both science and logic in utilizing various aspects of evolutionary theory to consider\nhomo economicus\n.\nBy the way, something that I didn’t manage to work into the column was Shermer’s articulation of “Darwin’s Dictum”, which he developed from a letter Darwin wrote to Henry Fawcett.\n“About thirty years ago there was much talk that geologists ought only to observe and not theorize, and I well remember someone saying that at this rate a man might as well go into a gravel-pit and count the pebbles and describe the colours. How odd it is that anyone should not see that all observation must be for or against some view if it is to be of any service!\n“\nShermer writes:\n“This quote was the centerpiece of the first of my monthly columns for Scientific American, in which I elevated it to a principle I call “Darwin’s Dictum,” as identified in the final clause: all observation must be for or against some view if it is to be of any service. Darwin’s Dictum encodes the philosophy of science of this book: if observations are to be of any use they must be tested against some view—a thesis, model, hypothesis, theory, or paradigm. Since the facts never just speak for themselves, they must be interpreted through the colored lenses of ideas—percepts need concepts. Science is an exquisite blend of data and theory—percepts and concepts—that together form the bedrock for the foundation of science, the greatest tool ever devised for understanding how the world works. We can no more separate our theories and concepts from our data and percepts than we can find a truly objective Archimedean point—a god’s eye view—of ourselves and our world.\nI found this to be an intriguing perspective, especially in light of the vociferous claims of science’s pure objectivity made so often by those who fetishize it.  It tends to raise two questions, of course.  In service to what, or to whom?  And by what standard are competing interpretations of the same facts to be judged?",
  "tags": [
    "books",
    "column"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-09-28T06:30:00+00:00"
}