{
  "url": "https://voxday.net/2009/09/20/yep-theyre-ou/",
  "scraped_at": "2026-01-08T23:07:11.468485",
  "title": "Yep, they’re out",
  "date_display": "September 20, 2009",
  "date_iso": "2009-09-20T12:49:00+00:00",
  "date_from_url": "2009-09-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>According to my calculations, following the failure of the 93rd and 94th banks this year, the DIF is in the red somewhere between -3.6 billion and -13.3 billion, depending upon the difference between FDIC-estimated losses and actual losses.  That multiple was 1.95 in 2008 and Q1 2009, but thanks to the special assessment in the second quarter, it fell to 1.69 in the last report.  There will be another assessment in the third quarter, but regardless, it’s clear that if the DIF hasn’t run out yet, <a href=\"http://online.wsj.com/article/SB125328162000123101.html#mod=WSJ_hps_LEFTWhatsNews\">it’s going to</a> before the end of the year.</p><blockquote><p>Federal Deposit Insurance Corp. Chairman Sheila Bair said Friday her agency may tap its $500 billion credit line with the U.S. Treasury to replenish its deposit insurance fund, though she appeared cautious about doing so.</p><p>“We are carefully considering all options” including borrowing from the Treasury, Ms. Bair said Friday after a speech in Washington.</p><p>Ms. Bair has already warned banks that they may face an assessment increase to bolster the fund. Friday, she said there are also other little-known options available to the agency, including requiring banks to prepay assessments. The FDIC board of directors will meet at the end of this month to consider how to replenish the fund, she said.</p></blockquote><p>Two observations.  If they think they’re going to need $500 billion on tap, that would imply the failure of an additional 1,200 banks, (or at least the depository percentage equivalent), since the failure of 119 banks has eaten up the $52 billion in the DIF at the beginning of 2008.  1,200 is 15 percent of all the remaining depository institutions in the USA.  An article in the SF Chronicle today may help explain <a href=\"http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2009/09/20/MNOR19N2B1.DTL\">where some of those bank failures are going to come from</a>:</p><p><i>“Next year, many option ARM payments will begin to readjust, slamming borrowers with dramatically higher monthly mortgage bills. Analysts say that could unleash the next big wave of foreclosures – and home-loan data show that the risky loans were heavily used in the Bay Area….  First American shows more than 54,000 option ARMs issued here with a value of about $30.9 billion.”</i></p><p>Perhaps $500 billion just the proverbial Big Number meant to reassure the public.  Either way, the fiction of the fund has been exploded.  The second thing that springs to mind is this: how high would bank fees have to be if they ever tried to pay back that much money?</p></div>",
  "content_text": "According to my calculations, following the failure of the 93rd and 94th banks this year, the DIF is in the red somewhere between -3.6 billion and -13.3 billion, depending upon the difference between FDIC-estimated losses and actual losses.  That multiple was 1.95 in 2008 and Q1 2009, but thanks to the special assessment in the second quarter, it fell to 1.69 in the last report.  There will be another assessment in the third quarter, but regardless, it’s clear that if the DIF hasn’t run out yet,\nit’s going to\nbefore the end of the year.\nFederal Deposit Insurance Corp. Chairman Sheila Bair said Friday her agency may tap its $500 billion credit line with the U.S. Treasury to replenish its deposit insurance fund, though she appeared cautious about doing so.\n“We are carefully considering all options” including borrowing from the Treasury, Ms. Bair said Friday after a speech in Washington.\nMs. Bair has already warned banks that they may face an assessment increase to bolster the fund. Friday, she said there are also other little-known options available to the agency, including requiring banks to prepay assessments. The FDIC board of directors will meet at the end of this month to consider how to replenish the fund, she said.\nTwo observations.  If they think they’re going to need $500 billion on tap, that would imply the failure of an additional 1,200 banks, (or at least the depository percentage equivalent), since the failure of 119 banks has eaten up the $52 billion in the DIF at the beginning of 2008.  1,200 is 15 percent of all the remaining depository institutions in the USA.  An article in the SF Chronicle today may help explain\nwhere some of those bank failures are going to come from\n:\n“Next year, many option ARM payments will begin to readjust, slamming borrowers with dramatically higher monthly mortgage bills. Analysts say that could unleash the next big wave of foreclosures – and home-loan data show that the risky loans were heavily used in the Bay Area….  First American shows more than 54,000 option ARMs issued here with a value of about $30.9 billion.”\nPerhaps $500 billion just the proverbial Big Number meant to reassure the public.  Either way, the fiction of the fund has been exploded.  The second thing that springs to mind is this: how high would bank fees have to be if they ever tried to pay back that much money?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-20T11:49:00+00:00"
}