{
  "url": "https://voxday.net/2009/09/23/you-cant-kick-us-out-we-already-lef-2/",
  "scraped_at": "2026-01-08T23:07:30.264513",
  "title": "You can’t kick us out, we already left",
  "date_display": "September 23, 2009",
  "date_iso": "2009-09-23T08:25:00+00:00",
  "date_from_url": "2009-09-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Republicans argue over who should be kicked out of the party first, <a href=\"http://newsrealblog.com/2009/09/20/david-frum-refuses-to-acknowledge-the-whole-story-about-glenn-beck-and-ron-paul/\">Glenn Beck or Ron Paul</a>?</p><blockquote><p>We need to focus on Paul before we can get to Beck. What makes Paul a crackpot who we should cast out from Conservatism? Sure, he’s got some economic crackpot ideas about the Gold Standard and the Federal Reserve. But are those banishment worthy? No. They’re intellectual junk food, not intellectual poison. I don’t like them but I’m not going to say someone shouldn’t be allowed to be part of the movement because they advocate them.  Paul gets cast out because of his insane foreign policy views. He’s an absolute isolationist who wants us to cut off our support and alliance with Israel. His foreign policy is all but in line with the anti-war Left. John Podhoretz fisked this issue of Paul as an anti-Semite for Commentary back in 2007 and isolated several reasons why people could regard Paul as an enemy of the Jews. (Though Podhoretz himself disagreed with the overall assessment.) So that’s the central problem with Paul.</p></blockquote><p>Good, <a href=\"http://www.newmajority.com/glenn-beck-and-ron-paul-2\">boot them both out</a>, as I would like to see them establish a genuine alternative to the bi-factional ruling party, an isolationist, hard money, Constitution-respecting, sovereignty-defending American Freedom Party that combines the best of the Constitution Party and the Libertarian Party.  Look at the modern Republican media “conservative”.  Their primary concerns are: 1) defending the Federal Reserve monopoly, 2) protecting Wall Street from the consequences of its actions, 3) maintaining Empire abroad, 4) Israel uber alles.  There’s no rational reason for any actual American conservative, let alone a libertarian, to give these “conservative” views any consideration whatsoever.  It’s increasingly obvious that the label “conservative” has been hijacked in a manner similar to the way that “liberal” was captured decades ago.</p><p>The Other McCain <a href=\"http://rsmccain.blogspot.com/2009/09/cant-all-conservatives-at-least-agree.html\">has the links</a>, just in case you’re interested in the Beck-Levin catfight.  I couldn’t care less about it, since none of them, Beck included, appear to be sentient enough to have recognized the only relevant point.  Ron Paul happens to be entirely correct, and no matter how highly these “conservatives” think of the Federal Reserve system, Wall Street’s perverted parody of capitalism, and the Pax Americana, all three are going to collapse sooner than any of them dream possible.  Israel, on the other hand, should be all right, but the sooner the Israelis stop relying on American Jews and Christian Zionists to funnel US taxpayer money to them, the better off they’ll be.  Welfare didn’t help the inner city and it’s not helping Israel either.</p><p>Other than Ron Paul, I have no use for the lot of them or their mad dominance-humpery.  I don’t watch television or listen to the radio anyhow.  As for the two-party system that concerns them so deeply, well, I’m with Demosthenes:</p><p><i>“You used, men of Athens, to pay taxes by Boards: today you conduct your politics by Boards. On either side there is an orator as leader, and a general under him; and for the Three Hundred, there are those who come to shout. The rest of you distribute yourselves between the two parties, some on either side.  This system you must give up: you must even now become your own masters….”</i></p><p>I am pleased to be able to say that I have never cast a vote for either a Republican or a Democrat for president.  When I look at the choices I have been presented by the two parties over the course of my voting eligibility, George Bush, Michael Dukakis, Bill Clinton, Bob Dole, George W. Bush, Al Gore, John Kerry, John McCain, and Barack Obama, there is not a single candidate I regret not voting for.</p></div>",
  "content_text": "Republicans argue over who should be kicked out of the party first,\nGlenn Beck or Ron Paul\n?\nWe need to focus on Paul before we can get to Beck. What makes Paul a crackpot who we should cast out from Conservatism? Sure, he’s got some economic crackpot ideas about the Gold Standard and the Federal Reserve. But are those banishment worthy? No. They’re intellectual junk food, not intellectual poison. I don’t like them but I’m not going to say someone shouldn’t be allowed to be part of the movement because they advocate them.  Paul gets cast out because of his insane foreign policy views. He’s an absolute isolationist who wants us to cut off our support and alliance with Israel. His foreign policy is all but in line with the anti-war Left. John Podhoretz fisked this issue of Paul as an anti-Semite for Commentary back in 2007 and isolated several reasons why people could regard Paul as an enemy of the Jews. (Though Podhoretz himself disagreed with the overall assessment.) So that’s the central problem with Paul.\nGood,\nboot them both out\n, as I would like to see them establish a genuine alternative to the bi-factional ruling party, an isolationist, hard money, Constitution-respecting, sovereignty-defending American Freedom Party that combines the best of the Constitution Party and the Libertarian Party.  Look at the modern Republican media “conservative”.  Their primary concerns are: 1) defending the Federal Reserve monopoly, 2) protecting Wall Street from the consequences of its actions, 3) maintaining Empire abroad, 4) Israel uber alles.  There’s no rational reason for any actual American conservative, let alone a libertarian, to give these “conservative” views any consideration whatsoever.  It’s increasingly obvious that the label “conservative” has been hijacked in a manner similar to the way that “liberal” was captured decades ago.\nThe Other McCain\nhas the links\n, just in case you’re interested in the Beck-Levin catfight.  I couldn’t care less about it, since none of them, Beck included, appear to be sentient enough to have recognized the only relevant point.  Ron Paul happens to be entirely correct, and no matter how highly these “conservatives” think of the Federal Reserve system, Wall Street’s perverted parody of capitalism, and the Pax Americana, all three are going to collapse sooner than any of them dream possible.  Israel, on the other hand, should be all right, but the sooner the Israelis stop relying on American Jews and Christian Zionists to funnel US taxpayer money to them, the better off they’ll be.  Welfare didn’t help the inner city and it’s not helping Israel either.\nOther than Ron Paul, I have no use for the lot of them or their mad dominance-humpery.  I don’t watch television or listen to the radio anyhow.  As for the two-party system that concerns them so deeply, well, I’m with Demosthenes:\n“You used, men of Athens, to pay taxes by Boards: today you conduct your politics by Boards. On either side there is an orator as leader, and a general under him; and for the Three Hundred, there are those who come to shout. The rest of you distribute yourselves between the two parties, some on either side.  This system you must give up: you must even now become your own masters….”\nI am pleased to be able to say that I have never cast a vote for either a Republican or a Democrat for president.  When I look at the choices I have been presented by the two parties over the course of my voting eligibility, George Bush, Michael Dukakis, Bill Clinton, Bob Dole, George W. Bush, Al Gore, John Kerry, John McCain, and Barack Obama, there is not a single candidate I regret not voting for.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-09-23T07:25:00+00:00"
}