{
  "url": "https://voxday.net/2008/02/21/adding-to-lexicon/",
  "scraped_at": "2026-01-08T22:12:42.957719",
  "title": "Adding to the lexicon",
  "date_display": "February 21, 2008",
  "date_iso": "2008-02-21T17:32:00+00:00",
  "date_from_url": "2008-02-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It occurs to me that when kicking around the concept of God as game designer, we’re still missing a few words required to properly consider the concept.  The problem with the concept of omniscience is that it’s a weirdly binary notion, wherein the only options are a superficially illogical all-knowing and a definitively non-Biblical naught-knowing of nonexistence.  But how would one describe the knowledge of the Game Designer God, who can know or not know any given thing depending solely on His will?</p><p>The concept of <i>voliscience</i> describes a Creator who knows whatever He wants, whenever He wants, to the extent that the concept of time is even relevant to such a being.  Not only does this concept not limit God, but it has the additional benefit of being far more Biblically accurate than the traditional concept of an omniscient God.  In fact, if one thinks about the matter for more than five seconds, one quickly realizes that the concept of voliscience is far less limiting than the use of the concept of omniscience has historically proven to be.  One might also consider the concept of <i>volipotence</i> to be of some benefit in better conceiving a rationally sound and Scripturally precise nature of the Biblical God, but it’s probably less necessary since the key stumbling point for most Christians and atheists alike here is not related directly to omnipotence per se, but rather their inability to distinguish between the capacity of omnipotence and the action of omniderigence.</p><p>The fact that there is no possible logical conflict between voliscience and volipotence only adds to the rational appeal of the concept in my opinion, although I regard the nominal theodictic conflict between omnipotence and omniscience to reflect thinking so shallow as to border on stupidity anyhow.  In an information society, one has to be fairly obtuse to fail to realize that because knowledge is power, absolute knowledge IS absolute power.  There is no conflict because the two are one and the same.</p></div>",
  "content_text": "It occurs to me that when kicking around the concept of God as game designer, we’re still missing a few words required to properly consider the concept.  The problem with the concept of omniscience is that it’s a weirdly binary notion, wherein the only options are a superficially illogical all-knowing and a definitively non-Biblical naught-knowing of nonexistence.  But how would one describe the knowledge of the Game Designer God, who can know or not know any given thing depending solely on His will?\nThe concept of\nvoliscience\ndescribes a Creator who knows whatever He wants, whenever He wants, to the extent that the concept of time is even relevant to such a being.  Not only does this concept not limit God, but it has the additional benefit of being far more Biblically accurate than the traditional concept of an omniscient God.  In fact, if one thinks about the matter for more than five seconds, one quickly realizes that the concept of voliscience is far less limiting than the use of the concept of omniscience has historically proven to be.  One might also consider the concept of\nvolipotence\nto be of some benefit in better conceiving a rationally sound and Scripturally precise nature of the Biblical God, but it’s probably less necessary since the key stumbling point for most Christians and atheists alike here is not related directly to omnipotence per se, but rather their inability to distinguish between the capacity of omnipotence and the action of omniderigence.\nThe fact that there is no possible logical conflict between voliscience and volipotence only adds to the rational appeal of the concept in my opinion, although I regard the nominal theodictic conflict between omnipotence and omniscience to reflect thinking so shallow as to border on stupidity anyhow.  In an information society, one has to be fairly obtuse to fail to realize that because knowledge is power, absolute knowledge IS absolute power.  There is no conflict because the two are one and the same.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-21T17:32:00+00:00"
}