{
  "url": "https://voxday.net/2008/02/03/atheists-in-action/",
  "scraped_at": "2026-01-08T22:10:24.931764",
  "title": "Atheists in action",
  "date_display": "February 3, 2008",
  "date_iso": "2008-02-03T11:59:00+00:00",
  "date_from_url": "2008-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now this seriously cracked me up!  Only two days after TIA was published, one can already see how deeply confident atheists are in the ability of their heroes to withstand the case I present against Dawkins, Harris, and Hitchens in <i>The Irrational Atheist</i>.</p><blockquote><p><a href=\"http://en.wikipedia.org/w/index.php?title=Vox_Day&amp;oldid=188776558\">Syphilis</a><br>From Wikipedia, the free encyclopedia<br> (Redirected from Vox Day)</br></br></p><p>Vox Day<br>From Wikipedia, the free encyclopedia<br>Redirect page<br>Jump to: navigation, search<br>#REDIRECT Syphilis<br>121.45.115.91</br></br></br></br></br></p></blockquote><p>Atheists so desperately want to dismiss the idea that they just might tend to the irrational and socially autistic… and yet this behavior is so entirely predictable that it can’t possibly surprise anyone with a three-digit IQ.  Meanwhile, El Borak actually reads the entire book and concludes that <a href=\"http://elborak.blogspot.com/2008/02/intellectual-pummeling.html\">TIA is an “intellectual pummeling”</a>:</p><blockquote><p>With its thorough presentation of its opponents’ arguments, its careful handling of the data that shows those arguments to be as specious as they are widespread, and its “in your face” style of presentation, TIA is not so much a knockout punch as a devastating flurry of intellectual body blows that sends its targets stumbling back into the corner at the end of the round, followed by an arrogant taunt from across the ring that there’s plenty more where that came from. Whether or not Day’s chosen opponents have what it takes to answer the bell, TIA is one performance that’s going on the highlight reel.</p></blockquote><p>Personally, I’m beginning to suspect they should probably just stick with vandalizing Wikipedia.  Based on the feeble attempts we’ve seen thus far from Richard Dawkins’s fan club, it’s probably going to be a more effective and convincing approach.</p></div>",
  "content_text": "Now this seriously cracked me up!  Only two days after TIA was published, one can already see how deeply confident atheists are in the ability of their heroes to withstand the case I present against Dawkins, Harris, and Hitchens in\nThe Irrational Atheist\n.\nSyphilis\nFrom Wikipedia, the free encyclopedia\n(Redirected from Vox Day)\nVox Day\nFrom Wikipedia, the free encyclopedia\nRedirect page\nJump to: navigation, search\n#REDIRECT Syphilis\n121.45.115.91\nAtheists so desperately want to dismiss the idea that they just might tend to the irrational and socially autistic… and yet this behavior is so entirely predictable that it can’t possibly surprise anyone with a three-digit IQ.  Meanwhile, El Borak actually reads the entire book and concludes that\nTIA is an “intellectual pummeling”\n:\nWith its thorough presentation of its opponents’ arguments, its careful handling of the data that shows those arguments to be as specious as they are widespread, and its “in your face” style of presentation, TIA is not so much a knockout punch as a devastating flurry of intellectual body blows that sends its targets stumbling back into the corner at the end of the round, followed by an arrogant taunt from across the ring that there’s plenty more where that came from. Whether or not Day’s chosen opponents have what it takes to answer the bell, TIA is one performance that’s going on the highlight reel.\nPersonally, I’m beginning to suspect they should probably just stick with vandalizing Wikipedia.  Based on the feeble attempts we’ve seen thus far from Richard Dawkins’s fan club, it’s probably going to be a more effective and convincing approach.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-03T11:59:00+00:00"
}