{
  "url": "https://voxday.net/2008/02/02/billions-and-billions-of-dinosaurs/",
  "scraped_at": "2026-01-08T22:10:17.623818",
  "title": "Billions and billions of dinosaurs",
  "date_display": "February 2, 2008",
  "date_iso": "2008-02-02T12:00:00+00:00",
  "date_from_url": "2008-02-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not particularly into biology, but I’ve never bought into the “science” that <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=59991\">oil is nothing but squished dinosaurs and sufficiently fermented ferns</a>.  Like many boys, I was a huge dinosaur enthusiast when I was five, and I didn’t believe it then any more than I do now.  (Apparently, I was so disgusted with my kindergarten teacher’s inability to recognize that my nametag was an Allosaurus on my first day that in the evening, I informed my father that I wasn’t going to school anymore, as there was obviously no point trying to learn anything from a woman who couldn’t even tell an Allosaurus from a Tyrannosaurus Rex.  He managed to keep a straight face and patiently convinced me that there just might be other, non-dinosaur related subjects worth learning about.)</p><p>I don’t pretend to know precisely what oil is or how it is created, but it seems to me that we’ve used a little too much of it over the last century for it to be non-renewable resource that cannot be manufactured as we were always taught it was.  Now that abiotic theory is finally beginning to be discussed openly in public, perhaps scientists will deign to actually consider making use of scientody to consider the issue instead of simply relying on their usual appeal to their own authority.</p><p>I must get my suspicion of scientific authority from my father.  A friend of his told me how he once brought a male professor of biology to angry tears merely by asking intelligent questions about the source of calcium in cow’s milk, then pointing out that the professor’s answers simply didn’t add up.</p></div>",
  "content_text": "I’m not particularly into biology, but I’ve never bought into the “science” that\noil is nothing but squished dinosaurs and sufficiently fermented ferns\n.  Like many boys, I was a huge dinosaur enthusiast when I was five, and I didn’t believe it then any more than I do now.  (Apparently, I was so disgusted with my kindergarten teacher’s inability to recognize that my nametag was an Allosaurus on my first day that in the evening, I informed my father that I wasn’t going to school anymore, as there was obviously no point trying to learn anything from a woman who couldn’t even tell an Allosaurus from a Tyrannosaurus Rex.  He managed to keep a straight face and patiently convinced me that there just might be other, non-dinosaur related subjects worth learning about.)\nI don’t pretend to know precisely what oil is or how it is created, but it seems to me that we’ve used a little too much of it over the last century for it to be non-renewable resource that cannot be manufactured as we were always taught it was.  Now that abiotic theory is finally beginning to be discussed openly in public, perhaps scientists will deign to actually consider making use of scientody to consider the issue instead of simply relying on their usual appeal to their own authority.\nI must get my suspicion of scientific authority from my father.  A friend of his told me how he once brought a male professor of biology to angry tears merely by asking intelligent questions about the source of calcium in cow’s milk, then pointing out that the professor’s answers simply didn’t add up.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-02T12:00:00+00:00"
}