{
  "url": "https://voxday.net/2008/02/08/clearly-im-crazy/",
  "scraped_at": "2026-01-08T22:11:05.629122",
  "title": "You so crazy",
  "date_display": "February 8, 2008",
  "date_iso": "2008-02-08T11:40:00+00:00",
  "date_from_url": "2008-02-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Who could possibly argue against <a href=\"http://www.onlineopinion.com.au/view.asp?article=6878\">the ideological abuse of science</a> by those who claim <a href=\"http://liberalfascism.nationalreview.com/post/?q=NzNkMTRhN2Y1N2JiNGIzN2Y2OGU4OTBmMzk3NzUwMmE=\">to speak for it</a>:</p><blockquote><p><b>[T]he authors conclude that an authoritarian form of government is necessary, but this will be governance by experts and not by those who seek power.</b></p><p>Liberal democracy is sweet and addictive and indeed in the most extreme case, the USA, unbridled individual liberty overwhelms many of the collective needs of the citizens. . .  There must be open minds to look critically at liberal democracy. Reform must involve the adoption of structures to act quickly regardless of some perceived liberties. . .  We are going to have to look how authoritarian decisions based on consensus science can be implemented to contain greenhouse emissions.</p></blockquote><p>Jonah Goldberg wrote a book describing this.  As it happens, so did I: <i>“While the scientific method may lead invariably to a more accurate understanding of the material world, the same is not true of the scientists who pursue it. The profession of science is growing increasingly authoritarian and political, as can be seen by the treatment of those who fail to fall in line with the scientific consensus on subjects where the evidence is far from settled, such as global warming….  Religion does not threaten science so much as science threatens itself. By combining increasingly authoritarian arrogance with an encroachment upon intellectual spheres they are manifestly unprepared to invade, scientists and their thoughtless science fetishist followers risk starting a genuine war they cannot possibly hope to win.”</i><br> – <i><b>The Irrational Atheist</b></i> p. 59.</br></p><p>And as I said in my interview with Joseph Farah, scientists are like philosophers, they always eventually come around to the idea of rule by scientist-king.  I may not be a fan of universal representative democracy, but I’ll definitely take universal direct democracy over oligarchical rule by autocratic scientists.</p></div>",
  "content_text": "Who could possibly argue against\nthe ideological abuse of science\nby those who claim\nto speak for it\n:\n[T]he authors conclude that an authoritarian form of government is necessary, but this will be governance by experts and not by those who seek power.\nLiberal democracy is sweet and addictive and indeed in the most extreme case, the USA, unbridled individual liberty overwhelms many of the collective needs of the citizens. . .  There must be open minds to look critically at liberal democracy. Reform must involve the adoption of structures to act quickly regardless of some perceived liberties. . .  We are going to have to look how authoritarian decisions based on consensus science can be implemented to contain greenhouse emissions.\nJonah Goldberg wrote a book describing this.  As it happens, so did I:\n“While the scientific method may lead invariably to a more accurate understanding of the material world, the same is not true of the scientists who pursue it. The profession of science is growing increasingly authoritarian and political, as can be seen by the treatment of those who fail to fall in line with the scientific consensus on subjects where the evidence is far from settled, such as global warming….  Religion does not threaten science so much as science threatens itself. By combining increasingly authoritarian arrogance with an encroachment upon intellectual spheres they are manifestly unprepared to invade, scientists and their thoughtless science fetishist followers risk starting a genuine war they cannot possibly hope to win.”\n–\nThe Irrational Atheist\np. 59.\nAnd as I said in my interview with Joseph Farah, scientists are like philosophers, they always eventually come around to the idea of rule by scientist-king.  I may not be a fan of universal representative democracy, but I’ll definitely take universal direct democracy over oligarchical rule by autocratic scientists.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-08T11:40:00+00:00"
}