{
  "url": "https://voxday.net/2008/02/03/disappointment-of-rationalis/",
  "scraped_at": "2026-01-08T22:10:23.117981",
  "title": "The disappointment of the “rationalist”",
  "date_display": "February 3, 2008",
  "date_iso": "2008-02-03T10:50:00+00:00",
  "date_from_url": "2008-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ben Jennings is very amusing indeed:</p><blockquote><p>Man, am I disappointed. Having read the preface and about half of chapter one I think that either all the people telling me you were a cut above D’Souza and McGrath were pulling my leg, or you’re just lulling me into a false sense of security like a common pool hustler.  So is the rest of the book this inept, Vox?</p></blockquote><p>Let’s compare Ben’s experience with <i>The Irrational Atheist</i> with my own reading of <i>The God Delusion</i>.  By the end of the preface and halfway through chapter one, Richard Dawkins’s attempt to prove that belief in God is a delusion as well as the massive improbability of God’s existence had established:</p><p>1.  His wife’s inability to talk about things she didn’t like.<br>2.  A definition of delusion courtesy of Penguin, Microsoft Word and the author of <i>Zen and the Art of Motorcycle Maintenance</i>.  Which reminds me, is there a logical fallacy known as the Appeal to Inexplicable Authority?  Or should that be the Inexplicable Appeal to Non-Authority.<br>3.  The ineffectiveness of atheist political lobbying compared with the Jews.  It’s such a pity he didn’t follow this train of thought further, it really could have been hilarious, at least to those of us with a dark sense of humor.<br>4.  His belief in Einstein’s atheism or agnosticism.  (With which I concur, by the way.)</br></br></br></p><p>Now, that’s one convincing case against God and religious belief right there, isn’t it!  Given Ben’s demonstrated handicap when it comes to logical thinking, I have to say that I’m eagerly awaiting the next missteps in his exciting adventure in creative criticism.</p><p>But seriously, this really shouldn’t be that hard.  First you read THE ENTIRE BOOK.  Then you go back and criticize whatever flaws you found.  Public note-taking along the way is perfectly fine, just be aware that you may find yourself looking like a complete fool for not realizing that the very things you’re complaining about not being there are, in fact, there in a later chapter.</p></div>",
  "content_text": "Ben Jennings is very amusing indeed:\nMan, am I disappointed. Having read the preface and about half of chapter one I think that either all the people telling me you were a cut above D’Souza and McGrath were pulling my leg, or you’re just lulling me into a false sense of security like a common pool hustler.  So is the rest of the book this inept, Vox?\nLet’s compare Ben’s experience with\nThe Irrational Atheist\nwith my own reading of\nThe God Delusion\n.  By the end of the preface and halfway through chapter one, Richard Dawkins’s attempt to prove that belief in God is a delusion as well as the massive improbability of God’s existence had established:\n1.  His wife’s inability to talk about things she didn’t like.\n2.  A definition of delusion courtesy of Penguin, Microsoft Word and the author of\nZen and the Art of Motorcycle Maintenance\n.  Which reminds me, is there a logical fallacy known as the Appeal to Inexplicable Authority?  Or should that be the Inexplicable Appeal to Non-Authority.\n3.  The ineffectiveness of atheist political lobbying compared with the Jews.  It’s such a pity he didn’t follow this train of thought further, it really could have been hilarious, at least to those of us with a dark sense of humor.\n4.  His belief in Einstein’s atheism or agnosticism.  (With which I concur, by the way.)\nNow, that’s one convincing case against God and religious belief right there, isn’t it!  Given Ben’s demonstrated handicap when it comes to logical thinking, I have to say that I’m eagerly awaiting the next missteps in his exciting adventure in creative criticism.\nBut seriously, this really shouldn’t be that hard.  First you read THE ENTIRE BOOK.  Then you go back and criticize whatever flaws you found.  Public note-taking along the way is perfectly fine, just be aware that you may find yourself looking like a complete fool for not realizing that the very things you’re complaining about not being there are, in fact, there in a later chapter.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-03T10:50:00+00:00"
}