{
  "url": "https://voxday.net/2008/02/24/discuss-amongst-yourselves_24/",
  "scraped_at": "2026-01-08T22:13:06.756196",
  "title": "Discuss amongst yourselves",
  "date_display": "February 24, 2008",
  "date_iso": "2008-02-24T23:39:00+00:00",
  "date_from_url": "2008-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The TIA downloads have picked up of late.  75 on Friday and 93 yesterday, compared to an average 25 the previous week.  No idea why, but interesting nonetheless.  And what is with the continued “strawman argument” claims from the dimmer “brights”?  It’s bizarre, because I’m not only responding directly to the specific arguments laid out by the New Atheists in their books, in the case of Dawkins I actually quote in its entirety what he asserts is the central argument of <i>The God Delusion</i>.  If I got any less “strawman”, I’d be plagiarizing.</p><p>I’m beginning to suspect that more than a few of my critics not only don’t comprehend what I’ve written, but that they don’t even understand the arguments that their heroes have made.</p><p>UPDATE – I did warn you that <a href=\"http://www.amazon.com/review/RUS5Q5VOI7RX/ref=cm_cr_rdp_perm\">educators aren’t very bright</a>:</p><blockquote><p>If the author wrote the book for the three most often named Athiests, I could probably give him 4 or five stars, the 1 star is for the book as written, assuming that it was intended for mass market readership….  My objection to the book is not what it says, but how it says it. A book written in obvious attemt to “prove” a series of points should be written in a manner that will allow the majority of readers to understand the points being made. Unless the reader wants to sit down with an unabridged dictionary in one hand and the book in the other, he will not be able to tell if Mr Day really has some arguments or is just “blowing smoke”.</p><p>As a post script, I am not one of his Mensa idiots nor am I uneducated. I have a post graduate degree and taught in a major University for over 20 years.</p></blockquote></div>",
  "content_text": "The TIA downloads have picked up of late.  75 on Friday and 93 yesterday, compared to an average 25 the previous week.  No idea why, but interesting nonetheless.  And what is with the continued “strawman argument” claims from the dimmer “brights”?  It’s bizarre, because I’m not only responding directly to the specific arguments laid out by the New Atheists in their books, in the case of Dawkins I actually quote in its entirety what he asserts is the central argument of\nThe God Delusion\n.  If I got any less “strawman”, I’d be plagiarizing.\nI’m beginning to suspect that more than a few of my critics not only don’t comprehend what I’ve written, but that they don’t even understand the arguments that their heroes have made.\nUPDATE – I did warn you that\neducators aren’t very bright\n:\nIf the author wrote the book for the three most often named Athiests, I could probably give him 4 or five stars, the 1 star is for the book as written, assuming that it was intended for mass market readership….  My objection to the book is not what it says, but how it says it. A book written in obvious attemt to “prove” a series of points should be written in a manner that will allow the majority of readers to understand the points being made. Unless the reader wants to sit down with an unabridged dictionary in one hand and the book in the other, he will not be able to tell if Mr Day really has some arguments or is just “blowing smoke”.\nAs a post script, I am not one of his Mensa idiots nor am I uneducated. I have a post graduate degree and taught in a major University for over 20 years.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-24T23:39:00+00:00"
}