{
  "url": "https://voxday.net/2008/02/15/empty-shell-of-dawkinsne/",
  "scraped_at": "2026-01-08T22:12:00.858036",
  "title": "The empty shell of Dawkins.Net",
  "date_display": "February 15, 2008",
  "date_iso": "2008-02-15T13:50:00+00:00",
  "date_from_url": "2008-02-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Despite their literally hundreds of comments on <i>The Irrational Atheist</i>, (<a href=\"http://richarddawkins.net/articleComments,2192,Irrational-Atheist-trounces-God-deniers,Wold-Net-Daily,page1#comments\">1,983 to be precise</a>) Dawkins.Net wound up conceding that the book did indeed trounce the targeted god-deniers and that they’ve got neither the collective capacity nor the courage to confront the refutation of their hero contained in TIA.  Other than Crazy Ivan’s valiant but unconvincing efforts and Stephen Bain’s ability to demonstrate that science has actually inspired a few little poems here and there, the Dawkins.Net troop was unable to come up with any substantial responses to the Seven Impossible Things believed by their iconic Red Queen.</p><p>I also note that the various individuals who declared their intentions of doing to do a chapter-by-chapter rebuttal seem to have mysteriously given up right around the time they reached Chapter Three.  Apparently, they discovered that while it’s possible to dispute aspects of the rhetorical framing of my arguments, it’s not quite so easy to finesse the arguments themselves presented in TIA… especially when I anticipate many of the objections that were, as expected, raised to the first two chapters.  On a tangential note, I must say that I particularly enjoyed The Professor’s classic Fighting Withdrawal, when he cut the heart out of the New Atheism movement as well as Richard Dawkins’s OUT campaign <a href=\"http://irrationalatheist.com/forum/viewtopic.php?t=53\">by trying to argue that atheists can believe in the supernatural and in Heaven and Hell</a>, to say nothing of his demonstrated inability to perform the basic math required to determine the relationship between the fraction of a larger population and a fraction of a smaller population.</p><p>By the way, it occurs to me that we appear to have the need for a little TIA-related lexicon.  If there’s any words you think should be included, leave them in the comments here.  And yes, we already know about the O-word, the T-word and the Four Horsemen of the B-word.</p></div>",
  "content_text": "Despite their literally hundreds of comments on\nThe Irrational Atheist\n, (\n1,983 to be precise\n) Dawkins.Net wound up conceding that the book did indeed trounce the targeted god-deniers and that they’ve got neither the collective capacity nor the courage to confront the refutation of their hero contained in TIA.  Other than Crazy Ivan’s valiant but unconvincing efforts and Stephen Bain’s ability to demonstrate that science has actually inspired a few little poems here and there, the Dawkins.Net troop was unable to come up with any substantial responses to the Seven Impossible Things believed by their iconic Red Queen.\nI also note that the various individuals who declared their intentions of doing to do a chapter-by-chapter rebuttal seem to have mysteriously given up right around the time they reached Chapter Three.  Apparently, they discovered that while it’s possible to dispute aspects of the rhetorical framing of my arguments, it’s not quite so easy to finesse the arguments themselves presented in TIA… especially when I anticipate many of the objections that were, as expected, raised to the first two chapters.  On a tangential note, I must say that I particularly enjoyed The Professor’s classic Fighting Withdrawal, when he cut the heart out of the New Atheism movement as well as Richard Dawkins’s OUT campaign\nby trying to argue that atheists can believe in the supernatural and in Heaven and Hell\n, to say nothing of his demonstrated inability to perform the basic math required to determine the relationship between the fraction of a larger population and a fraction of a smaller population.\nBy the way, it occurs to me that we appear to have the need for a little TIA-related lexicon.  If there’s any words you think should be included, leave them in the comments here.  And yes, we already know about the O-word, the T-word and the Four Horsemen of the B-word.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-15T13:50:00+00:00"
}