{
  "url": "https://voxday.net/2008/02/13/endorsing-evi/",
  "scraped_at": "2026-01-08T22:11:42.482187",
  "title": "Endorsing evil",
  "date_display": "February 13, 2008",
  "date_iso": "2008-02-13T11:03:00+00:00",
  "date_from_url": "2008-02-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As you all know, I have been a Ron Paul supporter from the very start.  And while I continue to wish Ron Paul every success in both his presidential and congressional campaigns, the fact is that my official endorsement is still available due to the Paul campaign’s entirely understandable disinclination to waste any time defending my various controversialities to the dim-witted and the reading-comprehension challenged lot otherwise known as the mainstream media.  I have no problem whatsoever with their decision and fully respect it, on the other hand, I feel that it would be irresponsible to not do something with my unoccupied endorsement considering the immense weight of my opinion on the matter with the American electorate.</p><p>I am, of course, vehemently opposed to the Lizard Queen and the only thing about her I can wholeheartedly endorse is our shared appreciation for attractive young women.  Since she seems disinclined to publicly advertise that aspect of her lizardliness, I imagine that she, too, would fail to properly appreciate my endorsement of her campaign.</p><p><a href=\"http://corner.nationalreview.com/post/?q=MTU5OTJiM2I4YmRhMDA5NWIzYzNlYTRmYWY3MWE3MjA=\">Like everyone else</a>, I don’t know much about the Magic Negro except for the fact that his fellow senator assures us that he is a black man who showers regularly, is unlikely to steal the silverware and seldom bursts into spontaneous rap.  Also, he is audacious enough to “hope”, although the American public remains in blissed ignorance of precisely what he is so audaciously hoping for.  While I am generally pro-shower, I don’t know if there’s enough there there to even justify an opinion of the man, let alone an endorsement.</p><p>McCrazy would certainly make for an entertaining president as he pursued Osama bin Laden TO THE GATES OF HELL!!!!!!  That being said, I’m not sure that being unashamedly mentally unbalanced is particularly desirable in a national leader and “the lesser of two evils” equation is really rendered incalculable by McCrazy since he is not so much the lesser of two evils as the more unstable of two evils.  And if the nation is united in its collective decision to walk down the left-hand path together, I feel that we would be wise to do so with vigor and to actively embrace the greater evil rather than the lesser.  Also, I have to assume that a candidate of ancient and unabashed evil is unlikely to have any significant problem with controversial endorsers.</p><p>Therefore, I have decided <a href=\"http://cthulhu2008.blogspot.com/\">to endorse a truly great and fearsome evil, Dread Cthulhu, for president in 2008</a>.  For as it is written, that is not dead which can eternal lie, and with strange æons even death may die.</p></div>",
  "content_text": "As you all know, I have been a Ron Paul supporter from the very start.  And while I continue to wish Ron Paul every success in both his presidential and congressional campaigns, the fact is that my official endorsement is still available due to the Paul campaign’s entirely understandable disinclination to waste any time defending my various controversialities to the dim-witted and the reading-comprehension challenged lot otherwise known as the mainstream media.  I have no problem whatsoever with their decision and fully respect it, on the other hand, I feel that it would be irresponsible to not do something with my unoccupied endorsement considering the immense weight of my opinion on the matter with the American electorate.\nI am, of course, vehemently opposed to the Lizard Queen and the only thing about her I can wholeheartedly endorse is our shared appreciation for attractive young women.  Since she seems disinclined to publicly advertise that aspect of her lizardliness, I imagine that she, too, would fail to properly appreciate my endorsement of her campaign.\nLike everyone else\n, I don’t know much about the Magic Negro except for the fact that his fellow senator assures us that he is a black man who showers regularly, is unlikely to steal the silverware and seldom bursts into spontaneous rap.  Also, he is audacious enough to “hope”, although the American public remains in blissed ignorance of precisely what he is so audaciously hoping for.  While I am generally pro-shower, I don’t know if there’s enough there there to even justify an opinion of the man, let alone an endorsement.\nMcCrazy would certainly make for an entertaining president as he pursued Osama bin Laden TO THE GATES OF HELL!!!!!!  That being said, I’m not sure that being unashamedly mentally unbalanced is particularly desirable in a national leader and “the lesser of two evils” equation is really rendered incalculable by McCrazy since he is not so much the lesser of two evils as the more unstable of two evils.  And if the nation is united in its collective decision to walk down the left-hand path together, I feel that we would be wise to do so with vigor and to actively embrace the greater evil rather than the lesser.  Also, I have to assume that a candidate of ancient and unabashed evil is unlikely to have any significant problem with controversial endorsers.\nTherefore, I have decided\nto endorse a truly great and fearsome evil, Dread Cthulhu, for president in 2008\n.  For as it is written, that is not dead which can eternal lie, and with strange æons even death may die.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-13T11:03:00+00:00"
}