{
  "url": "https://voxday.net/2008/02/19/few-atheists-in-foxholes/",
  "scraped_at": "2026-01-08T22:12:24.085789",
  "title": "Few atheists in foxholes",
  "date_display": "February 19, 2008",
  "date_iso": "2008-02-19T11:25:00+00:00",
  "date_from_url": "2008-02-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Cronolink is surprised:</p><blockquote><p>Vox, you’re angry. Why? I mean, didn’t you expect something much as this? I believe you received equally stupid and vacuous responses when you publicized your TIA op/ed column back then. Weren’t you expecting the same or even worse with your book?</p></blockquote><p>I’m not angry, just irritated.  I am, you may recall, an ex-martial artist from a rather hard core dojo.  In all my years there, there was only one iron-clad rule.  To win respect, YOU MUST GET UP!  You didn’t have to be a flashy kicker, an overpowering wrestler or an intimidating hand fighter to earn your place there, you just had to prove that when hurt, when knocked down, you’d get up and show that you were good to go.  Even if you really weren’t.</p><p>I saw young men knocked unconscious come to, push themselves to their feet and bring their guard up despite not being quite sure who or where they were.  I loved them for it.  I saw pretty girls with their noses gushing blood and tears pouring down their faces get up and nod to their opponent, telling them to go ahead and bring it again.  I loved them for it.  I saw a beaten and exhausted fighter walk into a wicked spinning sidekick that jackknifed him, broke a rib and made his eyes water, then watched in awe as he slowly straightened and waved off the referee’s offer of a pause to catch his breath despite knowing that he had to survive 30 more seconds in the final round.  It was terrible, but oh, how I loved him for it!</p><p>I also saw a 265-pound linebacker quit in the middle of his very first round after getting popped in the face for the first time.  I saw a brown belt from a Tae Kwon Do school surreptitiously limit his sparring to pounding on our overmatched green belts and gold belts… he never came back after our most vicious black belt noticed what was happening and gave him a beating that bordered on criminal.  I saw one loud-mouthed muscle boy after another talk a huge game about how tough they were, then disappear after watching Wednesday sparring, never to return.  I cannot express how much I loathed them all, or the depth of my contempt for them.</p><p>Now, I knew Dawkins wouldn’t respond until the book became successful enough that he couldn’t avoid it, he’s directly stated that he has no interest in any intellectual engagement that won’t somehow further his career.  I also knew that Sam Harris would probably be unable to respond because the mere fact of acknowledging this level of criticism will be tantamount to conceding his entire thesis.  Christopher Hitchens has nothing to say and doesn’t even attempt to make a coherent case for or against anything and I tend to agree with Daniel Dennett on the practical issues, so I don’t know what would be the point of debating either of them.  But I did not expect that the entire atheist community would prove to be such a collection of frightened little bitches, barring a very few courageous exceptions to the contrary.</p><p>For years, atheists have been rightly demanding that Christians and other religious individuals stop hiding behind evasive theology and avoiding the pointed issues that atheists have been raising, a criticism that I have always felt to be an entirely reasonable one.  But now that atheists have been offered precisely what they have been demanding, a fair fight on their chosen ground of science and reason, they’re desperately trying to pretend it doesn’t exist.  It’s not going to work, of course, because while they can certainly avoid me and my book, they aren’t going to be able to avoid the ideas contained therein as they are picked up and improved upon by hundreds of other Christian thinkers.  Would Madeleine Bunting have been so befuddled by Richard Dawkins a few days ago if she had been armed with TIA, for example?  Of course, it is amusing that the great public intellectual Dawkins is already reduced to sparring with <i>journalists</i> in order to avoid being unmasked for the charlatan he is.</p><p>Ironically, it’s the atheist and former RD.net commenter Dominic who probably best expresses my feelings at the moment: “I stand by my proclamation that the people over at RD.net are a bunch of “little bitches”.  And that most certainly includes the leading member of the Godless Circle of Jerkdom.</p><p>UPDATE – I have no idea if this guy is an atheist or not, but <a href=\"http://www.jonathanmoeller.com/screed/?p=99\">he is an amusing writer</a>.  He made me laugh, anyhow, and he also takes the time helpfully explains why no published writer is particularly excited about <a href=\"http://www.absolutewrite.com/novels/dealing_with_the_newbies.htm\">the opportunity to “help”</a> some poor innocent soul dive into the abyss that is the world of the writer.</p><blockquote><p>He must be a libertarian, because I’ve never met a libertarian who didn’t enjoy argument ad nauseum, and Day seems to have picked online fights with numerous individual science fiction writers, a few editors, the SFWA, several individual atheists, numerous atheist message boards, several individual feminists, numerous feminist blogs  a couple of scientists, and, I don’t know, he probably invaded Russia in winter just for the thrill of it. (I get the impression that if he’d lived 150 years earlier, he’d have been helping William Walker conquer Nicaragua.)  So when I saw that he had a book coming out, naturally I had to read it.</p></blockquote><p>In my own defense, all I can say is that I seldom pick fights with anyone.  I merely write what I think and then the fights find me.</p></div>",
  "content_text": "Cronolink is surprised:\nVox, you’re angry. Why? I mean, didn’t you expect something much as this? I believe you received equally stupid and vacuous responses when you publicized your TIA op/ed column back then. Weren’t you expecting the same or even worse with your book?\nI’m not angry, just irritated.  I am, you may recall, an ex-martial artist from a rather hard core dojo.  In all my years there, there was only one iron-clad rule.  To win respect, YOU MUST GET UP!  You didn’t have to be a flashy kicker, an overpowering wrestler or an intimidating hand fighter to earn your place there, you just had to prove that when hurt, when knocked down, you’d get up and show that you were good to go.  Even if you really weren’t.\nI saw young men knocked unconscious come to, push themselves to their feet and bring their guard up despite not being quite sure who or where they were.  I loved them for it.  I saw pretty girls with their noses gushing blood and tears pouring down their faces get up and nod to their opponent, telling them to go ahead and bring it again.  I loved them for it.  I saw a beaten and exhausted fighter walk into a wicked spinning sidekick that jackknifed him, broke a rib and made his eyes water, then watched in awe as he slowly straightened and waved off the referee’s offer of a pause to catch his breath despite knowing that he had to survive 30 more seconds in the final round.  It was terrible, but oh, how I loved him for it!\nI also saw a 265-pound linebacker quit in the middle of his very first round after getting popped in the face for the first time.  I saw a brown belt from a Tae Kwon Do school surreptitiously limit his sparring to pounding on our overmatched green belts and gold belts… he never came back after our most vicious black belt noticed what was happening and gave him a beating that bordered on criminal.  I saw one loud-mouthed muscle boy after another talk a huge game about how tough they were, then disappear after watching Wednesday sparring, never to return.  I cannot express how much I loathed them all, or the depth of my contempt for them.\nNow, I knew Dawkins wouldn’t respond until the book became successful enough that he couldn’t avoid it, he’s directly stated that he has no interest in any intellectual engagement that won’t somehow further his career.  I also knew that Sam Harris would probably be unable to respond because the mere fact of acknowledging this level of criticism will be tantamount to conceding his entire thesis.  Christopher Hitchens has nothing to say and doesn’t even attempt to make a coherent case for or against anything and I tend to agree with Daniel Dennett on the practical issues, so I don’t know what would be the point of debating either of them.  But I did not expect that the entire atheist community would prove to be such a collection of frightened little bitches, barring a very few courageous exceptions to the contrary.\nFor years, atheists have been rightly demanding that Christians and other religious individuals stop hiding behind evasive theology and avoiding the pointed issues that atheists have been raising, a criticism that I have always felt to be an entirely reasonable one.  But now that atheists have been offered precisely what they have been demanding, a fair fight on their chosen ground of science and reason, they’re desperately trying to pretend it doesn’t exist.  It’s not going to work, of course, because while they can certainly avoid me and my book, they aren’t going to be able to avoid the ideas contained therein as they are picked up and improved upon by hundreds of other Christian thinkers.  Would Madeleine Bunting have been so befuddled by Richard Dawkins a few days ago if she had been armed with TIA, for example?  Of course, it is amusing that the great public intellectual Dawkins is already reduced to sparring with\njournalists\nin order to avoid being unmasked for the charlatan he is.\nIronically, it’s the atheist and former RD.net commenter Dominic who probably best expresses my feelings at the moment: “I stand by my proclamation that the people over at RD.net are a bunch of “little bitches”.  And that most certainly includes the leading member of the Godless Circle of Jerkdom.\nUPDATE – I have no idea if this guy is an atheist or not, but\nhe is an amusing writer\n.  He made me laugh, anyhow, and he also takes the time helpfully explains why no published writer is particularly excited about\nthe opportunity to “help”\nsome poor innocent soul dive into the abyss that is the world of the writer.\nHe must be a libertarian, because I’ve never met a libertarian who didn’t enjoy argument ad nauseum, and Day seems to have picked online fights with numerous individual science fiction writers, a few editors, the SFWA, several individual atheists, numerous atheist message boards, several individual feminists, numerous feminist blogs  a couple of scientists, and, I don’t know, he probably invaded Russia in winter just for the thrill of it. (I get the impression that if he’d lived 150 years earlier, he’d have been helping William Walker conquer Nicaragua.)  So when I saw that he had a book coming out, naturally I had to read it.\nIn my own defense, all I can say is that I seldom pick fights with anyone.  I merely write what I think and then the fights find me.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-19T11:25:00+00:00"
}