{
  "url": "https://voxday.net/2008/02/17/how-appallingly-sexis/",
  "scraped_at": "2026-01-08T22:12:11.096743",
  "title": "How appallingly sexist",
  "date_display": "February 17, 2008",
  "date_iso": "2008-02-17T16:56:00+00:00",
  "date_from_url": "2008-02-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The OC <a href=\"http://rantingroom.blogspot.com/2008/02/applianc-post-mortem.html\">appears to have been infected</a> by the anti-equalitarian cognivirus inhabiting these parts:</p><blockquote><p>At risk of being sexist, I believe this is why the market is dominated by female-oriented fantasy written by women for women. It’s easier to find a husband (or male-role domestic partner) willing to support the wife while she stays home and writes than it is to find a woman willing to work long hours at a high-paying job while her husband (or boy-toy) stays home and writes….  The economics of the publishing industry are predicated on the assumption that there is an infinite supply of young writers who are willing to sacrifice everything in order to sustain the two dozen or so big names that are at the top of the heap.</p></blockquote><p>To sacrifice everything… or, alternatively, to be in a position that involves the sacrifice of nothing but time.  The latter can be achieved in a variety of ways, of course, but the OC’s reasoning makes a lot more sense if you happen to understand the realities of the book-selling industry. <a href=\"http://business.timesonline.co.uk/tol/business/columnists/article3378297.ece\">This UK report on book sales</a> is why I was so vastly amused by the various accusations of being a “failed” writer even prior to the publication of TIA.  Which book, by the way, continues to do extremely well despite the ongoing failure of the media to even notice its existence.</p><blockquote><p>Last month The Times published statistics from Nielsen Bookscan, which tracks book sales nationwide, showing that, of 200,000 books on sale last year, 190,000 titles sold fewer than 3,500 copies. More devastating still, of 85,933 new books, as many as 58,325 sold an average of just 18 copies. And things aren’t much better over the pond: I read recently that, of the 1.2 million titles sold in the United States in 2004, only 2 per cent sold more than 5,000 copies.</p></blockquote><p>While I haven’t ever put any of the best-seller lists in peril, none of my books except the self-published Wrath has ever sold less than 3,500 books, and two have sold more than ten times that number.  That’s not bad, considering that getting massive breast implants and taking your clothes off is arguably a faster track to a lucrative book deal and a Top Ten bestseller than actually writing anything.</p></div>",
  "content_text": "The OC\nappears to have been infected\nby the anti-equalitarian cognivirus inhabiting these parts:\nAt risk of being sexist, I believe this is why the market is dominated by female-oriented fantasy written by women for women. It’s easier to find a husband (or male-role domestic partner) willing to support the wife while she stays home and writes than it is to find a woman willing to work long hours at a high-paying job while her husband (or boy-toy) stays home and writes….  The economics of the publishing industry are predicated on the assumption that there is an infinite supply of young writers who are willing to sacrifice everything in order to sustain the two dozen or so big names that are at the top of the heap.\nTo sacrifice everything… or, alternatively, to be in a position that involves the sacrifice of nothing but time.  The latter can be achieved in a variety of ways, of course, but the OC’s reasoning makes a lot more sense if you happen to understand the realities of the book-selling industry.\nThis UK report on book sales\nis why I was so vastly amused by the various accusations of being a “failed” writer even prior to the publication of TIA.  Which book, by the way, continues to do extremely well despite the ongoing failure of the media to even notice its existence.\nLast month The Times published statistics from Nielsen Bookscan, which tracks book sales nationwide, showing that, of 200,000 books on sale last year, 190,000 titles sold fewer than 3,500 copies. More devastating still, of 85,933 new books, as many as 58,325 sold an average of just 18 copies. And things aren’t much better over the pond: I read recently that, of the 1.2 million titles sold in the United States in 2004, only 2 per cent sold more than 5,000 copies.\nWhile I haven’t ever put any of the best-seller lists in peril, none of my books except the self-published Wrath has ever sold less than 3,500 books, and two have sold more than ten times that number.  That’s not bad, considering that getting massive breast implants and taking your clothes off is arguably a faster track to a lucrative book deal and a Top Ten bestseller than actually writing anything.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-17T16:56:00+00:00"
}