{
  "url": "https://voxday.net/2008/02/19/how-i-ruined-ocs-career/",
  "scraped_at": "2026-01-08T22:12:29.539881",
  "title": "How I ruined the OC’s career",
  "date_display": "February 19, 2008",
  "date_iso": "2008-02-19T21:07:00+00:00",
  "date_from_url": "2008-02-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Original Cyberpunk <a href=\"http://rantingroom.blogspot.com/2008/02/in-praise-of-brilliant-amateurs.html\">riffs on writing</a>, the publishing industry, and the significance of being the the third angelfish from the left in the chorus line in “Disney’s Finding Nemo On Ice”:</p><blockquote><p>Writing Rebel Moon was fun. Working with Vox was… fascinating. It was far more work than I’d bargained for, and I was deeply disappointed when the publisher saw the final manuscript, said, “It’s too long!,” and made us cut it down to 90,000 words. But on the whole, I enjoyed doing it.</p><p>What I hadn’t reckoned on is that everyone else in the publishing industry would look at that book, see the words, “Based on the Computer Game from Fenris Wolf” on the cover, and say, “Whoops. The Sophomore Curse has struck again. Bethke is reduced to doing books based on computer games.” And thereafter, the assumption was that I’d do anything, because I must have been out of ideas and desperate for money. So I got offers for book projects galore, and all of them for properties that I wouldn’t have touched with a ten-meter electric cattle prod.</p><p>Thank God the deal for Duke Nukem: Balls of Steel, fell through. They really wanted me to sign up to do that one.</p></blockquote><p>There are two important literary differences between the OC and I.  Three, actually.  1.  He is a highly talented writer, whereas I am merely an intelligent individual who uses that intelligence to emulate genuine talent.  The former produces much better results, but it can’t be turned on and off as easily.  2.  The OC is a real writer with a writing career.  I am a dilettante who occasionally scribbles and doesn’t give that much of a damn beyond what happens to be of interest to me at the moment.  Hence my willingness to engage in hostilities with petty publishing principalities like the Tor Witch and her Thin Gay Consort; if I ever want to get published by Tor, I’ll just have to buy it off Holtzbrinck.  3.  The OC would never write the lyrics for a low-budget graphics novel trilogy, while I had a great time doing <a href=\"http://www.cahabaproductions.com/volume_one.htm\">Archangels: The Fall</a>.</p><p>One of the burdens of genuine talent is the feeling that you must do something important with that talent.  Lacking any such talent and knowing that I’m just not cut out to be the next Lewis or Eco, I’m free to write whatever I want, whether that ends up being <i>The Leadership Secrets of Satanas Rex</i>, <i>Principia Posthumanica</i> or a black horror-comedy about a certain educational facility.  Although, since I have a contract for <i>Summa Elvetica</i> on offer, I should probably wrap that up first.</p><p>So while I envy the OC his talent, I’m quite happy with my lot.  It’s rather like being Corin to his Cor… although we are nevertheless in complete accord in thinking that we really should have left the aliens for Rising.  And, of course, <i>blown up the doggone Death Star!</i></p></div>",
  "content_text": "The Original Cyberpunk\nriffs on writing\n, the publishing industry, and the significance of being the the third angelfish from the left in the chorus line in “Disney’s Finding Nemo On Ice”:\nWriting Rebel Moon was fun. Working with Vox was… fascinating. It was far more work than I’d bargained for, and I was deeply disappointed when the publisher saw the final manuscript, said, “It’s too long!,” and made us cut it down to 90,000 words. But on the whole, I enjoyed doing it.\nWhat I hadn’t reckoned on is that everyone else in the publishing industry would look at that book, see the words, “Based on the Computer Game from Fenris Wolf” on the cover, and say, “Whoops. The Sophomore Curse has struck again. Bethke is reduced to doing books based on computer games.” And thereafter, the assumption was that I’d do anything, because I must have been out of ideas and desperate for money. So I got offers for book projects galore, and all of them for properties that I wouldn’t have touched with a ten-meter electric cattle prod.\nThank God the deal for Duke Nukem: Balls of Steel, fell through. They really wanted me to sign up to do that one.\nThere are two important literary differences between the OC and I.  Three, actually.  1.  He is a highly talented writer, whereas I am merely an intelligent individual who uses that intelligence to emulate genuine talent.  The former produces much better results, but it can’t be turned on and off as easily.  2.  The OC is a real writer with a writing career.  I am a dilettante who occasionally scribbles and doesn’t give that much of a damn beyond what happens to be of interest to me at the moment.  Hence my willingness to engage in hostilities with petty publishing principalities like the Tor Witch and her Thin Gay Consort; if I ever want to get published by Tor, I’ll just have to buy it off Holtzbrinck.  3.  The OC would never write the lyrics for a low-budget graphics novel trilogy, while I had a great time doing\nArchangels: The Fall\n.\nOne of the burdens of genuine talent is the feeling that you must do something important with that talent.  Lacking any such talent and knowing that I’m just not cut out to be the next Lewis or Eco, I’m free to write whatever I want, whether that ends up being\nThe Leadership Secrets of Satanas Rex\n,\nPrincipia Posthumanica\nor a black horror-comedy about a certain educational facility.  Although, since I have a contract for\nSumma Elvetica\non offer, I should probably wrap that up first.\nSo while I envy the OC his talent, I’m quite happy with my lot.  It’s rather like being Corin to his Cor… although we are nevertheless in complete accord in thinking that we really should have left the aliens for Rising.  And, of course,\nblown up the doggone Death Star!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-19T21:07:00+00:00"
}