{
  "url": "https://voxday.net/2008/02/26/larry-norman-exits-plane/",
  "scraped_at": "2026-01-08T22:13:21.144998",
  "title": "Larry Norman exits the planet",
  "date_display": "February 26, 2008",
  "date_iso": "2008-02-26T15:42:00+00:00",
  "date_from_url": "2008-02-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I cannot overemphasize how much I loathed Christian Rock music while growing up.  I couldn’t stand Amy Grant, pre- or post- pop career; the same year I bought my first album – AC/DC’s Back in Black – my Dad gave me a Sandi Patti record.  A few years later, he noticed that it was still in the plastic… gee, I wonder why?</p><p>However, there were three more or less Christian artists that I thought were all right.  They didn’t really play my style of music, but I thought U2, Daniel Amos and Randy Stonehill were all listenable.  Larry Norman was too hippy for my tastes, but listening to some of his old songs now, I’m struck by how well-composed some of them were, especially <a href=\"http://www.geocities.com/larrynormanmp3/p05.mp3\">I Wish We’d All Been Ready</a>.  Of course, the man’s got an awful lot to answer for, given that he almost surely inspired that horrificly bad series of best-selling novels with that song.</p><p>Now, I tend to prefer good music that happens to be written by Christians to self-conscious Christian Rock.  I like Evanescence and Creed much better than Jars of Clay or whatever.  But nevertheless, I respect those who elect to dedicate the entirety of their artistic efforts to the purpose of serving Jesus Christ, and Larry Norman was not only the Godfather of Christian Rock, he exemplified the spirit of a man who would serve God only.</p></div>",
  "content_text": "I cannot overemphasize how much I loathed Christian Rock music while growing up.  I couldn’t stand Amy Grant, pre- or post- pop career; the same year I bought my first album – AC/DC’s Back in Black – my Dad gave me a Sandi Patti record.  A few years later, he noticed that it was still in the plastic… gee, I wonder why?\nHowever, there were three more or less Christian artists that I thought were all right.  They didn’t really play my style of music, but I thought U2, Daniel Amos and Randy Stonehill were all listenable.  Larry Norman was too hippy for my tastes, but listening to some of his old songs now, I’m struck by how well-composed some of them were, especially\nI Wish We’d All Been Ready\n.  Of course, the man’s got an awful lot to answer for, given that he almost surely inspired that horrificly bad series of best-selling novels with that song.\nNow, I tend to prefer good music that happens to be written by Christians to self-conscious Christian Rock.  I like Evanescence and Creed much better than Jars of Clay or whatever.  But nevertheless, I respect those who elect to dedicate the entirety of their artistic efforts to the purpose of serving Jesus Christ, and Larry Norman was not only the Godfather of Christian Rock, he exemplified the spirit of a man who would serve God only.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-26T15:42:00+00:00"
}