{
  "url": "https://voxday.net/2008/02/12/mailvox-jews-and-inquisition/",
  "scraped_at": "2026-01-08T22:11:32.902243",
  "title": "Mailvox: Jews and inquisition",
  "date_display": "February 12, 2008",
  "date_iso": "2008-02-12T12:30:00+00:00",
  "date_from_url": "2008-02-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AC take exception and he has a valid point:</p><blockquote><p>In his column, Vox Day misstates the position of the Jewish Encyclopedia regarding the expulsion of the Jews from Spain. He makes the assertion that the forcibly converted Jews of Spain were actively encouraging the Muslim leaders to invade and re-conquer the Iberian Peninsula and that this was the practical reason behind Isabella’s persecution of the them.  He states that “…it was known that some Jews were encouraging Muslim leaders to attempt the recapture of al-Andalus.”</p><p>As evidence for this he cites the 1906 Jewish Encyclopedia which reads…  “It remains a fact that the Jews, either directly or through their coreligionists in Africa, encouraged the Mohammedans to conquer Spain.”</p><p>If you read <a href=\"http://www.jewishencyclopedia.com/view.jsp?artid=992&amp;letter=S&amp;search=encouraged%20the%20Mohammedans%20to%20conquer%20Spain\">the entire entry in the 1906 version of the Jewish Encyclopedia</a> you will find that statement, but Vox Day misattributes it to the period of Ferdinand and Isabella.  It is actually a statement regarding the period of the eighth century, following the particularly brutal persecution of the Jewish Community by the Christian Visigoths.  In fact, if you go on to read the rest of the entry, it directly addresses the question of the motive of the King Ferdinand and Queen Isabella. It reads:</p><p><i>“The reason alleged for this action in the preamble of the edict was the relapse of so many “conversos,” owing to the proximity of unconverted Jews who seduced them from Christianity and kept alive in them the knowledge and practises of Judaism. No other motive is assigned, and there is no doubt that the religious motive was the main one.”</i></p><p>This is a clear case, Vox Day is in error in citing this passage.  The Jewish Encyclopedia in no way attributes the expulsion of the Jews in Spain to a conspiracy by the Conversos and the Muslim powers on the Iberian Peninsula.  In fact, it directly contradicts the point.  Vox Day makes a libelous and slanderous charge against the forcibly converted Jews of Spain.  His implication that this charge is backed up by a respected Jewish historical source document is as despicable as it is untrue.</p></blockquote><p>I did screw up and the quote is certainly misleading, albeit unintentionally, and yet my case remains the same.  I had originally thought that the quote – which I first saw on Wikipedia – applied to the proposed re-capture of Spain and wrote the paragraph accordingly, but upon checking the encyclopedia to verify it later, I learned that it actually applied to the initial Moorish invasion.  Unfortunately, I forgot to go back and fix the sentence.  I’ve already added the corrected sentence to the errata as well as a clarified footnote, both of which should be in the third printing. <i>“[I]t was known that some Jews were encouraging Muslim leaders to attempt the recapture of al-Andalus….  The conquered cities Cordova, Malaga, Granada, Seville, and Toledo were placed in charge of the Jewish inhabitants, who had been armed by the Arabs.”</i> That, along with the clarified sentence, should make it perfectly clear that I’m referring to the actual eighth-century invasion and not the feared fifteenth-century one.</p><p>However, AC is incorrect to rely upon the 1906 Jewish Encyclopedia’s errant insistence upon a solely religious motive behind the expulsions.  Compare its conclusions with those of Henry Kamen, the Jewish historian whose seminal work published in 1997 is my primary source on the subject:</p><p>Jewish Encyclopedia: <i>“The reason alleged for this action in the preamble of the edict was the relapse of so many “conversos,” owing to the proximity of unconverted Jews who seduced them from Christianity and kept alive in them the knowledge and practises of Judaism. No other motive is assigned, and there is no doubt that the religious motive was the main one.”</i></p><p>Henry Kamen, <i>The Spanish Inquisition: A Historical Revision</i>: <b>“No less mistaken is the claim that the crown’s purpose was to achieve unity of faith.  The king and queen were neither personally nor in their politics anti-Jewish.  They had always protected and favored Jews and conversos.  They might be accused of many things, but not of anti-semitism.”</b> p. 26</p><p>Jewish Encyclopedia: <i>“The number of those who were thus driven from Spain has been differently estimated by various observers and historians. Mariana, in his history of Spain, claims as many as 800,000. Isidore Loeb, in a special study of the subject in the “Revue des Etudes Juives” (xiv. 162-183), reduces the actual number of emigrants to 165,000. Bernaldez gives details of about 100,000 who went from Spain to Portugal: 3,000 from Benevente to Braganza; 30,000 from Zamora to Miranda; 35,000 from Ciudad Rodrigo to Villar; 15,000 from Miranda de Alcantara to Marbao; and 10,000 from Badajoz to Yelves. According to the same observer, there were altogether 160,000 Jews in Aragon and Castile. Abraham Zacuto reckons those who went to Portugal at 120,000. Lindo asserts that 1,500 families of Jewish Moriscos from the kingdom of Granada were the first to leave the country….  These estimates must be regarded as a minimum; it is probable that at least 200,000 fled the country, leaving behind them their dead and a large number of relatives who had been forced by circumstances to conceal their religion and to adopt the dominant creed.”</i></p><p>Henry Kamen: <b>“In total, then, the Jews of Spain on the eve of the expulsion of 1492 numbered just over eighty thousand souls, a far cry from the totals offered by their own leaders or by most subsequent scholars….  Between those who converted and those who returned, the total of those who left Spain for ever was relatively small, possibly no more than forty thousand.  The figures place many of the historical issues in perspective.”</b> pp. 23-25</p><p>Now, I admit that Kamen only suggests that the expulsions were “in part motivated by the fear of Jewish collaboration with the Muslim kingdom of Granada, then under attack by Ferdinand’s forces”, and he believes the role of the Inquisition was paramount.  But, as I showed in TIA, Kamen failed to notice the obvious link between the bloody fall of Ferdinand’s city of Otranto to the Turks on August 11, 1480, and his sudden naming of the inquisition’s first inquisitors less than seven weeks later, after two years of total inactivity on that front.  Given Kamen’s convincing demonstration of the absence of both an anti-semitic motive as well any royal profit motive, plus the military motivation that is generally accepted as the reason for the later expulsion of the <i>moriscos</i>, the only logical conclusion is that the primary motivation underlying both the Jewish expulsion and the Spanish Inquisition that followed was the reasonable fear of a second successful Jewish-Muslim alliance against the newly united Christian crowns of Spain, as I described in both TIA and yesterday’s column.</p></div>",
  "content_text": "AC take exception and he has a valid point:\nIn his column, Vox Day misstates the position of the Jewish Encyclopedia regarding the expulsion of the Jews from Spain. He makes the assertion that the forcibly converted Jews of Spain were actively encouraging the Muslim leaders to invade and re-conquer the Iberian Peninsula and that this was the practical reason behind Isabella’s persecution of the them.  He states that “…it was known that some Jews were encouraging Muslim leaders to attempt the recapture of al-Andalus.”\nAs evidence for this he cites the 1906 Jewish Encyclopedia which reads…  “It remains a fact that the Jews, either directly or through their coreligionists in Africa, encouraged the Mohammedans to conquer Spain.”\nIf you read\nthe entire entry in the 1906 version of the Jewish Encyclopedia\nyou will find that statement, but Vox Day misattributes it to the period of Ferdinand and Isabella.  It is actually a statement regarding the period of the eighth century, following the particularly brutal persecution of the Jewish Community by the Christian Visigoths.  In fact, if you go on to read the rest of the entry, it directly addresses the question of the motive of the King Ferdinand and Queen Isabella. It reads:\n“The reason alleged for this action in the preamble of the edict was the relapse of so many “conversos,” owing to the proximity of unconverted Jews who seduced them from Christianity and kept alive in them the knowledge and practises of Judaism. No other motive is assigned, and there is no doubt that the religious motive was the main one.”\nThis is a clear case, Vox Day is in error in citing this passage.  The Jewish Encyclopedia in no way attributes the expulsion of the Jews in Spain to a conspiracy by the Conversos and the Muslim powers on the Iberian Peninsula.  In fact, it directly contradicts the point.  Vox Day makes a libelous and slanderous charge against the forcibly converted Jews of Spain.  His implication that this charge is backed up by a respected Jewish historical source document is as despicable as it is untrue.\nI did screw up and the quote is certainly misleading, albeit unintentionally, and yet my case remains the same.  I had originally thought that the quote – which I first saw on Wikipedia – applied to the proposed re-capture of Spain and wrote the paragraph accordingly, but upon checking the encyclopedia to verify it later, I learned that it actually applied to the initial Moorish invasion.  Unfortunately, I forgot to go back and fix the sentence.  I’ve already added the corrected sentence to the errata as well as a clarified footnote, both of which should be in the third printing.\n“[I]t was known that some Jews were encouraging Muslim leaders to attempt the recapture of al-Andalus….  The conquered cities Cordova, Malaga, Granada, Seville, and Toledo were placed in charge of the Jewish inhabitants, who had been armed by the Arabs.”\nThat, along with the clarified sentence, should make it perfectly clear that I’m referring to the actual eighth-century invasion and not the feared fifteenth-century one.\nHowever, AC is incorrect to rely upon the 1906 Jewish Encyclopedia’s errant insistence upon a solely religious motive behind the expulsions.  Compare its conclusions with those of Henry Kamen, the Jewish historian whose seminal work published in 1997 is my primary source on the subject:\nJewish Encyclopedia:\n“The reason alleged for this action in the preamble of the edict was the relapse of so many “conversos,” owing to the proximity of unconverted Jews who seduced them from Christianity and kept alive in them the knowledge and practises of Judaism. No other motive is assigned, and there is no doubt that the religious motive was the main one.”\nHenry Kamen,\nThe Spanish Inquisition: A Historical Revision\n:\n“No less mistaken is the claim that the crown’s purpose was to achieve unity of faith.  The king and queen were neither personally nor in their politics anti-Jewish.  They had always protected and favored Jews and conversos.  They might be accused of many things, but not of anti-semitism.”\np. 26\nJewish Encyclopedia:\n“The number of those who were thus driven from Spain has been differently estimated by various observers and historians. Mariana, in his history of Spain, claims as many as 800,000. Isidore Loeb, in a special study of the subject in the “Revue des Etudes Juives” (xiv. 162-183), reduces the actual number of emigrants to 165,000. Bernaldez gives details of about 100,000 who went from Spain to Portugal: 3,000 from Benevente to Braganza; 30,000 from Zamora to Miranda; 35,000 from Ciudad Rodrigo to Villar; 15,000 from Miranda de Alcantara to Marbao; and 10,000 from Badajoz to Yelves. According to the same observer, there were altogether 160,000 Jews in Aragon and Castile. Abraham Zacuto reckons those who went to Portugal at 120,000. Lindo asserts that 1,500 families of Jewish Moriscos from the kingdom of Granada were the first to leave the country….  These estimates must be regarded as a minimum; it is probable that at least 200,000 fled the country, leaving behind them their dead and a large number of relatives who had been forced by circumstances to conceal their religion and to adopt the dominant creed.”\nHenry Kamen:\n“In total, then, the Jews of Spain on the eve of the expulsion of 1492 numbered just over eighty thousand souls, a far cry from the totals offered by their own leaders or by most subsequent scholars….  Between those who converted and those who returned, the total of those who left Spain for ever was relatively small, possibly no more than forty thousand.  The figures place many of the historical issues in perspective.”\npp. 23-25\nNow, I admit that Kamen only suggests that the expulsions were “in part motivated by the fear of Jewish collaboration with the Muslim kingdom of Granada, then under attack by Ferdinand’s forces”, and he believes the role of the Inquisition was paramount.  But, as I showed in TIA, Kamen failed to notice the obvious link between the bloody fall of Ferdinand’s city of Otranto to the Turks on August 11, 1480, and his sudden naming of the inquisition’s first inquisitors less than seven weeks later, after two years of total inactivity on that front.  Given Kamen’s convincing demonstration of the absence of both an anti-semitic motive as well any royal profit motive, plus the military motivation that is generally accepted as the reason for the later expulsion of the\nmoriscos\n, the only logical conclusion is that the primary motivation underlying both the Jewish expulsion and the Spanish Inquisition that followed was the reasonable fear of a second successful Jewish-Muslim alliance against the newly united Christian crowns of Spain, as I described in both TIA and yesterday’s column.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-12T12:30:00+00:00"
}