{
  "url": "https://voxday.net/2008/02/22/mailvox-why-we-write/",
  "scraped_at": "2026-01-08T22:12:46.587491",
  "title": "Mailvox: why we write",
  "date_display": "February 22, 2008",
  "date_iso": "2008-02-22T08:21:00+00:00",
  "date_from_url": "2008-02-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An atheist wrote that he couldn’t understand why I would make free copies of <i>The Irrational Atheist</i> available to anyone who wants it.  There are three reasons.  The first is that I don’t need the money.  I can use it, sure, but I don’t actually need it.  I am fortunate to have everything I need and much of what I want.  The second is that I have seen no evidence that pirated or otherwise available ebooks harm book sales, the evidence I have seen indicates that to the extent they have any effect, it is a positive one.  And the third reason is that I wrote the book because I knew that there are many individuals on either side of the religious divide whose thinking has been affected by the fallacious, illogical and downright dishonest arguments put forth by the Four Horsemen of the Bukkakelypse.  Not all of those people can afford to buy books, others simply aren’t inclined to do so, but their need for something like TIA to help them see the demonstrable flaws in the various New Atheist absurdities is distinct from their propensity for book-buying.  Bane, unsurprisingly, understood my purpose best, as he likened the book to the serial killer’s montage. <i>Do you see?</i> In a related vein, MM writes:</p><blockquote><p>I have recently read, then re-read, The Irrational Atheist and found it to be a wonderful resource for nourishing my faith. I realize that you did not intend for your book to be an apologetic but it has certainly served that purpose….  Because I deal with such divergent worldviews on a regular basis, I make every effort to keep myself informed of current trends; so I felt obligated to read the books by Dawkins, Harris, Hitchens, etc.</p><p>Although I found much of the content of each book to be laughable, there were some things in each one (except for Hitchens’ little screed) that left me disturbed and shaken. However, your careful dismantling of each one of the “Horsemen’s” arguments brought me much relief and renewed confidence in my faith.</p><p>So I want to take a moment to thank you for bothering to write The Irrational Atheist. You have done a great service for other believers, and those who are on the fence…  I intend to encourage everyone I know to read it.</p></blockquote><p>To put things in a language that Christopher Hitchens would understand, the New Atheist books are the thesis.  TIA and the other Christian polemics to come are the antithesis.  The synthesis will be a combination of a stronger and more intellectually-hardened Christian faith with an enervated atheism, robbed of its militance and inclined towards a more civilized agnosticism.  How can I be so sure?  Because while Christians have not hesitated to read and respond to the New Atheist attacks on their faith, the New Atheists and their acolytes are running away in fear from the so-called fleas, who are evolving into larger, more confident and more aggressive creatures.</p><p>Dawkins and Hitchens can handle a McGrath, a Bunting, a Sharpton or a pathetic Archbishop of Canturbury.  (Harris, on the other hand, couldn’t even handle a Sullivan or a Hewitt.)  They can barely handle a D’Souza, who isn’t even seriously trying to attack them.  They are simply not capable of standing up to a Day, a Wilson, a Craig or many of the offense-oriented Christian intellectual warriors who are just beginning to make their way towards the field of combat. <i>And they know it!</i> TIA is far from the final word, but like the Duke of Aquitane’s victory at Toulouse, it marks the turning point in what I believe will conclude in a successful intellectual <i>Reconquista</i>.</p><p>And if I may offer some advice to those attempting chapter-by-chapter reviews… it may help to keep in mind that unlike most writers of non-fiction, I am also a novelist.  Not necessarily a particularly good novelist, but a competent one.  So, it’s a mistake to assume that TIA is an entirely segmented work like so much non-fiction happens to be, for example, one who reads only the chapter on Sam Harris will be left under the mistaken assumption that I’ve ignored two of his primary arguments, both of which are examined in great detail in three previous chapters, two of which primarily concern the implicit and the explicit aspects of Harris’s war-related argument.  So, to build an effective case against this book or any other, I recommend first reading the book through in its entirety, taking the occasional note about whatever happens to leap out at you along the way, then going back and going through it with a fine-toothed comb chapter by chapter.</p></div>",
  "content_text": "An atheist wrote that he couldn’t understand why I would make free copies of\nThe Irrational Atheist\navailable to anyone who wants it.  There are three reasons.  The first is that I don’t need the money.  I can use it, sure, but I don’t actually need it.  I am fortunate to have everything I need and much of what I want.  The second is that I have seen no evidence that pirated or otherwise available ebooks harm book sales, the evidence I have seen indicates that to the extent they have any effect, it is a positive one.  And the third reason is that I wrote the book because I knew that there are many individuals on either side of the religious divide whose thinking has been affected by the fallacious, illogical and downright dishonest arguments put forth by the Four Horsemen of the Bukkakelypse.  Not all of those people can afford to buy books, others simply aren’t inclined to do so, but their need for something like TIA to help them see the demonstrable flaws in the various New Atheist absurdities is distinct from their propensity for book-buying.  Bane, unsurprisingly, understood my purpose best, as he likened the book to the serial killer’s montage.\nDo you see?\nIn a related vein, MM writes:\nI have recently read, then re-read, The Irrational Atheist and found it to be a wonderful resource for nourishing my faith. I realize that you did not intend for your book to be an apologetic but it has certainly served that purpose….  Because I deal with such divergent worldviews on a regular basis, I make every effort to keep myself informed of current trends; so I felt obligated to read the books by Dawkins, Harris, Hitchens, etc.\nAlthough I found much of the content of each book to be laughable, there were some things in each one (except for Hitchens’ little screed) that left me disturbed and shaken. However, your careful dismantling of each one of the “Horsemen’s” arguments brought me much relief and renewed confidence in my faith.\nSo I want to take a moment to thank you for bothering to write The Irrational Atheist. You have done a great service for other believers, and those who are on the fence…  I intend to encourage everyone I know to read it.\nTo put things in a language that Christopher Hitchens would understand, the New Atheist books are the thesis.  TIA and the other Christian polemics to come are the antithesis.  The synthesis will be a combination of a stronger and more intellectually-hardened Christian faith with an enervated atheism, robbed of its militance and inclined towards a more civilized agnosticism.  How can I be so sure?  Because while Christians have not hesitated to read and respond to the New Atheist attacks on their faith, the New Atheists and their acolytes are running away in fear from the so-called fleas, who are evolving into larger, more confident and more aggressive creatures.\nDawkins and Hitchens can handle a McGrath, a Bunting, a Sharpton or a pathetic Archbishop of Canturbury.  (Harris, on the other hand, couldn’t even handle a Sullivan or a Hewitt.)  They can barely handle a D’Souza, who isn’t even seriously trying to attack them.  They are simply not capable of standing up to a Day, a Wilson, a Craig or many of the offense-oriented Christian intellectual warriors who are just beginning to make their way towards the field of combat.\nAnd they know it!\nTIA is far from the final word, but like the Duke of Aquitane’s victory at Toulouse, it marks the turning point in what I believe will conclude in a successful intellectual\nReconquista\n.\nAnd if I may offer some advice to those attempting chapter-by-chapter reviews… it may help to keep in mind that unlike most writers of non-fiction, I am also a novelist.  Not necessarily a particularly good novelist, but a competent one.  So, it’s a mistake to assume that TIA is an entirely segmented work like so much non-fiction happens to be, for example, one who reads only the chapter on Sam Harris will be left under the mistaken assumption that I’ve ignored two of his primary arguments, both of which are examined in great detail in three previous chapters, two of which primarily concern the implicit and the explicit aspects of Harris’s war-related argument.  So, to build an effective case against this book or any other, I recommend first reading the book through in its entirety, taking the occasional note about whatever happens to leap out at you along the way, then going back and going through it with a fine-toothed comb chapter by chapter.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-22T08:21:00+00:00"
}