{
  "url": "https://voxday.net/2008/02/08/more-atheist-reviews-of-tia/",
  "scraped_at": "2026-01-08T22:11:03.820712",
  "title": "More atheist reviews of TIA",
  "date_display": "February 8, 2008",
  "date_iso": "2008-02-08T10:05:00+00:00",
  "date_from_url": "2008-02-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dominic Saltarelli will no doubt enrage the howling monkeys over at Dawkins.Net, writing: <i>“this is in fact a good book. Entertaining, insightful, and well researched.”</i> However, he also found it to be <i>“Just as overhyped as the books it attacks”</i>.  I’ve posted <a href=\"http://irrationalatheist.com/forum/viewtopic.php?p=122#122\">both his Amazon review and my reply to it</a> in the TIA forums, perhaps he will stop by here sometime to discuss them.</p><p>Ken Casner, on the other hand, continues his quixotic attempt to completely ignore 99.8 percent of the book in order to blatantly lie about the non-existence of the specific and detailed criticisms of the arguments of Sam Harris, Richard Dawkins, Christopher Hitchens, Michel Onfray and Daniel Dennett contained within it.  And as I’ve <a href=\"http://irrationalatheist.com/forum/viewtopic.php?t=36\">shown in this response to his third attempt to defend his indefensible review</a>, I’m not the one misrepresenting Sam Harris’s views, Casner is wildly misrepresenting them in order to make a foolish attempt at a classic Fighting Withdrawal.</p><p>Casner’s argument is an almost flawless example of a poorly chosen Fighting Withdrawal, because the point to which he withdraws renders Harris’s argument completely irrelevant in every context.  If Harris is only talking about killing people in legitimate self-defense, then what does his argument have to do with belief, faith or any other non-material concept?  If there is material action of one sort or another to indicate a threat justifying a lethal response, then there’s no need for the subject of belief or faith to even enter into the conversation.  Moreover, my position is supported by an email I received from Sam Harris last November confirming that it is in fact immaterial <b>belief</b> that is relevant to his argument, not any subsequent material actions inspired by that belief.  I have no problem with self-defense, I am criticizing pre-emptive lethal self defense based on one individual’s beliefs about another individual’s future actions.  It can only lead to a destructive circular logic, and as I’ve noted in the past, one might very reasonably justify the murder of Sam Harris through the application of his own argument here.</p><p>Jemison Thorsby is not an atheist, unsurprisingly, <a href=\"http://irrationalatheist.com/forum/viewtopic.php?t=50\">he liked the book rather better</a>.  He writes: <i>“Vox chose to fight on atheists’ favorite grounds, and he does so in a way that shows the terrain–reason–actually favors the faithful, not the faithless.”</i></p><p>As for the German blogger <a href=\"http://irrationalatheist.com/forum/viewtopic.php?p=128#128\">Kamenin’s review</a>, it’s clear that he didn’t read the chapter entitled “The Case Against Science” very closely, nor was he capable of grasping the logic of what he did read.  It’s actually apparent that he must not have read very much of the book, since he reaches the mistaken conclusion that it’s just another attack on atheism via Hitler and Stalin.  I’ll have a more detailed response to his review later.</p></div>",
  "content_text": "Dominic Saltarelli will no doubt enrage the howling monkeys over at Dawkins.Net, writing:\n“this is in fact a good book. Entertaining, insightful, and well researched.”\nHowever, he also found it to be\n“Just as overhyped as the books it attacks”\n.  I’ve posted\nboth his Amazon review and my reply to it\nin the TIA forums, perhaps he will stop by here sometime to discuss them.\nKen Casner, on the other hand, continues his quixotic attempt to completely ignore 99.8 percent of the book in order to blatantly lie about the non-existence of the specific and detailed criticisms of the arguments of Sam Harris, Richard Dawkins, Christopher Hitchens, Michel Onfray and Daniel Dennett contained within it.  And as I’ve\nshown in this response to his third attempt to defend his indefensible review\n, I’m not the one misrepresenting Sam Harris’s views, Casner is wildly misrepresenting them in order to make a foolish attempt at a classic Fighting Withdrawal.\nCasner’s argument is an almost flawless example of a poorly chosen Fighting Withdrawal, because the point to which he withdraws renders Harris’s argument completely irrelevant in every context.  If Harris is only talking about killing people in legitimate self-defense, then what does his argument have to do with belief, faith or any other non-material concept?  If there is material action of one sort or another to indicate a threat justifying a lethal response, then there’s no need for the subject of belief or faith to even enter into the conversation.  Moreover, my position is supported by an email I received from Sam Harris last November confirming that it is in fact immaterial\nbelief\nthat is relevant to his argument, not any subsequent material actions inspired by that belief.  I have no problem with self-defense, I am criticizing pre-emptive lethal self defense based on one individual’s beliefs about another individual’s future actions.  It can only lead to a destructive circular logic, and as I’ve noted in the past, one might very reasonably justify the murder of Sam Harris through the application of his own argument here.\nJemison Thorsby is not an atheist, unsurprisingly,\nhe liked the book rather better\n.  He writes:\n“Vox chose to fight on atheists’ favorite grounds, and he does so in a way that shows the terrain–reason–actually favors the faithful, not the faithless.”\nAs for the German blogger\nKamenin’s review\n, it’s clear that he didn’t read the chapter entitled “The Case Against Science” very closely, nor was he capable of grasping the logic of what he did read.  It’s actually apparent that he must not have read very much of the book, since he reaches the mistaken conclusion that it’s just another attack on atheism via Hitler and Stalin.  I’ll have a more detailed response to his review later.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-08T10:05:00+00:00"
}