{
  "url": "https://voxday.net/2008/02/20/narrative-gets-exciting/",
  "scraped_at": "2026-01-08T22:12:31.378956",
  "title": "The Narrative gets exciting",
  "date_display": "February 20, 2008",
  "date_iso": "2008-02-20T11:42:00+00:00",
  "date_from_url": "2008-02-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>Barack Obama <a href=\"http://www.breitbart.com/article.php?id=D8UTUQGG0&amp;show_article=1\">cruised past a fading Hillary Rodham Clinton</a> in the Wisconsin primary and Hawaii caucuses Tuesday night, gaining the upper hand in a Democratic presidential race for the ages.  The twin triumphs made 10 straight for Obama, and left the former first lady in desperate need of a comeback in a race she long commanded as front-runner.</p></blockquote><p>What an incredible story it would be if Hillary Rodham-Clinton, summoning hitherto unknown strength from that vast pool of goddessness deep within the core of her menopausal feminine essence, should fight back from the face of certain defeat and claim the Democratic nomination.  Why, it would be a historic victory for women everywhere!  And it would be all the proof she would ever need to show that she was tough enough for the job.</p><p>In case that doesn’t answer your question, yes, I am as confident that the the Lizard Queen will be Bush’s successor as I have been since I first declared that in 2003.  It doesn’t look very likely at the moment, to be sure, but then it didn’t look very likely five years ago either.  Since I merely observe the horse race and the Narrative rather instead of placing much significance upon them, I am untroubled by its various vicissitudes.</p></div>",
  "content_text": "Barack Obama\ncruised past a fading Hillary Rodham Clinton\nin the Wisconsin primary and Hawaii caucuses Tuesday night, gaining the upper hand in a Democratic presidential race for the ages.  The twin triumphs made 10 straight for Obama, and left the former first lady in desperate need of a comeback in a race she long commanded as front-runner.\nWhat an incredible story it would be if Hillary Rodham-Clinton, summoning hitherto unknown strength from that vast pool of goddessness deep within the core of her menopausal feminine essence, should fight back from the face of certain defeat and claim the Democratic nomination.  Why, it would be a historic victory for women everywhere!  And it would be all the proof she would ever need to show that she was tough enough for the job.\nIn case that doesn’t answer your question, yes, I am as confident that the the Lizard Queen will be Bush’s successor as I have been since I first declared that in 2003.  It doesn’t look very likely at the moment, to be sure, but then it didn’t look very likely five years ago either.  Since I merely observe the horse race and the Narrative rather instead of placing much significance upon them, I am untroubled by its various vicissitudes.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-20T11:42:00+00:00"
}