{
  "url": "https://voxday.net/2008/02/27/pushing-placebos/",
  "scraped_at": "2026-01-08T22:13:33.931163",
  "title": "The pushers strike back",
  "date_display": "February 27, 2008",
  "date_iso": "2008-02-27T22:28:00+00:00",
  "date_from_url": "2008-02-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p><a href=\"http://www.breitbart.com/article.php?id=080227102745.p467o58k&amp;show_article=1\">Doctors urged patients to keep taking their anti-depressants</a> Wednesday despite a scientific study showing that the drugs are little more effective than placebos in treating depression.  Doctors are warning their patients not to suddenly stop taking the medication prescribed to them….  Louis Appleby, national clinical director for Mental Health, told the Press Association: “New <s>exculpatory whitewashing</s><i>guidance</i> on the treatment of depression will be issued by Nice [the National Institute for Health and Clinical Excellence] later in the year, and this new study will be <s>buried under technical jargon</s><i>considered</i> as the <s>excuses are</s><i>guidance is</i> prepared.</p></blockquote><p>In other news, 10 out of 10 doctors surveyed indicated that they would like to continue to be compensated in return for the service they provide in waving a dead chicken over their patients.</p></div>",
  "content_text": "Doctors urged patients to keep taking their anti-depressants\nWednesday despite a scientific study showing that the drugs are little more effective than placebos in treating depression.  Doctors are warning their patients not to suddenly stop taking the medication prescribed to them….  Louis Appleby, national clinical director for Mental Health, told the Press Association: “New\nexculpatory whitewashing\nguidance\non the treatment of depression will be issued by Nice [the National Institute for Health and Clinical Excellence] later in the year, and this new study will be\nburied under technical jargon\nconsidered\nas the\nexcuses are\nguidance is\nprepared.\nIn other news, 10 out of 10 doctors surveyed indicated that they would like to continue to be compensated in return for the service they provide in waving a dead chicken over their patients.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-27T22:28:00+00:00"
}