{
  "url": "https://voxday.net/2008/02/27/requiscat-in-pace-william-f-buckley-jr/",
  "scraped_at": "2026-01-08T22:13:32.091990",
  "title": "The last Republican giant",
  "date_display": "February 27, 2008",
  "date_iso": "2008-02-27T17:46:00+00:00",
  "date_from_url": "2008-02-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Requiescat in Pace, William F. Buckley, Jr.  I never met the man, never once spoke with him and was never particularly influenced by him.  But believe it or not, when I was signed to a national syndication deal by Universal Press Syndicate, it was with the idea that I was going to be an eventual long-term replacement for WFB, whom they had syndicated for donkey’s years.  They liked the fact that I was a forthright right-winger and that my columns were more intellectually demanding than the norm, unfortunately, the editors of the nation’s newspapers very much disagreed.  But I always felt a sense of personal appreciation for WFB Jr, as I never would have been given that opportunity to fail so spectacularly were it not for him blazing a trail with his labyrinthine sentence structures, heteroclitic vocabularies and the occasional foreign <i>bon mot</i> thrown in for good measure.</p><p>I read his National Review all through college and still retain an affinity for it even though I regard a good fifty percent of the writers – and most of the current editors – as traitors to the cause of thwarting history.  Love him or loathe him, Buckley was a unique individual and his absence will leave a hole in the American political scene for some time to come.</p><p>Update – Ramesh Ponnuru quotes Republican House Leader John Boehner:</p><blockquote><p> As long as America honors the ideals of our Founding Fathers – free speech, freedom of religion, and limited, Constitutional government – his legacy will be cherished.”</p></blockquote><p>An ironic elegy, considering the source.  As far as the Republican leadership is concerned, Buckley’s legacy should rival the long shadow cast by Nick Saban in Miami.</p></div>",
  "content_text": "Requiescat in Pace, William F. Buckley, Jr.  I never met the man, never once spoke with him and was never particularly influenced by him.  But believe it or not, when I was signed to a national syndication deal by Universal Press Syndicate, it was with the idea that I was going to be an eventual long-term replacement for WFB, whom they had syndicated for donkey’s years.  They liked the fact that I was a forthright right-winger and that my columns were more intellectually demanding than the norm, unfortunately, the editors of the nation’s newspapers very much disagreed.  But I always felt a sense of personal appreciation for WFB Jr, as I never would have been given that opportunity to fail so spectacularly were it not for him blazing a trail with his labyrinthine sentence structures, heteroclitic vocabularies and the occasional foreign\nbon mot\nthrown in for good measure.\nI read his National Review all through college and still retain an affinity for it even though I regard a good fifty percent of the writers – and most of the current editors – as traitors to the cause of thwarting history.  Love him or loathe him, Buckley was a unique individual and his absence will leave a hole in the American political scene for some time to come.\nUpdate – Ramesh Ponnuru quotes Republican House Leader John Boehner:\nAs long as America honors the ideals of our Founding Fathers – free speech, freedom of religion, and limited, Constitutional government – his legacy will be cherished.”\nAn ironic elegy, considering the source.  As far as the Republican leadership is concerned, Buckley’s legacy should rival the long shadow cast by Nick Saban in Miami.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-27T17:46:00+00:00"
}