{
  "url": "https://voxday.net/2008/02/06/ruled-by-fear-and-fury/",
  "scraped_at": "2026-01-08T22:10:50.950732",
  "title": "Ruled by fear and fury",
  "date_display": "February 6, 2008",
  "date_iso": "2008-02-06T19:51:00+00:00",
  "date_from_url": "2008-02-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Christians often wonder why atheists appear to be so angry.  This mystifies some cheerful atheists, while the mere observation of the obvious sends others into a rage. <a href=\"http://frum.nationalreview.com/post/?q=MmE1MzIzN2FiYWQ3MDlmMWFmN2Y5YjRkODA5YWY1Yjk=\">David Frum’s report on David Rieff’s new book</a> about the death of his mother suggests a partial explanation for the constant state of fury that afflicts some atheists as well as suggests one explanation for the superior state of theist mental and physical health:</p><blockquote><p>For Rieff (as for Sontag) death is catastrophe, ruin, destruction, the annihilation of a living, thinking, conscious being. It is murder for the dying one; robbery for those from whom she is stolen; unmitigated loss and absolute catastrophe; made somehow worse (if there can be worse) by the protracted intrusion and humilations of the medical process.  There is not a trace of acceptance in this book. Neither Sontag nor Rieff makes peace with what happens to her, what will happen to him, what must happen to us all. They remain to the end outraged by the horror of what they are to suffer….</p><p>The traditionally religious will be disturbed by Rieff’s utter certainty that the life of the mind ceases with the life of the body.</p></blockquote><p>But why would anyone be in the least bit disturbed by his certainty or lack of it?  One can feel sorry for his loss, even sorrier for the prison he has made for himself of his own consciousness, but disturbed?  One need not subscribe to my Game Designer theory of God to anticipate finding out what comes next, even if death is naught but an endless nap, there’s not much that’s more comfortable than a really deep and dreamless sleep.</p><p>The downside of atheist anger is that it is the driving force behind earthly utopianism, it is the source of the moral urgency that underlies the more dangerous forms of secular humanism.  And I do not need to remind anyone who has read TIA that attempting to build paradise on Earth, regardless of the creed that serves as the foundation of that would-be paradise, has proven to be Mankind’s fastest route to Hell.</p></div>",
  "content_text": "Christians often wonder why atheists appear to be so angry.  This mystifies some cheerful atheists, while the mere observation of the obvious sends others into a rage.\nDavid Frum’s report on David Rieff’s new book\nabout the death of his mother suggests a partial explanation for the constant state of fury that afflicts some atheists as well as suggests one explanation for the superior state of theist mental and physical health:\nFor Rieff (as for Sontag) death is catastrophe, ruin, destruction, the annihilation of a living, thinking, conscious being. It is murder for the dying one; robbery for those from whom she is stolen; unmitigated loss and absolute catastrophe; made somehow worse (if there can be worse) by the protracted intrusion and humilations of the medical process.  There is not a trace of acceptance in this book. Neither Sontag nor Rieff makes peace with what happens to her, what will happen to him, what must happen to us all. They remain to the end outraged by the horror of what they are to suffer….\nThe traditionally religious will be disturbed by Rieff’s utter certainty that the life of the mind ceases with the life of the body.\nBut why would anyone be in the least bit disturbed by his certainty or lack of it?  One can feel sorry for his loss, even sorrier for the prison he has made for himself of his own consciousness, but disturbed?  One need not subscribe to my Game Designer theory of God to anticipate finding out what comes next, even if death is naught but an endless nap, there’s not much that’s more comfortable than a really deep and dreamless sleep.\nThe downside of atheist anger is that it is the driving force behind earthly utopianism, it is the source of the moral urgency that underlies the more dangerous forms of secular humanism.  And I do not need to remind anyone who has read TIA that attempting to build paradise on Earth, regardless of the creed that serves as the foundation of that would-be paradise, has proven to be Mankind’s fastest route to Hell.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-06T19:51:00+00:00"
}