{
  "url": "https://voxday.net/2008/02/18/seven-questions-for-sam-harris/",
  "scraped_at": "2026-01-08T22:12:18.544961",
  "title": "Seven questions for Sam Harris",
  "date_display": "February 18, 2008",
  "date_iso": "2008-02-18T14:24:00+00:00",
  "date_from_url": "2008-02-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Having written to Mr. Harris and later receiving a clarification of one of his controversial positions, I wrote him another email with a few more questions this time.  It’s probably unlikely that he will elect to address them, but unlike Richard Dawkins, there is at least a non-zero possibility that he will choose to do so:</p><p><i>1.  When you wrote the Red State/Blue State argument quoted by Richard Dawkins in The God Delusion, were you aware that the electoral data for the various counties in which the various cities mentioned are located was available?  If you were not, are you willing to concede that the more accurate county data supports a conclusion that is the precise opposite of the one you reached in <i>Letter to a Christian Nation</i>?</i></p><p>2.  Are you willing to admit that religion is not the explicit cause of more than 90 percent of the war throughout recorded human history?  Are you also willing to admit that religious faith is not a significant aspect of military strategy, tactics, recruitment or discipline?</p><p>3.  Were you aware that the professional historians’ estimated bodycount of the most deadly Inquisition, the Spanish, was less than 3,000 deaths over 345 years when you described the inquisition as one of the two “darkest episodes in the history of faith”?</p><p>4.  How does your long-term vision of world government differ from Bertrand Russell’s?  Why are you opposed to American national sovereignty?</p><p>5.  Are there other forms of “unjustified belief” or “an absence of rationality” than religious faith?</p><p>6.  Did you forget that you had defined Buddhism as not being a religion of faith when you compared the societal health of the U.S.A. to that of “the least religious states”?</p><p>7.  If the world is genuinely imperiled by nuclear weaponry in the hands of religious individuals, isn’t it true that science is as much to blame as religion?  And if the peril is both imminent and genuine, wouldn’t it be more practical and far less costly in terms of human life to end science rather than religion?</p><p>I have many more questions, of course, but too many of them are the damned-if-you-do, damned-if-you-don’t variety better reserved for debate and I think it’s always best to offer an opponent the chance to clarify or concede a point rather than always trying to pin them to the wall.</p></div>",
  "content_text": "Having written to Mr. Harris and later receiving a clarification of one of his controversial positions, I wrote him another email with a few more questions this time.  It’s probably unlikely that he will elect to address them, but unlike Richard Dawkins, there is at least a non-zero possibility that he will choose to do so:\n1.  When you wrote the Red State/Blue State argument quoted by Richard Dawkins in The God Delusion, were you aware that the electoral data for the various counties in which the various cities mentioned are located was available?  If you were not, are you willing to concede that the more accurate county data supports a conclusion that is the precise opposite of the one you reached in\nLetter to a Christian Nation\n?\n2.  Are you willing to admit that religion is not the explicit cause of more than 90 percent of the war throughout recorded human history?  Are you also willing to admit that religious faith is not a significant aspect of military strategy, tactics, recruitment or discipline?\n3.  Were you aware that the professional historians’ estimated bodycount of the most deadly Inquisition, the Spanish, was less than 3,000 deaths over 345 years when you described the inquisition as one of the two “darkest episodes in the history of faith”?\n4.  How does your long-term vision of world government differ from Bertrand Russell’s?  Why are you opposed to American national sovereignty?\n5.  Are there other forms of “unjustified belief” or “an absence of rationality” than religious faith?\n6.  Did you forget that you had defined Buddhism as not being a religion of faith when you compared the societal health of the U.S.A. to that of “the least religious states”?\n7.  If the world is genuinely imperiled by nuclear weaponry in the hands of religious individuals, isn’t it true that science is as much to blame as religion?  And if the peril is both imminent and genuine, wouldn’t it be more practical and far less costly in terms of human life to end science rather than religion?\nI have many more questions, of course, but too many of them are the damned-if-you-do, damned-if-you-don’t variety better reserved for debate and I think it’s always best to offer an opponent the chance to clarify or concede a point rather than always trying to pin them to the wall.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-18T14:24:00+00:00"
}