{
  "url": "https://voxday.net/2008/02/01/shaking-ebook-tree/",
  "scraped_at": "2026-01-08T22:10:13.840720",
  "title": "Shaking the ebook tree",
  "date_display": "February 1, 2008",
  "date_iso": "2008-02-01T21:48:00+00:00",
  "date_from_url": "2008-02-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Everything’s not quite as slick and sophisticated as we would have liked, but both Paid and Free ebook versions of <i>The Irrational Atheist</i> are now available from <a href=\"http://irrationalatheist.com/downloads.html\">the TIA downloads page</a>.  You can also access the downloads page from the link underneath the picture of the book cover on the right sidebar.</p><p>The PDF is the cleanest version; the LIT and PDB versions are functional but will require some polishing over the next few days thanks to the copious footnotes.  I appreciate the work done on those versions by Adam and SWW, who jumped in on short notice and made it possible for us to have them available now.  If you’d like to create another version in whatever idiosyncratic format you happen to prefer, you can do so from the DOC file; please send it to me when it’s done and we’ll add it to the page.  If you run into any technical issues with the downloads or whatever – you know there are bound to be some – let me know.</p><p>There is also <a href=\"http://irrationalatheist.com/forum/\">a new TIA forum</a> for reviews and TIA-related discussions. If anyone is interested in volunteering to moderate them, please let me know here.  There’s bound to be a need for it.  Thanks very much to Digital Cowboy, who managed to get this together on time despite having a few curveballs thrown at him over the last few weeks.</p></div>",
  "content_text": "Everything’s not quite as slick and sophisticated as we would have liked, but both Paid and Free ebook versions of\nThe Irrational Atheist\nare now available from\nthe TIA downloads page\n.  You can also access the downloads page from the link underneath the picture of the book cover on the right sidebar.\nThe PDF is the cleanest version; the LIT and PDB versions are functional but will require some polishing over the next few days thanks to the copious footnotes.  I appreciate the work done on those versions by Adam and SWW, who jumped in on short notice and made it possible for us to have them available now.  If you’d like to create another version in whatever idiosyncratic format you happen to prefer, you can do so from the DOC file; please send it to me when it’s done and we’ll add it to the page.  If you run into any technical issues with the downloads or whatever – you know there are bound to be some – let me know.\nThere is also\na new TIA forum\nfor reviews and TIA-related discussions. If anyone is interested in volunteering to moderate them, please let me know here.  There’s bound to be a need for it.  Thanks very much to Digital Cowboy, who managed to get this together on time despite having a few curveballs thrown at him over the last few weeks.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-01T21:48:00+00:00"
}