{
  "url": "https://voxday.net/2008/02/18/shooter-sure-love-their-nietszche/",
  "scraped_at": "2026-01-08T22:12:16.731293",
  "title": "Shooter sure love their Nietszche",
  "date_display": "February 18, 2008",
  "date_iso": "2008-02-18T10:08:00+00:00",
  "date_from_url": "2008-02-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t know if the NIU killer was an atheist or not, but let’s face it, despite the statistical unlikelihood, it wouldn’t be any more surprising than the fact that he wore black or <a href=\"http://www.cnn.com/2008/US/02/17/shooter.girlfriend/index.html#cnnSTCText\">just happened to be on anti-depressants</a>:</p><blockquote><p>Since Thursday, Baty said authorities have intercepted several packages Kazmierczak sent her, including several items such as: the book “The Antichrist” by Friedrich Nietszche; a textbook for her class about serial killers; a package with a gun holster and bullets; a new cell phone that she had told him she wanted and about $100 in cash.</p></blockquote><p>Godless secular culture is not only suicide for the society, it’s all too often literal suicide for the individual.  It’s interesting how so many of these would-be <i>Uebermensch</i> can’t figure out anything more intelligent or creative than simply attacking the lesser beings that surround them.</p></div>",
  "content_text": "I don’t know if the NIU killer was an atheist or not, but let’s face it, despite the statistical unlikelihood, it wouldn’t be any more surprising than the fact that he wore black or\njust happened to be on anti-depressants\n:\nSince Thursday, Baty said authorities have intercepted several packages Kazmierczak sent her, including several items such as: the book “The Antichrist” by Friedrich Nietszche; a textbook for her class about serial killers; a package with a gun holster and bullets; a new cell phone that she had told him she wanted and about $100 in cash.\nGodless secular culture is not only suicide for the society, it’s all too often literal suicide for the individual.  It’s interesting how so many of these would-be\nUebermensch\ncan’t figure out anything more intelligent or creative than simply attacking the lesser beings that surround them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-18T10:08:00+00:00"
}