{
  "url": "https://voxday.net/2008/02/13/surprisingly-positive-tia-review/",
  "scraped_at": "2026-01-08T22:11:40.615155",
  "title": "A surprisingly positive TIA review",
  "date_display": "February 13, 2008",
  "date_iso": "2008-02-13T09:01:00+00:00",
  "date_from_url": "2008-02-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://irrationalatheist.com/forum/viewtopic.php?t=70\">From an atheist</a>… or maybe an agnostic of sorts.  I have to admit, I’m not exactly sure when The Great Agnostic <a href=\"http://www.atheists.org/Atheism/roots/ingersoll/\">became classified as an atheist</a> either:</p><blockquote><p>The Irrational Atheist is a succinct rebuttal to what I felt were apparently bad arguments from little tomes of regurgitated atheist liturgy. None of the refuted authors offer the power of voice or intellect that past freethinkers have.</p><p>This is the sort of book I have been waiting for since first reading <i>The God Delusion</i>, and moving on to <i>Letter</i> and <i>god is not Great</i>. The book itself is not surprising, but the source from which it comes is a surprise. I expected the heretical community to be up in arms against a group of best selling authors who in my opinion have done more to make unbelievers look like assholes than to give atheism any new ideas, or even a refreshing take on old ones. Instead of the likes of a more secular author, a Jennifer Hecht or Susan Jacoby, it has taken a libertarian Christian to point to the elephant in the room. It was about time someone did.</p></blockquote><p>I have to confess, I didn’t really understand what the publisher was getting at when they wrote something about the book being a surprise… from my perspective, it seemed obvious that a Christian would be opposed to the New Atheism and marshal arguments against it.  So, where’s the surprise?  Now, I think I understand that from their entirely secular point of view, they truly didn’t believe that a God-addled theist would be capable of looking at the situation from a purely logical, scientific and historical perspective.  Which I’d like to say is spectacularly unfair, except that from what I’ve seen post-publication, it’s at the very least true as often as it is not.</p><p>On a tangential note, this is the root of my dislike for theologians and scientists alike.  Both groups are intrinsicly gnostic and insist on communicating with outsiders solely in their own intentionally obscure, jargon-ridden language, then complain when they are inevitably misunderstood.  I see this behavior as being not only pointless and self-defeating, but inexcusably obnoxious.</p></div>",
  "content_text": "From an atheist\n… or maybe an agnostic of sorts.  I have to admit, I’m not exactly sure when The Great Agnostic\nbecame classified as an atheist\neither:\nThe Irrational Atheist is a succinct rebuttal to what I felt were apparently bad arguments from little tomes of regurgitated atheist liturgy. None of the refuted authors offer the power of voice or intellect that past freethinkers have.\nThis is the sort of book I have been waiting for since first reading\nThe God Delusion\n, and moving on to\nLetter\nand\ngod is not Great\n. The book itself is not surprising, but the source from which it comes is a surprise. I expected the heretical community to be up in arms against a group of best selling authors who in my opinion have done more to make unbelievers look like assholes than to give atheism any new ideas, or even a refreshing take on old ones. Instead of the likes of a more secular author, a Jennifer Hecht or Susan Jacoby, it has taken a libertarian Christian to point to the elephant in the room. It was about time someone did.\nI have to confess, I didn’t really understand what the publisher was getting at when they wrote something about the book being a surprise… from my perspective, it seemed obvious that a Christian would be opposed to the New Atheism and marshal arguments against it.  So, where’s the surprise?  Now, I think I understand that from their entirely secular point of view, they truly didn’t believe that a God-addled theist would be capable of looking at the situation from a purely logical, scientific and historical perspective.  Which I’d like to say is spectacularly unfair, except that from what I’ve seen post-publication, it’s at the very least true as often as it is not.\nOn a tangential note, this is the root of my dislike for theologians and scientists alike.  Both groups are intrinsicly gnostic and insist on communicating with outsiders solely in their own intentionally obscure, jargon-ridden language, then complain when they are inevitably misunderstood.  I see this behavior as being not only pointless and self-defeating, but inexcusably obnoxious.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-13T09:01:00+00:00"
}