{
  "url": "https://voxday.net/2008/02/09/welcome-to-mavericks-club/",
  "scraped_at": "2026-01-08T22:11:10.807278",
  "title": "Welcome to the maverick’s club",
  "date_display": "February 9, 2008",
  "date_iso": "2008-02-09T10:39:00+00:00",
  "date_from_url": "2008-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dominic Santerelli is still <a href=\"http://irrationalatheist.com/forum/viewtopic.php?t=49\">reeling in bitter disbelief</a>:</p><blockquote><p>Essentially, the point I’m making is that if atheists and theists see each other as “enemies”, the argument is over before it begins. The first step then, that I see, is to stamp out the high profile outspoken loyalists (people who will not change their minds for any reason) under whose banners the intellectually lazy flock to, leaving behind only those of high profile who are actually willing to listen to the other side.</p><p>Which is why I set out to crush Vox Day. I was fed the impression that this was just another evangelical loyalist, so I give a call to arms over at RD.net, a place which I assumed was populated by a cadre of intellectual mavericks (being one myself).</p><p>Oh, the irony.</p></blockquote><p>As Dominic now understands, I truly don’t see him as an enemy, which is why I put the word in scare quotes.  Indeed, the very reason that most Christians refer to “militant atheists” is not to tar all atheists with militancy, but rather to distinguish between those trapped in the narrative and intent on attacking Christianity and other religions, and those who are simply people that happen to be atheists.  The adjective MODIFIES the noun, as I find myself having to point out disturbingly often on a wide range of otherwise unrelated subjects.</p><p>I quite like the concept of escaping the narrative Dominic puts forth in <a href=\"http://www.richarddawkins.net/forum/viewtopic.php?f=6&amp;t=36175\">his extended review on Dawkins.net</a>, as I think it achieving intellectual escape velocity something that atheists like him, and Daniel Dennett, and perhaps even the occasional Christian may be capable.  But again, I feel the need to point out that the purpose of the “Red Hand of Atheism” chapter was not to make the simple logical fallacy that he believes me to have made, but rather to demonstrate the absurdity of the Unholy Trinity’s No True Atheist argument by showing how the strength of the correlation indicates some sort of causal relationship.  Communism was a godless vision, it is not the only one and I suggest it is not the only one that is likely to lead to tragedy.  Only this last point is truly up for discussion, which I welcome.  Now, I may well have indulged in argumentative overkill that led to a mistaken impression, but then, as Dominic cannot possibly have known when reading TIA, overkill is my idiom.  (At this point, Dominic, don’t be surprised if a few regulars elbow you and whisper an urgent recommendation to avoid the topic of Asian mid-century ocean transport capacities.)  It’s also possible that he quite reasonably mistook the staunch anti-statism of a libertarian for the religious zealotry of a Christian.  That would be understandable, as I am, after all, both.</p><p>I am not in the least bit concerned about communism today.  That brand has exhausted its appeal.  But the same elements it contained that caused the tragedies it wrought are at work today in other, as yet unnamed Enlightenment-inspired ideologies that are of dangerously broad appeal, ideologies that can be clearly seen in the global imperatives of Sam Harris and Bertrand Russell.  Utopianism is always dangerous, be they religious or secular, but scientific secular utopias are the most dangerous of the lot via the process I articulated in the very chapter Dominic considers to be trapped in the narrative.  But this has nothing inherently to do with communism per se.  I submit that “The Red Hand of Atheism” is not actually trapped in the narrative, (although it is undoubtedly stained by it, being a response to a narrative-trapped notion.)  Anyhow, it’s not like I can reasonably deny that I’m perfectly capable of taking off on the rhetorical flights I mentioned in the Hitchens’s chapter.  I’m a polemicist, not a philosopher, but that doesn’t mean that it’s wise to dismiss the ideas in the polemic out of hand.  At least I’m not advocating rule by polemicist-king….</p><p>But even if I cannot convince Dominic that I am not making the argument that he believes I am making, I appreciate his overall perspective.  For what Christian can deny the man who, in essence, is saying “come, let us reason together.”</p></div>",
  "content_text": "Dominic Santerelli is still\nreeling in bitter disbelief\n:\nEssentially, the point I’m making is that if atheists and theists see each other as “enemies”, the argument is over before it begins. The first step then, that I see, is to stamp out the high profile outspoken loyalists (people who will not change their minds for any reason) under whose banners the intellectually lazy flock to, leaving behind only those of high profile who are actually willing to listen to the other side.\nWhich is why I set out to crush Vox Day. I was fed the impression that this was just another evangelical loyalist, so I give a call to arms over at RD.net, a place which I assumed was populated by a cadre of intellectual mavericks (being one myself).\nOh, the irony.\nAs Dominic now understands, I truly don’t see him as an enemy, which is why I put the word in scare quotes.  Indeed, the very reason that most Christians refer to “militant atheists” is not to tar all atheists with militancy, but rather to distinguish between those trapped in the narrative and intent on attacking Christianity and other religions, and those who are simply people that happen to be atheists.  The adjective MODIFIES the noun, as I find myself having to point out disturbingly often on a wide range of otherwise unrelated subjects.\nI quite like the concept of escaping the narrative Dominic puts forth in\nhis extended review on Dawkins.net\n, as I think it achieving intellectual escape velocity something that atheists like him, and Daniel Dennett, and perhaps even the occasional Christian may be capable.  But again, I feel the need to point out that the purpose of the “Red Hand of Atheism” chapter was not to make the simple logical fallacy that he believes me to have made, but rather to demonstrate the absurdity of the Unholy Trinity’s No True Atheist argument by showing how the strength of the correlation indicates some sort of causal relationship.  Communism was a godless vision, it is not the only one and I suggest it is not the only one that is likely to lead to tragedy.  Only this last point is truly up for discussion, which I welcome.  Now, I may well have indulged in argumentative overkill that led to a mistaken impression, but then, as Dominic cannot possibly have known when reading TIA, overkill is my idiom.  (At this point, Dominic, don’t be surprised if a few regulars elbow you and whisper an urgent recommendation to avoid the topic of Asian mid-century ocean transport capacities.)  It’s also possible that he quite reasonably mistook the staunch anti-statism of a libertarian for the religious zealotry of a Christian.  That would be understandable, as I am, after all, both.\nI am not in the least bit concerned about communism today.  That brand has exhausted its appeal.  But the same elements it contained that caused the tragedies it wrought are at work today in other, as yet unnamed Enlightenment-inspired ideologies that are of dangerously broad appeal, ideologies that can be clearly seen in the global imperatives of Sam Harris and Bertrand Russell.  Utopianism is always dangerous, be they religious or secular, but scientific secular utopias are the most dangerous of the lot via the process I articulated in the very chapter Dominic considers to be trapped in the narrative.  But this has nothing inherently to do with communism per se.  I submit that “The Red Hand of Atheism” is not actually trapped in the narrative, (although it is undoubtedly stained by it, being a response to a narrative-trapped notion.)  Anyhow, it’s not like I can reasonably deny that I’m perfectly capable of taking off on the rhetorical flights I mentioned in the Hitchens’s chapter.  I’m a polemicist, not a philosopher, but that doesn’t mean that it’s wise to dismiss the ideas in the polemic out of hand.  At least I’m not advocating rule by polemicist-king….\nBut even if I cannot convince Dominic that I am not making the argument that he believes I am making, I appreciate his overall perspective.  For what Christian can deny the man who, in essence, is saying “come, let us reason together.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-09T10:39:00+00:00"
}