{
  "url": "https://voxday.net/2008/02/07/when-props-are-due/",
  "scraped_at": "2026-01-08T22:10:52.824307",
  "title": "When props are due",
  "date_display": "February 7, 2008",
  "date_iso": "2008-02-07T09:06:00+00:00",
  "date_from_url": "2008-02-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>CrazyIvan points out that atheists and Christians can reach common ground:</p><blockquote><p>” And Vox, how about some Kudos to me for supporting your boy Ron Paul. It’s nice to agree on something isn’t it.”</p></blockquote><p>As I have said many times before, I would support an atheist libertarian – a real libertarian, not a Bill Maher “I have have no idea what that means but I think it sounds cool so I’ll call myself one” libertarian – before I would support yet another Christian charlatan like George Bush the Elder, Bill Clinton, George Bush the Younger, Mike Huckabee or anyone else wrapping their hunger for power over others in their purported Christian faith.</p><p>However, I must also ask CrazyIvan what in the name of liberty he is doing as a libertarian in trying to defend Sam Harris, who does not believe in freedom of belief, does not believe in free will, opposes national sovereignty and is both a defender of torture and an advocate of one-world government?   It seems to me that CrazyIvan has far more <i>ideologically</i> in common with the libertarian theists than he does with the utopian atheists, his lack of religious faith notwithstanding.</p><p>And while we’re on the subject, I should note that I have written <a href=\"http://irrationalatheist.com/forum/viewtopic.php?t=36\">a response to the recent Amazon reviewer</a> who claims that Harris supports freedom of belief and asserts that he is not just another lethal utopian calling for an imposed global dictatorship.</p></div>",
  "content_text": "CrazyIvan points out that atheists and Christians can reach common ground:\n” And Vox, how about some Kudos to me for supporting your boy Ron Paul. It’s nice to agree on something isn’t it.”\nAs I have said many times before, I would support an atheist libertarian – a real libertarian, not a Bill Maher “I have have no idea what that means but I think it sounds cool so I’ll call myself one” libertarian – before I would support yet another Christian charlatan like George Bush the Elder, Bill Clinton, George Bush the Younger, Mike Huckabee or anyone else wrapping their hunger for power over others in their purported Christian faith.\nHowever, I must also ask CrazyIvan what in the name of liberty he is doing as a libertarian in trying to defend Sam Harris, who does not believe in freedom of belief, does not believe in free will, opposes national sovereignty and is both a defender of torture and an advocate of one-world government?   It seems to me that CrazyIvan has far more\nideologically\nin common with the libertarian theists than he does with the utopian atheists, his lack of religious faith notwithstanding.\nAnd while we’re on the subject, I should note that I have written\na response to the recent Amazon reviewer\nwho claims that Harris supports freedom of belief and asserts that he is not just another lethal utopian calling for an imposed global dictatorship.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-07T09:06:00+00:00"
}