{
  "url": "https://voxday.net/2008/02/19/yet-another-non-reading-reviewer/",
  "scraped_at": "2026-01-08T22:12:22.213884",
  "title": "Yet another non-reading reviewer",
  "date_display": "February 19, 2008",
  "date_iso": "2008-02-19T00:48:00+00:00",
  "date_from_url": "2008-02-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Will Pattison pretends to have read TIA, but <a href=\"http://www.amazon.com/review/RRUYN5M328UYY/ref=cm_cr_rdp_perm\">makes it painfully obvious that he didn’t</a>:</p><blockquote><p>I have been reading the Vox day blog for a while.</p><p>The book starts with many generic arguments that evolve down to the old question of “without god, how can there be morals?”. Anyone who has spent 5 minutes reading the ‘Argument from morality’ page on wikipedia will find these sections silly or at least inefficient.</p><p>The attacks use short quotes from Dawkins/Harris books, and as a reader I feel like I am not getting the context of the quotes. In the case of the Harris state vs county crime/religion statistic, I wish Vox would quote the reason Harris was using it… for all I know Harris was making a point that the corelation is meaningless.</p><p>Vox spends too many words personally attacking people instead of attacking the viewpoints. It feels insulting as a reader.</p><p>Even though this is a intelectually dishonest book, I am glad to see someone attempting to defend Christianity in a non-soundbyte manner. Vox Day may be the last person trying (Al Sharpten, James Dobson, Christian Science Center, etc have stopped as far as I can tell).</p></blockquote><p>From TIA:</p><p><i><b>The Incompetent Atheist</b></i></p><p>One of the most oft-cited passages in Letter to a Christian Nation<br>is Harris’s Red State-Blue State argument, in which he purports to<br>prove that there is no correlation between Christian conservativism<br>and social health. Richard Dawkins found the data to be “striking,”<br>so much so that he quotes the following paragraph from Harris’s<br>book in its entirety.</br></br></br></br></br></p><p>After quoting the entire paragraph myself, I then spend no less then five pages demonstrating first that the argument is meaningless, then showing how the incompetent means utilized to go about proving the argument actually prove the opposite based on the more accurate data that was readily available to Sam Harris.  This is the lamest and most bizarre Fighting Withdrawal we’ve seen yet!  It’s quite clear that Will has not read <i>The Irrational Atheist</i>, <i>Letter to a Christian Nation</i> or <i>The God Delusion</i>.  I never once make an argument that without God there can be no morals, instead, I specifically point out that Richard Dawkins and company are utilizing a faux-scientific bait-and-switch in order to argue for a rival moral system based on Enlightenment ideals.  God is one theoretical source of an objective moral standard, the challenge of the New Atheists is not to suggest new morals, which is easy enough, but rather to find a rational basis for an objective moral standard by which one individual has a justification for holding another individual accountable.  This is, as Daniel Dennett admits, much more difficult than it initially looks.</p><p>And I have no need to create straw man arguments, the New Atheist arguments are sufficiently flawed as they are, which, for example, is why I was quite happy to quote the central argument of <i>The God Delusion</i> in its entirety.</p><p>What is it with atheists and their insane eagerness to blatantly lie?  Are they so determined to demonstrate the truth of the stereotype of the immoral atheist?  This is the second atheist pulling this kind of nonsense today, as over on the Atheism Sucks blog, another atheist was claiming that I had been making offensive posts over at richarddawkins.net.  I have never once posted or commented there.</p></div>",
  "content_text": "Will Pattison pretends to have read TIA, but\nmakes it painfully obvious that he didn’t\n:\nI have been reading the Vox day blog for a while.\nThe book starts with many generic arguments that evolve down to the old question of “without god, how can there be morals?”. Anyone who has spent 5 minutes reading the ‘Argument from morality’ page on wikipedia will find these sections silly or at least inefficient.\nThe attacks use short quotes from Dawkins/Harris books, and as a reader I feel like I am not getting the context of the quotes. In the case of the Harris state vs county crime/religion statistic, I wish Vox would quote the reason Harris was using it… for all I know Harris was making a point that the corelation is meaningless.\nVox spends too many words personally attacking people instead of attacking the viewpoints. It feels insulting as a reader.\nEven though this is a intelectually dishonest book, I am glad to see someone attempting to defend Christianity in a non-soundbyte manner. Vox Day may be the last person trying (Al Sharpten, James Dobson, Christian Science Center, etc have stopped as far as I can tell).\nFrom TIA:\nThe Incompetent Atheist\nOne of the most oft-cited passages in Letter to a Christian Nation\nis Harris’s Red State-Blue State argument, in which he purports to\nprove that there is no correlation between Christian conservativism\nand social health. Richard Dawkins found the data to be “striking,”\nso much so that he quotes the following paragraph from Harris’s\nbook in its entirety.\nAfter quoting the entire paragraph myself, I then spend no less then five pages demonstrating first that the argument is meaningless, then showing how the incompetent means utilized to go about proving the argument actually prove the opposite based on the more accurate data that was readily available to Sam Harris.  This is the lamest and most bizarre Fighting Withdrawal we’ve seen yet!  It’s quite clear that Will has not read\nThe Irrational Atheist\n,\nLetter to a Christian Nation\nor\nThe God Delusion\n.  I never once make an argument that without God there can be no morals, instead, I specifically point out that Richard Dawkins and company are utilizing a faux-scientific bait-and-switch in order to argue for a rival moral system based on Enlightenment ideals.  God is one theoretical source of an objective moral standard, the challenge of the New Atheists is not to suggest new morals, which is easy enough, but rather to find a rational basis for an objective moral standard by which one individual has a justification for holding another individual accountable.  This is, as Daniel Dennett admits, much more difficult than it initially looks.\nAnd I have no need to create straw man arguments, the New Atheist arguments are sufficiently flawed as they are, which, for example, is why I was quite happy to quote the central argument of\nThe God Delusion\nin its entirety.\nWhat is it with atheists and their insane eagerness to blatantly lie?  Are they so determined to demonstrate the truth of the stereotype of the immoral atheist?  This is the second atheist pulling this kind of nonsense today, as over on the Atheism Sucks blog, another atheist was claiming that I had been making offensive posts over at richarddawkins.net.  I have never once posted or commented there.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-02-19T00:48:00+00:00"
}