{
  "url": "https://voxday.net/2022/07/10/a-dire-situation/",
  "scraped_at": "2026-01-08T13:24:14.155111",
  "title": "A Dire Situation",
  "date_display": "July 10, 2022",
  "date_iso": "2022-07-10T11:39:25+00:00",
  "date_from_url": "2022-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The head of the Swiss gas industry, André Dosé, warns about <a href=\"http://nzz.ch/schweiz/andre-dose-zur-energiekrise-man-ist-sich-in-der-schweiz-nicht-bewusst-wie-gefaehrlich-die-situation-ist-ld.1692143\">the dangerous energy and electricity situation facing Europe</a> in the aftermath of the self-destructive decision on the part of the European governments to go to war with Russia and China on the orders of the US-based neocons. Of course, if the Swiss had maintained their historical neutrality, they could simply ask the Russians for help, but instead they’re being retaught the painful lesson of a) taking sides and b) aligning with the losers.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>How dire is the situation?</strong></p><p>We have a huge problem. There are currently increasing signs that no more gas will flow from Russia to Europe via Nord Stream 1 after the maintenance in July. The gas shortage in Germany could be declared in the next few days. Coal-fired power plants are now being used in Germany to produce electricity. At the same time, 40 to 45 percent of the nuclear power plants in France are out of operation. And the world’s largest gas supplier, Uniper, has asked the state for stabilization measures because of liquidity problems. Under these conditions, it takes very little for energy to run out in winter.</p><p><strong>Does that also apply to Switzerland?</strong></p><p>Yes. We depend on year-round gas imports and electricity imports in winter. This crisis in Switzerland is largely self-inflicted. The Energy Strategy 2050 is built on sand. It was assumed that there was no population growth, the population reduced electricity consumption. Likewise, electromobility was not included in the scenarios when voting. It was a dream that would never have worked one way or the other. The Ukraine war is now forcing us to rethink dramatically.</p><p><strong>What must Switzerland do now?</strong></p><p>There is no short-term solution. The expansion of photovoltaics is all right and good – but it won’t get us through the winter. Switzerland lags behind other countries in Europe. In addition, we do not have an electricity agreement with the EU, which does not improve our situation.</p><p><strong>The “Perfect Storm”.</strong></p><p>Yes, unfortunately. And I don’t have the impression that people in this country are aware of how dangerous the situation is. If the population is now called upon to take a shower instead of a bath, then the scope of our problems is fundamentally misunderstood.</p><cite>André Dosé zur Energiekrise: «Man ist sich in der Schweiz nicht bewusst, wie gefährlich die Situation ist», <em>NZZ</em>, 6 July 2022</cite></blockquote><p>The situation is economically catalysmic, and may even prove to be societally cataclysmic. Three years ago, a megawatt hour of gas cost EUR 7. The price is now EUR 175, and is expected to rise to <em>at least</em> 250.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Spot electricity and gas markets are blowing up. But, less noticed, so are 2023 and 2024 gas prices.</p><p>Germany’s gas situation is dire. They are issuing official warnings about rationing. Lots of manufacturing will get turned off. People who hedged forward will face massive margin calls. Industry experts are predicting governments will have to do bailouts.</p><p>I do not think Europe will sustain its current position on UKR/Russia through this winter. And Putin can squeeze much harder. European voters will not support large hits to their living standards to fund turnign UKR into rubble and fighting between people screaming in Russian at each other.</p><p>The media and much of academia has cheered for the war so it’s very hard for them to cover this story…</p></blockquote><p>The war against Russia was always and obviously going to be a complete disaster, without even taking China and the other BRICSIA nations into account. The European countries absolutely need to surrender now, before the weather turns cold and their need for heat and electricity rises. But as with the defeated Ukrainian military forces, it is unlikely that their globalist masters will permit them to do so. After all, the globalist elite doesn’t care about freezing Poles, Germans, or Swiss any more than they do about their starving Ukrainian cannon fodder.</p><p>What a pity the Swiss media didn’t seek to interview me about relevant topics like this instead of seeking to dig up material for the 473rd failed hit piece about me.</p><p><strong>UPDATE: </strong>Today’s NZZ is discussing the possibility that Switzerland will lose 30 to 40 percent of its power this winter. It seems to me that the wisest approach to the incipient crisis would be a) declaring permanent neutrality, b) unfreezing and restoring all Russian assets, and c) sending a delegation to Moscow to apologize to the Russian people and request assistance.</p><p><strong>UPDATE:</strong> <em>French authorities are preparing for a complete suspension of gas supplies from Russia, according to the country’s Finance Minister Bruno Le Maire, who sees such a full shutdown as the “most likely scenario.”</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/273c4682-dcdb-468c-89ad-11079843c6f1\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The head of the Swiss gas industry, André Dosé, warns about\nthe dangerous energy and electricity situation facing Europe\nin the aftermath of the self-destructive decision on the part of the European governments to go to war with Russia and China on the orders of the US-based neocons. Of course, if the Swiss had maintained their historical neutrality, they could simply ask the Russians for help, but instead they’re being retaught the painful lesson of a) taking sides and b) aligning with the losers.\nHow dire is the situation?\nWe have a huge problem. There are currently increasing signs that no more gas will flow from Russia to Europe via Nord Stream 1 after the maintenance in July. The gas shortage in Germany could be declared in the next few days. Coal-fired power plants are now being used in Germany to produce electricity. At the same time, 40 to 45 percent of the nuclear power plants in France are out of operation. And the world’s largest gas supplier, Uniper, has asked the state for stabilization measures because of liquidity problems. Under these conditions, it takes very little for energy to run out in winter.\nDoes that also apply to Switzerland?\nYes. We depend on year-round gas imports and electricity imports in winter. This crisis in Switzerland is largely self-inflicted. The Energy Strategy 2050 is built on sand. It was assumed that there was no population growth, the population reduced electricity consumption. Likewise, electromobility was not included in the scenarios when voting. It was a dream that would never have worked one way or the other. The Ukraine war is now forcing us to rethink dramatically.\nWhat must Switzerland do now?\nThere is no short-term solution. The expansion of photovoltaics is all right and good – but it won’t get us through the winter. Switzerland lags behind other countries in Europe. In addition, we do not have an electricity agreement with the EU, which does not improve our situation.\nThe “Perfect Storm”.\nYes, unfortunately. And I don’t have the impression that people in this country are aware of how dangerous the situation is. If the population is now called upon to take a shower instead of a bath, then the scope of our problems is fundamentally misunderstood.\nAndré Dosé zur Energiekrise: «Man ist sich in der Schweiz nicht bewusst, wie gefährlich die Situation ist»,\nNZZ\n, 6 July 2022\nThe situation is economically catalysmic, and may even prove to be societally cataclysmic. Three years ago, a megawatt hour of gas cost EUR 7. The price is now EUR 175, and is expected to rise to\nat least\n250.\nSpot electricity and gas markets are blowing up. But, less noticed, so are 2023 and 2024 gas prices.\nGermany’s gas situation is dire. They are issuing official warnings about rationing. Lots of manufacturing will get turned off. People who hedged forward will face massive margin calls. Industry experts are predicting governments will have to do bailouts.\nI do not think Europe will sustain its current position on UKR/Russia through this winter. And Putin can squeeze much harder. European voters will not support large hits to their living standards to fund turnign UKR into rubble and fighting between people screaming in Russian at each other.\nThe media and much of academia has cheered for the war so it’s very hard for them to cover this story…\nThe war against Russia was always and obviously going to be a complete disaster, without even taking China and the other BRICSIA nations into account. The European countries absolutely need to surrender now, before the weather turns cold and their need for heat and electricity rises. But as with the defeated Ukrainian military forces, it is unlikely that their globalist masters will permit them to do so. After all, the globalist elite doesn’t care about freezing Poles, Germans, or Swiss any more than they do about their starving Ukrainian cannon fodder.\nWhat a pity the Swiss media didn’t seek to interview me about relevant topics like this instead of seeking to dig up material for the 473rd failed hit piece about me.\nUPDATE:\nToday’s NZZ is discussing the possibility that Switzerland will lose 30 to 40 percent of its power this winter. It seems to me that the wisest approach to the incipient crisis would be a) declaring permanent neutrality, b) unfreezing and restoring all Russian assets, and c) sending a delegation to Moscow to apologize to the Russian people and request assistance.\nUPDATE:\nFrench authorities are preparing for a complete suspension of gas supplies from Russia, according to the country’s Finance Minister Bruno Le Maire, who sees such a full shutdown as the “most likely scenario.”\nDISCUSS ON SG",
  "tags": [
    "EU",
    "media",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-07-10T19:16:02+00:00"
}