{
  "url": "https://voxday.net/2022/07/19/a-satanian-lectures-churchians/",
  "scraped_at": "2026-01-08T13:25:03.116091",
  "title": "A Satanian Lectures Churchians",
  "date_display": "July 19, 2022",
  "date_iso": "2022-07-19T10:54:45+00:00",
  "date_from_url": "2022-07-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jordan Peterson, who is a “little satan” if there ever was one, <a href=\"https://www.youtube.com/watch?v=e7ytLpO7mj0&amp;t=4s\">literally accuses the Christian churches</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>It is of course completely presumptuous of me to dare to write and broadcast a video entitled message to the Christian churches but I’m going to do it anyway because I have something to say and<br/>because that something needs to be said.</p></blockquote><p>It is completely presumptuous. It is completely absurd. He’s now gone beyond his conventional luciferian Babelism to literal satanry. And Peterson is leaving out something rather vital, he’s attempting to mislead young men and subvert Christianity and its institutional organizations because his new masters at the <em>Daily Wire</em> hired him for precisely that purpose.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>We in the West are facing an all-out assault at the deepest levels on what that old joker Jacques Derrida deemed the faux logo-centric conceptual structure of civilization itself. To take that apart, that’s a society centered on the encouraging adventurous masculine spirit and that privileges – that hated word – of all things, the divine logos, and what should we worship and celebrate properly other than that deconstructionists the words of that mass murderer Karl Marx, and it is precisely those young men who are deeply conscientious, capable of guilt and regret, who have come to believe in pain, that every deep impulse that moves them out into the world for the adventure of their life, even that impulse drawing them to women, is nothing but the manifestation of a spirit that is essentially satanic in nature.</p><p>This is not only wrong theologically, morally, psychologically, practically, and scientifically, it is literally<br/>anti-true. It’s not a mere misstatement about the nature of reality, a minor conceptual error, but something that literally could not be farther from the truth and something that distant from the truth comes from a place that cannot be distinguished from Hell.</p></blockquote><p>This is pure Judeochurchian bafflegarble. The assault on the West has been spearheaded by the very people for whom Jordan Peterson now draws a paycheck. And it comes from Hell, not “a place that cannot be distinguished” from it. The satanic war is first against Jesus Christ, second against the European nations, third against the Greco-Roman philosophic legacy, and fourth, against the rest of humanity. It’s not a war against masculinity or young men; the assault on young women has been even more serious and devastating, as many young men can readily attest.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Christian Church is there to remind people, young men included, and perhaps even first and foremost, that they have a woman to find a garden, to walk in a family, to nurture an ark, to build a land, to conquer a ladder to heaven, to build, and the utter terrible catastrophe of life to face stalwartly in truth, devoted to love, and without fear.</p><p>Invite the young men back. Say literally to those young men: you are welcome here. If no one else wants what you have to offer, we do. We want to call you to the highest purpose of your life, we want your time and energy and effort and your will and your good will. We want to work with you to make things better, to produce life more abundant for you, and for your wife and children, and for your community and your country and the world.</p></blockquote><p>No. A thousand times no! The Christian church is absolutely not there to remind people to pursue certain specific material goals. The Christian church is there to worship Jesus Christ, to care for the flock, and to spread the Gospel. It is not there to more efficiently produce material goods for the betterment of the world; to the contrary, it is there to war against the fallen world and its myriad of falsehoods! And one reason so many young men and women have left the institutional churches is because those churches have replaced Christianity with the very Churchian materialism Peterson is now claiming is the purpose of the Christian Church!</p><p>Peterson’s understanding of the role of the Church doesn’t even rise to the level of an evil pagan occultist like Hitler, who at least understood that “Kirche” was something fundamentally distinct from “Kinder” and “Kuche”. And life is not “a terrible catastrophe”. This is not only subversion, it is pure inversion, and most of you reading this will understand the significance of that.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Your church is for god’s sake. Quit fighting for social justice, quit saving the bloody planet. Attend to some souls, that’s what you’re supposed to do, that’s your holy duty. Do it now, before it’s too late and the hour is nigh.</p></blockquote><p>And which “god” is that, Mr. Peterson. <em>Which “god” is that?</em></p><p>Like the professional gatekeeper that he is, like the deceitful inversionist snaketongue that he is, Peterson is demanding a return from social justice evil to materialist Enlightenment evil in order to prevent those seeking the Way, the Truth, and the Life from founding new Christian bodies that will supplant the invaded, conquered, and subverted organizations that have been rightfully abandoned. This is simply an attempt to maintain the viability of the converged churchian institutions in order to prevent them from collapsing completely.</p><p>Needless to say, the average Churchian will drink this pseudo-philosophical poison up like Kool-Aid on a hot summer’s day.</p><p><strong>UPDATE: </strong>Fencing Bear points out how, <a href=\"https://fencingbearatprayer.blogspot.com/2018/02/who-wants-to-be-heretic.html\">in his own words</a>, the little satan actively rejects the central beliefs of Christianity while accusing the churches of failing to live up to his materialist standards for them.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Dogmatic belief in the central axioms of Christianity (that Christ’s crucifixion redeemed the world; that salvation was reserved for the hereafter; that salvation could not be achieved through works) had three mutually reinforcing consequences: First, <em>devaluation of the significance of earthly life, as only the hereafter mattered.</em> This also meant that it had become acceptable to overlook and shirk responsibility for the suffering that existed in the here-and-now; Second, <em>passive acceptance of the status quo, because salvation could not be earned in any case through effort in this life</em> (a consequence that Marx also derided, with his proposition that religion was the opiate of the masses); and, finally, third, <em>the right of the believer to reject any real moral burden</em> (outside of the stated belief in salvation through Christ), <em>because the Son of God had already done all the important work.</em></p></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/1d35e37a-4c82-4c1a-8cd2-f919de6122e7\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Jordan Peterson, who is a “little satan” if there ever was one,\nliterally accuses the Christian churches\n.\nIt is of course completely presumptuous of me to dare to write and broadcast a video entitled message to the Christian churches but I’m going to do it anyway because I have something to say and\nbecause that something needs to be said.\nIt is completely presumptuous. It is completely absurd. He’s now gone beyond his conventional luciferian Babelism to literal satanry. And Peterson is leaving out something rather vital, he’s attempting to mislead young men and subvert Christianity and its institutional organizations because his new masters at the\nDaily Wire\nhired him for precisely that purpose.\nWe in the West are facing an all-out assault at the deepest levels on what that old joker Jacques Derrida deemed the faux logo-centric conceptual structure of civilization itself. To take that apart, that’s a society centered on the encouraging adventurous masculine spirit and that privileges – that hated word – of all things, the divine logos, and what should we worship and celebrate properly other than that deconstructionists the words of that mass murderer Karl Marx, and it is precisely those young men who are deeply conscientious, capable of guilt and regret, who have come to believe in pain, that every deep impulse that moves them out into the world for the adventure of their life, even that impulse drawing them to women, is nothing but the manifestation of a spirit that is essentially satanic in nature.\nThis is not only wrong theologically, morally, psychologically, practically, and scientifically, it is literally\nanti-true. It’s not a mere misstatement about the nature of reality, a minor conceptual error, but something that literally could not be farther from the truth and something that distant from the truth comes from a place that cannot be distinguished from Hell.\nThis is pure Judeochurchian bafflegarble. The assault on the West has been spearheaded by the very people for whom Jordan Peterson now draws a paycheck. And it comes from Hell, not “a place that cannot be distinguished” from it. The satanic war is first against Jesus Christ, second against the European nations, third against the Greco-Roman philosophic legacy, and fourth, against the rest of humanity. It’s not a war against masculinity or young men; the assault on young women has been even more serious and devastating, as many young men can readily attest.\nThe Christian Church is there to remind people, young men included, and perhaps even first and foremost, that they have a woman to find a garden, to walk in a family, to nurture an ark, to build a land, to conquer a ladder to heaven, to build, and the utter terrible catastrophe of life to face stalwartly in truth, devoted to love, and without fear.\nInvite the young men back. Say literally to those young men: you are welcome here. If no one else wants what you have to offer, we do. We want to call you to the highest purpose of your life, we want your time and energy and effort and your will and your good will. We want to work with you to make things better, to produce life more abundant for you, and for your wife and children, and for your community and your country and the world.\nNo. A thousand times no! The Christian church is absolutely not there to remind people to pursue certain specific material goals. The Christian church is there to worship Jesus Christ, to care for the flock, and to spread the Gospel. It is not there to more efficiently produce material goods for the betterment of the world; to the contrary, it is there to war against the fallen world and its myriad of falsehoods! And one reason so many young men and women have left the institutional churches is because those churches have replaced Christianity with the very Churchian materialism Peterson is now claiming is the purpose of the Christian Church!\nPeterson’s understanding of the role of the Church doesn’t even rise to the level of an evil pagan occultist like Hitler, who at least understood that “Kirche” was something fundamentally distinct from “Kinder” and “Kuche”. And life is not “a terrible catastrophe”. This is not only subversion, it is pure inversion, and most of you reading this will understand the significance of that.\nYour church is for god’s sake. Quit fighting for social justice, quit saving the bloody planet. Attend to some souls, that’s what you’re supposed to do, that’s your holy duty. Do it now, before it’s too late and the hour is nigh.\nAnd which “god” is that, Mr. Peterson.\nWhich “god” is that?\nLike the professional gatekeeper that he is, like the deceitful inversionist snaketongue that he is, Peterson is demanding a return from social justice evil to materialist Enlightenment evil in order to prevent those seeking the Way, the Truth, and the Life from founding new Christian bodies that will supplant the invaded, conquered, and subverted organizations that have been rightfully abandoned. This is simply an attempt to maintain the viability of the converged churchian institutions in order to prevent them from collapsing completely.\nNeedless to say, the average Churchian will drink this pseudo-philosophical poison up like Kool-Aid on a hot summer’s day.\nUPDATE:\nFencing Bear points out how,\nin his own words\n, the little satan actively rejects the central beliefs of Christianity while accusing the churches of failing to live up to his materialist standards for them.\nDogmatic belief in the central axioms of Christianity (that Christ’s crucifixion redeemed the world; that salvation was reserved for the hereafter; that salvation could not be achieved through works) had three mutually reinforcing consequences: First,\ndevaluation of the significance of earthly life, as only the hereafter mattered.\nThis also meant that it had become acceptable to overlook and shirk responsibility for the suffering that existed in the here-and-now; Second,\npassive acceptance of the status quo, because salvation could not be earned in any case through effort in this life\n(a consequence that Marx also derided, with his proposition that religion was the opiate of the masses); and, finally, third,\nthe right of the believer to reject any real moral burden\n(outside of the stated belief in salvation through Christ),\nbecause the Son of God had already done all the important work.\nDISCUSS ON SG",
  "tags": [
    "Jordanetics",
    "Judeochristianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-07-19T11:56:19+00:00"
}