{
  "url": "https://voxday.net/2022/07/20/a-tale-of-two-capitalisms/",
  "scraped_at": "2026-01-08T13:25:10.112956",
  "title": "A Tale of Two Capitalisms",
  "date_display": "July 20, 2022",
  "date_iso": "2022-07-20T12:47:11+00:00",
  "date_from_url": "2022-07-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Michael Hudson <a href=\"https://thesaker.is/finance-capitalisms-self-destructive-nature/\">explains the difference</a> between industrial capitalism and finance capitalism, and how the latter has destroyed the US economy and impoverished the American people.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Most people think of all kinds of capitalism as being the same and the assumption is that industrial capitalism of the nineteenth century somehow was always financialized because there were always banks but financial capitalism is you just pointed out is a political system and as a political system it’s very different from the industrial capitalism dynamic. In industrial capitalism, the whole aim or the hope of the industrial capitalists in the late nineteenth century, especially in Germany and central Europe was that banking would no longer be just usury, it wouldn’t be just consumer lending to exploit labor, and it wouldn’t be lending to the government somehow.</p><p>The financial system would recycle the economy savings and money creation and credit into industrial production and would finance the means of production to make that productive instead of predatory and parasitic as it became and that seemed to be the way that industrial capitalism was evolving up until World War I. Everything changed after that all of a sudden you had the financial system take over as a result of the crisis caused in the 1920s by the German reparations debt that couldn’t be paid and the inter-ally debt that was insisted upon to repay the United States for the arms that have supplied Europe for a century into World War I. Well, the result was a huge depression.</p><p>The allies said, well, we didn’t expect to actually have to pay the United States. If we have to pay the United States, then we have to charge reparations on Germany and for a decade there was a debate between John Maynard Keynes and Harold Moulton and others saying that these debts can’t be paid. How are you going to handle a situation where the debts can’t be paid?</p><p>The finance capitalists then were the basically the ancestors of today’s neoliberals and they said any amount of debt can be paid by any country if it just lowers the living standards and squeezes labor enough and that’s what basically the philosophy of the IMF ever since world war II when third world countries can’t pay the debt, the IMF comes in with an austerity program and say you have to lower wages, you have to break up labor unions, if necessary you have to have a democracy, and you can’t have a democracy unless you’re willing to assassinate and arrest the labor leaders and the advocates of land redistribution because a democracy means basically rule by the financial sector centered in the united states. And so finance capitalism ever since WWI and especially WWII and especially since 1980 is the nationalistic doctrine of American banks and the American one percent, and the American financial sector that is sort of merged into a symbiotic unit with the finance insurance and real estate.</p><p>In other words, finance capitalism instead of trying to promote overall economic growth for the 99 percent, instead of financing the industrialization of an economy with rising productivity and rising living standards, is now cannibalizing the industrial sector, cannibalizing the corporate sector. As you’re seeing in the U.S., finance capitalism is the economic doctrine of deindustrialization that has occurred in America in England and is now occurring in Europe.</p><p>Well, the problem is how do you survive if you’re not industrializing, if you’re not producing your own means of subsistence and how are you going to get this from other countries? Well, the answer is you don’t go to war with them like countries used to go to war with each other to grab their money and their land, you use finance as the new means of war so finance capitalism is the tactic of economic warfare by the United States against Europe and the global south to sort of draw all of the economic surplus of these countries in the form of debt service and the debt service is supplied by basically economic rent seeking from land rent, natural resource rent, and just plain interest charges on economy. So, none of these are really the result of industrial profits that are made by employing labor and uh selling its products at a markup.</p><p>Finance capitalism is not based on surplus value like industrial capitalism was. In fact, it destroys industry and in this cannibalizing of industrial capital, it basically dries out the economy and makes it unable to break even or even to function and in the United States today, for instance, if you look at the balance sheets of corporate revenue much of it is spent on stock buybacks. You buy back your own stock or dividend payouts. Only eight percent of corporate earnings are spent on new capital investment research and development: factories, machinery, and means of production to employ labor.</p><p>How did General Electric (GE) go broke? Basically, Jack Welch said let’s use our income not to continue to invest in making more electronic goods and services and appliances, let’s use it to buy our own stock that’ll push up our stock and essentially, we’ll just sell off our divisions and we’ll use the money of selling off our washing machine companies and stoves and sell it off and we’ll just pay it to the stockholders. That’ll push it up and by the way his salary was based on how much he could push up the stock of GE and he was paid in the form of stock options. Well, all of this is now the normal corporate behavior in the United States and corporations are no longer led by industrial engineers as they were a few centuries ago in the nineteenth and twentieth century.</p><p>They’re led by financial engineers of the chief financial officer and the ideal of these corporations is to make money financially not by industrial investment….. so on the narrow microeconomic level finance capitalism is a way of basically selling out a company and giving the proceeds to the stockholders and the bondholders but as a political system, because it is so destructive of the economy as you’ve seen in the United States and you’ve seen in Britain through de-industrializing it, it becomes belligerent in an attempt to make other countries just as equally paralyzed by making these countries pay tribute to the U.S. and England and the financialized economies by means of financial engineering, by means of debt service, by means of selling their mineral resources, their public utilities, their land, their roads all to foreign investors–basically to who borrows the money that’s just simply created in the U.S. and to save all of their money in their central bank reserves in the forms of loans to the U.S. treasury holding treasury bonds which is how the international monetary system worked until just a few months ago when everything changed.</p><p>So if you’re England and America right now you can look at President Biden’s speeches and he said well, China is our number one enemy because it’s competing unfairly. China is actually subsidizing industrial development by having its own infrastructure. It gives free education instead of privatizing education and making its labor pay for it. It has public health instead of privatizing social medicine like we do in the United States and making employers and workers pay for it.</p><p>Well, industrial capitalism in the nineteenth century was all in favor of strong government infrastructure. The ideal of industrial capitalism was to keep the wage costs of production down not by reducing wages but having government provide a basic infrastructure to cover the basic<br/>needs of employees. The governments would provide free education so that employers didn’t have to pay for it. The governments would provide medical care so that employees didn’t have to pay for it and employers wouldn’t have to pay employees enough money to cover the education costs and to cover the medical care costs. The government would build roads and infrastructure and everything to facilitate the overall cost of doing business by industrial capital.</p><p>Well finance capitalism is just the reverse. Finance capitalism wants to privatize and take education, medical care, roads, turn the roads into toll roads, and take all of these and privatize them and make them financial corporations that will essentially pay out their economic rent to the bondholders and the stockholders and this economic rent adds to the cost of education and everything else that workers need to live on so the result is to make it a high cost economy and that’s why Biden has said China and Russia are America’s enemies because the only way that America can succeed given our privatized economy, given the fact that Americans have to pay up to forty three percent of their income for rent, given the fact that eighteen percent of America’s GDP is for medical care, given the heavy student loan debt–only if other countries tie themselves in the same knot, only if other countries impose the same economic overhead on their labor force and on their industry can there be equal competition.</p><p>If other countries have a mixed economy and are more efficient because they have an active government providing basic needs, that’s “autocracy” and that’s the opposite of “democracy.” Democracy is where everything is privatized and ultimately the one percent own everything.</p><p>Autocracy is any government that’s strong enough to have its own public investment. Any government strong enough to tax or regulate the financial sector is called “autocracy” so the U.S. in the 19th century would be called an autocracy as I guess the Austrian school called it – civilization is basically an “autocracy.”</p><p>There never has been an unmixed economy without government regulation, without a government investment, although Rome began to get to that point at the end of its empire and we all know what happened to it. So basically, finance capitalism is a predatory international economic policy aimed at draining the rest of the world all to pay the leading one percent of wealth holders in the U.S. and their satellite oligarchy in England and a few European countries.</p></blockquote><p>Notice how, as always, evil lurks in the endless redefinitions and word spells. The inversions, subversions, and perversions are endless, and remember, we have been told that the root of all evil is the love of money. Therefore, it should be no surprise that an economic system entirely focused on money would prove to be unmitigated evil.</p><p><em><a href=\"https://social.infogalactic.com/micropost/d2ac07d3-7dc9-4e11-8395-24c34cb90281\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Michael Hudson\nexplains the difference\nbetween industrial capitalism and finance capitalism, and how the latter has destroyed the US economy and impoverished the American people.\nMost people think of all kinds of capitalism as being the same and the assumption is that industrial capitalism of the nineteenth century somehow was always financialized because there were always banks but financial capitalism is you just pointed out is a political system and as a political system it’s very different from the industrial capitalism dynamic. In industrial capitalism, the whole aim or the hope of the industrial capitalists in the late nineteenth century, especially in Germany and central Europe was that banking would no longer be just usury, it wouldn’t be just consumer lending to exploit labor, and it wouldn’t be lending to the government somehow.\nThe financial system would recycle the economy savings and money creation and credit into industrial production and would finance the means of production to make that productive instead of predatory and parasitic as it became and that seemed to be the way that industrial capitalism was evolving up until World War I. Everything changed after that all of a sudden you had the financial system take over as a result of the crisis caused in the 1920s by the German reparations debt that couldn’t be paid and the inter-ally debt that was insisted upon to repay the United States for the arms that have supplied Europe for a century into World War I. Well, the result was a huge depression.\nThe allies said, well, we didn’t expect to actually have to pay the United States. If we have to pay the United States, then we have to charge reparations on Germany and for a decade there was a debate between John Maynard Keynes and Harold Moulton and others saying that these debts can’t be paid. How are you going to handle a situation where the debts can’t be paid?\nThe finance capitalists then were the basically the ancestors of today’s neoliberals and they said any amount of debt can be paid by any country if it just lowers the living standards and squeezes labor enough and that’s what basically the philosophy of the IMF ever since world war II when third world countries can’t pay the debt, the IMF comes in with an austerity program and say you have to lower wages, you have to break up labor unions, if necessary you have to have a democracy, and you can’t have a democracy unless you’re willing to assassinate and arrest the labor leaders and the advocates of land redistribution because a democracy means basically rule by the financial sector centered in the united states. And so finance capitalism ever since WWI and especially WWII and especially since 1980 is the nationalistic doctrine of American banks and the American one percent, and the American financial sector that is sort of merged into a symbiotic unit with the finance insurance and real estate.\nIn other words, finance capitalism instead of trying to promote overall economic growth for the 99 percent, instead of financing the industrialization of an economy with rising productivity and rising living standards, is now cannibalizing the industrial sector, cannibalizing the corporate sector. As you’re seeing in the U.S., finance capitalism is the economic doctrine of deindustrialization that has occurred in America in England and is now occurring in Europe.\nWell, the problem is how do you survive if you’re not industrializing, if you’re not producing your own means of subsistence and how are you going to get this from other countries? Well, the answer is you don’t go to war with them like countries used to go to war with each other to grab their money and their land, you use finance as the new means of war so finance capitalism is the tactic of economic warfare by the United States against Europe and the global south to sort of draw all of the economic surplus of these countries in the form of debt service and the debt service is supplied by basically economic rent seeking from land rent, natural resource rent, and just plain interest charges on economy. So, none of these are really the result of industrial profits that are made by employing labor and uh selling its products at a markup.\nFinance capitalism is not based on surplus value like industrial capitalism was. In fact, it destroys industry and in this cannibalizing of industrial capital, it basically dries out the economy and makes it unable to break even or even to function and in the United States today, for instance, if you look at the balance sheets of corporate revenue much of it is spent on stock buybacks. You buy back your own stock or dividend payouts. Only eight percent of corporate earnings are spent on new capital investment research and development: factories, machinery, and means of production to employ labor.\nHow did General Electric (GE) go broke? Basically, Jack Welch said let’s use our income not to continue to invest in making more electronic goods and services and appliances, let’s use it to buy our own stock that’ll push up our stock and essentially, we’ll just sell off our divisions and we’ll use the money of selling off our washing machine companies and stoves and sell it off and we’ll just pay it to the stockholders. That’ll push it up and by the way his salary was based on how much he could push up the stock of GE and he was paid in the form of stock options. Well, all of this is now the normal corporate behavior in the United States and corporations are no longer led by industrial engineers as they were a few centuries ago in the nineteenth and twentieth century.\nThey’re led by financial engineers of the chief financial officer and the ideal of these corporations is to make money financially not by industrial investment….. so on the narrow microeconomic level finance capitalism is a way of basically selling out a company and giving the proceeds to the stockholders and the bondholders but as a political system, because it is so destructive of the economy as you’ve seen in the United States and you’ve seen in Britain through de-industrializing it, it becomes belligerent in an attempt to make other countries just as equally paralyzed by making these countries pay tribute to the U.S. and England and the financialized economies by means of financial engineering, by means of debt service, by means of selling their mineral resources, their public utilities, their land, their roads all to foreign investors–basically to who borrows the money that’s just simply created in the U.S. and to save all of their money in their central bank reserves in the forms of loans to the U.S. treasury holding treasury bonds which is how the international monetary system worked until just a few months ago when everything changed.\nSo if you’re England and America right now you can look at President Biden’s speeches and he said well, China is our number one enemy because it’s competing unfairly. China is actually subsidizing industrial development by having its own infrastructure. It gives free education instead of privatizing education and making its labor pay for it. It has public health instead of privatizing social medicine like we do in the United States and making employers and workers pay for it.\nWell, industrial capitalism in the nineteenth century was all in favor of strong government infrastructure. The ideal of industrial capitalism was to keep the wage costs of production down not by reducing wages but having government provide a basic infrastructure to cover the basic\nneeds of employees. The governments would provide free education so that employers didn’t have to pay for it. The governments would provide medical care so that employees didn’t have to pay for it and employers wouldn’t have to pay employees enough money to cover the education costs and to cover the medical care costs. The government would build roads and infrastructure and everything to facilitate the overall cost of doing business by industrial capital.\nWell finance capitalism is just the reverse. Finance capitalism wants to privatize and take education, medical care, roads, turn the roads into toll roads, and take all of these and privatize them and make them financial corporations that will essentially pay out their economic rent to the bondholders and the stockholders and this economic rent adds to the cost of education and everything else that workers need to live on so the result is to make it a high cost economy and that’s why Biden has said China and Russia are America’s enemies because the only way that America can succeed given our privatized economy, given the fact that Americans have to pay up to forty three percent of their income for rent, given the fact that eighteen percent of America’s GDP is for medical care, given the heavy student loan debt–only if other countries tie themselves in the same knot, only if other countries impose the same economic overhead on their labor force and on their industry can there be equal competition.\nIf other countries have a mixed economy and are more efficient because they have an active government providing basic needs, that’s “autocracy” and that’s the opposite of “democracy.” Democracy is where everything is privatized and ultimately the one percent own everything.\nAutocracy is any government that’s strong enough to have its own public investment. Any government strong enough to tax or regulate the financial sector is called “autocracy” so the U.S. in the 19th century would be called an autocracy as I guess the Austrian school called it – civilization is basically an “autocracy.”\nThere never has been an unmixed economy without government regulation, without a government investment, although Rome began to get to that point at the end of its empire and we all know what happened to it. So basically, finance capitalism is a predatory international economic policy aimed at draining the rest of the world all to pay the leading one percent of wealth holders in the U.S. and their satellite oligarchy in England and a few European countries.\nNotice how, as always, evil lurks in the endless redefinitions and word spells. The inversions, subversions, and perversions are endless, and remember, we have been told that the root of all evil is the love of money. Therefore, it should be no surprise that an economic system entirely focused on money would prove to be unmitigated evil.\nDISCUSS ON SG",
  "tags": [
    "corpocracy",
    "economics",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-07-20T12:47:14+00:00"
}