{
  "url": "https://voxday.net/2022/07/08/clown-world-loses-another-clown/",
  "scraped_at": "2026-01-08T13:24:01.270560",
  "title": "Clown World Loses Another Clown",
  "date_display": "July 8, 2022",
  "date_iso": "2022-07-08T09:17:04+00:00",
  "date_from_url": "2022-07-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Former Japanese Prime Minister <a href=\"https://www.rt.com/news/558614-shinzo-abe-shooting-japan/\">Shinzo Abe was shot dead</a> this morning in Nara:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Former Japanese Prime Minister Shinzo Abe has been pronounced dead at the age of 67 after he was shot during a public address, NHK reported citing the ruling Japanese Liberal Democratic Party. The death was also confirmed by a party source, who spoke to the Kyodo news agency.</p><p>Abe was taken to hospital in grave condition after a gunman injured him during a public appearance in the city of Nara in western Japan. He was campaigning as a candidate in an upcoming parliamentary election.</p><p>Chief cabinet secretary Hirokazu Matsuno was among the first to corroborate details of the attack on Friday, calling it “unforgivable” while noting that a suspect had been arrested. NHK news identified the man as Yamagami Tetsuya, who is said to be in his 40s. He was arrested for attempted murder, and a weapon was reportedly retrieved from the scene.</p></blockquote><p>Despite being portrayed as a “right-wing nationalist”, Abe was always a globalist creature, who “sought to increase Japan’s international profile by expanding ties with NATO, the EU, and other organizations beyond the Asia-Pacific region.” He also “attempted to centralize security policy in the Prime Minister’s office by creating the Japanese National Security Council to better coordinate national security policy, and by ordering the first National Security Strategy in Japan’s history. Based on the American body of the same name, the law to create the NSC was passed in November 2013 and began operating the following month when Abe appointed Shotaro Yachi as Japan’s first National Security Advisor.”</p><p>He was, in short, a man of the world machine.</p><p><em>Born into a political dynasty, Abe’s grandfather and great uncle had both served as prime minister before him and he was groomed for power from the start.</em></p><p>And given the ongoing collapse of the liberal world order, the current stage of the global economic decline, and the way in which so many “democratic” governments are actively engaged in depopulationist war against their own nations, it won’t be terribly surprising if the next decade rivals what was described as <a href=\"https://link.springer.com/chapter/10.1057/9781137347794_7\">“the Age of Assassination”</a> during the 19th Century.</p><p>However, as I noted <a href=\"https://voxday.net/2022/06/26/how-to-read-the-news/\">on 22 June 2022</a>: <em>“There is an incipient split in the G7, most likely between those who want to negotiate a peace settlement (Japan and Italy) and those who don’t (USA, UK, Canada). France is leaning toward the former and Germany is leaning toward the latter.”</em> Abe was among the LDP leaders who openly supported the peace settlement, and it’s not impossible that his very public assassination was a warning to the LDP to keep Japan in the war against the BRICSIA alliance.</p><p> Clown World appears to be terrified of a reasonable peace settlement in Ukraine, for some reason. And the fact that his assassin was ex-military tends to lend itself to the “pour encourager les autres” interpretation.</p><p><a href=\"https://social.infogalactic.com/micropost/b88385c2-9cec-46aa-93de-27ecb025b24a\">DISCUSS ON SG</a></p></div>",
  "content_text": "Former Japanese Prime Minister\nShinzo Abe was shot dead\nthis morning in Nara:\nFormer Japanese Prime Minister Shinzo Abe has been pronounced dead at the age of 67 after he was shot during a public address, NHK reported citing the ruling Japanese Liberal Democratic Party. The death was also confirmed by a party source, who spoke to the Kyodo news agency.\nAbe was taken to hospital in grave condition after a gunman injured him during a public appearance in the city of Nara in western Japan. He was campaigning as a candidate in an upcoming parliamentary election.\nChief cabinet secretary Hirokazu Matsuno was among the first to corroborate details of the attack on Friday, calling it “unforgivable” while noting that a suspect had been arrested. NHK news identified the man as Yamagami Tetsuya, who is said to be in his 40s. He was arrested for attempted murder, and a weapon was reportedly retrieved from the scene.\nDespite being portrayed as a “right-wing nationalist”, Abe was always a globalist creature, who “sought to increase Japan’s international profile by expanding ties with NATO, the EU, and other organizations beyond the Asia-Pacific region.” He also “attempted to centralize security policy in the Prime Minister’s office by creating the Japanese National Security Council to better coordinate national security policy, and by ordering the first National Security Strategy in Japan’s history. Based on the American body of the same name, the law to create the NSC was passed in November 2013 and began operating the following month when Abe appointed Shotaro Yachi as Japan’s first National Security Advisor.”\nHe was, in short, a man of the world machine.\nBorn into a political dynasty, Abe’s grandfather and great uncle had both served as prime minister before him and he was groomed for power from the start.\nAnd given the ongoing collapse of the liberal world order, the current stage of the global economic decline, and the way in which so many “democratic” governments are actively engaged in depopulationist war against their own nations, it won’t be terribly surprising if the next decade rivals what was described as\n“the Age of Assassination”\nduring the 19th Century.\nHowever, as I noted\non 22 June 2022\n:\n“There is an incipient split in the G7, most likely between those who want to negotiate a peace settlement (Japan and Italy) and those who don’t (USA, UK, Canada). France is leaning toward the former and Germany is leaning toward the latter.”\nAbe was among the LDP leaders who openly supported the peace settlement, and it’s not impossible that his very public assassination was a warning to the LDP to keep Japan in the war against the BRICSIA alliance.\nClown World appears to be terrified of a reasonable peace settlement in Ukraine, for some reason. And the fact that his assassin was ex-military tends to lend itself to the “pour encourager les autres” interpretation.\nDISCUSS ON SG",
  "tags": [
    "globalism",
    "news"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-07-08T11:00:10+00:00"
}