{
  "url": "https://voxday.net/2022/07/07/contemplating-the-non-problem-of-evil/",
  "scraped_at": "2026-01-08T13:23:56.052507",
  "title": "Contemplating the Non-Problem of Evil",
  "date_display": "July 7, 2022",
  "date_iso": "2022-07-07T11:47:13+00:00",
  "date_from_url": "2022-07-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Tree of Woe <a href=\"https://treeofwoe.substack.com/p/on-the-problem-of-evil\">contemplates four theodicies</a> and finds none of them to his satisfaction:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>An answer to the problem of evil is often called a theodicy, a term coined in 1710 by Gottfried Leibniz in his book <em>Théodicée</em>. A number of theodicies have been developed over time. In chronological order:</p><p><strong>Isaiahic: </strong>Evil exists because God created it (and/or compels or permits his subjects to create it). Named for Isaiah 45:7, where God states “I form the light, and create darkness: I make good, and create evil: I the LORD do all these things.” Isaiahic theodicy rejects God’s omnibenevolence to emphasize His omnipotence and omniscience. “The Lord giveth and the Lord taketh away” is an Isaiahic platitude. Isaiahic theodicy is accepted by many Jews and Muslims, but most Christians reject it, believing that God is all-loving.</p><p><strong>Irenaean: </strong>Evil exists for our own good. Goodness develops from the experience of suffering. In the words of contemporary theologian John Hicks, our world is a “vale of soul-making” that enables us to become spiritually perfected. But Irenaean theodicy leaves unanswered the question of inexplicable evil. If a mother dies in childbirth and her infant starves to death, with none to mourn for them, whose soul is being “made”? Irenaean theodicy asks us to just trust that God has configured our world to be the best possible world for human development. “God always brings good out of evil” and “God works in mysterious ways” are Irenaean platitudes. Irenaean is the main theodicy for Orthodox Christians and some liberal Protestants.</p><p><strong>Augustinian: </strong>Evil does not exist except as privation from, or absence of, God. When humans freely chose to reject God, committing Original Sin, they thus introduced evil into the world. Augustinian theodicy leaves unanswered the question of foreknowledge. Why would an omniscient God create Adam and Eve knowing they would commit original sin? Isn’t a father who puts his curious child in a room with a loaded gun, knowing the child will pull the trigger, responsible for the harm when the child pulls the trigger? Augustinian theodicy also leaves unexplained why original sin is inherited. Even if the child is to blame for killing someone, why should the child’s great-great-great-great-grandson still be in prison? Questions like this split Orthodox from Catholic and Reformed into Calvinists and Arminians and continue to plague all denominations. Because of this critique, Augustinian theodicy has in practice tended to either collapse back into Irenaean theodicy or progress into Boydian theodicy, depending on whether omniscience or omnibenevolence is emphasized.</p><p><strong>Boydian: </strong>Evil exists because of the free-willed choices of the beings over whom God has given authority over the world. Named for theologian Greg Boyd, this theodicy is distinguished from Augustinian theodicy because it denies God’s omniscience. Boyd is the creator of open theology, which asserts that God is not all-knowing about future contingent events. When God created Satan, Adam, and Eve, He delegated to them a libertarian free will that enabled them to make choices He would not know in advance that they would make. Because God vested great power into Satan (“the prince of this world”), and gave Satan free will, Satan causes great harm. Satan, not God, is responsible for 200 billion dead fetuses and 50 billion dead children. But Boydian theodicy is troubled by this question: why God doesn’t intervene to stop Satan now that Satan has chosen evil? If God cannot stop Satan, then He is not omnipotent. If God could stop Satan, but doesn’t because Satan’s evil actions are part of His plan, or because Satan’s free will is mysteriously part of the greater good, then we’ve reverted to Irenaean or Isaiahic. If God could stop Satan, but doesn’t because he made an irrevocable covenant to let Satan be prince of this world, then God is not just lacking in omniscience, he’s lacking in heavenly legal counsel — who writes a job contract without a termination clause for wrongful behavior?</p><p>If you are satisfied with any of those four theodicies, you should stop here. You have my gratitude for being a reader of this blog, and I do not wish to challenge your faith. The rest of this essay is just for troubled souls.</p></blockquote><p>It’s an interesting and intelligent essay. I will share my thoughts on it in a future post, and probably on a future Darkstream as well. In the meantime, it’s no secret that I incline toward the Boydian theodicy, although in doing so I think it is necessary to distinguish between three types of evil: primordial, spiritual, and material if one is to seriously address the topic. The mere fact that there is a Lake of Fire and Outer Darkness into which Satan is to be cast is sufficient to distinguish between the first two, and the fact that humanity links the latter two indicates a need to distinguish between them.</p><p>But, as I have repeatedly stated, there is no such thing as a “problem” of evil for the Christian in the first place. To the contrary, Christianity is entirely dependent upon its existence; if the world is not fallen, there is no need for salvation. One need not believe in God to recognize the reality of evil, but once one begins to grasp the material existence of evil and the extent to which it permeates the world in which we live, the absolute necessity of God’s Son becomes readily apparent.</p><p><em><a href=\"https://social.infogalactic.com/micropost/dca4b656-37e9-4894-8b75-3132fd099899\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Tree of Woe\ncontemplates four theodicies\nand finds none of them to his satisfaction:\nAn answer to the problem of evil is often called a theodicy, a term coined in 1710 by Gottfried Leibniz in his book\nThéodicée\n. A number of theodicies have been developed over time. In chronological order:\nIsaiahic:\nEvil exists because God created it (and/or compels or permits his subjects to create it). Named for Isaiah 45:7, where God states “I form the light, and create darkness: I make good, and create evil: I the LORD do all these things.” Isaiahic theodicy rejects God’s omnibenevolence to emphasize His omnipotence and omniscience. “The Lord giveth and the Lord taketh away” is an Isaiahic platitude. Isaiahic theodicy is accepted by many Jews and Muslims, but most Christians reject it, believing that God is all-loving.\nIrenaean:\nEvil exists for our own good. Goodness develops from the experience of suffering. In the words of contemporary theologian John Hicks, our world is a “vale of soul-making” that enables us to become spiritually perfected. But Irenaean theodicy leaves unanswered the question of inexplicable evil. If a mother dies in childbirth and her infant starves to death, with none to mourn for them, whose soul is being “made”? Irenaean theodicy asks us to just trust that God has configured our world to be the best possible world for human development. “God always brings good out of evil” and “God works in mysterious ways” are Irenaean platitudes. Irenaean is the main theodicy for Orthodox Christians and some liberal Protestants.\nAugustinian:\nEvil does not exist except as privation from, or absence of, God. When humans freely chose to reject God, committing Original Sin, they thus introduced evil into the world. Augustinian theodicy leaves unanswered the question of foreknowledge. Why would an omniscient God create Adam and Eve knowing they would commit original sin? Isn’t a father who puts his curious child in a room with a loaded gun, knowing the child will pull the trigger, responsible for the harm when the child pulls the trigger? Augustinian theodicy also leaves unexplained why original sin is inherited. Even if the child is to blame for killing someone, why should the child’s great-great-great-great-grandson still be in prison? Questions like this split Orthodox from Catholic and Reformed into Calvinists and Arminians and continue to plague all denominations. Because of this critique, Augustinian theodicy has in practice tended to either collapse back into Irenaean theodicy or progress into Boydian theodicy, depending on whether omniscience or omnibenevolence is emphasized.\nBoydian:\nEvil exists because of the free-willed choices of the beings over whom God has given authority over the world. Named for theologian Greg Boyd, this theodicy is distinguished from Augustinian theodicy because it denies God’s omniscience. Boyd is the creator of open theology, which asserts that God is not all-knowing about future contingent events. When God created Satan, Adam, and Eve, He delegated to them a libertarian free will that enabled them to make choices He would not know in advance that they would make. Because God vested great power into Satan (“the prince of this world”), and gave Satan free will, Satan causes great harm. Satan, not God, is responsible for 200 billion dead fetuses and 50 billion dead children. But Boydian theodicy is troubled by this question: why God doesn’t intervene to stop Satan now that Satan has chosen evil? If God cannot stop Satan, then He is not omnipotent. If God could stop Satan, but doesn’t because Satan’s evil actions are part of His plan, or because Satan’s free will is mysteriously part of the greater good, then we’ve reverted to Irenaean or Isaiahic. If God could stop Satan, but doesn’t because he made an irrevocable covenant to let Satan be prince of this world, then God is not just lacking in omniscience, he’s lacking in heavenly legal counsel — who writes a job contract without a termination clause for wrongful behavior?\nIf you are satisfied with any of those four theodicies, you should stop here. You have my gratitude for being a reader of this blog, and I do not wish to challenge your faith. The rest of this essay is just for troubled souls.\nIt’s an interesting and intelligent essay. I will share my thoughts on it in a future post, and probably on a future Darkstream as well. In the meantime, it’s no secret that I incline toward the Boydian theodicy, although in doing so I think it is necessary to distinguish between three types of evil: primordial, spiritual, and material if one is to seriously address the topic. The mere fact that there is a Lake of Fire and Outer Darkness into which Satan is to be cast is sufficient to distinguish between the first two, and the fact that humanity links the latter two indicates a need to distinguish between them.\nBut, as I have repeatedly stated, there is no such thing as a “problem” of evil for the Christian in the first place. To the contrary, Christianity is entirely dependent upon its existence; if the world is not fallen, there is no need for salvation. One need not believe in God to recognize the reality of evil, but once one begins to grasp the material existence of evil and the extent to which it permeates the world in which we live, the absolute necessity of God’s Son becomes readily apparent.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-07-07T11:47:16+00:00"
}