{
  "url": "https://voxday.net/2022/07/19/does-a-bear-glow-in-the-woods/",
  "scraped_at": "2026-01-08T13:25:04.938880",
  "title": "Does a Bear Glow in the Woods?",
  "date_display": "July 19, 2022",
  "date_iso": "2022-07-19T14:42:32+00:00",
  "date_from_url": "2022-07-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which Owen and the Beartaria team are accused of <a href=\"https://write.as/sonofyeshua/owen-benjamin-glows\">being a federal operation</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>What I Think Comprises the “Op”</strong></p><p>My best guess: I think that there will be four phases of the operation. I believe we are currently nearing the end of Phase One.</p><p><em>Phase One:</em> Information Collection and list making. Owen is collecting the names and addresses of non-op-team “Bears” via two methods:<br/>All letters sent directly to him have the name and address of the “Bear” recorded.</p><p>All Telegram links in the BTA (Beartaria Times App) that the Op team runs try and identify the Bears on the Telegram chat and then proceed to collect as much information and possible about the person’s views on controversial topics.</p><p><em>Phase Two:</em> Initial roll-up of subset of the “Bears” that Owen and the team has identified and categorized as fitting into the preferred Operational Target (I describe the “Operational Target” in the following section) To provide believable cover for himself, just like those 1980’s Miami Vice episodes, he will ALSO be arrested and it will be a spectacle that is recorded by the op team for purposes of mass media dissemination.</p><p>My best guess is that the timing of will coincide with one of the meet-ups or happen during a meet-up, because of the convenient proximity of the operational targets. Because of this, I predict that Phase Two will happen all in one day sometime during the upcoming Bear Meet-up in the Ozarks.</p><p><em>Phase Three: </em>Phase 3 will be the prosecution and confinement of the preferred Operational Targets identified in phase 1. It will also include, of course, the slipping away of Owen Benjamin or his release based on some legal reason or technicality. This is consistent with prior ops where the leader escapes punishment. Typically, these leaders are on the payroll of security services and make a LOT of money if they are good. Owen Benjamin is the best person I’ve ever seen play the role of “oppressed victim of The System.”</p><p>Owen will have to re-convince his audience that he’s NOT an insider to the operation; some will believe him and others will not. If he plays that role effectively, then Phase 4 will be more successful for the op team.</p><p><em>Phase Four: </em>Phase 4 will be the identification and possible apprehension of those individuals who express vehement anger or rage at the operation, whether they be on social media or otherwise. Given the emphasis of Owen on his family and all of the heart-rending content he posts, this last phase could actually be substantial. All individuals identified will either be 1) Intimidated or 2) Arrested.</p></blockquote><p>Is it possible that Owen is the largest and most unlikely honeypot in FBI history? Sure, it’s possible. Anything is possible. But that’s not the right question. The right question is “what is the probability that Owen and the entire Bear infrastructure are feds?” And the answer to that is: very, very low.</p><p>The two things that immediately  leaped out at me are: a) this came out not long after Patriot Front was, and in my opinion, correctly, ID’d as a federal op. So, a little poisoning of the independent well would make sense at this point in time. And b) the title “Son of Yeshua” is deeply suspect and strongly indicates we’re dealing with a Gamma caught up in the throes of a self-delusion right from the start. Characters with these sorts of appellations almost invariably believe themselves to be some sort of prophet and enjoy predicting future events that never come to pass.</p><p>You would not believe some of the emails and “warnings” that I receive on a regular basis. Suffice it to say that they are never, ever genuine in any way.</p><p>The good news here is that the aforementioned gentleman was kind enough to provide us with a clear predictive model. So, after no one is arrested for anything this summer, we can safely conclude that he’s full of complete nonsense and await the next attempt to discredit another pillar of the Unauthorized community.</p><p>And before the attention of the Panopticon returns to me again, I will confirm that I am not employed or associated with or compensated by any intelligence, surveillance, military, investigative, or police organization. I can’t speak for anyone else on the subject, but I will speak unequivocally for myself.</p><p>As for the accuser, he would do well to keep in mind that “bearing false witness” is not a legitimate activity for the Christian.</p><p><em><a href=\"https://social.infogalactic.com/micropost/932ef6f0-a131-4542-a77a-41fa75e0325a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "In which Owen and the Beartaria team are accused of\nbeing a federal operation\n:\nWhat I Think Comprises the “Op”\nMy best guess: I think that there will be four phases of the operation. I believe we are currently nearing the end of Phase One.\nPhase One:\nInformation Collection and list making. Owen is collecting the names and addresses of non-op-team “Bears” via two methods:\nAll letters sent directly to him have the name and address of the “Bear” recorded.\nAll Telegram links in the BTA (Beartaria Times App) that the Op team runs try and identify the Bears on the Telegram chat and then proceed to collect as much information and possible about the person’s views on controversial topics.\nPhase Two:\nInitial roll-up of subset of the “Bears” that Owen and the team has identified and categorized as fitting into the preferred Operational Target (I describe the “Operational Target” in the following section) To provide believable cover for himself, just like those 1980’s Miami Vice episodes, he will ALSO be arrested and it will be a spectacle that is recorded by the op team for purposes of mass media dissemination.\nMy best guess is that the timing of will coincide with one of the meet-ups or happen during a meet-up, because of the convenient proximity of the operational targets. Because of this, I predict that Phase Two will happen all in one day sometime during the upcoming Bear Meet-up in the Ozarks.\nPhase Three:\nPhase 3 will be the prosecution and confinement of the preferred Operational Targets identified in phase 1. It will also include, of course, the slipping away of Owen Benjamin or his release based on some legal reason or technicality. This is consistent with prior ops where the leader escapes punishment. Typically, these leaders are on the payroll of security services and make a LOT of money if they are good. Owen Benjamin is the best person I’ve ever seen play the role of “oppressed victim of The System.”\nOwen will have to re-convince his audience that he’s NOT an insider to the operation; some will believe him and others will not. If he plays that role effectively, then Phase 4 will be more successful for the op team.\nPhase Four:\nPhase 4 will be the identification and possible apprehension of those individuals who express vehement anger or rage at the operation, whether they be on social media or otherwise. Given the emphasis of Owen on his family and all of the heart-rending content he posts, this last phase could actually be substantial. All individuals identified will either be 1) Intimidated or 2) Arrested.\nIs it possible that Owen is the largest and most unlikely honeypot in FBI history? Sure, it’s possible. Anything is possible. But that’s not the right question. The right question is “what is the probability that Owen and the entire Bear infrastructure are feds?” And the answer to that is: very, very low.\nThe two things that immediately  leaped out at me are: a) this came out not long after Patriot Front was, and in my opinion, correctly, ID’d as a federal op. So, a little poisoning of the independent well would make sense at this point in time. And b) the title “Son of Yeshua” is deeply suspect and strongly indicates we’re dealing with a Gamma caught up in the throes of a self-delusion right from the start. Characters with these sorts of appellations almost invariably believe themselves to be some sort of prophet and enjoy predicting future events that never come to pass.\nYou would not believe some of the emails and “warnings” that I receive on a regular basis. Suffice it to say that they are never, ever genuine in any way.\nThe good news here is that the aforementioned gentleman was kind enough to provide us with a clear predictive model. So, after no one is arrested for anything this summer, we can safely conclude that he’s full of complete nonsense and await the next attempt to discredit another pillar of the Unauthorized community.\nAnd before the attention of the Panopticon returns to me again, I will confirm that I am not employed or associated with or compensated by any intelligence, surveillance, military, investigative, or police organization. I can’t speak for anyone else on the subject, but I will speak unequivocally for myself.\nAs for the accuser, he would do well to keep in mind that “bearing false witness” is not a legitimate activity for the Christian.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "Unauthorized"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-07-19T14:42:34+00:00"
}