{
  "url": "https://voxday.net/2022/07/06/dutch-uprising/",
  "scraped_at": "2026-01-08T13:23:51.268521",
  "title": "Dutch Uprising",
  "date_display": "July 6, 2022",
  "date_iso": "2022-07-06T09:51:11+00:00",
  "date_from_url": "2022-07-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Dutch farmers <a href=\"https://thecountersignal.com/dutch-uprising/\">are leading the charge</a> against the Wicked Evil Fascists and their attempt to starve the nations of the West:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Dutch people are rising up to protest destructive WEF climate law. We are going to share their story with the world.</p><p>The World Economic Forum controlled Dutch government announced last week an end to modern farming – putting harsh controls on nitrogen, and spelling the end to thousands of family farms.<br/>In response, Dutch farmers took a page out of the Canadian Freedom Convoy playbook. They took to the highways, blockaded borders, and launched massive protests.</p><p>So far, the global media has vilified the farmers, brushing aside their concerns with the New World Order-style policy, and propagating government lines.</p></blockquote><p>People are finally beginning to figure out that the self-admitted global population depopulationists actually, really, and truly want them and their children dead, and that they are willing to use a broad variety of tactics designed to do precisely that. And, Russia excluded, they haven’t even begun to fight back yet.</p><p>Karl Denninger’s <a href=\"https://market-ticker.org/akcs-www?post=246285\">skepticism notwithstanding</a> – I’ll address his points directly in a future post, but for now will merely observe that his perspective is proof of how even the smartest, best-informed secularist can’t possibly grasp the entirety of what is happening – the vaccines, the war in Ukraine, and the ongoing collapse of the energy and food supply channels are all various elements of the depopulationist agenda.</p><p>As hard as it is to believe, some people literally seek Hell on Earth, because they believe they will serve their master with honor and privilege in Hell.</p><p><em><a href=\"https://social.infogalactic.com/micropost/a41196a2-0390-4f9a-bbc6-907ddad0c061\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Dutch farmers\nare leading the charge\nagainst the Wicked Evil Fascists and their attempt to starve the nations of the West:\nThe Dutch people are rising up to protest destructive WEF climate law. We are going to share their story with the world.\nThe World Economic Forum controlled Dutch government announced last week an end to modern farming – putting harsh controls on nitrogen, and spelling the end to thousands of family farms.\nIn response, Dutch farmers took a page out of the Canadian Freedom Convoy playbook. They took to the highways, blockaded borders, and launched massive protests.\nSo far, the global media has vilified the farmers, brushing aside their concerns with the New World Order-style policy, and propagating government lines.\nPeople are finally beginning to figure out that the self-admitted global population depopulationists actually, really, and truly want them and their children dead, and that they are willing to use a broad variety of tactics designed to do precisely that. And, Russia excluded, they haven’t even begun to fight back yet.\nKarl Denninger’s\nskepticism notwithstanding\n– I’ll address his points directly in a future post, but for now will merely observe that his perspective is proof of how even the smartest, best-informed secularist can’t possibly grasp the entirety of what is happening – the vaccines, the war in Ukraine, and the ongoing collapse of the energy and food supply channels are all various elements of the depopulationist agenda.\nAs hard as it is to believe, some people literally seek Hell on Earth, because they believe they will serve their master with honor and privilege in Hell.\nDISCUSS ON SG",
  "tags": [
    "economics",
    "globalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-07-06T09:51:12+00:00"
}