{
  "url": "https://voxday.net/2022/07/12/evolutionary-epicycles-and-episyntheses/",
  "scraped_at": "2026-01-08T13:24:28.089337",
  "title": "Evolutionary Epicycles and Episyntheses",
  "date_display": "July 12, 2022",
  "date_iso": "2022-07-12T16:39:29+00:00",
  "date_from_url": "2022-07-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It was long ago, years before I demonstrated the mathematical impossibility of the current synthesis of the theory of evolution by natural selection with genetic science, that I declared evolutionists were going to have to develop a new theory of evolution. And now, lo and behold, some of the evolutionists themselves <a href=\"https://www.theguardian.com/science/2022/jun/28/do-we-need-a-new-theory-of-evolution\">are finally beginning to reach the same conclusion</a> due to the total failure of their pet theory as a useful predictive or explanatory model.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Strange as it sounds, scientists still do not know the answers to some of the most basic questions about how life on Earth evolved. Take eyes, for instance. Where do they come from, exactly? The usual explanation of how we got these stupendously complex organs rests upon the theory of natural selection.</p><p>You may recall the gist from school biology lessons. If a creature with poor eyesight happens to produce offspring with slightly better eyesight, thanks to random mutations, then that tiny bit more vision gives them more chance of survival. The longer they survive, the more chance they have to reproduce and pass on the genes that equipped them with slightly better eyesight. Some of their offspring might, in turn, have better eyesight than their parents, making it likelier that they, too, will reproduce. And so on. Generation by generation, over unfathomably long periods of time, tiny advantages add up. Eventually, after a few hundred million years, you have creatures who can see as well as humans, or cats, or owls.</p><p>This is the basic story of evolution, as recounted in countless textbooks and pop-science bestsellers. The problem, according to a growing number of scientists, is that it is absurdly crude and misleading.</p><p>For one thing, it starts midway through the story, taking for granted the existence of light-sensitive cells, lenses and irises, without explaining where they came from in the first place. Nor does it adequately explain how such delicate and easily disrupted components meshed together to form a single organ. And it isn’t just eyes that the traditional theory struggles with. “The first eye, the first wing, the first placenta. How they emerge. Explaining these is the foundational motivation of evolutionary biology,” says Armin Moczek, a biologist at Indiana University. “And yet, we still do not have a good answer. This classic idea of gradual change, one happy accident at a time, has so far fallen flat.”</p><p>There are certain core evolutionary principles that no scientist seriously questions. Everyone agrees that natural selection plays a role, as does mutation and random chance. But how exactly these processes interact – and whether other forces might also be at work – has become the subject of bitter dispute. “If we cannot explain things with the tools we have right now,” the Yale University biologist Günter Wagner told me, “we must find new ways of explaining.”</p><cite>Do We Need A New Theory Of Evolution, <em>The Guardian</em>, 28 June 2022</cite></blockquote><p>Forget epicycles and Darwinism. Now we’re officially into the realm of episyntheses being required in order to maintain the perception of scientific relevance for natural selection, neo-Darwinism, and neo-Darwinianism. Which means it won’t be long before all the serious scientists are publicly questioning the core evolutionary principles as well.</p><p><em><a href=\"https://social.infogalactic.com/micropost/b5298215-ee4c-4b62-97c6-6699971803d8\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It was long ago, years before I demonstrated the mathematical impossibility of the current synthesis of the theory of evolution by natural selection with genetic science, that I declared evolutionists were going to have to develop a new theory of evolution. And now, lo and behold, some of the evolutionists themselves\nare finally beginning to reach the same conclusion\ndue to the total failure of their pet theory as a useful predictive or explanatory model.\nStrange as it sounds, scientists still do not know the answers to some of the most basic questions about how life on Earth evolved. Take eyes, for instance. Where do they come from, exactly? The usual explanation of how we got these stupendously complex organs rests upon the theory of natural selection.\nYou may recall the gist from school biology lessons. If a creature with poor eyesight happens to produce offspring with slightly better eyesight, thanks to random mutations, then that tiny bit more vision gives them more chance of survival. The longer they survive, the more chance they have to reproduce and pass on the genes that equipped them with slightly better eyesight. Some of their offspring might, in turn, have better eyesight than their parents, making it likelier that they, too, will reproduce. And so on. Generation by generation, over unfathomably long periods of time, tiny advantages add up. Eventually, after a few hundred million years, you have creatures who can see as well as humans, or cats, or owls.\nThis is the basic story of evolution, as recounted in countless textbooks and pop-science bestsellers. The problem, according to a growing number of scientists, is that it is absurdly crude and misleading.\nFor one thing, it starts midway through the story, taking for granted the existence of light-sensitive cells, lenses and irises, without explaining where they came from in the first place. Nor does it adequately explain how such delicate and easily disrupted components meshed together to form a single organ. And it isn’t just eyes that the traditional theory struggles with. “The first eye, the first wing, the first placenta. How they emerge. Explaining these is the foundational motivation of evolutionary biology,” says Armin Moczek, a biologist at Indiana University. “And yet, we still do not have a good answer. This classic idea of gradual change, one happy accident at a time, has so far fallen flat.”\nThere are certain core evolutionary principles that no scientist seriously questions. Everyone agrees that natural selection plays a role, as does mutation and random chance. But how exactly these processes interact – and whether other forces might also be at work – has become the subject of bitter dispute. “If we cannot explain things with the tools we have right now,” the Yale University biologist Günter Wagner told me, “we must find new ways of explaining.”\nDo We Need A New Theory Of Evolution,\nThe Guardian\n, 28 June 2022\nForget epicycles and Darwinism. Now we’re officially into the realm of episyntheses being required in order to maintain the perception of scientific relevance for natural selection, neo-Darwinism, and neo-Darwinianism. Which means it won’t be long before all the serious scientists are publicly questioning the core evolutionary principles as well.\nDISCUSS ON SG",
  "tags": [
    "evolution",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-07-12T16:53:02+00:00"
}