{
  "url": "https://voxday.net/2022/07/01/intentio-nocendi/",
  "scraped_at": "2026-01-08T13:23:30.563396",
  "title": "Intentio Nocendi",
  "date_display": "July 1, 2022",
  "date_iso": "2022-07-01T14:43:26+00:00",
  "date_from_url": "2022-07-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Archbishop Vigano explains that the global depopulationists really do seek <a href=\"https://rwmalonemd.substack.com/p/interview-with-archbishop-carlo-maria\">to kill most of the people in the nations</a> over which they rule. Not because they are stupid – although many of them are genuinely stupid – but because they are wicked and they consciously serve the satanic forces that rule this fallen world.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Up until the pandemic, power was in practice still managed at least formally by individual nations, and laws were passed by Parliaments. But for the last two years, the Parliaments have been deprived of authority, and all those whom the World Economic Forum and other lobbies have succeeded in placing at the high levels of governments and international institutions have begun to legislate against the Constitution and the interests of the Nation, obeying orders given to them from on high – “from the markets,” they tell us – which in fact is made up of a very small number of multinational corporations that engulf competing companies, flatten professional skills with damage to the quality of the product, and reduce the protection and wages of workers thanks to the complicity of unions and of the Left.</p><p>In short, we are governed by a high command of usurers and speculators, from Bill Gates who invests in large farms right on the eve of the food emergency or in vaccines just before the outbreak of the pandemic, to George Soros, who speculates on the fluctuations of currencies and government bonds and along with Hunter Biden finances a bio-laboratory in Ukraine.</p><p>To think that there is no relationship between the instigators of these crimes and those who carry them out at the highest levels of national governments, the EU, and the UN is a sign of bad faith, because even a child could understand that we are held hostage by a group of technocrats who are ideologically deviant and morally corrupt. The peoples of the world need to reclaim their sovereignty, which has been usurped by the globalist elite.</p><p>The instigators of this crime show themselves proudly at the Davos Forum, at meetings of the Trilateral Commission or the Bilderberg Group along with the rulers, prime ministers, directors of newspapers and television broadcasters, CEOs of social bankers and directors of social platforms and multinational corporations, bankers and directors of ratings agencies, presidents of foundations and self-styled philanthropists. All of these share the same agenda – which they publish on their websites – and are so confident in their own power that they affirm it with impunity – as Soros and Schwab have recently done – that it is necessary to create a narrative to be conveyed through the mainstream media, in order to make their decisions acceptable to the people. They embrace censorship and mass manipulation as instrumentum regni, and we have had proof of this both with the pandemic farce as well as with the pro-Zelensky propaganda in Ukraine.</p><p><strong>We must understand that our rulers are traitors of our Nation who are devoted to the elimination of populations, and that all of their actions are carried out in order to cause the greatest amount of harm to citizens.</strong> It is not a problem of inexperience or inability but rather of an<em> intentio nocendi</em> – a deliberate intention to harm. Honest citizens find it inconceivable that those who govern them could do it with the perverse intention of undermining and destroying them, so much so that they find it very hard to believe. The main cause of this very serious problem is found in the corruption of authority along with the resigned obedience of those who are governed.</p></blockquote><p>Nothing that the wicked do is going to “work” in the traditional sense, nothing is going to function “properly”, because they actually seek to manage the inevitable collapse of their evil order in a form that will permit them to retain their influence, fancy pants, and lollipops.</p><p>Mankind’s ultimate hope can only be in Jesus Christ. But in the material sense, his only hope is in <em>what appears to be</em> the resistance to the corrupted and converged neoliberal order, which cannot truly be described as “a world order” anymore now that the BRICS have openly declared their intention to replace it. However, it must be well understood that the nascent sovereign order of nations will not be a return to Christendom, although we may reasonably hope that there is a place for Christendom within it.</p><p>Regardless, this deep devotion to wickedness on the part of the primary actors is why very intelligent secularists are having such a difficult time understanding, anticipating, or even correctly describing current events. Unless and until one accepts the reality of the Christian perspective, and admits the centrality of the struggle between repentant Man and unrepentant Angel, one cannot possibly make any sense of what is happening around the world today.</p><p>But there is no reason for fear or despair, for as the Archbishop himself observes, their failure is inevitable and their fate is inescapable.</p><p><em>The Great Reset is ontologically destined for failure, because it is inspired by inhuman and diabolical principles. But its end, however inevitable, may still take some time, depending on our capacity to oppose it and also what is contained in the plans of Divine Providence.</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/d44f0718-7f0d-4060-86e2-9c667c229195\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Archbishop Vigano explains that the global depopulationists really do seek\nto kill most of the people in the nations\nover which they rule. Not because they are stupid – although many of them are genuinely stupid – but because they are wicked and they consciously serve the satanic forces that rule this fallen world.\nUp until the pandemic, power was in practice still managed at least formally by individual nations, and laws were passed by Parliaments. But for the last two years, the Parliaments have been deprived of authority, and all those whom the World Economic Forum and other lobbies have succeeded in placing at the high levels of governments and international institutions have begun to legislate against the Constitution and the interests of the Nation, obeying orders given to them from on high – “from the markets,” they tell us – which in fact is made up of a very small number of multinational corporations that engulf competing companies, flatten professional skills with damage to the quality of the product, and reduce the protection and wages of workers thanks to the complicity of unions and of the Left.\nIn short, we are governed by a high command of usurers and speculators, from Bill Gates who invests in large farms right on the eve of the food emergency or in vaccines just before the outbreak of the pandemic, to George Soros, who speculates on the fluctuations of currencies and government bonds and along with Hunter Biden finances a bio-laboratory in Ukraine.\nTo think that there is no relationship between the instigators of these crimes and those who carry them out at the highest levels of national governments, the EU, and the UN is a sign of bad faith, because even a child could understand that we are held hostage by a group of technocrats who are ideologically deviant and morally corrupt. The peoples of the world need to reclaim their sovereignty, which has been usurped by the globalist elite.\nThe instigators of this crime show themselves proudly at the Davos Forum, at meetings of the Trilateral Commission or the Bilderberg Group along with the rulers, prime ministers, directors of newspapers and television broadcasters, CEOs of social bankers and directors of social platforms and multinational corporations, bankers and directors of ratings agencies, presidents of foundations and self-styled philanthropists. All of these share the same agenda – which they publish on their websites – and are so confident in their own power that they affirm it with impunity – as Soros and Schwab have recently done – that it is necessary to create a narrative to be conveyed through the mainstream media, in order to make their decisions acceptable to the people. They embrace censorship and mass manipulation as instrumentum regni, and we have had proof of this both with the pandemic farce as well as with the pro-Zelensky propaganda in Ukraine.\nWe must understand that our rulers are traitors of our Nation who are devoted to the elimination of populations, and that all of their actions are carried out in order to cause the greatest amount of harm to citizens.\nIt is not a problem of inexperience or inability but rather of an\nintentio nocendi\n– a deliberate intention to harm. Honest citizens find it inconceivable that those who govern them could do it with the perverse intention of undermining and destroying them, so much so that they find it very hard to believe. The main cause of this very serious problem is found in the corruption of authority along with the resigned obedience of those who are governed.\nNothing that the wicked do is going to “work” in the traditional sense, nothing is going to function “properly”, because they actually seek to manage the inevitable collapse of their evil order in a form that will permit them to retain their influence, fancy pants, and lollipops.\nMankind’s ultimate hope can only be in Jesus Christ. But in the material sense, his only hope is in\nwhat appears to be\nthe resistance to the corrupted and converged neoliberal order, which cannot truly be described as “a world order” anymore now that the BRICS have openly declared their intention to replace it. However, it must be well understood that the nascent sovereign order of nations will not be a return to Christendom, although we may reasonably hope that there is a place for Christendom within it.\nRegardless, this deep devotion to wickedness on the part of the primary actors is why very intelligent secularists are having such a difficult time understanding, anticipating, or even correctly describing current events. Unless and until one accepts the reality of the Christian perspective, and admits the centrality of the struggle between repentant Man and unrepentant Angel, one cannot possibly make any sense of what is happening around the world today.\nBut there is no reason for fear or despair, for as the Archbishop himself observes, their failure is inevitable and their fate is inescapable.\nThe Great Reset is ontologically destined for failure, because it is inspired by inhuman and diabolical principles. But its end, however inevitable, may still take some time, depending on our capacity to oppose it and also what is contained in the plans of Divine Providence.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "decline and fall",
    "globalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-07-01T14:47:42+00:00"
}