{
  "url": "https://voxday.net/2022/07/22/iq-estimation-guide/",
  "scraped_at": "2026-01-08T13:25:21.139438",
  "title": "IQ Estimation Guide",
  "date_display": "July 22, 2022",
  "date_iso": "2022-07-22T10:27:51+00:00",
  "date_from_url": "2022-07-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Pursuant to <a href=\"https://social.infogalactic.com/micropost/fe0a0661-789c-4670-a63d-0229fd57efcb/comment/177d4a15-7ba4-4ed2-be5c-58a55c3bf4d5\">a discussion on SocialGalactic</a>, I put together a rough guide based on IQ rarity. Obviously, there are outliers in both group and individual terms, but if you’re an average individual of European descent and you have literally no information with which to base an estimate, this should suffice as a starting point.</p><p>A rough guide based on IQ rarity:</p><ul class=\"wp-block-list\"><li>110 = Smartest person in your close friend circle.</li><li>124 = Smartest person in your extended family.</li><li>140 = Smartest person in your entire social circle of friends and acquaintances.</li><li>180 = Smartest person at your college or university.</li></ul><p>To estimate your own intelligence, deduct 2 points for each person in that group you believe to be smarter than you.</p><p><strong>NSB: </strong>It is absolutely <span style=\"text-decoration: underline;\">not</span> necessary to explain that this rough guide does not apply to you, your friends, your extended family, or your social circle because you are such a smart and special boy. And yes, NSB stands for <em>Nota Smartus Boyum</em>.</p></div>",
  "content_text": "Pursuant to\na discussion on SocialGalactic\n, I put together a rough guide based on IQ rarity. Obviously, there are outliers in both group and individual terms, but if you’re an average individual of European descent and you have literally no information with which to base an estimate, this should suffice as a starting point.\nA rough guide based on IQ rarity:\n110 = Smartest person in your close friend circle.\n124 = Smartest person in your extended family.\n140 = Smartest person in your entire social circle of friends and acquaintances.\n180 = Smartest person at your college or university.\nTo estimate your own intelligence, deduct 2 points for each person in that group you believe to be smarter than you.\nNSB:\nIt is absolutely\nnot\nnecessary to explain that this rough guide does not apply to you, your friends, your extended family, or your social circle because you are such a smart and special boy. And yes, NSB stands for\nNota Smartus Boyum\n.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-07-22T10:27:53+00:00"
}