{
  "url": "https://voxday.net/2022/07/05/jordan-peterson-rolls-over/",
  "scraped_at": "2026-01-08T13:23:47.892793",
  "title": "Jordan Peterson Rolls Over",
  "date_display": "July 5, 2022",
  "date_iso": "2022-07-05T12:42:32+00:00",
  "date_from_url": "2022-07-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I told you, repeatedly, that Jordan Peterson was steeped in the occult and was a servant of evil. I warned you, repeatedly, that he never was, and he never will be, on the side of the Good, the Beautiful, and the True. I pointed out, repeatedly, that excessively charitable Christians have been saying that Peterson has “been moving toward Christianity” for four years without ever getting anywhere that even remotely resembles the genuine faith.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A recent podcast discussion between Dr. Jordan Peterson and ‘married’ homosexual Dave Rubin titled “Gay Parenting: Promise and Pitfalls” further demonstrates that homosexuality and homosexual marriage have conquered nearly all conservative elites.  </p><p>Just seven years and one week since the U.S. released its decision in the Obergefell same-sex ‘marriage’ case, the impulse among high profile conservative thinkers and opinionators is not to preserve the immutable definition of marriage, but to justify mutilating it to include two men or two women as “married.”  </p><p>“This is a political issue. We’re trying to sketch out a pathway … I mean, our culture appears to have decided that gay marriage has become part of the structure of marriage itself,” Peterson stated at the outset of the hour and a half discussion, waving an enormous white flag of surrender. .. Peterson casually tossed the definition of marriage into the dustbin of history, claiming that “Marriage is the union of two people,” not the union of a man and a woman. He nonchalantly trashed civilization’s understanding of nature and biology and the understanding of every society and religion around the world for thousands of years.   </p></blockquote><p>Jordan Peterson failed as both a gatekeeper and an intellectual before his descent into depression and drug addiction. <a href=\"https://www.lifesitenews.com/news/dr-jordan-peterson-bends-the-knee-to-homosexual-marriage-and-parenting-in-interview-with-dave-rubin/\">His second coming is as a neoconservative figurehead</a>, featuring a shiny new leash held by Ben Shapiro’s master. Now he will bark and perform conservative tricks on command. This recent discussion is a useful reminder of two things: a) the total uselessness of “high profile conservative thinkers” and b) the fact that the devil cares nothing for those who serve him and is particularly cruel to those who fail him.</p><p>Those who fall from the devil’s high horse seldom fare well.</p><p><em><a href=\"https://social.infogalactic.com/micropost/1355277d-9284-4046-b6e2-cccb8b9a4963\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I told you, repeatedly, that Jordan Peterson was steeped in the occult and was a servant of evil. I warned you, repeatedly, that he never was, and he never will be, on the side of the Good, the Beautiful, and the True. I pointed out, repeatedly, that excessively charitable Christians have been saying that Peterson has “been moving toward Christianity” for four years without ever getting anywhere that even remotely resembles the genuine faith.\nA recent podcast discussion between Dr. Jordan Peterson and ‘married’ homosexual Dave Rubin titled “Gay Parenting: Promise and Pitfalls” further demonstrates that homosexuality and homosexual marriage have conquered nearly all conservative elites.\nJust seven years and one week since the U.S. released its decision in the Obergefell same-sex ‘marriage’ case, the impulse among high profile conservative thinkers and opinionators is not to preserve the immutable definition of marriage, but to justify mutilating it to include two men or two women as “married.”\n“This is a political issue. We’re trying to sketch out a pathway … I mean, our culture appears to have decided that gay marriage has become part of the structure of marriage itself,” Peterson stated at the outset of the hour and a half discussion, waving an enormous white flag of surrender. .. Peterson casually tossed the definition of marriage into the dustbin of history, claiming that “Marriage is the union of two people,” not the union of a man and a woman. He nonchalantly trashed civilization’s understanding of nature and biology and the understanding of every society and religion around the world for thousands of years.\nJordan Peterson failed as both a gatekeeper and an intellectual before his descent into depression and drug addiction.\nHis second coming is as a neoconservative figurehead\n, featuring a shiny new leash held by Ben Shapiro’s master. Now he will bark and perform conservative tricks on command. This recent discussion is a useful reminder of two things: a) the total uselessness of “high profile conservative thinkers” and b) the fact that the devil cares nothing for those who serve him and is particularly cruel to those who fail him.\nThose who fall from the devil’s high horse seldom fare well.\nDISCUSS ON SG",
  "tags": [
    "decline and fall",
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-07-05T12:42:34+00:00"
}