{
  "url": "https://voxday.net/2022/07/24/leaving-the-west-behind/",
  "scraped_at": "2026-01-08T13:25:33.273814",
  "title": "Leaving the West Behind",
  "date_display": "July 24, 2022",
  "date_iso": "2022-07-24T09:56:18+00:00",
  "date_from_url": "2022-07-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s clear that the primary reason for the current desperation of the Prometheans stems from the way they seriously underestimated the Chinese. But the Chinese have turned out to be significantly harder to fool than the Europeans of the West, and now they are demonstrating that they no longer require guidance in order to advance their technology<a href=\"https://www.thefinancialtrends.com/2022/07/22/china-now-produces-semiconductors-better-than-the-us/\"> beyond Western levels</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A report by Bloomberg Thursday found that Semiconductor Manufacturing International Corp (SMIC). China’s premier chip manufacturer has developed the ability to produce chips to the highest Western standards despite US sanctions that had been designed to prevent such an advance.</p><p>According to a report by industry blog Tech Insights, which Bloomberg has confirmed, SMIC has produced Bitcoin mining semiconductors with 7-nanometer technology since last July. The figure represents the size of the transistors involved, and the smaller the figure, the smaller the transistors, and the more transistors that can be fit on a single chip. The more transistors on a chip, the faster and more efficient it will be.</p><p>Previously SMIC had only produced chips to a standard of 14-nanometers, and the US government had hoped to prevent any advance beyond that level. In 2020, the US government had banned export of equipment capable of producing 10nm and below level chips to SMIC. Currently the US government is focusing on preventing Dutch supplier ASML from supplying similar machines to SMIC.</p><p>Although ASML is already forbidden from selling its most advanced equipment to SMIC, the Biden administration is trying to tighten the ban to include less advanced technologies as well.</p><p>Currently Taiwan’s TSMC and South Korea’s Samsung can make 7nm semiconductors, while US-based Intel is slated to release its own 7nm chip next year. Currently the most advanced US and European chips are only 12nm.</p><p>It is not clear how China has reached this level of technological sophistication. Some have suggested they may have modified their 14nm tooling.</p></blockquote><p>Meanwhile, in Europe, <a href=\"https://www.rt.com/business/559439-switzerland-energy-saving-plan/\">the lights may literally be going out</a> this winter thanks to the reprehensible stupidity of the European leaders who believed the lies of the neocons and agreed to act as the USA’s economic proxy army:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Switzerland has developed an emergency plan in the event of an energy crisis if natural gas and electricity supplies run short, the <em>Basler Zeitung</em> newspaper reported this week.</p><p>According to the paper, the Swiss government has been working in tandem with industrial companies for several months on the plan. It includes several steps, ranging from a public awareness campaign with calls for energy saving, such as turning off shop window lights and heaters, to rationing electricity for about 30,000 large energy consumers.</p><p>The government also warns of the possibility of power shutdowns in certain areas of the country from four to eight hours a day as a more stringent measure.</p></blockquote><p>As I have repeatedly warned you, we’ll be fortunate if we emerge on the other end of this civilizational catastrophe with interior plumbing. Abandoning the traditions of your fathers, adopting foreign creeds and accepting foreign rulers seldom ends well for any nation.</p><p><em><a href=\"https://social.infogalactic.com/micropost/36db968b-6ff6-4821-9f63-9c55d01afa69\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s clear that the primary reason for the current desperation of the Prometheans stems from the way they seriously underestimated the Chinese. But the Chinese have turned out to be significantly harder to fool than the Europeans of the West, and now they are demonstrating that they no longer require guidance in order to advance their technology\nbeyond Western levels\n.\nA report by Bloomberg Thursday found that Semiconductor Manufacturing International Corp (SMIC). China’s premier chip manufacturer has developed the ability to produce chips to the highest Western standards despite US sanctions that had been designed to prevent such an advance.\nAccording to a report by industry blog Tech Insights, which Bloomberg has confirmed, SMIC has produced Bitcoin mining semiconductors with 7-nanometer technology since last July. The figure represents the size of the transistors involved, and the smaller the figure, the smaller the transistors, and the more transistors that can be fit on a single chip. The more transistors on a chip, the faster and more efficient it will be.\nPreviously SMIC had only produced chips to a standard of 14-nanometers, and the US government had hoped to prevent any advance beyond that level. In 2020, the US government had banned export of equipment capable of producing 10nm and below level chips to SMIC. Currently the US government is focusing on preventing Dutch supplier ASML from supplying similar machines to SMIC.\nAlthough ASML is already forbidden from selling its most advanced equipment to SMIC, the Biden administration is trying to tighten the ban to include less advanced technologies as well.\nCurrently Taiwan’s TSMC and South Korea’s Samsung can make 7nm semiconductors, while US-based Intel is slated to release its own 7nm chip next year. Currently the most advanced US and European chips are only 12nm.\nIt is not clear how China has reached this level of technological sophistication. Some have suggested they may have modified their 14nm tooling.\nMeanwhile, in Europe,\nthe lights may literally be going out\nthis winter thanks to the reprehensible stupidity of the European leaders who believed the lies of the neocons and agreed to act as the USA’s economic proxy army:\nSwitzerland has developed an emergency plan in the event of an energy crisis if natural gas and electricity supplies run short, the\nBasler Zeitung\nnewspaper reported this week.\nAccording to the paper, the Swiss government has been working in tandem with industrial companies for several months on the plan. It includes several steps, ranging from a public awareness campaign with calls for energy saving, such as turning off shop window lights and heaters, to rationing electricity for about 30,000 large energy consumers.\nThe government also warns of the possibility of power shutdowns in certain areas of the country from four to eight hours a day as a more stringent measure.\nAs I have repeatedly warned you, we’ll be fortunate if we emerge on the other end of this civilizational catastrophe with interior plumbing. Abandoning the traditions of your fathers, adopting foreign creeds and accepting foreign rulers seldom ends well for any nation.\nDISCUSS ON SG",
  "tags": [
    "China",
    "decline and fall",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-07-24T09:56:20+00:00"
}