{
  "url": "https://voxday.net/2022/07/25/on-awards/",
  "scraped_at": "2026-01-08T13:25:40.571919",
  "title": "On Awards",
  "date_display": "July 25, 2022",
  "date_iso": "2022-07-25T10:07:31+00:00",
  "date_from_url": "2022-07-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Keep this in mind if you’re ever inclined to feel that you haven’t been properly recognized for your achievements, whatever they might be.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Nolan Ryan has more strikeouts than any pitcher in baseball history and has thrown more no-hitters (Ryan has seven, Sandy Koufax is second with four) than any pitcher. He had seasons of 383, 367, 341, 329 and 327 strikeouts. He had nine complete-game shutouts in 1972, and two seasons of 26 complete games.</p><p>Ryan never won the Cy Young Award.</p></blockquote><p>Awards used to be popularity contests. Now they’re just Narrative Approval contests. In either case, they are entirely irrelevant with regards to actually recognizing genuine accomplishment in a field. They mean literally nothing, as the Puppies demonstrated when <em>Space Raptor Butt Invasion</em> and <em>Alien Stripper Boned By The T-Rex </em>were both nominated for Hugo Awards, and as the SF-SJWs conclusively proved when they tried to claim, with a straight face, that a black female performance artist had written the best novel in science fiction for three straight years.</p><p>For crying out loud, Paul Krugman, who is RELIABLY wrong and has just released yet another mea culpa, has been given numerous economics awards. And do you know who never won a</p><p>This isn’t sour grapes. In addition to my many Puppy-powered Hugo Award nominations, I have been received various academic awards, athletic awards, and music awards – not too many people can say they beat out Prince himself for a music award for which he was also nominated – and have absolutely no idea what I did with any of them. I did find two Hugo rocket pins in a Euro change box the other day, though, for whatever that’s worth.</p><p>Achievement speaks for itself and should be pursued for its own sake. Merit is not determined by those who are established in their industry and seek to control it.</p><p><strong>UPDATE: </strong>It’s worth noting that JRR Tolkien never won a Hugo Award or a Nebula Award, and never even made the shortlist for one.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Although certainly not obscure on release, it [<em>The Lord of the Rings</em>] was not immediately regarded as a classic and the American WorldCon attendees (the two ceremonies were held in Cleveland, Ohio and New York City, respectively) seem to have pretty much ignored it. The 1955 Best Hugo was instead given to Mark Clifton and Frank Riley’s <em>They’d Rather Be Right </em>and the 1956 award to Robert A. Heinlein’s <em>Double Star</em>.</p><p>In 1966, the Hugo Awards introduced a one-off “Best All-Time Series” category. It was widely assumed by many (but most notably Isaac Asimov) that the award was introduced solely to reward The Lord of the Rings and to make up for the book’s initial publication being overlooked. Surprisingly, the award went instead to Asimov’s Foundation Trilogy, as it then was.</p></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/76ae46ea-18c1-4a8b-9402-7e6d0dd95494\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Keep this in mind if you’re ever inclined to feel that you haven’t been properly recognized for your achievements, whatever they might be.\nNolan Ryan has more strikeouts than any pitcher in baseball history and has thrown more no-hitters (Ryan has seven, Sandy Koufax is second with four) than any pitcher. He had seasons of 383, 367, 341, 329 and 327 strikeouts. He had nine complete-game shutouts in 1972, and two seasons of 26 complete games.\nRyan never won the Cy Young Award.\nAwards used to be popularity contests. Now they’re just Narrative Approval contests. In either case, they are entirely irrelevant with regards to actually recognizing genuine accomplishment in a field. They mean literally nothing, as the Puppies demonstrated when\nSpace Raptor Butt Invasion\nand\nAlien Stripper Boned By The T-Rex\nwere both nominated for Hugo Awards, and as the SF-SJWs conclusively proved when they tried to claim, with a straight face, that a black female performance artist had written the best novel in science fiction for three straight years.\nFor crying out loud, Paul Krugman, who is RELIABLY wrong and has just released yet another mea culpa, has been given numerous economics awards. And do you know who never won a\nThis isn’t sour grapes. In addition to my many Puppy-powered Hugo Award nominations, I have been received various academic awards, athletic awards, and music awards – not too many people can say they beat out Prince himself for a music award for which he was also nominated – and have absolutely no idea what I did with any of them. I did find two Hugo rocket pins in a Euro change box the other day, though, for whatever that’s worth.\nAchievement speaks for itself and should be pursued for its own sake. Merit is not determined by those who are established in their industry and seek to control it.\nUPDATE:\nIt’s worth noting that JRR Tolkien never won a Hugo Award or a Nebula Award, and never even made the shortlist for one.\nAlthough certainly not obscure on release, it [\nThe Lord of the Rings\n] was not immediately regarded as a classic and the American WorldCon attendees (the two ceremonies were held in Cleveland, Ohio and New York City, respectively) seem to have pretty much ignored it. The 1955 Best Hugo was instead given to Mark Clifton and Frank Riley’s\nThey’d Rather Be Right\nand the 1956 award to Robert A. Heinlein’s\nDouble Star\n.\nIn 1966, the Hugo Awards introduced a one-off “Best All-Time Series” category. It was widely assumed by many (but most notably Isaac Asimov) that the award was introduced solely to reward The Lord of the Rings and to make up for the book’s initial publication being overlooked. Surprisingly, the award went instead to Asimov’s Foundation Trilogy, as it then was.\nDISCUSS ON SG",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-07-25T11:37:04+00:00"
}