{
  "url": "https://voxday.net/2022/07/22/scientology-science/",
  "scraped_at": "2026-01-08T13:25:22.602861",
  "title": "Scientology > Science",
  "date_display": "July 22, 2022",
  "date_iso": "2022-07-22T13:32:44+00:00",
  "date_from_url": "2022-07-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tom Cruise was correct about psychiatry and its snake oil solution for nonexistent “chemical imbalances” all along.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>TOM CRUISE: </strong>Here we are today, where I talk out against drugs and psychiatric abuses of electro-shocking people against their will, drugging children, with them not knowing the effects of these drugs. Do you know what Adderall is, do you know Ritalin? Do you now that Ritalin is a street drug? Do you understand that?</p><p><strong>MATT LAUER: </strong>The difference is that this was not against her will, though.</p><p><strong>TOM CRUISE:</strong> Matt, I’m asking you a question.</p><p><strong>MATT LAUER: </strong>I understand there’s abuse of all of these things.</p><p><strong>TOM CRUISE:</strong> No, you see, here’s the problem. You don’t know the history of psychiatry. I do. All it does is mask the problem, Matt. And if you understand the history of it, it masks the problem. That’s what it does. That’s all it does. You’re not getting to the reason why. There is no such thing as a chemical imbalance. I’m saying that drugs are not the answer. These substances are very dangerous. They’re mind-altering anti-psychotic drugs. And there are ways of doing it without that, so we don’t end up in A Brave New World.</p><p><strong>MATT LAUER: </strong>Yes, there are abuses. And yes, maybe we’ve gone too far in certain areas. Maybe there are too many kids on Ritalin. But aren’t there examples where it works.</p><p><strong>TOM CRUISE:</strong> Too many kids on Ritalin? Matt, you’re glib. You don’t even know what Ritalin is. If you start talking about chemical imbalance, you have to evaluate and read the research papers on how they came up with these theories. That’s what I’ve done. You go and you say, where’s the medical test? Where’s the blood test that says how much Ritalin you’re supposed to get?</p><p><strong>MATT LAUER: </strong>It’s very impressive to listen to you, because clearly you’ve done the homework and you know the subject.</p><p><strong>TOM CRUISE:</strong> And you should. And you should do that also, because just knowing people who are on Ritalin isn’t enough.</p></blockquote><p>After decades of blindly assuming that depression is caused by chemical imbalances, and subjecting tens of millions of people to mind-altering drugs, <a href=\"https://www.theweek.co.uk/news/science-health/957409/depression-chemical-imbalance-theory-not-grounded-in-science\">scientists have finally begun to catch up</a> to Tom Cruise and the Scientologists.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A scientific review has concluded that depression is not caused by chemical imbalances in the brain, and may be more closely linked to stressful life events.</p><p>The review, conducted by University College London and published in the Molecular Psychiatry journal, examined the “serotonin theory of depression”, an “influential” and long-held belief that lower serotonin levels may make an individual more likely to experience depression.</p><p>A link between serotonin levels and depression was first put forward in the 1960s, and antidepressant use has increased since the 1990s with the development of Selective Serotonin Reuptake Inhibitor antidepressants. One in six adults in England are currently prescribed antidepressants, many of which help to adjust serotonin levels.</p><p>“Many people take antidepressants because they have been led to believe their depression has a biochemical cause, but this research suggests this belief is not grounded in evidence,” said Professor Joanna Moncrieff, the study’s lead author.</p><p>The authors examined studies into the chemical’s impact on depression, including studies where participants’ serotonin levels were artificially lowered through dietary methods. In both cases, a link could not be established.</p></blockquote><p>Better late than never. Now do vaccines…. And keep this in mind someone tells you to “trust the science”. The official science narrative is observably less trustworthy than the Xenu science fiction cult.</p><p><em><a href=\"https://social.infogalactic.com/micropost/8823ffa6-2e13-4c86-bcd0-b20293521bb2\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Tom Cruise was correct about psychiatry and its snake oil solution for nonexistent “chemical imbalances” all along.\nTOM CRUISE:\nHere we are today, where I talk out against drugs and psychiatric abuses of electro-shocking people against their will, drugging children, with them not knowing the effects of these drugs. Do you know what Adderall is, do you know Ritalin? Do you now that Ritalin is a street drug? Do you understand that?\nMATT LAUER:\nThe difference is that this was not against her will, though.\nTOM CRUISE:\nMatt, I’m asking you a question.\nMATT LAUER:\nI understand there’s abuse of all of these things.\nTOM CRUISE:\nNo, you see, here’s the problem. You don’t know the history of psychiatry. I do. All it does is mask the problem, Matt. And if you understand the history of it, it masks the problem. That’s what it does. That’s all it does. You’re not getting to the reason why. There is no such thing as a chemical imbalance. I’m saying that drugs are not the answer. These substances are very dangerous. They’re mind-altering anti-psychotic drugs. And there are ways of doing it without that, so we don’t end up in A Brave New World.\nMATT LAUER:\nYes, there are abuses. And yes, maybe we’ve gone too far in certain areas. Maybe there are too many kids on Ritalin. But aren’t there examples where it works.\nTOM CRUISE:\nToo many kids on Ritalin? Matt, you’re glib. You don’t even know what Ritalin is. If you start talking about chemical imbalance, you have to evaluate and read the research papers on how they came up with these theories. That’s what I’ve done. You go and you say, where’s the medical test? Where’s the blood test that says how much Ritalin you’re supposed to get?\nMATT LAUER:\nIt’s very impressive to listen to you, because clearly you’ve done the homework and you know the subject.\nTOM CRUISE:\nAnd you should. And you should do that also, because just knowing people who are on Ritalin isn’t enough.\nAfter decades of blindly assuming that depression is caused by chemical imbalances, and subjecting tens of millions of people to mind-altering drugs,\nscientists have finally begun to catch up\nto Tom Cruise and the Scientologists.\nA scientific review has concluded that depression is not caused by chemical imbalances in the brain, and may be more closely linked to stressful life events.\nThe review, conducted by University College London and published in the Molecular Psychiatry journal, examined the “serotonin theory of depression”, an “influential” and long-held belief that lower serotonin levels may make an individual more likely to experience depression.\nA link between serotonin levels and depression was first put forward in the 1960s, and antidepressant use has increased since the 1990s with the development of Selective Serotonin Reuptake Inhibitor antidepressants. One in six adults in England are currently prescribed antidepressants, many of which help to adjust serotonin levels.\n“Many people take antidepressants because they have been led to believe their depression has a biochemical cause, but this research suggests this belief is not grounded in evidence,” said Professor Joanna Moncrieff, the study’s lead author.\nThe authors examined studies into the chemical’s impact on depression, including studies where participants’ serotonin levels were artificially lowered through dietary methods. In both cases, a link could not be established.\nBetter late than never. Now do vaccines…. And keep this in mind someone tells you to “trust the science”. The official science narrative is observably less trustworthy than the Xenu science fiction cult.\nDISCUSS ON SG",
  "tags": [
    "healthcare",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-07-22T13:37:39+00:00"
}