{
  "url": "https://voxday.net/2022/07/13/the-wests-fatal-flaw/",
  "scraped_at": "2026-01-08T13:24:31.012087",
  "title": "The West’s Fatal Flaw",
  "date_display": "July 13, 2022",
  "date_iso": "2022-07-13T01:29:10+00:00",
  "date_from_url": "2022-07-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If Michael Hudson is correct, Western Civilization will ultimately fall because <a href=\"https://thesaker.is/michael-hudson-the-end-of-western-civilization-why-it-lacks-resilience-and-what-will-take-its-place/\">Christians failed to understand</a> what “forgive them their debts” actually meant:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The greatest challenge facing societies has always been how to conduct trade and credit without letting merchants and creditors make money by exploiting their customers and debtors. All antiquity recognized that the drive to acquire money is addictive and indeed tends to be exploitative and hence socially injurious. The moral values of most societies opposed selfishness, above all in the form of avarice and wealth addiction, which the Greeks called <em>philarguria </em>– love of money, silver-mania. Individuals and families indulging in conspicuous consumption tended to be ostracized, because it was recognized that wealth often was obtained at the expense of others, especially the weak.</p><p>The Greek concept of hubris involved egotistic behavior causing injury to others. Avarice and greed were to be punished by the justice goddess Nemesis, who had many Near Eastern antecedents, such as Nanshe of Lagash in Sumer, protecting the weak against the powerful, the debtor against the creditor.</p><p>That protection is what rulers were expected to provide in serving the gods. That is why rulers were imbued with enough power to protect the population from being reduced to debt dependency and clientage. Chieftains, kings and temples were in charge of allocating credit and crop-land to enable smallholders to serve in the army and provide corvée labor. Rulers who behaved selfishly were liable to be unseated, or their subjects might run away, or support rebel leaders or foreign attackers promising to cancel debts and redistribute land more equitably.</p><p>The most basic function of Near Eastern kingship was to proclaim “economic order,” misharum and andurarum clean slate debt cancellations, echoed in Judaism’s Jubilee Year. There was no “democracy” in the sense of citizens electing their leaders and administrators, but “divine kingship” was obliged to achieve the implicit economic aim of democracy: “protecting the weak from the powerful.”</p><p>Royal power was backed by temples and ethical or religious systems. The major religions that emerged in the mid-first millennium BC, those of Buddha, Lao-Tzu and Zoroaster, held that personal drives should be subordinate to the promotion of overall welfare and mutual aid.</p><p>What did not seem likely 2500 years ago was that a warlord aristocracy would conquer the Western world. In creating what became the Roman Empire, an oligarchy took control of the land and, in due course, the political system. It abolished royal or civic authority, shifted the fiscal burden onto the lower classes, and ran the population and industry into debt.</p><p>This was done on a purely opportunistic basis. There was no attempt to defend this ideologically. There was no hint of an archaic Milton Friedman emerging to popularize a radical new moral order celebrating avarice by claiming that greed is what drives economies forward, not backward, convincing society to leave the distribution of land and money to “the market” controlled by private corporations and money-lenders instead of communalistic regulation by palace rulers and temples – or by extension, today’s socialism. Palaces, temples and civic governments were creditors. They were not forced to borrow to function, and so were not subjected to the policy demands of a private creditor class.</p><p>But running the population, industry and even governments into debt to an oligarchic elite is precisely what has occurred in the West, which is now trying to impose the modern variant of this debt-based economic regime – U.S.-centered neoliberal finance capitalism – on the entire world. That is what today’s New Cold War is all about.</p></blockquote><p>It’s not socialism to forgive debt. It’s not irresponsible to forgive debt. It’s not economically unsound to forgive debt. To the contrary, debt forgiveness is Christian, it is civilized, and it is absolutely necessary on a regular basis in any society that permits legal usury.</p><p><em><a href=\"https://social.infogalactic.com/micropost/66cbe978-783c-41ce-a9e0-82f0e9443ff2\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "If Michael Hudson is correct, Western Civilization will ultimately fall because\nChristians failed to understand\nwhat “forgive them their debts” actually meant:\nThe greatest challenge facing societies has always been how to conduct trade and credit without letting merchants and creditors make money by exploiting their customers and debtors. All antiquity recognized that the drive to acquire money is addictive and indeed tends to be exploitative and hence socially injurious. The moral values of most societies opposed selfishness, above all in the form of avarice and wealth addiction, which the Greeks called\nphilarguria\n– love of money, silver-mania. Individuals and families indulging in conspicuous consumption tended to be ostracized, because it was recognized that wealth often was obtained at the expense of others, especially the weak.\nThe Greek concept of hubris involved egotistic behavior causing injury to others. Avarice and greed were to be punished by the justice goddess Nemesis, who had many Near Eastern antecedents, such as Nanshe of Lagash in Sumer, protecting the weak against the powerful, the debtor against the creditor.\nThat protection is what rulers were expected to provide in serving the gods. That is why rulers were imbued with enough power to protect the population from being reduced to debt dependency and clientage. Chieftains, kings and temples were in charge of allocating credit and crop-land to enable smallholders to serve in the army and provide corvée labor. Rulers who behaved selfishly were liable to be unseated, or their subjects might run away, or support rebel leaders or foreign attackers promising to cancel debts and redistribute land more equitably.\nThe most basic function of Near Eastern kingship was to proclaim “economic order,” misharum and andurarum clean slate debt cancellations, echoed in Judaism’s Jubilee Year. There was no “democracy” in the sense of citizens electing their leaders and administrators, but “divine kingship” was obliged to achieve the implicit economic aim of democracy: “protecting the weak from the powerful.”\nRoyal power was backed by temples and ethical or religious systems. The major religions that emerged in the mid-first millennium BC, those of Buddha, Lao-Tzu and Zoroaster, held that personal drives should be subordinate to the promotion of overall welfare and mutual aid.\nWhat did not seem likely 2500 years ago was that a warlord aristocracy would conquer the Western world. In creating what became the Roman Empire, an oligarchy took control of the land and, in due course, the political system. It abolished royal or civic authority, shifted the fiscal burden onto the lower classes, and ran the population and industry into debt.\nThis was done on a purely opportunistic basis. There was no attempt to defend this ideologically. There was no hint of an archaic Milton Friedman emerging to popularize a radical new moral order celebrating avarice by claiming that greed is what drives economies forward, not backward, convincing society to leave the distribution of land and money to “the market” controlled by private corporations and money-lenders instead of communalistic regulation by palace rulers and temples – or by extension, today’s socialism. Palaces, temples and civic governments were creditors. They were not forced to borrow to function, and so were not subjected to the policy demands of a private creditor class.\nBut running the population, industry and even governments into debt to an oligarchic elite is precisely what has occurred in the West, which is now trying to impose the modern variant of this debt-based economic regime – U.S.-centered neoliberal finance capitalism – on the entire world. That is what today’s New Cold War is all about.\nIt’s not socialism to forgive debt. It’s not irresponsible to forgive debt. It’s not economically unsound to forgive debt. To the contrary, debt forgiveness is Christian, it is civilized, and it is absolutely necessary on a regular basis in any society that permits legal usury.\nDISCUSS ON SG",
  "tags": [
    "economics",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-07-13T01:29:13+00:00"
}