{
  "url": "https://voxday.net/2022/07/23/the-damage-is-to-the-totality/",
  "scraped_at": "2026-01-08T13:25:27.791625",
  "title": "The Damage is to the Totality",
  "date_display": "July 23, 2022",
  "date_iso": "2022-07-23T13:18:34+00:00",
  "date_from_url": "2022-07-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>To say that Karl Denninger has no sympathy for the vaxxed <a href=\"https://market-ticker.org/akcs-www?post=246438\">would be putting it mildly</a>. But his ire is not unreasonably based on a much better scientific understanding of what they did to themselves, and what was done to them, than most.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>This was just published in <em>Nature</em>, and thus one cannot argue its “mere opinion” or a “conspiracy theory” since it went through the journal’s review process. It is no longer mere speculation that the jabs could wind up causing serious immune damage — and that said damage may well be permanent.</p><p><em>Recently, The Lancet published a study on the effectiveness of COVID-19 vaccines and the waning of immunity with time. The study showed that immune function among vaccinated individuals 8 months after the administration of two doses of COVID-19 vaccine was lower than that among the unvaccinated individuals. According to European Medicines Agency recommendations, frequent COVID-19 booster shots could adversely affect the immune response and may not be feasible…. These clinical alterations may explain the association reported between COVID-19 vaccination and shingles.</em></p><p>Notice a problem in that language — the damage isn’t specific to Covid and it is not transient either as one might expect from an immune challenge by vaccination (or infection) — even at eight months, likely the duration of the study, immune impairment from these jabs was persistent. That’s extraordinarily bad, and exactly why you don’t rush out new things without testing over a long period of time so you can not just find such potential problems but definitively run them into the ground before you go stabbing a couple hundred million people in America alone and billions more world-wide.</p><p>The impact may be irreversible and notice that the article talks about mitigating rather than reversing the impact, specifically limiting other drugs that might otherwise suppress or interfere with immune function even on a short-term basis. May I remind you that beyond the impact when it comes to being impaired in fighting off other diseases every single person on the planet today has cancerous cells in their body and it is your immune system that keeps those in check and prevents you from developing clinical cancer. If this damage is permanent then your lifetime cancer risk has been permanently and materially increased, perhaps by a LOT.</p><p>What’s worse is that the younger you are the greater the harm because you have more years in front of you for those abnormal cells to get out of control.</p><p>Let me point out another very nasty aspect of this: This paper does not describe a random chance event; rather it describes mechanisms of action that are caused when you are given these jabs. Indeed it is logical, given this data, to believe that myocarditis is simply a bad roll on how ugly it was for you in that myocarditis is inflammation which, in the absence of a pathogen is evidence of <span style=\"text-decoration: underline;\">significant immune dysregulation</span>. That is, <span style=\"text-decoration: underline;\">every person</span> who took the jabs got screwed. The degree of screwing of course varies from person to person but everyone who took the jab got nailed to some degree because the mechanism of harm was introduced into the body. Whether there is variation with the technology used is not something that is yet in evidence but the presumption at this point has to be that at best it is a result of what I have described as a nasty biological parlor trick through the inducement of the body’s cells to produce spike protein, a trick that was chosen in an attempt to avoid the history of ADE that has repeatedly developed in trials of whole, inactivated virus for various coronavirus strains. What’s worse is that the spike was intentionally genetically modified in the jabs to prevent it from folding and breaking down in order to enhance the immune response and thus it has now been found in the circulation months after vaccination.</p><p>We did all of this despite having zero long-term evidence that hijacking the cellular machinery to produce the spike was safe and much worse we had scientific evidence prior to the mass roll-out of these shots that the spike alone, absent the rest of the virus, was capable of producing direct harm to the body. I warned of this repeatedly in my column right here before we started this idiocy on a mass-basis and now, it appears, I was not only right I underestimated the risk in that my assumption was that the damage would be coronavirus (and maybe Covid) specific.</p><p>The evidence now strongly suggests that the damage is to the totality of immune response.</p></blockquote><p>To be honest, I’m less concerned with the vaxxed living with damaged immune systems and lower life expectancies than I am with regards to the a) effects on fertility and b) the effects of vaxx-shedding on the fertility of the purebloods.</p><p>The human race can survive just fine with much shorter lifespans than are presently enjoyed, but it cannot survive without a sufficient number of healthy children annually being born.</p><p><em><a href=\"https://social.infogalactic.com/micropost/b6be0b04-deea-4a8f-b909-7fcd7d35e568\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "To say that Karl Denninger has no sympathy for the vaxxed\nwould be putting it mildly\n. But his ire is not unreasonably based on a much better scientific understanding of what they did to themselves, and what was done to them, than most.\nThis was just published in\nNature\n, and thus one cannot argue its “mere opinion” or a “conspiracy theory” since it went through the journal’s review process. It is no longer mere speculation that the jabs could wind up causing serious immune damage — and that said damage may well be permanent.\nRecently, The Lancet published a study on the effectiveness of COVID-19 vaccines and the waning of immunity with time. The study showed that immune function among vaccinated individuals 8 months after the administration of two doses of COVID-19 vaccine was lower than that among the unvaccinated individuals. According to European Medicines Agency recommendations, frequent COVID-19 booster shots could adversely affect the immune response and may not be feasible…. These clinical alterations may explain the association reported between COVID-19 vaccination and shingles.\nNotice a problem in that language — the damage isn’t specific to Covid and it is not transient either as one might expect from an immune challenge by vaccination (or infection) — even at eight months, likely the duration of the study, immune impairment from these jabs was persistent. That’s extraordinarily bad, and exactly why you don’t rush out new things without testing over a long period of time so you can not just find such potential problems but definitively run them into the ground before you go stabbing a couple hundred million people in America alone and billions more world-wide.\nThe impact may be irreversible and notice that the article talks about mitigating rather than reversing the impact, specifically limiting other drugs that might otherwise suppress or interfere with immune function even on a short-term basis. May I remind you that beyond the impact when it comes to being impaired in fighting off other diseases every single person on the planet today has cancerous cells in their body and it is your immune system that keeps those in check and prevents you from developing clinical cancer. If this damage is permanent then your lifetime cancer risk has been permanently and materially increased, perhaps by a LOT.\nWhat’s worse is that the younger you are the greater the harm because you have more years in front of you for those abnormal cells to get out of control.\nLet me point out another very nasty aspect of this: This paper does not describe a random chance event; rather it describes mechanisms of action that are caused when you are given these jabs. Indeed it is logical, given this data, to believe that myocarditis is simply a bad roll on how ugly it was for you in that myocarditis is inflammation which, in the absence of a pathogen is evidence of\nsignificant immune dysregulation\n. That is,\nevery person\nwho took the jabs got screwed. The degree of screwing of course varies from person to person but everyone who took the jab got nailed to some degree because the mechanism of harm was introduced into the body. Whether there is variation with the technology used is not something that is yet in evidence but the presumption at this point has to be that at best it is a result of what I have described as a nasty biological parlor trick through the inducement of the body’s cells to produce spike protein, a trick that was chosen in an attempt to avoid the history of ADE that has repeatedly developed in trials of whole, inactivated virus for various coronavirus strains. What’s worse is that the spike was intentionally genetically modified in the jabs to prevent it from folding and breaking down in order to enhance the immune response and thus it has now been found in the circulation months after vaccination.\nWe did all of this despite having zero long-term evidence that hijacking the cellular machinery to produce the spike was safe and much worse we had scientific evidence prior to the mass roll-out of these shots that the spike alone, absent the rest of the virus, was capable of producing direct harm to the body. I warned of this repeatedly in my column right here before we started this idiocy on a mass-basis and now, it appears, I was not only right I underestimated the risk in that my assumption was that the damage would be coronavirus (and maybe Covid) specific.\nThe evidence now strongly suggests that the damage is to the totality of immune response.\nTo be honest, I’m less concerned with the vaxxed living with damaged immune systems and lower life expectancies than I am with regards to the a) effects on fertility and b) the effects of vaxx-shedding on the fertility of the purebloods.\nThe human race can survive just fine with much shorter lifespans than are presently enjoyed, but it cannot survive without a sufficient number of healthy children annually being born.\nDISCUSS ON SG",
  "tags": [
    "healthcare",
    "science",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-07-23T13:18:36+00:00"
}