{
  "url": "https://voxday.net/2022/07/21/when-losing-one-war-isnt-enough/",
  "scraped_at": "2026-01-08T13:25:17.469044",
  "title": "When Losing One War Isn’t Enough",
  "date_display": "July 21, 2022",
  "date_iso": "2022-07-21T17:04:43+00:00",
  "date_from_url": "2022-07-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Already on their knees due to NATO’s war on Russia, the leaders of the EU nevertheless appear to be determined <a href=\"http://belfast.china-consulate.gov.cn/eng/wjbfyrth_3/202207/t20220719_10723456.htm\">to open a second front</a> with China as well.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>AFP: </strong>The European Parliament Vice President Nicola Beer is visiting Taiwan this week. She said today that Europe must stand firm with Taiwan and avoid turning a blind eye to the mainland’s threats to Taiwan. Do you have any response to these comments?</p><p><strong>Zhao Lijian: </strong>Taiwan is an inalienable part of China’s territory. The one-China principle is a widely recognized basic norm in international relations and the political foundation of China-Europe relations. The European Parliament is an official institution of the European Union. Hence its members and senior officials are expected to abide by the one-China principle. </p><p>Over the past two years, the European Parliament has promulgated multiple Taiwan-related resolutions to support and embolden “Taiwan independence” forces. Such moves have gravely violated the one-China principle and poisoned the atmosphere of China-Europe relations. China firmly opposes all forms of official interactions between the EU side and the Taiwan region. We urge the EU side to earnestly abide by the one-China principle, speak and act with prudence on issues related to Taiwan, and prevent any serious disruption in China-Europe relations. </p></blockquote><p>It’s not exactly a mystery why China is siding so strongly with Russia and ignoring all the desperate pleas to join the failed economic sanctions. And just in case the European leaders didn’t get the message being sent by multiple members of the Chinese Foreign Ministry, the <em>Global Times</em> <a href=\"https://www.globaltimes.cn/page/202207/1270984.shtml\">spelled it out for them</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Chinese Foreign Ministry denounced the European Parliament (EP) on Wednesday for having seriously violating the one-China principle and urged the EU body to stop any forms of official exchanges with China’s Taiwan region.</p><p>The responding remarks came after EP’s vice-president Nicola Beer arrived on Taiwan island leading a delegation and kicked off a three-day visit to show support to the secessionists in the island. Taiwan’s secessionist Democratic Progressive Party (DPP) authorities hyped the fact that Beer is the first EP official at this level to visit the island in an official capacity.</p><p>Upon her arriving, Beer said the EU would not turn a blind eye to “China’s threats” toward the island, as she maintains that “Taiwan’s bloom is Europe’s bloom,” Taiwan-based media reported. Beer is scheduled to meet Taiwan’s regional leader Tsai Ing-wen during the visit.</p><p>“Taiwan is an inalienable part of China’s territory. The one-China principle is a widely recognized basic norm in international relations and the political foundation of China-Europe relations. The EP is an official institution of the EU. Hence its members and senior officials are expected to abide by the one-China principle,” said Wang Wenbin, spokesperson of Chinese Foreign Ministry on Wednesday.</p><p>Over the past two years, the European Parliament has promulgated multiple Taiwan-related resolutions to support and embolden “Taiwan independence” forces. Such moves have gravely violated the one-China principle and poisoned the atmosphere of China-Europe relations, Wang stressed.</p><p>“China firmly opposes all forms of official interactions between the EU side and the Taiwan region,” Wang said, “We urge the EU to earnestly abide by the one-China principle, to speak and act with prudence on issues related to Taiwan, and to prevent any serious disruption in China-Europe relations.”</p><cite>Zhao Lijian, Foreign Ministry, 19 July 2022</cite></blockquote><p>This diplomatic recklessness and retardery is breathtaking. If it weren’t for what we’ve witnessed over the last two years, it would be almost impossible to believe it was real.</p><p><em><a href=\"https://social.infogalactic.com/micropost/3b9d0905-4b36-4f4b-80af-121497559247\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Already on their knees due to NATO’s war on Russia, the leaders of the EU nevertheless appear to be determined\nto open a second front\nwith China as well.\nAFP:\nThe European Parliament Vice President Nicola Beer is visiting Taiwan this week. She said today that Europe must stand firm with Taiwan and avoid turning a blind eye to the mainland’s threats to Taiwan. Do you have any response to these comments?\nZhao Lijian:\nTaiwan is an inalienable part of China’s territory. The one-China principle is a widely recognized basic norm in international relations and the political foundation of China-Europe relations. The European Parliament is an official institution of the European Union. Hence its members and senior officials are expected to abide by the one-China principle.\nOver the past two years, the European Parliament has promulgated multiple Taiwan-related resolutions to support and embolden “Taiwan independence” forces. Such moves have gravely violated the one-China principle and poisoned the atmosphere of China-Europe relations. China firmly opposes all forms of official interactions between the EU side and the Taiwan region. We urge the EU side to earnestly abide by the one-China principle, speak and act with prudence on issues related to Taiwan, and prevent any serious disruption in China-Europe relations.\nIt’s not exactly a mystery why China is siding so strongly with Russia and ignoring all the desperate pleas to join the failed economic sanctions. And just in case the European leaders didn’t get the message being sent by multiple members of the Chinese Foreign Ministry, the\nGlobal Times\nspelled it out for them\n.\nChinese Foreign Ministry denounced the European Parliament (EP) on Wednesday for having seriously violating the one-China principle and urged the EU body to stop any forms of official exchanges with China’s Taiwan region.\nThe responding remarks came after EP’s vice-president Nicola Beer arrived on Taiwan island leading a delegation and kicked off a three-day visit to show support to the secessionists in the island. Taiwan’s secessionist Democratic Progressive Party (DPP) authorities hyped the fact that Beer is the first EP official at this level to visit the island in an official capacity.\nUpon her arriving, Beer said the EU would not turn a blind eye to “China’s threats” toward the island, as she maintains that “Taiwan’s bloom is Europe’s bloom,” Taiwan-based media reported. Beer is scheduled to meet Taiwan’s regional leader Tsai Ing-wen during the visit.\n“Taiwan is an inalienable part of China’s territory. The one-China principle is a widely recognized basic norm in international relations and the political foundation of China-Europe relations. The EP is an official institution of the EU. Hence its members and senior officials are expected to abide by the one-China principle,” said Wang Wenbin, spokesperson of Chinese Foreign Ministry on Wednesday.\nOver the past two years, the European Parliament has promulgated multiple Taiwan-related resolutions to support and embolden “Taiwan independence” forces. Such moves have gravely violated the one-China principle and poisoned the atmosphere of China-Europe relations, Wang stressed.\n“China firmly opposes all forms of official interactions between the EU side and the Taiwan region,” Wang said, “We urge the EU to earnestly abide by the one-China principle, to speak and act with prudence on issues related to Taiwan, and to prevent any serious disruption in China-Europe relations.”\nZhao Lijian, Foreign Ministry, 19 July 2022\nThis diplomatic recklessness and retardery is breathtaking. If it weren’t for what we’ve witnessed over the last two years, it would be almost impossible to believe it was real.\nDISCUSS ON SG",
  "tags": [
    "China",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-07-21T17:04:45+00:00"
}