{
  "url": "https://voxday.net/2015/04/10/a-doctorate-in-comparative-gaming/",
  "scraped_at": "2025-12-16T12:51:46.183708",
  "title": "A doctorate in comparative gaming",
  "date_display": "April 10, 2015",
  "date_iso": "2015-04-10T12:39:00+00:00",
  "date_from_url": "2015-04-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>2015 Hugo nominee Jeffro Johnson is better suited to make the following introduction than I am, so I will simply quote him in introducing the latest Castalia House blog star, Douglas Cole, the author of GURPS Martial Arts: Technical Grappling and a number of other <a href=\"http://gamingballistic.blogspot.com/p/author-credits.html\">combat-related RPG publications</a>.</p><p><i>Game designer Douglas Cole will be joining Ken Burnside and myself at Castalia House with his new blog series called “Violent Resolution.” As you can see from his first post, this is going to be a doozy. From what I’ve seen, this will do for rpgs what Nick Schuessler did for wargames in his Space Gamer column. If you’re the type of person that’s always wanted a doctorate in comparative gaming, you will faint!</i></p><p>As for Violent Resolution itself, Cole himself explains what the weekly column is going to entail:</p><blockquote class=\"tr_bq\"><p> The column will focus on combat in games, mostly to the exclusion of other things. It will of course include fighting, but also how fights start and end. It will spend a great deal of time looking at game mechanics along the way, and will probably spend a lot of word count looking at what kind of storytelling environment is created by those mechanics.</p><h3 style=\"text-align: justify;\"> <i>Through the Lens</i></h3><p>As the blog progresses, I’ll frequently be looking at combat with examples from different games. There will be others from time-to-time – notably when I have an anecdote from games I’ve played (or stopped playing) in the past. But by and large, I’ll explore this topic by looking at how certain games handle things.</p><h3 style=\"text-align: justify;\"> <i>Dungeons and Dragons, Fifth Edition</i></h3><div style=\"text-align: justify;\"></div><p>I’m going to refer to D&amp;D5 here<br> frequently, because you can’t talk about RPGs – especially combat in<br> RPGs – without talking about the moose in the room. D&amp;D-based games<br> dominate the market of tabletop RPGs that all other games combined are<br> pretty much an afterthought.</br></br></br></br></p><p>I’ll use D&amp;D5 as a proxy for the kind<br> of resolution system that is found as variations on a theme in<br> Pathfinder, the D&amp;D-derived Old School Renaissance (or Old School<br> Revival? Maybe both!), and other games that are recognizably the same<br> basic mechanic. All are recognizable as essentially the same game that I<br> learned to play when I was 10 years old, roleplaying for the first time<br> in 1981 – the Basic/Expert D&amp;D boxed sets, followed by AD&amp;D.<br> Stepping into Swords and Wizardry, Pathfinder, or D&amp;D is usually a<br> matter of fine-tuning. You may need to understand the proper use of a<br> Feat hierarchy, or what will kill your character as opposed to knocking<br> him out, or get the feel for various special mechanics, such as the<br> Advantaged/Disadvantaged mechanic newly introduced in <i>D&amp;D5</i> . . . but by and large if you’ve ever played D&amp;D you’ll understand what’s going on pretty fast.</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>As the future leading publisher of military science fiction, the martial arts from the grand strategic to the tactical is of interest to us, and while I think it is highly unlikely that we will be able to convince Dr. van Creveld, Gen. Krulak, Gen. Gray, or Mr. Lind to take up blogging  at Castalia House anytime soon, we are very pleased to have Mr. Cole intelligently addressing matters from the other end of the spectrum.</p></div>",
  "content_text": "2015 Hugo nominee Jeffro Johnson is better suited to make the following introduction than I am, so I will simply quote him in introducing the latest Castalia House blog star, Douglas Cole, the author of GURPS Martial Arts: Technical Grappling and a number of other\ncombat-related RPG publications\n.\nGame designer Douglas Cole will be joining Ken Burnside and myself at Castalia House with his new blog series called “Violent Resolution.” As you can see from his first post, this is going to be a doozy. From what I’ve seen, this will do for rpgs what Nick Schuessler did for wargames in his Space Gamer column. If you’re the type of person that’s always wanted a doctorate in comparative gaming, you will faint!\nAs for Violent Resolution itself, Cole himself explains what the weekly column is going to entail:\nThe column will focus on combat in games, mostly to the exclusion of other things. It will of course include fighting, but also how fights start and end. It will spend a great deal of time looking at game mechanics along the way, and will probably spend a lot of word count looking at what kind of storytelling environment is created by those mechanics.\nThrough the Lens\nAs the blog progresses, I’ll frequently be looking at combat with examples from different games. There will be others from time-to-time – notably when I have an anecdote from games I’ve played (or stopped playing) in the past. But by and large, I’ll explore this topic by looking at how certain games handle things.\nDungeons and Dragons, Fifth Edition\nI’m going to refer to D&D5 here\nfrequently, because you can’t talk about RPGs – especially combat in\nRPGs – without talking about the moose in the room. D&D-based games\ndominate the market of tabletop RPGs that all other games combined are\npretty much an afterthought.\nI’ll use D&D5 as a proxy for the kind\nof resolution system that is found as variations on a theme in\nPathfinder, the D&D-derived Old School Renaissance (or Old School\nRevival? Maybe both!), and other games that are recognizably the same\nbasic mechanic. All are recognizable as essentially the same game that I\nlearned to play when I was 10 years old, roleplaying for the first time\nin 1981 – the Basic/Expert D&D boxed sets, followed by AD&D.\nStepping into Swords and Wizardry, Pathfinder, or D&D is usually a\nmatter of fine-tuning. You may need to understand the proper use of a\nFeat hierarchy, or what will kill your character as opposed to knocking\nhim out, or get the feel for various special mechanics, such as the\nAdvantaged/Disadvantaged mechanic newly introduced in\nD&D5\n. . . but by and large if you’ve ever played D&D you’ll understand what’s going on pretty fast.\nAs the future leading publisher of military science fiction, the martial arts from the grand strategic to the tactical is of interest to us, and while I think it is highly unlikely that we will be able to convince Dr. van Creveld, Gen. Krulak, Gen. Gray, or Mr. Lind to take up blogging  at Castalia House anytime soon, we are very pleased to have Mr. Cole intelligently addressing matters from the other end of the spectrum.",
  "tags": [
    "Castalia House",
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-10T11:39:00+00:00"
}