{
  "url": "https://voxday.net/2015/04/19/a-letter-to-popular-science/",
  "scraped_at": "2025-12-16T12:52:48.511739",
  "title": "A letter to Popular Science",
  "date_display": "April 19, 2015",
  "date_iso": "2015-04-19T06:00:00+00:00",
  "date_from_url": "2015-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dear Editor,</p><p>I am writing to demand a retraction and apology for <a href=\"http://www.popsci.com/culture-wars-raging-within-science-fiction-fandom?dom=fb&amp;src=SOC\">the libelous article</a> posted Apr 17th, 2015 at 3:00pm by Mike VanHelder. Mr. VanHelder wrote:</p><p><i>“Big winner Vox Day is an outspoken white supremacist and campaigner<br> against women’s education and suffrage, who is on the record as<br> supporting the Taliban’s attempt to assassinate Nobel Peace Prize winner<br> Malala Yousifazi, finding it “scientifically justifiable.””</br></br></br></i></p><ol><li>I am not a white supremacist. This is flat-out false. Also, I am a Native American with Mexican heritage.</li><li>I am not a campaigner against women’s education. I am not an activist. I have never campaigned against it.</li><li>I am not a campaigner against suffrage. I am not an activist. I have never campaigned against it.</li><li>I am not against women’s suffrage. I support direct democracy for all, including women.</li><li>I am not on the record supporting the Taliban’s attempt to assassinate Nobel Peace Prize winner<br> Malala Yousifazi. This is an absolutely outrageous accusation and utterly false.</br></li></ol><p>All of these statements are false, provably and demonstrably false,<br> and appear to be malicious. Therefore, I am requesting an immediate<br> retraction of this error-ridden article as<br> well as a published apology to me. Some of these additional errors include:</br></br></br></p><ol><li>Gamergate is not anti-feminist.</li><li>Neither Sad Puppies nor Rabid Puppies courted any assistance from GamerGate.</li><li>The extent of the collaboration between the THREE groups, (not<br> two, as in the article) is not difficult to quantify. There are<br> precisely two GamerGaters who are also Rabid Puppies, myself and Daddy<br> Warpig.</br></br></br></li><li>It is false to claim “No nominated author has ever before<br> withdrawn their work after making it onto the Hugo ballot.” It is<br> actually not uncommon for an author to withdraw one of his works after<br> getting more than one nominated in a category. To give a few examples, Harlan<br> Ellison withdrew his Hugo nomination in 1968. Jack Gaughan withdrew his<br> nomination in 1968. Fritz Leiber withdrew his nomination in 1971, as did<br> Robert Silverberg in 1972.</br></br></br></br></br></br></li><li>Therefore, the action of withdrawing a nomination is not “unprecedented”.</li></ol><p>I will appreciate your prompt attention to this matter.</p><p>NB: <i>If you would like to add your voice to this call for a retraction and apology, this is the editor’s email: letters@popsci.com</i></p></div>",
  "content_text": "Dear Editor,\nI am writing to demand a retraction and apology for\nthe libelous article\nposted Apr 17th, 2015 at 3:00pm by Mike VanHelder. Mr. VanHelder wrote:\n“Big winner Vox Day is an outspoken white supremacist and campaigner\nagainst women’s education and suffrage, who is on the record as\nsupporting the Taliban’s attempt to assassinate Nobel Peace Prize winner\nMalala Yousifazi, finding it “scientifically justifiable.””\nI am not a white supremacist. This is flat-out false. Also, I am a Native American with Mexican heritage.\nI am not a campaigner against women’s education. I am not an activist. I have never campaigned against it.\nI am not a campaigner against suffrage. I am not an activist. I have never campaigned against it.\nI am not against women’s suffrage. I support direct democracy for all, including women.\nI am not on the record supporting the Taliban’s attempt to assassinate Nobel Peace Prize winner\nMalala Yousifazi. This is an absolutely outrageous accusation and utterly false.\nAll of these statements are false, provably and demonstrably false,\nand appear to be malicious. Therefore, I am requesting an immediate\nretraction of this error-ridden article as\nwell as a published apology to me. Some of these additional errors include:\nGamergate is not anti-feminist.\nNeither Sad Puppies nor Rabid Puppies courted any assistance from GamerGate.\nThe extent of the collaboration between the THREE groups, (not\ntwo, as in the article) is not difficult to quantify. There are\nprecisely two GamerGaters who are also Rabid Puppies, myself and Daddy\nWarpig.\nIt is false to claim “No nominated author has ever before\nwithdrawn their work after making it onto the Hugo ballot.” It is\nactually not uncommon for an author to withdraw one of his works after\ngetting more than one nominated in a category. To give a few examples, Harlan\nEllison withdrew his Hugo nomination in 1968. Jack Gaughan withdrew his\nnomination in 1968. Fritz Leiber withdrew his nomination in 1971, as did\nRobert Silverberg in 1972.\nTherefore, the action of withdrawing a nomination is not “unprecedented”.\nI will appreciate your prompt attention to this matter.\nNB:\nIf you would like to add your voice to this call for a retraction and apology, this is the editor’s email: letters@popsci.com",
  "tags": [
    "#GamerGate",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-19T05:00:00+00:00"
}