{
  "url": "https://voxday.net/2015/04/02/a-name-designer-speaks-ou/",
  "scraped_at": "2025-12-16T12:50:44.142234",
  "title": "A name designer speaks out",
  "date_display": "April 2, 2015",
  "date_iso": "2015-04-02T08:37:00+00:00",
  "date_from_url": "2015-04-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Game designer American McGee <a href=\"http://theralphretort.com/noted-developer-american-mcgee-calls-out-anita-sarkeesian-402015/\">dismisses SJWs and Literally Who 2</a>:</p><blockquote class=\"tr_bq\"><p> I’m prepared for the SJW flamethrower…</p><p>Seriously, isn’t Anita saying this character is acceptable because she’s such a blank slate? I can’t help but think the “woman” in this game might as well be wearing a burka for all the identity she has. If this is “positive” and we (as game writer/designers) are meant to emulate this model… then I imagine the characters in our future games getting some really odd looks as they walk down the streets of virtual Los Angeles, sneak through the corridors of Space Station 009, or try to blend into any world that isn’t a magical fantasy world of pixel make-believe.</p><p>To me, real characters, positive characters, have flaws. They’re broken. They have an identity constructed of past events – good and bad. Like real people, they might make poor “life choices” which result in them being shallow minded, skin revealing, homicidal maniacs, who wear women’s lingerie under their space armor. Or, like the rest of us, they might be who they are, and wear what they wear, because society (the real world) hasn’t left them many other options. If we’re going to tell real stories, it’s best we do that with characters who closely resemble real people.</p></blockquote><p>We are now advancing on two fronts, the game industry and the science fiction publishing industry. And we’re able to do so because more and more people are entering the ranks. If you know someone who plays games or reads SF/F, talk to them about #GamerGate and Sad Puppies. Let them know about it. Chances are, if they’re not an SJW, they’ll turn out to be as enthusiastic about it as you are.</p><p>A lot of science fiction readers abandoned all hope sometime between the late 90s and the middle 00s and lost interest in the genre. They didn’t know exactly why, all they knew is that they weren’t interested in reading the books about kickass werewolf lovers with crossbows or in being lectured about how evil the bigoted Biblethumpers who didn’t accept the quadsexual aliens with open arms and orifices were. So they stopped reading and started playing games instead.</p><p>But now games are under attack and there is nowhere else to run, so we have no choice but to fight back. And, lo and behold, it turns out that they are paper tigers, and their victory is no more inevitable or lasting than Hitler’s defeat of Russia.</p><p>I was acquainted with American from the time he was a level designer at id and it’s significant that he is speaking out because he is an old school, name-on-the-box game designer. I’ve said repeatedly that the designers and developers are with us, but only now are they beginning to realize that their livelihoods and their freedom to create is under attack. And more of them will be speaking out against the SJWs soon.</p><p>Speaking of SJWs and their inability to write characters, consider <a href=\"http://www.milobookclub.com/2005/05/11/book-review-old-mans-war-by-john/\">my original review</a> of John Scalzi’s <i>Old Man’s War</i>, specifically, this part:</p><blockquote class=\"tr_bq\"><p> Characters: This is probably the weakest link of the book. While Scalzi makes some effort to provide motivations for his characters, only the protagonist and, ironically, a character who knows next to nothing of herself, come across in full-color. The crude bigot who gets his, the delightful gay man, the crusty drill sergeant, the overenthusiastic fool and the sexually uninhibited beautiful women are all oft-seen staples of SF fiction and they’re simply plugged in as required here.</p></blockquote><p>Of course, I got this part dreadfully wrong: <i>“OLD MAN’S WAR is both stylistically and thematically informed by<br> Heinlein, especially STARSHIP TROOPERS, but manages to be so without<br> being a thinly disguised ripoff.”</br></br></i></p><p>It’s a bit embarrassing, but how was I to know Scalzi had written what he openly admits was a straight-up color-by-numbers attempt to imitate Heinlein, then follow it up with even less-disguised ripoffs of Dick, Piper, and Star Trek? Anyhow, what I gave the benefit of the doubt and rounded up from a 6.5 to a 7 rating would, in retrospect, lose one star for Style and two stars for Creativity, and therefore wind up rated 5/10.</p><p>Of course, Scalzi is far from the only SJW in science fiction who has trouble with characters <a href=\"http://www.milobookclub.com/2011/02/24/lets-try-this-one-more-time/\">as a direct result of his ideological perspective</a>:</p><blockquote class=\"tr_bq\"><p> I certainly don’t deny that I am making a value judgment about modern fantasy, what Bakker simply can’t seem to grasp is that I am expressing a literary judgment and not a moral one. The fact that one of the causes of the genre’s literary decline can quite logically be attributed to observable moral color-blindness on the part of many modern fantasy authors does not make the observation a moral judgment, anymore than attributing the decline to historical ignorance would make it a historical judgment.</p><p>This isn’t double-talk or moral cowardice. I am about as genuinely disinterested as it is possible to be and still be cognizant of the matter. I have read everything from Nietzsche and Stalin to Keynes and Onfray without it ruffling my feathers so I’m not inclined to be perturbed by mere fictitious monsters. If I was concerned that Joe or anyone else was “leading innocent souls to potential damnation” through nihilistic genre literature, my track record of publishing highly controversial opinions strongly suggests that I would not hesitate to say so. The fact is that I simply don’t believe the writers of modern fantasy matter all that much, in part due to the literary decline of the genre. As I stated before, they are a symptom of the greater societal decline, they are not a cause.</p></blockquote><p>Meanwhile, an SJW named Bruce Baugh perfectly summarizes the core attitude of every SJW: <i>“It occurs to me that the problems some of us feel about Hugo<br> nominating tie into something I’ve remarked on in other contexts: the<br> sense that we have to act like pundits, arbiters, or decision-making<br> authorities (judges, chief executives, etc.) when commenting on things.”</br></br></br></i></p><p>Everyone else’s opinion is merely an opinion. But their expressed opinion is that of a “decision-making authority”.</p></div>",
  "content_text": "Game designer American McGee\ndismisses SJWs and Literally Who 2\n:\nI’m prepared for the SJW flamethrower…\nSeriously, isn’t Anita saying this character is acceptable because she’s such a blank slate? I can’t help but think the “woman” in this game might as well be wearing a burka for all the identity she has. If this is “positive” and we (as game writer/designers) are meant to emulate this model… then I imagine the characters in our future games getting some really odd looks as they walk down the streets of virtual Los Angeles, sneak through the corridors of Space Station 009, or try to blend into any world that isn’t a magical fantasy world of pixel make-believe.\nTo me, real characters, positive characters, have flaws. They’re broken. They have an identity constructed of past events – good and bad. Like real people, they might make poor “life choices” which result in them being shallow minded, skin revealing, homicidal maniacs, who wear women’s lingerie under their space armor. Or, like the rest of us, they might be who they are, and wear what they wear, because society (the real world) hasn’t left them many other options. If we’re going to tell real stories, it’s best we do that with characters who closely resemble real people.\nWe are now advancing on two fronts, the game industry and the science fiction publishing industry. And we’re able to do so because more and more people are entering the ranks. If you know someone who plays games or reads SF/F, talk to them about #GamerGate and Sad Puppies. Let them know about it. Chances are, if they’re not an SJW, they’ll turn out to be as enthusiastic about it as you are.\nA lot of science fiction readers abandoned all hope sometime between the late 90s and the middle 00s and lost interest in the genre. They didn’t know exactly why, all they knew is that they weren’t interested in reading the books about kickass werewolf lovers with crossbows or in being lectured about how evil the bigoted Biblethumpers who didn’t accept the quadsexual aliens with open arms and orifices were. So they stopped reading and started playing games instead.\nBut now games are under attack and there is nowhere else to run, so we have no choice but to fight back. And, lo and behold, it turns out that they are paper tigers, and their victory is no more inevitable or lasting than Hitler’s defeat of Russia.\nI was acquainted with American from the time he was a level designer at id and it’s significant that he is speaking out because he is an old school, name-on-the-box game designer. I’ve said repeatedly that the designers and developers are with us, but only now are they beginning to realize that their livelihoods and their freedom to create is under attack. And more of them will be speaking out against the SJWs soon.\nSpeaking of SJWs and their inability to write characters, consider\nmy original review\nof John Scalzi’s\nOld Man’s War\n, specifically, this part:\nCharacters: This is probably the weakest link of the book. While Scalzi makes some effort to provide motivations for his characters, only the protagonist and, ironically, a character who knows next to nothing of herself, come across in full-color. The crude bigot who gets his, the delightful gay man, the crusty drill sergeant, the overenthusiastic fool and the sexually uninhibited beautiful women are all oft-seen staples of SF fiction and they’re simply plugged in as required here.\nOf course, I got this part dreadfully wrong:\n“OLD MAN’S WAR is both stylistically and thematically informed by\nHeinlein, especially STARSHIP TROOPERS, but manages to be so without\nbeing a thinly disguised ripoff.”\nIt’s a bit embarrassing, but how was I to know Scalzi had written what he openly admits was a straight-up color-by-numbers attempt to imitate Heinlein, then follow it up with even less-disguised ripoffs of Dick, Piper, and Star Trek? Anyhow, what I gave the benefit of the doubt and rounded up from a 6.5 to a 7 rating would, in retrospect, lose one star for Style and two stars for Creativity, and therefore wind up rated 5/10.\nOf course, Scalzi is far from the only SJW in science fiction who has trouble with characters\nas a direct result of his ideological perspective\n:\nI certainly don’t deny that I am making a value judgment about modern fantasy, what Bakker simply can’t seem to grasp is that I am expressing a literary judgment and not a moral one. The fact that one of the causes of the genre’s literary decline can quite logically be attributed to observable moral color-blindness on the part of many modern fantasy authors does not make the observation a moral judgment, anymore than attributing the decline to historical ignorance would make it a historical judgment.\nThis isn’t double-talk or moral cowardice. I am about as genuinely disinterested as it is possible to be and still be cognizant of the matter. I have read everything from Nietzsche and Stalin to Keynes and Onfray without it ruffling my feathers so I’m not inclined to be perturbed by mere fictitious monsters. If I was concerned that Joe or anyone else was “leading innocent souls to potential damnation” through nihilistic genre literature, my track record of publishing highly controversial opinions strongly suggests that I would not hesitate to say so. The fact is that I simply don’t believe the writers of modern fantasy matter all that much, in part due to the literary decline of the genre. As I stated before, they are a symptom of the greater societal decline, they are not a cause.\nMeanwhile, an SJW named Bruce Baugh perfectly summarizes the core attitude of every SJW:\n“It occurs to me that the problems some of us feel about Hugo\nnominating tie into something I’ve remarked on in other contexts: the\nsense that we have to act like pundits, arbiters, or decision-making\nauthorities (judges, chief executives, etc.) when commenting on things.”\nEveryone else’s opinion is merely an opinion. But their expressed opinion is that of a “decision-making authority”.",
  "tags": [
    "#GamerGate",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-02T07:37:00+00:00"
}