{
  "url": "https://voxday.net/2015/04/25/a-special-kind-of-cowardice/",
  "scraped_at": "2025-12-16T12:53:28.458073",
  "title": "A special kind of cowardice",
  "date_display": "April 25, 2015",
  "date_iso": "2015-04-25T10:30:00+00:00",
  "date_from_url": "2015-04-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://voxmaximus.wordpress.com/2015/04/24/sjws-a-podcast-and-a-special-kind-of-lie/\">Vox Maximus observes</a> that people are much more interested in talking ABOUT me than TO me:</p><blockquote class=\"tr_bq\"><p> I recently listened to the <b>Nerdvana Podcast</b> on the 2015 Hugo Awards (a two-part series with Part 2 <a href=\"http://nerdvanapodcast.com/ep38b-hugogate-2015-pt2/\">being located here</a>).<br> Minute after minute, I listened to these individuals converse about Vox<br> Day. They mused about his motives. They psycho-analyzed him. They<br> called his family members “stooges”. And they just talked, and talked,<br> and talked about Vox in quite a bit of detail (they also<br> cried–seriously–when they thought about what Vox was “doing” to the Hugo<br> Awards).</br></br></br></br></br></br></p><p>But do you know the one thing that they did not do? <b>TALK TO VOX DAY HIMSELF.</b><br> That’s right, these individuals used up precious time speculating about<br> everything from Vox Day’s goals to his potential financial fixing of<br> the Hugo Awards themselves. And yet, they did not talk to <i>him</i>.<br> They did not send him an e-mail with questions. They did not try to<br> contact him on his blog. In fact, they did not even quote anything from<br> his blog or his writings (or a bad paraphrase or two was included).</br></br></br></br></br></br></p></blockquote><p>I don’t think that this is so much a special kind of lying as it is a special kind of cowardice. The reason so few people are willing to take me on directly can be seen in my interview with David Pakman. Sure, I didn’t cover myself with glory there, but the fact is that even with all the advantages on his side, even when taking me completely by surprise by misleading me about the topics the interview would address and demanding that I explain why I had written words that I never wrote and defend a case I never made – see if you can find where I said anything about “signs” or declared that the Denver shootings were definitely a false flag operation in <a href=\"http://www.wnd.com/2012/07/the-lone-gunmen/\">The Lone Gunmen</a> – I still managed to get him on record confessing himself to be in the habit of having sex without obtaining consent first.</p><p>Can you blame them for not wanting to take such risks?</p><p>Sure, they claim that I am stupid, that I am an idiot, that I am crazy, that I am a badthinker, that my views are beyond the pale and unacceptable to all goodthinking people. But if they are correct, why are they so afraid of me? Why are they so afraid to simply meet me on equal terms and prove that my ideas are indefensible and wrong?</p><p>Because they can’t. And more importantly, they know they can’t.</p><p>This sort of thing doesn’t upset me. I just sent an email to David Pakman offering to do a second interview with him, one that would actually address #GamerGate, the game industry, and the Hugo Awards. I’m entirely willing to talk to the people on the Nerdvana Podcast too. If you’d like to see me do either, go ahead and contact Pakman or Nerdvana and let them know.</p><p>But (and I cannot stress this strongly enough), I don’t care. I don’t have a media career. I’m not concerned about looking like a politician on camera. I’m not concerned about talking points or winning people over, and I neither need nor want any more platforms than the one I’ve got.</p><p>And if people want to attack me for being a criminal badthinker, well, that’s something for which they will have to answer one day. Not to me, but to themselves. For all my terrible thoughts and deeds and words, the one thing I have never been guilty of is telling anyone “you are not permitted to think that and you are a bad person if you do.”</p><p>The world is what it is. You can be as upset about calling homosexuality a “birth defect” as you like, but being upset is not going to save the life of a single homosexual fetus if – note the word IF – it turns out that there is a detectable genetic component that reliably predicts homosexuality in the unborn child. The “born that way” concept doesn’t go very far in a society that permits the murder of the unborn.</p><p>If you could boil my perspective down to its essence, it would be this: “The world is what it is and there is no point in pretending otherwise.” I may be wrong about some things. I may be wrong about many things. But I do not pretend.</p><p> UPDATE: David Pakman emailed me back and expressed his opinion that there was no ambush and no hit piece. He also declined to have me back on next week to discuss GamerGate, the game industry, or the Hugo Awards.</p></div>",
  "content_text": "Vox Maximus observes\nthat people are much more interested in talking ABOUT me than TO me:\nI recently listened to the\nNerdvana Podcast\non the 2015 Hugo Awards (a two-part series with Part 2\nbeing located here\n).\nMinute after minute, I listened to these individuals converse about Vox\nDay. They mused about his motives. They psycho-analyzed him. They\ncalled his family members “stooges”. And they just talked, and talked,\nand talked about Vox in quite a bit of detail (they also\ncried–seriously–when they thought about what Vox was “doing” to the Hugo\nAwards).\nBut do you know the one thing that they did not do?\nTALK TO VOX DAY HIMSELF.\nThat’s right, these individuals used up precious time speculating about\neverything from Vox Day’s goals to his potential financial fixing of\nthe Hugo Awards themselves. And yet, they did not talk to\nhim\n.\nThey did not send him an e-mail with questions. They did not try to\ncontact him on his blog. In fact, they did not even quote anything from\nhis blog or his writings (or a bad paraphrase or two was included).\nI don’t think that this is so much a special kind of lying as it is a special kind of cowardice. The reason so few people are willing to take me on directly can be seen in my interview with David Pakman. Sure, I didn’t cover myself with glory there, but the fact is that even with all the advantages on his side, even when taking me completely by surprise by misleading me about the topics the interview would address and demanding that I explain why I had written words that I never wrote and defend a case I never made – see if you can find where I said anything about “signs” or declared that the Denver shootings were definitely a false flag operation in\nThe Lone Gunmen\n– I still managed to get him on record confessing himself to be in the habit of having sex without obtaining consent first.\nCan you blame them for not wanting to take such risks?\nSure, they claim that I am stupid, that I am an idiot, that I am crazy, that I am a badthinker, that my views are beyond the pale and unacceptable to all goodthinking people. But if they are correct, why are they so afraid of me? Why are they so afraid to simply meet me on equal terms and prove that my ideas are indefensible and wrong?\nBecause they can’t. And more importantly, they know they can’t.\nThis sort of thing doesn’t upset me. I just sent an email to David Pakman offering to do a second interview with him, one that would actually address #GamerGate, the game industry, and the Hugo Awards. I’m entirely willing to talk to the people on the Nerdvana Podcast too. If you’d like to see me do either, go ahead and contact Pakman or Nerdvana and let them know.\nBut (and I cannot stress this strongly enough), I don’t care. I don’t have a media career. I’m not concerned about looking like a politician on camera. I’m not concerned about talking points or winning people over, and I neither need nor want any more platforms than the one I’ve got.\nAnd if people want to attack me for being a criminal badthinker, well, that’s something for which they will have to answer one day. Not to me, but to themselves. For all my terrible thoughts and deeds and words, the one thing I have never been guilty of is telling anyone “you are not permitted to think that and you are a bad person if you do.”\nThe world is what it is. You can be as upset about calling homosexuality a “birth defect” as you like, but being upset is not going to save the life of a single homosexual fetus if – note the word IF – it turns out that there is a detectable genetic component that reliably predicts homosexuality in the unborn child. The “born that way” concept doesn’t go very far in a society that permits the murder of the unborn.\nIf you could boil my perspective down to its essence, it would be this: “The world is what it is and there is no point in pretending otherwise.” I may be wrong about some things. I may be wrong about many things. But I do not pretend.\nUPDATE: David Pakman emailed me back and expressed his opinion that there was no ambush and no hit piece. He also declined to have me back on next week to discuss GamerGate, the game industry, or the Hugo Awards.",
  "tags": [
    "media",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-25T09:30:00+00:00"
}