{
  "url": "https://voxday.net/2015/04/24/a-statement-by-literally-wus/",
  "scraped_at": "2025-12-16T12:53:23.303057",
  "title": "A statement by the Literally Wus",
  "date_display": "April 24, 2015",
  "date_iso": "2015-04-24T12:00:00+00:00",
  "date_from_url": "2015-04-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Try to read <a href=\"http://spacechannel6.com/post/117189650788/a-statement-from-frank-wu-and-brianna-wu-about\">this statement about RavenCon</a> with a straight face. I dare you:</p><blockquote class=\"tr_bq\"><p> A statement from Frank Wu and Brianna Wu about RavenCon</p><p>This weekend, we are both invited to be guests of honor at<br> RavenCon. Every time we’re asked to be GoHs at a convention, we consider<br> it a huge responsibility. We take our work as guests seriously – both<br> in representing the convention, and participating in programming in a<br> way that is entertaining to attendees. Our long track record of<br> professionalism speaks for itself.</br></br></br></br></br></p><p>The toll that the hate<br> group Gamergate has taken on our family has been well documented in<br> press, interviews and documentaries. Brianna has received 83 death<br> threats in the last 8 months, and Gamergate regularly disrupts her<br> speaking invitations at colleges. We’ve tried to stand firm to our<br> beliefs and march forward.</br></br></br></br></br></p><p>Sadly, the same reactionary anger has<br> spread into the science fiction community with the hijacking of year’s<br> Hugo awards, deliberately sabotaging them for bitter, regressive<br> political purposes. Many of the forums that orchestrate harassment<br> against Brianna and other women in the game industry have avowed<br> supporters of the Hugo hijacking, many of whom participated in the<br> voting and strongly support Vox Day.</br></br></br></br></br></br></p><p>What makes RavenCon<br> particularly uncomfortable for us is that a number of those attending<br> directly orchestrated or benefited from the hijacking. We’ve heard<br> numbers as high as six.</br></br></br></p><p>Frank Wu has won four Hugo awards. They<br> are near and dear to our family. And we agree with John Scalzi, Connie<br> Willis, George R. R. Martin and others about the travesty this has been.<br> The hijackers have contempt for the awards while also desperately<br> wanting the legitimacy they feel it would grant them.</br></br></br></br></p><p>To put it<br> bluntly, attending this con makes us tremendously uncomfortable. But we<br> agreed to attend, long before Gamergate, and we will follow through with<br> that professional commitment.</br></br></br></p><p>Neither of us wish to discuss the<br> Hugo hijacking with any person responsible for this atrocious action.<br> Both of us would consider it a professional courtesy if you didn’t<br> attend Brianna’s Gamergate panel tomorrow.</br></br></br></p><p>Let’s all enjoy what<br> brings us together, rather than focus on what brings us apart. There’s<br> plenty that science fiction fans can agree on. We hope we can all enjoy<br> RavenCon.</br></br></br></p><p>Frank and Brianna Wu</p></blockquote><p><a href=\"https://pbs.twimg.com/media/CDWx-SEUUAAJ19Z.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"183\" src=\"https://pbs.twimg.com/media/CDWx-SEUUAAJ19Z.jpg\" width=\"320\"/></a>I know when I hear about John Flynt, the first thing I think about is his “long track record of<br> professionalism”. Not about his pretending to be a woman, his pretending to flee his house, his being caught autoharassing, his failure as a game developer, or his ludicrous, but modestly successful attempts to promote himself as a victim of misogyny. As for the 83 claimed death threats, I would assume Mr. Flynt himself likely accounted for at least 80 of them. But it would be interesting to hear someone count how many lies Mr. Flynt tells in his #GamerGate panel; I’d put the over/under north of 30.</br></p><p>And I’m guessing every single one of <a href=\"http://www.returnofkings.com/60470/6-logical-fallacies-you-can-expect-from-feminists-and-sjws?utm_source=dlvr.it&amp;utm_medium=twitter&amp;ModPagespeed=noscript\">these six logical fallacies</a> so often relied upon by SJWs will be on display.</p></div>",
  "content_text": "Try to read\nthis statement about RavenCon\nwith a straight face. I dare you:\nA statement from Frank Wu and Brianna Wu about RavenCon\nThis weekend, we are both invited to be guests of honor at\nRavenCon. Every time we’re asked to be GoHs at a convention, we consider\nit a huge responsibility. We take our work as guests seriously – both\nin representing the convention, and participating in programming in a\nway that is entertaining to attendees. Our long track record of\nprofessionalism speaks for itself.\nThe toll that the hate\ngroup Gamergate has taken on our family has been well documented in\npress, interviews and documentaries. Brianna has received 83 death\nthreats in the last 8 months, and Gamergate regularly disrupts her\nspeaking invitations at colleges. We’ve tried to stand firm to our\nbeliefs and march forward.\nSadly, the same reactionary anger has\nspread into the science fiction community with the hijacking of year’s\nHugo awards, deliberately sabotaging them for bitter, regressive\npolitical purposes. Many of the forums that orchestrate harassment\nagainst Brianna and other women in the game industry have avowed\nsupporters of the Hugo hijacking, many of whom participated in the\nvoting and strongly support Vox Day.\nWhat makes RavenCon\nparticularly uncomfortable for us is that a number of those attending\ndirectly orchestrated or benefited from the hijacking. We’ve heard\nnumbers as high as six.\nFrank Wu has won four Hugo awards. They\nare near and dear to our family. And we agree with John Scalzi, Connie\nWillis, George R. R. Martin and others about the travesty this has been.\nThe hijackers have contempt for the awards while also desperately\nwanting the legitimacy they feel it would grant them.\nTo put it\nbluntly, attending this con makes us tremendously uncomfortable. But we\nagreed to attend, long before Gamergate, and we will follow through with\nthat professional commitment.\nNeither of us wish to discuss the\nHugo hijacking with any person responsible for this atrocious action.\nBoth of us would consider it a professional courtesy if you didn’t\nattend Brianna’s Gamergate panel tomorrow.\nLet’s all enjoy what\nbrings us together, rather than focus on what brings us apart. There’s\nplenty that science fiction fans can agree on. We hope we can all enjoy\nRavenCon.\nFrank and Brianna Wu\nI know when I hear about John Flynt, the first thing I think about is his “long track record of\nprofessionalism”. Not about his pretending to be a woman, his pretending to flee his house, his being caught autoharassing, his failure as a game developer, or his ludicrous, but modestly successful attempts to promote himself as a victim of misogyny. As for the 83 claimed death threats, I would assume Mr. Flynt himself likely accounted for at least 80 of them. But it would be interesting to hear someone count how many lies Mr. Flynt tells in his #GamerGate panel; I’d put the over/under north of 30.\nAnd I’m guessing every single one of\nthese six logical fallacies\nso often relied upon by SJWs will be on display.",
  "tags": [
    "#GamerGate"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-24T11:00:00+00:00"
}