{
  "url": "https://voxday.net/2015/04/28/baltimore-burning/",
  "scraped_at": "2025-12-16T12:53:50.126711",
  "title": "Baltimore burning",
  "date_display": "April 28, 2015",
  "date_iso": "2015-04-28T08:04:00+00:00",
  "date_from_url": "2015-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yet another example of why racial and national separatism is inevitable <a href=\"http://www.washingtontimes.com/news/2015/apr/27/larry-hogan-maryland-national-guard-alert-over-bal/\">is provided</a> in living color:</p><blockquote class=\"tr_bq\"><p> Maryland Republican Gov. Larry Hogan has declared a state of emergency and has put the state’s National Guard “on alert” after a day of rioting, looting and violence targeting police in Baltimore. The violence broke out just hours after the funeral for Freddie Gray, the 25-year-old Baltimore man who died in police custody April 19, a week after he was arrested on a West Baltimore street and dragged into the back of a police wagon. Police said Mr. Gray died of severe injuries to his spine and are still investigating the circumstances behind his death…. With demonstrators threatening to take the protests to the city’s<br> prosperous downtown area, Major League Baseball officials announced the<br> cancellation of a planned game between the Baltimore Orioles and the<br> Chicago White Sox.</br></br></br></p></blockquote><p><a href=\"https://pbs.twimg.com/media/CDpB4FgW0AEZIw7.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"266\" src=\"https://pbs.twimg.com/media/CDpB4FgW0AEZIw7.jpg\" width=\"320\"/></a>Well, there is nothing like spirited public protest to revive the flagging spirits of democracy in America. Meanwhile, we are reliably informed by one DeShawn that his boy DRAYQUAN, of the Baltimore Loot Crew, IS GOIN OUT TO POP SUM PIGS.</p><p>He seems nice. No doubt after he dies in a hail of bullets after pointing that pig-shooter at the police or some National Guardsmen, we will learn all about how he wanted to go to college, how he liked to arrange flowers, and that he was really just a sweet ickle boy who happened to be in the wrong place at the wrong time.</p><p>Is it a parody? Perhaps. That’s the problem. How can you possibly tell anymore?</p></div>",
  "content_text": "Yet another example of why racial and national separatism is inevitable\nis provided\nin living color:\nMaryland Republican Gov. Larry Hogan has declared a state of emergency and has put the state’s National Guard “on alert” after a day of rioting, looting and violence targeting police in Baltimore. The violence broke out just hours after the funeral for Freddie Gray, the 25-year-old Baltimore man who died in police custody April 19, a week after he was arrested on a West Baltimore street and dragged into the back of a police wagon. Police said Mr. Gray died of severe injuries to his spine and are still investigating the circumstances behind his death…. With demonstrators threatening to take the protests to the city’s\nprosperous downtown area, Major League Baseball officials announced the\ncancellation of a planned game between the Baltimore Orioles and the\nChicago White Sox.\nWell, there is nothing like spirited public protest to revive the flagging spirits of democracy in America. Meanwhile, we are reliably informed by one DeShawn that his boy DRAYQUAN, of the Baltimore Loot Crew, IS GOIN OUT TO POP SUM PIGS.\nHe seems nice. No doubt after he dies in a hail of bullets after pointing that pig-shooter at the police or some National Guardsmen, we will learn all about how he wanted to go to college, how he liked to arrange flowers, and that he was really just a sweet ickle boy who happened to be in the wrong place at the wrong time.\nIs it a parody? Perhaps. That’s the problem. How can you possibly tell anymore?",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-28T07:04:00+00:00"
}