{
  "url": "https://voxday.net/2015/04/07/brad-torgersen-confronts-beas/",
  "scraped_at": "2025-12-16T12:51:26.622711",
  "title": "Brad Torgersen confronts the beast",
  "date_display": "April 7, 2015",
  "date_iso": "2015-04-07T20:02:00+00:00",
  "date_from_url": "2015-04-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s a little ironic that Brad Torgersen is being accused of racism, which you’ll understand <a href=\"https://bradrtorgersen.wordpress.com/2015/04/07/fort-living-room/\">if you click on the link</a>:</p><blockquote class=\"tr_bq\"><p> What disturbs me more is that the field of SF/F is stooping this low.<br> That some of my colleagues — and no, contrary to my impression of the<br> field 20 years ago, not everyone likes or gets along with each other —<br> have decided to make the nerd argument over the Hugos into a decidedly<br> personal grudge match.  Where the objective is to not just win the<br> argument, but to <i>destroy</i> the arguer.  Professionally.  In the<br> marketplace.  On the big stage of public opinion.  This is the kind of<br> stuff you ordinarily find in cut-throat national political elections,<br> but then it’s been clear for years that cut-throat politics have drifted<br> down into nerd circles of all kinds: comic book circles, movie and<br> television circles, video game circles, etc.  There’s simply no escaping<br> it.  And there are people for whom winning is more important than<br> ethics, more important than integrity, and more important than the<br> truth.</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>And the truth is, I’m not the dastardly guy Biedenharn’s piece makes me out to be.  And neither is Larry Correia.</p><p>Am I concerned with the infestation of political correctness which<br> has invaded SF/F over the last 15 years?  You bet.  Today’s ride on the<br> media dunking machine was just another iteration in the near-endless<br> attempts by the politically correct to enforce their views, with slander<br> and falsehoods when it comes down to it.  Our field is diseased.  It<br> has been struck by the same mental virus that has been permeating other<br> sectors of our culture.  As one astute and recovered victim put it, the<br> new zealots are a <a href=\"http://www.mcgilldaily.com/2014/11/everything-problematic/\">cult</a> who dwell in depression and anger, seeking the slightest excuses to lash out and make other people suffer:</br></br></br></br></br></br></br></p><blockquote><p> <i>There is something dark and vaguely cultish about this<br> particular brand of politics. I’ve thought a lot about what exactly that<br> is. I’ve pinned down four core features that make it so disturbing:<br> dogmatism, groupthink, a crusader mentality, and anti-intellectualism.</br></br></br></i></p></blockquote><p>Today, the crusader mentality decided to defame and slander Brad R.<br> Torgersen the evil demonic racist and hateful sick bigoted misognynist. As my friend Larry often quips, if I was half the bastard some of these crusaders say I am, I’d probably hate me too….</br></p><p>But really, when SF/F sinks to this depth, you know we’ve jumped a<br> certain kind of unfortunate shark.  Political correctness has gone to a<br> place of destructive take-no-prisoners soul tyranny that could very well<br> and permanently wreck this field; unless good men and women of<br> conscience decide to stand up.  I made the decision a long time ago that<br> I wasn’t going to be one of those professionals who diplomatically<br> skulks around the field, obsequiously trying to avoid controversy and<br> not upset the bigger fish.  Again, I’ve seen too much of the elephant.<br> My career isn’t so important to me that I am willing to become an<br> ideological chameleon, or cipher.  Perhaps this has angered some people<br> to the point they believe it’s time to “end” Torgersen once and for all?<br> If so, I think that’s a very sad statement — about the vindictiveness<br> that has overtaken the genre, among men and women who should probably be<br> working hard to be friends.</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Folks, until or unless political correctness is given the boot, this kind of stuff isn’t going to stop.</p><p>It won’t be just me getting the torch.  It will be you too.  You<br> other authors, and you other fans.  Political correctness has a<br> bottomless stomach, and is red in tooth and claw.  Even if you try to<br> appease the beast, it will eat you eventually anyway.</br></br></br></p></blockquote><p>Needless to say, I’m a little less surprised. I was openly warned about my sinful nature in the eyes of science fiction’s thought police more than 10 years ago, and attacked by a few of those self-appointed thought police for my thought crimes. They know perfectly well that I don’t care what they call me, so they’re going in search of what they think is easier prey, of people more inclined to give in.</p><p>Aren’t they in for a surprise!</p></div>",
  "content_text": "It’s a little ironic that Brad Torgersen is being accused of racism, which you’ll understand\nif you click on the link\n:\nWhat disturbs me more is that the field of SF/F is stooping this low.\nThat some of my colleagues — and no, contrary to my impression of the\nfield 20 years ago, not everyone likes or gets along with each other —\nhave decided to make the nerd argument over the Hugos into a decidedly\npersonal grudge match.  Where the objective is to not just win the\nargument, but to\ndestroy\nthe arguer.  Professionally.  In the\nmarketplace.  On the big stage of public opinion.  This is the kind of\nstuff you ordinarily find in cut-throat national political elections,\nbut then it’s been clear for years that cut-throat politics have drifted\ndown into nerd circles of all kinds: comic book circles, movie and\ntelevision circles, video game circles, etc.  There’s simply no escaping\nit.  And there are people for whom winning is more important than\nethics, more important than integrity, and more important than the\ntruth.\nAnd the truth is, I’m not the dastardly guy Biedenharn’s piece makes me out to be.  And neither is Larry Correia.\nAm I concerned with the infestation of political correctness which\nhas invaded SF/F over the last 15 years?  You bet.  Today’s ride on the\nmedia dunking machine was just another iteration in the near-endless\nattempts by the politically correct to enforce their views, with slander\nand falsehoods when it comes down to it.  Our field is diseased.  It\nhas been struck by the same mental virus that has been permeating other\nsectors of our culture.  As one astute and recovered victim put it, the\nnew zealots are a\ncult\nwho dwell in depression and anger, seeking the slightest excuses to lash out and make other people suffer:\nThere is something dark and vaguely cultish about this\nparticular brand of politics. I’ve thought a lot about what exactly that\nis. I’ve pinned down four core features that make it so disturbing:\ndogmatism, groupthink, a crusader mentality, and anti-intellectualism.\nToday, the crusader mentality decided to defame and slander Brad R.\nTorgersen the evil demonic racist and hateful sick bigoted misognynist. As my friend Larry often quips, if I was half the bastard some of these crusaders say I am, I’d probably hate me too….\nBut really, when SF/F sinks to this depth, you know we’ve jumped a\ncertain kind of unfortunate shark.  Political correctness has gone to a\nplace of destructive take-no-prisoners soul tyranny that could very well\nand permanently wreck this field; unless good men and women of\nconscience decide to stand up.  I made the decision a long time ago that\nI wasn’t going to be one of those professionals who diplomatically\nskulks around the field, obsequiously trying to avoid controversy and\nnot upset the bigger fish.  Again, I’ve seen too much of the elephant.\nMy career isn’t so important to me that I am willing to become an\nideological chameleon, or cipher.  Perhaps this has angered some people\nto the point they believe it’s time to “end” Torgersen once and for all?\nIf so, I think that’s a very sad statement — about the vindictiveness\nthat has overtaken the genre, among men and women who should probably be\nworking hard to be friends.\nFolks, until or unless political correctness is given the boot, this kind of stuff isn’t going to stop.\nIt won’t be just me getting the torch.  It will be you too.  You\nother authors, and you other fans.  Political correctness has a\nbottomless stomach, and is red in tooth and claw.  Even if you try to\nappease the beast, it will eat you eventually anyway.\nNeedless to say, I’m a little less surprised. I was openly warned about my sinful nature in the eyes of science fiction’s thought police more than 10 years ago, and attacked by a few of those self-appointed thought police for my thought crimes. They know perfectly well that I don’t care what they call me, so they’re going in search of what they think is easier prey, of people more inclined to give in.\nAren’t they in for a surprise!",
  "tags": [
    "Hugo Award",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-07T19:02:00+00:00"
}