{
  "url": "https://voxday.net/2015/04/30/compare-and-contras-2/",
  "scraped_at": "2025-12-16T12:54:03.865554",
  "title": "Compare and contrast",
  "date_display": "April 30, 2015",
  "date_iso": "2015-04-30T08:27:00+00:00",
  "date_from_url": "2015-04-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The SJWs in science fiction believe that if they can control the narrative, if they can convince the media to tell the story their way, they are going to retain their control of the science fiction establishment. They are given every opportunity to spin the narrative and make their case; Brad, Larry, and I were contacted by a Wall Street Journal reporter yesterday, which was a welcome change from most of the coverage that we’ve been seeing of late, but so too were John Scalzi and George Martin.</p><p>It’s just like one sees on the cable news. If a talking head has on a liberal guest, the liberal appears alone to sell the narrative. If a talking head has on a conservative guest, a liberal guest usually appears to dispute the narrative. And although it is only a guess, I suspect that the way that the story is likely to go will be moderately anti-Puppy, in light of the reporter actually “playing devil’s advocate” in conversation with me.</p><p>When I pointed out how the Puppy case is bolstered by comparing the number of Hugo nominations belonging to those in the Making Light clique, (15 for Charles Stross, 15/14 for Patrick Nielsen Hayden, and 9 for John Scalzi compared to 12 for Isaac Asimov, 12 for Robert Heinlein, and 7 for Arthur C. Clarke), the reporter shot back, and I quote, “yeah, but they’re editors!”</p><p>Although I pointed out to him that a) Charles Stross and John Scalzi are not, in fact, editors, and b) Isaac Asimov was an editor as well as a writer, I got the feeling that he was not likely to quote me concerning those readily observable and very telling facts. We’ll see, perhaps I’m wrong.</p><p>But the anti-Puppy influence over the mainstream media is largely irrelevant. Because, when people look more closely at the situation, here is the sort of thing they are seeing the Anti-Puppies say:</p><p>Anna Feruglio Dal Dan: <i>“It’s not the Hugo ballot – that is a problem, but I am solving it by gleefully voting No Award to lots of categories, and I think I will make a point not to read any of it just to annoy you – it’s the strutting and posturing and pronouncing of you guys that I find hilarious. OK, I tell a lie, some of you are just boring and lame, Kratman for example can’t even insult people creatively, but you have moments of pure comedy genius.” </i></p><p>Hampus Eckerman:<i> “</i><i>Honestly, when you are saying that there are no unwritten rules, the<br> only thing you’re really saying is that you haven’t got the social<br> competence to notice them. Even when people write them on your nose.</br></br></i></p><p>Mickey Finn: <i>“</i><i>I’ve been making my way through the short stories, novellas and<br> novelettes, and so far haven’t even encountered a competently polished<br> turd. </br></br></i></p><p>NelC:<i> “I’m not absolutely convinced that you’re not the type of loony who<br> thinks he can gain advantage by pretending to be a (different kind of)<br> loony, but either way, you’re seriously fucked in the head.”</br></br></i></p><p>Alexvdl:<i> </i><i>“I think you have articulated better than anyone else why Beale’s (and<br> other puppies) reliance on rating systems shows how far outside fandom<br> they are.”</br></br></i></p><p>Whatever reader: <i>“I had a great time voting “No Award” today… I’d rather give the award to a trash can than to the crap they spent years working on.” </i></p><p>By contrast, here is how the non-Puppies in the field see the situation.<i> </i></p><p>Rick Moen: <i>“I think it’s abundantly clear what about the Beale and Torgersen<br> campaigning and (apparent) acquisition of nomination votes has made<br> habitual Hugo voters and Worldcon co-goers very annoyed and (in my<br> estimation) in a mood to terminate what they see as behaviour hostile to<br> the Worldcon.”</br></br></br></br></i></p><p>Whereas here is how at least some of those outside science fiction are seeing it<a href=\"http://arhyalon.livejournal.com/379546.html?thread=3271578#t3271578\"></a>:</p><p>Greg Ellis: <i>“When all of this blew up I was not even a non-attending supporting<br> member of WorldCon. I’ve known about the Hugos for years, but never knew<br> I had, as a fan, a chance to vote for nominees or on the final ballot.<br> That all changed this year. What also changed was that I came down on<br> the Sad Puppies side of the debate. For awhile I was trying to look at both sides and judge equitably. I<br> was trying to be fair and open-minded and non-biased. Then I asked the<br> wrong question of the wrong people at the wrong time. Even Brianna Wu<br> chimed in on that one. I was a “white supremacist” by mere association<br> with Brad Torgerson and Larry Correia because they knew Vox Day and I<br> was friends with Brad and Larry on FaceBook. Guilt-by-association. I do<br> not tolerate being accused of something that anyone who knows me<br> understands that I am not. You want to push me into somebody else’s<br> camp, make an accusation like that.”</br></br></br></br></br></br></br></br></br></br></br></br></i></p><p> RI:<i> I’ve been a spectator to this conflict for several months now. To be<br> honest, I didn’t even know who any of the participants were when I first<br> started following. Now, because of the outcry against you, Mr. Correia,<br> and Mr. Torgersen I have become a daily reader of your blog and am<br> rapidly burning through Mr. Corriea’s books. </br></br></br></br></i></p><p>Bojoti, a Worldcon Supporting member <a href=\"http://arhyalon.livejournal.com/379546.html?thread=3271578#t3271578\">appears to share similar sentiments:</a><i> </i></p><blockquote class=\"tr_bq\"><p> I knew absolutely nothing about the Sad Puppies until this year. I knew of the Hugos but little about them, either. I’d followed George R.R. Martin’s Not a Blog for years, and I remember him encouraging people to vote because the Hugos were their award (except now, they aren’t). But, back then, I had a house full of kids which meant less time for reading and fewer dollars for sure! Now, the kids are gone, and I have more of both of the aforementioned. When I discovered that WorldCon would be held in the Midwest in 2016, I was excited and decided to get a supporting membership for this year and attend the next.</p><p>I didn’t realize all the turmoil about Sad Puppies until after the nominations were announced. I came to the situation too late to nominate and unaware that my membership would be an affront to the TrueFans. I just wanted to participate in and give back to a genre that has been integral to my life. Instead, I find that I’m not welcome at the cool kids’ table, which is ironically hilarious, because my science fiction ways were unpopular to the non-science fiction crowd of my youth.</p><p>As is my researching way, I took to the Internet to look at all sides. I went all the way back to the inception of Sad Puppies. I read “Making Light.” I Googled, read, and digested from a wide spectrum from news sources (most very biased and inaccurate), authors’ websites, Twitter, and Facebook.</p><p>I think what the TrueFans and Sad Puppies don’t realize is that they are being watched by the great unwashed masses, hoi polloi, the little people of science fiction. Some of the behavior and rhetoric is so hateful and venomous that I regret my membership. Authors were saying that the new members didn’t love science fiction; they were claiming that they didn’t even read! Some were even saying stupid things like the Koch brothers bought my membership. TrueFans were disgusted by the thought of new members. They like the WorldCon being small and are actively against new members.</p><p>I’m rethinking attending WorldCon 2016. I’ll wait to see what happens at Sasquan before I decide. If people are going to act crazy like a frenetic bag of cut snakes, I want no part of that fandom (or Fandom). I don’t need to spend money to be ostracized, belittled, and hated. I’m sure I can get that for free, elsewhere!</p><p>The TrueFans are pushing the new members right into the Sad Puppies’ doghouse. I wasn’t a Sad Puppy, but if the TrueFans don’t want me, they have proven the Sad Puppies’ charge of insular exclusivity. When the TrueFans band together and decide as a bloc NOT to read the works and agree to vote No Award to Sad Puppy nominations, they’ve lost any respect or sympathy I had for them. When people advocate putting the Puppies “down,” I’m horrified. When people write “basically if the “hero” isn’t white and male, the Puppies will get all Sad at you and threaten to rape you to death. Like the good, tolerant humans they are, natch,” I’m sickened. When an author opines the correct way to treat the Sad Puppies is “Well, we make fun of them. We refuse to play with them. We refuse to share our resources with them,” I flash back to the petty games of the middle school mean girls’ cliques.</p></blockquote><p>Baen Books author John Ringo has an idea <a href=\"https://www.facebook.com/john.ringo.90857/posts/10152765320275887\">where things are headed and why</a>:</p><blockquote class=\"tr_bq\"><p> The SJBs, CHORFs, what have you are facing an uphill climb. Their ‘award winning authors’ are hardly popular in the mainstream (also frequently boring as shit on a panel) and every convention which has tried to stay entirely ‘SJW’ has found it has little or no market.</p><p>The CHORFs accuse the SPs of ‘fighting to retain white-male privilege.’ The reality is that the CHORFs are desperate to retain any sort of relevance at all. ‘Their’ conventions are failing. ‘Their’ books don’t sell as well as ‘pulp crap’. ‘Their’ magazines are losing circulation and closing. Lose control of the Hugos and they become irrelevant. And desperate regimes get crazier and crazier the more desperate they become.</p></blockquote><p>They are not completely irrelevant yet. But they will be. And they fear it. Their over-the-top reactions make that very clear indeed.</p></div>",
  "content_text": "The SJWs in science fiction believe that if they can control the narrative, if they can convince the media to tell the story their way, they are going to retain their control of the science fiction establishment. They are given every opportunity to spin the narrative and make their case; Brad, Larry, and I were contacted by a Wall Street Journal reporter yesterday, which was a welcome change from most of the coverage that we’ve been seeing of late, but so too were John Scalzi and George Martin.\nIt’s just like one sees on the cable news. If a talking head has on a liberal guest, the liberal appears alone to sell the narrative. If a talking head has on a conservative guest, a liberal guest usually appears to dispute the narrative. And although it is only a guess, I suspect that the way that the story is likely to go will be moderately anti-Puppy, in light of the reporter actually “playing devil’s advocate” in conversation with me.\nWhen I pointed out how the Puppy case is bolstered by comparing the number of Hugo nominations belonging to those in the Making Light clique, (15 for Charles Stross, 15/14 for Patrick Nielsen Hayden, and 9 for John Scalzi compared to 12 for Isaac Asimov, 12 for Robert Heinlein, and 7 for Arthur C. Clarke), the reporter shot back, and I quote, “yeah, but they’re editors!”\nAlthough I pointed out to him that a) Charles Stross and John Scalzi are not, in fact, editors, and b) Isaac Asimov was an editor as well as a writer, I got the feeling that he was not likely to quote me concerning those readily observable and very telling facts. We’ll see, perhaps I’m wrong.\nBut the anti-Puppy influence over the mainstream media is largely irrelevant. Because, when people look more closely at the situation, here is the sort of thing they are seeing the Anti-Puppies say:\nAnna Feruglio Dal Dan:\n“It’s not the Hugo ballot – that is a problem, but I am solving it by gleefully voting No Award to lots of categories, and I think I will make a point not to read any of it just to annoy you – it’s the strutting and posturing and pronouncing of you guys that I find hilarious. OK, I tell a lie, some of you are just boring and lame, Kratman for example can’t even insult people creatively, but you have moments of pure comedy genius.”\nHampus Eckerman:\n“\nHonestly, when you are saying that there are no unwritten rules, the\nonly thing you’re really saying is that you haven’t got the social\ncompetence to notice them. Even when people write them on your nose.\nMickey Finn:\n“\nI’ve been making my way through the short stories, novellas and\nnovelettes, and so far haven’t even encountered a competently polished\nturd.\nNelC:\n“I’m not absolutely convinced that you’re not the type of loony who\nthinks he can gain advantage by pretending to be a (different kind of)\nloony, but either way, you’re seriously fucked in the head.”\nAlexvdl:\n“I think you have articulated better than anyone else why Beale’s (and\nother puppies) reliance on rating systems shows how far outside fandom\nthey are.”\nWhatever reader:\n“I had a great time voting “No Award” today… I’d rather give the award to a trash can than to the crap they spent years working on.”\nBy contrast, here is how the non-Puppies in the field see the situation.\nRick Moen:\n“I think it’s abundantly clear what about the Beale and Torgersen\ncampaigning and (apparent) acquisition of nomination votes has made\nhabitual Hugo voters and Worldcon co-goers very annoyed and (in my\nestimation) in a mood to terminate what they see as behaviour hostile to\nthe Worldcon.”\nWhereas here is how at least some of those outside science fiction are seeing it\n:\nGreg Ellis:\n“When all of this blew up I was not even a non-attending supporting\nmember of WorldCon. I’ve known about the Hugos for years, but never knew\nI had, as a fan, a chance to vote for nominees or on the final ballot.\nThat all changed this year. What also changed was that I came down on\nthe Sad Puppies side of the debate. For awhile I was trying to look at both sides and judge equitably. I\nwas trying to be fair and open-minded and non-biased. Then I asked the\nwrong question of the wrong people at the wrong time. Even Brianna Wu\nchimed in on that one. I was a “white supremacist” by mere association\nwith Brad Torgerson and Larry Correia because they knew Vox Day and I\nwas friends with Brad and Larry on FaceBook. Guilt-by-association. I do\nnot tolerate being accused of something that anyone who knows me\nunderstands that I am not. You want to push me into somebody else’s\ncamp, make an accusation like that.”\nRI:\nI’ve been a spectator to this conflict for several months now. To be\nhonest, I didn’t even know who any of the participants were when I first\nstarted following. Now, because of the outcry against you, Mr. Correia,\nand Mr. Torgersen I have become a daily reader of your blog and am\nrapidly burning through Mr. Corriea’s books.\nBojoti, a Worldcon Supporting member\nappears to share similar sentiments:\nI knew absolutely nothing about the Sad Puppies until this year. I knew of the Hugos but little about them, either. I’d followed George R.R. Martin’s Not a Blog for years, and I remember him encouraging people to vote because the Hugos were their award (except now, they aren’t). But, back then, I had a house full of kids which meant less time for reading and fewer dollars for sure! Now, the kids are gone, and I have more of both of the aforementioned. When I discovered that WorldCon would be held in the Midwest in 2016, I was excited and decided to get a supporting membership for this year and attend the next.\nI didn’t realize all the turmoil about Sad Puppies until after the nominations were announced. I came to the situation too late to nominate and unaware that my membership would be an affront to the TrueFans. I just wanted to participate in and give back to a genre that has been integral to my life. Instead, I find that I’m not welcome at the cool kids’ table, which is ironically hilarious, because my science fiction ways were unpopular to the non-science fiction crowd of my youth.\nAs is my researching way, I took to the Internet to look at all sides. I went all the way back to the inception of Sad Puppies. I read “Making Light.” I Googled, read, and digested from a wide spectrum from news sources (most very biased and inaccurate), authors’ websites, Twitter, and Facebook.\nI think what the TrueFans and Sad Puppies don’t realize is that they are being watched by the great unwashed masses, hoi polloi, the little people of science fiction. Some of the behavior and rhetoric is so hateful and venomous that I regret my membership. Authors were saying that the new members didn’t love science fiction; they were claiming that they didn’t even read! Some were even saying stupid things like the Koch brothers bought my membership. TrueFans were disgusted by the thought of new members. They like the WorldCon being small and are actively against new members.\nI’m rethinking attending WorldCon 2016. I’ll wait to see what happens at Sasquan before I decide. If people are going to act crazy like a frenetic bag of cut snakes, I want no part of that fandom (or Fandom). I don’t need to spend money to be ostracized, belittled, and hated. I’m sure I can get that for free, elsewhere!\nThe TrueFans are pushing the new members right into the Sad Puppies’ doghouse. I wasn’t a Sad Puppy, but if the TrueFans don’t want me, they have proven the Sad Puppies’ charge of insular exclusivity. When the TrueFans band together and decide as a bloc NOT to read the works and agree to vote No Award to Sad Puppy nominations, they’ve lost any respect or sympathy I had for them. When people advocate putting the Puppies “down,” I’m horrified. When people write “basically if the “hero” isn’t white and male, the Puppies will get all Sad at you and threaten to rape you to death. Like the good, tolerant humans they are, natch,” I’m sickened. When an author opines the correct way to treat the Sad Puppies is “Well, we make fun of them. We refuse to play with them. We refuse to share our resources with them,” I flash back to the petty games of the middle school mean girls’ cliques.\nBaen Books author John Ringo has an idea\nwhere things are headed and why\n:\nThe SJBs, CHORFs, what have you are facing an uphill climb. Their ‘award winning authors’ are hardly popular in the mainstream (also frequently boring as shit on a panel) and every convention which has tried to stay entirely ‘SJW’ has found it has little or no market.\nThe CHORFs accuse the SPs of ‘fighting to retain white-male privilege.’ The reality is that the CHORFs are desperate to retain any sort of relevance at all. ‘Their’ conventions are failing. ‘Their’ books don’t sell as well as ‘pulp crap’. ‘Their’ magazines are losing circulation and closing. Lose control of the Hugos and they become irrelevant. And desperate regimes get crazier and crazier the more desperate they become.\nThey are not completely irrelevant yet. But they will be. And they fear it. Their over-the-top reactions make that very clear indeed.",
  "tags": [
    "Hugo Award",
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-30T07:27:00+00:00"
}