{
  "url": "https://voxday.net/2015/04/19/critique-by-identity/",
  "scraped_at": "2025-12-16T12:52:52.155217",
  "title": "Critique by identity",
  "date_display": "April 19, 2015",
  "date_iso": "2015-04-19T16:00:00+00:00",
  "date_from_url": "2015-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I find it amusing how invariably McCarthyite the SJWs playing critic <a href=\"http://www.theguardian.com/commentisfree/2015/apr/18/hugo-award-hijack-just-proves-progressives-right\">reveal themselves to be</a>:</p><blockquote class=\"tr_bq\"><p> Over and over again, we see the mechanism by which power re-asserts itself when challenged. With a gymnastic leap, those on the defensive become the underdogs, cruelly repressed by the BBC, feminists, people from Islington, some nebulous “elite” or the suggestion that sometimes a female character in a videogame might wear a decently supportive bra.</p><p>The debate demands onlookers accept one of two contradictory premises, so there is little room for nuance and the argument never runs out of fuel. Is Farage a truth-teller or a race-baiter? Was Thornberry a metropolitan snob, or was the England flag itself a type of dogwhistle? Are the Hugo awards in thrall to a politically correct cabal, or simply making an effort to remedy an ingrained injustice? Whether it’s videogames, science fiction or Westminster politics, the underlying struggle for victim status is the same. And once you notice, it’s downright eerie to hear the same arguments – about “out-of-touch elites” who don’t connect with the tastes of “real people” – coming from the leader of Ukip and a guy who wrote a book called <i>Summa Elvetica: A Casuistry of the Elvish Controversy</i>.</p><p>There is no single answer and, at least in the case of the Hugo awards, it is not in the extremists’ interests to find one. Vox Day has built a small internet army on his manufactured grievance, and he won’t let it go lightly. If SFF fans vote to give “no award” in the categories where Rabid Puppies candidates dominate, he has threatened to ensure that the awards are never given again. It is a supremely self-interested move. Politicising the Hugos to such a degree certainly doesn’t help the nominees themselves, because authors on his slate risk being informally blacklisted by the rest of the community. Who wants to read a fantasy story endorsed by a bigot?</p></blockquote><p>This is mildly amusing, considering how it is usually asserted that I am stupid. Now I am suddenly an overly erudite elitist? Okay, actually, that’s considerably closer to the truth, but then, as an avowed anti-equalitarian, I don’t pretend to be anything but an elitist.</p><p>The important difference: unlike most elitists, I have no desire to dictate or control the behavior of the non-elite. I simply refuse to let either the elite or the non-elite claim the right to dictate or control my behavior or my beliefs.</p><p>The last question is the most interesting. We might, of course, turn it around, as it rather usefully clarifies what James May keeps pointing out to everyone. Who wants to read a fantasy story endorsed by a Communist? Who wants to read a story endorsed by a feminist? Who wants to read a fantasy story endorsed by a Negro? Who wants to read a fantasy story endorsed by a woman?</p><p>Once the idea of judging a work on its own merits, rather than on the basis of who creates or endorses it, is rejected, then there is no reason to not judge works on the very racist, sexist, and ideological grounds that the SJWs claim to bitterly oppose. They are openly demolishing the very foundations upon which their incoherent ideology rests.</p><p>The Hugo situation doesn’t “prove progressives right”. Quite to the contrary, it has clearly shown their ideology to be not only hopelessly hypocritical, but intrinsically self-contradictory too. And if the article didn’t prove it, the comments certainly do.</p><p><i>“They stand for intolerance, prejudice, fear &amp; loathing and must be rejected with scorn, derision and at times, force. Their opinion and views are not equal nor are they valid so therefore they do not deserve to be given any air time or publicity.”</i></p><p>Very well. We can certainly treat them likewise.</p></div>",
  "content_text": "I find it amusing how invariably McCarthyite the SJWs playing critic\nreveal themselves to be\n:\nOver and over again, we see the mechanism by which power re-asserts itself when challenged. With a gymnastic leap, those on the defensive become the underdogs, cruelly repressed by the BBC, feminists, people from Islington, some nebulous “elite” or the suggestion that sometimes a female character in a videogame might wear a decently supportive bra.\nThe debate demands onlookers accept one of two contradictory premises, so there is little room for nuance and the argument never runs out of fuel. Is Farage a truth-teller or a race-baiter? Was Thornberry a metropolitan snob, or was the England flag itself a type of dogwhistle? Are the Hugo awards in thrall to a politically correct cabal, or simply making an effort to remedy an ingrained injustice? Whether it’s videogames, science fiction or Westminster politics, the underlying struggle for victim status is the same. And once you notice, it’s downright eerie to hear the same arguments – about “out-of-touch elites” who don’t connect with the tastes of “real people” – coming from the leader of Ukip and a guy who wrote a book called\nSumma Elvetica: A Casuistry of the Elvish Controversy\n.\nThere is no single answer and, at least in the case of the Hugo awards, it is not in the extremists’ interests to find one. Vox Day has built a small internet army on his manufactured grievance, and he won’t let it go lightly. If SFF fans vote to give “no award” in the categories where Rabid Puppies candidates dominate, he has threatened to ensure that the awards are never given again. It is a supremely self-interested move. Politicising the Hugos to such a degree certainly doesn’t help the nominees themselves, because authors on his slate risk being informally blacklisted by the rest of the community. Who wants to read a fantasy story endorsed by a bigot?\nThis is mildly amusing, considering how it is usually asserted that I am stupid. Now I am suddenly an overly erudite elitist? Okay, actually, that’s considerably closer to the truth, but then, as an avowed anti-equalitarian, I don’t pretend to be anything but an elitist.\nThe important difference: unlike most elitists, I have no desire to dictate or control the behavior of the non-elite. I simply refuse to let either the elite or the non-elite claim the right to dictate or control my behavior or my beliefs.\nThe last question is the most interesting. We might, of course, turn it around, as it rather usefully clarifies what James May keeps pointing out to everyone. Who wants to read a fantasy story endorsed by a Communist? Who wants to read a story endorsed by a feminist? Who wants to read a fantasy story endorsed by a Negro? Who wants to read a fantasy story endorsed by a woman?\nOnce the idea of judging a work on its own merits, rather than on the basis of who creates or endorses it, is rejected, then there is no reason to not judge works on the very racist, sexist, and ideological grounds that the SJWs claim to bitterly oppose. They are openly demolishing the very foundations upon which their incoherent ideology rests.\nThe Hugo situation doesn’t “prove progressives right”. Quite to the contrary, it has clearly shown their ideology to be not only hopelessly hypocritical, but intrinsically self-contradictory too. And if the article didn’t prove it, the comments certainly do.\n“They stand for intolerance, prejudice, fear & loathing and must be rejected with scorn, derision and at times, force. Their opinion and views are not equal nor are they valid so therefore they do not deserve to be given any air time or publicity.”\nVery well. We can certainly treat them likewise.",
  "tags": [
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-19T15:00:00+00:00"
}