{
  "url": "https://voxday.net/2015/04/27/debate-dragon/",
  "scraped_at": "2025-12-16T12:53:40.559175",
  "title": "Debate the Dragon",
  "date_display": "April 27, 2015",
  "date_iso": "2015-04-27T08:39:00+00:00",
  "date_from_url": "2015-04-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Puff the Magic Dragon was talking very brave until it was suggested that he debate me himself.</p><blockquote class=\"tr_bq\"><p> <i>Go ahead and debate Vox yourself, puff. If he’s the soft target you<br> think he is, you should really be able to make him look foolish.</br></i></p><p>Debate<br> what? What are his actual positions? That’s what this is all about. He<br> puffs himself up into a controversial figure on the internet and when<br> someone calls him out on it, you find out it was all smoke and mirrors.<br> Is that supposed to be impressive? These issues aren’t as cut and dried<br> as you people seem to think they are, and apparently neither does Vox.<br> You guys  have bought into the persona as much as those “rabbits” have.</br></br></br></br></br></br></p></blockquote><p>Now, since Puff admitted that he is insufficiently knowledgeable to debate me on an economic subject, we will avoid economics despite it being one of my specialties. So, here are five actual positions that I offer Puff the Magic Dragon to debate me on. If he runs like Myers, Martin, Scalzi, and others, we will all know the value of his opinion.</p><ol><li><strike>That One Bright Start to Guide Them is a great book and The Wasp Factory is a dreadful one. </strike>Oh, wait, sorry, I agreed to debate that with Phil Sandifier on a left-wing SF podcast. Let’s start over.</li></ol><ol><li>That there are a series of continental-scale wars on the medium-term horizon that will be vicious, unconventional, and are likely to result in severe racial and national separatism.</li><li>That John Scalzi is a fraud.</li><li>That “The American Tolkien” is not a credible title for George R.R. Martin.</li><li>That “marital rape” is a logical, historical, and legal contradiction in terms.</li><li>That all modern human beings are not genetically equal.</li></ol><p>That seems like a nice broad range of subjects from which to choose. I thought it was interesting to learn that for some people, the Pakman interview was informative in helping them understand my problem communicating with people:</p><blockquote class=\"tr_bq\"><p> For the record, Vox was correct about the common law. He did seem caught off guard about the fact that rape, even within marriage, is against the law in most states if not all. Pakman tried to use this as a “GOTCHA!” moment, and Vox looked confused, even though his point was not invalidated and his argument was still correct. The average person would come across thinking Vox was wrong, though.</p><p>This was actually the first time I really made sense of how Vox’s mind works. As an earlier commenter said, Vox is so far ahead that it seems to stump him that someone isn’t making the same logical jumps as quickly as he does — having to explain every step is very annoying.</p></blockquote><p>It’s not always annoying (although it often is) but it is usually confusing. This is especially true when I am dealing with someone new because I have no idea at what point their ability to follow the train of logic is going to fail without warning. I was very confused when Pakman brought up US law in a bizarre attempt to rebut my reference to the historical Common Law. That’s rather like pointing out that the US lost in Vietnam to rebut a claim that the US invaded Normandy in World War II.</p><p>Where does one even go with that? Try to give him a basic primer on the historical basis for US law? Tell him that he’s an ignorant MPAI member and leave it at that? The best thing would have been to point out that his reference to US law was irrelevant and to observe that the post to which he referred was written in response to an Indian court upholding section 375 of the Indian Penal Code, except I didn’t recall that at the time because I had no idea I was going to be asked about a short three-paragraph blog post from over a year ago.</p><p>Rhetorically speaking, I suppose the best thing to do if I’m concerned about my self-image is to say “so what” and unmask the fact that he can’t follow the train of thought. But I try to be a polite guest. Perhaps I will need to rethink that policy if the host is an ambush artist; virtually none of the interviews I’d given in the past attempted to play gotcha without giving me fair warning about what the subjects would be beforehand.</p><p>I highlighted the irrelevance of his appeal to US law by reminding him that I don’t live in the USA. Which I have no doubt sounded like a non sequitur to many, only the non sequitur was Pakman’s. But I can’t help it if a lot of people didn’t understand that, because I can’t simultaneously fill in the gaps in their knowledge and defend myself against a dishonest, time-limited ambush at the same time.</p></div>",
  "content_text": "Puff the Magic Dragon was talking very brave until it was suggested that he debate me himself.\nGo ahead and debate Vox yourself, puff. If he’s the soft target you\nthink he is, you should really be able to make him look foolish.\nDebate\nwhat? What are his actual positions? That’s what this is all about. He\npuffs himself up into a controversial figure on the internet and when\nsomeone calls him out on it, you find out it was all smoke and mirrors.\nIs that supposed to be impressive? These issues aren’t as cut and dried\nas you people seem to think they are, and apparently neither does Vox.\nYou guys  have bought into the persona as much as those “rabbits” have.\nNow, since Puff admitted that he is insufficiently knowledgeable to debate me on an economic subject, we will avoid economics despite it being one of my specialties. So, here are five actual positions that I offer Puff the Magic Dragon to debate me on. If he runs like Myers, Martin, Scalzi, and others, we will all know the value of his opinion.\nThat One Bright Start to Guide Them is a great book and The Wasp Factory is a dreadful one.\nOh, wait, sorry, I agreed to debate that with Phil Sandifier on a left-wing SF podcast. Let’s start over.\nThat there are a series of continental-scale wars on the medium-term horizon that will be vicious, unconventional, and are likely to result in severe racial and national separatism.\nThat John Scalzi is a fraud.\nThat “The American Tolkien” is not a credible title for George R.R. Martin.\nThat “marital rape” is a logical, historical, and legal contradiction in terms.\nThat all modern human beings are not genetically equal.\nThat seems like a nice broad range of subjects from which to choose. I thought it was interesting to learn that for some people, the Pakman interview was informative in helping them understand my problem communicating with people:\nFor the record, Vox was correct about the common law. He did seem caught off guard about the fact that rape, even within marriage, is against the law in most states if not all. Pakman tried to use this as a “GOTCHA!” moment, and Vox looked confused, even though his point was not invalidated and his argument was still correct. The average person would come across thinking Vox was wrong, though.\nThis was actually the first time I really made sense of how Vox’s mind works. As an earlier commenter said, Vox is so far ahead that it seems to stump him that someone isn’t making the same logical jumps as quickly as he does — having to explain every step is very annoying.\nIt’s not always annoying (although it often is) but it is usually confusing. This is especially true when I am dealing with someone new because I have no idea at what point their ability to follow the train of logic is going to fail without warning. I was very confused when Pakman brought up US law in a bizarre attempt to rebut my reference to the historical Common Law. That’s rather like pointing out that the US lost in Vietnam to rebut a claim that the US invaded Normandy in World War II.\nWhere does one even go with that? Try to give him a basic primer on the historical basis for US law? Tell him that he’s an ignorant MPAI member and leave it at that? The best thing would have been to point out that his reference to US law was irrelevant and to observe that the post to which he referred was written in response to an Indian court upholding section 375 of the Indian Penal Code, except I didn’t recall that at the time because I had no idea I was going to be asked about a short three-paragraph blog post from over a year ago.\nRhetorically speaking, I suppose the best thing to do if I’m concerned about my self-image is to say “so what” and unmask the fact that he can’t follow the train of thought. But I try to be a polite guest. Perhaps I will need to rethink that policy if the host is an ambush artist; virtually none of the interviews I’d given in the past attempted to play gotcha without giving me fair warning about what the subjects would be beforehand.\nI highlighted the irrelevance of his appeal to US law by reminding him that I don’t live in the USA. Which I have no doubt sounded like a non sequitur to many, only the non sequitur was Pakman’s. But I can’t help it if a lot of people didn’t understand that, because I can’t simultaneously fill in the gaps in their knowledge and defend myself against a dishonest, time-limited ambush at the same time.",
  "tags": [
    "debate",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-27T07:39:00+00:00"
}