{
  "url": "https://voxday.net/2015/04/30/defensive-muc/",
  "scraped_at": "2025-12-16T12:54:06.877658",
  "title": "Defensive much?",
  "date_display": "April 30, 2015",
  "date_iso": "2015-04-30T16:12:00+00:00",
  "date_from_url": "2015-04-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Johnny Con is feeling a little caught out. And defensive:</p><blockquote class=\"tr_bq\"><p>     1. It’s been recently suggested that I should be ashamed for getting the Hugo for Redshirts (by an author who hasn’t himself read the book).</p><p>    2. To be clear: I am not. I am deeply pleased it won, and I think it was entirely deserving of the award, and the other awards it won.</p><p>    3. It’s funny and an easy read, and if you think that’s easy to accomplish as a writer — and still pack an emotional punch — well, try it.</p><p>    4. The same author suggested (again without reading it), that it was a “social justice” sort of book, which lent itself to winning.</p><p>    5. It is, in fact probably the least racially/sexually diverse book I’ve written BECAUSE the characters were supposed to reflect a BAD show.</p><p>    6. Indeed, when the TV script for it was written, they CHANGED the sex of a couple of characters to make it more diverse! This is true.</p><p>    7. So it really is a bad example of a Social Justice-y sort of book. Much worse, in fact, than my OMW series in general.</p><p>    8. Also, if the “SJWs” vote en bloc, why would they award me, SWM, when Saladin Ahmed and Mira Grant were on the ballot?</p><p>    9. The only answer here would be because the SJWs secretly crave straight white male leadership, which would be kinda not SJW-y at all.</p><p>    10. I’m happy with the politics I have and I try to be a good human, which is apparently what makes me an SJW. But Redshirts is, in fact…</p><p>    11. … a genuinely TERRIBLE example of a book to show influence of the SJW cabal, both in content, and in its year. It’s a bad argument.</p><p>    12. The book won for a number of reasons, including people just liked it. But because of an SJW cabal? Really, no. That’s dumb.</p><p>    13. I’m done.</p></blockquote><p>My rebuttal:<br>  <i><br/></i><br> <i>“Man, I owe you a blowjob,” Duvall said.</i></br></br></p><p><i>“What?” Dahl said.</i></p><p><i>“What?” Hester said.</i></p><p><i>“Sorry,” Duvall said. “In ground forces, when someone does you a<br> favor you tell them you owe them a sex act. If it’s a little thing, it’s<br> a handjob. Medium, blowjob. Big favor, you owe them a fuck. Force of<br> habit. It’s just an expression.”</br></br></br></i><br> <i><br/></i><br> <i>“Got it,” Dahl said.</i><br> <i><br/></i><br> <i>“No actual blowjob forthcoming,” Duvall said. “To be clear”</i></br></br></br></br></p><p><i>“It’s the thought that counts,” Dahl said, and turned to Hester. “What about you? You want to owe me a blowjob, too?”</i></p><p><i>“I’m thinking about it ,” Hester said.  <br> </br></i></p><p>Best Novel-worthy prose or Participation Hugo? You decide. This is nearly as amusing:</p><blockquote class=\"tr_bq\"><p> I do find the fixation on me weird, and I really do think it comes down to the fact that I would be the perfect flag-bearer for the sort of person who identifies as a Puppy, if for the inconvenient fact of my personal politics. And also because Beale really has a thing for me, which is straight-up pure envy, as far as I can tell.</p></blockquote><p>Yes, because contempt is so easily confused for straight-up pure envy. What It was a little more than two years ago that I was informed I was desperately jealous of Mr. Scalzi because his blog readership was “ten times the size of mine.” Now that my blog readership is three times the size of his, I’m envious of what, his failed career as a game writer? I’m the lead designer on six different games. His career as a writer? If I find an hour to write every other day, I’m fortunate.</p><p>John Scalzi has been attacking me and calling me names for just over ten years now. He’s been attacking my readers and calling them names for nearly as long. It’s absolutely stupid for the pathetic fraud to pretend he doesn’t know why we continue to go after him. He’s squirmed, he’s dissembled, and he’s spun, but he’s never simply admitted that he lied. He’s never apologized. He’s never simply admitted that he was wrong.</p><p>It’s kind of a pity the traffic didn’t quite hit 2 million this month, but fell 90k short. Because this would have been the perfect time to juxstapose that graphic with Scalzi’s 2010 interview with Lightspeed, in which he exaggerated his traffic <a href=\"https://archive.is/fb7OR\">by a mere 1.7 million</a>.</p><blockquote class=\"tr_bq\"><p> there’s more to John Scalzi and his writing than meets the eye. For one<br> thing, his blog gets an extraordinary amount of traffic for a writer’s<br> website–Scalzi himself quotes it at over <b>45,000 unique visitors daily</b><b> </b>and<br> more than two million page views monthly. And it’s well-deserved<br> traffic, too, in light of the man’s reputation for posting unique<br> content.</br></br></br></br></br></p></blockquote><p>I find it amusing that so many SJWs still try to pretend that 300k pageviews per month was “extraordinary traffic” while simultaneously insisting that more than 6x that much is nothing. The lesson, as always: SJWS always lie. Case in point:</p><div class=\"comment-content\"><blockquote class=\"tr_bq\"><p> Re: “Feud” with VD:</p><p>I kind of get exasperated with it being regarded as a feud. What it<br> is, is Beale obsessing about me and maneuvering that obsession into my<br> path so I have to deal with it. Which I would submit is less a feud, and<br> more dealing with something akin to a persistent stalker.</br></br></br></p></blockquote><p>Right, which is why he put together his mock charity drive and put pressure on the SFWA Board so they would pretend to expel me just to keep him and PNH in SFWA. The Scalzi cries “stalker” as he attacks you.</p></div></div>",
  "content_text": "Johnny Con is feeling a little caught out. And defensive:\n1. It’s been recently suggested that I should be ashamed for getting the Hugo for Redshirts (by an author who hasn’t himself read the book).\n2. To be clear: I am not. I am deeply pleased it won, and I think it was entirely deserving of the award, and the other awards it won.\n3. It’s funny and an easy read, and if you think that’s easy to accomplish as a writer — and still pack an emotional punch — well, try it.\n4. The same author suggested (again without reading it), that it was a “social justice” sort of book, which lent itself to winning.\n5. It is, in fact probably the least racially/sexually diverse book I’ve written BECAUSE the characters were supposed to reflect a BAD show.\n6. Indeed, when the TV script for it was written, they CHANGED the sex of a couple of characters to make it more diverse! This is true.\n7. So it really is a bad example of a Social Justice-y sort of book. Much worse, in fact, than my OMW series in general.\n8. Also, if the “SJWs” vote en bloc, why would they award me, SWM, when Saladin Ahmed and Mira Grant were on the ballot?\n9. The only answer here would be because the SJWs secretly crave straight white male leadership, which would be kinda not SJW-y at all.\n10. I’m happy with the politics I have and I try to be a good human, which is apparently what makes me an SJW. But Redshirts is, in fact…\n11. … a genuinely TERRIBLE example of a book to show influence of the SJW cabal, both in content, and in its year. It’s a bad argument.\n12. The book won for a number of reasons, including people just liked it. But because of an SJW cabal? Really, no. That’s dumb.\n13. I’m done.\nMy rebuttal:\n“Man, I owe you a blowjob,” Duvall said.\n“What?” Dahl said.\n“What?” Hester said.\n“Sorry,” Duvall said. “In ground forces, when someone does you a\nfavor you tell them you owe them a sex act. If it’s a little thing, it’s\na handjob. Medium, blowjob. Big favor, you owe them a fuck. Force of\nhabit. It’s just an expression.”\n“Got it,” Dahl said.\n“No actual blowjob forthcoming,” Duvall said. “To be clear”\n“It’s the thought that counts,” Dahl said, and turned to Hester. “What about you? You want to owe me a blowjob, too?”\n“I’m thinking about it ,” Hester said.\nBest Novel-worthy prose or Participation Hugo? You decide. This is nearly as amusing:\nI do find the fixation on me weird, and I really do think it comes down to the fact that I would be the perfect flag-bearer for the sort of person who identifies as a Puppy, if for the inconvenient fact of my personal politics. And also because Beale really has a thing for me, which is straight-up pure envy, as far as I can tell.\nYes, because contempt is so easily confused for straight-up pure envy. What It was a little more than two years ago that I was informed I was desperately jealous of Mr. Scalzi because his blog readership was “ten times the size of mine.” Now that my blog readership is three times the size of his, I’m envious of what, his failed career as a game writer? I’m the lead designer on six different games. His career as a writer? If I find an hour to write every other day, I’m fortunate.\nJohn Scalzi has been attacking me and calling me names for just over ten years now. He’s been attacking my readers and calling them names for nearly as long. It’s absolutely stupid for the pathetic fraud to pretend he doesn’t know why we continue to go after him. He’s squirmed, he’s dissembled, and he’s spun, but he’s never simply admitted that he lied. He’s never apologized. He’s never simply admitted that he was wrong.\nIt’s kind of a pity the traffic didn’t quite hit 2 million this month, but fell 90k short. Because this would have been the perfect time to juxstapose that graphic with Scalzi’s 2010 interview with Lightspeed, in which he exaggerated his traffic\nby a mere 1.7 million\n.\nthere’s more to John Scalzi and his writing than meets the eye. For one\nthing, his blog gets an extraordinary amount of traffic for a writer’s\nwebsite–Scalzi himself quotes it at over\n45,000 unique visitors daily\nand\nmore than two million page views monthly. And it’s well-deserved\ntraffic, too, in light of the man’s reputation for posting unique\ncontent.\nI find it amusing that so many SJWs still try to pretend that 300k pageviews per month was “extraordinary traffic” while simultaneously insisting that more than 6x that much is nothing. The lesson, as always: SJWS always lie. Case in point:\nRe: “Feud” with VD:\nI kind of get exasperated with it being regarded as a feud. What it\nis, is Beale obsessing about me and maneuvering that obsession into my\npath so I have to deal with it. Which I would submit is less a feud, and\nmore dealing with something akin to a persistent stalker.\nRight, which is why he put together his mock charity drive and put pressure on the SFWA Board so they would pretend to expel me just to keep him and PNH in SFWA. The Scalzi cries “stalker” as he attacks you.",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-30T15:12:00+00:00"
}