{
  "url": "https://voxday.net/2015/04/27/equality-impossible-quest-reviewed/",
  "scraped_at": "2025-12-16T12:53:48.261053",
  "title": "EQUALITY: THE IMPOSSIBLE QUEST reviewed",
  "date_display": "April 27, 2015",
  "date_iso": "2015-04-27T19:30:00+00:00",
  "date_from_url": "2015-04-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ann Sterzinger reviews Martin van Creveld’s <a href=\"http://www.amazon.com/Equality-Impossible-Martin-van-Creveld-ebook/dp/B00UVLE20W/ref=pd_sim_kstore_1?ie=UTF8&amp;refRID=0BS583CJ18QYJ0K20E5R\"><i><b>EQUALITY: THE IMPOSSIBLE QUEST</b></i></a> in a fairly detailed article entitled: <a href=\"http://www.triggerwarning.us/your-stupid-questions-have-no-answer-martin-van-creveld-vs-the-chimera-of-equality/\">“Your Stupid Questions Have No Answers: Martin van Creveld vs. the Chimera of Equality”</a>:</p><blockquote class=\"tr_bq\"><p> Van Creveld’s <i>Equality</i> is one of Castalia’s most absorbing<br> releases, if you’re interested in history anyway—past history, not the<br> historical destiny of your marching-drum ideology—the sort of history<br> that’s not only full of holes where the victors and the monks wrote over<br> chunks of the evidence, but the sort of history that, as far as we <i>can</i> tell, indeed has been repeating itself rather drearily.</br></br></br></br></p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2015/04/equality_960.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/04/equality_960.jpg\" width=\"200\"/></a></div><p>As van Creveld says in his preface, the histories of our other two<br> unattainable ideals, liberty and justice, have been written before—or,<br> rather, attempted; there’s too much to read on all three of these<br> subjects for one guy to do it at a go. But van Creveld does his best to<br> describe all our tragic, failed attempts at equality. When we’ve bothered to make an attempt, that is.</br></br></br></br></p><p>Van Creveld also dwells on one of my all-time favorite tear-jerkers:<br> the tragic failure of the classical fifth-century democracy at Athens.<br> This was history’s most famous attempt at “one man, one vote on every<br> issue,” and the resulting <i>polis </i>served as the cradle of the<br> greatest explosion of civilized thought and art in our history. The<br> glory lasted all of about a generation and a half, during which time the<br> Athenian mob destroyed themselves by repeatedly voting to attack their<br> neighbors at Sparta.</br></br></br></br></br></br></br></p><p>The Spartan attempt at equality, by the way, is more thoroughly given<br> its due by van Creveld than I’ve seen in any other historical text. He<br> also includes fresh perspectives on the interesting mishmash that was<br> feudalism (a derogatory name invented by snooty post-feudalists); Locke<br> vs. Rousseau vs. Montesquieu; the fitful, failed, and often bloody<br> attempts of Hellenic city-states to achieve equality after Alexander;<br> the ironically “vicious inequalities” of communism; the ever-miserable<br> war of the sexes; and the medieval revolt of the French <i>jacquerie</i>. The book is as rich in historical detail and perspective as it is thick with bitter disappointment.</br></br></br></br></br></br></br></p><p>Over and over again, van Creveld is forced toward the same conclusion: there are hardly ever two <i>individuals </i>who<br> are equal, much less entire social classes. And as lovely as it may be<br> to enjoy citizenship (if you can get it) in a relatively egalitarian<br> city-state, it’s only a matter of time before your <i>polis </i>gets<br> swallowed up by the greater driving power—a power which may actually be<br> the result of greater inequality and therefore organization—of a nearby<br> empire. Take, for instance, the way the squabbling Greek city-states<br> were swallowed by the burgeoning Macedonians’ power-lust. Alexander the<br> Great actually managed to co-opt the Greek cultural prestige while<br> stripping the Greeks of their political sovereignty and moving on to<br> bulldoze the Middle East.</br></br></br></br></br></br></br></br></br></br></p><p>Oh, and capitalism never helped much. It may have used the traders<br> and urban islands—which, clinging to the margins of feudalism, added a<br> dash of meritocracy to the stupid-son mix—to get its momentum going. But<br> then, says van Creveld, “The shift towards capitalism and absolutism<br> did not mean that inequality grew less pronounced. On the contrary, the<br> growing power of the modern state, which in many ways was based on a<br> firm partnership between the kings and their nobilities, caused it to be<br> accentuated even more.”</br></br></br></br></br></br></br></p></blockquote><p>Read the whole thing there. As for the book itself, <b><i>EQUALITY: THE IMPOSSIBLE QUEST </i></b>is available <a href=\"http://www.amazon.com/Equality-Impossible-Martin-van-Creveld-ebook/dp/B00UVLE20W/ref=pd_sim_kstore_1?ie=UTF8&amp;refRID=0BS583CJ18QYJ0K20E5R\">at Amazon</a> and <a href=\"http://www.castaliahouse.com/downloads/equality-the-impossible-quest/\">at Castalia House</a>. And speaking of Castalia House, you won’t want to miss <a href=\"http://www.castaliahouse.com/a-conversation-with-thomas-mays/\">Jeffro’s interview with Thomas Mays</a>, US Navy Commander and author of <b><i>A SWORD INTO DARKNESS</i></b>:</p><blockquote class=\"tr_bq\"><p> <b>Jeffro: </b>I have to hand it to you… I was utterly riveted by the scene from your A Sword Into Darkness when they used those fancy missiles of yours on an asteroid for target practice. It’s never crossed my mind that such a thing could be a problem in the first place, much less that a real spaceship would have all manner of ancillary problems to deal with in the process. How did you come up with all of that?</p><p><b>Thomas Mays: </b>You mean in terms of “It’s not like Star Wars, where the target blows up and that’s it?” Well, It’s a question of weapon effects. If you’re going to vaporize something, you have to have a mechanism that can contain the target long enough to apply sufficient energy to break down every molecular bond it has. That’s . . . a LOT of energy and actually very difficult to do. Even with antimatter, the target and the antimatter would tend to blow one another away from contact after only a few micrograms exploded. Aside from my engine (which is a handwavium 1g reaction drive with no reaction mass requirement, used so the story stays exciting (it moves at the speed of plot!)), most of the tech is within the realm of reason.</p><p>For the most bang for my buck, I wanted nukes. But nukes don’t work the same way exo-atmospheric. They burn and vaporize up close, and only produce a real blast effect if they blow up inside something. And if you do that, you’re going to have a lot of debris. How do you handle that? Use a different weapon that can reach out and touch someone. So I thought, LASER! But no. Lasers don’t zap things. They burn and vaporize, and they take time and focus. So that means I need big mirrors or lenses, and still the focal length will be relatively small. Lasers weapons are shorter range devices. Kind of like CIWS.</p><p>So, I went to my old standby: electromagnetic railguns, which I worked on for my Master’s Degree in Applied Physics. Figure out the proper shell velocity, then figure out your ammo for various effects. Everything in that scene derives from first principles. But I did have a lot of help and reference material from the Atomic Rockets website by Winchell Chung. That helped with a lot of the book’s technical details.</p></blockquote></div>",
  "content_text": "Ann Sterzinger reviews Martin van Creveld’s\nEQUALITY: THE IMPOSSIBLE QUEST\nin a fairly detailed article entitled:\n“Your Stupid Questions Have No Answers: Martin van Creveld vs. the Chimera of Equality”\n:\nVan Creveld’s\nEquality\nis one of Castalia’s most absorbing\nreleases, if you’re interested in history anyway—past history, not the\nhistorical destiny of your marching-drum ideology—the sort of history\nthat’s not only full of holes where the victors and the monks wrote over\nchunks of the evidence, but the sort of history that, as far as we\ncan\ntell, indeed has been repeating itself rather drearily.\nAs van Creveld says in his preface, the histories of our other two\nunattainable ideals, liberty and justice, have been written before—or,\nrather, attempted; there’s too much to read on all three of these\nsubjects for one guy to do it at a go. But van Creveld does his best to\ndescribe all our tragic, failed attempts at equality. When we’ve bothered to make an attempt, that is.\nVan Creveld also dwells on one of my all-time favorite tear-jerkers:\nthe tragic failure of the classical fifth-century democracy at Athens.\nThis was history’s most famous attempt at “one man, one vote on every\nissue,” and the resulting\npolis\nserved as the cradle of the\ngreatest explosion of civilized thought and art in our history. The\nglory lasted all of about a generation and a half, during which time the\nAthenian mob destroyed themselves by repeatedly voting to attack their\nneighbors at Sparta.\nThe Spartan attempt at equality, by the way, is more thoroughly given\nits due by van Creveld than I’ve seen in any other historical text. He\nalso includes fresh perspectives on the interesting mishmash that was\nfeudalism (a derogatory name invented by snooty post-feudalists); Locke\nvs. Rousseau vs. Montesquieu; the fitful, failed, and often bloody\nattempts of Hellenic city-states to achieve equality after Alexander;\nthe ironically “vicious inequalities” of communism; the ever-miserable\nwar of the sexes; and the medieval revolt of the French\njacquerie\n. The book is as rich in historical detail and perspective as it is thick with bitter disappointment.\nOver and over again, van Creveld is forced toward the same conclusion: there are hardly ever two\nindividuals\nwho\nare equal, much less entire social classes. And as lovely as it may be\nto enjoy citizenship (if you can get it) in a relatively egalitarian\ncity-state, it’s only a matter of time before your\npolis\ngets\nswallowed up by the greater driving power—a power which may actually be\nthe result of greater inequality and therefore organization—of a nearby\nempire. Take, for instance, the way the squabbling Greek city-states\nwere swallowed by the burgeoning Macedonians’ power-lust. Alexander the\nGreat actually managed to co-opt the Greek cultural prestige while\nstripping the Greeks of their political sovereignty and moving on to\nbulldoze the Middle East.\nOh, and capitalism never helped much. It may have used the traders\nand urban islands—which, clinging to the margins of feudalism, added a\ndash of meritocracy to the stupid-son mix—to get its momentum going. But\nthen, says van Creveld, “The shift towards capitalism and absolutism\ndid not mean that inequality grew less pronounced. On the contrary, the\ngrowing power of the modern state, which in many ways was based on a\nfirm partnership between the kings and their nobilities, caused it to be\naccentuated even more.”\nRead the whole thing there. As for the book itself,\nEQUALITY: THE IMPOSSIBLE QUEST\nis available\nat Amazon\nand\nat Castalia House\n. And speaking of Castalia House, you won’t want to miss\nJeffro’s interview with Thomas Mays\n, US Navy Commander and author of\nA SWORD INTO DARKNESS\n:\nJeffro:\nI have to hand it to you… I was utterly riveted by the scene from your A Sword Into Darkness when they used those fancy missiles of yours on an asteroid for target practice. It’s never crossed my mind that such a thing could be a problem in the first place, much less that a real spaceship would have all manner of ancillary problems to deal with in the process. How did you come up with all of that?\nThomas Mays:\nYou mean in terms of “It’s not like Star Wars, where the target blows up and that’s it?” Well, It’s a question of weapon effects. If you’re going to vaporize something, you have to have a mechanism that can contain the target long enough to apply sufficient energy to break down every molecular bond it has. That’s . . . a LOT of energy and actually very difficult to do. Even with antimatter, the target and the antimatter would tend to blow one another away from contact after only a few micrograms exploded. Aside from my engine (which is a handwavium 1g reaction drive with no reaction mass requirement, used so the story stays exciting (it moves at the speed of plot!)), most of the tech is within the realm of reason.\nFor the most bang for my buck, I wanted nukes. But nukes don’t work the same way exo-atmospheric. They burn and vaporize up close, and only produce a real blast effect if they blow up inside something. And if you do that, you’re going to have a lot of debris. How do you handle that? Use a different weapon that can reach out and touch someone. So I thought, LASER! But no. Lasers don’t zap things. They burn and vaporize, and they take time and focus. So that means I need big mirrors or lenses, and still the focal length will be relatively small. Lasers weapons are shorter range devices. Kind of like CIWS.\nSo, I went to my old standby: electromagnetic railguns, which I worked on for my Master’s Degree in Applied Physics. Figure out the proper shell velocity, then figure out your ammo for various effects. Everything in that scene derives from first principles. But I did have a lot of help and reference material from the Atomic Rockets website by Winchell Chung. That helped with a lot of the book’s technical details.",
  "tags": [
    "Book Review",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-27T18:30:00+00:00"
}