{
  "url": "https://voxday.net/2015/04/09/george-martin-admits-hugo-campaigns/",
  "scraped_at": "2025-12-16T12:51:38.809346",
  "title": "George Martin admits Hugo campaigns",
  "date_display": "April 9, 2015",
  "date_iso": "2015-04-09T13:43:00+00:00",
  "date_from_url": "2015-04-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>He is to be commended for not following the SJW lead in attempting to deny the undeniable, which is to say <a href=\"http://grrm.livejournal.com/417812.html\">the long and easily verified history of organized Hugo campaigning</a>:</p><blockquote class=\"tr_bq\"><p>  In the ongoing discussion of Puppygate, numerous people have cited one instance, wherein a stack of identical nominating ballots arrived with the same postmark, paid for by consecutive money orders. Those were disallowed. In 1987, members of the Church of Scientology campaigned successfully to place L. Ron Hubbard’s BLACK GENESIS on the Best Novel ballot. That was not disallowed — the Scientologists had done nothing illegal, after all, all they’d done is buy supporting memberships to a convention that they had no intention of attending, for the sole purpose of nominating LRH for a Hugo (hmmm, why does that tactic sound familiar?) — but their campaign created a huge backlash. Hubbard’s name was booed lustily at the Hugo ceremony in Brighton, and his book finished last in the final balloting, behind No Award. (The winner that year was Orson Scott Card, with SPEAKER FOR THE DEAD, for those who are counting).</p><p>Of course, there were also recommended reading lists. That wasn’t campaigning, not strictly, but certain lists could have huge influence on the final ballot. The annual LOCUS Recommended Reading List, compiled by Charles Brown and his staff and reviewers, was the most influential. If your book or story made that list… well, it did not guarantee you a place on the ballot, but it sure improved your chances. NESFA (the New England fan club) had an annual list as well, and LASFS might have done the same, not sure. And of course the Nebulas, which came before the Hugos, carried a lot of weight too. Win a Nebula, and the chances were good that you’d be a Hugo nominee as well. Again, no guarantee, some years the shortlists diverged sharply… but more often than not, there was a lot of overlap.</p><p>So there were always these factors in play. Cliques, I can hear the Sad Puppies saying. Yeah, maybe. Thing is, they were COMPETING cliques. The NESFA list and the Nebula list were not the same, and the LOCUS list… the LOCUS list was always very long. Five spots on the Hugo ballot, and LOCUS would recommend twenty books, or thirty… sometimes more, when they started putting SF and fantasy in separate categories.</p><p>Bottom line, lots of people influenced the Hugos (or tried to), but no one ever successfully controlled the Hugos.</p><p>That became even more true when we entered the age of the internet. Suddenly blogs and bulletin boards and listservs were everywhere, and there were DOZENS of people drawing up recommended reading lists and suggesting books and writers and stories. Sweet chaos. It was glorious. So many people talking about books, arguing about books, reading books.</p><p>That was also when the practice of writers blogging about their own eligible books and stories took root. “Say, the Hugo nominations are coming up, and I had a few things out last year. Hey, check them out.” Some people were deeply offended by this practice. (Some still are. Check out the blogs of Peter Watts and Adam Roberts on the subject, for instance). Others, especially newer writers and those hungry for attention, seized on it at once as a way of getting their name out there. Publishers and editors began to encourage it. Publicity and advertising budgets being what they were (non-existent in many cases), new writers and midlist writers soon realized that if they did not publicize their books, no one would.</p><p>And once it really got rolling, there was no stopping it. “Everyone else is doing it,” you heard writers say. “I have to do it, in self-defense.” They were not wrong. Sometimes the difference between making the Hugo ballot and falling short is a single vote. The writer who refused to self-promote and then fell a few votes short… ouch.</p><p>[And yes, I have done all this myself. Mentioned my own work, drawn up recommended reading lists, blogged passionately about people I thought deserved a nomination. I am not condemning the practice, just reporting on it. It always made me feel awkward, but like many of my friends, I knew that if I refrained and then missed the ballot by a few votes, I would be kicking myself. I’d sooner see the practice die out. But until it does, you have to play the game.]</p><p>Of course, not everyone was equally good at self-promotion. Certain subfandoms were better organized than others (the DOCTOR WHO fans, for instance). Certain writers were more skilled at social media than others, and built up huge personal followings on Twitter and Facebook, or through their blogs… numbers that soon translated to multiple Hugo nominations.</p><p>And that was pretty much where we stood, until the Sad Puppies came along…. The Sad Puppies did not invent Hugo campaigning, by any means. But they escalated it, just as that magazine/publisher partnership did way back when. They turned it up to eleven. Their slate was more effective that anyone could ever have dreamed, so effective that they drowned out pretty much all the other voices. They ran the best organized, most focused, and most effective awards campaign in the history of our genre, and showed everyone else how it’s done.</p></blockquote><p>It’s fascinating to see SJWs like John Scalzi twittering that Sad Puppies are on the wrong side of Mr. Martin when he just cut the legs out from under most of the opposition’s arguments. Observe what Mr. Martin has admitted, contra the SJWs, and particularly the Making Light clique.</p><ol><li> Whisper campaigns and bloc votes are real and have existed for decades. I’ve talked to a number of old school authors and the story is the same in every case. People have bought multiple memberships for their families, for their extended families, and voted them as a bloc. Publishers used to send free copies of the books they were specifically pushing for Best Novel to all the convention voters. Authors agreed to trade votes with each other in an arrangement known as “logrolling”.</li><li>We did not invent Hugo campaigning. Neither did John Scalzi. But just as he created Award Pimpage and used his blog to get him a Fan Writer Hugo, then, in a tactic imitated by Jim Hines and Kameron Hurley, used it as a pivot for his successful Best Novel campaign. Now he has 9 Hugo nominations and 3 Hugo Awards, which means that he has more nominations than Jerry Pournelle and Arthur C. Clarke, and 3 more Hugo Awards than Ray Bradbury, A.E. van Vogt, Lester del Rey; Gregory Benford, Norman Spinrad, Terry Pratchett and Iain M. Banks combined. The difference is that Scalzi’s <a href=\"http://whatever.scalzi.com/2008/01/03/the-2008-award-pimpage-post/\">Award Pimpage campaigns</a> benefited only himself. Sad Puppies has helped bring attention to the work of a broad spectrum of hitherto unrecognized, but meritorious authors.</li><li>Teresa Nielsen Hayden and everyone else who has claimed that there were no previous campaigns is lying.</li><li>Mr. Martin correctly decries the No Award tactic as the nuclear option, because “too many innocents would be hurt, and the Hugos would be destroyed”. He is correct. Those who are advocating it as a way to teach Sad Puppies a lesson are completely failing to understand the situation.</li><li>There are those who think No Award will send a message that this kind of campaigning is not wanted at the Hugos. Sure, it will send a very clear message to Sad Puppies. And that message will be: unleash the Rabid Puppies. </li><li>We don’t feel we’re victims. We’re not complaining that we’ve been overlooked for decades. We’re not whining or crying about anything. But we were told by a certain clique that we had to kowtow to them because failing to do so would be “a career-limiting move.” Now we are making sure that no one will ever have to kowtow to them, or cower before them, again.</li><li>I published science fiction books for years without ever campaigning for them, listing their eligibility, or pimping them for awards, despite having the public platforms of a nationally syndicated column and a popular blog. And I’m not inclined to listen to criticism from anyone who ever did. </li><li>The two Puppies campaigns have resulted in the highest average Amazon rating in the Best Novel category going back to 1986. In 2015, the average is 4.46 stars. The 2010-2014 pre-Puppy average is 3.9 stars. Sad Puppies is objectively improving the quality of the nominated works and expanding the overall nominee pool.</li></ol><p>UPDATE: Mr. Martin added this:</p><blockquote class=\"tr_bq\"><p> That business about one clique (those dreaded SJWs, I am sure) dominating the nominations for the last ten years strikes me as pure Puppy poop. Where’s the evidence of that?</p></blockquote><p>Someone needs to send him this quote from Charles “Three more Hugo nominations than Asimov or Heinlein” Stross at Making Light back in 2005:</p><blockquote class=\"tr_bq\"><p> For the purposes of assessing the impact<br> of your words, it doesn’t matter whether they’re supported by the<br> evidence or not — we’re talking <i>perceptions</i> here.</br></br></p><p>The people who live and work and pitch <i>their</i> tents in this<br> field have long memories. You’ll have to share the same field with them<br> for a long time — decades, maybe — if you want to be in it at all. And<br> you’ve just offended 75% of them? This is Not Clever.</br></br></br></p><p>You may not need them now, but you have no idea<br> what your circumstances will look like in ten years’ time. Twenty years.<br> Thirty. Five minutes hence. (Etcetera.) <i>Pissing people off for no good reason is counter-productive.</i> In a corporate environment it’s sometimes termed a career-limiting move. I think you just made a career-limiting move.</br></br></p></blockquote><p>Keep in mind this was in response to a nationally syndicated op/ed column I had written for Universal Press Syndicate. And I was supposed to be concerned that I had limited my career by offending the Nielsen Hayden clique <i>even though I didn’t know who they were</i>.</p><ol></ol></div>",
  "content_text": "He is to be commended for not following the SJW lead in attempting to deny the undeniable, which is to say\nthe long and easily verified history of organized Hugo campaigning\n:\nIn the ongoing discussion of Puppygate, numerous people have cited one instance, wherein a stack of identical nominating ballots arrived with the same postmark, paid for by consecutive money orders. Those were disallowed. In 1987, members of the Church of Scientology campaigned successfully to place L. Ron Hubbard’s BLACK GENESIS on the Best Novel ballot. That was not disallowed — the Scientologists had done nothing illegal, after all, all they’d done is buy supporting memberships to a convention that they had no intention of attending, for the sole purpose of nominating LRH for a Hugo (hmmm, why does that tactic sound familiar?) — but their campaign created a huge backlash. Hubbard’s name was booed lustily at the Hugo ceremony in Brighton, and his book finished last in the final balloting, behind No Award. (The winner that year was Orson Scott Card, with SPEAKER FOR THE DEAD, for those who are counting).\nOf course, there were also recommended reading lists. That wasn’t campaigning, not strictly, but certain lists could have huge influence on the final ballot. The annual LOCUS Recommended Reading List, compiled by Charles Brown and his staff and reviewers, was the most influential. If your book or story made that list… well, it did not guarantee you a place on the ballot, but it sure improved your chances. NESFA (the New England fan club) had an annual list as well, and LASFS might have done the same, not sure. And of course the Nebulas, which came before the Hugos, carried a lot of weight too. Win a Nebula, and the chances were good that you’d be a Hugo nominee as well. Again, no guarantee, some years the shortlists diverged sharply… but more often than not, there was a lot of overlap.\nSo there were always these factors in play. Cliques, I can hear the Sad Puppies saying. Yeah, maybe. Thing is, they were COMPETING cliques. The NESFA list and the Nebula list were not the same, and the LOCUS list… the LOCUS list was always very long. Five spots on the Hugo ballot, and LOCUS would recommend twenty books, or thirty… sometimes more, when they started putting SF and fantasy in separate categories.\nBottom line, lots of people influenced the Hugos (or tried to), but no one ever successfully controlled the Hugos.\nThat became even more true when we entered the age of the internet. Suddenly blogs and bulletin boards and listservs were everywhere, and there were DOZENS of people drawing up recommended reading lists and suggesting books and writers and stories. Sweet chaos. It was glorious. So many people talking about books, arguing about books, reading books.\nThat was also when the practice of writers blogging about their own eligible books and stories took root. “Say, the Hugo nominations are coming up, and I had a few things out last year. Hey, check them out.” Some people were deeply offended by this practice. (Some still are. Check out the blogs of Peter Watts and Adam Roberts on the subject, for instance). Others, especially newer writers and those hungry for attention, seized on it at once as a way of getting their name out there. Publishers and editors began to encourage it. Publicity and advertising budgets being what they were (non-existent in many cases), new writers and midlist writers soon realized that if they did not publicize their books, no one would.\nAnd once it really got rolling, there was no stopping it. “Everyone else is doing it,” you heard writers say. “I have to do it, in self-defense.” They were not wrong. Sometimes the difference between making the Hugo ballot and falling short is a single vote. The writer who refused to self-promote and then fell a few votes short… ouch.\n[And yes, I have done all this myself. Mentioned my own work, drawn up recommended reading lists, blogged passionately about people I thought deserved a nomination. I am not condemning the practice, just reporting on it. It always made me feel awkward, but like many of my friends, I knew that if I refrained and then missed the ballot by a few votes, I would be kicking myself. I’d sooner see the practice die out. But until it does, you have to play the game.]\nOf course, not everyone was equally good at self-promotion. Certain subfandoms were better organized than others (the DOCTOR WHO fans, for instance). Certain writers were more skilled at social media than others, and built up huge personal followings on Twitter and Facebook, or through their blogs… numbers that soon translated to multiple Hugo nominations.\nAnd that was pretty much where we stood, until the Sad Puppies came along…. The Sad Puppies did not invent Hugo campaigning, by any means. But they escalated it, just as that magazine/publisher partnership did way back when. They turned it up to eleven. Their slate was more effective that anyone could ever have dreamed, so effective that they drowned out pretty much all the other voices. They ran the best organized, most focused, and most effective awards campaign in the history of our genre, and showed everyone else how it’s done.\nIt’s fascinating to see SJWs like John Scalzi twittering that Sad Puppies are on the wrong side of Mr. Martin when he just cut the legs out from under most of the opposition’s arguments. Observe what Mr. Martin has admitted, contra the SJWs, and particularly the Making Light clique.\nWhisper campaigns and bloc votes are real and have existed for decades. I’ve talked to a number of old school authors and the story is the same in every case. People have bought multiple memberships for their families, for their extended families, and voted them as a bloc. Publishers used to send free copies of the books they were specifically pushing for Best Novel to all the convention voters. Authors agreed to trade votes with each other in an arrangement known as “logrolling”.\nWe did not invent Hugo campaigning. Neither did John Scalzi. But just as he created Award Pimpage and used his blog to get him a Fan Writer Hugo, then, in a tactic imitated by Jim Hines and Kameron Hurley, used it as a pivot for his successful Best Novel campaign. Now he has 9 Hugo nominations and 3 Hugo Awards, which means that he has more nominations than Jerry Pournelle and Arthur C. Clarke, and 3 more Hugo Awards than Ray Bradbury, A.E. van Vogt, Lester del Rey; Gregory Benford, Norman Spinrad, Terry Pratchett and Iain M. Banks combined. The difference is that Scalzi’s\nAward Pimpage campaigns\nbenefited only himself. Sad Puppies has helped bring attention to the work of a broad spectrum of hitherto unrecognized, but meritorious authors.\nTeresa Nielsen Hayden and everyone else who has claimed that there were no previous campaigns is lying.\nMr. Martin correctly decries the No Award tactic as the nuclear option, because “too many innocents would be hurt, and the Hugos would be destroyed”. He is correct. Those who are advocating it as a way to teach Sad Puppies a lesson are completely failing to understand the situation.\nThere are those who think No Award will send a message that this kind of campaigning is not wanted at the Hugos. Sure, it will send a very clear message to Sad Puppies. And that message will be: unleash the Rabid Puppies.\nWe don’t feel we’re victims. We’re not complaining that we’ve been overlooked for decades. We’re not whining or crying about anything. But we were told by a certain clique that we had to kowtow to them because failing to do so would be “a career-limiting move.” Now we are making sure that no one will ever have to kowtow to them, or cower before them, again.\nI published science fiction books for years without ever campaigning for them, listing their eligibility, or pimping them for awards, despite having the public platforms of a nationally syndicated column and a popular blog. And I’m not inclined to listen to criticism from anyone who ever did.\nThe two Puppies campaigns have resulted in the highest average Amazon rating in the Best Novel category going back to 1986. In 2015, the average is 4.46 stars. The 2010-2014 pre-Puppy average is 3.9 stars. Sad Puppies is objectively improving the quality of the nominated works and expanding the overall nominee pool.\nUPDATE: Mr. Martin added this:\nThat business about one clique (those dreaded SJWs, I am sure) dominating the nominations for the last ten years strikes me as pure Puppy poop. Where’s the evidence of that?\nSomeone needs to send him this quote from Charles “Three more Hugo nominations than Asimov or Heinlein” Stross at Making Light back in 2005:\nFor the purposes of assessing the impact\nof your words, it doesn’t matter whether they’re supported by the\nevidence or not — we’re talking\nperceptions\nhere.\nThe people who live and work and pitch\ntheir\ntents in this\nfield have long memories. You’ll have to share the same field with them\nfor a long time — decades, maybe — if you want to be in it at all. And\nyou’ve just offended 75% of them? This is Not Clever.\nYou may not need them now, but you have no idea\nwhat your circumstances will look like in ten years’ time. Twenty years.\nThirty. Five minutes hence. (Etcetera.)\nPissing people off for no good reason is counter-productive.\nIn a corporate environment it’s sometimes termed a career-limiting move. I think you just made a career-limiting move.\nKeep in mind this was in response to a nationally syndicated op/ed column I had written for Universal Press Syndicate. And I was supposed to be concerned that I had limited my career by offending the Nielsen Hayden clique\neven though I didn’t know who they were\n.",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-09T12:43:00+00:00"
}