{
  "url": "https://voxday.net/2015/04/12/george-martin-baits-hook/",
  "scraped_at": "2025-12-16T12:51:57.282008",
  "title": "George Martin baits the hook",
  "date_display": "April 12, 2015",
  "date_iso": "2015-04-12T00:33:00+00:00",
  "date_from_url": "2015-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Anyone who read <i>A Dance with Dragons</i> is aware that George R.R. Martin has lost it. Hell, I wrote <i>A Throne of Bones</i> partly because, after finishing that tedious, pointless slog of a poorly edited doorstopper, my first thought was, “I’m no great writer, but dammit, even I can do better than that shit.”</p><p>It seems a few people agreed, as <a href=\"http://www.amazon.com/Throne-Bones-Arts-Dark-Light-ebook/dp/B00I6H0J7S/\">ATOB </a>has a higher rating on Amazon than <a href=\"http://www.amazon.com/Dance-Dragons-Song-Ice-Fire/dp/0553582011\">ADWD</a>, 4.2 to 3.9.</p><p>Anyhow, it’s probably a mercy that instead of further mutilating his literary legacy, he’s decided to spend the last few days waxing ignorant with regards to #GamerGate, Sad Puppies, Rabid Puppies, and the Hugo Awards. I was particularly amused by <a href=\"http://grrm.livejournal.com/419232.html\">his belated Appeal to Divide and Conquer</a>.</p><blockquote class=\"tr_bq\"><p> I do believe that there are decent, honest, well-intentioned conservatives in our field, many of whom are deeply involved in the Sad Puppies movement. Brad Torgensen and Larry Correia among them; my disagreements with them so far have been on the issues, but I don’t believe that they are racists, sexists, misogynists, bigots, or haters. But I do have a question for you:</p><p>When are you going to do something about Vox Day?</p><p>Make no mistake. Vox Day and Requires Hate are twins. Mirror images of one another. The Toad of the West, the Toad of East, each of them spewing forth the venom of hatred and violence, poisoning any attempt at honest dialogue. Requires Hate had her acolytes and enablers, and so does Vox Day, and it is from those toads that they derive their power.</p><p>Liberals and moderates and “SJWs” can denounce Day all they want, and it only serves to generate more hate, more division, more death threats. His followers will just shrug that off. But if some respected figure from the right were to speak up, well, maybe someone would listen. But do we have a conservative in the house with the courage and integrity of Laura Mixon, someone honest enough and brave enough to denounce the excesses of their “own side?”</p></blockquote><p>First of all, the only Toad in science fiction is The Toad of (formerly) Tor, Teresa Nielsen Hayden. Second, neither the Ilk nor the Dread Ilk are toads. They are intelligent individuals who are entirely capable of thinking for themselves, and unlike the foolish Mr. Martin, they’re not stupid and gullible enough to swallow every false narrative put forth by SJWs in the media. Nor do they deserve to be insulted by a fat old fool who can’t be bothered to learn any of the salient facts before deciding to pontificate on the subject.</p><p>And third, it is amusing that Mr. Martin seems to seriously believe this is the first time any of us have seen this sort of Two-Minute-Hate Bait before. “Why, Mr. Decent, Honest, Well-Intentioned Conservative, if only you will join us in our ritual denouncing of today’s Emanuel Goldstein, we will be nice to you and pretend to respect you… for as long as we need you.”</p><p>Just how dumb does he think everyone on the right side of the political spectrum is anyhow?</p><p>Every member of the Evil Legion of Evil has been offered this deal if only they will abjure their Supreme Dark Lord, most of them multiple times. Every single one of them has spurned it, whether they agree with me about anything or not, because they all know exactly how forked the tongue is that speaks such deceitful promises.</p><p>Hell, I was offered the same deal myself if only I would disavow Roosh of Return of Kings and Reaxxion. To which my answer was simple and straightforward: “No, absolutely not.” This isn’t even the first time an SJW has broached the idea publicly:</p><ul><li> “There’s only one way to deal with people like Day, who see themselves as above basic human decency, and that is to cut them out of the community like a tumour. Shun them, ignore them, no-platform the hell out of them. Our conventions, our fanzines, our anthologies, our community is not open to people whose racist arguments could have come straight from the mouths of slave-owners.” (April 19, 2014)</li><li> “How do you bring the weight of community disapproval on someone who isn’t part of the community?” (March 30, 2015)</li></ul><p>Give a man a platform and he will speak his mind. Deny him a platform and he will build his own… and you will never silence him again. Rabbits always think that the only possible response to being shunned is to a) submit or b) vanish. The problem, of course, is that some of us aren’t rabbits.</p><p>And that’s why the SJWs are desperately appealing to Entertainment Weekly and George RR Martin and The Guardian and anyone and anything else that will swallow their false narrative. They are terrified because they know we are in the process of building a platform and that will mean they no longer have any influence or control over us. Over <i>any </i>of us.</p><p>As for Mr. Martin, it’s observably two books past time for him to hang it up and hand over <i>A Song of Ice and Fire</i> to Brandon Sanderson or Joe Abercrombie. Although my personal vote would be for R. Scott Bakker, just because it would be hilarious to see a horde of shape-shifting, black-seed spewing rape demons unleashed on Westeros without warning. What’s the point of featuring pointless nihilism if you don’t embrace it to the full?</p></div>",
  "content_text": "Anyone who read\nA Dance with Dragons\nis aware that George R.R. Martin has lost it. Hell, I wrote\nA Throne of Bones\npartly because, after finishing that tedious, pointless slog of a poorly edited doorstopper, my first thought was, “I’m no great writer, but dammit, even I can do better than that shit.”\nIt seems a few people agreed, as\nATOB\nhas a higher rating on Amazon than\nADWD\n, 4.2 to 3.9.\nAnyhow, it’s probably a mercy that instead of further mutilating his literary legacy, he’s decided to spend the last few days waxing ignorant with regards to #GamerGate, Sad Puppies, Rabid Puppies, and the Hugo Awards. I was particularly amused by\nhis belated Appeal to Divide and Conquer\n.\nI do believe that there are decent, honest, well-intentioned conservatives in our field, many of whom are deeply involved in the Sad Puppies movement. Brad Torgensen and Larry Correia among them; my disagreements with them so far have been on the issues, but I don’t believe that they are racists, sexists, misogynists, bigots, or haters. But I do have a question for you:\nWhen are you going to do something about Vox Day?\nMake no mistake. Vox Day and Requires Hate are twins. Mirror images of one another. The Toad of the West, the Toad of East, each of them spewing forth the venom of hatred and violence, poisoning any attempt at honest dialogue. Requires Hate had her acolytes and enablers, and so does Vox Day, and it is from those toads that they derive their power.\nLiberals and moderates and “SJWs” can denounce Day all they want, and it only serves to generate more hate, more division, more death threats. His followers will just shrug that off. But if some respected figure from the right were to speak up, well, maybe someone would listen. But do we have a conservative in the house with the courage and integrity of Laura Mixon, someone honest enough and brave enough to denounce the excesses of their “own side?”\nFirst of all, the only Toad in science fiction is The Toad of (formerly) Tor, Teresa Nielsen Hayden. Second, neither the Ilk nor the Dread Ilk are toads. They are intelligent individuals who are entirely capable of thinking for themselves, and unlike the foolish Mr. Martin, they’re not stupid and gullible enough to swallow every false narrative put forth by SJWs in the media. Nor do they deserve to be insulted by a fat old fool who can’t be bothered to learn any of the salient facts before deciding to pontificate on the subject.\nAnd third, it is amusing that Mr. Martin seems to seriously believe this is the first time any of us have seen this sort of Two-Minute-Hate Bait before. “Why, Mr. Decent, Honest, Well-Intentioned Conservative, if only you will join us in our ritual denouncing of today’s Emanuel Goldstein, we will be nice to you and pretend to respect you… for as long as we need you.”\nJust how dumb does he think everyone on the right side of the political spectrum is anyhow?\nEvery member of the Evil Legion of Evil has been offered this deal if only they will abjure their Supreme Dark Lord, most of them multiple times. Every single one of them has spurned it, whether they agree with me about anything or not, because they all know exactly how forked the tongue is that speaks such deceitful promises.\nHell, I was offered the same deal myself if only I would disavow Roosh of Return of Kings and Reaxxion. To which my answer was simple and straightforward: “No, absolutely not.” This isn’t even the first time an SJW has broached the idea publicly:\n“There’s only one way to deal with people like Day, who see themselves as above basic human decency, and that is to cut them out of the community like a tumour. Shun them, ignore them, no-platform the hell out of them. Our conventions, our fanzines, our anthologies, our community is not open to people whose racist arguments could have come straight from the mouths of slave-owners.” (April 19, 2014)\n“How do you bring the weight of community disapproval on someone who isn’t part of the community?” (March 30, 2015)\nGive a man a platform and he will speak his mind. Deny him a platform and he will build his own… and you will never silence him again. Rabbits always think that the only possible response to being shunned is to a) submit or b) vanish. The problem, of course, is that some of us aren’t rabbits.\nAnd that’s why the SJWs are desperately appealing to Entertainment Weekly and George RR Martin and The Guardian and anyone and anything else that will swallow their false narrative. They are terrified because they know we are in the process of building a platform and that will mean they no longer have any influence or control over us. Over\nany\nof us.\nAs for Mr. Martin, it’s observably two books past time for him to hang it up and hand over\nA Song of Ice and Fire\nto Brandon Sanderson or Joe Abercrombie. Although my personal vote would be for R. Scott Bakker, just because it would be hilarious to see a horde of shape-shifting, black-seed spewing rape demons unleashed on Westeros without warning. What’s the point of featuring pointless nihilism if you don’t embrace it to the full?",
  "tags": [
    "rabbitology",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-11T23:33:00+00:00"
}