{
  "url": "https://voxday.net/2015/04/03/how-do-they-know/",
  "scraped_at": "2025-12-16T12:50:50.390298",
  "title": "How do they know?",
  "date_display": "April 3, 2015",
  "date_iso": "2015-04-03T11:21:00+00:00",
  "date_from_url": "2015-04-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ptbarnium points out that the SJWs in science fiction <a href=\"https://bradrtorgersen.wordpress.com/2015/04/02/please-dont-chorf-it/#comment-8484\">are demonstrating one of the reasons</a> Sad Puppies 3 is so badly needed:</p><blockquote class=\"tr_bq\"><p> Every single second of the controversy so far has taken place before the ballot has been announced. It might sound plain but it seems that they have all missed it. Everytime TNH wrings her aquatic hands pathetically, every time Jason Sanford stamps his feet childishly, every time Cora Buhlhert blares her senseless foghorn, the undecided ask one question: <i>“How do you know?”</i></p><p>They have done more damage to their own cause than SP3 ever could simply because of their inability to restrain their wounded egos &amp; frustrated self entitlement for four days. No matter how this all shakes out, no matter who wins, the cat is out of the bag now. To the CHORFs, wrapped in their delusions, they have done nothing wrong.</p><p>To anyone neutral, anyone without a dog in the fight, they have proven beyond all of our expectations that the motive force driving Sad Puppies is true. Anyone who asks the question “How do they know?” will see the immediate and obvious conclusion that eludes these morons, insulated by their self-righteous anger.</p><p>They know because many of the people who ‘should’ have been given the nod haven’t. Is there any other convincing reason why people un-nominated for any award seem to know the entire final slate? You could excuse knowing one or two finalists in a given category but the entire list? The only ways to have their level or knowledge at this stage are (a) Worldcon leaking or (b) interval communication based on information from the people on their own slates that were ‘supposed’ to get through. I know which one my money is on.</p></blockquote><p>This is exactly right. The usual suspects, who revolve in orbit around Tor Books in general and Tor senior editor Patrick Nielsen Hayden in particular, are accustomed to quietly arranging things to their liking behind the scene. They talk to one another on a regular basis and arrange things like this outcome in 2008.</p><p>43 Best Fan Writer John Scalzi <br> 41 Best Novel The Last Colony John Scalzi <br> 40 Best Novel Halting State Charles Stross</br></br></p><p>That’s quite the coincidence, considering that Larry, Brad, and I were accused of bloc voting in 2014 with the following outcome.</p><p>184 Best Novel Warbound Larry Correia<br> 111 Best Novella The Chaplain’s Legacy Brad Torgersen<br> 092 Best Novelette The Exchange Officers Brad Torgersen<br> 069 Best Novelette Opera Vita Aeterna Vox Day</br></br></br></p><p>What looks more like a bloc vote to you? Oh, and speaking of 2014, let’s not forget this:</p><p>120 Best Novel Neptune’s Brood Charles Stross<br> 127 Best Novella Equoid Charles Stross<br> 118 Best Novelette Lady Astronaut of Mars Mary Kowal</br></br></p><p>Again, what looks more like a bloc vote to you? Are we seriously supposed to believe that a 115-vote variance is an invalid bloc vote, but 9-vote and 3-vote variances that are limited to <a href=\"http://nielsenhayden.com/makinglight/archives/016177.html#4047197\">SJW authors published by Tor</a> are just a pair of freakish coincidences involving the same group of closely connected authors six years apart?</p><blockquote class=\"tr_bq\"><p> Regarding Best Novel: I’ve heard that three of the five finalists are SP-endorsed. (Which, see above, doesn’t in itself guarantee that any of them are unworthy of a Hugo.) I don’t know what any of those three books are. I do know the identity of the other two, and I don’t think anyone in this conversation will regard them as unworthy candidates. (Disclaimer: Neither of them are books Teresa or I worked on in any way.) – Patrick Nielsen Hayden, Senior Editor, Tor Books</p></blockquote><p>Since we’re speaking of PNH, how about 2009, 2010, and 2012?</p><p>76 Best Novel Saturn’s Children Charles Stross<br> 74 Best Editor Patrick Nielsen Hayden<br> 54 Best Novel Zoe’s Tale John Scalzi (Even some in on the game couldn’t bring themselves to vote for that steaming little pile, but it still got enough votes to make the shortlist and keep the next two authors off: Iain M. Banks and Terry Pratchett.)</br></br></p><p>79 Best Novella The God Engines John Scalzi (indicates outside support)<br> 56 Best Novella Palimpsest Charles Stross <br> 52 Best Short Story Overtime Charles Stross<br> 54 Best Editor Patrick Nielsen Hayden</br></br></br></p><p>49 Best Novel The Wise Man’s Fear by Patrick Rothfuss<br> 48 Best Novel Fuzzy Nation by John Scalzi <br> 44 Best Editor Patrick Nielsen Hayden<br>   <br> Three more amazing coincidences! How do they know? <i>How do they know?</i> Furthermore, Kevin Standlee, a Secret Master of Fandom and Worldcon insider, acknowledged at File 770 that these quiet little campaigns <a href=\"http://file770.com/?p=21617&amp;cpage=3#comment-249412\">are known to have taken place</a> in the past.</br></br></br></br></p><blockquote class=\"tr_bq\"><p> There clearly have been campaigns to get individual works on the ballot, some of them going beyond the technically legal.<br> – Kevin Standlee on April 2, 2015 at 9:41 am</br></p></blockquote><p>He also added that nothing Sad Puppies has done is <a href=\"http://file770.com/?p=21617&amp;cpage=3#comment-249413\">illegal or against the rules</a>:</p><blockquote class=\"tr_bq\"><p> I agree with Vox that what’s been done (at least from the rumors<br> rumbling around) isn’t illegal. It’s not against the rules. It’s simply<br> exploiting a heretofore never-considered loophole in the rules that has<br> never come into play because fans are traditionally not very well<br> organized. <br> -Kevin Standlee on April 2, 2015 at 9:44 am</br></br></br></br></br></p></blockquote><p>The SJWs are upset because we play openly by the rules better than they cheat behind closed doors. And the mere fact that they are so upset BEFORE THE NOMINATIONS ARE ANNOUNCED is sufficient to prove that they coordinated their whisper campaigns in the past and they are still coordinating them now. And the fact that so few people in latter-day science fiction can’t see the obvious shows <a href=\"http://nielsenhayden.com/makinglight/archives/016191.html#4067790\">how crabbed and limited their imaginations are</a>:</p><blockquote class=\"tr_bq\"><p> SF fans have been historically so independent-minded and disorganized that the idea of actually filling a slate to try and deliberately stifle anything other than a particular group of five works in each category hadn’t really occurred to anyone I know of, and I’ve been following this since 1984. Sure, there have been deliberate campaigns (of varying degrees of ethical) to get individual works onto the ballot, but to try and monopolize all 85 spaces? Nah. Indeed, the idea would probably been laughable until fairly recently. You can’t generally get five fans to agree on where to go to dinner, let alone get 500 of them to agree on exactly the same slate of Hugo Award nominees.</p></blockquote><p>This juxstaposition, however, is my favorite proof that the other side is utterly incapable of thinking past the end of their noses.</p><ol><li>“There’s only one way to deal with people like Day, who see<br> themselves as above basic human decency, and that is to cut them out of<br> the community like a tumour. Shun them, ignore them, no-platform the<br> hell out of them. Our conventions, our fanzines, our anthologies, our<br> community is not open to people whose racist arguments could have come<br> straight from the mouths of slave-owners.” (<a href=\"http://bibliodaze.com/2014/04/vox-day-and-the-hugos-why-we-should-just-say-no/\">April 19, 2014</a>)</br></br></br></br></br></li><li>“How do you bring the weight of community disapproval on someone who isn’t part of the community?” (<a href=\"http://nielsenhayden.com/makinglight/archives/016177.html#4058660\">March 30, 2015</a>)</li></ol><p>Well, who could possibly have seen THAT coming? Give a man a platform and he will speak his mind. Deny him a platform and he will build his own… and you will never silence him again. Rabbits always think that the only possible response to being shunned is to a) submit or b) vanish. The problem, of course, is that some of us aren’t rabbits.</p><p>Now a number of them are credibly threatening to No Award everything even before the announcements have been announced. And I’m wondering, do they really think we didn’t anticipate that too? Considering that they repeatedly assert that Brad Torgersen is lying about the purpose of Sad Puppies, hasn’t it ever occurred to them that perhaps the purpose he is concealing is different than the one they assume it must be?</p><p>It is a proper conundrum.</p></div>",
  "content_text": "Ptbarnium points out that the SJWs in science fiction\nare demonstrating one of the reasons\nSad Puppies 3 is so badly needed:\nEvery single second of the controversy so far has taken place before the ballot has been announced. It might sound plain but it seems that they have all missed it. Everytime TNH wrings her aquatic hands pathetically, every time Jason Sanford stamps his feet childishly, every time Cora Buhlhert blares her senseless foghorn, the undecided ask one question:\n“How do you know?”\nThey have done more damage to their own cause than SP3 ever could simply because of their inability to restrain their wounded egos & frustrated self entitlement for four days. No matter how this all shakes out, no matter who wins, the cat is out of the bag now. To the CHORFs, wrapped in their delusions, they have done nothing wrong.\nTo anyone neutral, anyone without a dog in the fight, they have proven beyond all of our expectations that the motive force driving Sad Puppies is true. Anyone who asks the question “How do they know?” will see the immediate and obvious conclusion that eludes these morons, insulated by their self-righteous anger.\nThey know because many of the people who ‘should’ have been given the nod haven’t. Is there any other convincing reason why people un-nominated for any award seem to know the entire final slate? You could excuse knowing one or two finalists in a given category but the entire list? The only ways to have their level or knowledge at this stage are (a) Worldcon leaking or (b) interval communication based on information from the people on their own slates that were ‘supposed’ to get through. I know which one my money is on.\nThis is exactly right. The usual suspects, who revolve in orbit around Tor Books in general and Tor senior editor Patrick Nielsen Hayden in particular, are accustomed to quietly arranging things to their liking behind the scene. They talk to one another on a regular basis and arrange things like this outcome in 2008.\n43 Best Fan Writer John Scalzi\n41 Best Novel The Last Colony John Scalzi\n40 Best Novel Halting State Charles Stross\nThat’s quite the coincidence, considering that Larry, Brad, and I were accused of bloc voting in 2014 with the following outcome.\n184 Best Novel Warbound Larry Correia\n111 Best Novella The Chaplain’s Legacy Brad Torgersen\n092 Best Novelette The Exchange Officers Brad Torgersen\n069 Best Novelette Opera Vita Aeterna Vox Day\nWhat looks more like a bloc vote to you? Oh, and speaking of 2014, let’s not forget this:\n120 Best Novel Neptune’s Brood Charles Stross\n127 Best Novella Equoid Charles Stross\n118 Best Novelette Lady Astronaut of Mars Mary Kowal\nAgain, what looks more like a bloc vote to you? Are we seriously supposed to believe that a 115-vote variance is an invalid bloc vote, but 9-vote and 3-vote variances that are limited to\nSJW authors published by Tor\nare just a pair of freakish coincidences involving the same group of closely connected authors six years apart?\nRegarding Best Novel: I’ve heard that three of the five finalists are SP-endorsed. (Which, see above, doesn’t in itself guarantee that any of them are unworthy of a Hugo.) I don’t know what any of those three books are. I do know the identity of the other two, and I don’t think anyone in this conversation will regard them as unworthy candidates. (Disclaimer: Neither of them are books Teresa or I worked on in any way.) – Patrick Nielsen Hayden, Senior Editor, Tor Books\nSince we’re speaking of PNH, how about 2009, 2010, and 2012?\n76 Best Novel Saturn’s Children Charles Stross\n74 Best Editor Patrick Nielsen Hayden\n54 Best Novel Zoe’s Tale John Scalzi (Even some in on the game couldn’t bring themselves to vote for that steaming little pile, but it still got enough votes to make the shortlist and keep the next two authors off: Iain M. Banks and Terry Pratchett.)\n79 Best Novella The God Engines John Scalzi (indicates outside support)\n56 Best Novella Palimpsest Charles Stross\n52 Best Short Story Overtime Charles Stross\n54 Best Editor Patrick Nielsen Hayden\n49 Best Novel The Wise Man’s Fear by Patrick Rothfuss\n48 Best Novel Fuzzy Nation by John Scalzi\n44 Best Editor Patrick Nielsen Hayden\nThree more amazing coincidences! How do they know?\nHow do they know?\nFurthermore, Kevin Standlee, a Secret Master of Fandom and Worldcon insider, acknowledged at File 770 that these quiet little campaigns\nare known to have taken place\nin the past.\nThere clearly have been campaigns to get individual works on the ballot, some of them going beyond the technically legal.\n– Kevin Standlee on April 2, 2015 at 9:41 am\nHe also added that nothing Sad Puppies has done is\nillegal or against the rules\n:\nI agree with Vox that what’s been done (at least from the rumors\nrumbling around) isn’t illegal. It’s not against the rules. It’s simply\nexploiting a heretofore never-considered loophole in the rules that has\nnever come into play because fans are traditionally not very well\norganized.\n-Kevin Standlee on April 2, 2015 at 9:44 am\nThe SJWs are upset because we play openly by the rules better than they cheat behind closed doors. And the mere fact that they are so upset BEFORE THE NOMINATIONS ARE ANNOUNCED is sufficient to prove that they coordinated their whisper campaigns in the past and they are still coordinating them now. And the fact that so few people in latter-day science fiction can’t see the obvious shows\nhow crabbed and limited their imaginations are\n:\nSF fans have been historically so independent-minded and disorganized that the idea of actually filling a slate to try and deliberately stifle anything other than a particular group of five works in each category hadn’t really occurred to anyone I know of, and I’ve been following this since 1984. Sure, there have been deliberate campaigns (of varying degrees of ethical) to get individual works onto the ballot, but to try and monopolize all 85 spaces? Nah. Indeed, the idea would probably been laughable until fairly recently. You can’t generally get five fans to agree on where to go to dinner, let alone get 500 of them to agree on exactly the same slate of Hugo Award nominees.\nThis juxstaposition, however, is my favorite proof that the other side is utterly incapable of thinking past the end of their noses.\n“There’s only one way to deal with people like Day, who see\nthemselves as above basic human decency, and that is to cut them out of\nthe community like a tumour. Shun them, ignore them, no-platform the\nhell out of them. Our conventions, our fanzines, our anthologies, our\ncommunity is not open to people whose racist arguments could have come\nstraight from the mouths of slave-owners.” (\nApril 19, 2014\n)\n“How do you bring the weight of community disapproval on someone who isn’t part of the community?” (\nMarch 30, 2015\n)\nWell, who could possibly have seen THAT coming? Give a man a platform and he will speak his mind. Deny him a platform and he will build his own… and you will never silence him again. Rabbits always think that the only possible response to being shunned is to a) submit or b) vanish. The problem, of course, is that some of us aren’t rabbits.\nNow a number of them are credibly threatening to No Award everything even before the announcements have been announced. And I’m wondering, do they really think we didn’t anticipate that too? Considering that they repeatedly assert that Brad Torgersen is lying about the purpose of Sad Puppies, hasn’t it ever occurred to them that perhaps the purpose he is concealing is different than the one they assume it must be?\nIt is a proper conundrum.",
  "tags": [
    "Hugo Award",
    "rabbitology",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-03T10:21:00+00:00"
}