{
  "url": "https://voxday.net/2015/04/14/john-c-wright-work-disqualified/",
  "scraped_at": "2025-12-16T12:52:13.884737",
  "title": "John C. Wright work disqualified",
  "date_display": "April 14, 2015",
  "date_iso": "2015-04-14T09:43:00+00:00",
  "date_from_url": "2015-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Hugo Awards news <a href=\"http://file770.com/?p=21886\">from Mike Glyer at File 770</a>:</p><blockquote class=\"tr_bq\"><p> Sasquan, the 2015 Worldcon, has made changes to the final Hugo ballot to reflect  eligibility rulings by Hugo administrator John Lorentz.</p><ul><li>    “Yes, Virginia, There is a Santa Claus” by John C. Wright was previously published on a web site in 2013 prior to its inclusion in The Book of Feasts &amp; Seasons in 2014, so it is not eligible for the 2015 Novelette Hugo.</li><li>    Jon Eno did not publish any qualifying artwork in 2014, so he is not eligible for the 2015 Professional Artist Hugo</li></ul><p>Replacing Wright’s novelette on the ballot is “The Day The World Turned Upside Down” by Thomas Olde Heuvelt (Lightspeed Magazine, April 2014). Kirk DouPonce has been elevated to take Eno’s place in the Best Professional Artist category.</p></blockquote><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2015/04/Wright_960.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/04/Wright_960.jpg\" width=\"200\"/></a></div><p>I think this is a serious mistake by Sasquan. Just as <i>Dune </i>and <i>Ender’s Game</i> served as precedents for a shorter work reworked and published as a longer one, which was the case with both “One Bright Star to Guide Them” and “Big Boys Don’t Cry”, John Scalzi’s <i>Old Man’s War</i> serves as precedent for a work that appeared on the web prior to being professionally published and subsequently declared eligible in the latter year.</p><p>The comparison is particularly damning because John Scalzi specifically declared <i>Old Man’s War</i> to have been self-published in 2002, three years prior to it being published by Tor in 2005 and being nominated as Best Novel in 2006. John C. Wright is a professional author who does not self-publish and he never claimed to have published “Yes, Virginia, There is a Santa Claus”, he merely posted a work in progress on his site and removed it after Castalia House signed a contract with him to publish it. This action by Sasquan not only makes it appear as if there is one rule for SJWs who are Torlings and another for everyone else, but will serve as a chilling precedent to other writers to avoid publicly posting any unpublished and incomplete work they believe might be award-worthy in the future.</p><p>While neither I nor Castalia House intend to protest Sasquan’s decision and we recognize their right to ignore the precedents established by previous Worldcons, I do not think the decision was a wise one, especially at a time when tempers are running unusually high. Both Sad Puppies and Rabid Puppies exist because some members of the science fiction community were being treated as more equal than others, and the fact that John Scalzi and Tor Books are AGAIN the incongruous beneficiary of this sort of quietly preferential treatment is further evidence of the influential cliques and whispering campaigns that George Martin and other SJWs have disingenuously denied.</p><p>That being said, I have duly removed “Yes, Virginia, There is a Santa Claus” from the collection we are preparing for the Hugo Packet. And I trust that the various complaints about John C. Wright receiving six nominations can now stop, given that he now has no more nominations than Seanan McGuire received last year.</p><p>Meanwhile, another rabbit is up to the usual game. One <a href=\"https://www.amazon.com/gp/pdp/profile/ATEN0WSWXA82M/ref=cm_cr_pr_pdp?ie=UTF8\">Martha L. Thomases of New York, NY</a>,  who “never knowingly slept with a Republican”, has posted a fake review of RIDING THE RED HORSE:</p><blockquote class=\"tr_bq\"><p> <a href=\"http://www.amazon.com/review/R3OL4UJW3HNBQ/ref=cm_cr_rdp_perm\">What a piece of tripe. Exactly the kind of …</a><br> By Martha L. Thomases “Martha Thomases”on April 13, 2015</br></p><p>What a piece of tripe. Exactly the kind of fiction that appeals to men who are insecure in their masculinity. My only regret is that one can’t rate this book any less than one star.</p></blockquote><p>I’ve reported it for abuse and inappropriate content as a fake review from someone who is not a verified purchase and has not read the book, and I encourage you to do the same. Please be aware, prospective fake reviewers, if you lie about us, we will not hesitate to tell the truth about you.</p><p>I am also encouraging Amazon to consider cancelling the accounts of reviewers who post fake reviews. Retroactively. It’s an area they are looking into because their review system is very important to them, so keep that in mind when you are tempted to post a fake review. Note that Ms Thomases appears to be responding to <a href=\"https://archive.today/UCk4j\">this call by Glenn Hauman</a> to post fake reviews of Sad Puppies and Rabid Puppies works and thereby lower their average ratings.</p><blockquote class=\"tr_bq\"><p> Oh, and to answer the title question: what do you do to rabid puppies? You put them down.</p></blockquote><p>I would point out that recommending a specific number of nominations for<br> the Hugo ballot is within the rules. Posting fake reviews of books you<br> have neither purchased nor read is absolutely not. I have repeatedly told people <a href=\"http://www.milobookclub.com/2013/08/15/of-pharyngulans-and-fake-reviews/\">never to post any fake review for any reason</a>. But if the SJWs truly want to play this game, we can certainly arrange to bring a hydrogen bomb to the knife fight.</br></br></p><p><i>As for retaliation against PZ’s book, my position is the same as it was<br> when McRapey’s rabbits were posting fake reviews on Amazon. First, PZ<br> didn’t take any such action himself or advocate it. Second, he is not<br> responsible for the actions of his readers. Third, one’s integrity<br> should not permit one to write a false review of a book, no matter how<br> much one despises the author. Fourth, I am actively opposed to all fake<br> reviews, be they pro or con.  I do not want anyone who considers<br> himself a reader, a fan, a regular, or Dread Ilk to write fake reviews<br> of anything. Why? <b>Because lying about what you have not read is wrong.</b>  </br></br></br></br></br></br></br></br></i></p><p>UPDATE: Glen Hauman is dumber than I thought. He’s actually an author himself, <a href=\"http://www.amazon.com/Glenn-Hauman/e/B004FRK8MO\">complete with an Amazon page</a>. Now, I do NOT recommend downgrading his books, but I absolute recommend bringing his call to violate the Amazon reviews system to Amazon’s attention. And I call upon Hauman to recant and remove his idiotic call to put down the works written by the various Sad Puppies nominees.</p><p>UPDATE 2: Hauman must be a Making Light acolyte, given his penchant for disemvoweling. Here is what the disemvoweled comment on his site says:</p><blockquote class=\"tr_bq\"><p> *shakes head slowly* You guys really are a special brand of stupid, aren’t you? Do you enjoy poking bears with sticks as well? His audience dwarfs yours and he’s not above using the same tactics as you (as you so helpfully pointed out). So you go ahead and suggest An Approach that can only possibly win if your audience is larger than his. What exactly do you hope to accomplish? BTW, talking about the Hugo Awards without actually talking about the Hugo Awards is dishonest. Why not use an honest title, like “Vox is a horrible person. Here’s how to beat him at his own game.” I only suggest that title because you’ve shown you don’t care about committing libel.</p></blockquote></div>",
  "content_text": "Hugo Awards news\nfrom Mike Glyer at File 770\n:\nSasquan, the 2015 Worldcon, has made changes to the final Hugo ballot to reflect  eligibility rulings by Hugo administrator John Lorentz.\n“Yes, Virginia, There is a Santa Claus” by John C. Wright was previously published on a web site in 2013 prior to its inclusion in The Book of Feasts & Seasons in 2014, so it is not eligible for the 2015 Novelette Hugo.\nJon Eno did not publish any qualifying artwork in 2014, so he is not eligible for the 2015 Professional Artist Hugo\nReplacing Wright’s novelette on the ballot is “The Day The World Turned Upside Down” by Thomas Olde Heuvelt (Lightspeed Magazine, April 2014). Kirk DouPonce has been elevated to take Eno’s place in the Best Professional Artist category.\nI think this is a serious mistake by Sasquan. Just as\nDune\nand\nEnder’s Game\nserved as precedents for a shorter work reworked and published as a longer one, which was the case with both “One Bright Star to Guide Them” and “Big Boys Don’t Cry”, John Scalzi’s\nOld Man’s War\nserves as precedent for a work that appeared on the web prior to being professionally published and subsequently declared eligible in the latter year.\nThe comparison is particularly damning because John Scalzi specifically declared\nOld Man’s War\nto have been self-published in 2002, three years prior to it being published by Tor in 2005 and being nominated as Best Novel in 2006. John C. Wright is a professional author who does not self-publish and he never claimed to have published “Yes, Virginia, There is a Santa Claus”, he merely posted a work in progress on his site and removed it after Castalia House signed a contract with him to publish it. This action by Sasquan not only makes it appear as if there is one rule for SJWs who are Torlings and another for everyone else, but will serve as a chilling precedent to other writers to avoid publicly posting any unpublished and incomplete work they believe might be award-worthy in the future.\nWhile neither I nor Castalia House intend to protest Sasquan’s decision and we recognize their right to ignore the precedents established by previous Worldcons, I do not think the decision was a wise one, especially at a time when tempers are running unusually high. Both Sad Puppies and Rabid Puppies exist because some members of the science fiction community were being treated as more equal than others, and the fact that John Scalzi and Tor Books are AGAIN the incongruous beneficiary of this sort of quietly preferential treatment is further evidence of the influential cliques and whispering campaigns that George Martin and other SJWs have disingenuously denied.\nThat being said, I have duly removed “Yes, Virginia, There is a Santa Claus” from the collection we are preparing for the Hugo Packet. And I trust that the various complaints about John C. Wright receiving six nominations can now stop, given that he now has no more nominations than Seanan McGuire received last year.\nMeanwhile, another rabbit is up to the usual game. One\nMartha L. Thomases of New York, NY\n,  who “never knowingly slept with a Republican”, has posted a fake review of RIDING THE RED HORSE:\nWhat a piece of tripe. Exactly the kind of …\nBy Martha L. Thomases “Martha Thomases”on April 13, 2015\nWhat a piece of tripe. Exactly the kind of fiction that appeals to men who are insecure in their masculinity. My only regret is that one can’t rate this book any less than one star.\nI’ve reported it for abuse and inappropriate content as a fake review from someone who is not a verified purchase and has not read the book, and I encourage you to do the same. Please be aware, prospective fake reviewers, if you lie about us, we will not hesitate to tell the truth about you.\nI am also encouraging Amazon to consider cancelling the accounts of reviewers who post fake reviews. Retroactively. It’s an area they are looking into because their review system is very important to them, so keep that in mind when you are tempted to post a fake review. Note that Ms Thomases appears to be responding to\nthis call by Glenn Hauman\nto post fake reviews of Sad Puppies and Rabid Puppies works and thereby lower their average ratings.\nOh, and to answer the title question: what do you do to rabid puppies? You put them down.\nI would point out that recommending a specific number of nominations for\nthe Hugo ballot is within the rules. Posting fake reviews of books you\nhave neither purchased nor read is absolutely not. I have repeatedly told people\nnever to post any fake review for any reason\n. But if the SJWs truly want to play this game, we can certainly arrange to bring a hydrogen bomb to the knife fight.\nAs for retaliation against PZ’s book, my position is the same as it was\nwhen McRapey’s rabbits were posting fake reviews on Amazon. First, PZ\ndidn’t take any such action himself or advocate it. Second, he is not\nresponsible for the actions of his readers. Third, one’s integrity\nshould not permit one to write a false review of a book, no matter how\nmuch one despises the author. Fourth, I am actively opposed to all fake\nreviews, be they pro or con.  I do not want anyone who considers\nhimself a reader, a fan, a regular, or Dread Ilk to write fake reviews\nof anything. Why?\nBecause lying about what you have not read is wrong.\nUPDATE: Glen Hauman is dumber than I thought. He’s actually an author himself,\ncomplete with an Amazon page\n. Now, I do NOT recommend downgrading his books, but I absolute recommend bringing his call to violate the Amazon reviews system to Amazon’s attention. And I call upon Hauman to recant and remove his idiotic call to put down the works written by the various Sad Puppies nominees.\nUPDATE 2: Hauman must be a Making Light acolyte, given his penchant for disemvoweling. Here is what the disemvoweled comment on his site says:\n*shakes head slowly* You guys really are a special brand of stupid, aren’t you? Do you enjoy poking bears with sticks as well? His audience dwarfs yours and he’s not above using the same tactics as you (as you so helpfully pointed out). So you go ahead and suggest An Approach that can only possibly win if your audience is larger than his. What exactly do you hope to accomplish? BTW, talking about the Hugo Awards without actually talking about the Hugo Awards is dishonest. Why not use an honest title, like “Vox is a horrible person. Here’s how to beat him at his own game.” I only suggest that title because you’ve shown you don’t care about committing libel.",
  "tags": [
    "Hugo Award",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-14T08:43:00+00:00"
}