{
  "url": "https://voxday.net/2015/04/22/kicking-puppies-makes-vivian-sad/",
  "scraped_at": "2025-12-16T12:53:10.348975",
  "title": "Kicking Puppies makes Vivian sad",
  "date_display": "April 22, 2015",
  "date_iso": "2015-04-22T16:00:00+00:00",
  "date_from_url": "2015-04-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2015/04/VivianSP.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/04/VivianSP.jpg\" width=\"282\"/></a></div><p>I wonder how many SJWs have the wits to grasp <a href=\"http://kukuruyoart.deviantart.com/art/Vivian-and-Sad-Puppie-526250490\">what that picture indicates</a>? In any event, there are two more SJW responses worth noting this week, including another heartfelt soliloquy from David Gerrold as well as an absolutely revelatory response by John Scalzi.</p><p>David Gerrold first <a href=\"https://www.facebook.com/david.gerrold/posts/10205413284863919\">writes an open letter</a> to Brad Torgersen:</p><blockquote class=\"tr_bq\"><p> You have hurt the Sasquan committee. These are people who have spent years planning, campaigning, bidding, working, preparing, and anticipating the best convention they can imagine. You don’t know what goes on behind the scenes of a convention, how many moving parts there are, how many people have to rise to the occasion. There’s programming, guest relations, membership registration, con suite, green room, sound and video, tech of all kinds, finances, insurance, security, special needs, cat-herding, and more. Everyone who takes on one of those jobs does so out of a love of the field — and everyone who was looking forward to a party is now hurting because there’s a turd in the punch bowl — and you are perceived as the guy who dropped it there. You and Larry Correia.</p><p>And you have hurt all the fans who will be attending, all the fans who wil be following events online. Instead of the convention being about a celebration of our common interests in SF, it is now about you and Larry Correia and a few others associated with you. You have pulled the convention off purpose and you have hurt the fans who wanted to have a good old-fashioned happy Worldcon. There have been many of those.</p><p>You have hurt your colleagues in the field. There are people who have declined to be award presenters. Others have asked to have their works removed from the ballot. You have hurt the integrity of the awards.</p></blockquote><p>And then promptly <a href=\"https://www.facebook.com/david.gerrold/posts/10205413284863919?comment_id=10205414501734340&amp;offset=50&amp;total_comments=100&amp;comment_tracking=%7B%22tn%22%3A%22R9%22%7D\">deletes Brad’s response</a> to his open letter:</p><blockquote class=\"tr_bq\"><p> And once again, Brad Togersen misses the point. I’ve deleted his msgs. I’m done with you, Brad. At long last, have you no decency? Have you no shame?</p></blockquote><p>Do they still wonder why we laugh at their disingenuous calls for “honest dialogue” and “debate”? I thought Brad’s response was considerably longer than it needed to be. “We don’t care” would have sufficed. Although I suppose it is amusing to see that Gerrold still doesn’t realize that what he thought was a punch bowl has been a toilet for a decade.</p><p>Speaking of deletions, Johnny Con first made fun of sexually abused children in the process of attacking Larry Correia, then belatedly deleted his post.</p><blockquote class=\"tr_bq\"><p> [On second thought, this was not well-argued and I’m withdrawing it until I can more fairly and accurately make the point I want to make. Will update when I do. In the meantime, note to self: Don’t write screeds when operating under lack of sleep — JS]</p></blockquote><p>But not before I happened to notice this interesting big of psychological projection:<i> “Day is a perfectly lucid person. He’s a fine con man, in other words, and Correia and Torgersen fell for his con.</i>“</p><p>The choice of words is revealing. It was nearly a year ago when I wrote about <a href=\"http://www.milobookclub.com/2014/06/09/not-bad-summary-actually/\">SF’s biggest con artist</a>: “Sure you’re smiling, Johnny. That’s why you stopped reporting your<br> annual numbers in 2013. That’s why you shut down your Quantcast reports.<br> That’s why you don’t post a traffic meter anywhere on your site. That’s<br> why you threatened to quit SFWA…. I can’t speak for anyone else, but I find your constant<br> snake oil salesmanship genuinely amusing. You’re the Bernie Madoff of<br> science fiction and you’ve got the Participation Hugo to prove it.”</br></br></br></br></br></p><p>To say nothing of two more Hugo nominations than Arthur C. Clarke, and seven more than Iain Banks and Terry Pratchett combined. As it happens, thanks to the Dread Ilk and the Puppies, I am rapidly approaching the 2 million monthly pageviews that <a href=\"http://www.lightspeedmagazine.com/nonfiction/interview-john-scalzi/\">Johnny Con falsely told Lightspeed Magazine</a> he had back in 2010, when he actually had 305,000. The difference is that if I say I have two million monthly pageviews, you can be 100 percent certain that I do. I do not lie on the Internet. It is very, very stupid to lie on the Internet. Johnny also <a href=\"http://whatever.scalzi.com/2015/04/20/keeping-up-with-the-hugos-42015/\">let Larry Correia have it</a> for Larry’s refusal to let little<br> Johnny be friends with him despite Johnny’s repeated overtures.</br></p><blockquote class=\"tr_bq\"><p> Also, can we please now stop pretending that this whole Puppy nonsense began for any other reason than that once upon a time, Larry Correia thought he was going to win an award and was super pissed he didn’t, and decided that the reason he didn’t had to be a terrible, awful conspiracy against people just like him (a conservative! Writing “fun” fiction!), as opposed to, oh, the voters deciding they just plain liked something and someone else better? Can we stop pretending that a fellow who practically begs people to nominate his work three years running, hiding the begging behind an oh-so-thin veil of “let’s stick it to the SJWs!” doesn’t desperately crave the external validation that he thinks the award will bring? Can we stop pretending that this is anything other than a grown up child stomping his feet, screaming look at me, look at me, loooook at meeeeee? Because, come on, folks. We’re well past the point of genteel here. Let’s call it for what it is.</p><p>(And yes, I know, Correia declined his nomination for the Hugo this year. Let’s talk about that for a minute, shall we. It takes a very special sort of fellow to allow himself to be on a slate to get nominated, marshal people to nominate him for the award as part of a slate, and then decline — and write a big ol’ puffed-up piece about why he was declining, social justice warriors, blows against the empire, blah blah blah, yadda yadda. Yes, nice he declined the nomination and let someone else on the ballot. But it’s a little like wanting credit for rescuing a baby squirrel when you knocked the baby squirrel out of the tree to begin with.)</p><p>To be clear, the Puppy nonsense now isn’t just about Correia really really really wanting validation in the form of a rocketship; Day’s stealing the Puppy movement right out from under Correia and Torgerson has changed things up quite a bit, and it’s certainly true at this point that this little campaign is about a bunch of people trying to shit in the punchbowl so no one else can have any punch. But at the beginning, it was Correia hurt and angry that someone else got an award he thought was his, and deciding that it was stolen from him, rather than being something that was never his to begin with. And I’m sorry for him that it didn’t go his way. But actual grown human beings deal with disappointment in ways other than Correia has.</p><p>Correia can bluster about this all he likes; he’s a lovely online bully, and certainly he wishes to project that he’s a Tough Guy Saying Tough Things, Toughly™. But, eh. If he was actually who he wishes he could project himself as, the Sad Puppy thing would have never happened. And, ironically, he would be better positioned to win the awards he craved, because he wouldn’t be seen as a petulant whiner about such things. As it is, all we can do for him now is let him show us on the cartoon face pain chart how much Worldcon hurt him, and offer him soothing hugs until all his pain goes away.</p></blockquote><p>See, if only Larry had only treated Johnny Con more nicely, then he would have won the award that he so badly craves. Why won’t he be friends, why?</p></div>",
  "content_text": "I wonder how many SJWs have the wits to grasp\nwhat that picture indicates\n? In any event, there are two more SJW responses worth noting this week, including another heartfelt soliloquy from David Gerrold as well as an absolutely revelatory response by John Scalzi.\nDavid Gerrold first\nwrites an open letter\nto Brad Torgersen:\nYou have hurt the Sasquan committee. These are people who have spent years planning, campaigning, bidding, working, preparing, and anticipating the best convention they can imagine. You don’t know what goes on behind the scenes of a convention, how many moving parts there are, how many people have to rise to the occasion. There’s programming, guest relations, membership registration, con suite, green room, sound and video, tech of all kinds, finances, insurance, security, special needs, cat-herding, and more. Everyone who takes on one of those jobs does so out of a love of the field — and everyone who was looking forward to a party is now hurting because there’s a turd in the punch bowl — and you are perceived as the guy who dropped it there. You and Larry Correia.\nAnd you have hurt all the fans who will be attending, all the fans who wil be following events online. Instead of the convention being about a celebration of our common interests in SF, it is now about you and Larry Correia and a few others associated with you. You have pulled the convention off purpose and you have hurt the fans who wanted to have a good old-fashioned happy Worldcon. There have been many of those.\nYou have hurt your colleagues in the field. There are people who have declined to be award presenters. Others have asked to have their works removed from the ballot. You have hurt the integrity of the awards.\nAnd then promptly\ndeletes Brad’s response\nto his open letter:\nAnd once again, Brad Togersen misses the point. I’ve deleted his msgs. I’m done with you, Brad. At long last, have you no decency? Have you no shame?\nDo they still wonder why we laugh at their disingenuous calls for “honest dialogue” and “debate”? I thought Brad’s response was considerably longer than it needed to be. “We don’t care” would have sufficed. Although I suppose it is amusing to see that Gerrold still doesn’t realize that what he thought was a punch bowl has been a toilet for a decade.\nSpeaking of deletions, Johnny Con first made fun of sexually abused children in the process of attacking Larry Correia, then belatedly deleted his post.\n[On second thought, this was not well-argued and I’m withdrawing it until I can more fairly and accurately make the point I want to make. Will update when I do. In the meantime, note to self: Don’t write screeds when operating under lack of sleep — JS]\nBut not before I happened to notice this interesting big of psychological projection:\n“Day is a perfectly lucid person. He’s a fine con man, in other words, and Correia and Torgersen fell for his con.\n“\nThe choice of words is revealing. It was nearly a year ago when I wrote about\nSF’s biggest con artist\n: “Sure you’re smiling, Johnny. That’s why you stopped reporting your\nannual numbers in 2013. That’s why you shut down your Quantcast reports.\nThat’s why you don’t post a traffic meter anywhere on your site. That’s\nwhy you threatened to quit SFWA…. I can’t speak for anyone else, but I find your constant\nsnake oil salesmanship genuinely amusing. You’re the Bernie Madoff of\nscience fiction and you’ve got the Participation Hugo to prove it.”\nTo say nothing of two more Hugo nominations than Arthur C. Clarke, and seven more than Iain Banks and Terry Pratchett combined. As it happens, thanks to the Dread Ilk and the Puppies, I am rapidly approaching the 2 million monthly pageviews that\nJohnny Con falsely told Lightspeed Magazine\nhe had back in 2010, when he actually had 305,000. The difference is that if I say I have two million monthly pageviews, you can be 100 percent certain that I do. I do not lie on the Internet. It is very, very stupid to lie on the Internet. Johnny also\nlet Larry Correia have it\nfor Larry’s refusal to let little\nJohnny be friends with him despite Johnny’s repeated overtures.\nAlso, can we please now stop pretending that this whole Puppy nonsense began for any other reason than that once upon a time, Larry Correia thought he was going to win an award and was super pissed he didn’t, and decided that the reason he didn’t had to be a terrible, awful conspiracy against people just like him (a conservative! Writing “fun” fiction!), as opposed to, oh, the voters deciding they just plain liked something and someone else better? Can we stop pretending that a fellow who practically begs people to nominate his work three years running, hiding the begging behind an oh-so-thin veil of “let’s stick it to the SJWs!” doesn’t desperately crave the external validation that he thinks the award will bring? Can we stop pretending that this is anything other than a grown up child stomping his feet, screaming look at me, look at me, loooook at meeeeee? Because, come on, folks. We’re well past the point of genteel here. Let’s call it for what it is.\n(And yes, I know, Correia declined his nomination for the Hugo this year. Let’s talk about that for a minute, shall we. It takes a very special sort of fellow to allow himself to be on a slate to get nominated, marshal people to nominate him for the award as part of a slate, and then decline — and write a big ol’ puffed-up piece about why he was declining, social justice warriors, blows against the empire, blah blah blah, yadda yadda. Yes, nice he declined the nomination and let someone else on the ballot. But it’s a little like wanting credit for rescuing a baby squirrel when you knocked the baby squirrel out of the tree to begin with.)\nTo be clear, the Puppy nonsense now isn’t just about Correia really really really wanting validation in the form of a rocketship; Day’s stealing the Puppy movement right out from under Correia and Torgerson has changed things up quite a bit, and it’s certainly true at this point that this little campaign is about a bunch of people trying to shit in the punchbowl so no one else can have any punch. But at the beginning, it was Correia hurt and angry that someone else got an award he thought was his, and deciding that it was stolen from him, rather than being something that was never his to begin with. And I’m sorry for him that it didn’t go his way. But actual grown human beings deal with disappointment in ways other than Correia has.\nCorreia can bluster about this all he likes; he’s a lovely online bully, and certainly he wishes to project that he’s a Tough Guy Saying Tough Things, Toughly™. But, eh. If he was actually who he wishes he could project himself as, the Sad Puppy thing would have never happened. And, ironically, he would be better positioned to win the awards he craved, because he wouldn’t be seen as a petulant whiner about such things. As it is, all we can do for him now is let him show us on the cartoon face pain chart how much Worldcon hurt him, and offer him soothing hugs until all his pain goes away.\nSee, if only Larry had only treated Johnny Con more nicely, then he would have won the award that he so badly craves. Why won’t he be friends, why?",
  "tags": [
    "#GamerGate",
    "Hugo Award",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-22T15:00:00+00:00"
}