{
  "url": "https://voxday.net/2015/04/15/kicked-out-of-warren/",
  "scraped_at": "2025-12-16T12:52:21.203929",
  "title": "Kicked out of the warren",
  "date_display": "April 15, 2015",
  "date_iso": "2015-04-15T09:54:00+00:00",
  "date_from_url": "2015-04-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The atheists in Ireland found that PZ Myers’s relentlessly odious and bullying style was finally <a href=\"http://www.michaelnugent.com/2015/04/07/atheist-ireland-dissociates-from-pz-myers/\">too much for them</a> to take any longer:</p><blockquote class=\"tr_bq\"><p> Atheist Ireland is publicly dissociating itself from the hurtful and<br> dehumanising, hateful and violent, unjust and defamatory rhetoric of the<br> atheist blogger PZ Myers. The final of many, many straws were his<br> latest smear that Ayaan Hirsi Ali is ‘happily exploiting atrocities’,<br> and his subsequent description of Atheist Ireland’s chairperson as ‘the<br> Irish wanker’…</br></br></br></br></br></p><p><b>Some examples of his hurtful and dehumanising rhetoric</b><br> <b> </b><br> <br> He said that ‘the scum rose to the top of the atheist movement’, that<br> it is ‘burdened by cretinous reactionaries’, that ‘sexist and<br> misogynistic scumbags’ are ‘not a fringe phenomenon’, and that if you<br> don’t agree with Atheism Plus, you are an ‘Asshole Atheist’. He agreed<br> that science fetishism reproduces the ‘white supremacist logic of the<br> New Atheist Movement.’ He said ‘I officially divorce myself from the<br> skeptic movement,’ which ‘has attracted way too many thuggish jerks,<br> especially in the leadership’.</br></br></br></br></br></br></br></br></br></br></p><p>He said Richard Dawkins ‘seems to have developed a callous<br> indifference to the sexual abuse of children’ and ‘has been eaten by<br> brain parasites’, Michael Nugent is ‘the Irish wanker’ and a ‘demented<br> fuckwit’, Ann Marie Waters is a ‘nutter’, Russell Blackford is a ‘lying<br> fuckhead’, Bill Maher’s date at an event was ‘candy to decorate [her<br> sugar daddy’s] arm in public’, Ben Radford is a ‘revolting narcissistic<br> scumbag’ and his lawyer is ‘J Noble Dogshit’, Rosetta scientist Matt<br> Taylor and Bill Maher are ‘assholes’, and Abbie Smith and her ‘coterie<br> of slimy acolytes’ are ‘virtual non-entities’. He called Irish blogger<br> ZenBuffy a ‘narcissistic wanker,’ after she said she has experienced<br> mental illness….</br></br></br></br></br></br></br></br></br></br></p><p>He also employs hate speech against Christians (‘I left the theatre<br> filled with contempt and loathing for Christians’), apocalypse-mongers<br> (‘they make me furious and fill me with an angry contempt’), ‘your<br> average, run-of-the-mill Christian’ (‘I despise Karen Armstrong almost<br> as much as I do Fred Phelps’), and several people who were organising a<br> prayer initiative (‘Jesus Christ but I hate these slimebags’ who are<br> ‘demented fuckwits every one.’)</br></br></br></br></br></br></p><p>He uses violent rhetoric. He said ‘I’ve got to start carrying a knife<br> now’ to kill Christians if they pray instead of helping him while he is<br> dying. He said about a meal: ‘Don’t show up to pick a fight or we’ll<br> pitch you off a pier.’ When a Brazilian priest died in a charity<br> ballooning accident, he said ‘my new dream’ will be shooting priests out<br> of the sky from an aircraft. When a Christian shopkeeper apologised for<br> offending atheists, he refused to accept the apology, saying ‘No. Fuck<br> him to the ground.’ He would rather debate William Lane Craig in writing<br> ‘where I can pin him down, stick a knife in the bastard, and twist it<br> for a good long while’. He praised a blog post that ‘shanks Thunderf00t<br> in the kidneys and mocks him cruelly’.</br></br></br></br></br></br></br></br></br></br></p><p>He has encouraged his blog commenters to ‘rhetorically hand [critics]<br> a rotting porcupine and tell you to stuff it up your nether orifice’.<br> They in turn have told people to ‘put a three week old decaying<br> porcupine dipped in tar and broken glass up your arse sideways’, to<br> ‘fuck yourself sideways’ with a ‘rusty chainsaw’, ‘red-hot pokers’ or a<br> ‘rusty coat hanger’, and to ‘go die in a fire. slowly. seriously’. More<br> recently he said of ‘faux-Vulcan shit’ that he encourages his<br> commentariat to ‘draw their knives and flense it so thoroughly the<br> dispassionate ass is feeling the pain in every nerve ending’.</br></br></br></br></br></br></br></br></p></blockquote><p>You know PZ spiraled completely out of control when not a single example of his regular hate-on for me didn’t even make the Top 40 list. I quit paying attention to him years ago, and I’m a little sorry about that because it appears we missed some quality antics during that time.</p><p>On the plus side, at least he didn’t end up selling his corpulent body in a Las Vegas brothel. It could have been worse.</p><p>There is one interesting thing here. You’ve probably noticed that all the various calls for Larry Correia, Brad Torgersen, and others to disavow me are based on a very small number of cropped and ungrammatical quotes; they don’t even dare to quote a single complete sentence. And yet, there are no calls from public figures for Richard Dawkins or Sam Harris to disavow PZ Myers despite there being considerably more examples of considerably more objectionable public statements.</p><p>Why might that be?</p></div>",
  "content_text": "The atheists in Ireland found that PZ Myers’s relentlessly odious and bullying style was finally\ntoo much for them\nto take any longer:\nAtheist Ireland is publicly dissociating itself from the hurtful and\ndehumanising, hateful and violent, unjust and defamatory rhetoric of the\natheist blogger PZ Myers. The final of many, many straws were his\nlatest smear that Ayaan Hirsi Ali is ‘happily exploiting atrocities’,\nand his subsequent description of Atheist Ireland’s chairperson as ‘the\nIrish wanker’…\nSome examples of his hurtful and dehumanising rhetoric\nHe said that ‘the scum rose to the top of the atheist movement’, that\nit is ‘burdened by cretinous reactionaries’, that ‘sexist and\nmisogynistic scumbags’ are ‘not a fringe phenomenon’, and that if you\ndon’t agree with Atheism Plus, you are an ‘Asshole Atheist’. He agreed\nthat science fetishism reproduces the ‘white supremacist logic of the\nNew Atheist Movement.’ He said ‘I officially divorce myself from the\nskeptic movement,’ which ‘has attracted way too many thuggish jerks,\nespecially in the leadership’.\nHe said Richard Dawkins ‘seems to have developed a callous\nindifference to the sexual abuse of children’ and ‘has been eaten by\nbrain parasites’, Michael Nugent is ‘the Irish wanker’ and a ‘demented\nfuckwit’, Ann Marie Waters is a ‘nutter’, Russell Blackford is a ‘lying\nfuckhead’, Bill Maher’s date at an event was ‘candy to decorate [her\nsugar daddy’s] arm in public’, Ben Radford is a ‘revolting narcissistic\nscumbag’ and his lawyer is ‘J Noble Dogshit’, Rosetta scientist Matt\nTaylor and Bill Maher are ‘assholes’, and Abbie Smith and her ‘coterie\nof slimy acolytes’ are ‘virtual non-entities’. He called Irish blogger\nZenBuffy a ‘narcissistic wanker,’ after she said she has experienced\nmental illness….\nHe also employs hate speech against Christians (‘I left the theatre\nfilled with contempt and loathing for Christians’), apocalypse-mongers\n(‘they make me furious and fill me with an angry contempt’), ‘your\naverage, run-of-the-mill Christian’ (‘I despise Karen Armstrong almost\nas much as I do Fred Phelps’), and several people who were organising a\nprayer initiative (‘Jesus Christ but I hate these slimebags’ who are\n‘demented fuckwits every one.’)\nHe uses violent rhetoric. He said ‘I’ve got to start carrying a knife\nnow’ to kill Christians if they pray instead of helping him while he is\ndying. He said about a meal: ‘Don’t show up to pick a fight or we’ll\npitch you off a pier.’ When a Brazilian priest died in a charity\nballooning accident, he said ‘my new dream’ will be shooting priests out\nof the sky from an aircraft. When a Christian shopkeeper apologised for\noffending atheists, he refused to accept the apology, saying ‘No. Fuck\nhim to the ground.’ He would rather debate William Lane Craig in writing\n‘where I can pin him down, stick a knife in the bastard, and twist it\nfor a good long while’. He praised a blog post that ‘shanks Thunderf00t\nin the kidneys and mocks him cruelly’.\nHe has encouraged his blog commenters to ‘rhetorically hand [critics]\na rotting porcupine and tell you to stuff it up your nether orifice’.\nThey in turn have told people to ‘put a three week old decaying\nporcupine dipped in tar and broken glass up your arse sideways’, to\n‘fuck yourself sideways’ with a ‘rusty chainsaw’, ‘red-hot pokers’ or a\n‘rusty coat hanger’, and to ‘go die in a fire. slowly. seriously’. More\nrecently he said of ‘faux-Vulcan shit’ that he encourages his\ncommentariat to ‘draw their knives and flense it so thoroughly the\ndispassionate ass is feeling the pain in every nerve ending’.\nYou know PZ spiraled completely out of control when not a single example of his regular hate-on for me didn’t even make the Top 40 list. I quit paying attention to him years ago, and I’m a little sorry about that because it appears we missed some quality antics during that time.\nOn the plus side, at least he didn’t end up selling his corpulent body in a Las Vegas brothel. It could have been worse.\nThere is one interesting thing here. You’ve probably noticed that all the various calls for Larry Correia, Brad Torgersen, and others to disavow me are based on a very small number of cropped and ungrammatical quotes; they don’t even dare to quote a single complete sentence. And yet, there are no calls from public figures for Richard Dawkins or Sam Harris to disavow PZ Myers despite there being considerably more examples of considerably more objectionable public statements.\nWhy might that be?",
  "tags": [
    "atheism",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-15T08:54:00+00:00"
}