{
  "url": "https://voxday.net/2015/04/13/mailvox-refuting-rhetorica/",
  "scraped_at": "2025-12-16T12:52:06.438011",
  "title": "Mailvox: refuting the rhetorical",
  "date_display": "April 13, 2015",
  "date_iso": "2015-04-13T08:19:00+00:00",
  "date_from_url": "2015-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JD has a suggestion which makes superficial sense, although I tend to doubt it will accomplish anything given the inability of rhetorical minds to change based on information:</p><blockquote class=\"tr_bq\"><p> I got an idea reading your latest post about George R. R. Martin baiting the hook. Martin just reiterates the same litany of labels/misrepresentations that people love to affix to you but I seriously doubt he has spent any time on your blog or twitter feed looking for the relevant posts and quotes to read for himself- so maybe it would be useful to put them all together in one convenient place for all to read. I am suggesting you put together a FAQ relating to Sad/Rabid Puppies and yourself in general that you put front and center on your blog. I think it could serve a variety of purposes. (It would be a fun little museum of SJW’s lies and misrepresentations about you and would be more fun to browse than a freak show at the circus.) </p><p>I have spent a fair amount of time lately around the web and social media reading what your detractors say about you and Sad/Rabid puppies. Whether it is blog, Reddit, Twitter, etc., they trot out the same accusations: “he said black people are savages, he thinks it’s okay to throw acid in women’s faces, he got kicked out of the SFWA because he used the SFWA communication channels to spread racism, he is a white-supremacist, he is a Christian dominionist, he has said that he hates women, he is trying to destroy the Hugos, he gamed the Hugos…”</p><p>I know you have addressed these kinds of things as you have encountered them, but I think it would be helpful to put them all in one place, especially now that the mainstream media is taking notice of the Hugo situation. Quote the SJW’s accusation, link to the relevant blog entries if applicable, define yourself in your own words, and most importantly- make people accountable for twisting your words and misrepresenting you. I’m sure the Ilk wouldn’t mind helping you collect and catalogue the slanders against you.</p></blockquote><p>As I said, I’m skeptical, but it can’t hurt. To address the specific accusations:</p><ol><li>I did not say black people are savages. I said one black individual, N.K. Jemisin, was a half-savage. I was wrong. She is, we are reliably informed by Ms Jemisin herself, a full savage. In addition to falsely claiming that I am “a self-described<br> misogynist, racist, anti-Semite, and a few other flavors of asshole”, the charming Ms Jemisin has also claimed “a) that <b>Heinlein</b> was <b>racist</b> as *<b>fuck</b>*,<br> and b) most of science fiction fandom was too.” It’s mildly amusing to see science fiction fandom fall all over itself to call me racist in defense of the woman who has openly, and <i>repeatedly</i>, declared that they are racists.</br></br></li><li>I do not think it is okay to throw acid in women’s faces for any reason. I do think the Taliban are rational and that their policy of mutilating and murdering those who threaten their way of life reflects their objectives and their ruthlessness rather than <a href=\"http://www.milobookclub.com/2012/06/05/scientist-beats-up-pz/\">an inability to think rationally</a>. The fact that they have successively defeated the Red Army and NATO in Afghanistan tends to support my case.</li><li>I was not kicked out of SFWA for any reason. The SFWA Board voted to expel me, but the membership never followed suit as required by the bylaws at the time. And no reason was given by the SFWA Board for its vote. The real reason was that Patrick Nielsen Hayden and John Scalzi refused to pay their dues to SFWA and presented the board with choice between me and a Senior Editor at Tor Books as well as its three-time former president.</li><li>I am not a white supremacist. I am a Native American with considerable Mexican heritage. Mexican Revolutionary heritage to be precise. I am not a supremacist of any kind, but I would be better described as an East Asian supremacist. I tend to prefer Western European culture, specifically Italian culture, but I am an East Asian Studies major, I lived and studied in Japan, and I still speak some Japanese.</li><li>I could not unreasonably be described as a small-d Christian dominionist, but I am more accurately described as a Western Civilizationist. I believe that any civilized Western society will be a Christian one or it will cease to be civilized… if it manages to survive at all. The explosion of Christianity throughout Asia versus Western postchristianity is one reason I think the future favors Asian civilization in the long term. I think Europe is in the process of going back to being the historical sideshow it was prior to the 1500s.</li><li>I am not trying to destroy the Hugo Awards. I am indifferent to their fate.</li><li>I did not game the 2014 Hugo Awards. After being falsely accused of doing so by numerous parties, I decided to demonstrate the absurdity of the accusation by gaming the 2015 Awards. I trust my innocence with regards to the 2014 Awards is now clear and I look forward to receiving apologies from those who falsely accused me.</li></ol><p>Anything else? I tend to doubt knowing the relevant facts will affect many opinions, for the obvious reason that if you are inclined to write someone off completely because you heard they once called someone a “half-savage”, you are providing a very strong indication that your mind is limited to the rhetorical level.</p><p>Indeed, the fact that the same ungrammatical excerpt chopped out of the middle of a sentence keeps being trotted out again and again should alert the dialectical mind to the probability that there simply isn’t very much, if any, there there. The complete sentence, which for obvious reasons is almost never quoted, <a href=\"http://www.milobookclub.com/2013/06/13/a-black-female-fantasis/\">much less quoted in context</a>, is this:<br> <i><b><br/></b></i><br> <i><b>“Being an educated, but ignorant half-savage, with little more<br> understanding of what it took to build a new literature by “a bunch of<br> beardy old middle-class middle-American guys” than an illiterate Igbotu<br> tribesman has of how to build a jet engine, Jemisin clearly does not<br> understand that her dishonest call for “reconciliation” and even more<br> diversity within SF/F is tantamount to a call for its decline into<br> irrelevance.” </br></br></br></br></br></br></b></i></br></br></p><p>But it is entirely obvious that we’re not dealing with dialectical minds capable of logic, we’re dealing with rhetorical minds that are swayed solely by emotion. Such minds can be changed, but not by facts and reason. The more successful we are, and the more staunchly we stand, the more of them that will come over to our side for a whole host of “reasons” that will neither make sense to us nor withstand logical scrutiny.</p><p>Especially when <a href=\"http://www.milobookclub.com/2013/06/13/a-black-female-fantasis/?commentPage=2#c813120286664446140\">this is what passes for the honest dialogue and debate</a> from the other side when they come to comment here:</p><blockquote class=\"tr_bq\"><p> What does a right-wing fundamentalist southern Baptist do that’s “civilized”? – fuck his sister? Sodomize pigs and goats? Masturbate with his own gun? Beat his wife with a copy of the Bible? Dress in white sheets while spewing the kind of racist garbage that Hitler would be proud of? Too bad your mum didn’t abort you. At least you’re an old fuck who will die before me, so I can laugh over how few people come to your funeral.</p></blockquote></div>",
  "content_text": "JD has a suggestion which makes superficial sense, although I tend to doubt it will accomplish anything given the inability of rhetorical minds to change based on information:\nI got an idea reading your latest post about George R. R. Martin baiting the hook. Martin just reiterates the same litany of labels/misrepresentations that people love to affix to you but I seriously doubt he has spent any time on your blog or twitter feed looking for the relevant posts and quotes to read for himself- so maybe it would be useful to put them all together in one convenient place for all to read. I am suggesting you put together a FAQ relating to Sad/Rabid Puppies and yourself in general that you put front and center on your blog. I think it could serve a variety of purposes. (It would be a fun little museum of SJW’s lies and misrepresentations about you and would be more fun to browse than a freak show at the circus.)\nI have spent a fair amount of time lately around the web and social media reading what your detractors say about you and Sad/Rabid puppies. Whether it is blog, Reddit, Twitter, etc., they trot out the same accusations: “he said black people are savages, he thinks it’s okay to throw acid in women’s faces, he got kicked out of the SFWA because he used the SFWA communication channels to spread racism, he is a white-supremacist, he is a Christian dominionist, he has said that he hates women, he is trying to destroy the Hugos, he gamed the Hugos…”\nI know you have addressed these kinds of things as you have encountered them, but I think it would be helpful to put them all in one place, especially now that the mainstream media is taking notice of the Hugo situation. Quote the SJW’s accusation, link to the relevant blog entries if applicable, define yourself in your own words, and most importantly- make people accountable for twisting your words and misrepresenting you. I’m sure the Ilk wouldn’t mind helping you collect and catalogue the slanders against you.\nAs I said, I’m skeptical, but it can’t hurt. To address the specific accusations:\nI did not say black people are savages. I said one black individual, N.K. Jemisin, was a half-savage. I was wrong. She is, we are reliably informed by Ms Jemisin herself, a full savage. In addition to falsely claiming that I am “a self-described\nmisogynist, racist, anti-Semite, and a few other flavors of asshole”, the charming Ms Jemisin has also claimed “a) that\nHeinlein\nwas\nracist\nas *\nfuck\n*,\nand b) most of science fiction fandom was too.” It’s mildly amusing to see science fiction fandom fall all over itself to call me racist in defense of the woman who has openly, and\nrepeatedly\n, declared that they are racists.\nI do not think it is okay to throw acid in women’s faces for any reason. I do think the Taliban are rational and that their policy of mutilating and murdering those who threaten their way of life reflects their objectives and their ruthlessness rather than\nan inability to think rationally\n. The fact that they have successively defeated the Red Army and NATO in Afghanistan tends to support my case.\nI was not kicked out of SFWA for any reason. The SFWA Board voted to expel me, but the membership never followed suit as required by the bylaws at the time. And no reason was given by the SFWA Board for its vote. The real reason was that Patrick Nielsen Hayden and John Scalzi refused to pay their dues to SFWA and presented the board with choice between me and a Senior Editor at Tor Books as well as its three-time former president.\nI am not a white supremacist. I am a Native American with considerable Mexican heritage. Mexican Revolutionary heritage to be precise. I am not a supremacist of any kind, but I would be better described as an East Asian supremacist. I tend to prefer Western European culture, specifically Italian culture, but I am an East Asian Studies major, I lived and studied in Japan, and I still speak some Japanese.\nI could not unreasonably be described as a small-d Christian dominionist, but I am more accurately described as a Western Civilizationist. I believe that any civilized Western society will be a Christian one or it will cease to be civilized… if it manages to survive at all. The explosion of Christianity throughout Asia versus Western postchristianity is one reason I think the future favors Asian civilization in the long term. I think Europe is in the process of going back to being the historical sideshow it was prior to the 1500s.\nI am not trying to destroy the Hugo Awards. I am indifferent to their fate.\nI did not game the 2014 Hugo Awards. After being falsely accused of doing so by numerous parties, I decided to demonstrate the absurdity of the accusation by gaming the 2015 Awards. I trust my innocence with regards to the 2014 Awards is now clear and I look forward to receiving apologies from those who falsely accused me.\nAnything else? I tend to doubt knowing the relevant facts will affect many opinions, for the obvious reason that if you are inclined to write someone off completely because you heard they once called someone a “half-savage”, you are providing a very strong indication that your mind is limited to the rhetorical level.\nIndeed, the fact that the same ungrammatical excerpt chopped out of the middle of a sentence keeps being trotted out again and again should alert the dialectical mind to the probability that there simply isn’t very much, if any, there there. The complete sentence, which for obvious reasons is almost never quoted,\nmuch less quoted in context\n, is this:\n“Being an educated, but ignorant half-savage, with little more\nunderstanding of what it took to build a new literature by “a bunch of\nbeardy old middle-class middle-American guys” than an illiterate Igbotu\ntribesman has of how to build a jet engine, Jemisin clearly does not\nunderstand that her dishonest call for “reconciliation” and even more\ndiversity within SF/F is tantamount to a call for its decline into\nirrelevance.”\nBut it is entirely obvious that we’re not dealing with dialectical minds capable of logic, we’re dealing with rhetorical minds that are swayed solely by emotion. Such minds can be changed, but not by facts and reason. The more successful we are, and the more staunchly we stand, the more of them that will come over to our side for a whole host of “reasons” that will neither make sense to us nor withstand logical scrutiny.\nEspecially when\nthis is what passes for the honest dialogue and debate\nfrom the other side when they come to comment here:\nWhat does a right-wing fundamentalist southern Baptist do that’s “civilized”? – fuck his sister? Sodomize pigs and goats? Masturbate with his own gun? Beat his wife with a copy of the Bible? Dress in white sheets while spewing the kind of racist garbage that Hitler would be proud of? Too bad your mum didn’t abort you. At least you’re an old fuck who will die before me, so I can laugh over how few people come to your funeral.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-13T07:19:00+00:00"
}