{
  "url": "https://voxday.net/2015/04/07/mailvox-constructing-xanatos/",
  "scraped_at": "2025-12-16T12:51:23.330014",
  "title": "Mailvox: constructing Xanatos",
  "date_display": "April 7, 2015",
  "date_iso": "2015-04-07T10:39:00+00:00",
  "date_from_url": "2015-04-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>NH asks about setting up a Xanatos Gambit:</p><blockquote class=\"tr_bq\"><p> With some of your recent posts, I realized before you had pointed it out you were forcing the SJWs to make a choice, one that could lead to them nuking their own awards. The moment I realized this, I thought, that bastard! What a genius! It was simple, yet I wouldn’t have thought of it.</p><p>Recently, I had been considering similar ideas… all roads leading your enemy to defeat, as you quoted. Yet I struggle to see those moves because those moves can be so deceptive in their simplicity, so hidden in plain view.</p><p>How did you get better over time at seeing those strategic moves? I’m not a stupid guy, but I’m looking for mental exercises if you will. What is the difference between being Machiavellian (which I score high in on tests) and being manipulative?</p></blockquote><p>The difference between being Machiavellian and being manipulative is little more than the amount of foresight involved. Those who are manipulative are usually reactive, their goals are short term, and they often contradict themselves and get in their own way. Those who are Machiavellian usually have a long term goal in mind and their every move is designed to move them closer to that objective. There are two famous military dictums that I like to keep in mind at all times, the former credited to Sun Tzu, the latter to Napoleon.</p><ul><li><i>If you know others and know yourself, you will not be imperiled in a hundred battles; if you do not know others but know yourself, you win one and lose one; if you do not know others and do not know yourself, you will be imperiled in every single battle. </i></li><li><i>When your enemy is executing a false movement, never interrupt him.</i></li></ul><p>The reason you must know yourself is so that you can know your strong points, your weak points, and your capabilities. Few battles are won through overwhelming strength, they are won by breaking the enemy’s weak points before he can break your strong points. The reason you must know your enemy is so you can know his strong points to avoid them, his weak points to target them, and his capabilities so you can defend yourself against them.</p><p>[NB: This is why I HATE the term <i>schwerpunkt </i>in military theory, because it is an offensive term meaning focal point of effort, not a defensive term indicating a hardened resistance point as would make more sense in the above context.]</p><p>Where win-win situations, or Xanatos Gambits, are created is by taking advantage of the enemy’s illusions. Informational friction is absolutely key, and in situations like the present struggle for the Hugo Awards, it is compounded by people seeing what they want to see. So, applying Sun Tzu, you must first do two things:</p><ul><li>Ensure that you are seeing an accurate picture of yourself and your enemy.</li><li>Identify what their illusions are concerning themselves and you.</li></ul><p>Then present them with options where they will predictably react by choosing the one that works to your advantage. Soon enough, they will find themselves in a position where they are choosing between options that are equally beneficial to you. More or less. In some cases, you may well find that you don’t even care which option they choose.</p><p>Let me give an actual example of what underlay the Hugo situation. The SJWs in science fiction are constantly making ridiculously stupid mistakes because they violate Sun Tzu’s dictum by a) wrongly believing themselves to be more influential than they are and b) wrongly considering me and the Sad Puppies to be less influential than we are. The former is not their fault; John Scalzi has relentlessly misled them for years. “The biggest blog in SF” that they had on their side was literally 15 percent of the size they were told it was and erroneously believed it to be in August 2010. And yet, even 18 months after being exposed, there are still some SJWs who will tell you in all seriousness that Scalzi is “huge”.</p><p>Blame for the latter, on the other hand, is entirely theirs As recently as last year, there were SJWs <a href=\"http://bibliodaze.com/2014/04/vox-day-and-the-hugos-why-we-should-just-say-no/#li-comment-3015\">who quite literally believed this</a>:</p><blockquote class=\"tr_bq\"><p> My website averages well over 600 visits a day. Based on comments from other fanzine people, I’m guessing that’s more readers than VD’s blog would get even when he provokes a shit storm. Let’s deprive him of the traffic.</p></blockquote><p>At the time she posted that, the site traffic was 46,456 Google pageviews per day. Yesterday it was 68,539. Last month’s average was 51,068. The ludicrous aspect of this is that the Sitemeter widget has always been publicly available, and though it’s considerably stingier than Google or WordPress, about ten seconds of research would have provided whatever ratio is required to compare apples to apples.</p><p>The immediate consequence is that the other side imagines that the Dread Ilk cannot possibly account for the numbers that are overwhelming their core strength. Ergo #GamerGate must be involved and a whole host of other delusions that the rational observer knows are not even possible, thereby leading to a series of mistakes that will likely lead to the very situation they erroneously believe is already taking place. And their failure to know their enemy means they do not know what our objectives are, so they never know if their attempts to counter our actions are thwarting us or playing into our hands.</p><p>These two comments by Alexander are apt:</p><ul><li>So how long until the rabbits put 2 and 2 together and realize that they have waaaaaaaay more than just 300 sad puppies to deal with. The voters were the tip of the spear, we are now seeing the obvious signs that we have magnitudes of support behind us.</li><li>They’ve already gotten Breitbart, Instapundit, Twitchy, Ace, and Gamergate involved. At this rate, Finland will have declared war on SJWs by Friday.</li></ul><p>By the time they do recalibrate their thinking, it will be far too late. It is already too late, which is why I don’t mind spelling it out. As for how I learned to see these things, part of it is a natural propensity for pattern recognition, part of it is playing a lot of wargames like <i>Advanced Squad Leader</i>. Nothing teaches harsh lessons in actions and consequences, or demonstrates the importance of accurate information, like wargaming.</p><p>The most important thing is this: do not underestimate your enemy or ignore his strengths out of a foolish desire to believe yourself his superior. If you want to learn more about this sort of strategic thinking, I very highly recommend reading Martin van Creveld’s <a href=\"http://www.amazon.com/History-Strategy-From-William-Lind-ebook/dp/B00V94520E/\"><b><i>A History of Strategy: From Sun Tzu to William S. Lind</i></b></a>, which Castalia House just published last month.</p><p>Of course, sometimes it is very hard to take your enemy seriously when they are dumb enough to do things <a href=\"http://www.stuff.co.nz/technology/digital-living/67638135/scifi-hugo-awards-hijacked-by-antidiversity-campaign\">like post this caption</a>:</p><blockquote class=\"tr_bq\"><p> Annie Bellet, one of the writers on the nominees list who was not included in the Sad Puppies or Rabbid Puppies campaign.</p></blockquote><p>“Goodnight Stars” by Annie Bellet, <i>The Apocalypse Triptych </i>in fact appears on both the <a href=\"https://bradrtorgersen.wordpress.com/2015/02/01/sad-puppies-3-the-2015-hugo-slate/\">Sad Puppies</a> and <a href=\"http://www.milobookclub.com/2015/02/02/rabid-puppies-2015/\">Rabid Puppies</a> lists of recommendations.</p></div>",
  "content_text": "NH asks about setting up a Xanatos Gambit:\nWith some of your recent posts, I realized before you had pointed it out you were forcing the SJWs to make a choice, one that could lead to them nuking their own awards. The moment I realized this, I thought, that bastard! What a genius! It was simple, yet I wouldn’t have thought of it.\nRecently, I had been considering similar ideas… all roads leading your enemy to defeat, as you quoted. Yet I struggle to see those moves because those moves can be so deceptive in their simplicity, so hidden in plain view.\nHow did you get better over time at seeing those strategic moves? I’m not a stupid guy, but I’m looking for mental exercises if you will. What is the difference between being Machiavellian (which I score high in on tests) and being manipulative?\nThe difference between being Machiavellian and being manipulative is little more than the amount of foresight involved. Those who are manipulative are usually reactive, their goals are short term, and they often contradict themselves and get in their own way. Those who are Machiavellian usually have a long term goal in mind and their every move is designed to move them closer to that objective. There are two famous military dictums that I like to keep in mind at all times, the former credited to Sun Tzu, the latter to Napoleon.\nIf you know others and know yourself, you will not be imperiled in a hundred battles; if you do not know others but know yourself, you win one and lose one; if you do not know others and do not know yourself, you will be imperiled in every single battle.\nWhen your enemy is executing a false movement, never interrupt him.\nThe reason you must know yourself is so that you can know your strong points, your weak points, and your capabilities. Few battles are won through overwhelming strength, they are won by breaking the enemy’s weak points before he can break your strong points. The reason you must know your enemy is so you can know his strong points to avoid them, his weak points to target them, and his capabilities so you can defend yourself against them.\n[NB: This is why I HATE the term\nschwerpunkt\nin military theory, because it is an offensive term meaning focal point of effort, not a defensive term indicating a hardened resistance point as would make more sense in the above context.]\nWhere win-win situations, or Xanatos Gambits, are created is by taking advantage of the enemy’s illusions. Informational friction is absolutely key, and in situations like the present struggle for the Hugo Awards, it is compounded by people seeing what they want to see. So, applying Sun Tzu, you must first do two things:\nEnsure that you are seeing an accurate picture of yourself and your enemy.\nIdentify what their illusions are concerning themselves and you.\nThen present them with options where they will predictably react by choosing the one that works to your advantage. Soon enough, they will find themselves in a position where they are choosing between options that are equally beneficial to you. More or less. In some cases, you may well find that you don’t even care which option they choose.\nLet me give an actual example of what underlay the Hugo situation. The SJWs in science fiction are constantly making ridiculously stupid mistakes because they violate Sun Tzu’s dictum by a) wrongly believing themselves to be more influential than they are and b) wrongly considering me and the Sad Puppies to be less influential than we are. The former is not their fault; John Scalzi has relentlessly misled them for years. “The biggest blog in SF” that they had on their side was literally 15 percent of the size they were told it was and erroneously believed it to be in August 2010. And yet, even 18 months after being exposed, there are still some SJWs who will tell you in all seriousness that Scalzi is “huge”.\nBlame for the latter, on the other hand, is entirely theirs As recently as last year, there were SJWs\nwho quite literally believed this\n:\nMy website averages well over 600 visits a day. Based on comments from other fanzine people, I’m guessing that’s more readers than VD’s blog would get even when he provokes a shit storm. Let’s deprive him of the traffic.\nAt the time she posted that, the site traffic was 46,456 Google pageviews per day. Yesterday it was 68,539. Last month’s average was 51,068. The ludicrous aspect of this is that the Sitemeter widget has always been publicly available, and though it’s considerably stingier than Google or WordPress, about ten seconds of research would have provided whatever ratio is required to compare apples to apples.\nThe immediate consequence is that the other side imagines that the Dread Ilk cannot possibly account for the numbers that are overwhelming their core strength. Ergo #GamerGate must be involved and a whole host of other delusions that the rational observer knows are not even possible, thereby leading to a series of mistakes that will likely lead to the very situation they erroneously believe is already taking place. And their failure to know their enemy means they do not know what our objectives are, so they never know if their attempts to counter our actions are thwarting us or playing into our hands.\nThese two comments by Alexander are apt:\nSo how long until the rabbits put 2 and 2 together and realize that they have waaaaaaaay more than just 300 sad puppies to deal with. The voters were the tip of the spear, we are now seeing the obvious signs that we have magnitudes of support behind us.\nThey’ve already gotten Breitbart, Instapundit, Twitchy, Ace, and Gamergate involved. At this rate, Finland will have declared war on SJWs by Friday.\nBy the time they do recalibrate their thinking, it will be far too late. It is already too late, which is why I don’t mind spelling it out. As for how I learned to see these things, part of it is a natural propensity for pattern recognition, part of it is playing a lot of wargames like\nAdvanced Squad Leader\n. Nothing teaches harsh lessons in actions and consequences, or demonstrates the importance of accurate information, like wargaming.\nThe most important thing is this: do not underestimate your enemy or ignore his strengths out of a foolish desire to believe yourself his superior. If you want to learn more about this sort of strategic thinking, I very highly recommend reading Martin van Creveld’s\nA History of Strategy: From Sun Tzu to William S. Lind\n, which Castalia House just published last month.\nOf course, sometimes it is very hard to take your enemy seriously when they are dumb enough to do things\nlike post this caption\n:\nAnnie Bellet, one of the writers on the nominees list who was not included in the Sad Puppies or Rabbid Puppies campaign.\n“Goodnight Stars” by Annie Bellet,\nThe Apocalypse Triptych\nin fact appears on both the\nSad Puppies\nand\nRabid Puppies\nlists of recommendations.",
  "tags": [
    "mailvox",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-07T09:39:00+00:00"
}