{
  "url": "https://voxday.net/2015/04/05/mailvox-we-are-lessened/",
  "scraped_at": "2025-12-16T12:51:10.805446",
  "title": "Mailvox: We are lessened",
  "date_display": "April 5, 2015",
  "date_iso": "2015-04-05T17:18:00+00:00",
  "date_from_url": "2015-04-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I just received this news:</p><blockquote class=\"tr_bq\"><p> “Hello everyone, I am Outlaw’s nephew. I hate to be the bearer of bad news but, unfortunately Outlaw passed away last night at around 7:30. Personally, I had no idea my Uncle had this many followers on his blog. He was always a bright person and always had his own unique opinion on any topic. His death was a very tragic loss to our family. I would like to thank all of you for your prayers and support.”</p><p>He’d predicted he wouldn’t live to see Easter.</p><p>I know he’s with our Lord, free of pain, it that doesn’t still my sense of loss.</p></blockquote><p>Outlaw X, aka Equus Pallidus, was one of the original Dread Ilk. He was combative and argumentative and difficult and smart and generous and fiercely loyal. He was an early supporter of my writing; he once bought 10 copies of Summa Elvetica for other Ilk who could not afford them. Longtime Ilk will recall that he could get overheated at times, but he always settled down sooner or later.</p><p>I wish I’d had<br> the chance to tell him about the Hugo wipeout yesterday. If he’d been better, there is no way he wouldn’t have been a part of it. And he was one of the primary reasons the Ilk became known as the Dread Ilk. <a href=\"http://www.milobookclub.com/2006/06/09/pale-horse-tramples-michael-medved/\">His trampling of Michael Medved on Medved’s own show</a> when Medved was waxing outraged in response to one of my WND columns was epic; I can still here him saying “You made that up in your haid” in that strong Texas accent.</br></p><p>Death comes for us all in time, but few of us will be remembered as fondly as Equus Pallidus. Rest in peace, my friend, and give my best regards to Bane when you see him.</p></div>",
  "content_text": "I just received this news:\n“Hello everyone, I am Outlaw’s nephew. I hate to be the bearer of bad news but, unfortunately Outlaw passed away last night at around 7:30. Personally, I had no idea my Uncle had this many followers on his blog. He was always a bright person and always had his own unique opinion on any topic. His death was a very tragic loss to our family. I would like to thank all of you for your prayers and support.”\nHe’d predicted he wouldn’t live to see Easter.\nI know he’s with our Lord, free of pain, it that doesn’t still my sense of loss.\nOutlaw X, aka Equus Pallidus, was one of the original Dread Ilk. He was combative and argumentative and difficult and smart and generous and fiercely loyal. He was an early supporter of my writing; he once bought 10 copies of Summa Elvetica for other Ilk who could not afford them. Longtime Ilk will recall that he could get overheated at times, but he always settled down sooner or later.\nI wish I’d had\nthe chance to tell him about the Hugo wipeout yesterday. If he’d been better, there is no way he wouldn’t have been a part of it. And he was one of the primary reasons the Ilk became known as the Dread Ilk.\nHis trampling of Michael Medved on Medved’s own show\nwhen Medved was waxing outraged in response to one of my WND columns was epic; I can still here him saying “You made that up in your haid” in that strong Texas accent.\nDeath comes for us all in time, but few of us will be remembered as fondly as Equus Pallidus. Rest in peace, my friend, and give my best regards to Bane when you see him.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-05T16:18:00+00:00"
}