{
  "url": "https://voxday.net/2015/04/21/mailvox-racism-lens/",
  "scraped_at": "2025-12-16T12:53:04.760855",
  "title": "Mailvox: the racism lens",
  "date_display": "April 21, 2015",
  "date_iso": "2015-04-21T20:59:00+00:00",
  "date_from_url": "2015-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always fascinating how some people have an amazing ability to detect racism no matter how clearly the absence of racism by literally every definition is explained to them. From a discussion on Eric Flint’s blog:</p><blockquote class=\"tr_bq\"><p> I may as well go all-in here: In comments above Vox Day has repeatedly been called a “racist,” perhaps dozens of times. Have any of you ASKED him what his position is on racial differences? Have any of you READ what he has to say about racial differences? No? Then those of you who call him “racist” are simply a mob. In an attempt to educate, here is what Mr. Day wrote recently in a comment on Brad Torgersen’s blog; it was in response to the following statement by someone else (not Brad): “Vox Day believes that white people and Asians (and clearly Hispanics, since Beale is one, at least in part) are superior to black people, and he believes this inferiority of blacks is innate, genetic.”</p><p>Here is what Mr. Day wrote in response:</p><p>“Correction: I don’t have any reason to believe any one human population sub-group is intrinsically superior to any other population sub-group. That being said, both science and logic quite clearly indicate that no two population sub-groups are identical, and therefore every population sub-group is either superior or inferior to another sub-group on the basis of any chosen metric.<br> “It makes no more difference that you like or dislike this fact than if you disapprove of the speed of light or the rate of Earth gravity.<br> “I assert that an unborn female black child with a missing chromosome and an inclination to homosexuality is equal in human value and human dignity and unalienable, God-given rights to a straight white male in the prime of his life and a +4 SD IQ. How many of my dishonest critics will do the same?<br> “That doesn’t mean that I think it is wise to ask that particular child, when she is grown, to design the next plane on which I intend to fly. Or even to work in the air traffic control tower.<br> “I deal in reality as determined by history, science, and logic. And I care no more about what an equalitarian fantasist thinks about me or anything else than I do about the mentally deranged babbling in the psych ward. The world is as it is, not as we might wish it to be. If you can’t understand that, then I am among the least of your problems.”</br></br></br></br></p><p>So query: Do the above statements validate the multiple assertions above that Mr. Day is a “racist”? (Disclaimer: I’ve never met the man, nor talked to him; I have exchanged perhaps a couple of emails when I challenged a statement he made. But I do despise mindless online mobs screaming “racist!”)<br> Reply</br></p><p>    Gav says:<br>     April 21, 2015 at 10:39 AM</br></p><p>    A moment’s thought shows that his premise is completely ridiculous. Choose people A, B, C such that A &amp; C are from one group and B from another, but A is taller than B is taller than C. So now I’ve got a metric (height) where group 1 is both superior and inferior to group 2 on the height metric. (For a real-life example, choose Robert Wadlow and his father for A &amp; C, and Michael Jordan for B).</p><p>    You have to be not only racist but also stupid to believe that “every population sub-group is either superior or inferior to another sub-group on the basis of any chosen metric.”<br>   <br>         Mike says:<br>         April 21, 2015 at 12:21 PM</br></br></br></p><p>        This is a result of false equivocation between individuals and categories. Yes, the mean of the heights of all adult men if taller than the mean of the heights of all adult women, but that doesn’t mean all men are taller than all women.</p><p>        It ends up being a big problem in the scientific study of people. Some people have political/personal reasons to try to see one group as better than another, while other people have similar reasons to try to see no groups as being any different from each other. Both camps accuse the other side of being unscientific and ignoring the data.</p><p>        Really there is no conflict between the idea that one group may, on average, have a measurable difference than another group, and also the idea that the variance of individuals withing the groups may be much larger than the difference between the groups. But due to confirmation bias, people tend to ignore whatever part of that equation it is convenient for them to ignore.<br>         Reply<br>             Eric Flint says:<br>             April 21, 2015 at 12:33 PM</br></br></br></p><p>            The problem goes deeper than that, because there’s an intrinsic bias in the categories someone chooses in the first place. For instance, if you choose to compare “the race of whites” to “the race of blacks” you are assuming not only that such races exist but that they are the proper basis for comparison. But why should that be true? Due to the way the human race evolved, there is more genetic variation among Africans than there is between any given group of Africans and any non-African segment of humanity. The reason people think all Africans belong to the same “race” is because they share certain literally superficial features: skin color, hair and some facial features. But why should those criteria be used as the basis to define a “race” in the first place? Why not, for instance, choose the average distribution of blood types? In which case you wind up with a “racial map” of humanity that is completely different from a “racial map” drawn according to skin color, hair and facial features.</p><p>            My point is that there is an inherent bias in the way the question is posed in the first place, which makes any answer to the question automatically questionable. What defines a “racist” in the first place, intellectually speaking, is the firm conviction that “races” as defined sociologically have an actual biological reality which is more basic than any other possible differentiation. For which there is not a shred of actual evidence. It is a faith-based conviction. That’s a polite say of saying it’s just bigotry.<br>             Reply<br>                 Mike says:<br>                 April 21, 2015 at 1:59 PM</br></br></br></p><p>                Yes, I agree. There very definitely are biological races, if you define that as subsets of the overall human gene pool where certain collections of genes are much more prevalent than they are in the general population. But there is so much nonsense and xenophobia and misunderstanding involved that it’s a real nightmare to try to approach these questions without stepping on any land mines.</p><p>                I recommend a really interesting book called “The Sports Gene” that gives some great examples of how this can be done properly (IMO), and also some examples of where it has been done very much improperly.<br>                 Reply<br>                     335522 says:<br>                     April 21, 2015 at 2:13 PM</br></br></br></p><p>                    With all due respect to all of you, I believe you’re missing the point. Please read the third paragraph by Vox Day that begins “I assert that an unborn female black child….” And then answer the question that I posed at the end, please (it being notable that not one of the responses addresses it).</p></blockquote><p>The following quote from that exchange is an astonishing assertion that clearly demonstrates both the intellectual inferiority as well as the logical incapacity of the SJWs:</p><p><i>“You have to be not only racist but also stupid to believe that “every population sub-group is either superior or inferior to another sub-group on the basis of any chosen metric.”</i></p><p>Quite to the contrary, you have to be utterly stupid and wholly irrational to deny that assertion, or else possess hitherto-unknown evidence demonstrating that every human population sub-group is absolutely and entirely equal across the board. Every single group has an average, a mean, and a median, regardless of the metric chosen. None of those three statistics are likely to be precisely equal to the average, the mean, and the media of any other group.</p><p>At no point have I EVER claimed, suggested, implied, hinted, or intimated that EVERY SINGLE MEMBER of one human population group is superior to EVERY SINGLE MEMBER of another one. And anyone who claims that I ever have is either lying or simply too dim to bother even attempting to talk down to.</p><p>The idea that “races” don’t exist is simply antiscientific dogma. They might as well deny that “species” and “groups” exist while they’re at it.</p></div>",
  "content_text": "It’s always fascinating how some people have an amazing ability to detect racism no matter how clearly the absence of racism by literally every definition is explained to them. From a discussion on Eric Flint’s blog:\nI may as well go all-in here: In comments above Vox Day has repeatedly been called a “racist,” perhaps dozens of times. Have any of you ASKED him what his position is on racial differences? Have any of you READ what he has to say about racial differences? No? Then those of you who call him “racist” are simply a mob. In an attempt to educate, here is what Mr. Day wrote recently in a comment on Brad Torgersen’s blog; it was in response to the following statement by someone else (not Brad): “Vox Day believes that white people and Asians (and clearly Hispanics, since Beale is one, at least in part) are superior to black people, and he believes this inferiority of blacks is innate, genetic.”\nHere is what Mr. Day wrote in response:\n“Correction: I don’t have any reason to believe any one human population sub-group is intrinsically superior to any other population sub-group. That being said, both science and logic quite clearly indicate that no two population sub-groups are identical, and therefore every population sub-group is either superior or inferior to another sub-group on the basis of any chosen metric.\n“It makes no more difference that you like or dislike this fact than if you disapprove of the speed of light or the rate of Earth gravity.\n“I assert that an unborn female black child with a missing chromosome and an inclination to homosexuality is equal in human value and human dignity and unalienable, God-given rights to a straight white male in the prime of his life and a +4 SD IQ. How many of my dishonest critics will do the same?\n“That doesn’t mean that I think it is wise to ask that particular child, when she is grown, to design the next plane on which I intend to fly. Or even to work in the air traffic control tower.\n“I deal in reality as determined by history, science, and logic. And I care no more about what an equalitarian fantasist thinks about me or anything else than I do about the mentally deranged babbling in the psych ward. The world is as it is, not as we might wish it to be. If you can’t understand that, then I am among the least of your problems.”\nSo query: Do the above statements validate the multiple assertions above that Mr. Day is a “racist”? (Disclaimer: I’ve never met the man, nor talked to him; I have exchanged perhaps a couple of emails when I challenged a statement he made. But I do despise mindless online mobs screaming “racist!”)\nReply\nGav says:\nApril 21, 2015 at 10:39 AM\nA moment’s thought shows that his premise is completely ridiculous. Choose people A, B, C such that A & C are from one group and B from another, but A is taller than B is taller than C. So now I’ve got a metric (height) where group 1 is both superior and inferior to group 2 on the height metric. (For a real-life example, choose Robert Wadlow and his father for A & C, and Michael Jordan for B).\nYou have to be not only racist but also stupid to believe that “every population sub-group is either superior or inferior to another sub-group on the basis of any chosen metric.”\nMike says:\nApril 21, 2015 at 12:21 PM\nThis is a result of false equivocation between individuals and categories. Yes, the mean of the heights of all adult men if taller than the mean of the heights of all adult women, but that doesn’t mean all men are taller than all women.\nIt ends up being a big problem in the scientific study of people. Some people have political/personal reasons to try to see one group as better than another, while other people have similar reasons to try to see no groups as being any different from each other. Both camps accuse the other side of being unscientific and ignoring the data.\nReally there is no conflict between the idea that one group may, on average, have a measurable difference than another group, and also the idea that the variance of individuals withing the groups may be much larger than the difference between the groups. But due to confirmation bias, people tend to ignore whatever part of that equation it is convenient for them to ignore.\nReply\nEric Flint says:\nApril 21, 2015 at 12:33 PM\nThe problem goes deeper than that, because there’s an intrinsic bias in the categories someone chooses in the first place. For instance, if you choose to compare “the race of whites” to “the race of blacks” you are assuming not only that such races exist but that they are the proper basis for comparison. But why should that be true? Due to the way the human race evolved, there is more genetic variation among Africans than there is between any given group of Africans and any non-African segment of humanity. The reason people think all Africans belong to the same “race” is because they share certain literally superficial features: skin color, hair and some facial features. But why should those criteria be used as the basis to define a “race” in the first place? Why not, for instance, choose the average distribution of blood types? In which case you wind up with a “racial map” of humanity that is completely different from a “racial map” drawn according to skin color, hair and facial features.\nMy point is that there is an inherent bias in the way the question is posed in the first place, which makes any answer to the question automatically questionable. What defines a “racist” in the first place, intellectually speaking, is the firm conviction that “races” as defined sociologically have an actual biological reality which is more basic than any other possible differentiation. For which there is not a shred of actual evidence. It is a faith-based conviction. That’s a polite say of saying it’s just bigotry.\nReply\nMike says:\nApril 21, 2015 at 1:59 PM\nYes, I agree. There very definitely are biological races, if you define that as subsets of the overall human gene pool where certain collections of genes are much more prevalent than they are in the general population. But there is so much nonsense and xenophobia and misunderstanding involved that it’s a real nightmare to try to approach these questions without stepping on any land mines.\nI recommend a really interesting book called “The Sports Gene” that gives some great examples of how this can be done properly (IMO), and also some examples of where it has been done very much improperly.\nReply\n335522 says:\nApril 21, 2015 at 2:13 PM\nWith all due respect to all of you, I believe you’re missing the point. Please read the third paragraph by Vox Day that begins “I assert that an unborn female black child….” And then answer the question that I posed at the end, please (it being notable that not one of the responses addresses it).\nThe following quote from that exchange is an astonishing assertion that clearly demonstrates both the intellectual inferiority as well as the logical incapacity of the SJWs:\n“You have to be not only racist but also stupid to believe that “every population sub-group is either superior or inferior to another sub-group on the basis of any chosen metric.”\nQuite to the contrary, you have to be utterly stupid and wholly irrational to deny that assertion, or else possess hitherto-unknown evidence demonstrating that every human population sub-group is absolutely and entirely equal across the board. Every single group has an average, a mean, and a median, regardless of the metric chosen. None of those three statistics are likely to be precisely equal to the average, the mean, and the media of any other group.\nAt no point have I EVER claimed, suggested, implied, hinted, or intimated that EVERY SINGLE MEMBER of one human population group is superior to EVERY SINGLE MEMBER of another one. And anyone who claims that I ever have is either lying or simply too dim to bother even attempting to talk down to.\nThe idea that “races” don’t exist is simply antiscientific dogma. They might as well deny that “species” and “groups” exist while they’re at it.",
  "tags": [
    "mailvox",
    "philosophy",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-21T19:59:00+00:00"
}