{
  "url": "https://voxday.net/2015/04/21/meta-swatting/",
  "scraped_at": "2025-12-16T12:53:03.294147",
  "title": "Meta-SWATTing",
  "date_display": "April 21, 2015",
  "date_iso": "2015-04-21T13:00:00+00:00",
  "date_from_url": "2015-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Patterico <a href=\"http://patterico.com/2015/04/20/state-sponsored-swattings-in-wisconsin-courtesy-of-john-doe-investigations/\">has the details</a>:</p><blockquote><p> This is one of the creepiest articles I have ever read. It reminds me of my experience being SWATted — having armed police rush into my home in what looked like retaliation for my speech. Yet in the case described in the article, the SWATting is actually being carried out . . . by the government.<br> In Wisconsin, citizens had cops bust into their homes with battering rams. Property was taken from their homes, in full view of the neighbors — and in some cases officers mocked them. Then the citizens were told that they could tell nobody about what had happened. If they did, they could go to jail.<br> All for exercising their First Amendment rights. Essentially, for being conservatives.</br></br></p></blockquote><p>This should be kept in mind by anyone who still thinks going along to get along is still an option.  The Statists are as insistent in their demand for submission as those who named their religion after the concept.</p></div>",
  "content_text": "Patterico\nhas the details\n:\nThis is one of the creepiest articles I have ever read. It reminds me of my experience being SWATted — having armed police rush into my home in what looked like retaliation for my speech. Yet in the case described in the article, the SWATting is actually being carried out . . . by the government.\nIn Wisconsin, citizens had cops bust into their homes with battering rams. Property was taken from their homes, in full view of the neighbors — and in some cases officers mocked them. Then the citizens were told that they could tell nobody about what had happened. If they did, they could go to jail.\nAll for exercising their First Amendment rights. Essentially, for being conservatives.\nThis should be kept in mind by anyone who still thinks going along to get along is still an option.  The Statists are as insistent in their demand for submission as those who named their religion after the concept.",
  "tags": [
    "decline and fall",
    "NWA was right"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-21T12:00:00+00:00"
}