{
  "url": "https://voxday.net/2015/04/30/moderates-gonna-moderate/",
  "scraped_at": "2025-12-16T12:54:05.382007",
  "title": "Moderates gonna moderate",
  "date_display": "April 30, 2015",
  "date_iso": "2015-04-30T13:24:00+00:00",
  "date_from_url": "2015-04-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You can always trust a right-wing moderate <a href=\"http://pjmedia.com/blog/hurricane-hugos/?singlepage=true\">to shoot at a potential ally</a>:</p><blockquote class=\"tr_bq\"><p> Starting three years ago, Larry Correia, successful science fiction<br> writer, decided to test his suspicion that the Hugo Awards of the World<br> Science Fiction Society were increasingly being awarded through the<br> action of a small group, and increasingly reflect the tastes of that<br> small group rather than a more general population of science fiction<br> readers.</br></br></br></br></br></p><p>There were many ideas what the reason could be: a desire by the<br> active voters to reward more “literary” work. An ideological bias toward<br> “liberal” writers and themes — which seemed to be more plausible after<br> attacks on more “conservative” writers like Correia, attacks on the<br> movie <i>Ender’s Game</i> because the author of the original novel,<br> Orson Scott Card, is opposed to same-sex marriage, and the expulsion of<br> Vox Day from the Science Fiction and Fantasy Writers of America,<br> arguably in violation of their own bylaws, for having offensive views on<br> race and sexual roles.</br></br></br></br></br></br></br></br></p><p>(Just for full disclosure: Scott Card has been a personal friend for<br> something like 30 years, and along with Ray Bradbury was the first to<br> suggest maybe I actually could do this writing thing. Sarah Hoyt, who is<br> also involved in Sad Puppies, is a close friend and as most PJ Media<br> readers know, my partner in the Book Plug Friday column. Larry Correia<br> is a Facebook friend who I’ve never met personally. And I think Vox Day<br> is an obnoxious and unlikeable dolt, <a href=\"http://pjmedia.com/lifestyle/2014/04/07/the-meaning-of-eich/\">as I’ve said in these pages in the past</a>.)</br></br></br></br></br></br></p><p>Over the years, I’ve observed two things about people. First, people <i>always</i><br> do what they find most rewarding; and second, every human institution<br> optimizes its behavior to maximize rewards — and while money isn’t<br> everything, when you’re looking for what’s rewarding it’s the way to<br> bet. Who stands to get a <i>monetary</i> benefit from the direction the Hugo awards have taken?</br></br></br></br></p><p>Now, at that point, we have to go back and reference something Vox<br> Day — who, let me remind you, I think is an obnoxious and unlikable dolt<br> — <a href=\"http://www.milobookclub.com/2015/04/06/on-bloc-voting/\">published</a>.<br> If we look back at the last several years, there is a surprising<br> regularity to be seen: the same people are nominated over and over again<br> for several of the down-list awards, like Best Editor; those people are<br> all associated more or less closely with one publisher, Tor Books; and<br> much of the most vehement objection has been from authors and others<br> directly connected to Tor Books. The number of votes that decide the<br> election is very small — tens of votes.</br></br></br></br></br></br></br></br></br></p></blockquote><p>Wait, Charlie, I’m not entirely sure on your position on Vox Day. Could you repeat it?</p><p>Translation: I DISAVOW VOX DAY, I DISAVOW AND DENOUNCE VOX DAY, I DISAVOWANDDENOUNCEANDDONOTLIKEVOXDAY! (please, for the love of all that is good and holy, don’t hit me!)</p><p>They do not like me, wet or dry<br> They do not like me, low or high<br> They do not like me, dry or wet<br> Because they are so moderate</br></br></br></p><p>They do not like me here or there<br> They do not like me anywhere<br> They do not like me on the Net<br> Because they are so moderate</br></br></br></p><p>If only I would be more nice<br> And pour out sugar in place of spice<br> Then it would all be duly meet<br> We’d march off to our brave defeat</br></br></br></p><p>They do not like me when we win<br> They do not like me for my sin<br> They do not like me as a threat<br> Because they are so moderate</br></br></br></p><p>Say this for Charlie, at least he’s not afraid to go show:</p><blockquote class=\"tr_bq\"><p> William Strunk, Jr. ‏@cdrusnret<br> you say you referred to @voxday as a dolt in the past, but your link doesn’t appear germane?</br></p><p>Vox Day ‏@voxday<br> That’s just his way of putting up his hands and saying “please don’t hit me!”</br></p><p>Charlie Martin ‏@chasrmarti<br> Vox, let’s just cut to the chase. You wave your hands and scream, I say “fuck off”, we go on with our day.</br></p><p>Vox Day ‏@voxday<br>Maybe if you just denounce me once more, the SJWs will finally love you for who you are, White Buddha.</br></p></blockquote></div>",
  "content_text": "You can always trust a right-wing moderate\nto shoot at a potential ally\n:\nStarting three years ago, Larry Correia, successful science fiction\nwriter, decided to test his suspicion that the Hugo Awards of the World\nScience Fiction Society were increasingly being awarded through the\naction of a small group, and increasingly reflect the tastes of that\nsmall group rather than a more general population of science fiction\nreaders.\nThere were many ideas what the reason could be: a desire by the\nactive voters to reward more “literary” work. An ideological bias toward\n“liberal” writers and themes — which seemed to be more plausible after\nattacks on more “conservative” writers like Correia, attacks on the\nmovie\nEnder’s Game\nbecause the author of the original novel,\nOrson Scott Card, is opposed to same-sex marriage, and the expulsion of\nVox Day from the Science Fiction and Fantasy Writers of America,\narguably in violation of their own bylaws, for having offensive views on\nrace and sexual roles.\n(Just for full disclosure: Scott Card has been a personal friend for\nsomething like 30 years, and along with Ray Bradbury was the first to\nsuggest maybe I actually could do this writing thing. Sarah Hoyt, who is\nalso involved in Sad Puppies, is a close friend and as most PJ Media\nreaders know, my partner in the Book Plug Friday column. Larry Correia\nis a Facebook friend who I’ve never met personally. And I think Vox Day\nis an obnoxious and unlikeable dolt,\nas I’ve said in these pages in the past\n.)\nOver the years, I’ve observed two things about people. First, people\nalways\ndo what they find most rewarding; and second, every human institution\noptimizes its behavior to maximize rewards — and while money isn’t\neverything, when you’re looking for what’s rewarding it’s the way to\nbet. Who stands to get a\nmonetary\nbenefit from the direction the Hugo awards have taken?\nNow, at that point, we have to go back and reference something Vox\nDay — who, let me remind you, I think is an obnoxious and unlikable dolt\n—\npublished\n.\nIf we look back at the last several years, there is a surprising\nregularity to be seen: the same people are nominated over and over again\nfor several of the down-list awards, like Best Editor; those people are\nall associated more or less closely with one publisher, Tor Books; and\nmuch of the most vehement objection has been from authors and others\ndirectly connected to Tor Books. The number of votes that decide the\nelection is very small — tens of votes.\nWait, Charlie, I’m not entirely sure on your position on Vox Day. Could you repeat it?\nTranslation: I DISAVOW VOX DAY, I DISAVOW AND DENOUNCE VOX DAY, I DISAVOWANDDENOUNCEANDDONOTLIKEVOXDAY! (please, for the love of all that is good and holy, don’t hit me!)\nThey do not like me, wet or dry\nThey do not like me, low or high\nThey do not like me, dry or wet\nBecause they are so moderate\nThey do not like me here or there\nThey do not like me anywhere\nThey do not like me on the Net\nBecause they are so moderate\nIf only I would be more nice\nAnd pour out sugar in place of spice\nThen it would all be duly meet\nWe’d march off to our brave defeat\nThey do not like me when we win\nThey do not like me for my sin\nThey do not like me as a threat\nBecause they are so moderate\nSay this for Charlie, at least he’s not afraid to go show:\nWilliam Strunk, Jr. ‏@cdrusnret\nyou say you referred to @voxday as a dolt in the past, but your link doesn’t appear germane?\nVox Day ‏@voxday\nThat’s just his way of putting up his hands and saying “please don’t hit me!”\nCharlie Martin ‏@chasrmarti\nVox, let’s just cut to the chase. You wave your hands and scream, I say “fuck off”, we go on with our day.\nVox Day ‏@voxday\nMaybe if you just denounce me once more, the SJWs will finally love you for who you are, White Buddha.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-30T12:24:00+00:00"
}