{
  "url": "https://voxday.net/2015/04/09/objectively-superior/",
  "scraped_at": "2025-12-16T12:51:42.540356",
  "title": "Objectively superior",
  "date_display": "April 9, 2015",
  "date_iso": "2015-04-09T19:34:00+00:00",
  "date_from_url": "2015-04-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At <a href=\"http://file770.com/?p=21780&amp;cpage=1#comment-250201\">File 770, David W. raises the point</a> about the need for Sad Puppies to make the case that the works they have nominated are meritorious beyond the fact that many of them have sold rather well.</p><blockquote class=\"tr_bq\"><p> Hugo awards aren’t intended to recognize the skiffy equivalent of<br> Kraft Mac &amp; Cheese dinners.  They’re intended to recognize works<br> that are distinctive, not derivative, in the genre, and frankly we’re<br> lucky if 10% of what’s written rises above the level of mediocrity. So the SP’s need to base their claim for Hugo recognition on<br> something other than sales, such as, “what’s amazing and wonderful about<br> this story” and “what new and interesting thing has someone done with<br> science fiction lately”.  Not “my story outsold yours, neener, neener,<br> neener”.</br></br></br></br></br></br></br></p></blockquote><p>Actually, we can do considerably better than appeal to subjective superlatives too. We can objectively prove the superiority of both the Sad Puppies and Rabid Puppies recommendations, as well as the 2015 shortlist, to the previous five Best Novel classes.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2015/04/Hugo_2010-2105.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/04/Hugo_2010-2105.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2015/04/Hugo_2010-2105.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p> What year looks more like one representative of a true Best Novel class to you? While the averages are set, the winner in 2015 could actually be as high as Jim Butcher’s 4.8-rated <i>Skin Game</i>, but the lowest ranking book nominated this year, Ann Leckie’s <i>Ancillary Sword</i>, is still rated higher than any recent winner except for her own <i>Ancillary Justice</i>. In short fiction, consider the Amazon ratings and number of reviews for two of the Novella nominees in comparison with last year’s winners of the Novella and Novelette categories.</p><p>4.6 (63) One Bright Star to Guide Them (2015 finalist)<br> 4.3 (121) Big Boys Don’t Cry (2015 finalist)<br> 4.4 (48) Lady Astronaut of Mars (2014 winner)<br> 4.3 (152) Equoid (2014 winner)</br></br></br></p><p>The Sad Puppy nominees are objectively superior as rated by Amazon. They are, in fact, superior across the board in comparison with recent years. We are raising the bar, not lowering it.</p><p>At the Castalia House blog, Daniel has done some more research in this regard <a href=\"http://www.castaliahouse.com/2015-hugo-award-nominees-break-records/\">going back to 1986</a>.</p></div>",
  "content_text": "At\nFile 770, David W. raises the point\nabout the need for Sad Puppies to make the case that the works they have nominated are meritorious beyond the fact that many of them have sold rather well.\nHugo awards aren’t intended to recognize the skiffy equivalent of\nKraft Mac & Cheese dinners.  They’re intended to recognize works\nthat are distinctive, not derivative, in the genre, and frankly we’re\nlucky if 10% of what’s written rises above the level of mediocrity. So the SP’s need to base their claim for Hugo recognition on\nsomething other than sales, such as, “what’s amazing and wonderful about\nthis story” and “what new and interesting thing has someone done with\nscience fiction lately”.  Not “my story outsold yours, neener, neener,\nneener”.\nActually, we can do considerably better than appeal to subjective superlatives too. We can objectively prove the superiority of both the Sad Puppies and Rabid Puppies recommendations, as well as the 2015 shortlist, to the previous five Best Novel classes.\nWhat year looks more like one representative of a true Best Novel class to you? While the averages are set, the winner in 2015 could actually be as high as Jim Butcher’s 4.8-rated\nSkin Game\n, but the lowest ranking book nominated this year, Ann Leckie’s\nAncillary Sword\n, is still rated higher than any recent winner except for her own\nAncillary Justice\n. In short fiction, consider the Amazon ratings and number of reviews for two of the Novella nominees in comparison with last year’s winners of the Novella and Novelette categories.\n4.6 (63) One Bright Star to Guide Them (2015 finalist)\n4.3 (121) Big Boys Don’t Cry (2015 finalist)\n4.4 (48) Lady Astronaut of Mars (2014 winner)\n4.3 (152) Equoid (2014 winner)\nThe Sad Puppy nominees are objectively superior as rated by Amazon. They are, in fact, superior across the board in comparison with recent years. We are raising the bar, not lowering it.\nAt the Castalia House blog, Daniel has done some more research in this regard\ngoing back to 1986\n.",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-09T18:34:00+00:00"
}