{
  "url": "https://voxday.net/2015/04/06/on-bloc-voting/",
  "scraped_at": "2025-12-16T12:51:16.353494",
  "title": "On bloc voting",
  "date_display": "April 6, 2015",
  "date_iso": "2015-04-06T12:16:00+00:00",
  "date_from_url": "2015-04-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First, I was pleased to see that Black Gate accepted their well-deserved and long-overdue Hugo nomination. John O’Neill, who is one of the fairest and most decent individuals on either side of the ideological aisle, <a href=\"http://www.blackgate.com/2015/04/05/black-gate-nominated-for-a-hugo-award-in-a-terrible-ballot/\">explained why</a>:</p><p>“Since the <i><b>Black Gate</b></i> nomination was for the<br> entire site (which is run by a group of nearly 40 volunteers, many of<br> whom are thrilled by the nomination), we did not decline. That’s a<br> choice that will doubtless expose us to some (perhaps deserved)<br> criticism.”</br></br></br></br></p><p>John believes SP/RP was “a Spectacularly Bad Idea” and that “There will be a response, and it won’t be pretty.” Of course, we’re already seeing how unpretty that response can be.</p><p><i>“I consider Vox Day one step, either direction, from certifiable.” </i>– Mike Resnick</p><p><i>“Fuck John C. Wright, that cretinous neckbeard, and fuck Vox Day, that pathetic human garbage bin.”</i> – a commenter at Charles Stross’s site</p><p><i>“I cannot abide Vox Day, and I’d drop a planet on his house if I<br> could. Man’s a misogynistic pig, and that’s an insult to swine.”</br></i> – Michael Harper</p><p>And the latter comment is coming from someone who has REJECTED the Mutually Assured Destruction option being recommended by many, including John O’Neill himself. However much I like John and respect his opinion, I would be remiss if I did not point out there are two serious problems with it:</p><ol><li>It is logically incoherent to assert that we are wreckers and indifferent to the long-term fate of the Hugo Awards and to simultaneously threaten MAD. If anyone believes that it is our goal to destroy the awards, they should be begging Sad Puppies to not vote No Award for everything and promising to cast their own votes for everything on the merits. In 2008, there were 483 valid nominating ballots. In 2015, when SP/RP dominated, there were 2,122. It should be readily apparent that anything they can do, we can do bigger, better, and longer. Yes, the other side can bring more in the future. So can we. If they want a showdown, we’ll be there.</li><li>Contra John’s belief, I’m <i>not </i>crazy, he <i>is </i>completely wrong, and there <i>IS </i>a bloc operating in secret. Several blocs, as a matter of fact, and a fair number of people have known about them for a long time.</li></ol><p><i>You might be surprised how long small block voting has been going<br> on in Hugo nominations. In fact, I was having a conversation with a<br> former Hugo administrator about it last night. The thing is, it’s usually only in a category or two, and usually<br> either not enough to add a single nominated work, or just enough to add a<br> single nominated work.</br></br></br></br></i><br> – Deidre Saoirse Moen, April 5, 2015</br></p><p>I do not believe that there was ever a deliberate conspiracy to fill all<br> the slots in every category with a dedicated “slate” of works. There<br> clearly have been campaigns to get <i>individual works</i> on the ballot, some of them going beyond the technically legal.<br> – Kevin Standlee, <a href=\"http://file770.com/?p=21617&amp;cpage=3#comment-249412\">April 2, 2015</a></br></br></br></p><p>Here is one apparent example. Consider the following vote totals in Best Editor from 2007 to 2013:</p><p><u>2007</u><br> 88 David G. Hartwell (Tor)<br> 80 Patrick Nielsen Hayden (Tor)</br></br></p><p>The next three nominees received between 43 and 28 votes.</p><p><u>2008</u><br> 70 Patrick Nielsen Hayden (Tor)<br> 67 David G. Hartwell (Tor)</br></br></p><p>The next three nominees received between 18 to 51 votes.</p><p><u>2009</u><br> 87 David G. Hartwell (Tor)<br> 76 Patrick Nielsen Hayden (Tor)</br></br></p><p>The other three nominees received 92, 34, and 34 votes.</p><p><u>2010</u><br> 54 Patrick Nielsen Hayden (Tor)<br> 47 <strike>David G. Hartwell (Tor)</strike></br></br></p><p>The other three nominees received 99, 61, and 42 votes. Strikethrough indicates that the nomination was declined. As you can see, not everyone gets the message right away.</p><p><u>2011</u><br> 44  <strike>David G. Hartwell (Tor)</strike><br> 31 <strike>Patrick Nielsen Hayden (Tor)</strike></br></br></p><p>The other three nominees received 96, 54, and 23 votes </p><p>Either PNH or Hartwell won the Best Editor Long award every year from 2007 through 2010, with two apiece. Lou Anders of Pyr finished second on the shortlist every year from 2007 through 2013, except for the year he won, in 2011. Now, what is interesting to observe is that in 2007-2008, Anders only had 43 and 51 votes. Anders responded with an effective nomination campaign and came back the next three years with a bloc vote ranging from 92 to 96 votes, finally culminating in a shortlist win in 2011, the year that PNH followed Hartwell’s lead in declining the nomination.</p><p>PNH was back in the game the next year, although it looks like he threw his support to Betsy Wolheim of DAW who received 67 nominating votes and won the Best Editor Long award <a href=\"http://blog.patrickrothfuss.com/2012/07/why-i-love-my-editor/\">despite never receiving a single nominating vote</a> in 30 previous years and promptly falling off the shortlist the following year, when PNH won again. Two years after winning, Wolheim was back to receiving no nominating votes at all. Sheer coincidence, no doubt. Note that Wolheim is Patrick Rothfuss’s editor, and Rothfuss is an ally of the Scalzi/Stross bloc vote.</p><p>And what ho? That year that Wolheim inexplicably received Tor-level nominating votes and won, what do we see in Best Novel, but:</p><p>49 <i>The Wise Man’s Fear</i> by Patrick Rothfuss<br> 48 <i>Fuzzy Nation</i> by John Scalzi</br></p><p>Pure coincidence and fanly enthusiasm again, right? Unless you have a two-digit IQ, what you can see here is not only bloc votes of the sort that Standlee and Moen are describing, but <i>competing </i>bloc votes. Anders was able to build a bigger supporting bloc vote at the nominating stage, but he was always beaten out by Tor’s larger non-bloc shortlist voters until the Tor crew eased up and let him win one by stepping aside. Then they threw a bone to Wolheim before resuming business as usual.</p><p>And then Sad Puppies entered the picture….</p><p>Anyhow, <a href=\"http://www.blackgate.com/2015/04/05/black-gate-nominated-for-a-hugo-award-in-a-terrible-ballot/#comment-96385\">as I told everyone at Black Gate</a>, there is one, and only one, reason that I recommended their nomination. I recommended a Hugo nomination for Black Gate and for Matthew David<br> Surridge for one very simple reason; they are both among the best in<br> their categories in the SF/F field. No more, no less. And both deserved Hugos<br> years ago.</br></br></br></p><p>“The key to strategy… is not to choose a path to victory, but to choose so that all paths lead to a victory.”<br>     —<i>The Vor Game </i></br></p></div>",
  "content_text": "First, I was pleased to see that Black Gate accepted their well-deserved and long-overdue Hugo nomination. John O’Neill, who is one of the fairest and most decent individuals on either side of the ideological aisle,\nexplained why\n:\n“Since the\nBlack Gate\nnomination was for the\nentire site (which is run by a group of nearly 40 volunteers, many of\nwhom are thrilled by the nomination), we did not decline. That’s a\nchoice that will doubtless expose us to some (perhaps deserved)\ncriticism.”\nJohn believes SP/RP was “a Spectacularly Bad Idea” and that “There will be a response, and it won’t be pretty.” Of course, we’re already seeing how unpretty that response can be.\n“I consider Vox Day one step, either direction, from certifiable.”\n– Mike Resnick\n“Fuck John C. Wright, that cretinous neckbeard, and fuck Vox Day, that pathetic human garbage bin.”\n– a commenter at Charles Stross’s site\n“I cannot abide Vox Day, and I’d drop a planet on his house if I\ncould. Man’s a misogynistic pig, and that’s an insult to swine.”\n– Michael Harper\nAnd the latter comment is coming from someone who has REJECTED the Mutually Assured Destruction option being recommended by many, including John O’Neill himself. However much I like John and respect his opinion, I would be remiss if I did not point out there are two serious problems with it:\nIt is logically incoherent to assert that we are wreckers and indifferent to the long-term fate of the Hugo Awards and to simultaneously threaten MAD. If anyone believes that it is our goal to destroy the awards, they should be begging Sad Puppies to not vote No Award for everything and promising to cast their own votes for everything on the merits. In 2008, there were 483 valid nominating ballots. In 2015, when SP/RP dominated, there were 2,122. It should be readily apparent that anything they can do, we can do bigger, better, and longer. Yes, the other side can bring more in the future. So can we. If they want a showdown, we’ll be there.\nContra John’s belief, I’m\nnot\ncrazy, he\nis\ncompletely wrong, and there\nIS\na bloc operating in secret. Several blocs, as a matter of fact, and a fair number of people have known about them for a long time.\nYou might be surprised how long small block voting has been going\non in Hugo nominations. In fact, I was having a conversation with a\nformer Hugo administrator about it last night. The thing is, it’s usually only in a category or two, and usually\neither not enough to add a single nominated work, or just enough to add a\nsingle nominated work.\n– Deidre Saoirse Moen, April 5, 2015\nI do not believe that there was ever a deliberate conspiracy to fill all\nthe slots in every category with a dedicated “slate” of works. There\nclearly have been campaigns to get\nindividual works\non the ballot, some of them going beyond the technically legal.\n– Kevin Standlee,\nApril 2, 2015\nHere is one apparent example. Consider the following vote totals in Best Editor from 2007 to 2013:\n2007\n88 David G. Hartwell (Tor)\n80 Patrick Nielsen Hayden (Tor)\nThe next three nominees received between 43 and 28 votes.\n2008\n70 Patrick Nielsen Hayden (Tor)\n67 David G. Hartwell (Tor)\nThe next three nominees received between 18 to 51 votes.\n2009\n87 David G. Hartwell (Tor)\n76 Patrick Nielsen Hayden (Tor)\nThe other three nominees received 92, 34, and 34 votes.\n2010\n54 Patrick Nielsen Hayden (Tor)\n47\nDavid G. Hartwell (Tor)\nThe other three nominees received 99, 61, and 42 votes. Strikethrough indicates that the nomination was declined. As you can see, not everyone gets the message right away.\n2011\n44\nDavid G. Hartwell (Tor)\n31\nPatrick Nielsen Hayden (Tor)\nThe other three nominees received 96, 54, and 23 votes\nEither PNH or Hartwell won the Best Editor Long award every year from 2007 through 2010, with two apiece. Lou Anders of Pyr finished second on the shortlist every year from 2007 through 2013, except for the year he won, in 2011. Now, what is interesting to observe is that in 2007-2008, Anders only had 43 and 51 votes. Anders responded with an effective nomination campaign and came back the next three years with a bloc vote ranging from 92 to 96 votes, finally culminating in a shortlist win in 2011, the year that PNH followed Hartwell’s lead in declining the nomination.\nPNH was back in the game the next year, although it looks like he threw his support to Betsy Wolheim of DAW who received 67 nominating votes and won the Best Editor Long award\ndespite never receiving a single nominating vote\nin 30 previous years and promptly falling off the shortlist the following year, when PNH won again. Two years after winning, Wolheim was back to receiving no nominating votes at all. Sheer coincidence, no doubt. Note that Wolheim is Patrick Rothfuss’s editor, and Rothfuss is an ally of the Scalzi/Stross bloc vote.\nAnd what ho? That year that Wolheim inexplicably received Tor-level nominating votes and won, what do we see in Best Novel, but:\n49\nThe Wise Man’s Fear\nby Patrick Rothfuss\n48\nFuzzy Nation\nby John Scalzi\nPure coincidence and fanly enthusiasm again, right? Unless you have a two-digit IQ, what you can see here is not only bloc votes of the sort that Standlee and Moen are describing, but\ncompeting\nbloc votes. Anders was able to build a bigger supporting bloc vote at the nominating stage, but he was always beaten out by Tor’s larger non-bloc shortlist voters until the Tor crew eased up and let him win one by stepping aside. Then they threw a bone to Wolheim before resuming business as usual.\nAnd then Sad Puppies entered the picture….\nAnyhow,\nas I told everyone at Black Gate\n, there is one, and only one, reason that I recommended their nomination. I recommended a Hugo nomination for Black Gate and for Matthew David\nSurridge for one very simple reason; they are both among the best in\ntheir categories in the SF/F field. No more, no less. And both deserved Hugos\nyears ago.\n“The key to strategy… is not to choose a path to victory, but to choose so that all paths lead to a victory.”\n—\nThe Vor Game",
  "tags": [
    "Black Gate",
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-06T11:16:00+00:00"
}