{
  "url": "https://voxday.net/2015/04/10/perspective/",
  "scraped_at": "2025-12-16T12:51:48.040901",
  "title": "Perspective",
  "date_display": "April 10, 2015",
  "date_iso": "2015-04-10T16:00:00+00:00",
  "date_from_url": "2015-04-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2015/04/Hugo_perspective.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"175\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/04/Hugo_perspective.jpg\" width=\"640\"/></a></div><p> One thing I thought particularly worthy of note is what a small proportion of #GamerGate tweets are in response to the Hugo Awards. And notice that they didn’t move up until several days after the initial #SadPuppies spike.</p><p>That’s what I find so amusing about the SJW panic about those they call “thugs” in their midst. Not even a tenth of #GamerGate is paying any attention at all to the Hugo Awards yet, and that’s already enough to send them shrieking and running. This is still a period of calm as far as GG is concerned.</p><p>But if the SJWs want to be sure to grab #GamerGate’s attention, I suppose a coordinated media blitz full of ludicrous lies about people are an effective way to do it. It certainly isn’t anything we haven’t seen before.</p><p>I do have to give one SJW some credit, however. In addition to urging sanity on the more violence-prone SJWs, Mary Robinette Kowal also has a sense of humor. In response to Patrick Nielsen Hayden learns about the 2015 Hugo Awards, she wrote:</p><p><i>I never thought I’d say this, but you’ve made me laugh at something you intended to be funny. So, thanks for the chuckle. This was hilariously over the top.</i></p><p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"288\" src=\"https://www.youtube.com/embed/JXxNODbC6IE?feature=player_detailpage\" width=\"512\"></iframe></p><p> The American Spectator<a href=\"http://spectator.org/articles/62372/sci-fi%E2%80%99s-pod-people\"> covered the developing story</a>:</p><blockquote class=\"tr_bq\"><p> The controversy over the Hugo Awards contains elements of a good<br> dystopian science fiction story. Unfortunately, the media brat-fit over<br> the successful effort to rescue escapist fantasy literature from its<br> political pursuers comes not from the pages of <i style=\"line-height: 1.538em;\">Brave New World</i> but from <i style=\"line-height: 1.538em;\">Slate</i>, <i style=\"line-height: 1.538em;\">Salon</i>, and <i style=\"line-height: 1.538em;\">Entertainment Weekly</i>.</br></br></br></p><p>Like<br> sports, video games, and cake baking, science fiction strangely finds<br> itself in the crosshairs of ideological killjoys. Perhaps it was only a<br> matter of time and space before the genre obsessed with time and space<br> became a culture-war battlefield.</br></br></br></br></p><p>“To many of the people involved in this industry, politics and message trump entertainment or quality,” Larry Correia, a <i>New York Times</i>-bestselling bard of monster stories, tells <i>The</i> <i>American Spectator</i>.<br> “But most people buy entertainment because they want to be entertained.<br> Many longtime readers fell away because they were tired of being<br> preached at or having their values insulted.”</br></br></br></p></blockquote><p>It’s pretty good. It even contains a quote from yours truly. “We believe that the Best Novel award should actually go to the best<br> novels,” Vox Day says of his modest aim. “The best works should be<br> awarded, not only works by the best-connected.”</br></br></p><p>Who but a lunatic could possibly object to that? And, as I’ve noted, we can make a powerful objective case that the works awarded this year will be better, by every objective standard, than in recent years.</p></div>",
  "content_text": "One thing I thought particularly worthy of note is what a small proportion of #GamerGate tweets are in response to the Hugo Awards. And notice that they didn’t move up until several days after the initial #SadPuppies spike.\nThat’s what I find so amusing about the SJW panic about those they call “thugs” in their midst. Not even a tenth of #GamerGate is paying any attention at all to the Hugo Awards yet, and that’s already enough to send them shrieking and running. This is still a period of calm as far as GG is concerned.\nBut if the SJWs want to be sure to grab #GamerGate’s attention, I suppose a coordinated media blitz full of ludicrous lies about people are an effective way to do it. It certainly isn’t anything we haven’t seen before.\nI do have to give one SJW some credit, however. In addition to urging sanity on the more violence-prone SJWs, Mary Robinette Kowal also has a sense of humor. In response to Patrick Nielsen Hayden learns about the 2015 Hugo Awards, she wrote:\nI never thought I’d say this, but you’ve made me laugh at something you intended to be funny. So, thanks for the chuckle. This was hilariously over the top.\nThe American Spectator\ncovered the developing story\n:\nThe controversy over the Hugo Awards contains elements of a good\ndystopian science fiction story. Unfortunately, the media brat-fit over\nthe successful effort to rescue escapist fantasy literature from its\npolitical pursuers comes not from the pages of\nBrave New World\nbut from\nSlate\n,\nSalon\n, and\nEntertainment Weekly\n.\nLike\nsports, video games, and cake baking, science fiction strangely finds\nitself in the crosshairs of ideological killjoys. Perhaps it was only a\nmatter of time and space before the genre obsessed with time and space\nbecame a culture-war battlefield.\n“To many of the people involved in this industry, politics and message trump entertainment or quality,” Larry Correia, a\nNew York Times\n-bestselling bard of monster stories, tells\nThe\nAmerican Spectator\n.\n“But most people buy entertainment because they want to be entertained.\nMany longtime readers fell away because they were tired of being\npreached at or having their values insulted.”\nIt’s pretty good. It even contains a quote from yours truly. “We believe that the Best Novel award should actually go to the best\nnovels,” Vox Day says of his modest aim. “The best works should be\nawarded, not only works by the best-connected.”\nWho but a lunatic could possibly object to that? And, as I’ve noted, we can make a powerful objective case that the works awarded this year will be better, by every objective standard, than in recent years.",
  "tags": [
    "#GamerGate",
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-10T15:00:00+00:00"
}