{
  "url": "https://voxday.net/2015/04/19/population-replacemen/",
  "scraped_at": "2025-12-16T12:52:50.325778",
  "title": "Population replacement",
  "date_display": "April 19, 2015",
  "date_iso": "2015-04-19T12:30:00+00:00",
  "date_from_url": "2015-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s interesting to see how <a href=\"http://www.startribune.com/lifestyle/300549671.html?page=2&amp;c=y\">alarm bells are ringing</a> in liberal Minnesotan circles even though Somali immigration has helped the numbers to remain stable:</p><blockquote class=\"tr_bq\"><p> Casey Sperzel is Minnesotan through and through. She grew up in Maple Grove, went to college at the University of Minnesota, and lived in both St. Paul and Minneapolis. But when the 27-year-old met with a job recruiter last year, she was set on the Pacific Northwest.</p><p>“I don’t think I’ll be back,” said Sperzel, now with a Seattle ad agency.</p><p>States are scrambling for young professionals like Sperzel to help offset the wave of baby boomer retirements. Minnesota is falling behind in that competition. The state has lost residents every year since 2002, with young adults most eager to leave. About 9,300 18- to 24-year-olds move out annually, according to the Minnesota State Demographic Center.</p><p>That — combined with a declining birthrate and an aging population — has demographers and civic leaders sounding alarms.</p><p>“It’s a lapel-grabbing moment,” said Peter Frosch, a vice president at Greater MSP, a St. Paul nonprofit focused on economic development in the Twin Cities metro.</p><p>Over the next 15 years, more Minnesotans will retire than in the past six decades combined, resulting in a labor shortage that is unprecedented since the end of World War II. By 2020, the state is forecast to have a shortage of more than 100,000 workers…. Each year, 113,000 people leave Minnesota and go to another state, while<br> about 101,000 move here from another state. Were it not for strong<br> international migration, Minnesota’s overall population would be<br> falling.</br></br></br></p></blockquote><p>I left Minnesota in my twenties after founding a Billboard-charting band, a music company, and my first computer game company.  But don’t worry, thanks to “strong international migration”, I’m sure there is an Somali gentleman with an 85 IQ who is doing an admirable job of taking my place there. I have no doubt that he will continue to do so as long as he doesn’t wind up joining Al Shabaab and blowing himself up at the Megamall or somewhere in Africa.</p><p>After all, everyone is equal, and if they’re not, they are inevitably transformed by the magic of geographical translocation. That’s why the 20th century America was exactly like 15th century America that was inhabited only by my Native American ancestors.</p><p>I’m glad I grew up in then-Minnesota. It was a wonderful place for a child despite the cold winters. But despite the certain improvements that have taken place by virtue of the many blessings of Diversity and Vibrancy, I have no desire to live in now-Minnesota.</p></div>",
  "content_text": "It’s interesting to see how\nalarm bells are ringing\nin liberal Minnesotan circles even though Somali immigration has helped the numbers to remain stable:\nCasey Sperzel is Minnesotan through and through. She grew up in Maple Grove, went to college at the University of Minnesota, and lived in both St. Paul and Minneapolis. But when the 27-year-old met with a job recruiter last year, she was set on the Pacific Northwest.\n“I don’t think I’ll be back,” said Sperzel, now with a Seattle ad agency.\nStates are scrambling for young professionals like Sperzel to help offset the wave of baby boomer retirements. Minnesota is falling behind in that competition. The state has lost residents every year since 2002, with young adults most eager to leave. About 9,300 18- to 24-year-olds move out annually, according to the Minnesota State Demographic Center.\nThat — combined with a declining birthrate and an aging population — has demographers and civic leaders sounding alarms.\n“It’s a lapel-grabbing moment,” said Peter Frosch, a vice president at Greater MSP, a St. Paul nonprofit focused on economic development in the Twin Cities metro.\nOver the next 15 years, more Minnesotans will retire than in the past six decades combined, resulting in a labor shortage that is unprecedented since the end of World War II. By 2020, the state is forecast to have a shortage of more than 100,000 workers…. Each year, 113,000 people leave Minnesota and go to another state, while\nabout 101,000 move here from another state. Were it not for strong\ninternational migration, Minnesota’s overall population would be\nfalling.\nI left Minnesota in my twenties after founding a Billboard-charting band, a music company, and my first computer game company.  But don’t worry, thanks to “strong international migration”, I’m sure there is an Somali gentleman with an 85 IQ who is doing an admirable job of taking my place there. I have no doubt that he will continue to do so as long as he doesn’t wind up joining Al Shabaab and blowing himself up at the Megamall or somewhere in Africa.\nAfter all, everyone is equal, and if they’re not, they are inevitably transformed by the magic of geographical translocation. That’s why the 20th century America was exactly like 15th century America that was inhabited only by my Native American ancestors.\nI’m glad I grew up in then-Minnesota. It was a wonderful place for a child despite the cold winters. But despite the certain improvements that have taken place by virtue of the many blessings of Diversity and Vibrancy, I have no desire to live in now-Minnesota.",
  "tags": [
    "immigration",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-19T11:30:00+00:00"
}