{
  "url": "https://voxday.net/2015/04/01/post-trinitarian-levels-of-war/",
  "scraped_at": "2025-12-16T12:50:40.806264",
  "title": "Post-trinitarian levels of war",
  "date_display": "April 1, 2015",
  "date_iso": "2015-04-01T19:30:00+00:00",
  "date_from_url": "2015-04-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been reading Martin van Creveld’s excellent Technology and War, and this struck me as pertinent in light of the discussion we’ve been having about whether the problem with the Western militaries is at the Physical, the Mental, or the Moral level:</p><blockquote class=\"tr_bq\"><p> Once the politicians and commanders decided to mobilize their male populations, in one sense they overshot the mark. In 1914, and to a lesser extent in 1939, the instinctive reaction of the military to the unexpected prolongation of hostilities was to put everything and everybody into uniform. As the war dragged on, it became increasingly clear that this was a mistake. The same technology that made military mobilization possible also demanded that it remain incomplete. It was not enough for machines to be deployed on the battlefield. For them to do useful service, it was first necessary to have them designed, developed, produced, and supplied with fuel and spare parts. War itself extended its tentacles deep to the rear, spreading from the trenches into the fields, the mines, and the factories. Not content with the mobilization of those, it reached further into the design bureaus and, ultimately, into peaceful university laboratories where the most esoteric work was done and the potentially most powerful weapons were developed.</p><p>As war expanded in this way, both the meaning of strategy and its scope underwent a subtle, and at first imperceptible, change. Instead of being merely a question of concentrating the maximum force at the decisive point at the front, as Jomini and Clausewitz had taught, strategy now acquired the added dimension of an exercise in correctly distributing one’s total resources, both human and material, between the fighting front and the rear. Instead of being concerned with waging military operations, it became occupied with the overall coordination and integration of a country’s military effort. To cope with the new reality, a new term—grand strategy—was coined by the theoreticians and sometimes applied by those in charge.</p><p>For a variety of reasons, both ideological and structural, grand strategy was a field where Germany lagged behind the Western Allies during both World Wars, and for this, of course, she paid the ultimate penalty of defeat.</p></blockquote><p>The levels of war aren’t difficult to understand once you grasp that there is NO DIFFERENCE between “the military” and “the politicians” or “the brave soldiers” and “society”. This is not new, it’s the framework with which military strategists and theorists have worked since Clausewitz wrote his famous dictum: “War is a mere continuation of politics by other means.”</p><p>I provided the example of Fabius Maximus in the previous comments, apparently to little avail. But I will repeat it in light of the quote above and perhaps it will help shed some light on the matter. Now, after Hannibal slaughtered 50,000 Romans and Italians at Cannae, the first thing Fabius Maximus did in taking charge was go back to<br> Rome and shore up public support for the war against Hannibal.</br></p><blockquote class=\"tr_bq\"><p> When word reached Rome of the disastrous Roman defeat under Varro and Paullus at the Battle of Cannae, the Senate and the People of Rome turned to Fabius for guidance. They had believed his strategy to be flawed before, but now they thought him to be as wise as the gods. He walked the streets of Rome, assured as to eventual Roman victory, in an attempt to comfort his fellow Romans. Without his support, the senate might have remained too frightened to even meet. He placed guards at the gates of the city to stop the frightened Romans from fleeing, and regulated mourning activities. He set times and places for this mourning, and ordered that each family perform such observances within their own private walls, and that the mourning should be complete within a month; following the completion of these mourning rituals, the entire city was purified of its blood-guilt in the deaths. This decree effectively outlawed competitive outdoor mourning, which could have had a devastating psychological impact on the survivors.</p></blockquote><p> Only after he had secured the Moral level did he change Roman strategy. And there we see the interaction of the<br> different levels of war.</br></p><p>1. Moral.<br> 2. Strategic.<br> 3. Operational.<br> 4. Tactical.<br> 5. Physical.</br></br></br></br></p><p>Because<br> Fabius Maximus took care of the Moral level first, he was able to adopt a better<br> Strategy, which he knew would require a considerable amount of time, hence his nickname Cunctator, or “delayer”. Because that superior strategy was designed to affect the Operational<br> level, he put himself in a superior Tactical position as Hannibal’s<br> supplies and reinforcements dried up, thereby forcing Hannibal to retreat to Africa.</br></br></br></br></p><p>This is an amusingly ignorant statement from Wikipedia: “Fabius’ own military success was small.”</p><p>Nothing could be further from the truth. In the end, thanks to his superior Moral and Strategic generalship, Rome found itself in a position<br> to win on the very Physical level that Hannibal had previously<br> slaughtered them on at Trebia, Lake Trasimene, and Cannae. Fabius Maximus drove Hannibal out of Rome despite never seriously engaging Hannibal on the Tactical or Physical levels, something Varro and Paulus were unable to accomplish with 86,400 brave, well-drilled, well-armed Roman legionaries.</br></br></p></div>",
  "content_text": "I’ve been reading Martin van Creveld’s excellent Technology and War, and this struck me as pertinent in light of the discussion we’ve been having about whether the problem with the Western militaries is at the Physical, the Mental, or the Moral level:\nOnce the politicians and commanders decided to mobilize their male populations, in one sense they overshot the mark. In 1914, and to a lesser extent in 1939, the instinctive reaction of the military to the unexpected prolongation of hostilities was to put everything and everybody into uniform. As the war dragged on, it became increasingly clear that this was a mistake. The same technology that made military mobilization possible also demanded that it remain incomplete. It was not enough for machines to be deployed on the battlefield. For them to do useful service, it was first necessary to have them designed, developed, produced, and supplied with fuel and spare parts. War itself extended its tentacles deep to the rear, spreading from the trenches into the fields, the mines, and the factories. Not content with the mobilization of those, it reached further into the design bureaus and, ultimately, into peaceful university laboratories where the most esoteric work was done and the potentially most powerful weapons were developed.\nAs war expanded in this way, both the meaning of strategy and its scope underwent a subtle, and at first imperceptible, change. Instead of being merely a question of concentrating the maximum force at the decisive point at the front, as Jomini and Clausewitz had taught, strategy now acquired the added dimension of an exercise in correctly distributing one’s total resources, both human and material, between the fighting front and the rear. Instead of being concerned with waging military operations, it became occupied with the overall coordination and integration of a country’s military effort. To cope with the new reality, a new term—grand strategy—was coined by the theoreticians and sometimes applied by those in charge.\nFor a variety of reasons, both ideological and structural, grand strategy was a field where Germany lagged behind the Western Allies during both World Wars, and for this, of course, she paid the ultimate penalty of defeat.\nThe levels of war aren’t difficult to understand once you grasp that there is NO DIFFERENCE between “the military” and “the politicians” or “the brave soldiers” and “society”. This is not new, it’s the framework with which military strategists and theorists have worked since Clausewitz wrote his famous dictum: “War is a mere continuation of politics by other means.”\nI provided the example of Fabius Maximus in the previous comments, apparently to little avail. But I will repeat it in light of the quote above and perhaps it will help shed some light on the matter. Now, after Hannibal slaughtered 50,000 Romans and Italians at Cannae, the first thing Fabius Maximus did in taking charge was go back to\nRome and shore up public support for the war against Hannibal.\nWhen word reached Rome of the disastrous Roman defeat under Varro and Paullus at the Battle of Cannae, the Senate and the People of Rome turned to Fabius for guidance. They had believed his strategy to be flawed before, but now they thought him to be as wise as the gods. He walked the streets of Rome, assured as to eventual Roman victory, in an attempt to comfort his fellow Romans. Without his support, the senate might have remained too frightened to even meet. He placed guards at the gates of the city to stop the frightened Romans from fleeing, and regulated mourning activities. He set times and places for this mourning, and ordered that each family perform such observances within their own private walls, and that the mourning should be complete within a month; following the completion of these mourning rituals, the entire city was purified of its blood-guilt in the deaths. This decree effectively outlawed competitive outdoor mourning, which could have had a devastating psychological impact on the survivors.\nOnly after he had secured the Moral level did he change Roman strategy. And there we see the interaction of the\ndifferent levels of war.\n1. Moral.\n2. Strategic.\n3. Operational.\n4. Tactical.\n5. Physical.\nBecause\nFabius Maximus took care of the Moral level first, he was able to adopt a better\nStrategy, which he knew would require a considerable amount of time, hence his nickname Cunctator, or “delayer”. Because that superior strategy was designed to affect the Operational\nlevel, he put himself in a superior Tactical position as Hannibal’s\nsupplies and reinforcements dried up, thereby forcing Hannibal to retreat to Africa.\nThis is an amusingly ignorant statement from Wikipedia: “Fabius’ own military success was small.”\nNothing could be further from the truth. In the end, thanks to his superior Moral and Strategic generalship, Rome found itself in a position\nto win on the very Physical level that Hannibal had previously\nslaughtered them on at Trebia, Lake Trasimene, and Cannae. Fabius Maximus drove Hannibal out of Rome despite never seriously engaging Hannibal on the Tactical or Physical levels, something Varro and Paulus were unable to accomplish with 86,400 brave, well-drilled, well-armed Roman legionaries.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-01T18:30:00+00:00"
}