{
  "url": "https://voxday.net/2015/04/01/right-rhetoric/",
  "scraped_at": "2025-12-16T12:50:36.411348",
  "title": "Right rhetoric",
  "date_display": "April 1, 2015",
  "date_iso": "2015-04-01T08:41:00+00:00",
  "date_from_url": "2015-04-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Consider a few of the following reactions to Martin van Creveld’s article entitled “Pussycats” yesterday:</p><ul><li>Mr. Van Creveld vastly misstates the issue. In none of the conflicts he lists have the soldiers on the ground suffered anything but the most glancing and isolated defeats. I’ve been there, I’ve seen what it looks like when western soldiers fight third-world tribesmen. It’s not pretty. And it is precisely the level of training which overrides the natural impulse to protect oneself that makes us so effective. When ambushed, you walk straight into it. Sounds daft until you see it in action. Face in, plates in front, front sight post up, and you walk in shooting. They can’t match our discipline, our equipment nor our skills. In every skirmish I was ever in, the iraqis or the afghans would hang their AKs out over the wall, empty the mag blind, and then run for the hills or curl up in a ball.Van Creveld mistakes or misstates the fact that it is the political leadership (officer corps included) which “loses” these wars after the soldiers win every objective. Or else the retards back home set ridiculous non-military objectives.</li><li>I call bullshit. If Western Forces have been unable to win since<br> Clinton was in office because our troops have been personally unwilling<br> to fight, our enemies would have trumpeted our mutinies, routs,<br> desertions and cowardice in battle. Extravagent assertions for which the proponents admit there is no empirical evidence inspire no credibility.</br></br></br></li><li>There is no other reasonable interpretation of van<br> c’s words and he’s dead fucking wrong. If it is a language barrier or<br> translation problem, he should fix it or find a competent interpreter.<br> Otherwise, perhaps the strategist should stick to writing about<br> strategy.</br></br></br></br></li><li>The most charitable explanation for van c’s hissy fit that I can see is<br> either Vox’s interpretation that he’s really talking about the lack of<br> political will to prosecute the war in a manner calculated to win along<br> with a corresponding lack of will among the flag ranks (and possibly<br> field grades) to take risks or he’s simply projecting an end game level<br> of morale onto the troops. Yet words have meaning and I cannot fully<br> reconcile van c’s words with either of those interpretations. Nor am I<br> willing to accept a, shall we say calvinistic, position of “that’s what<br> he said, but what he really meant was…”</br></br></br></br></br></br></br></br></li></ul><p>What I found amusing about reading these attempted criticisms is that they are all examples of the right behaving in a rhetorical manner similar to that of the left’s customary form of response. They might appear to be based on dialectic, but they’re not. They are primarily emotional responses written in instinctive reaction to trigger words. It’s easy to identify when someone who is normally capable of dialectic descends to rhetoric out of emotional distress because they suddenly become dishonest; van Creveld may be wrong, but there is absolutely no way the article can reasonably be described as a “hissy fit”. Or for nonsensical claims, such as the idea that assertions the <i>proponents </i>have not made have anything to do with the credibility of the <i>author </i>or the article.</p><p>As for the appeal to personal experience, that’s not invalid, it’s just irrelevant. As strategists have noted going back to Maurice at the very least, one cannot judge Eastern military performances by Western standards. Shoot-and-scoot is their conventional tactic and it’s no more indicative of individual cowardice than the West’s convention of everyone dutifully lining up and bashing into each other is indicative of individual stupidity.</p><p>Furthermore, there is considerable evidence that the Western militaries are psychologically weaker and less willing to fight than they once were that don’t rely upon what is going to be dismissed as enemy propaganda anyhow. Look at pregnancy and suicide rates, for example:</p><ul><li><i>A study published in February in the journal <a href=\"http://journals.lww.com/greenjournal/Fulltext/2013/02000/Unintended_Pregnancy_Among_Active_Duty_Women_in.5.aspx\">Obstetrics and Gynecology </a>found<br> that about 11 percent of active-duty women ages 18 to 44, from all<br> branches of the military, said they had had an unplanned pregnancy<br> within the past year…. according to a 2010 survey, two of every three enlisted female sailors<br> became pregnant during their tenure in the Navy. </br></br></br></br></i></li><li><i>Navy SEALs, Army Rangers and other elite troops from the military’s<br> secretive Special Operations community are also killing themselves at<br> record rates. Our all-volunteer military reflects the society in which its soldiers were raised, and any problem that affects the country also affects those troops. Suicide is one of those problems. Indeed, troops who take their own lives have often been heavy drinkers or suffered from mental health issues such as bipolar disorder — the same factors linked to suicide in the civilian world. Although the military suicide rate recently eclipsed the rate among civilians of similar age and background, the civilian rate has also soared.</br></br></i></li></ul><p>As to some of the other suggested metrics, there is good reason to doubt that the US military is entirely reliable when it comes to reporting anything that might be considered <a href=\"http://www.washingtonpost.com/news/checkpoint/wp/2015/03/25/bowe-bergdahl-once-missing-u-s-soldier-charged-with-desertion/\">to reflect badly upon it</a>.</p><ul><li><i>Thousands of U.S. service members are believed to have deserted their units during the wars in Iraq and Afghanistan, but Bergdahl’s case is uncommon because he allegedly did so while on the battlefield. Some have escaped while in the United States and remain beyond the reach of the military in Canada, parts of Europe and other locations…. Many of those in his unit have been waiting years to see the Army acknowledge potential wrongdoing by Bergdahl, said Nathan B. Bethea, 30, a former Army captain in New York who was deployed with Bergdahl’s battalion when he went missing. “I think they’re pleased because this comes as a surprise,” Bethea said of the overall reaction. “I think that, given how long this has taken, it comes as a shock. The Army never made a statement on what happened. There was always just obfuscation and smoke and mirrors.”</i></li></ul><p>However, there is an important difference between the left’s emotional rhetoric and the right’s. And that is the right’s ability to return to the dialectical level after the initial emotional reaction dies down. One of the above-quoted authors subsequently commented:</p><ul><li>“I retract my criticism of van c. The “man for man” comments most likely translate poorly given the fact that he correctly diagnoses the problem and places blame squarely where it belongs for failures of western militaries. I engaged in a knee jerk reaction even though I know better. Mea culpa.”</li></ul><p>I can only applaud the gentleman’s ability to re-read, rethink and recant. This is the hallmark of one capable of surmounting the rhetoric; Aristotle would observe that he has a mind capable of being changed by information. I suggest that in the future, it will be useful for him, and others, to understand that this kneejerk instinct to react emotionally  and descend into the rhetorical when the bravery or efficacy of the American soldier is called into question exists.</p><p>Now, the thing to keep in mind that we all have triggers that will cause us to respond rhetorically rather than in a dialectical manner. And while there is nothing intrinsically wrong with rhetorical responses, they are inappropriate responses to dialectic, especially when they are presented as dialectic. Here are some clues that your emotions have been sufficiently triggered to cause your response to be pseudo-dialectical rhetoric.</p><ol><li>You use passive-aggressive language or launch passive-aggressive attacks.</li><li>You incorrectly characterize what you are criticizing.</li><li>You use loaded words or unnecessary vulgarities.</li><li>You utilize dismissive language or strike a dismissive pose without providing any justification for it.</li><li>You ignore any and all evidence of alternative explanations.</li><li>You rely upon a pedantic exegesis of a very small part of the text.</li><li>You offer justifications that are nonsensical.</li><li>You attack the character or competence of the author.</li></ol><p>If you find yourself doing any of those things, that is a sign that you need to step back, re-read, and reconsider. You may well be right, but I suggest the chances are that you’re not.</p></div>",
  "content_text": "Consider a few of the following reactions to Martin van Creveld’s article entitled “Pussycats” yesterday:\nMr. Van Creveld vastly misstates the issue. In none of the conflicts he lists have the soldiers on the ground suffered anything but the most glancing and isolated defeats. I’ve been there, I’ve seen what it looks like when western soldiers fight third-world tribesmen. It’s not pretty. And it is precisely the level of training which overrides the natural impulse to protect oneself that makes us so effective. When ambushed, you walk straight into it. Sounds daft until you see it in action. Face in, plates in front, front sight post up, and you walk in shooting. They can’t match our discipline, our equipment nor our skills. In every skirmish I was ever in, the iraqis or the afghans would hang their AKs out over the wall, empty the mag blind, and then run for the hills or curl up in a ball.Van Creveld mistakes or misstates the fact that it is the political leadership (officer corps included) which “loses” these wars after the soldiers win every objective. Or else the retards back home set ridiculous non-military objectives.\nI call bullshit. If Western Forces have been unable to win since\nClinton was in office because our troops have been personally unwilling\nto fight, our enemies would have trumpeted our mutinies, routs,\ndesertions and cowardice in battle. Extravagent assertions for which the proponents admit there is no empirical evidence inspire no credibility.\nThere is no other reasonable interpretation of van\nc’s words and he’s dead fucking wrong. If it is a language barrier or\ntranslation problem, he should fix it or find a competent interpreter.\nOtherwise, perhaps the strategist should stick to writing about\nstrategy.\nThe most charitable explanation for van c’s hissy fit that I can see is\neither Vox’s interpretation that he’s really talking about the lack of\npolitical will to prosecute the war in a manner calculated to win along\nwith a corresponding lack of will among the flag ranks (and possibly\nfield grades) to take risks or he’s simply projecting an end game level\nof morale onto the troops. Yet words have meaning and I cannot fully\nreconcile van c’s words with either of those interpretations. Nor am I\nwilling to accept a, shall we say calvinistic, position of “that’s what\nhe said, but what he really meant was…”\nWhat I found amusing about reading these attempted criticisms is that they are all examples of the right behaving in a rhetorical manner similar to that of the left’s customary form of response. They might appear to be based on dialectic, but they’re not. They are primarily emotional responses written in instinctive reaction to trigger words. It’s easy to identify when someone who is normally capable of dialectic descends to rhetoric out of emotional distress because they suddenly become dishonest; van Creveld may be wrong, but there is absolutely no way the article can reasonably be described as a “hissy fit”. Or for nonsensical claims, such as the idea that assertions the\nproponents\nhave not made have anything to do with the credibility of the\nauthor\nor the article.\nAs for the appeal to personal experience, that’s not invalid, it’s just irrelevant. As strategists have noted going back to Maurice at the very least, one cannot judge Eastern military performances by Western standards. Shoot-and-scoot is their conventional tactic and it’s no more indicative of individual cowardice than the West’s convention of everyone dutifully lining up and bashing into each other is indicative of individual stupidity.\nFurthermore, there is considerable evidence that the Western militaries are psychologically weaker and less willing to fight than they once were that don’t rely upon what is going to be dismissed as enemy propaganda anyhow. Look at pregnancy and suicide rates, for example:\nA study published in February in the journal\nObstetrics and Gynecology\nfound\nthat about 11 percent of active-duty women ages 18 to 44, from all\nbranches of the military, said they had had an unplanned pregnancy\nwithin the past year…. according to a 2010 survey, two of every three enlisted female sailors\nbecame pregnant during their tenure in the Navy.\nNavy SEALs, Army Rangers and other elite troops from the military’s\nsecretive Special Operations community are also killing themselves at\nrecord rates. Our all-volunteer military reflects the society in which its soldiers were raised, and any problem that affects the country also affects those troops. Suicide is one of those problems. Indeed, troops who take their own lives have often been heavy drinkers or suffered from mental health issues such as bipolar disorder — the same factors linked to suicide in the civilian world. Although the military suicide rate recently eclipsed the rate among civilians of similar age and background, the civilian rate has also soared.\nAs to some of the other suggested metrics, there is good reason to doubt that the US military is entirely reliable when it comes to reporting anything that might be considered\nto reflect badly upon it\n.\nThousands of U.S. service members are believed to have deserted their units during the wars in Iraq and Afghanistan, but Bergdahl’s case is uncommon because he allegedly did so while on the battlefield. Some have escaped while in the United States and remain beyond the reach of the military in Canada, parts of Europe and other locations…. Many of those in his unit have been waiting years to see the Army acknowledge potential wrongdoing by Bergdahl, said Nathan B. Bethea, 30, a former Army captain in New York who was deployed with Bergdahl’s battalion when he went missing. “I think they’re pleased because this comes as a surprise,” Bethea said of the overall reaction. “I think that, given how long this has taken, it comes as a shock. The Army never made a statement on what happened. There was always just obfuscation and smoke and mirrors.”\nHowever, there is an important difference between the left’s emotional rhetoric and the right’s. And that is the right’s ability to return to the dialectical level after the initial emotional reaction dies down. One of the above-quoted authors subsequently commented:\n“I retract my criticism of van c. The “man for man” comments most likely translate poorly given the fact that he correctly diagnoses the problem and places blame squarely where it belongs for failures of western militaries. I engaged in a knee jerk reaction even though I know better. Mea culpa.”\nI can only applaud the gentleman’s ability to re-read, rethink and recant. This is the hallmark of one capable of surmounting the rhetoric; Aristotle would observe that he has a mind capable of being changed by information. I suggest that in the future, it will be useful for him, and others, to understand that this kneejerk instinct to react emotionally  and descend into the rhetorical when the bravery or efficacy of the American soldier is called into question exists.\nNow, the thing to keep in mind that we all have triggers that will cause us to respond rhetorically rather than in a dialectical manner. And while there is nothing intrinsically wrong with rhetorical responses, they are inappropriate responses to dialectic, especially when they are presented as dialectic. Here are some clues that your emotions have been sufficiently triggered to cause your response to be pseudo-dialectical rhetoric.\nYou use passive-aggressive language or launch passive-aggressive attacks.\nYou incorrectly characterize what you are criticizing.\nYou use loaded words or unnecessary vulgarities.\nYou utilize dismissive language or strike a dismissive pose without providing any justification for it.\nYou ignore any and all evidence of alternative explanations.\nYou rely upon a pedantic exegesis of a very small part of the text.\nYou offer justifications that are nonsensical.\nYou attack the character or competence of the author.\nIf you find yourself doing any of those things, that is a sign that you need to step back, re-read, and reconsider. You may well be right, but I suggest the chances are that you’re not.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-01T07:41:00+00:00"
}