{
  "url": "https://voxday.net/2015/04/23/sjws-always-lie-3/",
  "scraped_at": "2025-12-16T12:53:17.735158",
  "title": "SJWs always lie",
  "date_display": "April 23, 2015",
  "date_iso": "2015-04-23T18:08:00+00:00",
  "date_from_url": "2015-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Case in point: <a href=\"https://bradrtorgersen.wordpress.com/2015/04/13/unpersoning/#comment-10456\">Mary Robinette Kowal</a>:</p><blockquote class=\"tr_bq\"><p> Mary Robinette Kowal says:    <br> April 13, 2015 at 6:25 pm   </br></p><p>Speaking as someone who has been the repeated target of Vox Day, this strategy does not work. Until April 11, 2015, I have NEVER mentioned him on my blog. EVER. I have him blocked on all social media.</p><p>“He doesn’t attack anyone that hasn’t opened the ball up.”<br> HA! His first mention of me is mid-2013.</br></p><p>He has threatened to post where I live. And yes, he could, because he has the SFWA directory.</p><p>This idea that you can ignore him and he’ll go away is demonstrably not how it works.</p></blockquote><p>What a poisonously stupid little bitch. Keep in mind this is Johnny Con’s former VP in SFWA. She is a <i>shameless </i>liar. I absolutely did NOT threaten to post where she lived. She publicly called me out on TWITTER about my claim that accused child molester Ed Kramer was a member of SFWA and was listed as such in the SFWA directory on June 23, 2014. The problem, of course, was that in order to provide evidence of my 100-percent correct claim by posting the relevant page from the 2010 SFWA directory, I would have to expose the names and addresses of everyone on that page, including the lying bitch herself. As it happens, Kowal, Mary Robinette (A) is directly above Kramer, Edward E. (A) on page 26 of the SFWA Directory.</p><p>This is the “proof” she cites that I “threatened to post” where she lived. Notice that they started claiming that Kramer was not a member after scrubbing his name from the online membership directory that morning. What a pity that I’d already <a href=\"http://4.bp.blogspot.com/-QJnKugraJgM/U6lQ8AEslvI/AAAAAAAAA1M/xVfW-grhAiU/s1600/SFWA_Kramer_23Jun14.jpg\">grabbed a screenshot</a>, knowing how these liars always lie.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://i1.wp.com/maryrobinettekowal.com/wp-content/uploads/2015/04/Fullscreen-capture-6242014-123042-PM.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"https://i1.wp.com/maryrobinettekowal.com/wp-content/uploads/2015/04/Fullscreen-capture-6242014-123042-PM.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://i1.wp.com/maryrobinettekowal.com/wp-content/uploads/2015/04/Fullscreen-capture-6242014-123042-PM.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p> Now, note that the convicted child molester Ed Kramer is not a current Active member of SFWA because he has not paid his dues… from prison. He is still eligible and can restore his Active status in the organization any time he simply pays his dues. He was absolutely a member of SFWA in 2010, as the SFWA directory showed, and he was STILL listed as a member of SFWA in their online directory as of June 24, 2014, although SFWA removed the listing only hours <a href=\"http://www.milobookclub.com/2014/06/24/sfwa-still-harbors-child-molesters/\">after I posted the screencap on my blog</a>.</p><p>Note that SFWA member Ed Kramer “was arrested on August 25, 2000 following an anonymous tip, and<br> charged with molesting three teenage boys. The ensuing investigation<br> revealed that Kramer had previously been accused of molestation in 1997<br> before the alleged victim recanted. Kramer’s first attempt to serve his pre-trial detention in house arrest<br> lasted only a week due to a reported visit by a teenage boy. After<br> Kramer suffered a spinal injury in jail, Judge Debra Turner allowed him<br> to go back to house arrest in January 2001.<a href=\"http://en.wikipedia.org/wiki/Edward_E._Kramer#cite_note-Henry2-11\"></a>This lasted until 2008.”</br></br></br></br></br></br></p><p>In any event, Mary Robinette Kowal is not only a liar, but a shameless deceiver as well. Not only did she lie about me threatening to post her address, but she lied about me not leaving her alone AFTER SHE CALLED ME OUT ON TWITTER. Sure, it’s true that she hadn’t mentioned me on her blog… because she was attacking me on Twitter.</p><p>The lesson, as always, is that <i>SJWs always lie.</i></p><p>I don’t lie on the Internet, Mary. I told you it will never end. And it hasn’t, has it?</p></div>",
  "content_text": "Case in point:\nMary Robinette Kowal\n:\nMary Robinette Kowal says:\nApril 13, 2015 at 6:25 pm\nSpeaking as someone who has been the repeated target of Vox Day, this strategy does not work. Until April 11, 2015, I have NEVER mentioned him on my blog. EVER. I have him blocked on all social media.\n“He doesn’t attack anyone that hasn’t opened the ball up.”\nHA! His first mention of me is mid-2013.\nHe has threatened to post where I live. And yes, he could, because he has the SFWA directory.\nThis idea that you can ignore him and he’ll go away is demonstrably not how it works.\nWhat a poisonously stupid little bitch. Keep in mind this is Johnny Con’s former VP in SFWA. She is a\nshameless\nliar. I absolutely did NOT threaten to post where she lived. She publicly called me out on TWITTER about my claim that accused child molester Ed Kramer was a member of SFWA and was listed as such in the SFWA directory on June 23, 2014. The problem, of course, was that in order to provide evidence of my 100-percent correct claim by posting the relevant page from the 2010 SFWA directory, I would have to expose the names and addresses of everyone on that page, including the lying bitch herself. As it happens, Kowal, Mary Robinette (A) is directly above Kramer, Edward E. (A) on page 26 of the SFWA Directory.\nThis is the “proof” she cites that I “threatened to post” where she lived. Notice that they started claiming that Kramer was not a member after scrubbing his name from the online membership directory that morning. What a pity that I’d already\ngrabbed a screenshot\n, knowing how these liars always lie.\nNow, note that the convicted child molester Ed Kramer is not a current Active member of SFWA because he has not paid his dues… from prison. He is still eligible and can restore his Active status in the organization any time he simply pays his dues. He was absolutely a member of SFWA in 2010, as the SFWA directory showed, and he was STILL listed as a member of SFWA in their online directory as of June 24, 2014, although SFWA removed the listing only hours\nafter I posted the screencap on my blog\n.\nNote that SFWA member Ed Kramer “was arrested on August 25, 2000 following an anonymous tip, and\ncharged with molesting three teenage boys. The ensuing investigation\nrevealed that Kramer had previously been accused of molestation in 1997\nbefore the alleged victim recanted. Kramer’s first attempt to serve his pre-trial detention in house arrest\nlasted only a week due to a reported visit by a teenage boy. After\nKramer suffered a spinal injury in jail, Judge Debra Turner allowed him\nto go back to house arrest in January 2001.\nThis lasted until 2008.”\nIn any event, Mary Robinette Kowal is not only a liar, but a shameless deceiver as well. Not only did she lie about me threatening to post her address, but she lied about me not leaving her alone AFTER SHE CALLED ME OUT ON TWITTER. Sure, it’s true that she hadn’t mentioned me on her blog… because she was attacking me on Twitter.\nThe lesson, as always, is that\nSJWs always lie.\nI don’t lie on the Internet, Mary. I told you it will never end. And it hasn’t, has it?",
  "tags": [
    "rabbitology",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-23T17:08:00+00:00"
}