{
  "url": "https://voxday.net/2015/04/09/sun-tzu-and-sjws/",
  "scraped_at": "2025-12-16T12:51:37.344278",
  "title": "Sun Tzu and the SJWs",
  "date_display": "April 9, 2015",
  "date_iso": "2015-04-09T09:31:00+00:00",
  "date_from_url": "2015-04-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In the podcast interview last night, I made a comment about how SJWs have been able to apply one element of Sun Tzu’s strategic recommendations to great success throughout the culture. And, when I thought a bit more about it, I realized there is also a second element that their deceitful nature allows them to successfully implement reliably without even being aware of it.</p><p>The first is this:</p><p><i>It has been said aforetime that he who<br> knows both sides has nothing to fear in a<br> hundred fights; he who is ignorant of the<br> enemy, and fixes his eyes only on his<br> own side, conquers, and the next time is<br> defeated; he who not only is ignorant of<br> the enemy, but also of his own resources,<br> is invariably defeated.</br></br></br></br></br></br></br></i></p><p>The second is this:</p><p><i>War is a thing of pretence: therefore,<br> when capable of action, we pretend disability;<br> when near to the enemy, we<br> pretend to be far; when far away, we<br> pretend to be near. Allure the enemy by giving him a small<br> advantage. Confuse and capture him. If<br> there be defects, give an appearance of<br> perfection, and awe the enemy. Pretend<br> to be strong, and so cause the enemy to<br> avoid you. Make him angry, and confuse<br> his plans. Pretend to be inferior, and<br> cause him to despise you. If he have <a href=\"https://www.blogger.com/null\" id=\"Page_20\" name=\"Page_20\"></a>superabundance of strength, tire him out;<br> if united, make divisions in his camp.<br> Attack weak points, and appear in unexpected<br> places.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></i></p><p>Remember, SJWs ALWAYS LIE. Deceit is not second nature to them, it is their first and most reliable instinct. They will lie when they do not have to. They will lie when there is no reason to. They will lie when their lies are easily detected. They will lie when their lies are bound to be exposed. They will lie and and dissemble and exaggerate and spin with such shameless abandon that the average individual will find it almost impossible to believe they are doing so.<br> <i> </i></br></p><p>And because war is a thing of pretence, their deceitful nature makes them very successful in conflict as long as their enemy does not realize how deceitful they are, anticipate their inevitable pretenses, and take advantage of them.</p><p>Sun Tzu says: “victory is to the side that excels<br> <i>in the foregoing matters</i>.” That means that if you do not anticipate SJW deceit, if you are not proactively prepared to penetrate, expose, and defend against their lies, you <i>will </i>lose to them.</br></p><p>But defeat is not inevitable, it’s not even likely, given the first element. Due to their deceitful and self-deceptive natures, SJWs neither know themselves nor their enemy. I’ll have a post later today demonstrating this: their descriptions of me and my motivations are risibly far off the mark. Because they are emotional and for the most part limited to the rhetorical level, no amount of information is capable of changing their minds, so SJW failure tends to reinforce itself rather than be corrected. (That’s why they always double-down right up until they give up.)</p><p>This ignorant self-delusion is significantly to our advantage. The problem conservatives have is that while they know themselves, they fix their eyes only on their own side and remain ignorant of the enemy. Thus the conservative “conquers, and the next time is defeated”. The conservative knows himself and mistakenly assumes that his enemy is just like him.</p><p>Because they know neither themselves nor us, the SJWs will be “invariably defeated” so long as we identify them and see them for what they are: liars and self-deceivers. We have the ability to win every conflict with them, and yet we will inevitably lose everywhere we refuse to see them for what they are or refuse to take the field.</p><p>And, by the by, this is why reading books like <a href=\"http://www.amazon.com/History-Strategy-Sun-William-Lind-ebook/dp/B00V94520E\"><i><b>A HISTORY OF STRATEGY</b></i></a> is so often useful. One simply never knows how the intellectual seeds planted by the author will sprout in one’s mind.</p><p>UPDATE: Case in point:</p><blockquote class=\"tr_bq\"><p> 神乃木荘龍 ‏<a href=\"https://twitter.com/SoryuKaminogi/status/586127164128366593\">@SoryuKaminogi</a><br> .@voxday You’re abysmally stupid and yet somehow disturbingly malign. Like a crocodile or a cancerous hangnail. </br></p></blockquote><p>Notice how their rhetoric is incoherent. They have to cling to the idea that their enemy is stupid – to do otherwise would risk harming their fragile self-esteem – but somehow this “abysmally stupid” opponent is a dangerous risk. This can only be explained by attributing the danger to evil that goes well beyond the pedestrian variety, and reaches the level of disturbing malignity.</p><p>So, they choose to believe in a very stupid, very malignant enemy rather than an intelligent opposition. Needless to say, this violates the first principle mentioned above, which is to know your enemy. They simply don’t know themselves well enough to permit them to do that.</p></div>",
  "content_text": "In the podcast interview last night, I made a comment about how SJWs have been able to apply one element of Sun Tzu’s strategic recommendations to great success throughout the culture. And, when I thought a bit more about it, I realized there is also a second element that their deceitful nature allows them to successfully implement reliably without even being aware of it.\nThe first is this:\nIt has been said aforetime that he who\nknows both sides has nothing to fear in a\nhundred fights; he who is ignorant of the\nenemy, and fixes his eyes only on his\nown side, conquers, and the next time is\ndefeated; he who not only is ignorant of\nthe enemy, but also of his own resources,\nis invariably defeated.\nThe second is this:\nWar is a thing of pretence: therefore,\nwhen capable of action, we pretend disability;\nwhen near to the enemy, we\npretend to be far; when far away, we\npretend to be near. Allure the enemy by giving him a small\nadvantage. Confuse and capture him. If\nthere be defects, give an appearance of\nperfection, and awe the enemy. Pretend\nto be strong, and so cause the enemy to\navoid you. Make him angry, and confuse\nhis plans. Pretend to be inferior, and\ncause him to despise you. If he have\nsuperabundance of strength, tire him out;\nif united, make divisions in his camp.\nAttack weak points, and appear in unexpected\nplaces.\nRemember, SJWs ALWAYS LIE. Deceit is not second nature to them, it is their first and most reliable instinct. They will lie when they do not have to. They will lie when there is no reason to. They will lie when their lies are easily detected. They will lie when their lies are bound to be exposed. They will lie and and dissemble and exaggerate and spin with such shameless abandon that the average individual will find it almost impossible to believe they are doing so.\nAnd because war is a thing of pretence, their deceitful nature makes them very successful in conflict as long as their enemy does not realize how deceitful they are, anticipate their inevitable pretenses, and take advantage of them.\nSun Tzu says: “victory is to the side that excels\nin the foregoing matters\n.” That means that if you do not anticipate SJW deceit, if you are not proactively prepared to penetrate, expose, and defend against their lies, you\nwill\nlose to them.\nBut defeat is not inevitable, it’s not even likely, given the first element. Due to their deceitful and self-deceptive natures, SJWs neither know themselves nor their enemy. I’ll have a post later today demonstrating this: their descriptions of me and my motivations are risibly far off the mark. Because they are emotional and for the most part limited to the rhetorical level, no amount of information is capable of changing their minds, so SJW failure tends to reinforce itself rather than be corrected. (That’s why they always double-down right up until they give up.)\nThis ignorant self-delusion is significantly to our advantage. The problem conservatives have is that while they know themselves, they fix their eyes only on their own side and remain ignorant of the enemy. Thus the conservative “conquers, and the next time is defeated”. The conservative knows himself and mistakenly assumes that his enemy is just like him.\nBecause they know neither themselves nor us, the SJWs will be “invariably defeated” so long as we identify them and see them for what they are: liars and self-deceivers. We have the ability to win every conflict with them, and yet we will inevitably lose everywhere we refuse to see them for what they are or refuse to take the field.\nAnd, by the by, this is why reading books like\nA HISTORY OF STRATEGY\nis so often useful. One simply never knows how the intellectual seeds planted by the author will sprout in one’s mind.\nUPDATE: Case in point:\n神乃木荘龍 ‏\n@SoryuKaminogi\n.@voxday You’re abysmally stupid and yet somehow disturbingly malign. Like a crocodile or a cancerous hangnail.\nNotice how their rhetoric is incoherent. They have to cling to the idea that their enemy is stupid – to do otherwise would risk harming their fragile self-esteem – but somehow this “abysmally stupid” opponent is a dangerous risk. This can only be explained by attributing the danger to evil that goes well beyond the pedestrian variety, and reaches the level of disturbing malignity.\nSo, they choose to believe in a very stupid, very malignant enemy rather than an intelligent opposition. Needless to say, this violates the first principle mentioned above, which is to know your enemy. They simply don’t know themselves well enough to permit them to do that.",
  "tags": [
    "SJW",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-09T08:31:00+00:00"
}