{
  "url": "https://voxday.net/2015/04/01/the-racist-sjws-of-making-lig/",
  "scraped_at": "2025-12-16T12:50:42.623687",
  "title": "The racist SJWs of Making Light",
  "date_display": "April 1, 2015",
  "date_iso": "2015-04-01T23:30:00+00:00",
  "date_from_url": "2015-04-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s incredible, but now they’re trying to say I’m not a real Native American and Hispanics are just white people like everyone else. Because, after all, everyone knows that all Native Americans are good little Indians who stay on their intellectual reservations and only believe what the nice white liberals tell them what they can and cannot read, write, and think:</p><blockquote class=\"tr_bq\"><p> #942 ::: Alex R. ::: (view all by) ::: April 01, 2015, 10:32 AM:<br> Definitely spoiled white boys. Without ever having met one in person, it’s written all over their behavior. And paranoid too, in a particularly white and spoiled fashion. Please note that the word “boys” was chosen carefully. Boys self-nominate and involve their friends. Men (and women too) who want awards slog it out in the trenches and try to raise their game.</br></p><p>#948 ::: Matt ::: (view all by) ::: April 01, 2015, 11:01 AM:<br> I think the behavior you describe is pretty accurate, but I don’t think it’s a white boy thing as much as it is a rich, conservative boy thing. After all, the leader of sad puppies, Correia, isn’t a white guy (and I think that the lack of support by other other minorities in the field is part of his “persecuted for his political beliefs” narrative).</br></p><p> #960 ::: Kelly Jennings ::: (view all by) ::: April 01, 2015, 12:03 PM:<br> Vox Day also claims to be a minority! An American Indian! Based on some genetic test he claims he took.</br></p><p>I mean, I’m sure no one would lie about something like that, for political reasons, or tactical reasons, or to bash liberals on his blog or twitter or whatever. Nah.</p><p>#961 ::: abi ::: (view all by) ::: April 01, 2015, 12:09 PM:<br> The footnote to my comment above notwithstanding, let’s tread lightly on the subject of whether any individual in this debate is or is not a member of any particular group.</br></p><p>Identity policing doesn’t tend to end well. Or start well. And the middle bits tend to stink, too.</p><p>There’s plenty to say that doesn’t go there.</p><p>#963 ::: Kelly Jennings ::: (view all by) ::: April 01, 2015, 12:12 PM:<br> Okay. Though VD’s use of that particular tactic has been a vexation to me, frankly. But okay.</br></p><p>#975 ::: Mike Scott ::: (view all by) ::: April 01, 2015, 01:23 PM:<br> Cat @950. If Correia’s ancestors come from Portugal, then he’s white. The Portuguese are white Europeans, the same as the rest of Europe. They doubtless have a bit more Arab and Berber than say the Swedish, but not enough to make any real difference. Remember, there’s no such race as “Hispanic”, which is mostly a mixture of white European and Native American in varying proportions.</br></p></blockquote><p>It’s rather astonishing that these racist SJWs will openly assert that a genuine Native American simply cannot hold the opinions that I do. They may not like it, but I am a real Indian, complete with tribe, reservation, casino, and language. I even know a few words of the latter, although I am not one of the small number of people who speak it. And I can absolutely prove it.</p><p>They seem to think that minorities are pets who should be happy with whatever crumbs they deign to dole out to us. I say we take their thinning, greying scalps instead.</p></div>",
  "content_text": "It’s incredible, but now they’re trying to say I’m not a real Native American and Hispanics are just white people like everyone else. Because, after all, everyone knows that all Native Americans are good little Indians who stay on their intellectual reservations and only believe what the nice white liberals tell them what they can and cannot read, write, and think:\n#942 ::: Alex R. ::: (view all by) ::: April 01, 2015, 10:32 AM:\nDefinitely spoiled white boys. Without ever having met one in person, it’s written all over their behavior. And paranoid too, in a particularly white and spoiled fashion. Please note that the word “boys” was chosen carefully. Boys self-nominate and involve their friends. Men (and women too) who want awards slog it out in the trenches and try to raise their game.\n#948 ::: Matt ::: (view all by) ::: April 01, 2015, 11:01 AM:\nI think the behavior you describe is pretty accurate, but I don’t think it’s a white boy thing as much as it is a rich, conservative boy thing. After all, the leader of sad puppies, Correia, isn’t a white guy (and I think that the lack of support by other other minorities in the field is part of his “persecuted for his political beliefs” narrative).\n#960 ::: Kelly Jennings ::: (view all by) ::: April 01, 2015, 12:03 PM:\nVox Day also claims to be a minority! An American Indian! Based on some genetic test he claims he took.\nI mean, I’m sure no one would lie about something like that, for political reasons, or tactical reasons, or to bash liberals on his blog or twitter or whatever. Nah.\n#961 ::: abi ::: (view all by) ::: April 01, 2015, 12:09 PM:\nThe footnote to my comment above notwithstanding, let’s tread lightly on the subject of whether any individual in this debate is or is not a member of any particular group.\nIdentity policing doesn’t tend to end well. Or start well. And the middle bits tend to stink, too.\nThere’s plenty to say that doesn’t go there.\n#963 ::: Kelly Jennings ::: (view all by) ::: April 01, 2015, 12:12 PM:\nOkay. Though VD’s use of that particular tactic has been a vexation to me, frankly. But okay.\n#975 ::: Mike Scott ::: (view all by) ::: April 01, 2015, 01:23 PM:\nCat @950. If Correia’s ancestors come from Portugal, then he’s white. The Portuguese are white Europeans, the same as the rest of Europe. They doubtless have a bit more Arab and Berber than say the Swedish, but not enough to make any real difference. Remember, there’s no such race as “Hispanic”, which is mostly a mixture of white European and Native American in varying proportions.\nIt’s rather astonishing that these racist SJWs will openly assert that a genuine Native American simply cannot hold the opinions that I do. They may not like it, but I am a real Indian, complete with tribe, reservation, casino, and language. I even know a few words of the latter, although I am not one of the small number of people who speak it. And I can absolutely prove it.\nThey seem to think that minorities are pets who should be happy with whatever crumbs they deign to dole out to us. I say we take their thinning, greying scalps instead.",
  "tags": [
    "SJW",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-01T22:30:00+00:00"
}