{
  "url": "https://voxday.net/2015/04/14/the-international-lord-of-hate-fisks/",
  "scraped_at": "2025-12-16T12:52:17.546212",
  "title": "The International Lord of Hate fisks GRRM",
  "date_display": "April 14, 2015",
  "date_iso": "2015-04-14T16:00:00+00:00",
  "date_from_url": "2015-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The results are <a href=\"http://monsterhunternation.com/2015/04/14/george-r-r-martin-responds/\">pretty much as you’d imagine</a>:</p><blockquote class=\"tr_bq\"><p> MARTIN : <i>Scalzi — look, I know Scalzi is liberal, and I know that the<br> Puppies seem to hate him, though I can’t for the life of me understand<br> why — but whatever you think of the writer’s politics, REDSHIRTS is a<br> light, fun, amusing SF adventure, an affectionate riff off of STAR TREK,<br> Ghu help us</br></br></br></br></i><br> <i> </i><br> <br> CORREIA:<b> No, I think he’s a fine of working a popularity contest.<br> Redshirts was a light read, but I’m on record already disagreeing about<br> amusing or fun and leave it at that. As for not understanding how my<br> side could possibly dislike this man, here is him being gracious in<br> victory the night last year’s final Hugo awards were announced: </br></br></br></br></b></br></br></br></p><p>John Scalzi @scalzi<br> I’m not going to lie. I’m going to be THRILLED to snarkread the whiny “I<br> didn’t want it anyway” nonsense that will squirt forth tomorrow.<br> John Scalzi @scalzi<br> WE ARE GOING TO MAKE THE HUGO SLATE A REFERENDUM ON THE FUTURE OF SCIENCE FICTION (loses) THE HUGOS DON’T MATTER ANYWAY<br> John Scalzi @scalzi<br> SHUT UP I AM NOT CRYING IT’S THAT LITTLE FLECKS OF GUNPOWDER FELL INTO<br> MY EYEBALLS SOMEONE GET ME A FLAMING SWORD SO I CAN FLICK THEM OUT<br> John Scalzi @scalzi<br> WHO IS CALLING ME PASSIVE AGGRESSIVE I AM ALL AGGRESSIVE DON’T YOU SEE<br> THIS HUGE GUN I HAVE WITH ME AT ALL TIMES (breaks down, sobbing)<br> John Scalzi @scalzi<br> AND NOW I WILL IGNORE THE HUGOS AGAIN UNTIL NEXT YEAR WHEN MY FEELINGS<br> OF PASSIVE AGGRESSIVE INADEQUACY ANGRILY WELL UP ONCE MORE<br> John Scalzi @scalzi<br> I’VE LEARNED MY LESSON AND MY LESSON IS THAT WE DIDN’T HAVE ENOUGH<br> PATENT RACIST SHITBAGGERY ON OUR SLATE WHAT THAT WAS GOOD WRITING MAN<br> John Scalzi @scalzi<br> ITS PROOF THAT ALL THE FEMINISTS NEED TO DO TO WIN AWARDS IS WRITE BETTER STORIES ACCORDING TO THE JUDGEMENT OF THE FANS SHEEESH<br> John Scalzi @scalzi<br> I NEVER WANTED THE AWARD THAT’S WHY I’VE WHINED LIKE A KICKED DOG ABOUT IT FOR A COUPLE YEARS RUNNING.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p><b>Simply can’t imagine why my side doesn’t care for him… But<br> anyways, we’ve got plenty more examples of him being classy if you’d<br> like them. </br></br></b></p><p>MARTIN: <i>I try to assist other authors (and artists, and filmmakers, and fan writers) as well, by recommending their works on my Not A Blog. Sometimes it works. More often it does not. If you do the same thing, I doubt anyone will have a problem with it.</i></p><p>CORREIA: <b>They sure minded when I did that last year.</b></p><p>MARTIN: <i>The backlash you are getting now is because you went way beyond that. Yes, all completely legal… but your campaign, your slate tactics, did not just get some authors you overlooked onto the ballot, it pretty much drove everyone else off the ballot. In the three short fiction categories, there are no choices but your choices (well, yours, and Brad Torgersen’s, and Vox Day’s). You say you just wanted a seat at the table. But you kicked over the table, and took ALL the seats.</i></p><p>CORREIA: <b>So we obeyed all the rules, but violated the secret gentleman’s agreement you guys had in place.</b> <b>You know that we didn’t expect to sweep the categories. Some of the categories that were swept weren’t even because of Sad Puppies, but by Vox Day’s separate campaign that I had absolutely zero control over. </b></p><p>MARTIN:<i> Your public platform was all about restoring “quality” to the<br> Hugos, and yet one of your standard bearers was the worst piece of<br> writing on the ballot. (In my opinion, of course. All of this is<br> opinion).</br></br></br></i></p><p>CORREIA: <b>So, I let something you don’t like get onto the ballot, and<br> that destroys every other work on the ballot, and it also destroys every<br> other work on the ballot the next year, and I’m assuming it destroys<br> every work on the ballot forever. Those are some harsh double standards<br> you’ve got there.</br></br></br></br></b></p><p><b>But it doesn’t really matter, because Vox is off doing his<br> own thing. You tried to shun a man who is incapable of being shunned. He<br> got kicked out of the market, so went and built his own market. The<br> more you go after him, the stronger he gets. I don’t think you guys<br> realize that most of me and Brad’s communication with Vox consists of us<br> asking him to be nice and not burn it all down out of spite. </br></br></br></br></br></b></p></blockquote><p>That’s almost entirely true. Brad and Larry understood that the Dread Ilk are formidable even as the other side was pretending that my readership is nothing but me and my imaginary wife. Although it isn’t spite that tempts me to burn it all down so much as my sheer love of chaos. Chaos always favors the fast-thinking and tactically nimble. My favorite quote from Larry was this: “I nominated Vox Day because Satan didn’t have any eligible works that period.”</p><p>Now, I know some of you are annoyed that Larry and Brad are not responding to the attacks of George Martin and other SJWs by publicly swearing blood brotherhood with me. Don’t be. They live in that community and have to find a way to abide them. We don’t. Larry and Brad are not my pack, the Dread Ilk and the Rabid Puppies are. Science fiction fandom is not my family, #GamerGate is.</p><p>They are allies. But they are not responsible for me and they have no control over me. That’s really all they are pointing out to the other side. Of course they don’t agree with me on everything, no one here does either.</p><p>One more thing. Larry also understands exactly what I am doing. This is only the beginning. We have laid the foundations for a towering structure that will one day loom over their gates and leave their walled gardens in its shadow. They don’t need to worry about us burning down their little tor. They need to worry that we won’t even see any reason to bother.</p></div>",
  "content_text": "The results are\npretty much as you’d imagine\n:\nMARTIN :\nScalzi — look, I know Scalzi is liberal, and I know that the\nPuppies seem to hate him, though I can’t for the life of me understand\nwhy — but whatever you think of the writer’s politics, REDSHIRTS is a\nlight, fun, amusing SF adventure, an affectionate riff off of STAR TREK,\nGhu help us\nCORREIA:\nNo, I think he’s a fine of working a popularity contest.\nRedshirts was a light read, but I’m on record already disagreeing about\namusing or fun and leave it at that. As for not understanding how my\nside could possibly dislike this man, here is him being gracious in\nvictory the night last year’s final Hugo awards were announced:\nJohn Scalzi @scalzi\nI’m not going to lie. I’m going to be THRILLED to snarkread the whiny “I\ndidn’t want it anyway” nonsense that will squirt forth tomorrow.\nJohn Scalzi @scalzi\nWE ARE GOING TO MAKE THE HUGO SLATE A REFERENDUM ON THE FUTURE OF SCIENCE FICTION (loses) THE HUGOS DON’T MATTER ANYWAY\nJohn Scalzi @scalzi\nSHUT UP I AM NOT CRYING IT’S THAT LITTLE FLECKS OF GUNPOWDER FELL INTO\nMY EYEBALLS SOMEONE GET ME A FLAMING SWORD SO I CAN FLICK THEM OUT\nJohn Scalzi @scalzi\nWHO IS CALLING ME PASSIVE AGGRESSIVE I AM ALL AGGRESSIVE DON’T YOU SEE\nTHIS HUGE GUN I HAVE WITH ME AT ALL TIMES (breaks down, sobbing)\nJohn Scalzi @scalzi\nAND NOW I WILL IGNORE THE HUGOS AGAIN UNTIL NEXT YEAR WHEN MY FEELINGS\nOF PASSIVE AGGRESSIVE INADEQUACY ANGRILY WELL UP ONCE MORE\nJohn Scalzi @scalzi\nI’VE LEARNED MY LESSON AND MY LESSON IS THAT WE DIDN’T HAVE ENOUGH\nPATENT RACIST SHITBAGGERY ON OUR SLATE WHAT THAT WAS GOOD WRITING MAN\nJohn Scalzi @scalzi\nITS PROOF THAT ALL THE FEMINISTS NEED TO DO TO WIN AWARDS IS WRITE BETTER STORIES ACCORDING TO THE JUDGEMENT OF THE FANS SHEEESH\nJohn Scalzi @scalzi\nI NEVER WANTED THE AWARD THAT’S WHY I’VE WHINED LIKE A KICKED DOG ABOUT IT FOR A COUPLE YEARS RUNNING.\nSimply can’t imagine why my side doesn’t care for him… But\nanyways, we’ve got plenty more examples of him being classy if you’d\nlike them.\nMARTIN:\nI try to assist other authors (and artists, and filmmakers, and fan writers) as well, by recommending their works on my Not A Blog. Sometimes it works. More often it does not. If you do the same thing, I doubt anyone will have a problem with it.\nCORREIA:\nThey sure minded when I did that last year.\nMARTIN:\nThe backlash you are getting now is because you went way beyond that. Yes, all completely legal… but your campaign, your slate tactics, did not just get some authors you overlooked onto the ballot, it pretty much drove everyone else off the ballot. In the three short fiction categories, there are no choices but your choices (well, yours, and Brad Torgersen’s, and Vox Day’s). You say you just wanted a seat at the table. But you kicked over the table, and took ALL the seats.\nCORREIA:\nSo we obeyed all the rules, but violated the secret gentleman’s agreement you guys had in place.\nYou know that we didn’t expect to sweep the categories. Some of the categories that were swept weren’t even because of Sad Puppies, but by Vox Day’s separate campaign that I had absolutely zero control over.\nMARTIN:\nYour public platform was all about restoring “quality” to the\nHugos, and yet one of your standard bearers was the worst piece of\nwriting on the ballot. (In my opinion, of course. All of this is\nopinion).\nCORREIA:\nSo, I let something you don’t like get onto the ballot, and\nthat destroys every other work on the ballot, and it also destroys every\nother work on the ballot the next year, and I’m assuming it destroys\nevery work on the ballot forever. Those are some harsh double standards\nyou’ve got there.\nBut it doesn’t really matter, because Vox is off doing his\nown thing. You tried to shun a man who is incapable of being shunned. He\ngot kicked out of the market, so went and built his own market. The\nmore you go after him, the stronger he gets. I don’t think you guys\nrealize that most of me and Brad’s communication with Vox consists of us\nasking him to be nice and not burn it all down out of spite.\nThat’s almost entirely true. Brad and Larry understood that the Dread Ilk are formidable even as the other side was pretending that my readership is nothing but me and my imaginary wife. Although it isn’t spite that tempts me to burn it all down so much as my sheer love of chaos. Chaos always favors the fast-thinking and tactically nimble. My favorite quote from Larry was this: “I nominated Vox Day because Satan didn’t have any eligible works that period.”\nNow, I know some of you are annoyed that Larry and Brad are not responding to the attacks of George Martin and other SJWs by publicly swearing blood brotherhood with me. Don’t be. They live in that community and have to find a way to abide them. We don’t. Larry and Brad are not my pack, the Dread Ilk and the Rabid Puppies are. Science fiction fandom is not my family, #GamerGate is.\nThey are allies. But they are not responsible for me and they have no control over me. That’s really all they are pointing out to the other side. Of course they don’t agree with me on everything, no one here does either.\nOne more thing. Larry also understands exactly what I am doing. This is only the beginning. We have laid the foundations for a towering structure that will one day loom over their gates and leave their walled gardens in its shadow. They don’t need to worry about us burning down their little tor. They need to worry that we won’t even see any reason to bother.",
  "tags": [
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-14T15:00:00+00:00"
}