{
  "url": "https://voxday.net/2015/04/27/the-return-of-there-will-be-war-2/",
  "scraped_at": "2025-12-16T12:53:42.727116",
  "title": "The return of THERE WILL BE WAR",
  "date_display": "April 27, 2015",
  "date_iso": "2015-04-27T12:03:00+00:00",
  "date_from_url": "2015-04-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.amazon.com/There-Will-Be-War-I-ebook/dp/B00WONO0C0\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/04/TWBWv1_480.jpg\" width=\"250\"/></a></div><p>From <i>The Year’s Best Science Fiction</i> to <i>Thieves World</i>, I have always been a fan of anthologies. I find it interesting to read the work of various authors as they address similar topics; in some ways, appearances in anthologies allows the reader to better distinguish the true masters from the journeymen, the stunt writers, the formulaists, and the one-trick ponies. It’s also intriguing to see the difference between authors who are adept with the short form and novelists who really need more textual space within which to work. And of all the anthologies I ever read in my youth, my absolute favorite was <a href=\"http://www.amazon.com/There-Will-Be-War-I-ebook/dp/B00WONO0C0\"><b><i>THERE WILL BE WAR</i></b></a>, created by none other than the science fiction great Dr. Jerry Pournelle himself.</p><p>To me, Jerry Pournelle was a near-mythic name that appeared on the shelves of B. Dalton’s like an omnipresent demigod. I enjoyed his non-fiction essays even more than most of the fiction for which he was most famous, and looking back, he probably had as significant an impact on my intellectual development as Milton Friedman, Joseph Schumpeter, or Camille Paglia, not only as a writer, but as an editor. When I first read the first volume of <a href=\"http://www.amazon.com/There-Will-Be-War-I-ebook/dp/B00WONO0C0\"><b><i>THERE WILL BE WAR</i></b></a>, with the unforgettable cover of a white-helmeted spotter calling in orbital artillery, I was deeply impressed by the way in which the essays informed the short stories as well as how the short stories tended to bring the essay subjects to life and make them more relevant to the reader.</p><p>And the names! Gordon R. Dickson. Philip K. Dick. Arthur C. Clarke. Poul Anderson. Joel Rosenberg. Robert Silverberg. Joe Haldeman. Niven and Pournelle. What was most impressive, however, was the way in which even the stories by the biggest names were occasionally trumped by then-unfamiliar names like Orson Scott Card, Edward P. Hughes, and above all, William F. Wu. THERE WILL BE WAR ran from 1982 to 1990, and finally came to an end around the same time as the Soviet Union, which had often served as a primary topic in the nine-volume series. It seemed apropos, after all. The Berlin Wall had fallen, an end to history had been reached, the long-warring nations of Europe were heading for monetary union, and, everyone assumed, peaceful political union as well, and many presumed that an end to war as we knew it was in sight as well. There would be no more war.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.amazon.com/Riding-Red-Horse-Christopher-Nuttall-ebook/dp/B00QZD9H5K/ref=zg_bs_156666011_8\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/04/RH1_900.jpg\" width=\"198\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2015/04/RH1_900.jpg\" decoding=\"async\" height=\"320\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20198%20320%22%3E%3C/svg%3E\" width=\"198\"/></a></div><p>Being, as readers here know, somewhat of a pessimist when it comes to such utopian claims, reviving THERE WILL BE WAR was one of my first ideas when Castalia House was founded. I contacted Dr. Pournelle about it, but although he generally favored the idea, we never really got around to discussing it very seriously. I went with Plan B and created <a href=\"http://www.amazon.com/Riding-Red-Horse-Christopher-Nuttall-ebook/dp/B00QZD9H5K/ref=zg_bs_156666011_8\"><i><b>RIDING THE RED HORSE </b></i></a>with LTC Tom Kratman instead. But I still wanted Dr. Pournelle to be involved, as I considered RED HORSE to be the spiritual successor of THERE WILL BE WAR. Upon being asked for a contribution, Dr. Pournelle graciously permitted me to include two of his pieces, a well-known short story set in the CoDominium universe<b> </b>called “His Truth Goes Marching On” and an article on wargame design that I found to be particularly interesting. Tom also obtained a contribution from John Carr, the associate editor on several volumes of THERE WILL BE WAR, including the first one. RIDING THE RED HORSE was published last December and it has been very<br> well received. Five months after its release, it is still one of <a href=\"http://www.amazon.com/gp/bestsellers/digital-text/156666011/ref=pd_zg_hrsr_kstore_1_5_last\">the top ten bestsellers in Military Strategy </a>and more than one reviewer has even referred to it as a virtual “tenth volume” of THERE WILL BE WAR.</br></p><p><a href=\"http://www.amazon.com/There-Will-Be-War-II-ebook/dp/B00WOM86I0\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"400\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/04/TWBWv2_480.jpg\" width=\"250\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2015/04/TWBWv2_480.jpg\" decoding=\"async\" height=\"400\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20250%20400%22%3E%3C/svg%3E\" width=\"250\"/></a>But the most significant response came from Dr. Pournelle, as after looking over the new anthology, he asked me if Castalia House might be interested in republishing his own out-of-print anthology series. I allowed that, yes, perhaps Castalia might have some modest interest in considering a discussion of the possibility, immediately put it on top of our priority list, and after a few months of hard work from the ad hoc THERE WILL BE WAR team, I am very, very, very pleased to be able to announce not only the republishing of THERE WILL BE WAR Volumes I and II, but also the revival of the THERE WILL BE WAR anthology series with an actual Volume X, edited by Jerry Pournelle, as well. <a href=\"http://www.amazon.com/There-Will-Be-War-Volume-ebook/dp/B00WONO0C0\"><i><b>Volume I</b></i></a> and <a href=\"http://www.amazon.com/There-Will-Be-War-II-ebook/dp/B00WOM86I0\"><i><b>Volume II</b></i></a> of THERE WILL BE WAR are now available in ebook at Amazon and <a href=\"http://www.castaliahouse.com/downloads/category/military/\">Castalia House </a>for $4.99 each, and as the following reviewer of Volume I noted, despite being 33 years old, they have a lot to offer the younger generations who never had a chance to read them before. It was very rewarding to read <a href=\"http://www.amazon.com/gp/customer-reviews/R3GJLEYJHCSC36/ref=cm_cr_pr_rvw_ttl?ie=UTF8&amp;ASIN=B00WONO0C0\">the first review of Volume I</a> from a reader too young to have encountered the original paperbacks.</p><blockquote class=\"tr_bq\"><p> This book is astonishing.  A<br> collection of short military science-fiction and essays put together in<br> the early 80s by Jerry Pournelle, the book is older than I am and yet<br> somehow manages to avoid seeming dated at all.  The book was extremely<br> well-regarded when it came out, and spawned a nine volume series, but<br> for years has languished in semi-obscurity. How good is it?  It’s got<br> the original “Ender’s Game” novella by Orson Scott Card, and that’s not<br> even the best story in the book!</br></br></br></br></br></br></br></p><p>If you’re a younger reader, odds are<br> you’ve never even heard of half of these writers.  And they’re all<br> good.  The stories are diverse, with everything from post-apocalyptic<br> shootouts to huge sci-fi space battles.  Sometimes the heroes win, and<br> sometimes they don’t.  But every time I found myself rooting for them.</br></br></br></br></p><p>But<br> the real prize of the book is the non-fiction essays, which give a<br> window into how scary the world was back when the Soviet Union was still<br> a threat.  One of the essays, ‘The Soviet Strategic Threat From Space”,<br> discusses the end of the world in a cold, scientific manner that’s more<br> chilling than any fiction could ever be.<br> <br> “There Will Be War”<br> introduced me to a ton of great new authors, and entire series that I<br> had no clue even existed.  For someone who’s just getting into science<br> fiction, it’s a wonderful starting point.  For veterans, it’s a way to<br> revisit some of the old greats.</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>I will post later today at Castalia House about some of my favorites from these first two volumes, but I can assure you that if you enjoyed <i>RIDING THE RED HORSE</i> in any way, shape, or form, you will be find Volume I and Volume II of <i>THERE WILL BE WAR</i> to be very well worth reading. I very highly recommend both volumes.</p><p><b>Amazon (Kindle format) </b></p><ul><li><a href=\"http://www.amazon.com/There-Will-Be-War-Volume-ebook/dp/B00WONO0C0\"><i>THERE WILL BE WAR Volume I</i></a></li><li><a href=\"http://www.amazon.com/There-Will-Be-War-II-ebook/dp/B00WOM86I0\"><i>THERE WILL BE WAR Volume II </i></a></li></ul><p><b>Castalia House (EPUB and Kindle formats)</b></p><ul><li><i><a href=\"http://www.castaliahouse.com/downloads/there-will-be-war-vol-i/\">THERE WILL BE WAR Volume I</a></i></li><li><i><a href=\"http://www.castaliahouse.com/downloads/there-will-be-war-vol-ii/\">THERE WILL BE WAR Volume II</a></i></li></ul><p><b>FAQ</b></p><ul><li><i> Will these be released in print versions as well? </i>Yes, in two-volume case laminated omnibus hardcovers. The first will probably appear in the July-August timeframe.</li><li><i>When will the next volumes be released?</i> We expect to release Volumes III and IV in company with the VI+VII hardcover.</li><li><i>Does this mean the end of RIDING THE RED HORSE?</i> No. <i>RIDING THE RED HORSE Vol. 2</i> will focus on entirely new fiction.<i> THERE WILL BE WAR Vol. X </i>will consist primarily of Dr. Pournelle’s selections from the best and most significant military fiction published between 1990 and 2015.</li><li><i>Who did the covers? </i>Jartstar and Chris came up with the title layout and a new artist, Lars, did the updated 3D images that are homages to the original painted covers. He’ll be doing the entire series. </li><li><i>Can we review the books on Amazon if we bought them from Castalia or read them previously?</i> By all means, please do.</li></ul></div>",
  "content_text": "From\nThe Year’s Best Science Fiction\nto\nThieves World\n, I have always been a fan of anthologies. I find it interesting to read the work of various authors as they address similar topics; in some ways, appearances in anthologies allows the reader to better distinguish the true masters from the journeymen, the stunt writers, the formulaists, and the one-trick ponies. It’s also intriguing to see the difference between authors who are adept with the short form and novelists who really need more textual space within which to work. And of all the anthologies I ever read in my youth, my absolute favorite was\nTHERE WILL BE WAR\n, created by none other than the science fiction great Dr. Jerry Pournelle himself.\nTo me, Jerry Pournelle was a near-mythic name that appeared on the shelves of B. Dalton’s like an omnipresent demigod. I enjoyed his non-fiction essays even more than most of the fiction for which he was most famous, and looking back, he probably had as significant an impact on my intellectual development as Milton Friedman, Joseph Schumpeter, or Camille Paglia, not only as a writer, but as an editor. When I first read the first volume of\nTHERE WILL BE WAR\n, with the unforgettable cover of a white-helmeted spotter calling in orbital artillery, I was deeply impressed by the way in which the essays informed the short stories as well as how the short stories tended to bring the essay subjects to life and make them more relevant to the reader.\nAnd the names! Gordon R. Dickson. Philip K. Dick. Arthur C. Clarke. Poul Anderson. Joel Rosenberg. Robert Silverberg. Joe Haldeman. Niven and Pournelle. What was most impressive, however, was the way in which even the stories by the biggest names were occasionally trumped by then-unfamiliar names like Orson Scott Card, Edward P. Hughes, and above all, William F. Wu. THERE WILL BE WAR ran from 1982 to 1990, and finally came to an end around the same time as the Soviet Union, which had often served as a primary topic in the nine-volume series. It seemed apropos, after all. The Berlin Wall had fallen, an end to history had been reached, the long-warring nations of Europe were heading for monetary union, and, everyone assumed, peaceful political union as well, and many presumed that an end to war as we knew it was in sight as well. There would be no more war.\nBeing, as readers here know, somewhat of a pessimist when it comes to such utopian claims, reviving THERE WILL BE WAR was one of my first ideas when Castalia House was founded. I contacted Dr. Pournelle about it, but although he generally favored the idea, we never really got around to discussing it very seriously. I went with Plan B and created\nRIDING THE RED HORSE\nwith LTC Tom Kratman instead. But I still wanted Dr. Pournelle to be involved, as I considered RED HORSE to be the spiritual successor of THERE WILL BE WAR. Upon being asked for a contribution, Dr. Pournelle graciously permitted me to include two of his pieces, a well-known short story set in the CoDominium universe\ncalled “His Truth Goes Marching On” and an article on wargame design that I found to be particularly interesting. Tom also obtained a contribution from John Carr, the associate editor on several volumes of THERE WILL BE WAR, including the first one. RIDING THE RED HORSE was published last December and it has been very\nwell received. Five months after its release, it is still one of\nthe top ten bestsellers in Military Strategy\nand more than one reviewer has even referred to it as a virtual “tenth volume” of THERE WILL BE WAR.\nBut the most significant response came from Dr. Pournelle, as after looking over the new anthology, he asked me if Castalia House might be interested in republishing his own out-of-print anthology series. I allowed that, yes, perhaps Castalia might have some modest interest in considering a discussion of the possibility, immediately put it on top of our priority list, and after a few months of hard work from the ad hoc THERE WILL BE WAR team, I am very, very, very pleased to be able to announce not only the republishing of THERE WILL BE WAR Volumes I and II, but also the revival of the THERE WILL BE WAR anthology series with an actual Volume X, edited by Jerry Pournelle, as well.\nVolume I\nand\nVolume II\nof THERE WILL BE WAR are now available in ebook at Amazon and\nCastalia House\nfor $4.99 each, and as the following reviewer of Volume I noted, despite being 33 years old, they have a lot to offer the younger generations who never had a chance to read them before. It was very rewarding to read\nthe first review of Volume I\nfrom a reader too young to have encountered the original paperbacks.\nThis book is astonishing.  A\ncollection of short military science-fiction and essays put together in\nthe early 80s by Jerry Pournelle, the book is older than I am and yet\nsomehow manages to avoid seeming dated at all.  The book was extremely\nwell-regarded when it came out, and spawned a nine volume series, but\nfor years has languished in semi-obscurity. How good is it?  It’s got\nthe original “Ender’s Game” novella by Orson Scott Card, and that’s not\neven the best story in the book!\nIf you’re a younger reader, odds are\nyou’ve never even heard of half of these writers.  And they’re all\ngood.  The stories are diverse, with everything from post-apocalyptic\nshootouts to huge sci-fi space battles.  Sometimes the heroes win, and\nsometimes they don’t.  But every time I found myself rooting for them.\nBut\nthe real prize of the book is the non-fiction essays, which give a\nwindow into how scary the world was back when the Soviet Union was still\na threat.  One of the essays, ‘The Soviet Strategic Threat From Space”,\ndiscusses the end of the world in a cold, scientific manner that’s more\nchilling than any fiction could ever be.\n“There Will Be War”\nintroduced me to a ton of great new authors, and entire series that I\nhad no clue even existed.  For someone who’s just getting into science\nfiction, it’s a wonderful starting point.  For veterans, it’s a way to\nrevisit some of the old greats.\nI will post later today at Castalia House about some of my favorites from these first two volumes, but I can assure you that if you enjoyed\nRIDING THE RED HORSE\nin any way, shape, or form, you will be find Volume I and Volume II of\nTHERE WILL BE WAR\nto be very well worth reading. I very highly recommend both volumes.\nAmazon (Kindle format)\nTHERE WILL BE WAR Volume I\nTHERE WILL BE WAR Volume II\nCastalia House (EPUB and Kindle formats)\nTHERE WILL BE WAR Volume I\nTHERE WILL BE WAR Volume II\nFAQ\nWill these be released in print versions as well?\nYes, in two-volume case laminated omnibus hardcovers. The first will probably appear in the July-August timeframe.\nWhen will the next volumes be released?\nWe expect to release Volumes III and IV in company with the VI+VII hardcover.\nDoes this mean the end of RIDING THE RED HORSE?\nNo.\nRIDING THE RED HORSE Vol. 2\nwill focus on entirely new fiction.\nTHERE WILL BE WAR Vol. X\nwill consist primarily of Dr. Pournelle’s selections from the best and most significant military fiction published between 1990 and 2015.\nWho did the covers?\nJartstar and Chris came up with the title layout and a new artist, Lars, did the updated 3D images that are homages to the original painted covers. He’ll be doing the entire series.\nCan we review the books on Amazon if we bought them from Castalia or read them previously?\nBy all means, please do.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-27T11:03:00+00:00"
}