{
  "url": "https://voxday.net/2015/04/04/the-gates-of-hell-shall-not-prevai/",
  "scraped_at": "2025-12-16T12:50:57.793897",
  "title": "The Gates of Hell shall not prevail",
  "date_display": "April 4, 2015",
  "date_iso": "2015-04-04T09:46:00+00:00",
  "date_from_url": "2015-04-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Christians need to <a href=\"http://www.theamericanconservative.com/dreher/the-post-indiana-future-christian-religious-liberty-gay-rights/\">stop their cowardly cowering before the world</a> and start actively following the fearless lead of the apostles and martyrs and crusaders and inquisitors who preceded them:</p><blockquote class=\"tr_bq\"><p> I spent a long time on the phone last night with a law professor at one of the country’s elite law schools. This professor is a practicing Christian, deeply closeted in the workplace; he is convinced that if his colleagues in academia knew of his faith, they would make it very hard for him. We made contact initially by e-mail — he is a reader of this blog — and last night, by phone. He agreed to speak with me about the Indiana situation on condition that I not identify him by name or by institution. I do know his identity, and when he tells me that he is “well-informed about the academy and the Supreme Court,” I assure you that from where he sits, and teaches, and from his CV, he is telling the truth.</p><p>I will call him Prof. Kingsfield, after the law professor in The Paper Chase.</p><p>What prompted his reaching out to me? “I’m very worried,” he said, of events of the last week. “The constituency for religious liberty just isn’t there anymore.”</p><p>Like me, what unnerved Prof. Kingsfield is not so much the details of the Indiana law, but the way the overculture treated the law. “When a perfectly decent, pro-gay marriage religious liberty scholar like Doug Laycock, who is one of the best in the country — when what he says is distorted, you know how crazy it is.”</p><p>“Alasdair Macintyre is right,” he said. “It’s like a nuclear bomb went off, but in slow motion.” What he meant by this is that our culture has lost the ability to reason together, because too many of us want and believe radically incompatible things.</p><p>But only one side has the power…. A college professor who is already tenured is probably safe. Those who aren’t tenured, are in danger. Those who are believed to be religious, or at least religious in ways the legal overculture believes constitutes bigotry, will likely never be hired. For example, the professor said, he was privy to the debate within a faculty hiring meeting in which the candidacy of a liberal Christian was discussed. Though the candidate appeared in every sense to be quite liberal in her views, the fact that she was an open Christian prompted discussion as to whether or not the university would be hiring a “fundamentalist.”</p><p>The result could be that religious schools have to start policing orthodoxy in terms of all their hires — a situation imposing standards far more strict than many schools may wish to live by, but which may be necessary to protect the school’s legal interests.</p><p>Kingsfield said homeschooling, and homeschooling-ish things (e.g., co-ops), are going to become increasingly important to orthodox Christians, especially as they see established religious schools folding on this issue.</p><p>Businesses, however, are going to have a very hard time resisting what’s coming. Not that they would try. “The big companies have already gone over,” said Kingsfield.</p><p>“Most anti-discrimination laws have a certain cut off – they don’t apply if you have 15 employees or less,” he said. “You could have an independent, loosely affiliated network of artisans, working together. If you can refer people to others within the network, that could work. You won’t be able to scale up, but that’s not such a bad thing.”</p><p>Kingsfield said religious colleges and universities are going to have to think hard about their identities.</p><p>“Colleges that don’t receive federal funding – Hillsdale and Grove City are two I can think of – are going to be in better position, because federal regulations force a lot of crazy stuff on you,” he said. “I think it would be really wise for small religious institutions to think hard if they can cut the cord of federal funding and can find wealthy donors to step in.”</p><p>Kingsfield said we are going to have to watch closely the way the law breaks regarding gender identity and transgenderism. If the courts accept the theory that gender is a social construct — and there is a long line of legal theory and jurisprudence that says that it is — then the field of antidiscrimination law is bound to be expanded to cover, for example, people with penises who consider themselves women. The law, in other words, will compel citizens to live as if this were true — and religious liberty will, in general, be no fallback. This may well happen.</p><p>What about the big issue that is on the minds of many Christians who pay attention to this fight: the tax-exempt status of churches and religious organizations? Will they be Bob Jones’d over gay rights?</p><p>Kingsfield said that this is too deeply embedded in American thought and law to be at serious risk right now, but gay rights proponents will probably push to tie the tax exemption on charities with how closely integrated they are within churches. The closer schools and charities are tied to churches, especially in their hiring, the greater protection they will enjoy.</p><p>The accreditation issue is going to be a much stickier wicket. Accreditation is tied to things like the acceptance of financial aid, and the ability to get into graduate schools.</p><p>“There was a professor at Penn last year who wrote an article in the Chronicle of Higher Education calling for the end of accrediting religious colleges and universities,” Kingsfield said. “It was a Richard Dawkins kind of thing, just crazy. The fact that someone taking a position this hostile felt very comfortable putting this in the Chronicle tells me that there’s a non-trivial number of professors willing to believe this.”</p><p>Gordon College has faced pressure from a regional accrediting authority over its adherence to traditional Christian sexual morals re: gay rights.</p><p>“Accreditation is critical to being admitted to law schools and medical schools,” Kingsfield said. “College accreditation will matter for some purposes of sports, federal aid, and for the ability to be admitted by top graduate schools. Ghettoization for Christians could be the result.”</p><p>“In California right now, judges can’t belong to the Boy Scouts now. Who knows if in the future, lawyers won’t be able to belong to churches that are considered hate groups?” he said. “It’s certainly true that a lot of law firms will not now hire people who worked on cases defending those on the traditional marriage side. It’s going to close some professional doors. I certainly wouldn’t write about this stuff in my work, not if I wanted to have a chance at tenure. There’s a question among Christian law professors right now: do you write about these issues and risk tenure? This really does distort your scholarship. Christianity could make a distinct contribution to legal discussions, but it’s simply too risky to say what you really think.”</p><p>The emerging climate on campus of microaggressions, trigger warnings, and the construal of discourse as a form of violence is driving Christian professors further into the closet, the professor said.</p><p>“If I said something that was construed as attacking a gay student, I could have my life made miserable with a year or two of litigation — and if I didn’t have tenure, there could be a chance that my career would be ruined,” he said. “Even if you have tenure, a few people who make allegations of someone being hateful can make a tenured professor’s life miserable.”</p><p>“What happened to Brendan Eich” — the tech giant who was driven out of Mozilla for having made a small donation years earlier to the Prop 8 campaign — “is going to start happening to a lot of people, and Christians had better be ready for it. The question I keep thinking about is, why would we want to do that to people? But that’s where we are now.”</p><p>I pointed out that the mob hysteria that descended on Memories Pizza, the mom &amp; pop pizza shop in small-town Indiana that had to close its doors (temporarily, one hopes) after its owners answered a reporter’s question truthfully, is highly instructive to the rest of us.</p><p>“You’re right,” he said. “Memories Pizza teaches us all a lesson. What is the line between prudently closing our mouths and closeting ourselves, and compromising our faith? Christians have to start thinking about that seriously.”</p><p>“We have to fall back to defensive lines and figure out where those lines are. It’s not going to be persecution like the older Romans, or even communist Russia,” he added. “But what’s coming is going cause a lot of people to fall away from the faith, and we are going to have to be careful about how we define and clarify what Christianity is…. The most important question for Christians parents to ask themselves is, do we have a vibrant church?,” he said. “Sadly, only a small number of places have them. My family is in one. Our kids are growing up with good examples that they can look up to, and good older kids who hang on because they can stand together.”</p><p>Some people taking the Benedict Option will head for the hills, Kingsfield said, but that will be a trivial number, and that won’t be an answer for most of us.</p><p>“We need to study more the experience of Orthodox Jews and Amish,” he said. “None of us are going to be living within an eruv or practicing shunning. What we should focus on is endogamy.”</p><p>Endogamy means marriage only within a certain clan or in-group.</p><p>“Intermarriage is death,” Kingsfield said. “Not something like Catholic-Orthodox, but Christian-Jew, or high church-low church. I just don’t think Christians are focused on that, but the Orthodox Jews get it. They know how much this matters in creating a culture in which transmitting the faith happens. For us Christians, this is going to mean matchmaking and youth camps and other things like that. It probably means embracing a higher fertility rate, and celebrating bigger families.”</p></blockquote><p>It’s time for the church leaders and the heads of Christian families to start learning from #GamerGate, to start learning from Sad Puppies, and start leading. Start banding together and stop accommodating the secular world in any way. Don’t hire those who hate you. Don’t buy from those who wish to destroy you. Don’t work with those who denigrate your faith, your traditions, your morals, and your God. Don’t tolerate or respect what passes for their morals and values.</p><p>Religious liberty in America is dead. Well and good. That was a fatal mistake by the other side, because now that they don’t respect our religious liberty, we have no reason or responsibility to respect theirs. Now it’s just a raw power struggle and we have the numbers, we have the indomitable will of the martyrs, and we have the certain knowledge of God on our side.</p><p>They have nothing but the carnal desires to which they are enslaved and the Prince of this fallen world, who has already been defeated by our Lord and Savior, Jesus Christ. Their world is post-Christian, post-rational, post-modern, post-morality, and post-law. It is absolutely doomed to failure of every kind, beginning with demographics.</p><p>So stop cowering. Stop hiding in the closet. Stop trying to play by outdated rules that are no longer in effect. They imposed the new rules on us, now let’s prove that we can play much better by them. What they don’t realize is that those rules were in place for THEIR protection, not for ours. It’s time to teach them the value and importance of religious liberty again.</p><p>We are not given a spirit of fear. We are the sons and daughters of the Crusades and of the Inquisitions, institutions so terrible that they strike terror in human hearts nearly one thousand years later. We are the heirs of Christendom. They cannot defeat us and they cannot defeat our Lord. Augustus and the pagan emperors of Rome failed. The Ottoman emperors failed. The French Revolutionaries failed. The Communist killers of Spain, the Soviet Union, and China failed. The post-Christian seculars of the latter-day USA will fail too.<br> <i><br/></i><br> <i>And I say also unto thee, That thou art Peter, and upon this rock I will build my church; and the gates of hell shall not prevail against it. And I will give unto thee the keys of the kingdom of heaven: and whatsoever thou shalt bind on earth shall be bound in heaven: and whatsoever thou shalt loose on earth shall be loosed in heaven.</i></br></br></p></div>",
  "content_text": "Christians need to\nstop their cowardly cowering before the world\nand start actively following the fearless lead of the apostles and martyrs and crusaders and inquisitors who preceded them:\nI spent a long time on the phone last night with a law professor at one of the country’s elite law schools. This professor is a practicing Christian, deeply closeted in the workplace; he is convinced that if his colleagues in academia knew of his faith, they would make it very hard for him. We made contact initially by e-mail — he is a reader of this blog — and last night, by phone. He agreed to speak with me about the Indiana situation on condition that I not identify him by name or by institution. I do know his identity, and when he tells me that he is “well-informed about the academy and the Supreme Court,” I assure you that from where he sits, and teaches, and from his CV, he is telling the truth.\nI will call him Prof. Kingsfield, after the law professor in The Paper Chase.\nWhat prompted his reaching out to me? “I’m very worried,” he said, of events of the last week. “The constituency for religious liberty just isn’t there anymore.”\nLike me, what unnerved Prof. Kingsfield is not so much the details of the Indiana law, but the way the overculture treated the law. “When a perfectly decent, pro-gay marriage religious liberty scholar like Doug Laycock, who is one of the best in the country — when what he says is distorted, you know how crazy it is.”\n“Alasdair Macintyre is right,” he said. “It’s like a nuclear bomb went off, but in slow motion.” What he meant by this is that our culture has lost the ability to reason together, because too many of us want and believe radically incompatible things.\nBut only one side has the power…. A college professor who is already tenured is probably safe. Those who aren’t tenured, are in danger. Those who are believed to be religious, or at least religious in ways the legal overculture believes constitutes bigotry, will likely never be hired. For example, the professor said, he was privy to the debate within a faculty hiring meeting in which the candidacy of a liberal Christian was discussed. Though the candidate appeared in every sense to be quite liberal in her views, the fact that she was an open Christian prompted discussion as to whether or not the university would be hiring a “fundamentalist.”\nThe result could be that religious schools have to start policing orthodoxy in terms of all their hires — a situation imposing standards far more strict than many schools may wish to live by, but which may be necessary to protect the school’s legal interests.\nKingsfield said homeschooling, and homeschooling-ish things (e.g., co-ops), are going to become increasingly important to orthodox Christians, especially as they see established religious schools folding on this issue.\nBusinesses, however, are going to have a very hard time resisting what’s coming. Not that they would try. “The big companies have already gone over,” said Kingsfield.\n“Most anti-discrimination laws have a certain cut off – they don’t apply if you have 15 employees or less,” he said. “You could have an independent, loosely affiliated network of artisans, working together. If you can refer people to others within the network, that could work. You won’t be able to scale up, but that’s not such a bad thing.”\nKingsfield said religious colleges and universities are going to have to think hard about their identities.\n“Colleges that don’t receive federal funding – Hillsdale and Grove City are two I can think of – are going to be in better position, because federal regulations force a lot of crazy stuff on you,” he said. “I think it would be really wise for small religious institutions to think hard if they can cut the cord of federal funding and can find wealthy donors to step in.”\nKingsfield said we are going to have to watch closely the way the law breaks regarding gender identity and transgenderism. If the courts accept the theory that gender is a social construct — and there is a long line of legal theory and jurisprudence that says that it is — then the field of antidiscrimination law is bound to be expanded to cover, for example, people with penises who consider themselves women. The law, in other words, will compel citizens to live as if this were true — and religious liberty will, in general, be no fallback. This may well happen.\nWhat about the big issue that is on the minds of many Christians who pay attention to this fight: the tax-exempt status of churches and religious organizations? Will they be Bob Jones’d over gay rights?\nKingsfield said that this is too deeply embedded in American thought and law to be at serious risk right now, but gay rights proponents will probably push to tie the tax exemption on charities with how closely integrated they are within churches. The closer schools and charities are tied to churches, especially in their hiring, the greater protection they will enjoy.\nThe accreditation issue is going to be a much stickier wicket. Accreditation is tied to things like the acceptance of financial aid, and the ability to get into graduate schools.\n“There was a professor at Penn last year who wrote an article in the Chronicle of Higher Education calling for the end of accrediting religious colleges and universities,” Kingsfield said. “It was a Richard Dawkins kind of thing, just crazy. The fact that someone taking a position this hostile felt very comfortable putting this in the Chronicle tells me that there’s a non-trivial number of professors willing to believe this.”\nGordon College has faced pressure from a regional accrediting authority over its adherence to traditional Christian sexual morals re: gay rights.\n“Accreditation is critical to being admitted to law schools and medical schools,” Kingsfield said. “College accreditation will matter for some purposes of sports, federal aid, and for the ability to be admitted by top graduate schools. Ghettoization for Christians could be the result.”\n“In California right now, judges can’t belong to the Boy Scouts now. Who knows if in the future, lawyers won’t be able to belong to churches that are considered hate groups?” he said. “It’s certainly true that a lot of law firms will not now hire people who worked on cases defending those on the traditional marriage side. It’s going to close some professional doors. I certainly wouldn’t write about this stuff in my work, not if I wanted to have a chance at tenure. There’s a question among Christian law professors right now: do you write about these issues and risk tenure? This really does distort your scholarship. Christianity could make a distinct contribution to legal discussions, but it’s simply too risky to say what you really think.”\nThe emerging climate on campus of microaggressions, trigger warnings, and the construal of discourse as a form of violence is driving Christian professors further into the closet, the professor said.\n“If I said something that was construed as attacking a gay student, I could have my life made miserable with a year or two of litigation — and if I didn’t have tenure, there could be a chance that my career would be ruined,” he said. “Even if you have tenure, a few people who make allegations of someone being hateful can make a tenured professor’s life miserable.”\n“What happened to Brendan Eich” — the tech giant who was driven out of Mozilla for having made a small donation years earlier to the Prop 8 campaign — “is going to start happening to a lot of people, and Christians had better be ready for it. The question I keep thinking about is, why would we want to do that to people? But that’s where we are now.”\nI pointed out that the mob hysteria that descended on Memories Pizza, the mom & pop pizza shop in small-town Indiana that had to close its doors (temporarily, one hopes) after its owners answered a reporter’s question truthfully, is highly instructive to the rest of us.\n“You’re right,” he said. “Memories Pizza teaches us all a lesson. What is the line between prudently closing our mouths and closeting ourselves, and compromising our faith? Christians have to start thinking about that seriously.”\n“We have to fall back to defensive lines and figure out where those lines are. It’s not going to be persecution like the older Romans, or even communist Russia,” he added. “But what’s coming is going cause a lot of people to fall away from the faith, and we are going to have to be careful about how we define and clarify what Christianity is…. The most important question for Christians parents to ask themselves is, do we have a vibrant church?,” he said. “Sadly, only a small number of places have them. My family is in one. Our kids are growing up with good examples that they can look up to, and good older kids who hang on because they can stand together.”\nSome people taking the Benedict Option will head for the hills, Kingsfield said, but that will be a trivial number, and that won’t be an answer for most of us.\n“We need to study more the experience of Orthodox Jews and Amish,” he said. “None of us are going to be living within an eruv or practicing shunning. What we should focus on is endogamy.”\nEndogamy means marriage only within a certain clan or in-group.\n“Intermarriage is death,” Kingsfield said. “Not something like Catholic-Orthodox, but Christian-Jew, or high church-low church. I just don’t think Christians are focused on that, but the Orthodox Jews get it. They know how much this matters in creating a culture in which transmitting the faith happens. For us Christians, this is going to mean matchmaking and youth camps and other things like that. It probably means embracing a higher fertility rate, and celebrating bigger families.”\nIt’s time for the church leaders and the heads of Christian families to start learning from #GamerGate, to start learning from Sad Puppies, and start leading. Start banding together and stop accommodating the secular world in any way. Don’t hire those who hate you. Don’t buy from those who wish to destroy you. Don’t work with those who denigrate your faith, your traditions, your morals, and your God. Don’t tolerate or respect what passes for their morals and values.\nReligious liberty in America is dead. Well and good. That was a fatal mistake by the other side, because now that they don’t respect our religious liberty, we have no reason or responsibility to respect theirs. Now it’s just a raw power struggle and we have the numbers, we have the indomitable will of the martyrs, and we have the certain knowledge of God on our side.\nThey have nothing but the carnal desires to which they are enslaved and the Prince of this fallen world, who has already been defeated by our Lord and Savior, Jesus Christ. Their world is post-Christian, post-rational, post-modern, post-morality, and post-law. It is absolutely doomed to failure of every kind, beginning with demographics.\nSo stop cowering. Stop hiding in the closet. Stop trying to play by outdated rules that are no longer in effect. They imposed the new rules on us, now let’s prove that we can play much better by them. What they don’t realize is that those rules were in place for THEIR protection, not for ours. It’s time to teach them the value and importance of religious liberty again.\nWe are not given a spirit of fear. We are the sons and daughters of the Crusades and of the Inquisitions, institutions so terrible that they strike terror in human hearts nearly one thousand years later. We are the heirs of Christendom. They cannot defeat us and they cannot defeat our Lord. Augustus and the pagan emperors of Rome failed. The Ottoman emperors failed. The French Revolutionaries failed. The Communist killers of Spain, the Soviet Union, and China failed. The post-Christian seculars of the latter-day USA will fail too.\nAnd I say also unto thee, That thou art Peter, and upon this rock I will build my church; and the gates of hell shall not prevail against it. And I will give unto thee the keys of the kingdom of heaven: and whatsoever thou shalt bind on earth shall be bound in heaven: and whatsoever thou shalt loose on earth shall be loosed in heaven.",
  "tags": [
    "Christianity",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-04T08:46:00+00:00"
}