{
  "url": "https://voxday.net/2015/04/22/the-red-heeled-guards/",
  "scraped_at": "2025-12-16T12:53:12.256247",
  "title": "The Red-heeled Guards",
  "date_display": "April 22, 2015",
  "date_iso": "2015-04-22T19:26:00+00:00",
  "date_from_url": "2015-04-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There always comes a time when a state military jumps the shark. The U.S. military appears to be <a href=\"http://www.unz.com/isteve/walk-of-shame/\">rapidly reaching that point</a>:</p><blockquote class=\"tr_bq\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.barenakedislam.com/wp-content/uploads/2015/04/1024x576xScreen-Shot-2015-04-21-at-12.02.43-PM-1024x576.jpg.pagespeed.ic_.1L1muqE3XjQgDIz7OJgk-e1429665992114.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"179\" src=\"http://www.barenakedislam.com/wp-content/uploads/2015/04/1024x576xScreen-Shot-2015-04-21-at-12.02.43-PM-1024x576.jpg.pagespeed.ic_.1L1muqE3XjQgDIz7OJgk-e1429665992114.jpg\" width=\"320\"/></a></div><p>“The purpose of the event is to create a basis of understanding about<br> sexual violence, stigmas and rape culture in the military as well as in<br> our community and to reinforce standards of behavior, active bystander<br> mentality and to be peer advisers to one’s unit and community,” Johnson<br> said. “By walking in heels, the hope is to instill standards of behavior<br> that will resonate.”</br></br></br></br></br></p><p>Johnson said they chose this event because the powerful message of<br> the heels would be best at capturing the community’s attention.</br></p><p>“The heels represent the rise of sexual assault within our<br> community,” she said. “Though the heels may feel one-sided, only<br> acknowledging that females suffer the horrors of rape and sexual<br> assault, that is not the case. The event is a synopses of the problem<br> that both men and women suffer in our community and society through the<br> stigmas, rape culture and lack of respect and education.”</br></br></br></br></br></p></blockquote><p>Of course, they could always try the absolutely foolproof plan of ending rape and sexual assault within the military by banning women and homosexuals. On the other hand, considering that the American people increasingly appear to be one of the more likely opponents of this New Fabulous Army, seeing the US Army putting on red heels probably isn’t the worst thing in the world.</p><p>At this point, I would fully expect the U.S. military to not only lose a war with Russia or China, but lose it badly. It may have better toys as a legacy of its historical greatness, but even Rome’s legions eventually became toothless parodies of their former selves.</p><p>I’m not sure they were ever quite this ridiculous, though. The fact that even a single ROTC candidate member was willing to go along with the program demonstrates how hapless the future officer corps is going to be.</p></div>",
  "content_text": "There always comes a time when a state military jumps the shark. The U.S. military appears to be\nrapidly reaching that point\n:\n“The purpose of the event is to create a basis of understanding about\nsexual violence, stigmas and rape culture in the military as well as in\nour community and to reinforce standards of behavior, active bystander\nmentality and to be peer advisers to one’s unit and community,” Johnson\nsaid. “By walking in heels, the hope is to instill standards of behavior\nthat will resonate.”\nJohnson said they chose this event because the powerful message of\nthe heels would be best at capturing the community’s attention.\n“The heels represent the rise of sexual assault within our\ncommunity,” she said. “Though the heels may feel one-sided, only\nacknowledging that females suffer the horrors of rape and sexual\nassault, that is not the case. The event is a synopses of the problem\nthat both men and women suffer in our community and society through the\nstigmas, rape culture and lack of respect and education.”\nOf course, they could always try the absolutely foolproof plan of ending rape and sexual assault within the military by banning women and homosexuals. On the other hand, considering that the American people increasingly appear to be one of the more likely opponents of this New Fabulous Army, seeing the US Army putting on red heels probably isn’t the worst thing in the world.\nAt this point, I would fully expect the U.S. military to not only lose a war with Russia or China, but lose it badly. It may have better toys as a legacy of its historical greatness, but even Rome’s legions eventually became toothless parodies of their former selves.\nI’m not sure they were ever quite this ridiculous, though. The fact that even a single ROTC candidate member was willing to go along with the program demonstrates how hapless the future officer corps is going to be.",
  "tags": [
    "decline and fall",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-22T18:26:00+00:00"
}