{
  "url": "https://voxday.net/2015/04/05/their-greatest-threa/",
  "scraped_at": "2025-12-16T12:51:12.680906",
  "title": "Their greatest threat",
  "date_display": "April 5, 2015",
  "date_iso": "2015-04-05T22:12:00+00:00",
  "date_from_url": "2015-04-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Hugo announcements appear to have driven a few SJWs well around the bend:</p><blockquote class=\"tr_bq\"><p> This is a man who goes beyond bigot, whose longterm planning looks more and more like creating a Christian version of ISIS. I don’t care about Godwin’s Law, he has written his own Mein Kampf. Forget the “War Against Terrorism”; Vox Day’s Culture War is the greatest threat to us all.<br> <a href=\"http://www.metafilter.com/148587/2015-Hugo-Nominees-Announced#5997952http://www.metafilter.com/148587/2015-Hugo-Nominees-Announced#5997952\">posted by oneswellfoop</a> at 12:38 PM on April 5 [5 favorites]</br></p></blockquote><p>My old Uncle Charlie – he once invited me to call him that – appears to be <a href=\"http://www.antipope.org/charlie/blog-static/2015/04/the-biggest-little-sf-publishe.html\">deeply, deeply disappointed</a> with his black sheep of an adopted nephew:</p><blockquote class=\"tr_bq\"><p> The screaming question I feel the need to ask, is: why Finland? Could there be a connection between the white supremacist Perussuomalaiset (Finns Party), the overtly racist Sweden Democrats, the Dark Enlightenment/neoreactionary movement, and Vox Day’s peculiarly toxic sect of Christian Dominionist theology?</p><p>Over a period of years, he’s built an international coalition, finding<br> common cause with the European neo-nazi fringe. Now they’ve attempted to<br> <a href=\"http://io9.com/the-hugo-awards-were-always-political-now-theyre-only-1695721604\">turn the Hugo Awards into a battlefield</a><br> in their (American) culture wars. But this clearly isn’t the end game<br> they have in mind: it’s only a beginning. (The Hugos, by their very<br> nature, are an award anyone can vote in for a small fee: it is<br> interesting to speculate on <a href=\"javascript:void(0)\">how deep</a> Vox Day’s pockets are.) But the real burning question is, “what will he attack next?”</br></br></br></br></br></br></p></blockquote><p>And now we know how the imagination that once produced <i>Accelerando </i>now exercises itself. Great stuff! My question is if it is “the screaming question” or “the real burning question” that takes priority? Remember, this is one of the very people who informs us that John C. Wright isn’t a Hugo-quality writer, like them. Cuz they be writing real gooder! But at least we now have a proper name for the auxiliary forces of the Evil Legion of Evil, which is the International Coalition of the Willingly Evil.</p><p>But I do owe the man for honestly warning me about how speaking my mind freely would pose a serious risk to my career in SF/F. Is Scalzi around? Does that merit a hand job or will a mere “thanks, mate” suffice?</p><p>McRapey’s friend Sparklepunter was content to settle for a death wish:</p><blockquote class=\"tr_bq\"><p> Chris Warcraft@chriswarcraft<br> The only thing that Vox Day deserves to win is a trip to a society that believes what he espouses so a random person can shoot him.</br></p></blockquote><p>And another of Scalzi’s little friends, @SFReviews, managed to get his account suspended.</p><blockquote class=\"tr_bq\"><p> Account suspended<br> The profile you are trying to view has been suspended.</br></p></blockquote><p>These people really have their identity tied up as the One True Science Fiction Fans. The mere threat of not collecting their annual rocket tribute has them reacting like Gollum to someone trying to steal his Precious. For who would contemplate something so purely evil, but Evil Nazi Finnsssssss?</p><p>If this keeps up, it will provide Anonymous Conservative with enough material for tome on Rabbitology fatter than <i>A Throne of Bones</i>. And you know, for all that they enjoy citing the fact that my father has been imprisoned for years and babbling about how dangerous I am, it’s interesting that they never manage to put the two together. I mean, in the movies, anyhow, people are usually very concerned about those who have direct contacts in the Federal prison system.</p><p>UPDATE: James Nicoll digs a deeper hole and <a href=\"https://archive.today/tQekx\">swears off Baen Books</a>:</p><blockquote class=\"tr_bq\"><p> Since Baen’s publisher Toni Weisskopf is part of the Puppies slate for the second year running, I will no longer accept new commissions where the only edition is from Baen and while I will finish current projects involving Baen Books, I won’t link to the Baen edition. I certainly will not be buying anything from Baen in the future. I urge everyone (particularly people with review sites) to do the same.</p></blockquote><p>Not exactly a problem for Castalia House. None of them were ever going to review our books anyhow. What was that a very smart and astonishingly handsome man once said about denying a man a platform?</p></div>",
  "content_text": "The Hugo announcements appear to have driven a few SJWs well around the bend:\nThis is a man who goes beyond bigot, whose longterm planning looks more and more like creating a Christian version of ISIS. I don’t care about Godwin’s Law, he has written his own Mein Kampf. Forget the “War Against Terrorism”; Vox Day’s Culture War is the greatest threat to us all.\nposted by oneswellfoop\nat 12:38 PM on April 5 [5 favorites]\nMy old Uncle Charlie – he once invited me to call him that – appears to be\ndeeply, deeply disappointed\nwith his black sheep of an adopted nephew:\nThe screaming question I feel the need to ask, is: why Finland? Could there be a connection between the white supremacist Perussuomalaiset (Finns Party), the overtly racist Sweden Democrats, the Dark Enlightenment/neoreactionary movement, and Vox Day’s peculiarly toxic sect of Christian Dominionist theology?\nOver a period of years, he’s built an international coalition, finding\ncommon cause with the European neo-nazi fringe. Now they’ve attempted to\nturn the Hugo Awards into a battlefield\nin their (American) culture wars. But this clearly isn’t the end game\nthey have in mind: it’s only a beginning. (The Hugos, by their very\nnature, are an award anyone can vote in for a small fee: it is\ninteresting to speculate on\nhow deep\nVox Day’s pockets are.) But the real burning question is, “what will he attack next?”\nAnd now we know how the imagination that once produced\nAccelerando\nnow exercises itself. Great stuff! My question is if it is “the screaming question” or “the real burning question” that takes priority? Remember, this is one of the very people who informs us that John C. Wright isn’t a Hugo-quality writer, like them. Cuz they be writing real gooder! But at least we now have a proper name for the auxiliary forces of the Evil Legion of Evil, which is the International Coalition of the Willingly Evil.\nBut I do owe the man for honestly warning me about how speaking my mind freely would pose a serious risk to my career in SF/F. Is Scalzi around? Does that merit a hand job or will a mere “thanks, mate” suffice?\nMcRapey’s friend Sparklepunter was content to settle for a death wish:\nChris Warcraft@chriswarcraft\nThe only thing that Vox Day deserves to win is a trip to a society that believes what he espouses so a random person can shoot him.\nAnd another of Scalzi’s little friends, @SFReviews, managed to get his account suspended.\nAccount suspended\nThe profile you are trying to view has been suspended.\nThese people really have their identity tied up as the One True Science Fiction Fans. The mere threat of not collecting their annual rocket tribute has them reacting like Gollum to someone trying to steal his Precious. For who would contemplate something so purely evil, but Evil Nazi Finnsssssss?\nIf this keeps up, it will provide Anonymous Conservative with enough material for tome on Rabbitology fatter than\nA Throne of Bones\n. And you know, for all that they enjoy citing the fact that my father has been imprisoned for years and babbling about how dangerous I am, it’s interesting that they never manage to put the two together. I mean, in the movies, anyhow, people are usually very concerned about those who have direct contacts in the Federal prison system.\nUPDATE: James Nicoll digs a deeper hole and\nswears off Baen Books\n:\nSince Baen’s publisher Toni Weisskopf is part of the Puppies slate for the second year running, I will no longer accept new commissions where the only edition is from Baen and while I will finish current projects involving Baen Books, I won’t link to the Baen edition. I certainly will not be buying anything from Baen in the future. I urge everyone (particularly people with review sites) to do the same.\nNot exactly a problem for Castalia House. None of them were ever going to review our books anyhow. What was that a very smart and astonishingly handsome man once said about denying a man a platform?",
  "tags": [
    "Hugo Award",
    "rabbitology",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-05T21:12:00+00:00"
}