{
  "url": "https://voxday.net/2015/04/18/there-will-be-there-will-be-war/",
  "scraped_at": "2025-12-16T12:52:42.994957",
  "title": "There will be THERE WILL BE WAR",
  "date_display": "April 18, 2015",
  "date_iso": "2015-04-18T10:14:00+00:00",
  "date_from_url": "2015-04-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>File 770 <a href=\"http://file770.com/?p=21956\">has the scoop</a>:</p><blockquote class=\"tr_bq\"><p> Jerry Pournelle’s <i>There Will Be War</i> series is returning to print. All nine volumes will be reissued by Castalia House in ebook and two-volume omnibus hardcovers.</p><p>I’m glad to see that Dr. Pournelle, who I have now known over 40 years, will have his iconic titles back on the market.</p><p>Jerry commented on the project’s history for File 770:</p><p><i>I am very pleased that we were able to revive, in both hardbound and eBook, the There Will Be War anthology series.  The series was conceived during the Cold War, but most of the stories take place in other eras.  I am not astonished that they hold up well long after the collapse of the Soviet Union ended that conflict. We will be releasing the original 9 volumes over the next year and revive the series after that.  However much international politics may change, it remains likely that There Will Be War.</i></p></blockquote><div class=\"separator\" style=\"clear: both; text-align: left;\"> <a href=\"http://file770.com/wp-content/uploads/TWBWv1_960.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://file770.com/wp-content/uploads/TWBWv1_960.jpg\" width=\"200\"/></a>There is more, so read the rest there. As you can imagine, I am a tremendous fan of the anthology series, and indeed, <a href=\"http://www.amazon.com/Riding-Red-Horse-Tom-Kratman-ebook/dp/B00QZD9H5K\"><b><i>Riding the Red Horse</i></b></a> was created in conscious imitation of its ground-breaking blend of fact and fiction. Volume I is already ready to go and we are just putting the final touches on Volume II, after which we will release both of them. If you’re not subscribing to the <a href=\"http://www.castaliahouse.com/subscribe-to-our-newsletter/\">Castalia House New Release mailing list</a> yet, you’re probably going to want to do so soon because we will be announcing a very good new release offer in the next newsletter. <i>There Will Be War </i>was a tremendous influence on my own intellectual development, and not only are the books not conceptually outdated, they often feel remarkably prescient despite the end of the Cold War and the passing of the events upon which they are nominally focused. The reality is that the forces leading to war run much deeper than any of the national or societal differences that are usually blamed for it, which is why Dr. Pournelle is correct to observe that history has not ended, the secular utopia has not arrived, and there will indeed be war. I have highly recommended the books for decades, which is why getting them back into print was one of my top priorities for Castalia House.</div><div class=\"separator\" style=\"clear: both; text-align: left;\"></div><div class=\"separator\" style=\"clear: both; text-align: left;\"> We will publish the Volume I and II ebooks before the end of this month. Later this year, we will publish Volumes III and IV in ebook, and Volumes I and II together in an omnibus hardcover edition. We expect to publish all nine volumes, as well as the new tenth volume, before the end of 2016.</div></div>",
  "content_text": "File 770\nhas the scoop\n:\nJerry Pournelle’s\nThere Will Be War\nseries is returning to print. All nine volumes will be reissued by Castalia House in ebook and two-volume omnibus hardcovers.\nI’m glad to see that Dr. Pournelle, who I have now known over 40 years, will have his iconic titles back on the market.\nJerry commented on the project’s history for File 770:\nI am very pleased that we were able to revive, in both hardbound and eBook, the There Will Be War anthology series.  The series was conceived during the Cold War, but most of the stories take place in other eras.  I am not astonished that they hold up well long after the collapse of the Soviet Union ended that conflict. We will be releasing the original 9 volumes over the next year and revive the series after that.  However much international politics may change, it remains likely that There Will Be War.\nThere is more, so read the rest there. As you can imagine, I am a tremendous fan of the anthology series, and indeed,\nRiding the Red Horse\nwas created in conscious imitation of its ground-breaking blend of fact and fiction. Volume I is already ready to go and we are just putting the final touches on Volume II, after which we will release both of them. If you’re not subscribing to the\nCastalia House New Release mailing list\nyet, you’re probably going to want to do so soon because we will be announcing a very good new release offer in the next newsletter.\nThere Will Be War\nwas a tremendous influence on my own intellectual development, and not only are the books not conceptually outdated, they often feel remarkably prescient despite the end of the Cold War and the passing of the events upon which they are nominally focused. The reality is that the forces leading to war run much deeper than any of the national or societal differences that are usually blamed for it, which is why Dr. Pournelle is correct to observe that history has not ended, the secular utopia has not arrived, and there will indeed be war. I have highly recommended the books for decades, which is why getting them back into print was one of my top priorities for Castalia House.\nWe will publish the Volume I and II ebooks before the end of this month. Later this year, we will publish Volumes III and IV in ebook, and Volumes I and II together in an omnibus hardcover edition. We expect to publish all nine volumes, as well as the new tenth volume, before the end of 2016.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-18T09:14:00+00:00"
}