{
  "url": "https://voxday.net/2015/04/29/they-also-serve/",
  "scraped_at": "2025-12-16T12:54:00.845705",
  "title": "They also serve",
  "date_display": "April 29, 2015",
  "date_iso": "2015-04-29T16:00:00+00:00",
  "date_from_url": "2015-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It was suggested that they also serve, who inadvertently and unknowingly do the bidding of the Evil Legion of Evil through their ludicrously predictable reactions. And lo, a badge for this brigade of Unwitting Minions was created. Evil Legion of Evil minions are free to award it to those whose behavior is so egregiously stupid or shortsighted or self-destructive that they could not possibly serve your Supreme Dark Lord better if they were consciously doing His Evil Bidding.</p><p>Given that they are, without exception, unique and special snowflakes, they naturally all bear the title “Minion #1”.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2015/04/Unwitting-Minion_512x512.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/04/Unwitting-Minion_512x512.jpg\" width=\"320\"/></a></div><p> On a not entirely unrelated note, RI explains why he is now reading this blog and Larry Correia’s books:</p><blockquote class=\"tr_bq\"><p> I’ve been a spectator to this conflict for several months now. To be honest, I didn’t even know who any of the participants were when I first started following. Now, because of the outcry against you, Mr. Correia, and Mr. Torgersen I have become a daily reader of your blog and am rapidly burning through Mr. Corriea’s books. I’d like to think I stand somewhere in the between you and Corriea. I’ve noticed you’ve been calling attention to some of the unethical book reviewing practices of the SJWs <a href=\"https://www.goodreads.com/review/show/166129626?book_show_action=true\">and I found one</a> I thought you would like to point out on your blog.</p><p>This person openly admits to downgrading her review after finding out about Correia’s politics.</p><p>If I am any evidence of a growing trend, then the SJWs are basically screaming themselves into irrelevance. I am glad you have decided to wade into this and stand up for your beliefs and stand against the terrorism of the left. God bless you, sir.</p></blockquote><p>This is the perspective that is so often ignored. What people are assumed to perceive, and what they will actually perceive, are often two different things. Larry once said that the benefit of telling the truth is that you have no need to worry about keeping your stories straight, and another one is that people tend to recognize those who tell the truth, whether they accept the truth on that particular subject or not.</p></div>",
  "content_text": "It was suggested that they also serve, who inadvertently and unknowingly do the bidding of the Evil Legion of Evil through their ludicrously predictable reactions. And lo, a badge for this brigade of Unwitting Minions was created. Evil Legion of Evil minions are free to award it to those whose behavior is so egregiously stupid or shortsighted or self-destructive that they could not possibly serve your Supreme Dark Lord better if they were consciously doing His Evil Bidding.\nGiven that they are, without exception, unique and special snowflakes, they naturally all bear the title “Minion #1”.\nOn a not entirely unrelated note, RI explains why he is now reading this blog and Larry Correia’s books:\nI’ve been a spectator to this conflict for several months now. To be honest, I didn’t even know who any of the participants were when I first started following. Now, because of the outcry against you, Mr. Correia, and Mr. Torgersen I have become a daily reader of your blog and am rapidly burning through Mr. Corriea’s books. I’d like to think I stand somewhere in the between you and Corriea. I’ve noticed you’ve been calling attention to some of the unethical book reviewing practices of the SJWs\nand I found one\nI thought you would like to point out on your blog.\nThis person openly admits to downgrading her review after finding out about Correia’s politics.\nIf I am any evidence of a growing trend, then the SJWs are basically screaming themselves into irrelevance. I am glad you have decided to wade into this and stand up for your beliefs and stand against the terrorism of the left. God bless you, sir.\nThis is the perspective that is so often ignored. What people are assumed to perceive, and what they will actually perceive, are often two different things. Larry once said that the benefit of telling the truth is that you have no need to worry about keeping your stories straight, and another one is that people tend to recognize those who tell the truth, whether they accept the truth on that particular subject or not.",
  "tags": [
    "conspiracy",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-29T15:00:00+00:00"
}