{
  "url": "https://voxday.net/2015/04/29/they-are-in-retrea/",
  "scraped_at": "2025-12-16T12:53:57.144576",
  "title": "THEY are in retreat",
  "date_display": "April 29, 2015",
  "date_iso": "2015-04-29T06:00:00+00:00",
  "date_from_url": "2015-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I told you that George RR Martin has lost the plot. After publicly declining the very debate for which he called, <a href=\"http://grrm.livejournal.com/423814.html?thread=21481862#t21481862\">he actually repeated his call</a> for what he already rejected:</p><blockquote class=\"tr_bq\"><p> Here’s an idea — debate the issue without epithets. Namecalling, whether with old epithets or new ones, is no substitute for actual discussion.</p></blockquote><p>Oh, come on, you cowardly sad sack of an SJW. I gave you the opportunity to debate the issue. Honestly. Civilly. Rationally. You declined. So, guess what that leaves? And while we’re at it, just get it over with and hand the books over to Brandon Sanderson or Joe Abercrombie to finish already.</p><p>As Martin’s <a href=\"http://grrm.livejournal.com/423814.html\">befuddled post demonstrates</a>, it is readily apparent that science fiction’s CHORFs aren’t entirely confident they are winning anymore. Jim Hines <a href=\"http://jimhines.livejournal.com/787660.html\">steals yet another page from John Scalzi’s playbook</a>, this time playing the classic “hey, forget my past attacks on you, we’re all just friends who happen to disagree” card:</p><blockquote class=\"tr_bq\"><p> I am so damn tired of the insistence on shoving everyone and everything into an artificial “Us vs. Them” framework. The Puppies thing is just the latest example. The only clearly defined “side” in this mess is the puppies themselves, and even that’s a slippery argument. Is Theodore Beale of the Rabid Puppies on the same side as Brad Torgersen and Larry Correia? Correia suggests they are: “Look at it like this. I’m Churchill. Brad is FDR. We wound up on the same side as Stalin.” But what about the commenters? Can people support some of what the puppies said they wanted — say, greater awareness of tie-in work in Hugo nominations — without having to swear allegiance to all things rabid?</p></blockquote><p>There is nothing artificial about it. The main reason SJWs were successful in infiltrating the science fiction establishment and imposing their ideology on it was due to their Fabian strategy of denying any conflict was taking place. Their entryism depended entirely upon stealth and plausible deniability. That’s why the single most important aspect of both #GamerGate and #SadPuppies was the way in which it was made perfectly clear to everyone that there are, in fact, two sides.</p><p>There are those who want to be able to define what is permissible to read, write, design, develop, play, think, and say, (SJWs) and those who wish to read, write, design, develop, play, think, and say whatever the hell they happen to please. (Everybody else)</p><p>Jim Hines isn’t “so damn tired” of “an artificial Us vs. Them framework”. He is simply alarmed that their most effective tactic has been exposed and rendered impotent.</p><blockquote class=\"tr_bq\"><p>  I keep coming across commentary and arguments that assume you have to be either pro-puppy or anti-puppy. In broader discussions, you’re either us or you’re the enemy. Left or Right. Puppy or CHORF. Lately, I’m seeing more accusations of blacklists and gatekeepers and people’s careers being hurt because of their politics or beliefs or whatever, because some publishers are for Us and some are for Them, and you can’t succeed in this business without swearing allegiance to the Evil Gun Nuts of Baen or the Evil Tree-hugging Lib’ruls of Tor. To be honest, that last bit is funny as hell.</p></blockquote><p>His point might be more convincing if we didn’t have Charles “15 Hugo Nominations” Stross on record warning me about the danger to my career if I didn’t stop writing my op/ed column and start sucking up to the then-Toad of Tor and Tor Senior Editor PNH. Or testimony from everyone from Larry Correia to Sarah Hoyt. You certainly can succeed in this business by fighting the establishment, but that doesn’t mean the establishment doesn’t exist or that it won’t attack you. It’s not like everyone doesn’t know that opinions deemed badthink can not only ruin your chances of getting published by an SJW-dominated publishing house, but get them to conspire to have the SFWA Board vote to “expel” you.</p><blockquote class=\"tr_bq\"><p> I know some of the Sad Puppies desperately want there to be some kind of<br> Social Justice Warrior Conspiracy that’s been manipulating the Hugos<br> and persecuting them for years, because that creates a simple narrative<br> with them as the feisty rebels striking a blow against the Evil Empire.<br> But there’s been zero evidence for it. Correia himself said he’d audited<br> the Hugos a few years back and found no sign of anything suspect.</br></br></br></br></br></p></blockquote><p>The lesson, as always, SJWs ALWAYS lie. Correia found no sign of anything suspect in the ballot-counting by the WorldCons. He did not admit there was no SJW conspiracy. A very dishonest switcheroo by McCreepy.</p><blockquote class=\"tr_bq\"><p> Part of my anger at Torgersen and Correia is because I feel like they deliberately encouraged this Us vs. Them mentality in order to win support and votes. They invented an evil cabal of “Them,” then rallied people to join their side against this fictitious enemy. Which only increases the abuse and the hatred. And please note: I’m angry at them as individuals, not because they’re conservative, or because of their views on gun control, or because they might have a different religious belief than I do. I’m angry because whatever problems were out there, these two individuals actively made them worse, and they hurt a great many people in the process. Themselves included.</p><p>Fandom is not two distinct sides. It’s a bunch of people who like things in a really big genre, a genre that has guns and spaceships and dinosaurs and dragons and magic and manly men and genderfluid protagonists and grittiness and erotica and humor and hard-core feminism and sexism and racism and hope and stereotypes and anger and messages and politics and fluff and were-jaguars and superheroes and so much more.</p><p>Criticism is not war. Choosing not to read or support things you don’t like isn’t censorship. Liking something problematic doesn’t make you a bad person.</p></blockquote><p>He shouldn’t be angry at Brad and Larry, who both seriously attempted to fix the Hugo system. He should be angry at me, because I have successfully exposed that which Hines and the other SJWs desperately wanted to keep hidden, for the same reason they hid their history of embracing child molesters like Breen, MzB, and Kramer, to name a few. But we didn’t make anything worse, any more than Deidre Saoirse Moen raped any children when she helped bring MzB’s behavior to light.</p><p>Criticism isn’t war. But taking over the SF establishment for ideological purposes is war. Of course they don’t like the fact that an opposition has arisen and is fighting back. That’s why they tried to discredit and disqualify and defenestrate me 10 years ago. They correctly sensed a potentially dangerous enemy and attempted to marginalize me. But I’m still here, and more importantly, I am not alone.</p><p>That’s why they are suddenly declaring there is no war. But it’s too late. The mask has been ripped off and too many have seen the true face of the SJWs…. as Dave Freer of the Mad Genius Club <a href=\"http://madgeniusclub.com/2015/04/27/to-destroysurvive-saurvox-voxdemort-the-evil-genius-in-his-volcano-lair/\">notes their recent behavior</a>:</p><blockquote class=\"tr_bq\"><p> But seriously, what have the AP [Anti-Puppies] tried so far, and what success has it brought them?  They’ve brought out media attacks accusing the Puppies and nominees of being sexists, racists, misogynist, homophobes – the usual made-up get out of jail cards rubbish with no substance and some funny twists – we’re all white Mormon men. Especially Sarah Hoyt. And a twenty year bi-racial marriage makes Brad Torgersen a racist. Then the voters weren’t real fans but slaves who voted to order (which was a true PR disaster, angering a huge circle of people).</p><p>Then there were the ‘you’ll never work in this town’ again threats to careers and reputations – with the Nielsen-Haydens and David Gerrold shrieking ‘who will rid us of these troublesome puppies?’ and providing precise instructions of what to do. Not a ‘blacklist’ of course (slither). Just things that people would do, like exclude them from publications, cons and reviews. Unlike the puppies, who actively said that their people shouldn’t, for example, boycott Tor, no such criticism came out of the AP. We’ve had people inform us we’re mad (at great length. It was funny, and very revealing – about the bat-sh!t loony writer), and bad, and just downright unfeeling to poor David’s tender sensibilities. Some AP camp-follower called Jane Carnall of Edinburgh, who has written a few opinion pieces in ‘The Guardian, went off and followed the instruction issued on ‘Making Light’ and started issuing fake 1 star reviews on Amazon on John Wright’s stories.</p><p>Oh and the cheering announcement that they will ‘No Award’ the Pups nominees out of existence, and we’ll never ever win Hugos. The latest (from a chorus, including Scalzi) has been that if the puppies and nominees do not immediately and forthwith viciously denounce Vox Day they will declare us stupid dupes and one with him. Deserving of his fate too. I’ve kind of lost track of the ‘if you do’ offer. Maybe we’ll be allowed to live out our short miserable lives like penitent whores in a nunnery, being kindly permitted to clean their chamber-pots with our tongues. Think for yourselves what you’d do given that choice: live free and maybe win or die, or surrender and live as a second – or third or fifth class citizen, continually used as a kicking boy?</p><p>And if the AP told me otherwise, I wouldn’t believe a word, given their track record. The AP really have credibility issues they need to work on.</p></blockquote><p>Never believe an opponent who tries to tell you the game hasn’t even started yet. And never believe an enemy who tells you that because there is no war, you should stop shooting at him and lay down your arms. Remember, rabbits only win when wolves refuse to fight.</p><p>Interestingly enough, after an amount of his usual meandering, R. Scott Bakker <a href=\"https://rsbakker.wordpress.com/2015/04/27/hugos-weaving/\">reaches much the same conclusion</a>:</p><blockquote class=\"tr_bq\"><p>  The fact that Beale managed to pull this little coup is proof positive that science fiction and fantasy matter, that we dwell in a rare corner of culture where the battle of ideas is for… fucking… real.</p></blockquote><p>Only it’s not a rare corner. The battle of ideas is ongoing and everywhere throughout the culture. It’s in Games, it’s in Science Fiction, it’s in Comics, and it’s in TV and Movies. And for the first time in decades, those who favor liberty are on the offensive.</p></div>",
  "content_text": "I told you that George RR Martin has lost the plot. After publicly declining the very debate for which he called,\nhe actually repeated his call\nfor what he already rejected:\nHere’s an idea — debate the issue without epithets. Namecalling, whether with old epithets or new ones, is no substitute for actual discussion.\nOh, come on, you cowardly sad sack of an SJW. I gave you the opportunity to debate the issue. Honestly. Civilly. Rationally. You declined. So, guess what that leaves? And while we’re at it, just get it over with and hand the books over to Brandon Sanderson or Joe Abercrombie to finish already.\nAs Martin’s\nbefuddled post demonstrates\n, it is readily apparent that science fiction’s CHORFs aren’t entirely confident they are winning anymore. Jim Hines\nsteals yet another page from John Scalzi’s playbook\n, this time playing the classic “hey, forget my past attacks on you, we’re all just friends who happen to disagree” card:\nI am so damn tired of the insistence on shoving everyone and everything into an artificial “Us vs. Them” framework. The Puppies thing is just the latest example. The only clearly defined “side” in this mess is the puppies themselves, and even that’s a slippery argument. Is Theodore Beale of the Rabid Puppies on the same side as Brad Torgersen and Larry Correia? Correia suggests they are: “Look at it like this. I’m Churchill. Brad is FDR. We wound up on the same side as Stalin.” But what about the commenters? Can people support some of what the puppies said they wanted — say, greater awareness of tie-in work in Hugo nominations — without having to swear allegiance to all things rabid?\nThere is nothing artificial about it. The main reason SJWs were successful in infiltrating the science fiction establishment and imposing their ideology on it was due to their Fabian strategy of denying any conflict was taking place. Their entryism depended entirely upon stealth and plausible deniability. That’s why the single most important aspect of both #GamerGate and #SadPuppies was the way in which it was made perfectly clear to everyone that there are, in fact, two sides.\nThere are those who want to be able to define what is permissible to read, write, design, develop, play, think, and say, (SJWs) and those who wish to read, write, design, develop, play, think, and say whatever the hell they happen to please. (Everybody else)\nJim Hines isn’t “so damn tired” of “an artificial Us vs. Them framework”. He is simply alarmed that their most effective tactic has been exposed and rendered impotent.\nI keep coming across commentary and arguments that assume you have to be either pro-puppy or anti-puppy. In broader discussions, you’re either us or you’re the enemy. Left or Right. Puppy or CHORF. Lately, I’m seeing more accusations of blacklists and gatekeepers and people’s careers being hurt because of their politics or beliefs or whatever, because some publishers are for Us and some are for Them, and you can’t succeed in this business without swearing allegiance to the Evil Gun Nuts of Baen or the Evil Tree-hugging Lib’ruls of Tor. To be honest, that last bit is funny as hell.\nHis point might be more convincing if we didn’t have Charles “15 Hugo Nominations” Stross on record warning me about the danger to my career if I didn’t stop writing my op/ed column and start sucking up to the then-Toad of Tor and Tor Senior Editor PNH. Or testimony from everyone from Larry Correia to Sarah Hoyt. You certainly can succeed in this business by fighting the establishment, but that doesn’t mean the establishment doesn’t exist or that it won’t attack you. It’s not like everyone doesn’t know that opinions deemed badthink can not only ruin your chances of getting published by an SJW-dominated publishing house, but get them to conspire to have the SFWA Board vote to “expel” you.\nI know some of the Sad Puppies desperately want there to be some kind of\nSocial Justice Warrior Conspiracy that’s been manipulating the Hugos\nand persecuting them for years, because that creates a simple narrative\nwith them as the feisty rebels striking a blow against the Evil Empire.\nBut there’s been zero evidence for it. Correia himself said he’d audited\nthe Hugos a few years back and found no sign of anything suspect.\nThe lesson, as always, SJWs ALWAYS lie. Correia found no sign of anything suspect in the ballot-counting by the WorldCons. He did not admit there was no SJW conspiracy. A very dishonest switcheroo by McCreepy.\nPart of my anger at Torgersen and Correia is because I feel like they deliberately encouraged this Us vs. Them mentality in order to win support and votes. They invented an evil cabal of “Them,” then rallied people to join their side against this fictitious enemy. Which only increases the abuse and the hatred. And please note: I’m angry at them as individuals, not because they’re conservative, or because of their views on gun control, or because they might have a different religious belief than I do. I’m angry because whatever problems were out there, these two individuals actively made them worse, and they hurt a great many people in the process. Themselves included.\nFandom is not two distinct sides. It’s a bunch of people who like things in a really big genre, a genre that has guns and spaceships and dinosaurs and dragons and magic and manly men and genderfluid protagonists and grittiness and erotica and humor and hard-core feminism and sexism and racism and hope and stereotypes and anger and messages and politics and fluff and were-jaguars and superheroes and so much more.\nCriticism is not war. Choosing not to read or support things you don’t like isn’t censorship. Liking something problematic doesn’t make you a bad person.\nHe shouldn’t be angry at Brad and Larry, who both seriously attempted to fix the Hugo system. He should be angry at me, because I have successfully exposed that which Hines and the other SJWs desperately wanted to keep hidden, for the same reason they hid their history of embracing child molesters like Breen, MzB, and Kramer, to name a few. But we didn’t make anything worse, any more than Deidre Saoirse Moen raped any children when she helped bring MzB’s behavior to light.\nCriticism isn’t war. But taking over the SF establishment for ideological purposes is war. Of course they don’t like the fact that an opposition has arisen and is fighting back. That’s why they tried to discredit and disqualify and defenestrate me 10 years ago. They correctly sensed a potentially dangerous enemy and attempted to marginalize me. But I’m still here, and more importantly, I am not alone.\nThat’s why they are suddenly declaring there is no war. But it’s too late. The mask has been ripped off and too many have seen the true face of the SJWs…. as Dave Freer of the Mad Genius Club\nnotes their recent behavior\n:\nBut seriously, what have the AP [Anti-Puppies] tried so far, and what success has it brought them?  They’ve brought out media attacks accusing the Puppies and nominees of being sexists, racists, misogynist, homophobes – the usual made-up get out of jail cards rubbish with no substance and some funny twists – we’re all white Mormon men. Especially Sarah Hoyt. And a twenty year bi-racial marriage makes Brad Torgersen a racist. Then the voters weren’t real fans but slaves who voted to order (which was a true PR disaster, angering a huge circle of people).\nThen there were the ‘you’ll never work in this town’ again threats to careers and reputations – with the Nielsen-Haydens and David Gerrold shrieking ‘who will rid us of these troublesome puppies?’ and providing precise instructions of what to do. Not a ‘blacklist’ of course (slither). Just things that people would do, like exclude them from publications, cons and reviews. Unlike the puppies, who actively said that their people shouldn’t, for example, boycott Tor, no such criticism came out of the AP. We’ve had people inform us we’re mad (at great length. It was funny, and very revealing – about the bat-sh!t loony writer), and bad, and just downright unfeeling to poor David’s tender sensibilities. Some AP camp-follower called Jane Carnall of Edinburgh, who has written a few opinion pieces in ‘The Guardian, went off and followed the instruction issued on ‘Making Light’ and started issuing fake 1 star reviews on Amazon on John Wright’s stories.\nOh and the cheering announcement that they will ‘No Award’ the Pups nominees out of existence, and we’ll never ever win Hugos. The latest (from a chorus, including Scalzi) has been that if the puppies and nominees do not immediately and forthwith viciously denounce Vox Day they will declare us stupid dupes and one with him. Deserving of his fate too. I’ve kind of lost track of the ‘if you do’ offer. Maybe we’ll be allowed to live out our short miserable lives like penitent whores in a nunnery, being kindly permitted to clean their chamber-pots with our tongues. Think for yourselves what you’d do given that choice: live free and maybe win or die, or surrender and live as a second – or third or fifth class citizen, continually used as a kicking boy?\nAnd if the AP told me otherwise, I wouldn’t believe a word, given their track record. The AP really have credibility issues they need to work on.\nNever believe an opponent who tries to tell you the game hasn’t even started yet. And never believe an enemy who tells you that because there is no war, you should stop shooting at him and lay down your arms. Remember, rabbits only win when wolves refuse to fight.\nInterestingly enough, after an amount of his usual meandering, R. Scott Bakker\nreaches much the same conclusion\n:\nThe fact that Beale managed to pull this little coup is proof positive that science fiction and fantasy matter, that we dwell in a rare corner of culture where the battle of ideas is for… fucking… real.\nOnly it’s not a rare corner. The battle of ideas is ongoing and everywhere throughout the culture. It’s in Games, it’s in Science Fiction, it’s in Comics, and it’s in TV and Movies. And for the first time in decades, those who favor liberty are on the offensive.",
  "tags": [
    "rabbitology",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-29T05:00:00+00:00"
}