{
  "url": "https://voxday.net/2015/04/16/two-tribes-and-alien-invasion/",
  "scraped_at": "2025-12-16T12:52:30.403796",
  "title": "Two tribes and an alien invasion",
  "date_display": "April 16, 2015",
  "date_iso": "2015-04-16T12:00:00+00:00",
  "date_from_url": "2015-04-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Brad Torgersen explains his view of <a href=\"https://bradrtorgersen.wordpress.com/2015/04/14/tribalism-is-as-tribalism-does/\">tribalism in science fiction</a>:</p><blockquote class=\"tr_bq\"><p> The Hugos (and the Worldcon tribe alike) brand the Hugo as the award for the entirety of SF/F: books, stories, movies, television, music, art, you name it. This is not just the totem of the single SF/F tribe. This is the totem of all the SF/F tribes.</p><p>But the single tribe (Worldcon) wants the exclusive right to decide how the totem gets distributed — to which tribe members, and for what kinds of work.</p><p>It’s the totem of all, but to be decided by only some.</p><p>That — right there — is the root of the conflict. Totem of of all, decided by some. Sad Puppies 3 (and to a certain extent, Sad Puppies 2 and Sad Puppies 1) made the audacious claim that the totem for all, should be decided by all. Anyone willing to pay the poll tax (Worldcon membership) should have a say. We invited everyone to the democratic process. We didn’t care who was or was not in the “tribe” of World Science Fiction Society. This is the totem of all! And the rules pretty much make it so that all can participate!</p><p>But the Worldcon tribe — or at least certain vocal members within the tribe — have gone full-retard-tribal about the affront to “their” award, and “their” convention. So it’s tribe-vs-tribe. Are you in-tribe or out-tribe? How can anyone tell? Are you “of the body” of the tribe? Were you inculcated? No? Then what the hell are you doing coming to our tribal ground and fucking with our totem? It’s ours, dammit! Not yours! Ours!!</p><p>Protestations about propriety are merely bureaucratic dressing for tribal reactionary mud-slinging.</p><p>Mud-slinging which was taken to the broader media by a few tribe-members determined to “nuke” us invaders: Sad Puppies.</p><p>But not just us alone. We were almost incidental. The partisans of the Worldcon tribe had a more serious foe in mind.</p><p>Because of all the things most frightening to the Worldcon tribe, the worst are the Visigoths of Vox Day. Not just an out-tribe, Vox and his fans represent an explicitly war-like and hostile tribe, come to seize the totem by brute means. So, some of the Worldcon tribe said, “No, we will destroy the totem first, before we let the Visigoths have it!” To which the Visigoths and their heathen king Vox replied, “If you destroy it this year, we will most certainly destroy it next year — and there is nothing you can do to stop us!”</p><p>Now, the heathen king is terrifying to the Worldcon tribe. He is a literal barbarian. He talks and walks and threatens like a barbarian. He’s not precisely the guy anyone planned on walking through the democratic door. But because the Hugo voting process is democratic, nobody can be barred for purely tribal reasons. You pay your poll tax, you get a vote. The Worldcon tribe stares at both Sad Puppies 3 and the Rabid Puppies with equal dismay.</p></blockquote><p>Brad’s analogy makes sense, for the most part, but it misses one crucial detail because he is not of the Rabid Puppies. We’re not the barbarians. As it happens, they are. We are a foreign culture, possibly less numerous, but with much better technology, discipline, and foresight. We appear hostile and warlike, to be sure, but only because our thinking and objectives are entirely alien to them. Not only do they not understand us, but they have not even made any effort to do so. Nor would it likely avail them much if they did, if this reaction by one member of the Worldcon tribe is any indication:</p><blockquote class=\"tr_bq\"><p> I think you really hit the nail on the head about tribalism. While I don’t feel tribalism in general about everyone different from me politically, I have felt very strong fear and vile about… that other guy, you know, the one who you won’t (and shouldn’t) unperson. 🙂 I have spent a lot of time on his blog and, to be frank, it terrifies me. It made me feel sick yet I couldn’t stop reading. I began going through his historical archives and a lot of his views on suffrage and marital relationships, in particular, made me feel nauseous. And what is the kneejerk reaction when someone like that makes us so sick… ban them, shun them, etc. And I think that is why GRRM asks you that question. Because He Who Should Not be Named isn’t just the “other side”, but someone who openly espouses, IMO, horrible, horrible views. I know he says that he doesn’t, but I can’t help but define his statements as misogynistic and racist.</p><p>Yet, the more I’ve thought about it, and read your words, I guess if you truly are going to be inclusive, that voice has the right to be heard as well, no matter how much it may scare or bother us. I personally believe that if we were to stop shouting about him as much or shouting at him and just back off and let him come and do what he wants, he actually would, in a way, “lose” some of his power.</p><p>When I said fear, I was trying to be more general of all of us on the left “side” but I’ll try to be more clear. I guess I fear the fact that such… Nasty sentiments still exist in this day and age. It’s hard for me to comprehend. It’s not just his views… It’s the very insulting terminology he uses. And again, this is from actually reading years worth of his posts. The comparisons to training a wife like an animal, insulting the physical features of women he deems unattractive, he is a very mean, cruel person and I feel fear that those mindsets and hateful way of speaking still exists. He also seems to feel pride in his hateful words.</p><p>For what it’s worth, I’ve also spent a lot of time reading Wright’s blog. Like I said, I was determined to do my research and not just repeat what others have said. In terms of Wright, I actually agree with you. While I obviously don’t agree with a lot of his views, I didn’t find him to be purposely mean at all. As you said, hate the sin, love the sinner. I have actually seen that Christian mindset in him, Brad, and others. Nothing about VD comes off as Christian. He is mean to people, plain and simple. Nothing to do with just disagreeing, he goes out of his way to call people fat, ugly women look like a tranny, and way too many other numerous comments. It actually emotionally hurt reading many of his blogs. I never felt that way reading Brad, Larry, or Wright, even if I didn’t agree with their view….</p><p>I have no real, actual complaint. I was just speaking of my perceptions.</p></blockquote><p>Despite her pain and fear, the commenter is, surprisingly enough, correct for the most part. Silencing us is not an option. They have no power to do so. Shouting at us is pointless. We don’t listen to them or care what they say. Shouting about us is also pointless. That only spreads our message and wins us more sympathy within their own tribe and among their allies.</p><p>They’re in the position of Flatlanders attempting to defend against an opponent operating in three dimensions. We can come at them any time we want from directions they don’t even know exist. But we don’t need to come at them at all. We have our own objectives that they would not credit even if we explained them fully and in detail; they can no more grasp them than a Flatlander can comprehend a cube.</p><p>For example, I have repeatedly stated for more than a year now that I have no particular interest in the Hugo Awards. I still don’t. Had they simply voted my work last year into last place and left it at that, I would never have even looked at the Worldcon rules. But once I was accused of gaming the system to obtain a 6 of 5 reward, I naturally decided to take a look at them. The rest, everyone knows.</p><p>The Dread Ilk are not a barbarian tribe that wants to take the land of the Worldcon tribe. We are an advanced foreign civilization that is simply going about its business in what naturally appears to be an inexplicable manner. We’re quite content to leave the primitives alone so long as they stay out of our way, but if a few of them decide to loose arrows at us as we work, we will respond with lasers and cobalt bombs without even thinking twice about it. Or paying any attention to the collateral damage.</p><p>My advice to the Worldcon community is very simple: don’t dig the hole deeper. Don’t scream at us, don’t insult us, don’t “send a message”, just settle down and do what you’ve always done and vote for whatever works you find to be the best, or the least offensive. Smile and politely do your jazz hands if a few of ours happen to claim the totem this year. We have no intention of camping the Hugos unless you give us a reason to do so. I have absolutely no desire to ever have as many Hugo nominations as Arthur C. Clarke, let alone Robert Heinlein or Isaac Asimov, but annoy me enough and I promise you that I will end up with more than David Hartwell and Mike Glyer <i>combined</i>.</p><p>There is nothing to stop the Worldcon tribe from continuing to double-down until it is destroyed entirely. It’s their call. The situation rather reminds me of a conflict I once had with a very large, wealthy and arrogant publisher. All they had to do was send me a letter. A one-page letter. Nothing more. But they wouldn’t, for various reasons that mostly have to do with pride. They firmly believed that there was no way that two young game designers in Minnesota could do anything about it.</p><p>Eighteen months later, they gave me the letter, a very large check, and not long after, went out of business. All I wanted was a letter. And I got the letter, unfortunately, I had to publicly eviscerate a large publicly-traded company in order to get it. Plus hundreds of thousands of dollars for my trouble. Whether the Worldcon tribe stands down or doubles-down is largely irrelevant to me. I will achieve my objectives in either case. But I really would prefer to minimize any unnecessary collateral damage.</p></div>",
  "content_text": "Brad Torgersen explains his view of\ntribalism in science fiction\n:\nThe Hugos (and the Worldcon tribe alike) brand the Hugo as the award for the entirety of SF/F: books, stories, movies, television, music, art, you name it. This is not just the totem of the single SF/F tribe. This is the totem of all the SF/F tribes.\nBut the single tribe (Worldcon) wants the exclusive right to decide how the totem gets distributed — to which tribe members, and for what kinds of work.\nIt’s the totem of all, but to be decided by only some.\nThat — right there — is the root of the conflict. Totem of of all, decided by some. Sad Puppies 3 (and to a certain extent, Sad Puppies 2 and Sad Puppies 1) made the audacious claim that the totem for all, should be decided by all. Anyone willing to pay the poll tax (Worldcon membership) should have a say. We invited everyone to the democratic process. We didn’t care who was or was not in the “tribe” of World Science Fiction Society. This is the totem of all! And the rules pretty much make it so that all can participate!\nBut the Worldcon tribe — or at least certain vocal members within the tribe — have gone full-retard-tribal about the affront to “their” award, and “their” convention. So it’s tribe-vs-tribe. Are you in-tribe or out-tribe? How can anyone tell? Are you “of the body” of the tribe? Were you inculcated? No? Then what the hell are you doing coming to our tribal ground and fucking with our totem? It’s ours, dammit! Not yours! Ours!!\nProtestations about propriety are merely bureaucratic dressing for tribal reactionary mud-slinging.\nMud-slinging which was taken to the broader media by a few tribe-members determined to “nuke” us invaders: Sad Puppies.\nBut not just us alone. We were almost incidental. The partisans of the Worldcon tribe had a more serious foe in mind.\nBecause of all the things most frightening to the Worldcon tribe, the worst are the Visigoths of Vox Day. Not just an out-tribe, Vox and his fans represent an explicitly war-like and hostile tribe, come to seize the totem by brute means. So, some of the Worldcon tribe said, “No, we will destroy the totem first, before we let the Visigoths have it!” To which the Visigoths and their heathen king Vox replied, “If you destroy it this year, we will most certainly destroy it next year — and there is nothing you can do to stop us!”\nNow, the heathen king is terrifying to the Worldcon tribe. He is a literal barbarian. He talks and walks and threatens like a barbarian. He’s not precisely the guy anyone planned on walking through the democratic door. But because the Hugo voting process is democratic, nobody can be barred for purely tribal reasons. You pay your poll tax, you get a vote. The Worldcon tribe stares at both Sad Puppies 3 and the Rabid Puppies with equal dismay.\nBrad’s analogy makes sense, for the most part, but it misses one crucial detail because he is not of the Rabid Puppies. We’re not the barbarians. As it happens, they are. We are a foreign culture, possibly less numerous, but with much better technology, discipline, and foresight. We appear hostile and warlike, to be sure, but only because our thinking and objectives are entirely alien to them. Not only do they not understand us, but they have not even made any effort to do so. Nor would it likely avail them much if they did, if this reaction by one member of the Worldcon tribe is any indication:\nI think you really hit the nail on the head about tribalism. While I don’t feel tribalism in general about everyone different from me politically, I have felt very strong fear and vile about… that other guy, you know, the one who you won’t (and shouldn’t) unperson. 🙂 I have spent a lot of time on his blog and, to be frank, it terrifies me. It made me feel sick yet I couldn’t stop reading. I began going through his historical archives and a lot of his views on suffrage and marital relationships, in particular, made me feel nauseous. And what is the kneejerk reaction when someone like that makes us so sick… ban them, shun them, etc. And I think that is why GRRM asks you that question. Because He Who Should Not be Named isn’t just the “other side”, but someone who openly espouses, IMO, horrible, horrible views. I know he says that he doesn’t, but I can’t help but define his statements as misogynistic and racist.\nYet, the more I’ve thought about it, and read your words, I guess if you truly are going to be inclusive, that voice has the right to be heard as well, no matter how much it may scare or bother us. I personally believe that if we were to stop shouting about him as much or shouting at him and just back off and let him come and do what he wants, he actually would, in a way, “lose” some of his power.\nWhen I said fear, I was trying to be more general of all of us on the left “side” but I’ll try to be more clear. I guess I fear the fact that such… Nasty sentiments still exist in this day and age. It’s hard for me to comprehend. It’s not just his views… It’s the very insulting terminology he uses. And again, this is from actually reading years worth of his posts. The comparisons to training a wife like an animal, insulting the physical features of women he deems unattractive, he is a very mean, cruel person and I feel fear that those mindsets and hateful way of speaking still exists. He also seems to feel pride in his hateful words.\nFor what it’s worth, I’ve also spent a lot of time reading Wright’s blog. Like I said, I was determined to do my research and not just repeat what others have said. In terms of Wright, I actually agree with you. While I obviously don’t agree with a lot of his views, I didn’t find him to be purposely mean at all. As you said, hate the sin, love the sinner. I have actually seen that Christian mindset in him, Brad, and others. Nothing about VD comes off as Christian. He is mean to people, plain and simple. Nothing to do with just disagreeing, he goes out of his way to call people fat, ugly women look like a tranny, and way too many other numerous comments. It actually emotionally hurt reading many of his blogs. I never felt that way reading Brad, Larry, or Wright, even if I didn’t agree with their view….\nI have no real, actual complaint. I was just speaking of my perceptions.\nDespite her pain and fear, the commenter is, surprisingly enough, correct for the most part. Silencing us is not an option. They have no power to do so. Shouting at us is pointless. We don’t listen to them or care what they say. Shouting about us is also pointless. That only spreads our message and wins us more sympathy within their own tribe and among their allies.\nThey’re in the position of Flatlanders attempting to defend against an opponent operating in three dimensions. We can come at them any time we want from directions they don’t even know exist. But we don’t need to come at them at all. We have our own objectives that they would not credit even if we explained them fully and in detail; they can no more grasp them than a Flatlander can comprehend a cube.\nFor example, I have repeatedly stated for more than a year now that I have no particular interest in the Hugo Awards. I still don’t. Had they simply voted my work last year into last place and left it at that, I would never have even looked at the Worldcon rules. But once I was accused of gaming the system to obtain a 6 of 5 reward, I naturally decided to take a look at them. The rest, everyone knows.\nThe Dread Ilk are not a barbarian tribe that wants to take the land of the Worldcon tribe. We are an advanced foreign civilization that is simply going about its business in what naturally appears to be an inexplicable manner. We’re quite content to leave the primitives alone so long as they stay out of our way, but if a few of them decide to loose arrows at us as we work, we will respond with lasers and cobalt bombs without even thinking twice about it. Or paying any attention to the collateral damage.\nMy advice to the Worldcon community is very simple: don’t dig the hole deeper. Don’t scream at us, don’t insult us, don’t “send a message”, just settle down and do what you’ve always done and vote for whatever works you find to be the best, or the least offensive. Smile and politely do your jazz hands if a few of ours happen to claim the totem this year. We have no intention of camping the Hugos unless you give us a reason to do so. I have absolutely no desire to ever have as many Hugo nominations as Arthur C. Clarke, let alone Robert Heinlein or Isaac Asimov, but annoy me enough and I promise you that I will end up with more than David Hartwell and Mike Glyer\ncombined\n.\nThere is nothing to stop the Worldcon tribe from continuing to double-down until it is destroyed entirely. It’s their call. The situation rather reminds me of a conflict I once had with a very large, wealthy and arrogant publisher. All they had to do was send me a letter. A one-page letter. Nothing more. But they wouldn’t, for various reasons that mostly have to do with pride. They firmly believed that there was no way that two young game designers in Minnesota could do anything about it.\nEighteen months later, they gave me the letter, a very large check, and not long after, went out of business. All I wanted was a letter. And I got the letter, unfortunately, I had to publicly eviscerate a large publicly-traded company in order to get it. Plus hundreds of thousands of dollars for my trouble. Whether the Worldcon tribe stands down or doubles-down is largely irrelevant to me. I will achieve my objectives in either case. But I really would prefer to minimize any unnecessary collateral damage.",
  "tags": [
    "Hugo Award",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-16T11:00:00+00:00"
}