{
  "url": "https://voxday.net/2015/04/28/vile-minion-pride/",
  "scraped_at": "2025-12-16T12:53:51.605888",
  "title": "Vile Minion pride",
  "date_display": "April 28, 2015",
  "date_iso": "2015-04-28T12:00:00+00:00",
  "date_from_url": "2015-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dear Evil<br> Legion of Evil,</br></p><p>It has come to my attention that our vile faceless minions,<br> in their abject loyalty to Our Evilness, crave more than the<br> mere lash of our whips, the daily sustenance of SJW blood, and the occasional bones of an SJW on<br> which to gnaw. Such is their pride in the growing spread of the dark<br> shadow over lands hitherto unengulfed that they have begged for<br> badges of recognition with which they can strike yet more<br> fear into our craven and cowardly foes.</br></br></br></br></br></br></p><p>It is, of course, exceedingly risible to imagine that we should raise<br> them up to the extent of providing them with names. Or, as<br> one minion, who is unfortunately no longer with us after an<br> accident that involved six Hellhounds and the untimely ringing of a dinner<br> bell, once had the temerity to suggest, pay them wages. But it occurred to me, in a<br> stroke of Indubitably Evil Genius, that it might be<br> useful to be able to tell the difference between these<br> otherwise indistinguishable, and indeed, faceless,<br> creatures. Therefore, in my Tender yet Sinister Mercy, I have graciously acceded to their pleas.</br></br></br></br></br></br></br></br></p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2015/04/0001_Evil-Legion-of-Evil_Vile-Faceless-Minion_512x512.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"200\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/04/0001_Evil-Legion-of-Evil_Vile-Faceless-Minion_512x512.jpg\" width=\"200\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2015/04/0001_Evil-Legion-of-Evil_Vile-Faceless-Minion_512x512.jpg\" decoding=\"async\" height=\"200\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20200%20200%22%3E%3C/svg%3E\" width=\"200\"/></a></div><p>An example of the first said badge is provided, one which has already been awarded to <a href=\"http://bloggerblaster.blogspot.com/2015/04/slight-design-change.html\">the first and most ruthlessly loyal of our minions</a>. Should any<br> of these vile and faceless minions wish to boast their own number in the Evil Legion of<br> Evil, they have merely to humbly bring themselves to Our Superlatively Evil Attention via the word MINION.<br> My Inventively Evil and Aggressively Breasted Executive Assistant, Malwyn, she who is also known as the Whore-Mistress of the Spiked Six-Whip, will subsequently send them a uniquely numbered badge, which they can display<br> to the public with all the unseemly pride and haughty arrogance they will no doubt feel, filling SJW hearts with fear and horror thereby.</br></br></br></br></p><p>In Supreme Confidence of the Coming Day in which Darkness Shall Cover All the Land,</p><p>Vox Day<br> Supreme Dark Lord <br> Evil Legion of Evil</br></br></p><p><a name=\"more\"></a><br> And in other news, I answer a few questions about my intentions at File 770: <br> <i><br/></i><br> <i>“I don’t care about awards at all.”</i><br> <b><br>None the less, your nomination of yourself has been noted. Also, your nomination of people who work for you.”</br></b></br></br></br></br></p><p>Yes, that’s obvious. And the statement is nevertheless true.</p><p><b>“Well, who cares how many page views he gets?”</b></p><p>Scalzi and everyone who claims how popular and influential he is. It was all self-puffery all along. When he claimed to have 2 million pageviews monthly in a 2010 interview with Lightspeed and everyone bought it, he actually had 305k.<b></b></p><p>“No-one’s conspiring to keep you from your just rewards, we just individually don’t like you.”</p><p>Yes, I know. I still don’t care. Why is it that you feel the need to keep pointing out the obvious? Do you find it that hard to accept that I place no value on your precious opinion? And yes, I will keep coming after PNH, but no I would not go after Stross, Valente, or anyone else unless they give me reason to do so. Leave me alone, I’ll leave you alone. And unlike Scalzi, I have respect for Stross’s writing. I was one of the few people who used to nominate him for Nebulas back when he most deserved them.<b></b></p><p>“What is your ultimate objective regarding the Hugos this year? Is it to win a few for your writers?”</p><p>To see how the SF establishment responds. This was just recon. No, winning awards was never an objective. I do think John deserves to win a few, as with Stephenson and Mieville he is one of the best SF/F writers writing today. And if WorldCon prefers No Award to honoring Wright for works much superior to past winners, that will confirm what I suspected from the start. And what I expected.</p><p>See, I’ve never been interested in much more than convincing a large number of people that the SJWs in SF are, in fact, the cultural enemy. You’ve collectively played your part wonderfully well in that regard. Based on his recent piece, I think Jim Hines is one of the first to belatedly figured out what’s actually going on. But it’s far too late. The mask has not only slipped, it’s been ripped off.<b></b></p><p>“And what will your response be next year if SP/RP nominees are No Awarded this year, as some have threatened?”</p><p>I haven’t given the matter much thought, other than to point out the one obvious option. It’s no secret that a fair number of RP want me to declare No Award for everyone and everything THIS year. The idea had some appeal, but the SP asked me not to do that and I agreed to give WorldCon a chance to play ball. If they’d rather play war, well, I am a wargamer. That’s fine too.<b></b></p><p>“And what is the plan about getting yourself nominated as editor?”</p><p>I am the sharpest stick. And I am the best short-form editor this year, as it happens. Not that it is likely to matter with regards to the vote, but then, that’s sort of the point.<b></b></p><p>“In conclusion, if you don’t care about awards (and I believe you), why go through the exercise? Do you intend to advise your supporters how to cast their final ballot? Will you be actively coordinating the final ballot with Larry Corriea, Brad Torgersen, Jim Butcher, etc.? Will you be suggesting anything for No Award?”</p><p>To get a better grasp on what the other side can bring to the battlefield when motivated. Yes. No. I will either suggest everything or nothing for No Award, but I have not made a final decision. Out of respect for the opinions of SP and neutrals, I am leaning towards nothing but it is possible their opinions will change, given the behavior of the SJWs.</p><p>With regards to the vote, although Sasquan’s ballot is now open, I will not be posting my list of recommendations until several weeks after the Hugo packet is released. I have no idea when that will be, as I have not yet been contacted in that regard. However, those interested in reading the nominated works of John C. Wright can <a href=\"http://www.castaliahouse.com/downloads/the-nominated-short-fiction-works-of-john-c-wright/\">download them for free here</a>.</p></div>",
  "content_text": "Dear Evil\nLegion of Evil,\nIt has come to my attention that our vile faceless minions,\nin their abject loyalty to Our Evilness, crave more than the\nmere lash of our whips, the daily sustenance of SJW blood, and the occasional bones of an SJW on\nwhich to gnaw. Such is their pride in the growing spread of the dark\nshadow over lands hitherto unengulfed that they have begged for\nbadges of recognition with which they can strike yet more\nfear into our craven and cowardly foes.\nIt is, of course, exceedingly risible to imagine that we should raise\nthem up to the extent of providing them with names. Or, as\none minion, who is unfortunately no longer with us after an\naccident that involved six Hellhounds and the untimely ringing of a dinner\nbell, once had the temerity to suggest, pay them wages. But it occurred to me, in a\nstroke of Indubitably Evil Genius, that it might be\nuseful to be able to tell the difference between these\notherwise indistinguishable, and indeed, faceless,\ncreatures. Therefore, in my Tender yet Sinister Mercy, I have graciously acceded to their pleas.\nAn example of the first said badge is provided, one which has already been awarded to\nthe first and most ruthlessly loyal of our minions\n. Should any\nof these vile and faceless minions wish to boast their own number in the Evil Legion of\nEvil, they have merely to humbly bring themselves to Our Superlatively Evil Attention via the word MINION.\nMy Inventively Evil and Aggressively Breasted Executive Assistant, Malwyn, she who is also known as the Whore-Mistress of the Spiked Six-Whip, will subsequently send them a uniquely numbered badge, which they can display\nto the public with all the unseemly pride and haughty arrogance they will no doubt feel, filling SJW hearts with fear and horror thereby.\nIn Supreme Confidence of the Coming Day in which Darkness Shall Cover All the Land,\nVox Day\nSupreme Dark Lord\nEvil Legion of Evil\nAnd in other news, I answer a few questions about my intentions at File 770:\n“I don’t care about awards at all.”\nNone the less, your nomination of yourself has been noted. Also, your nomination of people who work for you.”\nYes, that’s obvious. And the statement is nevertheless true.\n“Well, who cares how many page views he gets?”\nScalzi and everyone who claims how popular and influential he is. It was all self-puffery all along. When he claimed to have 2 million pageviews monthly in a 2010 interview with Lightspeed and everyone bought it, he actually had 305k.\n“No-one’s conspiring to keep you from your just rewards, we just individually don’t like you.”\nYes, I know. I still don’t care. Why is it that you feel the need to keep pointing out the obvious? Do you find it that hard to accept that I place no value on your precious opinion? And yes, I will keep coming after PNH, but no I would not go after Stross, Valente, or anyone else unless they give me reason to do so. Leave me alone, I’ll leave you alone. And unlike Scalzi, I have respect for Stross’s writing. I was one of the few people who used to nominate him for Nebulas back when he most deserved them.\n“What is your ultimate objective regarding the Hugos this year? Is it to win a few for your writers?”\nTo see how the SF establishment responds. This was just recon. No, winning awards was never an objective. I do think John deserves to win a few, as with Stephenson and Mieville he is one of the best SF/F writers writing today. And if WorldCon prefers No Award to honoring Wright for works much superior to past winners, that will confirm what I suspected from the start. And what I expected.\nSee, I’ve never been interested in much more than convincing a large number of people that the SJWs in SF are, in fact, the cultural enemy. You’ve collectively played your part wonderfully well in that regard. Based on his recent piece, I think Jim Hines is one of the first to belatedly figured out what’s actually going on. But it’s far too late. The mask has not only slipped, it’s been ripped off.\n“And what will your response be next year if SP/RP nominees are No Awarded this year, as some have threatened?”\nI haven’t given the matter much thought, other than to point out the one obvious option. It’s no secret that a fair number of RP want me to declare No Award for everyone and everything THIS year. The idea had some appeal, but the SP asked me not to do that and I agreed to give WorldCon a chance to play ball. If they’d rather play war, well, I am a wargamer. That’s fine too.\n“And what is the plan about getting yourself nominated as editor?”\nI am the sharpest stick. And I am the best short-form editor this year, as it happens. Not that it is likely to matter with regards to the vote, but then, that’s sort of the point.\n“In conclusion, if you don’t care about awards (and I believe you), why go through the exercise? Do you intend to advise your supporters how to cast their final ballot? Will you be actively coordinating the final ballot with Larry Corriea, Brad Torgersen, Jim Butcher, etc.? Will you be suggesting anything for No Award?”\nTo get a better grasp on what the other side can bring to the battlefield when motivated. Yes. No. I will either suggest everything or nothing for No Award, but I have not made a final decision. Out of respect for the opinions of SP and neutrals, I am leaning towards nothing but it is possible their opinions will change, given the behavior of the SJWs.\nWith regards to the vote, although Sasquan’s ballot is now open, I will not be posting my list of recommendations until several weeks after the Hugo packet is released. I have no idea when that will be, as I have not yet been contacted in that regard. However, those interested in reading the nominated works of John C. Wright can\ndownload them for free here\n.",
  "tags": [
    "conspiracy",
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-28T11:00:00+00:00"
}