{
  "url": "https://voxday.net/2015/04/23/when-i-said-always-i-meant-always/",
  "scraped_at": "2025-12-16T12:53:19.587001",
  "title": "When I said “always, I meant “always”.",
  "date_display": "April 23, 2015",
  "date_iso": "2015-04-23T22:34:00+00:00",
  "date_from_url": "2015-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In re SJWs. <a href=\"https://twitter.com/alexandraerin\">This chubbo</a> just can’t stop digging deeper:</p><blockquote class=\"tr_bq\"><p> Alexandra Erin ‏@alexandraerin<br> Anyone else notice that the thing the Sad Puppies take exception with David Gerrold for saying is “nobody wants to hang out with assholes”?</br></p><p>Alexandra Erin ‏@alexandraerin<br> They read into that the threat of a blacklist, which is a stretch, but it’s more than that.</br></p><p>Alexandra Erin ‏@alexandraerin<br> As much as the SPs/RPs keep singing the refrain of “WE DON’T CARE”, it hurts them that people don’t have to like them.</br></p><p>Alexandra Erin ‏@alexandraerin<br> It hurts them that people don’t have to like the books they write, or the books they like.</br></p><p>Alexandra Erin ‏@alexandraerin<br> It hurts them so much that they have to invent an entire alternate reality where no one REALLY dislikes them except a small clique.</br></p><p>Alexandra Erin ‏@alexandraerin<br> “The problem isn’t that I’m an asshole no one wants to associate with outside my own small clique!” they say. “People are just scared.”</br></p><p>Alexandra Erin ‏@alexandraerin<br> “I’m actually super popular and everyone loves me. They’re just too afraid to say so.”</br></p><p>Alexandra Erin ‏@alexandraerin<br> No one as immune to the “feelbads” as the puppies claim to be could be threatened by the statement “no one wants to hang out with assholes.”</br></p><p>Alexandra Erin ‏@alexandraerin<br> You know what it means when they clamor for David Gerrold to be sanctioned for stating the simple truth that people don’t like assholes?</br></p><p>Alexandra Erin ‏@alexandraerin<br> It means they’re asking for censorship. Of course, they’ve been demanding censorship all along. They just dress it up as different things.</br></p><p>Alexandra Erin ‏@alexandraerin<br> The only difference between “I don’t think stories I don’t like should be praised or nominated” and what the puppies are doing is HONESTY.</br></p><p>Alexandra Erin ‏@alexandraerin<br> It’s the same dodge GG uses with its shielding battlecry of “ETHICS!”</br></p><p>Alexandra Erin ‏@alexandraerin<br> Saying, “I don’t think people should be allowed to praise this story/game” = obvious game over. So they say “Anyone doing so must be LYING.”</br></p><p>Alexandra Erin ‏@alexandraerin<br> And then, oh, then… then they’re not arguing for censorship, but arguing against deception! Who could oppose that?</br></p><p>Alexandra Erin ‏@alexandraerin<br> David Gerrold said, very simply and very clearly, that people don’t like to hang out with assholes. Is that not manifestly true?</br></p><p>Alexandra Erin ‏@alexandraerin<br> Not one Sad Puppy will address this because it doesn’t fit their narrative. Facts? Who needs them! They FEEL attacked by it. That’s enough.</br></p><p>Alexandra Erin @alexandraerin<br> Heck, Gerrold even explicitly said he’s not talking about a blacklist. But liar-in-chief Vox Day said Gerrold “literally” called for one.</br></p></blockquote><p> Vox Day ‏@voxday<br> .@alexandraerin Exactly when and where did I say “Gerrold ‘literally’ called for” a blacklist? What is the exact quote you are quoting?</br></p><p>In the meantime, while he/she/it is busy searching for that nonexistent lie, let’s not forget the following statement by Mr. Gerrold. Presumably he is only telling Brad this in order to ensure no one has to hang out with bodily orifices.</p><p><i>“I will make sure you NEVER win a Hugo!”</i> – David Gerrold to Brad Torgersen on Facebook.</p><p>The “no blacklist” argument is about as convincing as David Gerrold coming out on stage at WorldCon in a leopard print g-string, dancing to Erasure under a disco ball with a dog leash around his neck held by a bald man wearing nothing but a mustache and leather chaps, then holding up his hands and insisting, “no homo”.</p><p>Let’s face it, if the Nielsen Haydens were caught red-handed making a list of writers who would never be permitted to publish at Tor.com, the SJWs would claim it wasn’t a blacklist so long as the names were written in blue ink.</p></div>",
  "content_text": "In re SJWs.\nThis chubbo\njust can’t stop digging deeper:\nAlexandra Erin ‏@alexandraerin\nAnyone else notice that the thing the Sad Puppies take exception with David Gerrold for saying is “nobody wants to hang out with assholes”?\nAlexandra Erin ‏@alexandraerin\nThey read into that the threat of a blacklist, which is a stretch, but it’s more than that.\nAlexandra Erin ‏@alexandraerin\nAs much as the SPs/RPs keep singing the refrain of “WE DON’T CARE”, it hurts them that people don’t have to like them.\nAlexandra Erin ‏@alexandraerin\nIt hurts them that people don’t have to like the books they write, or the books they like.\nAlexandra Erin ‏@alexandraerin\nIt hurts them so much that they have to invent an entire alternate reality where no one REALLY dislikes them except a small clique.\nAlexandra Erin ‏@alexandraerin\n“The problem isn’t that I’m an asshole no one wants to associate with outside my own small clique!” they say. “People are just scared.”\nAlexandra Erin ‏@alexandraerin\n“I’m actually super popular and everyone loves me. They’re just too afraid to say so.”\nAlexandra Erin ‏@alexandraerin\nNo one as immune to the “feelbads” as the puppies claim to be could be threatened by the statement “no one wants to hang out with assholes.”\nAlexandra Erin ‏@alexandraerin\nYou know what it means when they clamor for David Gerrold to be sanctioned for stating the simple truth that people don’t like assholes?\nAlexandra Erin ‏@alexandraerin\nIt means they’re asking for censorship. Of course, they’ve been demanding censorship all along. They just dress it up as different things.\nAlexandra Erin ‏@alexandraerin\nThe only difference between “I don’t think stories I don’t like should be praised or nominated” and what the puppies are doing is HONESTY.\nAlexandra Erin ‏@alexandraerin\nIt’s the same dodge GG uses with its shielding battlecry of “ETHICS!”\nAlexandra Erin ‏@alexandraerin\nSaying, “I don’t think people should be allowed to praise this story/game” = obvious game over. So they say “Anyone doing so must be LYING.”\nAlexandra Erin ‏@alexandraerin\nAnd then, oh, then… then they’re not arguing for censorship, but arguing against deception! Who could oppose that?\nAlexandra Erin ‏@alexandraerin\nDavid Gerrold said, very simply and very clearly, that people don’t like to hang out with assholes. Is that not manifestly true?\nAlexandra Erin ‏@alexandraerin\nNot one Sad Puppy will address this because it doesn’t fit their narrative. Facts? Who needs them! They FEEL attacked by it. That’s enough.\nAlexandra Erin @alexandraerin\nHeck, Gerrold even explicitly said he’s not talking about a blacklist. But liar-in-chief Vox Day said Gerrold “literally” called for one.\nVox Day ‏@voxday\n.@alexandraerin Exactly when and where did I say “Gerrold ‘literally’ called for” a blacklist? What is the exact quote you are quoting?\nIn the meantime, while he/she/it is busy searching for that nonexistent lie, let’s not forget the following statement by Mr. Gerrold. Presumably he is only telling Brad this in order to ensure no one has to hang out with bodily orifices.\n“I will make sure you NEVER win a Hugo!”\n– David Gerrold to Brad Torgersen on Facebook.\nThe “no blacklist” argument is about as convincing as David Gerrold coming out on stage at WorldCon in a leopard print g-string, dancing to Erasure under a disco ball with a dog leash around his neck held by a bald man wearing nothing but a mustache and leather chaps, then holding up his hands and insisting, “no homo”.\nLet’s face it, if the Nielsen Haydens were caught red-handed making a list of writers who would never be permitted to publish at Tor.com, the SJWs would claim it wasn’t a blacklist so long as the names were written in blue ink.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-23T21:34:00+00:00"
}