{
  "url": "https://voxday.net/2015/04/13/when-nukes-are-inevitable/",
  "scraped_at": "2025-12-16T12:52:08.280688",
  "title": "When nukes are inevitable…",
  "date_display": "April 13, 2015",
  "date_iso": "2015-04-13T12:00:00+00:00",
  "date_from_url": "2015-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Relax and enjoy the decline of total war. Jerry Pournelle discusses <a href=\"http://www.jerrypournelle.com/chaosmanor/if-you-would-have-peace-wordpress-warning-whos-the-boss/\">the inevitability of Iranian nukes</a> with a reader:</p><blockquote class=\"tr_bq\"><p> <i>Assuming that we were to bomb Iran, how long could we expect to set back their nuclear program?</i><br> <i><br/></i><br> <i>Let’s<br> assume, for the moment, a “surgical” strike whose targets are all<br> nuclear facilities. Comments I’ve read from people who ought to know<br> something maintain that we’d probably set back the program two or three<br> years; with the predictable consequence that Iran would immediately<br> begin the best financed and most clandestine program it could to produce<br> nuclear weapons *immediately*.</br></br></br></br></br></br></i><br> <i><br>Here, I think, we run into the North<br> Korea quandary. It is already possible for any tyrant to make the case<br> that, however appalling you are, if you have nuclear weapons the United<br> States will leave you alone; whereas if you do not have nuclear weapons<br> you live on sufferance. That’s awkward. While I certainly wouldn’t want<br> to encourage nuclear proliferation, I’m not sure it’s helpful to<br> persuade tyrants that they *really, really need* nuclear weapons.</br></br></br></br></br></br></br></i><br> <i><br>Now,<br> of course, the problem could perhaps be “solved” by strikes aimed not<br> at nuclear plants but at destroying Iran as a civilization. At which<br> point we really would have become a Satan. Or, at least, an apocalyptic<br> Babylon.</br></br></br></br></br></i><br> <i><br>So my question to Mr. Stephens would be: short of becoming<br> monsters, there is probably no permanent way to prevent Iran from<br> getting nuclear weapons. In consequence, do we really want to pursue a<br> strategy whose likely result would be to urge them to get the bomb<br> *really quickly?* Or are delaying tactics more likely to produce useful<br> results?</br></br></br></br></br></br></i><br> <i><br>Buying time is always a useful purchase. And perhaps the horse will learn to sing.<br> </br></br></i><br> <i>Yours,<br>Allan E. Johnson</br></i></br></br></br></br></br></br></br></p><p>Allan Johnson puts the case well and compellingly. Our choices are<br> few, and our technical capabilities are uncertain. Strikes at Iranian<br> nuclear capabilities will be bloody given their locations. Commando<br> style raids would make the destruction more thorough but would be far<br> more costly. The Iranians have been clever in their designs and<br> location. Uncertainties about the success of a surgical denuclearization<br> attack are quite high for the US or any conceivable coalition working<br> with us.</br></br></br></br></br></br></br></p><p>Of course that is doubly, triply, true for Israel; to assure the<br> attack’s success might require nuclear weapons, and I am quite certain<br> that at least some IDF generals have said this to the War Cabinet. First<br> use of nuclear weapons has so many devastating diplomatic and domestic<br> political consequences that I doubt Mr. Netanyahu would seriously<br> consider it.</br></br></br></br></br></p><p>Buying time may be all that is possible.</p></blockquote><p>And buying time is pointless except for the small minority who benefit from the delay. In some cases, such as the Federal Reserve’s decision to delay the inevitable bankruptcies of the indebted, buying time has made the situation observably worse for most.</p><p>The real question is if Israel genuinely feels itself threatened by a nuclear Iran or not. Considering that Martin van Creveld has been very clear about the fact <a href=\"http://www.milobookclub.com/2015/03/30/irans-nukes-israeli-perspective/\">that it does not</a>, we can safely discount the likelihood that Israel will do anything, much less nuke Iran. I don’t doubt that Israel would do so if they perceived a legitimate  existential threat, but the fact that they have not done so already suffices to indicate that they do not.</p><p>After reading several of van Creveld’s books from THE TRANSFORMATION OF WAR to A HISTORY OF STRATEGY and TECHNOLOGY AND WAR, it has become very clear that the primary military function of nuclear weapons is to take 20th century total war off the table. This does not mean that war will not take place, but rather, that it will take place on a scale more similar to those wars prior to the mass mobilizations of entire populations and the targeting of enemy civilians.</p><p>Remember, war has historically almost NEVER been primarily about killing the enemy, but rather destroying his will to fight by demoralizing him. And that should be of considerably more concern to an utterly, and literally, de-moralized West than one more nation possessing weapons it has no intention of using unless attacked.</p></div>",
  "content_text": "Relax and enjoy the decline of total war. Jerry Pournelle discusses\nthe inevitability of Iranian nukes\nwith a reader:\nAssuming that we were to bomb Iran, how long could we expect to set back their nuclear program?\nLet’s\nassume, for the moment, a “surgical” strike whose targets are all\nnuclear facilities. Comments I’ve read from people who ought to know\nsomething maintain that we’d probably set back the program two or three\nyears; with the predictable consequence that Iran would immediately\nbegin the best financed and most clandestine program it could to produce\nnuclear weapons *immediately*.\nHere, I think, we run into the North\nKorea quandary. It is already possible for any tyrant to make the case\nthat, however appalling you are, if you have nuclear weapons the United\nStates will leave you alone; whereas if you do not have nuclear weapons\nyou live on sufferance. That’s awkward. While I certainly wouldn’t want\nto encourage nuclear proliferation, I’m not sure it’s helpful to\npersuade tyrants that they *really, really need* nuclear weapons.\nNow,\nof course, the problem could perhaps be “solved” by strikes aimed not\nat nuclear plants but at destroying Iran as a civilization. At which\npoint we really would have become a Satan. Or, at least, an apocalyptic\nBabylon.\nSo my question to Mr. Stephens would be: short of becoming\nmonsters, there is probably no permanent way to prevent Iran from\ngetting nuclear weapons. In consequence, do we really want to pursue a\nstrategy whose likely result would be to urge them to get the bomb\n*really quickly?* Or are delaying tactics more likely to produce useful\nresults?\nBuying time is always a useful purchase. And perhaps the horse will learn to sing.\nYours,\nAllan E. Johnson\nAllan Johnson puts the case well and compellingly. Our choices are\nfew, and our technical capabilities are uncertain. Strikes at Iranian\nnuclear capabilities will be bloody given their locations. Commando\nstyle raids would make the destruction more thorough but would be far\nmore costly. The Iranians have been clever in their designs and\nlocation. Uncertainties about the success of a surgical denuclearization\nattack are quite high for the US or any conceivable coalition working\nwith us.\nOf course that is doubly, triply, true for Israel; to assure the\nattack’s success might require nuclear weapons, and I am quite certain\nthat at least some IDF generals have said this to the War Cabinet. First\nuse of nuclear weapons has so many devastating diplomatic and domestic\npolitical consequences that I doubt Mr. Netanyahu would seriously\nconsider it.\nBuying time may be all that is possible.\nAnd buying time is pointless except for the small minority who benefit from the delay. In some cases, such as the Federal Reserve’s decision to delay the inevitable bankruptcies of the indebted, buying time has made the situation observably worse for most.\nThe real question is if Israel genuinely feels itself threatened by a nuclear Iran or not. Considering that Martin van Creveld has been very clear about the fact\nthat it does not\n, we can safely discount the likelihood that Israel will do anything, much less nuke Iran. I don’t doubt that Israel would do so if they perceived a legitimate  existential threat, but the fact that they have not done so already suffices to indicate that they do not.\nAfter reading several of van Creveld’s books from THE TRANSFORMATION OF WAR to A HISTORY OF STRATEGY and TECHNOLOGY AND WAR, it has become very clear that the primary military function of nuclear weapons is to take 20th century total war off the table. This does not mean that war will not take place, but rather, that it will take place on a scale more similar to those wars prior to the mass mobilizations of entire populations and the targeting of enemy civilians.\nRemember, war has historically almost NEVER been primarily about killing the enemy, but rather destroying his will to fight by demoralizing him. And that should be of considerably more concern to an utterly, and literally, de-moralized West than one more nation possessing weapons it has no intention of using unless attacked.",
  "tags": [
    "war",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-13T11:00:00+00:00"
}