{
  "url": "https://voxday.net/2015/04/22/when-rabbits-rabbi/",
  "scraped_at": "2025-12-16T12:53:06.596531",
  "title": "When rabbits rabbit",
  "date_display": "April 22, 2015",
  "date_iso": "2015-04-22T06:00:00+00:00",
  "date_from_url": "2015-04-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not sure which is more amusing, this guy’s complete failure to even begin to grasp what neo-fascism is, the fact that the SJWs are pretending to take his ranting babble seriously, his claim that “If You Gave a Dinosaur a Cookie, My Love” is better than anything on the 2015 shortlist, or the severeness of the butthurt <a href=\"http://www.philipsandifer.com/2015/04/guided-by-beauty-of-their-weapons.html\">radiating from his crimson posterior</a>:</p><blockquote class=\"tr_bq\"><p> Fuck you, Theodore Beale.</p><p>Fuck you for trying to break a thing I loved. Fuck you for doing it to serve your stupid, lame fascist ideology. More to the point, fuck you for your stupid, lame fascist ideology. Your beliefs are horrible. You’re horrible. You’re a nasty, cruel little bully, and I do not like you.</p><p>Fuck you for making me feel that way. Fuck you for the way you’ve brought this thing that I love, this celebration of great science fiction, to a point where it is full of the sort of mean and hateful desires that seem to animate you. Fuck you for dragging us all down to your sorry level. Fuck you for being so odious that we have to go there.</p><p>And fuck you for making me want you to hate me. Fuck you for all of your beliefs that amount to nothing short of hatred for the things I love. For the people I love. For the art and beautiful things that are why I get out of bed in the morning. Fuck you for living your life for the sole purpose of destroying things that I love, and for making me wish that I could destroy something of yours in retaliation. Fuck you for making me write this, in the sincere and passionate hope that it will make you feel even a moment’s unpleasantness.</p><p>And fuck you for the very real possibility that a work nominated purely because you used your noxious little voice to rally your loathsome, asshole supporters to support it might win a Hugo Award. Fuck you because it’s actually possible that you will break the Hugos successfully and demonstrate that you’re oh so much stronger than a bunch of fans who were previously just happily attending a convention and voting for stuff they loved in awards. In short, fuck you.</p></blockquote><p>Other than that, how was the play, Mrs. Lincoln? I am afraid that the only thing this extended rabbiting managed to elicit from me was a wry smile. As for my “loathsome asshole supporters”, every article like this creates more of them because the true face of the SJW cannot be forgotten once it is revealed. And the lesson, as always, is this: <i>SJWs always lie.</i></p><p>I particularly enjoyed the punchline: “I will not attempt to construct some absolute explanation of Theodore<br> Beale’s beliefs. Instead, I will construct a caricature of them.”</br></p><p>You don’t say….</p></div>",
  "content_text": "I’m not sure which is more amusing, this guy’s complete failure to even begin to grasp what neo-fascism is, the fact that the SJWs are pretending to take his ranting babble seriously, his claim that “If You Gave a Dinosaur a Cookie, My Love” is better than anything on the 2015 shortlist, or the severeness of the butthurt\nradiating from his crimson posterior\n:\nFuck you, Theodore Beale.\nFuck you for trying to break a thing I loved. Fuck you for doing it to serve your stupid, lame fascist ideology. More to the point, fuck you for your stupid, lame fascist ideology. Your beliefs are horrible. You’re horrible. You’re a nasty, cruel little bully, and I do not like you.\nFuck you for making me feel that way. Fuck you for the way you’ve brought this thing that I love, this celebration of great science fiction, to a point where it is full of the sort of mean and hateful desires that seem to animate you. Fuck you for dragging us all down to your sorry level. Fuck you for being so odious that we have to go there.\nAnd fuck you for making me want you to hate me. Fuck you for all of your beliefs that amount to nothing short of hatred for the things I love. For the people I love. For the art and beautiful things that are why I get out of bed in the morning. Fuck you for living your life for the sole purpose of destroying things that I love, and for making me wish that I could destroy something of yours in retaliation. Fuck you for making me write this, in the sincere and passionate hope that it will make you feel even a moment’s unpleasantness.\nAnd fuck you for the very real possibility that a work nominated purely because you used your noxious little voice to rally your loathsome, asshole supporters to support it might win a Hugo Award. Fuck you because it’s actually possible that you will break the Hugos successfully and demonstrate that you’re oh so much stronger than a bunch of fans who were previously just happily attending a convention and voting for stuff they loved in awards. In short, fuck you.\nOther than that, how was the play, Mrs. Lincoln? I am afraid that the only thing this extended rabbiting managed to elicit from me was a wry smile. As for my “loathsome asshole supporters”, every article like this creates more of them because the true face of the SJW cannot be forgotten once it is revealed. And the lesson, as always, is this:\nSJWs always lie.\nI particularly enjoyed the punchline: “I will not attempt to construct some absolute explanation of Theodore\nBeale’s beliefs. Instead, I will construct a caricature of them.”\nYou don’t say….",
  "tags": [
    "Hugo Award",
    "rabbitology",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-22T05:00:00+00:00"
}