{
  "url": "https://voxday.net/2015/04/29/who-needs-that-pesky-civilization-anyhow/",
  "scraped_at": "2025-12-16T12:53:58.978173",
  "title": "Who needs that pesky “civilization” anyhow?",
  "date_display": "April 29, 2015",
  "date_iso": "2015-04-29T12:00:00+00:00",
  "date_from_url": "2015-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently we need to readjust our vocabularies again. It’s no longer white/yellow/red/brown separatism, it’s just <a href=\"http://www.salon.com/2015/04/28/baltimores_violent_protesters_are_right_smashing_police_cars_is_a_legitimate_political_strategy/?utm_source=twitter&amp;utm_medium=socialflow\">militant-shaming</a>.</p><blockquote class=\"tr_bq\"><p> As a nation, we fail to comprehend Black political strategy in much the same way we fail to recognize the value of Black life.</p><p>We<br> see ghettos and crime and absent parents where we should see<br> communities actively struggling against mental health crises and<br> premeditated economic exploitation. And when we see police cars being<br> smashed and corporate property being destroyed, we should see reasonable<br> responses to generations of extreme state violence, and logical<br> decisions about what kind of actions yield the desired political<br> results.</br></br></br></br></br></br></br></p><p>I’m overwhelmed by the pervasive slandering of protesters in Baltimore this weekend for not remaining peaceful….We need to clarify what we mean by terms like “violence” and<br> “peaceful.” Because, to be clear, violence is beating, harassing,<br> tazing, assaulting and shooting Black, trans, immigrant, women, and<br> queer people, and that is the reality many of us are dealing with daily.<br> Telling someone to be peaceful and shaming their militance not only<br> lacks a nuanced and historical political understanding, it is literally a<br> deadly and irresponsible demand.</br></br></br></br></br></br></p><p>The political goals of rioters in Baltimore are not unclear—just as they were not unclear when poor, Black people rioted in Ferguson last fall. When the free market, real estate, the elected government, the legal system have all shown you they are not going to protect you—in fact, that they are the sources of the greatest violence you face—then political action becomes about stopping the machine that is trying to kill you, even if only for a moment, getting the boot off your neck, even if it only allows you a second of air. This is exactly what blocking off streets, disrupting white consumerism, and destroying state property are designed to do.</p><p>Black people know this, and have<br> employed these tactics for a very, very long time. Calling them<br> uncivilized, and encouraging them to mind the Constitution is racist,<br> and as an argument fails to ground itself not only in the violent<br> political reality in which Black people find themselves, but also in our<br> centuries-long tradition of resistance, one that has taught effective<br> strategies for militance and direct action to virtually every other<br> current movement for justice.</br></br></br></br></br></br></br></p></blockquote><p>There is your choice, white America. Racism, aka “civilization and the Constitution” or living amongst an entitled and vibrant population that feels entirely justified in burning down the city around itself. I think it’s long past time for forced integration. But not for schoolchildren, for those who claim to oppose separatism. Let’s bus every self-professed “anti-racist” to Baltimore and make them live and work there.</p><p>They seem to think all of White America would rather die than be called racist. And they’re probably not wrong about the SJWs. But what the advocates of multiculturalism forgot is that Mexicans and Asians despise blacks in a way that few whites ever have, and they feel absolutely no guilt for the so-called “legacy of slavery”.</p><p>And if you’re going to try to make American Indians feel guilty about racial separatism, well, good luck with that.</p></div>",
  "content_text": "Apparently we need to readjust our vocabularies again. It’s no longer white/yellow/red/brown separatism, it’s just\nmilitant-shaming\n.\nAs a nation, we fail to comprehend Black political strategy in much the same way we fail to recognize the value of Black life.\nWe\nsee ghettos and crime and absent parents where we should see\ncommunities actively struggling against mental health crises and\npremeditated economic exploitation. And when we see police cars being\nsmashed and corporate property being destroyed, we should see reasonable\nresponses to generations of extreme state violence, and logical\ndecisions about what kind of actions yield the desired political\nresults.\nI’m overwhelmed by the pervasive slandering of protesters in Baltimore this weekend for not remaining peaceful….We need to clarify what we mean by terms like “violence” and\n“peaceful.” Because, to be clear, violence is beating, harassing,\ntazing, assaulting and shooting Black, trans, immigrant, women, and\nqueer people, and that is the reality many of us are dealing with daily.\nTelling someone to be peaceful and shaming their militance not only\nlacks a nuanced and historical political understanding, it is literally a\ndeadly and irresponsible demand.\nThe political goals of rioters in Baltimore are not unclear—just as they were not unclear when poor, Black people rioted in Ferguson last fall. When the free market, real estate, the elected government, the legal system have all shown you they are not going to protect you—in fact, that they are the sources of the greatest violence you face—then political action becomes about stopping the machine that is trying to kill you, even if only for a moment, getting the boot off your neck, even if it only allows you a second of air. This is exactly what blocking off streets, disrupting white consumerism, and destroying state property are designed to do.\nBlack people know this, and have\nemployed these tactics for a very, very long time. Calling them\nuncivilized, and encouraging them to mind the Constitution is racist,\nand as an argument fails to ground itself not only in the violent\npolitical reality in which Black people find themselves, but also in our\ncenturies-long tradition of resistance, one that has taught effective\nstrategies for militance and direct action to virtually every other\ncurrent movement for justice.\nThere is your choice, white America. Racism, aka “civilization and the Constitution” or living amongst an entitled and vibrant population that feels entirely justified in burning down the city around itself. I think it’s long past time for forced integration. But not for schoolchildren, for those who claim to oppose separatism. Let’s bus every self-professed “anti-racist” to Baltimore and make them live and work there.\nThey seem to think all of White America would rather die than be called racist. And they’re probably not wrong about the SJWs. But what the advocates of multiculturalism forgot is that Mexicans and Asians despise blacks in a way that few whites ever have, and they feel absolutely no guilt for the so-called “legacy of slavery”.\nAnd if you’re going to try to make American Indians feel guilty about racial separatism, well, good luck with that.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-29T11:00:00+00:00"
}