{
  "url": "https://voxday.net/2015/04/26/yeah-so-about-tha/",
  "scraped_at": "2025-12-16T12:53:36.916217",
  "title": "Yeah, so, about that….",
  "date_display": "April 26, 2015",
  "date_iso": "2015-04-26T17:00:00+00:00",
  "date_from_url": "2015-04-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What’s the lesson? No, not the one about women, the one about SJWs:</p><blockquote class=\"tr_bq\"><p> John Scalzi ‏@scalzi  <br> I’m not the Anti-Beale. I’m merely the person who Beale so very desperately wishes he had the career of.</br></p><p>Deirdre Saoirse Moen ‏@deirdresm<br> Which is why his Alexa rank is &lt; 1000 milliScalzis.</br></p><p>Notorious E.G.G. ‏@silvermink<br> Though, I have to say, his Alexa rank is much closer to that number than my faith in humanity can handle sometimes.</br></p><p>John Scalzi ‏@scalzi <br> Trust me, if his Alexa score ever gets above mine, he’ll trumpet it to the heavens.</br></p><p>Deirdre Saoirse Moen ‏@deirdresm<br> It wasn’t until I looked at the puppy Alexa rankings that I understood why RP was more successful than SP. Sigh.</br></p><p>Notorious E.G.G. ‏@silvermink<br> People actually listen to Mr. Beale, mindboggling as I find that.</br></p><p>John Scalzi ‏@scalzi<br> Yeah, but they’re assholes.</br></p><p>Notorious E.G.G. ‏@silvermink<br> A bit of a saving grace, it’s true.</br></p><p>Jonathan Bergeron<br> now that’s a burn</br></p><p>John Scalzi ‏@scalzi<br> It’s not the Alexa award. It’s that the RPs appealed more to people happy to shit all over other people.</br></p><p>Deirdre Saoirse Moen ‏@deirdresm<br>  I figured as much (and said so in response to a comment).</br></p><p>Marty ‏@hugbug94<br> VDBEALE doesn’t have the writing chops to be in your league.</br></p><p>John Scalzi ‏@scalzi<br> Thanks, although I would not that for commercial success, writing chops are not always required.</br></p></blockquote><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2015/04/Alexa_Apr15.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"232\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/04/Alexa_Apr15.jpg\" width=\"400\"/></a></div><p><b>Current Alexa Ranks</b></p><p>Scalzi Global: 84,147<br> Scalzi USA: 18,628</br></p><p>VP Global: 84,187<br> VP USA: 17,599</br></p><p>Now, Alexa is a ridiculous measure, as it is based on links rather than the more straightforward metric of traffic. At present, VP alone has about 3x Scalzi’s Google pageview traffic, and VP+AG has about 4x the traffic. If history is any guide, we should see the first 2 million-pageview month in August; this month is on course for 1.9 million+ combined.</p><p>But, as is our wont, let us count the lies:</p><ol><li><i>I very desperately wish I had John Scalzi’s career.</i> I’m a lead game designer, a lead editor, and a minor author. He’s a very successful midlist author who is making some headway in television and failed as a game writer. My blogs surpass his by a factor of four and are nearly double his all-time peak. My Twitter Impression/follower ratio is considerably higher (355 to 125), and despite having only one-fifth the Impressions and one-seventeenth the followers, I expect my Impressions will pass up his within 18 months.</li><li><i>I will trumpet to the heavens if my Alexa score ever passes his.</i> It did, months ago. I didn’t. That’s VP alone, by the way, VP+AG is far beyond his, as AG alone is around 105k Global.</li><li><i>People who read here are assholes. </i>Actually, according to the demographics, you’re much wealthier and better-educated than the norm. And considering how lightly I moderate, I think it’s self-evident that most people here are more civil than average as well. You’re certainly less vulgar than Scalzi’s commenters, for the most part. I like you, anyhow. Obviously, he doesn’t.</li><li><i>RPs appealed more to people happy to shit all over other people. </i>Considering how the SJWs have treated the 2015 nominees, this is certainly false when compared to them. But compared to Sad Puppies, that’s probably true. It’s an unfair and misleading exaggeration, but not a lie.</li><li><i>VDBEALE doesn’t have the writing chops to be in Scalzi’s league. </i>Actually, I’d put us both right in the same league. We’re both mediocre, albeit for very different reasons. My Style has no melody, no flare. It is plodding and pedestrian whereas Scalzi’s Style is light and breezy. Scalzi can’t do characters and they all speak in one snarky voice: his own. My characters are diverse and distinct, albeit limited to the upper half of the male spectrum. I think Story comes out fairly equal, although he directly rips off the greats whereas I merely borrow here and there, Concept is also fairly even, his clever stunts versus my worldbuilding.</li></ol></div>",
  "content_text": "What’s the lesson? No, not the one about women, the one about SJWs:\nJohn Scalzi ‏@scalzi\nI’m not the Anti-Beale. I’m merely the person who Beale so very desperately wishes he had the career of.\nDeirdre Saoirse Moen ‏@deirdresm\nWhich is why his Alexa rank is < 1000 milliScalzis.\nNotorious E.G.G. ‏@silvermink\nThough, I have to say, his Alexa rank is much closer to that number than my faith in humanity can handle sometimes.\nJohn Scalzi ‏@scalzi\nTrust me, if his Alexa score ever gets above mine, he’ll trumpet it to the heavens.\nDeirdre Saoirse Moen ‏@deirdresm\nIt wasn’t until I looked at the puppy Alexa rankings that I understood why RP was more successful than SP. Sigh.\nNotorious E.G.G. ‏@silvermink\nPeople actually listen to Mr. Beale, mindboggling as I find that.\nJohn Scalzi ‏@scalzi\nYeah, but they’re assholes.\nNotorious E.G.G. ‏@silvermink\nA bit of a saving grace, it’s true.\nJonathan Bergeron\nnow that’s a burn\nJohn Scalzi ‏@scalzi\nIt’s not the Alexa award. It’s that the RPs appealed more to people happy to shit all over other people.\nDeirdre Saoirse Moen ‏@deirdresm\nI figured as much (and said so in response to a comment).\nMarty ‏@hugbug94\nVDBEALE doesn’t have the writing chops to be in your league.\nJohn Scalzi ‏@scalzi\nThanks, although I would not that for commercial success, writing chops are not always required.\nCurrent Alexa Ranks\nScalzi Global: 84,147\nScalzi USA: 18,628\nVP Global: 84,187\nVP USA: 17,599\nNow, Alexa is a ridiculous measure, as it is based on links rather than the more straightforward metric of traffic. At present, VP alone has about 3x Scalzi’s Google pageview traffic, and VP+AG has about 4x the traffic. If history is any guide, we should see the first 2 million-pageview month in August; this month is on course for 1.9 million+ combined.\nBut, as is our wont, let us count the lies:\nI very desperately wish I had John Scalzi’s career.\nI’m a lead game designer, a lead editor, and a minor author. He’s a very successful midlist author who is making some headway in television and failed as a game writer. My blogs surpass his by a factor of four and are nearly double his all-time peak. My Twitter Impression/follower ratio is considerably higher (355 to 125), and despite having only one-fifth the Impressions and one-seventeenth the followers, I expect my Impressions will pass up his within 18 months.\nI will trumpet to the heavens if my Alexa score ever passes his.\nIt did, months ago. I didn’t. That’s VP alone, by the way, VP+AG is far beyond his, as AG alone is around 105k Global.\nPeople who read here are assholes.\nActually, according to the demographics, you’re much wealthier and better-educated than the norm. And considering how lightly I moderate, I think it’s self-evident that most people here are more civil than average as well. You’re certainly less vulgar than Scalzi’s commenters, for the most part. I like you, anyhow. Obviously, he doesn’t.\nRPs appealed more to people happy to shit all over other people.\nConsidering how the SJWs have treated the 2015 nominees, this is certainly false when compared to them. But compared to Sad Puppies, that’s probably true. It’s an unfair and misleading exaggeration, but not a lie.\nVDBEALE doesn’t have the writing chops to be in Scalzi’s league.\nActually, I’d put us both right in the same league. We’re both mediocre, albeit for very different reasons. My Style has no melody, no flare. It is plodding and pedestrian whereas Scalzi’s Style is light and breezy. Scalzi can’t do characters and they all speak in one snarky voice: his own. My characters are diverse and distinct, albeit limited to the upper half of the male spectrum. I think Story comes out fairly equal, although he directly rips off the greats whereas I merely borrow here and there, Concept is also fairly even, his clever stunts versus my worldbuilding.",
  "tags": [
    "McRapey",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-04-26T16:00:00+00:00"
}