{
  "url": "https://voxday.net/2017/02/11/a-failure-to-understand-identity/",
  "scraped_at": "2025-12-18T07:01:20.306306",
  "title": "A failure to understand identity",
  "date_display": "February 11, 2017",
  "date_iso": "2017-02-11T11:47:00+00:00",
  "date_from_url": "2017-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Wright <a href=\"http://www.scifiwright.com/2017/02/on-identity-politics/\">attempts to criticize identity politics</a> and the Alt-Right, and in doing so, demonstrates that he does not correctly grasp what identity is, or how identity politics tend to function in modern multiracial societies:</p><blockquote class=\"tr_bq\"><p> Some say that the success of identity politics trumped up by the Left proves that a man will always side with his inborn tribal group, grievance group, and identity politics group rather than with any political doctrine or party or nation into which education, experience, or personal decision might lead him.</p></blockquote><p>No, literally no one says that. First, identity is not limited to race. Religion, too, is an identity, and one of the most powerful. Second, while men can, and do, surmount their racial, grievance, and religious identities in favor of other identities and ideologies, the salient point is that the vast majority will not. One habitual weakness of John’s arguments I have observed is that he tends to be inclined towards binary thinking, and binary thinkers are particularly prone to the Ricardian Vice, which Joseph Schumpeter described in the <i>History of Economic Analysis</i>:</p><p><i>He then piled one simplifying assumption upon another until, having really settled everything by these assumptions, he was left with only a few aggregative variables between which, given these assumptions, he set up simple one-way relations so that, in the end, the desired results emerged almost as tautologies…. The habit of applying results of this character to the solution of practical problems we shall call the Ricardian Vice.</i><br> <i><br/></i><br> John continues with an drive-by implied defense of the fictional concept of the so-called “proposition nation”.</br></br></p><blockquote class=\"tr_bq\"><p> Nations are never built on a proposition that all men are created equal and never have been: they are only build on tribes and clans. So runs the theory.</p></blockquote><p>No, that is not the theory, that is the literal historical definition of “nation”. The concept is defined as: <i>“an aggregation of persons of the same ethnic family, often speaking the same language or cognate languages.”</i> 1250-1300; Middle English &lt; Latin nātiōn- (stem of nātiō) birth, tribe, equivalent to nāt (us) (past participle of nāscī to be born).</p><p>The “proposition nation” concept <a href=\"https://books.google.com/ngrams/graph?content=proposition+nation&amp;year_start=1700&amp;year_end=2008&amp;corpus=15&amp;smoothing=3&amp;share=&amp;direct_url=\">is entirely false</a>. Neither concurring with any proposition nor contradicting one will cause one to be part of the American nation, or cause one to be separated from it. <a href=\"http://rawlenyanzi.com/problem-proposition-nations/\">It is simply incorrect</a> to claim that the United States is fundamentally built on the principle of equality or any other idea; one <a href=\"http://www.milobookclub.com/2016/08/30/assimilationist-liars/\">need only read</a> the entire Declaration of Independence to know that Jefferson’s flight of rhetoric was nothing more than a rhetorical flourish. “All men are created equal” is not the founding principle of the United States of America nor the basis for any nation.</p><p>The irony, of course, is that one might as just as meaningfully cite the statement as grounds for claiming that anyone can become Chinese or Polish.</p><blockquote><p> Those who believe this say that the way to defeat Leftwing Anti-White identity politics is by adopting Pro-White identity politics. They are seduced into making a simple error. It is an error so simple that even a highly intelligent partisan of that movement might not see it. The identity-grievance politics groups on the Left are all about Leftism and nothing about identity.</p><p>The only people who ever side with their tribal group and identity politics group are people who have been indoctrinated by the Left. They are Leftists. Identity politics is their stock in trade. It is the only product remaining on their intellectually bankrupt shelves.</p></blockquote><p>First, it is true that for some, their Leftism is their dominant identity. Second, it is apparent that a number of identity groups have concluded that Leftism is in their tribal interest, which may be a source of the causal confusion. Third, it is absolutely and observably absurd to claim that the only people who ever side with their tribal group have been indoctrinated by the Left. Tribalism and identity long precede Leftism, moreover, it is very, very easy to provide examples of those on the Right who practice identity politics. Identity consistently provides a much more accurate predictive model for one’s positions and behavior than one’s nominal place on the political spectrum. But again, it must be understood that there are multiple kinds of identities; ethnicity merely tends to be the strongest and most powerful form.</p><blockquote class=\"tr_bq\"><p> Tribalism says that the loyalties one has toward genetically similar groups will eventually overwhelm all other loyalties of religion, culture, language community, political philosophy, and self interest, and that therefore one must abandon loyalty to religion and culture and state but adhere instead to one’s tribe. A more naive reading of history is difficult to imagine: as if civil wars never happened, and nothing but race wars did.</p></blockquote><p>It is strange to see John claim that identity politics and tribalism is a naive reading of history when he is simultaneously denying one of the primary engines of history. Again, he relies on simplistic binary thinking in order to reach a false conclusion. People have multiple loyalties, many of which are not related to their genetic inheritance; the homosexual is loyal to the gay community and hostile to the religious communities for reasons of sexual orientation, the Christian Zionist is loyal to the Jewish community for theological reasons, and so forth. But none of this changes the observable fact that Somalis in Minnesota reliably vote for Somalis, Indians in Quebec reliably vote for Indians, and African-Americans reliably vote for blacks.</p><p>John also fails to understand the Alt-Right. Because he seeks compromise and is willing to let the Left live, he implies the Alt-Right it is of the Left. This is a confusion of etiquette with objectives.</p><blockquote class=\"tr_bq\"><p> The lobbyist of the Right, by way of contrast, is not a religious zealot. He is willing to live and let live, and to compromise when need be. The Right thinks the Left are foolish, but not evil. The Left think the Right are an abomination, literally Hitler, and must be exterminated from the Earth as soon as this is practical.</p></blockquote><p>The Alt-Right thinks the Left is both foolish and evil. The Alt-Right thinks the Left is a collection of rabid, feral, incoherent, irrational barbarians who are observably incapable of participating in any civilized society without destroying it. We’re not religious zealots, we are simply educated observers of the entire history of the Left, from the French Revolution to the Killing Fields of Cambodia, who have reached certain logical conclusions on the basis of those observations.</p><p>The Alt-Right is most certainly not willing to compromise with the Left. We have witnessed the conservative Right live and let live, and compromise, to the point that Western civilization itself is at risk. And we are not willing to allow conservatives to meekly permit the destruction of Western civilization simply so they can go down to noble defeat in the sacred names of equality and not being racist.</p><blockquote class=\"tr_bq\"><p> I note in passing that every time, every single time, the roots of the Democrat Party are mentioned, the Alt-Right goes into a tizzy of sneers and scorn, scoffing that one should never say that Democrats are the real racists. Why one should never say it, they never say.  But it does undermine their whole race-is-politics theory, because the race of the Dems did not change their race before and after Johnson’s ‘Great Society’ programs, but only changed their political tactics. The utility of accusing the Party of Lincoln and Nixon of racism only started then, and so the Democrats only because the advocates of anti-racism then.</p></blockquote><p>This is simply absurd. Again, John is stating something observably false, then using his false statement as the basis of reaching an incorrect conclusion. It’s trivially easy to show that what he’s saying is not true. On this blog, and in Cuckservative, <a href=\"http://www.milobookclub.com/2016/09/03/the-alt-right-is-not-freddy-krueger/\">I have explained</a> why one should not bother saying that Democrats are the real racists: it is ineffective and toothless dialectic that has no effect on a group of rhetorical speakers. I have also pointed out that <a href=\"http://www.milobookclub.com/2017/01/21/attack-but-politely-please/\">it is ineffective rhetoric for the Right</a> because no one but cucks and cons fears being called racist.</p><p>And the race of the Democrats has most certainly changed since LBJ instituted the Great Society. That’s why <a href=\"https://www.theatlantic.com/politics/archive/2016/07/with-diversity-on-the-left-the-white-working-class-moves-right/493286/\">the <i>Atlantic </i>asks</a> if the Democratic Party even has room for what it calls “less-educated white voters” anymore.</p><blockquote class=\"tr_bq\"><p> So in asking the Right to accept pro-White tribalism into its political platform, the advocate of race-based politics is attempting to fight a religion with a lobbyist group. This is the same mistake the mainstream Right has been making for decades, if not centuries.</p></blockquote><p>No, we’re not asking. We are predicting it will happen as a natural result of the USA becoming a multiracial, multicultural, multinational state. And it will be easy to determine who is correct. If the Alt-Right is correct, whites will continue to gravitate right across the West. The likes of Jack Murphy, who voted for Obama, will vote for Trump in 2020. And the Democratic Party will continue to move Left, as the various non-white immigrants fill its ranks being depleted by the exiting whites.</p><p>We’re not making the same mistake the mainstream Right has made; quite the opposite. And it is the fact that we refuse to continue making their mistake of holding to the sacred, nonsensical symbolism that has led to their defeat that makes them uncomfortable.</p><p>Now, all that being said, John is correct to say that federalism is one solution to tribalism. But it is a solution that accepts and utilizes the reality of tribalism and identity politics, not one that rejects them. In any event, <a href=\"http://www.scifiwright.com/2017/02/on-identity-politics/\">read the whole thing there</a>, including the comments.</p><p>I close with a pair of quotes, and leave it to you to decide whether it is identity politics or proposition politics that are more firmly rooted in truth and historical reality:<br> <i><br/></i><i>“In multiracial societies, you don’t vote in accordance with your economic interests, you vote in accordance with race and religion.”</i><br> – Lee Kuan Yew<br> <i><br/></i><br> <i>“America has never been united by blood or birth or soil. We are bound by ideals that move us beyond our backgrounds, lift us above our interests and teach us what it means to be citizens…. Every immigrant, by embracing these ideals, makes our country more, not less, American.”</i><br> – George W. Bush</br></br></br></br></br></p></div>",
  "content_text": "John Wright\nattempts to criticize identity politics\nand the Alt-Right, and in doing so, demonstrates that he does not correctly grasp what identity is, or how identity politics tend to function in modern multiracial societies:\nSome say that the success of identity politics trumped up by the Left proves that a man will always side with his inborn tribal group, grievance group, and identity politics group rather than with any political doctrine or party or nation into which education, experience, or personal decision might lead him.\nNo, literally no one says that. First, identity is not limited to race. Religion, too, is an identity, and one of the most powerful. Second, while men can, and do, surmount their racial, grievance, and religious identities in favor of other identities and ideologies, the salient point is that the vast majority will not. One habitual weakness of John’s arguments I have observed is that he tends to be inclined towards binary thinking, and binary thinkers are particularly prone to the Ricardian Vice, which Joseph Schumpeter described in the\nHistory of Economic Analysis\n:\nHe then piled one simplifying assumption upon another until, having really settled everything by these assumptions, he was left with only a few aggregative variables between which, given these assumptions, he set up simple one-way relations so that, in the end, the desired results emerged almost as tautologies…. The habit of applying results of this character to the solution of practical problems we shall call the Ricardian Vice.\nJohn continues with an drive-by implied defense of the fictional concept of the so-called “proposition nation”.\nNations are never built on a proposition that all men are created equal and never have been: they are only build on tribes and clans. So runs the theory.\nNo, that is not the theory, that is the literal historical definition of “nation”. The concept is defined as:\n“an aggregation of persons of the same ethnic family, often speaking the same language or cognate languages.”\n1250-1300; Middle English < Latin nātiōn- (stem of nātiō) birth, tribe, equivalent to nāt (us) (past participle of nāscī to be born).\nThe “proposition nation” concept\nis entirely false\n. Neither concurring with any proposition nor contradicting one will cause one to be part of the American nation, or cause one to be separated from it.\nIt is simply incorrect\nto claim that the United States is fundamentally built on the principle of equality or any other idea; one\nneed only read\nthe entire Declaration of Independence to know that Jefferson’s flight of rhetoric was nothing more than a rhetorical flourish. “All men are created equal” is not the founding principle of the United States of America nor the basis for any nation.\nThe irony, of course, is that one might as just as meaningfully cite the statement as grounds for claiming that anyone can become Chinese or Polish.\nThose who believe this say that the way to defeat Leftwing Anti-White identity politics is by adopting Pro-White identity politics. They are seduced into making a simple error. It is an error so simple that even a highly intelligent partisan of that movement might not see it. The identity-grievance politics groups on the Left are all about Leftism and nothing about identity.\nThe only people who ever side with their tribal group and identity politics group are people who have been indoctrinated by the Left. They are Leftists. Identity politics is their stock in trade. It is the only product remaining on their intellectually bankrupt shelves.\nFirst, it is true that for some, their Leftism is their dominant identity. Second, it is apparent that a number of identity groups have concluded that Leftism is in their tribal interest, which may be a source of the causal confusion. Third, it is absolutely and observably absurd to claim that the only people who ever side with their tribal group have been indoctrinated by the Left. Tribalism and identity long precede Leftism, moreover, it is very, very easy to provide examples of those on the Right who practice identity politics. Identity consistently provides a much more accurate predictive model for one’s positions and behavior than one’s nominal place on the political spectrum. But again, it must be understood that there are multiple kinds of identities; ethnicity merely tends to be the strongest and most powerful form.\nTribalism says that the loyalties one has toward genetically similar groups will eventually overwhelm all other loyalties of religion, culture, language community, political philosophy, and self interest, and that therefore one must abandon loyalty to religion and culture and state but adhere instead to one’s tribe. A more naive reading of history is difficult to imagine: as if civil wars never happened, and nothing but race wars did.\nIt is strange to see John claim that identity politics and tribalism is a naive reading of history when he is simultaneously denying one of the primary engines of history. Again, he relies on simplistic binary thinking in order to reach a false conclusion. People have multiple loyalties, many of which are not related to their genetic inheritance; the homosexual is loyal to the gay community and hostile to the religious communities for reasons of sexual orientation, the Christian Zionist is loyal to the Jewish community for theological reasons, and so forth. But none of this changes the observable fact that Somalis in Minnesota reliably vote for Somalis, Indians in Quebec reliably vote for Indians, and African-Americans reliably vote for blacks.\nJohn also fails to understand the Alt-Right. Because he seeks compromise and is willing to let the Left live, he implies the Alt-Right it is of the Left. This is a confusion of etiquette with objectives.\nThe lobbyist of the Right, by way of contrast, is not a religious zealot. He is willing to live and let live, and to compromise when need be. The Right thinks the Left are foolish, but not evil. The Left think the Right are an abomination, literally Hitler, and must be exterminated from the Earth as soon as this is practical.\nThe Alt-Right thinks the Left is both foolish and evil. The Alt-Right thinks the Left is a collection of rabid, feral, incoherent, irrational barbarians who are observably incapable of participating in any civilized society without destroying it. We’re not religious zealots, we are simply educated observers of the entire history of the Left, from the French Revolution to the Killing Fields of Cambodia, who have reached certain logical conclusions on the basis of those observations.\nThe Alt-Right is most certainly not willing to compromise with the Left. We have witnessed the conservative Right live and let live, and compromise, to the point that Western civilization itself is at risk. And we are not willing to allow conservatives to meekly permit the destruction of Western civilization simply so they can go down to noble defeat in the sacred names of equality and not being racist.\nI note in passing that every time, every single time, the roots of the Democrat Party are mentioned, the Alt-Right goes into a tizzy of sneers and scorn, scoffing that one should never say that Democrats are the real racists. Why one should never say it, they never say.  But it does undermine their whole race-is-politics theory, because the race of the Dems did not change their race before and after Johnson’s ‘Great Society’ programs, but only changed their political tactics. The utility of accusing the Party of Lincoln and Nixon of racism only started then, and so the Democrats only because the advocates of anti-racism then.\nThis is simply absurd. Again, John is stating something observably false, then using his false statement as the basis of reaching an incorrect conclusion. It’s trivially easy to show that what he’s saying is not true. On this blog, and in Cuckservative,\nI have explained\nwhy one should not bother saying that Democrats are the real racists: it is ineffective and toothless dialectic that has no effect on a group of rhetorical speakers. I have also pointed out that\nit is ineffective rhetoric for the Right\nbecause no one but cucks and cons fears being called racist.\nAnd the race of the Democrats has most certainly changed since LBJ instituted the Great Society. That’s why\nthe\nAtlantic\nasks\nif the Democratic Party even has room for what it calls “less-educated white voters” anymore.\nSo in asking the Right to accept pro-White tribalism into its political platform, the advocate of race-based politics is attempting to fight a religion with a lobbyist group. This is the same mistake the mainstream Right has been making for decades, if not centuries.\nNo, we’re not asking. We are predicting it will happen as a natural result of the USA becoming a multiracial, multicultural, multinational state. And it will be easy to determine who is correct. If the Alt-Right is correct, whites will continue to gravitate right across the West. The likes of Jack Murphy, who voted for Obama, will vote for Trump in 2020. And the Democratic Party will continue to move Left, as the various non-white immigrants fill its ranks being depleted by the exiting whites.\nWe’re not making the same mistake the mainstream Right has made; quite the opposite. And it is the fact that we refuse to continue making their mistake of holding to the sacred, nonsensical symbolism that has led to their defeat that makes them uncomfortable.\nNow, all that being said, John is correct to say that federalism is one solution to tribalism. But it is a solution that accepts and utilizes the reality of tribalism and identity politics, not one that rejects them. In any event,\nread the whole thing there\n, including the comments.\nI close with a pair of quotes, and leave it to you to decide whether it is identity politics or proposition politics that are more firmly rooted in truth and historical reality:\n“In multiracial societies, you don’t vote in accordance with your economic interests, you vote in accordance with race and religion.”\n– Lee Kuan Yew\n“America has never been united by blood or birth or soil. We are bound by ideals that move us beyond our backgrounds, lift us above our interests and teach us what it means to be citizens…. Every immigrant, by embracing these ideals, makes our country more, not less, American.”\n– George W. Bush",
  "tags": [
    "#AltRight",
    "debate",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-11T11:47:00+00:00"
}