{
  "url": "https://voxday.net/2017/02/23/a-sympathetic-ca/",
  "scraped_at": "2025-12-18T07:03:14.604569",
  "title": "A sympathetic call",
  "date_display": "February 23, 2017",
  "date_iso": "2017-02-23T13:35:00+00:00",
  "date_from_url": "2017-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: left;\"> Unsurprisingly, <a href=\"https://www.youtube.com/watch?v=2wsZSE-iJAk\">Stefan Molyneux has one of the more intelligent and sympathetic takes</a> on the Milo takedown, and while I don’t concur with all of his conclusions, I note that he draws attention to an important element that most people, myself included, may have missed. I think Stefan is probably right to see this as the most significant aspect of the whole situation, and that Milo has the opportunity to transform what has been a terrible time for him into his finest moment if he is willing and able to do what so many before him have not, and name the names of those who have been, and probably still are, preying on young men and boys today.<p>It’s a very powerful observation: <i>“You can still protect the children of the future from the predators of the past.”</i></p><div style=\"text-align: center;\"> <iframe allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/2wsZSE-iJAk\" width=\"512\"></iframe></div><p> That being said, there is a reason that so many who have been witness to such ugliness, from Elijah Wood to Corey Feldman and Allison Arngrim, have not been specific, and are reluctant to identify the responsible parties. What that reason may be, I don’t know, but I think it would be absolutely wrong for those of us who have not been victimized to demand that Milo do what those others could not. What we can and should do, however, is to continue to offer our unconditional support for him, and encourage him to listen to his conscience and to speak the truth without fear, whatever it might be.</p><p>I would be remiss if I did not mention that another survivor of child abuse, Moira Greyland, the daughter of confirmed child molesters Walter Breen and Marion Zimmer Bradley, was one of many Castalia authors who emailed me to offer her support for Milo.</p><p><i>I know you’re busy. Can you let Milo know I am pulling for him and so are a crowd of other writers over here?</i><br> <i><br/></i>She also <a href=\"http://superversivesf.com/2017/02/21/moira-offers-unique-insight-milos-words/\">wrote a piece that can be read here</a>. As adults, we are, in part, the consequences of the childhood experiences that shaped us. We all bear the psychological scars, and not infrequently from experiences we thought were positive at the time. Think of the narcissistic attention-seeker who has never recovered from being the pretty girl in 7th grade, or the glory-days jock who simply can’t move past the game in which he scored four touchdowns, for example. But some of us <a href=\"http://wmbriggs.com/post/21111/\">were shaped in more difficult and dangerous molds</a> than others.</br></p><blockquote><p> When I grew up there were five little boys that I knew—all from different family circumstances, all of them, bright and smart and fun. One of them was my first official crush, and I must have been all of five years old, and so was he. There was a snow pile in the schoolyard, and we were king and queen of the mountain. The others I knew, too, and I even “dated” two of them, even though date is a chaste word. Once it was ice-skating and once it was a movie. We were always friends, but dating wasn’t in the cards, for what is now obvious reasons. But then it wasn’t obvious.</p><p>I learned later that when these little boys were little, they were visited upon by a friend, an older male, someone perhaps who was attracted to their brightness and wit.</p><p>They were funny boys. They knew what the convention was, and they tried to form attachments to girls. But they weren’t able to overcome what had happened. They felt that their lot in life was settled, that the map to their destiny was drawn by someone else, without their having a say in the matter.</p><p>Four of those little boys are now dead. Three died very young, one older but still young. One a suicide, and the others in situations that were brought on or complicated by The Disease. None of them married. None of them had children. They left their mothers behind, questioning, grieving, inconsolable, loving. Think of it: five families were prevented from being formed.</p></blockquote><p>This is precisely why I reject the notion that homosexuality is to be celebrated any more than drug addiction or smoking is. Some of you may recall that my band, Psykosonik, was signed to Wax Trax! Records. What you may not know is that the men who signed us to their label, Jim and Dannie, were both gay. Jim died at 47, less than three years after signing us. Dannie died in 2010, at the age of 58.</p></div></div>",
  "content_text": "Unsurprisingly,\nStefan Molyneux has one of the more intelligent and sympathetic takes\non the Milo takedown, and while I don’t concur with all of his conclusions, I note that he draws attention to an important element that most people, myself included, may have missed. I think Stefan is probably right to see this as the most significant aspect of the whole situation, and that Milo has the opportunity to transform what has been a terrible time for him into his finest moment if he is willing and able to do what so many before him have not, and name the names of those who have been, and probably still are, preying on young men and boys today.\nIt’s a very powerful observation:\n“You can still protect the children of the future from the predators of the past.”\nThat being said, there is a reason that so many who have been witness to such ugliness, from Elijah Wood to Corey Feldman and Allison Arngrim, have not been specific, and are reluctant to identify the responsible parties. What that reason may be, I don’t know, but I think it would be absolutely wrong for those of us who have not been victimized to demand that Milo do what those others could not. What we can and should do, however, is to continue to offer our unconditional support for him, and encourage him to listen to his conscience and to speak the truth without fear, whatever it might be.\nI would be remiss if I did not mention that another survivor of child abuse, Moira Greyland, the daughter of confirmed child molesters Walter Breen and Marion Zimmer Bradley, was one of many Castalia authors who emailed me to offer her support for Milo.\nI know you’re busy. Can you let Milo know I am pulling for him and so are a crowd of other writers over here?\nShe also\nwrote a piece that can be read here\n. As adults, we are, in part, the consequences of the childhood experiences that shaped us. We all bear the psychological scars, and not infrequently from experiences we thought were positive at the time. Think of the narcissistic attention-seeker who has never recovered from being the pretty girl in 7th grade, or the glory-days jock who simply can’t move past the game in which he scored four touchdowns, for example. But some of us\nwere shaped in more difficult and dangerous molds\nthan others.\nWhen I grew up there were five little boys that I knew—all from different family circumstances, all of them, bright and smart and fun. One of them was my first official crush, and I must have been all of five years old, and so was he. There was a snow pile in the schoolyard, and we were king and queen of the mountain. The others I knew, too, and I even “dated” two of them, even though date is a chaste word. Once it was ice-skating and once it was a movie. We were always friends, but dating wasn’t in the cards, for what is now obvious reasons. But then it wasn’t obvious.\nI learned later that when these little boys were little, they were visited upon by a friend, an older male, someone perhaps who was attracted to their brightness and wit.\nThey were funny boys. They knew what the convention was, and they tried to form attachments to girls. But they weren’t able to overcome what had happened. They felt that their lot in life was settled, that the map to their destiny was drawn by someone else, without their having a say in the matter.\nFour of those little boys are now dead. Three died very young, one older but still young. One a suicide, and the others in situations that were brought on or complicated by The Disease. None of them married. None of them had children. They left their mothers behind, questioning, grieving, inconsolable, loving. Think of it: five families were prevented from being formed.\nThis is precisely why I reject the notion that homosexuality is to be celebrated any more than drug addiction or smoking is. Some of you may recall that my band, Psykosonik, was signed to Wax Trax! Records. What you may not know is that the men who signed us to their label, Jim and Dannie, were both gay. Jim died at 47, less than three years after signing us. Dannie died in 2010, at the age of 58.",
  "tags": [
    "conspiracy",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-23T13:35:00+00:00"
}