{
  "url": "https://voxday.net/2017/02/25/alt-right-16-bodova/",
  "scraped_at": "2025-12-18T07:03:28.133889",
  "title": "Alt-Right: 16 točaka",
  "date_display": "February 25, 2017",
  "date_iso": "2017-02-25T10:30:00+00:00",
  "date_from_url": "2017-02-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>S ciljem razvoja središnje filozofije Alt Desnice kao temelja na kojem se pravac može dalje razvijati.</p><p>1. Alt Desnica je desničarski politički pravac u istom smislu kako se desnica poima u Americi i Europi. Socijalisti nisu Alt Desnica. Progresivci nisu Alt Desnica. Liberali nisu Alt Desnica. Komunisti, marksisti, kulturalni marksisti, i neokonzervativci nisu Alt Desnica.<br> 2. Alt Desnica je ALTERNATIVA konzervativističkom pokretu srednje struje u SAD-u koji je nominalno definiran kroz 10 konzervativnih principa Russela Kirka, ali je u stvarnosti degenerirao u progresivizam. Alt Desnica je alternativa libertarijanizmu.<br> 3. Alt Desnica nije obrambeni stav te odbacuje koncept plemenitog i principijalnog poraza. Ona je ofenzivna filozofija u svakom smislu tog pojma. Alt Desnica vjeruje u pobjedu kroz ustrajnost i upornost te djelovanjem u skladu sa znanošću, stvarnošću, kulturnom tradicijom i lekcijama povijesti.<br> 4. Alt Desnica vjeruje da je zapadna civilizacija vrhunac ljudskog postignuća te podržava njena tri temeljna stupa: Kršćanstvo, europske narode te grčko-rimsku ostavštinu.<br> 5. Alt Desnica otvoreno zagovara nacionalizam. Podupire sve nacionalizme te pravo svih nacija da postoje kao homogene, neiskvarene stranim invazijama i imigracijama.<br> 6. Alt Desnica je protiv globalizma. Suprostavlja se svim grupama koje se zalažu za globalističke ideale i ciljeve.<br> 7. Alt Desnica je protiv ideologije jednakosti. Odbacuje ideju jednakosti iz istog razloga zbog kojeg odbacuje ideje o jednorozima i vilenjacima. Jednakost ljudi ne može se poduprijeti niti jednom znanstvenom činjenicom, a ona ne postoji niti u pravnom, materijalnom, intelektualnom, seksualnom, ili duhovnom smislu.<br> 8. Alt Desnica je scijentodična. Prihvaća trenutne zaključke znanstvene metode (scijentodije), ali shvaća da: a) ti zaključci podlažu budućim revizijama, b) znanstvena profesija je sklona korupciji, c) takozvani znanstveni konsenzus nije temeljen na scijentodiji, već demokraciji, te je kao takav intrinzično neznanstven.<br> 9. Alt Desnica vjeruje da je identitet &gt; kultura &gt; politika. <br> 10. Alt Desnica se protivi vladanju ili dominaciji bilo koje etničke grupe nad drugom, naročito unutar suverenih država naroda koji su podčinjeni. Alt Desnica se protivi tome da bilo koja etnička grupa koja nije domaća ostvari prekomjeran utjecaj u bilo kojem društvu kroz nepotizam, tribalizam, ili pomoću bilo kojih drugih sredstava.<br> 11. Alt Desnica shvaća jednadžbu: različitost + neposredna blizina = rat.<br> 12. Alt Desnicu nije briga što mislite o njoj.<br> 13. Alt Desnica odbacuje međunarodnu slobodnu trgovinu i slobodno kretanje ljudi koje slobodna trgovina podrazumijeva. Prednost slobodne trgovine unutar jednog naroda nije dokaz za prednosti međunarodne slobodne trgovine.<br> 14. Alt Desnica vjeruje da moramo osigurati postojanje bijelaca te da moramo osigurati budućnost za bijelačku djecu.<br> 15. Alt Desnica ne vjeruje u generalnu nadmoć bilo koje rase, nacije, naroda ili ljudske podvrste. Svaka rasa, nacija, narod te ljudske podvrste imaju vlastite jedinstvene jakosti i slabosti, te posjeduju suvereno pravo da žive bez da ih se maltretira unutar vlastitih kultura.<br> 16. Alt Desnica je filozofija koja vrednuje mir između raznih svjetskih nacija i suprostavlja se ratovima koji služe za nametanje vrijednosti jedne nacije prema drugoj, te se suprostavlja svim pokušajima da se pojedine nacije istrijebi kroz rat, genocid, imigraciju ili genetsku asimilaciju.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>TL;DR: Alt Desnica je zapadna ideologija koja vjeruje u znanost, povijest, stvarnost i pravo svake nacije na život i vladanje prema vlastitim interesima.</p></div>",
  "content_text": "S ciljem razvoja središnje filozofije Alt Desnice kao temelja na kojem se pravac može dalje razvijati.\n1. Alt Desnica je desničarski politički pravac u istom smislu kako se desnica poima u Americi i Europi. Socijalisti nisu Alt Desnica. Progresivci nisu Alt Desnica. Liberali nisu Alt Desnica. Komunisti, marksisti, kulturalni marksisti, i neokonzervativci nisu Alt Desnica.\n2. Alt Desnica je ALTERNATIVA konzervativističkom pokretu srednje struje u SAD-u koji je nominalno definiran kroz 10 konzervativnih principa Russela Kirka, ali je u stvarnosti degenerirao u progresivizam. Alt Desnica je alternativa libertarijanizmu.\n3. Alt Desnica nije obrambeni stav te odbacuje koncept plemenitog i principijalnog poraza. Ona je ofenzivna filozofija u svakom smislu tog pojma. Alt Desnica vjeruje u pobjedu kroz ustrajnost i upornost te djelovanjem u skladu sa znanošću, stvarnošću, kulturnom tradicijom i lekcijama povijesti.\n4. Alt Desnica vjeruje da je zapadna civilizacija vrhunac ljudskog postignuća te podržava njena tri temeljna stupa: Kršćanstvo, europske narode te grčko-rimsku ostavštinu.\n5. Alt Desnica otvoreno zagovara nacionalizam. Podupire sve nacionalizme te pravo svih nacija da postoje kao homogene, neiskvarene stranim invazijama i imigracijama.\n6. Alt Desnica je protiv globalizma. Suprostavlja se svim grupama koje se zalažu za globalističke ideale i ciljeve.\n7. Alt Desnica je protiv ideologije jednakosti. Odbacuje ideju jednakosti iz istog razloga zbog kojeg odbacuje ideje o jednorozima i vilenjacima. Jednakost ljudi ne može se poduprijeti niti jednom znanstvenom činjenicom, a ona ne postoji niti u pravnom, materijalnom, intelektualnom, seksualnom, ili duhovnom smislu.\n8. Alt Desnica je scijentodična. Prihvaća trenutne zaključke znanstvene metode (scijentodije), ali shvaća da: a) ti zaključci podlažu budućim revizijama, b) znanstvena profesija je sklona korupciji, c) takozvani znanstveni konsenzus nije temeljen na scijentodiji, već demokraciji, te je kao takav intrinzično neznanstven.\n9. Alt Desnica vjeruje da je identitet > kultura > politika.\n10. Alt Desnica se protivi vladanju ili dominaciji bilo koje etničke grupe nad drugom, naročito unutar suverenih država naroda koji su podčinjeni. Alt Desnica se protivi tome da bilo koja etnička grupa koja nije domaća ostvari prekomjeran utjecaj u bilo kojem društvu kroz nepotizam, tribalizam, ili pomoću bilo kojih drugih sredstava.\n11. Alt Desnica shvaća jednadžbu: različitost + neposredna blizina = rat.\n12. Alt Desnicu nije briga što mislite o njoj.\n13. Alt Desnica odbacuje međunarodnu slobodnu trgovinu i slobodno kretanje ljudi koje slobodna trgovina podrazumijeva. Prednost slobodne trgovine unutar jednog naroda nije dokaz za prednosti međunarodne slobodne trgovine.\n14. Alt Desnica vjeruje da moramo osigurati postojanje bijelaca te da moramo osigurati budućnost za bijelačku djecu.\n15. Alt Desnica ne vjeruje u generalnu nadmoć bilo koje rase, nacije, naroda ili ljudske podvrste. Svaka rasa, nacija, narod te ljudske podvrste imaju vlastite jedinstvene jakosti i slabosti, te posjeduju suvereno pravo da žive bez da ih se maltretira unutar vlastitih kultura.\n16. Alt Desnica je filozofija koja vrednuje mir između raznih svjetskih nacija i suprostavlja se ratovima koji služe za nametanje vrijednosti jedne nacije prema drugoj, te se suprostavlja svim pokušajima da se pojedine nacije istrijebi kroz rat, genocid, imigraciju ili genetsku asimilaciju.\nTL;DR: Alt Desnica je zapadna ideologija koja vjeruje u znanost, povijest, stvarnost i pravo svake nacije na život i vladanje prema vlastitim interesima.",
  "tags": [
    "#AltRight"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-25T10:30:00+00:00"
}