{
  "url": "https://voxday.net/2017/02/04/attacked-at-berkeley/",
  "scraped_at": "2025-12-18T07:00:13.633467",
  "title": "Attacked at Berkeley",
  "date_display": "February 4, 2017",
  "date_iso": "2017-02-04T12:23:00+00:00",
  "date_from_url": "2017-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Stefan Molyneux <a href=\"https://www.youtube.com/watch?v=CIFYTYNl7ng\">interviews Katrina</a>, the blonde woman who was on video being assaulted by the SJW thugs rioting at UC-Berkeley. She was pepper-sprayed and concussed; her husband was beaten unconscious and several of his ribs were broken.<br/></p><div style=\"text-align: center;\"></div><div style=\"text-align: center;\"> <iframe allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/CIFYTYNl7ng\" width=\"512\"></iframe></div><p>Watch the video. Notice how they attack. They’re very skirmish-oriented, very hit-and-run. Effective, limited-force counters are going to require interfering with their ability to do so. Canes and staffs taking them down to the ground by application to the legs would likely be most effective for the untrained; sweeps and strikes to the knee would be the right tactic for the trained. Take them down, then have your allies drag them back away from their companions and zip-tie them.</p><p>It’s clear that they are inclined to use pepper spray, but those trying to pepper-spray can be taken out very easily, as when they extend their arm, they are vulnerable to either a) being taken down with a rotation, b) having their arm broken, or, if they’re small enough, c) thrown behind. The key is to be aware and ready for it; as soon as the arm comes out, grab with the opposite hand and pull <i>hard</i>.</p><p>Notice that Katrina and her husband thought they were prepared; they both were wearing kevlar vests. But defensive measures are not enough; one has to be prepared to neutralize the attackers when they attack. Always wear a belt, as it’s easy to loop it over an attacker’s neck, particularly one attacking someone else, and incapacitate them with it. In extremis, it can also be used in combination with a set of keys, or a pocket knife with a loop, as a flail.</p><p>Notice that both the pepper-spray attackers were women. These are not fearsome streetfighters, they are relying on getting in and out without being touched.</p><p>But most importantly, <i>stop relying on the police and the media!</i> They are not going to defend you, they are not going to take your side, and they are not going to give you a fair shake.</p><p>It occurs to me that as they rely upon anonymity, an Antifa List should be added to the SJW List so that everyone knows exactly who these people are.</p></div>",
  "content_text": "Stefan Molyneux\ninterviews Katrina\n, the blonde woman who was on video being assaulted by the SJW thugs rioting at UC-Berkeley. She was pepper-sprayed and concussed; her husband was beaten unconscious and several of his ribs were broken.\nWatch the video. Notice how they attack. They’re very skirmish-oriented, very hit-and-run. Effective, limited-force counters are going to require interfering with their ability to do so. Canes and staffs taking them down to the ground by application to the legs would likely be most effective for the untrained; sweeps and strikes to the knee would be the right tactic for the trained. Take them down, then have your allies drag them back away from their companions and zip-tie them.\nIt’s clear that they are inclined to use pepper spray, but those trying to pepper-spray can be taken out very easily, as when they extend their arm, they are vulnerable to either a) being taken down with a rotation, b) having their arm broken, or, if they’re small enough, c) thrown behind. The key is to be aware and ready for it; as soon as the arm comes out, grab with the opposite hand and pull\nhard\n.\nNotice that Katrina and her husband thought they were prepared; they both were wearing kevlar vests. But defensive measures are not enough; one has to be prepared to neutralize the attackers when they attack. Always wear a belt, as it’s easy to loop it over an attacker’s neck, particularly one attacking someone else, and incapacitate them with it. In extremis, it can also be used in combination with a set of keys, or a pocket knife with a loop, as a flail.\nNotice that both the pepper-spray attackers were women. These are not fearsome streetfighters, they are relying on getting in and out without being touched.\nBut most importantly,\nstop relying on the police and the media!\nThey are not going to defend you, they are not going to take your side, and they are not going to give you a fair shake.\nIt occurs to me that as they rely upon anonymity, an Antifa List should be added to the SJW List so that everyone knows exactly who these people are.",
  "tags": [
    "SJW",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-04T12:23:00+00:00"
}