{
  "url": "https://voxday.net/2017/02/24/bannon-priebus-interview-at-cpac/",
  "scraped_at": "2025-12-18T07:03:21.162238",
  "title": "Bannon-Priebus interview at CPAC",
  "date_display": "February 24, 2017",
  "date_iso": "2017-02-24T13:00:00+00:00",
  "date_from_url": "2017-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Interview of Steve Bannon and Reince Priebus by American Conservative Union President Matt Schlapp</p><p>SCHLAPP: On that front — on that front, I also think it’s a perfect moment to thank all of you for helping us elect what will be one of the greatest presidents that ever served this country. It’s because of your work…<br> (APPLAUSE)<br> … that he made it happen.<br> BANNON: And Matt, I want to thank you for finally inviting me to CPAC.<br> (LAUGHTER)<br> SCHLAPP: Yeah, there’s no — the — what was the name of the — the…<br> BANNON: The uninvited.<br> SCHLAPP: The uninvited.<br> BANNON: I know there are many alumni out here in the audience.<br> PRIEBUS: I didn’t like the uninvited.<br> SCHLAPP: Here’s what we decided to do at CPAC with the uninvited. We decided to say that everybody’s a part of our conservative family.<br> PRIEBUS: That’s right.<br> SCHLAPP: And that’s what Donald Trump has done to so many of us around the country politically. And you guys have put together an amazing operation. You know, I know you all know this, but the last time a president came to CPAC in his first year, it was Ronald Reagan.<br> (APPLAUSE) St. Ronald in 1981. And you’ve put together this — the president has put together the most conservative Cabinet we’ve ever seen according to our CPAC ratings and I think a few of us are pretty happy about what looks like is going to happen on the Supreme Court too, so it’s a…<br> (APPLAUSE)<br> Now, let me ask you two. I’m looking in the back of the room as well, but let me ask you two.<br> PRIEBUS: Is that the opposition party?<br> (LAUGHTER)<br> <a name=\"more\"></a><br> SCHLAPP: Let me ask you two, we read a lot about you two.<br> BANNON: It’s all good.<br> SCHLAPP: But I bet not all of it’s accurate — I bet not all of it’s accurate. I bet there’s some things that don’t get written correctly. Let me ask each one of you, what’s the biggest misconception about what’s going on in the Donald Trump White House?<br> PRIEBUS: Well, in regard to us two, I think the biggest misconception is everything that you’re reading.<br> (LAUGHTER)<br> We — we share an office suite together. We’re basically together from 6:30 in the morning until about 11:00 at night.<br> BANNON: I have a little thing called the war room, he has a fireplace with nice sofas.<br> PRIEBUS: And it’s — it’s actually something that you all have helped build which is, when you bring together — and what this election showed and what President Trump showed, and let’s not kid ourselves, I mean I can talk about data and ground game and Steve can talk about big ideas, but the truth of the matter is Donald Trump — President Trump brought together the party and the conservative movement.<br> And I’ve got to tell you, if the party and the conservative movement are together, similar to Steve and I, it can’t be stopped. And President Trump…<br> (APPLAUSE)<br> … was the one guy — he was the one person and I can say it after overseeing 16 people kill each other, it was Donald Trump that was able to bring this — this party and this movement together. And Steve and I know that and we live it every day. Our job is to get the agenda of President Trump through the door and on pen and paper.<br> BANNON: You know, but we’ve known it since August 15th and I think if you look at the opposition party and how they portray the campaign, how they portrayed the transition and now they’re portraying the administration, it’s always wrong. I mean, on — on the very first day that Kellyanne and I started, we reached out to Reince, Sean Spicer, Katie.<br> It’s the same team that, you know, every day was grinding away on the campaign, the same team that did the transition and if you remember, you know, the campaign was the most chaotic — by the media’s description, most chaotic, most disorganized, most unprofessional, had no earthly idea what they were doing and then you saw them all crying and weeping that night on — on the 8th when…<br> (APPLAUSE)<br> … when — and the reason it worked — the reason it worked is President Trump. I mean, Trump had those ideas, had that energy, had that vision that could galvanize a team around him of disparate — look, we’re a coalition. You know, a lot of people think — have strong beliefs about different things, but we understand that you can come together to win and we understood that from August 15th and — and we never had a doubt and Donald Trump never had a doubt that he was going to win.<br> BANNON: And — and I think that that is the power of this movement.<br> PRIEBUS: And — and on top of that — first of all, President Trump laid out his vision — what was it? — four or five years ago here at CPAC.<br> SCHLAPP: That’s right.<br> PRIEBUS: And it was that vision — it’s nothing different. If you go back and watch the tape of President Trump four or five years ago, that was the Trump agenda.<br> One of the things that I used to say all the time — and Governor Walker and everyone gets sick of me saying it, but I think that President Trump found it — which is what this country, what all of us, were starving for the whole time because we’re so sick of politics and politicians.<br> In spite of the fact that we love being here, we — we actually hate politics. But what we were starving for was somebody real, somebody genuine, somebody that was actually who he said he was.<br> (APPLAUSE)<br> BANNON: Yep — yep.<br> PRIEBUS: And the — the — the media attacked us on the campaign; remember, attacked me, you can’t spend the money on Trump, go give it to the Senate. Attacked us on the transition, we — President Trump put in the best Cabinet in the history of Cabinets I think.<br> Now — feed ridiculous stories and all we do every day and all President Trump does every day, is hit his agenda every single day, whether it’s TPP, whether it’s deregulation, whether it’s Neil Gorsuch, whatever it is, his promise is coming through every day.<br> SCHLAPP: He’s even — he’s even leaving bathrooms alone, that’s kind of a nice, refreshing thing for a lot of people as well.<br> (APPLAUSE)<br> BANNON: They happen to think it’s a state issue.<br> SCHLAPP: Of course. BANNON: But — but — I think — let’s go back to the point that Reince made for a second. President Trump, when he was running, he made a — and this is the other thing that the — the mainstream media or opposition party never caught is that if you want to see the Trump agenda it’s very simple.<br> It was all in the speeches. He went around to these rallies, but those speeches had a tremendous amount of content in them, right? I happen to believe, and I think many others do, he’s probably the great public speaker in those large arenas since William Jennings Bryan. This was galvanized.<br> And remember, we didn’t have money. Hillary Clinton and these guys had over $2 billion. We had a couple hundred million dollars. It was those rallies and those speeches, all he’s doing right now is, he’s laid out an agenda with those speeches for the promises he made. And our job every day is just to execute on that. It’s to simply get a path to how those get executed.<br> And he’s maniacally focused on that, and I think that’s one of the powers of the transition where many, many people try to come in and try to convince President Trump, hey, you won on this but this is what you want to do.<br> And he’s like, no, I promised the American people this, and this is the plan we’re going to execute on. And Reince said — and by the way that’s what you’ve seen; the executive orders, what the Supreme Court — the way he’s gone through the Supreme Court. And by the way the other 102 judges that we’re eventually going to pick, it’s just a methodical — and that’s what the mainstream media won’t report.<br> Just like they were dead wrong on the chaos of the campaign and just like they were dead wrong in the chaos of the transition, they are absolutely dead wrong about what’s going on today because we have a team that’s just grinding it through on President Donald Trump promised the American people. And the mainstream media better understand something, all of those promises are going to be implemented.<br> SCHLAPP: That’s awesome. It’s been a…<br> (APPLAUSE)<br> You know, Steve you’re a really likable guy. You should do this more often.<br> PRIEBUS: He’s not so bad.<br> SCHLAPP: He’s not so bad.<br> PRIEBUS: Most of the time.<br> BANNON: Yes, exactly.<br> SCHLAPP: So, what are 30 days of action, and you guys have touched on some of that action. Each one of you, tell me the one or two things that have happened the last 30 days that you think are the most critical. And what is the one thing that you just — like you said Steve — maniacally focused, that has just got to happen early in the administration to really turn this country around? Start first with the first 30 days and then what’s that focus after that.<br> PRIEBUS: So, I mean, there’s a lot that — that’s happened…<br> SCHLAPP: A lot.<br> PRIEBUS: … in the — in the first 30 days. Whether, you know — and you look at the our — the world — our world order and — and some of the things that are going on that I think are — will be dealt with soon, but the first thing I think is Neil Gorsuch, for a couple things.<br> Number one, we’re not talking about a change over a four year period. We’re talking about a change of potentially 40 years of law, number one. But more important than that — more important to that, it established trust. It established that President Trump is a man of his word. We always knew that. But when he said here’s 20 names on a piece of paper back in July, remember and he said I’m going to pick my judge out of these 20 people that are on this piece of paper and he did it, that’s number one.<br> PRIEBUS: Because Neil Gorsuch represents a conservative — represents the type of judge that has the vision of Donald Trump and it fulfills the promise that he made to all of you and to all Americans across the country. Second thing, deregulation, what hasn’t been talked about a lot is that President Trump signed an order that puts in place a constant deregulatory form within the federal government. And what it says is, for every regulation presented for passage that Cabinet secretary has to identify two that person would eliminate. And that’s a big deal.<br/> (APPLAUSE)<br/> And then lastly, immigration;, protecting the sovereignty of the United States, putting a wall on the southern border, making sure that criminals are not part of our process. These are all things that 80 percent of Americans agree with and these are all things that President Trump is doing within 30 days.<br/> SCHLAPP: Steve?<br/> (APPLAUSE)<br/> BANNON: I think the — I think the same thing; I think if you look at the lines of work, I kind of break it up into three verticals of three buckets. The first is kind of national security and sovereignty and that’s your intelligence, the Defense Department, Homeland Security.<br/> The second line of work is what I refer to as economic nationalism and that is Wilbur Ross at Commerce, Steven Mnuchin at Treasury, Lighthizer at — at Trade, Peter Navarro, Stephen Miller, these people that are rethinking how we’re gonna reconstruct the — our trade arrangements around the world.<br/> The third, broadly, line of work is what is deconstruction of the administrative state. And if you…<br/> (APPLAUSE)<br/> So I think — I think the three most important things, I think one of the most pivotal moments in modern American history was his immediate withdraw from TPP. That got us out of a…<br/> (APPLAUSE)<br/> … got us out of a trade deal and let our sovereignty come back to ourselves, the people, the mainstream media don’t get this, but we’re already working in consultation with the Hill. People are starting to think through a whole raft of amazing and innovative, bilateral relationships — bilateral trading relationships with people that will reposition America in the world as a — as a fair trading nation and start to bring jobs. High value added, manufacturing jobs, back to the United States of America.<br/> On the — on the national security part, it was certainly the first — I think the first two E.O.s that you start to see implemented here of the last couple of days under General Kelly. And that is, do rule of law is going to exist when you talk about our sovereignty and you talk about immigration. General Kelly…<br/> (APPLAUSE)<br/> … and Attorney General Sessions are adamant — you know, that and you’re gonna start to see I think with the defense budget we’re going to talk about next week when we bring the budget out and also with certain things about the plan on ISIS and what General Mattis and these guys think I think you’ll start to see the other part of that.<br/> But the third, this regulation…<br/> SCHLAPP: Yeah.<br/> BANNON: … every business leader we’ve had in is saying not just taxes, but it is — it is also the regulation. I think the consistent, if you look at these Cabinet appointees, they were selected for a reason and that is the deconstruction, the way the progressive left runs, is if they can’t get it passed, they’re just gonna put in some sort of regulation in — in an agency.<br/> That’s all gonna be deconstructed and I think that that’s why this regulatory thing is so important.<br/> SCHLAPP: We had Dr. Larry Arnn (ph) on the…<br/> (APPLAUSE)<br/> … stage earlier today. And he brought up the fact that we’re promulgating more laws and regulations that we ever had before. And most of that are from these independent agencies that are just on autopilot. You guys can stop that.<br/> And also, coming from the federal bunch as conservatives, we know that a lot of times we fight out the political wars over issues we care about and then all of a sudden, liberals on the bench like a lightening bolt out of the sky just change things.<br/> And so what you guys are saying about changing that order is amazing. You know, we all — we all consume a lot of news; we watch and read a lot of things, there’s been a great democratization in news. People get their news now from literally hundreds and thousands of sites.<br/> What — what would each of you say, what is the — there’s all these polls that are being put out again, is Donald Trump doing a good job, is Donald Trump doing a bad job. I know what you all think. We’ve been hearing it all — all day.<br/> What is it that they keep getting wrong and do you think it ever gets fixed? What does the media keep getting wrong about this Trump phenomena and what’s happening out there in the country? And is there any hope that this changes?<br/> PRIEBUS: I think there’s hope that it’s going to change. I mean we — we sit here, every day and — and the president pumps out all of this work and — and the executive orders and the punching through of the promises that he made to the American people.<br/> So we’re hoping that the media would catch up eventually. But we’re so conditioned to it, I’m personally so conditioned to hearing about why President Trump isn’t going to win the election. Why one — why a controversy in the primaries going to take down President Trump.<br/> I lived through it, as chairman of the party. And — and it really hit me because it was maybe the summer of 2015 and you remember, the media was constantly pounding President Trump. And the polling kept getting better and better and better, for President Trump.<br/> But it was when I went home and got out of this town. And I went back to Kenosha and I talked to my neighbor and I said, “Bob, what do you think?” And he goes, “Man, I really love that Trump.”<br/> (LAUGHTER)<br/> PRIEBUS: And I said, “Sandy — Sandy, what do you think?” She says, “We’re for Trump.”<br/> And it was, as you all lived through it too, because you all had different people you were for, but you kept running into your neighbors and you kept running into people that you know. And what did they keep telling you? They kept telling you “Trump, Trump, Trump.”<br/> And so…<br/> AUDIENCE: Trump, Trump, Trump…<br/> SCHLAPP: So tomorrow — tomorrow, OK? Just be patient.<br/> PRIEBUS: But I knew, and so it was back then, with my family and my sister, who is a doctor out in San Diego. And it just kept — everyone around me — that nothing — it was impenetrable. Because it goes back to what I said before, which is that the country was hungry for something far more — far bigger than one story or on-off issue. It was something that people wanted in this country, that was real, something that was going to change the direction that we were heading. And it was President Trump that was the answer.<br/> BANNON: The reason Reince and I are good partners is that we can disagree. It’s not only not going to get better. It’s going to get worse every day.<br/> (LAUGHTER)<br/> And here’s why. By the way, the internal logic makes sense. They’re corporatist, globalist media that are adamantly opposed — adamantly opposed to an economic nationalist agenda like Donald Trump has. President Trump really laid this out, as Reince said, many years ago at CPAC. It’s really CPAC that really originally gave him the springboard. It’s the first time at Breitbart we start seeing him, and saw how people, you know, his speeches resonated with people.<br/> And then he would go out to these smaller town halls later and really he got traction with the same message he’s bringing today. Here’s the only — here’s why it’s going to get worse: Because he’s going to continue to press his agenda. And as economic conditions get better, as more jobs get better, they’re going to continue to fight. If you think they’re going to give you your country back without a fight, you are sadly mistaken. Every day — every day, it is going to be a fight. And that is what I’m proudest about Donald Trump. All the opportunities he had to waiver off this; all the people who have come to him and said, “oh, you’ve got to moderate.” Every day in the Oval Office, he tells Reince and I, “I committed this to the American people; I promised this when I ran; and I’m going to deliver on this.”<br/> (APPLAUSE)<br/> How novel.<br/> SCHLAPP: How interesting. I remember I was being asked by some reports — they were like why is Trump doing X, Y or Z? And I said, because he said he would do it on the campaign trail.<br/> (LAUGHTER)<br/> It’s really not that complicated, is it?<br/> But no, there are — there are…<br/> (CROSSTALK)<br/> SCHLAPP: … OK, I like that one. There are some — there are some parts of this, though, that are fitful. The American Conservative Union which puts on CPAC was created after Barry Goldwater lost in 1964, in an effort to take all different kinds of voices from the right in the conservative movement and bring them together.<br/> So there is this question. There are those folks that consider themselves, you know, classical liberals or conservatives or Reagan conservatives. There are other folks that consider themselves libertarians. There are other folks that are part of this new Trump movement. And Trump brought a lot of new people. There’s probably in this — people in this crowd that wouldn’t have been in this crowd before.<br/> So there’s a lot of diversity here. We all know it when we’re at the bar at the end of the day. And can this Trump movement be combined with what’s happening at CPAC and other conservative movements for 50 years? Can this be brought together? And is — this is going to save the country?<br/> PRIEBUS: Well, first of all, it has to and we have to stick together as a team. I think that what you’ve got is an incredible opportunity. We’ve got an incredible opportunity to use this victory that President Trump and all of us, and you, and everyone that made this happen, put together.<br/> And work together. Continue to communicate. It’s very similar. Some of the core principles of President Trump are very similar to those of Ronald Reagan. When you look at peace through strength and building up the military, I mean, how many times have you heard President Trump say, “I’m going to build up the military; I’m going to take care of the vets; I’m going to make sure that we don’t have a Navy that’s decimated, and planes that are nowhere to be found.”<br/> Peace through strength, deregulation. You think about the economy, the economic boom that was created. And some of it is going to take a little time, I mean, to get the jobs back; to get more money in people’s pockets. Those things are going to happen.<br/> And in the meantime, we have to stick together and make sure that we’ve got President Trump for eight years. And he’s somebody that we know that we’re going to be very proud of as these things get done. But it’s going to take all of us working together to make it happen.<br/> BANNON: You know, I’ve said that there’s a new political order that’s being formed out of this. And it’s still being formed. But if you look at the wide degree of opinions in this room — whether you’re a populist; whether you’re a limited government conservative; whether you’re libertarian; whether you’re an economic nationalist — we have wide and sometimes divergent opinions.<br/> BANNON: But I think we — the center core of what we believe, that we’re a nation with an economy, not an economy just in some global marketplace with open borders, but we are a nation with a culture and a — and a reason for being.<br/> And I think that is what unites us and I think that is what is going to unite this movement going forward. President Trump tomorrow is coming I think really to express his appreciation.<br/> SCHLAPP: Absolutely. The vice president’s coming tonight.<br/> BANNON: The vice president’s coming tonight and the reason he understand in CPAC there are many, many, many voices, but he’s here to say appreciation and to drive this movement forward. This is really where he got his launch, you know, with his ideas in the conservative movement…<br/> SCHLAPP: Absolutely.<br/> BANNON: … what seven, six years ago — five years ago and he wanted to show his appreciation.<br/> We’re at the top of the first inning of this. And it’s going to take just as much fight, just as much focus and just as much determination. And that one thing I’d like to leave you guys today with is that, we want you to have our back. But more importantly…<br/> (APPLAUSE)<br/> We know — by the way, President Trump — we never doubted that for a second, but also and more importantly, hold us accountable. Hold us accountable to what we promised, hold us accountable for delivering on what we promised.<br/> SCHLAPP: Let me just ask as we — as we close this out. It’s time for — you know you guys have been so sort of kumbaya here it’s kind of time for a little bit of a group hug.<br/> (LAUGHTER)<br/> Let me ask you — OK, I’m sorry I’m going to do the Barbara Walter’s thing for those of you who remember Barbara Walters.<br/> Let me ask you, what do you — you’ve worked really closely with Steve.<br/> PRIEBUS: Right.<br/> SCHLAPP: You say your offices — I know what two offices they are, they are really close to each other. What do you like the most about him?<br/> (LAUGHTER)<br/> Hold on, let him think.<br/> PRIEBUS: I love how many collars he wears, interesting look.<br/> (LAUGHTER)<br/> One thing — we’re different, but where we’re very similar is that I think that he is very dogged in making sure that every day the promises that President Trump has made are the promises that we’re working on every day, number one.<br/> Number two, he’s incredibly loyal. And number three, which I think is a really important quality as we were working together to see to it that President Trump’s vision is enacted is that, he’s extremely consistent.<br/> That, as you can imagine, there are many things hitting the president’s ear and desk every day. Different things that come to the president that want to move him off of his agenda and Steve is very consistent and very loyal to the agenda and is a presence that I think is very important to have in the White House and I consider him…<br/> (APPLAUSE)<br/> … but — and secondly — and a very dear friend — a very dear friend and someone that we — that I work with every second of the day in — and actually we cherish — I cherish his friendship.<br/> BANNON: Yeah, you know, I can run a little hot on occasions.<br/> (LAUGHTER)<br/> And — and Reince is indefatigable I mean, it’s low key, but it’s determination. The thing I respect most and the only way this thing works is Reince is always kind of steady, he’s got Katie and some other people around him, it’s very steady.<br/> But his job is, by far, one of the toughest jobs I’ve ever seen in my life. To make it run every day and to make the trains and you only see the surface. What’s going on underneath it, planning what’s three weeks down the road to the — to the degree that we’re planning it, of all these E.O.s and legislation and — you know, whether it’s the tax reform bill, Reince is indefatigable in saying, we’ve got to drive this forward, we’ve got to drive this forward.<br/> And I think it’s one of the reasons we have such a — and by the way this started back in August when we had this campaign where we were outgunned, out manned, you know, outspent. And it was because President Trump had a message, he had this charisma and he had people like here at CPAC and we just put our heads down and that when we — and Reince has been unwavering since the very first moment I met him.<br/> SCHLAPP: Well it’s a great honor to have you both here.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></div>",
  "content_text": "Interview of Steve Bannon and Reince Priebus by American Conservative Union President Matt Schlapp\nSCHLAPP: On that front — on that front, I also think it’s a perfect moment to thank all of you for helping us elect what will be one of the greatest presidents that ever served this country. It’s because of your work…\n(APPLAUSE)\n… that he made it happen.\nBANNON: And Matt, I want to thank you for finally inviting me to CPAC.\n(LAUGHTER)\nSCHLAPP: Yeah, there’s no — the — what was the name of the — the…\nBANNON: The uninvited.\nSCHLAPP: The uninvited.\nBANNON: I know there are many alumni out here in the audience.\nPRIEBUS: I didn’t like the uninvited.\nSCHLAPP: Here’s what we decided to do at CPAC with the uninvited. We decided to say that everybody’s a part of our conservative family.\nPRIEBUS: That’s right.\nSCHLAPP: And that’s what Donald Trump has done to so many of us around the country politically. And you guys have put together an amazing operation. You know, I know you all know this, but the last time a president came to CPAC in his first year, it was Ronald Reagan.\n(APPLAUSE) St. Ronald in 1981. And you’ve put together this — the president has put together the most conservative Cabinet we’ve ever seen according to our CPAC ratings and I think a few of us are pretty happy about what looks like is going to happen on the Supreme Court too, so it’s a…\n(APPLAUSE)\nNow, let me ask you two. I’m looking in the back of the room as well, but let me ask you two.\nPRIEBUS: Is that the opposition party?\n(LAUGHTER)\nSCHLAPP: Let me ask you two, we read a lot about you two.\nBANNON: It’s all good.\nSCHLAPP: But I bet not all of it’s accurate — I bet not all of it’s accurate. I bet there’s some things that don’t get written correctly. Let me ask each one of you, what’s the biggest misconception about what’s going on in the Donald Trump White House?\nPRIEBUS: Well, in regard to us two, I think the biggest misconception is everything that you’re reading.\n(LAUGHTER)\nWe — we share an office suite together. We’re basically together from 6:30 in the morning until about 11:00 at night.\nBANNON: I have a little thing called the war room, he has a fireplace with nice sofas.\nPRIEBUS: And it’s — it’s actually something that you all have helped build which is, when you bring together — and what this election showed and what President Trump showed, and let’s not kid ourselves, I mean I can talk about data and ground game and Steve can talk about big ideas, but the truth of the matter is Donald Trump — President Trump brought together the party and the conservative movement.\nAnd I’ve got to tell you, if the party and the conservative movement are together, similar to Steve and I, it can’t be stopped. And President Trump…\n(APPLAUSE)\n… was the one guy — he was the one person and I can say it after overseeing 16 people kill each other, it was Donald Trump that was able to bring this — this party and this movement together. And Steve and I know that and we live it every day. Our job is to get the agenda of President Trump through the door and on pen and paper.\nBANNON: You know, but we’ve known it since August 15th and I think if you look at the opposition party and how they portray the campaign, how they portrayed the transition and now they’re portraying the administration, it’s always wrong. I mean, on — on the very first day that Kellyanne and I started, we reached out to Reince, Sean Spicer, Katie.\nIt’s the same team that, you know, every day was grinding away on the campaign, the same team that did the transition and if you remember, you know, the campaign was the most chaotic — by the media’s description, most chaotic, most disorganized, most unprofessional, had no earthly idea what they were doing and then you saw them all crying and weeping that night on — on the 8th when…\n(APPLAUSE)\n… when — and the reason it worked — the reason it worked is President Trump. I mean, Trump had those ideas, had that energy, had that vision that could galvanize a team around him of disparate — look, we’re a coalition. You know, a lot of people think — have strong beliefs about different things, but we understand that you can come together to win and we understood that from August 15th and — and we never had a doubt and Donald Trump never had a doubt that he was going to win.\nBANNON: And — and I think that that is the power of this movement.\nPRIEBUS: And — and on top of that — first of all, President Trump laid out his vision — what was it? — four or five years ago here at CPAC.\nSCHLAPP: That’s right.\nPRIEBUS: And it was that vision — it’s nothing different. If you go back and watch the tape of President Trump four or five years ago, that was the Trump agenda.\nOne of the things that I used to say all the time — and Governor Walker and everyone gets sick of me saying it, but I think that President Trump found it — which is what this country, what all of us, were starving for the whole time because we’re so sick of politics and politicians.\nIn spite of the fact that we love being here, we — we actually hate politics. But what we were starving for was somebody real, somebody genuine, somebody that was actually who he said he was.\n(APPLAUSE)\nBANNON: Yep — yep.\nPRIEBUS: And the — the — the media attacked us on the campaign; remember, attacked me, you can’t spend the money on Trump, go give it to the Senate. Attacked us on the transition, we — President Trump put in the best Cabinet in the history of Cabinets I think.\nNow — feed ridiculous stories and all we do every day and all President Trump does every day, is hit his agenda every single day, whether it’s TPP, whether it’s deregulation, whether it’s Neil Gorsuch, whatever it is, his promise is coming through every day.\nSCHLAPP: He’s even — he’s even leaving bathrooms alone, that’s kind of a nice, refreshing thing for a lot of people as well.\n(APPLAUSE)\nBANNON: They happen to think it’s a state issue.\nSCHLAPP: Of course. BANNON: But — but — I think — let’s go back to the point that Reince made for a second. President Trump, when he was running, he made a — and this is the other thing that the — the mainstream media or opposition party never caught is that if you want to see the Trump agenda it’s very simple.\nIt was all in the speeches. He went around to these rallies, but those speeches had a tremendous amount of content in them, right? I happen to believe, and I think many others do, he’s probably the great public speaker in those large arenas since William Jennings Bryan. This was galvanized.\nAnd remember, we didn’t have money. Hillary Clinton and these guys had over $2 billion. We had a couple hundred million dollars. It was those rallies and those speeches, all he’s doing right now is, he’s laid out an agenda with those speeches for the promises he made. And our job every day is just to execute on that. It’s to simply get a path to how those get executed.\nAnd he’s maniacally focused on that, and I think that’s one of the powers of the transition where many, many people try to come in and try to convince President Trump, hey, you won on this but this is what you want to do.\nAnd he’s like, no, I promised the American people this, and this is the plan we’re going to execute on. And Reince said — and by the way that’s what you’ve seen; the executive orders, what the Supreme Court — the way he’s gone through the Supreme Court. And by the way the other 102 judges that we’re eventually going to pick, it’s just a methodical — and that’s what the mainstream media won’t report.\nJust like they were dead wrong on the chaos of the campaign and just like they were dead wrong in the chaos of the transition, they are absolutely dead wrong about what’s going on today because we have a team that’s just grinding it through on President Donald Trump promised the American people. And the mainstream media better understand something, all of those promises are going to be implemented.\nSCHLAPP: That’s awesome. It’s been a…\n(APPLAUSE)\nYou know, Steve you’re a really likable guy. You should do this more often.\nPRIEBUS: He’s not so bad.\nSCHLAPP: He’s not so bad.\nPRIEBUS: Most of the time.\nBANNON: Yes, exactly.\nSCHLAPP: So, what are 30 days of action, and you guys have touched on some of that action. Each one of you, tell me the one or two things that have happened the last 30 days that you think are the most critical. And what is the one thing that you just — like you said Steve — maniacally focused, that has just got to happen early in the administration to really turn this country around? Start first with the first 30 days and then what’s that focus after that.\nPRIEBUS: So, I mean, there’s a lot that — that’s happened…\nSCHLAPP: A lot.\nPRIEBUS: … in the — in the first 30 days. Whether, you know — and you look at the our — the world — our world order and — and some of the things that are going on that I think are — will be dealt with soon, but the first thing I think is Neil Gorsuch, for a couple things.\nNumber one, we’re not talking about a change over a four year period. We’re talking about a change of potentially 40 years of law, number one. But more important than that — more important to that, it established trust. It established that President Trump is a man of his word. We always knew that. But when he said here’s 20 names on a piece of paper back in July, remember and he said I’m going to pick my judge out of these 20 people that are on this piece of paper and he did it, that’s number one.\nPRIEBUS: Because Neil Gorsuch represents a conservative — represents the type of judge that has the vision of Donald Trump and it fulfills the promise that he made to all of you and to all Americans across the country. Second thing, deregulation, what hasn’t been talked about a lot is that President Trump signed an order that puts in place a constant deregulatory form within the federal government. And what it says is, for every regulation presented for passage that Cabinet secretary has to identify two that person would eliminate. And that’s a big deal.\n(APPLAUSE)\nAnd then lastly, immigration;, protecting the sovereignty of the United States, putting a wall on the southern border, making sure that criminals are not part of our process. These are all things that 80 percent of Americans agree with and these are all things that President Trump is doing within 30 days.\nSCHLAPP: Steve?\n(APPLAUSE)\nBANNON: I think the — I think the same thing; I think if you look at the lines of work, I kind of break it up into three verticals of three buckets. The first is kind of national security and sovereignty and that’s your intelligence, the Defense Department, Homeland Security.\nThe second line of work is what I refer to as economic nationalism and that is Wilbur Ross at Commerce, Steven Mnuchin at Treasury, Lighthizer at — at Trade, Peter Navarro, Stephen Miller, these people that are rethinking how we’re gonna reconstruct the — our trade arrangements around the world.\nThe third, broadly, line of work is what is deconstruction of the administrative state. And if you…\n(APPLAUSE)\nSo I think — I think the three most important things, I think one of the most pivotal moments in modern American history was his immediate withdraw from TPP. That got us out of a…\n(APPLAUSE)\n… got us out of a trade deal and let our sovereignty come back to ourselves, the people, the mainstream media don’t get this, but we’re already working in consultation with the Hill. People are starting to think through a whole raft of amazing and innovative, bilateral relationships — bilateral trading relationships with people that will reposition America in the world as a — as a fair trading nation and start to bring jobs. High value added, manufacturing jobs, back to the United States of America.\nOn the — on the national security part, it was certainly the first — I think the first two E.O.s that you start to see implemented here of the last couple of days under General Kelly. And that is, do rule of law is going to exist when you talk about our sovereignty and you talk about immigration. General Kelly…\n(APPLAUSE)\n… and Attorney General Sessions are adamant — you know, that and you’re gonna start to see I think with the defense budget we’re going to talk about next week when we bring the budget out and also with certain things about the plan on ISIS and what General Mattis and these guys think I think you’ll start to see the other part of that.\nBut the third, this regulation…\nSCHLAPP: Yeah.\nBANNON: … every business leader we’ve had in is saying not just taxes, but it is — it is also the regulation. I think the consistent, if you look at these Cabinet appointees, they were selected for a reason and that is the deconstruction, the way the progressive left runs, is if they can’t get it passed, they’re just gonna put in some sort of regulation in — in an agency.\nThat’s all gonna be deconstructed and I think that that’s why this regulatory thing is so important.\nSCHLAPP: We had Dr. Larry Arnn (ph) on the…\n(APPLAUSE)\n… stage earlier today. And he brought up the fact that we’re promulgating more laws and regulations that we ever had before. And most of that are from these independent agencies that are just on autopilot. You guys can stop that.\nAnd also, coming from the federal bunch as conservatives, we know that a lot of times we fight out the political wars over issues we care about and then all of a sudden, liberals on the bench like a lightening bolt out of the sky just change things.\nAnd so what you guys are saying about changing that order is amazing. You know, we all — we all consume a lot of news; we watch and read a lot of things, there’s been a great democratization in news. People get their news now from literally hundreds and thousands of sites.\nWhat — what would each of you say, what is the — there’s all these polls that are being put out again, is Donald Trump doing a good job, is Donald Trump doing a bad job. I know what you all think. We’ve been hearing it all — all day.\nWhat is it that they keep getting wrong and do you think it ever gets fixed? What does the media keep getting wrong about this Trump phenomena and what’s happening out there in the country? And is there any hope that this changes?\nPRIEBUS: I think there’s hope that it’s going to change. I mean we — we sit here, every day and — and the president pumps out all of this work and — and the executive orders and the punching through of the promises that he made to the American people.\nSo we’re hoping that the media would catch up eventually. But we’re so conditioned to it, I’m personally so conditioned to hearing about why President Trump isn’t going to win the election. Why one — why a controversy in the primaries going to take down President Trump.\nI lived through it, as chairman of the party. And — and it really hit me because it was maybe the summer of 2015 and you remember, the media was constantly pounding President Trump. And the polling kept getting better and better and better, for President Trump.\nBut it was when I went home and got out of this town. And I went back to Kenosha and I talked to my neighbor and I said, “Bob, what do you think?” And he goes, “Man, I really love that Trump.”\n(LAUGHTER)\nPRIEBUS: And I said, “Sandy — Sandy, what do you think?” She says, “We’re for Trump.”\nAnd it was, as you all lived through it too, because you all had different people you were for, but you kept running into your neighbors and you kept running into people that you know. And what did they keep telling you? They kept telling you “Trump, Trump, Trump.”\nAnd so…\nAUDIENCE: Trump, Trump, Trump…\nSCHLAPP: So tomorrow — tomorrow, OK? Just be patient.\nPRIEBUS: But I knew, and so it was back then, with my family and my sister, who is a doctor out in San Diego. And it just kept — everyone around me — that nothing — it was impenetrable. Because it goes back to what I said before, which is that the country was hungry for something far more — far bigger than one story or on-off issue. It was something that people wanted in this country, that was real, something that was going to change the direction that we were heading. And it was President Trump that was the answer.\nBANNON: The reason Reince and I are good partners is that we can disagree. It’s not only not going to get better. It’s going to get worse every day.\n(LAUGHTER)\nAnd here’s why. By the way, the internal logic makes sense. They’re corporatist, globalist media that are adamantly opposed — adamantly opposed to an economic nationalist agenda like Donald Trump has. President Trump really laid this out, as Reince said, many years ago at CPAC. It’s really CPAC that really originally gave him the springboard. It’s the first time at Breitbart we start seeing him, and saw how people, you know, his speeches resonated with people.\nAnd then he would go out to these smaller town halls later and really he got traction with the same message he’s bringing today. Here’s the only — here’s why it’s going to get worse: Because he’s going to continue to press his agenda. And as economic conditions get better, as more jobs get better, they’re going to continue to fight. If you think they’re going to give you your country back without a fight, you are sadly mistaken. Every day — every day, it is going to be a fight. And that is what I’m proudest about Donald Trump. All the opportunities he had to waiver off this; all the people who have come to him and said, “oh, you’ve got to moderate.” Every day in the Oval Office, he tells Reince and I, “I committed this to the American people; I promised this when I ran; and I’m going to deliver on this.”\n(APPLAUSE)\nHow novel.\nSCHLAPP: How interesting. I remember I was being asked by some reports — they were like why is Trump doing X, Y or Z? And I said, because he said he would do it on the campaign trail.\n(LAUGHTER)\nIt’s really not that complicated, is it?\nBut no, there are — there are…\n(CROSSTALK)\nSCHLAPP: … OK, I like that one. There are some — there are some parts of this, though, that are fitful. The American Conservative Union which puts on CPAC was created after Barry Goldwater lost in 1964, in an effort to take all different kinds of voices from the right in the conservative movement and bring them together.\nSo there is this question. There are those folks that consider themselves, you know, classical liberals or conservatives or Reagan conservatives. There are other folks that consider themselves libertarians. There are other folks that are part of this new Trump movement. And Trump brought a lot of new people. There’s probably in this — people in this crowd that wouldn’t have been in this crowd before.\nSo there’s a lot of diversity here. We all know it when we’re at the bar at the end of the day. And can this Trump movement be combined with what’s happening at CPAC and other conservative movements for 50 years? Can this be brought together? And is — this is going to save the country?\nPRIEBUS: Well, first of all, it has to and we have to stick together as a team. I think that what you’ve got is an incredible opportunity. We’ve got an incredible opportunity to use this victory that President Trump and all of us, and you, and everyone that made this happen, put together.\nAnd work together. Continue to communicate. It’s very similar. Some of the core principles of President Trump are very similar to those of Ronald Reagan. When you look at peace through strength and building up the military, I mean, how many times have you heard President Trump say, “I’m going to build up the military; I’m going to take care of the vets; I’m going to make sure that we don’t have a Navy that’s decimated, and planes that are nowhere to be found.”\nPeace through strength, deregulation. You think about the economy, the economic boom that was created. And some of it is going to take a little time, I mean, to get the jobs back; to get more money in people’s pockets. Those things are going to happen.\nAnd in the meantime, we have to stick together and make sure that we’ve got President Trump for eight years. And he’s somebody that we know that we’re going to be very proud of as these things get done. But it’s going to take all of us working together to make it happen.\nBANNON: You know, I’ve said that there’s a new political order that’s being formed out of this. And it’s still being formed. But if you look at the wide degree of opinions in this room — whether you’re a populist; whether you’re a limited government conservative; whether you’re libertarian; whether you’re an economic nationalist — we have wide and sometimes divergent opinions.\nBANNON: But I think we — the center core of what we believe, that we’re a nation with an economy, not an economy just in some global marketplace with open borders, but we are a nation with a culture and a — and a reason for being.\nAnd I think that is what unites us and I think that is what is going to unite this movement going forward. President Trump tomorrow is coming I think really to express his appreciation.\nSCHLAPP: Absolutely. The vice president’s coming tonight.\nBANNON: The vice president’s coming tonight and the reason he understand in CPAC there are many, many, many voices, but he’s here to say appreciation and to drive this movement forward. This is really where he got his launch, you know, with his ideas in the conservative movement…\nSCHLAPP: Absolutely.\nBANNON: … what seven, six years ago — five years ago and he wanted to show his appreciation.\nWe’re at the top of the first inning of this. And it’s going to take just as much fight, just as much focus and just as much determination. And that one thing I’d like to leave you guys today with is that, we want you to have our back. But more importantly…\n(APPLAUSE)\nWe know — by the way, President Trump — we never doubted that for a second, but also and more importantly, hold us accountable. Hold us accountable to what we promised, hold us accountable for delivering on what we promised.\nSCHLAPP: Let me just ask as we — as we close this out. It’s time for — you know you guys have been so sort of kumbaya here it’s kind of time for a little bit of a group hug.\n(LAUGHTER)\nLet me ask you — OK, I’m sorry I’m going to do the Barbara Walter’s thing for those of you who remember Barbara Walters.\nLet me ask you, what do you — you’ve worked really closely with Steve.\nPRIEBUS: Right.\nSCHLAPP: You say your offices — I know what two offices they are, they are really close to each other. What do you like the most about him?\n(LAUGHTER)\nHold on, let him think.\nPRIEBUS: I love how many collars he wears, interesting look.\n(LAUGHTER)\nOne thing — we’re different, but where we’re very similar is that I think that he is very dogged in making sure that every day the promises that President Trump has made are the promises that we’re working on every day, number one.\nNumber two, he’s incredibly loyal. And number three, which I think is a really important quality as we were working together to see to it that President Trump’s vision is enacted is that, he’s extremely consistent.\nThat, as you can imagine, there are many things hitting the president’s ear and desk every day. Different things that come to the president that want to move him off of his agenda and Steve is very consistent and very loyal to the agenda and is a presence that I think is very important to have in the White House and I consider him…\n(APPLAUSE)\n… but — and secondly — and a very dear friend — a very dear friend and someone that we — that I work with every second of the day in — and actually we cherish — I cherish his friendship.\nBANNON: Yeah, you know, I can run a little hot on occasions.\n(LAUGHTER)\nAnd — and Reince is indefatigable I mean, it’s low key, but it’s determination. The thing I respect most and the only way this thing works is Reince is always kind of steady, he’s got Katie and some other people around him, it’s very steady.\nBut his job is, by far, one of the toughest jobs I’ve ever seen in my life. To make it run every day and to make the trains and you only see the surface. What’s going on underneath it, planning what’s three weeks down the road to the — to the degree that we’re planning it, of all these E.O.s and legislation and — you know, whether it’s the tax reform bill, Reince is indefatigable in saying, we’ve got to drive this forward, we’ve got to drive this forward.\nAnd I think it’s one of the reasons we have such a — and by the way this started back in August when we had this campaign where we were outgunned, out manned, you know, outspent. And it was because President Trump had a message, he had this charisma and he had people like here at CPAC and we just put our heads down and that when we — and Reince has been unwavering since the very first moment I met him.\nSCHLAPP: Well it’s a great honor to have you both here.",
  "tags": [
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-24T13:00:00+00:00"
}