{
  "url": "https://voxday.net/2017/02/10/debate-jack-murphy-vs-vox-day/",
  "scraped_at": "2025-12-18T07:01:11.154892",
  "title": "Debate: Jack Murphy vs Vox Day",
  "date_display": "February 10, 2017",
  "date_iso": "2017-02-10T13:00:00+00:00",
  "date_from_url": "2017-02-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here is a brief selection from <a href=\"http://darktriadman.com/2017/02/10/vox-day-and-jack-murphy/\">the recent debate on the future of the Alt-Right</a>  between Jack Murphy and me that was hosted by Ivan Throne, the author of <a href=\"http://amzn.to/2dUdBpa\"><b><i>The Nine Laws</i></b></a>:</p><p><b>Ivan Throne: </b>Vox, do you advocate a white ethno-state? If so, what is the proper white homeland?</p><p><b>Vox Day: </b>I wouldn’t say that I advocate for the white ethno-state so much as I see it as inevitable. First of all, white ethno-state is somewhat of a misnomer. White American is not the same as a European nationality. This is something that I have had to explain to a lot of white nationalists. White nationalism makes no sense in Europe because over here we have distinct white ethnic groups that are completely separate.</p><p>In the US, however, where the original American nation has been adulterated to the point that you have a generic white race, there you will see the same move towards homogeneity that we have traditionally seen throughout history. People tend to forget that homogenous nations do not spring into existence from the ground. They emerge from heterogeneous, multinational, multicultural empires. The US went from an Anglo-Protestant nation to a multinational, multicultural, multiracial empire. It was an empire that was imposed by force during the Civil War, and it will go the way of all empires. We are already seeing, in the American southwest, the rise of La Raza Cosmica, who want their own independent state in the southwest.</p><p>It’s going to be a mess. These situations are always a mess, but in terms of what is right or wrong, my tribe has its own reservation, and I support them having that reservation, and I don’t see any reason that self-identified white people should not have the same self-determination that the US has defended around the world for a hundred years.</p><p><b>Jack Murphy:</b> That is a very interesting representation. I am a lifelong Democrat. I voted for Bill Clinton and proudly for Obama during the first election. I live in Washington DC, the bluest of all blue districts in the US. It is sort of a democratic ideal. I have come into the exploration of white identity politics from a belief that there is a feminist/Marxist overreach combined with intersectionality that has deemed victim culture here in the US as where we are. Every minority group, self-identified to some intersection, has become a victim. By virtue of them being a victim there must be a perpetrator. That perpetrator according to them is me. A straight white male. Russian Jewish and Catholic Irish, but that doesn’t matter. Through intersectionality I become the perpetrator of all evils in the Us.</p><p>This is my entre for identity politics. From there I explore why and how our people representing themselves in groups and based around identity functions. I explore the identities and advocacy that our people entertain. My perspective, as I explore new political groups after being abandoned by the democrats in their move to the left, the world shifts and the center passes me by and I find myself on the left. I must figure out where I fit into in this new reality. The term alt-right came up. From my perspective, the alt-right was exciting. It wasn’t stodgy and unappealing to a counterculture person. It wasn’t boring. I didn’t really understand or have any notion about its history. I began to explore with the perspective of “I am now the bad guy.” Just ten years ago, I was part of the “good team.” I was questioning how I would find my way in the future when being a straight white male in the US makes you the villain.</p><p>This conversation is to me an exploration. The conversation I wanted to have with Spencer, who has been very vocal advocate for white amnesty by any means possible, was going to seek direct answers to the question of what means he wanted to use. For me, I am less concerned about theory, less concerned about broad subjects that are not really about what I am going to do today. How am I going to manage day to day?</p><p><b>Vox Day:</b> Just so you understand, we are not talking about theory here.</p><p>There is nothing more pragmatic and realistic than what I am describing. What I am describing is about as optional as gravity. What has fundamentally changed is the US, and the reason that people like Richard Spencer and people who have long been completely ignored on the Right, people who were pushed out and pushed aside by William F. Buckley and the conservative movement. Those people saw this coming. Since 1965, when the Immigration and Naturalization Act was pushed through, the die was cast. Ever since 1965, the US has been on a clock, and the clock is running out of time. The clock has now run out.</p><p>What I mean by running out is this: it is only possible to have ideological or political disagreements when you have people who are more or less the same in identity. As the founder of Singapore, Lee Kuan Yew, said, in any multiracial state, all politics is identity. This is not a white thing, or a European thing. This is not even a right-wing thing. This is straightforward history and political science.</p><p>Someone like Richard, or some of the people who are out there more aggressively advocating for white nationalism, or whatever you want to call it, they are a symptom. Even your move to the right was a result of people hating you. They didn’t allow you into the party anymore. At the DNC, they kicked out a guy running for chairman because he was criticizing a Muslim. That, too, is identity politics. It doesn’t matter if you do not know your identity, you know you are different because they kicked you out.</p><p>This is all part of the same very large cyclical process. The end result of that process is, as the Alt-Right likes to say, diversity plus proximity equals war. And the end result of that process is ethnically homogenous ethno-states.</p></div>",
  "content_text": "Here is a brief selection from\nthe recent debate on the future of the Alt-Right\nbetween Jack Murphy and me that was hosted by Ivan Throne, the author of\nThe Nine Laws\n:\nIvan Throne:\nVox, do you advocate a white ethno-state? If so, what is the proper white homeland?\nVox Day:\nI wouldn’t say that I advocate for the white ethno-state so much as I see it as inevitable. First of all, white ethno-state is somewhat of a misnomer. White American is not the same as a European nationality. This is something that I have had to explain to a lot of white nationalists. White nationalism makes no sense in Europe because over here we have distinct white ethnic groups that are completely separate.\nIn the US, however, where the original American nation has been adulterated to the point that you have a generic white race, there you will see the same move towards homogeneity that we have traditionally seen throughout history. People tend to forget that homogenous nations do not spring into existence from the ground. They emerge from heterogeneous, multinational, multicultural empires. The US went from an Anglo-Protestant nation to a multinational, multicultural, multiracial empire. It was an empire that was imposed by force during the Civil War, and it will go the way of all empires. We are already seeing, in the American southwest, the rise of La Raza Cosmica, who want their own independent state in the southwest.\nIt’s going to be a mess. These situations are always a mess, but in terms of what is right or wrong, my tribe has its own reservation, and I support them having that reservation, and I don’t see any reason that self-identified white people should not have the same self-determination that the US has defended around the world for a hundred years.\nJack Murphy:\nThat is a very interesting representation. I am a lifelong Democrat. I voted for Bill Clinton and proudly for Obama during the first election. I live in Washington DC, the bluest of all blue districts in the US. It is sort of a democratic ideal. I have come into the exploration of white identity politics from a belief that there is a feminist/Marxist overreach combined with intersectionality that has deemed victim culture here in the US as where we are. Every minority group, self-identified to some intersection, has become a victim. By virtue of them being a victim there must be a perpetrator. That perpetrator according to them is me. A straight white male. Russian Jewish and Catholic Irish, but that doesn’t matter. Through intersectionality I become the perpetrator of all evils in the Us.\nThis is my entre for identity politics. From there I explore why and how our people representing themselves in groups and based around identity functions. I explore the identities and advocacy that our people entertain. My perspective, as I explore new political groups after being abandoned by the democrats in their move to the left, the world shifts and the center passes me by and I find myself on the left. I must figure out where I fit into in this new reality. The term alt-right came up. From my perspective, the alt-right was exciting. It wasn’t stodgy and unappealing to a counterculture person. It wasn’t boring. I didn’t really understand or have any notion about its history. I began to explore with the perspective of “I am now the bad guy.” Just ten years ago, I was part of the “good team.” I was questioning how I would find my way in the future when being a straight white male in the US makes you the villain.\nThis conversation is to me an exploration. The conversation I wanted to have with Spencer, who has been very vocal advocate for white amnesty by any means possible, was going to seek direct answers to the question of what means he wanted to use. For me, I am less concerned about theory, less concerned about broad subjects that are not really about what I am going to do today. How am I going to manage day to day?\nVox Day:\nJust so you understand, we are not talking about theory here.\nThere is nothing more pragmatic and realistic than what I am describing. What I am describing is about as optional as gravity. What has fundamentally changed is the US, and the reason that people like Richard Spencer and people who have long been completely ignored on the Right, people who were pushed out and pushed aside by William F. Buckley and the conservative movement. Those people saw this coming. Since 1965, when the Immigration and Naturalization Act was pushed through, the die was cast. Ever since 1965, the US has been on a clock, and the clock is running out of time. The clock has now run out.\nWhat I mean by running out is this: it is only possible to have ideological or political disagreements when you have people who are more or less the same in identity. As the founder of Singapore, Lee Kuan Yew, said, in any multiracial state, all politics is identity. This is not a white thing, or a European thing. This is not even a right-wing thing. This is straightforward history and political science.\nSomeone like Richard, or some of the people who are out there more aggressively advocating for white nationalism, or whatever you want to call it, they are a symptom. Even your move to the right was a result of people hating you. They didn’t allow you into the party anymore. At the DNC, they kicked out a guy running for chairman because he was criticizing a Muslim. That, too, is identity politics. It doesn’t matter if you do not know your identity, you know you are different because they kicked you out.\nThis is all part of the same very large cyclical process. The end result of that process is, as the Alt-Right likes to say, diversity plus proximity equals war. And the end result of that process is ethnically homogenous ethno-states.",
  "tags": [
    "#AltRight",
    "debate"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-10T13:00:00+00:00"
}