{
  "url": "https://voxday.net/2017/02/17/equality-is-not-rights-of-englishmen/",
  "scraped_at": "2025-12-18T07:02:23.983242",
  "title": "Equality is not “the rights of Englishmen”",
  "date_display": "February 17, 2017",
  "date_iso": "2017-02-17T16:00:00+00:00",
  "date_from_url": "2017-02-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An article on Alexander Hamilton’s opinion on immigration is revealing for what it shows about Jefferson and <a href=\"http://www.providencejournal.com/opinion/20161220/mackubin-thomas-owens-hamiltons-actual-view-on-immigration\">the false foundation he provides the civic nationalists</a> for their pseudo-nationalism:</p><blockquote><p> Although Alexander Hamilton was himself an immigrant, he was adamantly opposed to the open immigration policies that President Thomas Jefferson proposed in his first annual message to Congress in 1801. Although the incoming president had once opposed unlimited immigration, Jefferson now saw it as a way to secure the future political dominance of his own party over Hamilton’s Federalists.</p><p>Hamilton, like most Federalists, was concerned about French influence on American politics. Although the French Revolution had descended into terror and led to the rise of Napoleon, Jefferson and his Democratic-Republican Party persisted in their attachment to the French. Hamilton feared that Jefferson’s proposal for unlimited immigration would lead to the triumph of the radical principles of the French Revolution over those of the more moderate American Revolution.</p><p>Writing as “Lucius Crassus,” Hamilton argued: “The safety of a republic depends essentially on the energy of a common national sentiment; on a uniformity of principles and habits; on the exemption of the citizens from foreign bias, and prejudice; and on that love of country which will almost invariably be found to be closely connected with birth, education, and family.”</p><p>Invoking Jefferson’s own “Notes on Virginia,” Hamilton observed that “foreigners will generally be apt to bring with them attachments to the persons they have left behind; to the country of their nativity, and to its particular customs and manners.” He argued that “it is unlikely that they will bring with them that temperate love of liberty, so essential to real republicanism.”</p><p>He continued: “The influx of foreigners must, therefore, tend to produce a heterogeneous compound; to change and corrupt the national spirit; to complicate and confound public opinion; to introduce foreign propensities. In the composition of society, the harmony of the ingredients is all-important, and whatever tends to a discordant intermixture must have an injurious tendency.”</p><p>Hamilton concluded: “To admit foreigners indiscriminately to the rights of citizens, the moment they put foot in our country, as recommended in [Jefferson’s] message, would be nothing less than to admit the Grecian horse into the citadel of our liberty and sovereignty.”</p></blockquote><p>As I have repeatedly noted, the openness of certain of the Founding Fathers to non-English immigration was not based on principle, and equality was very far from a core principle of the American Revolution, much less the “sacred” and primary principle that the civic nationalists falsely claim it to be.</p><p>Equality was not a core principle of the American Revolution at all, nor does the false and ahistorical conservative distinction between “equality of opportunity” and “equality of result” have anything to do with the famous rhetorical phrase that Jefferson inserted in the Declaration of Independence. The equality to which Jefferson refers is actually the “liberté, égalité, fraternité” of the French Revolution for which he subsequently showed such enthusiasm. Equality is a French concept, not an American one, and is not among <a href=\"https://infogalactic.com/info/Rights_of_Englishmen\">the Rights of Englishmen</a>.</p><p>Moreover, the Congress rejected Jefferson’s unprincipled and tactical call for open immigration, as it restricted naturalization to “free white men” and ” further directed the clerk of the court to record the entry of all aliens into the United States” in the Naturalization Law of 1802.</p></div>",
  "content_text": "An article on Alexander Hamilton’s opinion on immigration is revealing for what it shows about Jefferson and\nthe false foundation he provides the civic nationalists\nfor their pseudo-nationalism:\nAlthough Alexander Hamilton was himself an immigrant, he was adamantly opposed to the open immigration policies that President Thomas Jefferson proposed in his first annual message to Congress in 1801. Although the incoming president had once opposed unlimited immigration, Jefferson now saw it as a way to secure the future political dominance of his own party over Hamilton’s Federalists.\nHamilton, like most Federalists, was concerned about French influence on American politics. Although the French Revolution had descended into terror and led to the rise of Napoleon, Jefferson and his Democratic-Republican Party persisted in their attachment to the French. Hamilton feared that Jefferson’s proposal for unlimited immigration would lead to the triumph of the radical principles of the French Revolution over those of the more moderate American Revolution.\nWriting as “Lucius Crassus,” Hamilton argued: “The safety of a republic depends essentially on the energy of a common national sentiment; on a uniformity of principles and habits; on the exemption of the citizens from foreign bias, and prejudice; and on that love of country which will almost invariably be found to be closely connected with birth, education, and family.”\nInvoking Jefferson’s own “Notes on Virginia,” Hamilton observed that “foreigners will generally be apt to bring with them attachments to the persons they have left behind; to the country of their nativity, and to its particular customs and manners.” He argued that “it is unlikely that they will bring with them that temperate love of liberty, so essential to real republicanism.”\nHe continued: “The influx of foreigners must, therefore, tend to produce a heterogeneous compound; to change and corrupt the national spirit; to complicate and confound public opinion; to introduce foreign propensities. In the composition of society, the harmony of the ingredients is all-important, and whatever tends to a discordant intermixture must have an injurious tendency.”\nHamilton concluded: “To admit foreigners indiscriminately to the rights of citizens, the moment they put foot in our country, as recommended in [Jefferson’s] message, would be nothing less than to admit the Grecian horse into the citadel of our liberty and sovereignty.”\nAs I have repeatedly noted, the openness of certain of the Founding Fathers to non-English immigration was not based on principle, and equality was very far from a core principle of the American Revolution, much less the “sacred” and primary principle that the civic nationalists falsely claim it to be.\nEquality was not a core principle of the American Revolution at all, nor does the false and ahistorical conservative distinction between “equality of opportunity” and “equality of result” have anything to do with the famous rhetorical phrase that Jefferson inserted in the Declaration of Independence. The equality to which Jefferson refers is actually the “liberté, égalité, fraternité” of the French Revolution for which he subsequently showed such enthusiasm. Equality is a French concept, not an American one, and is not among\nthe Rights of Englishmen\n.\nMoreover, the Congress rejected Jefferson’s unprincipled and tactical call for open immigration, as it restricted naturalization to “free white men” and ” further directed the clerk of the court to record the entry of all aliens into the United States” in the Naturalization Law of 1802.",
  "tags": [
    "history",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-17T16:00:00+00:00"
}