{
  "url": "https://voxday.net/2017/02/12/every-single-time/",
  "scraped_at": "2025-12-18T07:01:31.030694",
  "title": "Every. Single. Time.",
  "date_display": "February 12, 2017",
  "date_iso": "2017-02-12T14:19:00+00:00",
  "date_from_url": "2017-02-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In case you don’t think immigrants are ruthlessly self-serving and totally indifferent to the fate of the nation they pretend to be joining, even for multiple generations, <a href=\"http://www.infowars.com/bill-kristol-lazy-white-working-class-americans-should-be-replaced-by-immigrants/\">just listen to this third-generation immigrant talk</a> about the so-called benefits of immigration.</p><blockquote><p> Neoconservative Bill Kristol says that white working class Americans should be replaced by immigrants because they have become “lazy,” “decadent” and “spoiled”.</p><p>“Look, to be totally honest, if things are so bad as you say with the white working class, don’t you want to get new Americans in?” asked Kristol. “You can make a case that America has been great because every — I think John Adams said this — basically if you are in free society, a capitalist society, after two or three generations of hard work everyone becomes kind of decadent, lazy, spoil. Then, luckily, you have these waves of people coming in from Italy, Ireland, Russia, and now Mexico, who really want to work hard and really want to succeed and really want their kids to live better lives than them and aren’t sort of clipping coupons or hoping that they can hang on and meanwhile grew up as spoiled kids and so forth. In that respect, I don’t know how this moment is that different from the early 20th century.”</p></blockquote><p>No, Bill. They’re not “new Americans”. They are not Americans at all. And neither are you.</p><p>There is that vaunted “melting pot” assimilation of which we have heard so much about. Americans should deport Bill Kristol, then dig up the bodies of his father and his grandfather and deport them too.</p><p>Ever wonder why (((certain neocons))) are always idiotically banging on about going to war with Russia? Read <i>The Melting Pot</i> and you’ll know why. They’re filled with an irrational historical hatred and seeking retroactive revenge upon Tsar Amalek. Apparently even the 70 years of communist slaughter, suffering, and deprivation to which the Russian people were subject isn’t enough for them. Forget America. Forget Israel. Forget all the challenges that the modern world presently poses to Western civilization. What is really important is that Russia and Germany be destroyed!</p><p>They’re observably insane by any civilized standard. Thank God both the God-Emperor and his Strategikon clearly understand this and refuse to listen to them.</p><blockquote class=\"tr_bq\"><p> Kristol was apparently nervous about his comments being recorded despite making them at a public event. “I hope this thing isn’t being videotaped or ever shown anywhere. Whatever tiny, pathetic future I have is going to totally collapse,” said the founder of <i>the Weekly Standard</i>.</p></blockquote><p>Fortunately, only 731,909 so-called conservatives were dumb enough to follow this disgusting creature’s lead and vote for Evan McMullin. Cellar-Kennedy. Kristol-McMullin. It’s almost as if there is a noticeable pattern there….</p><div style=\"text-align: center;\"></div><div style=\"text-align: center;\"> <iframe allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/mWJSKhEwjy8\" width=\"512\"></iframe></div></div>",
  "content_text": "In case you don’t think immigrants are ruthlessly self-serving and totally indifferent to the fate of the nation they pretend to be joining, even for multiple generations,\njust listen to this third-generation immigrant talk\nabout the so-called benefits of immigration.\nNeoconservative Bill Kristol says that white working class Americans should be replaced by immigrants because they have become “lazy,” “decadent” and “spoiled”.\n“Look, to be totally honest, if things are so bad as you say with the white working class, don’t you want to get new Americans in?” asked Kristol. “You can make a case that America has been great because every — I think John Adams said this — basically if you are in free society, a capitalist society, after two or three generations of hard work everyone becomes kind of decadent, lazy, spoil. Then, luckily, you have these waves of people coming in from Italy, Ireland, Russia, and now Mexico, who really want to work hard and really want to succeed and really want their kids to live better lives than them and aren’t sort of clipping coupons or hoping that they can hang on and meanwhile grew up as spoiled kids and so forth. In that respect, I don’t know how this moment is that different from the early 20th century.”\nNo, Bill. They’re not “new Americans”. They are not Americans at all. And neither are you.\nThere is that vaunted “melting pot” assimilation of which we have heard so much about. Americans should deport Bill Kristol, then dig up the bodies of his father and his grandfather and deport them too.\nEver wonder why (((certain neocons))) are always idiotically banging on about going to war with Russia? Read\nThe Melting Pot\nand you’ll know why. They’re filled with an irrational historical hatred and seeking retroactive revenge upon Tsar Amalek. Apparently even the 70 years of communist slaughter, suffering, and deprivation to which the Russian people were subject isn’t enough for them. Forget America. Forget Israel. Forget all the challenges that the modern world presently poses to Western civilization. What is really important is that Russia and Germany be destroyed!\nThey’re observably insane by any civilized standard. Thank God both the God-Emperor and his Strategikon clearly understand this and refuse to listen to them.\nKristol was apparently nervous about his comments being recorded despite making them at a public event. “I hope this thing isn’t being videotaped or ever shown anywhere. Whatever tiny, pathetic future I have is going to totally collapse,” said the founder of\nthe Weekly Standard\n.\nFortunately, only 731,909 so-called conservatives were dumb enough to follow this disgusting creature’s lead and vote for Evan McMullin. Cellar-Kennedy. Kristol-McMullin. It’s almost as if there is a noticeable pattern there….",
  "tags": [
    "immigration",
    "trainwreck",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-12T14:19:00+00:00"
}