{
  "url": "https://voxday.net/2017/02/17/fake-news-fake-jews/",
  "scraped_at": "2025-12-18T07:02:22.156814",
  "title": "Fake news, fake jews",
  "date_display": "February 17, 2017",
  "date_iso": "2017-02-17T13:00:00+00:00",
  "date_from_url": "2017-02-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We live in an age of lies and falsehoods. The news is fake. The economic statistics are fake. The educations are fake. Churchians practice a fake parody of Christianity. And as Isi Leibler declares, pseudo-liberal and progressive fake jews have abandoned their homeland, their religion, and their Jewish identity <a href=\"https://archive.is/5LfJv\">in the Jerusalem Post</a>:</p><blockquote><p> Contrary to all the claptrap about democracy that they sanctimoniously preached while in office, leftists are unwilling to accept the fact that their candidate was defeated by a parvenu.</p><p>The same chaos has swept through Europe, many of whose citizens are revolting against the failure of the Brussels-based European Union bureaucrats to address their needs and above all the collapse in the quality of their lives resulting from millions of so-called refugees flooding their countries.</p><p>This has led to a rise in global populism, a revival of conservative and right-wing political parties and rejection of the “politically correct” way of life imposed by sanctimonious liberal ideologues.</p><p>How has this chaos impacted on Diaspora Jews? As history has testified, during periods of stress and anxiety, Diaspora Jews face grave threats. Antisemitism, already having reached record levels since the Nazi era, is poised to become even more vicious.</p><p>That situation has been temporarily muted because the prevailing threat of Islamic fundamentalist terrorist attacks in many Western nations has directed public anger toward Muslims rather than Jews. This does not apply to Hungary, Greece and Germany.</p><p>The Jews, as a minority that has suffered tyranny and persecution, would be expected under current circumstances to concentrate primarily on their own security. Ethics of the Fathers quotes Hillel the Elder, “If I am not for myself, who will be for me? But if I am only for myself, what am I?” Liberal-inclined Diaspora Jews – especially those lacking an authentic Jewish education – appear to have reversed this dictum. They consider that the well-being of the world and politically correct standards of social values must be their priority – with disregard to the harm this inflicts on them as a community.</p><p>Observing Conservative and Reform Jewish leaders in the US, accompanied by once-mainstream liberal Jewish groups like the Anti-Defamation League and National Council of Jewish Women, at the forefront of hysterical demonstrations accusing Trump of being fascist and encouraging antisemitism, it is if they have been possessed by a dybbuk.</p><p>The same bleeding hearts in the US as well as those in Europe were at the forefront of calls to open the gates to Muslim “refugees” steeped in anti-democratic behavior and nourished on diets of undiluted, visceral antisemitism…. One of the main justifying positive elements of progressive Jews was that even if they did not consider themselves obligated to follow Halacha (Jewish law), their activity would ensure that they at least remained within a Jewish framework. What their leaders are doing now is the opposite – encouraging them to take up liberal causes even if it means forsaking Israel, the most fundamental component providing them with a Jewish identity.</p><p>They have reversed Hillel’s maxim and act for what they perceive to be the universal needs of humanity, dismissing the interests of their own people. They are undermining themselves as a community and acting as lemmings marching off a cliff to their own destruction.</p><p>There is only one example in Jewish history to which such behavior can be compared. The Jewish Bolsheviks also turned against their own people, and ultimately the revolution consumed them.</p><p>Unfortunately, the vociferous anti-Trump Jewish activists represent a far greater proportion of the Left and their bleeding-heart pseudo-liberal allies than the Bolsheviks, who represented an insignificant proportion of Russian Jews.</p><p>It is clear that in the Diaspora, committed Jews will remain overwhelmingly supportive of Israel while the pseudo-liberal or progressive Jews will become less interested in Israel and ultimately lose their identity.</p></blockquote><p>The growing divide between the true Jews of Israel and the fake jews who are loyal to neither the West nor Israel is becoming ever more clear. Leibler, as is appropriate, criticizes these fake jews for failing to be loyal to their Jewish identity, or to remain within what he describes as “a Jewish framework”. The Alt-Right, as is also appropriate, criticizes the fake jews for their treacherous dyscivic and dyscivilizational actions against the nations of the West and Western civilization itself.</p><p>As Leibler observes, these fake jews are traitors to their people and  to their countries of residence alike, as Mark Zuckerberg demonstrated yesterday in his openly anti-Western, anti-American call for global totalitarian rule subject to his speech and thought policing. Ein Welt, Ein Reich, Ein Facebook. He’s even <a href=\"https://www.facebook.com/notes/mark-zuckerberg/building-global-community/10154544292806634\">written a manifesto</a>.</p><blockquote><p> History is the story of how we’ve learned to come together in ever greater numbers — from tribes to cities to nations. At each step, we built social infrastructure like communities, media and governments to empower us to achieve things we couldn’t on our own.</p><p>Today we are close to taking our next step. Our greatest opportunities are now global — like spreading prosperity and freedom, promoting peace and understanding, lifting people out of poverty, and accelerating science. Our greatest challenges also need global responses — like ending terrorism, fighting climate change, and preventing pandemics. Progress now requires humanity coming together not just as cities or nations, but also as a global community.</p></blockquote><p>Zuckerberg is not the first jew to write a manifesto. It is less well-written than its predecessor, and Mankind had better hope it proves to be less historically destructive as well. Fake jews like nothing better than to call their critics “anti-Semites”, but the fact is, it is the pseudo-liberal and progressive jews of the Left who are observably the true anti-semites, as they have rejected their homeland, they have rejected their religion, and they have rejected their Jewish identity.</p></div>",
  "content_text": "We live in an age of lies and falsehoods. The news is fake. The economic statistics are fake. The educations are fake. Churchians practice a fake parody of Christianity. And as Isi Leibler declares, pseudo-liberal and progressive fake jews have abandoned their homeland, their religion, and their Jewish identity\nin the Jerusalem Post\n:\nContrary to all the claptrap about democracy that they sanctimoniously preached while in office, leftists are unwilling to accept the fact that their candidate was defeated by a parvenu.\nThe same chaos has swept through Europe, many of whose citizens are revolting against the failure of the Brussels-based European Union bureaucrats to address their needs and above all the collapse in the quality of their lives resulting from millions of so-called refugees flooding their countries.\nThis has led to a rise in global populism, a revival of conservative and right-wing political parties and rejection of the “politically correct” way of life imposed by sanctimonious liberal ideologues.\nHow has this chaos impacted on Diaspora Jews? As history has testified, during periods of stress and anxiety, Diaspora Jews face grave threats. Antisemitism, already having reached record levels since the Nazi era, is poised to become even more vicious.\nThat situation has been temporarily muted because the prevailing threat of Islamic fundamentalist terrorist attacks in many Western nations has directed public anger toward Muslims rather than Jews. This does not apply to Hungary, Greece and Germany.\nThe Jews, as a minority that has suffered tyranny and persecution, would be expected under current circumstances to concentrate primarily on their own security. Ethics of the Fathers quotes Hillel the Elder, “If I am not for myself, who will be for me? But if I am only for myself, what am I?” Liberal-inclined Diaspora Jews – especially those lacking an authentic Jewish education – appear to have reversed this dictum. They consider that the well-being of the world and politically correct standards of social values must be their priority – with disregard to the harm this inflicts on them as a community.\nObserving Conservative and Reform Jewish leaders in the US, accompanied by once-mainstream liberal Jewish groups like the Anti-Defamation League and National Council of Jewish Women, at the forefront of hysterical demonstrations accusing Trump of being fascist and encouraging antisemitism, it is if they have been possessed by a dybbuk.\nThe same bleeding hearts in the US as well as those in Europe were at the forefront of calls to open the gates to Muslim “refugees” steeped in anti-democratic behavior and nourished on diets of undiluted, visceral antisemitism…. One of the main justifying positive elements of progressive Jews was that even if they did not consider themselves obligated to follow Halacha (Jewish law), their activity would ensure that they at least remained within a Jewish framework. What their leaders are doing now is the opposite – encouraging them to take up liberal causes even if it means forsaking Israel, the most fundamental component providing them with a Jewish identity.\nThey have reversed Hillel’s maxim and act for what they perceive to be the universal needs of humanity, dismissing the interests of their own people. They are undermining themselves as a community and acting as lemmings marching off a cliff to their own destruction.\nThere is only one example in Jewish history to which such behavior can be compared. The Jewish Bolsheviks also turned against their own people, and ultimately the revolution consumed them.\nUnfortunately, the vociferous anti-Trump Jewish activists represent a far greater proportion of the Left and their bleeding-heart pseudo-liberal allies than the Bolsheviks, who represented an insignificant proportion of Russian Jews.\nIt is clear that in the Diaspora, committed Jews will remain overwhelmingly supportive of Israel while the pseudo-liberal or progressive Jews will become less interested in Israel and ultimately lose their identity.\nThe growing divide between the true Jews of Israel and the fake jews who are loyal to neither the West nor Israel is becoming ever more clear. Leibler, as is appropriate, criticizes these fake jews for failing to be loyal to their Jewish identity, or to remain within what he describes as “a Jewish framework”. The Alt-Right, as is also appropriate, criticizes the fake jews for their treacherous dyscivic and dyscivilizational actions against the nations of the West and Western civilization itself.\nAs Leibler observes, these fake jews are traitors to their people and  to their countries of residence alike, as Mark Zuckerberg demonstrated yesterday in his openly anti-Western, anti-American call for global totalitarian rule subject to his speech and thought policing. Ein Welt, Ein Reich, Ein Facebook. He’s even\nwritten a manifesto\n.\nHistory is the story of how we’ve learned to come together in ever greater numbers — from tribes to cities to nations. At each step, we built social infrastructure like communities, media and governments to empower us to achieve things we couldn’t on our own.\nToday we are close to taking our next step. Our greatest opportunities are now global — like spreading prosperity and freedom, promoting peace and understanding, lifting people out of poverty, and accelerating science. Our greatest challenges also need global responses — like ending terrorism, fighting climate change, and preventing pandemics. Progress now requires humanity coming together not just as cities or nations, but also as a global community.\nZuckerberg is not the first jew to write a manifesto. It is less well-written than its predecessor, and Mankind had better hope it proves to be less historically destructive as well. Fake jews like nothing better than to call their critics “anti-Semites”, but the fact is, it is the pseudo-liberal and progressive jews of the Left who are observably the true anti-semites, as they have rejected their homeland, they have rejected their religion, and they have rejected their Jewish identity.",
  "tags": [
    "media",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-17T13:00:00+00:00"
}