{
  "url": "https://voxday.net/2017/02/16/genetic-politics/",
  "scraped_at": "2025-12-18T07:02:09.805171",
  "title": "Genetic politics",
  "date_display": "February 16, 2017",
  "date_iso": "2017-02-16T09:32:00+00:00",
  "date_from_url": "2017-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is futile to deny <a href=\"http://www.unz.com/jman/the-genetics-of-the-american-nations/\">the impact of identity politics</a>, given that both science and history are pointing towards the observable influence that genetics and demographics have at the macrosocietal level:<br/></p><blockquote><p> <i>Here we identify very recent fine-scale population structure in North America from a network of over 500 million genetic (identity-by-descent, IBD) connections among 770,000 genotyped individuals of US origin. We detect densely connected clusters within the network and annotate these clusters using a database of over 20 million genealogical records. Recent population patterns captured by IBD clustering include immigrants such as Scandinavians and French Canadians; groups with continental admixture such as Puerto Ricans; settlers such as the Amish and Appalachians who experienced geographic or cultural isolation; and broad historical trends, including reduced north-south gene flow. Our results yield a detailed historical portrait of North America after European settlement and support substantial genetic heterogeneity in the United States beyond that uncovered by previous studie</i>s.</p><p>In short, their giant sample and rich genealogical data allowed them to detect large patterns of shared ancestry in living Americans. And, as expected the American nations clearly emerge from the genetic data.</p><p>How did this pattern emerge? In short, this is ultimately the result of the four British folkways of Albion’s Seed. Here the genetic data show that they remain alive and well. Previously, in my post Genes, Climate, and Even More Maps of the American Nations, we saw that the founding British colonists came from distinct parts of the British Isles and settled in different parts of North America. The founding British stock are themselves visible in the genetic data, as we saw from fine-scale analysis of Britain</p><p>So what then do the clusters of Han et al mean? While the original colonial ancestry of the country has been overrun by subsequent migrants, the founding stock remain as a genetic undercurrent – a common genetic thread – within each American nation. This is especially true in the nations of the American South, where the colonial settlers received less subsequent migration and the original stock remains strong.</p></blockquote><p>Neither conservatism nor progressivism can account for the patterns and trends being observed. This is why it is vital for the Alt-Right to resolutely resist the temptation to lock itself into an ideology that will ultimately doom it to the same sort of ludicrous denial that we so often see from communists, socialists, feminists, free traders, multiculturalists, Churchians, conservatives, neo-Nazis, and others whose political identity requires them to rely upon anti-scientific, anti-historical denial.</p></div>",
  "content_text": "It is futile to deny\nthe impact of identity politics\n, given that both science and history are pointing towards the observable influence that genetics and demographics have at the macrosocietal level:\nHere we identify very recent fine-scale population structure in North America from a network of over 500 million genetic (identity-by-descent, IBD) connections among 770,000 genotyped individuals of US origin. We detect densely connected clusters within the network and annotate these clusters using a database of over 20 million genealogical records. Recent population patterns captured by IBD clustering include immigrants such as Scandinavians and French Canadians; groups with continental admixture such as Puerto Ricans; settlers such as the Amish and Appalachians who experienced geographic or cultural isolation; and broad historical trends, including reduced north-south gene flow. Our results yield a detailed historical portrait of North America after European settlement and support substantial genetic heterogeneity in the United States beyond that uncovered by previous studie\ns.\nIn short, their giant sample and rich genealogical data allowed them to detect large patterns of shared ancestry in living Americans. And, as expected the American nations clearly emerge from the genetic data.\nHow did this pattern emerge? In short, this is ultimately the result of the four British folkways of Albion’s Seed. Here the genetic data show that they remain alive and well. Previously, in my post Genes, Climate, and Even More Maps of the American Nations, we saw that the founding British colonists came from distinct parts of the British Isles and settled in different parts of North America. The founding British stock are themselves visible in the genetic data, as we saw from fine-scale analysis of Britain\nSo what then do the clusters of Han et al mean? While the original colonial ancestry of the country has been overrun by subsequent migrants, the founding stock remain as a genetic undercurrent – a common genetic thread – within each American nation. This is especially true in the nations of the American South, where the colonial settlers received less subsequent migration and the original stock remains strong.\nNeither conservatism nor progressivism can account for the patterns and trends being observed. This is why it is vital for the Alt-Right to resolutely resist the temptation to lock itself into an ideology that will ultimately doom it to the same sort of ludicrous denial that we so often see from communists, socialists, feminists, free traders, multiculturalists, Churchians, conservatives, neo-Nazis, and others whose political identity requires them to rely upon anti-scientific, anti-historical denial.",
  "tags": [
    "immigration",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-16T09:32:00+00:00"
}