{
  "url": "https://voxday.net/2017/02/16/in-praise-of-moi/",
  "scraped_at": "2025-12-18T07:02:14.886102",
  "title": "In praise of moi",
  "date_display": "February 16, 2017",
  "date_iso": "2017-02-16T18:00:00+00:00",
  "date_from_url": "2017-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The estimable John C. Wright, Dragon Award-winner and grandmaster of science fiction and fantasy, explains <a href=\"http://www.scifiwright.com/2017/02/in-praise-of-beale/\">what makes a good editor</a>:</p><blockquote><p> Someone asked me privately why I say that Vox Day is the best editor under whom it has been my privilege to work. I wrote a private answer, but I see no reason not to share it with the world. Mr. Day does not suffer from false modesty.</p><p>I do not mind elaborating.</p><p>The question is broader than just one author’s opinion about one editor. It is asking what editing is. That is a deeper question, too deep for this column, but I can plant a few signs pointing the direction where a fuller answer hides.</p><p>A good editor does not substitute his tastes, his politics, his pet peeves, or his sense of where your story should go for his own. A good editor is like a beauty parlor that brings out the best-looking version of the hair style you want framing your face, not someone else’s face.</p><p>That is, a good editor can tell the difference between the subjective and objective parts of the way one judges a story, and limit his comments to the more objective.</p><p>A good editor want you to tell your story your way, but he want you to tell it in your highest and best way, not your merely workmanlike way.</p><p>A good editor does make specific suggestions rather than vague ones, that is, he tells you which lines should be amended and how, rather than simply say “this needs to be tighter” or “this lacks punch”</p><p>Let me amend that. I should be more specific. A good editor knows when to be specific (to cure specific flaws) and when to be general (when he knows you know how to address a general flaw, and trusts you to find a specific solution). That requires good assessment both about the writing and about the writer’s professionalism.</p><p>A good editor reads the work and his comments show he understands what point each scene is trying to make, how characters develop, how description works or does not work.</p><p>A good editor keeps you informed of his decisions that might effect your book. Vox Day has contacted me more often in the last two weeks than Tor Books has in two years.</p><p>A good editor finds good covers.</p></blockquote><p>There is, as you can probably imagine, <a href=\"http://www.scifiwright.com/2017/02/in-praise-of-beale/\">considerably more there</a>, as well as a few other Castalia authors weighing in on the basis of their own experiences working with me and other editors. For me, one of the biggest challenges in editing Mr. Wright is dealing with his massive vocabulary, which exceeds my English vocabulary, and frequently forces me, or an assistant editor, to resort to the OED in order to determine if the unfamiliar word is a typo, a misspelling, or simply a word with which we are unfamiliar.</p><p>8 times out of 10, Mr. Wright is correct and our vocabularies are expanded accordingly.</p><p>One mistake I think many editors make is to believe that they, and not the writer, should have the final say in how the book will proceed. While I will occasionally pull rank on a beginning writer whose grasp of what works and what doesn’t can be dubious, with more experienced writers I am inclined to view my edits as suggestions they can take or leave. Usually they listen, but sometimes they don’t, in which case I am content to let them take the chance that they’ll hear it from the readers as well.</p><p>It’s their name on the book, after all, not mine. Therefore, it has to be their call in the end. My primary objective as an editor is to make <i>their </i>book better and more successful, not make it <i>my </i>book. I don’t have to agree with them, or even like what they are writing, in order to do that, I merely have to understand what it is they are trying to accomplish.</p><p>Of course, it probably helps that, unlike many editors in SF/F, I am actually an established writer in my own right, so I have no need to seek vicarious input in someone else’s book. As Mr. Wright noted, I have even been known to suggest a turn of phrase or two on occasion. And, as some readers have observed, all this editing over the last three years appears to have improved my own writing, as having to articulate various issues to a wide variety of writers helps me better understand some of the weaknesses of my own writing.</p><p>In any event, I regard editing Mr. Wright as both a privilege and a serious responsibility. While it would be nice if my own books were read one hundred years from now as well, there are worse things to be remembered for than having been a grandmaster’s editor.</p></div>",
  "content_text": "The estimable John C. Wright, Dragon Award-winner and grandmaster of science fiction and fantasy, explains\nwhat makes a good editor\n:\nSomeone asked me privately why I say that Vox Day is the best editor under whom it has been my privilege to work. I wrote a private answer, but I see no reason not to share it with the world. Mr. Day does not suffer from false modesty.\nI do not mind elaborating.\nThe question is broader than just one author’s opinion about one editor. It is asking what editing is. That is a deeper question, too deep for this column, but I can plant a few signs pointing the direction where a fuller answer hides.\nA good editor does not substitute his tastes, his politics, his pet peeves, or his sense of where your story should go for his own. A good editor is like a beauty parlor that brings out the best-looking version of the hair style you want framing your face, not someone else’s face.\nThat is, a good editor can tell the difference between the subjective and objective parts of the way one judges a story, and limit his comments to the more objective.\nA good editor want you to tell your story your way, but he want you to tell it in your highest and best way, not your merely workmanlike way.\nA good editor does make specific suggestions rather than vague ones, that is, he tells you which lines should be amended and how, rather than simply say “this needs to be tighter” or “this lacks punch”\nLet me amend that. I should be more specific. A good editor knows when to be specific (to cure specific flaws) and when to be general (when he knows you know how to address a general flaw, and trusts you to find a specific solution). That requires good assessment both about the writing and about the writer’s professionalism.\nA good editor reads the work and his comments show he understands what point each scene is trying to make, how characters develop, how description works or does not work.\nA good editor keeps you informed of his decisions that might effect your book. Vox Day has contacted me more often in the last two weeks than Tor Books has in two years.\nA good editor finds good covers.\nThere is, as you can probably imagine,\nconsiderably more there\n, as well as a few other Castalia authors weighing in on the basis of their own experiences working with me and other editors. For me, one of the biggest challenges in editing Mr. Wright is dealing with his massive vocabulary, which exceeds my English vocabulary, and frequently forces me, or an assistant editor, to resort to the OED in order to determine if the unfamiliar word is a typo, a misspelling, or simply a word with which we are unfamiliar.\n8 times out of 10, Mr. Wright is correct and our vocabularies are expanded accordingly.\nOne mistake I think many editors make is to believe that they, and not the writer, should have the final say in how the book will proceed. While I will occasionally pull rank on a beginning writer whose grasp of what works and what doesn’t can be dubious, with more experienced writers I am inclined to view my edits as suggestions they can take or leave. Usually they listen, but sometimes they don’t, in which case I am content to let them take the chance that they’ll hear it from the readers as well.\nIt’s their name on the book, after all, not mine. Therefore, it has to be their call in the end. My primary objective as an editor is to make\ntheir\nbook better and more successful, not make it\nmy\nbook. I don’t have to agree with them, or even like what they are writing, in order to do that, I merely have to understand what it is they are trying to accomplish.\nOf course, it probably helps that, unlike many editors in SF/F, I am actually an established writer in my own right, so I have no need to seek vicarious input in someone else’s book. As Mr. Wright noted, I have even been known to suggest a turn of phrase or two on occasion. And, as some readers have observed, all this editing over the last three years appears to have improved my own writing, as having to articulate various issues to a wide variety of writers helps me better understand some of the weaknesses of my own writing.\nIn any event, I regard editing Mr. Wright as both a privilege and a serious responsibility. While it would be nice if my own books were read one hundred years from now as well, there are worse things to be remembered for than having been a grandmaster’s editor.",
  "tags": [
    "Castalia House",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-16T18:00:00+00:00"
}