{
  "url": "https://voxday.net/2017/02/09/mailvox-sjws-have-no-loyalty/",
  "scraped_at": "2025-12-18T07:01:04.219305",
  "title": "Mailvox: SJWs have no loyalty",
  "date_display": "February 9, 2017",
  "date_iso": "2017-02-09T16:00:00+00:00",
  "date_from_url": "2017-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Jon sent me this at my request. For more details concerning his blackballing by Baycon, <a href=\"http://delarroz.com/?p=431\">he has a post up</a> at his own site. His story is an illustration of the falsity of the illusion to which many “nice conservatives” are still subject, those who don’t realize that SJWs will judge them by the identity of their politics, not the content of their character or the perfection of their etiquette. He’s right: SJWs had, and have, no loyalty.</i></p><p>The Science Fiction and Fantasy writing and convention scene is one of the worst SJW converged subcultures. While Hollywood promotes extreme perversion and hedonism, they don’t push nearly as hard as SF/F literary groups when it comes to the intellectual aspects of identity politics. My name is Jon Del Arroz, I write Science Fiction, and this is my story.</p><p>I had grown up in this community as an avid reader and convention attendee. I used to be what you would call one of those “nice guy conservatives.” I would keep silent about my politics to the best of my ability, while smiling and allowing others to rant and rave to their hearts’ content. My first foray into irritation over this occurred when Baycon, a local convention in the San Francisco Bay Area, ran a talk on how to convince friends out of believing in Creationism. I wrote to the programming director of the convention, citing my concern over how anti-Christian that sounded, and how this didn’t seem relevant to Science Fiction at all. They dismissed my concerns and told me to attend anyway.</p><p>The next year, I’d gained prominence as the writer of a web comic which had garnered some praise and a lot of web traffic. This time, they invited me to the convention and placed me on a program. Because of my Hispanic last name, they made me speak about how difficult it is for minorities in Science Fiction. I’ve never met any resistance to my being Hispanic in the SF publishing field, and I found it more of a challenge to survive that hour and a half in the company of the whining panelists</p><p>Fast forward several years later, after I’d invested time and effort speaking on panels, entertaining convention attendees and being a good friend to everyone. Whispers about the evil Sad Puppies stealing Hugo awards circled the halls. Although I’d voted with the Sad Puppies, I stayed quiet. I’d spoken personally to several prominent members of the Sad and Rabid Puppies movements by this point and learned they were nice, professional people and not the monsters they had been made out to be by the SJWs.</p><p>All the while, the God-Emperor was ascending in politics. He took slings and arrows. Many conservatives in the Sci-Fi publishing field had been hit as well. I saw the guilt by association on a regular basis, and it angered me to see people attacked for the way they voted. I still didn’t speak out much, as I had <a href=\"http://amzn.to/2kv79d4\">my first novel</a> due for release the week after the election. My brainwashing from years of conventions told me I couldn’t afford that association if I wanted to sell books.</p><p>Trump won. I made a few posts as to how I was happy with the outcome of the election, complete with donning my red hat. What happened next? I received a nasty letter from my editor’s assistant about how intolerant and inflexible I was, telling me that I was not likely to be invited to be published again. SJWs weren’t just attacking someone I knew on the periphery. They’d come for me. I decided the best course of action would be to take a stand and be positive, say how proud I was of our country, of Trump and his team. My friends from the SF/F world quickly evaporated. I’d been blocked on social media, ignored by people with whom I thought I’d developed deep relationships. I’d spent hours critiquing other writers’ novels and improving their craft, yet they would not even share a link to my work, let alone make a purchase, to support me. SJWs had, and have, no loyalty.</p><p>This began my transition from “nice guy conservative” to “I am proud to be who I am.” I corresponded with prominent authors privately about what had transpired. Many of the Sad and Rabid Puppies told me I was not alone. They hardly knew me, yet helped me promote my book. I learned a valuable lesson on the meaning of true friendship and loyalty. If someone doesn’t share any core values with you, they will leave you in the dust. It’s only a matter of time.</p><p><a href=\"https://www.amazon.com/dp/B01MDTNR8U/ref=as_li_ss_il?ie=UTF8&amp;qid=1478053991&amp;sr=8-1&amp;keywords=star+realms:+rescue+run&amp;linkCode=li3&amp;tag=voxpop06-20&amp;linkId=0dcdd081064ccd2b673bbd8f6225f208\" rel=\"noopener\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\" target=\"_blank\"><noscript><img border=\"0\" decoding=\"async\" src=\"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&amp;ASIN=B01MDTNR8U&amp;Format=_SL250_&amp;ID=AsinImage&amp;MarketPlace=US&amp;ServiceVersion=20070822&amp;WS=1&amp;tag=voxpop06-20\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&amp;ASIN=B01MDTNR8U&amp;Format=_SL250_&amp;ID=AsinImage&amp;MarketPlace=US&amp;ServiceVersion=20070822&amp;WS=1&amp;tag=voxpop06-20\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a><noscript><img alt=\"\" border=\"0\" decoding=\"async\" height=\"1\" src=\"https://ir-na.amazon-adsystem.com/e/ir?t=voxpop06-20&amp;l=li3&amp;o=1&amp;a=B01MDTNR8U\" style=\"border: none !important; margin: 0px !important;\" width=\"1\"/></noscript><img alt=\"\" border=\"0\" class=\"lazyload\" data-src=\"https://ir-na.amazon-adsystem.com/e/ir?t=voxpop06-20&amp;l=li3&amp;o=1&amp;a=B01MDTNR8U\" decoding=\"async\" height=\"1\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%201%201%22%3E%3C/svg%3E\" style=\"border: none !important; margin: 0px !important;\" width=\"1\">I still couldn’t bring myself to fully speak out in these situations, fearing the loss of more long time friends. Vox emailed me with: <i>“Learn to go public. One reason they get away with it is because everyone they do it to tries to keep it quiet. You shouldn’t.”</i> These words haunted me, but I still clung to the past, hoping desperately that I could retain at least some of the relationships I had from my years of hard work and supporting other writers.</img></p><p>Inauguration time. The angry posts calling me and mine Nazis had not died down. The angry responses continued as well. My own cousin, with whom I grew up and played <i>Risk </i>‘til the wee hours of the morning, disowned me over my Trump support. He told me he was ashamed to call me family, and that I was never his friend. Matters became worse in the Science Fiction world. Prominent authors stepped up their game of name-calling. I wear their condemnations as badges of honor and will use them as blurbs on future books. I’d finally had enough when I found that my home convention, where I’d been a guest for years <a href=\"http://delarroz.com/?p=431\">had blackballed me from speaking</a>.</p><p>I’m done. It’s too much. There’s no logic. There’s no rationality. There’s no love. There’s no friendship. SJWs want to shut me down and destroy my career, and they want to find you and do the same to you, if they haven’t already. I’ve taken the leap of going public. I’m not scared to say who I am, who I like, who I voted for. They’re not going to shut me up because I have the platform of the internet. Vox was right. Every single time they shut you down, go public with it as I just did.</p><p>I’ve gotten a few hateful comments, but nothing worse than they’ve already called me. The people who were on the fringes of hating me, but warned me that I needed to play ball, were going to hate me anyway. I’m not losing anything. These people were not going to buy my products. They’re not going to support you either. But it’s not that bad. There is tremendous upside to going public, however.</p><p>I’ve had congratulations from friends. My blog has been reposted by dozens of prominent authors from Castalia House and others. Dragon Award Winner Nick Cole <a href=\"http://www.nickcolebooks.com/2017/02/08/the-assassination-of-milscifi-author-jon-del-arroz/\">shared my story</a>, and that by itself sold me more books in an hour than attending conventions for years ever did for me. There’s a lot of us. We’re not alone and we’re no longer afraid.</p><p>Here’s my advice:</p><ol><li>Be who you are, and go public when you’re wronged by SJWs. Every time one of us comes out of the closet, it makes it easier for the next dozen. This is how we will change the culture.</li><li>Don’t be attached to being liked or respected by SJWs. They won’t change their minds no matter how nice you are.</li><li>Reach out and find support groups. There’s millions of alt-right, libertarian, conservative, and Christian people out there. We’re the majority. Remember that.</li><li>Never get tired of winning.</li></ol><p>If you’re interested in my space opera, it’s called <b><i><a href=\"http://amzn.to/2kv79d4\">Star Realms: Rescue Run</a></i></b>.</p></div>",
  "content_text": "Jon sent me this at my request. For more details concerning his blackballing by Baycon,\nhe has a post up\nat his own site. His story is an illustration of the falsity of the illusion to which many “nice conservatives” are still subject, those who don’t realize that SJWs will judge them by the identity of their politics, not the content of their character or the perfection of their etiquette. He’s right: SJWs had, and have, no loyalty.\nThe Science Fiction and Fantasy writing and convention scene is one of the worst SJW converged subcultures. While Hollywood promotes extreme perversion and hedonism, they don’t push nearly as hard as SF/F literary groups when it comes to the intellectual aspects of identity politics. My name is Jon Del Arroz, I write Science Fiction, and this is my story.\nI had grown up in this community as an avid reader and convention attendee. I used to be what you would call one of those “nice guy conservatives.” I would keep silent about my politics to the best of my ability, while smiling and allowing others to rant and rave to their hearts’ content. My first foray into irritation over this occurred when Baycon, a local convention in the San Francisco Bay Area, ran a talk on how to convince friends out of believing in Creationism. I wrote to the programming director of the convention, citing my concern over how anti-Christian that sounded, and how this didn’t seem relevant to Science Fiction at all. They dismissed my concerns and told me to attend anyway.\nThe next year, I’d gained prominence as the writer of a web comic which had garnered some praise and a lot of web traffic. This time, they invited me to the convention and placed me on a program. Because of my Hispanic last name, they made me speak about how difficult it is for minorities in Science Fiction. I’ve never met any resistance to my being Hispanic in the SF publishing field, and I found it more of a challenge to survive that hour and a half in the company of the whining panelists\nFast forward several years later, after I’d invested time and effort speaking on panels, entertaining convention attendees and being a good friend to everyone. Whispers about the evil Sad Puppies stealing Hugo awards circled the halls. Although I’d voted with the Sad Puppies, I stayed quiet. I’d spoken personally to several prominent members of the Sad and Rabid Puppies movements by this point and learned they were nice, professional people and not the monsters they had been made out to be by the SJWs.\nAll the while, the God-Emperor was ascending in politics. He took slings and arrows. Many conservatives in the Sci-Fi publishing field had been hit as well. I saw the guilt by association on a regular basis, and it angered me to see people attacked for the way they voted. I still didn’t speak out much, as I had\nmy first novel\ndue for release the week after the election. My brainwashing from years of conventions told me I couldn’t afford that association if I wanted to sell books.\nTrump won. I made a few posts as to how I was happy with the outcome of the election, complete with donning my red hat. What happened next? I received a nasty letter from my editor’s assistant about how intolerant and inflexible I was, telling me that I was not likely to be invited to be published again. SJWs weren’t just attacking someone I knew on the periphery. They’d come for me. I decided the best course of action would be to take a stand and be positive, say how proud I was of our country, of Trump and his team. My friends from the SF/F world quickly evaporated. I’d been blocked on social media, ignored by people with whom I thought I’d developed deep relationships. I’d spent hours critiquing other writers’ novels and improving their craft, yet they would not even share a link to my work, let alone make a purchase, to support me. SJWs had, and have, no loyalty.\nThis began my transition from “nice guy conservative” to “I am proud to be who I am.” I corresponded with prominent authors privately about what had transpired. Many of the Sad and Rabid Puppies told me I was not alone. They hardly knew me, yet helped me promote my book. I learned a valuable lesson on the meaning of true friendship and loyalty. If someone doesn’t share any core values with you, they will leave you in the dust. It’s only a matter of time.\nI still couldn’t bring myself to fully speak out in these situations, fearing the loss of more long time friends. Vox emailed me with:\n“Learn to go public. One reason they get away with it is because everyone they do it to tries to keep it quiet. You shouldn’t.”\nThese words haunted me, but I still clung to the past, hoping desperately that I could retain at least some of the relationships I had from my years of hard work and supporting other writers.\nInauguration time. The angry posts calling me and mine Nazis had not died down. The angry responses continued as well. My own cousin, with whom I grew up and played\nRisk\n‘til the wee hours of the morning, disowned me over my Trump support. He told me he was ashamed to call me family, and that I was never his friend. Matters became worse in the Science Fiction world. Prominent authors stepped up their game of name-calling. I wear their condemnations as badges of honor and will use them as blurbs on future books. I’d finally had enough when I found that my home convention, where I’d been a guest for years\nhad blackballed me from speaking\n.\nI’m done. It’s too much. There’s no logic. There’s no rationality. There’s no love. There’s no friendship. SJWs want to shut me down and destroy my career, and they want to find you and do the same to you, if they haven’t already. I’ve taken the leap of going public. I’m not scared to say who I am, who I like, who I voted for. They’re not going to shut me up because I have the platform of the internet. Vox was right. Every single time they shut you down, go public with it as I just did.\nI’ve gotten a few hateful comments, but nothing worse than they’ve already called me. The people who were on the fringes of hating me, but warned me that I needed to play ball, were going to hate me anyway. I’m not losing anything. These people were not going to buy my products. They’re not going to support you either. But it’s not that bad. There is tremendous upside to going public, however.\nI’ve had congratulations from friends. My blog has been reposted by dozens of prominent authors from Castalia House and others. Dragon Award Winner Nick Cole\nshared my story\n, and that by itself sold me more books in an hour than attending conventions for years ever did for me. There’s a lot of us. We’re not alone and we’re no longer afraid.\nHere’s my advice:\nBe who you are, and go public when you’re wronged by SJWs. Every time one of us comes out of the closet, it makes it easier for the next dozen. This is how we will change the culture.\nDon’t be attached to being liked or respected by SJWs. They won’t change their minds no matter how nice you are.\nReach out and find support groups. There’s millions of alt-right, libertarian, conservative, and Christian people out there. We’re the majority. Remember that.\nNever get tired of winning.\nIf you’re interested in my space opera, it’s called\nStar Realms: Rescue Run\n.",
  "tags": [
    "mailvox",
    "Pink SF",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-09T16:00:00+00:00"
}