{
  "url": "https://voxday.net/2017/02/03/never-ever-accept-refugees/",
  "scraped_at": "2025-12-18T07:00:06.323393",
  "title": "Never, ever, accept refugees",
  "date_display": "February 3, 2017",
  "date_iso": "2017-02-03T16:00:00+00:00",
  "date_from_url": "2017-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Last summer, a number of normally sensible people were shocked when I said that the European governments would be wise to sink the refugee ships that were crossing the Mediterranean. Most of those people now realize that the people of Europe would be much better off if their governments had rejected the ridiculous “it is moral to help poor defenseless refugees” argument and fulfilled their responsibility to defend their national borders.</p><p>But my opinion is not based on any heartlessness or cruelty, it is based on knowledge of history. As it happened, I’ve been reading Charles Oman’s <i>The Byzantine Empire</i>, and the following incident caught my attention, presaging as it does the current situation. You will note that last summer was not the first time refugees in peril were permitted to cross a border, and as Oman’s account suggests, it will not be the first time that the people whose governments betrayed them have paid a bitter price for that failure either.</p><p>Consider this heart-rending account of a people in dire straits through no fault of their own, but due to the unprovoked attack of a vicious foe. Wouldn’t you be tempted to offer them refuge too?</p><blockquote><p> About the year a.d. 372 the Huns, an enormous Tartar horde from beyond the Don and Volga, burst into the lands north of the Euxine, and began to work their way westward. The first tribe that lay in their way, the nomadic race of the Alans, they almost exterminated. Then they fell upon the Goths. The Ostrogoths made a desperate attempt to defend the line of the Dniester against the oncoming savages—“men with faces that can hardly be called faces—rather shapeless black collops of flesh with little points instead of eyes; little in stature, but lithe and active, skilful in riding, broad shouldered, good at the bow, stiff-necked and proud, hiding under a barely human form the ferocity of the wild beast.” But the enemy whom the Gothic historian describes in these uninviting terms was too strong for the Teutons of the East. The Ostrogoths were crushed and compelled to become vassals of the Huns, save a remnant who fought their way southward to the Wallachian shore, near the marshes of the Delta of the Danube.</p><p>Then the Huns fell on the Visigoths. The wave of invasion pressed on; the Bug and the Pruth proved no barrier to the swarms of nomad bowmen, and the Visigoths, under their Duke Fritigern, fell back in dismay with their wives and children, their waggons and flocks and herds, till they found themselves with their backs to the Danube. Surrender to the enemy was more dreadful to the Visigoths than to their eastern brethren; they were more civilized, most of them were Christians, and the prospect of slavery to savages seems to have appeared intolerable to them.</p><p>Pressed against the Danube and the Roman border, the Visigoths sent in despair to ask permission to cross from the Emperor. A contemporary writer describes how they stood. “All the multitude that had escaped from the murderous savagery of the Huns—no less than 200,000 fighting men, besides women and old men and children—-were there on the river bank, stretching out their hands with loud lamentations, and earnestly supplicating leave to cross, bewailing their calamity, and promising that they would ever faithfully adhere to the imperial alliance if only the boon was granted them.”</p></blockquote><p>Who among you would be so heartless, so cruel, as to deny hundreds of thousands of desperate women and children refuge from some of the most savage warriors ever to slaughter the innocent in the recorded history of Man? Not the Roman Emperor, although he was not unmindful of the potential for trouble, and took the necessary precautions.</p><blockquote class=\"tr_bq\"><p> The proposal of the Goths filled Valens with dismay. It was difficult to say which was more dangerous—to refuse a passage to 200,000 desperate men with arms in their hands and a savage foe at their backs, or to admit them within the line of river and fortress that protected the border, with an implied obligation to find land for them. After much doubting he chose the latter alternative: if the Goths would give hostages and surrender their arms, they should be ferried across the Danube and permitted to settle as subject-allies within the empire.</p></blockquote><p>Isn’t that the correct moral choice? Provide them with refuge, but disarm them so they can’t cause too much trouble? Isn’t that what you would do, being both a good, moral person and a wise, cautious individual?</p><blockquote><p>  The Goths accepted the terms, gave up the sons of their chiefs as hostages, and streamed across the river as fast as the Roman Danube-flotilla could transport them. But no sooner had they reached Moesia than troubles broke out. The Roman officials at first tried to disarm the immigrants, but the Goths were unwilling to surrender their weapons, and offered large bribes to be allowed to retain them: in strict disobedience to the Emperor’s orders, the bribes were accepted and the Goths retained their arms. Further disputes soon broke out…. Fritigern, with many of his nobles, was dining with Count Lupicinus at the town of Marcianopolis, when some starving Goths tried to pillage the market by force. A party of Roman soldiers strove to drive them off, and were at once mishandled or slain. On hearing the tumult and learning its cause, Lupicinus recklessly bade his retinue seize and slay Fritigern and the other guests at his banquet. The Goths drew their swords and cut their way out of the palace. Then riding to the nearest camp of his followers, Fritigern told his tale, and bade them take up arms against Rome.</p><p>There followed a year of desperate fighting all along the Danube, and the northern slope of the Balkans. The Goths half-starved for many months, and smarting under the extortion and chicanery to which they had been subjected, soon showed that the old barbarian spirit was but thinly covered by the veneer of Christianity and civilization which they had acquired in the last half-century. The struggle resolved itself into a repetition of the great raids of the third century: towns were sacked and the open country harried in the old style, nor was the war rendered less fierce by the fact that many runaway slaves and other outcasts among the provincial population joined the invaders.</p></blockquote><p>So, instead of the Goths being slaughtered and enslaved by the Huns, the Romans were slaughtered, their towns were destroyed, and their lands were laid waste. No one could possibly have seen that coming, right? It was still the moral thing to do, because refugees, right? Just wait, it gets better, and the ending is so flawlessly fitting that it reads more like an Aesopian fable than actual history.</p><blockquote><p> In 378 a.d., the main body of the Goths succeeded in forcing the line of the Balkans; they were not far from Adrianople when the Emperor started to attack them, with a splendid army of 60,000 men. Every one expected to hear of a victory, for the reputation of invincibility still clung to the legions, and after six hundred years of war the disciplined infantry of Rome, robur peditum, whose day had lasted since the Punic wars, were still reckoned superior, when fairly handled, to any amount of wild barbarians….</p><p>Valens found the main body of the Goths encamped in a great “laager,” on the plain north of Adrianople. After some abortive negotiations he developed an attack on their front, when suddenly a great body of horsemen charged in on the Roman flank. It was the main strength of the Gothic cavalry, which had been foraging at a distance; receiving news of the fight it had ridden straight for the battle field. Some Roman squadrons which covered the left flank of the Emperor’s army were ridden down and trampled under foot. Then the Goths swept down on the infantry of the left wing, rolled it up, and drove it in upon the centre. So tremendous was their impact that legions and cohorts were pushed together in hopeless confusion. Every attempt to stand firm failed, and in a few minutes left, centre, and reserve, were one undistinguishable mass. Imperial guards, light troops, lancers, auxiliaries, and infantry of the line were wedged together in a press that grew closer every moment.</p><p>The Roman cavalry saw that the day was lost, and rode off without another effort. Then the abandoned infantry realized the horror of their position: equally unable to deploy or to fly, they had to stand to be cut down. Men could not raise their arms to strike a blow, so closely were they packed; spears snapped right and left, their bearers being unable to lift them to a vertical position; many soldiers were stifled in the press. Into this quivering mass the Goths rode, plying lance and sword against the helpless enemy. It was not till forty thousand men had fallen that the thinning of the ranks enabled the survivors to break out and follow their cavalry in a headlong flight. They left behind them, dead on the field, the Emperor, the Grand Masters of the Infantry and Cavalry, the Count of the Palace, and thirty-five commanders of different corps.</p><p>The battle of Adrianople was the most fearful defeat suffered by a Roman army since Cannæ, a slaughter to which it is aptly compared by the contemporary historian Ammianus Marcellinus. The army of the East was almost annihilated, and was never reorganized again on the old Roman lines.</p></blockquote><p>It would be just if the Obamas and Merkels of the world met similar fates at the hands of the refugees they saved. Only six years after permitting hundreds of thousands of poor desperate refugees to cross the river and reach the safety of Roman lands, the Emperor Valens and fifty thousand of his best soldiers were dead at their hands. Seventeen years later, Alaric the Goth ruled over the north, and “wandered far and wide, from the Danube to the gates of Constantinople, and from Constantinople to Greece, ransoming or sacking every town in his way till the Goths were gorged with plunder.”</p><p>38 years after the Goths crossed the Danube, Alaric the Goth sacked Rome itself. One has to observe that it may not take 38 years this time.</p><p>And that, my dear bleeding heart moralists, is why you <i>always sink the damn ships</i>.</p></div>",
  "content_text": "Last summer, a number of normally sensible people were shocked when I said that the European governments would be wise to sink the refugee ships that were crossing the Mediterranean. Most of those people now realize that the people of Europe would be much better off if their governments had rejected the ridiculous “it is moral to help poor defenseless refugees” argument and fulfilled their responsibility to defend their national borders.\nBut my opinion is not based on any heartlessness or cruelty, it is based on knowledge of history. As it happened, I’ve been reading Charles Oman’s\nThe Byzantine Empire\n, and the following incident caught my attention, presaging as it does the current situation. You will note that last summer was not the first time refugees in peril were permitted to cross a border, and as Oman’s account suggests, it will not be the first time that the people whose governments betrayed them have paid a bitter price for that failure either.\nConsider this heart-rending account of a people in dire straits through no fault of their own, but due to the unprovoked attack of a vicious foe. Wouldn’t you be tempted to offer them refuge too?\nAbout the year a.d. 372 the Huns, an enormous Tartar horde from beyond the Don and Volga, burst into the lands north of the Euxine, and began to work their way westward. The first tribe that lay in their way, the nomadic race of the Alans, they almost exterminated. Then they fell upon the Goths. The Ostrogoths made a desperate attempt to defend the line of the Dniester against the oncoming savages—“men with faces that can hardly be called faces—rather shapeless black collops of flesh with little points instead of eyes; little in stature, but lithe and active, skilful in riding, broad shouldered, good at the bow, stiff-necked and proud, hiding under a barely human form the ferocity of the wild beast.” But the enemy whom the Gothic historian describes in these uninviting terms was too strong for the Teutons of the East. The Ostrogoths were crushed and compelled to become vassals of the Huns, save a remnant who fought their way southward to the Wallachian shore, near the marshes of the Delta of the Danube.\nThen the Huns fell on the Visigoths. The wave of invasion pressed on; the Bug and the Pruth proved no barrier to the swarms of nomad bowmen, and the Visigoths, under their Duke Fritigern, fell back in dismay with their wives and children, their waggons and flocks and herds, till they found themselves with their backs to the Danube. Surrender to the enemy was more dreadful to the Visigoths than to their eastern brethren; they were more civilized, most of them were Christians, and the prospect of slavery to savages seems to have appeared intolerable to them.\nPressed against the Danube and the Roman border, the Visigoths sent in despair to ask permission to cross from the Emperor. A contemporary writer describes how they stood. “All the multitude that had escaped from the murderous savagery of the Huns—no less than 200,000 fighting men, besides women and old men and children—-were there on the river bank, stretching out their hands with loud lamentations, and earnestly supplicating leave to cross, bewailing their calamity, and promising that they would ever faithfully adhere to the imperial alliance if only the boon was granted them.”\nWho among you would be so heartless, so cruel, as to deny hundreds of thousands of desperate women and children refuge from some of the most savage warriors ever to slaughter the innocent in the recorded history of Man? Not the Roman Emperor, although he was not unmindful of the potential for trouble, and took the necessary precautions.\nThe proposal of the Goths filled Valens with dismay. It was difficult to say which was more dangerous—to refuse a passage to 200,000 desperate men with arms in their hands and a savage foe at their backs, or to admit them within the line of river and fortress that protected the border, with an implied obligation to find land for them. After much doubting he chose the latter alternative: if the Goths would give hostages and surrender their arms, they should be ferried across the Danube and permitted to settle as subject-allies within the empire.\nIsn’t that the correct moral choice? Provide them with refuge, but disarm them so they can’t cause too much trouble? Isn’t that what you would do, being both a good, moral person and a wise, cautious individual?\nThe Goths accepted the terms, gave up the sons of their chiefs as hostages, and streamed across the river as fast as the Roman Danube-flotilla could transport them. But no sooner had they reached Moesia than troubles broke out. The Roman officials at first tried to disarm the immigrants, but the Goths were unwilling to surrender their weapons, and offered large bribes to be allowed to retain them: in strict disobedience to the Emperor’s orders, the bribes were accepted and the Goths retained their arms. Further disputes soon broke out…. Fritigern, with many of his nobles, was dining with Count Lupicinus at the town of Marcianopolis, when some starving Goths tried to pillage the market by force. A party of Roman soldiers strove to drive them off, and were at once mishandled or slain. On hearing the tumult and learning its cause, Lupicinus recklessly bade his retinue seize and slay Fritigern and the other guests at his banquet. The Goths drew their swords and cut their way out of the palace. Then riding to the nearest camp of his followers, Fritigern told his tale, and bade them take up arms against Rome.\nThere followed a year of desperate fighting all along the Danube, and the northern slope of the Balkans. The Goths half-starved for many months, and smarting under the extortion and chicanery to which they had been subjected, soon showed that the old barbarian spirit was but thinly covered by the veneer of Christianity and civilization which they had acquired in the last half-century. The struggle resolved itself into a repetition of the great raids of the third century: towns were sacked and the open country harried in the old style, nor was the war rendered less fierce by the fact that many runaway slaves and other outcasts among the provincial population joined the invaders.\nSo, instead of the Goths being slaughtered and enslaved by the Huns, the Romans were slaughtered, their towns were destroyed, and their lands were laid waste. No one could possibly have seen that coming, right? It was still the moral thing to do, because refugees, right? Just wait, it gets better, and the ending is so flawlessly fitting that it reads more like an Aesopian fable than actual history.\nIn 378 a.d., the main body of the Goths succeeded in forcing the line of the Balkans; they were not far from Adrianople when the Emperor started to attack them, with a splendid army of 60,000 men. Every one expected to hear of a victory, for the reputation of invincibility still clung to the legions, and after six hundred years of war the disciplined infantry of Rome, robur peditum, whose day had lasted since the Punic wars, were still reckoned superior, when fairly handled, to any amount of wild barbarians….\nValens found the main body of the Goths encamped in a great “laager,” on the plain north of Adrianople. After some abortive negotiations he developed an attack on their front, when suddenly a great body of horsemen charged in on the Roman flank. It was the main strength of the Gothic cavalry, which had been foraging at a distance; receiving news of the fight it had ridden straight for the battle field. Some Roman squadrons which covered the left flank of the Emperor’s army were ridden down and trampled under foot. Then the Goths swept down on the infantry of the left wing, rolled it up, and drove it in upon the centre. So tremendous was their impact that legions and cohorts were pushed together in hopeless confusion. Every attempt to stand firm failed, and in a few minutes left, centre, and reserve, were one undistinguishable mass. Imperial guards, light troops, lancers, auxiliaries, and infantry of the line were wedged together in a press that grew closer every moment.\nThe Roman cavalry saw that the day was lost, and rode off without another effort. Then the abandoned infantry realized the horror of their position: equally unable to deploy or to fly, they had to stand to be cut down. Men could not raise their arms to strike a blow, so closely were they packed; spears snapped right and left, their bearers being unable to lift them to a vertical position; many soldiers were stifled in the press. Into this quivering mass the Goths rode, plying lance and sword against the helpless enemy. It was not till forty thousand men had fallen that the thinning of the ranks enabled the survivors to break out and follow their cavalry in a headlong flight. They left behind them, dead on the field, the Emperor, the Grand Masters of the Infantry and Cavalry, the Count of the Palace, and thirty-five commanders of different corps.\nThe battle of Adrianople was the most fearful defeat suffered by a Roman army since Cannæ, a slaughter to which it is aptly compared by the contemporary historian Ammianus Marcellinus. The army of the East was almost annihilated, and was never reorganized again on the old Roman lines.\nIt would be just if the Obamas and Merkels of the world met similar fates at the hands of the refugees they saved. Only six years after permitting hundreds of thousands of poor desperate refugees to cross the river and reach the safety of Roman lands, the Emperor Valens and fifty thousand of his best soldiers were dead at their hands. Seventeen years later, Alaric the Goth ruled over the north, and “wandered far and wide, from the Danube to the gates of Constantinople, and from Constantinople to Greece, ransoming or sacking every town in his way till the Goths were gorged with plunder.”\n38 years after the Goths crossed the Danube, Alaric the Goth sacked Rome itself. One has to observe that it may not take 38 years this time.\nAnd that, my dear bleeding heart moralists, is why you\nalways sink the damn ships\n.",
  "tags": [
    "history",
    "immigration",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-03T16:00:00+00:00"
}