{
  "url": "https://voxday.net/2017/02/11/of-false-dogmas-and-founding-myths/",
  "scraped_at": "2025-12-18T07:01:25.449548",
  "title": "Of false dogmas and founding myths",
  "date_display": "February 11, 2017",
  "date_iso": "2017-02-11T22:36:00+00:00",
  "date_from_url": "2017-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now, I love and respect John Wright for many reasons. He is, among other things, a science fiction and fantasy grandmaster, and one of the three best writers of his generation. But I am in complete intellectual harmony with no man, and his civic nationalism – which I will note that other men I respect such as Mike Cernovich and Donald Trump share – is one of them. The problem is that <a href=\"http://www.scifiwright.com/2017/02/on-identity-politics/#comment-3149959333\">their civic nationalism is almost entirely based on myths and falsehoods</a>, as anyone who has done the necessary historical research already knows.</p><blockquote class=\"tr_bq\"><p> America has a dogma. America is based on the proposition that all men are created equal. Anyone learning and loving that dogma, who comes here, is a candidate for becoming an American, and, upon legal naturalization, will be as much an American as the man whose ancestors arrived on the Mayflower.</p></blockquote><p>America does have a dogma. It is, like many national founding myths, a <i>false </i>dogma. There is no more truth to the idea that America is based on the proposition that all men are created equal than there is to the idea that Rome was founded by Aeneas and the Trojan refugees. John clearly has not read <i><b><a href=\"http://amzn.to/1Wnka63\">Cuckservative</a></b></i>, or some of the relevant writings of various Founding Fathers.</p><p><i>Why should the Palatine Boors be suffered to swarm into our settlements, and by herding together establish their languages and manners to the exclusion of ours? Why should Pennsylvania, founded by the English, become a colony of Aliens, who will shortly be so numerous as to Germanize us instead of our Anglifying them, and will never adopt our language or customs, any more than they can acquire our complexion?</i><br> —Ben Franklin, <i>Observations Concerning the Increase of Mankind</i>, 1751</br></p><p>Both George Washington and Thomas Jefferson happen to disprove the romantic notion of the civic nationalists as well. They believed foreigners could assimilate, so long as there were sufficiently small numbers of them, and their blood literally intermingled with the English blood of the actual Americans in time.</p><p><i>The policy or advantage of [immigration] taking place in a body (I mean the settling of them in a body) may be much questioned; for, by so doing, they retain the language, habits, and principles (good or bad) which they bring with them. Whereas by an intermixture with our people, they, or their descendants, get assimilated to our customs, measures, and laws: in a word, soon become one people.</i><br> —George Washington, letter to John Adams, November 15, 1794</br></p><p><i>Although as to other foreigners it is thought better to discourage their settling together in large masses, wherein, as in our German settlements, they preserve for a long time their own languages, habits, and principles of government, and that they should distribute themselves sparsely among the natives for quicker amalgamation, yet English emigrants are without this inconvenience.</i><br> —Thomas Jefferson, letter to George Flower, 1817</br></p><blockquote class=\"tr_bq\"><p> The Left, in order to destroy this concept, wrote immigration laws and misinterpreted constitutional principles, to make it so that anyone with an anchor baby, or any relative, living here, could be welcomed here. This was done by enemies of American and is alien to our entire way of life.</p></blockquote><p>Now, this part is correct. But recall that the Left achieved its goals by appealing to the very founding myths to which the civic nationalists subscribe.</p><blockquote class=\"tr_bq\"><p> America is not a nation in the sense that nations in the Old World are. We are exceptional. We are a new concept.</p></blockquote><p>If America is not a nation in the sense that nations in the Old World are, then it is not a nation at all. There is absolutely nothing new about the idea of giving citizenship to small numbers of foreigners or permitting entry to immigrants in the futile hope that they will strengthen the nation without transforming it into something that it is not. And the Swiss confederation preceded the American by more than 500 years.</p><blockquote class=\"tr_bq\"><p> Why do I need to be explaining to you something we have both known since childhood? How can anyone American or not, who is aware of America, be unaware of how America works or what is the secret of our unparalleled success?</p></blockquote><p>The difference is that I understand that the national founding myth is a myth, of no more truth than George Washington’s famous cherry tree. If America’s civic nationalists were Romans, they would insist that the secret to Rome’s strength was that the blood of Trojans flowed in their veins. Immigration and equality have very little, if anything, to do with America’s success, as the previous success of the British empire should suffice to show. America was successful because it was founded by one of the most successful peoples in the history of Man, and founded on a vast and wealthy continent protected from the powers of the Old World by an ocean. Moreover, Australia has hardly been a failure; its success can certainly be described as being reasonably comparable to the USA’s, especially given its relative geographic disadvantages.</p><p>This reminds me of the very popular view among economists that the secret to the USA’s post-WWII economic growth was the massive amount of government spending during the war, forgetting the considerably more important fact that the USA was the only industrialized country whose population and infrastructure was not devastated by the war.</p><blockquote class=\"tr_bq\"><p> Now, certain loudmouths on the Alt-Right heaps contempt on all these ideas, but never says anything that actually addresses or casts honest doubt on them. Aside from the emotion of scorn, there is no argument there. It is shouting, but no words underneath the noise.</p></blockquote><p>I leave it to the reader to determine the veracity of those words. What aspect of John’s argument for civic nationalism have I failed to address? Point it out, by all means, if you can, and I shall do my humble best to amend any failures in that regard. One reason the Alt-Right’s rise is inevitable is our intellectual ruthlessness and our determination to accept even those truths that are most painful to us. We are not at war with the civic nationalists; they are not the enemies of the West. But if we are to see  the situation as clearly as possible and understand the current challenges as deeply as we can, we cannot permit ourselves to be hampered by their conceptual baggage.</p><p>If you want to get up to speed on this subject, I strongly suggest you read <b><i><a href=\"http://amzn.to/1Wnka63\">Cuckservative</a></i></b>, by John Red Eagle and me. We learned a lot in the writing of the book, so it is safe to assume you’ll learn something by reading it.</p></div>",
  "content_text": "Now, I love and respect John Wright for many reasons. He is, among other things, a science fiction and fantasy grandmaster, and one of the three best writers of his generation. But I am in complete intellectual harmony with no man, and his civic nationalism – which I will note that other men I respect such as Mike Cernovich and Donald Trump share – is one of them. The problem is that\ntheir civic nationalism is almost entirely based on myths and falsehoods\n, as anyone who has done the necessary historical research already knows.\nAmerica has a dogma. America is based on the proposition that all men are created equal. Anyone learning and loving that dogma, who comes here, is a candidate for becoming an American, and, upon legal naturalization, will be as much an American as the man whose ancestors arrived on the Mayflower.\nAmerica does have a dogma. It is, like many national founding myths, a\nfalse\ndogma. There is no more truth to the idea that America is based on the proposition that all men are created equal than there is to the idea that Rome was founded by Aeneas and the Trojan refugees. John clearly has not read\nCuckservative\n, or some of the relevant writings of various Founding Fathers.\nWhy should the Palatine Boors be suffered to swarm into our settlements, and by herding together establish their languages and manners to the exclusion of ours? Why should Pennsylvania, founded by the English, become a colony of Aliens, who will shortly be so numerous as to Germanize us instead of our Anglifying them, and will never adopt our language or customs, any more than they can acquire our complexion?\n—Ben Franklin,\nObservations Concerning the Increase of Mankind\n, 1751\nBoth George Washington and Thomas Jefferson happen to disprove the romantic notion of the civic nationalists as well. They believed foreigners could assimilate, so long as there were sufficiently small numbers of them, and their blood literally intermingled with the English blood of the actual Americans in time.\nThe policy or advantage of [immigration] taking place in a body (I mean the settling of them in a body) may be much questioned; for, by so doing, they retain the language, habits, and principles (good or bad) which they bring with them. Whereas by an intermixture with our people, they, or their descendants, get assimilated to our customs, measures, and laws: in a word, soon become one people.\n—George Washington, letter to John Adams, November 15, 1794\nAlthough as to other foreigners it is thought better to discourage their settling together in large masses, wherein, as in our German settlements, they preserve for a long time their own languages, habits, and principles of government, and that they should distribute themselves sparsely among the natives for quicker amalgamation, yet English emigrants are without this inconvenience.\n—Thomas Jefferson, letter to George Flower, 1817\nThe Left, in order to destroy this concept, wrote immigration laws and misinterpreted constitutional principles, to make it so that anyone with an anchor baby, or any relative, living here, could be welcomed here. This was done by enemies of American and is alien to our entire way of life.\nNow, this part is correct. But recall that the Left achieved its goals by appealing to the very founding myths to which the civic nationalists subscribe.\nAmerica is not a nation in the sense that nations in the Old World are. We are exceptional. We are a new concept.\nIf America is not a nation in the sense that nations in the Old World are, then it is not a nation at all. There is absolutely nothing new about the idea of giving citizenship to small numbers of foreigners or permitting entry to immigrants in the futile hope that they will strengthen the nation without transforming it into something that it is not. And the Swiss confederation preceded the American by more than 500 years.\nWhy do I need to be explaining to you something we have both known since childhood? How can anyone American or not, who is aware of America, be unaware of how America works or what is the secret of our unparalleled success?\nThe difference is that I understand that the national founding myth is a myth, of no more truth than George Washington’s famous cherry tree. If America’s civic nationalists were Romans, they would insist that the secret to Rome’s strength was that the blood of Trojans flowed in their veins. Immigration and equality have very little, if anything, to do with America’s success, as the previous success of the British empire should suffice to show. America was successful because it was founded by one of the most successful peoples in the history of Man, and founded on a vast and wealthy continent protected from the powers of the Old World by an ocean. Moreover, Australia has hardly been a failure; its success can certainly be described as being reasonably comparable to the USA’s, especially given its relative geographic disadvantages.\nThis reminds me of the very popular view among economists that the secret to the USA’s post-WWII economic growth was the massive amount of government spending during the war, forgetting the considerably more important fact that the USA was the only industrialized country whose population and infrastructure was not devastated by the war.\nNow, certain loudmouths on the Alt-Right heaps contempt on all these ideas, but never says anything that actually addresses or casts honest doubt on them. Aside from the emotion of scorn, there is no argument there. It is shouting, but no words underneath the noise.\nI leave it to the reader to determine the veracity of those words. What aspect of John’s argument for civic nationalism have I failed to address? Point it out, by all means, if you can, and I shall do my humble best to amend any failures in that regard. One reason the Alt-Right’s rise is inevitable is our intellectual ruthlessness and our determination to accept even those truths that are most painful to us. We are not at war with the civic nationalists; they are not the enemies of the West. But if we are to see  the situation as clearly as possible and understand the current challenges as deeply as we can, we cannot permit ourselves to be hampered by their conceptual baggage.\nIf you want to get up to speed on this subject, I strongly suggest you read\nCuckservative\n, by John Red Eagle and me. We learned a lot in the writing of the book, so it is safe to assume you’ll learn something by reading it.",
  "tags": [
    "debate",
    "history",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-11T22:36:00+00:00"
}