{
  "url": "https://voxday.net/2017/02/20/pedophile-projection/",
  "scraped_at": "2025-12-18T07:02:48.567539",
  "title": "Pedophile projection",
  "date_display": "February 20, 2017",
  "date_iso": "2017-02-20T17:56:00+00:00",
  "date_from_url": "2017-02-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears some of the Pizzagate pedos are trying to run a disqualify-and-discredit game on Milo by claiming that he is one of them. Notice all the weasel words and unfounded assertions with which they are surrounding their accusatory non-accusations:</p><ul><li>Milo Yiannopoulos appears to speak fondly of pedophilia in video</li><li>Alt-Right Creep Milo Under Fire For Seemingly Defending Pedophilia</li><li>CPAC Blasted for Milo Invite Following Pedophilia Remarks</li><li>CPAC under pressure to cancel Milo speech after pedophilia defense.</li></ul><p><i>Appears. Seemingly. Remarks. </i>Now, I am entirely confident that Milo will absolutely welcome a serious investigation into pedophilia in the media and in the inner circles of power. But will those now affecting to criticize him? Unlike the former Speaker of the House, Dennis Hastert, Milo has openly criticized pedophiles. He has publicly said – in the very video where he was supposedly “defending pedophilia” – said that the age of consent of 16 is “about right”.</p><p><a href=\"https://www.facebook.com/myiannopoulos/posts/851263248344905\">Milo’s direct statement </a>could not possibly be more clear on the subject. Unlike Salon and anti-GG, he has never defended pedophiles. Quite the contrary, as a matter of fact.</p><blockquote><p> I do not support pedophilia. Period. It is a vile and disgusting crime, perhaps the very worst….</p><p>I have outed THREE pedophiles in my career as a journalist. That’s three more than any of my critics and a peculiar strategy for a supposed pedophile apologist.<br/></p><div> (a) <a href=\"http://kernelmag.dailydot.com/%E2%80%A6/%E2%80%A6/3746/luke-bozier-arrested/\">Luke Bozier</a>, former business partner of Louise Mensch </div><div> (b) <a href=\"http://www.breitbart.com/%E2%80%A6/leading-gamergate-critic-sarah-%E2%80%A6/\">Nicholas Nyberg</a>, anti-GamerGate activist who self-described as a pedophile and white nationalist </div><div> (c) <a href=\"http://www.breitbart.com/%E2%80%A6/tech-city-darling-chris-leydon-%E2%80%A6/\">Chris Leydon</a>, a London photographer who has a rape trial starting March 13 thanks to my reporting.<p>I have never defended and would never defend child abusers, as my reporting history shows. The world is messy and complicated, and I recognize it as such, as this furore demonstrates. But that is a red line for any decent person.</p></div></blockquote><p>I don’t know if it is primarily Never-Trumpers who are enraged by the news of the CPAC invite or Pizzagaters who are attempting to discredit another high-profile figure who aware of them, but either way, it is obvious that this is a media hit campaign similar to those we’ve seen before in #GamerGate. UPDATE: it’s apparently the latter. The Never-Trumpers are just jumping on board.</p><p>Strange, is it not, that the media is suddenly willing to pay so much attention to a single non-defense of pedophilia while it continues to ignore all of the smoke that is billowing from Hillary Clinton’s circle, including Anthony Weiner, the Podesta brothers, David Brock, and other shady figures? Remember, they created “fake news” specifically in order to avoid having to address Pizzagate.</p><p>I absolutely agree that pedophilia is evil and I will go further in saying that it has absolutely no mitigating elements whatsoever. And that is precisely why every media organization should be delving deeply into Pizzagate. Milo is no more a pedo than the crisis actor who “attacked” Comet Pizza was a genuine right-wing religious nut.</p><p>UPDATE: CPAC <a href=\"http://www.mediaite.com/online/breaking-milo-yiannapolous-disinvited-from-cpac/\">cuts and runs</a>.</p><blockquote class=\"tr_bq\"><p> According to Townhall editor and frequent Fox News contributor Guy Benson, controversial Breitbart editor Milo Yiannopoulos has been disinvited from speaking at the upcoming Conservative Political Action Conference (CPAC) in DC, a report that was quickly confirmed by the ACU Chair.</p></blockquote><p>And that’s why you never, <i>ever</i>, rely upon moderates or conservatives. They will NEVER have your back when the Left starts shooting at you.</p><p>UPDATE: In his Periscope, Mike Cernovich predicted that they’d be putting pressure on Breitbart to eject Milo next. The irony is that some of the pressure is coming from Salon, which actually has defended pedophiles, as has National Review.</p></div>",
  "content_text": "It appears some of the Pizzagate pedos are trying to run a disqualify-and-discredit game on Milo by claiming that he is one of them. Notice all the weasel words and unfounded assertions with which they are surrounding their accusatory non-accusations:\nMilo Yiannopoulos appears to speak fondly of pedophilia in video\nAlt-Right Creep Milo Under Fire For Seemingly Defending Pedophilia\nCPAC Blasted for Milo Invite Following Pedophilia Remarks\nCPAC under pressure to cancel Milo speech after pedophilia defense.\nAppears. Seemingly. Remarks.\nNow, I am entirely confident that Milo will absolutely welcome a serious investigation into pedophilia in the media and in the inner circles of power. But will those now affecting to criticize him? Unlike the former Speaker of the House, Dennis Hastert, Milo has openly criticized pedophiles. He has publicly said – in the very video where he was supposedly “defending pedophilia” – said that the age of consent of 16 is “about right”.\nMilo’s direct statement\ncould not possibly be more clear on the subject. Unlike Salon and anti-GG, he has never defended pedophiles. Quite the contrary, as a matter of fact.\nI do not support pedophilia. Period. It is a vile and disgusting crime, perhaps the very worst….\nI have outed THREE pedophiles in my career as a journalist. That’s three more than any of my critics and a peculiar strategy for a supposed pedophile apologist.\n(a)\nLuke Bozier\n, former business partner of Louise Mensch\n(b)\nNicholas Nyberg\n, anti-GamerGate activist who self-described as a pedophile and white nationalist\n(c)\nChris Leydon\n, a London photographer who has a rape trial starting March 13 thanks to my reporting.\nI have never defended and would never defend child abusers, as my reporting history shows. The world is messy and complicated, and I recognize it as such, as this furore demonstrates. But that is a red line for any decent person.\nI don’t know if it is primarily Never-Trumpers who are enraged by the news of the CPAC invite or Pizzagaters who are attempting to discredit another high-profile figure who aware of them, but either way, it is obvious that this is a media hit campaign similar to those we’ve seen before in #GamerGate. UPDATE: it’s apparently the latter. The Never-Trumpers are just jumping on board.\nStrange, is it not, that the media is suddenly willing to pay so much attention to a single non-defense of pedophilia while it continues to ignore all of the smoke that is billowing from Hillary Clinton’s circle, including Anthony Weiner, the Podesta brothers, David Brock, and other shady figures? Remember, they created “fake news” specifically in order to avoid having to address Pizzagate.\nI absolutely agree that pedophilia is evil and I will go further in saying that it has absolutely no mitigating elements whatsoever. And that is precisely why every media organization should be delving deeply into Pizzagate. Milo is no more a pedo than the crisis actor who “attacked” Comet Pizza was a genuine right-wing religious nut.\nUPDATE: CPAC\ncuts and runs\n.\nAccording to Townhall editor and frequent Fox News contributor Guy Benson, controversial Breitbart editor Milo Yiannopoulos has been disinvited from speaking at the upcoming Conservative Political Action Conference (CPAC) in DC, a report that was quickly confirmed by the ACU Chair.\nAnd that’s why you never,\never\n, rely upon moderates or conservatives. They will NEVER have your back when the Left starts shooting at you.\nUPDATE: In his Periscope, Mike Cernovich predicted that they’d be putting pressure on Breitbart to eject Milo next. The irony is that some of the pressure is coming from Salon, which actually has defended pedophiles, as has National Review.",
  "tags": [
    "conspiracy",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-20T17:56:00+00:00"
}