{
  "url": "https://voxday.net/2017/02/06/rumors-from-chans/",
  "scraped_at": "2025-12-18T07:00:34.535134",
  "title": "Rumors from the chans",
  "date_display": "February 6, 2017",
  "date_iso": "2017-02-06T15:35:00+00:00",
  "date_from_url": "2017-02-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Pizzagate prediction was <a href=\"https://i.imgur.com/xCoJK7K.jpg\">made last Thursday</a>:</p><blockquote><p> Information was finally submitted from the FBI to the DOJ today at 3PM. Mr. Sessions was briefed 3 weeks ago as to the investigation in its entirety. Once he assumes his position, arrest warrants will be signed and arrests will be made. This is also why the Democratic Party in DC has been fighting the Sessions vote. Panic.</p><p>Furthermore, starting Monday or Tuesday of next week, you will begin to start seeing arrests of individuals. Over 30 politicians and over 40 other individuals throughout DC, VA, and also a handful in NYC. Some may off themselves before they are apprehended, so keep an eye out for that over the weekend and you will know they are involved in some manner.</p></blockquote><p>I’d have ignored it, but Glenn Beck also made some noises about some recent arrests already being made. Sessions hasn’t been confirmed yet, and isn’t expected to be confirmed until later this week, <a href=\"http://edition.cnn.com/2017/02/06/politics/devos-session-senate-vote-tuesday/\">after he votes on DeVos’s confirmation</a>, so that may push the predicted timeline back a little. Could be fake news, of course, as this isn’t the first time we’ve heard some sort of action is imminent. Regardless, we should know within another 7 to 10 days if this source is credible or not.</p><p>UPDATE: This may or may not be related, but it certainly sounds a little more credible <a href=\"http://ktla.com/2017/02/01/474-arrested-28-sexually-exploited-children-rescued-during-statewide-human-trafficking-operation-lasd/\">in light of the 474 arrests</a> that were reported to have been made in California last week.<br/></p><blockquote><p> Hundreds of people were arrested and dozens of sexually exploited children and adult victims were rescued across California during a statewide operation to combat human trafficking, the Los Angeles County Sheriff’s Department announced Tuesday.</p><p>More than 30 federal, state and local law enforcement agencies and task forces, including the Los Angeles Regional Human Trafficking Task Force, participated in the third annual “Operation Reclaim and Rebuild” enforcement operation, according to a sheriff’s news release.</p><p>The statewide operation took place over the three-day period between last Thursday and Saturday.</p><p>In total, 474 arrests were made, including 142 males on solicitation charges, and 36 males on suspicion of pimping, according to figures provided by the Sheriff’s Department.</p></blockquote></div>",
  "content_text": "A Pizzagate prediction was\nmade last Thursday\n:\nInformation was finally submitted from the FBI to the DOJ today at 3PM. Mr. Sessions was briefed 3 weeks ago as to the investigation in its entirety. Once he assumes his position, arrest warrants will be signed and arrests will be made. This is also why the Democratic Party in DC has been fighting the Sessions vote. Panic.\nFurthermore, starting Monday or Tuesday of next week, you will begin to start seeing arrests of individuals. Over 30 politicians and over 40 other individuals throughout DC, VA, and also a handful in NYC. Some may off themselves before they are apprehended, so keep an eye out for that over the weekend and you will know they are involved in some manner.\nI’d have ignored it, but Glenn Beck also made some noises about some recent arrests already being made. Sessions hasn’t been confirmed yet, and isn’t expected to be confirmed until later this week,\nafter he votes on DeVos’s confirmation\n, so that may push the predicted timeline back a little. Could be fake news, of course, as this isn’t the first time we’ve heard some sort of action is imminent. Regardless, we should know within another 7 to 10 days if this source is credible or not.\nUPDATE: This may or may not be related, but it certainly sounds a little more credible\nin light of the 474 arrests\nthat were reported to have been made in California last week.\nHundreds of people were arrested and dozens of sexually exploited children and adult victims were rescued across California during a statewide operation to combat human trafficking, the Los Angeles County Sheriff’s Department announced Tuesday.\nMore than 30 federal, state and local law enforcement agencies and task forces, including the Los Angeles Regional Human Trafficking Task Force, participated in the third annual “Operation Reclaim and Rebuild” enforcement operation, according to a sheriff’s news release.\nThe statewide operation took place over the three-day period between last Thursday and Saturday.\nIn total, 474 arrests were made, including 142 males on solicitation charges, and 36 males on suspicion of pimping, according to figures provided by the Sheriff’s Department.",
  "tags": [
    "conspiracy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-06T15:35:00+00:00"
}