{
  "url": "https://voxday.net/2017/02/04/the-winning-spreads/",
  "scraped_at": "2025-12-18T07:00:16.946767",
  "title": "The winning spreads",
  "date_display": "February 4, 2017",
  "date_iso": "2017-02-04T20:11:00+00:00",
  "date_from_url": "2017-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Argentina <a href=\"https://archive.is/aTaGD\">follows the God-Emperor’s lead</a> in restricting immigration and preparing for repatriations</p><blockquote><p> Argentina is so used to celebrating immigration as a cornerstone of society that a 19th-century saying — to govern is to populate — remains in use to this day. But in an abrupt shift coinciding with the immigration restrictions put in place by the Trump administration, President Mauricio Macri has issued a decree curbing immigration to Argentina, with his government declaring that newcomers from poorer countries in Latin America bring crime.</p><p>The measures announced by Mr. Macri in recent days made it much easier to deport immigrants and restrict their entry, prompting irate comparisons to President Trump and igniting a fierce debate over immigration.</p><p>“A decree like this scares people,” said Arfang Diedhiou, 33, a Senegalese immigrant who runs his own clothing store here in the capital, Buenos Aires. “It came out just after what Trump did, a coincidence that seems very strange to me.”</p><p>Argentina’s president, the son of an immigrant, has echoed some of Mr. Trump’s “America First” theme, making it clear that his “first concern” should be “caring for Argentines, caring for ourselves. We cannot continue to allow criminals to keep choosing Argentina as a place to commit offenses,” Mr. Macri said during a news conference…. But opinion polls in Argentina showed widespread support for limiting immigration, and some say the new decree does not go far enough.</p></blockquote><p>Meanwhile, wormtongue David Brooks <a href=\"https://archive.is/PNOHZ\">mourns for the lost greatness of a nonexistent “nation”</a> while declaring that the real America is Russian. Or German. Or Nazi. Whatever it is, he doesn’t like it.</p><blockquote><p> That American myth was embraced and lived out by everybody from Washington to Lincoln to Roosevelt to Reagan. It was wrestled with by John Winthrop and Walt Whitman. It gave America a mission in the world — to spread democracy and freedom. It gave us an attitude of welcome and graciousness, to embrace the huddled masses yearning to breathe free and to give them the scope by which to realize their powers.</p><p>But now the myth has been battered. It’s been bruised by an educational system that doesn’t teach civilizational history or real American history but instead a shapeless multiculturalism. It’s been bruised by an intellectual culture that can’t imagine providence. It’s been bruised by people on the left who are uncomfortable with patriotism and people on the right who are uncomfortable with the federal government that is necessary to lead our project.</p><p>The myth has been bruised, too, by the humiliations of Iraq and the financial crisis. By a cultural elite that ignored the plight of the working class and thus broke faith with the basic solidarity that binds a nation.</p><p>And so along come men like Donald Trump and Stephen Bannon with a countermyth. Their myth is an alien myth, frankly a Russian myth. It holds, as Russian reactionaries hold, that deep in the heartland are the pure folk who embody the pure soul of the country — who endure the suffering and make the bread. But the pure peasant soul is threatened. It is threatened by the cosmopolitan elites and by the corruption of foreign influence.</p><p>The true American myth is dynamic and universal — embracing strangers and seizing possibilities. The Russian myth that Trump and Bannon have injected into the national bloodstream is static and insular. It is about building walls, staying put. Their country is bound by its nostalgia, not its common future.</p><p>The odd thing is that the Trump-Bannon myth is winning. The policies that emanate from it are surprisingly popular. The refugee ban has a lot of support. Closing off trade is popular. Building the wall is a winning issue.</p></blockquote><p>There is nothing odd about it, because there is nothing mythical about it. David Brooks is, to put it mildly, a total fucking liar. A Russian myth? WTF? He sounds like a lunatic Jew who has read <i>The Melting Pot</i> too many times and is now terrified of Tsars and Cossacks and pogroms. Who listens to these morons? How did anyone ever take these wormtongues seriously?</p><p>As I said in my debate with Jack Murphy last night, the Proposition Nation is total bullshit. It’s utterly false. There is absolutely NOTHING truthful about it. And all you need to know that is to listen to its lunatic proponents try to defend it, usually by waxing lyrical with feeble rhetoric that wouldn’t convince a brain-damaged chimpanzee.</p><p>Brooks sounds as if he’s ready to fight with his Muslim brothers against Old America.</p><blockquote class=\"tr_bq\"><p> We are in the midst of a great war of national identity. We thought we were in an ideological battle against radical Islam, but we are really fighting the national myths spread by Trump, Bannon, Putin, Le Pen and Farage.</p></blockquote><p>There is no “we”, David. You are not American. You are not Russian. You are not French. You are not British. You are not us.</p></div>",
  "content_text": "Argentina\nfollows the God-Emperor’s lead\nin restricting immigration and preparing for repatriations\nArgentina is so used to celebrating immigration as a cornerstone of society that a 19th-century saying — to govern is to populate — remains in use to this day. But in an abrupt shift coinciding with the immigration restrictions put in place by the Trump administration, President Mauricio Macri has issued a decree curbing immigration to Argentina, with his government declaring that newcomers from poorer countries in Latin America bring crime.\nThe measures announced by Mr. Macri in recent days made it much easier to deport immigrants and restrict their entry, prompting irate comparisons to President Trump and igniting a fierce debate over immigration.\n“A decree like this scares people,” said Arfang Diedhiou, 33, a Senegalese immigrant who runs his own clothing store here in the capital, Buenos Aires. “It came out just after what Trump did, a coincidence that seems very strange to me.”\nArgentina’s president, the son of an immigrant, has echoed some of Mr. Trump’s “America First” theme, making it clear that his “first concern” should be “caring for Argentines, caring for ourselves. We cannot continue to allow criminals to keep choosing Argentina as a place to commit offenses,” Mr. Macri said during a news conference…. But opinion polls in Argentina showed widespread support for limiting immigration, and some say the new decree does not go far enough.\nMeanwhile, wormtongue David Brooks\nmourns for the lost greatness of a nonexistent “nation”\nwhile declaring that the real America is Russian. Or German. Or Nazi. Whatever it is, he doesn’t like it.\nThat American myth was embraced and lived out by everybody from Washington to Lincoln to Roosevelt to Reagan. It was wrestled with by John Winthrop and Walt Whitman. It gave America a mission in the world — to spread democracy and freedom. It gave us an attitude of welcome and graciousness, to embrace the huddled masses yearning to breathe free and to give them the scope by which to realize their powers.\nBut now the myth has been battered. It’s been bruised by an educational system that doesn’t teach civilizational history or real American history but instead a shapeless multiculturalism. It’s been bruised by an intellectual culture that can’t imagine providence. It’s been bruised by people on the left who are uncomfortable with patriotism and people on the right who are uncomfortable with the federal government that is necessary to lead our project.\nThe myth has been bruised, too, by the humiliations of Iraq and the financial crisis. By a cultural elite that ignored the plight of the working class and thus broke faith with the basic solidarity that binds a nation.\nAnd so along come men like Donald Trump and Stephen Bannon with a countermyth. Their myth is an alien myth, frankly a Russian myth. It holds, as Russian reactionaries hold, that deep in the heartland are the pure folk who embody the pure soul of the country — who endure the suffering and make the bread. But the pure peasant soul is threatened. It is threatened by the cosmopolitan elites and by the corruption of foreign influence.\nThe true American myth is dynamic and universal — embracing strangers and seizing possibilities. The Russian myth that Trump and Bannon have injected into the national bloodstream is static and insular. It is about building walls, staying put. Their country is bound by its nostalgia, not its common future.\nThe odd thing is that the Trump-Bannon myth is winning. The policies that emanate from it are surprisingly popular. The refugee ban has a lot of support. Closing off trade is popular. Building the wall is a winning issue.\nThere is nothing odd about it, because there is nothing mythical about it. David Brooks is, to put it mildly, a total fucking liar. A Russian myth? WTF? He sounds like a lunatic Jew who has read\nThe Melting Pot\ntoo many times and is now terrified of Tsars and Cossacks and pogroms. Who listens to these morons? How did anyone ever take these wormtongues seriously?\nAs I said in my debate with Jack Murphy last night, the Proposition Nation is total bullshit. It’s utterly false. There is absolutely NOTHING truthful about it. And all you need to know that is to listen to its lunatic proponents try to defend it, usually by waxing lyrical with feeble rhetoric that wouldn’t convince a brain-damaged chimpanzee.\nBrooks sounds as if he’s ready to fight with his Muslim brothers against Old America.\nWe are in the midst of a great war of national identity. We thought we were in an ideological battle against radical Islam, but we are really fighting the national myths spread by Trump, Bannon, Putin, Le Pen and Farage.\nThere is no “we”, David. You are not American. You are not Russian. You are not French. You are not British. You are not us.",
  "tags": [
    "cuckservative",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-04T20:11:00+00:00"
}