{
  "url": "https://voxday.net/2017/02/10/the-end-of-dual-citizenship/",
  "scraped_at": "2025-12-18T07:01:13.011915",
  "title": "The end of dual-citizenship",
  "date_display": "February 10, 2017",
  "date_iso": "2017-02-10T16:00:00+00:00",
  "date_from_url": "2017-02-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"tr_bq\"> A man cannot serve two masters. Jesus Christ knew it. <a href=\"http://www.dailymail.co.uk/news/article-4211324/Le-Pen-French-Jews-renounce-Israeli-citizenship.html\">So does Marine Le Pen</a>:</div><blockquote><p> French Jews who have dual Israeli nationality will have to give up one of their nationalities if far-right candidate Marine Le Pen is elected. The Front National leader said she would not allow citizens to hold dual citizenship in two non-European countries.<br> She will, however, not include Russia in the policy, stating she considers it to be part of the ‘Europe of nations’. Speaking on France 2 TV, she said immigrants, and those who hold two passports, would have to surrender one of their passports – but added that this would not mean they would be deported.</br></p></blockquote><p>Good for France. The USA and every other Western nation should institute a similar policy. Saudis and Israelis and Nigerians are no more Americans than they are Chinese or Martian. “Dual-citizenship” is a nonsensical postmodern concept that is every bit as incoherent as “gay marriage” and “sex as social construct”</p><p>After all, it’s not much of a “proposition” if you don’t even have to give up your previous national proposition. But I think it is a mistake to permit ANY dual-citizenship at all.</p></div>",
  "content_text": "A man cannot serve two masters. Jesus Christ knew it.\nSo does Marine Le Pen\n:\nFrench Jews who have dual Israeli nationality will have to give up one of their nationalities if far-right candidate Marine Le Pen is elected. The Front National leader said she would not allow citizens to hold dual citizenship in two non-European countries.\nShe will, however, not include Russia in the policy, stating she considers it to be part of the ‘Europe of nations’. Speaking on France 2 TV, she said immigrants, and those who hold two passports, would have to surrender one of their passports – but added that this would not mean they would be deported.\nGood for France. The USA and every other Western nation should institute a similar policy. Saudis and Israelis and Nigerians are no more Americans than they are Chinese or Martian. “Dual-citizenship” is a nonsensical postmodern concept that is every bit as incoherent as “gay marriage” and “sex as social construct”\nAfter all, it’s not much of a “proposition” if you don’t even have to give up your previous national proposition. But I think it is a mistake to permit ANY dual-citizenship at all.",
  "tags": [
    "#AltRight",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-10T16:00:00+00:00"
}