{
  "url": "https://voxday.net/2017/02/22/the-path-of-tru/",
  "scraped_at": "2025-12-18T07:03:06.199649",
  "title": "The path of truth",
  "date_display": "February 22, 2017",
  "date_iso": "2017-02-22T13:00:00+00:00",
  "date_from_url": "2017-02-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An observation on Gab</p><blockquote class=\"tr_bq\"><p> voxday is fiercely loyal to people. But there is something else. He has an almost uncanny ability to sense who is seeking the path of righteousness, even if it is not superficially apparent from their behavior. Roosh has taken a far more spiritual path of late. Milo clearly wants to change.<br> <a href=\"https://gab.ai/SamuelNock/posts/5443242\">Samuel Nock</a></br></p></blockquote><p>There is really nothing uncanny about it. Most people tend to look at others where they were, and judge them by things they have done in the past, even in the distant past. That is why the Left constantly digs through long-forgotten personal histories in seeking to discredit people; to them, you will forever be whatever the worst interpretation of the worst thing you have ever done or said is. That this is patently absurd, of course, is irrelevant to them. They care nothing for the truth, they only seek to destroy. They are little satans, accusers in service to the Great Accuser.</p><p>But they are not alone. Petty people always insist on trying to force people into the box of their past. They cannot conceive of change, of personal growth, or personal improvement, and they hate it when others make them feel as if their understanding of the world is incorrect. They will never stop trying to remind even the most successful, most transformed individual of his less impressive past.</p><p>Fewer people look at others where they are. And fewer still look at the trend line formed by what a man was to who he is now, thereby providing a glimpse of what he may one day become. The man I am today is very different than the arrogant young man with a record contract whose primary interests were girls, music, and video games. The writer I am today is very different than the author of <i>Rebel Moon</i> and the generic, obvious-twist-at-the-end short story that was rejected by <i>Asimov’s Science Fiction Magazine</i>.</p><p>The individuals I appreciate most are those who seek after the truth, even when they find it uncomfortable or personally distasteful. I am far more comfortable with the seekers than with those who are convinced that they have arrived at the final one true understanding of God, Man, the universe, and everything, whether it is the Catholic Church, the Bible, or Science that provides them with the basis for their baseless confidence.</p><p>I prefer those who know they see as though through a glass, darkly, probably because they are the only people who are not hopelessly self-deluded who also possess the courage to reject the despair of the nihilist.</p><p>Not everyone who walks the hard and narrow path of truth is, or will become, a Christian, but it is a path that eventually leads to Jesus Christ all the same.</p></div>",
  "content_text": "An observation on Gab\nvoxday is fiercely loyal to people. But there is something else. He has an almost uncanny ability to sense who is seeking the path of righteousness, even if it is not superficially apparent from their behavior. Roosh has taken a far more spiritual path of late. Milo clearly wants to change.\nSamuel Nock\nThere is really nothing uncanny about it. Most people tend to look at others where they were, and judge them by things they have done in the past, even in the distant past. That is why the Left constantly digs through long-forgotten personal histories in seeking to discredit people; to them, you will forever be whatever the worst interpretation of the worst thing you have ever done or said is. That this is patently absurd, of course, is irrelevant to them. They care nothing for the truth, they only seek to destroy. They are little satans, accusers in service to the Great Accuser.\nBut they are not alone. Petty people always insist on trying to force people into the box of their past. They cannot conceive of change, of personal growth, or personal improvement, and they hate it when others make them feel as if their understanding of the world is incorrect. They will never stop trying to remind even the most successful, most transformed individual of his less impressive past.\nFewer people look at others where they are. And fewer still look at the trend line formed by what a man was to who he is now, thereby providing a glimpse of what he may one day become. The man I am today is very different than the arrogant young man with a record contract whose primary interests were girls, music, and video games. The writer I am today is very different than the author of\nRebel Moon\nand the generic, obvious-twist-at-the-end short story that was rejected by\nAsimov’s Science Fiction Magazine\n.\nThe individuals I appreciate most are those who seek after the truth, even when they find it uncomfortable or personally distasteful. I am far more comfortable with the seekers than with those who are convinced that they have arrived at the final one true understanding of God, Man, the universe, and everything, whether it is the Catholic Church, the Bible, or Science that provides them with the basis for their baseless confidence.\nI prefer those who know they see as though through a glass, darkly, probably because they are the only people who are not hopelessly self-deluded who also possess the courage to reject the despair of the nihilist.\nNot everyone who walks the hard and narrow path of truth is, or will become, a Christian, but it is a path that eventually leads to Jesus Christ all the same.",
  "tags": [
    "Christianity",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-22T13:00:00+00:00"
}