{
  "url": "https://voxday.net/2017/02/22/the-threat-to-free-speec/",
  "scraped_at": "2025-12-18T07:03:04.392250",
  "title": "The threat to free speech",
  "date_display": "February 22, 2017",
  "date_iso": "2017-02-22T09:44:00+00:00",
  "date_from_url": "2017-02-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While Milogate has dominated the news, the flamboyant ex-Breitbart editor is far from the only observer concerned about the future of free speech across the West. Military historian and Castalia House author Martin van Creveld <a href=\"http://www.martin-van-creveld.com/why-i-blog/\">has observed as much as well</a>:</p><blockquote><p> Freedom of speech is in trouble—and the only ones who do not know it are those who will soon find out. The idea of free speech is a recent one. It first emerged during the eighteenth century when Voltaire, the great French writer, said that while he might not agree with someone’s ideas he would fight to the utmost to protect that person’s right to express them. Like Assange and Snowden Voltaire paid the penalty, spending time in jail for his pains. Later, to prevent a recurrence, he went to live at Frenay, just a few hundred yards from Geneva. There he had a team or horses ready to carry him across the border should the need arise. Good for him.</p><p>To return to modern times, this is not the place to trace the stages by which freedom of speech was hemmed in in any detail. Looking back, it all started during the second half of the 1960s when it was forbidden to say, or think, or believe, that first blacks, then women, then gays, then transgender people, might in some ways be different from others. As time went on this prohibition came to be known as political correctness. Like an inkstain it spread, covering more and more domains and polluting them. This has now been carried to the point where anything that may offend anyone in some way is banned—with the result that, as Alan Bloom in <i>The Closing of the American Mind</i> has shown, in many fields it has become almost impossible to say anything at all.</p><p>Let me give you just one example of what I mean. Years ago, at my alma mater in Jerusalem, I taught a course on military history. The class consisted of foreign, mostly American, students. At one point I used the germ Gook. No sooner had the word left my mouth than a student rose and, accused me of racism. I did my best to explain that, by deliberately using the term, I did not mean to imply that, in my view, the Vietnamese were in any way inferior. To the contrary, I meant to express my admiration for them for having defeated the Americans who did think so. To no avail, of course.</p><p>And so it goes. When the Internet first appeared on the scene I, along with a great many other people, assumed that any attempt to limit freedom of speech had now been definitely defeated. Instead, the opposite is beginning to happen. Techniques such as “data mining” made their appearance, allowing anything anyone said about anything to be instantly monitored and recorded, forever. All over Europe, the thought police is in the process of being established. Sometimes it is corporations such as Facebook which, on pain of government intervention, are told to “clean up” their act by suppressing all kinds of speech or, at the very least, marking it as “offensive,” “untrue,” and “fake.” In others it is the governments themselves that take the bit between their teeth.</p></blockquote><p>When people as diverse as Roosh, Milo, and MvC are speaking out about the danger to free speech, you can be certain that it is a <i>serious </i>problem. And, of course, this threat is only one aspect of the larger, existential threat to Western civilization itself.</p><p>On a related note, <a href=\"https://i.imgur.com/vn6LVD1.png\">a visual guide</a> to how social justice warriors coopt organizations and communities.</p></div>",
  "content_text": "While Milogate has dominated the news, the flamboyant ex-Breitbart editor is far from the only observer concerned about the future of free speech across the West. Military historian and Castalia House author Martin van Creveld\nhas observed as much as well\n:\nFreedom of speech is in trouble—and the only ones who do not know it are those who will soon find out. The idea of free speech is a recent one. It first emerged during the eighteenth century when Voltaire, the great French writer, said that while he might not agree with someone’s ideas he would fight to the utmost to protect that person’s right to express them. Like Assange and Snowden Voltaire paid the penalty, spending time in jail for his pains. Later, to prevent a recurrence, he went to live at Frenay, just a few hundred yards from Geneva. There he had a team or horses ready to carry him across the border should the need arise. Good for him.\nTo return to modern times, this is not the place to trace the stages by which freedom of speech was hemmed in in any detail. Looking back, it all started during the second half of the 1960s when it was forbidden to say, or think, or believe, that first blacks, then women, then gays, then transgender people, might in some ways be different from others. As time went on this prohibition came to be known as political correctness. Like an inkstain it spread, covering more and more domains and polluting them. This has now been carried to the point where anything that may offend anyone in some way is banned—with the result that, as Alan Bloom in\nThe Closing of the American Mind\nhas shown, in many fields it has become almost impossible to say anything at all.\nLet me give you just one example of what I mean. Years ago, at my alma mater in Jerusalem, I taught a course on military history. The class consisted of foreign, mostly American, students. At one point I used the germ Gook. No sooner had the word left my mouth than a student rose and, accused me of racism. I did my best to explain that, by deliberately using the term, I did not mean to imply that, in my view, the Vietnamese were in any way inferior. To the contrary, I meant to express my admiration for them for having defeated the Americans who did think so. To no avail, of course.\nAnd so it goes. When the Internet first appeared on the scene I, along with a great many other people, assumed that any attempt to limit freedom of speech had now been definitely defeated. Instead, the opposite is beginning to happen. Techniques such as “data mining” made their appearance, allowing anything anyone said about anything to be instantly monitored and recorded, forever. All over Europe, the thought police is in the process of being established. Sometimes it is corporations such as Facebook which, on pain of government intervention, are told to “clean up” their act by suppressing all kinds of speech or, at the very least, marking it as “offensive,” “untrue,” and “fake.” In others it is the governments themselves that take the bit between their teeth.\nWhen people as diverse as Roosh, Milo, and MvC are speaking out about the danger to free speech, you can be certain that it is a\nserious\nproblem. And, of course, this threat is only one aspect of the larger, existential threat to Western civilization itself.\nOn a related note,\na visual guide\nto how social justice warriors coopt organizations and communities.",
  "tags": [
    "decline and fall",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-22T09:44:00+00:00"
}