{
  "url": "https://voxday.net/2017/02/02/the-cucking-intensifies/",
  "scraped_at": "2025-12-18T06:59:57.194053",
  "title": "The cucking intensifies",
  "date_display": "February 2, 2017",
  "date_iso": "2017-02-02T16:00:00+00:00",
  "date_from_url": "2017-02-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rod Dreher does not disappoint as <a href=\"https://archive.is/30uBB\">he wrings his hands</a> over the God-Emperor’s surprisingly restrained rule:</p><blockquote><p> The astonishing audacity and recklessness with which Trump has begun his presidency is a bad sign. For me, it is not so much what he has done (though I do object to some of it) as it is the reckless manner in which he has done it. As every well-raised Southern child knows, manners express morality. Yes, manners are artificial, but they embody a social code that governs the conduct of people who live under it. True, it is always better to do the right thing than to work unrighteousness under the cover of minding one’s manners. But as Brooks points out, there’s something crude and vicious about the way Trump goes out of his way to provoke, to rub the noses of his opponents in the exercise of his power. In Trump’s case, manners express the man.</p><p>In other words, we know what kind of president Trump is going to be by the way he has carried out his executive actions so far. He does not consider himself bound by law or custom. He is a law unto himself. That doesn’t make him wrong about everything, but it does serve as fair warning to Republicans and conservatives, both on Capitol Hill and out in the country: sooner or later, he’s going to make us take sides. In the moment of testing, you will only be able to make the right call then if you have prepared your conscience, and exercised it by being more faithful to the Truth than to your president.</p></blockquote><p>Demonstrating, as always, that for the moderate, it’s not what you do, it’s the genteel manner with which you do it.</p><p>Moderate: Okay, gentlemen… take 5 paces, then turn and shoot. SJW has won the coin toss and will shoot first. Understood?<br> Conservative: Yes.<br> SJW: Whatever.<br> Moderate: One…<br> SJW: turns and points pistol, hand trembling in terror<br> Moderate: looks at SJW scornfully Two…<br> SJW: CHECK YOUR PRIVILEGE! <i>shoots in Conservative’s general direction… misses horribly</i><br> Conservative: What the deuce? <i>turns around</i> You bastard!<br> SJW: How dare you turn around! You’re not a gentleman!<br> Moderate: Conservative! You must take three more paces before you may turn around!<br> Conservative: That coward shot at me after two!<br> Moderate: Do not lower yourself to his level! Death before dishonor!<br> Conservative: That doesn’t mean what you think it does! <i>aims at SJW</i><br> SJW: EEK! <i>cowers</i><br> Moderate: How dare you! <i>draws pistol on Conservative</i> If you do not turn around this instant, I shall shoot you myself, you dishonorable cur!</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Ross Douthat, meanwhile, claims <a href=\"https://www.nytimes.com/2017/02/01/opinion/how-populism-stumbles.html?action=click&amp;pgtype=Homepage&amp;clickSource=story-heading&amp;module=opinion-c-col-right-region&amp;region=opinion-c-col-right-region&amp;WT.nav=opinion-c-col-right-region&amp;_r=1\">populism is always doomed to failure</a> and assumes both incompetence and an inability to learn on the part of a man who not only specializes in A/B testing, but went through THREE campaign managers in his successful campaign for the White House.</p><blockquote><p> The great fear among Trump-fearers is that he will deal with this elite opposition by effectively crushing it — purging the deep state, taming the media, remaking the judiciary as his pawn, and routing or co-opting the Democrats. This is the scenario where a surging populism, its progress balked through normal channels, turns authoritarian and dictatorial, ending in the sort of American Putinism that David Frum describes darkly in the latest issue of The Atlantic.</p><p>But nothing about Trumpian populism to date suggests that it has either the political skill or the popularity required to grind its opposition down. In which case, instead of Putin, the more relevant case study might be former President Mohamed Morsi of Egypt, the Muslim Brotherhood leader whose brief tenure was defined both by chronic self-sabotage and by the active resistance of the Egyptian bureaucracy and intelligentsia, which rendered governance effectively impossible.</p><p>The Egyptian deep state’s sabotage of Morsi culminated in a coup. This is not my prediction for the Trump era. But what we’ve watched unfold with refugee policy suggests that chaos and incompetence are much more likely to define this administration than any kind of ruthless strength.</p></blockquote><p>I, on the other hand, observe that the God-Emperor is simply starting small and testing the waters. I don’t think we’ve seen anything at all as yet. But if the best he can do is to burn down the entire edifice, well, that’s just fine too.</p></div>",
  "content_text": "Rod Dreher does not disappoint as\nhe wrings his hands\nover the God-Emperor’s surprisingly restrained rule:\nThe astonishing audacity and recklessness with which Trump has begun his presidency is a bad sign. For me, it is not so much what he has done (though I do object to some of it) as it is the reckless manner in which he has done it. As every well-raised Southern child knows, manners express morality. Yes, manners are artificial, but they embody a social code that governs the conduct of people who live under it. True, it is always better to do the right thing than to work unrighteousness under the cover of minding one’s manners. But as Brooks points out, there’s something crude and vicious about the way Trump goes out of his way to provoke, to rub the noses of his opponents in the exercise of his power. In Trump’s case, manners express the man.\nIn other words, we know what kind of president Trump is going to be by the way he has carried out his executive actions so far. He does not consider himself bound by law or custom. He is a law unto himself. That doesn’t make him wrong about everything, but it does serve as fair warning to Republicans and conservatives, both on Capitol Hill and out in the country: sooner or later, he’s going to make us take sides. In the moment of testing, you will only be able to make the right call then if you have prepared your conscience, and exercised it by being more faithful to the Truth than to your president.\nDemonstrating, as always, that for the moderate, it’s not what you do, it’s the genteel manner with which you do it.\nModerate: Okay, gentlemen… take 5 paces, then turn and shoot. SJW has won the coin toss and will shoot first. Understood?\nConservative: Yes.\nSJW: Whatever.\nModerate: One…\nSJW: turns and points pistol, hand trembling in terror\nModerate: looks at SJW scornfully Two…\nSJW: CHECK YOUR PRIVILEGE!\nshoots in Conservative’s general direction… misses horribly\nConservative: What the deuce?\nturns around\nYou bastard!\nSJW: How dare you turn around! You’re not a gentleman!\nModerate: Conservative! You must take three more paces before you may turn around!\nConservative: That coward shot at me after two!\nModerate: Do not lower yourself to his level! Death before dishonor!\nConservative: That doesn’t mean what you think it does!\naims at SJW\nSJW: EEK!\ncowers\nModerate: How dare you!\ndraws pistol on Conservative\nIf you do not turn around this instant, I shall shoot you myself, you dishonorable cur!\nRoss Douthat, meanwhile, claims\npopulism is always doomed to failure\nand assumes both incompetence and an inability to learn on the part of a man who not only specializes in A/B testing, but went through THREE campaign managers in his successful campaign for the White House.\nThe great fear among Trump-fearers is that he will deal with this elite opposition by effectively crushing it — purging the deep state, taming the media, remaking the judiciary as his pawn, and routing or co-opting the Democrats. This is the scenario where a surging populism, its progress balked through normal channels, turns authoritarian and dictatorial, ending in the sort of American Putinism that David Frum describes darkly in the latest issue of The Atlantic.\nBut nothing about Trumpian populism to date suggests that it has either the political skill or the popularity required to grind its opposition down. In which case, instead of Putin, the more relevant case study might be former President Mohamed Morsi of Egypt, the Muslim Brotherhood leader whose brief tenure was defined both by chronic self-sabotage and by the active resistance of the Egyptian bureaucracy and intelligentsia, which rendered governance effectively impossible.\nThe Egyptian deep state’s sabotage of Morsi culminated in a coup. This is not my prediction for the Trump era. But what we’ve watched unfold with refugee policy suggests that chaos and incompetence are much more likely to define this administration than any kind of ruthless strength.\nI, on the other hand, observe that the God-Emperor is simply starting small and testing the waters. I don’t think we’ve seen anything at all as yet. But if the best he can do is to burn down the entire edifice, well, that’s just fine too.",
  "tags": [
    "cuckservative",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-02T16:00:00+00:00"
}