{
  "url": "https://voxday.net/2017/02/08/the-sociopathic-face-of-evi/",
  "scraped_at": "2025-12-18T07:00:53.918977",
  "title": "The sociopathic face of evil",
  "date_display": "February 8, 2017",
  "date_iso": "2017-02-08T18:20:00+00:00",
  "date_from_url": "2017-02-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No doubt in ten years it will be a mystery why there has been such a precipitous decline in the number of <a href=\"http://www.northjersey.com/story/news/2017/02/07/secaucus-transgender-boy-returns-scouting/97608482/\">postconvergence Boy Scouts</a>. Diversity isn’t about inclusion, it’s about intentional destruction.</p><blockquote><p> In a moment of historic significance, Joe Maldonado put on a Cub Scout uniform on Tuesday night as he became a member of Pack 20 in Essex County while his mother held back tears — one week after the Boy Scouts of America changed its national policy to allow transgender children to be scouts.</p><p>Scouting’s decision to change its longtime policy came about a month after The Record reported that Joe had been thrown out of a Cub Scout pack in Secaucus last year because he was born a girl. The decision was at least in part a response to the national debate generated by that story.</p><p>“This is fun; I’m so proud,” Joe, 9, said during the meeting. He said that the best part of the night was that “I am accepted, and I’m actually in Boy Scouts.”</p></blockquote><p>Isn’t it amazing how supposedly emotional these stories always are? They <i>inevitably </i>cite someone shedding tears of joy. This is the sociopathic, cynical face of evil.</p></div>",
  "content_text": "No doubt in ten years it will be a mystery why there has been such a precipitous decline in the number of\npostconvergence Boy Scouts\n. Diversity isn’t about inclusion, it’s about intentional destruction.\nIn a moment of historic significance, Joe Maldonado put on a Cub Scout uniform on Tuesday night as he became a member of Pack 20 in Essex County while his mother held back tears — one week after the Boy Scouts of America changed its national policy to allow transgender children to be scouts.\nScouting’s decision to change its longtime policy came about a month after The Record reported that Joe had been thrown out of a Cub Scout pack in Secaucus last year because he was born a girl. The decision was at least in part a response to the national debate generated by that story.\n“This is fun; I’m so proud,” Joe, 9, said during the meeting. He said that the best part of the night was that “I am accepted, and I’m actually in Boy Scouts.”\nIsn’t it amazing how supposedly emotional these stories always are? They\ninevitably\ncite someone shedding tears of joy. This is the sociopathic, cynical face of evil.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2017-02-08T18:20:00+00:00"
}