{
  "url": "https://voxday.net/2017/02/28/there-is-no-us/",
  "scraped_at": "2025-12-18T07:03:57.076226",
  "title": "There is no us",
  "date_display": "February 28, 2017",
  "date_iso": "2017-02-28T16:03:00+00:00",
  "date_from_url": "2017-02-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Univision’s Jorge Ramos declares that <a href=\"http://www.breitbart.com/big-government/2017/02/27/jorge-ramos-america-our-country-not-theirs-we-are-not-going-leave/\">the USA belongs to 60 million Latino invaders</a>, not We, the People, the Posterity of the Founding Fathers:</p><blockquote><p> Univision senior anchor Jorge Ramos declared on Friday that the United States belongs to Latino migrants, emphatically stating to a Spanish-speaking audience that “it is our country, not theirs.”<br> Ramos took an unusual tack, pivoting from talk of diversity and togetherness into boasts of conquest. Mass immigration, particularly illegal immigration, was a fait accompli. There is nothing the U.S. can do about it, and they must accept that America is “not their” country and that illegal aliens, particularly Latinos, “are not going to leave,” he said.</br></p><p>“I am an immigrant, just like many of you,” Ramos said in Spanish, as translated by the Media Research Center. “I am a proud Latino immigrant here in the United States. My name is Jorge Ramos, and I work at Univision and at the Fusion network.”</p><p>“And you know exactly what is going on here in the United States. There are many people who do not want us to be here, and who want to create a wall in order to separate us,” he said.</p><p>“But you know what? This is also our country. Let me repeat this: Our country, not theirs. It is our country. And we are not going to leave. We are nearly 60 million Latinos in the United States,” he continued. “And thanks to us, the United States eats, grows and, as we’ve seen today, sings and dances.”</p><p>“So when they attack us, we already know what we are going to do. We are not going to sit down. We will not shut up. And we will not leave. That is what we are going to do,” he added.</p></blockquote><p>Yet another nail in the coffin of the historically illiterate civic nationalists. And yet another brick in the strong intellectual foundation of the Alt-Right. The message is very clear: <i>“It’s our country now. You lost, just like the Indians so get over it and get out.”</i></p><p>It doesn’t matter whether you are a libertarian, a conservative, a liberal, a progressive, or a constitutionalist. Your ideology is outdated and irrelevant. It’s all identity politics now, and politics is a subset of war. If the matter cannot be resolved politically – and the fact that this is the largest invasion in human history strongly suggests it cannot be – it will be resolved with violence.</p><p>The USA will be physically divided. At this point, the only serious questions are a) where the lines will be drawn, b) the level of violence involved, and c) precisely whom is going to be permitted to remain where.</p></div>",
  "content_text": "Univision’s Jorge Ramos declares that\nthe USA belongs to 60 million Latino invaders\n, not We, the People, the Posterity of the Founding Fathers:\nUnivision senior anchor Jorge Ramos declared on Friday that the United States belongs to Latino migrants, emphatically stating to a Spanish-speaking audience that “it is our country, not theirs.”\nRamos took an unusual tack, pivoting from talk of diversity and togetherness into boasts of conquest. Mass immigration, particularly illegal immigration, was a fait accompli. There is nothing the U.S. can do about it, and they must accept that America is “not their” country and that illegal aliens, particularly Latinos, “are not going to leave,” he said.\n“I am an immigrant, just like many of you,” Ramos said in Spanish, as translated by the Media Research Center. “I am a proud Latino immigrant here in the United States. My name is Jorge Ramos, and I work at Univision and at the Fusion network.”\n“And you know exactly what is going on here in the United States. There are many people who do not want us to be here, and who want to create a wall in order to separate us,” he said.\n“But you know what? This is also our country. Let me repeat this: Our country, not theirs. It is our country. And we are not going to leave. We are nearly 60 million Latinos in the United States,” he continued. “And thanks to us, the United States eats, grows and, as we’ve seen today, sings and dances.”\n“So when they attack us, we already know what we are going to do. We are not going to sit down. We will not shut up. And we will not leave. That is what we are going to do,” he added.\nYet another nail in the coffin of the historically illiterate civic nationalists. And yet another brick in the strong intellectual foundation of the Alt-Right. The message is very clear:\n“It’s our country now. You lost, just like the Indians so get over it and get out.”\nIt doesn’t matter whether you are a libertarian, a conservative, a liberal, a progressive, or a constitutionalist. Your ideology is outdated and irrelevant. It’s all identity politics now, and politics is a subset of war. If the matter cannot be resolved politically – and the fact that this is the largest invasion in human history strongly suggests it cannot be – it will be resolved with violence.\nThe USA will be physically divided. At this point, the only serious questions are a) where the lines will be drawn, b) the level of violence involved, and c) precisely whom is going to be permitted to remain where.",
  "tags": [
    "decline and fall",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-28T16:03:00+00:00"
}