{
  "url": "https://voxday.net/2017/02/15/tolkien-and-rewrite-of-ring-cycle/",
  "scraped_at": "2025-12-18T07:02:02.609498",
  "title": "Tolkien and the rewrite of the Ring Cycle",
  "date_display": "February 15, 2017",
  "date_iso": "2017-02-15T16:00:00+00:00",
  "date_from_url": "2017-02-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m always a bit cautious taking David Goldman’s assertions at face value, because his Jewish hyperautomonomania occasionally leads his otherwise astute commentary astray into absurdities. That is why, despite not having any information at all on the subject, I tend to suspect his claim that Tolkien “despised” Wagner is at least part projection on his part.</p><p>But it is certainly interesting to observe the amazing number of structural, plot, and character similarities between <i>The Ring of the Nibelung</i> and <i>The Lord of the Rings, </i>in an old Spengler article <a href=\"http://www.castaliahouse.com/two-rings-and-the-remnants-of-the-west/\">linked at Castalia House today</a>.</p><blockquote class=\"tr_bq\"><p> Tolkien well may have written his epic as an “anti-Ring” to repair the damage that Wagner had inflicted upon Western culture…. Tolkien himself despised Wagner (whom he knew thoroughly) and rejected comparisons between his Ring and Wagner’s cycle (“Both rings are round,” is the extent of his published comment). But the parallels between the two works are so extensive as to raise the question as to Tolkien’s intent. The Ring of Power itself is Wagner’s invention (probably derived from the German Romantic de la Motte Fouque). Also to be found in both works are an immortal woman who renounces immortality for the love of a human, a broken sword reforged, a life-and-death game of riddles, and other elements which one doesn’t encounter every day. </p></blockquote><p>Now, I don’t know how anyone with even a modicum of musical talent or appreciation could fail to revere Wagner. His is my favorite writing music, and if his <i>Nibelungenlied </i>fell short of his vision of a <i>Gesamtkunstwerk</i>, it is still one of the great artistic accomplishments of Man. Which is not to say that his Teutonic interpretation of the Norse sagas is necessarily the optimal one; Middle Earth is considerably far more relatable to the more optimistic, less doom-obsessed Anglo-Saxons and their descendants.</p><p>And, we have to recall that Tolkien was scarred by England’s two wars against Germany, and was writing in the shadow of the latter. But no one delves so deep into the work of an artist he despises, or knows it so well. I do despise Scalzi as an author, which is why I stopped reading his work after the second straight debacle. I don’t despise George R. R. Marin – as an author, you understand – because even though ASOIAF has lost the plot and devolved into a near-parody of the earlier books, there are still enough echoes of very good epic fantasy that I will finish reading whatever portion of the series he manages to finish.</p><p>At the risk of engaging in some projection myself, I think Tolkien was doing very much what I am doing with <i>Arts of Dark and Light</i>, which is appreciating something, seeing its flaws, and imagining how it could have been done better. And it should be no surprise that <i>The Lord of the Rings</i> exceeds <i>Arts of Dark and Light</i>; Wagner certainly makes for a higher and more challenging bar to clear than Martin.</p></div>",
  "content_text": "I’m always a bit cautious taking David Goldman’s assertions at face value, because his Jewish hyperautomonomania occasionally leads his otherwise astute commentary astray into absurdities. That is why, despite not having any information at all on the subject, I tend to suspect his claim that Tolkien “despised” Wagner is at least part projection on his part.\nBut it is certainly interesting to observe the amazing number of structural, plot, and character similarities between\nThe Ring of the Nibelung\nand\nThe Lord of the Rings,\nin an old Spengler article\nlinked at Castalia House today\n.\nTolkien well may have written his epic as an “anti-Ring” to repair the damage that Wagner had inflicted upon Western culture…. Tolkien himself despised Wagner (whom he knew thoroughly) and rejected comparisons between his Ring and Wagner’s cycle (“Both rings are round,” is the extent of his published comment). But the parallels between the two works are so extensive as to raise the question as to Tolkien’s intent. The Ring of Power itself is Wagner’s invention (probably derived from the German Romantic de la Motte Fouque). Also to be found in both works are an immortal woman who renounces immortality for the love of a human, a broken sword reforged, a life-and-death game of riddles, and other elements which one doesn’t encounter every day.\nNow, I don’t know how anyone with even a modicum of musical talent or appreciation could fail to revere Wagner. His is my favorite writing music, and if his\nNibelungenlied\nfell short of his vision of a\nGesamtkunstwerk\n, it is still one of the great artistic accomplishments of Man. Which is not to say that his Teutonic interpretation of the Norse sagas is necessarily the optimal one; Middle Earth is considerably far more relatable to the more optimistic, less doom-obsessed Anglo-Saxons and their descendants.\nAnd, we have to recall that Tolkien was scarred by England’s two wars against Germany, and was writing in the shadow of the latter. But no one delves so deep into the work of an artist he despises, or knows it so well. I do despise Scalzi as an author, which is why I stopped reading his work after the second straight debacle. I don’t despise George R. R. Marin – as an author, you understand – because even though ASOIAF has lost the plot and devolved into a near-parody of the earlier books, there are still enough echoes of very good epic fantasy that I will finish reading whatever portion of the series he manages to finish.\nAt the risk of engaging in some projection myself, I think Tolkien was doing very much what I am doing with\nArts of Dark and Light\n, which is appreciating something, seeing its flaws, and imagining how it could have been done better. And it should be no surprise that\nThe Lord of the Rings\nexceeds\nArts of Dark and Light\n; Wagner certainly makes for a higher and more challenging bar to clear than Martin.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-15T16:00:00+00:00"
}