{
  "url": "https://voxday.net/2017/02/18/too-fab-too-strong/",
  "scraped_at": "2025-12-18T07:02:27.635967",
  "title": "Too fab, too strong",
  "date_display": "February 18, 2017",
  "date_iso": "2017-02-18T01:05:00+00:00",
  "date_from_url": "2017-02-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>They <a href=\"http://www.washingtontimes.com/news/2017/feb/16/bill-maher-blasts-jeremy-scahill-for-dropping-out-/\">can’t handle the Milo</a>:</p><blockquote class=\"tr_bq\"><p> Bill Maher is making no apologies for booking Milo Yiannopoulos on HBO’s “Real Time” this Friday, saying Jeremy Scahill’s refusal to appear on the show out of protest of the conservative firebrand is one of the reasons why Democrats lost the election to President Trump. Mr. Scahill, founding editor of <i>The Intercept</i>, posted a lengthy statement on Twitter Wednesday evening announcing that he was dropping out of his scheduled appearance on Friday’s show because he disagrees with giving Mr. Yiannopoulos a platform to “spew his hateful diatribes.”</p></blockquote><p>What a shame that Jeremy Scahill is such a horrible homophobe. This should be interesting, as I’ve seen Milo run rough-shod over UK TV journalists who are much smarter than Bill Maher. Maher isn’t verbally slow, but I will be very surprised if he can keep up with Milo. I think it’s fascinating that he’s even <a href=\"http://www.hbo.com/real-time-with-bill-maher\">willing to try</a>.</p><p>It is true, however, that the Left’s complete cowardice in this regard doesn’t fool anyone except the low-IQ true believers. Who does the Left have in the media that can possibly hold their own in a debate with Mike, Milo, me, or Stefan? They don’t have anyone. That’s why they run.</p><p>The idea that Maher is “giving Milo a platform” is absurd. Milo doesn’t need a platform. Milo IS a platform.</p></div>",
  "content_text": "They\ncan’t handle the Milo\n:\nBill Maher is making no apologies for booking Milo Yiannopoulos on HBO’s “Real Time” this Friday, saying Jeremy Scahill’s refusal to appear on the show out of protest of the conservative firebrand is one of the reasons why Democrats lost the election to President Trump. Mr. Scahill, founding editor of\nThe Intercept\n, posted a lengthy statement on Twitter Wednesday evening announcing that he was dropping out of his scheduled appearance on Friday’s show because he disagrees with giving Mr. Yiannopoulos a platform to “spew his hateful diatribes.”\nWhat a shame that Jeremy Scahill is such a horrible homophobe. This should be interesting, as I’ve seen Milo run rough-shod over UK TV journalists who are much smarter than Bill Maher. Maher isn’t verbally slow, but I will be very surprised if he can keep up with Milo. I think it’s fascinating that he’s even\nwilling to try\n.\nIt is true, however, that the Left’s complete cowardice in this regard doesn’t fool anyone except the low-IQ true believers. Who does the Left have in the media that can possibly hold their own in a debate with Mike, Milo, me, or Stefan? They don’t have anyone. That’s why they run.\nThe idea that Maher is “giving Milo a platform” is absurd. Milo doesn’t need a platform. Milo IS a platform.",
  "tags": [
    "debate",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-18T01:05:00+00:00"
}