{
  "url": "https://voxday.net/2017/02/16/what-to-do-what-to-do/",
  "scraped_at": "2025-12-18T07:02:11.625745",
  "title": "What to do, what not to do",
  "date_display": "February 16, 2017",
  "date_iso": "2017-02-16T13:12:00+00:00",
  "date_from_url": "2017-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Men of the West <a href=\"https://www.menofthewest.net/moving-into-meatspace/\">have suggestions</a> for the Alt-Right, the Alt-Lite, and other defenders of Western civilization:</p><blockquote><p> So, you have looked around and realized that the world is not how it should be. Things that were good in the past  have decayed. Our culture is crumbling around us. We see things that are good and proper being ignored or even intentionally dismantled, replaced with obscenities and evil. Whether we are talking about governmental policies or business practices, or even educational opportunities, we can no longer rely on things as they are. They do not produce an end result that indicates a healthy, godly culture. So what do we do? As I see it, we have three choices.</p><p>First, the thing we cannot do, though it is an option, is to just stick our heads back in the sand and ignore it. Look, it is time to make a stand, not just let things progress down this path to destruction.</p><p>Secondly, we can point out problems. We can gripe about them. We can write articles, blog posts, and generally complain. Now, I do think we need to do this. It is important. Without calling out the problems, nothing will be done. However, we cannot stop there.</p><p>igThird, we have to address these problems, whatever they may be, and begin to do something about them. We point them out, and then enact change. The time for “go along to get along” is past. In fact, it was never a good choice, but so many of us just figured things will work themselves out. Unfortunately, that is not the case. We have to take real action.</p><ul><li>Use resources that are consistent with our world view. We recently ran a post with such resources. Make it your habit to support them, whether with finances or just by using them. The more we spread these healthy alternatives, the more people will be exposed to them and the more impact they will have.</li><li>Use your own skills and talents to produce more alternatives. Already, good folks have created alternatives to Wikipedia, Twitter, and more. Other alternatives are in the works. We need folks to step up and create even more of these. If your skill set allows you to help produce those, then go for it. Many, maybe most, of these won’t catch on, but so what? Some will. The more that do, the more that can follow. We just need traction to get these things to succeed.</li><li>Stop complaining about those who are stepping up. Rather than trying to be a “moderate,” be an extremist. This is no time for moderation. As Barry Goldwater stated: “Extremism in the defense of liberty is no vice. And moderation in the pursuit of justice is no virtue.” We have no patience for moderates. We want wholesale change and will work to make it happen.</li><li>Network with likeminded folks. Recently, a commenter on this site pointed out that too many people spend time complaining and writing articles, but not enough time actually doing anything. While the majority of his post was incorrect, on this one point, he was spot on. </li></ul></blockquote><p>These are key points. Unless you are a beta tester or a proofreader, don’t kid yourself into thinking that complaints and criticism are “helping” anyone or doing anything. They’re not. In almost all cases, the criticism is superficial and redundant, while the complaints are both irritating and demoralizing. And perhaps more importantly, if you had ever done anything yourself, <i>you would know that</i>.</p><p>So get involved. <i>Do </i>something. Act. Build. Cheer. Support. Subscribe. Sustain. That’s how you can make a difference. That’s how we will stave off collapse.</p></div>",
  "content_text": "The Men of the West\nhave suggestions\nfor the Alt-Right, the Alt-Lite, and other defenders of Western civilization:\nSo, you have looked around and realized that the world is not how it should be. Things that were good in the past  have decayed. Our culture is crumbling around us. We see things that are good and proper being ignored or even intentionally dismantled, replaced with obscenities and evil. Whether we are talking about governmental policies or business practices, or even educational opportunities, we can no longer rely on things as they are. They do not produce an end result that indicates a healthy, godly culture. So what do we do? As I see it, we have three choices.\nFirst, the thing we cannot do, though it is an option, is to just stick our heads back in the sand and ignore it. Look, it is time to make a stand, not just let things progress down this path to destruction.\nSecondly, we can point out problems. We can gripe about them. We can write articles, blog posts, and generally complain. Now, I do think we need to do this. It is important. Without calling out the problems, nothing will be done. However, we cannot stop there.\nigThird, we have to address these problems, whatever they may be, and begin to do something about them. We point them out, and then enact change. The time for “go along to get along” is past. In fact, it was never a good choice, but so many of us just figured things will work themselves out. Unfortunately, that is not the case. We have to take real action.\nUse resources that are consistent with our world view. We recently ran a post with such resources. Make it your habit to support them, whether with finances or just by using them. The more we spread these healthy alternatives, the more people will be exposed to them and the more impact they will have.\nUse your own skills and talents to produce more alternatives. Already, good folks have created alternatives to Wikipedia, Twitter, and more. Other alternatives are in the works. We need folks to step up and create even more of these. If your skill set allows you to help produce those, then go for it. Many, maybe most, of these won’t catch on, but so what? Some will. The more that do, the more that can follow. We just need traction to get these things to succeed.\nStop complaining about those who are stepping up. Rather than trying to be a “moderate,” be an extremist. This is no time for moderation. As Barry Goldwater stated: “Extremism in the defense of liberty is no vice. And moderation in the pursuit of justice is no virtue.” We have no patience for moderates. We want wholesale change and will work to make it happen.\nNetwork with likeminded folks. Recently, a commenter on this site pointed out that too many people spend time complaining and writing articles, but not enough time actually doing anything. While the majority of his post was incorrect, on this one point, he was spot on.\nThese are key points. Unless you are a beta tester or a proofreader, don’t kid yourself into thinking that complaints and criticism are “helping” anyone or doing anything. They’re not. In almost all cases, the criticism is superficial and redundant, while the complaints are both irritating and demoralizing. And perhaps more importantly, if you had ever done anything yourself,\nyou would know that\n.\nSo get involved.\nDo\nsomething. Act. Build. Cheer. Support. Subscribe. Sustain. That’s how you can make a difference. That’s how we will stave off collapse.",
  "tags": [
    "#AltTech",
    "#AltWest",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-16T13:12:00+00:00"
}