{
  "url": "https://voxday.net/2017/02/05/why-conservatives-always-lose/",
  "scraped_at": "2025-12-18T07:00:27.245185",
  "title": "Why conservatives always lose",
  "date_display": "February 5, 2017",
  "date_iso": "2017-02-05T18:09:00+00:00",
  "date_from_url": "2017-02-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Wright pens <a href=\"http://www.scifiwright.com/2017/02/the-last-crusade-rip-van-con/\">a long and thoughtful piece</a> on why conservatives always lose. He contemplates the perspective of a hypothetical Rip van Conservative, a conservative who fell asleep in 1945 and awoke 72 years later, in 2017, only to discover that <strike>all </strike>many of the victories he thought won had been lost in the meantime:</p><blockquote><p> One main reason why a Last Crusade must be called is that Conservatism, while perfectly sound when facing Commies in a Cold War, Nazis in a World War, or Slavers in a Civil War, has no defense to offer when the fascistic cultural Marxism seeps peacefully into the ivory tower, the theater, the press, the halls of power…. Now, as a conservative, you point out that all these things are simply illogical, paradoxes even a schoolboy could see cannot possibly be true. A thing cannot be itself and be the opposite of itself at the same time. A sentence that contradicts the same idea it affirms is a self-refuting sentence. Reality cannot be unreal.</p><p>You are answered that modern progress has proven that truth is untrue, for all things are matters of mere opinion that each man decides for himself. To say truth is truth offends the liberty of each man to invent his own truth.</p><p>You are answered that modern progress has proven that logic is merely a social adaptation mechanism formed by evolution, and has no authority to compel men to obey it. To say that logic is logical offends the liberty of each man to enjoy whichever of the personal and invented truths he sees fit.</p><p>You are answered that modern progress has proven that morality consists of the single rule that all must toleration any abridgement of morality anyone sees fit, aside, of course, from hate speech and badthink. Avoiding badthink is an absolute moral prohibition applied to all rightwing angloamerican white male heterosexual Christians. To say that morals cannot be defined as immorality is badthink. It offends the liberty of men to be evil, condone evil, promote evil, and worship evil.</p><p>You are answered with a fullthroated defense of unreality so complete that even Buddha would be shamed. The Progressive thinks that all life is an illusion, but that the illusion can be peaceful and pleasing, or the opposite, depending on the discipline and disposition of the subjective observer. You make your own reality.</p><p>This reality is called “a Narrative.” It is not based on fact, nor meant to be. It is based on emotion, whim, psychological defense mechanism.</p><p>Unlike the Buddhist, the Progressive seeks not to escape the illusion. There is nothing outside the illusion, no reality, no nirvana, to which to escape. There is no red pill to take.</p><p>The Narrative is an all encompassing world of illusion. It is an empire of lies.</p><p>And the first lie in the empire of lies is the lie that the Narrative does not exist. Only truths, as told by conservatives and anyone else looking at reality, are called Narratives.</p><p>Now, at the end of these answers, Rip van Conservative realizes that debate is impossible with a creature who cannot and will not speak in a coherent sentence, cannot and will not think a logical thought, and whose sole verbal reply to any criticism, no matter how true and trenchant, is merely to accuse his accuser of the flaws he himself possesses.</p><p>The stupid calls his smarter critic stupid. The fool calls his wiser critic foolish. The bigot calls his open-minded critic bigoted. The fascist calls his freedom loving critic a fascist. And on and on ad nauseam.</p><p>And so the conservative loses every battle. Why?</p><p>When conservativism is not only obvious, but self-evident, why does it falter?</p><p>When conservatism is not only a self-evident position, but the sole position seen not to contradict itself, why does it lose the field?</p><p>If all positions other than the conservative one are not merely incorrect, but immoral, illogical and insane, how is it that conservatism is soundly swept from the field, and no one polite society dares utter a word in its defense?</p><p>Conservatism falters, fails, and finds itself utterly effaced because and only because it fights the wrong battle on the wrong battlefield.</p></blockquote><p>Now, I do not disagree with John here in the slightest, except to observe that there are competing explanations for the reason <i>why </i>conservatives are always fighting the wrong battle on the wrong battlefield. My explanation is the Alt-Right one, which is that immigrants wielding identity politics against an unsuspecting America have misled conservatives into believing false history and defending imaginary philosophical ground rather than defending their national interests. Of course, I expect John, being dubious about identity politics, would tend to disagree. At no little length.</p><p>Which is fine. Because regardless of <i>why </i>conservativism fights the wrong battle on the wrong battlefield, this piece serves as an informative illustration explaining why conservativism has so reliably failed to provide a philosophical bulwark against the Left, and why it will continue to do so. The more conservatives understand that more conservatism is not the answer, the more the winning will continue.</p></div>",
  "content_text": "John Wright pens\na long and thoughtful piece\non why conservatives always lose. He contemplates the perspective of a hypothetical Rip van Conservative, a conservative who fell asleep in 1945 and awoke 72 years later, in 2017, only to discover that\nall\nmany of the victories he thought won had been lost in the meantime:\nOne main reason why a Last Crusade must be called is that Conservatism, while perfectly sound when facing Commies in a Cold War, Nazis in a World War, or Slavers in a Civil War, has no defense to offer when the fascistic cultural Marxism seeps peacefully into the ivory tower, the theater, the press, the halls of power…. Now, as a conservative, you point out that all these things are simply illogical, paradoxes even a schoolboy could see cannot possibly be true. A thing cannot be itself and be the opposite of itself at the same time. A sentence that contradicts the same idea it affirms is a self-refuting sentence. Reality cannot be unreal.\nYou are answered that modern progress has proven that truth is untrue, for all things are matters of mere opinion that each man decides for himself. To say truth is truth offends the liberty of each man to invent his own truth.\nYou are answered that modern progress has proven that logic is merely a social adaptation mechanism formed by evolution, and has no authority to compel men to obey it. To say that logic is logical offends the liberty of each man to enjoy whichever of the personal and invented truths he sees fit.\nYou are answered that modern progress has proven that morality consists of the single rule that all must toleration any abridgement of morality anyone sees fit, aside, of course, from hate speech and badthink. Avoiding badthink is an absolute moral prohibition applied to all rightwing angloamerican white male heterosexual Christians. To say that morals cannot be defined as immorality is badthink. It offends the liberty of men to be evil, condone evil, promote evil, and worship evil.\nYou are answered with a fullthroated defense of unreality so complete that even Buddha would be shamed. The Progressive thinks that all life is an illusion, but that the illusion can be peaceful and pleasing, or the opposite, depending on the discipline and disposition of the subjective observer. You make your own reality.\nThis reality is called “a Narrative.” It is not based on fact, nor meant to be. It is based on emotion, whim, psychological defense mechanism.\nUnlike the Buddhist, the Progressive seeks not to escape the illusion. There is nothing outside the illusion, no reality, no nirvana, to which to escape. There is no red pill to take.\nThe Narrative is an all encompassing world of illusion. It is an empire of lies.\nAnd the first lie in the empire of lies is the lie that the Narrative does not exist. Only truths, as told by conservatives and anyone else looking at reality, are called Narratives.\nNow, at the end of these answers, Rip van Conservative realizes that debate is impossible with a creature who cannot and will not speak in a coherent sentence, cannot and will not think a logical thought, and whose sole verbal reply to any criticism, no matter how true and trenchant, is merely to accuse his accuser of the flaws he himself possesses.\nThe stupid calls his smarter critic stupid. The fool calls his wiser critic foolish. The bigot calls his open-minded critic bigoted. The fascist calls his freedom loving critic a fascist. And on and on ad nauseam.\nAnd so the conservative loses every battle. Why?\nWhen conservativism is not only obvious, but self-evident, why does it falter?\nWhen conservatism is not only a self-evident position, but the sole position seen not to contradict itself, why does it lose the field?\nIf all positions other than the conservative one are not merely incorrect, but immoral, illogical and insane, how is it that conservatism is soundly swept from the field, and no one polite society dares utter a word in its defense?\nConservatism falters, fails, and finds itself utterly effaced because and only because it fights the wrong battle on the wrong battlefield.\nNow, I do not disagree with John here in the slightest, except to observe that there are competing explanations for the reason\nwhy\nconservatives are always fighting the wrong battle on the wrong battlefield. My explanation is the Alt-Right one, which is that immigrants wielding identity politics against an unsuspecting America have misled conservatives into believing false history and defending imaginary philosophical ground rather than defending their national interests. Of course, I expect John, being dubious about identity politics, would tend to disagree. At no little length.\nWhich is fine. Because regardless of\nwhy\nconservativism fights the wrong battle on the wrong battlefield, this piece serves as an informative illustration explaining why conservativism has so reliably failed to provide a philosophical bulwark against the Left, and why it will continue to do so. The more conservatives understand that more conservatism is not the answer, the more the winning will continue.",
  "tags": [
    "#AltRight",
    "history",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-05T18:09:00+00:00"
}