{
  "url": "https://voxday.net/2017/02/09/wikipedia-bans-daily-mai/",
  "scraped_at": "2025-12-18T07:01:02.738339",
  "title": "Wikipedia bans Daily Mail",
  "date_display": "February 9, 2017",
  "date_iso": "2017-02-09T13:00:00+00:00",
  "date_from_url": "2017-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yet another reason to prefer Infogalactic to Wikipedia: the latter’s heavily biased, increasingly inaccurate, ironically named <a href=\"https://archive.is/1i9KM\">“reliable source” standard</a>:</p><blockquote><p> Wikipedia editors have voted to ban the Daily Mail as a source for the website in all but exceptional circumstances after deeming the news group “generally unreliable”.</p><p>The move is highly unusual for the online encyclopaedia, which rarely puts in place a blanket ban on publications and which still allows links to sources such as Kremlin backed news organisation Russia Today, and Fox News, both of which have raised concern among editors.</p><p>The Wikimedia Foundation, which runs Wikipedia but does not control its editing processes, said in a statement that volunteer editors on English Wikipedia had discussed the reliability of the Mail since at least early 2015.</p><p>It said: “Based on the requests for comments section [on the reliable sources noticeboard], volunteer editors on English Wikipedia have come to a consensus that the Daily Mail is ‘generally unreliable and its use as a reference is to be generally prohibited, especially when other more reliable sources exist’.</p><p>“This means that the Daily Mail will generally not be referenced as a ‘reliable source’ on English Wikipedia, and volunteer editors are encouraged to change existing citations to the Daily Mail to another source deemed reliable by the community. This is consistent with how Wikipedia editors evaluate and use media outlets in general – with common sense and caution.”</p></blockquote><p>Infogalactic has a vastly superior standard: truth. This sort of SJW thought-policing is why Infogalactic is eventually going to replace Wikipedia; it is only a matter of time. It’s particularly ironic that this article originally appeared in <i>The Guardian</i>, which has got to be the least reliable source among newspapers that one can hope to find since the demise of the Soviet Union.</p><p>Speaking of Infogalactic, it is soon going to launch Infogalactic News, a dynamic Drudge-style page that will be actively curated and update twice per day. It will feature 36 permalinks to sites and commenters that are mostly not available at Drudge, including this one, so we hope you’ll make it your primary news page. We need a few more news editors to round out the full week, so if you’re VFM and you want a regular turn at the wheel, email me with your VFM # in the subject and whether you prefer 12 midnight to 12 noon or 12 noon to 12 midnight, both EST. Each editor will be responsible for keeping the page up-to-date for one 12-hour period per week.</p><p>On a tangential note, full dynamic auto-forking will be also operational within a few weeks. And if you haven’t <a href=\"http://infogalactic.com/info/Infogalactic:Donations\">joined the Burn Unit yet</a>, please consider doing so. We’ve been growing steadily, but once News and Forkbot go live, the traffic is going to explode, so we’ll need the Burn Unit to grow accordingly.</p></div>",
  "content_text": "Yet another reason to prefer Infogalactic to Wikipedia: the latter’s heavily biased, increasingly inaccurate, ironically named\n“reliable source” standard\n:\nWikipedia editors have voted to ban the Daily Mail as a source for the website in all but exceptional circumstances after deeming the news group “generally unreliable”.\nThe move is highly unusual for the online encyclopaedia, which rarely puts in place a blanket ban on publications and which still allows links to sources such as Kremlin backed news organisation Russia Today, and Fox News, both of which have raised concern among editors.\nThe Wikimedia Foundation, which runs Wikipedia but does not control its editing processes, said in a statement that volunteer editors on English Wikipedia had discussed the reliability of the Mail since at least early 2015.\nIt said: “Based on the requests for comments section [on the reliable sources noticeboard], volunteer editors on English Wikipedia have come to a consensus that the Daily Mail is ‘generally unreliable and its use as a reference is to be generally prohibited, especially when other more reliable sources exist’.\n“This means that the Daily Mail will generally not be referenced as a ‘reliable source’ on English Wikipedia, and volunteer editors are encouraged to change existing citations to the Daily Mail to another source deemed reliable by the community. This is consistent with how Wikipedia editors evaluate and use media outlets in general – with common sense and caution.”\nInfogalactic has a vastly superior standard: truth. This sort of SJW thought-policing is why Infogalactic is eventually going to replace Wikipedia; it is only a matter of time. It’s particularly ironic that this article originally appeared in\nThe Guardian\n, which has got to be the least reliable source among newspapers that one can hope to find since the demise of the Soviet Union.\nSpeaking of Infogalactic, it is soon going to launch Infogalactic News, a dynamic Drudge-style page that will be actively curated and update twice per day. It will feature 36 permalinks to sites and commenters that are mostly not available at Drudge, including this one, so we hope you’ll make it your primary news page. We need a few more news editors to round out the full week, so if you’re VFM and you want a regular turn at the wheel, email me with your VFM # in the subject and whether you prefer 12 midnight to 12 noon or 12 noon to 12 midnight, both EST. Each editor will be responsible for keeping the page up-to-date for one 12-hour period per week.\nOn a tangential note, full dynamic auto-forking will be also operational within a few weeks. And if you haven’t\njoined the Burn Unit yet\n, please consider doing so. We’ve been growing steadily, but once News and Forkbot go live, the traffic is going to explode, so we’ll need the Burn Unit to grow accordingly.",
  "tags": [
    "Infogalactic",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2017-02-09T13:00:00+00:00"
}