{
  "url": "https://voxday.net/2021/12/09/1000-videos-on-uatv/",
  "scraped_at": "2026-01-08T13:02:04.906995",
  "title": "1,000 Videos on UATV",
  "date_display": "December 9, 2021",
  "date_iso": "2021-12-09T14:00:00+00:00",
  "date_from_url": "2021-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Congratulations to the Big Bear, whose <em>Owen’s Livestreams</em> channel on UATV has just hit 1,000 videos. That’s 80 days, 17 hours, and 31 seconds of video content from his livestreams alone, and that doesn’t count the 457 other videos that are featured on one of his other three channels.</p><p>This is remarkable, if you consider that Unauthorized launched with Owen’s first livestream back in March 2019. But if the progress has been a little winding and uneven at times, it has also been relentless, and 2022 is going to see new creators, new features, and a massive quantity of new content.</p><p>Nuke Netflix, Ditch Disney, cut the CNN cable, and <a href=\"https://unauthorized.tv/account/subscribe/\">support UATV instead</a>. You’ll be glad you did, because this is merely the beginning of a very long march that is going to take us to a lot of places you’ll want to go. And if you’re already a UATV subscriber, don’t forget <a href=\"https://unauthorized.tv/account/payment/method/new/\">to make the transition</a> to the new payment system, which is necessary for participation in the coming UATV chats as well as for supporting multiple creators and giving gift subscriptions.</p><p>They told us to build our own platforms. And that’s exactly what we’re doing. Because we neither need nor want to be a part of their world.</p><p><em><a href=\"https://social.infogalactic.com/micropost/16dbde6b-042c-4e8c-9323-49bc27ae975a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Congratulations to the Big Bear, whose\nOwen’s Livestreams\nchannel on UATV has just hit 1,000 videos. That’s 80 days, 17 hours, and 31 seconds of video content from his livestreams alone, and that doesn’t count the 457 other videos that are featured on one of his other three channels.\nThis is remarkable, if you consider that Unauthorized launched with Owen’s first livestream back in March 2019. But if the progress has been a little winding and uneven at times, it has also been relentless, and 2022 is going to see new creators, new features, and a massive quantity of new content.\nNuke Netflix, Ditch Disney, cut the CNN cable, and\nsupport UATV instead\n. You’ll be glad you did, because this is merely the beginning of a very long march that is going to take us to a lot of places you’ll want to go. And if you’re already a UATV subscriber, don’t forget\nto make the transition\nto the new payment system, which is necessary for participation in the coming UATV chats as well as for supporting multiple creators and giving gift subscriptions.\nThey told us to build our own platforms. And that’s exactly what we’re doing. Because we neither need nor want to be a part of their world.\nDISCUSS ON SG",
  "tags": [
    "Unauthorized"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-12-09T15:54:09+00:00"
}