{
  "url": "https://voxday.net/2021/12/19/a-message-for-the-american-people/",
  "scraped_at": "2026-01-08T13:03:25.256299",
  "title": "A Message for the American People",
  "date_display": "December 19, 2021",
  "date_iso": "2021-12-19T21:27:53+00:00",
  "date_from_url": "2021-12-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Archbishop Carlo Maria Viganò <a href=\"https://www.scribd.com/document/548169431/Message-for-American-People-Vigano-Dec-19#from_embed\">warns about the war</a> the Babelists are waging on Christianity and Western Civilization, and points out that the Adversary they serve is always the same:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>DEAR FRIENDS, for two years now, a global coup has been carried out all over the world, planned for some time by an elite group of conspirators enslaved to the interests of international high finance. This coup was made possible by an emergency pandemic that is based on the premise of a virus that has a mortality rate almost analogous to that of any other seasonal flu virus, on the delegitimization and prohibition of effective treatments, and on the distribution of an experimental gene serum which is obviously ineffective, and which also clearly carries with it the danger of serious and even lethal side effects. We all know how much the mainstream media has contributed to supporting the insane pandemic narrative, the interests that are at stake, and the goals of these groups of power: reducing the world population, making those who survive chronically ill, and imposing forms of control that violate the fundamental rights and natural liberties of citizens. And yet, two years after this grotesque farce started, which has claimed more victims than a war and destroyed the social fabric, national economies, and the very foundations of the rule of law, nothing has changed in the policies of Nations and their response to the so-called pandemic.</p><p>Last year, when many still had not yet understood the gravity of the looming threat, I was among the first to denounce this coup, and I was promptly singled out as a conspiracy theorist. Today more and more people are opening their eyes and beginning to understand that the emergency pandemic and the“ecological emergency” are part of a criminal plan hatched by the World Economic Forum, the UN, the WHO, and a galaxy of organizations and foundations that are ideologically characterized as clearly anti-human and – this needs to be said clearly – anti-Christian.</p><p>One of the elements that unequivocally confirms the criminal nature of the Great Reset is the perfect synchrony with which all the different Nations are acting, demonstrating the existence of a single script under a single direction. And it is disconcerting to see how the lack of treatment, the deliberately wrong treatments that have been given in order to cause more deaths, the decision to impose lockdowns and masks, the conspiratorial silence about the adverse effects of the so-called “vaccines” that are in fact gene serums, and the continuous repetition of culpable errors have all been possible thanks to the complicity of those who govern and the institutions. Political and religious leaders, representatives of the people, scientists and doctors, journalists and those who work in the media have literally betrayed their people, their laws,their Constitutions, and the most basic ethical principles….</p><p>In short, we have subverted the entire moral order that constitutes the indispensable basis of the laws and social life of a people. Already in the fourth century B.C., Plato wrote these things in his last work the Laws and identified the cause of the Athenian political crisis precisely in the breaking of the divine order – the cosmos – between these eternal principles and human laws. These natural moral principles of the Greco-Roman world found their fulfillment in Christianity, which built Western civilization by giving them a supernatural impetus.</p><p>Christianity is the strongest defense against injustice, the strongest garrison against the oppression of the powerful over the weak, the violent over the peaceful, and the wicked over the good, because Christian morality makes each of us accountable to God and our neighbor for our actions, both as citizens and as rulers. The Son of God, whose Birth we will celebrate in a few days, became Incarnate in time and in history in order to heal an ancient wound, and to restore by Grace the order broken by disobedience. His social Kingship was the generating principle of the <em>ordo Christianus </em>that for two centuries now has been fiercely fought against by Freemasonry: because the Revolution it promotes is chaos; it is disorder; it is infernal rebellion against the divine order so as to impose Satan’s tyranny. Now, as we see what is happening around us, we understand how mendacious were the promises of progress and freedom made by those who destroyed Christian society, and how deceptive was the prospect of a new Tower of Babel, built not only without regard for God but even in direct opposition to Him.</p><p>The infernal challenge of the Enemy is repeated over the centuries unchanged, but it is doomed to inexorable failure. Behind this millennial conspiracy, the adversary is always the same, and the only thing that changes are the particular individuals who cooperate with him.</p></blockquote><p>He’s absolutely correct. Read the whole thing.</p><p><em><a href=\"https://social.infogalactic.com/micropost/a826410f-2563-4b17-a2e9-0d589ebd3b34\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Archbishop Carlo Maria Viganò\nwarns about the war\nthe Babelists are waging on Christianity and Western Civilization, and points out that the Adversary they serve is always the same:\nDEAR FRIENDS, for two years now, a global coup has been carried out all over the world, planned for some time by an elite group of conspirators enslaved to the interests of international high finance. This coup was made possible by an emergency pandemic that is based on the premise of a virus that has a mortality rate almost analogous to that of any other seasonal flu virus, on the delegitimization and prohibition of effective treatments, and on the distribution of an experimental gene serum which is obviously ineffective, and which also clearly carries with it the danger of serious and even lethal side effects. We all know how much the mainstream media has contributed to supporting the insane pandemic narrative, the interests that are at stake, and the goals of these groups of power: reducing the world population, making those who survive chronically ill, and imposing forms of control that violate the fundamental rights and natural liberties of citizens. And yet, two years after this grotesque farce started, which has claimed more victims than a war and destroyed the social fabric, national economies, and the very foundations of the rule of law, nothing has changed in the policies of Nations and their response to the so-called pandemic.\nLast year, when many still had not yet understood the gravity of the looming threat, I was among the first to denounce this coup, and I was promptly singled out as a conspiracy theorist. Today more and more people are opening their eyes and beginning to understand that the emergency pandemic and the“ecological emergency” are part of a criminal plan hatched by the World Economic Forum, the UN, the WHO, and a galaxy of organizations and foundations that are ideologically characterized as clearly anti-human and – this needs to be said clearly – anti-Christian.\nOne of the elements that unequivocally confirms the criminal nature of the Great Reset is the perfect synchrony with which all the different Nations are acting, demonstrating the existence of a single script under a single direction. And it is disconcerting to see how the lack of treatment, the deliberately wrong treatments that have been given in order to cause more deaths, the decision to impose lockdowns and masks, the conspiratorial silence about the adverse effects of the so-called “vaccines” that are in fact gene serums, and the continuous repetition of culpable errors have all been possible thanks to the complicity of those who govern and the institutions. Political and religious leaders, representatives of the people, scientists and doctors, journalists and those who work in the media have literally betrayed their people, their laws,their Constitutions, and the most basic ethical principles….\nIn short, we have subverted the entire moral order that constitutes the indispensable basis of the laws and social life of a people. Already in the fourth century B.C., Plato wrote these things in his last work the Laws and identified the cause of the Athenian political crisis precisely in the breaking of the divine order – the cosmos – between these eternal principles and human laws. These natural moral principles of the Greco-Roman world found their fulfillment in Christianity, which built Western civilization by giving them a supernatural impetus.\nChristianity is the strongest defense against injustice, the strongest garrison against the oppression of the powerful over the weak, the violent over the peaceful, and the wicked over the good, because Christian morality makes each of us accountable to God and our neighbor for our actions, both as citizens and as rulers. The Son of God, whose Birth we will celebrate in a few days, became Incarnate in time and in history in order to heal an ancient wound, and to restore by Grace the order broken by disobedience. His social Kingship was the generating principle of the\nordo Christianus\nthat for two centuries now has been fiercely fought against by Freemasonry: because the Revolution it promotes is chaos; it is disorder; it is infernal rebellion against the divine order so as to impose Satan’s tyranny. Now, as we see what is happening around us, we understand how mendacious were the promises of progress and freedom made by those who destroyed Christian society, and how deceptive was the prospect of a new Tower of Babel, built not only without regard for God but even in direct opposition to Him.\nThe infernal challenge of the Enemy is repeated over the centuries unchanged, but it is doomed to inexorable failure. Behind this millennial conspiracy, the adversary is always the same, and the only thing that changes are the particular individuals who cooperate with him.\nHe’s absolutely correct. Read the whole thing.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "globalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-12-19T21:34:57+00:00"
}