{
  "url": "https://voxday.net/2021/12/18/arkhaven-is-the-best/",
  "scraped_at": "2026-01-08T13:03:14.303705",
  "title": "“Arkhaven is the BEST”",
  "date_display": "December 18, 2021",
  "date_iso": "2021-12-18T15:17:05+00:00",
  "date_from_url": "2021-12-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is <a href=\"https://www.youtube.com/watch?v=gJMKOE7cfgU\">an intriguing video</a> from a comics book reviewer and illustrator who has not only been reading Arktoons, but is apparently going to be putting some of his original work up there in the near future. Full disclosure: There is nothing to disclose, as I know nothing about the reviewer or his forthcoming comic. The latter is news to me since I leave all that sort of thing up to the Production Editor and I usually learn about a new independent series the day before it first appears on the site.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Today’s topic is Arkhaven Comics.  Arkhaven Comics is kind of like a Webtoons-inspired comics website primarily helmed by Chuck Dixon, although there are a number of other talented writers and artists across the board on the website. And this place, this website has been a haven and a godsend for me in many ways…</p><p>That’s arkhaven.com probably one of the best resources for independent and professional grade comics out there at the moment. 100 percent free, so if you want to get into comics and you’re looking for new things to read or you want to check out the indie comic space and support some independent creators, check out arkhaven.com.</p><cite>Arkhaven is the BEST place for FREE COMICS!</cite></blockquote><p>What pleases me so much about this video is that a) it represents a viewpoint from entirely outside the greater community, and b) it demonstrates how some of the less-viewed comics have their own loyal followings and are able to hold their own. While the site traffic has seen slow, but steady growth since Asteroid Day in April, we’ve begun to see some increased growth over the last month, and as Chuck Dixon observed last week, each million views is coming faster as we begin to approach the four-million mark.</p><p>The interesting thing is that while we don’t have anywhere nearly as many comics series as Tapas or Webtoons, we probably have more strong series than Tapas already and our best series are now capable of going head-to-head with the very best that Webtoons has to offer. And while we still have a very long ways to go in terms of the number of independent creators, views, and subscribers, it’s becoming clear to neutral observers that Arktoons is not only a competitive toons site, but is already, as the reviewer asserts, <em><strong>“the best place”</strong></em>.</p><p>And it’s going to continue improving. We’re already making plans for much higher resolutions and are beginning to lay the groundwork for that with some of our leading comics such as <em>Hypergamouse</em>, <em>How To Succeed Like a Darklord</em>, and <em>Midnight’s War</em>, while we’ll be introducing great new comics such as <em>Witchstalker </em>and <em>Red Hornet </em>in 2022. So, if you want to help us continue to advance on this front, don’t hesitate <a href=\"https://arkhavencomics.com/product-category/subscriptions/arktoons/?orderby=price&amp;q=%2Fproduct-category%2Fsubscriptions%2Farktoons%2F\">to become an Arkhaven subscriber</a> subscriber in the new year.</p><p><em><a href=\"https://social.infogalactic.com/micropost/1949caf8-2f89-4913-84c0-6106b2d70f21\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This is\nan intriguing video\nfrom a comics book reviewer and illustrator who has not only been reading Arktoons, but is apparently going to be putting some of his original work up there in the near future. Full disclosure: There is nothing to disclose, as I know nothing about the reviewer or his forthcoming comic. The latter is news to me since I leave all that sort of thing up to the Production Editor and I usually learn about a new independent series the day before it first appears on the site.\nToday’s topic is Arkhaven Comics.  Arkhaven Comics is kind of like a Webtoons-inspired comics website primarily helmed by Chuck Dixon, although there are a number of other talented writers and artists across the board on the website. And this place, this website has been a haven and a godsend for me in many ways…\nThat’s arkhaven.com probably one of the best resources for independent and professional grade comics out there at the moment. 100 percent free, so if you want to get into comics and you’re looking for new things to read or you want to check out the indie comic space and support some independent creators, check out arkhaven.com.\nArkhaven is the BEST place for FREE COMICS!\nWhat pleases me so much about this video is that a) it represents a viewpoint from entirely outside the greater community, and b) it demonstrates how some of the less-viewed comics have their own loyal followings and are able to hold their own. While the site traffic has seen slow, but steady growth since Asteroid Day in April, we’ve begun to see some increased growth over the last month, and as Chuck Dixon observed last week, each million views is coming faster as we begin to approach the four-million mark.\nThe interesting thing is that while we don’t have anywhere nearly as many comics series as Tapas or Webtoons, we probably have more strong series than Tapas already and our best series are now capable of going head-to-head with the very best that Webtoons has to offer. And while we still have a very long ways to go in terms of the number of independent creators, views, and subscribers, it’s becoming clear to neutral observers that Arktoons is not only a competitive toons site, but is already, as the reviewer asserts,\n“the best place”\n.\nAnd it’s going to continue improving. We’re already making plans for much higher resolutions and are beginning to lay the groundwork for that with some of our leading comics such as\nHypergamouse\n,\nHow To Succeed Like a Darklord\n, and\nMidnight’s War\n, while we’ll be introducing great new comics such as\nWitchstalker\nand\nRed Hornet\nin 2022. So, if you want to help us continue to advance on this front, don’t hesitate\nto become an Arkhaven subscriber\nsubscriber in the new year.\nDISCUSS ON SG",
  "tags": [
    "Arktoons",
    "comics",
    "reviews"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-12-18T15:42:52+00:00"
}