{
  "url": "https://voxday.net/2021/12/05/china-claims-the-moral-high-ground/",
  "scraped_at": "2026-01-08T13:01:34.484949",
  "title": "China Claims the Moral High Ground",
  "date_display": "December 5, 2021",
  "date_iso": "2021-12-05T11:24:45+00:00",
  "date_from_url": "2021-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For more than 100 years, the neo-liberal world order has claimed the international moral high ground on the basis of being “democratic”. The Allies who fought Germany in WWII – France, Britain, and the USA – were often referred to as “the Western democracies”, and “spreading democracy” has been the primary justification for US military invasions for the last three decades.</p><p>But now, in the aftermath of the shocking 2020 revelation that US democracy is a massive and fraudulent sham, <a href=\"https://www.globaltimes.cn/page/202112/1240628.shtml\">China has launched a direct rhetorical assault on the West’s primary claim</a> to possess the moral high ground on the international scene. This is a form of unrestricted warfare that strongly suggests Chinese strategists are very familiar with William S. Lind’s concept of 4th Generation Warfare.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>China’s democracy is more extensive, more genuine and more effective than the US democracy, as the US politicians represent the interest groups but in China the whole-process democracy ensures implementation of policies that change people’s lives, senior Chinese officials said on Saturday as China issued a white paper titled “China: Democracy That Works.”</p><p>Under the US democratic system, politicians are agents of interest groups, rather than representing the interests of the majority of voters and the interests of the country as a whole, Tian Peiyan, Deputy Director of the Policy Research Office of the CPC Central Committee, said at a press conference on the launch of the white paper on Saturday.</p><p>“Those politicians can make random promises for the sake of elections, but they seldom fulfill their promises after being elected. Superficially they accept voters’ supervision, but in fact as long as they are elected, the voters have no option but to wait for the next election. They are only awakened during voting but become dormant after voting,” Tian said.</p><p>US voters listen to those dazzling slogans only during the election, but they have no say after the election, the Chinese official said.</p><p>However, China’s democracy is whole process people’s democracy under the leadership of the CPC, the Chinese official continued. Party members and leaders at all levels must accept the whole process and all-round supervision of the Party and the people when performing their duties to ensure that the power granted by the people is always used for serving the people’s interest.</p><p>And they also maintain a close contact with the public, listening to people’s requests and striving to solve their problems.</p><p>The different behavior of US politicians before and after elections is due to the lack of a supervising mechanism for politicians including congressmen after they are elected, Guo Zhenhua, Deputy Secretary General of the Standing Committee of the NPC, told the press conference.</p></blockquote><p>Don’t be surprised if the concept of “whole-process democracy” is successful in superseding the increasingly outmoded concept of “representative democracy” that is neither representative nor democratic, and which completely fails to represent the will of the people in any way, shape, or form. Because it is entirely obvious to any honest observer that the USA and the European Union are not only exhibiting democratic deficits, but now possess <a href=\"https://www.globaltimes.cn/page/202112/1240661.shtml\">overtly anti-democratic regimes</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>Chinese Foreign Ministry on Sunday released a report on US democracy, exposing the deficiencies and abuse of democracy in the US as well as the harm of it exporting such democracy…. Democracy is a common value shared by all humanity, said the report. It is a right for all nations, not a prerogative reserved for a few. Democracy takes different forms, and there is no one-size-fits-all model. It would be totally undemocratic to measure the diverse political systems of the world with a single yardstick or examine different political civilizations from a single perspective. The political system of a country should be independently decided by its own people, the report said.</em></p></blockquote><p>And, of course, all the complaints about China’s social credit scores and violations of human rights sound very thin in light of the bannings, prison terms, deplatformings, lockdowns, disemployments, mandates, and even forced vaccinations presently being imposed throughout the West.</p><p><em><a href=\"https://social.infogalactic.com/micropost/8c8a53cf-250c-4943-aa97-4eb42b8a8d7c\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "For more than 100 years, the neo-liberal world order has claimed the international moral high ground on the basis of being “democratic”. The Allies who fought Germany in WWII – France, Britain, and the USA – were often referred to as “the Western democracies”, and “spreading democracy” has been the primary justification for US military invasions for the last three decades.\nBut now, in the aftermath of the shocking 2020 revelation that US democracy is a massive and fraudulent sham,\nChina has launched a direct rhetorical assault on the West’s primary claim\nto possess the moral high ground on the international scene. This is a form of unrestricted warfare that strongly suggests Chinese strategists are very familiar with William S. Lind’s concept of 4th Generation Warfare.\nChina’s democracy is more extensive, more genuine and more effective than the US democracy, as the US politicians represent the interest groups but in China the whole-process democracy ensures implementation of policies that change people’s lives, senior Chinese officials said on Saturday as China issued a white paper titled “China: Democracy That Works.”\nUnder the US democratic system, politicians are agents of interest groups, rather than representing the interests of the majority of voters and the interests of the country as a whole, Tian Peiyan, Deputy Director of the Policy Research Office of the CPC Central Committee, said at a press conference on the launch of the white paper on Saturday.\n“Those politicians can make random promises for the sake of elections, but they seldom fulfill their promises after being elected. Superficially they accept voters’ supervision, but in fact as long as they are elected, the voters have no option but to wait for the next election. They are only awakened during voting but become dormant after voting,” Tian said.\nUS voters listen to those dazzling slogans only during the election, but they have no say after the election, the Chinese official said.\nHowever, China’s democracy is whole process people’s democracy under the leadership of the CPC, the Chinese official continued. Party members and leaders at all levels must accept the whole process and all-round supervision of the Party and the people when performing their duties to ensure that the power granted by the people is always used for serving the people’s interest.\nAnd they also maintain a close contact with the public, listening to people’s requests and striving to solve their problems.\nThe different behavior of US politicians before and after elections is due to the lack of a supervising mechanism for politicians including congressmen after they are elected, Guo Zhenhua, Deputy Secretary General of the Standing Committee of the NPC, told the press conference.\nDon’t be surprised if the concept of “whole-process democracy” is successful in superseding the increasingly outmoded concept of “representative democracy” that is neither representative nor democratic, and which completely fails to represent the will of the people in any way, shape, or form. Because it is entirely obvious to any honest observer that the USA and the European Union are not only exhibiting democratic deficits, but now possess\novertly anti-democratic regimes\n.\nChinese Foreign Ministry on Sunday released a report on US democracy, exposing the deficiencies and abuse of democracy in the US as well as the harm of it exporting such democracy…. Democracy is a common value shared by all humanity, said the report. It is a right for all nations, not a prerogative reserved for a few. Democracy takes different forms, and there is no one-size-fits-all model. It would be totally undemocratic to measure the diverse political systems of the world with a single yardstick or examine different political civilizations from a single perspective. The political system of a country should be independently decided by its own people, the report said.\nAnd, of course, all the complaints about China’s social credit scores and violations of human rights sound very thin in light of the bannings, prison terms, deplatformings, lockdowns, disemployments, mandates, and even forced vaccinations presently being imposed throughout the West.\nDISCUSS ON SG",
  "tags": [
    "China",
    "politics",
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-12-05T12:46:09+00:00"
}