{
  "url": "https://voxday.net/2021/12/20/hospitals-as-hit-men/",
  "scraped_at": "2026-01-08T13:03:27.112820",
  "title": "Hospitals as Hit Men",
  "date_display": "December 20, 2021",
  "date_iso": "2021-12-20T08:10:00+00:00",
  "date_from_url": "2021-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In his pre-Christmas letter, Archbishop Vigano referred to “the deliberately wrong treatments that have been given in order to cause more deaths.” And as I pointed out on last night’s Darkstream, one can no more expect a hospital, once converged, <a href=\"https://aapsonline.org/bidens-bounty-on-your-life-hospitals-incentive-payments-for-covid-19/\">to perform its primary mission of saving human lives</a> than one can reasonably expect a converged university to provide its primary mission of providing higher education.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Upon admission to a once-trusted hospital, American patients with COVID-19 become virtual prisoners, subjected to a rigid treatment protocol with roots in Ezekiel Emanuel’s “Complete Lives System” for rationing medical care in those over age 50. They have a shockingly high mortality rate. How and why is this happening, and what can be done about it?</p><p>As exposed in audio recordings, hospital executives in Arizona admitted meeting several times a week to <em>lower </em>standards of care, with coordinated restrictions on visitation rights. Most COVID-19 patients’ families are deliberately kept in the dark about what is really being done to their loved ones.</p><p>The combination that enables this tragic and avoidable loss of hundreds of thousands of lives includes (1) The CARES Act, which provides hospitals with bonus incentive payments for all things related to COVID-19 (testing, diagnosing, admitting to hospital, use of remdesivir and ventilators, reporting COVID-19 deaths, and vaccinations) and (2) waivers of customary and long-standing patient rights by the Centers for Medicare and Medicaid Services (CMS).</p><p>In 2020, the Texas Hospital Association submitted requests for waivers to CMS. According to Texas attorney Jerri Ward, “CMS has granted ‘waivers’ of federal law regarding patient rights. Specifically, CMS purports to allow hospitals to violate the rights of patients or their surrogates with regard to medical record access, to have patient visitation, and to be free from seclusion.” She notes that “rights do not come from the hospital or CMS and cannot be waived, as that is the antithesis of a ‘right.’ The purported waivers are meant to isolate and gain total control over the patient and to deny patient and patient’s decision-maker the ability to exercise informed consent.”</p><p>Creating a “National Pandemic Emergency” provided justification for such sweeping actions that override individual physician medical decision-making and patients’ rights. The CARES Act provides incentives for hospitals to use treatments dictated solely by the federal government under the auspices of the NIH. These “bounties” must paid back if not “earned” by making the COVID-19 diagnosis and following the COVID-19 protocol.</p><p>The hospital payments include:</p><p>A “free” required PCR test in the Emergency Room or upon admission for every patient, with government-paid fee to hospital.<br/>Added bonus payment for each positive COVID-19 diagnosis.<br/>Another bonus for a COVID-19 admission to the hospital.<br/>A 20 percent “boost” bonus payment from Medicare on the entire hospital bill for use of remdesivir instead of medicines such as Ivermectin.<br/>Another and larger bonus payment to the hospital if a COVID-19 patient is mechanically ventilated.<br/>More money to the hospital if cause of death is listed as COVID-19, even if patient did not die directly of COVID-19.</p></blockquote><p>There was no “Covid pandemic” per se. What actually happened was the deliberate weaponization of cold and flu season, made to look more lethal than normal by the intentional euthanization of elderly patients in hospitals and nursing homes. This isn’t a “conspiracy theory”, it is a fully-substantiated, copiously-documented observation that you yourself witnessed in real time.</p><p>The bonus for the remdesivir protocol is particularly damning. An experimental drug for Ebola <a href=\"https://www.nih.gov/news-events/nih-research-matters/two-drugs-reduce-risk-death-ebola\" rel=\"noreferrer noopener\" target=\"_blank\">that killed a substantial percentage of its test subjects</a> is obviously not a reasonable treatment for a virus that doesn’t kill 99.98 percent of the patients infected.</p><p><em>The Ebola virus spreads through direct contact with broken skin or mucous membranes in the eyes, nose, or mouth. The World Health Organization estimates that the virus kills about half of the people who contract it…. After results from the first 499 participants had been reviewed, the trial’s safety monitors recommended that two drugs—ZMapp and remdesivir—be dropped from the remainder of the trial. These two drugs were much less effective at preventing death. </em></p><p>Note that <a href=\"https://epicentre.msf.org/en/publications/randomized-controlled-trial-ebola-virus-disease-therapeutics\">51.3 percen</a>t of the patients who received ZMapp and remdesivir died, compared to 49.7 percent of those who received only ZMapp.</p><p><em><a href=\"https://social.infogalactic.com/micropost/627dc3e9-191b-4af2-8b17-2288c4c73e8d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "In his pre-Christmas letter, Archbishop Vigano referred to “the deliberately wrong treatments that have been given in order to cause more deaths.” And as I pointed out on last night’s Darkstream, one can no more expect a hospital, once converged,\nto perform its primary mission of saving human lives\nthan one can reasonably expect a converged university to provide its primary mission of providing higher education.\nUpon admission to a once-trusted hospital, American patients with COVID-19 become virtual prisoners, subjected to a rigid treatment protocol with roots in Ezekiel Emanuel’s “Complete Lives System” for rationing medical care in those over age 50. They have a shockingly high mortality rate. How and why is this happening, and what can be done about it?\nAs exposed in audio recordings, hospital executives in Arizona admitted meeting several times a week to\nlower\nstandards of care, with coordinated restrictions on visitation rights. Most COVID-19 patients’ families are deliberately kept in the dark about what is really being done to their loved ones.\nThe combination that enables this tragic and avoidable loss of hundreds of thousands of lives includes (1) The CARES Act, which provides hospitals with bonus incentive payments for all things related to COVID-19 (testing, diagnosing, admitting to hospital, use of remdesivir and ventilators, reporting COVID-19 deaths, and vaccinations) and (2) waivers of customary and long-standing patient rights by the Centers for Medicare and Medicaid Services (CMS).\nIn 2020, the Texas Hospital Association submitted requests for waivers to CMS. According to Texas attorney Jerri Ward, “CMS has granted ‘waivers’ of federal law regarding patient rights. Specifically, CMS purports to allow hospitals to violate the rights of patients or their surrogates with regard to medical record access, to have patient visitation, and to be free from seclusion.” She notes that “rights do not come from the hospital or CMS and cannot be waived, as that is the antithesis of a ‘right.’ The purported waivers are meant to isolate and gain total control over the patient and to deny patient and patient’s decision-maker the ability to exercise informed consent.”\nCreating a “National Pandemic Emergency” provided justification for such sweeping actions that override individual physician medical decision-making and patients’ rights. The CARES Act provides incentives for hospitals to use treatments dictated solely by the federal government under the auspices of the NIH. These “bounties” must paid back if not “earned” by making the COVID-19 diagnosis and following the COVID-19 protocol.\nThe hospital payments include:\nA “free” required PCR test in the Emergency Room or upon admission for every patient, with government-paid fee to hospital.\nAdded bonus payment for each positive COVID-19 diagnosis.\nAnother bonus for a COVID-19 admission to the hospital.\nA 20 percent “boost” bonus payment from Medicare on the entire hospital bill for use of remdesivir instead of medicines such as Ivermectin.\nAnother and larger bonus payment to the hospital if a COVID-19 patient is mechanically ventilated.\nMore money to the hospital if cause of death is listed as COVID-19, even if patient did not die directly of COVID-19.\nThere was no “Covid pandemic” per se. What actually happened was the deliberate weaponization of cold and flu season, made to look more lethal than normal by the intentional euthanization of elderly patients in hospitals and nursing homes. This isn’t a “conspiracy theory”, it is a fully-substantiated, copiously-documented observation that you yourself witnessed in real time.\nThe bonus for the remdesivir protocol is particularly damning. An experimental drug for Ebola\nthat killed a substantial percentage of its test subjects\nis obviously not a reasonable treatment for a virus that doesn’t kill 99.98 percent of the patients infected.\nThe Ebola virus spreads through direct contact with broken skin or mucous membranes in the eyes, nose, or mouth. The World Health Organization estimates that the virus kills about half of the people who contract it…. After results from the first 499 participants had been reviewed, the trial’s safety monitors recommended that two drugs—ZMapp and remdesivir—be dropped from the remainder of the trial. These two drugs were much less effective at preventing death.\nNote that\n51.3 percen\nt of the patients who received ZMapp and remdesivir died, compared to 49.7 percent of those who received only ZMapp.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "globalism",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-12-20T12:20:43+00:00"
}