{
  "url": "https://voxday.net/2021/12/07/i-really-dont-miss-it/",
  "scraped_at": "2026-01-08T13:01:49.041770",
  "title": "I Really Don’t Miss It",
  "date_display": "December 7, 2021",
  "date_iso": "2021-12-07T13:27:14+00:00",
  "date_from_url": "2021-12-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Occasionally I’m asked if I miss Minnesota. My answer is always: <a href=\"https://alphanews.org/video-mob-invades-apartment-in-minneapolis-beats-woman-and-her-mother/\">“not even a little bit”</a>. And I’m not referring to the cold weather or the mosquito season.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Shocking footage uploaded to social media Sunday night appears to show about a dozen youths forcing their way into an apartment to attack a woman and her mother.</p><p>Unconfirmed reports circulated on social media suggest that the young woman who was the target of this invasion and attack earned the ire of the mob by accusing a man who is friends with the mob of sexually assaulting her. It appears that the woman who was attacked leveled this accusation on TikTok, where both her and the man she named have a notable presence in the Minneapolis area.</p><p>The main video of the incident opens in an elevator as a group of Somali youths, some wearing face masks apparently to conceal their identity, approach their target. After a minor confrontation with a man walking in the apartment building’s hallway, the majority of the group stands back as two individuals knock on the targeted individual’s door.</p></blockquote><p>Minnesota was always doomed to descend into ethnic strife because the native population was the most clueless, intellectually-defenseless, and ideologically-retarded population in the entire USA at the end of the previous century. See the 1984 and 1988 presidential elections if you don’t know what I’m talking about. The cult of nice combined with the left-wing politics, the total unfamiliarity with non-European cultures, and the Scandinavian heritage that prioritizes communal approval <em>uber alles</em> laid the foundation for the perfect storm of vibrancy that has been unfolding in Minneapolis and spreading out as far as Rochester for the last two decades.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img alt=\"\" decoding=\"async\" fetchpriority=\"high\" height=\"496\" src=\"https://social.infogalactic.com/images/posts/301838b0-5020-4c68-bcfe-cc21c0cf0d1b/original-a5c3d688cc34457d86f43a8bbe470630.png?v=63806103310\" width=\"512\"/></figure></div><p>The level of denial in which most Minnesotans now engage on a daily basis has to be experienced to be believed. There can be literal riots, complete with burning police stations, looting, and dozens of shots being fired, and the normal Minnesota response is: “Well, that’s all happening over there. It can’t happen here!” And they will cling to this notion even when “over there” means “one city block away”.</p><p>It’s probably not a coincidence that the phrase “it can’t happen here” was popularized by a man born in Sauk Centre.</p><p><em><a href=\"https://social.infogalactic.com/micropost/209458b6-40ef-4036-be07-bf9c1fec4882\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Occasionally I’m asked if I miss Minnesota. My answer is always:\n“not even a little bit”\n. And I’m not referring to the cold weather or the mosquito season.\nShocking footage uploaded to social media Sunday night appears to show about a dozen youths forcing their way into an apartment to attack a woman and her mother.\nUnconfirmed reports circulated on social media suggest that the young woman who was the target of this invasion and attack earned the ire of the mob by accusing a man who is friends with the mob of sexually assaulting her. It appears that the woman who was attacked leveled this accusation on TikTok, where both her and the man she named have a notable presence in the Minneapolis area.\nThe main video of the incident opens in an elevator as a group of Somali youths, some wearing face masks apparently to conceal their identity, approach their target. After a minor confrontation with a man walking in the apartment building’s hallway, the majority of the group stands back as two individuals knock on the targeted individual’s door.\nMinnesota was always doomed to descend into ethnic strife because the native population was the most clueless, intellectually-defenseless, and ideologically-retarded population in the entire USA at the end of the previous century. See the 1984 and 1988 presidential elections if you don’t know what I’m talking about. The cult of nice combined with the left-wing politics, the total unfamiliarity with non-European cultures, and the Scandinavian heritage that prioritizes communal approval\nuber alles\nlaid the foundation for the perfect storm of vibrancy that has been unfolding in Minneapolis and spreading out as far as Rochester for the last two decades.\nThe level of denial in which most Minnesotans now engage on a daily basis has to be experienced to be believed. There can be literal riots, complete with burning police stations, looting, and dozens of shots being fired, and the normal Minnesota response is: “Well, that’s all happening over there. It can’t happen here!” And they will cling to this notion even when “over there” means “one city block away”.\nIt’s probably not a coincidence that the phrase “it can’t happen here” was popularized by a man born in Sauk Centre.\nDISCUSS ON SG",
  "tags": [
    "decline and fall",
    "immigration",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-12-07T13:42:19+00:00"
}