{
  "url": "https://voxday.net/2021/12/30/unearthing-the-stranded/",
  "scraped_at": "2026-01-08T13:04:47.432581",
  "title": "Unearthing THE STRANDED",
  "date_display": "December 30, 2021",
  "date_iso": "2021-12-30T18:13:34+00:00",
  "date_from_url": "2021-12-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bounding Into Comics <a href=\"https://boundingintocomics.com/2021/12/30/classic-chuck-dixon-story-added-to-arktoons-as-digital-comics-platform-hits-4-million-pageviews/\">dives into the history</a> of the newest Arktoons series, <em>The Stranded</em>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Digital comic website, Arktoons, added a classic Chuck Dixon story to their library as the site celebrates 4 million pageviews since it launched back in April. The classic Chuck Dixon story added to the platform is <em>The Stranded</em> that features artwork by Argentinian artist Enrique Villagran.</p><p>The series was originally published by Apple Comics and titled <em>The Time Jump War</em> back in 1989. Arktoons is publishing the series under its original name before it was changed by Apple Comics. Not only has the title been reverted to its original, but Arktoons has also remastered the series. It was originally published in black and white and has now been fully colored.</p><p>As for the story it follows U.S. Space Cavalry Captain Doyle Macklinton as he pilots a troop transport full of Marines with his co-pilot Lieutenant Veronic ‘Ronnie’ Killy as they do battle against an invading alien force. However, once they engage the alien forces on Europa they travel through a time warp and find themselves stranded in prehistoric Earth. Not only are they stranded, but a number of the alien forces also made it through the warp and still have their plans of conquering Earth.</p><p>The original official description from Apple Comics stated, “When rocket jockey Capt. ‘Doy’ MacKlinton and his beautiful co-pilot, ‘Ronnie’ Killy blasted the invading aliens’ stargate, they thought they’d stopped the invasion – instead, they discovered they’d trapped themselves in the prehistoric past! Now, even though Doy and Ronnie can’t understand the language of their own ancestors, they must lead them – with only stones and spears – against the deadly high-tech alien menace!</p><p>”When the series was originally published by Apple Comics it included commentary by Chuck Dixon detailing how the series came about.</p><p>Dixon explained, “In the dark days of Winter, 1988, Enrique Villagran and his brother, Ricardo, invited me to the studio they shared in the Philadelphia suburbs. As usual on these visits, we had an animated discussion of comics and movies and guns until the early hours of the morning.”</p><p>He added, “On this particular evening, between the jokes and the stories, Enrique showed me some drawings he had done. They were in his usual crisp and attractive style and depicted male and female space warriors and a scantily-clad cavegirl.”</p><p>“He asked me what I thought of them. I told him they looked great and asked what story they went with. He replied that they went with whatever story I chose for them to go with,” he detailed.</p></blockquote><p>BIC also observed the recent FOUR MILLION mark that Arktoons recently surpassed.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>When the site launched it featured 16 different series. In just its first year the site now has 60 different series that run new episodes on a weekly or twice-weekly basis… Dixon, who has numerous titles on the platform also observed, “Everyone can see all the numbers right there on the site. And everyone can see that the time between each million views is becoming shorter and shorter.”</p><p>The most popular series on the platform are <em>Hypergamouse</em>, a romance comedy about mice, <em>Savage Memes</em>, a comic strip featuring “viciously biting commentary on current events,” <em>Stonetoss</em>, a similar comic strip in the vein of Savage Memes, and <em>Midnight’s War</em>, “a vampire comic with enough violent intrigue to rival <em>A Game of Thrones</em>.”</p><p>It’s also introduced a number of new series that are quickly gaining in popularity including <em>How To Succeed Like A Dark Lord</em> and <em>My Sister Suprema</em>.</p><p>Needless to say it doesn’t look like Arktoons is going anywhere, but up as it provides a clear alternative to Marvel, DC, and even WEBTOON.</p></blockquote><p><a href=\"https://boundingintocomics.com/2021/12/30/classic-chuck-dixon-story-added-to-arktoons-as-digital-comics-platform-hits-4-million-pageviews/\">Read the whole thing</a> there.</p></div>",
  "content_text": "Bounding Into Comics\ndives into the history\nof the newest Arktoons series,\nThe Stranded\n.\nDigital comic website, Arktoons, added a classic Chuck Dixon story to their library as the site celebrates 4 million pageviews since it launched back in April. The classic Chuck Dixon story added to the platform is\nThe Stranded\nthat features artwork by Argentinian artist Enrique Villagran.\nThe series was originally published by Apple Comics and titled\nThe Time Jump War\nback in 1989. Arktoons is publishing the series under its original name before it was changed by Apple Comics. Not only has the title been reverted to its original, but Arktoons has also remastered the series. It was originally published in black and white and has now been fully colored.\nAs for the story it follows U.S. Space Cavalry Captain Doyle Macklinton as he pilots a troop transport full of Marines with his co-pilot Lieutenant Veronic ‘Ronnie’ Killy as they do battle against an invading alien force. However, once they engage the alien forces on Europa they travel through a time warp and find themselves stranded in prehistoric Earth. Not only are they stranded, but a number of the alien forces also made it through the warp and still have their plans of conquering Earth.\nThe original official description from Apple Comics stated, “When rocket jockey Capt. ‘Doy’ MacKlinton and his beautiful co-pilot, ‘Ronnie’ Killy blasted the invading aliens’ stargate, they thought they’d stopped the invasion – instead, they discovered they’d trapped themselves in the prehistoric past! Now, even though Doy and Ronnie can’t understand the language of their own ancestors, they must lead them – with only stones and spears – against the deadly high-tech alien menace!\n”When the series was originally published by Apple Comics it included commentary by Chuck Dixon detailing how the series came about.\nDixon explained, “In the dark days of Winter, 1988, Enrique Villagran and his brother, Ricardo, invited me to the studio they shared in the Philadelphia suburbs. As usual on these visits, we had an animated discussion of comics and movies and guns until the early hours of the morning.”\nHe added, “On this particular evening, between the jokes and the stories, Enrique showed me some drawings he had done. They were in his usual crisp and attractive style and depicted male and female space warriors and a scantily-clad cavegirl.”\n“He asked me what I thought of them. I told him they looked great and asked what story they went with. He replied that they went with whatever story I chose for them to go with,” he detailed.\nBIC also observed the recent FOUR MILLION mark that Arktoons recently surpassed.\nWhen the site launched it featured 16 different series. In just its first year the site now has 60 different series that run new episodes on a weekly or twice-weekly basis… Dixon, who has numerous titles on the platform also observed, “Everyone can see all the numbers right there on the site. And everyone can see that the time between each million views is becoming shorter and shorter.”\nThe most popular series on the platform are\nHypergamouse\n, a romance comedy about mice,\nSavage Memes\n, a comic strip featuring “viciously biting commentary on current events,”\nStonetoss\n, a similar comic strip in the vein of Savage Memes, and\nMidnight’s War\n, “a vampire comic with enough violent intrigue to rival\nA Game of Thrones\n.”\nIt’s also introduced a number of new series that are quickly gaining in popularity including\nHow To Succeed Like A Dark Lord\nand\nMy Sister Suprema\n.\nNeedless to say it doesn’t look like Arktoons is going anywhere, but up as it provides a clear alternative to Marvel, DC, and even WEBTOON.\nRead the whole thing\nthere.",
  "tags": [
    "Arktoons",
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-12-30T18:13:36+00:00"
}