{
  "url": "https://voxday.net/2021/12/24/why-russia-will-win/",
  "scraped_at": "2026-01-08T13:03:57.110270",
  "title": "Why Russia Will Win",
  "date_display": "December 24, 2021",
  "date_iso": "2021-12-24T11:08:47+00:00",
  "date_from_url": "2021-12-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Vladimir Putin’s position on his government’s ability to impose vaccination on his people <a href=\"https://www.anonymousconservative.com/blog/news-briefs-12-24-2021/\">demonstrates that he is much more intelligent</a> than the Promethean leaders of the Western states:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>No “prosecution measures” should be imposed for the refusal to receive the vaccine, as “action force is always equal to reaction force,” President Putin said, emphasizing that it is necessary to patiently explain why immunization is essential and to encourage people to receive the vaccine, but there should be no prosecution. </em></p><p>Again, people tell you their psychology, by explaining how they think others will operate. This will tell you, when dealing with Putin, “action force” applied to him will always equal “reaction force” from him. It is very tough to not like a guy like that, and it is even tougher to not respect a guy like that as well. And in governance, it produces a very respectful, empathetic governing style. Notice how our Cabal leaders operate on a premise that action force applied to people should always produce immediate capitulation. It tells you something about them as well.</p></blockquote><p>Putin actually understates his own case in the interest of rhetorical balance. In the dialectial reality, political force is not subject to the laws of physics. For most political actions, the reaction force will be considerably less than the initial action, until the government goes too far and the reaction force becomes disproportionately greater than the initial action. For example, that point has already been reached <a href=\"https://www.newsflare.com/video/469478/mass-rampage-in-a-district-in-indonesia-as-a-result-of-a-resident-dies-after-being-injected-with-an-anti-covid-19-vaccine\">in occupied West Papua</a>, where distrust for the government is considerably greater than in Germany or even the USA.</p><p><em>Security forces fired shots to regain control after locals destroyed a health centre on 17 December, convinced the vaccine it was administering had killed a village elder. The atmosphere in Ransiki District of South Manokwari Regency in West Papua Province became tense after a mob became angry over the death of local village head Alpius Iba. Alpius died after being injected with vaccine although it is unclear if it played any role in his death</em></p><p>That’s why mass demonstrations are both effective and important, and why they are so often faked and misreported, as genuine ones serve as a warning that the “reaction force tipping point” is being approached. They inform the authorities that they will soon have to either a) increase the action force and risk an even greater reaction or b) back down.</p><p>Putin, unlike the leaders who wrongly believe they are protected by NATO, is being careful to ensure his people are with him. He’s prepared for war. They, quite obviously, are not. That is why, if there is war over the Donbass, Russia will win.</p><p><em><a href=\"https://social.infogalactic.com/micropost/5eacfd8c-a8de-4ef4-8852-f227b2f301c0\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Vladimir Putin’s position on his government’s ability to impose vaccination on his people\ndemonstrates that he is much more intelligent\nthan the Promethean leaders of the Western states:\nNo “prosecution measures” should be imposed for the refusal to receive the vaccine, as “action force is always equal to reaction force,” President Putin said, emphasizing that it is necessary to patiently explain why immunization is essential and to encourage people to receive the vaccine, but there should be no prosecution.\nAgain, people tell you their psychology, by explaining how they think others will operate. This will tell you, when dealing with Putin, “action force” applied to him will always equal “reaction force” from him. It is very tough to not like a guy like that, and it is even tougher to not respect a guy like that as well. And in governance, it produces a very respectful, empathetic governing style. Notice how our Cabal leaders operate on a premise that action force applied to people should always produce immediate capitulation. It tells you something about them as well.\nPutin actually understates his own case in the interest of rhetorical balance. In the dialectial reality, political force is not subject to the laws of physics. For most political actions, the reaction force will be considerably less than the initial action, until the government goes too far and the reaction force becomes disproportionately greater than the initial action. For example, that point has already been reached\nin occupied West Papua\n, where distrust for the government is considerably greater than in Germany or even the USA.\nSecurity forces fired shots to regain control after locals destroyed a health centre on 17 December, convinced the vaccine it was administering had killed a village elder. The atmosphere in Ransiki District of South Manokwari Regency in West Papua Province became tense after a mob became angry over the death of local village head Alpius Iba. Alpius died after being injected with vaccine although it is unclear if it played any role in his death\nThat’s why mass demonstrations are both effective and important, and why they are so often faked and misreported, as genuine ones serve as a warning that the “reaction force tipping point” is being approached. They inform the authorities that they will soon have to either a) increase the action force and risk an even greater reaction or b) back down.\nPutin, unlike the leaders who wrongly believe they are protected by NATO, is being careful to ensure his people are with him. He’s prepared for war. They, quite obviously, are not. That is why, if there is war over the Donbass, Russia will win.\nDISCUSS ON SG",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2021-12-24T11:08:49+00:00"
}