{
  "url": "https://voxday.net/2021/12/20/you-got-to-boost-bro/",
  "scraped_at": "2026-01-08T13:03:28.937575",
  "title": "You Got to Boost, Bro!",
  "date_display": "December 20, 2021",
  "date_iso": "2021-12-20T13:00:00+00:00",
  "date_from_url": "2021-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img alt=\"\" decoding=\"async\" fetchpriority=\"high\" height=\"375\" src=\"https://crypto.fashion/image/cache/catalog/0ian/Depopulation%20Black-500x500.png\" width=\"375\"/></figure></div><p>First, I would remiss if I didn’t mention that Cryptofashion now has VAXX TRAX shirts on offer, featuring both <a href=\"https://crypto.fashion/dark-lord-designs/depop\">DEPOPULATION</a> and <a href=\"https://crypto.fashion/dark-lord-designs/lessthan\">LESS HUMAN THAN HUMAN </a>variants.</p><p>But that’s not actually what this post is about. Because the point is: <em>you’ve got to boost!</em> By which, of course, I mean listen to <a href=\"https://soundcloud.com/john-bradley-298288478/depopulation-booster?in=john-bradley-298288478/sets/vaxx-trax\">the BOOSTER MIX version of Depopulation</a>. Let’s just say that it is the sort of thing you might expect from the sort of people who listen to White Zombie and reach the conclusion: “you know, it’s not bad, but the one thing it really needs is MORE GUITAR!”</p><p><em>You’ve been tricked by a true deceiver<br/>You’ve been tricked by someone who wants to see you dead<br/>You’ve been tricked by a true believer<br/>You’ve been tricked by the false god of this earth</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/6a65f5e9-97a9-44ce-8b34-d67574f0f936\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "First, I would remiss if I didn’t mention that Cryptofashion now has VAXX TRAX shirts on offer, featuring both\nDEPOPULATION\nand\nLESS HUMAN THAN HUMAN\nvariants.\nBut that’s not actually what this post is about. Because the point is:\nyou’ve got to boost!\nBy which, of course, I mean listen to\nthe BOOSTER MIX version of Depopulation\n. Let’s just say that it is the sort of thing you might expect from the sort of people who listen to White Zombie and reach the conclusion: “you know, it’s not bad, but the one thing it really needs is MORE GUITAR!”\nYou’ve been tricked by a true deceiver\nYou’ve been tricked by someone who wants to see you dead\nYou’ve been tricked by a true believer\nYou’ve been tricked by the false god of this earth\nDISCUSS ON SG",
  "tags": [
    "CryptoFashion",
    "music",
    "Vaxx Trax"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-12-20T13:34:19+00:00"
}