{
  "url": "https://voxday.net/2019/07/03/an-excellent-choice/",
  "scraped_at": "2025-12-21T02:48:59.898986",
  "title": "An excellent choice",
  "date_display": "July 3, 2019",
  "date_iso": "2019-07-03T12:11:05+00:00",
  "date_from_url": "2019-07-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you want to see the rapid dismantling of the European Union, the selection of the “minister of the lack of defense” as the President of the European Commission <a href=\"https://www.rt.com/news/463271-german-defence-eu-president/\">is an almost ideal choice</a>:</p><blockquote><p>Germany’s Ursula von der Leyen is slated to lead the EU’s executive for five years. A model centrist liberal politician with a dubious record of overseeing Germany’s troubled military, she’s facing rough waters to navigate.</p><p>The long-serving German defense chief has all of a sudden come to the forefront as a future head of the European Union’s executive branch. That might be a little unexpected, as she was not even on the list of potential candidates until recently. Yet, after marathon debates the European leaders agreed that she would be the best fit for the position previously held by Jean-Claude Juncker.</p><p>Von der Leyen is a political veteran and the only person to have held a ministerial position in all four successive governments of Chancellor Angela Merkel since the German leader first came to power back in 2005.</p><p><b>Minister of lack of defense</b></p><p>Yet, her ministerial record is far from flawless. Over the past six years, during which von der Leyen headed the Defense Ministry, Germany’s armed forces, the Bundeswehr, have become a steady source of news about planes that can’t fly, tanks that break down, and vessels that are unfit for maritime operations….</p><p>Despite the mounting problems within her domain, von der Leyen has consistently supported the idea of an increased German military presence in foreign nations, sending German troops for peacekeeping missions to countries like Somalia, South Sudan and Mali. In 2016, Germany toed the line to join the US-led coalition fighting in Syria and Iraq. In March 2018, she told the German forces stationed in Afghanistan that her ministry does not plan to bring them home anytime soon – just after Berlin decided to ramp up the troop numbers in the war-torn country.</p><p>During her tenure as labor minister, von der Leyen lobbied for lower barriers to immigration, arguing that Germany needs a larger workforce. Two years later, at the height of the refugee crisis, she lashed out at the Hungarian Prime Minister Viktor Orban for his restrictive asylum policies by saying that his actions were “not acceptable” and violated “the European rules.”</p><p>She is also a strong proponent of deep European integration. In 2011, she said she would like to see the emergence of a “United States of Europe” built on the example of Germany or the US, which are both federal states.</p></blockquote><p>She’s incompetent, imperious, and completely out of touch with the average European. Which suggests that by the end of her term, Italy, Hungary, and at least two other countries will either be out of the EU or in the process of leaving. You know von der Leyen is going to be exceptionally good for the nationalists of Europe when even a strongly pro-EU German newspaper like <i>Bild </i>describes the selection of a German politician to lead the EU as ‘horrifically short-sighted’.</p></div>",
  "content_text": "If you want to see the rapid dismantling of the European Union, the selection of the “minister of the lack of defense” as the President of the European Commission\nis an almost ideal choice\n:\nGermany’s Ursula von der Leyen is slated to lead the EU’s executive for five years. A model centrist liberal politician with a dubious record of overseeing Germany’s troubled military, she’s facing rough waters to navigate.\nThe long-serving German defense chief has all of a sudden come to the forefront as a future head of the European Union’s executive branch. That might be a little unexpected, as she was not even on the list of potential candidates until recently. Yet, after marathon debates the European leaders agreed that she would be the best fit for the position previously held by Jean-Claude Juncker.\nVon der Leyen is a political veteran and the only person to have held a ministerial position in all four successive governments of Chancellor Angela Merkel since the German leader first came to power back in 2005.\nMinister of lack of defense\nYet, her ministerial record is far from flawless. Over the past six years, during which von der Leyen headed the Defense Ministry, Germany’s armed forces, the Bundeswehr, have become a steady source of news about planes that can’t fly, tanks that break down, and vessels that are unfit for maritime operations….\nDespite the mounting problems within her domain, von der Leyen has consistently supported the idea of an increased German military presence in foreign nations, sending German troops for peacekeeping missions to countries like Somalia, South Sudan and Mali. In 2016, Germany toed the line to join the US-led coalition fighting in Syria and Iraq. In March 2018, she told the German forces stationed in Afghanistan that her ministry does not plan to bring them home anytime soon – just after Berlin decided to ramp up the troop numbers in the war-torn country.\nDuring her tenure as labor minister, von der Leyen lobbied for lower barriers to immigration, arguing that Germany needs a larger workforce. Two years later, at the height of the refugee crisis, she lashed out at the Hungarian Prime Minister Viktor Orban for his restrictive asylum policies by saying that his actions were “not acceptable” and violated “the European rules.”\nShe is also a strong proponent of deep European integration. In 2011, she said she would like to see the emergence of a “United States of Europe” built on the example of Germany or the US, which are both federal states.\nShe’s incompetent, imperious, and completely out of touch with the average European. Which suggests that by the end of her term, Italy, Hungary, and at least two other countries will either be out of the EU or in the process of leaving. You know von der Leyen is going to be exceptionally good for the nationalists of Europe when even a strongly pro-EU German newspaper like\nBild\ndescribes the selection of a German politician to lead the EU as ‘horrifically short-sighted’.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-07-03T11:11:05+00:00"
}