{
  "url": "https://voxday.net/2019/07/27/deep-state-foiled-again/",
  "scraped_at": "2025-12-21T02:52:06.907325",
  "title": "Deep State foiled again?",
  "date_display": "July 27, 2019",
  "date_iso": "2019-07-27T00:52:13+00:00",
  "date_from_url": "2019-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The rumor is that <a href=\"https://edition.cnn.com/2019/07/25/politics/us-marines-arrested/index.html\">the arrested Marines</a> were smuggling in snipers who were intended to attack the President:</p><blockquote><p>Sixteen US Marines were arrested Thursday for alleged involvement in various illegal activities ranging from human smuggling to drug-related offenses, according to a statement from the Marine Corps.</p><p>The arrests took place in a dramatic fashion on Thursday morning at Camp Pendleton, California, during a battalion formation.</p><p>“Information gained from a previous human smuggling investigation precipitated the arrests,” the statement said. “None of the Marines arrested or detained for questioning served in support of the Southwest Border Support mission.”</p></blockquote><p>I assume these arrests were likely related to the news that an entire SEAL team had been sent home:</p><blockquote class=\"tr_bq\"><p>Thursday’s arrests come one day after the US military took the rare step of sending home an elite team of Navy SEALs from Iraq due to “a perceived deterioration of good order and discipline” that caused a military commander to lose “confidence in the team’s ability to accomplish the mission.” </p></blockquote><p>It looks like things are beginning to heat up quickly now that Epstein is in custody and Mueller has been exposed. And apparently it was Russian military intelligence <a href=\"http://www.whatdoesitmean.com/index2935.htm\">that exposed the plot</a>. We can only hope and pray that the President’s forces are prepared to act soon. Q is confident and states that nothing can stop what’s coming, and we can hope that they are correct.</p><p>However, note that the description of the former FBI agent comments on Tucker Carlson’s show was taken out of context, as they clearly referred to the Mueller hearing and not any assassination attempt. So, this may simply be someone putting a few known pieces of the puzzle together in a fictitious manner.</p></div>",
  "content_text": "The rumor is that\nthe arrested Marines\nwere smuggling in snipers who were intended to attack the President:\nSixteen US Marines were arrested Thursday for alleged involvement in various illegal activities ranging from human smuggling to drug-related offenses, according to a statement from the Marine Corps.\nThe arrests took place in a dramatic fashion on Thursday morning at Camp Pendleton, California, during a battalion formation.\n“Information gained from a previous human smuggling investigation precipitated the arrests,” the statement said. “None of the Marines arrested or detained for questioning served in support of the Southwest Border Support mission.”\nI assume these arrests were likely related to the news that an entire SEAL team had been sent home:\nThursday’s arrests come one day after the US military took the rare step of sending home an elite team of Navy SEALs from Iraq due to “a perceived deterioration of good order and discipline” that caused a military commander to lose “confidence in the team’s ability to accomplish the mission.”\nIt looks like things are beginning to heat up quickly now that Epstein is in custody and Mueller has been exposed. And apparently it was Russian military intelligence\nthat exposed the plot\n. We can only hope and pray that the President’s forces are prepared to act soon. Q is confident and states that nothing can stop what’s coming, and we can hope that they are correct.\nHowever, note that the description of the former FBI agent comments on Tucker Carlson’s show was taken out of context, as they clearly referred to the Mueller hearing and not any assassination attempt. So, this may simply be someone putting a few known pieces of the puzzle together in a fictitious manner.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-07-26T23:52:13+00:00"
}