{
  "url": "https://voxday.net/2019/07/23/disarming-the-attack-media/",
  "scraped_at": "2025-12-21T02:51:36.218143",
  "title": "Disarming the attack media",
  "date_display": "July 23, 2019",
  "date_iso": "2019-07-23T14:06:16+00:00",
  "date_from_url": "2019-07-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Deuce may have correctly anticipated the purpose of the <i>Wired </i>article that is purportedly about Google:</p><blockquote class=\"tr_bq\"><p>My guess is that they’re going to ask Google, purely out of journalistic interest of course, if they consider hosting an “alt-right” blog to be within their policies regarding hate speech.</p></blockquote><p>Yes, there is a very good chance that this is the author’s attempt to utilize a weaponized media platform in order to induce Google to break its contract with me. That is exactly <a href=\"https://www.revealnews.org/episodes/never-meet-your-super-heroes/\">what Amanda Robb tried to do</a>, unsuccessfully, with Amazon, and what she did somewhat more successfully with Indiegogo, much to the latter’s regret.</p><p>(In case you didn’t know, Indiegogo’s CEO, General Counsel, and Head of Trust &amp; Safety have all already become casualties of Indiegogo’s ongoing encounter with the Dread Ilk. And it’s not over yet; there is at least one more skull we anticipate collecting by the time this comes to an end. In the metaphorical sense, the <i>metaphorical </i>sense, you understand.)</p><blockquote><p>Al Letson: Why is Amazon distributing this book?</p><p>Amanda Robb: Well I asked Amazon, and someone from their PR department got back to me. He said it falls within their guidelines. He helpfully sent me a link to their guidelines so I click on them and it says their definition of offensive material is, and I’m quoting, “What we deem offensive is probably about what you would expect.”</p><p>Al Letson: That doesn’t make sense because I find this offensive and they don’t find it offensive.</p><p>Amanda Robb: Well it’s a very moveable goalpost, it turns out. Amazon changes what it thinks is offensive all the time.</p><p>Al Letson: I don’t know. That rule seems pretty flimsy.</p><p>Amanda Robb: Not only is Amazon distributing the digital version, it’s number one in its category on Amazon.</p></blockquote><p>This tactic of weaponizing the media to leverage a platform in order to deny its services to a target has been used against many innocent individuals. Fortunately, our research has found that there are a number of legal remedies in various jurisdictions that are useful for holding parties who induce a breach of contract liable for their actions. Interestingly enough, being a self-employed, self-styled journalist is no defense against personal liability in these matters. I spoke with one of the leaders of the Legal Legion of Evil concerning this and we’re now actively looking into the optimal system, place, and method of systematically holding these attack SJWs accountable for their defamation and deplatforming campaigns.</p><p>So, if you’re a lawyer, you oppose the SJW weaponization of the media, and you’re potentially interested in joining the Disarm the Attack Media Now campaign, shoot me an email identifying the specific jurisdictions in which you are licensed to practice. We’re particularly interested in CA, WA, and the UK.</p><p>And apropos of absolutely nothing at all, if you are one of the many people that Amanda Robb contacted, please be sure to save and screenshot <a href=\"https://archive.fo/HgVMx\">her approaches to you</a> on Facebook, Linked In, email, or whatever.</p></div>",
  "content_text": "The Deuce may have correctly anticipated the purpose of the\nWired\narticle that is purportedly about Google:\nMy guess is that they’re going to ask Google, purely out of journalistic interest of course, if they consider hosting an “alt-right” blog to be within their policies regarding hate speech.\nYes, there is a very good chance that this is the author’s attempt to utilize a weaponized media platform in order to induce Google to break its contract with me. That is exactly\nwhat Amanda Robb tried to do\n, unsuccessfully, with Amazon, and what she did somewhat more successfully with Indiegogo, much to the latter’s regret.\n(In case you didn’t know, Indiegogo’s CEO, General Counsel, and Head of Trust & Safety have all already become casualties of Indiegogo’s ongoing encounter with the Dread Ilk. And it’s not over yet; there is at least one more skull we anticipate collecting by the time this comes to an end. In the metaphorical sense, the\nmetaphorical\nsense, you understand.)\nAl Letson: Why is Amazon distributing this book?\nAmanda Robb: Well I asked Amazon, and someone from their PR department got back to me. He said it falls within their guidelines. He helpfully sent me a link to their guidelines so I click on them and it says their definition of offensive material is, and I’m quoting, “What we deem offensive is probably about what you would expect.”\nAl Letson: That doesn’t make sense because I find this offensive and they don’t find it offensive.\nAmanda Robb: Well it’s a very moveable goalpost, it turns out. Amazon changes what it thinks is offensive all the time.\nAl Letson: I don’t know. That rule seems pretty flimsy.\nAmanda Robb: Not only is Amazon distributing the digital version, it’s number one in its category on Amazon.\nThis tactic of weaponizing the media to leverage a platform in order to deny its services to a target has been used against many innocent individuals. Fortunately, our research has found that there are a number of legal remedies in various jurisdictions that are useful for holding parties who induce a breach of contract liable for their actions. Interestingly enough, being a self-employed, self-styled journalist is no defense against personal liability in these matters. I spoke with one of the leaders of the Legal Legion of Evil concerning this and we’re now actively looking into the optimal system, place, and method of systematically holding these attack SJWs accountable for their defamation and deplatforming campaigns.\nSo, if you’re a lawyer, you oppose the SJW weaponization of the media, and you’re potentially interested in joining the Disarm the Attack Media Now campaign, shoot me an email identifying the specific jurisdictions in which you are licensed to practice. We’re particularly interested in CA, WA, and the UK.\nAnd apropos of absolutely nothing at all, if you are one of the many people that Amanda Robb contacted, please be sure to save and screenshot\nher approaches to you\non Facebook, Linked In, email, or whatever.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-07-23T13:06:16+00:00"
}