{
  "url": "https://voxday.net/2019/07/22/get-over-it/",
  "scraped_at": "2025-12-21T02:51:29.206732",
  "title": "Get over it",
  "date_display": "July 22, 2019",
  "date_iso": "2019-07-22T15:00:06+00:00",
  "date_from_url": "2019-07-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Other McCain, or as I now very much enjoy calling him, The Only McCain, points out that the Red Faction of the globocracy <a href=\"https://theothermccain.com/2019/07/22/oikophobia-and-nevertrump-how-can-we-secure-the-blessings-of-liberty/\">still isn’t over the fact</a> that most Americans are still nationalists who prefer Americans to Fake Americans, Paper Americans, and various other Not Americans</p><blockquote><p>Four years ago, Vox Day observed that French and the #NeverTrump conservatives “haven’t grasped the fact that the demographic changes to the United States have not only changed the way the political game is played, but have changed the game itself.” The country that elected and re-elected Ronald Reagan by landslide margins has ceased to exist, replaced by one in which Republicans can win the White House only by razor-thin margins, and the most important reason for this change is immigration. The demographic changes that have so transformed our politics did not “just happen.” It wasn’t some impersonal trend which caused this, but rather it was a matter of policy, and National Review was on the side of open borders, having purged <i>Alien Nation</i> author Peter Brimelow and sidelined John O’Sullivan. Not only did <i>National Review </i>purge those who dissented from their open-borders agenda, but also treated as persona non grata anyone who lamented this purge. They will call you a racist if you don’t support open-borders Republicans whose policies make it impossible for Republicans to win elections. Why do the editors of <i>National Review</i> think we should be grateful for their services in denouncing Republican voters as racist, as if there is a shortage of Democrats willing to perform this service?</p><p>Americans have grown tired of being lectured about how racist they are. The white people delivering these lectures — e.g., Joe Scarborough, Chris Cuomo, David Brooks — seem to believe that their moral superiority to the rest of us is so self-evident that we will enjoy and be grateful for the opportunity to be “enlightened” by them. Yet they are telling us nothing we haven’t already been told a million times, long before anyone imagined Donald Trump running for president.</p><p>David French’s insistence that Ilhan Omar is better than any native-born American simply because she is an immigrant — that our inheritance as Americans is a stigma of inferiority — is insulting, and the fact that he thinks we are too stupid to notice this is even more insulting.</p></blockquote><p>It’s not so much that the National Cuckservatives think we are stupid. It’s that they erreoneously believe that they are subtle and clever. Because gamma.</p><p>The blessings of liberty are not for them. They are for the Posterity of the original People of the united States. It’s more than a bit ironic that so many deny that Christians have been grafted on to the promises of Abraham as per the Bible while asserting on nothing more than the basis of a poem and a play, both written by foreigners, that Not Americans have been grafted on to the American Posterity.</p><p>The Dirt isn’t Magic. Neither is the Paper. And the NatCucks refuse to accept that, just as they won’t accept the easily verifiable fact that, yes, in fact, most Americans<a href=\"https://www.nationalreview.com/2019/07/no-one-really-wants-to-send-her-back/\"> really do want to send Ilhan Omar back to Somalia</a>, along with all of her compatriots.</p><p>And if she can take David French with her, so much the better.</p></div>",
  "content_text": "The Other McCain, or as I now very much enjoy calling him, The Only McCain, points out that the Red Faction of the globocracy\nstill isn’t over the fact\nthat most Americans are still nationalists who prefer Americans to Fake Americans, Paper Americans, and various other Not Americans\nFour years ago, Vox Day observed that French and the #NeverTrump conservatives “haven’t grasped the fact that the demographic changes to the United States have not only changed the way the political game is played, but have changed the game itself.” The country that elected and re-elected Ronald Reagan by landslide margins has ceased to exist, replaced by one in which Republicans can win the White House only by razor-thin margins, and the most important reason for this change is immigration. The demographic changes that have so transformed our politics did not “just happen.” It wasn’t some impersonal trend which caused this, but rather it was a matter of policy, and National Review was on the side of open borders, having purged\nAlien Nation\nauthor Peter Brimelow and sidelined John O’Sullivan. Not only did\nNational Review\npurge those who dissented from their open-borders agenda, but also treated as persona non grata anyone who lamented this purge. They will call you a racist if you don’t support open-borders Republicans whose policies make it impossible for Republicans to win elections. Why do the editors of\nNational Review\nthink we should be grateful for their services in denouncing Republican voters as racist, as if there is a shortage of Democrats willing to perform this service?\nAmericans have grown tired of being lectured about how racist they are. The white people delivering these lectures — e.g., Joe Scarborough, Chris Cuomo, David Brooks — seem to believe that their moral superiority to the rest of us is so self-evident that we will enjoy and be grateful for the opportunity to be “enlightened” by them. Yet they are telling us nothing we haven’t already been told a million times, long before anyone imagined Donald Trump running for president.\nDavid French’s insistence that Ilhan Omar is better than any native-born American simply because she is an immigrant — that our inheritance as Americans is a stigma of inferiority — is insulting, and the fact that he thinks we are too stupid to notice this is even more insulting.\nIt’s not so much that the National Cuckservatives think we are stupid. It’s that they erreoneously believe that they are subtle and clever. Because gamma.\nThe blessings of liberty are not for them. They are for the Posterity of the original People of the united States. It’s more than a bit ironic that so many deny that Christians have been grafted on to the promises of Abraham as per the Bible while asserting on nothing more than the basis of a poem and a play, both written by foreigners, that Not Americans have been grafted on to the American Posterity.\nThe Dirt isn’t Magic. Neither is the Paper. And the NatCucks refuse to accept that, just as they won’t accept the easily verifiable fact that, yes, in fact, most Americans\nreally do want to send Ilhan Omar back to Somalia\n, along with all of her compatriots.\nAnd if she can take David French with her, so much the better.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-07-22T14:00:06+00:00"
}