{
  "url": "https://voxday.net/2019/07/18/gladstone-on-free-trade/",
  "scraped_at": "2025-12-21T02:50:57.384663",
  "title": "Gladstone on free trade",
  "date_display": "July 18, 2019",
  "date_iso": "2019-07-18T12:00:08+00:00",
  "date_from_url": "2019-07-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A reader sends an informative quote from the great 19th-century British advocate of free trade, Prime Minister William Gladstone:</p><blockquote><p>Advocacy of Free Trade goes back to the United Kingdom of 1846-1860.  However, what William Gladstone actually said as a defense of free trade is <i>“It is a mistake to suppose that the best way of giving benefit to the labouring classes is simply to operate on the articles consumed by them. If you want to do them the maximum of good, you should rather operate on the articles which give them a maximum of employment.”</i></p><p>However, in 1846-1860 English manufacturing was the best in the world, though America had surpassed them in some fields. Free trade meant far larger markets abroad for English goods, and cheaper foodstuffs at home, meaning that the English labouring classes had more money to spend on their own manufactures.</p><p>For precisely the same reason, the French have rigorous protections of their somewhat inefficient agriculture, namely it creates a maximum of employment.</p><p>For the United States of 2019, our labor is relatively expensive, so in many areas our industries are not competitive with places where labor costs little. Gladstone’s rationale for free trade thus indicates for us that protectionism, not free trade, is to our advantage.</p></blockquote><p>Translation: it is a fundamental mistake for economists to focus on providing the US population with access to cheap imported goods instead of jobs that permit them to pay for more expensive domestic goods.</p></div>",
  "content_text": "A reader sends an informative quote from the great 19th-century British advocate of free trade, Prime Minister William Gladstone:\nAdvocacy of Free Trade goes back to the United Kingdom of 1846-1860.  However, what William Gladstone actually said as a defense of free trade is\n“It is a mistake to suppose that the best way of giving benefit to the labouring classes is simply to operate on the articles consumed by them. If you want to do them the maximum of good, you should rather operate on the articles which give them a maximum of employment.”\nHowever, in 1846-1860 English manufacturing was the best in the world, though America had surpassed them in some fields. Free trade meant far larger markets abroad for English goods, and cheaper foodstuffs at home, meaning that the English labouring classes had more money to spend on their own manufactures.\nFor precisely the same reason, the French have rigorous protections of their somewhat inefficient agriculture, namely it creates a maximum of employment.\nFor the United States of 2019, our labor is relatively expensive, so in many areas our industries are not competitive with places where labor costs little. Gladstone’s rationale for free trade thus indicates for us that protectionism, not free trade, is to our advantage.\nTranslation: it is a fundamental mistake for economists to focus on providing the US population with access to cheap imported goods instead of jobs that permit them to pay for more expensive domestic goods.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-07-18T11:00:08+00:00"
}