{
  "url": "https://voxday.net/2019/07/23/incoming/",
  "scraped_at": "2025-12-21T02:51:32.491350",
  "title": "Incoming",
  "date_display": "July 23, 2019",
  "date_iso": "2019-07-23T01:13:09+00:00",
  "date_from_url": "2019-07-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Looks like <i>Wired </i>is going to take yet another shot or two at me for the fourth time since the Sad Puppies first blew up the Hugos. Although it is possible that it is only doing so in the process of taking one at Google, since I am notoriously – and rather inexplicably – banned from setting foot on Google’s Mountain View headquarters.</p><blockquote><p>I am fact-checking a story on Google for the coming issue of WIRED. Can you confirm the following details?</p><p>1. Your name is Theodore Beale.<br>2. You run the blog Vox Populi.<br>3. Would you consider yourself a member or proponent of the alt-right?</br></br></p></blockquote><p>And no, of course I did not respond to the email. FFS, you’d think they would try simply, I don’t know, <i>looking at the blog</i> for the answers to those questions. Now, given the basic nature of the questions, it probably wouldn’t be any more harmful to answer them than not… but in the interest of setting a good example for those more tempted by seeing their name in print than me, I will not cooperate even to that extent.</p></div>",
  "content_text": "Looks like\nWired\nis going to take yet another shot or two at me for the fourth time since the Sad Puppies first blew up the Hugos. Although it is possible that it is only doing so in the process of taking one at Google, since I am notoriously – and rather inexplicably – banned from setting foot on Google’s Mountain View headquarters.\nI am fact-checking a story on Google for the coming issue of WIRED. Can you confirm the following details?\n1. Your name is Theodore Beale.\n2. You run the blog Vox Populi.\n3. Would you consider yourself a member or proponent of the alt-right?\nAnd no, of course I did not respond to the email. FFS, you’d think they would try simply, I don’t know,\nlooking at the blog\nfor the answers to those questions. Now, given the basic nature of the questions, it probably wouldn’t be any more harmful to answer them than not… but in the interest of setting a good example for those more tempted by seeing their name in print than me, I will not cooperate even to that extent.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-07-23T00:13:09+00:00"
}