{
  "url": "https://voxday.net/2019/07/22/mailvox-one-giant-leap-for-an-omega/",
  "scraped_at": "2025-12-21T02:51:25.908845",
  "title": "Mailvox: one giant leap for an omega",
  "date_display": "July 22, 2019",
  "date_iso": "2019-07-22T11:28:50+00:00",
  "date_from_url": "2019-07-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>LE begins to apply his newfound knowledge of the socio-sexual hierarchy:</p><blockquote><p>I’m a noob in this world. I believe I was an omega until one stream you said something angrily like, “just do what normal people do!” to another omega man. I got a haircut, trimmed my beard to stubble, and started wearing clothes that aren’t sweats.</p><p>I walked past a house party in my neighborhood, Saturday, July 13th, and a woman yelled, “GQ!” I just kept walking thinking, obviously they aren’t talking to me, but then the a second one screamed, “GQ come here!”</p><p>Although it went against my instinct of running home and torturing myself with remorse for eternity, I joined them. Long story short, one of them, a nurse, asked to use my phone, and she saved her number into it. Even if this relationship results in nothing more than a few text messages, I’m forever in your debt.</p><p>I wasted the first 30 years of my life as an antisocial pussy, and always thought of the term “carpe diem” as a load of shit. Now, I’m excited to seize <i>every </i>day. I was thinking about your and Owen’s role in turning my formerly worthless life around, while listening to Dean Martin’s <i>Kick in the Head</i>, and this stupid, simple line brought me to tears, “if this is just the beginning/ then my life is gonna be beautiful!” So I felt obligated to write, if only to let you know of my gratitude.</p></blockquote><p>If you want to win, if you even want to score a point or two, you have to a) learn the rules and b) get in the game. Not necessarily in that order.</p><p>LE’s instincts are all wrong, obviously, for whatever reason. But he understands this now, and he has a mind and a will that together are capable of overriding those erroneous instincts. And it appears he has better raw material with which to work than the average omega. Regardless, the key is this: if your normal patterns of behavior aren’t working for you, then change them! Stop enviously sniping at the normal, functional people, stop listening to your fellow dysfunctionals, and start simply doing what the normal people do.</p><p>If it worked for him, it can work for you.</p></div>",
  "content_text": "LE begins to apply his newfound knowledge of the socio-sexual hierarchy:\nI’m a noob in this world. I believe I was an omega until one stream you said something angrily like, “just do what normal people do!” to another omega man. I got a haircut, trimmed my beard to stubble, and started wearing clothes that aren’t sweats.\nI walked past a house party in my neighborhood, Saturday, July 13th, and a woman yelled, “GQ!” I just kept walking thinking, obviously they aren’t talking to me, but then the a second one screamed, “GQ come here!”\nAlthough it went against my instinct of running home and torturing myself with remorse for eternity, I joined them. Long story short, one of them, a nurse, asked to use my phone, and she saved her number into it. Even if this relationship results in nothing more than a few text messages, I’m forever in your debt.\nI wasted the first 30 years of my life as an antisocial pussy, and always thought of the term “carpe diem” as a load of shit. Now, I’m excited to seize\nevery\nday. I was thinking about your and Owen’s role in turning my formerly worthless life around, while listening to Dean Martin’s\nKick in the Head\n, and this stupid, simple line brought me to tears, “if this is just the beginning/ then my life is gonna be beautiful!” So I felt obligated to write, if only to let you know of my gratitude.\nIf you want to win, if you even want to score a point or two, you have to a) learn the rules and b) get in the game. Not necessarily in that order.\nLE’s instincts are all wrong, obviously, for whatever reason. But he understands this now, and he has a mind and a will that together are capable of overriding those erroneous instincts. And it appears he has better raw material with which to work than the average omega. Regardless, the key is this: if your normal patterns of behavior aren’t working for you, then change them! Stop enviously sniping at the normal, functional people, stop listening to your fellow dysfunctionals, and start simply doing what the normal people do.\nIf it worked for him, it can work for you.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-07-22T10:28:50+00:00"
}