{
  "url": "https://voxday.net/2019/07/01/mailvox-defending-ben-shapiro/",
  "scraped_at": "2025-12-21T02:48:51.835374",
  "title": "Mailvox: defending Ben Shapiro",
  "date_display": "July 1, 2019",
  "date_iso": "2019-07-01T20:33:35+00:00",
  "date_from_url": "2019-07-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jew613 rather unwisely attempted to defend the Littlest Chickenhawk’s disrespect for Jesus Christ:</p><blockquote class=\"tr_bq\"><p>Jews never believed Jesus was anything but a man. This can’t possibly be news to you. There are a series of very specific prophecies, which werent fulfilled. Hence the need for a second coming so Jews rejected him. While the Gemara doesnt mention Jesus, the vat of semen story is not about your Jesus, why do you expect reverence for your divinity from another religion? There isnt any such respect shown to from Christians towards Jews, Rabbis, shuls, or the religion itself.</p></blockquote><p>It’s not news to me or anyone here that Jews never believed Jesus was anything but a man. Hey, at least they believe he actually existed and walked the Holy Land, right? But apparentlyit is news to a lot of PragerU-supporting Christians and conservative Shapiro fans, which has been demonstrated rather clearly by their reaction to Big Bear breaking the news to them.</p><p>As to why we expect respect – not reverence, respect – for our Lord and Savior from another religion, it is because you live in our Christian civilization. You don’t live in a Jewish civilization, you don’t live in a Jewish society, you don’t live in the Jewish homeland, you live in a Christian civilization and a Christian society. So, if you don’t want to show respect for Jesus Christ, for Christianity, and Christian traditions, that’s your choice and your prerogative, but then by all means get your fat, subversive, inversive asses out of our collective house.</p><p>When I lived in Japan, I showed respect for both their Shinto spirits and the Amidha Buddha worshipped by my hosts, not because I believed in any of it in the slightest, but because I was a guest in their civilization and their society. I didn’t try to forcibly alter their society because I was accustomed to using a fork instead of chopsticks and leaving my shoes on inside the house. How do you not understand that basic principle of decent human behavior?</p><p>Now, it is an absolute lie to claim that there is no respect shown to Jews, Rabbis, shuls, and Judaism by tens of millions of Christians across the West. An ABSOLUTE and shameless lie. But that raises the question, on precisely what grounds does the Jewish religion even merit any respect? What is there to respect, exactly? Very, very few non-Jews even know what that religion is, much less what the average practitioner believes. The rabbis literally make it an imperative, <i>if not a capital offense</i>, to share even basic facts about your religion with outsiders. So how can anyone be expected to respect what is purposefully hidden from them?</p><p>More importantly, Christians are not living in your civilization or your society. You are living in ours. You are a guest, you are not a co-owner, let alone the proprietor of the place. That means you owe respect and conformity to Christian rules, traditions, and sensibilities, whereas Christians owe you nothing at all unless they happen to live in Israel.</p><p>Now, I am aware that God promised Abraham that he would be “a blessing” and his children would be “to me a kingdom of priests and a holy nation”. And that was assuming they actually kept their side of the bargain. I note that He never promised the children of Abraham, of which the Jews are a one-thirteenth fraction, that they would heal the world, let alone rule the nations and eat like effendi with thousands of subhuman animals to serve them as slaves.</p><p>So, my question to Jew613 is this: <i>who promised you that?</i></p></div>",
  "content_text": "Jew613 rather unwisely attempted to defend the Littlest Chickenhawk’s disrespect for Jesus Christ:\nJews never believed Jesus was anything but a man. This can’t possibly be news to you. There are a series of very specific prophecies, which werent fulfilled. Hence the need for a second coming so Jews rejected him. While the Gemara doesnt mention Jesus, the vat of semen story is not about your Jesus, why do you expect reverence for your divinity from another religion? There isnt any such respect shown to from Christians towards Jews, Rabbis, shuls, or the religion itself.\nIt’s not news to me or anyone here that Jews never believed Jesus was anything but a man. Hey, at least they believe he actually existed and walked the Holy Land, right? But apparentlyit is news to a lot of PragerU-supporting Christians and conservative Shapiro fans, which has been demonstrated rather clearly by their reaction to Big Bear breaking the news to them.\nAs to why we expect respect – not reverence, respect – for our Lord and Savior from another religion, it is because you live in our Christian civilization. You don’t live in a Jewish civilization, you don’t live in a Jewish society, you don’t live in the Jewish homeland, you live in a Christian civilization and a Christian society. So, if you don’t want to show respect for Jesus Christ, for Christianity, and Christian traditions, that’s your choice and your prerogative, but then by all means get your fat, subversive, inversive asses out of our collective house.\nWhen I lived in Japan, I showed respect for both their Shinto spirits and the Amidha Buddha worshipped by my hosts, not because I believed in any of it in the slightest, but because I was a guest in their civilization and their society. I didn’t try to forcibly alter their society because I was accustomed to using a fork instead of chopsticks and leaving my shoes on inside the house. How do you not understand that basic principle of decent human behavior?\nNow, it is an absolute lie to claim that there is no respect shown to Jews, Rabbis, shuls, and Judaism by tens of millions of Christians across the West. An ABSOLUTE and shameless lie. But that raises the question, on precisely what grounds does the Jewish religion even merit any respect? What is there to respect, exactly? Very, very few non-Jews even know what that religion is, much less what the average practitioner believes. The rabbis literally make it an imperative,\nif not a capital offense\n, to share even basic facts about your religion with outsiders. So how can anyone be expected to respect what is purposefully hidden from them?\nMore importantly, Christians are not living in your civilization or your society. You are living in ours. You are a guest, you are not a co-owner, let alone the proprietor of the place. That means you owe respect and conformity to Christian rules, traditions, and sensibilities, whereas Christians owe you nothing at all unless they happen to live in Israel.\nNow, I am aware that God promised Abraham that he would be “a blessing” and his children would be “to me a kingdom of priests and a holy nation”. And that was assuming they actually kept their side of the bargain. I note that He never promised the children of Abraham, of which the Jews are a one-thirteenth fraction, that they would heal the world, let alone rule the nations and eat like effendi with thousands of subhuman animals to serve them as slaves.\nSo, my question to Jew613 is this:\nwho promised you that?",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-07-01T19:33:35+00:00"
}