{
  "url": "https://voxday.net/2019/07/28/pedo-economics/",
  "scraped_at": "2025-12-21T02:52:16.048084",
  "title": "Pedo-economics",
  "date_display": "July 28, 2019",
  "date_iso": "2019-07-28T19:46:56+00:00",
  "date_from_url": "2019-07-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Readers here are well familiar with my rejection of Keynes and his General Theory, which unlike most economists, I have actually read. Twice. And the fact that it is a piece of Freudian lunacy applied to economics means that it is less than astonishing to be told that the lunatic economist was, as the English put it, <a href=\"https://bigleaguepolitics.com/exposed-economist-reveals-that-john-maynard-keynes-was-a-pedophile/\">a paedophile</a>:</p><blockquote><p>Students of economics know Keynes as arguably the most influential economist of the 20th century. His prescriptions for stimulus spending and active government intervention in economic affairs have become go-to-strategies for governments across the world.</p><p>However, one lesser known aspect about his life was his pedophiliac activity. Economist Saifedean Ammous’ book, <i>The Bitcoin Standard</i>, details some interesting factoids about Keynes’ life.</p><p>Ammous started off by detailing how the family unit is destroyed by government largesse:</p><p><i>Substituting the family with government largesse has arguably been a losing trade for individuals who have partaken in it. Several studies show that life satisfaction depends to a large degree on establishing intimate long-term familial bonds with a partner and children. Many studies also show that rates of depression and psychological diseases are rising over time as the family breaks down, particularly for women. Cases of depression and psychological disorders very frequently have family breakdown as a leading cause</i>.</p><p>The economist then transitioned his analysis into Keynes’ life, which revealed his pedophiliac tendencies:</p><p>It is no coincidence that the breakdown of the family has come about through the implementation of the economic teachings of a man who never had any interest in the long term. A son of a rich family that had accumulated significant capital over generations, Keynes was a libertine hedonist who wasted most his adult life engaging in sexual relationships with children, including traveling around the Mediterranean to visit children’s brothels.</p></blockquote><p>Keynes was one of the important architects in the construction of Satandom. His work was integral to the inversion required to create the modern financial system that is built on a foundation of usury.</p></div>",
  "content_text": "Readers here are well familiar with my rejection of Keynes and his General Theory, which unlike most economists, I have actually read. Twice. And the fact that it is a piece of Freudian lunacy applied to economics means that it is less than astonishing to be told that the lunatic economist was, as the English put it,\na paedophile\n:\nStudents of economics know Keynes as arguably the most influential economist of the 20th century. His prescriptions for stimulus spending and active government intervention in economic affairs have become go-to-strategies for governments across the world.\nHowever, one lesser known aspect about his life was his pedophiliac activity. Economist Saifedean Ammous’ book,\nThe Bitcoin Standard\n, details some interesting factoids about Keynes’ life.\nAmmous started off by detailing how the family unit is destroyed by government largesse:\nSubstituting the family with government largesse has arguably been a losing trade for individuals who have partaken in it. Several studies show that life satisfaction depends to a large degree on establishing intimate long-term familial bonds with a partner and children. Many studies also show that rates of depression and psychological diseases are rising over time as the family breaks down, particularly for women. Cases of depression and psychological disorders very frequently have family breakdown as a leading cause\n.\nThe economist then transitioned his analysis into Keynes’ life, which revealed his pedophiliac tendencies:\nIt is no coincidence that the breakdown of the family has come about through the implementation of the economic teachings of a man who never had any interest in the long term. A son of a rich family that had accumulated significant capital over generations, Keynes was a libertine hedonist who wasted most his adult life engaging in sexual relationships with children, including traveling around the Mediterranean to visit children’s brothels.\nKeynes was one of the important architects in the construction of Satandom. His work was integral to the inversion required to create the modern financial system that is built on a foundation of usury.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-07-28T18:46:56+00:00"
}