{
  "url": "https://voxday.net/2019/07/29/pizzagate-reconsidered/",
  "scraped_at": "2025-12-21T02:52:23.313938",
  "title": "Pizzagate, reconsidered",
  "date_display": "July 29, 2019",
  "date_iso": "2019-07-29T15:07:24+00:00",
  "date_from_url": "2019-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ron Unz <a href=\"http://www.unz.com/runz/american-pravda-john-mccain-jeffrey-epstein-and-pizzagate/\">reconsiders the plausibility of Pizzagate</a> in light of the Epstein and McCain revelations:</p><blockquote><p>Given my awareness of this remarkable track-record of major media cover-ups, I’m ashamed to admit that I had paid almost no attention to the Jeffrey Epstein case until it exploded across our national headlines earlier this month, suddenly becoming one of the biggest news stories in our country.</p><p>For many years, reports about Epstein and his illegal sex-ring had regularly circulated on the fringes of the Internet, with agitated commenters citing the case as proof of the dark and malevolent forces that secretly controlled our corrupted political system. But I almost entirely ignored these discussions, and I’m not sure that I ever once clicked on a single link.</p><p>Probably one reason I paid so little attention to the topic was the exceptionally lurid nature of the claims being made. Epstein was supposedly an enormously wealthy Wall Street financier of rather mysterious personal background and source of funds, who owned a private island and an immense New York City mansion, both regularly stocked with harems of underage girls provided for sexual purposes. He allegedly hobnobbed on a regular basis with Bill Clinton, Prince Andrew, Harvard’s Alan Dershowitz, and numerous other figures in the international elite, as well as a gaggle of ordinary billionaires, frequently transporting those individuals on his personal jet known as “the Lolita Express” for the role it played in facilitating illegal secret orgies with young girls. When right-wing bloggers on obscure websites claimed that former President Clinton and the British Royals were being sexually serviced by the underage girls of a James Bond super-villain brought to life, I just assumed those accusations were the wildest sort of Internet exaggeration….</p><p>Around the same time that I first became familiar with the details of the Pizzagate controversy, the topic also started reaching the pages of my morning newspapers, but in an rather strange manner. Political stories began giving a sentence or two to the “Pizzagate hoax,” describing it as a ridiculous right-wing “conspiracy theory” but excluding all relevant details. I had an eery feeling that some unseen hand had suddenly flipped a switch caused the entire mainstream media to begin displaying identical signs reading “Pizzagate Is False—Nothing To See There!” in brightly flashing neon. I couldn’t recall any previous example of such a strange media reaction to some obscure controversy on the Internet.</p><p>Articles in the Washington Post and the Los Angeles Times also suddenly appeared denouncing the entirety of the alternative media—Left, Right, and Libertarian—as “fake news” websites promoting Russian propaganda, while urging that their content be blocked by all patriotic Internet giants such as Facebook, Twitter, and Google. Prior to that moment, I’d never even heard the term “fake news” but suddenly it was ubiquitous across the media, once again almost as if some unseen hand had suddenly flipped a switch.</p><p>I naturally began to wonder whether the timing of these two strange developments was entirely coincidental. Perhaps Pizzagate was indeed true and struck so deeply at the core of our hugely corrupted political system that the media efforts to suppress it were approaching the point of hysteria.</p><p>Not long afterward, Tara McCarthy’s fine Pizzagate videos were purged from YouTube. This was among the very first instances of video content being banned despite fully conforming to all existing YouTube guidelines, another deeply suspicious development.</p><p>I also noticed that mere mention of Pizzagate had become politically lethal. Donald Trump had selected Lt. Gen. Michael Flynn, former head of the Defense Intelligence Agency, as his National Security Advisor, and Flynn’s son served as the latter’s chief of staff. The younger Flynn happened to Tweet out a couple of links to Pizzagate stories, pointing out that the accusations hadn’t yet been actually investigated let alone disproven, and very soon afterward, he was purged from the Trump transition team, foreshadowing his father’s fall a few weeks later. It seemed astonishing to me that a few simple Tweets about an Internet controversy could have such huge real-life impact near the top of our government.</p><p>The media continued its uniform drumbeat of “Pizzagate Has Been Disproven!” but we were never explained how or by whom, and I was not the only individual to notice the hollowness of such denunciations. An award-winning investigative journalist named Ben Swann at a CBS station in Atlanta broadcast a short television segment summarizing the Pizzagate controversy and noting that contrary to widespread media claims, Pizzagate had neither been investigated nor debunked.</p></blockquote><p>Here is my prediction: Pizzagate will, sooner or later, be largely confirmed to be true, most likely sans a few of the more lurid and cartoonish elements, and, as with the Epstein case, will turn out to be more sinister and of larger scale than even the conspiracy theorists initially believed.</p><p>As always, you can trust the lies and illogic to guide you toward the truth. Which is to say, once you know someone is lying, once you see that someone is presenting an obviously false syllogism, you know there is a <i>specific </i>truth that they are desperately trying to hide. The fact that the oft-repeated claim that Pizzagate has been “debunked” without any of the so-called debunkings being at all logically coherent, let alone conclusive, is sufficient to indicate that there are specific truths being hidden underneath the denials.</p><p>Imagine if we were to utilize this debunking logic in other scenarios.</p><ul><li><b>Major Premise: </b>Conspiracy theorists claim Donald Trump is the President of the United States.</li><li><b>Minor Premise: </b>A crazy man tried to attack Donald Trump at a rally in Vandalia, Ohio.</li><li><b>Conclusion: </b>Therefore, the claim that Donald Trump is President of the United States is debunked!</li></ul><div>Precisely how low does your IQ have to be to find that syllogism to be not only compelling, but conclusive?</div></div>",
  "content_text": "Ron Unz\nreconsiders the plausibility of Pizzagate\nin light of the Epstein and McCain revelations:\nGiven my awareness of this remarkable track-record of major media cover-ups, I’m ashamed to admit that I had paid almost no attention to the Jeffrey Epstein case until it exploded across our national headlines earlier this month, suddenly becoming one of the biggest news stories in our country.\nFor many years, reports about Epstein and his illegal sex-ring had regularly circulated on the fringes of the Internet, with agitated commenters citing the case as proof of the dark and malevolent forces that secretly controlled our corrupted political system. But I almost entirely ignored these discussions, and I’m not sure that I ever once clicked on a single link.\nProbably one reason I paid so little attention to the topic was the exceptionally lurid nature of the claims being made. Epstein was supposedly an enormously wealthy Wall Street financier of rather mysterious personal background and source of funds, who owned a private island and an immense New York City mansion, both regularly stocked with harems of underage girls provided for sexual purposes. He allegedly hobnobbed on a regular basis with Bill Clinton, Prince Andrew, Harvard’s Alan Dershowitz, and numerous other figures in the international elite, as well as a gaggle of ordinary billionaires, frequently transporting those individuals on his personal jet known as “the Lolita Express” for the role it played in facilitating illegal secret orgies with young girls. When right-wing bloggers on obscure websites claimed that former President Clinton and the British Royals were being sexually serviced by the underage girls of a James Bond super-villain brought to life, I just assumed those accusations were the wildest sort of Internet exaggeration….\nAround the same time that I first became familiar with the details of the Pizzagate controversy, the topic also started reaching the pages of my morning newspapers, but in an rather strange manner. Political stories began giving a sentence or two to the “Pizzagate hoax,” describing it as a ridiculous right-wing “conspiracy theory” but excluding all relevant details. I had an eery feeling that some unseen hand had suddenly flipped a switch caused the entire mainstream media to begin displaying identical signs reading “Pizzagate Is False—Nothing To See There!” in brightly flashing neon. I couldn’t recall any previous example of such a strange media reaction to some obscure controversy on the Internet.\nArticles in the Washington Post and the Los Angeles Times also suddenly appeared denouncing the entirety of the alternative media—Left, Right, and Libertarian—as “fake news” websites promoting Russian propaganda, while urging that their content be blocked by all patriotic Internet giants such as Facebook, Twitter, and Google. Prior to that moment, I’d never even heard the term “fake news” but suddenly it was ubiquitous across the media, once again almost as if some unseen hand had suddenly flipped a switch.\nI naturally began to wonder whether the timing of these two strange developments was entirely coincidental. Perhaps Pizzagate was indeed true and struck so deeply at the core of our hugely corrupted political system that the media efforts to suppress it were approaching the point of hysteria.\nNot long afterward, Tara McCarthy’s fine Pizzagate videos were purged from YouTube. This was among the very first instances of video content being banned despite fully conforming to all existing YouTube guidelines, another deeply suspicious development.\nI also noticed that mere mention of Pizzagate had become politically lethal. Donald Trump had selected Lt. Gen. Michael Flynn, former head of the Defense Intelligence Agency, as his National Security Advisor, and Flynn’s son served as the latter’s chief of staff. The younger Flynn happened to Tweet out a couple of links to Pizzagate stories, pointing out that the accusations hadn’t yet been actually investigated let alone disproven, and very soon afterward, he was purged from the Trump transition team, foreshadowing his father’s fall a few weeks later. It seemed astonishing to me that a few simple Tweets about an Internet controversy could have such huge real-life impact near the top of our government.\nThe media continued its uniform drumbeat of “Pizzagate Has Been Disproven!” but we were never explained how or by whom, and I was not the only individual to notice the hollowness of such denunciations. An award-winning investigative journalist named Ben Swann at a CBS station in Atlanta broadcast a short television segment summarizing the Pizzagate controversy and noting that contrary to widespread media claims, Pizzagate had neither been investigated nor debunked.\nHere is my prediction: Pizzagate will, sooner or later, be largely confirmed to be true, most likely sans a few of the more lurid and cartoonish elements, and, as with the Epstein case, will turn out to be more sinister and of larger scale than even the conspiracy theorists initially believed.\nAs always, you can trust the lies and illogic to guide you toward the truth. Which is to say, once you know someone is lying, once you see that someone is presenting an obviously false syllogism, you know there is a\nspecific\ntruth that they are desperately trying to hide. The fact that the oft-repeated claim that Pizzagate has been “debunked” without any of the so-called debunkings being at all logically coherent, let alone conclusive, is sufficient to indicate that there are specific truths being hidden underneath the denials.\nImagine if we were to utilize this debunking logic in other scenarios.\nMajor Premise:\nConspiracy theorists claim Donald Trump is the President of the United States.\nMinor Premise:\nA crazy man tried to attack Donald Trump at a rally in Vandalia, Ohio.\nConclusion:\nTherefore, the claim that Donald Trump is President of the United States is debunked!\nPrecisely how low does your IQ have to be to find that syllogism to be not only compelling, but conclusive?",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-07-29T14:07:24+00:00"
}