{
  "url": "https://voxday.net/2019/07/27/put-not-your-faith-in-whores/",
  "scraped_at": "2025-12-21T02:52:12.402392",
  "title": "Put not your faith in whores",
  "date_display": "July 27, 2019",
  "date_iso": "2019-07-27T20:55:24+00:00",
  "date_from_url": "2019-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Especially <a href=\"https://pjmedia.com/faith/josh-harris-kisses-christianity-goodbye/\">not media whores</a>.</p><blockquote><p>Josh Harris, author of the bestselling 1997 book <i>I Kissed Dating Goodby</i>e, announced on Instagram Friday that he had kissed Christianity goodbye, as well. He is also divorcing his wife. In recent years, Harris has rightly repented of his extraordinarily stringent and slightly heretical teachings in the evangelical purity movement, but he seems to have thrown the baby out with the bathwater. Ironically, the evangelical ex-pastor went from preaching one worldly dogma dressed up in Christian garb to fully embracing another worldly dogma clearly opposed to Christianity.</p><p>Last week, Harris announced that he and his wife of 21 years would be separating. This is significant in part because Harris made himself the model of the promises of a pure Christian life in his book. He essentially promised young Christians that if they keep themselves pure for marriage — he even suggested refraining from kissing until the wedding day — they will find the perfect spouse, enjoy the frequent satisfaction of desire, and the blessings of children.</p><p>That didn’t seem to work out for him, and in his Instagram post, Harris wrote, “I wish you could see all the messages people sent me after the announcement of my divorce. They are expressions of love though they are saddened or even strongly disapprove of the decision.⁣⁣”</p><p>Yet the former evangelical Christian made an even bigger announcement in the same post. “I have undergone a massive shift in regard to my faith in Jesus. The popular phrase for this is ‘deconstruction,’ the biblical phrase is ‘falling away.’ By all the measurements that I have for defining a Christian, I am not a Christian. Many people tell me that there is a different way to practice faith and I want to remain open to this, but I’m not there now,” Harris wrote.</p></blockquote><p>As Owen has said, never trust anyone who puts himself forward as a prophet. Even if he claims to be a Christian. <i>Especially </i>if he claims to be a Christian.</p></div>",
  "content_text": "Especially\nnot media whores\n.\nJosh Harris, author of the bestselling 1997 book\nI Kissed Dating Goodby\ne, announced on Instagram Friday that he had kissed Christianity goodbye, as well. He is also divorcing his wife. In recent years, Harris has rightly repented of his extraordinarily stringent and slightly heretical teachings in the evangelical purity movement, but he seems to have thrown the baby out with the bathwater. Ironically, the evangelical ex-pastor went from preaching one worldly dogma dressed up in Christian garb to fully embracing another worldly dogma clearly opposed to Christianity.\nLast week, Harris announced that he and his wife of 21 years would be separating. This is significant in part because Harris made himself the model of the promises of a pure Christian life in his book. He essentially promised young Christians that if they keep themselves pure for marriage — he even suggested refraining from kissing until the wedding day — they will find the perfect spouse, enjoy the frequent satisfaction of desire, and the blessings of children.\nThat didn’t seem to work out for him, and in his Instagram post, Harris wrote, “I wish you could see all the messages people sent me after the announcement of my divorce. They are expressions of love though they are saddened or even strongly disapprove of the decision.⁣⁣”\nYet the former evangelical Christian made an even bigger announcement in the same post. “I have undergone a massive shift in regard to my faith in Jesus. The popular phrase for this is ‘deconstruction,’ the biblical phrase is ‘falling away.’ By all the measurements that I have for defining a Christian, I am not a Christian. Many people tell me that there is a different way to practice faith and I want to remain open to this, but I’m not there now,” Harris wrote.\nAs Owen has said, never trust anyone who puts himself forward as a prophet. Even if he claims to be a Christian.\nEspecially\nif he claims to be a Christian.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-07-27T19:55:24+00:00"
}