{
  "url": "https://voxday.net/2019/07/04/rebels-run/",
  "scraped_at": "2025-12-21T02:49:06.558665",
  "title": "REBEL’S RUN",
  "date_display": "July 4, 2019",
  "date_iso": "2019-07-04T00:40:59+00:00",
  "date_from_url": "2019-07-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; fullscreen\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://player.vimeo.com/video/345389018\" width=\"512\"></iframe></div><p>Many of you are aware that we have been working on a larger-scale project than usual over the last few months. So, I suspect that few of you will be surprised to learn that what we have been assiduously working on is putting together a production team for the first Arkhaven film as well as a new film production company, Viral Films Media. This is the <a href=\"https://vimeo.com/345389018\">Rebel’s Run Teaser Trailer</a> from <a href=\"https://vimeo.com/user4162883\">Galatia Films</a> and VFM. We’re pleased to be able to announce that Scooter Downey, who directed this trailer, will also be directing the film.</p><p>UPDATE: Owen and I discuss REBEL’S RUN and another project <a href=\"https://www.youtube.com/watch?v=bPC2dK7XK10\">on his stream</a>.</p></div>",
  "content_text": "Many of you are aware that we have been working on a larger-scale project than usual over the last few months. So, I suspect that few of you will be surprised to learn that what we have been assiduously working on is putting together a production team for the first Arkhaven film as well as a new film production company, Viral Films Media. This is the\nRebel’s Run Teaser Trailer\nfrom\nGalatia Films\nand VFM. We’re pleased to be able to announce that Scooter Downey, who directed this trailer, will also be directing the film.\nUPDATE: Owen and I discuss REBEL’S RUN and another project\non his stream\n.",
  "tags": [
    "film"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-07-03T23:40:59+00:00"
}