{
  "url": "https://voxday.net/2019/07/24/stop-whining-about-wikipedia-conservatives/",
  "scraped_at": "2025-12-21T02:51:43.251686",
  "title": "Stop whining about Wikipedia, conservatives",
  "date_display": "July 24, 2019",
  "date_iso": "2019-07-24T14:21:14+00:00",
  "date_from_url": "2019-07-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And <a href=\"https://victorygirlsblog.com/lies-damn-lies-and-wikipedia-edits/\">start using Infogalactic</a>:</p><blockquote><p>Last year, Larry Correia fisked a condescending piece of… writing vomited by some screeching social justice simian who got offended because someone shared a meme on the Internet advising poor people to cook at home and instead of buying fast food. Two days later, someone edited Larry’s Wikipedia page so that the very first thing it said was that he was a White Supremacist Author. The page was also edited to say that Larry wanted his “worthless and self published fantasy dreck” nominated for a Hugo Award. “The funny thing was,” Larry told me when I spoke to him about the incident, “I was the one defending the intelligence and dignity of poor people of any ethnic background, and the rich white liberal was trying to say they were too dumb to boil water.”</p><p>Baen authors Tom Kratman, Sarah Hoyt, and John Ringo have also been targeted (the flaccid attempts against Ringo will go over about as well as the pantshittingly inept ones against Larry – that is to say they will be a fail), ostensibly for their refusal to act in accordance with the screeching social justice simian diktats and soothe their chafed labia by acknowledging that mayonnaise is a gender.</p><p>Reasons for the deletion range from petty to outright unhinged, claiming primary sources are insufficient and even questioning the military service of Mike Williamson and Tom Kratman! Apparently, even an article in Stars and Stripes about veterans forging successful careers in science fiction is insufficient evidence that an author is significant enough to warrant a Wikipedia page and Baen publishing – a giant in science fiction and fantasy that’s been in existence more than three decades – is apparently a “vanity press with little editorial/production standards that can’t even keep straight what year they awarded one of their fake awards.”</p><p>But really – like everything else they do – their efforts to destroy the reputations of their political enemies stem from their feelings of inadequacy compared with creators who not only produce literature people want to buy and read, but are infinitely more successful at their chosen art than these squealing mediocrities are at whatever it is that they choose as their so-called “professions” (often involving begging for money on Patreon and serving overpriced beverages at whatever hipster coffee house allows them to wear torn Che t-shirts and neckbeards as a uniform).</p><p>“To an extent, it’s like erasing historical figures,” Sarah Hoyt told me. “They try to erase us because our accomplishments make them feel theirs are tiny. It’s stompy-foot, fuck fuck games of people too stupid to excel at their supposed profession,” she added.</p></blockquote><p>The conservatives, the Williamsons, Hoyts, and Ringos of the world, are endlessly surprised to discover that their enemies actually hate them, aren’t going to play fair, and aren’t going to heed dire warning #863,527 that someday, someone who almost certainly isn’t them, is going to do something about it.</p><p><i>There will come a time when normal people will have had enough. </i></p><p>I’ve been hearing those dire warnings to the Left from conservatives since the 1980s. I’ve learned not to pay any attention to them, and I’m pretty sure the Left has concluded that they have nothing to worry about on that score.</p><p>Sarah Hoyt <a href=\"https://pjmedia.com/instapundit/336910/\">adds:</a> <i>“IT’S HAPPENING MUCH FASTER THAN I EXPECTED.”</i></p><p>But it was always happening all along, she just didn’t want to have to actually do anything substantive about it. One commenter points out the obvious: <i>There’s one guy actually doing something about it, and a bunch of the people named in the article have disavowed him, because he didn’t wait until now to fight back. </i><br><i><br/></i>Exactly. So FFS, stop whining, stop crying, stop issuing dire warnings, and just use Infogalactic instead. If you’re a public figure, get your Verified page and use it to set the record straight. And relax, it’s not about me, I’m only one of literally hundreds of people who helped make it happen and help keep it going.</br></p><p><b>UPDATE: </b>The gammas all butthurt about the fact that I don’t let them snark away snarkily about me on my personal blog, on my personal YouTube channel, or in my house are too self-centered and stupid to observe the obvious fact that the rules are very different for my personal sites than for the games, technologies, and public sites I design. If I don’t like you, that’s a perfectly legitimate reason to never permit you on my site or in my house. But my personal preferences are not a legitimate reason to deny anyone access to a site that purports to be for everyone.</p></div>",
  "content_text": "And\nstart using Infogalactic\n:\nLast year, Larry Correia fisked a condescending piece of… writing vomited by some screeching social justice simian who got offended because someone shared a meme on the Internet advising poor people to cook at home and instead of buying fast food. Two days later, someone edited Larry’s Wikipedia page so that the very first thing it said was that he was a White Supremacist Author. The page was also edited to say that Larry wanted his “worthless and self published fantasy dreck” nominated for a Hugo Award. “The funny thing was,” Larry told me when I spoke to him about the incident, “I was the one defending the intelligence and dignity of poor people of any ethnic background, and the rich white liberal was trying to say they were too dumb to boil water.”\nBaen authors Tom Kratman, Sarah Hoyt, and John Ringo have also been targeted (the flaccid attempts against Ringo will go over about as well as the pantshittingly inept ones against Larry – that is to say they will be a fail), ostensibly for their refusal to act in accordance with the screeching social justice simian diktats and soothe their chafed labia by acknowledging that mayonnaise is a gender.\nReasons for the deletion range from petty to outright unhinged, claiming primary sources are insufficient and even questioning the military service of Mike Williamson and Tom Kratman! Apparently, even an article in Stars and Stripes about veterans forging successful careers in science fiction is insufficient evidence that an author is significant enough to warrant a Wikipedia page and Baen publishing – a giant in science fiction and fantasy that’s been in existence more than three decades – is apparently a “vanity press with little editorial/production standards that can’t even keep straight what year they awarded one of their fake awards.”\nBut really – like everything else they do – their efforts to destroy the reputations of their political enemies stem from their feelings of inadequacy compared with creators who not only produce literature people want to buy and read, but are infinitely more successful at their chosen art than these squealing mediocrities are at whatever it is that they choose as their so-called “professions” (often involving begging for money on Patreon and serving overpriced beverages at whatever hipster coffee house allows them to wear torn Che t-shirts and neckbeards as a uniform).\n“To an extent, it’s like erasing historical figures,” Sarah Hoyt told me. “They try to erase us because our accomplishments make them feel theirs are tiny. It’s stompy-foot, fuck fuck games of people too stupid to excel at their supposed profession,” she added.\nThe conservatives, the Williamsons, Hoyts, and Ringos of the world, are endlessly surprised to discover that their enemies actually hate them, aren’t going to play fair, and aren’t going to heed dire warning #863,527 that someday, someone who almost certainly isn’t them, is going to do something about it.\nThere will come a time when normal people will have had enough.\nI’ve been hearing those dire warnings to the Left from conservatives since the 1980s. I’ve learned not to pay any attention to them, and I’m pretty sure the Left has concluded that they have nothing to worry about on that score.\nSarah Hoyt\nadds:\n“IT’S HAPPENING MUCH FASTER THAN I EXPECTED.”\nBut it was always happening all along, she just didn’t want to have to actually do anything substantive about it. One commenter points out the obvious:\nThere’s one guy actually doing something about it, and a bunch of the people named in the article have disavowed him, because he didn’t wait until now to fight back.\nExactly. So FFS, stop whining, stop crying, stop issuing dire warnings, and just use Infogalactic instead. If you’re a public figure, get your Verified page and use it to set the record straight. And relax, it’s not about me, I’m only one of literally hundreds of people who helped make it happen and help keep it going.\nUPDATE:\nThe gammas all butthurt about the fact that I don’t let them snark away snarkily about me on my personal blog, on my personal YouTube channel, or in my house are too self-centered and stupid to observe the obvious fact that the rules are very different for my personal sites than for the games, technologies, and public sites I design. If I don’t like you, that’s a perfectly legitimate reason to never permit you on my site or in my house. But my personal preferences are not a legitimate reason to deny anyone access to a site that purports to be for everyone.",
  "tags": [
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-07-24T13:21:14+00:00"
}