{
  "url": "https://voxday.net/2019/07/21/the-gamma-never-grows-up/",
  "scraped_at": "2025-12-21T02:51:22.217667",
  "title": "The gamma never grows up",
  "date_display": "July 21, 2019",
  "date_iso": "2019-07-21T20:37:16+00:00",
  "date_from_url": "2019-07-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rod Dreher explains <a href=\"https://www.theamericanconservative.com/dreher/no-sympathy-for-the-devil-demonic-trump-politics/\">why he is such a useless, hapless cuck </a>and why he always will be:</p><blockquote><p>If I had to pick one single event that formed my outlook on the world, it would be a couple of minutes on the floor of a hotel room at the beach, in the summer of 1982. I was part of a group of high school kids from our town who were on a summer vacation. We were chaperoned by several parents of kids on the trip. The cool kids had been pushing me and a couple of other kids around the whole time, but it was relatively minor stuff. One afternoon, when a bunch of us kids gathered in one of the hotels’ suites, group of older high school boys threw me onto the ground, pinned me, and tried to pull down my pants. The goals was to humiliate me for the amusement of the high school girls in the room.</p><p>I was 14. And I was terrified.</p><p>They had been picking on me for days, but this was a real escalation. What made it so important to the development of my worldview was that I was lying on the floor, pinned and helpless as I struggled to get free, I called out to the two adults in the room to help me. Both of them literally stepped over me to get out of the room. As I’m sitting here writing this, nearly four decades later, I can recall with crystal clarity the stitching on the pants leg of the jeans one of those moms wore as she stepped over me (the other mom went around me).</p><p>After a minute or so more, the boys let me up, and I ran away. They never took my pants down; they were just toying with me. For all I know, as the two moms left the room, they signaled to the boys to knock it off. The point is, though, that rather than use the authority they had to force this idiot small mob of boys, and the girls who stood on the hotel room beds jumping up and down, squealing and egging them on, to stand down, they walked away. No doubt because they wanted to stay in good with the cool kids. These were the kind of moms who wanted to be friends with their teenagers, not authorities.</p><p>Here’s something else: this was not an angry mob (and not much of a mob either: maybe seven or eight boys, and that many girls). They were merry. I was a mouse, and they were cats. They were doing something vicious, but to them, they were just having fun. There was no point to what they did other than to amuse themselves by the suffering of someone who couldn’t fight back.</p><p>The whole thing might have lasted two minutes at most. But the shock waves of that have reverberated throughout my life. I learned more in those two minutes about the way the world really works than I have learned in five decades, though it took a very long time for me to understand that.</p></blockquote><p>Dreher would still rather cry to Mommy than fight. That’s why he’s a useless, hapless cuck. That’s why he will ALWAYS be a useless, hapless cuck, crying and complaining about those who are actually willing to take action to protect themselves, their family, and their nation.</p><p>He could have fought that day. He <i>should </i>have fought. He would have lost, but he would never have known the shame and humiliation that burns inside him and perverts his thinking to this day. And had he fought back at the onset of the tormenting, the older boys would never have used him for public amusement in front of the girls, but because he was a coward, he made it clear to them that he was a soft and easy target.</p><p>And that’s why Dreher is attacking Trump. He’s triggered by the President’s alpha nature. He only sees the bully and not the champion of the American people the President has sworn to protect. Dreher doesn’t realize that Trump is trying to do what the 14-year-old Dreher was begging the two moms to do, and defending those who are incapable of defending themselves from the global mob that is invading and attacking them. Dreher just wants to cuck, and cluck, and virtue-signal, instead of defend his family and his nation.</p><p>The lesson is this: never, ever, trust a coward. They will never fight, not to save themselves, not to save their nations, and certainly not to save you. And worse, they will attack those who are willing to fight, because that very willingness to fight fills them with shame and self-loathing.</p><p>I first got beaten up in first grade. I went through seven pairs of glasses by the time I finished elementary school, usually from getting them broken repeatedly in fights. In ninth grade, I was beaten up by two of my soccer teammates and had a rib cracked from one of them kicking me when the other – a varsity wrestler – got me down. I didn’t win a single fight until I was in eighth grade, when I managed to win two. But despite seven straight years of uninterrupted defeat and physical punishment, I don’t harbor any of Dreher’s sense of childhood shame and humiliation, <i>because no one ever took me on twice</i>.</p><p>We all show the shape of our formative years. But as Dreher’s incessant cuckery shows, the self-inflicted humiliation of youthful cowardice is one from which few men are capable of recovering.</p></div>",
  "content_text": "Rod Dreher explains\nwhy he is such a useless, hapless cuck\nand why he always will be:\nIf I had to pick one single event that formed my outlook on the world, it would be a couple of minutes on the floor of a hotel room at the beach, in the summer of 1982. I was part of a group of high school kids from our town who were on a summer vacation. We were chaperoned by several parents of kids on the trip. The cool kids had been pushing me and a couple of other kids around the whole time, but it was relatively minor stuff. One afternoon, when a bunch of us kids gathered in one of the hotels’ suites, group of older high school boys threw me onto the ground, pinned me, and tried to pull down my pants. The goals was to humiliate me for the amusement of the high school girls in the room.\nI was 14. And I was terrified.\nThey had been picking on me for days, but this was a real escalation. What made it so important to the development of my worldview was that I was lying on the floor, pinned and helpless as I struggled to get free, I called out to the two adults in the room to help me. Both of them literally stepped over me to get out of the room. As I’m sitting here writing this, nearly four decades later, I can recall with crystal clarity the stitching on the pants leg of the jeans one of those moms wore as she stepped over me (the other mom went around me).\nAfter a minute or so more, the boys let me up, and I ran away. They never took my pants down; they were just toying with me. For all I know, as the two moms left the room, they signaled to the boys to knock it off. The point is, though, that rather than use the authority they had to force this idiot small mob of boys, and the girls who stood on the hotel room beds jumping up and down, squealing and egging them on, to stand down, they walked away. No doubt because they wanted to stay in good with the cool kids. These were the kind of moms who wanted to be friends with their teenagers, not authorities.\nHere’s something else: this was not an angry mob (and not much of a mob either: maybe seven or eight boys, and that many girls). They were merry. I was a mouse, and they were cats. They were doing something vicious, but to them, they were just having fun. There was no point to what they did other than to amuse themselves by the suffering of someone who couldn’t fight back.\nThe whole thing might have lasted two minutes at most. But the shock waves of that have reverberated throughout my life. I learned more in those two minutes about the way the world really works than I have learned in five decades, though it took a very long time for me to understand that.\nDreher would still rather cry to Mommy than fight. That’s why he’s a useless, hapless cuck. That’s why he will ALWAYS be a useless, hapless cuck, crying and complaining about those who are actually willing to take action to protect themselves, their family, and their nation.\nHe could have fought that day. He\nshould\nhave fought. He would have lost, but he would never have known the shame and humiliation that burns inside him and perverts his thinking to this day. And had he fought back at the onset of the tormenting, the older boys would never have used him for public amusement in front of the girls, but because he was a coward, he made it clear to them that he was a soft and easy target.\nAnd that’s why Dreher is attacking Trump. He’s triggered by the President’s alpha nature. He only sees the bully and not the champion of the American people the President has sworn to protect. Dreher doesn’t realize that Trump is trying to do what the 14-year-old Dreher was begging the two moms to do, and defending those who are incapable of defending themselves from the global mob that is invading and attacking them. Dreher just wants to cuck, and cluck, and virtue-signal, instead of defend his family and his nation.\nThe lesson is this: never, ever, trust a coward. They will never fight, not to save themselves, not to save their nations, and certainly not to save you. And worse, they will attack those who are willing to fight, because that very willingness to fight fills them with shame and self-loathing.\nI first got beaten up in first grade. I went through seven pairs of glasses by the time I finished elementary school, usually from getting them broken repeatedly in fights. In ninth grade, I was beaten up by two of my soccer teammates and had a rib cracked from one of them kicking me when the other – a varsity wrestler – got me down. I didn’t win a single fight until I was in eighth grade, when I managed to win two. But despite seven straight years of uninterrupted defeat and physical punishment, I don’t harbor any of Dreher’s sense of childhood shame and humiliation,\nbecause no one ever took me on twice\n.\nWe all show the shape of our formative years. But as Dreher’s incessant cuckery shows, the self-inflicted humiliation of youthful cowardice is one from which few men are capable of recovering.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-07-21T19:37:16+00:00"
}