{
  "url": "https://voxday.net/2019/07/16/the-christian-view-on-diversity/",
  "scraped_at": "2025-12-21T02:50:41.552832",
  "title": "The Christian view on Diversity",
  "date_display": "July 16, 2019",
  "date_iso": "2019-07-16T15:49:32+00:00",
  "date_from_url": "2019-07-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Archcuck David French on why he imported an Ethiopian to the USA:</p><blockquote><p>I’m an evangelical Christian, and ever since I was a young man, two Bible verses have tugged at my soul. The first comes from the Book of James, and defines “pure” religious practice in part as looking after “widows and orphans in their distress.” The second, from the Book of Galatians, declares an eternal truth: “There is neither Jew nor Gentile, neither slave nor free, nor is there male and female, for you are all one in Christ Jesus.” As a result, my wife and I not only felt called to adopt, but we believed that race was no barrier to unity for a family of genuine faith.</p><p>And so, in the summer of 2010, we journeyed to Addis Ababa, Ethiopia, to pick up our youngest child. Then we chopped off his penis, gave him a girl’s name, and brought him to America where there is neither male nor female, for we are all one in Diversity.</p></blockquote><p><i><b>“Ashkelon shall see it, and be afraid; Gaza too, and shall writhe  in anguish; Ekron also, because it’s hopes are confounded. The king  shall perish in Gaza; Askelon shall be uninhabited, a mixed people shall dwell in Ashdod, and I will cut of the pride of Philistia.”</b></i><br>(Zech. 9:5-6)</br></p><p>Reader Matt notes: <i>In  the Bible, the destruction of national identity is a clear sign of the  judgement of God, therefore it is very bad for a nation. This speaks  volumes about what is happening in the West; multiculturalism is  literally a sign that we have been very, very bad. As you said in a  recent Darkstream, we need to stop tolerating those who are tempting God  to smite them. </i></p><p>Immigration, diversity, and assimilation are God’s collective curse on a nation, because it is a way of destroying a nation even more completely than war. Just ask your nearest American Indian who belongs to one of the 562 tribes <a href=\"https://www.aaanativearts.com/extinct-tribes\">that haven’t been completely extinguished</a> yet.</p><p>And I can’t help but wonder how long it will take Churchians to declare transgenderism to be proper theology on the basis of that verse from Galatians.</p></div>",
  "content_text": "Archcuck David French on why he imported an Ethiopian to the USA:\nI’m an evangelical Christian, and ever since I was a young man, two Bible verses have tugged at my soul. The first comes from the Book of James, and defines “pure” religious practice in part as looking after “widows and orphans in their distress.” The second, from the Book of Galatians, declares an eternal truth: “There is neither Jew nor Gentile, neither slave nor free, nor is there male and female, for you are all one in Christ Jesus.” As a result, my wife and I not only felt called to adopt, but we believed that race was no barrier to unity for a family of genuine faith.\nAnd so, in the summer of 2010, we journeyed to Addis Ababa, Ethiopia, to pick up our youngest child. Then we chopped off his penis, gave him a girl’s name, and brought him to America where there is neither male nor female, for we are all one in Diversity.\n“Ashkelon shall see it, and be afraid; Gaza too, and shall writhe  in anguish; Ekron also, because it’s hopes are confounded. The king  shall perish in Gaza; Askelon shall be uninhabited, a mixed people shall dwell in Ashdod, and I will cut of the pride of Philistia.”\n(Zech. 9:5-6)\nReader Matt notes:\nIn  the Bible, the destruction of national identity is a clear sign of the  judgement of God, therefore it is very bad for a nation. This speaks  volumes about what is happening in the West; multiculturalism is  literally a sign that we have been very, very bad. As you said in a  recent Darkstream, we need to stop tolerating those who are tempting God  to smite them.\nImmigration, diversity, and assimilation are God’s collective curse on a nation, because it is a way of destroying a nation even more completely than war. Just ask your nearest American Indian who belongs to one of the 562 tribes\nthat haven’t been completely extinguished\nyet.\nAnd I can’t help but wonder how long it will take Churchians to declare transgenderism to be proper theology on the basis of that verse from Galatians.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-07-16T14:49:32+00:00"
}