{
  "url": "https://voxday.net/2019/07/01/there-is-no-point-in-debate/",
  "scraped_at": "2025-12-21T02:48:50.380956",
  "title": "There is no point in debate",
  "date_display": "July 1, 2019",
  "date_iso": "2019-07-01T16:13:38+00:00",
  "date_from_url": "2019-07-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I keep being asked if I’m willing to debate X or interested in talking to Y. The answer is no. What point is there in debate when most of the people watching are totally incapable of having their minds changed by the information exchanged and those who don’t even bother watching or listening to it are nevertheless willing to lie about it. Consider these two recent YouTube comments concerning what passed for my “debate” with Andrew Anglin:</p><blockquote><p>honkyness<br>Didn’t know about the Andrew Anglin interview.  You did some serious dodging Vox – damn disappointing.  I have no idea where you stand on the only thing that matters – the onslaught on Western Civilization and its people.<br><span style=\"white-space: pre;\"> </span><br>Hunter of Witches, Orcs and Goblins<br>I saw that debate recently and I’ll admit I was secretly rooting for Anglin because I instinctively tend to root for people who are brave enough to fight unwinnable battles. That said you absolutely brutalised him. Even to call it a debate is a misnomer. It was an hour long history lesson with a whiny little pupil who ended up learning nothing. He couldn’t even improvise, he was reading everything from a piece of paper and didn’t even respond to anything you said. He was so intellectually inept and puny that it actually hurt my opinion of Anglin, he did nothing but whine and cry about “muh censorship”. Seriously, get in line. Who isn’t being censored?</br></br></br></br></p></blockquote><p>In my both debates with Andrew Anglin and Bob Murphy, my opponent was totally – 100 percent – unable to even <i>begin </i>addressing the points I made. Neither of them raised a single point that was in any way new to me or that I did not address – if not refute entirely – with ease. And yet, there were still a sizable minority of viewers who claimed that Anglin or Murphy somehow <i>won </i>the debate.</p><p>So, when people ask me why I turn down debate invitations these days, that is why. As usual, it comes down to MPAI. I have always preferred written debates, and at this point, that is the only format that even potentially interests me anymore.</p></div>",
  "content_text": "I keep being asked if I’m willing to debate X or interested in talking to Y. The answer is no. What point is there in debate when most of the people watching are totally incapable of having their minds changed by the information exchanged and those who don’t even bother watching or listening to it are nevertheless willing to lie about it. Consider these two recent YouTube comments concerning what passed for my “debate” with Andrew Anglin:\nhonkyness\nDidn’t know about the Andrew Anglin interview.  You did some serious dodging Vox – damn disappointing.  I have no idea where you stand on the only thing that matters – the onslaught on Western Civilization and its people.\nHunter of Witches, Orcs and Goblins\nI saw that debate recently and I’ll admit I was secretly rooting for Anglin because I instinctively tend to root for people who are brave enough to fight unwinnable battles. That said you absolutely brutalised him. Even to call it a debate is a misnomer. It was an hour long history lesson with a whiny little pupil who ended up learning nothing. He couldn’t even improvise, he was reading everything from a piece of paper and didn’t even respond to anything you said. He was so intellectually inept and puny that it actually hurt my opinion of Anglin, he did nothing but whine and cry about “muh censorship”. Seriously, get in line. Who isn’t being censored?\nIn my both debates with Andrew Anglin and Bob Murphy, my opponent was totally – 100 percent – unable to even\nbegin\naddressing the points I made. Neither of them raised a single point that was in any way new to me or that I did not address – if not refute entirely – with ease. And yet, there were still a sizable minority of viewers who claimed that Anglin or Murphy somehow\nwon\nthe debate.\nSo, when people ask me why I turn down debate invitations these days, that is why. As usual, it comes down to MPAI. I have always preferred written debates, and at this point, that is the only format that even potentially interests me anymore.",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-07-01T15:13:38+00:00"
}