{
  "url": "https://voxday.net/2019/07/05/warmongers-against-war/",
  "scraped_at": "2025-12-21T02:49:17.541283",
  "title": "Warmongers against war",
  "date_display": "July 5, 2019",
  "date_iso": "2019-07-05T14:17:14+00:00",
  "date_from_url": "2019-07-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Are you beginning to understand how <a href=\"https://www.rt.com/op-ed/463405-soros-koch-anti-war/\">the neoclown gatekeeper strategy</a> works yet?</p><blockquote><p>There’s a new “anti-war” think tank coming to town. It will promote a new US foreign policy — one based on diplomacy instead of sanctions and war. Sounds great, until you hear it’s being funded by Soros and Koch.</p><p>The ‘Quincy Institute for Responsible Statecraft’ will oppose Washington’s “endless wars” and will “challenge the basis of American foreign policy in a way that has not been done in at least the last quarter-century,” according to co-founder Trita Parsi.</p><p>With financier George Soros coming from the left (though he’s hardly a real leftist) and industrialist Charles Koch coming from the right, everyone is supposed to applaud the bipartisan nature of the initiative. The Boston Globe called it “one of the most remarkable partnerships in modern American political history” as though the two billionaire businessmen come from alternate universes.</p><p>Named after John Quincy Adams, who declared in 1821 that the US “goes not abroad in search of monsters to destroy” but is the “well-wisher to the freedom and independence of all” and the “champion and vindicator only of her own,” the think tank will offer a platform to both progressive voices and anti-interventionist conservatives.</p><p>The Globe writes that this will mean its writers will “likely” advocate for things like pulling US troops out of Afghanistan and Syria, putting an end to regime change wars and “less confrontational” policies toward China and Russia. The problem here is not the concept. It’s just a question of whether or not the venture can actually be taken seriously when Soros and Koch’s fingerprints are already all over the world’s current endless wars, conflicts and regime changes.</p><p>Take some well-known Soros-funded think tanks; the Center for American Progress and the Atlantic Council, for example. They haven’t exactly been the biggest peace-pushers in the think tank world. The AC also received funding from a slew of arms manufacturers, so you’d be hard-pressed to find any anti-war sentiment there. Soros has also been linked to the “pro-democracy” European group Avaaz, which has advocated for no-fly zones in Libya and agitated for regime change in Venezuela and Iran.</p><p>Koch too has been linked to havoc-wreaking policies everywhere from Iraq to Venezuela. Despite supposedly opposing the Iraq war, independent journalist Caitlin Johnstone notes that Koch has been a major donor to the neoconservative American Enterprise Institute, whose members are considered leading architects of the invasion.</p></blockquote><p>This new think tank is as fake as the Edmund Burke Center for National Conservativism or whatever the neoclowns’ latest charade is called. It’s neoclowns from top to bottom and they’re attempting to subvert the opposition to neoclown warmongering by taking control of the opposition to imperialist warfare. <i>National Review</i> and the modern conservative movement are the model; the plutocrats provide lavish funding for a false front organization that is designed to vacuum up all the minds, money, and media that might otherwise go to the genuine opposition.</p><p>“The Quincy Institute opposes wars of no purpose that drag on endlessly.”</p><p>Wars of reasonable duration that aim at destroying any nation that the neoclowns don’t like, on the other hand, are just peachy.</p></div>",
  "content_text": "Are you beginning to understand how\nthe neoclown gatekeeper strategy\nworks yet?\nThere’s a new “anti-war” think tank coming to town. It will promote a new US foreign policy — one based on diplomacy instead of sanctions and war. Sounds great, until you hear it’s being funded by Soros and Koch.\nThe ‘Quincy Institute for Responsible Statecraft’ will oppose Washington’s “endless wars” and will “challenge the basis of American foreign policy in a way that has not been done in at least the last quarter-century,” according to co-founder Trita Parsi.\nWith financier George Soros coming from the left (though he’s hardly a real leftist) and industrialist Charles Koch coming from the right, everyone is supposed to applaud the bipartisan nature of the initiative. The Boston Globe called it “one of the most remarkable partnerships in modern American political history” as though the two billionaire businessmen come from alternate universes.\nNamed after John Quincy Adams, who declared in 1821 that the US “goes not abroad in search of monsters to destroy” but is the “well-wisher to the freedom and independence of all” and the “champion and vindicator only of her own,” the think tank will offer a platform to both progressive voices and anti-interventionist conservatives.\nThe Globe writes that this will mean its writers will “likely” advocate for things like pulling US troops out of Afghanistan and Syria, putting an end to regime change wars and “less confrontational” policies toward China and Russia. The problem here is not the concept. It’s just a question of whether or not the venture can actually be taken seriously when Soros and Koch’s fingerprints are already all over the world’s current endless wars, conflicts and regime changes.\nTake some well-known Soros-funded think tanks; the Center for American Progress and the Atlantic Council, for example. They haven’t exactly been the biggest peace-pushers in the think tank world. The AC also received funding from a slew of arms manufacturers, so you’d be hard-pressed to find any anti-war sentiment there. Soros has also been linked to the “pro-democracy” European group Avaaz, which has advocated for no-fly zones in Libya and agitated for regime change in Venezuela and Iran.\nKoch too has been linked to havoc-wreaking policies everywhere from Iraq to Venezuela. Despite supposedly opposing the Iraq war, independent journalist Caitlin Johnstone notes that Koch has been a major donor to the neoconservative American Enterprise Institute, whose members are considered leading architects of the invasion.\nThis new think tank is as fake as the Edmund Burke Center for National Conservativism or whatever the neoclowns’ latest charade is called. It’s neoclowns from top to bottom and they’re attempting to subvert the opposition to neoclown warmongering by taking control of the opposition to imperialist warfare.\nNational Review\nand the modern conservative movement are the model; the plutocrats provide lavish funding for a false front organization that is designed to vacuum up all the minds, money, and media that might otherwise go to the genuine opposition.\n“The Quincy Institute opposes wars of no purpose that drag on endlessly.”\nWars of reasonable duration that aim at destroying any nation that the neoclowns don’t like, on the other hand, are just peachy.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-07-05T13:17:14+00:00"
}