{
  "url": "https://voxday.net/2019/07/04/why-not-a-little-old-mermaid/",
  "scraped_at": "2025-12-21T02:49:12.075090",
  "title": "Why not a Little Old Mermaid?",
  "date_display": "July 4, 2019",
  "date_iso": "2019-07-04T15:46:00+00:00",
  "date_from_url": "2019-07-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Considering that Disney is already making Ariel the <a href=\"https://www.dailymail.co.uk/tvshowbiz/article-7211657/Halle-Berry-congratulates-Halle-Bailey-Little-Mermaid-casting-fans-confuse-two.html\">Little Black Mermaid</a>:</p><blockquote><p>Halle Bailey, 19, got a flood of online congratulations on her casting as Ariel in a live-action remake of Disney’s The Little Mermaid. But some of the warm feelings were a bit misdirected, as several online commentators hilariously mistook her for Oscar-winning actress Halle Berry, 52.</p><p>Berry herself wrote: ‘In case you needed a reminder… Halles get it DONE. Congratulations @chloexhalle on this amazing opportunity, we can’t wait to see what you do! #TheLittleMermaid #HalleBailey’.</p></blockquote><p>They might as well gone with Halle Berry. They’ve gone straight from blackwashing <i>A Wrinkle in Time Bomb</i> to <i>The Little Mermaid</i>, almost certainly with similarly dismal results. The hatred of Disney for all things European is so marked, I’m surprised that they haven’t completely replaced the very Germanic architecture of the Disneyland parks yet. All in due time, I suppose. But all this incessant Hollywood blackwashing just makes me want to remake <i>Roots </i>with a Chinese cast.</p><p>But back to the Little Black Mermaid…. at least this remake should provide some interesting new plot twists if Ariel is illegitimate and doesn’t know who her father is.</p><p>I wonder who will prove to be more popular, Little Black Mermaid or Little Black Irongirl? Every day is Wakanda day.</p><p><b>UPDATE: </b>Amazon is not looking any better.</p><blockquote class=\"tr_bq\"><p>Amazon’s <i>Lord of the Rings</i> series is bringing <i>Jurassic World: Fallen Kingdom</i> filmmaker J.A.  Bayona to Middle-earth. Bayona will direct the first two episodes of the fantasy series based on J. R. R. Tolkien’s novels, and he will serve as an executive producer, alongside partner Belén Atienza.</p></blockquote><p>Ye cats…. Although I suppose it could have been a lot worse. It could have been Spielberg. Or <i>shudder </i>J.J. Abrams. It should be downright fascinating to see the gay black elves and pretty blonde orcs.</p><p><b>UPDATE: </b>In fairness, from the SJW perspective, a remake was absolutely necessary. Because problematic.</p><blockquote class=\"tr_bq\"><p>I watched the original with my wife literally this week and it was the first time I’d seen it in about 25 or so years and, wow, it is very, very bad. There’s a lot of cleaning up to do.</p></blockquote><p><b>UPDATE: </b>What positive impact?</p><blockquote class=\"tr_bq\"><p>On social media, thousands praised the decision and the positive impact 19-year-old Bailey’s casting could have on ‘young black girls’.</p></blockquote><p>A bunch of young black girls thinking they can be mermaids… it’s not exactly a mystery how this could go horribly wrong, given how black Americans are not, on average, what one would tend to describe as famous for their <i>swimming </i>abilities.</p></div>",
  "content_text": "Considering that Disney is already making Ariel the\nLittle Black Mermaid\n:\nHalle Bailey, 19, got a flood of online congratulations on her casting as Ariel in a live-action remake of Disney’s The Little Mermaid. But some of the warm feelings were a bit misdirected, as several online commentators hilariously mistook her for Oscar-winning actress Halle Berry, 52.\nBerry herself wrote: ‘In case you needed a reminder… Halles get it DONE. Congratulations @chloexhalle on this amazing opportunity, we can’t wait to see what you do! #TheLittleMermaid #HalleBailey’.\nThey might as well gone with Halle Berry. They’ve gone straight from blackwashing\nA Wrinkle in Time Bomb\nto\nThe Little Mermaid\n, almost certainly with similarly dismal results. The hatred of Disney for all things European is so marked, I’m surprised that they haven’t completely replaced the very Germanic architecture of the Disneyland parks yet. All in due time, I suppose. But all this incessant Hollywood blackwashing just makes me want to remake\nRoots\nwith a Chinese cast.\nBut back to the Little Black Mermaid…. at least this remake should provide some interesting new plot twists if Ariel is illegitimate and doesn’t know who her father is.\nI wonder who will prove to be more popular, Little Black Mermaid or Little Black Irongirl? Every day is Wakanda day.\nUPDATE:\nAmazon is not looking any better.\nAmazon’s\nLord of the Rings\nseries is bringing\nJurassic World: Fallen Kingdom\nfilmmaker J.A.  Bayona to Middle-earth. Bayona will direct the first two episodes of the fantasy series based on J. R. R. Tolkien’s novels, and he will serve as an executive producer, alongside partner Belén Atienza.\nYe cats…. Although I suppose it could have been a lot worse. It could have been Spielberg. Or\nshudder\nJ.J. Abrams. It should be downright fascinating to see the gay black elves and pretty blonde orcs.\nUPDATE:\nIn fairness, from the SJW perspective, a remake was absolutely necessary. Because problematic.\nI watched the original with my wife literally this week and it was the first time I’d seen it in about 25 or so years and, wow, it is very, very bad. There’s a lot of cleaning up to do.\nUPDATE:\nWhat positive impact?\nOn social media, thousands praised the decision and the positive impact 19-year-old Bailey’s casting could have on ‘young black girls’.\nA bunch of young black girls thinking they can be mermaids… it’s not exactly a mystery how this could go horribly wrong, given how black Americans are not, on average, what one would tend to describe as famous for their\nswimming\nabilities.",
  "tags": [
    "Vibrancyisourstrength"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-07-04T14:46:00+00:00"
}