{
  "url": "https://voxday.net/2006/06/27/feminist-fantasy/",
  "scraped_at": "2026-01-08T21:10:58.704337",
  "title": "A feminist fantasy",
  "date_display": "June 27, 2006",
  "date_iso": "2006-06-27T12:10:00+00:00",
  "date_from_url": "2006-06-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mouthybitch <a href=\"http://mouthybitch.blogspot.com/2006/06/three-am-high-scoring.html\">makes a very dubious claim</a>:</p><blockquote><p>One day, at almost twelve, I just snapped. I set my alarm for three a.m. and rose silently from my bed. I glided to the computer room, shut the door and booted up the machine. Trying over and over all night long, I finally beat every high score in Wing Commander, leaving at first shy little messages like, “Guess Who?” They graduated, becoming things like, “It’s me again, not you,” and, “I beat you again. Try and stop me.” I sleep-walked through the next day, but no one ever said anything about it. And I didn’t care. I had beaten them. I checked every day to see if they had beaten me, then got up that night and went back, trying over and over until I had earned more</p></blockquote><p>I detect an unmistakeable odor of bovine ejectus here.  First, there are no high scores in Wing Commander.  There are only Sorties and Kills, which are saved according to the pilot’s name which is entered once upon starting the game.  Having the most Kills is merely a matter of playing the most Sorties, there isn’t any “high score” record system ala many arcade games <a href=\"http://www.mobygames.com/game/wing-commander/screenshots\">as these screen shots conclusively demonstrate</a>.  It’s possible that the Nintendo version might have had a scores, I never played that bastardized version, but the fact that she refers to the “computer” and “Commmand and Conquer” indicates that she’s talking about either the DOS or Amiga version.  However, the reference to Wizardry and Wing Commander being “strategy” games is a strong clue that she doesn’t really know what she’s talking about here.</p><p>The lesson here is that girls can do everything that boys can do, and more, in Rainbow Unicorn world.</p><p><em>Note – this is not to say that girls cannot achieve game success, even pretty blonde women.  Space Bunny, for example, is also known as Princess Pooyan, courtesy of her onetime Internet High Score in the classic arcade game during the early days of MAME.  She can still beat me at that one.</em></p></div>",
  "content_text": "Mouthybitch\nmakes a very dubious claim\n:\nOne day, at almost twelve, I just snapped. I set my alarm for three a.m. and rose silently from my bed. I glided to the computer room, shut the door and booted up the machine. Trying over and over all night long, I finally beat every high score in Wing Commander, leaving at first shy little messages like, “Guess Who?” They graduated, becoming things like, “It’s me again, not you,” and, “I beat you again. Try and stop me.” I sleep-walked through the next day, but no one ever said anything about it. And I didn’t care. I had beaten them. I checked every day to see if they had beaten me, then got up that night and went back, trying over and over until I had earned more\nI detect an unmistakeable odor of bovine ejectus here.  First, there are no high scores in Wing Commander.  There are only Sorties and Kills, which are saved according to the pilot’s name which is entered once upon starting the game.  Having the most Kills is merely a matter of playing the most Sorties, there isn’t any “high score” record system ala many arcade games\nas these screen shots conclusively demonstrate\n.  It’s possible that the Nintendo version might have had a scores, I never played that bastardized version, but the fact that she refers to the “computer” and “Commmand and Conquer” indicates that she’s talking about either the DOS or Amiga version.  However, the reference to Wizardry and Wing Commander being “strategy” games is a strong clue that she doesn’t really know what she’s talking about here.\nThe lesson here is that girls can do everything that boys can do, and more, in Rainbow Unicorn world.\nNote – this is not to say that girls cannot achieve game success, even pretty blonde women.  Space Bunny, for example, is also known as Princess Pooyan, courtesy of her onetime Internet High Score in the classic arcade game during the early days of MAME.  She can still beat me at that one.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-06-27T11:10:00+00:00"
}