{
  "url": "https://voxday.net/2006/06/30/good-games-are-tomorrow/",
  "scraped_at": "2026-01-08T21:11:16.956206",
  "title": "The good games are tomorrow",
  "date_display": "June 30, 2006",
  "date_iso": "2006-06-30T08:00:00+00:00",
  "date_from_url": "2006-06-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Germany, as most host countries do, has made a good run, but mostly because its group was disgustingly easy.  As their games against England showed, neither Ecuador nor Sweden were very good – Sweden didn’t even come close to meriting the point they salvaged against the Brits – which means that Germany hasn’t faced a serious test yet this World Cup.</p><p>Argentina, on the other hand, outplayed a very skilled Dutch team and beat a solid Mexico that was playing as well as I’ve ever seen it play.  They’ve overwhelmed teams, they’re unselfish, they’ve shown they can come from behind without panicking and their substitutes are often better than their starters.  Pekerman can’t not start Hernan Crespo, and yet Unfrozen Caveman Striker is the most dangerous and disruptive player on the Argentine squad.  This should be the game in which the German defense gets exposed, and as an Arsenalista, I can testify that while Lehman is a good keeper, he is unlikely to rescue an overmatched Deutschland ala Oliver Kahn in Korea.</p><p>Italy will have no trouble with Ukraine.  A team that can’t score against a Swiss team missing Senderos will find it next to impossible to put one in the net against the Azzurri, even if the Italians are missing both Nesta and Materazzi in defense.  Just as Buffon, Cannevaro, Camoranesi, Zambrotta and Del Piero helped render their Juventus teammate Nedved ineffective in the Czech game, the extreme familiarity of Milan’s Inzaghi, Pirlo, Gilardino, Nesta and Gattuso with Shevchenko – who played seven years with the <em>rossoneri</em> before this summer’s move to Chelsea – will help enormously in shutting him down.</p><p>My affection for the Azzurri aside, I hope we get the chance to see Italy-Argentina as it promises a clash between two well-coached, highly-skilled and technically-excellent teams.</p></div>",
  "content_text": "Germany, as most host countries do, has made a good run, but mostly because its group was disgustingly easy.  As their games against England showed, neither Ecuador nor Sweden were very good – Sweden didn’t even come close to meriting the point they salvaged against the Brits – which means that Germany hasn’t faced a serious test yet this World Cup.\nArgentina, on the other hand, outplayed a very skilled Dutch team and beat a solid Mexico that was playing as well as I’ve ever seen it play.  They’ve overwhelmed teams, they’re unselfish, they’ve shown they can come from behind without panicking and their substitutes are often better than their starters.  Pekerman can’t not start Hernan Crespo, and yet Unfrozen Caveman Striker is the most dangerous and disruptive player on the Argentine squad.  This should be the game in which the German defense gets exposed, and as an Arsenalista, I can testify that while Lehman is a good keeper, he is unlikely to rescue an overmatched Deutschland ala Oliver Kahn in Korea.\nItaly will have no trouble with Ukraine.  A team that can’t score against a Swiss team missing Senderos will find it next to impossible to put one in the net against the Azzurri, even if the Italians are missing both Nesta and Materazzi in defense.  Just as Buffon, Cannevaro, Camoranesi, Zambrotta and Del Piero helped render their Juventus teammate Nedved ineffective in the Czech game, the extreme familiarity of Milan’s Inzaghi, Pirlo, Gilardino, Nesta and Gattuso with Shevchenko – who played seven years with the\nrossoneri\nbefore this summer’s move to Chelsea – will help enormously in shutting him down.\nMy affection for the Azzurri aside, I hope we get the chance to see Italy-Argentina as it promises a clash between two well-coached, highly-skilled and technically-excellent teams.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-06-30T07:00:00+00:00"
}