{
  "url": "https://voxday.net/2006/06/24/humor-kommissaria/",
  "scraped_at": "2026-01-08T21:10:45.554431",
  "title": "The humor kommissariat",
  "date_display": "June 24, 2006",
  "date_iso": "2006-06-24T08:54:00+00:00",
  "date_from_url": "2006-06-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Kafkaesque k harbors a fantasy about wearing a secret policeman’s outfit:</p><blockquote><p>1. Violence against women is never funny, and never deserving of ridicule. Never.</p></blockquote><p>Someone probably should have told Chris Rock this before he launched his career as comedian.  “I would never hit a woman… but I’ll sure as Hell shake the shit out of her!”</p><blockquote><p>2. In case you don’t understand, because most of you don’t appear to be utilizing all of your God-given faculties, violence against women is NEVER funny.</p></blockquote><p>To say nothing of David Chapelle.  “I’m Rick James, bitch!”  And  the more that puritanical feminists preach against the horrors of “violence against women”, the funnier the average person will find it.  You see, only one person laughing about violence against women is sufficient to disprove k’s absurd assertion no matter how many times she repeats her mantra.  If you don’t think it’s funny when a verbally agressive woman unexpectedly, but deservedly gets her clock cleaned, well, you’re just a sad and humorless individual.  And if she’s a feminist who publicly professes a belief in total equality, so much the better.</p><blockquote><p>3. I find it interesting that both Evil Bender and The Lizard Queen have written lengthy, thoughtful responses, but when I come over here to find the other half of the debate, I read only mockery. Try to formulate a coherent argument rather than berating your opponents.  Or do you not have a logical, coherent argument that can be supported by evidence? Is that what all this belittling is about—hiding your inability to eloquently express your ideas and defend your belief system behind schoolyard ridicule?</p></blockquote><p>I have already formulated a coherent argument, that to which Evil Bender, the Lizard Princess and Mrs. Smitty were respondingly poorly, insufficiently and inaccurately.  k shows herself to be a cretin here, as she thinks her ontological assertion is enough to make Evil Bender’s response “lengthy” and “thoughtful” despite the fact that EB himself stated that he was not making a detailed argument, only that he could.  k must be a woman, since she thinks <a href=\"http://evilbender.wordpress.com/2006/06/20/disgusting/\">a four-sentence expression of personal feeling</a> passes for a “thoughtful response” demanding a coherent counterargument.  What does she think I’m going to do, insist that Evil Bender doesn’t feel the way he says he feels?  As I said, a cretin, and a deluded one at that.</p><p>Between the LQ’s redundant notion of political action against an activity that violates numerous existing laws and Mrs. Smitty’s demonstration of her vast reserve of historical ignorance, there is little to do but mock.  Once you’ve demonstrated the way in which a case is reliant upon a falsehood, there’s nothing left but the taunting.</p><p>The Daddy Lizard pipes up:</p><blockquote><p>There are many ways that these facts mean that Vox is wrong in his fantasy of what would happen if my daughter became involved in fighting sexual slavery.</p></blockquote><p>Why don’t you mention at least one of those many ways then, if not providing a comprehensive list?  Oh, I know, you could but you can’t bother.  Whatever.  Anyhow, I harbor no fantasies about his reptilian spawn, I merely mentioned the likely result if the Lizard Princess decided to go teach those awful, sexist Eastern European slavers a Hollywood lesson.  How I loathe the use of “to fight” as a metaphor, and yes, I’m including you, Chuck Palahniuk.</p><blockquote><p>I can’t control what some punks fantasize about my daughter. I can’t control that they use such fantasies for verbal oneupsmanship to prove that they are right and whoever disagrees with them is wrong. God doesn’t even do that. But neither of us is deaf and blind. There is absolutely no way that someone who ridicules another in print is following God.</p></blockquote><p>I don’t need verbal oneupsmanship to prove that I am right in this matter, as the historical facts speak for themselves.  Any verbal sleight-of-hand is merely a means of highlighting the flawed statements made by those who are demonstrably unaware of the historical facts, the present realities and the future probabilities.  I’ve yet to hear a single person make a case for how Western feminism is going to survive the next 50 years, let alone successfully address the challenges of secular barbarism or Islamic revival.</p><p>As for Daddy Lizard’s theology, the less said, the better.  Still, I am relieved to know that as I have only ridiculed others via digital bits, I have escaped the divine judgment of those who so sinfully misuse the printing press.</p><p>By the way, as Lena points out in the comments, the former Soviet Union is heavily feminized, or if you prefer, antipatriarchal, which is why its population has declined more drastically than the populations of Western Europe.  I was aware of this thanks to The Perfect Aryan Male’s Russian stripper, who was a nurse back in her home country, but I still don’t know the extent to which it is true in other Eastern European nations.  Feminism and Communism stem from the same source, of course, as anyone familiar with the career of Betty Friedan knows very well.  When Camille Paglia uses the term “Stalinist” to refer to the feminist movement, she is not merely engaging in rhetoric, she is also referring to its intellectual roots.</p></div>",
  "content_text": "The Kafkaesque k harbors a fantasy about wearing a secret policeman’s outfit:\n1. Violence against women is never funny, and never deserving of ridicule. Never.\nSomeone probably should have told Chris Rock this before he launched his career as comedian.  “I would never hit a woman… but I’ll sure as Hell shake the shit out of her!”\n2. In case you don’t understand, because most of you don’t appear to be utilizing all of your God-given faculties, violence against women is NEVER funny.\nTo say nothing of David Chapelle.  “I’m Rick James, bitch!”  And  the more that puritanical feminists preach against the horrors of “violence against women”, the funnier the average person will find it.  You see, only one person laughing about violence against women is sufficient to disprove k’s absurd assertion no matter how many times she repeats her mantra.  If you don’t think it’s funny when a verbally agressive woman unexpectedly, but deservedly gets her clock cleaned, well, you’re just a sad and humorless individual.  And if she’s a feminist who publicly professes a belief in total equality, so much the better.\n3. I find it interesting that both Evil Bender and The Lizard Queen have written lengthy, thoughtful responses, but when I come over here to find the other half of the debate, I read only mockery. Try to formulate a coherent argument rather than berating your opponents.  Or do you not have a logical, coherent argument that can be supported by evidence? Is that what all this belittling is about—hiding your inability to eloquently express your ideas and defend your belief system behind schoolyard ridicule?\nI have already formulated a coherent argument, that to which Evil Bender, the Lizard Princess and Mrs. Smitty were respondingly poorly, insufficiently and inaccurately.  k shows herself to be a cretin here, as she thinks her ontological assertion is enough to make Evil Bender’s response “lengthy” and “thoughtful” despite the fact that EB himself stated that he was not making a detailed argument, only that he could.  k must be a woman, since she thinks\na four-sentence expression of personal feeling\npasses for a “thoughtful response” demanding a coherent counterargument.  What does she think I’m going to do, insist that Evil Bender doesn’t feel the way he says he feels?  As I said, a cretin, and a deluded one at that.\nBetween the LQ’s redundant notion of political action against an activity that violates numerous existing laws and Mrs. Smitty’s demonstration of her vast reserve of historical ignorance, there is little to do but mock.  Once you’ve demonstrated the way in which a case is reliant upon a falsehood, there’s nothing left but the taunting.\nThe Daddy Lizard pipes up:\nThere are many ways that these facts mean that Vox is wrong in his fantasy of what would happen if my daughter became involved in fighting sexual slavery.\nWhy don’t you mention at least one of those many ways then, if not providing a comprehensive list?  Oh, I know, you could but you can’t bother.  Whatever.  Anyhow, I harbor no fantasies about his reptilian spawn, I merely mentioned the likely result if the Lizard Princess decided to go teach those awful, sexist Eastern European slavers a Hollywood lesson.  How I loathe the use of “to fight” as a metaphor, and yes, I’m including you, Chuck Palahniuk.\nI can’t control what some punks fantasize about my daughter. I can’t control that they use such fantasies for verbal oneupsmanship to prove that they are right and whoever disagrees with them is wrong. God doesn’t even do that. But neither of us is deaf and blind. There is absolutely no way that someone who ridicules another in print is following God.\nI don’t need verbal oneupsmanship to prove that I am right in this matter, as the historical facts speak for themselves.  Any verbal sleight-of-hand is merely a means of highlighting the flawed statements made by those who are demonstrably unaware of the historical facts, the present realities and the future probabilities.  I’ve yet to hear a single person make a case for how Western feminism is going to survive the next 50 years, let alone successfully address the challenges of secular barbarism or Islamic revival.\nAs for Daddy Lizard’s theology, the less said, the better.  Still, I am relieved to know that as I have only ridiculed others via digital bits, I have escaped the divine judgment of those who so sinfully misuse the printing press.\nBy the way, as Lena points out in the comments, the former Soviet Union is heavily feminized, or if you prefer, antipatriarchal, which is why its population has declined more drastically than the populations of Western Europe.  I was aware of this thanks to The Perfect Aryan Male’s Russian stripper, who was a nurse back in her home country, but I still don’t know the extent to which it is true in other Eastern European nations.  Feminism and Communism stem from the same source, of course, as anyone familiar with the career of Betty Friedan knows very well.  When Camille Paglia uses the term “Stalinist” to refer to the feminist movement, she is not merely engaging in rhetoric, she is also referring to its intellectual roots.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-06-24T07:54:00+00:00"
}