{
  "url": "https://voxday.net/2006/06/27/on-language-and-losers/",
  "scraped_at": "2026-01-08T21:10:56.820151",
  "title": "On language and losers",
  "date_display": "June 27, 2006",
  "date_iso": "2006-06-27T11:22:00+00:00",
  "date_from_url": "2006-06-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am disappointed at the way in which the usual suspects have interpreted one or two vulgarisms as permission to freely engage in the vernacular.  Again, I repeat that my occasional descent is not blanket permission for everyone else to do the same, we are not in junior high and whereas the occasional exclamation point adds seasoning to the subject, ending every sentence with one quickly grows tiresome.</p><p>You know who you are, so knock it off.  And if a non-regular does it, don’t follow suit.  If you feel the need to verbally unleash, go do it at Pluto’s Spewage since he seems to so enjoy the company of the occasional random castoff.  As an added bonus, you might be able to see a chubby Slavic peasant with her shirt off while you’re at it.</p><p>Now, for the important stuff.  I was disappointed with the performance of both the Azzurri and the Swiss; as Jamie correctly anticipated, I was looking forward to seeing the two teams meet.  Australia played well, but they did not deserve to win as the team was let down by Gus Hiddink’s conservative game management, which rather reminded me of a Vikings-Cowboys game during the Dennis Green era.</p><p>The Vikings were playing at home in the dome the year following one of the Cowboy’s Super Bowl winning seasons and scored in the last minute of the game.  The score was 21-20 and Denny had to choose whether to kick or go for two.  As the White Buffalo, Big Chilly and I went nuts, he sent on the special teams unit to kick the extra point and send the game into overtime.</p><p>So, here’s the point.  You are playing the defending Super Bowl Champions, which feature Troy Aikman, Emmitt Smith and Michael Irvin.  You’ve played them even for four quarters, and now you have a chance to win the game.  Do you take it?  Green didn’t, he played not to lose, so naturally, he lost.  Dallas won the coin toss, marched down the field and kicked the game-winning field goal.</p><p>While the red card was not justified, (the Australian wasn’t clearly through the Italian defense, so it should have been a yellow), the Socceroos had the Azzurri where they wanted them after 50 minutes.  With Nesta out due to injury and Materazzi out, Hiddinck had to press hard for the win.  The Italians feature one of the best defenses in the world, so they were never going to crack easly even with Gattuso, a midfielder, playing in the back four.  Italy is perfectly comfortable playing on the counterattack, so as soon as they realized that Hiddink wasn’t going to put the pressure on them, they relaxed and let the game come to them.</p><p>The damning statistic is that Italy had 12 shots, seven on goal, to Australia’s 10, four on goal.  That should never, ever be the case when a side is up a man, let alone when the penalized team is missing two starting defenders.  The fact that the penalty in question was won by Grosso, a <em>defender</em> attacking so far forward, shows how little the Italians had to fear from the Australian pressure, or more to the point, the lack of it.</p><p>There was no penalty, but that being said, Neill’s decision to go to ground so early was remarkably stupid.  Australia had two defenders between Grosso and the goal, had either of them merely held position instead of diving for the ball, the attack would have been thwarted.  While FIFA must fix the diving problem exacerbated in part by its Fair Play initiative, (I will post my thoughts on this and other related matters soon), the cheap penalty was a good example of how calcio karma penalizes the stupid and benefits the hard-working.  The lesson is: 1) don’t leave your feet if you don’t have to, and, 2) Great runs make good things happen, even when they aren’t deserved.</p><p>As for the other game, Ukraine didn’t deserve to win so much as Switzerland deserved to lose.  Those three missed penalties were the worst I have ever seen in succession by any team; even my six year olds know not to kick it directly at the goalie.</p></div>",
  "content_text": "I am disappointed at the way in which the usual suspects have interpreted one or two vulgarisms as permission to freely engage in the vernacular.  Again, I repeat that my occasional descent is not blanket permission for everyone else to do the same, we are not in junior high and whereas the occasional exclamation point adds seasoning to the subject, ending every sentence with one quickly grows tiresome.\nYou know who you are, so knock it off.  And if a non-regular does it, don’t follow suit.  If you feel the need to verbally unleash, go do it at Pluto’s Spewage since he seems to so enjoy the company of the occasional random castoff.  As an added bonus, you might be able to see a chubby Slavic peasant with her shirt off while you’re at it.\nNow, for the important stuff.  I was disappointed with the performance of both the Azzurri and the Swiss; as Jamie correctly anticipated, I was looking forward to seeing the two teams meet.  Australia played well, but they did not deserve to win as the team was let down by Gus Hiddink’s conservative game management, which rather reminded me of a Vikings-Cowboys game during the Dennis Green era.\nThe Vikings were playing at home in the dome the year following one of the Cowboy’s Super Bowl winning seasons and scored in the last minute of the game.  The score was 21-20 and Denny had to choose whether to kick or go for two.  As the White Buffalo, Big Chilly and I went nuts, he sent on the special teams unit to kick the extra point and send the game into overtime.\nSo, here’s the point.  You are playing the defending Super Bowl Champions, which feature Troy Aikman, Emmitt Smith and Michael Irvin.  You’ve played them even for four quarters, and now you have a chance to win the game.  Do you take it?  Green didn’t, he played not to lose, so naturally, he lost.  Dallas won the coin toss, marched down the field and kicked the game-winning field goal.\nWhile the red card was not justified, (the Australian wasn’t clearly through the Italian defense, so it should have been a yellow), the Socceroos had the Azzurri where they wanted them after 50 minutes.  With Nesta out due to injury and Materazzi out, Hiddinck had to press hard for the win.  The Italians feature one of the best defenses in the world, so they were never going to crack easly even with Gattuso, a midfielder, playing in the back four.  Italy is perfectly comfortable playing on the counterattack, so as soon as they realized that Hiddink wasn’t going to put the pressure on them, they relaxed and let the game come to them.\nThe damning statistic is that Italy had 12 shots, seven on goal, to Australia’s 10, four on goal.  That should never, ever be the case when a side is up a man, let alone when the penalized team is missing two starting defenders.  The fact that the penalty in question was won by Grosso, a\ndefender\nattacking so far forward, shows how little the Italians had to fear from the Australian pressure, or more to the point, the lack of it.\nThere was no penalty, but that being said, Neill’s decision to go to ground so early was remarkably stupid.  Australia had two defenders between Grosso and the goal, had either of them merely held position instead of diving for the ball, the attack would have been thwarted.  While FIFA must fix the diving problem exacerbated in part by its Fair Play initiative, (I will post my thoughts on this and other related matters soon), the cheap penalty was a good example of how calcio karma penalizes the stupid and benefits the hard-working.  The lesson is: 1) don’t leave your feet if you don’t have to, and, 2) Great runs make good things happen, even when they aren’t deserved.\nAs for the other game, Ukraine didn’t deserve to win so much as Switzerland deserved to lose.  Those three missed penalties were the worst I have ever seen in succession by any team; even my six year olds know not to kick it directly at the goalie.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-06-27T10:22:00+00:00"
}