{
  "url": "https://voxday.net/2006/06/27/to-lizard-princess-sans-vitrio/",
  "scraped_at": "2026-01-08T21:10:54.987272",
  "title": "To the Lizard Princess, sans vitriol",
  "date_display": "June 27, 2006",
  "date_iso": "2006-06-27T09:21:00+00:00",
  "date_from_url": "2006-06-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which we also apologize for the delay in responding <a href=\"http://bassclefgirl5.blogspot.com/2006/06/response-to-voxs-arguments.html\">to the LP’s request for clarification</a>.  As a few of the Volk are aware, I was somewhat engaged with the fallout from an unfortunate incident which is now behind us, and I’m happy to report that everyone involved is perfectly well.</p><blockquote><p>I am beginning to suspect that the man behind the curtain, if you will, over at Vox Popoli does not actually believe that which he spews. His argumentation is faulty and, it would seem, deliberately inflammatory. As a result, this may well be my last post on the subject. But for now, I refuse to be bullied into silence.</p></blockquote><p>As I previously assured Evil Bender, I do indeed stand by my position on these matters.  But have no fear of bullying, post all you like as no one is launching cyberattacks or writing complaints to your employer in an effort to silence you.  But if you consider having your thoughts broken down and stripped to reveal their flaws equivalent to being bullied, well, that’s just education.  Live and learn.  And for the Nth time, a naked assertion proves nothing.  Either show how my argumentation is faulty or stand revealed as a pretender like so many before you.</p><blockquote><p>First, I’d like to respond to your comment that “the Lizard Princess and Mrs. Smitty were respondingly poorly, insufficiently and inaccurately.” The sentence of mine that you posted in your entry titled “She will look beautiful in chains” was taken out of context in the simplest sense of the term: I was responding to a comment your follower “keer K guard” made: “the continual claims that women can do anything men can etc. is patently false when it comes to breaking horrendous trends like the re-emergence (not that it ever went away, but is now explosive and moving to 2nd and 1st world nations) of sexual slavery.”</p></blockquote><p>That particular comment did not merely refer to your inexplicable failure to recognize that slavery has only ever been forcibly ended by male force – and supremely powerful male force at that – but to the sum total of your responses at that point, which despite Mrs. Smitty’s claims, were neither “lengthy” nor “thoughtful”.</p><blockquote><p>I was merely interested in having the logic behind that argument explained to me. (Please note that I expressed no such “redundant notion of political action against an activity that violates numerous existing laws;” you’ll note from the use of the conditional tense in my sentence that I was speaking hypothetically.) “keer K guard” never responded to my statement, which made it rather handy that you took it–albeit out of context–over to your blog, because while you personally did nothing to clear up my confusion–you merely suggested that in Eastern Europe I would be beaten for questioning such a thing–your commenters were able to enlighten me on that point. I gather from the comments thus far that in your opinions I am incapable of fighting the re-emergence of sex slavery because women are powerless to fight such things both physically and politically. Am I correct about that? Please do correct me if I’m wrong.</p></blockquote><p>I was aware you were speaking hypothetically, it was just an amusing and naive hypothesis.  I didn’t have the impression you harbored visions of going Rambo on anyone.  If you wanted to know my reasoning, then you had merely to ask.  Pretty Lady, LisaLisa and many others who don’t happen to share my ideology or my religious faith can tell you that I’m quite happy to engage in a civil, high-minded discussion if approached politely.  But begin by throwing a jab, however passive-aggressive, and there’s a high probability that I’ll respond in like manner.  If I’m not shy about publicly sparring with national commentators, I’m certainly not going to be hesitant about firing back at a random Internet critic.  (I do, however, believe that all critics deserve their shot and I dislike the way in which many bloggers believe they are somehow unaccountable to critics whose traffic is less than their own.  And I say this as one who turned down an invitation to the Michael Reagan show yesterday; like John Stewart I have no interest in playing Sock Monkey du jour.)</p><p>Anyhow, in answer to your question, both men and women are politically powerless to fight the re-emergence of sex slavery for three reasons.  First, in the abstract, political power is incapable of controlling humans without force, so it makes no difference if the anti-trafficking political elite is male or female if a sufficient percentage of the populace favors it.  The political elite can guide and it can manipulate, but it cannot force.  This is why, for example, the pro-war media is constantly in despair over the insufficient enthusiasm of Americans for the elite’s World Democratic Revolution project, whether it is the Democrat’s version 1.0 (Somalia and Serbia) or version 2.0 Republican (Afghanistan, Iraq and Iran).</p><p>Second, in the areas currently most infamous for sex slavery, there is no political power to be exercised.  The European Union is an undemocratic entity run by the unelected European Commission, so it makes no difference who is serving in the German, French or British parliaments, all that matters is the dictates of Brussels.</p><p>Third, sex slavery is already illegal on numerous counts since it typically involves kidnapping, theft, assault, failure to declare income, illegal immigration and, in most countries, prostitution.  A War on Sex Slavery will be no more successful than the wars on poverty and drugs, and due to sex slavery’s complicated and easily concealed nature – to say nothing of the varied interests supporting it – it will likely be far less successful than those two proven failures.</p><p>And finally, as to why you, the Lizard Princess, are personally powerless to end sex slavery, as we have explained why there is no political solution, this leaves us to take your metaphor literally.  And while I have no doubt that a Hollywood film about a kickass superheroine singlehandedly breaking up a chain of evil Romanian sex slavers would be cool and very successful, the notion is absurd on its face.  Not merely because women lack the upper body strength of men, they also tend to lack the decisiveness and the sheer aggressiveness required for physical combat of any kind.  More importantly, they are reluctant tool users, especially when it comes to mastering the use of the sort of deadly tools required to impose one’s will on a group of recalcitrant individuals given to violence.</p><blockquote><p>I will certainly agree that men still wield much of the power in the world. Where we part ways, however, is in how we feel about this fact: I would like to see equality between the sexes, while you and your followers believe that a society wherein men wield all the power would be best for all involved. Again, please correct me if I’m wrong.</p></blockquote><p>You are wrong in that I believe that a society wherein men wield all the power is not only historical, but inevitable.  Even in nominally equalitarian societies, women are only permitted to wield the appearance of power as they provide power-seeking men with a much-needed proxy until the time such cover is no longer needed.  This is an old game which was played by both Lenin and Hitler and is currently in vogue with Eurofascists, Panamericans and mullahs alike.</p><p>But this is a minor error compared to the more profound misunderstanding of power.  It is not only women who are helpless tools used by the small group of men in power, but 99 percent of all men as well.  Before you can change society, you must first understand how it works.  The dichotomy between what feminists and other post-Christians expected from post-Christian society and the results thus far achieved should inspire some to begin considering the way in which they have been used by those elites working towards global fascism.  Indeed, it is clear that the campai<br> gn against sex-trafficking is one of many threads intended to bind those mighty fasces together…. do not, national laws and national sovereignties stand in the way of tracking down those helpless victims?</br></p><p>It’s just the game that is older than prostitution, the promise of order out of chaos.</p><p>As for your professed belief in equality, I am skeptical.  As a man who verbally insults another man deserves a punch in the mouth, would you consider me justified for punching a woman who delivers a similar insult?  That is genuine equality.  If your answer is that no one deserves a punch in the mouth, then you don’t believe in equality, you believe in imposing feminized society.  They are two different concepts.  Which do you support?</p><blockquote><p>So, in short, I believe in and do what I can to work toward equality between the sexes, while you believe in and do what you can to ensure a male-dominated society. We may well have to agree to disagree on that point, but I see no reason why we can’t discuss it like adults, with mutual respect. Why all the vitriol? Do you all not realize that saying things like “modern women need to be signed up to get punched in the face twice” only serves to discredit your argument?</p></blockquote><p>Do what you like, it doesn’t matter.  And I don’t have to do anything to ensure continued male-domination.  Feminism, like communism, will last as long as it is useful to the male global power elite.  When it ceases to become useful for their purposes, it will be eradicated as quickly and brutally as Ernst Roehm’s homosexual-ridden Sturmabteilung were supplanted by Himmler’s gay-murdering Schutzstaffel.  Please note that sex slavery and other anti-liberty unpleasantries are growing fastest in areas where the global facism is currently most advanced.</p><p>As for vitriol, I already stated my practice of responding in kind.  If a critic makes use of naked assertions, then I am free to do the same… it is as silly to make comments about my logic or my sexual orientation without providing supporting evidence as it would be for me to state that I am only being criticized because the critic enjoys carnal relations with certain vegetables.  I further submit that an important difference is that I usually respond to the entirety of my critic’s case in company with the rhetorical artillery, while most of my critics immediately fall silent on points I have successfully addressed and begin evasive maneuvers.  Will you do the same?</p><p>And finally, why should such a statement serve to discredit my argument since I never said or wrote any such thing.  Even if I had, what reasons would you give in support of your apparent belief that modern women do not need to sign up for such treatment?  If a rebuttal is transparently simple, then there is no excuse for not providing it upon request.</p></div>",
  "content_text": "In which we also apologize for the delay in responding\nto the LP’s request for clarification\n.  As a few of the Volk are aware, I was somewhat engaged with the fallout from an unfortunate incident which is now behind us, and I’m happy to report that everyone involved is perfectly well.\nI am beginning to suspect that the man behind the curtain, if you will, over at Vox Popoli does not actually believe that which he spews. His argumentation is faulty and, it would seem, deliberately inflammatory. As a result, this may well be my last post on the subject. But for now, I refuse to be bullied into silence.\nAs I previously assured Evil Bender, I do indeed stand by my position on these matters.  But have no fear of bullying, post all you like as no one is launching cyberattacks or writing complaints to your employer in an effort to silence you.  But if you consider having your thoughts broken down and stripped to reveal their flaws equivalent to being bullied, well, that’s just education.  Live and learn.  And for the Nth time, a naked assertion proves nothing.  Either show how my argumentation is faulty or stand revealed as a pretender like so many before you.\nFirst, I’d like to respond to your comment that “the Lizard Princess and Mrs. Smitty were respondingly poorly, insufficiently and inaccurately.” The sentence of mine that you posted in your entry titled “She will look beautiful in chains” was taken out of context in the simplest sense of the term: I was responding to a comment your follower “keer K guard” made: “the continual claims that women can do anything men can etc. is patently false when it comes to breaking horrendous trends like the re-emergence (not that it ever went away, but is now explosive and moving to 2nd and 1st world nations) of sexual slavery.”\nThat particular comment did not merely refer to your inexplicable failure to recognize that slavery has only ever been forcibly ended by male force – and supremely powerful male force at that – but to the sum total of your responses at that point, which despite Mrs. Smitty’s claims, were neither “lengthy” nor “thoughtful”.\nI was merely interested in having the logic behind that argument explained to me. (Please note that I expressed no such “redundant notion of political action against an activity that violates numerous existing laws;” you’ll note from the use of the conditional tense in my sentence that I was speaking hypothetically.) “keer K guard” never responded to my statement, which made it rather handy that you took it–albeit out of context–over to your blog, because while you personally did nothing to clear up my confusion–you merely suggested that in Eastern Europe I would be beaten for questioning such a thing–your commenters were able to enlighten me on that point. I gather from the comments thus far that in your opinions I am incapable of fighting the re-emergence of sex slavery because women are powerless to fight such things both physically and politically. Am I correct about that? Please do correct me if I’m wrong.\nI was aware you were speaking hypothetically, it was just an amusing and naive hypothesis.  I didn’t have the impression you harbored visions of going Rambo on anyone.  If you wanted to know my reasoning, then you had merely to ask.  Pretty Lady, LisaLisa and many others who don’t happen to share my ideology or my religious faith can tell you that I’m quite happy to engage in a civil, high-minded discussion if approached politely.  But begin by throwing a jab, however passive-aggressive, and there’s a high probability that I’ll respond in like manner.  If I’m not shy about publicly sparring with national commentators, I’m certainly not going to be hesitant about firing back at a random Internet critic.  (I do, however, believe that all critics deserve their shot and I dislike the way in which many bloggers believe they are somehow unaccountable to critics whose traffic is less than their own.  And I say this as one who turned down an invitation to the Michael Reagan show yesterday; like John Stewart I have no interest in playing Sock Monkey du jour.)\nAnyhow, in answer to your question, both men and women are politically powerless to fight the re-emergence of sex slavery for three reasons.  First, in the abstract, political power is incapable of controlling humans without force, so it makes no difference if the anti-trafficking political elite is male or female if a sufficient percentage of the populace favors it.  The political elite can guide and it can manipulate, but it cannot force.  This is why, for example, the pro-war media is constantly in despair over the insufficient enthusiasm of Americans for the elite’s World Democratic Revolution project, whether it is the Democrat’s version 1.0 (Somalia and Serbia) or version 2.0 Republican (Afghanistan, Iraq and Iran).\nSecond, in the areas currently most infamous for sex slavery, there is no political power to be exercised.  The European Union is an undemocratic entity run by the unelected European Commission, so it makes no difference who is serving in the German, French or British parliaments, all that matters is the dictates of Brussels.\nThird, sex slavery is already illegal on numerous counts since it typically involves kidnapping, theft, assault, failure to declare income, illegal immigration and, in most countries, prostitution.  A War on Sex Slavery will be no more successful than the wars on poverty and drugs, and due to sex slavery’s complicated and easily concealed nature – to say nothing of the varied interests supporting it – it will likely be far less successful than those two proven failures.\nAnd finally, as to why you, the Lizard Princess, are personally powerless to end sex slavery, as we have explained why there is no political solution, this leaves us to take your metaphor literally.  And while I have no doubt that a Hollywood film about a kickass superheroine singlehandedly breaking up a chain of evil Romanian sex slavers would be cool and very successful, the notion is absurd on its face.  Not merely because women lack the upper body strength of men, they also tend to lack the decisiveness and the sheer aggressiveness required for physical combat of any kind.  More importantly, they are reluctant tool users, especially when it comes to mastering the use of the sort of deadly tools required to impose one’s will on a group of recalcitrant individuals given to violence.\nI will certainly agree that men still wield much of the power in the world. Where we part ways, however, is in how we feel about this fact: I would like to see equality between the sexes, while you and your followers believe that a society wherein men wield all the power would be best for all involved. Again, please correct me if I’m wrong.\nYou are wrong in that I believe that a society wherein men wield all the power is not only historical, but inevitable.  Even in nominally equalitarian societies, women are only permitted to wield the appearance of power as they provide power-seeking men with a much-needed proxy until the time such cover is no longer needed.  This is an old game which was played by both Lenin and Hitler and is currently in vogue with Eurofascists, Panamericans and mullahs alike.\nBut this is a minor error compared to the more profound misunderstanding of power.  It is not only women who are helpless tools used by the small group of men in power, but 99 percent of all men as well.  Before you can change society, you must first understand how it works.  The dichotomy between what feminists and other post-Christians expected from post-Christian society and the results thus far achieved should inspire some to begin considering the way in which they have been used by those elites working towards global fascism.  Indeed, it is clear that the campai\ngn against sex-trafficking is one of many threads intended to bind those mighty fasces together…. do not, national laws and national sovereignties stand in the way of tracking down those helpless victims?\nIt’s just the game that is older than prostitution, the promise of order out of chaos.\nAs for your professed belief in equality, I am skeptical.  As a man who verbally insults another man deserves a punch in the mouth, would you consider me justified for punching a woman who delivers a similar insult?  That is genuine equality.  If your answer is that no one deserves a punch in the mouth, then you don’t believe in equality, you believe in imposing feminized society.  They are two different concepts.  Which do you support?\nSo, in short, I believe in and do what I can to work toward equality between the sexes, while you believe in and do what you can to ensure a male-dominated society. We may well have to agree to disagree on that point, but I see no reason why we can’t discuss it like adults, with mutual respect. Why all the vitriol? Do you all not realize that saying things like “modern women need to be signed up to get punched in the face twice” only serves to discredit your argument?\nDo what you like, it doesn’t matter.  And I don’t have to do anything to ensure continued male-domination.  Feminism, like communism, will last as long as it is useful to the male global power elite.  When it ceases to become useful for their purposes, it will be eradicated as quickly and brutally as Ernst Roehm’s homosexual-ridden Sturmabteilung were supplanted by Himmler’s gay-murdering Schutzstaffel.  Please note that sex slavery and other anti-liberty unpleasantries are growing fastest in areas where the global facism is currently most advanced.\nAs for vitriol, I already stated my practice of responding in kind.  If a critic makes use of naked assertions, then I am free to do the same… it is as silly to make comments about my logic or my sexual orientation without providing supporting evidence as it would be for me to state that I am only being criticized because the critic enjoys carnal relations with certain vegetables.  I further submit that an important difference is that I usually respond to the entirety of my critic’s case in company with the rhetorical artillery, while most of my critics immediately fall silent on points I have successfully addressed and begin evasive maneuvers.  Will you do the same?\nAnd finally, why should such a statement serve to discredit my argument since I never said or wrote any such thing.  Even if I had, what reasons would you give in support of your apparent belief that modern women do not need to sign up for such treatment?  If a rebuttal is transparently simple, then there is no excuse for not providing it upon request.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2006-06-27T08:21:00+00:00"
}