{
  "url": "https://voxday.net/2008/11/05/and-now-fun-begins/",
  "scraped_at": "2026-01-08T22:39:59.274660",
  "title": "And now the fun begins",
  "date_display": "November 5, 2008",
  "date_iso": "2008-11-05T09:28:00+00:00",
  "date_from_url": "2008-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to admit that I’m feeling quite cheerful this morning. <a href=\"http://corner.nationalreview.com/post/?q=ZjBhMWEyZmZhYTYwZTNlMjIyM2E1NmQwOWUzODBlZTc=\">John Derbyshire pretty much sums up my thoughts</a>, except that I’m not in the least bit sour about the results of the election despite the failure of my McCain call; these events are precisely what I unsuccessfully attempted to warn conservatives and Republicans would be the logical outcome of their political pragmatism since 2003:</p><blockquote><p>All right, I’m sour. The most liberal member of the U.S. Senate! And that shakedown-artist of a wife, with the permanent frown! And Joe Biden! …</p><p>I’m sour about the GOP too. What did it all get us, those 8 years of pandering and spending? If GWB had turned his face against new entitlements, closed the borders, deported the illegals, held the line on calls to loosen mortgage-lending standards, starved the Department of Education, and declined those invitations to mosque functions, would the GOP be in any worse shape now?…</p><p>Where was conservatism in this election? Where was restraint in government? Where was national sovereignty? Where was liberty? Where was self-support? And where are those things now? Where are they headed this next four years?</p></blockquote><p>What Derb strongly implies, but does not explicitly point out, was that conservatism, government restraint, national sovereignty, liberty and self-support weren’t just lacking in this election, but more importantly, were completely absent from the Republican governance of the last eight years.  All of these things were rejected at the advice of the more influential part of the conservative commentariat in the name of the Iraqi occupation and political pragmatism.</p><p>How practical is a “pragmatism” that manages to turn a Republican White House, House, and Senate into a Democratic White House, House, and Senate?</p><p>Leadership requires principle; pragmatism and pandering are simply followership.  The “reformed conservatism” of a David Frum or a Russ Douthat that many Republicans will be tempted to embrace will be a fatal strategic mistake; the further that the newly empowered Democrats overreach to the left, the more important it will be for Republicans to offer a genuinely libertarian alternative.</p><p>There is no reason whatsoever to mourn a McCain loss.  None.  No one can reasonably argue that Mr. Bipartisan would ever imperil his amicable relations with his good friends on the other side of the aisle.  Just as George Bush ensured the appearance of a Barack Obama, four years of John McCain presiding over the current economy would have not only moved the country in the same direction that Obama will take it, but ensured that his inevitable Democratic successor would be even worse than Obama.</p><p>As for my failed political predictions, do keep in mind that I batted .250 this round.  Incorrect on Pataki, incorrect on Clinton, correct on Palin, incorrect on McCain.  Not impressive, but not exactly bad when you consider that most of these predictions were made months in advance; everyone knows I’ve been expecting Bush’s successor to be some form of Democrat for literally years.  More than one long-time regular correctly surmised via email that, in addition to my fear of a McCain presidency, there was a bit of the cruelty artist behind that most recent call.  And as one sharp-eyed Obama supporter noted in the comments, the case for the McCain scenario foundered upon the fact that most of the polls in the battleground states tended to exceed the five-point fudge that was its justification.  (In the spirit of the new U.S. president, I’m throwing the Baseball Savant under the bus.)  Note that despite Obama’s win, the new model polls simply were not accurate, <a href=\"http://www.gallup.com/poll/111703/Final-Presidential-Estimate-Obama-55-McCain-44.aspx\">the final Gallup poll</a> and <a href=\"http://www.reuters.com/article/politicsNews/idUSN3134134020081104\">final Zogby poll</a> both had Obama +11 nationally, while CNN currently has <a href=\"http://edition.cnn.com/ELECTION/2008/results/president/\">the actual results</a> at 52-47 with 96 percent reporting.  That would indicate that the five-percent rule actually underestimated the major poll bias, not that it helped John McCain.  UPDATE – Jonah Goldberg points out that the supposedly historic youth vote doesn’t appear to have been <a href=\"http://corner.nationalreview.com/post/?q=ZmI5MGU4ODVkY2ZlYmJmYzdjMDc3YWYxNmEwOWJhYzA=\">what it was projected to be</a> either.</p><p>So, what now?  I’m not concerned about whatever it is that the Democrats occupy themselves with doing over the next few months, since it’s not going to work and will only exacerbate the present problems.  Yes, it will be outrageous, yes it will be stupid, and yes, it will all end in tears, but that’s obvious.  I have little interest in attempting to guess precisely with what idiocies they will indulge themselves.  The much more important thing is how the right reacts to all of this.  Will it be the Euro-style Christian Democrat conservativism that the anti-Palin crowd are preaching in order to nibble away at the edges or will it be a principled Ron Paul opposition party?</p><p>Obviously, the latter is the correct strategy and one that will be positioned to take advantage of the problems caused by Democratic dalliance with overt socialism.  But, I would not put it past the GOP elite to embrace what killed them while rejecting what would have permitted them to maintain their hold on the reins of power.  However, keep in mind that all of this may well be irrelevant anyhow, as the untrammeled migration of the next four years may well lay the foundation for Karl Rove’s permanent majority party, albeit not the precise party he was contemplating.</p><p>As for the VP crew, here’s how we voted yesterday.  I suspect that this may help explain how the election actually turned more on those who didn’t turn out for McCain rather than those who did turn out for Obama.</p><p>31% (N) None of the above (413)<br>30% (R) John McCain (402)<br>23% (C) Chuck Baldwin (303)<br>11% (L) Bob Barr (147)<br>05% (D) Barack Obama (60)</br></br></br></br></p><p>This should make clear what I have stated many times before: Vox Popoli is neither a Republican blog nor an echo chamber.  I hope the Libertarians also learned that it’s a really bad idea to run a non-libertarian as their candidate.  I think it’s clearly time for Libertarians and the Constitution Party to work out their differences and create a Freedom Alliance capable of succeeding the Republicans if they insist on going the way of the Whigs.</p><p>UPDATE – National Review finally bothers to notice something rather salient: <i>“[A]ll the folks who told us McCain was the man, from Christopher Buckley to New Hampshire’s primary voters, had no difficulty abandoning him for Obama.”</i> – Mark Steyn.</p><p>UPDATE II – <i>“There was no spectacular youth vote or black vote. What there was was a spectacular seven-million strong abandonment of the Republican candidate, less than half of whom switched to the Dem.”</i> Gee, I wonder why that happened?</p></div>",
  "content_text": "I have to admit that I’m feeling quite cheerful this morning.\nJohn Derbyshire pretty much sums up my thoughts\n, except that I’m not in the least bit sour about the results of the election despite the failure of my McCain call; these events are precisely what I unsuccessfully attempted to warn conservatives and Republicans would be the logical outcome of their political pragmatism since 2003:\nAll right, I’m sour. The most liberal member of the U.S. Senate! And that shakedown-artist of a wife, with the permanent frown! And Joe Biden! …\nI’m sour about the GOP too. What did it all get us, those 8 years of pandering and spending? If GWB had turned his face against new entitlements, closed the borders, deported the illegals, held the line on calls to loosen mortgage-lending standards, starved the Department of Education, and declined those invitations to mosque functions, would the GOP be in any worse shape now?…\nWhere was conservatism in this election? Where was restraint in government? Where was national sovereignty? Where was liberty? Where was self-support? And where are those things now? Where are they headed this next four years?\nWhat Derb strongly implies, but does not explicitly point out, was that conservatism, government restraint, national sovereignty, liberty and self-support weren’t just lacking in this election, but more importantly, were completely absent from the Republican governance of the last eight years.  All of these things were rejected at the advice of the more influential part of the conservative commentariat in the name of the Iraqi occupation and political pragmatism.\nHow practical is a “pragmatism” that manages to turn a Republican White House, House, and Senate into a Democratic White House, House, and Senate?\nLeadership requires principle; pragmatism and pandering are simply followership.  The “reformed conservatism” of a David Frum or a Russ Douthat that many Republicans will be tempted to embrace will be a fatal strategic mistake; the further that the newly empowered Democrats overreach to the left, the more important it will be for Republicans to offer a genuinely libertarian alternative.\nThere is no reason whatsoever to mourn a McCain loss.  None.  No one can reasonably argue that Mr. Bipartisan would ever imperil his amicable relations with his good friends on the other side of the aisle.  Just as George Bush ensured the appearance of a Barack Obama, four years of John McCain presiding over the current economy would have not only moved the country in the same direction that Obama will take it, but ensured that his inevitable Democratic successor would be even worse than Obama.\nAs for my failed political predictions, do keep in mind that I batted .250 this round.  Incorrect on Pataki, incorrect on Clinton, correct on Palin, incorrect on McCain.  Not impressive, but not exactly bad when you consider that most of these predictions were made months in advance; everyone knows I’ve been expecting Bush’s successor to be some form of Democrat for literally years.  More than one long-time regular correctly surmised via email that, in addition to my fear of a McCain presidency, there was a bit of the cruelty artist behind that most recent call.  And as one sharp-eyed Obama supporter noted in the comments, the case for the McCain scenario foundered upon the fact that most of the polls in the battleground states tended to exceed the five-point fudge that was its justification.  (In the spirit of the new U.S. president, I’m throwing the Baseball Savant under the bus.)  Note that despite Obama’s win, the new model polls simply were not accurate,\nthe final Gallup poll\nand\nfinal Zogby poll\nboth had Obama +11 nationally, while CNN currently has\nthe actual results\nat 52-47 with 96 percent reporting.  That would indicate that the five-percent rule actually underestimated the major poll bias, not that it helped John McCain.  UPDATE – Jonah Goldberg points out that the supposedly historic youth vote doesn’t appear to have been\nwhat it was projected to be\neither.\nSo, what now?  I’m not concerned about whatever it is that the Democrats occupy themselves with doing over the next few months, since it’s not going to work and will only exacerbate the present problems.  Yes, it will be outrageous, yes it will be stupid, and yes, it will all end in tears, but that’s obvious.  I have little interest in attempting to guess precisely with what idiocies they will indulge themselves.  The much more important thing is how the right reacts to all of this.  Will it be the Euro-style Christian Democrat conservativism that the anti-Palin crowd are preaching in order to nibble away at the edges or will it be a principled Ron Paul opposition party?\nObviously, the latter is the correct strategy and one that will be positioned to take advantage of the problems caused by Democratic dalliance with overt socialism.  But, I would not put it past the GOP elite to embrace what killed them while rejecting what would have permitted them to maintain their hold on the reins of power.  However, keep in mind that all of this may well be irrelevant anyhow, as the untrammeled migration of the next four years may well lay the foundation for Karl Rove’s permanent majority party, albeit not the precise party he was contemplating.\nAs for the VP crew, here’s how we voted yesterday.  I suspect that this may help explain how the election actually turned more on those who didn’t turn out for McCain rather than those who did turn out for Obama.\n31% (N) None of the above (413)\n30% (R) John McCain (402)\n23% (C) Chuck Baldwin (303)\n11% (L) Bob Barr (147)\n05% (D) Barack Obama (60)\nThis should make clear what I have stated many times before: Vox Popoli is neither a Republican blog nor an echo chamber.  I hope the Libertarians also learned that it’s a really bad idea to run a non-libertarian as their candidate.  I think it’s clearly time for Libertarians and the Constitution Party to work out their differences and create a Freedom Alliance capable of succeeding the Republicans if they insist on going the way of the Whigs.\nUPDATE – National Review finally bothers to notice something rather salient:\n“[A]ll the folks who told us McCain was the man, from Christopher Buckley to New Hampshire’s primary voters, had no difficulty abandoning him for Obama.”\n– Mark Steyn.\nUPDATE II –\n“There was no spectacular youth vote or black vote. What there was was a spectacular seven-million strong abandonment of the Republican candidate, less than half of whom switched to the Dem.”\nGee, I wonder why that happened?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-11-05T09:28:00+00:00"
}