{
  "url": "https://voxday.net/2008/11/22/atheist-own-goa/",
  "scraped_at": "2026-01-08T22:41:39.901652",
  "title": "An atheist own goal",
  "date_display": "November 22, 2008",
  "date_iso": "2008-11-22T21:57:00+00:00",
  "date_from_url": "2008-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This <a href=\"http://debunkingchristianity.blogspot.com/2008/08/vox-day-fractal-intelligence-delusion.html\">attempt at a critique</a> of my refutation of Richard Dawkins’s “Ultimate 747” argument in TIA by Touchstone of Debunking Christianity should amuse some of you.  Microphone Jones correctly pointed out the primary flaw; I added some additional points on the 21st comment.  I have to say, there are few individuals I find funnier than those who attempt to defend an argument by saying that if the argument had been different than it actually is, it would be correct.</p><p>This is the best part:</p><blockquote><p>Dawkins does not spell out a formal definition of organizational or algorithmic complexity in his book. But you don’t have to be a super-genius to get familiar with the concepts as they are used in science and information theoretic application. I haven’t read Day’s section of “theistic bodycounts” from wars versus “atheistic bodycounts”, but Day’s supporters on my list regale me superlatives of Day’s phenomenal research capabalities. If he’s got such capabilities, he shot all his efforts in previous chapters; Day simply punts here and decides to equate complexity with information.</p><p>Oops. That’s a really major blunder. Just in casual terms, complexity is a description of the “number of discrete and differentiated parts”, and information is “reduction in uncertainty”. Complexity and information are related on some level, and those terms do often occur together in computing and information theoretic contexts. But complexity is not information, any more than mass is acceleration.</p></blockquote><p>It is a really major blunder.  But the problem here is that the idea of equating complexity with information did not originate with me.  You see, I’m not the one who wrote that Richard Dawkins’s Argument from Improbability is rooted in “the source of all the information in living matter”, or brought up the problem of “continually monitoring and controlling the individual status of every particle in the universe”, or referred incredulously to “bandwidth” contra simplicity.  That would be, well, Richard Dawkins.</p><p>One can only criticize the existing argument.  If Dawkins has something besides sheer quantity of information in mind there, I should very much like to know precisely what it is.  But until he offers a convincing definition of complexity that fits his argument, the Ultimate 747 simply will not fly.</p><p>UPDATE – This has turned out to be even funnier than I’d thought!  When posting my comment at Debunking Christianity, I skipped right over this rather telling bit written by Touchstone in the comments there: <i>“Dawkins is pointing out a structural deficiency in the argument from complexity, that’s all. It’s not an argument for the non-existence of God, just pointing out the poverty of one of the arguments *for* God’s existence.”</i></p><p><b>“The argument from improbability, properly deployed, comes close to proving that God does not exist.  My name for the statistical demonstration that God almost certainly does not exist is the Ultimate Boeing 747 gambit.”</b><br>– Richard Dawkins, TGD p. 113</br></p><p><b>“[T]he argument from improbability – the “Ultimate 747″ gambit – is a very serious argument against the existence of God.”</b><br>– Richard Dawkins, TGD p. 157</br></p><p>Touchstone not only reads what isn’t there, he obviously can’t read what actually IS there. <s>There is no theistic “argument from complexity” and</s>* Dawkins not only asserts that the Ultimate 747 is an argument for the nonexistence of God, he vows that he has “yet to hear a theologian give a convincing answer” to it.  (Technically, that may still be true; I’m not a theologian.)  Just as Petrarch reversed the metaphor of the “dark ages”, Dawkins is explicitly attempting to reverse the argument from improbability to argue for the non-existence of God.</p><p>Touchstone admits he hasn’t read TIA and I suspect he hasn’t really read <i>The God Delusion</i> either.  Regardless, it is readily apparent that he is not competent to serve as a reliable interpreter of Dawkins’s poorly articulated intentions.</p><p><i>*I am told that Touchstone meant to write either the Argument from Design or Irreducible Complexity here, both of which certainly exist.  However, both are only tangentially related and neither indicate that Dawkins’s argument is not what Dawkins claims it to be, an argument for the nonexistence of God.</i></p></div>",
  "content_text": "This\nattempt at a critique\nof my refutation of Richard Dawkins’s “Ultimate 747” argument in TIA by Touchstone of Debunking Christianity should amuse some of you.  Microphone Jones correctly pointed out the primary flaw; I added some additional points on the 21st comment.  I have to say, there are few individuals I find funnier than those who attempt to defend an argument by saying that if the argument had been different than it actually is, it would be correct.\nThis is the best part:\nDawkins does not spell out a formal definition of organizational or algorithmic complexity in his book. But you don’t have to be a super-genius to get familiar with the concepts as they are used in science and information theoretic application. I haven’t read Day’s section of “theistic bodycounts” from wars versus “atheistic bodycounts”, but Day’s supporters on my list regale me superlatives of Day’s phenomenal research capabalities. If he’s got such capabilities, he shot all his efforts in previous chapters; Day simply punts here and decides to equate complexity with information.\nOops. That’s a really major blunder. Just in casual terms, complexity is a description of the “number of discrete and differentiated parts”, and information is “reduction in uncertainty”. Complexity and information are related on some level, and those terms do often occur together in computing and information theoretic contexts. But complexity is not information, any more than mass is acceleration.\nIt is a really major blunder.  But the problem here is that the idea of equating complexity with information did not originate with me.  You see, I’m not the one who wrote that Richard Dawkins’s Argument from Improbability is rooted in “the source of all the information in living matter”, or brought up the problem of “continually monitoring and controlling the individual status of every particle in the universe”, or referred incredulously to “bandwidth” contra simplicity.  That would be, well, Richard Dawkins.\nOne can only criticize the existing argument.  If Dawkins has something besides sheer quantity of information in mind there, I should very much like to know precisely what it is.  But until he offers a convincing definition of complexity that fits his argument, the Ultimate 747 simply will not fly.\nUPDATE – This has turned out to be even funnier than I’d thought!  When posting my comment at Debunking Christianity, I skipped right over this rather telling bit written by Touchstone in the comments there:\n“Dawkins is pointing out a structural deficiency in the argument from complexity, that’s all. It’s not an argument for the non-existence of God, just pointing out the poverty of one of the arguments *for* God’s existence.”\n“The argument from improbability, properly deployed, comes close to proving that God does not exist.  My name for the statistical demonstration that God almost certainly does not exist is the Ultimate Boeing 747 gambit.”\n– Richard Dawkins, TGD p. 113\n“[T]he argument from improbability – the “Ultimate 747″ gambit – is a very serious argument against the existence of God.”\n– Richard Dawkins, TGD p. 157\nTouchstone not only reads what isn’t there, he obviously can’t read what actually IS there.\nThere is no theistic “argument from complexity” and\n* Dawkins not only asserts that the Ultimate 747 is an argument for the nonexistence of God, he vows that he has “yet to hear a theologian give a convincing answer” to it.  (Technically, that may still be true; I’m not a theologian.)  Just as Petrarch reversed the metaphor of the “dark ages”, Dawkins is explicitly attempting to reverse the argument from improbability to argue for the non-existence of God.\nTouchstone admits he hasn’t read TIA and I suspect he hasn’t really read\nThe God Delusion\neither.  Regardless, it is readily apparent that he is not competent to serve as a reliable interpreter of Dawkins’s poorly articulated intentions.\n*I am told that Touchstone meant to write either the Argument from Design or Irreducible Complexity here, both of which certainly exist.  However, both are only tangentially related and neither indicate that Dawkins’s argument is not what Dawkins claims it to be, an argument for the nonexistence of God.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-11-22T21:57:00+00:00"
}