{
  "url": "https://voxday.net/2008/11/22/by-f10-and-three-finger-salute/",
  "scraped_at": "2026-01-08T22:41:35.109387",
  "title": "By the F10 and the Three-Finger Salute",
  "date_display": "November 22, 2008",
  "date_iso": "2008-11-22T15:28:00+00:00",
  "date_from_url": "2008-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I summon and invoke the dread spirit of JOHN SCALZI!  (He waits for the appearance of a sulferous orange smoke, which unaccountably fails to appear.)  Ahem… <i>zoe ghost brigade old man war android dream whatever…</i> (gestures madly) <i>JOHNATHAN MICHELANGELO SCALZI IL SECONDO SUBITO VIENIQUA!!!</i></p><p>Be not alarmed.  I’m merely putting the dark sorcery of <a href=\"http://whatever.scalzi.com/2004/01/12/the-law-of-internet-invocation/\">the Law of Internet Invocation</a> to the test.  I note that the explanation for it, though quite correct, isn’t entirely comprehensive.  Unlike my more famous SFWA colleague, I don’t often search for myself via the various search engines; clicking on the Technorati link is about as far as I usually go.  However, people email me links when others have written something about me or my books on a near-daily basis.  That’s how I got word of the New Oxford Review’s review of TIA, for example.</p><p>Anyhow, once we’ve got John in the salt circle, what shall we order him to do?  I think I should like to know three hypothetical Obama administration deal-breakers that would cause him to consider not supporting Obama in 2012?</p></div>",
  "content_text": "I summon and invoke the dread spirit of JOHN SCALZI!  (He waits for the appearance of a sulferous orange smoke, which unaccountably fails to appear.)  Ahem…\nzoe ghost brigade old man war android dream whatever…\n(gestures madly)\nJOHNATHAN MICHELANGELO SCALZI IL SECONDO SUBITO VIENIQUA!!!\nBe not alarmed.  I’m merely putting the dark sorcery of\nthe Law of Internet Invocation\nto the test.  I note that the explanation for it, though quite correct, isn’t entirely comprehensive.  Unlike my more famous SFWA colleague, I don’t often search for myself via the various search engines; clicking on the Technorati link is about as far as I usually go.  However, people email me links when others have written something about me or my books on a near-daily basis.  That’s how I got word of the New Oxford Review’s review of TIA, for example.\nAnyhow, once we’ve got John in the salt circle, what shall we order him to do?  I think I should like to know three hypothetical Obama administration deal-breakers that would cause him to consider not supporting Obama in 2012?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-11-22T15:28:00+00:00"
}