{
  "url": "https://voxday.net/2008/11/07/economics-and-evolution-2/",
  "scraped_at": "2026-01-08T22:40:17.738000",
  "title": "Economics and evolution",
  "date_display": "November 7, 2008",
  "date_iso": "2008-11-07T15:00:00+00:00",
  "date_from_url": "2008-11-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not secret that I find the notion often put forth by evolutionists, particularly those who have actual training in biology, that they are more educated and intellectually sophisticated than all potential detractors, to be ironic in the extreme.  However, it occurs to me that they not only don’t understand what I mean by the backtesting problem that reliably leads them into error, more than a few of my critics have appeared to think that this objection is a misguided and whacky concept that I have somehow conceived on my own.</p><p>So, it was with some amusement that I re-read the beginning to Chapter 4 and realized that Rothbard had spelled out the essential problem in simpler terms than I ever have:</p><blockquote><p>Most writers on the 1929 depression make the same grave mistake that plagues economic studies in general—the use of historical statistics to “test” the validity of economic theory. We have tried to indicate that this is a radically defective methodology for economic science, and that theory can only be confirmed or refuted on prior grounds. <br>– Rothbard, p. 85</br></p></blockquote><p>Needless to say, what is a radically defective methodology for economic science does not magically become any less defective when applied to any other science, including biology.  Unfortunately for all of us, we appear to be on the verge of testing both his theories and Ben Bernanke’s regarding the Great Depression in real time now.  No one likes to be wrong, but I have to admit, this would be a very opportune moment to discovery that Austrian theory is incorrect.</p><p>The incoming data, however, seems to be indicating that it is not: <a href=\"http://business.timesonline.co.uk/tol/business/industry_sectors/banking_and_finance/article5105630.ece\">Darling summons bank chiefs over rate cut failure</a>.</p></div>",
  "content_text": "It’s not secret that I find the notion often put forth by evolutionists, particularly those who have actual training in biology, that they are more educated and intellectually sophisticated than all potential detractors, to be ironic in the extreme.  However, it occurs to me that they not only don’t understand what I mean by the backtesting problem that reliably leads them into error, more than a few of my critics have appeared to think that this objection is a misguided and whacky concept that I have somehow conceived on my own.\nSo, it was with some amusement that I re-read the beginning to Chapter 4 and realized that Rothbard had spelled out the essential problem in simpler terms than I ever have:\nMost writers on the 1929 depression make the same grave mistake that plagues economic studies in general—the use of historical statistics to “test” the validity of economic theory. We have tried to indicate that this is a radically defective methodology for economic science, and that theory can only be confirmed or refuted on prior grounds.\n– Rothbard, p. 85\nNeedless to say, what is a radically defective methodology for economic science does not magically become any less defective when applied to any other science, including biology.  Unfortunately for all of us, we appear to be on the verge of testing both his theories and Ben Bernanke’s regarding the Great Depression in real time now.  No one likes to be wrong, but I have to admit, this would be a very opportune moment to discovery that Austrian theory is incorrect.\nThe incoming data, however, seems to be indicating that it is not:\nDarling summons bank chiefs over rate cut failure\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-11-07T15:00:00+00:00"
}