{
  "url": "https://voxday.net/2008/11/23/emerging-nonsense/",
  "scraped_at": "2026-01-08T22:41:41.360552",
  "title": "Emerging nonsense",
  "date_display": "November 23, 2008",
  "date_iso": "2008-11-23T14:48:00+00:00",
  "date_from_url": "2008-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As has probably been apparent by my complete ignoring of it, I have zero interest in the so-called “Emergent Church”.  I’ve yet to hear anything interesting or positive about it, and I’m <a href=\"http://www.worldnetdaily.com/index.php?fa=PAGE.view&amp;pageId=81765\">not in the least bit surprised</a> to hear that they’re little more than intellectually immature, emotional Episcopalians in the process of moving away from Christianity in favor of a New Age unitarianism:</p><blockquote><p>One of the key leaders of today’s most cutting-edge church movement has opened an Internet discussion on the issue of same-sex marriage with the bold proclamation that he believes “gay, lesbian, bisexual, transsexual and queer” individuals can and should live out their sexuality in – and blessed by – the Christian church.  “I now believe that GLBTQ can live lives in accord with biblical Christianity (as least as much as any of us can!),” writes author and church leader Tony Jones, “and that their monogamy can and should be sanctioned and blessed by church and state.”</p></blockquote><p>Based on that picture, I don’t find it at all hard to believe that Mr. Jones will be announcing his own incipient homogamy in the near future.  And based on his blog, the guy appears to have <a href=\"http://blog.beliefnet.com/tonyjones/2008/11/same-sex-marriage-blogalogue-h.html\">the reasoning capacity of a chipmunk</a>.  Look, Florence Nightingale, the only way one can reasonably connect an AIDS death with the church is if one’s friend was getting overfriendly with a gay priest.  Seriously, what is wrong with these cretins?</p><p><i>“I want to do that!”</i></p><p>“Don’t do that.”</p><p><i>“But I want to… you can’t stop me!”</i></p><p>“Dude, just don’t.  You’ll be sorry.”</p><p><i>“Waaah!  Look what’s happened to me!  It’s all your fault!”</i></p><p>“WTF?  I told you not to, you moron.”</p><p><i>“You made me do it with your hostility and oppression and disapproval!”</i></p><p>“What part of ‘don’t do that’ did you not understand?”</p></div>",
  "content_text": "As has probably been apparent by my complete ignoring of it, I have zero interest in the so-called “Emergent Church”.  I’ve yet to hear anything interesting or positive about it, and I’m\nnot in the least bit surprised\nto hear that they’re little more than intellectually immature, emotional Episcopalians in the process of moving away from Christianity in favor of a New Age unitarianism:\nOne of the key leaders of today’s most cutting-edge church movement has opened an Internet discussion on the issue of same-sex marriage with the bold proclamation that he believes “gay, lesbian, bisexual, transsexual and queer” individuals can and should live out their sexuality in – and blessed by – the Christian church.  “I now believe that GLBTQ can live lives in accord with biblical Christianity (as least as much as any of us can!),” writes author and church leader Tony Jones, “and that their monogamy can and should be sanctioned and blessed by church and state.”\nBased on that picture, I don’t find it at all hard to believe that Mr. Jones will be announcing his own incipient homogamy in the near future.  And based on his blog, the guy appears to have\nthe reasoning capacity of a chipmunk\n.  Look, Florence Nightingale, the only way one can reasonably connect an AIDS death with the church is if one’s friend was getting overfriendly with a gay priest.  Seriously, what is wrong with these cretins?\n“I want to do that!”\n“Don’t do that.”\n“But I want to… you can’t stop me!”\n“Dude, just don’t.  You’ll be sorry.”\n“Waaah!  Look what’s happened to me!  It’s all your fault!”\n“WTF?  I told you not to, you moron.”\n“You made me do it with your hostility and oppression and disapproval!”\n“What part of ‘don’t do that’ did you not understand?”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-11-23T14:48:00+00:00"
}