{
  "url": "https://voxday.net/2008/11/11/first-of-many-backstabs/",
  "scraped_at": "2026-01-08T22:40:36.116824",
  "title": "The first of many backstabs",
  "date_display": "November 11, 2008",
  "date_iso": "2008-11-11T16:26:00+00:00",
  "date_from_url": "2008-11-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Barack Obama begins with <a href=\"http://www.huffingtonpost.com/2008/11/11/wsj-obama-wont-radically_n_142943.html\">the first ritual betrayal</a> of his base:</p><blockquote><p>President-elect Barack Obama is unlikely to radically overhaul controversial Bush administration intelligence policies, advisers say, an approach that is almost certain to create tension within the Democratic Party.</p></blockquote><p>The appointment of Rahm Emmanuel as Chief of Staff wasn’t an actual stab-in-the-back, it only suggested – albeit strongly – that a whole series of betrayals was coming.  No libertarian will be the least bit surprised to learn that Obama has no intention of giving up any of the police state powers that President Bush inveigled from the Congress or manufactured <i>ex nihilo</i> by executive order.  But there will surely be many civil rights enthusiasts who will be as horrified by this as conservatives were appalled by Bush’s creation of a prescription drug entitlement.</p><p>And I look forward to mercilessly reminding conservatives of their idiotic support for the Patriot Acts when Obama begins to find novel uses for them.</p></div>",
  "content_text": "Barack Obama begins with\nthe first ritual betrayal\nof his base:\nPresident-elect Barack Obama is unlikely to radically overhaul controversial Bush administration intelligence policies, advisers say, an approach that is almost certain to create tension within the Democratic Party.\nThe appointment of Rahm Emmanuel as Chief of Staff wasn’t an actual stab-in-the-back, it only suggested – albeit strongly – that a whole series of betrayals was coming.  No libertarian will be the least bit surprised to learn that Obama has no intention of giving up any of the police state powers that President Bush inveigled from the Congress or manufactured\nex nihilo\nby executive order.  But there will surely be many civil rights enthusiasts who will be as horrified by this as conservatives were appalled by Bush’s creation of a prescription drug entitlement.\nAnd I look forward to mercilessly reminding conservatives of their idiotic support for the Patriot Acts when Obama begins to find novel uses for them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-11-11T16:26:00+00:00"
}