{
  "url": "https://voxday.net/2008/11/02/flock-of-c-gulls/",
  "scraped_at": "2026-01-08T22:39:42.854969",
  "title": "A flock of C gulls",
  "date_display": "November 2, 2008",
  "date_iso": "2008-11-02T11:57:00+00:00",
  "date_from_url": "2008-11-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Doesn’t <a href=\"http://www.editorandpublisher.com/eandp/news/article_display.jsp?vnu_content_id=1003886047\">this just make you dream</a> happily about a sex-inclusive military draft with no college exemptions?  Because you know that between Zimbabwe, Kenya, and the Congo, a President Obama is going to invade Africa one way or another.  Perhaps he’s planning to use his armed, federally-funded <a href=\"http://www.youtube.com/watch?v=Tt2yGzHfy7s\">civilian national security force.</a> The only question is, will they wear black shirts or brown?</p><blockquote><p>The Obama campaign leads by better than 2-1 in newspaper endorsements from dailies and weeklies, based on our tally so far. But the Democratic ticket has an even more impressive lead when it comes to college newspapers — 63 to 1, according to UWIRE’s Presidential Endorsement Scorecard</p></blockquote><p>There’s no shortage of evidence that most people are idiots.  This is fundamental to the most basic understanding of human society.  But what’s special about American college students is not that they’re not idiots devoid of wisdom and life experience, it’s that they truly believe they are highly knowledgeable and well-educated despite reliably demonstrating the exact opposite.  I despised them when I was in college and I would probably loathe them more now if I ever had to have any contact with them.  Thankfully I don’t, as in my decades of experience traveling around the world, I yet to encounter a more reliably foolish group of <s>individuals</s>people.</p><p>One of the things I really enjoy about Voxiversity is seeing the awareness of self-ignorance bloom into full-flower in many of the participants.  This is because everyone, no matter how intelligent, is ignorant of most things; the most certain way to conclusively establish that you are a fool is to believe yourself without ignorance.  Unless you recognize and accept your ignorance about a subject, you cannot do anything about filling in those voids in your knowledge base.  While I tend to despise Socrates and find his deceptive dialogues to be vastly overrated, there is something to be said for his open-handed approach to knowledge, which is both humble and arrogant at the same time.</p><p>The problem with the college-educated is that most of them don’t understand that education is not about listening to lectures, being graded, or receiving external confirmation that you happened to possess a certain amount of information about a subject at a specific point in time.  The certificate culture is antithetical to a learning one.  And, I should point out, being maleducated on a subject is worse than being totally ignorant.  It’s much better to know that you have no knowledge than to possess a little and assume you know much.</p><p>This is why, all too often, the A-student in college is no better than a C-student of life.</p><p>UPDATE – Jonah Goldberg <a href=\"http://corner.nationalreview.com/post/?q=N2VhZjM4NjYwZmYwYjFhNTNmNWI4ODYwMjU0ZDJmM2I=\">is similarly unimpressed</a> by the would-be opinion leaders of tomorrow:</p><blockquote><p>I find it hilarious how much respect many readers have for the intellectual chops of these kids. Having been to dozens of campuses this year alone, let me tell you that college newspaper workers (I was an editor myself) are not a superior breed of student. Some are impressive. Many aint. Most are just younger versions of grown-up journalists, only more liberal, more self-important, more emotional and more resentful that people don’t care enough about what they have to say.</p></blockquote></div>",
  "content_text": "Doesn’t\nthis just make you dream\nhappily about a sex-inclusive military draft with no college exemptions?  Because you know that between Zimbabwe, Kenya, and the Congo, a President Obama is going to invade Africa one way or another.  Perhaps he’s planning to use his armed, federally-funded\ncivilian national security force.\nThe only question is, will they wear black shirts or brown?\nThe Obama campaign leads by better than 2-1 in newspaper endorsements from dailies and weeklies, based on our tally so far. But the Democratic ticket has an even more impressive lead when it comes to college newspapers — 63 to 1, according to UWIRE’s Presidential Endorsement Scorecard\nThere’s no shortage of evidence that most people are idiots.  This is fundamental to the most basic understanding of human society.  But what’s special about American college students is not that they’re not idiots devoid of wisdom and life experience, it’s that they truly believe they are highly knowledgeable and well-educated despite reliably demonstrating the exact opposite.  I despised them when I was in college and I would probably loathe them more now if I ever had to have any contact with them.  Thankfully I don’t, as in my decades of experience traveling around the world, I yet to encounter a more reliably foolish group of\nindividuals\npeople.\nOne of the things I really enjoy about Voxiversity is seeing the awareness of self-ignorance bloom into full-flower in many of the participants.  This is because everyone, no matter how intelligent, is ignorant of most things; the most certain way to conclusively establish that you are a fool is to believe yourself without ignorance.  Unless you recognize and accept your ignorance about a subject, you cannot do anything about filling in those voids in your knowledge base.  While I tend to despise Socrates and find his deceptive dialogues to be vastly overrated, there is something to be said for his open-handed approach to knowledge, which is both humble and arrogant at the same time.\nThe problem with the college-educated is that most of them don’t understand that education is not about listening to lectures, being graded, or receiving external confirmation that you happened to possess a certain amount of information about a subject at a specific point in time.  The certificate culture is antithetical to a learning one.  And, I should point out, being maleducated on a subject is worse than being totally ignorant.  It’s much better to know that you have no knowledge than to possess a little and assume you know much.\nThis is why, all too often, the A-student in college is no better than a C-student of life.\nUPDATE – Jonah Goldberg\nis similarly unimpressed\nby the would-be opinion leaders of tomorrow:\nI find it hilarious how much respect many readers have for the intellectual chops of these kids. Having been to dozens of campuses this year alone, let me tell you that college newspaper workers (I was an editor myself) are not a superior breed of student. Some are impressive. Many aint. Most are just younger versions of grown-up journalists, only more liberal, more self-important, more emotional and more resentful that people don’t care enough about what they have to say.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-11-02T11:57:00+00:00"
}