{
  "url": "https://voxday.net/2008/11/13/least-favorite-person-on-rig/",
  "scraped_at": "2026-01-08T22:40:48.934371",
  "title": "Least favorite person on the right",
  "date_display": "November 13, 2008",
  "date_iso": "2008-11-13T14:00:00+00:00",
  "date_from_url": "2008-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You know, perhaps the Republican Party should have paid closer attention to John Hawkins’s <a href=\"http://www.rightwingnews.com/#post13456\">Right Wing News poll</a> last year.  One can’t help but notice that John McCain been in the top 3 of the least popular national figures on the Right with the right-wing blogosphere since the poll first began in 2005:</p><blockquote><p>10) Arnold Schwarzenegger (12)<br>7) Mike Huckabee, Pat Buchanan, Ron Paul (13)<br>6) Chuck Hagel (14)<br>5) Arlen Specter (15)<br>4) Colin Powell (17)<br>3) Peggy Noonan (18)<br>2) Ted Stevens (19)<br>1) John McCain (25)</br></br></br></br></br></br></br></p></blockquote><p>I couldn’t help but notice one rather significant name missing from the 25 on the list.  Not only that, but Peggy Noonan makes a surprise appearance as the third most-unpopular; she wasn’t even on last year’s list.  Don’t you suspect that perhaps this just might have something to do with the extreme popularity of the individual that Noonan rather publicly dissed on several occasions?  I think the poll is a very strong indication that despite the best efforts of the McCain staffers and the Republican <s>squish</s>“reform” faction, Gov. Palin will remain far more popular and influential with the conservative base than will her detractors in the media.</p><p>UPDATE – John Hawkins his own bad self emails with additional information: <i>Not only did Palin not make the list, she didn’t receive a single vote.</i></p></div>",
  "content_text": "You know, perhaps the Republican Party should have paid closer attention to John Hawkins’s\nRight Wing News poll\nlast year.  One can’t help but notice that John McCain been in the top 3 of the least popular national figures on the Right with the right-wing blogosphere since the poll first began in 2005:\n10) Arnold Schwarzenegger (12)\n7) Mike Huckabee, Pat Buchanan, Ron Paul (13)\n6) Chuck Hagel (14)\n5) Arlen Specter (15)\n4) Colin Powell (17)\n3) Peggy Noonan (18)\n2) Ted Stevens (19)\n1) John McCain (25)\nI couldn’t help but notice one rather significant name missing from the 25 on the list.  Not only that, but Peggy Noonan makes a surprise appearance as the third most-unpopular; she wasn’t even on last year’s list.  Don’t you suspect that perhaps this just might have something to do with the extreme popularity of the individual that Noonan rather publicly dissed on several occasions?  I think the poll is a very strong indication that despite the best efforts of the McCain staffers and the Republican\nsquish\n“reform” faction, Gov. Palin will remain far more popular and influential with the conservative base than will her detractors in the media.\nUPDATE – John Hawkins his own bad self emails with additional information:\nNot only did Palin not make the list, she didn’t receive a single vote.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-11-13T14:00:00+00:00"
}