{
  "url": "https://voxday.net/2008/11/17/mailvox-liberal-fascism-in-action/",
  "scraped_at": "2026-01-08T22:41:09.356486",
  "title": "Mailvox: liberal fascism in action",
  "date_display": "November 17, 2008",
  "date_iso": "2008-11-17T15:31:00+00:00",
  "date_from_url": "2008-11-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>“Free Speech for me, but not for thee” is the mantra of the modern “liberal”.  How, one wonders, can anyone seriously attempt to claim to simultaneously champion free speech and yet clamor for the abolition of “hate speech”?</p><blockquote><p>My sister Ellen <a href=\"http://www.vanityfair.com/online/politics/2008/11/the-unlikely-mastermind-behind-the-impeach-obama-movement.html\">started a Facebook group</a> called Impeach Barack Obama, which has gotten a lot of media attention. Someone else started a Facebook group called “We Should Do Something to Ellen Finnigan,” which now has 175 members. It says “we should still have a 0 tolerance for people who talk bad or talk down on our president.” The founder has changed the description to be more mellow, but the implication is clear.  This is liberal fascism at its worst.   I think it deserves maximum attention, as it shows the ugly side of Obama crazies. “We want change, and if you don’t go along with it, better watch out!”</p></blockquote><p>If you think the Obamanations are crazy now, just wait until he begins the ritual back-stabbing as soon as he’s in office!  He’s already signaled this quite clearly with his initial appointments.  I won’t be surprised if more than a few of those who are now heaping odium on Ellen find themselves joining her Facebook group by the end of his first term.</p><p>Personally, I’m quite looking forward to the cognitive dissonance; Obama promises to be even more entertaining than Bush the Younger.  But then, I am a Cruelty Artist.</p></div>",
  "content_text": "“Free Speech for me, but not for thee” is the mantra of the modern “liberal”.  How, one wonders, can anyone seriously attempt to claim to simultaneously champion free speech and yet clamor for the abolition of “hate speech”?\nMy sister Ellen\nstarted a Facebook group\ncalled Impeach Barack Obama, which has gotten a lot of media attention. Someone else started a Facebook group called “We Should Do Something to Ellen Finnigan,” which now has 175 members. It says “we should still have a 0 tolerance for people who talk bad or talk down on our president.” The founder has changed the description to be more mellow, but the implication is clear.  This is liberal fascism at its worst.   I think it deserves maximum attention, as it shows the ugly side of Obama crazies. “We want change, and if you don’t go along with it, better watch out!”\nIf you think the Obamanations are crazy now, just wait until he begins the ritual back-stabbing as soon as he’s in office!  He’s already signaled this quite clearly with his initial appointments.  I won’t be surprised if more than a few of those who are now heaping odium on Ellen find themselves joining her Facebook group by the end of his first term.\nPersonally, I’m quite looking forward to the cognitive dissonance; Obama promises to be even more entertaining than Bush the Younger.  But then, I am a Cruelty Artist.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-11-17T15:31:00+00:00"
}