{
  "url": "https://voxday.net/2008/11/09/meanwhile-back-on-planet-ear/",
  "scraped_at": "2026-01-08T22:40:26.978565",
  "title": "Meanwhile, back on Planet Earth",
  "date_display": "November 9, 2008",
  "date_iso": "2008-11-09T21:35:00+00:00",
  "date_from_url": "2008-11-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>They’re RELIABLY wrong.  Always keep that in mind when <a href=\"http://www.nytimes.com/2008/11/07/opinion/07brooks.html?_r=2&amp;ref=opinion&amp;oref=slogin&amp;oref=slogin\">Republican squishes like David Brooks</a> offer advice as to how Republicans should go about reclaiming the political power they’ve squandered for the last eight years:</p><blockquote><p>I’m dreaming of the successful presidency this country needs. I’m dreaming of an administration led by Barack Obama, but which stretches beyond the normal Democratic base. It makes time for moderate voters, suburban voters, rural voters and even people who voted for the other guy….</p><p>They’ll do things conservatives disagree with, but they’ll also show that they’re not toadies of the liberal interest groups. They’ll insist on merit pay and preserving No Child Left Behind’s accountability standards, no matter what the teachers’ unions say. They’ll postpone contentious fights on things like card check legislation.  Most of all, they’ll take significant action on the problems facing the country without causing a mass freak-out among voters to the right of Nancy Pelosi.</p></blockquote><p>On the same weekend Brooks wrote this, Obama’s transition team announced that they’re considering a series of executive orders in order to quickly flush out the influence of the previous administration while bypassing that unnecessary and annoying procedure otherwise known as “the legislative process”.  Needless to say, this will almost certainly upset those “conservative” members of the commentariat who waxed enthusiastic about the Bush administration’s expansive view of the unitary executive theory.</p><p>UPDATE – Obama’s Chief of Staff confirms the next administration’s <a href=\"http://www.ft.com/cms/s/0/3496c848-ae91-11dd-b621-000077b07658.html\">intent to push left</a> and push hard: <i>“US President-elect Barack Obama intends to push a comprehensive programme of social and economic reform beyond an immediate emergency stimulus package, Rahm Emanuel, the next White House chief of staff, indicated on Sunday.  Mr Emanuel brushed aside concerns that an Obama administration would risk taking on too much when it takes office in January. He said Mr Obama saw the financial meltdown as an historic opportunity to deliver the large-scale investments that Democrats had promised for years.”</i></p><p>A socialist seeing historic opportunity in financial crisis?  That would certainly be new.  At least Americans can console themselves that Obama appears to be more of an international socialist than a national one.</p></div>",
  "content_text": "They’re RELIABLY wrong.  Always keep that in mind when\nRepublican squishes like David Brooks\noffer advice as to how Republicans should go about reclaiming the political power they’ve squandered for the last eight years:\nI’m dreaming of the successful presidency this country needs. I’m dreaming of an administration led by Barack Obama, but which stretches beyond the normal Democratic base. It makes time for moderate voters, suburban voters, rural voters and even people who voted for the other guy….\nThey’ll do things conservatives disagree with, but they’ll also show that they’re not toadies of the liberal interest groups. They’ll insist on merit pay and preserving No Child Left Behind’s accountability standards, no matter what the teachers’ unions say. They’ll postpone contentious fights on things like card check legislation.  Most of all, they’ll take significant action on the problems facing the country without causing a mass freak-out among voters to the right of Nancy Pelosi.\nOn the same weekend Brooks wrote this, Obama’s transition team announced that they’re considering a series of executive orders in order to quickly flush out the influence of the previous administration while bypassing that unnecessary and annoying procedure otherwise known as “the legislative process”.  Needless to say, this will almost certainly upset those “conservative” members of the commentariat who waxed enthusiastic about the Bush administration’s expansive view of the unitary executive theory.\nUPDATE – Obama’s Chief of Staff confirms the next administration’s\nintent to push left\nand push hard:\n“US President-elect Barack Obama intends to push a comprehensive programme of social and economic reform beyond an immediate emergency stimulus package, Rahm Emanuel, the next White House chief of staff, indicated on Sunday.  Mr Emanuel brushed aside concerns that an Obama administration would risk taking on too much when it takes office in January. He said Mr Obama saw the financial meltdown as an historic opportunity to deliver the large-scale investments that Democrats had promised for years.”\nA socialist seeing historic opportunity in financial crisis?  That would certainly be new.  At least Americans can console themselves that Obama appears to be more of an international socialist than a national one.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-11-09T21:35:00+00:00"
}