{
  "url": "https://voxday.net/2008/11/16/migration-move-lef/",
  "scraped_at": "2026-01-08T22:41:02.010595",
  "title": "Migration = Move Left",
  "date_display": "November 16, 2008",
  "date_iso": "2008-11-16T14:46:00+00:00",
  "date_from_url": "2008-11-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Perhaps you’ve noticed that some people get upset when I point out that incoming migration necessarily causes a fundamental change in society, but no one gets their panties in a bunch when those on the left <a href=\"http://frum.nationalreview.com/post/?q=YmY4NGVkZDVjZGM4MzMxZjFmNTQyZDRiOGJkZmY0MDU=\">notice precisely the same thing</a>:</p><blockquote><p>Look closely at the Florida exit polls for 2008 vs 2004. you see why the gop is in deep trouble.  you won white people by exactly the same margins as you beat kerry, but got killed by latinos….  It’s like you’re playing with a deck with only white cards in it—harder and harder to find an Ace of Ivory when the the other side keeps adding black, brown, and yellow cards to its hand.</p></blockquote><p>Note that this is cited as a reason that the Republican Party must <s>move left</s>modernize or face continued electoral decline.  So, how is this substantively different from my observations?  It also seems to escape these keen observers that there is an obvious alternative to simply accepting left-wing multicultural rule for the foreseeable future.</p><p>And given that socionomics predicts increased ethnic conflict during economic contractions, it’s probably too soon to assume that there will be no migrational ebb tide.</p></div>",
  "content_text": "Perhaps you’ve noticed that some people get upset when I point out that incoming migration necessarily causes a fundamental change in society, but no one gets their panties in a bunch when those on the left\nnotice precisely the same thing\n:\nLook closely at the Florida exit polls for 2008 vs 2004. you see why the gop is in deep trouble.  you won white people by exactly the same margins as you beat kerry, but got killed by latinos….  It’s like you’re playing with a deck with only white cards in it—harder and harder to find an Ace of Ivory when the the other side keeps adding black, brown, and yellow cards to its hand.\nNote that this is cited as a reason that the Republican Party must\nmove left\nmodernize or face continued electoral decline.  So, how is this substantively different from my observations?  It also seems to escape these keen observers that there is an obvious alternative to simply accepting left-wing multicultural rule for the foreseeable future.\nAnd given that socionomics predicts increased ethnic conflict during economic contractions, it’s probably too soon to assume that there will be no migrational ebb tide.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-11-16T14:46:00+00:00"
}