{
  "url": "https://voxday.net/2008/11/13/new-oxford-review-on-tia/",
  "scraped_at": "2026-01-08T22:40:47.110732",
  "title": "New Oxford Review on TIA",
  "date_display": "November 13, 2008",
  "date_iso": "2008-11-13T09:06:00+00:00",
  "date_from_url": "2008-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Anne Barbeau Gardiner of the John Jay College <a href=\"http://www.newoxfordreview.org/reviews.jsp?did=1108-gardiner\">reviews <i>The Irrational Atheist</i> for New Oxford Review</a>:</p><blockquote><p>What makes Day’s book entertaining is his exuberant language — the rhetorical fireworks with which he takes on the new atheists. High spirits and clever phrasing provoke continual chuckles, as for example when he remarks that not since the craze for Marx and Freud “has there been so much enthusiasm about the non-existence of God,” and that this new evangelism is directed at “atheists whose lack of faith is weak.” He employs mock praise, too, as in, “Hitchens and Dawkins became atheists after long and exhaustive rational inquiries into the existence of God, both at the age of nine.” Yet the humor doesn’t get in the way of subtle analysis, for he lays bare Dawkins’s “incessant shell games,” Harris’s “exercises in self-parody,” and Hitchens’s “epic feat of intellectual self-evisceration.”…</p><p>Although Day is an evangelical, he is remarkably sympathetic to Catholics, who are usually the chief targets of atheists. Day scoffs at the way Dawkins, in the space of a couple of pages, dismisses the 3,000-page Summa Theologiae of St. Thomas Aquinas: He says that Dawkins waved “a dead chicken over the keyboard” and tried to make readers believe he had “seriously considered” the Sum­ma and found it “wanting.”</p></blockquote><p>I have to confess that the latter bit was, in my considered opinion, probably the most intellectually disgusting thing about <i>The God Delusion</i>, as well as the most revealing of Richard Dawkins’s fundamentally anti-intellectual character.  It certainly demonstrated what a tawdry little charlatan Dawkins is.  As <i>Summa Elvetica</i> should suffice to indicate, I have a much stronger understanding of Aquinan logic than does Dawkins so I am by no means unaware of its intrinsic structural flaw or a number of the more questionable leaps of logic made by the saint. <i>Summa Elvetica</i> may be a parody of the <i>Summa Theologica</i> on several levels, but it is a very <i>respectful</i>, even affectionate, parody because Thomas Aquinas’s masterpiece is a remarkable intellectual achievement that demands the regard of any thinking man; Dawkins should be deeply embarrassed about his shameless attempt to dismiss one of Man’s great philosophical works without the courage to offer any substantive criticism of his own.</p><p>There are errors in every great philosophical classic.  I have myself pointed out several of them in the dialogues of Socrates; imagine what TIA readers would have thought if I had similarly dismissed <i>Euthyphro</i> as “wanting” without bothering to point out any of the specific flaws in the argument.  Richard Dawkins’s criticism of Thomas Aquinas is no more serious or legitimate than The Princess Bride’s take on Plato, Aristotle and Socrates.</p><p>I had to laugh when I reached the end of the review, as it appears the Divine String-puller has arranged things in such a manner as to warm the Responsible Puppet’s heart:</p><blockquote><p>One caveat: At the end, Day touches briefly on theology and tries to solve the mystery of suffering by limiting God’s omnipotence and omniscience. This amounts to reducing a great mystery to a problem.</p></blockquote><p>I tend to think that limiting omniscience to voliscience is not only Biblically correct but also resolves a number of logical objections, so I’m quite curious to know what sort of new problem it might introduce.  But I have no objection whatsoever to this sort of criticism, and am quite pleased to learn that Dr. Gardiner found the book to be worth her while.</p></div>",
  "content_text": "Anne Barbeau Gardiner of the John Jay College\nreviews\nThe Irrational Atheist\nfor New Oxford Review\n:\nWhat makes Day’s book entertaining is his exuberant language — the rhetorical fireworks with which he takes on the new atheists. High spirits and clever phrasing provoke continual chuckles, as for example when he remarks that not since the craze for Marx and Freud “has there been so much enthusiasm about the non-existence of God,” and that this new evangelism is directed at “atheists whose lack of faith is weak.” He employs mock praise, too, as in, “Hitchens and Dawkins became atheists after long and exhaustive rational inquiries into the existence of God, both at the age of nine.” Yet the humor doesn’t get in the way of subtle analysis, for he lays bare Dawkins’s “incessant shell games,” Harris’s “exercises in self-parody,” and Hitchens’s “epic feat of intellectual self-evisceration.”…\nAlthough Day is an evangelical, he is remarkably sympathetic to Catholics, who are usually the chief targets of atheists. Day scoffs at the way Dawkins, in the space of a couple of pages, dismisses the 3,000-page Summa Theologiae of St. Thomas Aquinas: He says that Dawkins waved “a dead chicken over the keyboard” and tried to make readers believe he had “seriously considered” the Sum­ma and found it “wanting.”\nI have to confess that the latter bit was, in my considered opinion, probably the most intellectually disgusting thing about\nThe God Delusion\n, as well as the most revealing of Richard Dawkins’s fundamentally anti-intellectual character.  It certainly demonstrated what a tawdry little charlatan Dawkins is.  As\nSumma Elvetica\nshould suffice to indicate, I have a much stronger understanding of Aquinan logic than does Dawkins so I am by no means unaware of its intrinsic structural flaw or a number of the more questionable leaps of logic made by the saint.\nSumma Elvetica\nmay be a parody of the\nSumma Theologica\non several levels, but it is a very\nrespectful\n, even affectionate, parody because Thomas Aquinas’s masterpiece is a remarkable intellectual achievement that demands the regard of any thinking man; Dawkins should be deeply embarrassed about his shameless attempt to dismiss one of Man’s great philosophical works without the courage to offer any substantive criticism of his own.\nThere are errors in every great philosophical classic.  I have myself pointed out several of them in the dialogues of Socrates; imagine what TIA readers would have thought if I had similarly dismissed\nEuthyphro\nas “wanting” without bothering to point out any of the specific flaws in the argument.  Richard Dawkins’s criticism of Thomas Aquinas is no more serious or legitimate than The Princess Bride’s take on Plato, Aristotle and Socrates.\nI had to laugh when I reached the end of the review, as it appears the Divine String-puller has arranged things in such a manner as to warm the Responsible Puppet’s heart:\nOne caveat: At the end, Day touches briefly on theology and tries to solve the mystery of suffering by limiting God’s omnipotence and omniscience. This amounts to reducing a great mystery to a problem.\nI tend to think that limiting omniscience to voliscience is not only Biblically correct but also resolves a number of logical objections, so I’m quite curious to know what sort of new problem it might introduce.  But I have no objection whatsoever to this sort of criticism, and am quite pleased to learn that Dr. Gardiner found the book to be worth her while.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-11-13T09:06:00+00:00"
}