{
  "url": "https://voxday.net/2008/11/12/portrait-in-conflic/",
  "scraped_at": "2026-01-08T22:40:45.298726",
  "title": "A portrait in conflict",
  "date_display": "November 12, 2008",
  "date_iso": "2008-11-12T23:30:00+00:00",
  "date_from_url": "2008-11-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Wrath of the Lich King is live.  This is good.  Lord British has <a href=\"http://www.gamasutra.com/php-bin/news_index.php?story=21052\">announced his departure from NCSoft</a> in terms that suggest he is essentially retiring from game development.  This is devastating.  I’ve been acquainted with him for years and when we spoke last summer, I was impressed to see how he was one of the few designers in the MMO space who was really trying to break out of the hardware cycle and expand the nature of the fundamental gameplay instead. <i>Tabula Rasa</i> was a failure for a number of reasons that I won’t go into here, but I suspect will prove to be a more influential game in terms of design concepts than much more successful MMOs like Warhammer.</p><p>Instead of beginning the long march to level 80 tonight, I think I shall go old school instead and fire up Akalabeth on the Apple II emulator.</p></div>",
  "content_text": "Wrath of the Lich King is live.  This is good.  Lord British has\nannounced his departure from NCSoft\nin terms that suggest he is essentially retiring from game development.  This is devastating.  I’ve been acquainted with him for years and when we spoke last summer, I was impressed to see how he was one of the few designers in the MMO space who was really trying to break out of the hardware cycle and expand the nature of the fundamental gameplay instead.\nTabula Rasa\nwas a failure for a number of reasons that I won’t go into here, but I suspect will prove to be a more influential game in terms of design concepts than much more successful MMOs like Warhammer.\nInstead of beginning the long march to level 80 tonight, I think I shall go old school instead and fire up Akalabeth on the Apple II emulator.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-11-12T23:30:00+00:00"
}