{
  "url": "https://voxday.net/2008/11/05/prop-8-passes/",
  "scraped_at": "2026-01-08T22:40:04.758618",
  "title": "Prop. 8 passes",
  "date_display": "November 5, 2008",
  "date_iso": "2008-11-05T19:30:00+00:00",
  "date_from_url": "2008-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Evidence that it is pragmatic Republicanism that was rejected yesterday, <a href=\"http://www.telegraph.co.uk/news/newstopics/uselection2008/3384493/Proposition-8-ballot-to-ban-gay-marriage-set-to-pass-in-California.html\">not the conservatism that Republicans nominally represented</a>:</p><blockquote><p>Proposition 8 ballot to ban gay marriage set to pass in California.  With 63 per cent of the state’s voting district results in, the measure was leading by 52.4 to 47.6 per cent….  A ban on gay marriage was approved in Arizona and a similar measure looked set to pass in Florida. Meanwhile in Arkansas, voters approved a measure banning unmarried couples from serving as adoptive or foster parents. Supporters made clear their main target was gays and lesbians.</p></blockquote><p>Perhaps now the homogamy emos will be a bit more open to the idea that the State should not be in the marriage business that they previously dismissed as theoretical.  As with everything else, the State with the power to invent a faux marriage <i>ex nihilo</i>, has the power to void it at will too.</p></div>",
  "content_text": "Evidence that it is pragmatic Republicanism that was rejected yesterday,\nnot the conservatism that Republicans nominally represented\n:\nProposition 8 ballot to ban gay marriage set to pass in California.  With 63 per cent of the state’s voting district results in, the measure was leading by 52.4 to 47.6 per cent….  A ban on gay marriage was approved in Arizona and a similar measure looked set to pass in Florida. Meanwhile in Arkansas, voters approved a measure banning unmarried couples from serving as adoptive or foster parents. Supporters made clear their main target was gays and lesbians.\nPerhaps now the homogamy emos will be a bit more open to the idea that the State should not be in the marriage business that they previously dismissed as theoretical.  As with everything else, the State with the power to invent a faux marriage\nex nihilo\n, has the power to void it at will too.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-11-05T19:30:00+00:00"
}