{
  "url": "https://voxday.net/2008/11/20/so-much-for-shame-john-theory/",
  "scraped_at": "2026-01-08T22:41:24.026840",
  "title": "So much for “shame the john” theory",
  "date_display": "November 20, 2008",
  "date_iso": "2008-11-20T09:12:00+00:00",
  "date_from_url": "2008-11-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.telegraph.co.uk/news/newstopics/howaboutthat/3477293/Brothel-offers-free-entry-to-men-who-have-its-name-tattooed-on-their-arm.html\">Anecdotal evidence</a> strongly suggests it will never be successful in reducing male demand for female prostitution:</p><blockquote><p>A brothel reputed to be the largest in Europe has been overwhelmed with interest after offering free entry for life to customers who have its name tattooed on their arm.  The manager of Pascha, which houses more than 120 prostitutes across its 12 stories, did not expect any takers when he put up posters advertising the tongue-in-cheek promotion.  But more than 40 men have already come forward to have the name inked onto their arm in large blue letters, and the brothel’s tattoo artist is having to work extra shifts to keep up with demand.</p></blockquote><p>As Spacebunny likes to say, men are always proud of the wrong things… at least, the wrong things from a female perspective.  So, you can expect that an anti-prostitution policy designed around reducing men’s demand for sex isn’t very likely to be viable.  Considering the way in which criminal laws and fatal infectious diseases haven’t eliminated homosexuality over the last millenium, it’s rather optimistic, shall we say, to argue that <a href=\"http://www.telegraph.co.uk/opinion/main.jhtml?xml=/opinion/2008/11/20/do2003.xml\">the occasional $1,500 fine</a> is going to have any impact at all on men’s demand for sex with women.  The fine is still cheaper than a weekend trip to Hawaii.</p><p>Although I am not a consumer of paid sexual services myself, I am an adamant advocate of legal prostitution.  It is not only the free market’s way of undermining the feminist political fascism that is destroying the West, it also happens to nicely highlight the fundamental absurdity of most atheist concepts of morality.  That undermining is why the feminist Left is utterly obsessed with attempting to stamp out “sex slavery”.  As usual, the feminist position is logically incoherent; they attempt to argue that while paid sex between adults can and should be subject to government control, unpaid sex between children cannot and should not be.</p><p>Never forget that legality is not morality.  The only thing that has ever prevented prostitution from becoming a part of mainstream Western culture is its Christian moral tradition, not the laws that sprang from that tradition.  Secular culture, which has no broadly applicable moral tradition and rejects the application of Christian morality to sexual matters, has no rational basis for objecting to prostitution; one thing atheists who so admire European secularism seldom see fit to mention is the way in which brothels, call girls, and roadside hookers are a normal part of the Old World landscape.</p><p>Men will always pay for sex in one way or another.  Many young women will always find it easier and more to their liking to earn a living through their sexual capital than by working in any of the more conventional labor markets.  And the Iron Law of Supply and Demand will always trump the best legal efforts of politicians and societal reconstructionists.</p></div>",
  "content_text": "Anecdotal evidence\nstrongly suggests it will never be successful in reducing male demand for female prostitution:\nA brothel reputed to be the largest in Europe has been overwhelmed with interest after offering free entry for life to customers who have its name tattooed on their arm.  The manager of Pascha, which houses more than 120 prostitutes across its 12 stories, did not expect any takers when he put up posters advertising the tongue-in-cheek promotion.  But more than 40 men have already come forward to have the name inked onto their arm in large blue letters, and the brothel’s tattoo artist is having to work extra shifts to keep up with demand.\nAs Spacebunny likes to say, men are always proud of the wrong things… at least, the wrong things from a female perspective.  So, you can expect that an anti-prostitution policy designed around reducing men’s demand for sex isn’t very likely to be viable.  Considering the way in which criminal laws and fatal infectious diseases haven’t eliminated homosexuality over the last millenium, it’s rather optimistic, shall we say, to argue that\nthe occasional $1,500 fine\nis going to have any impact at all on men’s demand for sex with women.  The fine is still cheaper than a weekend trip to Hawaii.\nAlthough I am not a consumer of paid sexual services myself, I am an adamant advocate of legal prostitution.  It is not only the free market’s way of undermining the feminist political fascism that is destroying the West, it also happens to nicely highlight the fundamental absurdity of most atheist concepts of morality.  That undermining is why the feminist Left is utterly obsessed with attempting to stamp out “sex slavery”.  As usual, the feminist position is logically incoherent; they attempt to argue that while paid sex between adults can and should be subject to government control, unpaid sex between children cannot and should not be.\nNever forget that legality is not morality.  The only thing that has ever prevented prostitution from becoming a part of mainstream Western culture is its Christian moral tradition, not the laws that sprang from that tradition.  Secular culture, which has no broadly applicable moral tradition and rejects the application of Christian morality to sexual matters, has no rational basis for objecting to prostitution; one thing atheists who so admire European secularism seldom see fit to mention is the way in which brothels, call girls, and roadside hookers are a normal part of the Old World landscape.\nMen will always pay for sex in one way or another.  Many young women will always find it easier and more to their liking to earn a living through their sexual capital than by working in any of the more conventional labor markets.  And the Iron Law of Supply and Demand will always trump the best legal efforts of politicians and societal reconstructionists.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-11-20T09:12:00+00:00"
}