{
  "url": "https://voxday.net/2008/11/11/surge-repor/",
  "scraped_at": "2026-01-08T22:40:37.926414",
  "title": "Surge report",
  "date_display": "November 11, 2008",
  "date_iso": "2008-11-11T19:30:00+00:00",
  "date_from_url": "2008-11-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First of all, I sincerely thank everyone who participated and bought a book.  The surge was hugely successful, as according to Marcher Lord, 172 copies of <i>Summa Elvetica</i> were purchased during those twelve hours.  What was especially great about this was that it pushed SE over Marcher Lord’s breakeven point, which significantly increases the possibility that there will be a sequel.  In fact, they have already informed me that they would like me to write a second novel in the setting, pending approval of the synopsis.</p><p>So thank you, again, for making it possible.  I hope you will all enjoy the books when they arrive, and that a few of you will see fit to post your reviews of it on Amazon.  Also, if you write a review on your blog, let me know and I’ll be sure to link to it here.</p><p>UPDATE – It sounds as if people are beginning to receive their books today.</p></div>",
  "content_text": "First of all, I sincerely thank everyone who participated and bought a book.  The surge was hugely successful, as according to Marcher Lord, 172 copies of\nSumma Elvetica\nwere purchased during those twelve hours.  What was especially great about this was that it pushed SE over Marcher Lord’s breakeven point, which significantly increases the possibility that there will be a sequel.  In fact, they have already informed me that they would like me to write a second novel in the setting, pending approval of the synopsis.\nSo thank you, again, for making it possible.  I hope you will all enjoy the books when they arrive, and that a few of you will see fit to post your reviews of it on Amazon.  Also, if you write a review on your blog, let me know and I’ll be sure to link to it here.\nUPDATE – It sounds as if people are beginning to receive their books today.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-11-11T19:30:00+00:00"
}