{
  "url": "https://voxday.net/2008/11/07/vii-section-1-questions/",
  "scraped_at": "2026-01-08T22:40:13.980248",
  "title": "VII section 1 questions",
  "date_display": "November 7, 2008",
  "date_iso": "2008-11-07T00:33:00+00:00",
  "date_from_url": "2008-11-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This post is intended for those who are participating in the Voxiversity II study of Rothbard’s <i>America’s Great Depression</i> to have the chance to ask any questions that were missed or overlooked in the Saturday comments.  So, if there’s something you were missing, feel free to ask away.  In the meantime, I noticed that Question 4 was the one with which the most people had trouble.  “In 1982, what did Rothbard believe would be the outcome of Reaganomics?”</p><p>The most common incorrect answer was that he thought it would be a short-term success but a long-term failure.  That’s pretty much how it turned out, in fact, since Volcker’s incredible interest-rate increases did have the effect of shocking the economy and rapidly correcting the malinvestment imbalances, but since Reagan failed to reduce spending, the palliative didn’t quite last a decade.  On page xxiii, Rothbard wrote:</p><p><i>“Reaganomics—a blend of monetarism and fiscal Keynesianism swathed in classical liberal and supply-side rhetoric—is in no way going to solve the problem of inflationary depression or of the business cycle. But if Reaganomics is doomed to be a fiasco, what is likely to happen? Will we suffer a replay, as many voices are increasingly predicting, of the Great Depression of the 1930s? Certainly there are many ominous signs and parallels.”</i></p><p>Obviously, Rothbard’s timing was incorrect; 1987 did not mark the collapse of the American economy into another Great Depression.  But then, no one expected the Federal Reserve to throw all caution and common sense to the wind and reduce interest rates to all-time historic lows in the process of blowing a series of investment bubbles.</p><p>In light of the last two days, Cyn.ical’s comment is rather appropriate: <i>“[M]y thought as I was reading the introductions, was ‘Well! A Sixth Edition ought to be coming out any day now!'”</i></p></div>",
  "content_text": "This post is intended for those who are participating in the Voxiversity II study of Rothbard’s\nAmerica’s Great Depression\nto have the chance to ask any questions that were missed or overlooked in the Saturday comments.  So, if there’s something you were missing, feel free to ask away.  In the meantime, I noticed that Question 4 was the one with which the most people had trouble.  “In 1982, what did Rothbard believe would be the outcome of Reaganomics?”\nThe most common incorrect answer was that he thought it would be a short-term success but a long-term failure.  That’s pretty much how it turned out, in fact, since Volcker’s incredible interest-rate increases did have the effect of shocking the economy and rapidly correcting the malinvestment imbalances, but since Reagan failed to reduce spending, the palliative didn’t quite last a decade.  On page xxiii, Rothbard wrote:\n“Reaganomics—a blend of monetarism and fiscal Keynesianism swathed in classical liberal and supply-side rhetoric—is in no way going to solve the problem of inflationary depression or of the business cycle. But if Reaganomics is doomed to be a fiasco, what is likely to happen? Will we suffer a replay, as many voices are increasingly predicting, of the Great Depression of the 1930s? Certainly there are many ominous signs and parallels.”\nObviously, Rothbard’s timing was incorrect; 1987 did not mark the collapse of the American economy into another Great Depression.  But then, no one expected the Federal Reserve to throw all caution and common sense to the wind and reduce interest rates to all-time historic lows in the process of blowing a series of investment bubbles.\nIn light of the last two days, Cyn.ical’s comment is rather appropriate:\n“[M]y thought as I was reading the introductions, was ‘Well! A Sixth Edition ought to be coming out any day now!'”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-11-07T00:33:00+00:00"
}