{
  "url": "https://voxday.net/2008/07/23/atheists-in-denia/",
  "scraped_at": "2026-01-08T22:31:04.922508",
  "title": "Atheists in denial",
  "date_display": "July 23, 2008",
  "date_iso": "2008-07-23T10:47:00+00:00",
  "date_from_url": "2008-07-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>On Pharyngula the other day, a man named Fr. J pointed out that PZ’s hate mail notwithstanding, it is atheists who are killing Christians rather than the other way around.  Unsurprisingly, <a href=\"http://scienceblogs.com/pharyngula/2008/07/not_again.php#comments\">this prompted the expected reaction</a> from PZ’s incredibly ignorant and mindlessly defensive readers:</p><blockquote><p><i>“I read about how atheists kill and torture Christians all the time.”</i></p><p>Woah, proofs? And while you’re at it, care to talk about the jews you guys killed and tortured for supposedly desecrating the host?<br>Posted by: Michelle | July 22, 2008 3:27 PM</br></p><p>You lying sack of crap… where have the actual threats and actions of physical harm come from in this inceident? WHERE? Answer the question. Then go away.<br>Posted by: Celtic_Evolution | July 22, 2008 3:25 PM</br></p><p>No you don’t, you fucking liar.<br>Posted by: Brownian, OM | July 22, 2008 3:22 PM</br></p><p>That is a big fat case of your pants being on fire lying.<br>Posted by: Rev. BigDumbChimp | July 22, 2008 3:32 PM</br></p><p>And I read about Kirk sky-diving from orbit! IT MUST BE TRUE.<br>Seriously, with this comment you’ve embarrassed yourself past even most christians being willing to defend you.<br>Posted by: NanuNanu | July 22, 2008 3:41 PM</br></br></p><p>I can believe that’s true if you spend all your time reading medical reports documenting the delusions of schizophrenics. <br>Posted by: Emmet Caulfield | July 22, 2008 4:00 PM</br></p></blockquote><p>There are four atheist countries in which atheists are presently jailing, torturing, and murdering Christians.  These countries are China, Laos, North Korea, and Vietnam.  (Cuba was doing the same in the past, but has shown some respect for religious freedom for nearly a decade now.) While American atheists customarily try to fall back on a spurious No True Atheist defense, government documents prove this defense to not only be illogical, but incontrovertibly false.  For example, the motivation for China’s most recent wave of anti-Christian persecution was laid out in a government document entitled “<a href=\"http://www.persecution.net/news/china_secretdoc_eng.pdf\">Notice on Further Strengthening Marxist Atheism Research, Propaganda and Education</a>“.  This proves that the motivation underlying the persecution is atheism; specifically the Marxist variant which is the heart of a godless worldview that correctly sees Christianity as a serious threat.</p><p>A subsequent document laid out the case against the Christian church: <i>“We have dealt with the Falun-gong. We have arrested and put their leaders on the run. Now we must resolutely and strongly deal with the unregistered house churches. They are too numerous — too many. We must deal with them strongly.”</i></p><p>Given that at least 1,600 Falun Gong practitioners have been tortured to death and a number of recent Christian deaths have also been confirmed, such as the beating death of Ms. Jiang Zongxiu in prison on June 18, 2004 and the death of Bishop John Han Dingxian on September 12, 2007, there is absolutely no question that Chinese atheists are murdering Christians today and intend to continue doing so.</p><p>The situation is much worse in North Korea.  In TIA, I quoted <a href=\"http://www.guardian.co.uk/world/2004/feb/01/northkorea\">a 2004 article</a> published by The Guardian: <i>“The number of prisoners held in the North Korean gulag is not known: one estimate is 200,000, held in 12 or more centres. Camp 22 is thought to hold 50,000.  Most are imprisoned because their relatives are believed to be critical of the regime. Many are Christians, a religion believed by Kim Jong-il to be one of the greatest threats to his power.”</i> These North Koreans are not “Kim Jong-ilists”; they are atheists and correctly identify themselves as such.  Their atheist self-identification is less dubious than that of the American atheist who makes a fetish of science and/or Darwinism and believes in the ever-ineffable “progress” towards a shiny, secular, material paradise.</p><p>In Vietnam, the atheist regime <a href=\"http://www.persecution.net/country/vietnam.htm\">is currently persecuting the Montagnards</a>, a predominantly Christian minority.  This is probably done as much for ethnic reasons as anti-religious ones, but the persecution has been purely religious and directed against ethnic Vietnamese Christians in the recent past. <i>Persecution is most intense for the ethnic minorities, especially the Montagnards from the hill country. Many of these people have attempted to flee to neighbouring Cambodia. However, under an agreement with the Vietnamese government, the authorities there have been returning the refugees to Vietnam to collect a bounty. Those who are returned are imprisoned, tortured or killed. Despite the persecution, instead of being destroyed, the church in Vietnam is growing and becoming stronger. Christians now make up almost ten percent of the population.</i></p><p>In Laos, Christians are considered to be enemies of the state and have been viciously persecuted since 1975.  Although the persecution has not been as intense in the last three years, <a href=\"http://www.persecution.net/news/laos14.html\">it still continues</a>: <i>“At least thirteen Christian villagers who were falsely accused of stirring rebel dissent have been killed by authorities in Laos over the past month, according to an August 7, [2007] report from Compass Direct. The report also states that approximately 200 Christians in the village of Sai Jerern have been arrested and imprisoned.”</i></p><p>Atheists have been murdering Christians almost non-stop around the world for the last 91 years and they have done so with predictable regularity in the majority of countries where they have obtained political dominance.  It is all too typical that American atheists are far more concerned about Christian crimes committed against non-atheists in Europe more than 500 years ago than they are about the crimes being committed by avowed atheists against Asian Christians today.</p><p>But the persecutions will fail in the end, as they always do, and as Western Christianity continues to decline amidst its sloth, wealth, and apostasy, Eastern Christianity will rise, energized by the bloody test of its faith in the risen Lord Jesus Christ.</p></div>",
  "content_text": "On Pharyngula the other day, a man named Fr. J pointed out that PZ’s hate mail notwithstanding, it is atheists who are killing Christians rather than the other way around.  Unsurprisingly,\nthis prompted the expected reaction\nfrom PZ’s incredibly ignorant and mindlessly defensive readers:\n“I read about how atheists kill and torture Christians all the time.”\nWoah, proofs? And while you’re at it, care to talk about the jews you guys killed and tortured for supposedly desecrating the host?\nPosted by: Michelle | July 22, 2008 3:27 PM\nYou lying sack of crap… where have the actual threats and actions of physical harm come from in this inceident? WHERE? Answer the question. Then go away.\nPosted by: Celtic_Evolution | July 22, 2008 3:25 PM\nNo you don’t, you fucking liar.\nPosted by: Brownian, OM | July 22, 2008 3:22 PM\nThat is a big fat case of your pants being on fire lying.\nPosted by: Rev. BigDumbChimp | July 22, 2008 3:32 PM\nAnd I read about Kirk sky-diving from orbit! IT MUST BE TRUE.\nSeriously, with this comment you’ve embarrassed yourself past even most christians being willing to defend you.\nPosted by: NanuNanu | July 22, 2008 3:41 PM\nI can believe that’s true if you spend all your time reading medical reports documenting the delusions of schizophrenics.\nPosted by: Emmet Caulfield | July 22, 2008 4:00 PM\nThere are four atheist countries in which atheists are presently jailing, torturing, and murdering Christians.  These countries are China, Laos, North Korea, and Vietnam.  (Cuba was doing the same in the past, but has shown some respect for religious freedom for nearly a decade now.) While American atheists customarily try to fall back on a spurious No True Atheist defense, government documents prove this defense to not only be illogical, but incontrovertibly false.  For example, the motivation for China’s most recent wave of anti-Christian persecution was laid out in a government document entitled “\nNotice on Further Strengthening Marxist Atheism Research, Propaganda and Education\n“.  This proves that the motivation underlying the persecution is atheism; specifically the Marxist variant which is the heart of a godless worldview that correctly sees Christianity as a serious threat.\nA subsequent document laid out the case against the Christian church:\n“We have dealt with the Falun-gong. We have arrested and put their leaders on the run. Now we must resolutely and strongly deal with the unregistered house churches. They are too numerous — too many. We must deal with them strongly.”\nGiven that at least 1,600 Falun Gong practitioners have been tortured to death and a number of recent Christian deaths have also been confirmed, such as the beating death of Ms. Jiang Zongxiu in prison on June 18, 2004 and the death of Bishop John Han Dingxian on September 12, 2007, there is absolutely no question that Chinese atheists are murdering Christians today and intend to continue doing so.\nThe situation is much worse in North Korea.  In TIA, I quoted\na 2004 article\npublished by The Guardian:\n“The number of prisoners held in the North Korean gulag is not known: one estimate is 200,000, held in 12 or more centres. Camp 22 is thought to hold 50,000.  Most are imprisoned because their relatives are believed to be critical of the regime. Many are Christians, a religion believed by Kim Jong-il to be one of the greatest threats to his power.”\nThese North Koreans are not “Kim Jong-ilists”; they are atheists and correctly identify themselves as such.  Their atheist self-identification is less dubious than that of the American atheist who makes a fetish of science and/or Darwinism and believes in the ever-ineffable “progress” towards a shiny, secular, material paradise.\nIn Vietnam, the atheist regime\nis currently persecuting the Montagnards\n, a predominantly Christian minority.  This is probably done as much for ethnic reasons as anti-religious ones, but the persecution has been purely religious and directed against ethnic Vietnamese Christians in the recent past.\nPersecution is most intense for the ethnic minorities, especially the Montagnards from the hill country. Many of these people have attempted to flee to neighbouring Cambodia. However, under an agreement with the Vietnamese government, the authorities there have been returning the refugees to Vietnam to collect a bounty. Those who are returned are imprisoned, tortured or killed. Despite the persecution, instead of being destroyed, the church in Vietnam is growing and becoming stronger. Christians now make up almost ten percent of the population.\nIn Laos, Christians are considered to be enemies of the state and have been viciously persecuted since 1975.  Although the persecution has not been as intense in the last three years,\nit still continues\n:\n“At least thirteen Christian villagers who were falsely accused of stirring rebel dissent have been killed by authorities in Laos over the past month, according to an August 7, [2007] report from Compass Direct. The report also states that approximately 200 Christians in the village of Sai Jerern have been arrested and imprisoned.”\nAtheists have been murdering Christians almost non-stop around the world for the last 91 years and they have done so with predictable regularity in the majority of countries where they have obtained political dominance.  It is all too typical that American atheists are far more concerned about Christian crimes committed against non-atheists in Europe more than 500 years ago than they are about the crimes being committed by avowed atheists against Asian Christians today.\nBut the persecutions will fail in the end, as they always do, and as Western Christianity continues to decline amidst its sloth, wealth, and apostasy, Eastern Christianity will rise, energized by the bloody test of its faith in the risen Lord Jesus Christ.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-23T09:47:00+00:00"
}