{
  "url": "https://voxday.net/2008/07/27/audacity-of-fiction/",
  "scraped_at": "2026-01-08T22:31:27.051587",
  "title": "The audacity of fiction",
  "date_display": "July 27, 2008",
  "date_iso": "2008-07-27T22:40:00+00:00",
  "date_from_url": "2008-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is absolutely no way that <a href=\"http://www.bild.de/BILD/news/bild-english/world-news/2008/07/24/Bild-was-in-fitness-studio/with-barack-obama-before-his-speech-in-berlin.html\">this latest legend</a> in the growing mythology of the Obamassiah can possibly be true:</p><blockquote><p>Obama (with toned arms and a strong back) puts on his headphones for his iPod to listen to pop music. He hums quietly. Then he jumps on a fitness bike. He pushes three times on the pedals – but then can’t be bothered with it.  He goes and picks up a pair of 16 kilo weights and starts curling them with his left and right arms, 30 repetitions on each side.  Then, amazingly, he picks up the 32 kilo weights! Very slowly he lifts them, first 10 curls with his right, then 10 with his left. He breathes deeply in and out and takes a sip of water from his 0,5 litre Evian bottle.</p></blockquote><p>Now, Obama obviously keeps himself in shape, but either his magical negritude is much more powerful than I’d previously believed or this German reporter is at best mistaking pounds for kilos.  I have lifted weights regularly for 20 years and at 17 inches in circumference, my arms should be significantly stronger than Obama’s appear to be in <a href=\"http://www.citizenu.org/uploaded_images/PH2007010801538-744225.jpg\">the famous beach photo</a>.  I do use the 32-kilo dumbbells occasionally myself, but only for shoulder press and even then for just four reps.  Granted, I do both pull-ups and straight bar before getting to dumbbell curls, but I start with reps of ten at 35-40 kilos on the straight bar using both arms and 14 kilos for the single-arm exercises.  I finish with four reps at 50 and 20, respectively.  At no point have I ever used more than 22 kilos for one-arm curls and that was when I was hitting the weights very hard while using creatine.</p><p>If Obama proves that he can curl 10 reps with each arm using 70-pound dumbbells after doing a set of 30 with 35-pounders, I will publicly endorse him in a WND column because there clearly isn’t anything that the man cannot do.</p><p>And yes, <a href=\"http://www.nytimes.com/2008/07/27/opinion/27dowd.html?em&amp;ex=1217390400&amp;en=f77f42c3a76e65dd&amp;ei=5087%0A\">Maureen Dowd’s NYT column today</a> is precisely the sort of thing I was describing in today’s WND column: the pseudo-sophisticated American who thinks they know all about Europe from their two-week summer vacations to the various capitals.</p></div>",
  "content_text": "There is absolutely no way that\nthis latest legend\nin the growing mythology of the Obamassiah can possibly be true:\nObama (with toned arms and a strong back) puts on his headphones for his iPod to listen to pop music. He hums quietly. Then he jumps on a fitness bike. He pushes three times on the pedals – but then can’t be bothered with it.  He goes and picks up a pair of 16 kilo weights and starts curling them with his left and right arms, 30 repetitions on each side.  Then, amazingly, he picks up the 32 kilo weights! Very slowly he lifts them, first 10 curls with his right, then 10 with his left. He breathes deeply in and out and takes a sip of water from his 0,5 litre Evian bottle.\nNow, Obama obviously keeps himself in shape, but either his magical negritude is much more powerful than I’d previously believed or this German reporter is at best mistaking pounds for kilos.  I have lifted weights regularly for 20 years and at 17 inches in circumference, my arms should be significantly stronger than Obama’s appear to be in\nthe famous beach photo\n.  I do use the 32-kilo dumbbells occasionally myself, but only for shoulder press and even then for just four reps.  Granted, I do both pull-ups and straight bar before getting to dumbbell curls, but I start with reps of ten at 35-40 kilos on the straight bar using both arms and 14 kilos for the single-arm exercises.  I finish with four reps at 50 and 20, respectively.  At no point have I ever used more than 22 kilos for one-arm curls and that was when I was hitting the weights very hard while using creatine.\nIf Obama proves that he can curl 10 reps with each arm using 70-pound dumbbells after doing a set of 30 with 35-pounders, I will publicly endorse him in a WND column because there clearly isn’t anything that the man cannot do.\nAnd yes,\nMaureen Dowd’s NYT column today\nis precisely the sort of thing I was describing in today’s WND column: the pseudo-sophisticated American who thinks they know all about Europe from their two-week summer vacations to the various capitals.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-27T21:40:00+00:00"
}