{
  "url": "https://voxday.net/2008/07/19/best-defense/",
  "scraped_at": "2026-01-08T22:30:47.220748",
  "title": "The best defense",
  "date_display": "July 19, 2008",
  "date_iso": "2008-07-19T11:06:00+00:00",
  "date_from_url": "2008-07-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>is an incompetent opponent.  In the comments to <a href=\"http://paholaisen-asianajaja.blogspot.com/2008/07/irrational-atheist.html\">PA’s review of TIA</a>, Norm Doering failed to pass up a very good opportunity to avoid demonstrating his reading comprehension issues, to say nothing of the all-too-typical veracity of the vehement atheist:</p><blockquote><p>Watch out for Vox. I caught him in a rather bald faced lie when I read his sample chapter on Sam Harris.</p><p><a href=\"http://normdoering.blogspot.com/2008/01/just-one-more-of-vox-days-lies-andor.html\">Details here on my blog pos</a>t.</p><p>Don’t be so sure he is using the full quotes, he quote mines and takes things out of context. Don’t rely on him to get the real views of Harris, Dawkins and Hitchens.</p></blockquote><p>Now, first of all, understand that this “bright” hasn’t actually read the book.  He read <i>an early draft</i> of the Sam Harris chapter which I sent out to a few people in order to get constructive criticism before writing the book.  That chapter, like every other chapter, saw subsequent changes made as minor errors and mistakes were caught and changed prior to the publication of the book.  This is the excerpt which is the source of his ludicrous accusations:</p><p><i><b>Factual error.</b> Harris begins The End of Faith by strongly implying that almost all suicide bombers are Muslims. Jane’s Intelligence Review reports that the Liberation Tigers of Tamil Eelam, who are not Muslims but a Marxist liberation front that committed 168 of the 273 suicide bombings that took place between 1980 and 2000, have historically been the leading practitioners of suicide bombing.  Harris tries to cover up his blunder in the Notes section of the paperback edition by claiming that to describe the Tigers as secular “is misleading” because they “are Hindus who undoubtedly believe many improbable things about the nature of life and death.” But the Tamil Tigers themselves expressly claim secular status, a declaration supported by the fact that the recently deceased Anton Balasingham, the LTTE’s chief political strategist and ideologue, was a Roman Catholic. It’s also worth noting that slain Tigers are buried rather than cremated according to Hindu ritual. More importantly, there is no definition of “secular” that precludes a belief in improbable things about the nature of life and death or anything else, including the Labor Theory of Value, String Theory, or multiple universes.</i></p><p>Doering reads this and concludes: “One factoid Vox used in that early draft was to claim that it’s a “lie” or “factual error” in Harris’ book that Sam “claims” that most suicide bombers are Muslims.”</p><p>1.  Doering invents an accusation of my claim that Harris is lying.<br>2.  Doering demonstrates an inability to comprehend what he reads in failing to grasp that the factual error of which I am accusing Harris is his claim that the Tamil Tigers are not a secular organization, not his implication that most suicide bombers are Muslim.<br>3.  Doering doesn’t notice that Harris has already conceded the point by attempting to argue that the Tamil Tigers are not secular; he never attempts to defend his original point about Islam being a uniquely correlated factor in causing suicide bombings.<br>4.  The reason that underlies the factual error I highlighted is that theoretical correlation between suicide bombing and Islam by is extremely questionable, bordering on the downright stupid, given its problematic dependence on the irrelevant “bombing” rather than rather more salient “suicide”.  That this is the result of preconceived notions is obvious given the tendency of those who subscribe to the Islamic theory to somehow include the 21 suicide attackers of 9/11 while ignoring the 3,912 <i>tokkōtai</i> who committed aerial suicide attacks in less than a year during 1944-45… four years after the phrase “suicide bombing” had already been used to describe a tactic used on the European front in World War II. <br>5.  It is obviously absurd, bordering on actual lunacy, to criticize the actual published book which you have not read on the basis of an early draft that was never published.  And given that Doering has not, by his own admission, actually read the book, how can he possibly state whether the quotes it contains are accurate and in context or not?</br></br></br></br></p><p>Every now and then, I find myself sitting on the deck, looking out over the sea with only a bottle of prosecco to keep me company, wondering if I truly am as stunningly intelligent as it seems.  Or is it possible, I muse, that it only looks that way because my critics are so mind-bogglingly stupid.</p></div>",
  "content_text": "is an incompetent opponent.  In the comments to\nPA’s review of TIA\n, Norm Doering failed to pass up a very good opportunity to avoid demonstrating his reading comprehension issues, to say nothing of the all-too-typical veracity of the vehement atheist:\nWatch out for Vox. I caught him in a rather bald faced lie when I read his sample chapter on Sam Harris.\nDetails here on my blog pos\nt.\nDon’t be so sure he is using the full quotes, he quote mines and takes things out of context. Don’t rely on him to get the real views of Harris, Dawkins and Hitchens.\nNow, first of all, understand that this “bright” hasn’t actually read the book.  He read\nan early draft\nof the Sam Harris chapter which I sent out to a few people in order to get constructive criticism before writing the book.  That chapter, like every other chapter, saw subsequent changes made as minor errors and mistakes were caught and changed prior to the publication of the book.  This is the excerpt which is the source of his ludicrous accusations:\nFactual error.\nHarris begins The End of Faith by strongly implying that almost all suicide bombers are Muslims. Jane’s Intelligence Review reports that the Liberation Tigers of Tamil Eelam, who are not Muslims but a Marxist liberation front that committed 168 of the 273 suicide bombings that took place between 1980 and 2000, have historically been the leading practitioners of suicide bombing.  Harris tries to cover up his blunder in the Notes section of the paperback edition by claiming that to describe the Tigers as secular “is misleading” because they “are Hindus who undoubtedly believe many improbable things about the nature of life and death.” But the Tamil Tigers themselves expressly claim secular status, a declaration supported by the fact that the recently deceased Anton Balasingham, the LTTE’s chief political strategist and ideologue, was a Roman Catholic. It’s also worth noting that slain Tigers are buried rather than cremated according to Hindu ritual. More importantly, there is no definition of “secular” that precludes a belief in improbable things about the nature of life and death or anything else, including the Labor Theory of Value, String Theory, or multiple universes.\nDoering reads this and concludes: “One factoid Vox used in that early draft was to claim that it’s a “lie” or “factual error” in Harris’ book that Sam “claims” that most suicide bombers are Muslims.”\n1.  Doering invents an accusation of my claim that Harris is lying.\n2.  Doering demonstrates an inability to comprehend what he reads in failing to grasp that the factual error of which I am accusing Harris is his claim that the Tamil Tigers are not a secular organization, not his implication that most suicide bombers are Muslim.\n3.  Doering doesn’t notice that Harris has already conceded the point by attempting to argue that the Tamil Tigers are not secular; he never attempts to defend his original point about Islam being a uniquely correlated factor in causing suicide bombings.\n4.  The reason that underlies the factual error I highlighted is that theoretical correlation between suicide bombing and Islam by is extremely questionable, bordering on the downright stupid, given its problematic dependence on the irrelevant “bombing” rather than rather more salient “suicide”.  That this is the result of preconceived notions is obvious given the tendency of those who subscribe to the Islamic theory to somehow include the 21 suicide attackers of 9/11 while ignoring the 3,912\ntokkōtai\nwho committed aerial suicide attacks in less than a year during 1944-45… four years after the phrase “suicide bombing” had already been used to describe a tactic used on the European front in World War II.\n5.  It is obviously absurd, bordering on actual lunacy, to criticize the actual published book which you have not read on the basis of an early draft that was never published.  And given that Doering has not, by his own admission, actually read the book, how can he possibly state whether the quotes it contains are accurate and in context or not?\nEvery now and then, I find myself sitting on the deck, looking out over the sea with only a bottle of prosecco to keep me company, wondering if I truly am as stunningly intelligent as it seems.  Or is it possible, I muse, that it only looks that way because my critics are so mind-bogglingly stupid.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-19T10:06:00+00:00"
}