{
  "url": "https://voxday.net/2008/07/09/cognitive-contortions/",
  "scraped_at": "2026-01-08T22:29:37.626986",
  "title": "Cognitive contortions",
  "date_display": "July 9, 2008",
  "date_iso": "2008-07-09T08:50:00+00:00",
  "date_from_url": "2008-07-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Daniel Finklestein <a href=\"http://www.timesonline.co.uk/tol/comment/columnists/daniel_finkelstein/article4296359.ece\">explains the existence</a> of some of the more bizarre arguments of the New Atheists, among many other things:</p><blockquote><p>It is commonly thought that we have theories and that they are tested by the facts. The opposite is true. We have theories and then we strive mightily to fit the facts into them, ignoring those that don’t quite work or reinterpreting them if we have to. The more we have at stake emotionally, the more pressing this task becomes.</p></blockquote><p>And now, for <a href=\"http://teapotatheism.blogspot.com/2008/06/anonymous-wanted-body-count-total-so-he.html\">an extraordinary example of this cognitive contortion</a> in action, consider this attempt by the Teapot Atheist to turn around the damning body count observation that has produced more spectacular atheist twists and tumbles than any other aspect of the ongoing debate.</p><blockquote><p>So, at its very highest, atheists have caused almost a whopping 100 million deaths throughout world history. This is about 1/20th the casualties caused by the morally depraved theists who have dominated history. Given that statistically about 16% of the world is non-religious but only about 5% of total world military/genocidal violence has been caused by atheism, we can safely add one more piece of evidence that theists have proven themselves to be far and away more morally depraved, violent, aggressive, brutally selfish, and downright nasty to each other than us infidels.</p></blockquote><p>Bear with me as I point out the logical errors of this argument without even bothering to dispute any of the extremely dubious “facts” that he asserts.</p><p>1.  We are often told that “non-religious” cannot be equated with “atheist”, especially by atheists troubled by the prison statistics that show how the non-religious are overrepresented in the criminal population.  This is a typical atheist deceit, counting the non-religious as atheists when it suits them, denying that they are atheists when it doesn’t.</p><p>2.  Even if the religious affiliation statistics are correct for today, this does not mean they were correct 10 years ago, let alone 1,000.</p><p>3.  By what standard does this individual label anyone, or any action, “morally depraved”?</p><p>4.  There have been approximately 89 atheist leaders throughout world history.  By the Teapot Atheist’s own admission, those 89 atheists have accounted for 1/20th the FATALITIES – casualties include but usually don’t imply deaths – so if there have been more than 1,780 theistic leaders who have, as the Teapot Atheist declares, dominated recorded world history, then atheists are clearly the more lethally inclined.</p><p>5.  Curiously enough, I calculated a conservative estimate of 1,781 Christian leaders of Byzantium from 392 to 1453 and Christendom from 800 to the present.  Multiplying this figure by 5 to account for Africa, Asia, North America, South America and the South Pacific, and then again by 5 to account for previous historical epochs counted by the Teapot Atheist, we get a very conservative figure of approximately 44,525 historical theistic leaders.  This is far, far too low, of course, since our recent reading of <i>The History of the Peloponnesian War</i> shows that there were hundreds of city-states where now there are simply the two nation-states of Greece and Italy, but even so, it suffices to demonstrate that atheist leaders are at least 25x more inclined to behave in a murderous fashion than theist leaders <i>according to the Teapot Atheist’s own statistical measure!</i></p><p>If atheists were truly rational and guided by objective evidence as they claim rather than simple loyalty to their preconceived notions as Finklestein asserts most men are, they would accept the legitimacy of the historical body count argument against atheism and attempt to understand why so many of their co-non-religionists are inordinately inclined to commit mass murder once they find themselves in a position that enables them to do so.  Instead, they repeatedly humiliate themselves in public by attempting to deny the undeniable in defense of the indefensible.</p><p>It’s also clear that most atheists should stay far, very far, away from statistics and probability when arguing about religion.  There is an increasing body of evidence demonstrating that from the Archbishop of Oxford on down, they simply don’t understand either.</p></div>",
  "content_text": "Daniel Finklestein\nexplains the existence\nof some of the more bizarre arguments of the New Atheists, among many other things:\nIt is commonly thought that we have theories and that they are tested by the facts. The opposite is true. We have theories and then we strive mightily to fit the facts into them, ignoring those that don’t quite work or reinterpreting them if we have to. The more we have at stake emotionally, the more pressing this task becomes.\nAnd now, for\nan extraordinary example of this cognitive contortion\nin action, consider this attempt by the Teapot Atheist to turn around the damning body count observation that has produced more spectacular atheist twists and tumbles than any other aspect of the ongoing debate.\nSo, at its very highest, atheists have caused almost a whopping 100 million deaths throughout world history. This is about 1/20th the casualties caused by the morally depraved theists who have dominated history. Given that statistically about 16% of the world is non-religious but only about 5% of total world military/genocidal violence has been caused by atheism, we can safely add one more piece of evidence that theists have proven themselves to be far and away more morally depraved, violent, aggressive, brutally selfish, and downright nasty to each other than us infidels.\nBear with me as I point out the logical errors of this argument without even bothering to dispute any of the extremely dubious “facts” that he asserts.\n1.  We are often told that “non-religious” cannot be equated with “atheist”, especially by atheists troubled by the prison statistics that show how the non-religious are overrepresented in the criminal population.  This is a typical atheist deceit, counting the non-religious as atheists when it suits them, denying that they are atheists when it doesn’t.\n2.  Even if the religious affiliation statistics are correct for today, this does not mean they were correct 10 years ago, let alone 1,000.\n3.  By what standard does this individual label anyone, or any action, “morally depraved”?\n4.  There have been approximately 89 atheist leaders throughout world history.  By the Teapot Atheist’s own admission, those 89 atheists have accounted for 1/20th the FATALITIES – casualties include but usually don’t imply deaths – so if there have been more than 1,780 theistic leaders who have, as the Teapot Atheist declares, dominated recorded world history, then atheists are clearly the more lethally inclined.\n5.  Curiously enough, I calculated a conservative estimate of 1,781 Christian leaders of Byzantium from 392 to 1453 and Christendom from 800 to the present.  Multiplying this figure by 5 to account for Africa, Asia, North America, South America and the South Pacific, and then again by 5 to account for previous historical epochs counted by the Teapot Atheist, we get a very conservative figure of approximately 44,525 historical theistic leaders.  This is far, far too low, of course, since our recent reading of\nThe History of the Peloponnesian War\nshows that there were hundreds of city-states where now there are simply the two nation-states of Greece and Italy, but even so, it suffices to demonstrate that atheist leaders are at least 25x more inclined to behave in a murderous fashion than theist leaders\naccording to the Teapot Atheist’s own statistical measure!\nIf atheists were truly rational and guided by objective evidence as they claim rather than simple loyalty to their preconceived notions as Finklestein asserts most men are, they would accept the legitimacy of the historical body count argument against atheism and attempt to understand why so many of their co-non-religionists are inordinately inclined to commit mass murder once they find themselves in a position that enables them to do so.  Instead, they repeatedly humiliate themselves in public by attempting to deny the undeniable in defense of the indefensible.\nIt’s also clear that most atheists should stay far, very far, away from statistics and probability when arguing about religion.  There is an increasing body of evidence demonstrating that from the Archbishop of Oxford on down, they simply don’t understand either.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-09T07:50:00+00:00"
}