{
  "url": "https://voxday.net/2008/07/08/death-of-dystopian/",
  "scraped_at": "2026-01-08T22:29:30.273474",
  "title": "Death of a dystopian",
  "date_display": "July 8, 2008",
  "date_iso": "2008-07-08T08:56:00+00:00",
  "date_from_url": "2008-07-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The recently deceased Thomas Disch was <a href=\"http://tomsdisch.livejournal.com/\">a fine and underappreciated literary talent</a> laboring primarily in the SF <s>literary</s> ghetto.  Like all too many creative talents, he was used, abused, and cast aside by the sharks in suits who sustain themselves upon such prey; <i>The Lion King</i> is reportedly based upon a treatment he submitted to Disney although he apparently never saw any benefit from its blockbuster success.  (Today’s Lesson: never work with Hollywood in any of its guises.)</p><p>I couldn’t help but feel that his sad and self-inflicted end could reasonably be described as unexpected, however, given the attitude expressed in <a href=\"http://www.strangehorizons.com/2001/20010730/interview.shtml\">this 2001 interview</a> with <i>Strange Horizons</i>:</p><blockquote><p>DH: Was it a struggle to establish your career? What was the science fiction field like in the early ’60s?</p><p>TD: Wide open, for me. I quickly got pretty good, to the degree that it sent out warning signals to some people. Even the dislike of those who didn’t like me was a kind of compliment, in the form that it took. Algis Budrys talked of me as a “nihilist.” That’s the word people use when they want to say, “this is our enemy. He believes nothing.” Meaning, he believes nothing that we believe in (and we believe a lot of crap). So you have the advantage over them that way, even in their enmity.</p><p>DH: Were you trying to do something different–</p><p>TD: I didn’t have to try. If I just followed my vision, that was different. There were lots of people my own age and generation and background who were writing similarly to me, and so I was scarcely alone — I was part of the “New Wave,” which meant: college-educated smartypants. The old kind of smartass writer had only had a high school education. Science fiction in the ’30s and ’40s was a working class literature, like the detective pulps. The whole country gradually was becoming more educated, and I was part of that whole transition.</p><p>DH: How much of this was also a product of, or influenced by, the cultural and social changes going on in the ’60s?</p><p>TD: Well, we were the cultural and social change going on. We were part of it, we reflected it in our own lives, we mirrored it, and we stimulated it by our writings and other vehicles. It was mutually reinforcing. It’s nice to have been part of history that way.</p><p>DH: Did you have a sense at the time that you and your colleagues were doing something different and new?</p><p>TD: Oh, sure, we knew it. It was rather a glorious sensation. We knew we were kicking ass. And that was fun.</p><p>DH: So the reception was positive at the time, within the field, within fandom as it existed then?</p><p>TD: Well, it was positive and negative. Always, the older generation that’s being shoved aside isn’t too happy about that. The older ones had a choice — they could join us, or they could try and fight back. It was really a case of which ones were going to decide to be fuddy-duddies, and which ones were going to move along.</p><p>There was one generation right on the cusp — Brian Aldiss, Phil Dick, people in that generation — that had the choice of becoming New Wave with us, and taking advantage of all of the liberties of writing — the adult-rated language, and situations, and comedy. You could finally write for grown-ups! That was wonderful! For lots of the older writers, it was catnip to them, and they had a rebirth; Damon Knight was one of them. But there were a few stick-in-the muds who just couldn’t move with the times, like Algis Budrys, and Ray Bradbury, and I think they sort of stayed back in the Paleolithic.</p></blockquote><p>Every generation believes it is something new, something different and unique.  Every generation believes it is immortal and imagines that for the first time in history, time will stop and stand still in order to bask in the marvel of this glorious, self-confident New Youth.  Every generation sneers at the hard-earned wisdom of the elders and scorns the democracy of the dead.</p><p>“Vanity of vanities, saith the preacher; all is vanity.”  And eventually, the nihilist comes to understand the arrogance and certainty of youth fades with its beauty and there is nothing new under the sun.</p><p>Still, Disch had the courage to write the world as he saw it rather than the way he wished it to be.  One must honor him for that, even if one regrets his dearth of hope.</p></div>",
  "content_text": "The recently deceased Thomas Disch was\na fine and underappreciated literary talent\nlaboring primarily in the SF\nliterary\nghetto.  Like all too many creative talents, he was used, abused, and cast aside by the sharks in suits who sustain themselves upon such prey;\nThe Lion King\nis reportedly based upon a treatment he submitted to Disney although he apparently never saw any benefit from its blockbuster success.  (Today’s Lesson: never work with Hollywood in any of its guises.)\nI couldn’t help but feel that his sad and self-inflicted end could reasonably be described as unexpected, however, given the attitude expressed in\nthis 2001 interview\nwith\nStrange Horizons\n:\nDH: Was it a struggle to establish your career? What was the science fiction field like in the early ’60s?\nTD: Wide open, for me. I quickly got pretty good, to the degree that it sent out warning signals to some people. Even the dislike of those who didn’t like me was a kind of compliment, in the form that it took. Algis Budrys talked of me as a “nihilist.” That’s the word people use when they want to say, “this is our enemy. He believes nothing.” Meaning, he believes nothing that we believe in (and we believe a lot of crap). So you have the advantage over them that way, even in their enmity.\nDH: Were you trying to do something different–\nTD: I didn’t have to try. If I just followed my vision, that was different. There were lots of people my own age and generation and background who were writing similarly to me, and so I was scarcely alone — I was part of the “New Wave,” which meant: college-educated smartypants. The old kind of smartass writer had only had a high school education. Science fiction in the ’30s and ’40s was a working class literature, like the detective pulps. The whole country gradually was becoming more educated, and I was part of that whole transition.\nDH: How much of this was also a product of, or influenced by, the cultural and social changes going on in the ’60s?\nTD: Well, we were the cultural and social change going on. We were part of it, we reflected it in our own lives, we mirrored it, and we stimulated it by our writings and other vehicles. It was mutually reinforcing. It’s nice to have been part of history that way.\nDH: Did you have a sense at the time that you and your colleagues were doing something different and new?\nTD: Oh, sure, we knew it. It was rather a glorious sensation. We knew we were kicking ass. And that was fun.\nDH: So the reception was positive at the time, within the field, within fandom as it existed then?\nTD: Well, it was positive and negative. Always, the older generation that’s being shoved aside isn’t too happy about that. The older ones had a choice — they could join us, or they could try and fight back. It was really a case of which ones were going to decide to be fuddy-duddies, and which ones were going to move along.\nThere was one generation right on the cusp — Brian Aldiss, Phil Dick, people in that generation — that had the choice of becoming New Wave with us, and taking advantage of all of the liberties of writing — the adult-rated language, and situations, and comedy. You could finally write for grown-ups! That was wonderful! For lots of the older writers, it was catnip to them, and they had a rebirth; Damon Knight was one of them. But there were a few stick-in-the muds who just couldn’t move with the times, like Algis Budrys, and Ray Bradbury, and I think they sort of stayed back in the Paleolithic.\nEvery generation believes it is something new, something different and unique.  Every generation believes it is immortal and imagines that for the first time in history, time will stop and stand still in order to bask in the marvel of this glorious, self-confident New Youth.  Every generation sneers at the hard-earned wisdom of the elders and scorns the democracy of the dead.\n“Vanity of vanities, saith the preacher; all is vanity.”  And eventually, the nihilist comes to understand the arrogance and certainty of youth fades with its beauty and there is nothing new under the sun.\nStill, Disch had the courage to write the world as he saw it rather than the way he wished it to be.  One must honor him for that, even if one regrets his dearth of hope.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-08T07:56:00+00:00"
}