{
  "url": "https://voxday.net/2008/07/22/difficult-but-not-impossible/",
  "scraped_at": "2026-01-08T22:30:59.669406",
  "title": "Difficult, but not impossible",
  "date_display": "July 22, 2008",
  "date_iso": "2008-07-22T10:37:00+00:00",
  "date_from_url": "2008-07-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Derbyshire muses on <a href=\"http://article.nationalreview.com/?q=NjEzOTM1YmM4ZmYxOTExMTg1MTZmODlhZGM0N2RkY2I=&amp;w=MQ==\">the difficulty of speaking with the differently intelligenced</a>:</p><blockquote><p>William Deresiewicz in <i>The American Scholar</i>, wrote recently about the difficulty of talking to a plumber:</p><p><i>It didn’t dawn on me that there might be a few holes in my education until I was about 35. I’d just bought a house, the pipes needed fixing, and the plumber was standing in my kitchen. There he was, a short, beefy guy with a goatee and a Red Sox cap and a thick Boston accent, and I suddenly learned that I didn’t have the slightest idea what to say to someone like him. So alien was his experience to me, so unguessable his values, so mysterious his very language, that I couldn’t succeed in engaging him in a few minutes of small talk before he got down to work. Fourteen years of higher education and a handful of Ivy League [degrees], and there I was, stiff and stupid, struck dumb by my own dumbness. “Ivy retardation,” a friend of mine calls this. I could carry on conversations with people from other countries, in other languages, but I couldn’t talk to the man who was standing in my own house.</i></p><p>It’s a horrifying story, but not a surprising one. This is indeed what we have come to. An acquaintance of mine, an academic in the human sciences (not Charles Murray) holds the opinion that across an IQ gap of more than one standard deviation (i.e. about 15 points), communication between two people becomes difficult, and that beyond two standard deviations it is effectively impossible.</p></blockquote><p>I think this is somewhat of an exaggeration.  There’s no question that crossing the intelligence chasm can be very hard, but it can be done if there is sufficient patience and respect on both sides.  I doubt it has escaped the attention of many readers how often I am accused of being crazy despite the obvious trappings that indicate a high level of social functionality; these accusations mostly stem from there being a gap of <i>three</i> standard deviations between me and many of my critics.  They simply can’t understand what on Earth I’m talking about, and because they know they are of above-average intelligence and therefore not stupid, they conclude that I must be insane.</p><p>Hence Vox’s First Law.</p><p>I didn’t formulate that law due to any Internet skirmish, by the way, but long before I first put pen to paper.  The reason was that I happened to notice how almost every single person of exceptionally high intelligence I knew was considered to be more or less off their rockers by the majority of normal people of their acquaintance.  Some dealt with this well, others retreated into a drug-infused shell and wound up turning the popular perception into an auto-fulfilling prophecy.</p><p>There are a number of ways to deal with the problem, my solution was to embrace an area of broad common interest, athletics.  Martial arts worked out very well, since no one in the dojo cares what you think, who you are, or what you do.  The only thing that matters is how good you are and how tough you are.  It was a brutal janitor with broken teeth who taught me how to talk to plumbers; years later he told me that when I first walked in, he couldn’t wait to beat the hell out of this pansy-ass rich boy with a Porsche.  And he did, for years, although I do remember that once, after about the twentieth time that he’d decked me with a right to the jaw, he stepped back and nodded approvingly when I pushed myself back to my feet.  It was the first friendly gesture he’d made in six months.</p><p>It took me four years of training and weightlifting six days a week to reach the point where I could fight him on reasonably equal terms, although he was always the better fighter.  By that time, we were reasonably friendly and we always had plenty to talk about, whether it was mocking the flashy Tae Kwon Do kickers, musing about the feasibility of adding Aikido techniques to our repertoire or trying to figure out how to deal with that damned Muy Thai centerline trap.  (His brilliant solution, unsurprisingly, was to go in hard enough to send them reeling with the first shot.  Of course, that works a lot better when you go 225 instead of 175.)</p><p>So, I think the problem mentioned by Deresiewicz is less about the very real intelligence gap referenced by Derb and more about the general unwillingness of the highly intelligent to grant the less intelligent the respect they deserve as autonomous individuals with their own unique interests and occupations, however boring or pointless one might find them to be.</p><p>On a tangential note, I wouldn’t be at all surprised if Deresiewicz couldn’t actually speak very much to people from other countries in other languages.  In addition to the “Ivy retardation” of which he speaks, there is also the “Ivy illusion”, which is the tendency of many Ivy Leaguers to vastly overrate their own individual competencies on the basis of their alma maters.  From what I have seen over the last 10 years in Europe, most of the people who studied a language in college don’t really speak it.</p></div>",
  "content_text": "John Derbyshire muses on\nthe difficulty of speaking with the differently intelligenced\n:\nWilliam Deresiewicz in\nThe American Scholar\n, wrote recently about the difficulty of talking to a plumber:\nIt didn’t dawn on me that there might be a few holes in my education until I was about 35. I’d just bought a house, the pipes needed fixing, and the plumber was standing in my kitchen. There he was, a short, beefy guy with a goatee and a Red Sox cap and a thick Boston accent, and I suddenly learned that I didn’t have the slightest idea what to say to someone like him. So alien was his experience to me, so unguessable his values, so mysterious his very language, that I couldn’t succeed in engaging him in a few minutes of small talk before he got down to work. Fourteen years of higher education and a handful of Ivy League [degrees], and there I was, stiff and stupid, struck dumb by my own dumbness. “Ivy retardation,” a friend of mine calls this. I could carry on conversations with people from other countries, in other languages, but I couldn’t talk to the man who was standing in my own house.\nIt’s a horrifying story, but not a surprising one. This is indeed what we have come to. An acquaintance of mine, an academic in the human sciences (not Charles Murray) holds the opinion that across an IQ gap of more than one standard deviation (i.e. about 15 points), communication between two people becomes difficult, and that beyond two standard deviations it is effectively impossible.\nI think this is somewhat of an exaggeration.  There’s no question that crossing the intelligence chasm can be very hard, but it can be done if there is sufficient patience and respect on both sides.  I doubt it has escaped the attention of many readers how often I am accused of being crazy despite the obvious trappings that indicate a high level of social functionality; these accusations mostly stem from there being a gap of\nthree\nstandard deviations between me and many of my critics.  They simply can’t understand what on Earth I’m talking about, and because they know they are of above-average intelligence and therefore not stupid, they conclude that I must be insane.\nHence Vox’s First Law.\nI didn’t formulate that law due to any Internet skirmish, by the way, but long before I first put pen to paper.  The reason was that I happened to notice how almost every single person of exceptionally high intelligence I knew was considered to be more or less off their rockers by the majority of normal people of their acquaintance.  Some dealt with this well, others retreated into a drug-infused shell and wound up turning the popular perception into an auto-fulfilling prophecy.\nThere are a number of ways to deal with the problem, my solution was to embrace an area of broad common interest, athletics.  Martial arts worked out very well, since no one in the dojo cares what you think, who you are, or what you do.  The only thing that matters is how good you are and how tough you are.  It was a brutal janitor with broken teeth who taught me how to talk to plumbers; years later he told me that when I first walked in, he couldn’t wait to beat the hell out of this pansy-ass rich boy with a Porsche.  And he did, for years, although I do remember that once, after about the twentieth time that he’d decked me with a right to the jaw, he stepped back and nodded approvingly when I pushed myself back to my feet.  It was the first friendly gesture he’d made in six months.\nIt took me four years of training and weightlifting six days a week to reach the point where I could fight him on reasonably equal terms, although he was always the better fighter.  By that time, we were reasonably friendly and we always had plenty to talk about, whether it was mocking the flashy Tae Kwon Do kickers, musing about the feasibility of adding Aikido techniques to our repertoire or trying to figure out how to deal with that damned Muy Thai centerline trap.  (His brilliant solution, unsurprisingly, was to go in hard enough to send them reeling with the first shot.  Of course, that works a lot better when you go 225 instead of 175.)\nSo, I think the problem mentioned by Deresiewicz is less about the very real intelligence gap referenced by Derb and more about the general unwillingness of the highly intelligent to grant the less intelligent the respect they deserve as autonomous individuals with their own unique interests and occupations, however boring or pointless one might find them to be.\nOn a tangential note, I wouldn’t be at all surprised if Deresiewicz couldn’t actually speak very much to people from other countries in other languages.  In addition to the “Ivy retardation” of which he speaks, there is also the “Ivy illusion”, which is the tendency of many Ivy Leaguers to vastly overrate their own individual competencies on the basis of their alma maters.  From what I have seen over the last 10 years in Europe, most of the people who studied a language in college don’t really speak it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-22T09:37:00+00:00"
}