{
  "url": "https://voxday.net/2008/07/23/easy-enoug/",
  "scraped_at": "2026-01-08T22:31:06.779746",
  "title": "Easy enough",
  "date_display": "July 23, 2008",
  "date_iso": "2008-07-23T17:43:00+00:00",
  "date_from_url": "2008-07-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scott Hatfield <a href=\"http://monkeytrials.blogspot.com/2008/07/vox-interprets-new-scientist.html\">asks a question</a>:</p><blockquote><p>It should be noted that Vox’s arguments are short on the sort of data that impress working biologists, but they are long on ‘information + intelligence + pattern recognition.’ But the question is, what if your intelligent attempts to recognize patterns are based on faulty information?</p></blockquote><p>Then the attempts are doomed to near-certain failure.  GIGO and all that.  If there is nothing new about the epigenetic inheritance reported so breathlessly in <i>New Scientist</i> magazine and Lamarckism is not due for an unexpected revival, then obviously any conclusions based on that information are incorrect.  Of course, my skepticism about ND-TENS long precedes Ms Young’s article and is in no way dependent upon the vagaries of prospective Neo-Lamarckism.  While I still expect the Darwinian biological model to eventually go the way of the Ptolemaic cosmological model, the Marxian economic model, and the Freudian psychological model, I should be very surprised to see it happen within the next thirty years.</p><p>Now, if <i>New Scientist</i> magazine is little more than puffed-up science fiction, perhaps Scott or another science enthusiast would be so kind as to direct my attention to a more reliable source of science information.  If scientists are genuinely concerned that the public is well-informed on science matters, it would seem to make sense for them to provide some reasonable means of doing so.  I can’t say I’m terribly shocked to have the scientific legitimacy of <i>New Scientist</i> called into question, however, given the plethora of articles on largely unscientific concepts such as global warming, string theory, multiverses, and dark matter/energy/vapor.</p></div>",
  "content_text": "Scott Hatfield\nasks a question\n:\nIt should be noted that Vox’s arguments are short on the sort of data that impress working biologists, but they are long on ‘information + intelligence + pattern recognition.’ But the question is, what if your intelligent attempts to recognize patterns are based on faulty information?\nThen the attempts are doomed to near-certain failure.  GIGO and all that.  If there is nothing new about the epigenetic inheritance reported so breathlessly in\nNew Scientist\nmagazine and Lamarckism is not due for an unexpected revival, then obviously any conclusions based on that information are incorrect.  Of course, my skepticism about ND-TENS long precedes Ms Young’s article and is in no way dependent upon the vagaries of prospective Neo-Lamarckism.  While I still expect the Darwinian biological model to eventually go the way of the Ptolemaic cosmological model, the Marxian economic model, and the Freudian psychological model, I should be very surprised to see it happen within the next thirty years.\nNow, if\nNew Scientist\nmagazine is little more than puffed-up science fiction, perhaps Scott or another science enthusiast would be so kind as to direct my attention to a more reliable source of science information.  If scientists are genuinely concerned that the public is well-informed on science matters, it would seem to make sense for them to provide some reasonable means of doing so.  I can’t say I’m terribly shocked to have the scientific legitimacy of\nNew Scientist\ncalled into question, however, given the plethora of articles on largely unscientific concepts such as global warming, string theory, multiverses, and dark matter/energy/vapor.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-23T16:43:00+00:00"
}