{
  "url": "https://voxday.net/2008/07/30/equalitarian-equality/",
  "scraped_at": "2026-01-08T22:31:39.895326",
  "title": "Equalitarian “equality”",
  "date_display": "July 30, 2008",
  "date_iso": "2008-07-30T09:29:00+00:00",
  "date_from_url": "2008-07-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Perhaps <a href=\"http://www.fathersandhusbands.org/NJ_Rights_1.pdf\">this explication of the current state of what passes for “law”</a> in America might help some of you understand why I oppose the concept of “equality” so remorselessly:</p><blockquote><p>“If I had one message to give you today, it is that it is not your job to weigh the parties’ rights as you might inclined to do as having been private practitioners.  Your job is not to become concerned about the constitutional rights of the man that you’re violating as you grant a restraining order.  Throw him out on the street, give him the clothes on his back and tell him, see ya around.  Your job is to be the wall between the two people that are fighting each other and that’s how you can rationalize it.  Because that’s what the statute says.  The statute says there is something called domestic violence and it says that it is an evil in our society.<br>– Judge Richard Russell, Ocean City, New Jersey</br></p></blockquote><p>The most ominous thing about the linked article is that this judge is actually responsible for training new judges, which is the context in which he made the statement quoted above.  But if Judge Russell thinks domestic violence is an evil in our society, then he clearly has no idea what will happen once men realize that their rights are no longer recognized by the legal system and even the pretense of the rule of law has been abandoned.  Domestic violence will be vastly preferred to an equalitarian totalitarianism that can only lead to a complete societal breakdown.</p><p>At this point, any man who elects to get married in New Jersey or even live with a woman has to be either completely ignorant or insane.  However, there appears to be some effort to <a href=\"http://drhelen.blogspot.com/2008/07/in-general-restraining-order-is-only.html\">reign in the madness</a> before it spirals completely out of control.</p></div>",
  "content_text": "Perhaps\nthis explication of the current state of what passes for “law”\nin America might help some of you understand why I oppose the concept of “equality” so remorselessly:\n“If I had one message to give you today, it is that it is not your job to weigh the parties’ rights as you might inclined to do as having been private practitioners.  Your job is not to become concerned about the constitutional rights of the man that you’re violating as you grant a restraining order.  Throw him out on the street, give him the clothes on his back and tell him, see ya around.  Your job is to be the wall between the two people that are fighting each other and that’s how you can rationalize it.  Because that’s what the statute says.  The statute says there is something called domestic violence and it says that it is an evil in our society.\n– Judge Richard Russell, Ocean City, New Jersey\nThe most ominous thing about the linked article is that this judge is actually responsible for training new judges, which is the context in which he made the statement quoted above.  But if Judge Russell thinks domestic violence is an evil in our society, then he clearly has no idea what will happen once men realize that their rights are no longer recognized by the legal system and even the pretense of the rule of law has been abandoned.  Domestic violence will be vastly preferred to an equalitarian totalitarianism that can only lead to a complete societal breakdown.\nAt this point, any man who elects to get married in New Jersey or even live with a woman has to be either completely ignorant or insane.  However, there appears to be some effort to\nreign in the madness\nbefore it spirals completely out of control.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-30T08:29:00+00:00"
}