{
  "url": "https://voxday.net/2008/07/18/european-atheists-perspective/",
  "scraped_at": "2026-01-08T22:30:42.141018",
  "title": "A European atheist’s perspective",
  "date_display": "July 18, 2008",
  "date_iso": "2008-07-18T10:57:00+00:00",
  "date_from_url": "2008-07-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Paholaisen Asianajaja <a href=\"http://paholaisen-asianajaja.blogspot.com/2008/07/irrational-atheist.html\">reviews TIA</a>:</p><blockquote><p>This is one of those books that has gotten polarized reviews. Some of those reviews are based one the first three chapters (in some case only pages), and nothing more. The reason for these not-so-indepth reviews is the tone in which Vox Day, a pseudonym, obviously, starts describing the Unholy Trinity. Calling names and hurling alphabetical excrement is never a good way to draw in the reader. Even if one’s opponent – The Dreaded Unholy Trinity – does it, there’s no need stoop to the same level. Of course, some will find it extremely entertaining….</p><p>To the great shock of many who have not read Day’s book, it must be said [that] he does make valid points. That is, Dawkins, Harris and Hitchens have made baseless assertions in their books.</p></blockquote><p>I’ve noticed that the European atheists tend to be much more relaxed about TIA and accepting of its attacks on the New Atheists than their American counterparts.  This may be because they don’t feel so completely outnumbered, but having lived in Europe for a long time myself, I suspect it has more to do with a less fundamentally innocent approach to life.  Americans say they think politicians are crooks and liars, but most of them don’t really believe it; if they did, they wouldn’t have been viewing George Bush as the second coming of Ronald Reagan or be swooning over the magical negritude of Barack Obama.  Europeans literally don’t divide into teams the way Americans do, which allows a European atheist to view a polemic like TIA for what it is rather than seeing it through the lens of a personal attack from the start.</p><p>As for his criticisms, I’d simply direct his attention to Chapter XIII, which explains how the atheism of the leader is a significant contributing factor to government slaughter; it is not and cannot be the sole causal factor for the very logical reason that there is no sole causal factor.  The common defenses of atheist crimes can be applied just as easily to Communism; while PA is surely correct, it’s also not as if any of the atheist leaders listed in the appendix woke up and said <i>“Gosh, the value of an object is derived from the stored human labor required to produce that object from which the surplus value is appropriated from the bourgeoisie. Let’s kill loads of people.”</i> And I have constructed no caricatures; Richard Dawkins really did take the position he did on childhood sexual abuse and only the most blindly loyal Dawkinsians even attempt to defend him on this point any more.</p><p>But regardless, it is a pleasure to read calm and straightforward criticisms from atheists who have actually read and understood the purpose of the book, rather than the usual overwrought fiction produced by those fearful of having their beliefs called into question.</p></div>",
  "content_text": "Paholaisen Asianajaja\nreviews TIA\n:\nThis is one of those books that has gotten polarized reviews. Some of those reviews are based one the first three chapters (in some case only pages), and nothing more. The reason for these not-so-indepth reviews is the tone in which Vox Day, a pseudonym, obviously, starts describing the Unholy Trinity. Calling names and hurling alphabetical excrement is never a good way to draw in the reader. Even if one’s opponent – The Dreaded Unholy Trinity – does it, there’s no need stoop to the same level. Of course, some will find it extremely entertaining….\nTo the great shock of many who have not read Day’s book, it must be said [that] he does make valid points. That is, Dawkins, Harris and Hitchens have made baseless assertions in their books.\nI’ve noticed that the European atheists tend to be much more relaxed about TIA and accepting of its attacks on the New Atheists than their American counterparts.  This may be because they don’t feel so completely outnumbered, but having lived in Europe for a long time myself, I suspect it has more to do with a less fundamentally innocent approach to life.  Americans say they think politicians are crooks and liars, but most of them don’t really believe it; if they did, they wouldn’t have been viewing George Bush as the second coming of Ronald Reagan or be swooning over the magical negritude of Barack Obama.  Europeans literally don’t divide into teams the way Americans do, which allows a European atheist to view a polemic like TIA for what it is rather than seeing it through the lens of a personal attack from the start.\nAs for his criticisms, I’d simply direct his attention to Chapter XIII, which explains how the atheism of the leader is a significant contributing factor to government slaughter; it is not and cannot be the sole causal factor for the very logical reason that there is no sole causal factor.  The common defenses of atheist crimes can be applied just as easily to Communism; while PA is surely correct, it’s also not as if any of the atheist leaders listed in the appendix woke up and said\n“Gosh, the value of an object is derived from the stored human labor required to produce that object from which the surplus value is appropriated from the bourgeoisie. Let’s kill loads of people.”\nAnd I have constructed no caricatures; Richard Dawkins really did take the position he did on childhood sexual abuse and only the most blindly loyal Dawkinsians even attempt to defend him on this point any more.\nBut regardless, it is a pleasure to read calm and straightforward criticisms from atheists who have actually read and understood the purpose of the book, rather than the usual overwrought fiction produced by those fearful of having their beliefs called into question.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-18T09:57:00+00:00"
}