{
  "url": "https://voxday.net/2008/07/17/joys-of-vibrant-community/",
  "scraped_at": "2026-01-08T22:30:36.656335",
  "title": "The joys of a vibrant community",
  "date_display": "July 17, 2008",
  "date_iso": "2008-07-17T09:42:00+00:00",
  "date_from_url": "2008-07-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Liberal Minnesotans often used to bemoan the monochromatic culture of the Twin Cities when I was growing up there.  So, I’m sure they’re <a href=\"http://stuffwhitepeoplelike.com/2008/01/19/7-diversity/?cp=13\">delighted by the vibrancy</a> that the new multiculturalism is bringing to the area. It’s more than a little amusing to note the delicate way that the Strib avoided mentioning any descriptive details about the assailants yesterday – the text was nearly identical to today’s – which was very strange considering the mention of the hunt for the missing eighth assailant.  Today, that delicacy was rendered somewhat less than pointless by <a href=\"http://www.startribune.com/local/25472764.html?location_refer=Local%20+%20Metro\">the pictures that now accompany the story</a>.</p><blockquote><p>A woman whose husband was severely beaten trying to protect his daughter from being molested as the family left Valleyfair said Tuesday they remain traumatized and are still healing from bruises and injuries.  Eight young men are accused of taking turns stomping on and kicking the head of the 41-year-old man, who was knocked unconscious as his wife and three daughters tried to help him. Prosecutors say more serious charges could be brought against the men if the man’s injuries are permanent….  Police arrested seven of the suspects in the Valleyfair parking lot that night and the eighth escaped. Police did not have a good description of that suspect but would like help finding him.</p></blockquote><p>It’s Shakopee.  The <a href=\"http://en.wikipedia.org/wiki/Shakopee\">population demographics</a> strongly suggest that he’s probably between 5’10 and 6’2″, with blond hair, blue eyes and a last name ending in -sen or -son.</p></div>",
  "content_text": "Liberal Minnesotans often used to bemoan the monochromatic culture of the Twin Cities when I was growing up there.  So, I’m sure they’re\ndelighted by the vibrancy\nthat the new multiculturalism is bringing to the area. It’s more than a little amusing to note the delicate way that the Strib avoided mentioning any descriptive details about the assailants yesterday – the text was nearly identical to today’s – which was very strange considering the mention of the hunt for the missing eighth assailant.  Today, that delicacy was rendered somewhat less than pointless by\nthe pictures that now accompany the story\n.\nA woman whose husband was severely beaten trying to protect his daughter from being molested as the family left Valleyfair said Tuesday they remain traumatized and are still healing from bruises and injuries.  Eight young men are accused of taking turns stomping on and kicking the head of the 41-year-old man, who was knocked unconscious as his wife and three daughters tried to help him. Prosecutors say more serious charges could be brought against the men if the man’s injuries are permanent….  Police arrested seven of the suspects in the Valleyfair parking lot that night and the eighth escaped. Police did not have a good description of that suspect but would like help finding him.\nIt’s Shakopee.  The\npopulation demographics\nstrongly suggest that he’s probably between 5’10 and 6’2″, with blond hair, blue eyes and a last name ending in -sen or -son.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-17T08:42:00+00:00"
}