{
  "url": "https://voxday.net/2008/07/02/mailvox-more-optimistic-view/",
  "scraped_at": "2026-01-08T22:29:06.316505",
  "title": "Mailvox: A more optimistic view",
  "date_display": "July 2, 2008",
  "date_iso": "2008-07-02T08:50:00+00:00",
  "date_from_url": "2008-07-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>BH sees more silver lining than cloud in the <i>Heller</i> decision.  Or, at the very least, the potential for it:</p><blockquote><p>I read with interest your assessment of the recent Heller decision, and the careful language of Scalia in the majority opinion. I was concerned with the dicta you cited, as well as Scalia’s assertion that there existed “sensitive places” where the lawful carrying of arms could be prohibited.</p><p>The reality is, dicta notwithstanding (because while dicta informs, it does not set precedent), that the Court was only considering a very narrow issue, that of the possession of functional, readily available arms within the home. The dicta touched upon keeping and bearing consolidating into a single right, but the holding did not address the lawful carrying of arms outside the home. As you know, SCOTUS does this all the time, allowing the gov’t to cling to unaddressed ultra vires behavior as long as possible. There is a hole in this holding, however, into which a wedge can be driven in our favor, regarding the People’s progenetive right to alter or abolish tyrannical gov’t enumerated in the DoI. Scalia addressed the Miller holding, only partially stating what it really meant. While his language regarding Miller eviscerates the “collective right” absurdity advanced by statists, it seeks to eliminate military pattern small arms from the designation “in common use” intimating that sporting and hunting arms (there were no such distinctions at the writing of the BoR, as you rightly noted) are those to which Miller referred. I submit (as should any competent lawyer) that military pattern semi-automatic firearms, both pistols and rifles, are contemporarily “in common use”, and could be brought into service if needed in any militia activity, because their ownership and lawful use is widespread (i.e. “common”), and the only reason they aren’t more common is inane federal, state and local restrictions preventing them from being so.</p><p>So, while I understand and agree with your skepticism, I see light at the end of the tunnel. As you are well aware, these issues must be pursued one a time, carefully and skillfully – such is the state of our jurisprudence. However, Scalia, in seeking to limit the type of arms the keeping and bearing of which are protected, by placing heavy emphasis on the “common use” language in Miller, has actually opened the door. Now, all we have to do is to stick our foot in it to keep it from closing.</p></blockquote><p>I certainly hope he’s right.  World events don’t always go as poorly as one expects; the recent nationalistic intransigence in Ireland, Poland, and even Germany demonstrate that.  But, I’m not as convinced as most conservatives that Scalia is as ferocious a defender of gun rights as he’s been painted, and considering the narrow majority that even subscribe to the individual rights “interpretation”, I don’t see how the worms will fail to come out of the opened can that is <i>Heller</i> or that a mere foot in the door will be enough.</p></div>",
  "content_text": "BH sees more silver lining than cloud in the\nHeller\ndecision.  Or, at the very least, the potential for it:\nI read with interest your assessment of the recent Heller decision, and the careful language of Scalia in the majority opinion. I was concerned with the dicta you cited, as well as Scalia’s assertion that there existed “sensitive places” where the lawful carrying of arms could be prohibited.\nThe reality is, dicta notwithstanding (because while dicta informs, it does not set precedent), that the Court was only considering a very narrow issue, that of the possession of functional, readily available arms within the home. The dicta touched upon keeping and bearing consolidating into a single right, but the holding did not address the lawful carrying of arms outside the home. As you know, SCOTUS does this all the time, allowing the gov’t to cling to unaddressed ultra vires behavior as long as possible. There is a hole in this holding, however, into which a wedge can be driven in our favor, regarding the People’s progenetive right to alter or abolish tyrannical gov’t enumerated in the DoI. Scalia addressed the Miller holding, only partially stating what it really meant. While his language regarding Miller eviscerates the “collective right” absurdity advanced by statists, it seeks to eliminate military pattern small arms from the designation “in common use” intimating that sporting and hunting arms (there were no such distinctions at the writing of the BoR, as you rightly noted) are those to which Miller referred. I submit (as should any competent lawyer) that military pattern semi-automatic firearms, both pistols and rifles, are contemporarily “in common use”, and could be brought into service if needed in any militia activity, because their ownership and lawful use is widespread (i.e. “common”), and the only reason they aren’t more common is inane federal, state and local restrictions preventing them from being so.\nSo, while I understand and agree with your skepticism, I see light at the end of the tunnel. As you are well aware, these issues must be pursued one a time, carefully and skillfully – such is the state of our jurisprudence. However, Scalia, in seeking to limit the type of arms the keeping and bearing of which are protected, by placing heavy emphasis on the “common use” language in Miller, has actually opened the door. Now, all we have to do is to stick our foot in it to keep it from closing.\nI certainly hope he’s right.  World events don’t always go as poorly as one expects; the recent nationalistic intransigence in Ireland, Poland, and even Germany demonstrate that.  But, I’m not as convinced as most conservatives that Scalia is as ferocious a defender of gun rights as he’s been painted, and considering the narrow majority that even subscribe to the individual rights “interpretation”, I don’t see how the worms will fail to come out of the opened can that is\nHeller\nor that a mere foot in the door will be enough.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-02T07:50:00+00:00"
}