{
  "url": "https://voxday.net/2008/07/02/no-surprise/",
  "scraped_at": "2026-01-08T22:29:08.119051",
  "title": "No surprise",
  "date_display": "July 2, 2008",
  "date_iso": "2008-07-02T09:41:00+00:00",
  "date_from_url": "2008-07-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Why are we supposed to be shocked or upset <a href=\"http://frum.nationalreview.com/post/?q=YTBmZGY0Nzg1MjVhMGRkODc4NDdmNmJmNzYxNmVhOGM=\">by this</a>?  Why are we even supposed to be surprised by this?  The <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=51424\">American </a>and <a href=\"http://www.aftenposten.no/english/local/article1567514.ece\">European rape epidemics</a> are the direct and predictable result of the West’s open door policy towards Third World migration; migration always changes the culture of the territory more dramatically than it changes the character of the migrants.  The theoretical arguments of the equality crowd are being blown away in real-time by the rapidly accumulating empirical evidence.</p><blockquote><p>It is an indignant, heartbroken, outraged father who speaks with us. “My daughter was raped at the Midi Station. In Brussels. Capital of Europe. In complete impunity.”</p><p>It was June 12th. “My daughter came back from Waterloo station. It was 9 PM. Upon exiting the train, she walked to the Bancontact.” A transit place. And it was there, of all places, that the drama unfolded.</p><p>“In the midst of a train station. How is this possible?” continues the father of Lola, 21 years old. “Two man reproached her for not wearing the veil. My girl is pretty. She’s blonde and has blue eyes.”</p><p>Everything then happened very fast. “One of the aggressors took out a knife. My daughter was forcibly put against a wall in Bancontact. Knife under the throat, one of the guys raped her. The other one watched.”</p><p>It was 9 PM. It was still light out and the station was far from being empty.</p></blockquote><p>This is but a harbinger of the crime-ridden society that the liberals, left-wingers, and multiculturalists of the West have chosen.  They shouldn’t complain about the unintended consequences, but rather, take the famous advice of Bobby Knight, relax, and enjoy it.  Those who rejected the civilized traditional culture of Western Christendom in favor of a mythical “equality” of one sort or another – socialism, feminism, and multiculturalism all stem from that basic premise – merit the full fruits of that rejection.  It’s a mark of the spineless secular suicide of the modern West that the proposed response to a violent attack on a strong, independent woman is… more cameras at the train station.</p></div>",
  "content_text": "Why are we supposed to be shocked or upset\nby this\n?  Why are we even supposed to be surprised by this?  The\nAmerican\nand\nEuropean rape epidemics\nare the direct and predictable result of the West’s open door policy towards Third World migration; migration always changes the culture of the territory more dramatically than it changes the character of the migrants.  The theoretical arguments of the equality crowd are being blown away in real-time by the rapidly accumulating empirical evidence.\nIt is an indignant, heartbroken, outraged father who speaks with us. “My daughter was raped at the Midi Station. In Brussels. Capital of Europe. In complete impunity.”\nIt was June 12th. “My daughter came back from Waterloo station. It was 9 PM. Upon exiting the train, she walked to the Bancontact.” A transit place. And it was there, of all places, that the drama unfolded.\n“In the midst of a train station. How is this possible?” continues the father of Lola, 21 years old. “Two man reproached her for not wearing the veil. My girl is pretty. She’s blonde and has blue eyes.”\nEverything then happened very fast. “One of the aggressors took out a knife. My daughter was forcibly put against a wall in Bancontact. Knife under the throat, one of the guys raped her. The other one watched.”\nIt was 9 PM. It was still light out and the station was far from being empty.\nThis is but a harbinger of the crime-ridden society that the liberals, left-wingers, and multiculturalists of the West have chosen.  They shouldn’t complain about the unintended consequences, but rather, take the famous advice of Bobby Knight, relax, and enjoy it.  Those who rejected the civilized traditional culture of Western Christendom in favor of a mythical “equality” of one sort or another – socialism, feminism, and multiculturalism all stem from that basic premise – merit the full fruits of that rejection.  It’s a mark of the spineless secular suicide of the modern West that the proposed response to a violent attack on a strong, independent woman is… more cameras at the train station.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-02T08:41:00+00:00"
}