{
  "url": "https://voxday.net/2008/07/29/nonsensical-materialis/",
  "scraped_at": "2026-01-08T22:31:36.257999",
  "title": "Nonsensical materialism",
  "date_display": "July 29, 2008",
  "date_iso": "2008-07-29T13:55:00+00:00",
  "date_from_url": "2008-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Science-fetishizing materialists deny the testimony of thousands of direct eyewitnesses throughout the course of history.  No doubt <a href=\"http://www.telegraph.co.uk/arts/main.jhtml?xml=/arts/2008/07/17/bobyrne117.xml\">they will continue to do so</a>:</p><blockquote><p>“I’m seeing spirals of light behind people,” she reports. “Those are the people’s guardian angels. We’ve all got one. They are usually about three paces behind us.  And then I’m also seeing the other angels, too, the ones that I call the helpers and teachers. They are white and beautiful. All angels have a human appearance, but that’s just for us, so we are not terrified.”</p></blockquote><p>Now, I readily admit the <i>possibility</i> that Lorna Byrne is lying.  After all, she presumably has a solid financial motivation to do so, having just received a book contract in excess of $100,000.  It’s also possible that she is insane, although that’s not a particularly credible possibility given the fact that she apparently doesn’t manifest any of the usual signs of mental illness.  The third possibility is even less believable, as she can’t possibly have mistaken ordinary visual and auditory artifacts for supernatural sights and sounds for the majority of her 54 years.  The fourth possibility, of course, is that she is simply reporting what she has seen and heard with reasonable accuracy.</p><p>While one can attempt to reach a logical conclusion with regards to selecting between the four possibilities, it is important to recognize that one can claim to have done nothing more than that, reached a logical conclusion.  The ironic thing here is that many so-called rational materialists stake out a fundamentally irrational position with regards to the supernatural; the only evidence they will accept – personal experience – is precisely the evidence they reject when it is provided by others.</p><p>Given the present inability to predict, understand, or cure mental illness, to say nothing of the large quantities of testimonial evidence in support of the supernatural, it is highly illogical to conclude that every single individual eyewitness is insane, especially in the complete absence of any information about the general mental stability of the eyewitness.  Moreover, just a single example of empirical evidence, such as the Sarejevo shrapnel-detection mentioned by the Dublin therapist, is sufficient to jettison the materialist model should the testimony remained unimpeached.</p><p>The reach of science is not unlimited.  I have read that cosmologists believe that in one hundred billion years, <a href=\"http://www.sciam.com/article.cfm?id=the-end-of-cosmology\">all signs of the 400 billion other galaxies in the universe will be undetectable</a> to observers on the Earth; sans the testimony of the historical record, there would be no scientific evidence that these other galaxies ever existed.  In other words, we know that there is a reasonable probability that future science will be forced to deny what present science insists is material.  Given the testimony of Lorna Byrne and many others, given the spiritual model derived from the Biblical description of our fallen, silent planet, and given the obvious past and future limitations of science, it is far more rational to conclude that science is simply unable to detect the supernatural at present than to conclude from this inability that the supernatural does not exist.</p><p>While there are historical frauds on the supernatural side, there are no shortage of historical scientific frauds to counterbalance them.  But the incredible number of baseless charges of deceit, error, and madness required to sustain the materialist model show how fundamentally weak it is when weighed against the known past and future limitations of the scientific method, to say nothing of the scientific consensus.  Placing one’s faith in nothing more than the present state of technology, an intrinsically dynamic entity, is beyond illogical.  It is wholly nonsensical.  The reason Richard Dawkins and his fetish flock so hate the oft-heard quote from Hamlet is that they suspect, in their heart of hearts, that it is probably true.</p></div>",
  "content_text": "Science-fetishizing materialists deny the testimony of thousands of direct eyewitnesses throughout the course of history.  No doubt\nthey will continue to do so\n:\n“I’m seeing spirals of light behind people,” she reports. “Those are the people’s guardian angels. We’ve all got one. They are usually about three paces behind us.  And then I’m also seeing the other angels, too, the ones that I call the helpers and teachers. They are white and beautiful. All angels have a human appearance, but that’s just for us, so we are not terrified.”\nNow, I readily admit the\npossibility\nthat Lorna Byrne is lying.  After all, she presumably has a solid financial motivation to do so, having just received a book contract in excess of $100,000.  It’s also possible that she is insane, although that’s not a particularly credible possibility given the fact that she apparently doesn’t manifest any of the usual signs of mental illness.  The third possibility is even less believable, as she can’t possibly have mistaken ordinary visual and auditory artifacts for supernatural sights and sounds for the majority of her 54 years.  The fourth possibility, of course, is that she is simply reporting what she has seen and heard with reasonable accuracy.\nWhile one can attempt to reach a logical conclusion with regards to selecting between the four possibilities, it is important to recognize that one can claim to have done nothing more than that, reached a logical conclusion.  The ironic thing here is that many so-called rational materialists stake out a fundamentally irrational position with regards to the supernatural; the only evidence they will accept – personal experience – is precisely the evidence they reject when it is provided by others.\nGiven the present inability to predict, understand, or cure mental illness, to say nothing of the large quantities of testimonial evidence in support of the supernatural, it is highly illogical to conclude that every single individual eyewitness is insane, especially in the complete absence of any information about the general mental stability of the eyewitness.  Moreover, just a single example of empirical evidence, such as the Sarejevo shrapnel-detection mentioned by the Dublin therapist, is sufficient to jettison the materialist model should the testimony remained unimpeached.\nThe reach of science is not unlimited.  I have read that cosmologists believe that in one hundred billion years,\nall signs of the 400 billion other galaxies in the universe will be undetectable\nto observers on the Earth; sans the testimony of the historical record, there would be no scientific evidence that these other galaxies ever existed.  In other words, we know that there is a reasonable probability that future science will be forced to deny what present science insists is material.  Given the testimony of Lorna Byrne and many others, given the spiritual model derived from the Biblical description of our fallen, silent planet, and given the obvious past and future limitations of science, it is far more rational to conclude that science is simply unable to detect the supernatural at present than to conclude from this inability that the supernatural does not exist.\nWhile there are historical frauds on the supernatural side, there are no shortage of historical scientific frauds to counterbalance them.  But the incredible number of baseless charges of deceit, error, and madness required to sustain the materialist model show how fundamentally weak it is when weighed against the known past and future limitations of the scientific method, to say nothing of the scientific consensus.  Placing one’s faith in nothing more than the present state of technology, an intrinsically dynamic entity, is beyond illogical.  It is wholly nonsensical.  The reason Richard Dawkins and his fetish flock so hate the oft-heard quote from Hamlet is that they suspect, in their heart of hearts, that it is probably true.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-29T12:55:00+00:00"
}