{
  "url": "https://voxday.net/2008/07/10/obama-and-eurohicks/",
  "scraped_at": "2026-01-08T22:29:45.138564",
  "title": "Obama and the Eurohicks",
  "date_display": "July 10, 2008",
  "date_iso": "2008-07-10T18:59:00+00:00",
  "date_from_url": "2008-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Miss Lucas <a href=\"http://rachellucas.com/index.php/2008/07/10/you-need-to-make-sure-your-child-can-speak-spanish/\">spots the salient point</a> in Obama’s recent Spanish kerfluffle:</p><blockquote><p>Obama’s insistence that we all learn Spanish tells me a few things, not least of which is that he has no intention of doing anything about rampant immigration.</p><p>Anyway. Back to the Europe thing, it reminds me of a girl I knew in college who was a big flaming Euro-humper. You know the type – Europeans are smart, well-traveled, and worldly, while Americans are a bunch of homebody dumb hicks.</p></blockquote><p>Unfortunately, McCain won’t do anything about the third world migration – it’s not immigration – either.  This is only one of the many, many reasons that I won’t be voting for either man, or for Hillary Clinton should one of Obama’s skeletons come to light before November.</p><p>Speaking as someone who has lived in Europe for close to half my adult life, rest assured that there are just as many European homebody dumb hicks as there are American ones.  I have one teammate from Calabria, and he is every bit as unintelligible in Italian as the thickest-tongued backwoods Alabaman is in English.   I’ve been in places where no one even speaks anything that is recognizable as a genuine language; they only speak a dialect called, appropriately enough, <i>dialetto</i>.  (It means “dialect”.)  The only difference between a European hick and an American hick is that the European hick is far more inbred, since his family has probably been there for at least 500 years.</p><p>Speaking of which, it’s kind of weird at times living in a small European town because all your neighbors kind of look alike.  It’s as if every community has it’s own Innsmouth look… on several occasions, I’ve been able to guess where someone lives without them telling me first.  A few years ago, a neighbor was asking me if I’d found it hard to fit in, since we’re such obvious <i>stranieri</i>.  She said she still found the people of our town rather cold and unwelcoming, even though she’d lived there for 20 years.  The punchline came when I asked her where she and her husband were from… and she named a town that is about a ten minutes walk away.</p></div>",
  "content_text": "Miss Lucas\nspots the salient point\nin Obama’s recent Spanish kerfluffle:\nObama’s insistence that we all learn Spanish tells me a few things, not least of which is that he has no intention of doing anything about rampant immigration.\nAnyway. Back to the Europe thing, it reminds me of a girl I knew in college who was a big flaming Euro-humper. You know the type – Europeans are smart, well-traveled, and worldly, while Americans are a bunch of homebody dumb hicks.\nUnfortunately, McCain won’t do anything about the third world migration – it’s not immigration – either.  This is only one of the many, many reasons that I won’t be voting for either man, or for Hillary Clinton should one of Obama’s skeletons come to light before November.\nSpeaking as someone who has lived in Europe for close to half my adult life, rest assured that there are just as many European homebody dumb hicks as there are American ones.  I have one teammate from Calabria, and he is every bit as unintelligible in Italian as the thickest-tongued backwoods Alabaman is in English.   I’ve been in places where no one even speaks anything that is recognizable as a genuine language; they only speak a dialect called, appropriately enough,\ndialetto\n.  (It means “dialect”.)  The only difference between a European hick and an American hick is that the European hick is far more inbred, since his family has probably been there for at least 500 years.\nSpeaking of which, it’s kind of weird at times living in a small European town because all your neighbors kind of look alike.  It’s as if every community has it’s own Innsmouth look… on several occasions, I’ve been able to guess where someone lives without them telling me first.  A few years ago, a neighbor was asking me if I’d found it hard to fit in, since we’re such obvious\nstranieri\n.  She said she still found the people of our town rather cold and unwelcoming, even though she’d lived there for 20 years.  The punchline came when I asked her where she and her husband were from… and she named a town that is about a ten minutes walk away.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-10T17:59:00+00:00"
}