{
  "url": "https://voxday.net/2008/07/25/of-talking-and-chewing-of-gu/",
  "scraped_at": "2026-01-08T22:31:16.000938",
  "title": "Of talking and the chewing of the gum",
  "date_display": "July 25, 2008",
  "date_iso": "2008-07-25T18:45:00+00:00",
  "date_from_url": "2008-07-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Kelly of the Rational Respond Squad <a href=\"http://www.rationalresponders.com/autism\">asks a question</a>:</p><blockquote><p>This month’s issue of Psychology Today has an interesting piece that reminded me of everybody’s dear friend, Vox Day. He asserts in his blog and his book on many occasions that atheists are more likely to suffer from what he terms “social autism”–disorders such as Asperger’s Syndrome or mild forms of autism. He bases this on informal internet surveys that questioned people on their personality traits. But is the correlation really there, or is this just another attempt to disparage atheists?</p></blockquote><p>An attempt to disparage atheists?  Why, surely Kelly doesn’t consider human beings with Asperger’s Syndrome to be any less valuable in the eyes of God or less possessed of the unalienable rights endowed by their Creator than anyone else!  The answer to her question, of course, is that it’s not a binary matter.</p><p>Kelly appears to have forgotten that the correlation between social ineptness and atheism was not first made by me, but by Gary Wolf of <i>Wired Magazine</i> in his influential article that first brought the New Atheists to the public’s attention, “<a href=\"http://www.wired.com/wired/archive/14.11/atheism.html\">The Church of the Non-Believers</a>“.  It was subsequently supported by the self-reported results of the atheists on Pharyngula; it was some time later that I gave the apparent phenomenon a name – social autism – and suggested a scientific hypothesis that might be worthy of further investigation.</p><p>In any event, there’s no reason to suppose that there is any inherent conflict between the hypotheses posed by Dr. Levin and me.  It’s not as if there isn’t a theory which posits parenting style in general and paternal issues in particular as a causal factor in atheism, after all.  Regardless, the matter is merely one for conjecture at this point, even if there is no shortage of observable empirical evidence in support of my hypothesis available all over the Internet.</p></div>",
  "content_text": "Kelly of the Rational Respond Squad\nasks a question\n:\nThis month’s issue of Psychology Today has an interesting piece that reminded me of everybody’s dear friend, Vox Day. He asserts in his blog and his book on many occasions that atheists are more likely to suffer from what he terms “social autism”–disorders such as Asperger’s Syndrome or mild forms of autism. He bases this on informal internet surveys that questioned people on their personality traits. But is the correlation really there, or is this just another attempt to disparage atheists?\nAn attempt to disparage atheists?  Why, surely Kelly doesn’t consider human beings with Asperger’s Syndrome to be any less valuable in the eyes of God or less possessed of the unalienable rights endowed by their Creator than anyone else!  The answer to her question, of course, is that it’s not a binary matter.\nKelly appears to have forgotten that the correlation between social ineptness and atheism was not first made by me, but by Gary Wolf of\nWired Magazine\nin his influential article that first brought the New Atheists to the public’s attention, “\nThe Church of the Non-Believers\n“.  It was subsequently supported by the self-reported results of the atheists on Pharyngula; it was some time later that I gave the apparent phenomenon a name – social autism – and suggested a scientific hypothesis that might be worthy of further investigation.\nIn any event, there’s no reason to suppose that there is any inherent conflict between the hypotheses posed by Dr. Levin and me.  It’s not as if there isn’t a theory which posits parenting style in general and paternal issues in particular as a causal factor in atheism, after all.  Regardless, the matter is merely one for conjecture at this point, even if there is no shortage of observable empirical evidence in support of my hypothesis available all over the Internet.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-25T17:45:00+00:00"
}