{
  "url": "https://voxday.net/2008/07/11/original-gangster-rap/",
  "scraped_at": "2026-01-08T22:29:52.495264",
  "title": "The original gangster rap",
  "date_display": "July 11, 2008",
  "date_iso": "2008-07-11T14:45:00+00:00",
  "date_from_url": "2008-07-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I lift weights from time to time with a Sicilian rapper upon whom I have affectionately bestowed the appellation “Gangsta”.  He either shows up at the gym looking like one of Capone’s hit men from 1930’s Chicago, or like a basketball jersey-wearing Crip circa 1992, complete with the bandana.  He’s a good guy, and introduced me to Marracash, a fellow Sicilian who is currently one of the leaders of the Milanese rap scene.</p><p>It’s no <i>Black Steel in the Hour of Chaos</i>, but as rap goes, <i>Badabum Cha Cha</i> is pretty good. I find it interesting that Italians can’t do metal, but they can rap and do catchy dance music, while it’s the other way round with the Tedeschi.  The video reminds me of <i>Welcome to the Black Parade</i>, which is one of my favorites, although the song isn’t as dark as the imagery would lead you to assume.  Can you imagine an American rap song with straight-faced references to the rapper’s uncle and grandfather?  I did like the line about how the world is a whorehouse under the stage, though.  That’s a succinct summary of my perspective on law and politics.</p></div>",
  "content_text": "I lift weights from time to time with a Sicilian rapper upon whom I have affectionately bestowed the appellation “Gangsta”.  He either shows up at the gym looking like one of Capone’s hit men from 1930’s Chicago, or like a basketball jersey-wearing Crip circa 1992, complete with the bandana.  He’s a good guy, and introduced me to Marracash, a fellow Sicilian who is currently one of the leaders of the Milanese rap scene.\nIt’s no\nBlack Steel in the Hour of Chaos\n, but as rap goes,\nBadabum Cha Cha\nis pretty good. I find it interesting that Italians can’t do metal, but they can rap and do catchy dance music, while it’s the other way round with the Tedeschi.  The video reminds me of\nWelcome to the Black Parade\n, which is one of my favorites, although the song isn’t as dark as the imagery would lead you to assume.  Can you imagine an American rap song with straight-faced references to the rapper’s uncle and grandfather?  I did like the line about how the world is a whorehouse under the stage, though.  That’s a succinct summary of my perspective on law and politics.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-11T13:45:00+00:00"
}