{
  "url": "https://voxday.net/2008/07/11/pz-asks-for-letters/",
  "scraped_at": "2026-01-08T22:29:46.967831",
  "title": "PZ asks for letters",
  "date_display": "July 11, 2008",
  "date_iso": "2008-07-11T07:28:00+00:00",
  "date_from_url": "2008-07-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Should you wish to show your support for PZ, he would like you <a href=\"http://scienceblogs.com/pharyngula/2008/07/fight_back_against_bill_donohu.php\">to write to the University of Minnesota</a>:</p><blockquote><p>Instead, I would appreciate it if you would write a short note to <a href=\"mailto:bruin001@umn.edu\">President Robert Bruininks</a> in support (he’s going to hate me for this). I have to ask for a few constraints, though: only do so if you are willing to sign a real name to it — most of the complaint mail I’m getting uses fake names, making it much less persuasive — and that, unlike the religious screeds I’m seeing, you take the time to proofread and send him something that at least looks like a high school graduate wrote it, which will put you way above the level of the hate mail. Be polite and rational, too!</p><p>If you really want to impress, send him regular mail at this address:</p><p>President Robert H. Bruininks<br>202 Morrill Hall<br>100 Church Street S.E.<br>University of Minnesota<br>Minneapolis, MN 55455</br></br></br></br></p></blockquote><p>Perhaps someone with a stronger stomach than me would care to wade through the stinking muck of Pharyngula and provide us with some shining examples of Prof. Myers’s polite and rational discourse.  As for myself, I have very little regard for the University of Minnesota and the fact that it should choose to employ an egregious buffoon given to performing stupid atheist tricks and publicly insisting that he “<a href=\"http://scienceblogs.com/pharyngula/2008/07/fight_back_against_bill_donohu.php#comment-974311\">must commit sacrilege</a>” at one of its lesser campuses strikes me as par for the course.  It strikes me that PZ is already serving out his well-merited punishment; I find it hard to think of many hells much worse than being forced to spend one’s life on the campus of a public Minnesota university.</p><p>The funniest thing about this whole affair thus far is <a href=\"http://scienceblogs.com/pharyngula/2008/07/fight_back_against_bill_donohu.php#comment-974444\">the intellectual debacle presented by one particularly stupid Pharyngulan</a> who quoted the dictionary definition of tolerance in an attempt to claim that Pharyngulans are tolerant, which only managed to highlight the extreme intolerance of their maladjusted crowd.  Regardless of how you feel about Pharyngula, you must admit that the very last thing that can be said of it is that its host and commenters exhibit anything that can be reasonably described as a “fair, objective, and permissive attitude toward opinions and practices that differ from one’s own.”</p></div>",
  "content_text": "Should you wish to show your support for PZ, he would like you\nto write to the University of Minnesota\n:\nInstead, I would appreciate it if you would write a short note to\nPresident Robert Bruininks\nin support (he’s going to hate me for this). I have to ask for a few constraints, though: only do so if you are willing to sign a real name to it — most of the complaint mail I’m getting uses fake names, making it much less persuasive — and that, unlike the religious screeds I’m seeing, you take the time to proofread and send him something that at least looks like a high school graduate wrote it, which will put you way above the level of the hate mail. Be polite and rational, too!\nIf you really want to impress, send him regular mail at this address:\nPresident Robert H. Bruininks\n202 Morrill Hall\n100 Church Street S.E.\nUniversity of Minnesota\nMinneapolis, MN 55455\nPerhaps someone with a stronger stomach than me would care to wade through the stinking muck of Pharyngula and provide us with some shining examples of Prof. Myers’s polite and rational discourse.  As for myself, I have very little regard for the University of Minnesota and the fact that it should choose to employ an egregious buffoon given to performing stupid atheist tricks and publicly insisting that he “\nmust commit sacrilege\n” at one of its lesser campuses strikes me as par for the course.  It strikes me that PZ is already serving out his well-merited punishment; I find it hard to think of many hells much worse than being forced to spend one’s life on the campus of a public Minnesota university.\nThe funniest thing about this whole affair thus far is\nthe intellectual debacle presented by one particularly stupid Pharyngulan\nwho quoted the dictionary definition of tolerance in an attempt to claim that Pharyngulans are tolerant, which only managed to highlight the extreme intolerance of their maladjusted crowd.  Regardless of how you feel about Pharyngula, you must admit that the very last thing that can be said of it is that its host and commenters exhibit anything that can be reasonably described as a “fair, objective, and permissive attitude toward opinions and practices that differ from one’s own.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-11T06:28:00+00:00"
}