{
  "url": "https://voxday.net/2008/07/21/rout-of-new-atheists/",
  "scraped_at": "2026-01-08T22:30:52.336639",
  "title": "The rout of the New Atheists",
  "date_display": "July 21, 2008",
  "date_iso": "2008-07-21T08:15:00+00:00",
  "date_from_url": "2008-07-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First <a href=\"http://www.milobookclub.com/2008/06/09/challenge-to-pz-myers/\">PZ ran away</a> from me.  Now Richard Dawkins <a href=\"http://news.aol.com/newsbloggers/2008/07/20/an-open-letter-to-richard-dawkins/\">is running away</a> from Dinesh D’Souza.  As you may recall, this is exactly the behavior that I predicted from the New Atheists just before the publication of TIA.  Now that their errors, and more importantly, the illogic they habitually use in constructing their arguments, have been methodically exposed in print, anyone with half a brain can take them apart with ease.</p><blockquote><p>We’re both scheduled to discuss issues of Darwin and God on the Riz Khan Show on Al-Jazeera on Monday, July 21. Viewers who are interested can watch the show live here. The segments will also be posted on Youtube and I’ll link to them.</p><p>But a few hours after I mentioned our forthcoming debate on this blog, you posted a comment on your website essentially accusing me of making the whole thing up. So first you accuse me of having a Hitler voice, and now you accuse me of misrepresentation.</p><p>Here’s what happened. Al-Jazeera contacted me a while ago, asking me to appear in a point-counterpoint format with a leading opponent. I said I was writing about God and atheism, and suggested I appear with a prominent atheist. They chose you. Then the producer Zeresnaey Abraha confirmed that you were ready to do it. Late last week I got a studio notice from Al-Jazeera giving me the time for me to arrive at their rented San Diego studio. The other guest was listed as “Richard Dawkins” and your studio details at Oxford were given.</p><p>Apparently when you found out that the two of us were booked on the same show, same segment, you rushed to the producer to insist that we appear separately. Your pretext according to Abraha was that you have a long-standing pledge not to debate “creationists.” I can understand that you don’t want to give legitimacy to people who flatly deny evolution or who insist that the earth is less than 6,000 years old. The only problem with you invoking this pledge is that I believe in evolution and am not, nor have I ever been, a “creationist.”</p><p>Apparently the format now is that we will each be interviewed separately. So technically it’s no longer a debate, although it is most certainly an exchange of rival ideas on the same topic. It’s a pity that we cannot engage each other directly.</p><p>To be honest, I find your behavior extremely bizarre. You go halfway around the world to chase down televangelists to outsmart them in an interview format that you control, but given several opportunities to engage the issues you profess to care about in a true spirit of open debate and inquiry, you duck and dodge and run away.</p></blockquote><p>Dawkins is not only a coward, but a hypocrite.  He’s been quite open in the past about his willingness to debate “up” but not “down”; does anyone doubt that he’d be willing to debate a creationist if that creationist was the Pope?  What he fails to realize is that his fame doesn’t give him the ability to confer legitimacy on anyone; don’t forget that Paris Hilton and Victoria Beckham are far more famous than Dawkins and Katie Price sells more books.  It’s Dawkins’s own legitimacy that has been called into question, first with his shallow, error-filled book, and now with these cowardly antics intended to avoid allowing the public to learn that the godless emperor has no intellectual clothes.  The New Atheism will not survive <i>because it is completely incapable of standing up to criticism</i>.  This is becoming increasingly obvious to everyone, theist and atheist alike; all this dancing, evading, and running away only delays the day of ultimate reckoning.   Of course, a small cult of personality will continue to cling desperately to the Four Horsemen and their lackeys as they continue to retreat from their critics; an ironic homage to the very religions that they so hate and fear.</p></div>",
  "content_text": "First\nPZ ran away\nfrom me.  Now Richard Dawkins\nis running away\nfrom Dinesh D’Souza.  As you may recall, this is exactly the behavior that I predicted from the New Atheists just before the publication of TIA.  Now that their errors, and more importantly, the illogic they habitually use in constructing their arguments, have been methodically exposed in print, anyone with half a brain can take them apart with ease.\nWe’re both scheduled to discuss issues of Darwin and God on the Riz Khan Show on Al-Jazeera on Monday, July 21. Viewers who are interested can watch the show live here. The segments will also be posted on Youtube and I’ll link to them.\nBut a few hours after I mentioned our forthcoming debate on this blog, you posted a comment on your website essentially accusing me of making the whole thing up. So first you accuse me of having a Hitler voice, and now you accuse me of misrepresentation.\nHere’s what happened. Al-Jazeera contacted me a while ago, asking me to appear in a point-counterpoint format with a leading opponent. I said I was writing about God and atheism, and suggested I appear with a prominent atheist. They chose you. Then the producer Zeresnaey Abraha confirmed that you were ready to do it. Late last week I got a studio notice from Al-Jazeera giving me the time for me to arrive at their rented San Diego studio. The other guest was listed as “Richard Dawkins” and your studio details at Oxford were given.\nApparently when you found out that the two of us were booked on the same show, same segment, you rushed to the producer to insist that we appear separately. Your pretext according to Abraha was that you have a long-standing pledge not to debate “creationists.” I can understand that you don’t want to give legitimacy to people who flatly deny evolution or who insist that the earth is less than 6,000 years old. The only problem with you invoking this pledge is that I believe in evolution and am not, nor have I ever been, a “creationist.”\nApparently the format now is that we will each be interviewed separately. So technically it’s no longer a debate, although it is most certainly an exchange of rival ideas on the same topic. It’s a pity that we cannot engage each other directly.\nTo be honest, I find your behavior extremely bizarre. You go halfway around the world to chase down televangelists to outsmart them in an interview format that you control, but given several opportunities to engage the issues you profess to care about in a true spirit of open debate and inquiry, you duck and dodge and run away.\nDawkins is not only a coward, but a hypocrite.  He’s been quite open in the past about his willingness to debate “up” but not “down”; does anyone doubt that he’d be willing to debate a creationist if that creationist was the Pope?  What he fails to realize is that his fame doesn’t give him the ability to confer legitimacy on anyone; don’t forget that Paris Hilton and Victoria Beckham are far more famous than Dawkins and Katie Price sells more books.  It’s Dawkins’s own legitimacy that has been called into question, first with his shallow, error-filled book, and now with these cowardly antics intended to avoid allowing the public to learn that the godless emperor has no intellectual clothes.  The New Atheism will not survive\nbecause it is completely incapable of standing up to criticism\n.  This is becoming increasingly obvious to everyone, theist and atheist alike; all this dancing, evading, and running away only delays the day of ultimate reckoning.   Of course, a small cult of personality will continue to cling desperately to the Four Horsemen and their lackeys as they continue to retreat from their critics; an ironic homage to the very religions that they so hate and fear.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-21T07:15:00+00:00"
}