{
  "url": "https://voxday.net/2008/07/29/rule-1/",
  "scraped_at": "2026-01-08T22:31:38.080672",
  "title": "Rule #1",
  "date_display": "July 29, 2008",
  "date_iso": "2008-07-29T18:17:00+00:00",
  "date_from_url": "2008-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Her Bad Mother <a href=\"http://www.mamapop.com/mamapop/2008/07/because-you-hav.html\">boldly ignores it</a> at Mamapop:</p><blockquote><p>[W]e know that mom-blogging – WOMAN-blogging – is still radical because there is still so much animosity, so much hate toward it, so much deprecation of it, so much dismissal of it, so much effort put into its marginalization. What is radical about it is that we push on, demanding to be heard, and demanding recognition of our worth as mothers, women, writers, business-people, innovators, people, against the ignorance of those who would keep us down.</p></blockquote><p>Oh, get over yourself, you narcissistic, brainless, lactating cow.  While I’m delighted to recognize the woman for successfully doing what all too few women are accomplishing these days – to her credit she has accomplished the one thing that the human race actually requires of her for its survival – but F-minus for accurate perception of reality.  Such drama-queening!  Such bathos!  This is a Chris Rock moment:</p><p><i>Women, y’all exaggerate everything.  You turn it into some Dynasty shit, like:  ”She’s trying to destroy me!”  What the fuck are you talking about?  You wrap up bags at J.C. Penney’s!</i></p><p>So, we are informed that these radical mommybloggers are DEMANDING to be heard, DEMANDING to be recognized.  Well, guess what?  They’ve got three options in today’s blogosphere.  Write something intelligent, write something entertaining, or post naked pictures.  And clearly, in an undefined number of these cases, options one and two are out.</p><p>No one marginalizes the chick-bloggers and mommy-bloggers; they marginalize themselves.  Hate and animosity?  There is none, readers ignore you because they could not possibly care less about nothing, which just happens to be what you have to say.  Ignorance?  Hardly, when it’s the knowledge of your posts that breeds contempt!  Do you seriously want to know why you’re not taken seriously by me or anyone of either gender with even half a brain?  Sweet Saint Darwin of the Galapagos Islands, <a href=\"http://www.badladies.blogspot.com/\">then read what you write</a>!  The economy is failing, the Obama is at the Gates, the real estate sector is being nationalized, the nation is teetering on the precipice of what appear to be Interesting Times all round, and this woman is entirely caught up in babbling about her vulnerabilities, her breast-feeding, her tears, and her fears?  In precisely what lower circle of Hell does she think anyone except her and those in very similar circumstances to her give the most infinitesimal damn about any of those things?</p><p>Now, I fully support the right of everyone to blog about whatever they want.  Let a million blogs bloom and all that.  It’s not as if anyone except a few hard-core nerds in Estonia and Finland cared about <a href=\"http://www.milobookclub.com/2008/02/27/importance-of-fai/\">my brilliant performance as a commander in Alterac Valley</a> and hardly anyone even understands what I’m talking about when I worry about what looks suspiciously like Wave Three of Three <a href=\"http://www.milobookclub.com/2008/04/30/hair-of-dog-3/\">getting under way</a>.  The salient point is that I understand that this blog exists for me and me alone.  I have no right to demand that anyone read it or recognize it or pay any attention to it whatsoever, and no one has any right to demand that I do it any differently than I do.  Everyone knows most male bloggers aren’t taken seriously either, the difference is that male bloggers don’t often cry about how they’re being marginalized and oppressed and persecuted and near-raped and genitally mutilated and OH THE HUMANITY I CAN’T TAKE IT ANY MORE, WON’T SOMEONE PLEASE CREATE A FEDERAL DEPARTMENT OF BLOG EQUITY TO HELP THESE POOR HOMOGAMETIC BLOGGERS!!!!!</p><p>Now, since this post appears likely to strike a few estrobloggers with inspiration of the pulse-elevating variety, perhaps it would behoove me to remind them of <a href=\"http://www.milobookclub.com/2008/07/26/theres-your-answer/\">Rule #1</a>:</p><p><i>1. Have at least half a brain and demonstrate that it actually functions by not writing egregiously stupid stuff.</i></p></div>",
  "content_text": "Her Bad Mother\nboldly ignores it\nat Mamapop:\n[W]e know that mom-blogging – WOMAN-blogging – is still radical because there is still so much animosity, so much hate toward it, so much deprecation of it, so much dismissal of it, so much effort put into its marginalization. What is radical about it is that we push on, demanding to be heard, and demanding recognition of our worth as mothers, women, writers, business-people, innovators, people, against the ignorance of those who would keep us down.\nOh, get over yourself, you narcissistic, brainless, lactating cow.  While I’m delighted to recognize the woman for successfully doing what all too few women are accomplishing these days – to her credit she has accomplished the one thing that the human race actually requires of her for its survival – but F-minus for accurate perception of reality.  Such drama-queening!  Such bathos!  This is a Chris Rock moment:\nWomen, y’all exaggerate everything.  You turn it into some Dynasty shit, like:  ”She’s trying to destroy me!”  What the fuck are you talking about?  You wrap up bags at J.C. Penney’s!\nSo, we are informed that these radical mommybloggers are DEMANDING to be heard, DEMANDING to be recognized.  Well, guess what?  They’ve got three options in today’s blogosphere.  Write something intelligent, write something entertaining, or post naked pictures.  And clearly, in an undefined number of these cases, options one and two are out.\nNo one marginalizes the chick-bloggers and mommy-bloggers; they marginalize themselves.  Hate and animosity?  There is none, readers ignore you because they could not possibly care less about nothing, which just happens to be what you have to say.  Ignorance?  Hardly, when it’s the knowledge of your posts that breeds contempt!  Do you seriously want to know why you’re not taken seriously by me or anyone of either gender with even half a brain?  Sweet Saint Darwin of the Galapagos Islands,\nthen read what you write\n!  The economy is failing, the Obama is at the Gates, the real estate sector is being nationalized, the nation is teetering on the precipice of what appear to be Interesting Times all round, and this woman is entirely caught up in babbling about her vulnerabilities, her breast-feeding, her tears, and her fears?  In precisely what lower circle of Hell does she think anyone except her and those in very similar circumstances to her give the most infinitesimal damn about any of those things?\nNow, I fully support the right of everyone to blog about whatever they want.  Let a million blogs bloom and all that.  It’s not as if anyone except a few hard-core nerds in Estonia and Finland cared about\nmy brilliant performance as a commander in Alterac Valley\nand hardly anyone even understands what I’m talking about when I worry about what looks suspiciously like Wave Three of Three\ngetting under way\n.  The salient point is that I understand that this blog exists for me and me alone.  I have no right to demand that anyone read it or recognize it or pay any attention to it whatsoever, and no one has any right to demand that I do it any differently than I do.  Everyone knows most male bloggers aren’t taken seriously either, the difference is that male bloggers don’t often cry about how they’re being marginalized and oppressed and persecuted and near-raped and genitally mutilated and OH THE HUMANITY I CAN’T TAKE IT ANY MORE, WON’T SOMEONE PLEASE CREATE A FEDERAL DEPARTMENT OF BLOG EQUITY TO HELP THESE POOR HOMOGAMETIC BLOGGERS!!!!!\nNow, since this post appears likely to strike a few estrobloggers with inspiration of the pulse-elevating variety, perhaps it would behoove me to remind them of\nRule #1\n:\n1. Have at least half a brain and demonstrate that it actually functions by not writing egregiously stupid stuff.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-29T17:17:00+00:00"
}