{
  "url": "https://voxday.net/2008/07/19/seriously-socially-autistic/",
  "scraped_at": "2026-01-08T22:30:48.899163",
  "title": "Seriously socially autistic",
  "date_display": "July 19, 2008",
  "date_iso": "2008-07-19T22:36:00+00:00",
  "date_from_url": "2008-07-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In a post entitled “<a href=\"http://normdoering.blogspot.com/2008/07/what-does-vox-think-he-will-accomplish.html\">What does Vox think he will accomplish by such a bald faced lie?</a>“, Norm Doering actually attempts to defend himself <i>by uploading the early rough draft of the chapter I sent him for criticism onto the Internet!</i> Perhaps some altruistic atheist might care to explain to Doering why this is simply not done before my publisher sends the lawyers after him.</p><blockquote><p>I read what Vox sent me and that wasn’t it. I did a global seach on what Vox sent me and the quote on his blog post is not there. If you want to check me out on this, I have uploaded the chapter he sent me and I’ve put it up on an old spammed up yahoo groups site I haven’t bothered with in years. You’ll have to join the group to download what Vox sent me. Then you click on “files” and it will be the only file there.</p></blockquote><p>Here’s what I wrote to Doering on May 20, 2007 when he offered to critique the chapter prior to publication.  He never delivered the promised critique, although he twice said that he would on May 11 and May 22 last year.  Note that he does NOT have permission to release the text.</p><p><i>Hello Norman,</i></p><p>Please have a crack at it and let me know which arguments you think are weak, baseless or insufficiently proven.  I’d appreciate it if you’d not write anything publicly about it yet or share it with anyone, I plan to provide the complete text to those who have helped just prior to release in order to give them the first chance to blog about it.</p><p>Thank you,<br>Vox</br></p><p>Please keep in mind, this is the lunatic behavior of the atheist who is accusing me of lying due to a rough draft of TIA that was never published or released.  Still have doubts about that social autism theory?  And on what planet is it considered reasonable to criticize an author on the basis of an inaccuracy in a rough draft that was corrected prior to the first publication of the book? An inaccuracy, I might add, that was caught by the author himself before it was corrected since the critic never provided the critique of the rough draft that he promised.</p><p>UPDATE – I received an email from Mr. Doering, who has had the good sense to realize that publicly announcing one’s posting of material that does not belong to one isn’t the best idea and taken down his two posts relating to the matter.  Unfortunately, he has still not grokked the difficult concept of a “rough draft” and stubbornly insists that I am a “bald-faced liar” who not only lied about Sam Harris, but also about Norm Doering.</p><p>All in all, a fine example of the rationality of the New Atheist.</p><p>UPDATE II – Here’s another fine one.  First, <a href=\"http://scienceblogs.com/dispatches/2008/07/vox_day_weighs_in.php\">Ed Drayton pulls the usual atheist stunt</a> of asserting a judgment without providing a single example in support of the assertion – they do this because whenever they do, they are publicly shown to be wrong – and fails to notice that a) the Northern Alliance Radio Show is not my radio show, and b) a correct prediction of cowardice is not inane.</p><p>Even more amusingly, one of Mr. Drayton’s commenter adds: <i>“If he does it he’s an evil bastard and if he doesn’t he’s a coward. This is grade-school level “gotcha” debate technique. Which pretty much sums up Vox Dipshit.”</i> Debate technique?  There is no debate, PZ ran away with his tail between his fat little legs.  As for the dilemma in which PZ finds himself, caught between the Scylla of evil bastardy and the Charybdis of cowardice, that’s of PZ’s doing, not mine.  Myers made his threat to present the photographed evidence “profound disrespect and heinous cracker abuse” <a href=\"http://scienceblogs.com/pharyngula/2008/07/its_a_goddamned_cracker.php#more\">on July 8th</a>.  That was nearly two weeks ago and there’s still no sign of the promised fanfare… so if PZ’s not a coward, one can only conclude that those must be some amazingly intimidating crackers.</p></div>",
  "content_text": "In a post entitled “\nWhat does Vox think he will accomplish by such a bald faced lie?\n“, Norm Doering actually attempts to defend himself\nby uploading the early rough draft of the chapter I sent him for criticism onto the Internet!\nPerhaps some altruistic atheist might care to explain to Doering why this is simply not done before my publisher sends the lawyers after him.\nI read what Vox sent me and that wasn’t it. I did a global seach on what Vox sent me and the quote on his blog post is not there. If you want to check me out on this, I have uploaded the chapter he sent me and I’ve put it up on an old spammed up yahoo groups site I haven’t bothered with in years. You’ll have to join the group to download what Vox sent me. Then you click on “files” and it will be the only file there.\nHere’s what I wrote to Doering on May 20, 2007 when he offered to critique the chapter prior to publication.  He never delivered the promised critique, although he twice said that he would on May 11 and May 22 last year.  Note that he does NOT have permission to release the text.\nHello Norman,\nPlease have a crack at it and let me know which arguments you think are weak, baseless or insufficiently proven.  I’d appreciate it if you’d not write anything publicly about it yet or share it with anyone, I plan to provide the complete text to those who have helped just prior to release in order to give them the first chance to blog about it.\nThank you,\nVox\nPlease keep in mind, this is the lunatic behavior of the atheist who is accusing me of lying due to a rough draft of TIA that was never published or released.  Still have doubts about that social autism theory?  And on what planet is it considered reasonable to criticize an author on the basis of an inaccuracy in a rough draft that was corrected prior to the first publication of the book? An inaccuracy, I might add, that was caught by the author himself before it was corrected since the critic never provided the critique of the rough draft that he promised.\nUPDATE – I received an email from Mr. Doering, who has had the good sense to realize that publicly announcing one’s posting of material that does not belong to one isn’t the best idea and taken down his two posts relating to the matter.  Unfortunately, he has still not grokked the difficult concept of a “rough draft” and stubbornly insists that I am a “bald-faced liar” who not only lied about Sam Harris, but also about Norm Doering.\nAll in all, a fine example of the rationality of the New Atheist.\nUPDATE II – Here’s another fine one.  First,\nEd Drayton pulls the usual atheist stunt\nof asserting a judgment without providing a single example in support of the assertion – they do this because whenever they do, they are publicly shown to be wrong – and fails to notice that a) the Northern Alliance Radio Show is not my radio show, and b) a correct prediction of cowardice is not inane.\nEven more amusingly, one of Mr. Drayton’s commenter adds:\n“If he does it he’s an evil bastard and if he doesn’t he’s a coward. This is grade-school level “gotcha” debate technique. Which pretty much sums up Vox Dipshit.”\nDebate technique?  There is no debate, PZ ran away with his tail between his fat little legs.  As for the dilemma in which PZ finds himself, caught between the Scylla of evil bastardy and the Charybdis of cowardice, that’s of PZ’s doing, not mine.  Myers made his threat to present the photographed evidence “profound disrespect and heinous cracker abuse”\non July 8th\n.  That was nearly two weeks ago and there’s still no sign of the promised fanfare… so if PZ’s not a coward, one can only conclude that those must be some amazingly intimidating crackers.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-19T21:36:00+00:00"
}