{
  "url": "https://voxday.net/2008/07/31/she-begins-to-bitchify/",
  "scraped_at": "2026-01-08T22:31:49.149923",
  "title": "She begins to bitchify",
  "date_display": "July 31, 2008",
  "date_iso": "2008-07-31T13:46:00+00:00",
  "date_from_url": "2008-07-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mamalogues <a href=\"http://www.mamalogues.com/2008/07/ill-be-your-huckleberry.html\">violates Rule #1</a> like a serial-killing pedophile locked into a daycare center the day before he’s supposed to be put away for life:</p><blockquote><p>The ripples of this extended all the way over to World Net Daily, whose columnist by the pseudonym of Vox Day (seriously, I think there were like 20 of those pseudonyms back in my junior high AOL chatroom days) – excuse me – Christian columnist Vox Day (real name Theodore Beale; he’s a rich kid and his dad was on the board at WND, which undoubtedly helped Beale to get some ink) decided to go on a rant against women with emphasis on mothers who blog and basically called us all stupid. I realize that intelligence is probably very important to a man who works “I’m in Mensa” in every biographical footnote and pick-up lines, all the while juxtaposing it next to a standard Myspace headshot replete with a hairstyle and goatee sported by every teenage male member of my Ozark family.</p><p>Now see, that was cruel. It was as shallow and tasteless as the arguments Vox Day/Theodore Beale presented against women bloggers and for that I am ashamed. Really.</p><p>(Tangent: Some time ago I read wherein Beale apologized to national socialists for further disparaging their already-besmirched name with the “femi-nazi” sobriquet. I would go so far as to say Day is acting like a “manazi.” That would be an excellent metal album title.)</p></blockquote><p>Well, technically it didn’t quite make it to WND, not unless I write a column about it.  Which I simply can’t imagine.  It’s not a terrible beginning, but sadly unoriginal.  Cruel?  I laughed, I did; one hears worse from the girls in the fantasy league.  Mamalogues begins exactly as all the radical lesbian feminists and militant atheists do, complete with the customary references to family, hair, money, and Mensa, but perhaps because she’s a religious mommyblogger, she fails to threaten to not have sex with me or impute irregular sexual preferences.  [UPDATE – one of her commenters finally got around to the latter, so check that one off too.]  And, of course, we have the requisite “outing”, which only serves to demonstrate, unsurprisingly, that she flunked the intelligence test.  But, because she’s Christian, she has to feign feeling bad about it, just before launching into another attack with all the biting savagery of a toothless lamb.</p><p>By the way, “Manazi” would be a terrible name for a metal album.  It sounds like “manatee”.  “Mamalaogai”, on the other hand, would rock in a very Rage Against the Machine sense that will almost surely be completely lost on every mommyblogger who happens to read this post.</p><blockquote><p>My other problem with Beale is a repeat of what I mentioned in my earlier graphs: I don’t walk around with a makeshift halo over my head. However, Beale apparently does. This is a guy that advertises all the Christian books he’s reading or has written, a guy who opines about politics and the merits of Christianity in his World Net Daily columns; this is a guy who positions himself in an authoritative role with regards to spirituality, a guy who lectures us on the importance of faith. So forgive me if I find it a little contradictory when he calls someone I know, a genuinely real and good person, a “lactating cow.”</p><p>You don’t speak to someone about their concern for sexism by writing about them like a sexist.</p><p>I should point out that this was on his Blogger site and not on the World Net Daily site, otherwise that probably wouldn’t help sell books, I’d imagine.</p></blockquote><p>Four lies in three paragraphs, at least two of which are intentional.  Impressive, especially for a lecture on Christianity.  Now, I don’t know what sort of halo could possibly involve <i>Chris fucking Rock quotes</i>, and if she was even remotely familiar with anything I’d written, she would know that I completely reject being viewed as any sort of spiritual or theological exemplar, or even as an authority of any kind except on electronic games.  Her combination of dishonesty and ignorance is further demonstrated by her strange comment about selling books.  Want a book?  Then download one free on the right.  As for our friendly lactating cow, if you want to get dramatic and play Enjolras at the barricades, that’s fine, but don’t be surprised when someone shoots at you.  Now, I believe that Bad Mommy is probably a very nice woman.  I have little doubt that Mamalogues is a lovely woman herself.  But that doesn’t excuse them from suffering the consequences of publicly making blitheringly stupid remarks.  I’m an equal-opportunity intellectual assassin.</p><blockquote><p>He goes on to say how women marginalize themselves because of “hate and animosity.” I don’t disagree with this statement, yet he misses the irony completely.</p></blockquote><p>I’m beginning to think I may have been too harsh on Enjolras… her manifesto was brilliant in comparison with this tripe.  Mamalogues is either partially illiterate or she can’t read through her tears.  I wrote absolutely nothing about women marginalizing themselves because of hate and animosity, I only pointed out that hate and animosity had nothing to do with the lack of respect shown mommybloggers and chick-bloggers.  I said that they marginalize themselves due to their choice of subject matter – their own lives.  There is no irony to be found in a statement I never made… but there is certainly an attempt to enlist all women in the cause of brainless, narcissistic female blogging here.</p><blockquote><p>Why does this bother me? I try not to embarrass myself or my faith too much which can be really difficult for me because I have a notoriously sharp tongue and I feel that bluntness expediency in speech is more efficient. I realize that when I say I am a person of faith that I am representing a lot more here on earth than just myself. I try hard to avoid becoming like that which I detest: people like Benny Hinn and his ilk, people who praise God on Sunday but betray Him with their actions on Monday.</p><p>Talking about how spiritually righteous you are while at the same time eviscerating others does nothing to improve the stereotype that some have of Christians. It makes it harder for people to publicly admit their faith. It gives more ammunition to the jerks in high school that make fun of the kid on his way to a meeting of Christian Athletes.</p></blockquote><p>And now the inevitable Appeal to Religion.  Here’s a lesson for you, lady.  What people can’t stomach is lies, hypocrisy, and pretense.  I couldn’t stomach it myself, which was what kept me far away from church and Christians for more than two decades.  It would be a lie, a monstrous lie, a lie of gargantuan proportions, for me to feign any respect whatsoever for that narcissistic demand for recognition and respect made by Bad Mommy.  Dana isn’t at all interested in the truth, she desires the happy, fake, plastic niceness that allows everyone to pretend that Daddy isn’t an alcholic, Mommy didn’t get an abortion, and all the children are above average.  She loves lies more than truth, which is why she tells them so readily.  I challenge her to find a single assertion of being spiritually righteous anywhere in these blog archives, in the seven years of opinion columns or in any of my books.</p><p>Being a Christian has nothing whatsoever to do with being nice.  And all are fallen, every single one.  Some of us simply see little point in trying to hide our flaws.  Now, your mileage may vary, but I happen to prefer open and snarling disagreement to the false smiles, whispers, and knives in the back that permeate so much of Churchianity.</p><blockquote><p>Perhaps Beale’s zeal got ahead of his knowledge on this one: that’s not what was said in the slightest. All that was said was that women in technology would like to be treated with the same consideration as are the men. It’s interesting to me: Beale considers unfair treatment important when discussing matters o<br> f religion or politics; perhaps he discounts women because he’s a male and therefore can’t identify with some of what’s being discussed?</br></p></blockquote><p>She’s lying again.  I quote: <i>“What is radical about it is that we push on, demanding to be heard, and demanding recognition of our worth as mothers, women, writers, business-people, innovators, people, against the ignorance of those who would keep us down.”</i></p><p>That’s demanding far more than being treated with the same consideration, in fact, being treated with precisely the same consideration as are the men is exactly what Mamalogues is complaining about here.  I treated Bad Mommy’s absurd assertions in exactly the same way I treated Sam Harris’s and Richard Dawkins’s in <i>The Irrational Atheist</i>, she has no legitimate cause for complaint on that score.  When have I ever considered unfair treatment to be important, anyhow?  I’m openly and avowedly anti-equalitarian; equality is an immaterial myth far less credible than God.  The only equality that conceivably exists is in the eyes of God, and one can make a credible case that it doesn’t even exist there.</p><blockquote><p>I can’t speak for everyone, but I write online because I enjoy it, it helps me work through things, but most importantly, I have a living diary of my life with my children. I’d forget half of this without typing it up. Also important – I’ve connected with other mothers. I’ve found a groundswell of homeschooling resources and support.</p></blockquote><p>Good for her, but she’s not demanding respect or recognition for it as Bad Mommy was.  She can do whatever she wants.  I neither mind nor care.</p><blockquote><p>It’s the exact same as a bunch of Dungeons and Dragons nerds sitting around in Vox’s mom’s basement, drinking the Kool-Aid, combing their goatees and talking about how much they hate women. OK. That was mean. See? It takes work, ya’ll.</p></blockquote><p>It’s the exact same, except of course that her example doesn’t exist.  Whereas one can see “groups of narcissistic women” that “like to babble at each other and tell each other how wonderful they are” at any given coffee shop every single day, to say nothing of every mommyblog I’ve ever seen.  Granted, my experience of the latter is thankfully quite limited; I’m still trying to bleach my mind from that momentary exposure to the unspeakable Dooche.</p><blockquote><p>Everyone is deserving of respect until otherwise proven. Have you even read the Bible which you thump so hard? NONE of us have earned respect, yet, by faith, we are saved.</p></blockquote><p>Nonsense.  Given the broad and beautiful spectrum of human idiocies on display throughout the Internet, there is absolutely no logical reason to grant respect to anyone or their opinion until they have demonstrated that they merit it.  As for the religious non sequitor, I merely point out that salvation!=respect.</p><p>I don’t hate women.  I especially <a href=\"http://www.worldnetdaily.com/index.php?pageId=41576\">don’t hate mothers</a>.  But I will always show open contempt for those of either sex who demand that which they have not earned and who attempt to seize it through social manipulation and other passive-aggressive means.  Bloggers tend to play rough on the blogosphere and if you want to be a big dog there, then you’d better learn how to take both well-earned shots as well as cheap ones without running away and crying.  I must give Mamalogues her due for trying, but she’s got a long way to go before she’ll even get to Pandagon and PZ territory.</p><p>UPDATE – A Blonde Moment has <a href=\"http://ablondmoment.blogspot.com/2008/07/mom-blogging.html\">a significantly more rational perspective</a> on mommyblogging: <i>“I blog for my own amusement. If others are likewise entertained, I’m glad. I don’t need special recognition for my “worth” as a mom, woman, writer, worker or a person. Nor do I think anyone is trying to keep me down.  My vocation, or in military terms, my mission is to be Josh’s wife, Mallory’s mom, a daughter, a sister, a friend, and to do so with a cheerful attitude as Christ would have me do. I don’t need a special “Good job” or recognition from the New York Times or anyone else.”</i></p><p>UPDATE II – The increasingly hapless Mamalogues adds: <i>“I’ve read him before and stopped because there were other, better political and religious writers out there who didn’t depend on daddy to get them their columns (note how he sidesteps that whole issue.”</i></p><p>Translation: “I tried to read it but it’s over my head so I’m sticking with the Littlest Chickenhawk.”  Anyhow, it seems Mamalogues enjoys the Continental Touch and is looking for another bitch-slap.  Groovie!  I was a weekly columnist for the Pioneer Press and nationally syndicated by both Chronicle Features and Universal Press Syndicate long before my father had any involvement with WND.  The amusing thing is that even the feminists and atheists gave up on this futile line of attack some time ago, but then, evangelical culture has always been a bit behind the times.</p></div>",
  "content_text": "Mamalogues\nviolates Rule #1\nlike a serial-killing pedophile locked into a daycare center the day before he’s supposed to be put away for life:\nThe ripples of this extended all the way over to World Net Daily, whose columnist by the pseudonym of Vox Day (seriously, I think there were like 20 of those pseudonyms back in my junior high AOL chatroom days) – excuse me – Christian columnist Vox Day (real name Theodore Beale; he’s a rich kid and his dad was on the board at WND, which undoubtedly helped Beale to get some ink) decided to go on a rant against women with emphasis on mothers who blog and basically called us all stupid. I realize that intelligence is probably very important to a man who works “I’m in Mensa” in every biographical footnote and pick-up lines, all the while juxtaposing it next to a standard Myspace headshot replete with a hairstyle and goatee sported by every teenage male member of my Ozark family.\nNow see, that was cruel. It was as shallow and tasteless as the arguments Vox Day/Theodore Beale presented against women bloggers and for that I am ashamed. Really.\n(Tangent: Some time ago I read wherein Beale apologized to national socialists for further disparaging their already-besmirched name with the “femi-nazi” sobriquet. I would go so far as to say Day is acting like a “manazi.” That would be an excellent metal album title.)\nWell, technically it didn’t quite make it to WND, not unless I write a column about it.  Which I simply can’t imagine.  It’s not a terrible beginning, but sadly unoriginal.  Cruel?  I laughed, I did; one hears worse from the girls in the fantasy league.  Mamalogues begins exactly as all the radical lesbian feminists and militant atheists do, complete with the customary references to family, hair, money, and Mensa, but perhaps because she’s a religious mommyblogger, she fails to threaten to not have sex with me or impute irregular sexual preferences.  [UPDATE – one of her commenters finally got around to the latter, so check that one off too.]  And, of course, we have the requisite “outing”, which only serves to demonstrate, unsurprisingly, that she flunked the intelligence test.  But, because she’s Christian, she has to feign feeling bad about it, just before launching into another attack with all the biting savagery of a toothless lamb.\nBy the way, “Manazi” would be a terrible name for a metal album.  It sounds like “manatee”.  “Mamalaogai”, on the other hand, would rock in a very Rage Against the Machine sense that will almost surely be completely lost on every mommyblogger who happens to read this post.\nMy other problem with Beale is a repeat of what I mentioned in my earlier graphs: I don’t walk around with a makeshift halo over my head. However, Beale apparently does. This is a guy that advertises all the Christian books he’s reading or has written, a guy who opines about politics and the merits of Christianity in his World Net Daily columns; this is a guy who positions himself in an authoritative role with regards to spirituality, a guy who lectures us on the importance of faith. So forgive me if I find it a little contradictory when he calls someone I know, a genuinely real and good person, a “lactating cow.”\nYou don’t speak to someone about their concern for sexism by writing about them like a sexist.\nI should point out that this was on his Blogger site and not on the World Net Daily site, otherwise that probably wouldn’t help sell books, I’d imagine.\nFour lies in three paragraphs, at least two of which are intentional.  Impressive, especially for a lecture on Christianity.  Now, I don’t know what sort of halo could possibly involve\nChris fucking Rock quotes\n, and if she was even remotely familiar with anything I’d written, she would know that I completely reject being viewed as any sort of spiritual or theological exemplar, or even as an authority of any kind except on electronic games.  Her combination of dishonesty and ignorance is further demonstrated by her strange comment about selling books.  Want a book?  Then download one free on the right.  As for our friendly lactating cow, if you want to get dramatic and play Enjolras at the barricades, that’s fine, but don’t be surprised when someone shoots at you.  Now, I believe that Bad Mommy is probably a very nice woman.  I have little doubt that Mamalogues is a lovely woman herself.  But that doesn’t excuse them from suffering the consequences of publicly making blitheringly stupid remarks.  I’m an equal-opportunity intellectual assassin.\nHe goes on to say how women marginalize themselves because of “hate and animosity.” I don’t disagree with this statement, yet he misses the irony completely.\nI’m beginning to think I may have been too harsh on Enjolras… her manifesto was brilliant in comparison with this tripe.  Mamalogues is either partially illiterate or she can’t read through her tears.  I wrote absolutely nothing about women marginalizing themselves because of hate and animosity, I only pointed out that hate and animosity had nothing to do with the lack of respect shown mommybloggers and chick-bloggers.  I said that they marginalize themselves due to their choice of subject matter – their own lives.  There is no irony to be found in a statement I never made… but there is certainly an attempt to enlist all women in the cause of brainless, narcissistic female blogging here.\nWhy does this bother me? I try not to embarrass myself or my faith too much which can be really difficult for me because I have a notoriously sharp tongue and I feel that bluntness expediency in speech is more efficient. I realize that when I say I am a person of faith that I am representing a lot more here on earth than just myself. I try hard to avoid becoming like that which I detest: people like Benny Hinn and his ilk, people who praise God on Sunday but betray Him with their actions on Monday.\nTalking about how spiritually righteous you are while at the same time eviscerating others does nothing to improve the stereotype that some have of Christians. It makes it harder for people to publicly admit their faith. It gives more ammunition to the jerks in high school that make fun of the kid on his way to a meeting of Christian Athletes.\nAnd now the inevitable Appeal to Religion.  Here’s a lesson for you, lady.  What people can’t stomach is lies, hypocrisy, and pretense.  I couldn’t stomach it myself, which was what kept me far away from church and Christians for more than two decades.  It would be a lie, a monstrous lie, a lie of gargantuan proportions, for me to feign any respect whatsoever for that narcissistic demand for recognition and respect made by Bad Mommy.  Dana isn’t at all interested in the truth, she desires the happy, fake, plastic niceness that allows everyone to pretend that Daddy isn’t an alcholic, Mommy didn’t get an abortion, and all the children are above average.  She loves lies more than truth, which is why she tells them so readily.  I challenge her to find a single assertion of being spiritually righteous anywhere in these blog archives, in the seven years of opinion columns or in any of my books.\nBeing a Christian has nothing whatsoever to do with being nice.  And all are fallen, every single one.  Some of us simply see little point in trying to hide our flaws.  Now, your mileage may vary, but I happen to prefer open and snarling disagreement to the false smiles, whispers, and knives in the back that permeate so much of Churchianity.\nPerhaps Beale’s zeal got ahead of his knowledge on this one: that’s not what was said in the slightest. All that was said was that women in technology would like to be treated with the same consideration as are the men. It’s interesting to me: Beale considers unfair treatment important when discussing matters o\nf religion or politics; perhaps he discounts women because he’s a male and therefore can’t identify with some of what’s being discussed?\nShe’s lying again.  I quote:\n“What is radical about it is that we push on, demanding to be heard, and demanding recognition of our worth as mothers, women, writers, business-people, innovators, people, against the ignorance of those who would keep us down.”\nThat’s demanding far more than being treated with the same consideration, in fact, being treated with precisely the same consideration as are the men is exactly what Mamalogues is complaining about here.  I treated Bad Mommy’s absurd assertions in exactly the same way I treated Sam Harris’s and Richard Dawkins’s in\nThe Irrational Atheist\n, she has no legitimate cause for complaint on that score.  When have I ever considered unfair treatment to be important, anyhow?  I’m openly and avowedly anti-equalitarian; equality is an immaterial myth far less credible than God.  The only equality that conceivably exists is in the eyes of God, and one can make a credible case that it doesn’t even exist there.\nI can’t speak for everyone, but I write online because I enjoy it, it helps me work through things, but most importantly, I have a living diary of my life with my children. I’d forget half of this without typing it up. Also important – I’ve connected with other mothers. I’ve found a groundswell of homeschooling resources and support.\nGood for her, but she’s not demanding respect or recognition for it as Bad Mommy was.  She can do whatever she wants.  I neither mind nor care.\nIt’s the exact same as a bunch of Dungeons and Dragons nerds sitting around in Vox’s mom’s basement, drinking the Kool-Aid, combing their goatees and talking about how much they hate women. OK. That was mean. See? It takes work, ya’ll.\nIt’s the exact same, except of course that her example doesn’t exist.  Whereas one can see “groups of narcissistic women” that “like to babble at each other and tell each other how wonderful they are” at any given coffee shop every single day, to say nothing of every mommyblog I’ve ever seen.  Granted, my experience of the latter is thankfully quite limited; I’m still trying to bleach my mind from that momentary exposure to the unspeakable Dooche.\nEveryone is deserving of respect until otherwise proven. Have you even read the Bible which you thump so hard? NONE of us have earned respect, yet, by faith, we are saved.\nNonsense.  Given the broad and beautiful spectrum of human idiocies on display throughout the Internet, there is absolutely no logical reason to grant respect to anyone or their opinion until they have demonstrated that they merit it.  As for the religious non sequitor, I merely point out that salvation!=respect.\nI don’t hate women.  I especially\ndon’t hate mothers\n.  But I will always show open contempt for those of either sex who demand that which they have not earned and who attempt to seize it through social manipulation and other passive-aggressive means.  Bloggers tend to play rough on the blogosphere and if you want to be a big dog there, then you’d better learn how to take both well-earned shots as well as cheap ones without running away and crying.  I must give Mamalogues her due for trying, but she’s got a long way to go before she’ll even get to Pandagon and PZ territory.\nUPDATE – A Blonde Moment has\na significantly more rational perspective\non mommyblogging:\n“I blog for my own amusement. If others are likewise entertained, I’m glad. I don’t need special recognition for my “worth” as a mom, woman, writer, worker or a person. Nor do I think anyone is trying to keep me down.  My vocation, or in military terms, my mission is to be Josh’s wife, Mallory’s mom, a daughter, a sister, a friend, and to do so with a cheerful attitude as Christ would have me do. I don’t need a special “Good job” or recognition from the New York Times or anyone else.”\nUPDATE II – The increasingly hapless Mamalogues adds:\n“I’ve read him before and stopped because there were other, better political and religious writers out there who didn’t depend on daddy to get them their columns (note how he sidesteps that whole issue.”\nTranslation: “I tried to read it but it’s over my head so I’m sticking with the Littlest Chickenhawk.”  Anyhow, it seems Mamalogues enjoys the Continental Touch and is looking for another bitch-slap.  Groovie!  I was a weekly columnist for the Pioneer Press and nationally syndicated by both Chronicle Features and Universal Press Syndicate long before my father had any involvement with WND.  The amusing thing is that even the feminists and atheists gave up on this futile line of attack some time ago, but then, evangelical culture has always been a bit behind the times.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-31T12:46:00+00:00"
}