{
  "url": "https://voxday.net/2008/07/26/theres-your-answer/",
  "scraped_at": "2026-01-08T22:31:19.690841",
  "title": "There’s your answer",
  "date_display": "July 26, 2008",
  "date_iso": "2008-07-26T11:05:00+00:00",
  "date_from_url": "2008-07-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Female bloggers wonder <a href=\"http://www.nytimes.com/2008/07/27/fashion/27blogher.html?_r=1&amp;hp&amp;oref=slogin\">why they’re not taken seriously</a>:</p><blockquote><p>Blogging has come a long way from its modest beginnings. These days, there is money to be made, fame to be earned and influence to be gained. And though women and men are creating blogs in roughly equal numbers, many women at the conference were becoming very Katie Couric about their belief that they are not taken as seriously as their male counterparts at, say, Daily Kos, a political blog site….</p><p>There were tears at many emotional panels, and also much hooting and applause, whether in response to news that Michelle Obama had just written her first blog post on the BlogHer Web site or that Michelin would be giving away a set of tires.</p></blockquote><p>If a female blogger wants to be taken seriously, it’s not at all difficult:</p><p>1.  Have at least half a brain and demonstrate that it actually functions by not writing egregiously stupid stuff.</p><p>2.  At least 75 percent of your posts should have nothing to do with you or your life.</p><p>3.  Don’t post a picture or talk about your romantic life, your children or your pets.</p><p>4.  Don’t threaten to quit blogging every time anyone criticizes you.</p><p>5.  Learn how to defend your positions with facts and logic instead of passive-aggressive parthian shots fired off as you run away.</p><p>The reality is that most female bloggers aren’t taken seriously because they don’t merit it.  They market themselves based on their physical appearance because it attracts attention, then they are surprised when they are judged on that appearance and belittled for relying upon it.  There are definitely good female bloggers out there – <a href=\"http://rachellucas.com/\">Rachel Lucas</a> and <a href=\"http://drhelen.blogspot.com/\">Dr. Helen</a> are my two favorites – and it’s no accident that neither of them are whiners like these ridiculous women, whose blogs are no doubt full of the female litany of complaints that are such music to the average man’s ears.</p><p>Blogging is one of the most pure meritocracies to be found.  There are exceptions, of course, but the relatively low traffic of most female bloggers is primarily related to either their lack of talent and or their unwillingness to make the sacrifices required to drive it up.  If someone isn’t interested in reading what you’ve got to write, that’s no one’s fault but your own.  Notice how Megan McArdle, with whom I don’t agree all that often, provides a good example of how a female blogger merits being taken seriously, as she attempts to explain <a href=\"http://meganmcardle.theatlantic.com/archives/2008/07/humans_are_complicated_part_11.php\">the importance of respect for symbols</a> in civil society to the socially autistic:</p><blockquote><p>Would it be okay if I spraypainted obscenities on your mother’s grave because it’s just a piece of highly compressed igneous rock with some lines chiseled into it?  How about if I photoshop your a photo of your now-grown child onto a piece of child porn, because after all, no one’s actually hurt by this–it’s just a piece of paper.</p><p>If you reduce symbols to their base physical constituents, then of course it sounds silly to get all excited about them.  Nonetheless, you’d probably be pretty damn upset if someone dug up a relative’s grave and desecrated the corpse on the grounds that it’s just some rotting meat.</p></blockquote><p>Speaking of McArdle, this comment in her post on PZ Myers nearly did for me; I started laughing and coughing at the same time: <i>“Also, those protesting against Myers can boycott his university all they want, but my guess is they don’t have the intellectual chops to get accepted there.”</i></p><p>The commenter is obviously not from Minnesota, as the appropriately named UMM doesn’t report average test scores, but they are proud of the fact that <a href=\"http://education.yahoo.com/college/facts/9272.html\">only 17 percent of their current freshmen scored BELOW 500 </a>on the verbal portion of the SAT.  You can get into UMM as long as you’ve got a pulse and the ability to spell your own name; as it happens, 20 percent of the applicants there can’t even manage that.</p></div>",
  "content_text": "Female bloggers wonder\nwhy they’re not taken seriously\n:\nBlogging has come a long way from its modest beginnings. These days, there is money to be made, fame to be earned and influence to be gained. And though women and men are creating blogs in roughly equal numbers, many women at the conference were becoming very Katie Couric about their belief that they are not taken as seriously as their male counterparts at, say, Daily Kos, a political blog site….\nThere were tears at many emotional panels, and also much hooting and applause, whether in response to news that Michelle Obama had just written her first blog post on the BlogHer Web site or that Michelin would be giving away a set of tires.\nIf a female blogger wants to be taken seriously, it’s not at all difficult:\n1.  Have at least half a brain and demonstrate that it actually functions by not writing egregiously stupid stuff.\n2.  At least 75 percent of your posts should have nothing to do with you or your life.\n3.  Don’t post a picture or talk about your romantic life, your children or your pets.\n4.  Don’t threaten to quit blogging every time anyone criticizes you.\n5.  Learn how to defend your positions with facts and logic instead of passive-aggressive parthian shots fired off as you run away.\nThe reality is that most female bloggers aren’t taken seriously because they don’t merit it.  They market themselves based on their physical appearance because it attracts attention, then they are surprised when they are judged on that appearance and belittled for relying upon it.  There are definitely good female bloggers out there –\nRachel Lucas\nand\nDr. Helen\nare my two favorites – and it’s no accident that neither of them are whiners like these ridiculous women, whose blogs are no doubt full of the female litany of complaints that are such music to the average man’s ears.\nBlogging is one of the most pure meritocracies to be found.  There are exceptions, of course, but the relatively low traffic of most female bloggers is primarily related to either their lack of talent and or their unwillingness to make the sacrifices required to drive it up.  If someone isn’t interested in reading what you’ve got to write, that’s no one’s fault but your own.  Notice how Megan McArdle, with whom I don’t agree all that often, provides a good example of how a female blogger merits being taken seriously, as she attempts to explain\nthe importance of respect for symbols\nin civil society to the socially autistic:\nWould it be okay if I spraypainted obscenities on your mother’s grave because it’s just a piece of highly compressed igneous rock with some lines chiseled into it?  How about if I photoshop your a photo of your now-grown child onto a piece of child porn, because after all, no one’s actually hurt by this–it’s just a piece of paper.\nIf you reduce symbols to their base physical constituents, then of course it sounds silly to get all excited about them.  Nonetheless, you’d probably be pretty damn upset if someone dug up a relative’s grave and desecrated the corpse on the grounds that it’s just some rotting meat.\nSpeaking of McArdle, this comment in her post on PZ Myers nearly did for me; I started laughing and coughing at the same time:\n“Also, those protesting against Myers can boycott his university all they want, but my guess is they don’t have the intellectual chops to get accepted there.”\nThe commenter is obviously not from Minnesota, as the appropriately named UMM doesn’t report average test scores, but they are proud of the fact that\nonly 17 percent of their current freshmen scored BELOW 500\non the verbal portion of the SAT.  You can get into UMM as long as you’ve got a pulse and the ability to spell your own name; as it happens, 20 percent of the applicants there can’t even manage that.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-26T10:05:00+00:00"
}