{
  "url": "https://voxday.net/2008/07/17/third-cu/",
  "scraped_at": "2026-01-08T22:30:34.835753",
  "title": "The Third Cult",
  "date_display": "July 17, 2008",
  "date_iso": "2008-07-17T08:34:00+00:00",
  "date_from_url": "2008-07-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Even the Darwinists <a href=\"http://judson.blogs.nytimes.com/2008/07/15/lets-get-rid-of-darwinism/?em&amp;ex=1216440000&amp;en=167a295250cb0688&amp;ei=5087%0A\">want to get rid of Darwinism now</a>… at least in the titular sense.  This is a reasonable suggestion because the concept of evolution has been modified so greatly that Darwin’s contributions were arguably less important to the latest revision than Mendel’s, Wallace’s, and now, perhaps, Lamarck.  However, there also appears to be an amount of distaste for the idea of Darwin being included with the two fallen secular giants of the nineteenth century, Freud and Marx:</p><blockquote><p>Definitely agree – the only people who use the term “Darwinism” are creationists. And they only do it to tar it with the same brush as “Marxism”, and “Freudianism” – i.e. they want to hint that it’s an outdated and cult-like semi-religious system.</p><p>It’s not, we are evolutionary biologists, not “Darwinists”.</p></blockquote><p>First, it’s worth noting the admission that Marxism and Freudianism are outdated and cult-like, although I think “semi-religious system” is an exaggeration in both cases.  But the more interesting and revealing assertion is the final one.  There are two possible ways to reasonable interpret the statement:</p><p>1.  The commenter is a professional scientist and is correctly pointing out that he should be described as an evolutionary biologist.  How he refers to his profession is really up to him and his peers, of course, but it leaves nameless the much larger group of non-evolutionary biologists who nevertheless believe in Darwin’s theory of evolution by natural selection.</p><p>2.  The commenter is a non-scientist who believes in Darwin’s theory of evolution by natural selection and is attempting to replace the term “Darwinist” by applying “evolutionary biologist” to describe everyone who believes in the theory even if they are not studying or working in the field of biology and have never read works by Darwin, Gould, Dawkins, Wilson or any other evolutionist.</p><p>The first option leaves things incomplete, the second is the sort of logical howler that one has come to expect of science fetishists in general and, ironically enough, biologists in particular.  “Darwinist” is and will remain a perfectly apt description of those who subscribe to the theory of evolution by natural selection, especially considering that most of those who do have never read Darwin or any other scientist writing about evolution and yet place unquestioning faith in that of which they know nothing.  Darwinism in its most recently modified form is not yet outdated, and it is not a worldview or a religion, but it certainly has a few distinct hallmarks of being an intellectual cult.</p></div>",
  "content_text": "Even the Darwinists\nwant to get rid of Darwinism now\n… at least in the titular sense.  This is a reasonable suggestion because the concept of evolution has been modified so greatly that Darwin’s contributions were arguably less important to the latest revision than Mendel’s, Wallace’s, and now, perhaps, Lamarck.  However, there also appears to be an amount of distaste for the idea of Darwin being included with the two fallen secular giants of the nineteenth century, Freud and Marx:\nDefinitely agree – the only people who use the term “Darwinism” are creationists. And they only do it to tar it with the same brush as “Marxism”, and “Freudianism” – i.e. they want to hint that it’s an outdated and cult-like semi-religious system.\nIt’s not, we are evolutionary biologists, not “Darwinists”.\nFirst, it’s worth noting the admission that Marxism and Freudianism are outdated and cult-like, although I think “semi-religious system” is an exaggeration in both cases.  But the more interesting and revealing assertion is the final one.  There are two possible ways to reasonable interpret the statement:\n1.  The commenter is a professional scientist and is correctly pointing out that he should be described as an evolutionary biologist.  How he refers to his profession is really up to him and his peers, of course, but it leaves nameless the much larger group of non-evolutionary biologists who nevertheless believe in Darwin’s theory of evolution by natural selection.\n2.  The commenter is a non-scientist who believes in Darwin’s theory of evolution by natural selection and is attempting to replace the term “Darwinist” by applying “evolutionary biologist” to describe everyone who believes in the theory even if they are not studying or working in the field of biology and have never read works by Darwin, Gould, Dawkins, Wilson or any other evolutionist.\nThe first option leaves things incomplete, the second is the sort of logical howler that one has come to expect of science fetishists in general and, ironically enough, biologists in particular.  “Darwinist” is and will remain a perfectly apt description of those who subscribe to the theory of evolution by natural selection, especially considering that most of those who do have never read Darwin or any other scientist writing about evolution and yet place unquestioning faith in that of which they know nothing.  Darwinism in its most recently modified form is not yet outdated, and it is not a worldview or a religion, but it certainly has a few distinct hallmarks of being an intellectual cult.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-17T07:34:00+00:00"
}