{
  "url": "https://voxday.net/2008/07/08/tia-kelly-climbs-chapter-iv/",
  "scraped_at": "2026-01-08T22:29:32.096276",
  "title": "TIA: Kelly climbs Chapter IV",
  "date_display": "July 8, 2008",
  "date_iso": "2008-07-08T10:52:00+00:00",
  "date_from_url": "2008-07-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Actually, it would be more accurate to say that she glances at a topographical map of it and claims to have reached the summit on that basis.  Rather like Richard Dawkins’s absurd claims to have somehow refuted the massive <i>Summa Theologica</i> of Thomas Aquinas in less than three paltry pages, <a href=\"http://www.rationalresponders.com/reason\">Kelly doesn’t even make a half-hearted attempt</a> at addressing the issues raised in the fourth chapter of <i><a href=\"http://www.amazon.com/Irrational-Atheist-Dissecting-Trinity-Hitchens/dp/1933771364/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1200445323&amp;sr=1-1\">The Irrational Atheist</a></i>:</p><blockquote><p>Reason is a Religion… with none of the defining characteristics of a religion. It is because Vox Day says so in Chapter 4, entitled “The Religion of Reason.” Aside from the humorous comparison between an atheist politician and a “toothless, illiterate, homosexual Afro-Hispanic crack whore with a peg-leg,” his opening salvo misses the point when he adds in the footnote that “it appears that telling people how evil and stupid they are may not be the best way of convincing them….” (p. 61) The reason that atheists are distrusted and, in some cases, despised is not because of intellectual elitism and snobbery—it’s because atheism has been caricatured and stigmatized as a pseudo-Satanic cult in most popular media. It is still not socially acceptable to be as open with one’s non-belief as those who believe are. Walking or driving around with merchandise that announces one’s lack of superstitious belief still draws glares or snide remarks mixed in with the head shaking and sympathetic looks. Meanwhile, almost nobody looks askance at people wearing jewelry depicting crosses and dead crucified men, and Jesus fish are practically ubiquitous. Nonetheless, atheists are unpopular—just not for that reason.</p></blockquote><p>I always enjoy unpopular people attempting to explain to me the real reason they are unpopular, don’t you?  Because, after all, they should know, right?  In this one paragraph, Kelly sheds a great deal of light on how she managed to become that rare bird, the female militant atheist.  If she had even a smidgeon of the social awareness that God gives the average computer programmer, she’d understand that the reason no one looks askance at Christian accoutrements is that the Christian who makes a public statement is making statement about himself and his own beliefs.  Atheists, on the other hand, are making a statement about everyone else and everyone else’s beliefs.  Unsurprisingly, everyone else tends to look on this askance.</p><p>Let me see if I can explain this in sufficiently simple terms.  If I wear a shirt that says “I like chocolate”, this does not offend anyone who prefers strawberry or vanilla.  It is merely providing you with information about me.  If, on the other hand, I wear a shirt that says “Vanilla is evil and everyone who likes it is stupid and bad”, then I should not be surprised when those who happen to like vanilla are not favorably disposed towards me.  It is not only providing you with information about me, it is providing you with information about my negative attitude towards you.  And to those atheists who are so narcissistic as to believe that another individual’s religion is a statement that somehow concerns them, I merely say: Get over yourself! Life, the universe and everything <i>are not about you!</i></p><p>Most non-socially autistic individuals are aware that their actions don’t take place in a vaccuum.  By announcing “I am an atheist”, one is also announcing to the world “There is a high probability that I possess a lot of the same fundamental personality defects that the annoying snot-nosed loser you hated at college did.”  Christians understand that they are lumped in with annoying doorknockers and sanctimonious Biblethumpers, which is why they often behave in a manner intended to put at ease those who find such behaviors annoying.  If atheists don’t like being regarded as annoying atheists, then they should stop behaving in an annoying manner and make it very clear from the start that they have no problem whatsoever with whatever religious absurdity the other person happens to believe.  It’s really not that hard… if you’re not myopically self-obsessed.</p><blockquote><p>Vox relies on many non-scientific studies done by news organizations to prove his points in this chapter, which is fine as they can be a legitimate gauge of popular culture, but one must be careful to remember that these surveys are subject to many confounding factors that limit their usefulness—the most obvious being selection bias and lack of randomization. When a person chooses to call in to a place and voluntarily take a survey about an issue, they tend to have very strong feelings about the issue. People who don’t find religion to be an issue are not likely to waste their time.</p></blockquote><p>Surprise, surprise, Kelly not only doesn’t believe in God, she doesn’t believe the efficacy of polling when she doesn’t like the results.  At least, unlike the New Atheists for the most part, I actually made use of relevant and legitimate data produced by reputable organizations as well as noting the fundamental flaws related to religion-related polls in an earlier chapter.  Now, how, precisely, would one produce “scientific studies” of the popularity or unpopularity of atheists anyhow?</p><blockquote><p>With that out of the way, he claims that people use the religion of a politician to have confirmation of their personal morality.  Given the fact that within Christendom, people’s morality can vary widely even on issues such as abortion, capital punishment, and war, it wouldn’t seem to be a very accurate or reliable tool. With our current president displaying extreme bellicosity and having the honor of putting more people to death than any other during his gubernatorial term in Texas, his conversations with Jesus don’t appear to have had any effect. Life is precious and sacred—until it comes out of a vagina. After that, fuck turning the other cheek. Is anybody else confused? What happened to praying for those who persecute you and giving the thief your shirt after he steals your jacket? It seems that people are talking to lots of different Jesuses. Or the Jesus they are talking to suffers from dissociative identity disorder.</p></blockquote><p>As Richard Dawkins pointed out in <i>The Blind Watchmaker</i>, some information is better than none.  Like a number of Internet atheists, Kelly has averred that a person’s atheism says nothing about that individual except their position on the existence of God, so she shouldn’t find it difficult to understand that people seldom like the idea of electing a complete <i>tabula rasa</i>, Barack Obama’s current popularity notwithstanding.</p><blockquote><p>Day admits that these moral boundaries are theoretical, and thus nullifies his own argument. We have already figured out that religiosity is no guide to an individual’s behavior, whether they are engaged in politics or not. The Jimmy Bakkers and Ted Haggards of the world only confirm the hypocrisy that is evident in the actions of most every believer. Given these facts, perhaps we need a better moral determinant. Maybe we could try some less nebulous ways of getting this information—such as asking them? I know, it’s a radical change from assuming that they hold to a set of beliefs handed down to fictional characters millennia ago, but it just might offer more insight into the personal morality of our leaders.</p></blockquote><p>The fact that the moral boundaries are abstract is hardly irrelevant given the important role that perception plays in democratic elections, especially at the national level where most of the voters will never meet or lay eyes upon the candidate.  The fact that a man may not abide perfectly by the moral standard indicated by his professed religion is not synonymous with a complete absence of information about his morals and beliefs.  Kelly is simply bab<br> bling here, she’s in over her head again and she doesn’t realize it.  I wonder if she realizes that she is seriously suggesting that the electorate should ask <i>politicians</i> to publicly define their personal moralities.  Can anyone spot the small logical flaw in that brilliant plan?</br></p><blockquote><p>Day then uses the absence of defining characteristics of atheism, aside from lack of god-belief, to bolster his argument that there is no way for a person to know what particular pursuits will be undertaken by the politician with no religion. While I agree that this is the case, it seems ironic that he (admittedly) reverses his opinion in this circumstance. Isn’t this chapter called “The Religion of Reason?” If it is in fact a religion, then there would surely be some tenets and guidelines.</p></blockquote><p>Like most social autists, Kelly has trouble recognizing metaphor and other non-literal forms of communication.  Reason is more precisely described as a fetish (any object eliciting unquestioning reverence, respect, or devotion) for most atheists, although they honor it primarily in absentia.</p><blockquote><p>Moreover, he proceeds to go on and claim that, by and large, atheists “parasitically” adopt the morality of their “hosts”, AKA the religious people around us. Could it not be the case that the similarities in ethical belief systems lie in the evolutionary origins of morality? Humans have been selected for traits such as reciprocal altruism and empathy, and while the details may vary over time and cultures, the tendencies that lead one to believe that some standards must be adhered to have been hard-wired into the brains of those most successful at reproduction. The specific indulgences, such as premarital sex, prohibited by religion are just as easily discarded by the religious as the non-religious. It is not random, as he asserts, but rather based in our nature as social creatures dependant on one another and the maintenance of stable societies. Religion may have played a role in the establishment and development of these groups, but we have moved past the point where punishment from sky-daddys is necessary. That’s what the justice system is for, and if that isn’t enough of a deterrent, neither is god.</p></blockquote><p>Could it be the case?  Perhaps.  Is it the case?  Almost surely not, given the historical evidence of the difference between Christian morality and the pagan moralities that preceded and followed it.  Ethical belief systems are far less similar than atheists would usually have one think, of course, an atheist attempting to compare ethical systems is rather like a deaf man attempting to distinguish between Mozart and Vivaldi.</p><blockquote><p>As he again conflates atheism with communist fascism as proof of the willingness of atheists to kill, need I remind anybody of the violence inspired by religion throughout history? Oh wait, that only applies to atheists. When it’s religious people doing the killing, they’re merely power-hungry humans lying about their religious belief to attain the trust of the populace. It has nothing to do with religion. And leaders who claim a religious affiliation are still more trustworthy, despite all of that. Special pleading, anybody?</p></blockquote><p>And incredibly, Kelly makes yet another lame attempt to claim that militant atheists were No True Atheists because they also happened to belong to a certain political party.  It appears she hasn’t made it to Chapter XIII yet.  The relevant point isn’t that religious people don’t ever kill – all are fallen – but that religious people are ORDERS OF MAGNITUDE less likely than atheists to kill when they are in positions that enable them to do so.  I suppose it should be expected that Kelly would find this statistical reality to be an incredible coincidence, though, since her entire worldview is founded on a series of incredible improbabilities occurring for no reason at all.  Life must be interesting for the atheist, coming as it does in a series of totally unexpected, completely unconnected surprises.</p><p>While this may be what passes for “well-reasoned” by an atheist, it isn’t a rebuttal and it doesn’t even rise to the level of a genuine critique.  Kelly must be able to do better than this; she should be embarrassed to be presenting this shallow, stream-of-consciousness drivel with a straight face. <i>Wakarimasu ka?</i></p></div>",
  "content_text": "Actually, it would be more accurate to say that she glances at a topographical map of it and claims to have reached the summit on that basis.  Rather like Richard Dawkins’s absurd claims to have somehow refuted the massive\nSumma Theologica\nof Thomas Aquinas in less than three paltry pages,\nKelly doesn’t even make a half-hearted attempt\nat addressing the issues raised in the fourth chapter of\nThe Irrational Atheist\n:\nReason is a Religion… with none of the defining characteristics of a religion. It is because Vox Day says so in Chapter 4, entitled “The Religion of Reason.” Aside from the humorous comparison between an atheist politician and a “toothless, illiterate, homosexual Afro-Hispanic crack whore with a peg-leg,” his opening salvo misses the point when he adds in the footnote that “it appears that telling people how evil and stupid they are may not be the best way of convincing them….” (p. 61) The reason that atheists are distrusted and, in some cases, despised is not because of intellectual elitism and snobbery—it’s because atheism has been caricatured and stigmatized as a pseudo-Satanic cult in most popular media. It is still not socially acceptable to be as open with one’s non-belief as those who believe are. Walking or driving around with merchandise that announces one’s lack of superstitious belief still draws glares or snide remarks mixed in with the head shaking and sympathetic looks. Meanwhile, almost nobody looks askance at people wearing jewelry depicting crosses and dead crucified men, and Jesus fish are practically ubiquitous. Nonetheless, atheists are unpopular—just not for that reason.\nI always enjoy unpopular people attempting to explain to me the real reason they are unpopular, don’t you?  Because, after all, they should know, right?  In this one paragraph, Kelly sheds a great deal of light on how she managed to become that rare bird, the female militant atheist.  If she had even a smidgeon of the social awareness that God gives the average computer programmer, she’d understand that the reason no one looks askance at Christian accoutrements is that the Christian who makes a public statement is making statement about himself and his own beliefs.  Atheists, on the other hand, are making a statement about everyone else and everyone else’s beliefs.  Unsurprisingly, everyone else tends to look on this askance.\nLet me see if I can explain this in sufficiently simple terms.  If I wear a shirt that says “I like chocolate”, this does not offend anyone who prefers strawberry or vanilla.  It is merely providing you with information about me.  If, on the other hand, I wear a shirt that says “Vanilla is evil and everyone who likes it is stupid and bad”, then I should not be surprised when those who happen to like vanilla are not favorably disposed towards me.  It is not only providing you with information about me, it is providing you with information about my negative attitude towards you.  And to those atheists who are so narcissistic as to believe that another individual’s religion is a statement that somehow concerns them, I merely say: Get over yourself! Life, the universe and everything\nare not about you!\nMost non-socially autistic individuals are aware that their actions don’t take place in a vaccuum.  By announcing “I am an atheist”, one is also announcing to the world “There is a high probability that I possess a lot of the same fundamental personality defects that the annoying snot-nosed loser you hated at college did.”  Christians understand that they are lumped in with annoying doorknockers and sanctimonious Biblethumpers, which is why they often behave in a manner intended to put at ease those who find such behaviors annoying.  If atheists don’t like being regarded as annoying atheists, then they should stop behaving in an annoying manner and make it very clear from the start that they have no problem whatsoever with whatever religious absurdity the other person happens to believe.  It’s really not that hard… if you’re not myopically self-obsessed.\nVox relies on many non-scientific studies done by news organizations to prove his points in this chapter, which is fine as they can be a legitimate gauge of popular culture, but one must be careful to remember that these surveys are subject to many confounding factors that limit their usefulness—the most obvious being selection bias and lack of randomization. When a person chooses to call in to a place and voluntarily take a survey about an issue, they tend to have very strong feelings about the issue. People who don’t find religion to be an issue are not likely to waste their time.\nSurprise, surprise, Kelly not only doesn’t believe in God, she doesn’t believe the efficacy of polling when she doesn’t like the results.  At least, unlike the New Atheists for the most part, I actually made use of relevant and legitimate data produced by reputable organizations as well as noting the fundamental flaws related to religion-related polls in an earlier chapter.  Now, how, precisely, would one produce “scientific studies” of the popularity or unpopularity of atheists anyhow?\nWith that out of the way, he claims that people use the religion of a politician to have confirmation of their personal morality.  Given the fact that within Christendom, people’s morality can vary widely even on issues such as abortion, capital punishment, and war, it wouldn’t seem to be a very accurate or reliable tool. With our current president displaying extreme bellicosity and having the honor of putting more people to death than any other during his gubernatorial term in Texas, his conversations with Jesus don’t appear to have had any effect. Life is precious and sacred—until it comes out of a vagina. After that, fuck turning the other cheek. Is anybody else confused? What happened to praying for those who persecute you and giving the thief your shirt after he steals your jacket? It seems that people are talking to lots of different Jesuses. Or the Jesus they are talking to suffers from dissociative identity disorder.\nAs Richard Dawkins pointed out in\nThe Blind Watchmaker\n, some information is better than none.  Like a number of Internet atheists, Kelly has averred that a person’s atheism says nothing about that individual except their position on the existence of God, so she shouldn’t find it difficult to understand that people seldom like the idea of electing a complete\ntabula rasa\n, Barack Obama’s current popularity notwithstanding.\nDay admits that these moral boundaries are theoretical, and thus nullifies his own argument. We have already figured out that religiosity is no guide to an individual’s behavior, whether they are engaged in politics or not. The Jimmy Bakkers and Ted Haggards of the world only confirm the hypocrisy that is evident in the actions of most every believer. Given these facts, perhaps we need a better moral determinant. Maybe we could try some less nebulous ways of getting this information—such as asking them? I know, it’s a radical change from assuming that they hold to a set of beliefs handed down to fictional characters millennia ago, but it just might offer more insight into the personal morality of our leaders.\nThe fact that the moral boundaries are abstract is hardly irrelevant given the important role that perception plays in democratic elections, especially at the national level where most of the voters will never meet or lay eyes upon the candidate.  The fact that a man may not abide perfectly by the moral standard indicated by his professed religion is not synonymous with a complete absence of information about his morals and beliefs.  Kelly is simply bab\nbling here, she’s in over her head again and she doesn’t realize it.  I wonder if she realizes that she is seriously suggesting that the electorate should ask\npoliticians\nto publicly define their personal moralities.  Can anyone spot the small logical flaw in that brilliant plan?\nDay then uses the absence of defining characteristics of atheism, aside from lack of god-belief, to bolster his argument that there is no way for a person to know what particular pursuits will be undertaken by the politician with no religion. While I agree that this is the case, it seems ironic that he (admittedly) reverses his opinion in this circumstance. Isn’t this chapter called “The Religion of Reason?” If it is in fact a religion, then there would surely be some tenets and guidelines.\nLike most social autists, Kelly has trouble recognizing metaphor and other non-literal forms of communication.  Reason is more precisely described as a fetish (any object eliciting unquestioning reverence, respect, or devotion) for most atheists, although they honor it primarily in absentia.\nMoreover, he proceeds to go on and claim that, by and large, atheists “parasitically” adopt the morality of their “hosts”, AKA the religious people around us. Could it not be the case that the similarities in ethical belief systems lie in the evolutionary origins of morality? Humans have been selected for traits such as reciprocal altruism and empathy, and while the details may vary over time and cultures, the tendencies that lead one to believe that some standards must be adhered to have been hard-wired into the brains of those most successful at reproduction. The specific indulgences, such as premarital sex, prohibited by religion are just as easily discarded by the religious as the non-religious. It is not random, as he asserts, but rather based in our nature as social creatures dependant on one another and the maintenance of stable societies. Religion may have played a role in the establishment and development of these groups, but we have moved past the point where punishment from sky-daddys is necessary. That’s what the justice system is for, and if that isn’t enough of a deterrent, neither is god.\nCould it be the case?  Perhaps.  Is it the case?  Almost surely not, given the historical evidence of the difference between Christian morality and the pagan moralities that preceded and followed it.  Ethical belief systems are far less similar than atheists would usually have one think, of course, an atheist attempting to compare ethical systems is rather like a deaf man attempting to distinguish between Mozart and Vivaldi.\nAs he again conflates atheism with communist fascism as proof of the willingness of atheists to kill, need I remind anybody of the violence inspired by religion throughout history? Oh wait, that only applies to atheists. When it’s religious people doing the killing, they’re merely power-hungry humans lying about their religious belief to attain the trust of the populace. It has nothing to do with religion. And leaders who claim a religious affiliation are still more trustworthy, despite all of that. Special pleading, anybody?\nAnd incredibly, Kelly makes yet another lame attempt to claim that militant atheists were No True Atheists because they also happened to belong to a certain political party.  It appears she hasn’t made it to Chapter XIII yet.  The relevant point isn’t that religious people don’t ever kill – all are fallen – but that religious people are ORDERS OF MAGNITUDE less likely than atheists to kill when they are in positions that enable them to do so.  I suppose it should be expected that Kelly would find this statistical reality to be an incredible coincidence, though, since her entire worldview is founded on a series of incredible improbabilities occurring for no reason at all.  Life must be interesting for the atheist, coming as it does in a series of totally unexpected, completely unconnected surprises.\nWhile this may be what passes for “well-reasoned” by an atheist, it isn’t a rebuttal and it doesn’t even rise to the level of a genuine critique.  Kelly must be able to do better than this; she should be embarrassed to be presenting this shallow, stream-of-consciousness drivel with a straight face.\nWakarimasu ka?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-08T09:52:00+00:00"
}