{
  "url": "https://voxday.net/2008/07/31/when-contempt-is-merited/",
  "scraped_at": "2026-01-08T22:31:52.805998",
  "title": "Doc Holliday never ducked a fight",
  "date_display": "July 31, 2008",
  "date_iso": "2008-07-31T21:48:00+00:00",
  "date_from_url": "2008-07-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Underwater Operative notes that Mamalogue not only can’t take criticism of her friends, she can’t bear criticism of herself either:</p><blockquote><p>I was just reading <a href=\"http://www.mamalogues.com/2008/07/ill-be-your-huckleberry.html\">the comments on her blog</a> and noticed after a refresh that the number of comments had dropped. Her blog her prerogative. It’s just funny that she felt the need to delete the comment. I hit the back button. Here’s the comment she felt needed to be deleted.</p><p><i>Do you know how inappropriate it is to “out” an author by giving his or her real name? Apparently not.</i></p><p>How do I say this gently? Women are more emotional than men, correct? In some instances this is beneficial, but this emotion can cause one to see things in a different light, especially if little or no time is given to reflect on a situation. In the instance of blogging, the lack of traffic of women’s blogs is no indication of inequality or suppression. It is an indication of a smaller level of interest in the topics written (and there’s no shame in that). For those complaining, what is your proposed solution? Force people to read blogs in which they have no interest? Do you see how irrational the whole complaint is? (I say this as a woman, so please don’t start on the ‘woman hater’ thing. It gets really old.)</p><p>As for Vox, you have two choices. Either lash out and learn nothing or glean the idea that not many people are going to care about the specifics of your life beyond friends and family and if you want a larger audience, you will have to adjust your writing accordingly. Whether man or woman, the “plight” of a blogger is the same. If bloggers want traffic, they have to write something people want to read. If you don’t want a larger audience, fine but don’t complain about it. Don’t be like some women who want not equality, but special treatment disguised as equality, which was the point of Vox’s original post.”<br>– By W on July 31, 2008 1:43 PM</br></p></blockquote><p>Rule #6 – Don’t run an echo chamber.  If you cannot bear to be humbled or shown to be wrong on your own blog, then you’d better not allow comments in the first place.</p><p>Interestingly enough, I received notice that those fine, upstanding women at Mamalogue are also imitating the Dawkins.Net atheists in <a href=\"http://en.wikipedia.org/w/index.php?title=Theodore_Beale&amp;oldid=229099628\">vandalizing the amazingly accurate Wikipedia page</a> that is theoretically about me.  Here’s one of the additions made: <i>“Many of his comments have left some wondering about the possibility of closet homosexuality or perhaps a simple case of rape fantasies fueled by anger towards his mother.”</i></p><p>I was under the impression that it was more the muscles, the mohawk and the flaming sword that had some wondering about my particular preferences.  Now, I don’t really mind people screwing around with Wikipedia; I rather liked the old redirect to the syphilis page.  Not exactly subtle, but still mildly amusing.  It’s only Wikipedia, after all, where weirdos who don’t know the first thing about strangers write their biographies.  Still, as one commenter there said: “Dana – way to respond with class.”</p></div>",
  "content_text": "Underwater Operative notes that Mamalogue not only can’t take criticism of her friends, she can’t bear criticism of herself either:\nI was just reading\nthe comments on her blog\nand noticed after a refresh that the number of comments had dropped. Her blog her prerogative. It’s just funny that she felt the need to delete the comment. I hit the back button. Here’s the comment she felt needed to be deleted.\nDo you know how inappropriate it is to “out” an author by giving his or her real name? Apparently not.\nHow do I say this gently? Women are more emotional than men, correct? In some instances this is beneficial, but this emotion can cause one to see things in a different light, especially if little or no time is given to reflect on a situation. In the instance of blogging, the lack of traffic of women’s blogs is no indication of inequality or suppression. It is an indication of a smaller level of interest in the topics written (and there’s no shame in that). For those complaining, what is your proposed solution? Force people to read blogs in which they have no interest? Do you see how irrational the whole complaint is? (I say this as a woman, so please don’t start on the ‘woman hater’ thing. It gets really old.)\nAs for Vox, you have two choices. Either lash out and learn nothing or glean the idea that not many people are going to care about the specifics of your life beyond friends and family and if you want a larger audience, you will have to adjust your writing accordingly. Whether man or woman, the “plight” of a blogger is the same. If bloggers want traffic, they have to write something people want to read. If you don’t want a larger audience, fine but don’t complain about it. Don’t be like some women who want not equality, but special treatment disguised as equality, which was the point of Vox’s original post.”\n– By W on July 31, 2008 1:43 PM\nRule #6 – Don’t run an echo chamber.  If you cannot bear to be humbled or shown to be wrong on your own blog, then you’d better not allow comments in the first place.\nInterestingly enough, I received notice that those fine, upstanding women at Mamalogue are also imitating the Dawkins.Net atheists in\nvandalizing the amazingly accurate Wikipedia page\nthat is theoretically about me.  Here’s one of the additions made:\n“Many of his comments have left some wondering about the possibility of closet homosexuality or perhaps a simple case of rape fantasies fueled by anger towards his mother.”\nI was under the impression that it was more the muscles, the mohawk and the flaming sword that had some wondering about my particular preferences.  Now, I don’t really mind people screwing around with Wikipedia; I rather liked the old redirect to the syphilis page.  Not exactly subtle, but still mildly amusing.  It’s only Wikipedia, after all, where weirdos who don’t know the first thing about strangers write their biographies.  Still, as one commenter there said: “Dana – way to respond with class.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-07-31T20:48:00+00:00"
}