{
  "url": "https://voxday.net/2011/10/16/boring-bloodsuckers/",
  "scraped_at": "2025-12-13T23:24:42.970586",
  "title": "Soporific plasmaphages and the guide to genre",
  "date_display": "October 16, 2011",
  "date_iso": "2011-10-16T10:22:00+00:00",
  "date_from_url": "2011-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After reading the entire <em>Southern Vampire</em> series and watching an episode of <em>The Vampire Diaries</em>, I have reached the conclusion that John O’Neill is entirely correct to cast a deeply skeptical eye upon the entire genre of the vampire story.  As strange as it may seem to assert this, it appears that vampires simply aren’t very interesting in and of themselves.  They appear to exist primarily as a means of expanding the appeal of the traditional romance novel to audiences that would find themselves embarrassed to be reading a traditional bodice-ripper or watching a soap opera.  For example, if one considers the structure of the Charlaine Harris novels and compares them to other urban fantasies, it becomes readily apparent that this genre is little more than a hybrid of the traditional romance novel with the mystery novel, colored by a dash of fantasy that is exotic only to young readers and older readers coming from the romance and mystery markets.  This also explains why the novels hold relatively little appeal to traditional SF/F readers and their irritation at the otherwise reasonable classification of urban fantasy in the fantasy genre.</p><p>Read the rest <a href=\"http://www.blackgate.com/2011/10/16/boring-bloodsuckers/\">at the Black Gate</a></p></div>",
  "content_text": "After reading the entire\nSouthern Vampire\nseries and watching an episode of\nThe Vampire Diaries\n, I have reached the conclusion that John O’Neill is entirely correct to cast a deeply skeptical eye upon the entire genre of the vampire story.  As strange as it may seem to assert this, it appears that vampires simply aren’t very interesting in and of themselves.  They appear to exist primarily as a means of expanding the appeal of the traditional romance novel to audiences that would find themselves embarrassed to be reading a traditional bodice-ripper or watching a soap opera.  For example, if one considers the structure of the Charlaine Harris novels and compares them to other urban fantasies, it becomes readily apparent that this genre is little more than a hybrid of the traditional romance novel with the mystery novel, colored by a dash of fantasy that is exotic only to young readers and older readers coming from the romance and mystery markets.  This also explains why the novels hold relatively little appeal to traditional SF/F readers and their irritation at the otherwise reasonable classification of urban fantasy in the fantasy genre.\nRead the rest\nat the Black Gate",
  "tags": [
    "Black Gate"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-10-16T09:22:00+00:00"
}