{
  "url": "https://voxday.net/2011/10/07/dancing-around-d-word/",
  "scraped_at": "2025-12-13T23:23:54.518640",
  "title": "Dancing around the D-word",
  "date_display": "October 7, 2011",
  "date_iso": "2011-10-07T08:15:00+00:00",
  "date_from_url": "2011-10-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>1. <i>“The average rate on a 30-year fixed mortgage <a href=\"http://finance.yahoo.com/news/30year-mortgage-below-4-pct-apf-2069630673.html?x=0&amp;sec=topStories&amp;pos=4&amp;asset=&amp;ccode=\">has fallen below 4 percent</a> for the first time in history. For the lucky few with good jobs and stable finances, it’s a rare opportunity to save potentially thousands of dollars each year. For most people, it’s a tease and a reminder of how weak their own financial situation is.”</i></p><p>2. <i>“The American dream of homeownership has felt its biggest drop since the Great Depression, according to <a href=\"http://hosted.ap.org/dynamic/stories/U/US_CENSUS_HOUSING?SITE=AP&amp;SECTION=HOME&amp;TEMPLATE=DEFAULT&amp;CTIME=2011-10-06-18-07-33\">new 2010 census figures</a> released Thursday.  The analysis by the Census Bureau found the homeownership rate fell to 65.1 percent last year. While that level remains the second highest decennial rate, analysts say the U.S. may never return to its mid-decade housing boom peak in which nearly 70 percent of occupied households were owned by their residents.”</i></p><p>3. <i>“<a href=\"http://www.telegraph.co.uk/finance/financialcrisis/8812260/World-facing-worst-financial-crisis-in-history-Bank-of-England-Governor-says.html\">Sir Mervyn King was speaking</a> after the decision by the Bank’s Monetary Policy Committee to put £75billion of newly created money into the economy in a desperate effort to stave off a new credit crisis and a UK recession.  Economists said the Bank’s decision to resume its quantitative easing [QE], or asset purchase programme, showed it was increasingly fearful for the economy, and predicted more such moves ahead.  Sir Mervyn said the Bank had been driven by growing signs of a global economic disaster. “This is the most serious financial crisis we’ve seen, at least since the 1930s, if not ever. We’re having to deal with very unusual circumstances, but to act calmly to this and to do the right thing.””</i></p><p>Of course, more quantitative easing isn’t the right thing to do if the desire is to see the global economy return to real economic growth in the shortest possible period of time.  Expanding the money supply, however one wants to label it, is the precisely wrong thing thing to do and is an action driven by the banking industry’s allegiance to a false economic model because the correct action will significantly increase the likelihood of widespread bank failure.  But if one simply goes back to basic economic theory 101, it’s not hard to see why neither Bank of England’s current action nor the Federal Reserve’s previous actions can possibly work.  Since it is the price of money, the Law of Supply and Demand dictates that historically low interest rates mean there is either (a) insufficient demand for money or (b) an excess supply of money.</p><p>How, one wonders, can <i>increasing the supply of money</i> be expected to either (a) increase the insufficient demand for money or (b) reduce the excess supply of it?</p><p>Both the Federal Reserve and the Bank of England would do much better to reduce the money supply, raise interest rates to 20 percent, and make it profitable to save and loan money again.  The reason they don’t is that thanks to the Wall Street Casino, many banks are now net borrowers rather than creditors; remember that the financial institutions <b>owe </b>27 percent of all U.S. debt.  That is why there is simply no way out of the financial crisis without shutting down the banks.</p></div>",
  "content_text": "1.\n“The average rate on a 30-year fixed mortgage\nhas fallen below 4 percent\nfor the first time in history. For the lucky few with good jobs and stable finances, it’s a rare opportunity to save potentially thousands of dollars each year. For most people, it’s a tease and a reminder of how weak their own financial situation is.”\n2.\n“The American dream of homeownership has felt its biggest drop since the Great Depression, according to\nnew 2010 census figures\nreleased Thursday.  The analysis by the Census Bureau found the homeownership rate fell to 65.1 percent last year. While that level remains the second highest decennial rate, analysts say the U.S. may never return to its mid-decade housing boom peak in which nearly 70 percent of occupied households were owned by their residents.”\n3.\n“\nSir Mervyn King was speaking\nafter the decision by the Bank’s Monetary Policy Committee to put £75billion of newly created money into the economy in a desperate effort to stave off a new credit crisis and a UK recession.  Economists said the Bank’s decision to resume its quantitative easing [QE], or asset purchase programme, showed it was increasingly fearful for the economy, and predicted more such moves ahead.  Sir Mervyn said the Bank had been driven by growing signs of a global economic disaster. “This is the most serious financial crisis we’ve seen, at least since the 1930s, if not ever. We’re having to deal with very unusual circumstances, but to act calmly to this and to do the right thing.””\nOf course, more quantitative easing isn’t the right thing to do if the desire is to see the global economy return to real economic growth in the shortest possible period of time.  Expanding the money supply, however one wants to label it, is the precisely wrong thing thing to do and is an action driven by the banking industry’s allegiance to a false economic model because the correct action will significantly increase the likelihood of widespread bank failure.  But if one simply goes back to basic economic theory 101, it’s not hard to see why neither Bank of England’s current action nor the Federal Reserve’s previous actions can possibly work.  Since it is the price of money, the Law of Supply and Demand dictates that historically low interest rates mean there is either (a) insufficient demand for money or (b) an excess supply of money.\nHow, one wonders, can\nincreasing the supply of money\nbe expected to either (a) increase the insufficient demand for money or (b) reduce the excess supply of it?\nBoth the Federal Reserve and the Bank of England would do much better to reduce the money supply, raise interest rates to 20 percent, and make it profitable to save and loan money again.  The reason they don’t is that thanks to the Wall Street Casino, many banks are now net borrowers rather than creditors; remember that the financial institutions\nowe\n27 percent of all U.S. debt.  That is why there is simply no way out of the financial crisis without shutting down the banks.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-10-07T07:15:00+00:00"
}