{
  "url": "https://voxday.net/2011/10/05/failure-to-communicate/",
  "scraped_at": "2025-12-13T23:23:43.451750",
  "title": "A mistaken assumption",
  "date_display": "October 5, 2011",
  "date_iso": "2011-10-05T06:58:00+00:00",
  "date_from_url": "2011-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve noticed that some people are operating under the mistaken impression that I have to answer anyone’s questions.  Let me make it perfectly clear for everyone.  I don’t have to do anything.  And, as I have already made clear in Rule 14, even if I do choose to answer a question or two, I’m not inclined to devote inordinate effort in explaining anything to the egregiously slow, the willfully or terminally stupid, or to permit any visitor here to assume a prosecutorial role.  In fact, the more one attempts the latter, the less likely it is that I will even read one’s comments.  Substantive criticism is not only fine, it is welcome.  Acting officious or posturing as if you have any authority whatsoever is not.</p><p><i>Rule 14: It is my intention to give individual commenters up to three opportunities per post to criticize what I have posted there. Since I do not have any interest whatsoever in wasting time on futile attempts to explain things to the willfully obtuse, the intellectually underpowered, or the disingenuous, I will cease to engage with a commenter after he has committed three demonstrable errors of fact or logic in that comment thread. While I will identify those errors, I am not inclined to be drawn into tangential discussions of them. Attempts to claim that my refusal to further engage with a commenter whose arguments have repeatedly been demonstrated to be flawed are the result of cowardice or an inability to respond are false and will be deleted.</i></p><p>What some tend to forget is that thousands of people come here to learn what I have to think.  They don’t come here to learn what random critic A or emotionally deranged person B have to say.  So, I get a lot of questions directed at me, both in the comments and in my email.  I ignore the majority of them because I simply can’t answer them all and when I do answer them, I answer most of them in a terse manner.  For example, I presently have 27 emails saved because I would like to answer them but haven’t found the time to do so yet.</p><p>On the other hand, the commenter to whom I direct a question has usually already asked me several questions that were answered.  He doesn’t have hundreds of people asking him questions and he has no one holding him to account.  Furthermore, he does not have an eight-year history of reliably backing up his claims with evidence.  And finally, as we have learned, there is a type of critic that is the shoot-and-run variety that is totally unwilling to stand by his own words.</p><p>Notice, for example, that whereas I answered R.S. Bakker’s ridiculous question that I initially believed to be rhetorical, the moment I started asking him questions central to his assertions, he dropped the subject and fell silent despite having implied that my failure to immediately answer his questions was meaningful.  I shall leave it to the readers to decide what his failure to answer my direct questions means by his own metric.</p><p>So, that is why the unbalanced treatment of a) requiring commenters to answer direct challenges to their claims and b) ignoring questions directed at me is not only justified, but necessary.  The fact that people can ask me questions about my posts is a privilege, not a right, as is commenting here at all.  And the fact that I have answered a question, or two, or three neither means that I have agreed to a debate nor accepted a commenter’s status as some sort of special prosecutor.</p><p>And once you’ve shown that you’re clueless, I’m simply not going to pay much attention to what you write.  There are too many other people who actually have something intelligent or interesting to say.  This isn’t a public school, where the teacher has to devote all her attention to the retards and behaviorally challenged to the detriment of the rest of the classroom.</p><p>And on a tangential note, many of you need to stop using the term “logical fallacy” until you learn your logical fallacies.  It is readily apparent that many of you do not know what is and what is not a logical fallacy.  So, unless you can identify the specific logical fallacy that has been committed, I recommend avoiding use of the term.  A logical error is not synonymous with a logical fallacy.  Wikipedia has <a href=\"http://en.wikipedia.org/wiki/Logical_fallacy\">a list of logical fallacies</a> here.</p></div>",
  "content_text": "I’ve noticed that some people are operating under the mistaken impression that I have to answer anyone’s questions.  Let me make it perfectly clear for everyone.  I don’t have to do anything.  And, as I have already made clear in Rule 14, even if I do choose to answer a question or two, I’m not inclined to devote inordinate effort in explaining anything to the egregiously slow, the willfully or terminally stupid, or to permit any visitor here to assume a prosecutorial role.  In fact, the more one attempts the latter, the less likely it is that I will even read one’s comments.  Substantive criticism is not only fine, it is welcome.  Acting officious or posturing as if you have any authority whatsoever is not.\nRule 14: It is my intention to give individual commenters up to three opportunities per post to criticize what I have posted there. Since I do not have any interest whatsoever in wasting time on futile attempts to explain things to the willfully obtuse, the intellectually underpowered, or the disingenuous, I will cease to engage with a commenter after he has committed three demonstrable errors of fact or logic in that comment thread. While I will identify those errors, I am not inclined to be drawn into tangential discussions of them. Attempts to claim that my refusal to further engage with a commenter whose arguments have repeatedly been demonstrated to be flawed are the result of cowardice or an inability to respond are false and will be deleted.\nWhat some tend to forget is that thousands of people come here to learn what I have to think.  They don’t come here to learn what random critic A or emotionally deranged person B have to say.  So, I get a lot of questions directed at me, both in the comments and in my email.  I ignore the majority of them because I simply can’t answer them all and when I do answer them, I answer most of them in a terse manner.  For example, I presently have 27 emails saved because I would like to answer them but haven’t found the time to do so yet.\nOn the other hand, the commenter to whom I direct a question has usually already asked me several questions that were answered.  He doesn’t have hundreds of people asking him questions and he has no one holding him to account.  Furthermore, he does not have an eight-year history of reliably backing up his claims with evidence.  And finally, as we have learned, there is a type of critic that is the shoot-and-run variety that is totally unwilling to stand by his own words.\nNotice, for example, that whereas I answered R.S. Bakker’s ridiculous question that I initially believed to be rhetorical, the moment I started asking him questions central to his assertions, he dropped the subject and fell silent despite having implied that my failure to immediately answer his questions was meaningful.  I shall leave it to the readers to decide what his failure to answer my direct questions means by his own metric.\nSo, that is why the unbalanced treatment of a) requiring commenters to answer direct challenges to their claims and b) ignoring questions directed at me is not only justified, but necessary.  The fact that people can ask me questions about my posts is a privilege, not a right, as is commenting here at all.  And the fact that I have answered a question, or two, or three neither means that I have agreed to a debate nor accepted a commenter’s status as some sort of special prosecutor.\nAnd once you’ve shown that you’re clueless, I’m simply not going to pay much attention to what you write.  There are too many other people who actually have something intelligent or interesting to say.  This isn’t a public school, where the teacher has to devote all her attention to the retards and behaviorally challenged to the detriment of the rest of the classroom.\nAnd on a tangential note, many of you need to stop using the term “logical fallacy” until you learn your logical fallacies.  It is readily apparent that many of you do not know what is and what is not a logical fallacy.  So, unless you can identify the specific logical fallacy that has been committed, I recommend avoiding use of the term.  A logical error is not synonymous with a logical fallacy.  Wikipedia has\na list of logical fallacies\nhere.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-10-05T05:58:00+00:00"
}