{
  "url": "https://voxday.net/2011/10/15/incompetence-and-art-of-war/",
  "scraped_at": "2025-12-13T23:24:39.687197",
  "title": "Incompetence and the art of war",
  "date_display": "October 15, 2011",
  "date_iso": "2011-10-15T12:35:00+00:00",
  "date_from_url": "2011-10-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Obama administration offers a lesson in how not to do it.  First, we have the strategic incompetence with <a href=\"http://ex-army.blogspot.com/2011/10/obama-invades-africa.html\">the new invasion of Uganda</a>, which marks the Nobel Peace Prize winner’s sixth war in three years.  At this rate, if he somehow manages to win reelection, the USA will be fighting 16 wars by the end of his second term.</p><blockquote><p>Offhand, what do you think the dumbest damn place in the world to deploy US troops would be?  Why guess?  Just watch Obama.  Our modern Clausewitz has picked the absolute craziest, most futile, most counterproductive place in the world, central Africa….  Whenever we invade some godforsaken place, we always end up with thousands of new immigrants from that place.  Check out Vietnam, Iraq, Afghanistan, and Somalia, for example.  So I suppose this idiotic invasion will, sort of, benefit these new refugee-immigrants which the welfare establishment is already smacking its lips over. So if you think that what this country needs is some more immigrants from central Africa, cheer Obama on!</p></blockquote><p>But it’s not enough that the Commander-in-Chief is strategically challenged, the forces he has at his disposal are tactically given to <a href=\"http://www.latimes.com/news/nationworld/world/afghanistan/la-fg-pentagon-drone-20111014,0,5628010.story\">literally shooting themselves in the foot</a>.</p><blockquote><p>A Marine and a Navy medic killed by a U.S. drone airstrike were targeted when Marine commanders in Afghanistan mistook them for Taliban fighters, even though analysts watching the Predator’s video feed were uncertain whether the men were part of an enemy force.</p></blockquote><p>Now, if one considers how much collateral damage has taken place thanks to no-knock raids in the War on Drugs, imagine how badly awry things are likely to go once Hellfire-equipped Predators are ordered to patrol American skies.  I wonder how long it will be before these trends come together and the first Ugandan “refugee” is accidentally killed by a Predator intending to attack domestic terrorists in the United States.</p></div>",
  "content_text": "The Obama administration offers a lesson in how not to do it.  First, we have the strategic incompetence with\nthe new invasion of Uganda\n, which marks the Nobel Peace Prize winner’s sixth war in three years.  At this rate, if he somehow manages to win reelection, the USA will be fighting 16 wars by the end of his second term.\nOffhand, what do you think the dumbest damn place in the world to deploy US troops would be?  Why guess?  Just watch Obama.  Our modern Clausewitz has picked the absolute craziest, most futile, most counterproductive place in the world, central Africa….  Whenever we invade some godforsaken place, we always end up with thousands of new immigrants from that place.  Check out Vietnam, Iraq, Afghanistan, and Somalia, for example.  So I suppose this idiotic invasion will, sort of, benefit these new refugee-immigrants which the welfare establishment is already smacking its lips over. So if you think that what this country needs is some more immigrants from central Africa, cheer Obama on!\nBut it’s not enough that the Commander-in-Chief is strategically challenged, the forces he has at his disposal are tactically given to\nliterally shooting themselves in the foot\n.\nA Marine and a Navy medic killed by a U.S. drone airstrike were targeted when Marine commanders in Afghanistan mistook them for Taliban fighters, even though analysts watching the Predator’s video feed were uncertain whether the men were part of an enemy force.\nNow, if one considers how much collateral damage has taken place thanks to no-knock raids in the War on Drugs, imagine how badly awry things are likely to go once Hellfire-equipped Predators are ordered to patrol American skies.  I wonder how long it will be before these trends come together and the first Ugandan “refugee” is accidentally killed by a Predator intending to attack domestic terrorists in the United States.",
  "tags": [
    "trainwreck",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-10-15T11:35:00+00:00"
}