{
  "url": "https://voxday.net/2011/10/01/mailvox-hypocrisy-of-anti-scientis/",
  "scraped_at": "2025-12-13T23:23:27.650260",
  "title": "Mailvox: the hypocrisy of the anti-scientist",
  "date_display": "October 1, 2011",
  "date_iso": "2011-10-01T13:04:00+00:00",
  "date_from_url": "2011-10-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One can’t truly appreciate how effectively Dominic has argued the atheist case without comparing it to the conventional talking points usually presented by the average atheist:</p><blockquote><p>Yeah, heaven forbid that we actually learn from our mistakes!  Tell me vox, if you have such distrust of our present snapshot, how about you jump off your roof to test it?</p><p>But you won’t. And I’ll tell you why. While you know it can be wrong, and certainly is at some points, the chance that it’s wrong regarding your fall is abysmally low. So low that you won’t stake your life on it.</p><p>You similarly will not trust historical evidence that says humans flew , for you know well that the chance of them lying as opposed to science being wrong on the subject is really, really huge.</p><p>When someone testifies to you that he has seen a dragon in your backyard, you will, like a true hypocrite, impose upon the scientific principles of biology and non-observation of dragons despite the fact that you know full well it can be wrong.</p><p>And I’ll tell you why. You know it can be wrong, but you’re pretty sure it isn’t. When we bet, we bet on good odds, not bad ones. There’s the difference between probable and plausible that you’re unable to grasp. There’s a chance that your car will crash, your aeroplane will be hijacked by Islamic fundamentalists, you’ll be mugged while walking, etc. Does that prevent you from going out ?</p><p>You just happen to forget this game of odds when it suits you. It’s called hypocrisy, and you play this game well.</p></blockquote><p>The amusing thing about the average atheist is the way they illogically attempt to simultaneously deny the relevance of historical and testimonial evidence while appealing to it under the misapprehension that it is science.  I don’t refrain from jumping off my roof because science has confirmed that the effect of Earth gravity will draw me to the ground at 9.8 m/s and I have performed a rapid calculation involving my mass, the distance of the fall from the roof, and reached a conclusion that I will not jump.  Instead, I rely upon the testimonial evidence of others, which simply states “don’t jump off the roof or you will hurt yourself.”</p><p>The amusing thing about this atheist’s example of flight is that scientists of the early 20th century refused to believe the historical evidence that the Wright Brothers had, in fact, flown, in part due to their reliance upon the scientific consensus of the time which insisted that heavier-than-air flight was impossible.  In fact, Lord Kelvin, the leading scientist and President of the Royal Society of England, in 1895 stated unequivocally that “Heavier than air flying machines are impossible”.</p><p>If someone testifies that he has seen a dragon in my backyard, I may or may not believe him depending upon his <i>historical</i> record of truthfulness.  Science won’t enter into it at all.  I have already seen far too many things take place that I previously thought to be impossible to place more confidence in “the scientific principles of biology and non-observation of dragons” than in the truthfulness of an individual known to have been reliably truthful in the past.</p><p>The problem with atheists who make a fetish of science is that they simply don’t understand that science is not a universal tool ideal for all purposes, but is rather more akin to a hammer.  A hammer works very well for driving nails and rather less well for cutting down trees.  But preferring the use of a saw when the task at hand involves cutting down a tree does not make one intrinsically anti-hammer, nor does it make one hesitate before picking up a hammer to drive a nail.</p><p>Scientific evidence and historical evidence are complimentary, not intrinsically adversarial.  They may overlap at times, they may conflict at others, but in no case are they the same thing and both types of evidence are capable of being wholly unreliable if applied in an inappropriate manner.  It is far from hypocrisy to recognize the limits to a type of knowledge and restrict one’s use of it to the situations when it is relevant, especially since doing otherwise is misguided at best and quite possibly delusional.</p></div>",
  "content_text": "One can’t truly appreciate how effectively Dominic has argued the atheist case without comparing it to the conventional talking points usually presented by the average atheist:\nYeah, heaven forbid that we actually learn from our mistakes!  Tell me vox, if you have such distrust of our present snapshot, how about you jump off your roof to test it?\nBut you won’t. And I’ll tell you why. While you know it can be wrong, and certainly is at some points, the chance that it’s wrong regarding your fall is abysmally low. So low that you won’t stake your life on it.\nYou similarly will not trust historical evidence that says humans flew , for you know well that the chance of them lying as opposed to science being wrong on the subject is really, really huge.\nWhen someone testifies to you that he has seen a dragon in your backyard, you will, like a true hypocrite, impose upon the scientific principles of biology and non-observation of dragons despite the fact that you know full well it can be wrong.\nAnd I’ll tell you why. You know it can be wrong, but you’re pretty sure it isn’t. When we bet, we bet on good odds, not bad ones. There’s the difference between probable and plausible that you’re unable to grasp. There’s a chance that your car will crash, your aeroplane will be hijacked by Islamic fundamentalists, you’ll be mugged while walking, etc. Does that prevent you from going out ?\nYou just happen to forget this game of odds when it suits you. It’s called hypocrisy, and you play this game well.\nThe amusing thing about the average atheist is the way they illogically attempt to simultaneously deny the relevance of historical and testimonial evidence while appealing to it under the misapprehension that it is science.  I don’t refrain from jumping off my roof because science has confirmed that the effect of Earth gravity will draw me to the ground at 9.8 m/s and I have performed a rapid calculation involving my mass, the distance of the fall from the roof, and reached a conclusion that I will not jump.  Instead, I rely upon the testimonial evidence of others, which simply states “don’t jump off the roof or you will hurt yourself.”\nThe amusing thing about this atheist’s example of flight is that scientists of the early 20th century refused to believe the historical evidence that the Wright Brothers had, in fact, flown, in part due to their reliance upon the scientific consensus of the time which insisted that heavier-than-air flight was impossible.  In fact, Lord Kelvin, the leading scientist and President of the Royal Society of England, in 1895 stated unequivocally that “Heavier than air flying machines are impossible”.\nIf someone testifies that he has seen a dragon in my backyard, I may or may not believe him depending upon his\nhistorical\nrecord of truthfulness.  Science won’t enter into it at all.  I have already seen far too many things take place that I previously thought to be impossible to place more confidence in “the scientific principles of biology and non-observation of dragons” than in the truthfulness of an individual known to have been reliably truthful in the past.\nThe problem with atheists who make a fetish of science is that they simply don’t understand that science is not a universal tool ideal for all purposes, but is rather more akin to a hammer.  A hammer works very well for driving nails and rather less well for cutting down trees.  But preferring the use of a saw when the task at hand involves cutting down a tree does not make one intrinsically anti-hammer, nor does it make one hesitate before picking up a hammer to drive a nail.\nScientific evidence and historical evidence are complimentary, not intrinsically adversarial.  They may overlap at times, they may conflict at others, but in no case are they the same thing and both types of evidence are capable of being wholly unreliable if applied in an inappropriate manner.  It is far from hypocrisy to recognize the limits to a type of knowledge and restrict one’s use of it to the situations when it is relevant, especially since doing otherwise is misguided at best and quite possibly delusional.",
  "tags": [
    "atheism",
    "mailvox",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-10-01T12:04:00+00:00"
}