{
  "url": "https://voxday.net/2011/10/13/overruling-family-court-judge/",
  "scraped_at": "2025-12-13T23:24:29.882581",
  "title": "Overruling the family court judge",
  "date_display": "October 13, 2011",
  "date_iso": "2011-10-13T14:42:00+00:00",
  "date_from_url": "2011-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Unfortunately, it is becoming increasingly apparent that the most effective way for men to overturn the ludicrously evil child custody system is <a href=\"http://www.dailymail.co.uk/news/article-2048470/Seal-Beach-shooting-8-killed-Scott-Dekraai-targets-ex-wife-Orange-county-hair-salon.html\">to utilize violence</a> to render moot the unjust dictates of the family courts:</p><blockquote><p>A gunman who shot dead eight people in an upmarket beauty salon in California is said to have gone on the rampage after losing a custody battle over his son.  Scott Dekraai, who is the former husband of one of the stylists, is said to have shot a total of nine hairdressers and customers at Salon Meritage, a beauty salon just blocks from the Pacific Ocean in the upscale seaside resort of Seal Beach.</p><p>His ex-wife, Michelle, is also reportedly among those who were killed.  The 42-year-old, who used to work in the military, had allegedly threatened violence after losing a court case against Michelle – who was using the name Huff – over the custody of their seven-year-old son, Dominic.</p></blockquote><p>The problem is twofold.  First, the family court system is totally unjust.  Second, there is simply no other recourse for the man who has been forcibly robbed of his children by the unholy alliance of ex-wife and family court.  I have zero sympathy for any woman who would utilize the force of the law to deprive a man of his children, no matter how unhappy the marriage.  In fact, one can quite reasonably argue that it is in the interest of <i>women</i> to demand a more equitable family court system; this should become more apparent when “winning” a child custody case amounts to a potential death lottery.</p><p>The ironic thing is that society tends to applaud a man who do anything and pay any price to get back his child.  There are movies entirely based on this premise.  So, why should it surprise anyone that increasing numbers of men are willing to resort to breaking the very law that took their children away from them?  Throughout the West, the Muslims have shown the way: threaten sufficient violence in a credible manner and the law will be modified according to your will.</p></div>",
  "content_text": "Unfortunately, it is becoming increasingly apparent that the most effective way for men to overturn the ludicrously evil child custody system is\nto utilize violence\nto render moot the unjust dictates of the family courts:\nA gunman who shot dead eight people in an upmarket beauty salon in California is said to have gone on the rampage after losing a custody battle over his son.  Scott Dekraai, who is the former husband of one of the stylists, is said to have shot a total of nine hairdressers and customers at Salon Meritage, a beauty salon just blocks from the Pacific Ocean in the upscale seaside resort of Seal Beach.\nHis ex-wife, Michelle, is also reportedly among those who were killed.  The 42-year-old, who used to work in the military, had allegedly threatened violence after losing a court case against Michelle – who was using the name Huff – over the custody of their seven-year-old son, Dominic.\nThe problem is twofold.  First, the family court system is totally unjust.  Second, there is simply no other recourse for the man who has been forcibly robbed of his children by the unholy alliance of ex-wife and family court.  I have zero sympathy for any woman who would utilize the force of the law to deprive a man of his children, no matter how unhappy the marriage.  In fact, one can quite reasonably argue that it is in the interest of\nwomen\nto demand a more equitable family court system; this should become more apparent when “winning” a child custody case amounts to a potential death lottery.\nThe ironic thing is that society tends to applaud a man who do anything and pay any price to get back his child.  There are movies entirely based on this premise.  So, why should it surprise anyone that increasing numbers of men are willing to resort to breaking the very law that took their children away from them?  Throughout the West, the Muslims have shown the way: threaten sufficient violence in a credible manner and the law will be modified according to your will.",
  "tags": [
    "law",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-10-13T13:42:00+00:00"
}