{
  "url": "https://voxday.net/2011/10/04/pz-myers-memorial-debate-round-3-judges/",
  "scraped_at": "2025-12-13T23:23:40.062122",
  "title": "PZ Myers Memorial Debate Round 3 – the judges",
  "date_display": "October 4, 2011",
  "date_iso": "2011-10-04T05:00:00+00:00",
  "date_from_url": "2011-10-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>Alex:</b> I’m still adding to my detailed notes, but I’ll make them available to anyone upon request.</p><p>1. The first attempt at explanation is almost invariably wrong.  I find the hypothesis, as it relates to the question at hand, specious and unconvincing.  Vox’s rebuttal was very slightly more convincing.  Very small edge to Vox.</p><p>2. Proposition B, aka Vox’s Argument from Objective Morality.  Vox carries the day.</p><p>3. Proposition A, aka the Ancient Aliens.  Vox again.</p><p>Vox’s arguments are tighter, sharper, and more concrete.  Round to Vox.</p><p> <b>Markku:</b> What I attempted to do in order to judge the debate format was to identify the specific attacks from Dominic, and the corresponding counter-arguments from Vox. Since Vox was on the defense, he merely had to counter the attacks in order to fulfill his responsibilities. The shortened forms displayed here should not be understood as capturing the argument but merely showing which part of the text I am talking about.</p><p>Dominic:   no one does [have a complete model of what constitutes conciousness]</p><p>Vox: [I mentioned it] to demonstrate b) the materialist internal model cannot be assumed to be correct.</p><p>Vox from round 2: but their opinion is irrelevant at this point <br> <i><br> Verdict: Successfully countered. Claim of irrelevancy is not a claim of your own explanation’s superiority. </br></i></br></p><p>Dominic: admitting that our moral sense is another part of our conciousness while having no idea what conciousness is composed of amounts to admitting B3 [“that the moral sense is informed by a source external to the conscious mind”] is false</p><p>Vox from previous round: we must decide if it is more likely that the signal is internally or externally generated. (?) And because this definitive moral law is constant and arbitrary, there must be a lawgiver capable of both defining and transmitting it.</p><p><i>Verdict:  Vox defined the “signal” (the only part he claimed external) as where the moral sense’s information comes from, calling it moral law and merely calling its externality more likely. Not certain. Dominic just took what Vox had explicitly admitted and pronounced the claim, not unsatisfactorily proven, but false. Had it been the former, there could be sensible further debate about the evidence. </i></p><p>Dominic:  [Freud vs. external moral law] is a false dichotomy.</p><p>Vox from round 2: Freud’s theory and its variants is the most established of the various internal models</p><p><i>Verdict:  Models, plural, means admitting several options. No dichotomy. <br> </br></i></p><p>Dominic: heterosexual attraction to the opposite sex [is internally generated] (…) It is just another desire, a consequence of biology</p><p>Vox: If this were true, Freud and his successors would not have had to construct their tripartite model in the first place</p><p><i>Verdict:  Vox’s answer doesn’t hold water. Sexual attraction comes from id, as opposed to ego, according to Freud’s model. These are already two separate processes of mind, both seemingly pure biology. If we can have two, we could have three. </i></p><p>Dominic:  Without further context, [aliens, plasma beings and time travellers] are equally plausible explanations</p><p>Vox: It is merely an object lesson in the importance of not leaping to conclusions or placing inordinate confidence in a tool that is inadequate for the task at hand.</p><p><i>Verdict:  The agnostic option is in the middle, and doesn’t do the atheist any more good than it does the theist. What Dominic needs in order to do anything useful is to look at the options that don’t involve gods and argue why they are more plausible than the others. Nor does the mere existence of those options do any good to Vox, but he is not listing them to that end. </i></p><p> Dominic: The concept of gods are what we first postulated to explain the inexplicable. Consequently, the concept itself, is wrong.</p><p>Vox:   But theists readily admit our understanding of the nature of the divine is far from perfect. <br> <i><br> Verdict:  Successfully countered. It was particular gods with particular features, responsibilities and names, which were arguably postulated to explain such things. Any of those things not only can be wrong, but must be in the overwhelming majority of cases. It is enough to satisfy Dominic’s principle. </br></i></br></p><p>Round goes to Vox</p><p> <b>Scott: </b>Dominic continues his argument that the first explanation is usually wrong. Nothing he says, however, is new, and I continue to disagree with it.</p><p>He does address me at one point, and while I don’t want to intrude on the role of the debaters, I feel that at least addressing why I don’t think his counter addresses my point will illustrate why I don’t find his argument convincing at large. (Moreover, Day makes similar points in his rebuttal.)  I said: “[S]ure, people will color their experiences with the divine with trappings taken from their culture. But that’s just them trying to understand something far beyond their ken. People who first saw the sun imagined it was a guy in a chariot. Nevertheless, that they put it in terms of the familiar doesn’t show the sun doesn’t exist.”</p><p>To which Dominic responded: “For some reason, Scott was under the impression he was disagreeing with me here, but he made my point quite well. Yes, there is a Sun out there, but it sure as hell isn’t a guy in a chariot. It is something else besides a god.”</p><p>But that wasn’t my point. My point was the mere fact that we explain things in term of the known doesn’t prove that there isn’t something out there to be explained. Dominic said:<br> “Show me someone recounting an experience of being sexually molested by little grey aliens with big heads and huge hypnotic eyes who’d never heard of or been exposed to Hollywood films or other popular culture sources that tell us what aliens do and what they look like.”</br></p><p>In saying this, he was denying, so far as I can tell, the existence of aliens because people who “encounter” aliens explain those “encounters” in terms familiar to them. But, say I, this would be the same as denying the existence of the sun based on the fact that people used familiar terms to describe it. But the sun clearly exists. Ergo, this argument would prove entirely too much.</p><p>Note the fact that the sun is not a chariot in the sky is completely irrelevant. Of course it isn’t. But the operative fact is that the sun exists, despite our folk explanations of it. Gods, gods, or aliens, what have you, may exist in the same fashion, though we early on explained Him as astride Merkabah.</p><p>Dominic continues to harp on gods being the first explanation implies they’re wrong. What he doesn’t seem to grasp is that “God” is not some unique answer that was made for all time in Bronze Age Israel. The Christian God has greatly evolved since the gods of the Ancient Greeks, as has *Dyēus phter himself. Aquinas’s God is not Zeus. So I’m perfectly willing to except that the first answer is nearly always incorrect–but I don’t think that has any weight on the argument. Just because our first stab at what a God is is wrong doesn’t mean that God doesn’t exist–which is what Dominic wants to infer. God just isn’t what was described by our first hypothesis. In the same way, our first stab at science was wrong–that doesn’t mean since as a whole is a failed hypothesis. Better hypotheses will be presented with time, just as more plausible gods are presented with time.</p><p>So while we can heartily accept Dominic’s observation that the first explanation is usually wrong–and it seems Day does as well–I don’t think that takes us where Dominic wants it to.</p><p>So, respectfully, I think the argument fails. In fact, I think Dominic at least twice now has attacked arguments out of context. He attacks Day’s Aztec argument, but not for the purpose for which Day advanced it. In the same fashion, he appreciates my sun-chariot argument as supporting his claim that the first explanation is wrong. But my argument was not addressed at that particular argument of his, so whether or not it supports it is besides the point–it is aimed elsewhere.</p><p>Dominic makes other points. He says the failure to explain consciousness does not mean that morality is external to humankind. I agree entirely. And Day seems to as well. But, and here I agree with Day, this certainly does not show it to be internal to humankind either. Day cites the failure to explain our moral sense through traditional models as pointing to something external. And well he should, because this is quite suggestive, and will be until:  1. a model of our morality produced through naturalistic processes is convincingly demonstrated; or 2. we find ourselves willing to accept that evolution produces some counterintuitive things that we, through lack of evidence and repeatability, may never be able to fully explain.</p><p>Does this show that God is the rule-giver? No. But it, coupled with evidence that God exists and has given rules, is not nothing.</p><p>Day repeats much of my own response to Dominic’s argument. His attack is far-ranging, and, though there are parts of it I disagree with–that science may have unexplored frontiers does not suggest to me it doesn’t have substantial authority in saying what does and does not exist–I think on the whole his response the stronger. Day seems to back off of previous statements that evil implies God, now content to say it implies external morality, whatever its provenance may be. But even if morality can exist without a creator–nonetheless, that it does exist gives one some pause in denying a creator entirely.</p><p>Round to Day.</p><p> <i>As the judges scored the third round 3-0 in my favor, I will elect to present the argument for Round 4 and Dominic will rebut.  This is the second-to-last round.</i></p></div>",
  "content_text": "Alex:\nI’m still adding to my detailed notes, but I’ll make them available to anyone upon request.\n1. The first attempt at explanation is almost invariably wrong.  I find the hypothesis, as it relates to the question at hand, specious and unconvincing.  Vox’s rebuttal was very slightly more convincing.  Very small edge to Vox.\n2. Proposition B, aka Vox’s Argument from Objective Morality.  Vox carries the day.\n3. Proposition A, aka the Ancient Aliens.  Vox again.\nVox’s arguments are tighter, sharper, and more concrete.  Round to Vox.\nMarkku:\nWhat I attempted to do in order to judge the debate format was to identify the specific attacks from Dominic, and the corresponding counter-arguments from Vox. Since Vox was on the defense, he merely had to counter the attacks in order to fulfill his responsibilities. The shortened forms displayed here should not be understood as capturing the argument but merely showing which part of the text I am talking about.\nDominic:   no one does [have a complete model of what constitutes conciousness]\nVox: [I mentioned it] to demonstrate b) the materialist internal model cannot be assumed to be correct.\nVox from round 2: but their opinion is irrelevant at this point\nVerdict: Successfully countered. Claim of irrelevancy is not a claim of your own explanation’s superiority.\nDominic: admitting that our moral sense is another part of our conciousness while having no idea what conciousness is composed of amounts to admitting B3 [“that the moral sense is informed by a source external to the conscious mind”] is false\nVox from previous round: we must decide if it is more likely that the signal is internally or externally generated. (?) And because this definitive moral law is constant and arbitrary, there must be a lawgiver capable of both defining and transmitting it.\nVerdict:  Vox defined the “signal” (the only part he claimed external) as where the moral sense’s information comes from, calling it moral law and merely calling its externality more likely. Not certain. Dominic just took what Vox had explicitly admitted and pronounced the claim, not unsatisfactorily proven, but false. Had it been the former, there could be sensible further debate about the evidence.\nDominic:  [Freud vs. external moral law] is a false dichotomy.\nVox from round 2: Freud’s theory and its variants is the most established of the various internal models\nVerdict:  Models, plural, means admitting several options. No dichotomy.\nDominic: heterosexual attraction to the opposite sex [is internally generated] (…) It is just another desire, a consequence of biology\nVox: If this were true, Freud and his successors would not have had to construct their tripartite model in the first place\nVerdict:  Vox’s answer doesn’t hold water. Sexual attraction comes from id, as opposed to ego, according to Freud’s model. These are already two separate processes of mind, both seemingly pure biology. If we can have two, we could have three.\nDominic:  Without further context, [aliens, plasma beings and time travellers] are equally plausible explanations\nVox: It is merely an object lesson in the importance of not leaping to conclusions or placing inordinate confidence in a tool that is inadequate for the task at hand.\nVerdict:  The agnostic option is in the middle, and doesn’t do the atheist any more good than it does the theist. What Dominic needs in order to do anything useful is to look at the options that don’t involve gods and argue why they are more plausible than the others. Nor does the mere existence of those options do any good to Vox, but he is not listing them to that end.\nDominic: The concept of gods are what we first postulated to explain the inexplicable. Consequently, the concept itself, is wrong.\nVox:   But theists readily admit our understanding of the nature of the divine is far from perfect.\nVerdict:  Successfully countered. It was particular gods with particular features, responsibilities and names, which were arguably postulated to explain such things. Any of those things not only can be wrong, but must be in the overwhelming majority of cases. It is enough to satisfy Dominic’s principle.\nRound goes to Vox\nScott:\nDominic continues his argument that the first explanation is usually wrong. Nothing he says, however, is new, and I continue to disagree with it.\nHe does address me at one point, and while I don’t want to intrude on the role of the debaters, I feel that at least addressing why I don’t think his counter addresses my point will illustrate why I don’t find his argument convincing at large. (Moreover, Day makes similar points in his rebuttal.)  I said: “[S]ure, people will color their experiences with the divine with trappings taken from their culture. But that’s just them trying to understand something far beyond their ken. People who first saw the sun imagined it was a guy in a chariot. Nevertheless, that they put it in terms of the familiar doesn’t show the sun doesn’t exist.”\nTo which Dominic responded: “For some reason, Scott was under the impression he was disagreeing with me here, but he made my point quite well. Yes, there is a Sun out there, but it sure as hell isn’t a guy in a chariot. It is something else besides a god.”\nBut that wasn’t my point. My point was the mere fact that we explain things in term of the known doesn’t prove that there isn’t something out there to be explained. Dominic said:\n“Show me someone recounting an experience of being sexually molested by little grey aliens with big heads and huge hypnotic eyes who’d never heard of or been exposed to Hollywood films or other popular culture sources that tell us what aliens do and what they look like.”\nIn saying this, he was denying, so far as I can tell, the existence of aliens because people who “encounter” aliens explain those “encounters” in terms familiar to them. But, say I, this would be the same as denying the existence of the sun based on the fact that people used familiar terms to describe it. But the sun clearly exists. Ergo, this argument would prove entirely too much.\nNote the fact that the sun is not a chariot in the sky is completely irrelevant. Of course it isn’t. But the operative fact is that the sun exists, despite our folk explanations of it. Gods, gods, or aliens, what have you, may exist in the same fashion, though we early on explained Him as astride Merkabah.\nDominic continues to harp on gods being the first explanation implies they’re wrong. What he doesn’t seem to grasp is that “God” is not some unique answer that was made for all time in Bronze Age Israel. The Christian God has greatly evolved since the gods of the Ancient Greeks, as has *Dyēus phter himself. Aquinas’s God is not Zeus. So I’m perfectly willing to except that the first answer is nearly always incorrect–but I don’t think that has any weight on the argument. Just because our first stab at what a God is is wrong doesn’t mean that God doesn’t exist–which is what Dominic wants to infer. God just isn’t what was described by our first hypothesis. In the same way, our first stab at science was wrong–that doesn’t mean since as a whole is a failed hypothesis. Better hypotheses will be presented with time, just as more plausible gods are presented with time.\nSo while we can heartily accept Dominic’s observation that the first explanation is usually wrong–and it seems Day does as well–I don’t think that takes us where Dominic wants it to.\nSo, respectfully, I think the argument fails. In fact, I think Dominic at least twice now has attacked arguments out of context. He attacks Day’s Aztec argument, but not for the purpose for which Day advanced it. In the same fashion, he appreciates my sun-chariot argument as supporting his claim that the first explanation is wrong. But my argument was not addressed at that particular argument of his, so whether or not it supports it is besides the point–it is aimed elsewhere.\nDominic makes other points. He says the failure to explain consciousness does not mean that morality is external to humankind. I agree entirely. And Day seems to as well. But, and here I agree with Day, this certainly does not show it to be internal to humankind either. Day cites the failure to explain our moral sense through traditional models as pointing to something external. And well he should, because this is quite suggestive, and will be until:  1. a model of our morality produced through naturalistic processes is convincingly demonstrated; or 2. we find ourselves willing to accept that evolution produces some counterintuitive things that we, through lack of evidence and repeatability, may never be able to fully explain.\nDoes this show that God is the rule-giver? No. But it, coupled with evidence that God exists and has given rules, is not nothing.\nDay repeats much of my own response to Dominic’s argument. His attack is far-ranging, and, though there are parts of it I disagree with–that science may have unexplored frontiers does not suggest to me it doesn’t have substantial authority in saying what does and does not exist–I think on the whole his response the stronger. Day seems to back off of previous statements that evil implies God, now content to say it implies external morality, whatever its provenance may be. But even if morality can exist without a creator–nonetheless, that it does exist gives one some pause in denying a creator entirely.\nRound to Day.\nAs the judges scored the third round 3-0 in my favor, I will elect to present the argument for Round 4 and Dominic will rebut.  This is the second-to-last round.",
  "tags": [
    "debate"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-10-04T04:00:00+00:00"
}