{
  "url": "https://voxday.net/2011/10/02/review-desert-of-souls-by-howard-jones/",
  "scraped_at": "2025-12-13T23:23:31.320687",
  "title": "Review:The Desert of Soulsby Howard A. Jones",
  "date_display": "October 2, 2011",
  "date_iso": "2011-10-02T06:34:00+00:00",
  "date_from_url": "2011-10-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the legitimate complaints about SF/F literature these days is that in the authors’ fervent, self-conscious attempts to Make A Point, Preach To The Choir, or Demonstrate Literary Talent, basic story-telling elements such as plot, characters, and sheer enjoyment tend to be swept out the window. Long gone are the days of the little novel of 65k words, which didn’t attempt to Lecture, Educate, Browbeat, or even Impress us, but was content to merely provide the reader with a pleasurable few hours visiting faraway places and magical lands. The magic of Howard A. Jones’s <i>The Desert of Souls</i> is its admirable lack of literary ambition and its unfashionable focus on simply telling an entertaining tale of two remarkable and very different heroes who refuse to shirk their duty in the face of either evil or danger.</p><p>Read the rest of the review at <a href=\"http://www.blackgate.com/2011/10/02/review-the-desert-of-souls-by-howard-andrew-jones/\">The Black Gate</a></p></div>",
  "content_text": "One of the legitimate complaints about SF/F literature these days is that in the authors’ fervent, self-conscious attempts to Make A Point, Preach To The Choir, or Demonstrate Literary Talent, basic story-telling elements such as plot, characters, and sheer enjoyment tend to be swept out the window. Long gone are the days of the little novel of 65k words, which didn’t attempt to Lecture, Educate, Browbeat, or even Impress us, but was content to merely provide the reader with a pleasurable few hours visiting faraway places and magical lands. The magic of Howard A. Jones’s\nThe Desert of Souls\nis its admirable lack of literary ambition and its unfashionable focus on simply telling an entertaining tale of two remarkable and very different heroes who refuse to shirk their duty in the face of either evil or danger.\nRead the rest of the review at\nThe Black Gate",
  "tags": [
    "Black Gate",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-10-02T05:34:00+00:00"
}