{
  "url": "https://voxday.net/2011/10/01/science-that-isnt-science/",
  "scraped_at": "2025-12-13T23:23:29.466217",
  "title": "Science that isn’t science",
  "date_display": "October 1, 2011",
  "date_iso": "2011-10-01T17:33:00+00:00",
  "date_from_url": "2011-10-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The materialist argument against testimonial evidence is that it relies heavily on the truthfulness of the witness.  The great irony is that this is also true of science as it is actually practiced, as opposed to that imaginary ideal science in which every experimental result is duly replicated multiple times. <a href=\"http://www.economist.com/node/21528593\">The Economist describes an episode of scientific misconduct</a> that reveals how most of what passes for science today holds no claim to even being called science, let alone possesses any scientific authority.</p><blockquote><p>ANIL POTTI, Joseph Nevins and their colleagues at Duke University in Durham, North Carolina, garnered widespread attention in 2006. They reported in the New England Journal of Medicine that they could predict the course of a patient’s lung cancer using devices called expression arrays, which log the activity patterns of thousands of genes in a sample of tissue as a colourful picture (see above). A few months later, they wrote in Nature Medicine that they had developed a similar technique which used gene expression in laboratory cultures of cancer cells, known as cell lines, to predict which chemotherapy would be most effective for an individual patient suffering from lung, breast or ovarian cancer.</p><p>At the time, this work looked like a tremendous advance for personalised medicine—the idea that understanding the molecular specifics of an individual’s illness will lead to a tailored treatment. The papers drew adulation from other workers in the field, and many newspapers, including this one (see article), wrote about them. The team then started to organise a set of clinical trials of personalised treatments for lung and breast cancer. Unbeknown to most people in the field, however, within a few weeks of the publication of the Nature Medicine paper a group of biostatisticians at the MD Anderson Cancer Centre in Houston, led by Keith Baggerly and Kevin Coombes, had begun to find serious flaws in the work….</p><p>Finally, in July 2010, matters unravelled when the Cancer Letter reported that Dr Potti had lied in numerous documents and grant applications. He falsely claimed to have been a Rhodes Scholar in Australia (a curious claim in any case, since Rhodes scholars only attend Oxford University). Dr Baggerly’s observation at the time was, “I find it ironic that we have been yelling for three years about the science, which has the potential to be very damaging to patients, but that was not what has started things rolling.”…</p><p>The process of peer review relies (as it always has done) on the goodwill of workers in the field, who have jobs of their own and frequently cannot spend the time needed to check other people’s papers in a suitably thorough manner.</p></blockquote><p>Now, there are two significant points here.  First, the reason the hypothesis was eventually falsified wasn’t due to the scientific method, but because of historical documentary evidence, namely, the false claim of Dr. Potti to have been a Rhodes Scholar in Australia.  Second, most “science” is not only never experimentally replicated, but the unscientific editing process known as peer review isn’t even performed properly in most cases.</p><p>When comparing science and other forms of knowledge, it is not logically consistent to compare ideal science versus the practical real world application of those alternatives.  Either ideal science can be compared to ideal alternatives or actual science can be compared to actual alternatives.  It is as nonsensical to claim that all reported science is reliable as it would be to claim that all historical documents are accurate and all eyewitness testimony is true.</p><p>Just as some eyewitness testimony is false and some historical documents are inaccurate, most scientific reports are neither properly peer-reviewed nor replicated in any manner.  Therefore, no scientific paper can credibly claim the authority of science until it has been demonstrated that it has been both properly peer-reviewed and duly replicated.</p></div>",
  "content_text": "The materialist argument against testimonial evidence is that it relies heavily on the truthfulness of the witness.  The great irony is that this is also true of science as it is actually practiced, as opposed to that imaginary ideal science in which every experimental result is duly replicated multiple times.\nThe Economist describes an episode of scientific misconduct\nthat reveals how most of what passes for science today holds no claim to even being called science, let alone possesses any scientific authority.\nANIL POTTI, Joseph Nevins and their colleagues at Duke University in Durham, North Carolina, garnered widespread attention in 2006. They reported in the New England Journal of Medicine that they could predict the course of a patient’s lung cancer using devices called expression arrays, which log the activity patterns of thousands of genes in a sample of tissue as a colourful picture (see above). A few months later, they wrote in Nature Medicine that they had developed a similar technique which used gene expression in laboratory cultures of cancer cells, known as cell lines, to predict which chemotherapy would be most effective for an individual patient suffering from lung, breast or ovarian cancer.\nAt the time, this work looked like a tremendous advance for personalised medicine—the idea that understanding the molecular specifics of an individual’s illness will lead to a tailored treatment. The papers drew adulation from other workers in the field, and many newspapers, including this one (see article), wrote about them. The team then started to organise a set of clinical trials of personalised treatments for lung and breast cancer. Unbeknown to most people in the field, however, within a few weeks of the publication of the Nature Medicine paper a group of biostatisticians at the MD Anderson Cancer Centre in Houston, led by Keith Baggerly and Kevin Coombes, had begun to find serious flaws in the work….\nFinally, in July 2010, matters unravelled when the Cancer Letter reported that Dr Potti had lied in numerous documents and grant applications. He falsely claimed to have been a Rhodes Scholar in Australia (a curious claim in any case, since Rhodes scholars only attend Oxford University). Dr Baggerly’s observation at the time was, “I find it ironic that we have been yelling for three years about the science, which has the potential to be very damaging to patients, but that was not what has started things rolling.”…\nThe process of peer review relies (as it always has done) on the goodwill of workers in the field, who have jobs of their own and frequently cannot spend the time needed to check other people’s papers in a suitably thorough manner.\nNow, there are two significant points here.  First, the reason the hypothesis was eventually falsified wasn’t due to the scientific method, but because of historical documentary evidence, namely, the false claim of Dr. Potti to have been a Rhodes Scholar in Australia.  Second, most “science” is not only never experimentally replicated, but the unscientific editing process known as peer review isn’t even performed properly in most cases.\nWhen comparing science and other forms of knowledge, it is not logically consistent to compare ideal science versus the practical real world application of those alternatives.  Either ideal science can be compared to ideal alternatives or actual science can be compared to actual alternatives.  It is as nonsensical to claim that all reported science is reliable as it would be to claim that all historical documents are accurate and all eyewitness testimony is true.\nJust as some eyewitness testimony is false and some historical documents are inaccurate, most scientific reports are neither properly peer-reviewed nor replicated in any manner.  Therefore, no scientific paper can credibly claim the authority of science until it has been demonstrated that it has been both properly peer-reviewed and duly replicated.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-10-01T16:33:00+00:00"
}