{
  "url": "https://voxday.net/2011/10/14/surviving-la-dolce-vita/",
  "scraped_at": "2025-12-13T23:24:37.217536",
  "title": "Surviving la dolce vita",
  "date_display": "October 14, 2011",
  "date_iso": "2011-10-14T18:00:00+00:00",
  "date_from_url": "2011-10-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Speaking of culture, I had a rather exquisite lunch today.  Pata Negra squared.  Which is to say, Barcelona’s finest <i>jambon</i> and slices of <i>bufalo parmigiano</i>, (technically impossible and yet it exists all the same), washed down with an excellent Spanish red named after the delectable king of all pork.  Spacebunny made pizza for dinner and I resorted to a jar of homemade hot oil made by the Dutch Girl which is just ever so slightly cooler than napalm.  This, naturally, required the accompaniment of a nicely drinkable red, the aforementioned Spanish bottle being lamentably empty.</p><p>Ender had to be picked up from his martial arts training, but I was early, so the head of the dojo, being a hospitable sort, poured us both a glass of local white.  And then another.</p><p>At this point, I am entirely certain that my arteries are as clean as a newly scoured aqueduct. I can’t say I’m quite as confident about the old liver, however.  The great thing about the Southern European approach to wine is that you’re never the least bit drunk.  You’re just sort of sporting a vaguely happy buzz from noon until midnight.</p></div>",
  "content_text": "Speaking of culture, I had a rather exquisite lunch today.  Pata Negra squared.  Which is to say, Barcelona’s finest\njambon\nand slices of\nbufalo parmigiano\n, (technically impossible and yet it exists all the same), washed down with an excellent Spanish red named after the delectable king of all pork.  Spacebunny made pizza for dinner and I resorted to a jar of homemade hot oil made by the Dutch Girl which is just ever so slightly cooler than napalm.  This, naturally, required the accompaniment of a nicely drinkable red, the aforementioned Spanish bottle being lamentably empty.\nEnder had to be picked up from his martial arts training, but I was early, so the head of the dojo, being a hospitable sort, poured us both a glass of local white.  And then another.\nAt this point, I am entirely certain that my arteries are as clean as a newly scoured aqueduct. I can’t say I’m quite as confident about the old liver, however.  The great thing about the Southern European approach to wine is that you’re never the least bit drunk.  You’re just sort of sporting a vaguely happy buzz from noon until midnight.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-10-14T17:00:00+00:00"
}