{
  "url": "https://voxday.net/2011/10/31/that-sums-it-up/",
  "scraped_at": "2025-12-13T23:26:04.474242",
  "title": "That sums it up",
  "date_display": "October 31, 2011",
  "date_iso": "2011-10-31T17:04:00+00:00",
  "date_from_url": "2011-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A quote from a Denver Broncos fan: <i>“Tebow needs to switch to tight end, fullback or safety. Great kid, awesome person, horrible NFL QB.”</i></p><p>I like Tebow and admire the way he has handled his fame and success, but after watching his two starts this year, I have no problem stating that he simply cannot play quarterback in the NFL.  I respect willpower and a hard work ethic as much as anyone, but watching Tebow try to play quarterback is like watching a guy who runs a 14-second 100 meter dash try to play wide receiver or a guy who weighs 220 pounds try to play offensive lineman.  It would take a literal miracle for him to even reach the “competent starter” level, forget All-Pro, much less Super Bowl-winning superstar.  If Richard Dawkins followed NFL football, he would readily admit that Tim Tebow becoming an All-Pro quarterback and leading Denver to victory in the Super Bowl would qualify as proof of the existence of the Christian God.</p><p>None of this is Tebow’s fault.  He didn’t ask to be drafted in the first round.  No one, not even his worst critics, have so much as hinted at any failure to work hard.  But he has the complete lack of package at the position: weak arm, slow wind-up, inability to read defenses, and inability to go through his progressions and find the open receiver.  (Okay, perhaps not quite complete, I doubt his Wonderlic score is in the single digits.)  The difference between watching Cam Newton and Christian Ponder – both rookies – and then watching Tebow, in his second year, rendered the conclusion unavoidable. <i>That is not an NFL quarterback.</i></p><p>I have no doubt Tebow will be extraordinarily successful at something.  But it won’t be as an NFL quarterback.  It’s not a question of overcoming doubts, it’s a question of overcoming undeniable facts.</p></div>",
  "content_text": "A quote from a Denver Broncos fan:\n“Tebow needs to switch to tight end, fullback or safety. Great kid, awesome person, horrible NFL QB.”\nI like Tebow and admire the way he has handled his fame and success, but after watching his two starts this year, I have no problem stating that he simply cannot play quarterback in the NFL.  I respect willpower and a hard work ethic as much as anyone, but watching Tebow try to play quarterback is like watching a guy who runs a 14-second 100 meter dash try to play wide receiver or a guy who weighs 220 pounds try to play offensive lineman.  It would take a literal miracle for him to even reach the “competent starter” level, forget All-Pro, much less Super Bowl-winning superstar.  If Richard Dawkins followed NFL football, he would readily admit that Tim Tebow becoming an All-Pro quarterback and leading Denver to victory in the Super Bowl would qualify as proof of the existence of the Christian God.\nNone of this is Tebow’s fault.  He didn’t ask to be drafted in the first round.  No one, not even his worst critics, have so much as hinted at any failure to work hard.  But he has the complete lack of package at the position: weak arm, slow wind-up, inability to read defenses, and inability to go through his progressions and find the open receiver.  (Okay, perhaps not quite complete, I doubt his Wonderlic score is in the single digits.)  The difference between watching Cam Newton and Christian Ponder – both rookies – and then watching Tebow, in his second year, rendered the conclusion unavoidable.\nThat is not an NFL quarterback.\nI have no doubt Tebow will be extraordinarily successful at something.  But it won’t be as an NFL quarterback.  It’s not a question of overcoming doubts, it’s a question of overcoming undeniable facts.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-10-31T17:04:00+00:00"
}