{
  "url": "https://voxday.net/2011/10/29/they-just-never-learn/",
  "scraped_at": "2025-12-13T23:25:51.621608",
  "title": "They just never learn",
  "date_display": "October 29, 2011",
  "date_iso": "2011-10-29T11:58:00+00:00",
  "date_from_url": "2011-10-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Keep in mind that the following assertion is from the same individual who five minutes later departed the scene with the following Parthian shot: <i>“Arguments from ignorance galore – ah, how I love Vox day.  Anyways, enough of arguing with people of IQ below lima beans. Ciao.</i> Just a Random Atheist wrote:</p><blockquote><p>How about the fact that a molecular tree of life and a morphological tree of life has over 99% congruency? Do you think anyone would take evo seriously if the case was different?</p></blockquote><p>There is not much that needs to be said except that “the fact” is clearly nothing of the kind.  And yes, it is entirely obvious scientists will still continue to take evolutionary theory seriously despite the fact that the case has been determined to be different, as the fifth search result for “Darwin tree of life” shows that this is already the case.  Consider <a href=\"http://www.telegraph.co.uk/science/4312355/Charles-Darwins-tree-of-life-is-wrong-and-misleading-claim-scientists.html\">the following statements</a>.</p><p><i>The discovery of the structure of DNA in 1953 – whose pioneers believed it would provide proof of Darwin’s tree – opened up new vistas for evolutionary biology.  But current research is finding a far more complex scenario than Darwin could have imagined – particularly in relation to bacteria and single-celled organisms.</i></p><p><i>Dr Eric Bapteste, an evolutionary biologist at the Pierre and Marie Curie University in Paris, said: “For a long time the holy grail was to build a tree of life. We have no evidence at all that the tree of life is a reality.”</i></p><p><i>“It’s part of a revolutionary change in biology. Our standard model of evolution is under enormous pressure.”</i></p><p><i>“The tree of life is being politely buried – we all know that. What’s less accepted is our whole fundamental view of biology needs to change.” </i></p><p>So, precisely whom is arguing from ignorance here?  Now, note that it was me, the evolutionary skeptic, who predicted that this would happen, that the standard model of evolution, the Neo-Darwinian Synthesis, would not only come under enormous pressure due to advancements in genetic science, but eventually be junked entirely.  That hasn’t happened yet, of course, but the trend is clear and the predicted outcome has become increasingly likely.  It is also worth noting that it is evolutionary true believers like Just a Random Atheist who are simply not up on recent developments in biology, in part because they erroneously assume that the standard model is not only correct, but infallible and unquestionable.</p><p>That is not scientific thinking.  That isn’t even <i>theological </i>thinking.  That is pure, unquestioning, religious dogma.</p></div>",
  "content_text": "Keep in mind that the following assertion is from the same individual who five minutes later departed the scene with the following Parthian shot:\n“Arguments from ignorance galore – ah, how I love Vox day.  Anyways, enough of arguing with people of IQ below lima beans. Ciao.\nJust a Random Atheist wrote:\nHow about the fact that a molecular tree of life and a morphological tree of life has over 99% congruency? Do you think anyone would take evo seriously if the case was different?\nThere is not much that needs to be said except that “the fact” is clearly nothing of the kind.  And yes, it is entirely obvious scientists will still continue to take evolutionary theory seriously despite the fact that the case has been determined to be different, as the fifth search result for “Darwin tree of life” shows that this is already the case.  Consider\nthe following statements\n.\nThe discovery of the structure of DNA in 1953 – whose pioneers believed it would provide proof of Darwin’s tree – opened up new vistas for evolutionary biology.  But current research is finding a far more complex scenario than Darwin could have imagined – particularly in relation to bacteria and single-celled organisms.\nDr Eric Bapteste, an evolutionary biologist at the Pierre and Marie Curie University in Paris, said: “For a long time the holy grail was to build a tree of life. We have no evidence at all that the tree of life is a reality.”\n“It’s part of a revolutionary change in biology. Our standard model of evolution is under enormous pressure.”\n“The tree of life is being politely buried – we all know that. What’s less accepted is our whole fundamental view of biology needs to change.”\nSo, precisely whom is arguing from ignorance here?  Now, note that it was me, the evolutionary skeptic, who predicted that this would happen, that the standard model of evolution, the Neo-Darwinian Synthesis, would not only come under enormous pressure due to advancements in genetic science, but eventually be junked entirely.  That hasn’t happened yet, of course, but the trend is clear and the predicted outcome has become increasingly likely.  It is also worth noting that it is evolutionary true believers like Just a Random Atheist who are simply not up on recent developments in biology, in part because they erroneously assume that the standard model is not only correct, but infallible and unquestionable.\nThat is not scientific thinking.  That isn’t even\ntheological\nthinking.  That is pure, unquestioning, religious dogma.",
  "tags": [
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-10-29T10:58:00+00:00"
}