{
  "url": "https://voxday.net/2011/10/14/transformative-magic-of-passpor/",
  "scraped_at": "2025-12-13T23:24:33.573148",
  "title": "The transformative magic of the passport",
  "date_display": "October 14, 2011",
  "date_iso": "2011-10-14T09:33:00+00:00",
  "date_from_url": "2011-10-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This purported criticism of passport snobbery is still indicative of an amount of <a href=\"http://www.outsidethebeltway.com/passport-snobbery/\">silly passport snobbery</a>:</p><blockquote><p>It’s not because there’s something magical about exposure to the quirks and customs of other cultures that transforms you into a better, wiser person.   It’s just that there’s a certain provincialism that surrounds populist politicians and those who are attracted to them.   And traveling widely — whether on the great continental landmass that Americans live on or across national borders and oceans — tends to not only break down said provincialism but demonstrates a curiosity about the world around you that is a vital characteristic for national leaders.</p></blockquote><p>This was clearly written by the sort of individual, usually left-leaning, who genuinely believes that there is some sort of magic inherent to travel and some sort of evil inherent to what they invariably label “provincialism”.  Interestingly enough, in my experience it is Americans living in the East Coast Axis of Boston to Washington DC and Canadians who are most susceptible to the disease of passport snobbery; the only Europeans who are impressed by the low percentage of American passport ownership are those who haven’t been to the USA and don’t realize how big it is.</p><p>The irony is that the passport snob primarily subscribes to the myth of the mind-expanding magic of travel due to his own provincialism.  You may recall the attempt of The Prince of Wängst to label me, a multi-passport multi-lingual, expatriate who studied in Japan, as “provincial”.  This was more than a little amusing given Mr. Bakker’s literally provincial existence, having been born in Ontario, educated in Ontario, and presently residing in, you guessed it, Ontario.  Even more amusing was the example I have previously related of the self-appointed Canadian Euro-sophisticate from Quebec.  He was happily occupied with lecturing Spacebunny and I on the near-European nature of Montreal and how it compared so very favorably to the Minnesota peasantry at the party we were attending when his fiance joined the conversation.  And he was visibly put out to discover we had flown in that very morning from either Zurich or Milano, I don’t recall which.</p><p>“Well, what were you doing there?” he demanded.</p><p>Strangely, he didn’t seem to want to talk to us anymore after he found out we lived in Italy, although we were quite willing to hear more about what a European city Montreal is.  Fascinating stuff.</p><p>The truth, as those who have not only traveled around the world, but who actually speak different languages and have lived in different cultures for extended periods of time, is that there are far more similarities than differences among the civilized peoples of the world.  The mountain peasants of Italy, the agricultural peasants of France, and the rice paddy peasants of Japan have far more in common with each other and with the rural working class in the Midwest than they do with the Milanese industrial magnates, the banking gnomes of Zurich, the powerful, but self-effacing executives of the great <i>keiretsu</i>, or the Wall Street elite.</p><p>And neither transnational group has much in common with the angst-laden middle-class would-be intellectuals, whose desperate pretentiousness and feverish pursuit of credentials sets them in a particularly annoying transnational class of their own.  The European ones confide to you how American they feel themselves to be while the American version forever bears the imprint of the semester it spent in [insert European capital].  The Canadian version is either the saddest or the funniest, depending upon your perspective, because it genuinely believes that a semester in Nashville or Iowa City counts as magic travel.</p><p>But there are interesting things to be learned from every group, in every country.  My soccer teammates are mostly peasants, with one notable exception.  My social acquaintances are mostly petty international class, and my interests tend to most closely resemble the aspirational middle-class intellectuals.  But it is as shallow and ultimately pointless to look down on the rural peasantry for their lack of passports as it is to criticize the rich and powerful for their accounting strategies or the aspirational academics for their insecurities.  Such things are more definitive attributes than correctable actions.</p><p>Travel doesn’t make you a better or more curious person.  It simply presents you with more information.  What you do with that information, and how it effects your thought processes and future behavior, will have more to do with who you already were than any transformative magic courtesy that comes from the possession of a government document.</p><p>For me, the experience gained from living most of my adult life as an expatriate that has given me a greater respect for the unique nature of historical American society as well as a deeper sorrow for that which Americans have lost.</p></div>",
  "content_text": "This purported criticism of passport snobbery is still indicative of an amount of\nsilly passport snobbery\n:\nIt’s not because there’s something magical about exposure to the quirks and customs of other cultures that transforms you into a better, wiser person.   It’s just that there’s a certain provincialism that surrounds populist politicians and those who are attracted to them.   And traveling widely — whether on the great continental landmass that Americans live on or across national borders and oceans — tends to not only break down said provincialism but demonstrates a curiosity about the world around you that is a vital characteristic for national leaders.\nThis was clearly written by the sort of individual, usually left-leaning, who genuinely believes that there is some sort of magic inherent to travel and some sort of evil inherent to what they invariably label “provincialism”.  Interestingly enough, in my experience it is Americans living in the East Coast Axis of Boston to Washington DC and Canadians who are most susceptible to the disease of passport snobbery; the only Europeans who are impressed by the low percentage of American passport ownership are those who haven’t been to the USA and don’t realize how big it is.\nThe irony is that the passport snob primarily subscribes to the myth of the mind-expanding magic of travel due to his own provincialism.  You may recall the attempt of The Prince of Wängst to label me, a multi-passport multi-lingual, expatriate who studied in Japan, as “provincial”.  This was more than a little amusing given Mr. Bakker’s literally provincial existence, having been born in Ontario, educated in Ontario, and presently residing in, you guessed it, Ontario.  Even more amusing was the example I have previously related of the self-appointed Canadian Euro-sophisticate from Quebec.  He was happily occupied with lecturing Spacebunny and I on the near-European nature of Montreal and how it compared so very favorably to the Minnesota peasantry at the party we were attending when his fiance joined the conversation.  And he was visibly put out to discover we had flown in that very morning from either Zurich or Milano, I don’t recall which.\n“Well, what were you doing there?” he demanded.\nStrangely, he didn’t seem to want to talk to us anymore after he found out we lived in Italy, although we were quite willing to hear more about what a European city Montreal is.  Fascinating stuff.\nThe truth, as those who have not only traveled around the world, but who actually speak different languages and have lived in different cultures for extended periods of time, is that there are far more similarities than differences among the civilized peoples of the world.  The mountain peasants of Italy, the agricultural peasants of France, and the rice paddy peasants of Japan have far more in common with each other and with the rural working class in the Midwest than they do with the Milanese industrial magnates, the banking gnomes of Zurich, the powerful, but self-effacing executives of the great\nkeiretsu\n, or the Wall Street elite.\nAnd neither transnational group has much in common with the angst-laden middle-class would-be intellectuals, whose desperate pretentiousness and feverish pursuit of credentials sets them in a particularly annoying transnational class of their own.  The European ones confide to you how American they feel themselves to be while the American version forever bears the imprint of the semester it spent in [insert European capital].  The Canadian version is either the saddest or the funniest, depending upon your perspective, because it genuinely believes that a semester in Nashville or Iowa City counts as magic travel.\nBut there are interesting things to be learned from every group, in every country.  My soccer teammates are mostly peasants, with one notable exception.  My social acquaintances are mostly petty international class, and my interests tend to most closely resemble the aspirational middle-class intellectuals.  But it is as shallow and ultimately pointless to look down on the rural peasantry for their lack of passports as it is to criticize the rich and powerful for their accounting strategies or the aspirational academics for their insecurities.  Such things are more definitive attributes than correctable actions.\nTravel doesn’t make you a better or more curious person.  It simply presents you with more information.  What you do with that information, and how it effects your thought processes and future behavior, will have more to do with who you already were than any transformative magic courtesy that comes from the possession of a government document.\nFor me, the experience gained from living most of my adult life as an expatriate that has given me a greater respect for the unique nature of historical American society as well as a deeper sorrow for that which Americans have lost.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-10-14T08:33:00+00:00"
}