{
  "url": "https://voxday.net/2011/10/21/week-in-alpha-3/",
  "scraped_at": "2025-12-13T23:25:12.922984",
  "title": "The week in alpha",
  "date_display": "October 21, 2011",
  "date_iso": "2011-10-21T17:00:00+00:00",
  "date_from_url": "2011-10-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This week’s round-up of posts <a href=\"http://alphagameplan.blogspot.com/\">at Alpha Game</a></p><p><i>Stalking the Virgin</i>: Yohami’s amusing glossary of approaches plus the Sigma approach.</p><p><i>It’s not her fault.  It’s not her fault</i>:  In which we are informed that 80% of women involved in car crashes are not responsible.  At least, if you ask them.</p><p><i>The Orbital Leapfrog</i>: A tactic to enable gamma orbiters to land on the planet.  It will usually involve crashing and burning, of course, but even that’s better than remaining in perma-orbit.</p><p><i>Don’t talk to single women</i>: An explanation of why volunteering conversation is usually counterproductive for the interested man and why a refusal to submit to qualification is intrinsically attractive to women.</p><p>Given that we increasingly appear to be living in interesting times, there is no shortage of topics that merit discussion here, so I’m intending to keep my Game-related posts over at Alpha Game.  In unrelated news, I hope to wrap up my part of Round 4 and send it off to Dominic by the end of the weekend.  We’ve both been traveling, hence the delay.</p></div>",
  "content_text": "This week’s round-up of posts\nat Alpha Game\nStalking the Virgin\n: Yohami’s amusing glossary of approaches plus the Sigma approach.\nIt’s not her fault.  It’s not her fault\n:  In which we are informed that 80% of women involved in car crashes are not responsible.  At least, if you ask them.\nThe Orbital Leapfrog\n: A tactic to enable gamma orbiters to land on the planet.  It will usually involve crashing and burning, of course, but even that’s better than remaining in perma-orbit.\nDon’t talk to single women\n: An explanation of why volunteering conversation is usually counterproductive for the interested man and why a refusal to submit to qualification is intrinsically attractive to women.\nGiven that we increasingly appear to be living in interesting times, there is no shortage of topics that merit discussion here, so I’m intending to keep my Game-related posts over at Alpha Game.  In unrelated news, I hope to wrap up my part of Round 4 and send it off to Dominic by the end of the weekend.  We’ve both been traveling, hence the delay.",
  "tags": [
    "Alpha Game"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-10-21T16:00:00+00:00"
}