{
  "url": "https://voxday.net/2011/10/12/what-could-go-wrong-4/",
  "scraped_at": "2025-12-13T23:24:26.194781",
  "title": "What could go wrong?",
  "date_display": "October 12, 2011",
  "date_iso": "2011-10-12T18:53:00+00:00",
  "date_from_url": "2011-10-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some scientists really seem quixotically determined to convince the masses that it is in the best interests of humanity <a href=\"http://www.nytimes.com/2011/10/13/science/13plague.html?hp\">to turn scientist-hunting into a sport</a>:</p><blockquote><p>The bacterium that causes plague, Yersinia pestis, is still highly virulent today but has somewhat different symptoms, leading some historians to doubt that it was the agent of the Black Death.</p><p>Those doubts were laid to rest last year by detection of the bacterium’s DNA in plague victims. With the full genome now in hand, the researchers hope to recreate the microbe itself so as to understand what made the Black Death outbreak so deadly.</p></blockquote><p>Full credit to science for nearly eliminating smallpox and polio.  And I’m sure we all support the efforts to rid the world of cancer.  But <i>recreating the Black Death virus</i> seems like an epically stupid idea.  Of course, a member of the team says “the ancient plague would presumably be susceptible to antibiotics”.  Presumably.  That’s confidence-inspiring.  The universities of the West should really consider making a semester in basic risk/benefit analysis a mandatory requirement for any science major.</p><p>Besides, if scientists are going to recreate something, i think they should bring back the dire wolf and the sabertooth tiger.  Those would be cool and neither used to kill millions of people at a time.</p></div>",
  "content_text": "Some scientists really seem quixotically determined to convince the masses that it is in the best interests of humanity\nto turn scientist-hunting into a sport\n:\nThe bacterium that causes plague, Yersinia pestis, is still highly virulent today but has somewhat different symptoms, leading some historians to doubt that it was the agent of the Black Death.\nThose doubts were laid to rest last year by detection of the bacterium’s DNA in plague victims. With the full genome now in hand, the researchers hope to recreate the microbe itself so as to understand what made the Black Death outbreak so deadly.\nFull credit to science for nearly eliminating smallpox and polio.  And I’m sure we all support the efforts to rid the world of cancer.  But\nrecreating the Black Death virus\nseems like an epically stupid idea.  Of course, a member of the team says “the ancient plague would presumably be susceptible to antibiotics”.  Presumably.  That’s confidence-inspiring.  The universities of the West should really consider making a semester in basic risk/benefit analysis a mandatory requirement for any science major.\nBesides, if scientists are going to recreate something, i think they should bring back the dire wolf and the sabertooth tiger.  Those would be cool and neither used to kill millions of people at a time.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-10-12T17:53:00+00:00"
}