{
  "url": "https://voxday.net/2018/09/03/a-failure-to-learn/",
  "scraped_at": "2025-12-19T21:19:34.890020",
  "title": "A failure to learn",
  "date_display": "September 3, 2018",
  "date_iso": "2018-09-03T14:00:00+00:00",
  "date_from_url": "2018-09-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Wil Wheaton demonstrates that he has <a href=\"http://wilwheaton.net/2018/08/the-world-is-a-terrible-place-right-now-and-thats-largely-because-it-is-what-we-make-it/\">no ability to recognize irony, justice, or karma</a>:</p><blockquote><p>M. A. Murray 31 AUGUST, 2018 AT 12:08 PM<br>I do not hate you. But what’s missing from this post of yours, as is true of so many of your tweets, is any sense of self-awareness. Everything is always something someone else has done to you. You refuse to accept any responsibility yourself for anything. You have, over the years, said terrible things about people you disagreed with politically and about people who supported GamerGate, as but two examples. You have not only participated in the climate of hate you now decry, you have helped foster it yourself. You have helped make the world bad for others, and you have expressed not the tiniest bit of self-reflection or remorse about it.</br></p><p>Charlie Kilo 31 AUGUST, 2018 AT 12:17 PM<br>You left Twitter because they wouldn’t deplatform someone you think is a hater, and are complaining that you got deplatformed from Mastodon by people who think you’re a hater. Did this experience teach you anything?</br></p><p>Wil 31 AUGUST, 2018 AT 12:23 PM<br>Yes. It taught me that people will seek out and create false equivalence to feed their narrative.</br></p></blockquote><p>You see, to the insufficiently enlightened, one deplatforming for being deemed hateful by others is exactly the same as another. But what these social justice-challenged troglodytes fail to take into account is that while one deplatforming happened to Wil Wheaton, <i>the others did not</i>, therefore the equivalence is obviously and necessarily false.</p><p>Meanwhile, John Scalzi continues to blithely pretend that he <a href=\"http://wilwheaton.net/2018/08/the-world-is-a-terrible-place-right-now-and-thats-largely-because-it-is-what-we-make-it/comment-page-7/#comment-195507\">has never heard</a> of this hateful Wil Wheaton unperson….</p><blockquote class=\"tr_bq\"><p>I’ve made a choice not to say anything publicly, because, quite frankly (and I know you don’t want to hear this) I don’t owe anyone anything, no matter how loudly and persistently they demand it. If someone has decided that they are owed my public comment on this, or anything else, and will hate on me because I’m not giving it to them, that’s entirely their choice and their right. It is also my choice and my right to not engage with or respond to random people on the Internet.</p></blockquote><p>Oh, I’m sorry. That was Wil Wheaton explaining why he wasn’t going to say anything about Chris Hardwick, not John Scalzi explaining why he wasn’t going to say anything about Wil Wheaton. It’s just so hard to keep these chinless gamma males straight.</p></div>",
  "content_text": "Wil Wheaton demonstrates that he has\nno ability to recognize irony, justice, or karma\n:\nM. A. Murray 31 AUGUST, 2018 AT 12:08 PM\nI do not hate you. But what’s missing from this post of yours, as is true of so many of your tweets, is any sense of self-awareness. Everything is always something someone else has done to you. You refuse to accept any responsibility yourself for anything. You have, over the years, said terrible things about people you disagreed with politically and about people who supported GamerGate, as but two examples. You have not only participated in the climate of hate you now decry, you have helped foster it yourself. You have helped make the world bad for others, and you have expressed not the tiniest bit of self-reflection or remorse about it.\nCharlie Kilo 31 AUGUST, 2018 AT 12:17 PM\nYou left Twitter because they wouldn’t deplatform someone you think is a hater, and are complaining that you got deplatformed from Mastodon by people who think you’re a hater. Did this experience teach you anything?\nWil 31 AUGUST, 2018 AT 12:23 PM\nYes. It taught me that people will seek out and create false equivalence to feed their narrative.\nYou see, to the insufficiently enlightened, one deplatforming for being deemed hateful by others is exactly the same as another. But what these social justice-challenged troglodytes fail to take into account is that while one deplatforming happened to Wil Wheaton,\nthe others did not\n, therefore the equivalence is obviously and necessarily false.\nMeanwhile, John Scalzi continues to blithely pretend that he\nhas never heard\nof this hateful Wil Wheaton unperson….\nI’ve made a choice not to say anything publicly, because, quite frankly (and I know you don’t want to hear this) I don’t owe anyone anything, no matter how loudly and persistently they demand it. If someone has decided that they are owed my public comment on this, or anything else, and will hate on me because I’m not giving it to them, that’s entirely their choice and their right. It is also my choice and my right to not engage with or respond to random people on the Internet.\nOh, I’m sorry. That was Wil Wheaton explaining why he wasn’t going to say anything about Chris Hardwick, not John Scalzi explaining why he wasn’t going to say anything about Wil Wheaton. It’s just so hard to keep these chinless gamma males straight.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-03T13:00:00+00:00"
}