{
  "url": "https://voxday.net/2018/09/19/arkstream-the-ember-war-campaign/",
  "scraped_at": "2025-12-19T21:21:58.178796",
  "title": "Arkstream: The Ember War campaign",
  "date_display": "September 19, 2018",
  "date_iso": "2018-09-19T07:04:11+00:00",
  "date_from_url": "2018-09-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/ggOYRYIij-4\" width=\"512\"></iframe></div><p>From the transcript <a href=\"https://youtu.be/ggOYRYIij-4\">of the Arkstream</a>:</p><p>I’m  excited about this. We we have another  crowdfunding campaign that’s going  on, that’s been very successful, <a href=\"https://www.indiegogo.com/projects/alt-hero-q/x/19185338#/\">Alt-Hero: Q</a>, some of you are probably already  backing that one, but Ember War is  significant in a different way. It’s  significant because this is the first  time that a major science fiction writer  is doing a comics-related crowdfunding  and so this is potentially quite  significant. Just like the  original Alt-Hero, this is an experiment. The magic of crowdfunding is not that  you can get people to give you a lot of  money if you’re lucky, if you happen to  hit the right sweet spot at the right  time, the magic of crowdfunding is that  it tells you where the demand is ahead  of time.</p><p>And you know, we  weren’t that serious about getting into  comics originally. I’d had people  lobbying me for three years to do it, and  finally I said, “okay fine,  we’ll see if there is genuine demand for it.” As it turned out as you know there  turned out to be ten  times more demand for it than we ever  imagined, and so this is a test, this is an experiment. If you like  military science fiction, if you want to  see more military science fiction turned  into graphic novels, it would be a very,  very good idea to support <a href=\"https://www.indiegogo.com/projects/the-ember-war-graphic-novel/x/19185338#/\">the Ember War campaign</a> even if you’re not familiar  with either Richard Fox or the Ember War Saga. I  don’t think that you’ll be disappointed  because it is a really good story.</p></div>",
  "content_text": "From the transcript\nof the Arkstream\n:\nI’m  excited about this. We we have another  crowdfunding campaign that’s going  on, that’s been very successful,\nAlt-Hero: Q\n, some of you are probably already  backing that one, but Ember War is  significant in a different way. It’s  significant because this is the first  time that a major science fiction writer  is doing a comics-related crowdfunding  and so this is potentially quite  significant. Just like the  original Alt-Hero, this is an experiment. The magic of crowdfunding is not that  you can get people to give you a lot of  money if you’re lucky, if you happen to  hit the right sweet spot at the right  time, the magic of crowdfunding is that  it tells you where the demand is ahead  of time.\nAnd you know, we  weren’t that serious about getting into  comics originally. I’d had people  lobbying me for three years to do it, and  finally I said, “okay fine,  we’ll see if there is genuine demand for it.” As it turned out as you know there  turned out to be ten  times more demand for it than we ever  imagined, and so this is a test, this is an experiment. If you like  military science fiction, if you want to  see more military science fiction turned  into graphic novels, it would be a very,  very good idea to support\nthe Ember War campaign\neven if you’re not familiar  with either Richard Fox or the Ember War Saga. I  don’t think that you’ll be disappointed  because it is a really good story.",
  "tags": [
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-19T06:04:11+00:00"
}