{
  "url": "https://voxday.net/2018/09/26/better-smile-harder-comicsgatenazihaters/",
  "scraped_at": "2025-12-20T05:09:57.701559",
  "title": "Better smile harder, ComicsGateNaziHaters",
  "date_display": "September 26, 2018",
  "date_iso": "2018-09-26T15:32:40+00:00",
  "date_from_url": "2018-09-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SyFyWire isn’t quite sure what ComicsGate is, when it started, or why it started, but they know a) <a href=\"https://www.syfy.com/syfywire/widespread-creator-outcry-wont-be-enough-to-end-comicsgate\">it is Very Bad</a>, and b) Ethan van Sciver and Richard Meyer are ComicsGateNaziHater He-Men Women Harassers.</p><blockquote><p>In the current climate of internet discourse, the latest story of online harassment is always just around the corner. That’s especially true in the comic book industry. If you’ve been following most comic creators during the end of August, then you’ve likely seen the latest developments in the ongoing saga of what’s become known as “Comicsgate.”</p><p>Comicsgate, for those not in the know, is the name of a group of comics readers who believe their beloved medium has been corrupted by political correctness. It is their stated belief that Social Justice Warriors (SJWs, or people with vested interest in women, POC, and members of the LGBTQ community) have infiltrated the comics industry and are simultaneously profiting off of it and destroying it from the inside. In order to combat this invasion, they have taken to their keyboards to harass, dox, and threaten any creator they believe to be a part of the problem.</p><p>The actual timeline of Comicsgate — tracking down where and when it started, who exactly started it, and what the inciting incident may have been — is complicated, to say the least. It may have begun as many as three or four years ago, coinciding with the rise of its mutated brethren Gamergate and the Sad Puppy take over of the Hugos. It may instead have begun when Chelsea Cain completed her run on Marvel’s Mockingbird, or when Heather Antos, formerly an editor at Marvel, posted a photo of herself and other staffers enjoying an evening of milkshakes. We did our best to track the start of this so-called “movement” earlier this year, but wherever you believe it started, Comicsgate has now entered a new chapter. Much to the chagrin of those involved, many of their heroes are now denouncing them altogether.</p><p>In the final week of August, countless comics pros began posting a copied and pasted message to their social media accounts. The message was one of solidarity with marginalized creators who had been experiencing extended harassment, many for more than a year. The message read, “I believe comics are for everyone. There is no excuse for harassment. There is no place for homophobia, transphobia, racism or misogyny in comics criticism.”</p></blockquote><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://www.indiegogo.com/projects/alt-hero-q/x/19185338#/\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" data-original-height=\"512\" data-original-width=\"341\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"https://cdn.idka.com/7ae73849-926e-499e-bc71-8c732c8ba82f\" width=\"212\"/></a></div><p>Whatever. The Evil Legion of Evil is not ComicsGate, we’re not on Twitter or Facebook, and all this back-and-forth online harassment is simply Not Our Problem. We have more important things to do. For one, publishing <a href=\"https://www.amazon.com/Best-Sellers-Books-Superhero-Comics-Graphic-Novels/zgbs/books/3825121/ref=zg_bs_nav_b_4_4393\">three of the top 50</a> bestselling superhero comics and graphic novels. That’s not Kindle either, that’s <i>everything</i>. It’s fascinating to see that some of the print editions are actually outselling the Kindle editions on Amazon, particularly when we know how well they are doing on <a href=\"https://www.aerbook.com/store/castalia/Arkhaven_Comics/7135\">Arkhaven Direct</a>.</p><p>For two, we’re now entering the final stretch of <a href=\"https://www.indiegogo.com/projects/alt-hero-q/x/19185338#/\">the Alt-Hero: Q campaign</a>. Trust the Plan. Join the Win. Get on Board. Crush the SJWs. If you’re still on the fence about this one, today is the time to jump. There are just 17 hours left.</p><p>ComicsGate is making the same mistake as the Sad Puppies and trying to make nice with the SJWs who hate them. But cowering, cringing, and smiling hopefully in an attempt to convey your harmlessness is not going to stop an SJW media swarming any more than wagging its tail will permit a puppy to fend off an attack by a school of ravenous flying piranha.</p><p>UPDATE: <a href=\"https://www.youtube.com/watch?v=RLxPbAkJx4Q\">A rare Brightstream</a> addressing the closing hours of the campaign. Also, I’ll be on with Alex Jones at 1 PM Central.</p></div>",
  "content_text": "SyFyWire isn’t quite sure what ComicsGate is, when it started, or why it started, but they know a)\nit is Very Bad\n, and b) Ethan van Sciver and Richard Meyer are ComicsGateNaziHater He-Men Women Harassers.\nIn the current climate of internet discourse, the latest story of online harassment is always just around the corner. That’s especially true in the comic book industry. If you’ve been following most comic creators during the end of August, then you’ve likely seen the latest developments in the ongoing saga of what’s become known as “Comicsgate.”\nComicsgate, for those not in the know, is the name of a group of comics readers who believe their beloved medium has been corrupted by political correctness. It is their stated belief that Social Justice Warriors (SJWs, or people with vested interest in women, POC, and members of the LGBTQ community) have infiltrated the comics industry and are simultaneously profiting off of it and destroying it from the inside. In order to combat this invasion, they have taken to their keyboards to harass, dox, and threaten any creator they believe to be a part of the problem.\nThe actual timeline of Comicsgate — tracking down where and when it started, who exactly started it, and what the inciting incident may have been — is complicated, to say the least. It may have begun as many as three or four years ago, coinciding with the rise of its mutated brethren Gamergate and the Sad Puppy take over of the Hugos. It may instead have begun when Chelsea Cain completed her run on Marvel’s Mockingbird, or when Heather Antos, formerly an editor at Marvel, posted a photo of herself and other staffers enjoying an evening of milkshakes. We did our best to track the start of this so-called “movement” earlier this year, but wherever you believe it started, Comicsgate has now entered a new chapter. Much to the chagrin of those involved, many of their heroes are now denouncing them altogether.\nIn the final week of August, countless comics pros began posting a copied and pasted message to their social media accounts. The message was one of solidarity with marginalized creators who had been experiencing extended harassment, many for more than a year. The message read, “I believe comics are for everyone. There is no excuse for harassment. There is no place for homophobia, transphobia, racism or misogyny in comics criticism.”\nWhatever. The Evil Legion of Evil is not ComicsGate, we’re not on Twitter or Facebook, and all this back-and-forth online harassment is simply Not Our Problem. We have more important things to do. For one, publishing\nthree of the top 50\nbestselling superhero comics and graphic novels. That’s not Kindle either, that’s\neverything\n. It’s fascinating to see that some of the print editions are actually outselling the Kindle editions on Amazon, particularly when we know how well they are doing on\nArkhaven Direct\n.\nFor two, we’re now entering the final stretch of\nthe Alt-Hero: Q campaign\n. Trust the Plan. Join the Win. Get on Board. Crush the SJWs. If you’re still on the fence about this one, today is the time to jump. There are just 17 hours left.\nComicsGate is making the same mistake as the Sad Puppies and trying to make nice with the SJWs who hate them. But cowering, cringing, and smiling hopefully in an attempt to convey your harmlessness is not going to stop an SJW media swarming any more than wagging its tail will permit a puppy to fend off an attack by a school of ravenous flying piranha.\nUPDATE:\nA rare Brightstream\naddressing the closing hours of the campaign. Also, I’ll be on with Alex Jones at 1 PM Central.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-26T14:32:40+00:00"
}