{
  "url": "https://voxday.net/2018/09/12/boers-out-chinese-in/",
  "scraped_at": "2025-12-19T21:20:55.157937",
  "title": "Boers out, Chinese in",
  "date_display": "September 12, 2018",
  "date_iso": "2018-09-12T12:52:15+00:00",
  "date_from_url": "2018-09-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I expect it won’t be too long before South Africa’s blacks are pining for the good old days of Apartheid. This period of black self-rule <a href=\"https://www.businessinsider.co.za/the-new-coal-power-station-in-limpopo-will-only-be-used-by-the-chinese-heres-why-its-an-irrational-project-2018-9\">appears likely to be more a brief racial interregnum</a> than anything approaching genuine independence.</p><blockquote><p>There has been some confusion in the energy industry this past week after the announcement that a new coal-powered power plant is planned for Limpopo. According to reports, President Cyril Ramaphosa inked a deal with the Chinese to build a new 4,600-megawatt coal power station during his visit to that country.</p><p>This came as a shock, as the brand-new Integrated Resource Plan (IRP) does not include any new coal-fired power plants. It has since emerged that the planned new power plant, called the “Power China International Energy Project”, won’t produce electricity for South African households and business – it will only be used for a massive new Chinese-controlled industrial park.</p><p>Earlier this year, nine Chinese companies committed to invest $10 billion in the Musina-Makhado special economic zone at a signing ceremony in Beijing.</p></blockquote><p>Meanwhile, the remaining white South Africans are wondering if they should fight or flee. A South African reader writes:</p><blockquote><p>The previous president (Zuma) was ousted amidst a cloud of corruption, and there are currently parliamentary enquiries into “state capture” by Zuma, his cronies and his super-rich Indian friends the Guptas, including a shady nuclear power deal with the Russians. Even the white South Africans managed to have mass protests against Zuma, and they were all overjoyed when he was replaced with Ramaphosa. Ramaphosa made millions in business – crony capitalism, one suspects – since 1994, and was part owner of the Marikana mine where striking miners were killed by the police a few years ago. Obviously, whites thought he was a coconut and would save them.</p><p>But since coming into power, Ramaphosa has been all about expropriating without compensation land from whites, and borrowing like mad from the Chinese. Now every white I speak with will say Zuma was a thief and Ramaphosa is a communist selling his land to the Chinese, but barely any will say – if they even realise – that identity politics cares about them, even if they don’t care about identity politics. The rainbow nation non-racial cuckery runs deep in way too many. Whites keep thinking that all South Africans should care about all other South Africans, while the other tribes think whites should pay.</p><p>I’ve also seen first hand how the Chinese operate, having worked abroad on a Chinese operated plant. The owners of the plant and their employees cannot operate the plant, nor maintain it. Everything is done by the Chinese contractors, whose ability to speak English diminishes the more you ask them for information and training. They have the plant owners held hostage, because if they lose the contract they go back to China with all the knowledge and skills required to run this billion dollar project.</p><p>Lastly, of those white men who acknowledge racial war in South Africa is imminent, they almost all seem to be in favour of fighting. But I also suspect that 99 percent of them are just <i>windgat </i>– loud-mouths who are more bark than bite. I’m torn between the wisdom of running away to a whiter, safer country with my family; and saying “if you just keep running away, eventually there’ll be no place left to run to” and staying to fight. I’m sure the latter is correct, but some positions just aren’t defensible, and South Africa is probably not viable for whites absent balkanisation. Emigration is almost certainly the wise option, but I also know it’s not feasible for all four or five million whites.</p></blockquote><p>It’s probably too late to fight now. The time for the white South Africans to fight was when they still had nukes and control of the army, not when they have no nukes, no army, and the Chinese have decided to colonize the land. At this point, the Boers wouldn’t just be fighting the ANC, they’d be fighting the Chinese Red Army defending its very material investments in China’s new colony-to-be.</p><p>The problem, of course, is that who would want the white South African emigrants? They have proven to be wholly undesirable in any democracy; look at how they celebrated the accession of Ramaphosa to power. Even <i>after </i>losing their own country, they are reliably proving to be more foolish on matters of race and ethnicity than the average white American Democrat, who at least still has the sense to try to keep his children out of vibrant neighborhoods and school districts.</p><p>Lest you doubt the Chinese are <a href=\"https://bulawayo24.com/index-id-news-sc-national-byo-143959.html\">serious about colonizing Africa</a>:</p><blockquote class=\"tr_bq\"><p>In what all but amounts to turning Harare into a satellite outpost of Beijing, China has reportedly deployed and installed a dreaded new generation of surface-to- air missiles (SAM) in Zimbabwe, in what is seen as direct preparation for defending her vast economic interests in the country, with a possible signal of ratcheting up future gunboat diplomacy against the competing West.</p></blockquote><p>The irony is that the same white idiots who complained about white imperialism and Sun City are going to declare that the white man has an obligation to rescue the black man from the yellow man. But the white man has laid down his burden and he no longer has the ability to shoulder it.</p></div>",
  "content_text": "I expect it won’t be too long before South Africa’s blacks are pining for the good old days of Apartheid. This period of black self-rule\nappears likely to be more a brief racial interregnum\nthan anything approaching genuine independence.\nThere has been some confusion in the energy industry this past week after the announcement that a new coal-powered power plant is planned for Limpopo. According to reports, President Cyril Ramaphosa inked a deal with the Chinese to build a new 4,600-megawatt coal power station during his visit to that country.\nThis came as a shock, as the brand-new Integrated Resource Plan (IRP) does not include any new coal-fired power plants. It has since emerged that the planned new power plant, called the “Power China International Energy Project”, won’t produce electricity for South African households and business – it will only be used for a massive new Chinese-controlled industrial park.\nEarlier this year, nine Chinese companies committed to invest $10 billion in the Musina-Makhado special economic zone at a signing ceremony in Beijing.\nMeanwhile, the remaining white South Africans are wondering if they should fight or flee. A South African reader writes:\nThe previous president (Zuma) was ousted amidst a cloud of corruption, and there are currently parliamentary enquiries into “state capture” by Zuma, his cronies and his super-rich Indian friends the Guptas, including a shady nuclear power deal with the Russians. Even the white South Africans managed to have mass protests against Zuma, and they were all overjoyed when he was replaced with Ramaphosa. Ramaphosa made millions in business – crony capitalism, one suspects – since 1994, and was part owner of the Marikana mine where striking miners were killed by the police a few years ago. Obviously, whites thought he was a coconut and would save them.\nBut since coming into power, Ramaphosa has been all about expropriating without compensation land from whites, and borrowing like mad from the Chinese. Now every white I speak with will say Zuma was a thief and Ramaphosa is a communist selling his land to the Chinese, but barely any will say – if they even realise – that identity politics cares about them, even if they don’t care about identity politics. The rainbow nation non-racial cuckery runs deep in way too many. Whites keep thinking that all South Africans should care about all other South Africans, while the other tribes think whites should pay.\nI’ve also seen first hand how the Chinese operate, having worked abroad on a Chinese operated plant. The owners of the plant and their employees cannot operate the plant, nor maintain it. Everything is done by the Chinese contractors, whose ability to speak English diminishes the more you ask them for information and training. They have the plant owners held hostage, because if they lose the contract they go back to China with all the knowledge and skills required to run this billion dollar project.\nLastly, of those white men who acknowledge racial war in South Africa is imminent, they almost all seem to be in favour of fighting. But I also suspect that 99 percent of them are just\nwindgat\n– loud-mouths who are more bark than bite. I’m torn between the wisdom of running away to a whiter, safer country with my family; and saying “if you just keep running away, eventually there’ll be no place left to run to” and staying to fight. I’m sure the latter is correct, but some positions just aren’t defensible, and South Africa is probably not viable for whites absent balkanisation. Emigration is almost certainly the wise option, but I also know it’s not feasible for all four or five million whites.\nIt’s probably too late to fight now. The time for the white South Africans to fight was when they still had nukes and control of the army, not when they have no nukes, no army, and the Chinese have decided to colonize the land. At this point, the Boers wouldn’t just be fighting the ANC, they’d be fighting the Chinese Red Army defending its very material investments in China’s new colony-to-be.\nThe problem, of course, is that who would want the white South African emigrants? They have proven to be wholly undesirable in any democracy; look at how they celebrated the accession of Ramaphosa to power. Even\nafter\nlosing their own country, they are reliably proving to be more foolish on matters of race and ethnicity than the average white American Democrat, who at least still has the sense to try to keep his children out of vibrant neighborhoods and school districts.\nLest you doubt the Chinese are\nserious about colonizing Africa\n:\nIn what all but amounts to turning Harare into a satellite outpost of Beijing, China has reportedly deployed and installed a dreaded new generation of surface-to- air missiles (SAM) in Zimbabwe, in what is seen as direct preparation for defending her vast economic interests in the country, with a possible signal of ratcheting up future gunboat diplomacy against the competing West.\nThe irony is that the same white idiots who complained about white imperialism and Sun City are going to declare that the white man has an obligation to rescue the black man from the yellow man. But the white man has laid down his burden and he no longer has the ability to shoulder it.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-12T11:52:15+00:00"
}