{
  "url": "https://voxday.net/2018/09/24/darkstream-amazon-revives-gun-ghoul/",
  "scraped_at": "2025-12-19T21:22:47.804238",
  "title": "Darkstream: Amazon revives Gun Ghoul",
  "date_display": "September 24, 2018",
  "date_iso": "2018-09-24T12:24:34+00:00",
  "date_from_url": "2018-09-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/J9FwABFNgvI\" width=\"512\"></iframe></div><div style=\"text-align: center;\"></div><div style=\"text-align: left;\"><b>From the transcript <a href=\"https://youtu.be/J9FwABFNgvI\">of the Darkstream</a>:</b></div><p>The thing that you have to understand  here is that this can happen to anyone. SJWs <i>will </i>abuse their positions if  given the opportunity. Once you become a target, for whatever  reason, however harmless you are, however harmless you believe  yourself to be, however moderate you  believe yourself to be, they will attempt  to monkeywrench. It’s guaranteed, and  again, it’s not just people like me, you know, actually, someone like me  doesn’t get attacked that much because  the SJWs know perfectly well that I’m  not going to give in to them. I will actually go to the  trouble of doing the exact opposite  simply because I’m not willing to let  myself be manipulated by them, but if you  look at what’s happening with the Linux  kernel….</p><p>Now, we all thought that  the Linux kernel was unassailable  because Linus Torvalds had established  such a ruthless meritocracy, with no  respect for feelings whatsoever. Now, suddenly, what we’re seeing is that  thanks to the cancer known as Coraline, SJWs have managed to successfully  oust Linus and they’ve managed to  establish a code of conduct that they’ve <i>already </i>weaponized. They’re <i>already </i>using it to go after non-SJWs and try to eject them  from positions of influence within the  project, and so, you know, you have to  understand that this is not a figment of  my imagination!</p><p>I wrote about this back  in 2015. Nothing has changed. I even specifically  warned about this in <i><b><a href=\"https://aerbook.com/maker/productcard-3528271-1875.html\">SJWs Always Double Down</a></b></i>, I <i>specifically</i> warned of the danger of  codes of conduct and about this Coraline creature. Specifically! And  now we’re seeing Linux, of all things, being converged, and you see people like Roosh whose  books have been under attack, and the thing is that virtue-signaling and trying to get  back in their good graces like we’re  seeing some of the ComicsGate people do is not going to work. It’s not going to work because it’s not  about you, it’s about them! They <i>need </i>to  be oppositional. You know, once they have  you as a target, you are of use to them, and if you are a target who is willing  to virtue signal, what you’re doing is  you’re painting a target on your chest. You’re not signaling <i>virtue </i>to them to  them you’re signaling <i>weakness </i>and  they’re going to keep pushing at it and  they’re going to keep coming after it.</p><p><a name=\"more\"></a><br><b>In the Darkstream, we also discussed the optimal timing of the next major Arkhaven campaign, which will be for a new series totally unrelated to Alt-Hero or any of our existing comics. This comment by a strong ComicsGate supporter was informative.</b></br></p><p><i>The indigogo fatigue is real, I started feeling it a few weeks ago. I’ve backed 19 of the indigogo comics so far though so perhaps that has something to do with it. I remember watching Mike S Millers stream some months ago where he interviewed a friend/colleague who recommended against launching close to: tax time and both before and after christmas. Like you said Vox, most people want their gifts in time for xmas and probably would be broke afterwards due to paying off credit cards. I live in Australia so I am unware of tax time for Americans and Euros. I’d say Feb-Nov would be a safe bet for indigogo campaigns, taking into account regional tax periods. </i><br><i><br/></i><i>Quarterly campaigns (4 times a year) also seem like a safe bet. Though apparently launching a fresh campaign while leaving another uncompleted or unfulfilled is a big crowd-funding “no no”. Several Comicsgaters chided Diversity and Comics for launching Iron Sights whilst leaving Jawbreakers unfulfilled. However this may not apply to you as you have a history of fulfilling campaigns and Arkhaven has already a reputation for providing its products.</i><br><i><br/></i>Share your thoughts, especially if you’re an Alt-Hero backer. We’re well aware of the fatigue aspect; it hasn’t escaped our attention that AH:Q has about half the number of backers that the original AH did. Keep in mind that for us a) these campaigns are as much to test the strength of the demand as to raise the resources required, and, b) we have different art teams on the different series, so there is no impact whatsoever on the speed with which the current projects are being completed.</br></br></p><p>That being said, I’m leaning towards mid-January at the soonest. I just don’t see how it would be a good idea to do anything before then and we’d like to see <a href=\"https://www.indiegogo.com/projects/alt-hero-q/x/19185338#/\">Alt★Hero: Q</a> finish strong. Plus, waiting will give us more time to put together some truly killer campaign resources.</p></div>",
  "content_text": "From the transcript\nof the Darkstream\n:\nThe thing that you have to understand  here is that this can happen to anyone. SJWs\nwill\nabuse their positions if  given the opportunity. Once you become a target, for whatever  reason, however harmless you are, however harmless you believe  yourself to be, however moderate you  believe yourself to be, they will attempt  to monkeywrench. It’s guaranteed, and  again, it’s not just people like me, you know, actually, someone like me  doesn’t get attacked that much because  the SJWs know perfectly well that I’m  not going to give in to them. I will actually go to the  trouble of doing the exact opposite  simply because I’m not willing to let  myself be manipulated by them, but if you  look at what’s happening with the Linux  kernel….\nNow, we all thought that  the Linux kernel was unassailable  because Linus Torvalds had established  such a ruthless meritocracy, with no  respect for feelings whatsoever. Now, suddenly, what we’re seeing is that  thanks to the cancer known as Coraline, SJWs have managed to successfully  oust Linus and they’ve managed to  establish a code of conduct that they’ve\nalready\nweaponized. They’re\nalready\nusing it to go after non-SJWs and try to eject them  from positions of influence within the  project, and so, you know, you have to  understand that this is not a figment of  my imagination!\nI wrote about this back  in 2015. Nothing has changed. I even specifically  warned about this in\nSJWs Always Double Down\n, I\nspecifically\nwarned of the danger of  codes of conduct and about this Coraline creature. Specifically! And  now we’re seeing Linux, of all things, being converged, and you see people like Roosh whose  books have been under attack, and the thing is that virtue-signaling and trying to get  back in their good graces like we’re  seeing some of the ComicsGate people do is not going to work. It’s not going to work because it’s not  about you, it’s about them! They\nneed\nto  be oppositional. You know, once they have  you as a target, you are of use to them, and if you are a target who is willing  to virtue signal, what you’re doing is  you’re painting a target on your chest. You’re not signaling\nvirtue\nto them to  them you’re signaling\nweakness\nand  they’re going to keep pushing at it and  they’re going to keep coming after it.\nIn the Darkstream, we also discussed the optimal timing of the next major Arkhaven campaign, which will be for a new series totally unrelated to Alt-Hero or any of our existing comics. This comment by a strong ComicsGate supporter was informative.\nThe indigogo fatigue is real, I started feeling it a few weeks ago. I’ve backed 19 of the indigogo comics so far though so perhaps that has something to do with it. I remember watching Mike S Millers stream some months ago where he interviewed a friend/colleague who recommended against launching close to: tax time and both before and after christmas. Like you said Vox, most people want their gifts in time for xmas and probably would be broke afterwards due to paying off credit cards. I live in Australia so I am unware of tax time for Americans and Euros. I’d say Feb-Nov would be a safe bet for indigogo campaigns, taking into account regional tax periods.\nQuarterly campaigns (4 times a year) also seem like a safe bet. Though apparently launching a fresh campaign while leaving another uncompleted or unfulfilled is a big crowd-funding “no no”. Several Comicsgaters chided Diversity and Comics for launching Iron Sights whilst leaving Jawbreakers unfulfilled. However this may not apply to you as you have a history of fulfilling campaigns and Arkhaven has already a reputation for providing its products.\nShare your thoughts, especially if you’re an Alt-Hero backer. We’re well aware of the fatigue aspect; it hasn’t escaped our attention that AH:Q has about half the number of backers that the original AH did. Keep in mind that for us a) these campaigns are as much to test the strength of the demand as to raise the resources required, and, b) we have different art teams on the different series, so there is no impact whatsoever on the speed with which the current projects are being completed.\nThat being said, I’m leaning towards mid-January at the soonest. I just don’t see how it would be a good idea to do anything before then and we’d like to see\nAlt★Hero: Q\nfinish strong. Plus, waiting will give us more time to put together some truly killer campaign resources.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-24T11:24:34+00:00"
}