{
  "url": "https://voxday.net/2018/09/29/darkstream-disney-suicides-star-wars/",
  "scraped_at": "2025-12-20T05:10:28.275128",
  "title": "Darkstream: Disney suicides Star Wars",
  "date_display": "September 29, 2018",
  "date_iso": "2018-09-29T15:39:15+00:00",
  "date_from_url": "2018-09-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/j5Fz_0qFAPs\" width=\"512\"></iframe></div><div style=\"text-align: left;\"><i>From the transcript <a href=\"https://www.youtube.com/watch?v=j5Fz_0qFAPs\">of the Darkstream</a>:</i></div><p>So there was very, very  disappointing news for <i>Star Wars</i> fans  today just a few hours ago. <i>Variety </i>and  some other entertainment news sources  reported that the woman who is primarily  responsible for the destruction of the <i>Star Wars</i> franchise, the ongoing  destruction of the <i>Star Wars</i> franchise, has actually been signed to a three-year  contract with Disney and apparently is  still going to be in charge of the<i> Star  Wars</i> movies. Now, I personally think this  is fantastic news, I think this is  wonderful news, because it means that  there is a tremendous opportunity out  there for those of us who are creating  alternatives. If you look  at what has been done with <i>Galaxy’s Edge</i>, if you look at what we are in the  process of doing with <i>Faraway Wars</i>, if  you look at a lot of the other stuff  that people are doing in a similar vein, this is an excellent opportunity for the <i>Star Wars</i> fans to find better and more worthy  alternatives because it is now very, very  clear that Disney is not going to fix  what George Lucas broke.</p><p>In fact Disney  is going to continue to make it worse. Disney is going to make <i>Star Wars</i> even more converged than it is. You might not think it’s  possible, but believe me it is. There’s a  good question, “Vox, why do they ruin  everything?” They ruin everything because they don’t understand  anything. You have to understand that  culture and technology and art, all of  these things, are black boxes to SJWs. They do not understand what they are,  they don’t understand how they work, they  don’t understand the nature of their  appeal to other people. SJWs are essentially cargo cultists.</p><p><i>On a related note, <a href=\"http://www.scifiwright.com/2018/09/the-last-straw-11-nonfight-at-the-escape-proof-hideout/#more-21666\">John C. Wright provides some characteristically insightful observations</a> in his ongoing critique of the latest generation of Star Wars movies:</i></p><blockquote><p>The reason why I argue that this is objectively bad, mechanically bad, and not just a plot twist that happens not to please me is this:</p><p>There are three components to any criticism of art. One is to look at the mechanics of the art form, regardless of content. That is an objective matter. The poem either has fourteen rhyming lines or does not; if it is a thirteen line poem, or blank verse, good bad or indifferent, it is not a sonnet. The next component is a judgement call: did the artist achieve the effect he was attempting? Was the audience moved as he was trying to move them? The final is subjective reaction: did I like it? And why did I?</p><p>It is often said in the modern day that beauty is in the eye of the beholder, which, in effect, says there is only one component to criticism: the subjective one. Nonsense. A fair-minded critic could, for example, be no fan of horror movies, or even dislike the whole genre, and still be able to tell John Carpenter’s HALLOWEEN is well-made horror movie and Ed Wood’s PLAN NINE FROM OUTER SPACE is not. More to the point, he could tell that MY FAIR LADY is not a horror movie at all.</p><p>In this case, in story telling of any kind, in film or print, any plot point needs set up and follow through if it is to be emotionally satisfying.</p><p>Example: The set up for a character like Rick Blaine in CASABLANCA, or Han Solo in STAR WARS, who at first wants no part of the fight is to have him show his reluctance. Hence the scene in CASABLANCA where Rick looks on indifferently as Ugarte is arrested and executed; hence the line in STAR WARS where Han will not stir a foot to rescue the princess until he is reassured that she is rich. That is the set up. The follow through is the about-face: when Rick sends away the woman he loves, despite the personal cost to him, or when Han returns unexpectedly to swoop out of the sun and blast Vader’s pursuit-ship as it is closing in on Luke for the kill.</p><p>In this case, we saw the set up for Finn’s reluctance in this last film and in this one. He attempts to steal an escape pod, and is zoinked by a zoink-dwarf with a zoink-wand. The follow-through was the about-face and the noble sacrifice to save his friends. Except that the suicide run is said over the radio to be in vain: a pointless gesture. Either Finn would have destroyed the gun by ramming it, or not. If not, it is not a real about-face. It is just a wasted character trying to waste himself to escape this wasteland of a film. But if it would have worked, preventing the sacrifice (at the sacrifice of everyone else) prevents any follow-through on the character arc: he is still, through no fault of his own, back where Rick and Han started out.</p><p>Good, bad or indifferent is another matter. Whether you personally liked it or not is another matter. On an objective level, having an event that robs all the meaning out of the set up event, and then leads nowhere to nothing, is a mechanical error in story telling. Story telling consists of telling about meaningful events, not meaningless ones. Even if you want to tell a nihilistic story, whose point is that life is pointless, the story itself must be told in a pointed way, and the events in the story must be meaningful in order to carry the message to the audience, even if that message says that meaning is illusion.</p><p>Basically, the story telling is objectively bad when the character in a drama loses all dramatic potential. There is no more story here. What is our Token Stormtrooper now? He is a hero who fails to be heroic. No chance to try again was given, not in this film. If the self-centered cynic, like Han Solo or Rick Blaine, has a certain romantic glamor to him, a cool self-possession. But a flunked suicide? What has he got? He is neither selfish nor selfless. He has no personality at all. The character becomes nothing.</p></blockquote></div>",
  "content_text": "From the transcript\nof the Darkstream\n:\nSo there was very, very  disappointing news for\nStar Wars\nfans  today just a few hours ago.\nVariety\nand  some other entertainment news sources  reported that the woman who is primarily  responsible for the destruction of the\nStar Wars\nfranchise, the ongoing  destruction of the\nStar Wars\nfranchise, has actually been signed to a three-year  contract with Disney and apparently is  still going to be in charge of the\nStar  Wars\nmovies. Now, I personally think this  is fantastic news, I think this is  wonderful news, because it means that  there is a tremendous opportunity out  there for those of us who are creating  alternatives. If you look  at what has been done with\nGalaxy’s Edge\n, if you look at what we are in the  process of doing with\nFaraway Wars\n, if  you look at a lot of the other stuff  that people are doing in a similar vein, this is an excellent opportunity for the\nStar Wars\nfans to find better and more worthy  alternatives because it is now very, very  clear that Disney is not going to fix  what George Lucas broke.\nIn fact Disney  is going to continue to make it worse. Disney is going to make\nStar Wars\neven more converged than it is. You might not think it’s  possible, but believe me it is. There’s a  good question, “Vox, why do they ruin  everything?” They ruin everything because they don’t understand  anything. You have to understand that  culture and technology and art, all of  these things, are black boxes to SJWs. They do not understand what they are,  they don’t understand how they work, they  don’t understand the nature of their  appeal to other people. SJWs are essentially cargo cultists.\nOn a related note,\nJohn C. Wright provides some characteristically insightful observations\nin his ongoing critique of the latest generation of Star Wars movies:\nThe reason why I argue that this is objectively bad, mechanically bad, and not just a plot twist that happens not to please me is this:\nThere are three components to any criticism of art. One is to look at the mechanics of the art form, regardless of content. That is an objective matter. The poem either has fourteen rhyming lines or does not; if it is a thirteen line poem, or blank verse, good bad or indifferent, it is not a sonnet. The next component is a judgement call: did the artist achieve the effect he was attempting? Was the audience moved as he was trying to move them? The final is subjective reaction: did I like it? And why did I?\nIt is often said in the modern day that beauty is in the eye of the beholder, which, in effect, says there is only one component to criticism: the subjective one. Nonsense. A fair-minded critic could, for example, be no fan of horror movies, or even dislike the whole genre, and still be able to tell John Carpenter’s HALLOWEEN is well-made horror movie and Ed Wood’s PLAN NINE FROM OUTER SPACE is not. More to the point, he could tell that MY FAIR LADY is not a horror movie at all.\nIn this case, in story telling of any kind, in film or print, any plot point needs set up and follow through if it is to be emotionally satisfying.\nExample: The set up for a character like Rick Blaine in CASABLANCA, or Han Solo in STAR WARS, who at first wants no part of the fight is to have him show his reluctance. Hence the scene in CASABLANCA where Rick looks on indifferently as Ugarte is arrested and executed; hence the line in STAR WARS where Han will not stir a foot to rescue the princess until he is reassured that she is rich. That is the set up. The follow through is the about-face: when Rick sends away the woman he loves, despite the personal cost to him, or when Han returns unexpectedly to swoop out of the sun and blast Vader’s pursuit-ship as it is closing in on Luke for the kill.\nIn this case, we saw the set up for Finn’s reluctance in this last film and in this one. He attempts to steal an escape pod, and is zoinked by a zoink-dwarf with a zoink-wand. The follow-through was the about-face and the noble sacrifice to save his friends. Except that the suicide run is said over the radio to be in vain: a pointless gesture. Either Finn would have destroyed the gun by ramming it, or not. If not, it is not a real about-face. It is just a wasted character trying to waste himself to escape this wasteland of a film. But if it would have worked, preventing the sacrifice (at the sacrifice of everyone else) prevents any follow-through on the character arc: he is still, through no fault of his own, back where Rick and Han started out.\nGood, bad or indifferent is another matter. Whether you personally liked it or not is another matter. On an objective level, having an event that robs all the meaning out of the set up event, and then leads nowhere to nothing, is a mechanical error in story telling. Story telling consists of telling about meaningful events, not meaningless ones. Even if you want to tell a nihilistic story, whose point is that life is pointless, the story itself must be told in a pointed way, and the events in the story must be meaningful in order to carry the message to the audience, even if that message says that meaning is illusion.\nBasically, the story telling is objectively bad when the character in a drama loses all dramatic potential. There is no more story here. What is our Token Stormtrooper now? He is a hero who fails to be heroic. No chance to try again was given, not in this film. If the self-centered cynic, like Han Solo or Rick Blaine, has a certain romantic glamor to him, a cool self-possession. But a flunked suicide? What has he got? He is neither selfish nor selfless. He has no personality at all. The character becomes nothing.",
  "tags": [
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-29T14:39:15+00:00"
}