{
  "url": "https://voxday.net/2018/09/21/darkstream-no-blue-wave-in-2018/",
  "scraped_at": "2025-12-19T21:22:16.648372",
  "title": "Darkstream: No “Blue Wave” in 2018",
  "date_display": "September 21, 2018",
  "date_iso": "2018-09-21T12:07:21+00:00",
  "date_from_url": "2018-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/A-DDAuPd9bo\" width=\"512\"></iframe></div><p>From the transcript <a href=\"https://www.youtube.com/watch?v=A-DDAuPd9bo\">of the Darkstream</a>:</p><p>These diversity candidates  that are very hard left are  completely unappealing to white  Democrats across the country. White Democrats are gradually beginning  to wake up to the fact that their party  has no use for them, that their party  actually hates them and it’s definitely  not going to govern in their interest, and so if you look at if you look at  what the media is trying to do, what they’re  trying to claim, it’s very clear that  their narrative is entirely false. In  fact, it would not surprise me in the  slightest if not only was there not a  blue wave, it wouldn’t surprise me in the  slightest if Republicans considerably  overperformed again, especially because  we’re starting to see the early  indications of that. In Texas there was just a  special election for Congress, it was a  seat that’s been held by Democrats for  139 years and it went for Hillary by  something like 12 points, and it just  went Republican.</p><p>Now can you imagine  what would happen how the media would  report it if a seat that had been  Republican for 139 years, that Donald  Trump had won by 12 points, suddenly  turned Democrat? You know we’d be hearing, “oh this is this is absolute proof the  blue wave is inevitable” and so forth, but where we actually have what may be reliable  information, we actually have the  actual evidence – it is scanty – but what there  is actually indicates that <i>if</i> there is a  wave, it’s going to be <i>in the Republican’s  favor, </i>especially when you look at the  generic party identification where the Republican  identification has actually increased by  a point and the Democratic  identification has fallen by four points. That’s a five-point swing right there,  and so you know when you look at the  actual situation instead of the fake  polls and the fake news pushed by the  SJW media, you immediately see that the  situation is not at all what they think  it is. It’s not at all what  they claim it to be.</p><p>And so what people  need to stop doing is stop paying  attention to people who have reliably  proved themselves to be unreliable. I can’t tell you how many  people on the blog say “oh I’m  worried about this, I’m concerned about  that.” You know, you’re actually  working towards making what you fear  happen. Why are you needlessly,  pointlessly, <i>groundlessly </i>demoralizing  people when all the actual evidence is  actually quite positive in the in the  short-term political sense?</p><p>Somebody  points out we were told down-ballot  Republicans were all going to lose in  2016 and Trump would cause Republicans  to lose Congress. Did that happen? No, the  exact opposite happened and the same  thing is going to be true in 2018. Look, I’ve been predicting a Trumpslide  in 2020. There was not a Trumpslide in  2016, Trump won but it was relatively  close. So how are we going to get from a  narrow victory in 2016 to a Trumpslide  in 2020 with Democrats over performing  in 2018? That’s not going to  happen, but the Trumpslide is going to  happen, and so I think that it is is very, very obvious that the media narrative is  false and the Republican doomsayers are  wrong again.</p></div>",
  "content_text": "From the transcript\nof the Darkstream\n:\nThese diversity candidates  that are very hard left are  completely unappealing to white  Democrats across the country. White Democrats are gradually beginning  to wake up to the fact that their party  has no use for them, that their party  actually hates them and it’s definitely  not going to govern in their interest, and so if you look at if you look at  what the media is trying to do, what they’re  trying to claim, it’s very clear that  their narrative is entirely false. In  fact, it would not surprise me in the  slightest if not only was there not a  blue wave, it wouldn’t surprise me in the  slightest if Republicans considerably  overperformed again, especially because  we’re starting to see the early  indications of that. In Texas there was just a  special election for Congress, it was a  seat that’s been held by Democrats for  139 years and it went for Hillary by  something like 12 points, and it just  went Republican.\nNow can you imagine  what would happen how the media would  report it if a seat that had been  Republican for 139 years, that Donald  Trump had won by 12 points, suddenly  turned Democrat? You know we’d be hearing, “oh this is this is absolute proof the  blue wave is inevitable” and so forth, but where we actually have what may be reliable  information, we actually have the  actual evidence – it is scanty – but what there  is actually indicates that\nif\nthere is a  wave, it’s going to be\nin the Republican’s  favor,\nespecially when you look at the  generic party identification where the Republican  identification has actually increased by  a point and the Democratic  identification has fallen by four points. That’s a five-point swing right there,  and so you know when you look at the  actual situation instead of the fake  polls and the fake news pushed by the  SJW media, you immediately see that the  situation is not at all what they think  it is. It’s not at all what  they claim it to be.\nAnd so what people  need to stop doing is stop paying  attention to people who have reliably  proved themselves to be unreliable. I can’t tell you how many  people on the blog say “oh I’m  worried about this, I’m concerned about  that.” You know, you’re actually  working towards making what you fear  happen. Why are you needlessly,  pointlessly,\ngroundlessly\ndemoralizing  people when all the actual evidence is  actually quite positive in the in the  short-term political sense?\nSomebody  points out we were told down-ballot  Republicans were all going to lose in  2016 and Trump would cause Republicans  to lose Congress. Did that happen? No, the  exact opposite happened and the same  thing is going to be true in 2018. Look, I’ve been predicting a Trumpslide  in 2020. There was not a Trumpslide in  2016, Trump won but it was relatively  close. So how are we going to get from a  narrow victory in 2016 to a Trumpslide  in 2020 with Democrats over performing  in 2018? That’s not going to  happen, but the Trumpslide is going to  happen, and so I think that it is is very, very obvious that the media narrative is  false and the Republican doomsayers are  wrong again.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-21T11:07:21+00:00"
}