{
  "url": "https://voxday.net/2018/09/10/darkstream-the-concept-of-the-right-wing-sjw/",
  "scraped_at": "2025-12-19T21:20:42.252279",
  "title": "Darkstream: the concept of the “right-wing” SJW",
  "date_display": "September 10, 2018",
  "date_iso": "2018-09-10T15:18:01+00:00",
  "date_from_url": "2018-09-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/_SdBasANBSI\" width=\"512\"></iframe></div><p>From the transcript <a href=\"https://youtu.be/_SdBasANBSI\">of the Darkstream</a>:</p><p>I don’t know what “right-wing SJW” signals to you but what it  signals to me is that the person who is  talking does not understand what an SJW is. They do not understand that social  justice actually <i>means something</i>. You  know, it is a complete oxymoron. To use the term “right-wing SJW” is  every bit as nonsensical as the term “right-wing communist”; there <i>are </i>no right-wing communists. Now, you can argue  all you want about the Nazis being  right-wing or left-wing; I think it’s  very obvious that the National Socialist  German Workers Party was, like all  socialist parties, like all workers parties, a party of the Left. I studied  their ideology, and if you go over the 21  points of the Munich Manifesto, you can  see that the National Socialists were  considerably  to the left of the American Democrats. That’s why it’s always been totally  absurd to claim that Republicans or libertarians are Nazis, but there is enough common confusion on  that score that you can understand where  it happens.</p><p>And yet, you never see the  same thing happen with communists, and  nobody ever says, “oh, well, you <i>right-wing communists</i>“, and so it’s  interesting to me to hear about that, especially in  this recent run-in with the  self-proclaimed moderates in the comics  industry.  More than a few of them  accused us, and me a particular, of being  a quote <i>right-wing SJW</i> unquote, but if  you understand what SJW stands for, if  you understand what social justice is, then you realize that it’s the same as saying you’re a right-wing/left-wing warrior.</p><p>It’s intrinsically nonsensical, and let  me explain for those of you who have not  read <i><b><a href=\"https://aerbook.com/maker/productcard-2687712-1875.html\">SJWS ALWAYS LIE</a></b></i>, which is, as even  people who don’t like me very much will  tell you, the go-to book on the subject. Social justice is about the convergence  of all individuals and institutions  towards what they consider to be the maximum possible  justice for everyone,  and so “social justice  warrior” does not refer to tactics, it does not refer to techniques, it  refers to <i>objectives</i>. And the objectives  of the SJW are absolutely antithetical to  the right wing in general, and to right-wing extremists in particular</p><p>Alot of people don’t  realize that the concept of social  justice goes back to the 1800s. That’s  right. A commenter said <i>social justice is socialist justice</i>. Many figures on the right have condemned  it, probably the best example being  Friedrich von Hayek. He wrote a really  good essay on the subject back in 1971, so this is all  going back much further than most people  realize, and what we’re seeing in the SJWs today is really just the ultimate  realization of what John Stuart Mill was  advocating back in, whatever it was, 1851. So if you look at what social justice stands for, it stands for the very things that we’re now seeing from the tech companies, it stands for all of the corporations, all of the organizations, all of the Boy  Scouts, all the churches, everything, being  used to enforce the principles of social  justice. Now, of course, what social justice <i>specifically </i>stands for has a tendency  to mutate at any given moment. They used to be concerned  about gay marriage, before that they were  concerned about women in the workplace. They were concerned about  black quarterbacks, now they’re concerned  about black coaches. The specific target frequently  evolves, but the general objective of  forcing everybody’s opinion, and  everybody’s thinking, and everybody’s actions to conform to the narrative, that is the primary  objective.</p><p>Obviously that is not what  we on the right wing support or stand for. We don’t accept any of it. Social justice, and  especially the convergence that it  entails, is diametrically opposed to all  of us who value Aristotelian logic, value  Christianity and Christian morality, and  so it is <i>absolutely insane</i>, it’s  nonsensical, to confuse the two or to  conflate the two. Now, you can say quite  reasonably that we don’t  want politics in our comics. I don’t  think that is very plausible for comics that are going to have any  relevance to current events or to the  interesting philosophical and  ideological questions of the day, but that’s not a nonsensical statement, it’s just a self-limiting statement.</p><p><i>As I mentioned in the Darkstream, we have taken the opportunity of the recent unpleasantries to update our Dark Legion Comics logo, and we will be replacing the ComicsGate Comic logo on <a href=\"https://aerbook.com/maker/productcard-4032460-1875.html\">the current Gun Ghoul graphic novel</a> with it later this week. We have already replaced the original Dark Legion logos on the digital editions, and we will replace the original gold Dark Legion logos on Chicago Typewriter and Rebel Dead Revenge when the production schedule permits.</i></p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://gallery.mailchimp.com/080c425cb9162df4953235529/images/8eb19e50-ca1c-4847-9629-d17f3af3077f.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"375\" data-original-width=\"375\" decoding=\"async\" src=\"https://gallery.mailchimp.com/080c425cb9162df4953235529/images/8eb19e50-ca1c-4847-9629-d17f3af3077f.png\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"375\" data-original-width=\"375\" data-src=\"https://gallery.mailchimp.com/080c425cb9162df4953235529/images/8eb19e50-ca1c-4847-9629-d17f3af3077f.png\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20375%20375%22%3E%3C/svg%3E\"/></a></div></div>",
  "content_text": "From the transcript\nof the Darkstream\n:\nI don’t know what “right-wing SJW” signals to you but what it  signals to me is that the person who is  talking does not understand what an SJW is. They do not understand that social  justice actually\nmeans something\n. You  know, it is a complete oxymoron. To use the term “right-wing SJW” is  every bit as nonsensical as the term “right-wing communist”; there\nare\nno right-wing communists. Now, you can argue  all you want about the Nazis being  right-wing or left-wing; I think it’s  very obvious that the National Socialist  German Workers Party was, like all  socialist parties, like all workers parties, a party of the Left. I studied  their ideology, and if you go over the 21  points of the Munich Manifesto, you can  see that the National Socialists were  considerably  to the left of the American Democrats. That’s why it’s always been totally  absurd to claim that Republicans or libertarians are Nazis, but there is enough common confusion on  that score that you can understand where  it happens.\nAnd yet, you never see the  same thing happen with communists, and  nobody ever says, “oh, well, you\nright-wing communists\n“, and so it’s  interesting to me to hear about that, especially in  this recent run-in with the  self-proclaimed moderates in the comics  industry.  More than a few of them  accused us, and me a particular, of being  a quote\nright-wing SJW\nunquote, but if  you understand what SJW stands for, if  you understand what social justice is, then you realize that it’s the same as saying you’re a right-wing/left-wing warrior.\nIt’s intrinsically nonsensical, and let  me explain for those of you who have not  read\nSJWS ALWAYS LIE\n, which is, as even  people who don’t like me very much will  tell you, the go-to book on the subject. Social justice is about the convergence  of all individuals and institutions  towards what they consider to be the maximum possible  justice for everyone,  and so “social justice  warrior” does not refer to tactics, it does not refer to techniques, it  refers to\nobjectives\n. And the objectives  of the SJW are absolutely antithetical to  the right wing in general, and to right-wing extremists in particular\nAlot of people don’t  realize that the concept of social  justice goes back to the 1800s. That’s  right. A commenter said\nsocial justice is socialist justice\n. Many figures on the right have condemned  it, probably the best example being  Friedrich von Hayek. He wrote a really  good essay on the subject back in 1971, so this is all  going back much further than most people  realize, and what we’re seeing in the SJWs today is really just the ultimate  realization of what John Stuart Mill was  advocating back in, whatever it was, 1851. So if you look at what social justice stands for, it stands for the very things that we’re now seeing from the tech companies, it stands for all of the corporations, all of the organizations, all of the Boy  Scouts, all the churches, everything, being  used to enforce the principles of social  justice. Now, of course, what social justice\nspecifically\nstands for has a tendency  to mutate at any given moment. They used to be concerned  about gay marriage, before that they were  concerned about women in the workplace. They were concerned about  black quarterbacks, now they’re concerned  about black coaches. The specific target frequently  evolves, but the general objective of  forcing everybody’s opinion, and  everybody’s thinking, and everybody’s actions to conform to the narrative, that is the primary  objective.\nObviously that is not what  we on the right wing support or stand for. We don’t accept any of it. Social justice, and  especially the convergence that it  entails, is diametrically opposed to all  of us who value Aristotelian logic, value  Christianity and Christian morality, and  so it is\nabsolutely insane\n, it’s  nonsensical, to confuse the two or to  conflate the two. Now, you can say quite  reasonably that we don’t  want politics in our comics. I don’t  think that is very plausible for comics that are going to have any  relevance to current events or to the  interesting philosophical and  ideological questions of the day, but that’s not a nonsensical statement, it’s just a self-limiting statement.\nAs I mentioned in the Darkstream, we have taken the opportunity of the recent unpleasantries to update our Dark Legion Comics logo, and we will be replacing the ComicsGate Comic logo on\nthe current Gun Ghoul graphic novel\nwith it later this week. We have already replaced the original Dark Legion logos on the digital editions, and we will replace the original gold Dark Legion logos on Chicago Typewriter and Rebel Dead Revenge when the production schedule permits.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-10T14:18:01+00:00"
}