{
  "url": "https://voxday.net/2018/09/14/darkstream-comicsgate-is-hitler/",
  "scraped_at": "2025-12-19T21:21:11.269239",
  "title": "Darkstream: ComicsGate is Hitler",
  "date_display": "September 14, 2018",
  "date_iso": "2018-09-14T09:11:30+00:00",
  "date_from_url": "2018-09-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/Ql8FTsslF-Q\" width=\"512\"></iframe></div><p>From the transcript <a href=\"https://youtu.be/Ql8FTsslF-Q\">of the Darkstream</a>:</p><p>So what did we learn  today? I don’t know about you, but I was,  of course, horrified to read <i>the  Washington Post</i> and be informed that not  only is ComicsGate Hitler, but that  Ethan Van Sciver is also Hitler, and that Diversity &amp; Comics is also Hitler too. Now, I  have to admit that there is a certain  amount of, I guess since we’re on the  Germanic theme, <i>schadenfreude</i>, to be had in watching  how this is playing out from the outside. The thing that  the virtue signalers and ComicsGatekeepers simply refuse to understand  is that there is nothing – <i>nothing </i>– you can  do to defend yourself against a  rhetorical attack by SJWs.</p><p>You can  virtue signal all you like, you can run  around talking about how you are a  diverse movement and that you that you  hate hate hate the Alt-Right, that you  disavow, disapprove, and anathematize  people like myself and so forth, but it won’t do you a damned bit of good. So yeah, my first thought when I was  reading that was, “hey, don’t come talking to me about this, you know, Two-Face van Sciver owns the trademark!” I’m actually waiting for the  first accusations that my contacts at <i>the Washington Post</i> set that whole thing up, that this is somehow my fault. I deny that! I absolutely deny that I  arranged that hit piece!</p><p>I’m not going to pretend that I don’t find it  funny. I find it more than a little bit  amusing, though not quite hysterical just  because I understand that the very ComicsGatekeepers who were trying to  brigade this particular stream are  probably genuinely astounded, and  genuinely dismayed, at these attacks from  the mainstream media. And what you have to understand is that  they’re not going to stop, they’re not  going to listen to you. They’re not going  to give you a fair shake, they’re not  going to allow you to defend yourself in  any way, shape, or form, and they’re going  to lie. So you’re going to see more  articles like this. You know, we saw this  with GamerGate. A lot of you  guys don’t know about the history of the Sad Puppies and the Rabid Puppies,  but you really need to learn it because  you guys are in the position of the Sad Puppies. The Sad Puppies were completely obliterated and that’s the  fate that is in store for you if you  follow your instincts.</p><p><i>Needless to say, the ComicsGatekeepers didn’t listen to me and continued to engage in some very public acts of virtue-signaling. A reader writes about D&amp;C’s foolish decision to metaphorically tattoo “kick me” on his forehead:</i></p><blockquote><p>I have to admit, even knowing better, to being highly disappointed in D&amp;C’s latest futile attempt at virtue-signalling.  He’s running another limited Indiegogo campaign as a “charity event” at premium prices, with at least US$10,000 to a charity that he spent several days researching and selecting.</p><p>Did he, a US veteran knowing full well how many veterans are in dire straits and in need of help, select Disabled American Veterans or another veterans’ charity.  He did not. He chose The Trevor Project, an LGBTQIA+ charity. Seriously. Semper Fi is out; “please accept me, SJWs” is in.</p><p>The ComicsGatekeepers are cuckservatives through and through, and are unable and unwilling to conserve a damned thing. Just as you’ve said.</p></blockquote><p>Once you indicate that you are willing to submit to the SJW Narrative, SJWs will never leave you alone until you submit to them entirely. The virtue-signaling tells them that you’re weak and that they only have to increase the pressure until you can’t take it anymore and give in to their demands. That’s one of the reasons they seldom even bother with me anymore. They know that not only will I never accept their idiot Narrative or submit to them, but the VFM and I will go after them harder and faster and from more directions than they even knew were vulnerable.</p></div>",
  "content_text": "From the transcript\nof the Darkstream\n:\nSo what did we learn  today? I don’t know about you, but I was,  of course, horrified to read\nthe  Washington Post\nand be informed that not  only is ComicsGate Hitler, but that  Ethan Van Sciver is also Hitler, and that Diversity & Comics is also Hitler too. Now, I  have to admit that there is a certain  amount of, I guess since we’re on the  Germanic theme,\nschadenfreude\n, to be had in watching  how this is playing out from the outside. The thing that  the virtue signalers and ComicsGatekeepers simply refuse to understand  is that there is nothing –\nnothing\n– you can  do to defend yourself against a  rhetorical attack by SJWs.\nYou can  virtue signal all you like, you can run  around talking about how you are a  diverse movement and that you that you  hate hate hate the Alt-Right, that you  disavow, disapprove, and anathematize  people like myself and so forth, but it won’t do you a damned bit of good. So yeah, my first thought when I was  reading that was, “hey, don’t come talking to me about this, you know, Two-Face van Sciver owns the trademark!” I’m actually waiting for the  first accusations that my contacts at\nthe Washington Post\nset that whole thing up, that this is somehow my fault. I deny that! I absolutely deny that I  arranged that hit piece!\nI’m not going to pretend that I don’t find it  funny. I find it more than a little bit  amusing, though not quite hysterical just  because I understand that the very ComicsGatekeepers who were trying to  brigade this particular stream are  probably genuinely astounded, and  genuinely dismayed, at these attacks from  the mainstream media. And what you have to understand is that  they’re not going to stop, they’re not  going to listen to you. They’re not going  to give you a fair shake, they’re not  going to allow you to defend yourself in  any way, shape, or form, and they’re going  to lie. So you’re going to see more  articles like this. You know, we saw this  with GamerGate. A lot of you  guys don’t know about the history of the Sad Puppies and the Rabid Puppies,  but you really need to learn it because  you guys are in the position of the Sad Puppies. The Sad Puppies were completely obliterated and that’s the  fate that is in store for you if you  follow your instincts.\nNeedless to say, the ComicsGatekeepers didn’t listen to me and continued to engage in some very public acts of virtue-signaling. A reader writes about D&C’s foolish decision to metaphorically tattoo “kick me” on his forehead:\nI have to admit, even knowing better, to being highly disappointed in D&C’s latest futile attempt at virtue-signalling.  He’s running another limited Indiegogo campaign as a “charity event” at premium prices, with at least US$10,000 to a charity that he spent several days researching and selecting.\nDid he, a US veteran knowing full well how many veterans are in dire straits and in need of help, select Disabled American Veterans or another veterans’ charity.  He did not. He chose The Trevor Project, an LGBTQIA+ charity. Seriously. Semper Fi is out; “please accept me, SJWs” is in.\nThe ComicsGatekeepers are cuckservatives through and through, and are unable and unwilling to conserve a damned thing. Just as you’ve said.\nOnce you indicate that you are willing to submit to the SJW Narrative, SJWs will never leave you alone until you submit to them entirely. The virtue-signaling tells them that you’re weak and that they only have to increase the pressure until you can’t take it anymore and give in to their demands. That’s one of the reasons they seldom even bother with me anymore. They know that not only will I never accept their idiot Narrative or submit to them, but the VFM and I will go after them harder and faster and from more directions than they even knew were vulnerable.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-14T08:11:30+00:00"
}