{
  "url": "https://voxday.net/2018/09/18/darkstream-trade-war-is-good-for-the-u-s-economy/",
  "scraped_at": "2025-12-19T21:21:51.632117",
  "title": "Darkstream: Trade war is good for the U.S. economy",
  "date_display": "September 18, 2018",
  "date_iso": "2018-09-18T11:45:10+00:00",
  "date_from_url": "2018-09-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/PiHIKslRhCA\" width=\"584\"></iframe></div><p>From the transcript <a href=\"https://youtu.be/PiHIKslRhCA\">of the Darkstream</a>:</p><p>So today the God-Emperor announced $200  billion in new trade tariffs targeted  against Chinese imports, and he’s also  made it clear that if China goes ahead  and retaliates he’s going to go ahead  and drop even more tariffs on them as  well. Now this, of course, has all the  usual suspects, all the free traders, all  the neocons, all the people who think  that responding “uh, <i>Ricardo</i>” is a  meaningful response to tariffs, in a  tizzy. And they’ve been upset about this, they’ve been arguing their theory over  and over and over again ever since the  first tariffs were announced a couple  months ago, but if you noticed something,  what hasn’t happened, what consequences were predicted by all of these doomsayers  didn’t come to pass.</p><p>Instead what happened  is what anti-free trade people like  myself predicted would happen, and what proper economic theory, conventional  economic theory, predicts would happen – the economy grew! This is not  difficult, this is not at all hard. Now, if  you want to argue that the idea of a  objective measure of a national economy,  especially one that is denominated in a  currency, is a contradiction in terms and  that it’s not possible to measure a  national economy, especially not in its  own currency I would accept that  argument, but then there’s no point in  having this discussion because it’s not  possible to argue about something that  can’t be quantified becoming larger or  smaller. If you’re accepting mainstream  economics to the point that you’re  talking about the economy growing or the  economy shrinking, then you have to  accept the mainstream theory and what  the mainstream theory very clearly  states is that the size of the economy  as measured in gross domestic product is  C plus I plus G Plus X minus M, as consumer spending plus investment plus  government spending plus exports minus  imports, so what happens when you <i>reduce </i>imports the economy <i>grows. </i>You know, this  is an absolutely straightforward  mathematical relationship, it is a very  simple equation, and so it’s not at all  surprising that despite all the doomsaying,  despite all the ridiculous predictions, that the economy has grown and we’ve  actually seen the fastest growth rates  for the U.S. economy since the 1980s.</p></div>",
  "content_text": "From the transcript\nof the Darkstream\n:\nSo today the God-Emperor announced $200  billion in new trade tariffs targeted  against Chinese imports, and he’s also  made it clear that if China goes ahead  and retaliates he’s going to go ahead  and drop even more tariffs on them as  well. Now this, of course, has all the  usual suspects, all the free traders, all  the neocons, all the people who think  that responding “uh,\nRicardo\n” is a  meaningful response to tariffs, in a  tizzy. And they’ve been upset about this, they’ve been arguing their theory over  and over and over again ever since the  first tariffs were announced a couple  months ago, but if you noticed something,  what hasn’t happened, what consequences were predicted by all of these doomsayers  didn’t come to pass.\nInstead what happened  is what anti-free trade people like  myself predicted would happen, and what proper economic theory, conventional  economic theory, predicts would happen – the economy grew! This is not  difficult, this is not at all hard. Now, if  you want to argue that the idea of a  objective measure of a national economy,  especially one that is denominated in a  currency, is a contradiction in terms and  that it’s not possible to measure a  national economy, especially not in its  own currency I would accept that  argument, but then there’s no point in  having this discussion because it’s not  possible to argue about something that  can’t be quantified becoming larger or  smaller. If you’re accepting mainstream  economics to the point that you’re  talking about the economy growing or the  economy shrinking, then you have to  accept the mainstream theory and what  the mainstream theory very clearly  states is that the size of the economy  as measured in gross domestic product is  C plus I plus G Plus X minus M, as consumer spending plus investment plus  government spending plus exports minus  imports, so what happens when you\nreduce\nimports the economy\ngrows.\nYou know, this  is an absolutely straightforward  mathematical relationship, it is a very  simple equation, and so it’s not at all  surprising that despite all the doomsaying,  despite all the ridiculous predictions, that the economy has grown and we’ve  actually seen the fastest growth rates  for the U.S. economy since the 1980s.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-18T10:45:10+00:00"
}