{
  "url": "https://voxday.net/2018/09/23/dead-on-arrival/",
  "scraped_at": "2025-12-19T21:22:42.265331",
  "title": "Dead on arrival",
  "date_display": "September 23, 2018",
  "date_iso": "2018-09-23T15:02:35+00:00",
  "date_from_url": "2018-09-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PM points out that the popular free trade argument that trade prevents war <a href=\"https://infogalactic.com/info/Norman_Angell\">is based on an early 20th century Nobel prize-winner’s idea</a> that proved itself to be an epic falsehood within seven years of its first articulation:</p><blockquote><p>Norman Angell is most widely remembered for his 1909 pamphlet, <i>Europe’s Optical Illusion</i>, which was published the following year (and many years thereafter) as the book, <i>The Great Illusion</i>. (The anti-war film <i>La Grande Illusion</i> took its title from his pamphlet.) The thesis of the book was that the integration of the economies of European countries had grown to such a degree that war between them would be entirely futile, making militarism obsolete. This quotation from the “Synopsis” to the popular 1913 edition summarizes his basic argument.</p><p>He establishes this apparent paradox, in so far as the economic problem is concerned, by showing that wealth in the economically civilized world is founded upon credit and commercial contract (these being the outgrowth of an economic interdependence due to the increasing division of labour and greatly developed communication). If credit and commercial contract are tampered with in an attempt at confiscation, the credit-dependent wealth is undermined, and its collapse involves that of the conqueror; so that if conquest is not to be self-injurious it must respect the enemy’s property, in which case it becomes economically futile. Thus the wealth of conquered territory remains in the hands of the population of such territory. When Germany annexed Alsace, no individual German secured a single mark’s worth of Alsatian property as the spoils of war. Conquest in the modern world is a process of multiplying by x, and then obtaining the original figure by dividing by x. For a modern nation to add to its territory no more adds to the wealth of the people of such nation than it would add to the wealth of Londoners if the City of London were to annex the county of Hertford.</p></blockquote><p>Whenever you dig into the logic of free trade or the arguments presented on its behalf, you inevitably discover that they are based on foundations that were conclusively proven to be rotten decades, or even <i>centuries</i>, ago. One of the most remarkable things about free traders I have observed is their relentlessly stubborn ignorance of the roots of their own economic philosophy.</p><p>Of course they don’t know anything about Norman Angell’s case for trade. One can hardly criticize them for that, as it was justly obscured by the course of historical events. But free trade advocates don’t even understand the specifics, let alone the intrinsic flaws, of David Ricardo’s comparative advantage argument.</p></div>",
  "content_text": "PM points out that the popular free trade argument that trade prevents war\nis based on an early 20th century Nobel prize-winner’s idea\nthat proved itself to be an epic falsehood within seven years of its first articulation:\nNorman Angell is most widely remembered for his 1909 pamphlet,\nEurope’s Optical Illusion\n, which was published the following year (and many years thereafter) as the book,\nThe Great Illusion\n. (The anti-war film\nLa Grande Illusion\ntook its title from his pamphlet.) The thesis of the book was that the integration of the economies of European countries had grown to such a degree that war between them would be entirely futile, making militarism obsolete. This quotation from the “Synopsis” to the popular 1913 edition summarizes his basic argument.\nHe establishes this apparent paradox, in so far as the economic problem is concerned, by showing that wealth in the economically civilized world is founded upon credit and commercial contract (these being the outgrowth of an economic interdependence due to the increasing division of labour and greatly developed communication). If credit and commercial contract are tampered with in an attempt at confiscation, the credit-dependent wealth is undermined, and its collapse involves that of the conqueror; so that if conquest is not to be self-injurious it must respect the enemy’s property, in which case it becomes economically futile. Thus the wealth of conquered territory remains in the hands of the population of such territory. When Germany annexed Alsace, no individual German secured a single mark’s worth of Alsatian property as the spoils of war. Conquest in the modern world is a process of multiplying by x, and then obtaining the original figure by dividing by x. For a modern nation to add to its territory no more adds to the wealth of the people of such nation than it would add to the wealth of Londoners if the City of London were to annex the county of Hertford.\nWhenever you dig into the logic of free trade or the arguments presented on its behalf, you inevitably discover that they are based on foundations that were conclusively proven to be rotten decades, or even\ncenturies\n, ago. One of the most remarkable things about free traders I have observed is their relentlessly stubborn ignorance of the roots of their own economic philosophy.\nOf course they don’t know anything about Norman Angell’s case for trade. One can hardly criticize them for that, as it was justly obscured by the course of historical events. But free trade advocates don’t even understand the specifics, let alone the intrinsic flaws, of David Ricardo’s comparative advantage argument.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-23T14:02:35+00:00"
}