{
  "url": "https://voxday.net/2018/09/24/directly-over-the-target/",
  "scraped_at": "2025-12-19T21:22:49.686186",
  "title": "Directly over the target",
  "date_display": "September 24, 2018",
  "date_iso": "2018-09-24T16:20:18+00:00",
  "date_from_url": "2018-09-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>NPR has released <a href=\"https://www.revealnews.org/episodes/never-meet-your-super-heroes/\">their hitpiece on Arkhaven and Alt★Hero</a>. It’s rather remarkable to observe how many people they manage to implicitly insult, from the Arkhaven backers to the entire comics industry. I think my favorite part was, after insinuating that our funding was illegitimate, the poor, disappointed Chuck Dixon fan who is ever so disappointed to learn that his childhood hero is a negative influence on innocent comics readers asks Amanda “MAGA” Robb how Alt★Hero is doing upon release, and is surprised to be informed that it is a #1 bestseller on Amazon.</p><p>Their explanation? We are gaming the system by a) having fans buy it on Kindle and read it on Kindle Unlimited, and, b) targeting a “very small” microcategory on Amazon. That category? <i>Comics and Graphic Novels: Superheroes</i>.</p><p>We’re clearly not dealing with rocket surgeons here.</p><p>Here is the punchline: after spending all this time trying to insinuate that I am a shadowy international figure with questionable sources of funding and astroturfed succcess, they spent the last quarter of the interview talking to Marvel Vice-President Sana Amanat, <a href=\"http://voxday.blogspot.com/2018/09/mailvox-marvel-and-swamp.html\">of all people</a>.</p><p>Anyhow, if anyone feels up to assembling a transcript, send it to me and I’ll do a Darkstream dissecting their shady pseudo-journalistic shenanigans. And if you weren’t certain about <a href=\"https://www.indiegogo.com/projects/alt-hero-q/x/19185338#/\">backing the AH-Q campaign</a>, this NPR hit piece should provide you with all the convincing you need, because it’s evident that nothing discombobulates them more than Arkhaven’s crowdfunding success.</p><p><b>UPDATE:</b> Just like a school of fish… here come <a href=\"https://www.amazon.com/gp/product/B07D5Z3CXW/ref=series_rw_dp_sw\">the fake reviews</a>!</p><p><b>Pass on this one  </b><br>Justin Mingus September 24, 2018<br>Just alt-right racist nonsense.</br></br></p><p><b>Are you kidding me?</b><br>John Rasmussen September 23, 2018<br>I can’t believe that Amazon would allow this to be available. This hate speech is utterly disgusting. I honestly don’t know what else to say. This goes against everything that comics stand for.</br></br></p><p><b>It’s poorly written and illustrated propaganda.</b><br>Jason Yargeron September 23, 2018<br>Trash for trash.</br></br></p><p><b>another alt-right diatribe</b><br>Lucy Owsleyon September 23, 2018<br>All I saw was poorly written alt right brain washing hate art.</br></br></p><p><b>Propaganda aimed at children</b><br>Joseph Webb September 23, 2018<br>Seriously? Famous white supremacist writes a comic book? Alt-Hero of alt-truth, for the alt-right. Shameful.</br></br></p><p><b><br/></b><b>UPDATE:</b> Old Two-Face jumps in to try to play divide-and-conquer.</p><blockquote><p><b>ComicArtistPro Secrets <a href=\"https://twitter.com/EthanVanSciver/status/1044152634888912896\">@EthanVanSciver</a></b><br>Just listened to a fabulous NPR show about The Alt Right in comics.</br></p><p>Poor Chuck Dixon. Cornered and asked why he’s working for Vox Day by these people. He should have said,”Because he’s paying me and I have bills to pay.”</p><p>ComicsGate is coming, Chuck. Come work with us instead.</p></blockquote><p>The amusing thing is that it won’t be long before 2VS is whining about the way Amanda Robb treats him in her upcoming and no-doubt-equally fabulous <i>Rolling Stone</i> article about the Nazis of ComicsGate. And in case you weren’t aware that 2VS’s claims about me trying to coopt ComicsGate are absolutely false, note that <i>he </i>was following <i>my </i>lead from the start before he abruptly turned around, feigned ignorance, and started dancing for the SJWs.</p><blockquote><p><i>On 1/23/2018 6:42 PM, ComicArtistPro Secrets wrote:</i><br>Vox, I’m VERY EXPENSIVE.  Me shifting to an independent venture just doesn’t seem likely, unless SJWs completely take over and dominate DC Comics this year and my entire mainstream career collapses   I will probably re-up with them or shock the world by going to Marvel.  I am watching you…I mean, Arkhaven might become a going concern that can support a book that I’ve drawn,  but it isn’t now.  You guys need to draw a fan base and maintain sales, learn how to reprint and repackage work in trade paper backs and hardcover editions, sell posters and prints, everything.  There has to be a ton of cash coming in from buyers, not just kickstarters. </br></p><p>You can do it.  But it’ll be a lot of work.<br>EVS</br></p></blockquote><p>That sounds just a little bit ironic these days, ne c’est pas? You can just about guarantee that 2VS is eventually going to stab ComicsGate in the back somehow, just like he has everyone else he’s worked with, from colorists to commissioned art buyers.</p></div>",
  "content_text": "NPR has released\ntheir hitpiece on Arkhaven and Alt★Hero\n. It’s rather remarkable to observe how many people they manage to implicitly insult, from the Arkhaven backers to the entire comics industry. I think my favorite part was, after insinuating that our funding was illegitimate, the poor, disappointed Chuck Dixon fan who is ever so disappointed to learn that his childhood hero is a negative influence on innocent comics readers asks Amanda “MAGA” Robb how Alt★Hero is doing upon release, and is surprised to be informed that it is a #1 bestseller on Amazon.\nTheir explanation? We are gaming the system by a) having fans buy it on Kindle and read it on Kindle Unlimited, and, b) targeting a “very small” microcategory on Amazon. That category?\nComics and Graphic Novels: Superheroes\n.\nWe’re clearly not dealing with rocket surgeons here.\nHere is the punchline: after spending all this time trying to insinuate that I am a shadowy international figure with questionable sources of funding and astroturfed succcess, they spent the last quarter of the interview talking to Marvel Vice-President Sana Amanat,\nof all people\n.\nAnyhow, if anyone feels up to assembling a transcript, send it to me and I’ll do a Darkstream dissecting their shady pseudo-journalistic shenanigans. And if you weren’t certain about\nbacking the AH-Q campaign\n, this NPR hit piece should provide you with all the convincing you need, because it’s evident that nothing discombobulates them more than Arkhaven’s crowdfunding success.\nUPDATE:\nJust like a school of fish… here come\nthe fake reviews\n!\nPass on this one\nJustin Mingus September 24, 2018\nJust alt-right racist nonsense.\nAre you kidding me?\nJohn Rasmussen September 23, 2018\nI can’t believe that Amazon would allow this to be available. This hate speech is utterly disgusting. I honestly don’t know what else to say. This goes against everything that comics stand for.\nIt’s poorly written and illustrated propaganda.\nJason Yargeron September 23, 2018\nTrash for trash.\nanother alt-right diatribe\nLucy Owsleyon September 23, 2018\nAll I saw was poorly written alt right brain washing hate art.\nPropaganda aimed at children\nJoseph Webb September 23, 2018\nSeriously? Famous white supremacist writes a comic book? Alt-Hero of alt-truth, for the alt-right. Shameful.\nUPDATE:\nOld Two-Face jumps in to try to play divide-and-conquer.\nComicArtistPro Secrets\n@EthanVanSciver\nJust listened to a fabulous NPR show about The Alt Right in comics.\nPoor Chuck Dixon. Cornered and asked why he’s working for Vox Day by these people. He should have said,”Because he’s paying me and I have bills to pay.”\nComicsGate is coming, Chuck. Come work with us instead.\nThe amusing thing is that it won’t be long before 2VS is whining about the way Amanda Robb treats him in her upcoming and no-doubt-equally fabulous\nRolling Stone\narticle about the Nazis of ComicsGate. And in case you weren’t aware that 2VS’s claims about me trying to coopt ComicsGate are absolutely false, note that\nhe\nwas following\nmy\nlead from the start before he abruptly turned around, feigned ignorance, and started dancing for the SJWs.\nOn 1/23/2018 6:42 PM, ComicArtistPro Secrets wrote:\nVox, I’m VERY EXPENSIVE.  Me shifting to an independent venture just doesn’t seem likely, unless SJWs completely take over and dominate DC Comics this year and my entire mainstream career collapses   I will probably re-up with them or shock the world by going to Marvel.  I am watching you…I mean, Arkhaven might become a going concern that can support a book that I’ve drawn,  but it isn’t now.  You guys need to draw a fan base and maintain sales, learn how to reprint and repackage work in trade paper backs and hardcover editions, sell posters and prints, everything.  There has to be a ton of cash coming in from buyers, not just kickstarters.\nYou can do it.  But it’ll be a lot of work.\nEVS\nThat sounds just a little bit ironic these days, ne c’est pas? You can just about guarantee that 2VS is eventually going to stab ComicsGate in the back somehow, just like he has everyone else he’s worked with, from colorists to commissioned art buyers.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-24T15:20:18+00:00"
}