{
  "url": "https://voxday.net/2018/09/22/dramagate/",
  "scraped_at": "2025-12-19T21:22:36.796853",
  "title": "DramaGate",
  "date_display": "September 22, 2018",
  "date_iso": "2018-09-22T22:52:15+00:00",
  "date_from_url": "2018-09-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bounding Into Comics urges everyone <a href=\"http://boundingintocomics.com/2018/09/22/lets-not-turn-comicsgate-into-dramagate/\">to stop the madness</a>:</p><blockquote><p>With coordinated attacks coming from all sides, it’s more critical than ever that #Comicsgate members keep their eye on the prize and don’t turn into #dramaqueens who favor sniping and infighting over solidarity. Sadly, for those supporting this consumer revolt in the name of good comic books, and for the high profile figures within it, recent history may not be on our side.</p><p>On September 3rd, 2018, Alt-Hero publisher Vox Day announced his prospective Comicsgate imprint right here on Bounding Into Comics, and it would be an insult to diarrhea to say that the Comicsgate community understandably lost their crap in response. Whether Vox Day was trying to do something he deemed to be positive for the movement, or he was just trying to co-opt it a la Sad Puppies…or both, is mostly irrelevant; the fallout from his move was quite real, particularly when it came to author and occasional BIC contributor Jon Del Arroz…. Guilt by association? Juvenile stunts? Sounds a little SJW, doesn’t it? That’s because these are the brushes that crowd loves to paint with, and this is the same crowd who is smiling with glee at seeing Comicsgate infighting because they equate it with weakness.</p><p>With someone like Vox Day, it’s easy to understand this reaction. He has a history of co-opting movements, and he’s far more apt just to burn down the house rather than try to treat the infestation, which is what many longtime comic book fans don’t want to see. However, in this case Vox didn’t do that. He gave up on the Comics Gate imprint and is sticking to publishing popular stories through Arkhaven Comics and Dark Legion Comics.</p></blockquote><p>I tend to agree that it’s important to stay focused on the business rather than the tempests and teapots, but I also have to admit that I’m really not concerned about this one way or another. Things will probably play out as they usually do, those who talk will talk and those who act will act. This ComicsGate nonsense hasn’t slowed down our release schedule in the slightest or interfered with the <i>Alt-Hero:Q</i> campaign. The only real ComicsGate-related problem for us has been the latest SJW attack at Amazon; the four digital editions of <i>Gun Ghoul</i> there are still blocked for absolutely no legitimate reason.</p><p>As I pointed out to a very irate Will Caligan last night, this isn’t a showstopper and the print edition of <i>Gun Ghoul</i> is available at Arkhaven Direct, at <a href=\"https://www.barnesandnoble.com/w/gun-ghoul-will-caligan/1129471022?ean=9789527303399\">Barnes &amp; Noble</a>, <a href=\"https://www.bookdepository.com/Gun-Ghoul-Will-Caligan/9789527303399\">Book Depository</a>, and even on Amazon itself. You’ll get the best price <a href=\"https://aerbook.com/maker/productcard-4032460-1875.html\">at Arkhaven</a>. But it is the sort of ridiculous thing that has inspired the President of the United States to consider lowering the antitrust boom on the social media giants.</p><p>I would, however, like to correct one common misapprehension: I never co-opted Sad Puppies. To the contrary, I was the architect of the Sad Puppies most notorious success and at no point in time was there ever any conflict between the Sad Puppies and me. If you look more closely, you’ll notice that none of the four leaders of the Sad Puppies, from Larry to Kate, have ever made a single accusation on that score. I don’t intend to say any more than that, except to reiterate an absolute fact: I did not co-opt Sad Puppies and anyone who claims I did in any way, shape, or form is wrong.</p><p>They are, however, correct to observe that I believe the optimal response to a converged organization is to burn it down. Because that’s what is going to happen anyhow, one is merely helping to speed the inevitable process along.</p></div>",
  "content_text": "Bounding Into Comics urges everyone\nto stop the madness\n:\nWith coordinated attacks coming from all sides, it’s more critical than ever that #Comicsgate members keep their eye on the prize and don’t turn into #dramaqueens who favor sniping and infighting over solidarity. Sadly, for those supporting this consumer revolt in the name of good comic books, and for the high profile figures within it, recent history may not be on our side.\nOn September 3rd, 2018, Alt-Hero publisher Vox Day announced his prospective Comicsgate imprint right here on Bounding Into Comics, and it would be an insult to diarrhea to say that the Comicsgate community understandably lost their crap in response. Whether Vox Day was trying to do something he deemed to be positive for the movement, or he was just trying to co-opt it a la Sad Puppies…or both, is mostly irrelevant; the fallout from his move was quite real, particularly when it came to author and occasional BIC contributor Jon Del Arroz…. Guilt by association? Juvenile stunts? Sounds a little SJW, doesn’t it? That’s because these are the brushes that crowd loves to paint with, and this is the same crowd who is smiling with glee at seeing Comicsgate infighting because they equate it with weakness.\nWith someone like Vox Day, it’s easy to understand this reaction. He has a history of co-opting movements, and he’s far more apt just to burn down the house rather than try to treat the infestation, which is what many longtime comic book fans don’t want to see. However, in this case Vox didn’t do that. He gave up on the Comics Gate imprint and is sticking to publishing popular stories through Arkhaven Comics and Dark Legion Comics.\nI tend to agree that it’s important to stay focused on the business rather than the tempests and teapots, but I also have to admit that I’m really not concerned about this one way or another. Things will probably play out as they usually do, those who talk will talk and those who act will act. This ComicsGate nonsense hasn’t slowed down our release schedule in the slightest or interfered with the\nAlt-Hero:Q\ncampaign. The only real ComicsGate-related problem for us has been the latest SJW attack at Amazon; the four digital editions of\nGun Ghoul\nthere are still blocked for absolutely no legitimate reason.\nAs I pointed out to a very irate Will Caligan last night, this isn’t a showstopper and the print edition of\nGun Ghoul\nis available at Arkhaven Direct, at\nBarnes & Noble\n,\nBook Depository\n, and even on Amazon itself. You’ll get the best price\nat Arkhaven\n. But it is the sort of ridiculous thing that has inspired the President of the United States to consider lowering the antitrust boom on the social media giants.\nI would, however, like to correct one common misapprehension: I never co-opted Sad Puppies. To the contrary, I was the architect of the Sad Puppies most notorious success and at no point in time was there ever any conflict between the Sad Puppies and me. If you look more closely, you’ll notice that none of the four leaders of the Sad Puppies, from Larry to Kate, have ever made a single accusation on that score. I don’t intend to say any more than that, except to reiterate an absolute fact: I did not co-opt Sad Puppies and anyone who claims I did in any way, shape, or form is wrong.\nThey are, however, correct to observe that I believe the optimal response to a converged organization is to burn it down. Because that’s what is going to happen anyhow, one is merely helping to speed the inevitable process along.",
  "tags": [
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-22T21:52:15+00:00"
}