{
  "url": "https://voxday.net/2018/09/13/exclusive-to-bic/",
  "scraped_at": "2025-12-19T21:21:05.745538",
  "title": "Exclusive to BIC",
  "date_display": "September 13, 2018",
  "date_iso": "2018-09-13T12:01:48+00:00",
  "date_from_url": "2018-09-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Bounding Into Comics</i> <a href=\"http://boundingintocomics.com/2018/09/13/exclusive-get-your-first-look-at-chuck-dixons-avalon-2-cover/\">has the exclusive</a> on the cover for the new Chuck Dixon comic that is being launched today.</p><p><i>“Avalon is a great first issue that introduces us to a fascinating group of super-powered individuals who are struggling with their own strengths and weaknesses. The conflicts that will eventually play out are worth being excited for and it’s a great bit of writing and world building overall that allow us to feel as if we’re already familiar with this universe, even as we’re only just introduced to it. You can feel safe in being excited for this one, folks.”</i><br>– Nathan Braudrick, <i>Bounding Into Comics</i><br><i><br/></i>You may notice that we’ve added an <i>Alt★Hero</i> logo to the bottom of the cover. This is because the success of the new series has already reached the point that The Legend Chuck Dixon and I have concluded the connection to <i>Alt★Hero</i> is of benefit to <i>Chuck Dixon’s Avalon</i> rather than detracting from it. Despite being set in the same world at roughly the same time, the two series will remain entirely distinct, with different authors and different art teams producing them.</br></br></p><p>Our objective is to grow both series over time, gradually adding individual hero-centric and limited-run story-centric spinoffs such as <i>Alt★Hero: Q </i>while continuing the two core series. One of the few complaints about the series has been the sheer volume of characters being introduced, but that is not going to change, as the scope of the Alternative Comics Universe aka ACU requires an ever-growing cast of characters. Going deeper into the stories of the individual heroes such as Vendetta or Shade will require focused spinoffs, which we will certainly create if there is sufficient demand for them.</p><p><i>Considers the possibility of talking to Milo about writing a Rainbow-centric comic. Is amused to consider the myriad of ways that could go so very, very wrong. </i></p><p>And we haven’t even gotten to the military line yet! Headshot, High-Q, Dark Zero, Centerfold, and the Gods of Peaceful Sleep are still little more than rumors to the readers.<i></i></p></div>",
  "content_text": "Bounding Into Comics\nhas the exclusive\non the cover for the new Chuck Dixon comic that is being launched today.\n“Avalon is a great first issue that introduces us to a fascinating group of super-powered individuals who are struggling with their own strengths and weaknesses. The conflicts that will eventually play out are worth being excited for and it’s a great bit of writing and world building overall that allow us to feel as if we’re already familiar with this universe, even as we’re only just introduced to it. You can feel safe in being excited for this one, folks.”\n– Nathan Braudrick,\nBounding Into Comics\nYou may notice that we’ve added an\nAlt★Hero\nlogo to the bottom of the cover. This is because the success of the new series has already reached the point that The Legend Chuck Dixon and I have concluded the connection to\nAlt★Hero\nis of benefit to\nChuck Dixon’s Avalon\nrather than detracting from it. Despite being set in the same world at roughly the same time, the two series will remain entirely distinct, with different authors and different art teams producing them.\nOur objective is to grow both series over time, gradually adding individual hero-centric and limited-run story-centric spinoffs such as\nAlt★Hero: Q\nwhile continuing the two core series. One of the few complaints about the series has been the sheer volume of characters being introduced, but that is not going to change, as the scope of the Alternative Comics Universe aka ACU requires an ever-growing cast of characters. Going deeper into the stories of the individual heroes such as Vendetta or Shade will require focused spinoffs, which we will certainly create if there is sufficient demand for them.\nConsiders the possibility of talking to Milo about writing a Rainbow-centric comic. Is amused to consider the myriad of ways that could go so very, very wrong.\nAnd we haven’t even gotten to the military line yet! Headshot, High-Q, Dark Zero, Centerfold, and the Gods of Peaceful Sleep are still little more than rumors to the readers.",
  "tags": [
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-13T11:01:48+00:00"
}