{
  "url": "https://voxday.net/2018/09/29/high-school-never-ends/",
  "scraped_at": "2025-12-20T05:10:24.528066",
  "title": "High school never ends",
  "date_display": "September 29, 2018",
  "date_iso": "2018-09-29T11:04:51+00:00",
  "date_from_url": "2018-09-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The media appears to be on the verge of <a href=\"http://www.unz.com/isteve/high-school-never-ends/\">discovering the socio-sexual hierarchy</a>:</p><blockquote><p>Is this the genesis of a new Sailer’s Law?</p><p><i>The most passionate tweets by male journalists tend to be demands that, Come the Revolution, the guys who beat out the journalists in getting the girls in high school will be destroyed in their adult lives.</i></p><p>The late Tom Wolfe suggested something similar in <i>Back to Blood</i>, in which an old editor, Topping, reflects upon young reporter John Smith. Only Wolfe thinks it all starts ten years younger:</p><p><i>If you ask me, newspaper reporters are created at age six when they first go to school. In the schoolyard boys immediately divide into two types. Immediately! There are those who have the will to be daring and dominate, and those who don’t have it. … But there are boys from the weaker side of the divide who grow up with the same dreams as the stronger … The boy standing before me, John Smith, is one of them. They, too, dream of power, money, fame, and beautiful lovers.</i></p></blockquote><p>The sort of men who go into journalism tend to be gammas. Just look at the average high school boy working on the school paper or college man majoring in journalism. That’s why so many of them get themselves into trouble once they climb the ranks, become a public face, start amassing real money and influence, and find themselves in the position of being a <i>situational </i>alpha. They simply don’t have the self-control that the young alpha naturally develops over time and their ability to rationalize their actions is off the charts because gamma.</p><p>But in truth, it’s more that elementary school never ends. That’s the age where most people appear to be stamped into what more or less remains their final form. Even the late-bloomers who transform themselves over time tend to more or less retain that early form on the inside.</p></div>",
  "content_text": "The media appears to be on the verge of\ndiscovering the socio-sexual hierarchy\n:\nIs this the genesis of a new Sailer’s Law?\nThe most passionate tweets by male journalists tend to be demands that, Come the Revolution, the guys who beat out the journalists in getting the girls in high school will be destroyed in their adult lives.\nThe late Tom Wolfe suggested something similar in\nBack to Blood\n, in which an old editor, Topping, reflects upon young reporter John Smith. Only Wolfe thinks it all starts ten years younger:\nIf you ask me, newspaper reporters are created at age six when they first go to school. In the schoolyard boys immediately divide into two types. Immediately! There are those who have the will to be daring and dominate, and those who don’t have it. … But there are boys from the weaker side of the divide who grow up with the same dreams as the stronger … The boy standing before me, John Smith, is one of them. They, too, dream of power, money, fame, and beautiful lovers.\nThe sort of men who go into journalism tend to be gammas. Just look at the average high school boy working on the school paper or college man majoring in journalism. That’s why so many of them get themselves into trouble once they climb the ranks, become a public face, start amassing real money and influence, and find themselves in the position of being a\nsituational\nalpha. They simply don’t have the self-control that the young alpha naturally develops over time and their ability to rationalize their actions is off the charts because gamma.\nBut in truth, it’s more that elementary school never ends. That’s the age where most people appear to be stamped into what more or less remains their final form. Even the late-bloomers who transform themselves over time tend to more or less retain that early form on the inside.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-29T10:04:51+00:00"
}