{
  "url": "https://voxday.net/2018/09/20/mediocre-author-denies-authorial-intent/",
  "scraped_at": "2025-12-19T21:22:07.407992",
  "title": "Mediocre author denies authorial intent",
  "date_display": "September 20, 2018",
  "date_iso": "2018-09-20T07:52:32+00:00",
  "date_from_url": "2018-09-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the reasons John Scalzi has never been able to lift himself out of mediocrity except by coloring Robert Heinlein by the numbers is that he doesn’t understand the first thing about understand and creating characters. Or, apparently, self-contradiction.</p><blockquote><p>“I created Bert,” says Frank Oz. “I know what and who he is.” And no, he isn’t gay.</p><p>John Scalzi<br>Frank Oz says that Bert’s not gay and he should know because he created him. I mean, Frank, a lot of parents feel the same, but then their kids come out anyway.</br></p><p>John Scalzi<br>To the folks who are asserting that fictional characters don’t have genders, or orientations, or have physical sex: I think you may be doing fiction wrong.</br></p><p>Mark Kern<br>Okay Scalzi, all your characters in all your novels are Trump loving, cis, Republicans. I demand you acknowledge that. You too, JK Rowling. I don’t care if you created them.</br></p></blockquote><p>McRapey is so dumb that he doesn’t even understand the intrinsic self-contradiction of his expressed positions. First, Frank Oz is correct; the creator defines the character. If we can unilaterally declare, <i>ex post facto</i>, that Bert and Ernie are gay, then we can also declare that Darth Vader is not Luke’s father, but rather, Luke’s Sigma Chi fraternity brother, that Gimli is not a Dwarf, but a short, bearded Elf, and that Dumbledore is a pedophile who repeatedly abused Harry Potter.</p><p>Actually, it might not be long before JK Rowling, in her enthusiasm for all things LGBTP, self-righteously announces the latter. It would explain a lot about those tedious novels.</p><p>In any event, the idea that fictional characters have genders, orientations, and engage in sex, but that their characteristics and behaviors are not established by their creators is not only self-contradictory, it is as intrinsically nonsensical as claiming that a man is really a woman.</p><p>Of course, if Scalzi’s monovocal dialogue is any guide, all of his characters, male and female, human and alien, are actually himself. Which may explain his incompetence with regards to these matters.</p></div>",
  "content_text": "One of the reasons John Scalzi has never been able to lift himself out of mediocrity except by coloring Robert Heinlein by the numbers is that he doesn’t understand the first thing about understand and creating characters. Or, apparently, self-contradiction.\n“I created Bert,” says Frank Oz. “I know what and who he is.” And no, he isn’t gay.\nJohn Scalzi\nFrank Oz says that Bert’s not gay and he should know because he created him. I mean, Frank, a lot of parents feel the same, but then their kids come out anyway.\nJohn Scalzi\nTo the folks who are asserting that fictional characters don’t have genders, or orientations, or have physical sex: I think you may be doing fiction wrong.\nMark Kern\nOkay Scalzi, all your characters in all your novels are Trump loving, cis, Republicans. I demand you acknowledge that. You too, JK Rowling. I don’t care if you created them.\nMcRapey is so dumb that he doesn’t even understand the intrinsic self-contradiction of his expressed positions. First, Frank Oz is correct; the creator defines the character. If we can unilaterally declare,\nex post facto\n, that Bert and Ernie are gay, then we can also declare that Darth Vader is not Luke’s father, but rather, Luke’s Sigma Chi fraternity brother, that Gimli is not a Dwarf, but a short, bearded Elf, and that Dumbledore is a pedophile who repeatedly abused Harry Potter.\nActually, it might not be long before JK Rowling, in her enthusiasm for all things LGBTP, self-righteously announces the latter. It would explain a lot about those tedious novels.\nIn any event, the idea that fictional characters have genders, orientations, and engage in sex, but that their characteristics and behaviors are not established by their creators is not only self-contradictory, it is as intrinsically nonsensical as claiming that a man is really a woman.\nOf course, if Scalzi’s monovocal dialogue is any guide, all of his characters, male and female, human and alien, are actually himself. Which may explain his incompetence with regards to these matters.",
  "tags": [
    "RulesofWriting"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-20T06:52:32+00:00"
}