{
  "url": "https://voxday.net/2018/09/13/peter-grant-clarifies/",
  "scraped_at": "2025-12-19T21:21:02.112354",
  "title": "Peter Grant clarifies",
  "date_display": "September 13, 2018",
  "date_iso": "2018-09-13T09:15:28+00:00",
  "date_from_url": "2018-09-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Peter Grant <a href=\"https://bayourenaissanceman.blogspot.com/2018/09/identity-politics-tribes-and-nations.html\">responds to critics and comments</a> concerning his original post on the existential threat posed by identity politics:</p><blockquote><p>Our society is built around the concept of a nation state as the focus of our loyalties, embodying our families, our tribes and our communities into a higher order of commitment.  As former President Theodore Roosevelt famously said in a 1915 speech:</p><p><i>There is no room in this country for hyphenated Americanism. When I refer to hyphenated Americans, I do not refer to naturalized Americans. Some of the very best Americans I have ever known were naturalized Americans, Americans born abroad. But a hyphenated American is not an American at all. This is just as true of the man who puts ‘native’ before the hyphen as of the man who puts German or Irish or English or French before the hyphen. Americanism is a matter of the spirit and of the soul. Our allegiance must be purely to the United States. We must unsparingly condemn any man who holds any other allegiance. But if he is heartily and singly loyal to this Republic, then no matter where he was born, he is just as good an American as anyone else.</i><br><i><br/></i><i>The one absolutely certain way of bringing this nation to ruin, of preventing all possibility of its continuing to be a nation at all, would be to permit it to become a tangle of squabbling nationalities, an intricate knot of German-Americans, Irish-Americans, English-Americans, French-Americans, Scandinavian-Americans or Italian-Americans, each preserving its separate nationality, each at heart feeling more sympathy with Europeans of that nationality, than with the other citizens of the American Republic. The men who do not become Americans and nothing else are hyphenated Americans; and there ought to be no room for them in this country. The man who calls himself an American citizen and who yet shows by his actions that he is primarily the citizen of a foreign land, plays a thoroughly mischievous part in the life of our body politic. He has no place here; and the sooner he returns to the land to which he feels his real heart allegiance, the better it will be for every good American. There is no such thing as a hyphenated American who is a good American. The only man who is a good American is the man who is an American and nothing else.</i></br></p><p>If you believe in the concept of a specifically American nation, it’s hard to disagree with him.</p><p>The concept of a “tribe” can be inimical to this national identity.  If one places more pride in being a socialist or communist or capitalist or Democrat or Republican, or a Christian or Muslim or Jew or Buddhist or Hindu, or a citizen of Texas or California or Vermont or Wyoming or Alaska, than one does in being an American, then one’s loyalty to one’s country is necessarily affected or influenced by the extent to which one identifies with that primary personal identity.  If the group(s) to which one belongs place similar emphasis on being this, or that, or the other, before being American, the same problem arises.</p><p>The trouble is, such divided loyalties end up weakening everybody – ourselves, our tribes, our communities, and our nation.</p></blockquote><p>No doubt that is true. But the problem with Peter’s thinking is that loyalty to an artificially constructed “nation-state” can be manufactured simply by everyone of goodwill electing to pretend that they are all part of the same nation. Even after <i>centuries </i>of being unified under a single British crown, the Scots voted for independence – it was the votes of the non-Scots resident in Scotland that caused the “Scottish” independence vote to fail.</p><p>And even Teddy Roosevelt himself said that “there ought to be no room” in the country for those who do not consider themselves to be Americans and nothing else. That means forcibly deporting most of the post-1965 immigrants, all of the Jews, and all of the African-Americans, just for starters. And that’s a more extreme position than that espoused by the average member of the Alt-Right. I very much doubt most of the civic nationalists who cite Roosevelt’s stirring rhetoric realize precisely what it is they are implicitly endorsing.</p><p>The rise of 4GW has broken the state’s monopoly on violence. Once nukes or other weapons of mass destruction are accessible to non-state actors, that will break the state’s monopoly on political legitimacy as well, because there will be strength without the numbers provided by unity.</p><p>And like nukes, identity politics are not going to disappear simply because some people happen to find them distasteful. Identity politics are not a Marxist plot or a “right-wing SJW” tactic, they are nothing less than the political environment in which Americans now find themselves due to their foolish and ruinous immigration policies of the last 53 years.</p></div>",
  "content_text": "Peter Grant\nresponds to critics and comments\nconcerning his original post on the existential threat posed by identity politics:\nOur society is built around the concept of a nation state as the focus of our loyalties, embodying our families, our tribes and our communities into a higher order of commitment.  As former President Theodore Roosevelt famously said in a 1915 speech:\nThere is no room in this country for hyphenated Americanism. When I refer to hyphenated Americans, I do not refer to naturalized Americans. Some of the very best Americans I have ever known were naturalized Americans, Americans born abroad. But a hyphenated American is not an American at all. This is just as true of the man who puts ‘native’ before the hyphen as of the man who puts German or Irish or English or French before the hyphen. Americanism is a matter of the spirit and of the soul. Our allegiance must be purely to the United States. We must unsparingly condemn any man who holds any other allegiance. But if he is heartily and singly loyal to this Republic, then no matter where he was born, he is just as good an American as anyone else.\nThe one absolutely certain way of bringing this nation to ruin, of preventing all possibility of its continuing to be a nation at all, would be to permit it to become a tangle of squabbling nationalities, an intricate knot of German-Americans, Irish-Americans, English-Americans, French-Americans, Scandinavian-Americans or Italian-Americans, each preserving its separate nationality, each at heart feeling more sympathy with Europeans of that nationality, than with the other citizens of the American Republic. The men who do not become Americans and nothing else are hyphenated Americans; and there ought to be no room for them in this country. The man who calls himself an American citizen and who yet shows by his actions that he is primarily the citizen of a foreign land, plays a thoroughly mischievous part in the life of our body politic. He has no place here; and the sooner he returns to the land to which he feels his real heart allegiance, the better it will be for every good American. There is no such thing as a hyphenated American who is a good American. The only man who is a good American is the man who is an American and nothing else.\nIf you believe in the concept of a specifically American nation, it’s hard to disagree with him.\nThe concept of a “tribe” can be inimical to this national identity.  If one places more pride in being a socialist or communist or capitalist or Democrat or Republican, or a Christian or Muslim or Jew or Buddhist or Hindu, or a citizen of Texas or California or Vermont or Wyoming or Alaska, than one does in being an American, then one’s loyalty to one’s country is necessarily affected or influenced by the extent to which one identifies with that primary personal identity.  If the group(s) to which one belongs place similar emphasis on being this, or that, or the other, before being American, the same problem arises.\nThe trouble is, such divided loyalties end up weakening everybody – ourselves, our tribes, our communities, and our nation.\nNo doubt that is true. But the problem with Peter’s thinking is that loyalty to an artificially constructed “nation-state” can be manufactured simply by everyone of goodwill electing to pretend that they are all part of the same nation. Even after\ncenturies\nof being unified under a single British crown, the Scots voted for independence – it was the votes of the non-Scots resident in Scotland that caused the “Scottish” independence vote to fail.\nAnd even Teddy Roosevelt himself said that “there ought to be no room” in the country for those who do not consider themselves to be Americans and nothing else. That means forcibly deporting most of the post-1965 immigrants, all of the Jews, and all of the African-Americans, just for starters. And that’s a more extreme position than that espoused by the average member of the Alt-Right. I very much doubt most of the civic nationalists who cite Roosevelt’s stirring rhetoric realize precisely what it is they are implicitly endorsing.\nThe rise of 4GW has broken the state’s monopoly on violence. Once nukes or other weapons of mass destruction are accessible to non-state actors, that will break the state’s monopoly on political legitimacy as well, because there will be strength without the numbers provided by unity.\nAnd like nukes, identity politics are not going to disappear simply because some people happen to find them distasteful. Identity politics are not a Marxist plot or a “right-wing SJW” tactic, they are nothing less than the political environment in which Americans now find themselves due to their foolish and ruinous immigration policies of the last 53 years.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-13T08:15:28+00:00"
}