{
  "url": "https://voxday.net/2018/09/21/right-but-wrong-again/",
  "scraped_at": "2025-12-19T21:22:20.288944",
  "title": "Right, but wrong. Again.",
  "date_display": "September 21, 2018",
  "date_iso": "2018-09-21T15:00:03+00:00",
  "date_from_url": "2018-09-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>ESR is an intelligent man, but he is fundamentally handicapped by his stubborn commitment to irreligion and his left-liberalism, which is why his diagnoses of the Left’s evils tend to be accurate, but <a href=\"http://esr.ibiblio.org/?p=260\">his predictions and prescriptions are reliably off-target</a>:</p><blockquote><p>One of the clearest lessons of recent times (exemplified not just by kaffiyeh-wearing western leftists but by Hamas’s recent clobbering of al-Fatah in the first Palestinian elections) is that po-mo leftism is weaker than liberal individualism in one important respect; it has only the weakest defenses against absolutist fervor. Brittingham tellingly notes po-mo philosopher Richard Rorty’s realization that when the babble of conflicting tribal narratives collapses in exhaustion, the only thing left is the will to power.</p><p>Again, this is by design. Lenin and Stalin wanted classical-liberal individualism replaced with something less able to resist totalitarianism, not more. Volk-Marxist fantasy and postmodern nihilism served their purposes; the emergence of an adhesive counter-ideology would not have. Thus, the Chomskys and Moores and Fisks are running a program carefully designed to dead-end at nothing.</p><p>Religions are good at filling that kind of nothing. Accordingly, if transnational progressivism actually succeeds in smothering liberal individualism, its reward will be to be put to the sword by some flavor of jihadi. Whether the eventual winners are Muslims or Mormons, the future is not going to look like the fuzzy multicultural ecotopia of modern left fantasy. The death of that dream is being written in European banlieus by angry Muslim youths under the light of burning cars.</p><p>In the banlieus and elsewhere, Islamist pressure makes it certain that sooner or later the West is going to vomit Stalin’s memes out of its body politic. The worst way would be through a reflex development of Western absolutism — Christian chauvinism, nativism and militarism melding into something like Francoite fascism. The self-panicking leftists who think they see that in today’s Republicans are comically wrong (as witnessed by the fact that they aren’t being systematically jailed and executed), but it is quite a plausible future for the demographically-collapsing nations of Europe.</p></blockquote><p>That’s not the worst way, it is the only way. If you want Western civilization to survive, then militant Christian nationalism is the only way that is going to happen. Period. Fools decry Franco, but he was one of the greatest leaders of the 20th century simply because he a) prevented his people from falling into the hands of the Communists, and, b) kept his nation out of World War II. Spain lost 4,500 soldiers from the Spanish Blue Division serving with the German Army in the USSR and promptly withdrew them. That was it. Italy, by contrast, lost 500,000 soldiers and civilians.</p><p>ESR notes that he and the Left were wrong about the past and that the Right was essentially correct. But note that this essay on suicidalism was written 12 years ago, and it’s already obvious that he was totally wrong to again put his faith in the liberal Left’s ability to control its extremists.</p><blockquote><p>I remain more optimistic than this. I think there is still an excellent chance that the West can recover from suicidalism without going through a fevered fascist episode and waging a genocidal war. But to do so, we have to do more than recognize Stalin’s memes; we have to reject them. We have to eject postmodern leftism from our universities, transnational progressivism from our politics, and volk-Marxism from our media.</p><p>The process won’t be pretty. But I fear that if the rest of us don’t hound the po-mo Left and its useful idiots out of public life with attack and ridicule and shunning, the hard Right will sooner or later get the power to do it by means that include a lot of killing. I don’t want to live in that future, and I don’t think any of my readers do, either. If we want to save a liberal, tolerant civilization for our children, we’d better get to work.</p></blockquote><p>The cure for suicidalism is not suicidalism lite. There is no saving “a liberal, tolerant civilization” because liberal tolerant civilizations are intrinsically suicidal. Most tolerant, civilized liberals can’t even bother to <i>have </i>children, let alone seek to save Western civilization for them.</p></div>",
  "content_text": "ESR is an intelligent man, but he is fundamentally handicapped by his stubborn commitment to irreligion and his left-liberalism, which is why his diagnoses of the Left’s evils tend to be accurate, but\nhis predictions and prescriptions are reliably off-target\n:\nOne of the clearest lessons of recent times (exemplified not just by kaffiyeh-wearing western leftists but by Hamas’s recent clobbering of al-Fatah in the first Palestinian elections) is that po-mo leftism is weaker than liberal individualism in one important respect; it has only the weakest defenses against absolutist fervor. Brittingham tellingly notes po-mo philosopher Richard Rorty’s realization that when the babble of conflicting tribal narratives collapses in exhaustion, the only thing left is the will to power.\nAgain, this is by design. Lenin and Stalin wanted classical-liberal individualism replaced with something less able to resist totalitarianism, not more. Volk-Marxist fantasy and postmodern nihilism served their purposes; the emergence of an adhesive counter-ideology would not have. Thus, the Chomskys and Moores and Fisks are running a program carefully designed to dead-end at nothing.\nReligions are good at filling that kind of nothing. Accordingly, if transnational progressivism actually succeeds in smothering liberal individualism, its reward will be to be put to the sword by some flavor of jihadi. Whether the eventual winners are Muslims or Mormons, the future is not going to look like the fuzzy multicultural ecotopia of modern left fantasy. The death of that dream is being written in European banlieus by angry Muslim youths under the light of burning cars.\nIn the banlieus and elsewhere, Islamist pressure makes it certain that sooner or later the West is going to vomit Stalin’s memes out of its body politic. The worst way would be through a reflex development of Western absolutism — Christian chauvinism, nativism and militarism melding into something like Francoite fascism. The self-panicking leftists who think they see that in today’s Republicans are comically wrong (as witnessed by the fact that they aren’t being systematically jailed and executed), but it is quite a plausible future for the demographically-collapsing nations of Europe.\nThat’s not the worst way, it is the only way. If you want Western civilization to survive, then militant Christian nationalism is the only way that is going to happen. Period. Fools decry Franco, but he was one of the greatest leaders of the 20th century simply because he a) prevented his people from falling into the hands of the Communists, and, b) kept his nation out of World War II. Spain lost 4,500 soldiers from the Spanish Blue Division serving with the German Army in the USSR and promptly withdrew them. That was it. Italy, by contrast, lost 500,000 soldiers and civilians.\nESR notes that he and the Left were wrong about the past and that the Right was essentially correct. But note that this essay on suicidalism was written 12 years ago, and it’s already obvious that he was totally wrong to again put his faith in the liberal Left’s ability to control its extremists.\nI remain more optimistic than this. I think there is still an excellent chance that the West can recover from suicidalism without going through a fevered fascist episode and waging a genocidal war. But to do so, we have to do more than recognize Stalin’s memes; we have to reject them. We have to eject postmodern leftism from our universities, transnational progressivism from our politics, and volk-Marxism from our media.\nThe process won’t be pretty. But I fear that if the rest of us don’t hound the po-mo Left and its useful idiots out of public life with attack and ridicule and shunning, the hard Right will sooner or later get the power to do it by means that include a lot of killing. I don’t want to live in that future, and I don’t think any of my readers do, either. If we want to save a liberal, tolerant civilization for our children, we’d better get to work.\nThe cure for suicidalism is not suicidalism lite. There is no saving “a liberal, tolerant civilization” because liberal tolerant civilizations are intrinsically suicidal. Most tolerant, civilized liberals can’t even bother to\nhave\nchildren, let alone seek to save Western civilization for them.",
  "tags": [
    "ClashofCivilizations"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-21T14:00:03+00:00"
}