{
  "url": "https://voxday.net/2018/09/24/the-pseudoscience-of-darwin/",
  "scraped_at": "2025-12-19T21:22:45.938874",
  "title": "The pseudoscience of Darwin",
  "date_display": "September 24, 2018",
  "date_iso": "2018-09-24T09:03:27+00:00",
  "date_from_url": "2018-09-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fred <a href=\"http://www.unz.com/freed/darwins-vigilantes-reichard-sternberg-and-conventional-pseudoscience/\">is tormenting the true believers</a> with observable facts again:</p><blockquote><p>Science is supposed to be objective study of nature, impelled by a willingness to follow the evidence impartially wherever it leads. For the most part it works this way. In the case of emotionally charged topics, it does not. For example, racial intelligence, cognitive differences between the sexes, and weaknesses in Darwinian evolution. Scientists who do perfectly good research in these fields, but arrive at forbidden conclusions, will be hounded out of their fields, fired from academic and research positions, blackballed from employment, and have their careers destroyed.</p><p>A prime example is Richard Sternberg, a Ph.D. in biology (Molecular Evolution) from Florida International University and a Ph.D. in Systems Science (Theoretical Biology) from Binghamton University. He is not a lightweight. From 2001-2007 he was staff scientist at the National Center for Biotechnology Information; 2001-2007 a Research Associate at the Smithsonian’s National Museum of Natural History.</p><p>Hell broke loose when he authorized in 2004 the publication, in the <i>Proceedings of the Biological Society of Washington</i>, an organ of the Smithsonian Institution, of a peer-reviewed article, <i>The Origin of Biological Information and the Higher taxonomic Categories</i> by Stephen Meyer. It dealt with the possibility of intelligent design as an explanation of aspects of Darwinism not explainable by the conventional theory. This is a serious no-no among the guardians of conventional Darwinism, the political correctness of science.</p><p>At the Smithsonian, he was demoted, denied access to specimens he needed in his work, transferred to work under a hostile supervisor, and lost his office space. In the ensuring storm of hatred, two separate federal investigations concluded that he had been made the target of malicious treatment.</p><p>Predictably, the establishment dismisses Meyer’s idea ass “pseudoscience”:</p><p>Wikipedia: <i>The Sternberg peer review controversy concerns the conflict arising from the publication of an article supporting the pseudo-scientific concept of intelligent design in a scientific journal, and the subsequent questions of whether proper editorial procedures had been followed and whether it was properly peer reviewed.</i></p><p>Pseudoscience? Does not Darwinism itself qualify as pseudoscience? It is firmly based on no evidence. For most readers this assertion will seem as delusional as saying that the sun revolves around the earth. This is because we have been indoctrinated since birth in the Darwinian myth.</p></blockquote><p>Like Fred, I am an evolutionary skeptic, not because of intelligent design or most of the issues that Fred raises, but because I have never observed any evolutionist able to demonstrate an adequate ability to address, let alone successfully answer, the direct questions about evolution posed to them. Instead, they always – always – attempt to turn the discussion to the Book of Genesis, the age of the Earth, Christianity, the public school system, or some other topic totally unrelated to the one at hand instead.</p><p>That is why I am still a skeptic concerning the secularism’s epic myth, despite having read every book ever published by Richard Dawkins, despite having read Wilson, and Gould, and Shermer, and Hauser, and a number of other well-regarded evolutionary popularizers.  At this point, it might be more accurate to say I am an evolutionary skeptic <i>because </i>I have read those books and been astounded by the panoply of obvious logical flaws, evasions, and handwaving that I have encountered in them.</p><p>I was pleased to recently run across one of my favorite quotes, from the Pharyngula days of yore:</p><p><i>Keynesian economics, like evolutionary biology, has an outstanding record of success, and has become the foundation for a vast amount of productive work in its field. </i></p></div>",
  "content_text": "Fred\nis tormenting the true believers\nwith observable facts again:\nScience is supposed to be objective study of nature, impelled by a willingness to follow the evidence impartially wherever it leads. For the most part it works this way. In the case of emotionally charged topics, it does not. For example, racial intelligence, cognitive differences between the sexes, and weaknesses in Darwinian evolution. Scientists who do perfectly good research in these fields, but arrive at forbidden conclusions, will be hounded out of their fields, fired from academic and research positions, blackballed from employment, and have their careers destroyed.\nA prime example is Richard Sternberg, a Ph.D. in biology (Molecular Evolution) from Florida International University and a Ph.D. in Systems Science (Theoretical Biology) from Binghamton University. He is not a lightweight. From 2001-2007 he was staff scientist at the National Center for Biotechnology Information; 2001-2007 a Research Associate at the Smithsonian’s National Museum of Natural History.\nHell broke loose when he authorized in 2004 the publication, in the\nProceedings of the Biological Society of Washington\n, an organ of the Smithsonian Institution, of a peer-reviewed article,\nThe Origin of Biological Information and the Higher taxonomic Categories\nby Stephen Meyer. It dealt with the possibility of intelligent design as an explanation of aspects of Darwinism not explainable by the conventional theory. This is a serious no-no among the guardians of conventional Darwinism, the political correctness of science.\nAt the Smithsonian, he was demoted, denied access to specimens he needed in his work, transferred to work under a hostile supervisor, and lost his office space. In the ensuring storm of hatred, two separate federal investigations concluded that he had been made the target of malicious treatment.\nPredictably, the establishment dismisses Meyer’s idea ass “pseudoscience”:\nWikipedia:\nThe Sternberg peer review controversy concerns the conflict arising from the publication of an article supporting the pseudo-scientific concept of intelligent design in a scientific journal, and the subsequent questions of whether proper editorial procedures had been followed and whether it was properly peer reviewed.\nPseudoscience? Does not Darwinism itself qualify as pseudoscience? It is firmly based on no evidence. For most readers this assertion will seem as delusional as saying that the sun revolves around the earth. This is because we have been indoctrinated since birth in the Darwinian myth.\nLike Fred, I am an evolutionary skeptic, not because of intelligent design or most of the issues that Fred raises, but because I have never observed any evolutionist able to demonstrate an adequate ability to address, let alone successfully answer, the direct questions about evolution posed to them. Instead, they always – always – attempt to turn the discussion to the Book of Genesis, the age of the Earth, Christianity, the public school system, or some other topic totally unrelated to the one at hand instead.\nThat is why I am still a skeptic concerning the secularism’s epic myth, despite having read every book ever published by Richard Dawkins, despite having read Wilson, and Gould, and Shermer, and Hauser, and a number of other well-regarded evolutionary popularizers.  At this point, it might be more accurate to say I am an evolutionary skeptic\nbecause\nI have read those books and been astounded by the panoply of obvious logical flaws, evasions, and handwaving that I have encountered in them.\nI was pleased to recently run across one of my favorite quotes, from the Pharyngula days of yore:\nKeynesian economics, like evolutionary biology, has an outstanding record of success, and has become the foundation for a vast amount of productive work in its field.",
  "tags": [
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-24T08:03:27+00:00"
}