{
  "url": "https://voxday.net/2018/09/04/the-secret-of-the-comicartistpro/",
  "scraped_at": "2025-12-19T21:19:49.552019",
  "title": "The secret of the ComicArtistPro",
  "date_display": "September 4, 2018",
  "date_iso": "2018-09-04T16:38:30+00:00",
  "date_from_url": "2018-09-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We’ve played nice with Two-Face van Soyver and his merry band of Comicsgatekeepers to date despite their incessant sniping. But I don’t know if it’s going to be possible to continue doing so for much longer, in light of <a href=\"https://www.youtube.com/watch?v=3utMhoPRvd8\">the little Kabuki theater</a> he is presently putting on for the crowd.</p><blockquote><p>Everybody’s cursing him out in the chat  what a tool they’re saying what a shit  move, ComicsGate, it is, what a shit move, let Ethan have it, please don’t be petty!  He won’t show his face, he’s  behind a screen right now. Vox is a piece  of shit can you go any lower from here? People are saying this might be the best  stream we’ve ever done nice, a great time, there he is. I see you Vox! You did not  start this gangster shit, Vox. The problem, Vox, is  that it did belong to everyone and then  you stole it for yourself, that’s the  problem. He’s laughing, cuz Vox watches  the chat very closely. Oh man, we got our people over there  trolling and big-time beautiful. He’s smirking, look at him! Vox  I do own it, I do own it!  Swallow hard, swallow, Vox. He thought, he  was, he’s like in one year I’m gonna be  more relevant than Ethan Van Sciver. How’s that going?</p><p>The dark  stream? Dude, I mean go get that checked out that’s  not that a joke. Another scam artist, somebody said, why is that  anus talking he said. Way to turn ComicsGate against you. I mean  what Vox doesn’t understand is that I  think a few of our people were actually  supporting Alt-Hero and that’s  gonna go bye-bye. Vox yeah  yeah the ratio did I mean dude not even  close  like if if we say so if ComicsGate says  so that’s it for Alt-Hero. that’s it for Alt-Hero. 34 likes and 304 dislikes right now on  the dark stream, 324 dark stream, yeah  he’s peeing blood right now look you  can’t, you don’t we’re not here to  be taken, we’re not here to be taken Vox, you can’t co-opt us, you can’t, you can’t  do it. I know you’re trying, it’s not  working, give up, let it go. Oh, feel it  slipping through your fingers    that’s ComicsGate, bitch! Dude’s not going to work out. He’s got to stop.</p></blockquote><p>Now, that’s a <i>very </i>convincing performance, until you learn that I ran the idea of creating a comics imprint called ComicsGate past a well-known professional comic artist last week and he actually <i>approved </i>of the idea, albeit with a few concerns about how it would play out. But he certainly had no objections, especially after I pointed out that any SJW-converged publisher with access could do exactly the same thing in a manner of seconds. It wasn’t until the <i>Bounding Into Comics</i> piece ran and he realized how badly his fans were reacting badly to the idea that “the brand” was being “stolen” that he turned around, pretended not to know anything about it, and feigned being surprised and outraged.</p><p>Still, don’t take my word about the identity of this professional comic artist. Just ask ol’ Uncle Ethan when he first learned about my intention to create a ComicsGate imprint.</p><p>In case you don’t believe good ‘ol Uncle Ethan would lie so shamelessly to his fellow ComicsGatekeepers, consider <a href=\"https://www.youtube.com/watch?v=4LTfqfF9MtE\">his revisionist description</a> of last night’s Darkstream this morning.</p><blockquote class=\"tr_bq\"><p>By the way, Vox calls himself the Dark Lord. I took the mantle of Dark Lord from him last night and his live stream just said EVS is the Dark Lord, EVS is the Dark Lord up there, he looked very upset, he looked like he was gonna cry, and he cancelled it early. He left in mid-sentence, he just he bombed his chat out. March, march tower armies on Vox Day, and I believe we conquered him.</p></blockquote><p>Translation: Ethan may be far more upset about this than any of us would have imagined. SJWs aren’t the only people who project. It was informative to see how he described our emails in detail last night, but said absolutely nothing about our 30-minute 55-second conversation on August 29th.</p><p>And since Two-Face Van Soyver is talking about emails, here are a pair of not-entirely-irrelevant emails I sent out to someone last week.</p><blockquote><p><u><b>8/29/2018 7:59 AM</b></u></p><p><i>From [REDACTED]:</i><br><i><br/></i><i>The imprint [REDACTED] has been added to your account as requested. </i><br><i><br/></i><i><br/></i><u><b>9/2/2018 2:30 PM</b></u><br><i><br/></i><i>Hey [REDACTED],</i><br><i><br/></i><i>Congrats on the variant cover killing it. Below is a link to AH#4: The War in Paris in case you’re interested. Also, we’ll make the [REDACTED] announcement on Tuesday when we publish Gun Ghoul in print.</i></br></br></br></br></p></blockquote><p>Obviously, we didn’t make the announcement on Tuesday, but moved it up one day when the print edition of <i><b><a href=\"https://aerbook.com/maker/productcard-4032460-1875.html\">Gun Ghoul</a></b></i> got through the system and onto our direct store faster than we’d anticipated, because <i>Bounding Into Comics</i> had the story ready to go and was eager to run it.</p></div>",
  "content_text": "We’ve played nice with Two-Face van Soyver and his merry band of Comicsgatekeepers to date despite their incessant sniping. But I don’t know if it’s going to be possible to continue doing so for much longer, in light of\nthe little Kabuki theater\nhe is presently putting on for the crowd.\nEverybody’s cursing him out in the chat  what a tool they’re saying what a shit  move, ComicsGate, it is, what a shit move, let Ethan have it, please don’t be petty!  He won’t show his face, he’s  behind a screen right now. Vox is a piece  of shit can you go any lower from here? People are saying this might be the best  stream we’ve ever done nice, a great time, there he is. I see you Vox! You did not  start this gangster shit, Vox. The problem, Vox, is  that it did belong to everyone and then  you stole it for yourself, that’s the  problem. He’s laughing, cuz Vox watches  the chat very closely. Oh man, we got our people over there  trolling and big-time beautiful. He’s smirking, look at him! Vox  I do own it, I do own it!  Swallow hard, swallow, Vox. He thought, he  was, he’s like in one year I’m gonna be  more relevant than Ethan Van Sciver. How’s that going?\nThe dark  stream? Dude, I mean go get that checked out that’s  not that a joke. Another scam artist, somebody said, why is that  anus talking he said. Way to turn ComicsGate against you. I mean  what Vox doesn’t understand is that I  think a few of our people were actually  supporting Alt-Hero and that’s  gonna go bye-bye. Vox yeah  yeah the ratio did I mean dude not even  close  like if if we say so if ComicsGate says  so that’s it for Alt-Hero. that’s it for Alt-Hero. 34 likes and 304 dislikes right now on  the dark stream, 324 dark stream, yeah  he’s peeing blood right now look you  can’t, you don’t we’re not here to  be taken, we’re not here to be taken Vox, you can’t co-opt us, you can’t, you can’t  do it. I know you’re trying, it’s not  working, give up, let it go. Oh, feel it  slipping through your fingers    that’s ComicsGate, bitch! Dude’s not going to work out. He’s got to stop.\nNow, that’s a\nvery\nconvincing performance, until you learn that I ran the idea of creating a comics imprint called ComicsGate past a well-known professional comic artist last week and he actually\napproved\nof the idea, albeit with a few concerns about how it would play out. But he certainly had no objections, especially after I pointed out that any SJW-converged publisher with access could do exactly the same thing in a manner of seconds. It wasn’t until the\nBounding Into Comics\npiece ran and he realized how badly his fans were reacting badly to the idea that “the brand” was being “stolen” that he turned around, pretended not to know anything about it, and feigned being surprised and outraged.\nStill, don’t take my word about the identity of this professional comic artist. Just ask ol’ Uncle Ethan when he first learned about my intention to create a ComicsGate imprint.\nIn case you don’t believe good ‘ol Uncle Ethan would lie so shamelessly to his fellow ComicsGatekeepers, consider\nhis revisionist description\nof last night’s Darkstream this morning.\nBy the way, Vox calls himself the Dark Lord. I took the mantle of Dark Lord from him last night and his live stream just said EVS is the Dark Lord, EVS is the Dark Lord up there, he looked very upset, he looked like he was gonna cry, and he cancelled it early. He left in mid-sentence, he just he bombed his chat out. March, march tower armies on Vox Day, and I believe we conquered him.\nTranslation: Ethan may be far more upset about this than any of us would have imagined. SJWs aren’t the only people who project. It was informative to see how he described our emails in detail last night, but said absolutely nothing about our 30-minute 55-second conversation on August 29th.\nAnd since Two-Face Van Soyver is talking about emails, here are a pair of not-entirely-irrelevant emails I sent out to someone last week.\n8/29/2018 7:59 AM\nFrom [REDACTED]:\nThe imprint [REDACTED] has been added to your account as requested.\n9/2/2018 2:30 PM\nHey [REDACTED],\nCongrats on the variant cover killing it. Below is a link to AH#4: The War in Paris in case you’re interested. Also, we’ll make the [REDACTED] announcement on Tuesday when we publish Gun Ghoul in print.\nObviously, we didn’t make the announcement on Tuesday, but moved it up one day when the print edition of\nGun Ghoul\ngot through the system and onto our direct store faster than we’d anticipated, because\nBounding Into Comics\nhad the story ready to go and was eager to run it.",
  "tags": [
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-04T15:38:30+00:00"
}