{
  "url": "https://voxday.net/2018/09/25/the-darwinian-fraud/",
  "scraped_at": "2025-12-19T21:22:53.388127",
  "title": "The Darwinian fraud",
  "date_display": "September 25, 2018",
  "date_iso": "2018-09-25T09:43:50+00:00",
  "date_from_url": "2018-09-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>The late Larry Auster was also an evolutionary skeptic. He wrote this back in 2010.</i></p><p><b>The Darwinian theory of evolution is a fraud—and it’s not Lawrence Auster who says that, it’s the <i>Darwinian scientists</i> who say it</b></p><p>Many times I have pointed out that the critics of the Darwinian theory of evolution do not need to prove that the theory fails to explain the origin of species by random mutation and natural selection, because the theory’s advocates frequently <a href=\"http://www.amnation.com/vfr/archives/012477.html\">admit the same</a>. Yet in a massive exercise of Orwellian doublethink, even while scientists repeatedly confess, if <i>sotto voce</i>, that the theory does not explain what it purports to explain (yes, it explains micro-changes within a life form, but not the evolution of new life forms), they and the whole world simultaneously keep declaring that the Darwinian theory has the status of proven fact, as true as the theory of gravity, and that anyone who doubts this is a faith-crazed moron barely worthy of the adjective “human.”</p><p>However, here’s an admission from the evolutionary establishment that really takes the cake. In their 2005 book, <i>The Plausibility of Life: Resolving Darwin’s Dilemma</i> (dilemma? dilemma? Darwin has a dilemma?), evolutionary scientists Marc Kirschner and John Gerhart come right out and declare that up to this point, evolutionary science has not shown how Darwinian evolution produces new organs, new species, new life forms. The fly leaf of the book says:</p><blockquote class=\"tr_bq\"><p>In the 150 years since Darwin, the field of evolutionary biology has left a glaring gap in understanding how animals developed their astounding variety and complexity. The answer has been that small genetic mutations accumulate over time to produce wondrous innovations such as eyes and wings. Drawing on cutting-edge research across the spectrum of modern biology, Marc Kirschner and John Gerhart demonstrate how this stock answer is woefully inadequate. <b>[LA replies: Meaning, the Darwinian theory of evolution by random genetic mutations and natural selection is woefully inadequate.]</b> Rather they offer an original solution to the long-standing puzzle of how small random genetic change can be converted into complex useful innovations.</p></blockquote><p>So, an entirely original theory is needed to explain how random mutations can accumulate into functional new biological forms. Meaning that the explanations offered up to this point have been wrong. Meaning that everything we’ve been told about how evolutionary theory has the status of proven fact has been false.</p><p>Yet (remember, we’re living in an Orwellian world) Kirschner and Gerhart’s astounding admission has not entered into the general public consciousness. One reason it hasn’t can be seen in <a href=\"http://www.nysun.com/arts/darwins-dilemma-resolved/24368/\">Paul R. Gross’s review of the book</a> in the <i>New York Sun</i> in 2005. Gross spent the first half of the review pounding his chest about how perfect and complete and absolutely unquestionable the Darwinian theory is, until, in the second half of the review, he quietly admitted that some eentsy teentsy issues still remain to be demonstrated, like, you know, <b><i>how new species evolved</i></b>. Yet so assured was Gross’s propaganda in the first half of the article, that his dramatic admission in the second half made no impact. Only a careful reader would notice it. And most people do not read carefully.</p></div>",
  "content_text": "The late Larry Auster was also an evolutionary skeptic. He wrote this back in 2010.\nThe Darwinian theory of evolution is a fraud—and it’s not Lawrence Auster who says that, it’s the\nDarwinian scientists\nwho say it\nMany times I have pointed out that the critics of the Darwinian theory of evolution do not need to prove that the theory fails to explain the origin of species by random mutation and natural selection, because the theory’s advocates frequently\nadmit the same\n. Yet in a massive exercise of Orwellian doublethink, even while scientists repeatedly confess, if\nsotto voce\n, that the theory does not explain what it purports to explain (yes, it explains micro-changes within a life form, but not the evolution of new life forms), they and the whole world simultaneously keep declaring that the Darwinian theory has the status of proven fact, as true as the theory of gravity, and that anyone who doubts this is a faith-crazed moron barely worthy of the adjective “human.”\nHowever, here’s an admission from the evolutionary establishment that really takes the cake. In their 2005 book,\nThe Plausibility of Life: Resolving Darwin’s Dilemma\n(dilemma? dilemma? Darwin has a dilemma?), evolutionary scientists Marc Kirschner and John Gerhart come right out and declare that up to this point, evolutionary science has not shown how Darwinian evolution produces new organs, new species, new life forms. The fly leaf of the book says:\nIn the 150 years since Darwin, the field of evolutionary biology has left a glaring gap in understanding how animals developed their astounding variety and complexity. The answer has been that small genetic mutations accumulate over time to produce wondrous innovations such as eyes and wings. Drawing on cutting-edge research across the spectrum of modern biology, Marc Kirschner and John Gerhart demonstrate how this stock answer is woefully inadequate.\n[LA replies: Meaning, the Darwinian theory of evolution by random genetic mutations and natural selection is woefully inadequate.]\nRather they offer an original solution to the long-standing puzzle of how small random genetic change can be converted into complex useful innovations.\nSo, an entirely original theory is needed to explain how random mutations can accumulate into functional new biological forms. Meaning that the explanations offered up to this point have been wrong. Meaning that everything we’ve been told about how evolutionary theory has the status of proven fact has been false.\nYet (remember, we’re living in an Orwellian world) Kirschner and Gerhart’s astounding admission has not entered into the general public consciousness. One reason it hasn’t can be seen in\nPaul R. Gross’s review of the book\nin the\nNew York Sun\nin 2005. Gross spent the first half of the review pounding his chest about how perfect and complete and absolutely unquestionable the Darwinian theory is, until, in the second half of the review, he quietly admitted that some eentsy teentsy issues still remain to be demonstrated, like, you know,\nhow new species evolved\n. Yet so assured was Gross’s propaganda in the first half of the article, that his dramatic admission in the second half made no impact. Only a careful reader would notice it. And most people do not read carefully.",
  "tags": [
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-25T08:43:50+00:00"
}