{
  "url": "https://voxday.net/2018/09/20/the-excuses-start-early/",
  "scraped_at": "2025-12-19T21:22:12.942939",
  "title": "The excuses start early",
  "date_display": "September 20, 2018",
  "date_iso": "2018-09-20T18:03:04+00:00",
  "date_from_url": "2018-09-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The media <a href=\"https://www.houstonchronicle.com/news/houston-texas/houston/article/Texas-Democrats-should-be-demoralized-by-13242703.php\">is already planting the seeds</a> for explaining away the mysterious absence of the Democrats much-predicted “Blue Wave” in November:</p><blockquote><p>Many Texas Democrats were demoralized Tuesday, when Republican Pete Flores defeated Democrat Pete Gallego in a runoff special election for the Texas Senate seat vacated in June by the resignation of Democrat Carlos Uresti.</p><p>They should be demoralized. It was a potentially consequential loss. Democrats have no one but themselves to blame for it. Flores’ victory doesn’t necessarily suggest that a “red wave” is coming to Texas in this year’s midterm elections, as many Republicans were quick to claim. But the Texas Democratic Party’s response to Gallego’s defeat does not augur well for their prospects of competing successfully.</p></blockquote><p>I have said before, and I will say again, there will be no “Blue Wave” in November. I don’t know if I am more amused or disappointed in those of you who – again – insist on falling for the mainstream media narrative.</p><p>Have you truly not figured out yet that they cannot be trusted? Do you truly not realize that they knowingly speak falsehoods, hoping to transform those falsehoods into truth by convincing you to accept their false narrative?</p><p>Even when the economy is not doing well, even when the Democrats are not nominating their most left-wing, most diverse, most unelectable candidates, <i>the average Republican midterm loss is only 11 seats</i>. This would reduce the Republican majority from 43 seats to 32 seats. Hardly a cause for panic.</p></div>",
  "content_text": "The media\nis already planting the seeds\nfor explaining away the mysterious absence of the Democrats much-predicted “Blue Wave” in November:\nMany Texas Democrats were demoralized Tuesday, when Republican Pete Flores defeated Democrat Pete Gallego in a runoff special election for the Texas Senate seat vacated in June by the resignation of Democrat Carlos Uresti.\nThey should be demoralized. It was a potentially consequential loss. Democrats have no one but themselves to blame for it. Flores’ victory doesn’t necessarily suggest that a “red wave” is coming to Texas in this year’s midterm elections, as many Republicans were quick to claim. But the Texas Democratic Party’s response to Gallego’s defeat does not augur well for their prospects of competing successfully.\nI have said before, and I will say again, there will be no “Blue Wave” in November. I don’t know if I am more amused or disappointed in those of you who – again – insist on falling for the mainstream media narrative.\nHave you truly not figured out yet that they cannot be trusted? Do you truly not realize that they knowingly speak falsehoods, hoping to transform those falsehoods into truth by convincing you to accept their false narrative?\nEven when the economy is not doing well, even when the Democrats are not nominating their most left-wing, most diverse, most unelectable candidates,\nthe average Republican midterm loss is only 11 seats\n. This would reduce the Republican majority from 43 seats to 32 seats. Hardly a cause for panic.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-20T17:03:04+00:00"
}