{
  "url": "https://voxday.net/2018/09/30/the-marvel-philosophy/",
  "scraped_at": "2025-12-20T05:10:32.000660",
  "title": "The Marvel philosophy",
  "date_display": "September 30, 2018",
  "date_iso": "2018-09-30T13:14:04+00:00",
  "date_from_url": "2018-09-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After reading <a href=\"https://www.dailymail.co.uk/tvshowbiz/article-6221953/Terrence-Howard-49-never-return-Marvel-fighting-Robert-Downey-Jr-Iron-Man.html\">this account of the falling out</a> between Terrence Howard and Robert Downey Jr., I very much look forward to competing with Marvel in the movie space:</p><blockquote><p>Appearing on Watch What Happens Live, a caller asked Howard if he would ever appear in a future Marvel film now he is civil with Robert again.</p><p>Prompting him to reply: ‘You know what’s so funny? Even though I love Don Cheadle so much and I love what he’s done, I still hear a lot of fans asking, “Am I going to come back and be War Machine? Am I going to come back and be War Machine? I think they could have a huge franchise off of it. But f*** ’em.’</p><p>The feud began after Howard accused Downey, 53, of abandoning him when he tried to negotiate a better fee to appear in Iron Man 2.</p><p>He previously explained: ‘We did a three-picture deal, so that means that you did the deal ahead of time. It was going to be a certain amount for the first one, a certain amount for the second one, a certain amount for the third.</p><p>‘They came to me with the second and said, ‘Look, we will pay you one-eighth of what we contractually had for you, because we think the second one will be successful with or without you.’ And I called my friend – that I helped get the first job – and he didn’t call me back for three months.’</p></blockquote><p>In other words, Howard didn’t try “to negotiate a better fee,” he tried to get paid <i>what he was contractually obligated to be paid</i>. Marvel tried to stiff him of 7/8ths of what he was supposed to be paid because they calculated, correctly, that his presence was not required for a successful sequel, so he walked away.</p><p>This behavior is completely consistent with what we have learned of Marvel’s treatment of freelance illustrators and colorists; their behavior towards writers tends to be even worse. It’s informative to learn that while Howard has forgiven Downey for not having had his back, he has neither forgiven nor forgotten Marvel’s shoddy treatment of him.</p><p>As you may have noted, nearly all of Castalia’s, Arkhaven’s, and Dark Legion’s various creators continue to work with us, and even those few who don’t tend to remain on good terms with us and may well work with us in the future. And on a not-entirely-unrelated subject, Bounding Into Comics <a href=\"https://boundingintocomics.com/2018/09/30/marvels-sana-amanat-gushes-over-disney-channels-marvel-rising/\">is less than entirely enthusiastic</a> about the upcoming Disney Channel film, <i>Marvel Rising: Secret Warriors</i>.</p><blockquote class=\"tr_bq\"><p>Looking at the Comichron numbers for the one-shot comics under the Marvel Rising brand, they are rather poor. In June, Marvel Rising Alpha would only ship 21,290 units. It didn’t even make the top 100 comics for the month. July would see Marvel Rising: Squirrel Girl/Ms. Marvel only ship 17,995 units. And then a different Marvel Rising: Squirrel Girl/Ms. Marvel would only ship 15,558 units in August.</p></blockquote><p>If one takes into account the average sell-through percentage, <i>Alt★Hero</i> is already competing very effectively with the <i>Marvel Rising</i> brand without taking the crowdfunding aspect into account. And we’re not even in the comic stores yet.</p></div>",
  "content_text": "After reading\nthis account of the falling out\nbetween Terrence Howard and Robert Downey Jr., I very much look forward to competing with Marvel in the movie space:\nAppearing on Watch What Happens Live, a caller asked Howard if he would ever appear in a future Marvel film now he is civil with Robert again.\nPrompting him to reply: ‘You know what’s so funny? Even though I love Don Cheadle so much and I love what he’s done, I still hear a lot of fans asking, “Am I going to come back and be War Machine? Am I going to come back and be War Machine? I think they could have a huge franchise off of it. But f*** ’em.’\nThe feud began after Howard accused Downey, 53, of abandoning him when he tried to negotiate a better fee to appear in Iron Man 2.\nHe previously explained: ‘We did a three-picture deal, so that means that you did the deal ahead of time. It was going to be a certain amount for the first one, a certain amount for the second one, a certain amount for the third.\n‘They came to me with the second and said, ‘Look, we will pay you one-eighth of what we contractually had for you, because we think the second one will be successful with or without you.’ And I called my friend – that I helped get the first job – and he didn’t call me back for three months.’\nIn other words, Howard didn’t try “to negotiate a better fee,” he tried to get paid\nwhat he was contractually obligated to be paid\n. Marvel tried to stiff him of 7/8ths of what he was supposed to be paid because they calculated, correctly, that his presence was not required for a successful sequel, so he walked away.\nThis behavior is completely consistent with what we have learned of Marvel’s treatment of freelance illustrators and colorists; their behavior towards writers tends to be even worse. It’s informative to learn that while Howard has forgiven Downey for not having had his back, he has neither forgiven nor forgotten Marvel’s shoddy treatment of him.\nAs you may have noted, nearly all of Castalia’s, Arkhaven’s, and Dark Legion’s various creators continue to work with us, and even those few who don’t tend to remain on good terms with us and may well work with us in the future. And on a not-entirely-unrelated subject, Bounding Into Comics\nis less than entirely enthusiastic\nabout the upcoming Disney Channel film,\nMarvel Rising: Secret Warriors\n.\nLooking at the Comichron numbers for the one-shot comics under the Marvel Rising brand, they are rather poor. In June, Marvel Rising Alpha would only ship 21,290 units. It didn’t even make the top 100 comics for the month. July would see Marvel Rising: Squirrel Girl/Ms. Marvel only ship 17,995 units. And then a different Marvel Rising: Squirrel Girl/Ms. Marvel would only ship 15,558 units in August.\nIf one takes into account the average sell-through percentage,\nAlt★Hero\nis already competing very effectively with the\nMarvel Rising\nbrand without taking the crowdfunding aspect into account. And we’re not even in the comic stores yet.",
  "tags": [
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-30T12:14:04+00:00"
}