{
  "url": "https://voxday.net/2018/09/28/trust-not-in-personality/",
  "scraped_at": "2025-12-20T05:10:15.747764",
  "title": "Trust not in personality",
  "date_display": "September 28, 2018",
  "date_iso": "2018-09-28T12:00:51+00:00",
  "date_from_url": "2018-09-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Because in the end, <a href=\"https://www.bbc.com/news/technology-45664640\">a cuck is always going to cuck</a>, because nothing, literally <i>nothing</i>, is more important to him than not being identified as one of the SJW-denominated “bad guys”:</p><blockquote><p><i>In an exclusive email to the BBC, Mr Torvalds shared his thoughts on his decision to temporarily step aside, the controversy behind the CoC, and the defects of the community he set up.</i></p><p>“So I’ve obviously long been on record as wanting to deal with the technical side, and not really wanting to get involved in most other discussions.</p><p>“Because technology is what I have always found interesting. People? Not my forte. Never has been, clearly. If you watched that TED talk, you’ll know I wasn’t a people person even as a child.</p><p>“And if you have read any of the recent stories, you will now know at least one other reason why I’ve wanted to stay away from that whole discussion. Because it’s not just my lack of people skills. It’s the discussions themselves.</p><p>“The advantage of concentrating on technology is that you can have some mostly objective measures, and some basis for agreement, and you can have a very nice and healthy community around it all. I really am motivated by the technology, but the community around Linux has been a big positive too.</p><p>“But there are very tangible and immediate common goals in any technical project like Linux, and while there is occasionally disagreement about how to solve some particular issue, there is a very real cohesive force in that common goal of improving the project.</p><p>“And even when there are disagreements, people in the end often have fairly clear and objective measures of what is better. Code that is faster, simpler, or handles more cases naturally is just objectively ‘better’, without people really having to argue too much about it.</p><p>“In contrast, the arguments about behaviour never seem to end up having a common goal. Except, in some sense, the argument itself.</p><p>“Have you read the Twitter feeds and other things by the people who seem to care more about the non-technical side? I think your ‘hyped stories’ is about as polite as you can put it. It’s a morass of nastiness. Instead of a ‘common goal’, you end up with horrible fighting between different ‘in-groups’.</p><p>“It’s very polarising, and both sides love egging the other side on. It’s not even a ‘discussion’, it’s just people shouting at each other.</p><p>“That’s actually the reason I for the longest time did not want to be involved with the whole CoC discussion in the first place. That whole subject seems to very easily just devolve and become unproductive. And I found a lot of the people who pushed for a CoC and criticised me for cursing to be hypocritical and pointless. I could easily point you to various tweet storms by people who criticise my ‘white cis male’ behaviour, while at the same time cursing more than I ever do.</p><p>“So that’s my excuse for dismissing a lot of the politically correct concerns for years. I felt it wasn’t worth it. Anybody who uses the words ‘white cis male privilege’ was simply not worth my time even talking to, I felt.</p><p>“And I’m still not apologising for my gender or the colour of my skin, or the fact that I happen to have the common sexual orientation.</p><p>“What changed? Maybe it was me, but I was also made very aware of some of the behaviour of the ‘other’ side in the discussion.</p><p>“Because I may have my reservations about excessive political correctness, but honestly, <u>I absolutely do not want to be seen as being in the same camp as the low-life scum on the internet that think it’s OK to be a white nationalist Nazi, and have some truly nasty misogynistic, homophobic or transphobic behaviour.</u> And those people were complaining about too much political correctness too, and in the process just making my public stance look bad.</p><p>“And don’t get me wrong, please – I’m not making excuses for some of my own rather strong language. But I do claim that it never ever was any of that kind of nastiness. I got upset with bad code, and people who made excuses for it, and used some pretty strong language in the process. Not good behaviour, but not the racist/etc claptrap some people spout.</p><p>“So in the end, my ‘I really don’t want to be too PC’ stance simply became untenable. Partly because you definitely can find some emails from me that were simply completely unacceptable, and I need to fix that going forward. But to a large degree also because <u>I don’t want to be associated with a lot of the people who complain about excessive political correctness.</u></p><p>“Am I turning into some cuddly people person? I’ll admit that sounds very unlikely. I still care about the technology, and I’m still not exactly the most empathetic person. But I’m hoping I can at least ‘fake it until I make it’. Part of that ‘faking it’ is definitely going to be a filter on my outgoing emails, but as mentioned, I’m actively also trying to find a professional therapist to talk to as well.</p><p>“Will everybody be happy? No. People who don’t like my blunt behaviour even when I’m not being actively nasty about it will just see that as ‘look, nothing changed’. I’m trying to get rid of my outbursts, and be more polite about things, but technically wrong is still technically wrong, and I won’t start accepting bad code just to make people feel better about themselves.</p><p>“But if people at least realise that <u>I’m not part of the disgusting underbelly of the internet</u> that thinks it’s OK to show the kind of behaviour you will find if you really have been reading up on the ‘discussions’ about the code of conduct, then even that will be a really good thing.</p><p>“And again – the above is just my explanation of why I applied the CoC even if there is obviously discussion about it. We will have the maintainer summit in Edinburgh next month, and we’ll talk about this issue a lot more.</p><p>“In the meantime, I’m taking a break from the kernel and probably shouldn’t talk to journalists.”</p></blockquote><p>There are the three key phrases that explain his previously inexplicable actions:</p><ul><li><i>I absolutely do not want to be seen as being in the same camp as the low-life scum on the internet that think it’s OK to be a white nationalist Nazi, and have some truly nasty misogynistic, homophobic or transphobic behaviour. </i></li><li><i>I don’t want to be associated with a lot of the people who complain about excessive political correctness. </i></li><li><i>I’m not part of the disgusting underbelly of the internet….</i></li></ul><p>Never trust a nerd to stand his ground. No matter what principles he espouses, no matter how tough he talks, at the end of the day all he really wants is to be accepted by the popular people. “Asbestos underpants” should never be confused with actually possessing iron balls and integrity.</p><p>Torvalds has destroyed his tech legacy, and he did it for less than nothing. What a contemptible, cowardly action. I have little doubt he’ll eventually come to regret this, but by then it will be too late.</p><p>It shouldn’t be a surprise that Torvalds failed to protect his tech legacy. The man <a href=\"https://opensource.com/life/15/8/patricia-torvalds-interview\">failed his daughter too</a>.</p><blockquote><p><i>You were active in the Feminism Club at your high school. What did you learn from that experience? What feminist issues are most important to you now?</i></p><p>My friend and I co-founded Feminism Club at our high school late in our sophomore year. We did receive lots of resistance to the club at first, and while that never entirely went away, by the time we graduated feminist ideals were absolutely a part of the school’s culture. The feminist work we did at my high school was generally on a more immediate scale and focused on issues like the dress code.</p><p>Personally, I’m very focused on intersectional feminism, which is feminism as it applies to other aspects of oppression like racism and classism. The Facebook page Guerrilla Feminism is a great example of an intersectional feminism and has done so much to educate me. I currently run the Portland branch.</p><p>Feminism is also important to me in terms of diversity in tech, although as an upper-class white woman with strong connections in the tech world, the problems here affect me much less than they do other people. The same goes for my involvement in intersectional feminism. Publications like Model View Culture are very inspiring to me, and I admire Shanley Kane so much for what she does.</p></blockquote></div>",
  "content_text": "Because in the end,\na cuck is always going to cuck\n, because nothing, literally\nnothing\n, is more important to him than not being identified as one of the SJW-denominated “bad guys”:\nIn an exclusive email to the BBC, Mr Torvalds shared his thoughts on his decision to temporarily step aside, the controversy behind the CoC, and the defects of the community he set up.\n“So I’ve obviously long been on record as wanting to deal with the technical side, and not really wanting to get involved in most other discussions.\n“Because technology is what I have always found interesting. People? Not my forte. Never has been, clearly. If you watched that TED talk, you’ll know I wasn’t a people person even as a child.\n“And if you have read any of the recent stories, you will now know at least one other reason why I’ve wanted to stay away from that whole discussion. Because it’s not just my lack of people skills. It’s the discussions themselves.\n“The advantage of concentrating on technology is that you can have some mostly objective measures, and some basis for agreement, and you can have a very nice and healthy community around it all. I really am motivated by the technology, but the community around Linux has been a big positive too.\n“But there are very tangible and immediate common goals in any technical project like Linux, and while there is occasionally disagreement about how to solve some particular issue, there is a very real cohesive force in that common goal of improving the project.\n“And even when there are disagreements, people in the end often have fairly clear and objective measures of what is better. Code that is faster, simpler, or handles more cases naturally is just objectively ‘better’, without people really having to argue too much about it.\n“In contrast, the arguments about behaviour never seem to end up having a common goal. Except, in some sense, the argument itself.\n“Have you read the Twitter feeds and other things by the people who seem to care more about the non-technical side? I think your ‘hyped stories’ is about as polite as you can put it. It’s a morass of nastiness. Instead of a ‘common goal’, you end up with horrible fighting between different ‘in-groups’.\n“It’s very polarising, and both sides love egging the other side on. It’s not even a ‘discussion’, it’s just people shouting at each other.\n“That’s actually the reason I for the longest time did not want to be involved with the whole CoC discussion in the first place. That whole subject seems to very easily just devolve and become unproductive. And I found a lot of the people who pushed for a CoC and criticised me for cursing to be hypocritical and pointless. I could easily point you to various tweet storms by people who criticise my ‘white cis male’ behaviour, while at the same time cursing more than I ever do.\n“So that’s my excuse for dismissing a lot of the politically correct concerns for years. I felt it wasn’t worth it. Anybody who uses the words ‘white cis male privilege’ was simply not worth my time even talking to, I felt.\n“And I’m still not apologising for my gender or the colour of my skin, or the fact that I happen to have the common sexual orientation.\n“What changed? Maybe it was me, but I was also made very aware of some of the behaviour of the ‘other’ side in the discussion.\n“Because I may have my reservations about excessive political correctness, but honestly,\nI absolutely do not want to be seen as being in the same camp as the low-life scum on the internet that think it’s OK to be a white nationalist Nazi, and have some truly nasty misogynistic, homophobic or transphobic behaviour.\nAnd those people were complaining about too much political correctness too, and in the process just making my public stance look bad.\n“And don’t get me wrong, please – I’m not making excuses for some of my own rather strong language. But I do claim that it never ever was any of that kind of nastiness. I got upset with bad code, and people who made excuses for it, and used some pretty strong language in the process. Not good behaviour, but not the racist/etc claptrap some people spout.\n“So in the end, my ‘I really don’t want to be too PC’ stance simply became untenable. Partly because you definitely can find some emails from me that were simply completely unacceptable, and I need to fix that going forward. But to a large degree also because\nI don’t want to be associated with a lot of the people who complain about excessive political correctness.\n“Am I turning into some cuddly people person? I’ll admit that sounds very unlikely. I still care about the technology, and I’m still not exactly the most empathetic person. But I’m hoping I can at least ‘fake it until I make it’. Part of that ‘faking it’ is definitely going to be a filter on my outgoing emails, but as mentioned, I’m actively also trying to find a professional therapist to talk to as well.\n“Will everybody be happy? No. People who don’t like my blunt behaviour even when I’m not being actively nasty about it will just see that as ‘look, nothing changed’. I’m trying to get rid of my outbursts, and be more polite about things, but technically wrong is still technically wrong, and I won’t start accepting bad code just to make people feel better about themselves.\n“But if people at least realise that\nI’m not part of the disgusting underbelly of the internet\nthat thinks it’s OK to show the kind of behaviour you will find if you really have been reading up on the ‘discussions’ about the code of conduct, then even that will be a really good thing.\n“And again – the above is just my explanation of why I applied the CoC even if there is obviously discussion about it. We will have the maintainer summit in Edinburgh next month, and we’ll talk about this issue a lot more.\n“In the meantime, I’m taking a break from the kernel and probably shouldn’t talk to journalists.”\nThere are the three key phrases that explain his previously inexplicable actions:\nI absolutely do not want to be seen as being in the same camp as the low-life scum on the internet that think it’s OK to be a white nationalist Nazi, and have some truly nasty misogynistic, homophobic or transphobic behaviour.\nI don’t want to be associated with a lot of the people who complain about excessive political correctness.\nI’m not part of the disgusting underbelly of the internet….\nNever trust a nerd to stand his ground. No matter what principles he espouses, no matter how tough he talks, at the end of the day all he really wants is to be accepted by the popular people. “Asbestos underpants” should never be confused with actually possessing iron balls and integrity.\nTorvalds has destroyed his tech legacy, and he did it for less than nothing. What a contemptible, cowardly action. I have little doubt he’ll eventually come to regret this, but by then it will be too late.\nIt shouldn’t be a surprise that Torvalds failed to protect his tech legacy. The man\nfailed his daughter too\n.\nYou were active in the Feminism Club at your high school. What did you learn from that experience? What feminist issues are most important to you now?\nMy friend and I co-founded Feminism Club at our high school late in our sophomore year. We did receive lots of resistance to the club at first, and while that never entirely went away, by the time we graduated feminist ideals were absolutely a part of the school’s culture. The feminist work we did at my high school was generally on a more immediate scale and focused on issues like the dress code.\nPersonally, I’m very focused on intersectional feminism, which is feminism as it applies to other aspects of oppression like racism and classism. The Facebook page Guerrilla Feminism is a great example of an intersectional feminism and has done so much to educate me. I currently run the Portland branch.\nFeminism is also important to me in terms of diversity in tech, although as an upper-class white woman with strong connections in the tech world, the problems here affect me much less than they do other people. The same goes for my involvement in intersectional feminism. Publications like Model View Culture are very inspiring to me, and I admire Shanley Kane so much for what she does.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-28T11:00:51+00:00"
}