{
  "url": "https://voxday.net/2018/09/20/un-backs-soros/",
  "scraped_at": "2025-12-19T21:22:09.257256",
  "title": "UN backs Soros",
  "date_display": "September 20, 2018",
  "date_iso": "2018-09-20T12:00:09+00:00",
  "date_from_url": "2018-09-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The UN and the EU are desperately <a href=\"https://www.rt.com/news/438871-hungary-un-migration-lies/\">trying to get nationalist Hungary to back down</a> and accept foreign invasion before more countries are inspired to defend themselves against the globalist evil:</p><blockquote><p>Hungary’s Foreign Minister Peter Szijjarto has accused the UN human rights watchdog of “spreading lies” about his country, saying that immigration was not a “fundamental human right.”<br>The official took aim at the “independent experts” with the UN Human Rights Council, stating they “should not be independent from the truth.”</br></p><p>“Recently, unfortunately, some UN officials started to spread lies against and about my country,” Szijjarto told the UN body’s meeting on Wednesday.</p><p>Such officials would like to “force on us impossible things,” namely allowing illegal migrants into the country, Szijjarto stated. “They say that migration is a fundamental human right, which is a lie,” he stressed.</p><p>The harsh statement of the foreign minister came as a response to criticism against Hungarian anti-immigration policies. Last week, the UN rights body blasted the so-called ‘Stop Soros’ law, adopted by the country’s government back in July. The UN paper said Hungary “attacks against civil society, migrants, refugees and asylum seekers” with the law, adding that it’s against the international human rights law and poses a threat to the “values” of the whole European Union.</p><p>It added that it targets the critical “civil society” and fuels “hostility, xenophobia and … discrimination against migrants, asylum seekers, refugees and all those trying to provide them support.”</p><p>The ‘Stop Soros’ law has imposed restrictions on foreign NGOs, which work with migrants, obliging them to seek licenses from the government. It also criminalized aiding migrants, namely “providing financial or property benefit” to them or simply informing them about the asylum-seeking procedures. Those who do so could now face 12 months in jail.</p></blockquote><p>Hungary is nationalist because Hungary understands the long-term costs of being invaded much better than most nations do. The Hungarian leadership is doing what the Right far too often fails to do, which is go on the offensive against its enemies. If all you do is play defense, <i>you will lose</i>. It’s guaranteed. Every party of the Right, from Myanmar to the USA, would be well advised to start aggressively pushing for laws banning the principles, funding, activities, and organizations of the Left.</p><p>So-called “freedom of speech” was always a trap. As others have noted, they simply define your speech as violence even as they define their violence as speech.</p></div>",
  "content_text": "The UN and the EU are desperately\ntrying to get nationalist Hungary to back down\nand accept foreign invasion before more countries are inspired to defend themselves against the globalist evil:\nHungary’s Foreign Minister Peter Szijjarto has accused the UN human rights watchdog of “spreading lies” about his country, saying that immigration was not a “fundamental human right.”\nThe official took aim at the “independent experts” with the UN Human Rights Council, stating they “should not be independent from the truth.”\n“Recently, unfortunately, some UN officials started to spread lies against and about my country,” Szijjarto told the UN body’s meeting on Wednesday.\nSuch officials would like to “force on us impossible things,” namely allowing illegal migrants into the country, Szijjarto stated. “They say that migration is a fundamental human right, which is a lie,” he stressed.\nThe harsh statement of the foreign minister came as a response to criticism against Hungarian anti-immigration policies. Last week, the UN rights body blasted the so-called ‘Stop Soros’ law, adopted by the country’s government back in July. The UN paper said Hungary “attacks against civil society, migrants, refugees and asylum seekers” with the law, adding that it’s against the international human rights law and poses a threat to the “values” of the whole European Union.\nIt added that it targets the critical “civil society” and fuels “hostility, xenophobia and … discrimination against migrants, asylum seekers, refugees and all those trying to provide them support.”\nThe ‘Stop Soros’ law has imposed restrictions on foreign NGOs, which work with migrants, obliging them to seek licenses from the government. It also criminalized aiding migrants, namely “providing financial or property benefit” to them or simply informing them about the asylum-seeking procedures. Those who do so could now face 12 months in jail.\nHungary is nationalist because Hungary understands the long-term costs of being invaded much better than most nations do. The Hungarian leadership is doing what the Right far too often fails to do, which is go on the offensive against its enemies. If all you do is play defense,\nyou will lose\n. It’s guaranteed. Every party of the Right, from Myanmar to the USA, would be well advised to start aggressively pushing for laws banning the principles, funding, activities, and organizations of the Left.\nSo-called “freedom of speech” was always a trap. As others have noted, they simply define your speech as violence even as they define their violence as speech.",
  "tags": [
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-20T11:00:09+00:00"
}