{
  "url": "https://voxday.net/2018/09/02/wesley-finally-shuts-up/",
  "scraped_at": "2025-12-19T21:19:25.651871",
  "title": "Wesley finally shuts up",
  "date_display": "September 2, 2018",
  "date_iso": "2018-09-02T15:19:17+00:00",
  "date_from_url": "2018-09-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s hard not to cry with laughter <a href=\"http://wilwheaton.net/2018/08/the-world-is-a-terrible-place-right-now-and-thats-largely-because-it-is-what-we-make-it/\">at Wil Wheaton’s little self-pity party</a>:</p><blockquote><p>I’m done with social media. Maybe I just don’t fit into whatever the social media world is. I mean, the people who are all over the various Mastodon instances made it really clear that I wasn’t welcome there (with a handful of notable, joyful, exceptions, mostly related to my first baby steps into painting), and it seems as if I was just unwelcome because … I’m me? I guess? Like, I know that I’m not a transphobe, but holy shit that lie just won’t die, and right now as I am writing this, someone at Mastodon is telling me that I am, because people said so, and I should apologize to them. I mean, how am I supposed to respond to that, when it happens over and over and over again? “You’ve been lied to about me. Please give me a chance” just doesn’t seem like a viable way forward with people who are, for whatever reason, very, very angry. And these people seem to have an idea of me in their head that doesn’t fit with the idea of myself that I have in my head. It’s honestly caused me to rethink a lot of stuff. Like, am I really the terrible person they say I am? I don’t think I am, but I’m doing my best to listen, and when I say, “please stop yelling at me and let’s have a conversation that I can grow from” I get yelled at for “tone policing” and honestly I just get exhausted and throw up my hands. Maybe I’m not this person they tell me I am, but I represent that person in their heads, and they treat me accordingly? This is one of those times when my mental illness makes it very hard for me to know what’s objective reality and what’s just in my head.</p><p>But I don’t deserve to be treated so terribly by so many random people, so I’m not going to put myself in a place where I am subjected to it all day long. As the saying goes, I’m too old for this shit. What we used to call microblogging isn’t worth the headache for me. I’m gonna focus my time and my energy on the things that I love, that make me happy, that support my family.</p></blockquote><p>This is why you should never crawl in bed with crocodiles. Sooner or later, <i>they’re going to get hungry</i>. Wil Wheaton and John Scalzi are just two of the increasing number of examples of white male SJWs belatedly discovering that they are on the Social Justice menu. And much to their horror, they are discovering that they won’t even be eaten last.</p><p>Once the white males are gone, the white females will be next on the list, no matter how avowedly feminist and trans-friendly they demonstrate themselves to be.</p><p>Of course, the amusing thing is that Wil Wheaton is one of the few individuals on social media who genuinely deserved to be treated as terribly as he has. He abused his position and wound up being treated in exactly the same way that he treated so many others. He was happy enough to label others on the sole basis of the ideas in his head, so how can he possibly complain that others are now doing precisely the same thing to him?</p></div>",
  "content_text": "It’s hard not to cry with laughter\nat Wil Wheaton’s little self-pity party\n:\nI’m done with social media. Maybe I just don’t fit into whatever the social media world is. I mean, the people who are all over the various Mastodon instances made it really clear that I wasn’t welcome there (with a handful of notable, joyful, exceptions, mostly related to my first baby steps into painting), and it seems as if I was just unwelcome because … I’m me? I guess? Like, I know that I’m not a transphobe, but holy shit that lie just won’t die, and right now as I am writing this, someone at Mastodon is telling me that I am, because people said so, and I should apologize to them. I mean, how am I supposed to respond to that, when it happens over and over and over again? “You’ve been lied to about me. Please give me a chance” just doesn’t seem like a viable way forward with people who are, for whatever reason, very, very angry. And these people seem to have an idea of me in their head that doesn’t fit with the idea of myself that I have in my head. It’s honestly caused me to rethink a lot of stuff. Like, am I really the terrible person they say I am? I don’t think I am, but I’m doing my best to listen, and when I say, “please stop yelling at me and let’s have a conversation that I can grow from” I get yelled at for “tone policing” and honestly I just get exhausted and throw up my hands. Maybe I’m not this person they tell me I am, but I represent that person in their heads, and they treat me accordingly? This is one of those times when my mental illness makes it very hard for me to know what’s objective reality and what’s just in my head.\nBut I don’t deserve to be treated so terribly by so many random people, so I’m not going to put myself in a place where I am subjected to it all day long. As the saying goes, I’m too old for this shit. What we used to call microblogging isn’t worth the headache for me. I’m gonna focus my time and my energy on the things that I love, that make me happy, that support my family.\nThis is why you should never crawl in bed with crocodiles. Sooner or later,\nthey’re going to get hungry\n. Wil Wheaton and John Scalzi are just two of the increasing number of examples of white male SJWs belatedly discovering that they are on the Social Justice menu. And much to their horror, they are discovering that they won’t even be eaten last.\nOnce the white males are gone, the white females will be next on the list, no matter how avowedly feminist and trans-friendly they demonstrate themselves to be.\nOf course, the amusing thing is that Wil Wheaton is one of the few individuals on social media who genuinely deserved to be treated as terribly as he has. He abused his position and wound up being treated in exactly the same way that he treated so many others. He was happy enough to label others on the sole basis of the ideas in his head, so how can he possibly complain that others are now doing precisely the same thing to him?",
  "tags": [
    "#GamerGate"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-02T14:19:17+00:00"
}