{
  "url": "https://voxday.net/2018/09/04/where-even-sjws-fear-to-tread/",
  "scraped_at": "2025-12-19T21:19:42.255552",
  "title": "Where even SJWs fear to tread",
  "date_display": "September 4, 2018",
  "date_iso": "2018-09-04T02:02:33+00:00",
  "date_from_url": "2018-09-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s truly <i>informative </i>to see that <a href=\"https://uploads.disquscdn.com/images/e13d246f064f6527fc57e29b0f4448b05d0cfc3e17966b6067595c8d2f7196e1.png?w=800&amp;h=388\">this</a> is the reaction from those charming ComicsGaters to the news that a publishing company supports their publicly expressed goals. The fake news image, which stated that a certain “suicide unites fandom”, was posted at Bounding Into Comics by one Brett S aka @seventhbeacon, who we are told is a “lover of sci-fi, comics, books, learning &amp; Enlightenment values. Atheist. Liberalist.” VFM, it would certainly be interesting to learn considerably more about him. There is the distinct scent of a ComicsGator trying to play let’s you and him fight.</p><p>In any event, whatever happened to “I am the leader of ComicsGate and so can you?” Now, if I understand correctly, we’re being informed that someone actually <i>owns</i> it? When did that happen?</p><p>If it is a genuine CGer, then these guys aren’t anywhere near ready for prime time. No discipline whatsoever. Imagine if that was directed at an SJW in the industry. The media SJWs would eat them alive.</p></div>",
  "content_text": "It’s truly\ninformative\nto see that\nthis\nis the reaction from those charming ComicsGaters to the news that a publishing company supports their publicly expressed goals. The fake news image, which stated that a certain “suicide unites fandom”, was posted at Bounding Into Comics by one Brett S aka @seventhbeacon, who we are told is a “lover of sci-fi, comics, books, learning & Enlightenment values. Atheist. Liberalist.” VFM, it would certainly be interesting to learn considerably more about him. There is the distinct scent of a ComicsGator trying to play let’s you and him fight.\nIn any event, whatever happened to “I am the leader of ComicsGate and so can you?” Now, if I understand correctly, we’re being informed that someone actually\nowns\nit? When did that happen?\nIf it is a genuine CGer, then these guys aren’t anywhere near ready for prime time. No discipline whatsoever. Imagine if that was directed at an SJW in the industry. The media SJWs would eat them alive.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-09-04T01:02:33+00:00"
}