{
  "url": "https://voxday.net/2020/12/31/2020-project-updates/",
  "scraped_at": "2025-12-21T22:31:37.417415",
  "title": "2020 project updates",
  "date_display": "December 31, 2020",
  "date_iso": "2020-12-31T15:25:14+00:00",
  "date_from_url": "2020-12-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So, as you know, we’re behind on pretty much every single one of our projects for various reasons. That’s the bad news. The good news is that we have been able to regularly improve the quality of what we’re delivering, and we expect to be able to continue doing that in 2021. Here is the current state of affairs:</p><p><b>CASTALIA HOUSE</b></p><p>We’ve significantly reduced the number of books we’re producing and removed almost all of our audiobooks from Audible in order to focus on books that are worth the effort involved to produce them. Those who want audiobooks can buy them from us directly or acquire them through the Castalia subscription on Patreon. We have completed the entire <i>THERE WILL BE WAR</i> series in paperback, but have not yet announced them because we need to make some minor revisions and Ingram is having some operational problems that are delaying them. The Junior Classics will be available from Castalia House through normal distribution as soon as we complete the shipments of the Original Backer editions. We also intend to produce regular hardcover editions of some of our Library books, such as <i>MEDITATIONS </i>and <i>THE DIVINE COMEDY</i>.</p><p><b>CASTALIA LIBRARY</b></p><p>The first four books have been bound and shipped. The fourth book, <i>THE DIVINE COMEDY</i>, is just beginning to reach the first subscribers. Books Five and Six, the two volumes of <i>PLUTARCH’S LIVES</i>, were scheduled to ship today, but we rejected the initial stamping because the gold was spilling over the two soldiers on the spine due to excessively fine lines. We’re working on modifying the stamping plates and expect the books to ship together in late January. A number of non-US subscribers have not received their books yet due to border blockages and insufficient airline cargo space, so just be patient, as they will get to you as soon as delivery is permitted.</p><p><b>ARKHAVEN COMICS</b></p><p>No comics will be released until March. Due to the unprecedented opportunity being presented by the meltdown of DC Comics, the Arkhaven team is focusing all of our efforts on this front on a new site dedicated to delivering free digital comics in an improved version of the Webtoons format. <i>Chuck Dixon’s Avalon</i> is complete. <i>Alt-Hero</i> is complete through Issue 9. <i>A Throne of Bones</i> 1-6 will be complete. <i>Alt-Hero: Q</i> will be complete by March. The first 3 or 4 issues of <i>Midnight’s War</i> will be complete. The first three issues of <i>Swan Knight’s Saga</i> are complete, as well as at least two issues of <i>Shade</i> and several <i>Quantum Mortis </i>issues. As a result of our partnership with an up-and-coming Brazilian comics publisher and Chuck Dixon’s efforts, other comics that will be introduced on the new site in the coming year include, but are not limited to: <i>The Awakener</i>, <i>The Hammer of Freedom</i>, <i>The Grey Claw</i>, <i>Lieutenant Bravo</i>, <i>Hecatomb</i>, <i>Jungle Sword</i>, <i>The Wagon From Hell</i>, and <i>Go Monster Go.</i></p><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://social.infogalactic.com/images/posts/6e71aec1-1c25-41d2-8f48-2cb1372daa33/original-b0104afedc0b6a12a57b489a2ca65cb7.jpg?v=63776640236\" style=\"margin-left: auto; margin-right: auto;\"><noscript><img border=\"0\" data-original-height=\"475\" data-original-width=\"512\" decoding=\"async\" src=\"https://social.infogalactic.com/images/posts/6e71aec1-1c25-41d2-8f48-2cb1372daa33/original-b0104afedc0b6a12a57b489a2ca65cb7.jpg?v=63776640236\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"475\" data-original-width=\"512\" data-src=\"https://social.infogalactic.com/images/posts/6e71aec1-1c25-41d2-8f48-2cb1372daa33/original-b0104afedc0b6a12a57b489a2ca65cb7.jpg?v=63776640236\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20475%22%3E%3C/svg%3E\"/></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\"><i>Arkhaven’s newest star: The Awakener</i></td></tr></tbody></table><p>In connection with the new site, we are looking for hard core volunteers who have Photoshop to help us in the conversion process to the new format. If you’re into both a) comics and b) tedious and repetitive graphic work, shoot me an email. It’s not difficult, but there are a LOT of frames that need to be created between now and then. Note: I did not say if you know how to use Photoshop, but <i>if you have it already</i>. Arkhaven print subscribers will be receiving their print issues in January, digital subscribers will be receiving special badges and early access to the new site.</p><p><b>JUNIOR CLASSICS</b></p><p>950 of the 1300 or so sets of Vols. I-III have shipped. None of the demy octavo editions have shipped yet. We’re going to do another shipment of most of the rest of the royal octavos, then put the retail edition royals into general distribution through the bookstores in January. We’re working on the demy editions and will announce when they are ready to ship. The ebook editions of Vols I-III will be sent out in January. Vols IV-VI will first ship in royal in the Feb-Mar timeframe to the same address to which the first three volumes were shipped.</p><p><b>A NOTE ABOUT COMMUNICATIONS</b></p><p>Please note that we NEVER confirm that we’ve received an email from you regarding an address or whatever. If you do the math, you’ll understand why. Everything we do is focused on the actual process of producing and delivering the promised products, and it’s not possible to automate communications about that process ala Amazon for products that are still being created. Notice that orders from the Castalia Direct store and the Arkhaven/Castalia ebook/audiobook store do provide the usual confirmations because those products are in stock at the time the order is placed. If you want more regular updates, please consider joining SocialGalactic, as we regularly provide them there.</p><p><i>More to come later today.</i></p></div>",
  "content_text": "So, as you know, we’re behind on pretty much every single one of our projects for various reasons. That’s the bad news. The good news is that we have been able to regularly improve the quality of what we’re delivering, and we expect to be able to continue doing that in 2021. Here is the current state of affairs:\nCASTALIA HOUSE\nWe’ve significantly reduced the number of books we’re producing and removed almost all of our audiobooks from Audible in order to focus on books that are worth the effort involved to produce them. Those who want audiobooks can buy them from us directly or acquire them through the Castalia subscription on Patreon. We have completed the entire\nTHERE WILL BE WAR\nseries in paperback, but have not yet announced them because we need to make some minor revisions and Ingram is having some operational problems that are delaying them. The Junior Classics will be available from Castalia House through normal distribution as soon as we complete the shipments of the Original Backer editions. We also intend to produce regular hardcover editions of some of our Library books, such as\nMEDITATIONS\nand\nTHE DIVINE COMEDY\n.\nCASTALIA LIBRARY\nThe first four books have been bound and shipped. The fourth book,\nTHE DIVINE COMEDY\n, is just beginning to reach the first subscribers. Books Five and Six, the two volumes of\nPLUTARCH’S LIVES\n, were scheduled to ship today, but we rejected the initial stamping because the gold was spilling over the two soldiers on the spine due to excessively fine lines. We’re working on modifying the stamping plates and expect the books to ship together in late January. A number of non-US subscribers have not received their books yet due to border blockages and insufficient airline cargo space, so just be patient, as they will get to you as soon as delivery is permitted.\nARKHAVEN COMICS\nNo comics will be released until March. Due to the unprecedented opportunity being presented by the meltdown of DC Comics, the Arkhaven team is focusing all of our efforts on this front on a new site dedicated to delivering free digital comics in an improved version of the Webtoons format.\nChuck Dixon’s Avalon\nis complete.\nAlt-Hero\nis complete through Issue 9.\nA Throne of Bones\n1-6 will be complete.\nAlt-Hero: Q\nwill be complete by March. The first 3 or 4 issues of\nMidnight’s War\nwill be complete. The first three issues of\nSwan Knight’s Saga\nare complete, as well as at least two issues of\nShade\nand several\nQuantum Mortis\nissues. As a result of our partnership with an up-and-coming Brazilian comics publisher and Chuck Dixon’s efforts, other comics that will be introduced on the new site in the coming year include, but are not limited to:\nThe Awakener\n,\nThe Hammer of Freedom\n,\nThe Grey Claw\n,\nLieutenant Bravo\n,\nHecatomb\n,\nJungle Sword\n,\nThe Wagon From Hell\n, and\nGo Monster Go.\nArkhaven’s newest star: The Awakener\nIn connection with the new site, we are looking for hard core volunteers who have Photoshop to help us in the conversion process to the new format. If you’re into both a) comics and b) tedious and repetitive graphic work, shoot me an email. It’s not difficult, but there are a LOT of frames that need to be created between now and then. Note: I did not say if you know how to use Photoshop, but\nif you have it already\n. Arkhaven print subscribers will be receiving their print issues in January, digital subscribers will be receiving special badges and early access to the new site.\nJUNIOR CLASSICS\n950 of the 1300 or so sets of Vols. I-III have shipped. None of the demy octavo editions have shipped yet. We’re going to do another shipment of most of the rest of the royal octavos, then put the retail edition royals into general distribution through the bookstores in January. We’re working on the demy editions and will announce when they are ready to ship. The ebook editions of Vols I-III will be sent out in January. Vols IV-VI will first ship in royal in the Feb-Mar timeframe to the same address to which the first three volumes were shipped.\nA NOTE ABOUT COMMUNICATIONS\nPlease note that we NEVER confirm that we’ve received an email from you regarding an address or whatever. If you do the math, you’ll understand why. Everything we do is focused on the actual process of producing and delivering the promised products, and it’s not possible to automate communications about that process ala Amazon for products that are still being created. Notice that orders from the Castalia Direct store and the Arkhaven/Castalia ebook/audiobook store do provide the usual confirmations because those products are in stock at the time the order is placed. If you want more regular updates, please consider joining SocialGalactic, as we regularly provide them there.\nMore to come later today.",
  "tags": [
    "CastaliaHouse"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-12-31T15:25:14+00:00"
}