{
  "url": "https://voxday.net/2020/12/07/a-lot-of-big-things/",
  "scraped_at": "2025-12-21T22:28:03.613950",
  "title": "“A lot of big things”",
  "date_display": "December 7, 2020",
  "date_iso": "2020-12-07T19:31:49+00:00",
  "date_from_url": "2020-12-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>President Trump answers a journalist:</p><p><b></b></p><blockquote><p><b>Journalist:</b> A week from now the electors will meet to cast their vote. There’s not a lot of time between now and then to make your case. Are you looking to change the outcome of the election or make the case to the American people that it wasn’t fair?</p><p><b>President Trump: </b>If you look at the polls, it was a rigged election. You look at the different states, the election was totally rigged. It’s a disgrace to our country, it’s like a Third World country, and these ballots pouring in from everywhere and using machinery nobody knows, ownership nobody knows anything about, they have glitches, as they call them, glitches that are not glitches, they’re caught sending out thousands of votes, all against me, by the way. This was like from a Third World nation and now we find out what we can do about it. But you’ll see a lot of big things happening over the next couple of days.</p></blockquote><p>Stay cool, stand back, and stand by. Meanwhile, the salient point <a href=\"https://edition.cnn.com/2020/12/07/politics/donald-trump-lawsuits-election/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">sails high over CNN’s collective head</a>.</p><blockquote><p>There is a sense developing within Donald Trump’s legal team and what remains of his campaign staff that their efforts to overturn or delay the results of the election are coming to an end, multiple sources tell CNN, despite what the President has said publicly.</p></blockquote><p>Translation: the courts had their chance. Sure, it’s always possible that we have it wrong. On the other hand, it’s going to be very easy to explain how no one saw it coming.</p></div>",
  "content_text": "President Trump answers a journalist:\nJournalist:\nA week from now the electors will meet to cast their vote. There’s not a lot of time between now and then to make your case. Are you looking to change the outcome of the election or make the case to the American people that it wasn’t fair?\nPresident Trump:\nIf you look at the polls, it was a rigged election. You look at the different states, the election was totally rigged. It’s a disgrace to our country, it’s like a Third World country, and these ballots pouring in from everywhere and using machinery nobody knows, ownership nobody knows anything about, they have glitches, as they call them, glitches that are not glitches, they’re caught sending out thousands of votes, all against me, by the way. This was like from a Third World nation and now we find out what we can do about it. But you’ll see a lot of big things happening over the next couple of days.\nStay cool, stand back, and stand by. Meanwhile, the salient point\nsails high over CNN’s collective head\n.\nThere is a sense developing within Donald Trump’s legal team and what remains of his campaign staff that their efforts to overturn or delay the results of the election are coming to an end, multiple sources tell CNN, despite what the President has said publicly.\nTranslation: the courts had their chance. Sure, it’s always possible that we have it wrong. On the other hand, it’s going to be very easy to explain how no one saw it coming.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-12-07T19:31:49+00:00"
}