{
  "url": "https://voxday.net/2020/12/12/a-non-military-war/",
  "scraped_at": "2025-12-21T22:29:01.788444",
  "title": "A non-military war",
  "date_display": "December 12, 2020",
  "date_iso": "2020-12-12T17:21:14+00:00",
  "date_from_url": "2020-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Unbeknownst to most of his supporters, that is what the President is presently fighting.</p><blockquote><p>As practically existing, the age of wars being a matter of moving weapons and soldiers has still not been translated into history, but as a concept it has already begun to noticeably fall behind. Following the increase in the number of international treaties limiting the arms race and the proliferation of weapons, the United Nations and regional international organizations have enlarged their intervention power in local wars and regional conflicts and relatively decreased the military threat to national security; on the contrary, the springing up of large amounts of new high technology will actually greatly increase the possibility of non-military measures threatening national security, and the international community, which is at a loss of what to do upon being confronted with non-military threats with such destruction no less than that of a war, at the least lacks necessary and effective limitations. This has objectively accelerated the occurrence of non-military wars, and at the same time it has also resulted in the old concepts and systems of national security being on the brink of collapse.</p><p>Aside from the increasingly intense terrorist attacks, as well as the hacker wars, financial wars and computer virus wars which will dominate the future, there are also the present various types of “new concept wars” to which it is difficult to fix a name and are already sufficient to have the security view of “resisting the enemy outside of one’s national gate” become something of the past in the space of an evening.</p></blockquote><p>I would argue that you cannot possibly understand what has been happening for the last twelve years, or understand the nature of the current Constitutional crisis, if you have not read <i><a href=\"https://www.iwp.edu/books/unrestricted-warfare/\" rel=\"noopener\" target=\"_blank\">UNRESTRICTED WARFARE</a></i> by Qiao Lang and Wang Xiangsui, first published in English in 1999. Ignore the histrionic subtitle of the 2017 edition, it is not “China’s master plan to destroy the USA”, but rather, a brilliant explication by two Chinese colonels of the then-new concept of “Total Dimensional Warfare”, to which I prefer to refer as “comprehensive warfare” and is, regardless of what one calls it, the real 5th Generation Warfare that so many glory-seeking would-be William S. Linds have attempted, incorrectly, to coin.</p><p>The current election crisis is not about Biden, or the Democrats, it’s not even about the Constitution. It is actually about defeating the world’s dominant military and rendering it <i>hors de combat</i> without firing a shot. And that, you see, is why I am confident that there is absolutely no way that President Trump ever even considered relying upon the state legislatures, or the courts, to ensure that he remains Commander-in-Chief for the next four years or more, for one single moment.</p><p>We should probably keep in mind that the fact a war has been waged with non-military means to date does not mean that it will remain that way indefinitely.</p></div>",
  "content_text": "Unbeknownst to most of his supporters, that is what the President is presently fighting.\nAs practically existing, the age of wars being a matter of moving weapons and soldiers has still not been translated into history, but as a concept it has already begun to noticeably fall behind. Following the increase in the number of international treaties limiting the arms race and the proliferation of weapons, the United Nations and regional international organizations have enlarged their intervention power in local wars and regional conflicts and relatively decreased the military threat to national security; on the contrary, the springing up of large amounts of new high technology will actually greatly increase the possibility of non-military measures threatening national security, and the international community, which is at a loss of what to do upon being confronted with non-military threats with such destruction no less than that of a war, at the least lacks necessary and effective limitations. This has objectively accelerated the occurrence of non-military wars, and at the same time it has also resulted in the old concepts and systems of national security being on the brink of collapse.\nAside from the increasingly intense terrorist attacks, as well as the hacker wars, financial wars and computer virus wars which will dominate the future, there are also the present various types of “new concept wars” to which it is difficult to fix a name and are already sufficient to have the security view of “resisting the enemy outside of one’s national gate” become something of the past in the space of an evening.\nI would argue that you cannot possibly understand what has been happening for the last twelve years, or understand the nature of the current Constitutional crisis, if you have not read\nUNRESTRICTED WARFARE\nby Qiao Lang and Wang Xiangsui, first published in English in 1999. Ignore the histrionic subtitle of the 2017 edition, it is not “China’s master plan to destroy the USA”, but rather, a brilliant explication by two Chinese colonels of the then-new concept of “Total Dimensional Warfare”, to which I prefer to refer as “comprehensive warfare” and is, regardless of what one calls it, the real 5th Generation Warfare that so many glory-seeking would-be William S. Linds have attempted, incorrectly, to coin.\nThe current election crisis is not about Biden, or the Democrats, it’s not even about the Constitution. It is actually about defeating the world’s dominant military and rendering it\nhors de combat\nwithout firing a shot. And that, you see, is why I am confident that there is absolutely no way that President Trump ever even considered relying upon the state legislatures, or the courts, to ensure that he remains Commander-in-Chief for the next four years or more, for one single moment.\nWe should probably keep in mind that the fact a war has been waged with non-military means to date does not mean that it will remain that way indefinitely.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-12-12T17:21:14+00:00"
}