{
  "url": "https://voxday.net/2020/12/27/americans-discover-the-uniparty/",
  "scraped_at": "2025-12-21T22:31:06.093834",
  "title": "Americans discover the uniparty",
  "date_display": "December 27, 2020",
  "date_iso": "2020-12-27T17:45:30+00:00",
  "date_from_url": "2020-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Twitter: <i>The greatest trick the political establishment ever played on the American people was convincing us that there are two parties, each with diametrically opposing viewpoints.</i></p><p>I’m not sure I’d even place it in the top ten, myself. Nevertheless, it is good to see that in the bipartisan opposition to President Trump, the average American is now beginning to recognize what was generally regarded as a strange and radical position <a href=\"http://voxday.blogspot.com/2004/11/remember.html\" rel=\"noopener\" target=\"_blank\">back in 2004</a>. And you may find the bolded sentence to be interesting in light of current events.</p><p><b>Remember</b></p><p>A failure to remember the lessons of the past is the great weakness of the voting populace and is exploited by the bifactional ruling party every four years. The present election is always the election at which everything is uniquely at stake; the idea that the global jihad was the deadliest threat to ever face America would have been rightly laughed at by those voters worried about an aggressive Soviet Union in 1980. The hysterical Three Monkeys who now warn of the lethal dangers of a Kerry presidency – as if the nation didn’t already recently survive two terms of a soulless ambition seeker with an annoyingly leftist wife – forget how they swore up and down that keeping Gore out of office was the most important vote anyone would ever make.</p><p>On the other side of the false divide, the Little Red Book Democrats spit foam-flecked drivel in comparing George Delano unfavorably to Hitler, Caligula and Genghis Khan, somehow managing to skip over the fact that this Republican president has done them the service of expanding the central government further and faster than Kennedy, Carter or Clinton. Like the Three Monkeys, the Little Red Books are mesmerized by the initial in parentheses before the name. Everything in the Party, nothing outside the Party, nothing against the Party.</p><p>But the bipolar construct is an old one. It has been a mirage since the elections of 1900, when JP Morgan and John D. Rockefeller were selecting the candidates for both parties. You may seriously believe that it makes a vital difference to the nation whether George Bush or John Kerry are elected president; it does not.</p><p>Both Bush and Kerry will severely disappoint their supporters because the president is not a dictator. He is primarily a symbol, and a largely powerless one at that. <b>Only a candidate completely devoted to dismantling the federal leviathan can hope to wield any real power and that is mostly negative.</b> A president can shut down the government, either by executive order or recalcitrance vis-a-vis Congress, but that is precisely the opposite of what both George Bush and John Kerry plan to do.</p><p>There is no party of small government in Washington DC. A vote for either candidate of the major party is a vote for big government now and bigger government in the future. If that suits you, then by all means vote for one of them. If not, it’s far better that you vote for no one at all than betray your principles based on rationalizations of lesser evils and secret plans.</p></div>",
  "content_text": "From Twitter:\nThe greatest trick the political establishment ever played on the American people was convincing us that there are two parties, each with diametrically opposing viewpoints.\nI’m not sure I’d even place it in the top ten, myself. Nevertheless, it is good to see that in the bipartisan opposition to President Trump, the average American is now beginning to recognize what was generally regarded as a strange and radical position\nback in 2004\n. And you may find the bolded sentence to be interesting in light of current events.\nRemember\nA failure to remember the lessons of the past is the great weakness of the voting populace and is exploited by the bifactional ruling party every four years. The present election is always the election at which everything is uniquely at stake; the idea that the global jihad was the deadliest threat to ever face America would have been rightly laughed at by those voters worried about an aggressive Soviet Union in 1980. The hysterical Three Monkeys who now warn of the lethal dangers of a Kerry presidency – as if the nation didn’t already recently survive two terms of a soulless ambition seeker with an annoyingly leftist wife – forget how they swore up and down that keeping Gore out of office was the most important vote anyone would ever make.\nOn the other side of the false divide, the Little Red Book Democrats spit foam-flecked drivel in comparing George Delano unfavorably to Hitler, Caligula and Genghis Khan, somehow managing to skip over the fact that this Republican president has done them the service of expanding the central government further and faster than Kennedy, Carter or Clinton. Like the Three Monkeys, the Little Red Books are mesmerized by the initial in parentheses before the name. Everything in the Party, nothing outside the Party, nothing against the Party.\nBut the bipolar construct is an old one. It has been a mirage since the elections of 1900, when JP Morgan and John D. Rockefeller were selecting the candidates for both parties. You may seriously believe that it makes a vital difference to the nation whether George Bush or John Kerry are elected president; it does not.\nBoth Bush and Kerry will severely disappoint their supporters because the president is not a dictator. He is primarily a symbol, and a largely powerless one at that.\nOnly a candidate completely devoted to dismantling the federal leviathan can hope to wield any real power and that is mostly negative.\nA president can shut down the government, either by executive order or recalcitrance vis-a-vis Congress, but that is precisely the opposite of what both George Bush and John Kerry plan to do.\nThere is no party of small government in Washington DC. A vote for either candidate of the major party is a vote for big government now and bigger government in the future. If that suits you, then by all means vote for one of them. If not, it’s far better that you vote for no one at all than betray your principles based on rationalizations of lesser evils and secret plans.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-12-27T17:45:30+00:00"
}