{
  "url": "https://voxday.net/2020/12/14/and-which-god-is-that/",
  "scraped_at": "2025-12-21T22:29:16.577798",
  "title": "And which god is that?",
  "date_display": "December 14, 2020",
  "date_iso": "2020-12-14T13:30:07+00:00",
  "date_from_url": "2020-12-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Beth Moore, one of the leading Jezebels of the Southern Baptist Convention, <a href=\"https://mobile.twitter.com/BethMooreLPM/status/1338134290647953410\" rel=\"noopener\" target=\"_blank\">openly attacks Christian nationalism</a>:</p><blockquote><p>I do not believe these are days for mincing words. I’m 63 1/2 years old &amp; I have never seen anything in these United States of America I found more astonishingly seductive &amp; dangerous to the saints of God than Trumpism. This Christian nationalism is not of God. Move back from it.</p></blockquote><p>This is precisely why women are to be silent in the Church. Those who wish to teach men are possessed by a spirit that rebels against both God and man, and <i>inevitably </i>attempt to lead those men away from Jesus Christ and towards servitude to the god of this world.</p><p>The Bible says the nations will survive until the end. It is globalism, which is at its heart Babelism, that is opposed to the nations, as well as to both God and His Son. Which means that Beth Moore is a ticket-taking creature of Babel. You can see how these creatures always, <i>always</i>, lie. How can Christian nationalism not be of God, unless that god is the Promethean god who is the prince of this world?</p></div>",
  "content_text": "Beth Moore, one of the leading Jezebels of the Southern Baptist Convention,\nopenly attacks Christian nationalism\n:\nI do not believe these are days for mincing words. I’m 63 1/2 years old & I have never seen anything in these United States of America I found more astonishingly seductive & dangerous to the saints of God than Trumpism. This Christian nationalism is not of God. Move back from it.\nThis is precisely why women are to be silent in the Church. Those who wish to teach men are possessed by a spirit that rebels against both God and man, and\ninevitably\nattempt to lead those men away from Jesus Christ and towards servitude to the god of this world.\nThe Bible says the nations will survive until the end. It is globalism, which is at its heart Babelism, that is opposed to the nations, as well as to both God and His Son. Which means that Beth Moore is a ticket-taking creature of Babel. You can see how these creatures always,\nalways\n, lie. How can Christian nationalism not be of God, unless that god is the Promethean god who is the prince of this world?",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-12-14T13:30:07+00:00"
}