{
  "url": "https://voxday.net/2020/12/31/bill-gates-is-going-down/",
  "scraped_at": "2025-12-21T22:31:41.080676",
  "title": "“Bill Gates is going down”",
  "date_display": "December 31, 2020",
  "date_iso": "2020-12-31T18:36:11+00:00",
  "date_from_url": "2020-12-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> Lin Woods makes <a href=\"https://www.anonymousconservative.com/blog/news-briefs-12-31-2020/\" rel=\"noopener\" target=\"_blank\">some remarkably specific predictions</a> in an interview summarized by AC:</p><blockquote><p>A sealed document in a federal court in Maryland, sealed under National Security, documents how Nancy Pelosi, Rod Rosenstein, John Podesta, and John Brennan have tapes of John Roberts talking with Podesta about who would best replace Antonin Scalia, and they were recorded before Scalia died, and apparently had foreknowledge of his death. Roberts flew on Epstein’s plane because Epstein helped him acquire his children from Wales.</p><p>Barack Obama is worth well over billion dollars, much inherited from his step-father who owned it in Halliburton stock.</p><p>Many people in this country will go to jail for treason, and the number that will be just associated with trying to steal this election from our President will be astounding.</p><p>He predicts a violent period of civil unrest as the Cabal tries to engage in violence as part of their Color Revolution plan, just like we have seen overseas, after Trump wins the Presidency.</p><p>He believes the Governor of Georgia has been taking kickbacks on Georgia purchases of Dominion voting machines and Chinese PPE orders. And the death of Harrison Deal in a car wreck, which produced an explosion that was heard by witnesses a mile away, was a message to him.</p><p>Pat Cipillone, the disloyal White House lawyer trying to thwart President Trump at every turn, drives a new luxury vehicle to the White House every two days, including a Rolls Royce.</p><p>Rosenstein, Sally Yates, and Christopher Wray all worked in the same law firm, and are corrupt.</p><p>CIA is the most corrupt organization in the country, and President Trump is about to defang them by pulling all direct-action operational capabilities from the Agency, reducing it to an organization of paper pushers. Oddly enough President Kennedy was about to do that when he was killed, and the memo, named “Memorandum 45,” sat on his desk unsigned. Lin implies President Trump set it in motion by signing that very memo.</p><p>Bill Gates is going down as well.</p><p>George Bush 41 and 43, Bill and Hillary, and Obama all ran crime families, and they ran them out of the Oval Office. He said he believes the notes given at Bush 41’s funeral said, “I’m sorry, but they know it all.”</p><p>Under the 2018 EO on voting integrity, President Trump will have the power to seize all the assets of the Fake News mainstream media once things start happening, because they have profited from trying to aid China in voter fraud.</p><p>He also points out there were reports of gunfire before the bombing, and that it is inconsistent with a lone bomber, and might indicate good guys killed the bomber before he positioned the bomb appropriately, and that is why the bomber failed to destroy the “evidence” he was trying to destroy.</p><p>Lin says he believes if the election is shown to be fraudulent, all down-ballot elections may have to be re-held.</p><p>President Trump will prove to be the greatest President in the history of the United States.</p></blockquote><p>Given that some of the objects of his criticism have publicly threatened defamation lawsuits, either Lin Woods is off his rocker or he is in possession of hard evidence. </p><p><b>UPDATE: </b>He’s really <a href=\"https://twitter.com/LLinWood/status/1344652363861258243\" rel=\"noopener\" target=\"_blank\">not holding anything back</a> at this point.</p><blockquote><p>I am fully aware of the onslaught of attacks being made against me based on my revelations about Chief Justice John Roberts. Before attacking me, maybe fair-minded people would first ask Roberts to tell the truth. Or ask Jeffrey Epstein. He is alive.</p></blockquote><p>This suggests that Team Trump has Epstein in protective custody and will produce him at the most effective moment. Could it be disinformation? Certainly. Never trust any authority <i>a priori</i>, including me. Then again, President Trump did warn us that things are going to get wild on January 6th.</p><p><b>UPDATE: </b>Dear Gamma retards,</p><p>Accurately reporting what other people are saying on the record is what was once called “journalism”. This should not be confused with either a) betting one’s life on what those other people are saying or b) actually saying it oneself.</p><p>First, I don’t care what you think about my credibility. Second, the only way my credibility could be negatively affected by reporting on what other people have said is if you have evidence that they did not, in fact, say it. Third, <i>if at all possible</i>, please stop being retarded, as witnessing your exhibitions of retardery is infinitely more painful to me than your would-be criticism.</p></div>",
  "content_text": "Lin Woods makes\nsome remarkably specific predictions\nin an interview summarized by AC:\nA sealed document in a federal court in Maryland, sealed under National Security, documents how Nancy Pelosi, Rod Rosenstein, John Podesta, and John Brennan have tapes of John Roberts talking with Podesta about who would best replace Antonin Scalia, and they were recorded before Scalia died, and apparently had foreknowledge of his death. Roberts flew on Epstein’s plane because Epstein helped him acquire his children from Wales.\nBarack Obama is worth well over billion dollars, much inherited from his step-father who owned it in Halliburton stock.\nMany people in this country will go to jail for treason, and the number that will be just associated with trying to steal this election from our President will be astounding.\nHe predicts a violent period of civil unrest as the Cabal tries to engage in violence as part of their Color Revolution plan, just like we have seen overseas, after Trump wins the Presidency.\nHe believes the Governor of Georgia has been taking kickbacks on Georgia purchases of Dominion voting machines and Chinese PPE orders. And the death of Harrison Deal in a car wreck, which produced an explosion that was heard by witnesses a mile away, was a message to him.\nPat Cipillone, the disloyal White House lawyer trying to thwart President Trump at every turn, drives a new luxury vehicle to the White House every two days, including a Rolls Royce.\nRosenstein, Sally Yates, and Christopher Wray all worked in the same law firm, and are corrupt.\nCIA is the most corrupt organization in the country, and President Trump is about to defang them by pulling all direct-action operational capabilities from the Agency, reducing it to an organization of paper pushers. Oddly enough President Kennedy was about to do that when he was killed, and the memo, named “Memorandum 45,” sat on his desk unsigned. Lin implies President Trump set it in motion by signing that very memo.\nBill Gates is going down as well.\nGeorge Bush 41 and 43, Bill and Hillary, and Obama all ran crime families, and they ran them out of the Oval Office. He said he believes the notes given at Bush 41’s funeral said, “I’m sorry, but they know it all.”\nUnder the 2018 EO on voting integrity, President Trump will have the power to seize all the assets of the Fake News mainstream media once things start happening, because they have profited from trying to aid China in voter fraud.\nHe also points out there were reports of gunfire before the bombing, and that it is inconsistent with a lone bomber, and might indicate good guys killed the bomber before he positioned the bomb appropriately, and that is why the bomber failed to destroy the “evidence” he was trying to destroy.\nLin says he believes if the election is shown to be fraudulent, all down-ballot elections may have to be re-held.\nPresident Trump will prove to be the greatest President in the history of the United States.\nGiven that some of the objects of his criticism have publicly threatened defamation lawsuits, either Lin Woods is off his rocker or he is in possession of hard evidence.\nUPDATE:\nHe’s really\nnot holding anything back\nat this point.\nI am fully aware of the onslaught of attacks being made against me based on my revelations about Chief Justice John Roberts. Before attacking me, maybe fair-minded people would first ask Roberts to tell the truth. Or ask Jeffrey Epstein. He is alive.\nThis suggests that Team Trump has Epstein in protective custody and will produce him at the most effective moment. Could it be disinformation? Certainly. Never trust any authority\na priori\n, including me. Then again, President Trump did warn us that things are going to get wild on January 6th.\nUPDATE:\nDear Gamma retards,\nAccurately reporting what other people are saying on the record is what was once called “journalism”. This should not be confused with either a) betting one’s life on what those other people are saying or b) actually saying it oneself.\nFirst, I don’t care what you think about my credibility. Second, the only way my credibility could be negatively affected by reporting on what other people have said is if you have evidence that they did not, in fact, say it. Third,\nif at all possible\n, please stop being retarded, as witnessing your exhibitions of retardery is infinitely more painful to me than your would-be criticism.",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-12-31T18:36:11+00:00"
}