{
  "url": "https://voxday.net/2020/12/29/dont-talk-to-the-media-part-46567/",
  "scraped_at": "2025-12-21T22:31:17.050724",
  "title": "Don’t talk to the media, part 46,567",
  "date_display": "December 29, 2020",
  "date_iso": "2020-12-29T14:45:02+00:00",
  "date_from_url": "2020-12-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No matter how smart you are, no matter how nice and sympathetic the reporter seems, no matter how interesting your side of the story is, never forget that <a href=\"https://stream.org/they-were-relentless-how-i-learned-respect-for-our-communist-media/\" rel=\"noopener\" target=\"_blank\">the deck is completely stacked against you</a>, as a friend of Supreme Court Justice Brett Kavanagh was reminded in 2018:</p><blockquote><p>This kind of appreciation for the skill of your enemy is essential to dealing with atheist materialists, whether in the old Soviet Union or in the modern media. Sure, the press is filled with people who are incompetent and make unbelievable mistakes. You and I might consider the MSM something of a joke. But don’t be fooled. In the midst of the mediocrities, you’ll also find experts and fanatics. You’ll meet people schooled in opposition research, psychological warfare and emotional manipulation.</p><p>You don’t have to like these facts. (In fact, you shouldn’t.) But you must respect reality. The reporter who has just called you with a list of personal questions might be a goofball — or a trained and skilled interrogator. Assume, to be on the safe side, that he is very likely a deeply damaged, ideologically obsessed and angry human being. One who cares nothing about you, fairness, or even your life. Just like the Russians who tortured Fr. Ciszek.</p><p><b>The Story Was Written Before They Even Contacted You</b></p><p>Every person who comes into the media’s crosshairs should understand this. Nothing you say or do is going to change the story they are going to write. Indeed, the story was written before they even contacted you. They will falsify quotes and leave out facts. They often have reams of opposition research (ugly tales about you) at the ready. If so, they will slowly dole it out to set up and trick a naïve subject.</p><p>To echo Fr. Ciszek: They are relentless, they are thorough, and they are good at their trade. Acknowledging this and not expecting fair or decent treatment will leave you more prepared than most. To become hysterical, or to even talk to them, is to play into their hands. Treat them the way surfers treat sharks — as a deadly adversary that should never be underestimated. I have been a reporter for some many years myself, and I have done a lot of reading on communism from <i>The Gulag Archipelago</i> to China’s Cultural Revolution. So after I hung up with Farrow, I knew exactly what was happening. I had been set up, and it had been a long time in the making. </p></blockquote><p>That’s the key to truly comprehending why you <u>cannot</u> talk to the media. <u>Never</u> talk to the media. The story is already written. Even those who are ex-media experts, such as Pax Dickenson and me, only talk to the media in very rare and particular circumstances when we know we can undermine the pre-written story. But most people haven’t worked in media for over a decade – remember, I was on the board of a television station in addition to having 19 years of experience as a local columnist (St. Paul Pioneer Press, Atlanta Journal/Constitution), as a nationally syndicated columnist (Chronicle Features, Universal Press Syndicate), and as a magazine contributor (Computer Gaming World, Electronic Entertainment) – and therefore have no idea what the pre-written story is or how it can be, in certain circumstances, undermined.</p><p><b>UPDATE: </b>To be clear, Do Not Talk To The Media also means Do Not Respond To Media Requests. Don’t politely decline. Don’t obscenely decline. Don’t write a wall of text explaining your Very Important Personal Media Policy. Ignore it and delete the email, because they can and will attempt to use anything you send them. Just ask Milo….</p></div>",
  "content_text": "No matter how smart you are, no matter how nice and sympathetic the reporter seems, no matter how interesting your side of the story is, never forget that\nthe deck is completely stacked against you\n, as a friend of Supreme Court Justice Brett Kavanagh was reminded in 2018:\nThis kind of appreciation for the skill of your enemy is essential to dealing with atheist materialists, whether in the old Soviet Union or in the modern media. Sure, the press is filled with people who are incompetent and make unbelievable mistakes. You and I might consider the MSM something of a joke. But don’t be fooled. In the midst of the mediocrities, you’ll also find experts and fanatics. You’ll meet people schooled in opposition research, psychological warfare and emotional manipulation.\nYou don’t have to like these facts. (In fact, you shouldn’t.) But you must respect reality. The reporter who has just called you with a list of personal questions might be a goofball — or a trained and skilled interrogator. Assume, to be on the safe side, that he is very likely a deeply damaged, ideologically obsessed and angry human being. One who cares nothing about you, fairness, or even your life. Just like the Russians who tortured Fr. Ciszek.\nThe Story Was Written Before They Even Contacted You\nEvery person who comes into the media’s crosshairs should understand this. Nothing you say or do is going to change the story they are going to write. Indeed, the story was written before they even contacted you. They will falsify quotes and leave out facts. They often have reams of opposition research (ugly tales about you) at the ready. If so, they will slowly dole it out to set up and trick a naïve subject.\nTo echo Fr. Ciszek: They are relentless, they are thorough, and they are good at their trade. Acknowledging this and not expecting fair or decent treatment will leave you more prepared than most. To become hysterical, or to even talk to them, is to play into their hands. Treat them the way surfers treat sharks — as a deadly adversary that should never be underestimated. I have been a reporter for some many years myself, and I have done a lot of reading on communism from\nThe Gulag Archipelago\nto China’s Cultural Revolution. So after I hung up with Farrow, I knew exactly what was happening. I had been set up, and it had been a long time in the making.\nThat’s the key to truly comprehending why you\ncannot\ntalk to the media.\nNever\ntalk to the media. The story is already written. Even those who are ex-media experts, such as Pax Dickenson and me, only talk to the media in very rare and particular circumstances when we know we can undermine the pre-written story. But most people haven’t worked in media for over a decade – remember, I was on the board of a television station in addition to having 19 years of experience as a local columnist (St. Paul Pioneer Press, Atlanta Journal/Constitution), as a nationally syndicated columnist (Chronicle Features, Universal Press Syndicate), and as a magazine contributor (Computer Gaming World, Electronic Entertainment) – and therefore have no idea what the pre-written story is or how it can be, in certain circumstances, undermined.\nUPDATE:\nTo be clear, Do Not Talk To The Media also means Do Not Respond To Media Requests. Don’t politely decline. Don’t obscenely decline. Don’t write a wall of text explaining your Very Important Personal Media Policy. Ignore it and delete the email, because they can and will attempt to use anything you send them. Just ask Milo….",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-12-29T14:45:02+00:00"
}