{
  "url": "https://voxday.net/2020/12/11/dont-mess-with-texas-2/",
  "scraped_at": "2025-12-21T22:28:48.916587",
  "title": "Don’t mess with Texas",
  "date_display": "December 11, 2020",
  "date_iso": "2020-12-11T16:16:08+00:00",
  "date_from_url": "2020-12-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Texas doesn’t hesitate <a href=\"https://www.supremecourt.gov/DocketPDF/22/22O155/163493/20201211095822921_TX-v-State-LeaveReply-2020-12-11.pdf\" rel=\"noopener\" target=\"_blank\">to shoot right back</a> at the assertions made by the four states about its claims. This is just the first section, which deals with the various assertions made in the four responses that Texas’s claims have no basis in fact.</p><blockquote><p>Defendant States’ factual defense of the administration of the 2020 election lacks merit. Thus, Texas states a claim on those issues. </p><p><b>A. Pennsylvania’s critiques of the evidence are false.</b></p><p>Pennsylvania attacks Dr. Cicchetti’s probability analysis calculating that the statistical chances of Mr. Biden’s winning the election in the Defendant States individually and collectively, given the known facts, are less than one in a quadrillion. Penn. Br. 6-8. Pennsylvania argues that Dr Cicchetti did not take into account that “votes counted later were indisputably not ‘randomly drawn’ from the same population of votes” in his analysis.  Penn. Br. 6-8. </p><p>Pennsylvania is wrong.</p><p>First, Dr. Cicchetti did take into account the possibility that votes were not randomly drawn in the later time period but, as stated in his original Declaration, he is not aware of any data that would support such an assertion. See Supplemental Declaration of Charles Cicchetti (“Supp. Cicchetti Decl.”) ¶¶ 2-3. (App. 152a-153a). Second, although Pennsylvania argues that such data is “indisputabl[e]”, Pennsylvania offers in support nothing other than counsel’s assertion. Unsworn statements of counsel, however, are not evidence. See Frazier v. United States, 335 U.S. 497, 503 (1948).</p><p>In fact, Pennsylvania’s rebuttal to Dr. Cicchetti’s analysis consists solely of ad hominem attacks, calling it “nonsense” and “worthless”.  Penn Br. 6, 8. Notably, a subsequent analysis by Dr. Cicchetti, comparing Mr. Biden’s underperformance in the Top-50 urban areas in the Country relative to former Secretary Clinton’s performance in the 2016 election, reinforces the unusual statistical improbability of Mr. Biden’s vote totals in the five urban areas in the Defendant States. See Supp. Cicchetti Decl. at ¶¶ 4-12, 20-21. (App. 154a-158a).</p><p>Pennsylvania also tries to explain away the reported 400,000 discrepancy between the number of mail-in ballots Pennsylvania sent out as reported on November 2, 2020 (2.7 million) and the figure reported on November 4, 2020 (3.1 million) as described in the Ryan Report. Penn. Br. 6-8; Compl. ¶ 59. </p><p>Pennsylvania again conclusorily asserts that the discrepancy is purportedly due to the fact that “[o]f the 3.1 million ballots sent out, 2.7 million were mail-in ballots and 400,000 were absentee ballots.” Pennsylvania Br. 6.  However, as fifteen Pennsylvania legislators stated in the Ryan Report, signed on December 4, 2020: “This discrepancy … has not been explained.” Compl. ¶ 59. Compl. ¶ 59 (App. 143a-44a). </p><p>The Ryan Report states further: “This apparent discrepancy can only be evaluated by reviewing all transaction logs into the SURE system…” (App. 144a). Pennsylvania’s unsupported explanation has no merit.</p><p>Notably, Pennsylvania says nothing about the 118,426 ballots that had no mail date, were nonsensically returned before the mailed date, or were improbably returned one day after the mail date. Lastly, Pennsylvania argues that it did not break its promise to this Court to segregate ballots received after November 3, 2020.  Penn. Br. 6.  Justice Alito’s order dated November 6, 2020 belies that argument. See Compl. ¶ 8.  And because Pennsylvania broke its promise to this Court, it is not possible to determine how many tens, or even hundreds of thousands of illegal late ballots were wrongfully counted. Compl. ¶ 55.</p><p><b>B. Georgia’s critiques of the evidence are false.</b></p><p>Georgia argues that the “[r]ejection rates for signatures on absentee ballots remained largely unchanged” as between the 2018 and 2020 elections, referring the Court to Wood v. Raffensperger, No. 1:20-cv-04651-SDG, 2020 WL 6817513, at *10 (N.D. Ga. Nov. 20, 2020) (“Wood”). Georgia Br. 4.  Georgia’s reliance on Wood is misplaced because the analysis therein related to rejection rates for absentee ballots—as opposed to the mail-in ballots analyzed by Dr. Cicchetti. Supp. Cicchetti Decl. ¶¶ 13-19. (App. 158a-60a). Georgia’s rejection rate comparison is therefore inapposite.  Id.</p><p>Specifically, the district court in Wood cited to “ECF 33-6” (id. at n.30) which is the affidavit of Chris Harvey, Georgia Director of Elections.  First, the Harvey Affidavit itself does not cite any evidence for signature rejection rates; rather, it relies solely upon a complaint in an unrelated action. Supp. Cicchetti Decl. ¶¶ 14-15. (App. 158a-59a) (citing Democratic Party of Georgia et al. v. Raffensperger).   Second, as explained by Dr. Cicchetti, the Harvey Affidavit relies on 2018 data which does not provide an accurate comparison with a presidential election year. Id. ¶¶ 19, 22. (App. 160a-62a).  More importantly, the Harvey affidavit discusses absentee ballots—not mail-in ballots at issue here and as analyzed by Dr. Cicchetti.  Mail-in ballots are subject to much higher rejection rates. Indeed, in 2018, the rejection rate for mail-in ballots was actually 3.32{e61d147451bc60549e96d95b5c07be35845e0345eab7ed5d54cc3d49f812ab5c} or more than twenty times higher than the rejection rate for the absentee ballots that Georgia incorrectly compares to dispute Dr. Cicchetti’s analysis. .  Id. at ¶¶ 16-18. (App. 159a-60a).   In short, Georgia’s attempt to rebut Dr. Cicchetti’s analysis fails. Id. ¶ 22. (App. 161a-62a).</p><p><b>C. Michigan’s critiques of the evidence are false.</b></p><p>Michigan’s argument against the evidence of irregularities in Wayne County’s election process fares no better.  First, Michigan concedes that, with respect to the ballots issued pursuant to the Secretary of State’s unlawful mailing of ballot applications and online ballot applications—which also did not comply with statutory signature verification requirements— “there is no way to associate the voter who used a particular application with his or her ballot after it is voted.” Mich. Br. 9; Compl. ¶¶ 81-87. Michigan’s “heads we win, tails you lose” defense should be rejected.  This is a problem solely of the Secretary of State’s own making.</p><p>Michigan also admits that it “is at a loss to explain the[] allegations” showing that Wayne County lists 174,384 absentee ballots that do not tie to a registered voter.  Mich. Br. 15; Compl. ¶ 97.  That is precisely the point.  And it illustrates exactly why the Court should grant Plaintiff’s motion.</p><p>Similarly, Michigan’s argument that the fact that 71{e61d147451bc60549e96d95b5c07be35845e0345eab7ed5d54cc3d49f812ab5c} of Detroit’s Absent Voter Counting Boards (“AVCBs”) were unbalanced provides no basis not to certify results is false. Mich. Br. 16.  In fact, while Michigan asserts that this “can happen for a number of innocuous reasons” it nonetheless offers no explanation for the highly suspicious circumstances: that this out of balance situation resulted in more than 174,000 votes not being tied to a registered voter; that two members of the Wayne County Board of Canvassers initially voted against certification based on these issues, then voted in favor of certification after receiving both threats and assurances of an immediate audit; and then rescinded their certification votes after the promised audit was refused.  Compl. ¶¶ 99-101. Texas understands that these issues involving Wayne County’s irregular votes have not been adjudicated, and Michigan does not contend otherwise. But it is suggestive at this preliminary stage of the proceeding.</p><p>Lastly, Michigan’s attempts to argue away the evidence showing that Wayne County had a policy of not performing signature verifications as required under MCL § 168.765a(6) are misplaced. Mich. Br. 14-15; Compl. ¶¶ 85-87, 92-95.  Michigan cites the affidavit of Christopher Thomas, a consultant for Detroit, used in litigation in Michigan state court, as evidence for its assertion. Mich. Br. 11, 15-16. </p><p>Thomas, however, does not state that he personally observed signatures being verified in accordance with MCL § 168.765a(6).  That statute requires that the clerk place a “written statement” or “stamp” on each ballot envelope where the voter signature is placed, indicating that the voter signature was in fact checked and verified with the signature on file with the State. Compl. ¶ 92.  Thus, contrary to Michigan’s argument, Thomas’ assertions do not rebut the testimony of Jessy Jacob, a decades-long City of Detroit employee stating that election workers were instructed not to compare signatures. Id. ¶ 94.  In fact, a poll challenger, Lisa Gage, testified in an affidavit that has not been submitted in any prior litigation, that not a single one of the several hundred to a thousand ballot envelopes she observed had a written statement or stamp indicating the voter signature had been verified at the TCF Center in accordance with MCL § 168.765a(6). Affidavit of Lisa Gage ¶ 17. (App. 165a).</p><p><b>D. Wisconsin’s critiques of the evidence are false.</b></p><p>Wisconsin argues that “Texas offers no proof of a single voter who cast a ballot in the general election who did not qualify for indefinite confinement status.”  Wisc. Br. 31. Under Wisconsin law, “indefinite confinement status” allows a voter to avoid Wisconsin’s statutory photo identification and signature verification requirements.  Compl. ¶¶ 115-17. The number of people claiming this special status exploded from fewer than 57,000 voters in 2016 to nearly 216,000 in 2020.  Compl. ¶ 122.  Wisconsin claims this increase was due to more people voting by mail in 2020.  Wisc. Br. 31.</p><p>Voting by mail, however, has nothing to do with being classified as “indefinitely confined.” Wisconsin offers no plausible justification for this nearly four-fold increase in voters claiming this special status.  </p><p>Wisconsin also ignores the fact that the Wisconsin Supreme Court found that clerks in Dane County and Milwaukee County had earlier violated Wisconsin law by issuing guidance stating that all voters should identify themselves as “indefinitely confined” on absentee ballot applications because of the COVID-19 pandemic.  Compl. ¶¶ 118-19.  Despite that order, the WEC again violated Wisconsin law and issued a directive to the Wisconsin clerks prohibiting removal of voters from the registry for indefinite-confinement status even if the voter is no longer “indefinitely confined,” thereby cementing this improper practice in the 2020 general election. Id. at ¶¶ 120-21.</p><p>Lastly, Wisconsin ignores the sworn testimony of Ethan J. Pease, a box truck delivery driver subcontracted to the U.S. Postal Service (“USPS”) to deliver truckloads of mail-in ballots to the sorting center in Madison, WI, who testified that USPS employees were backdating ballots received after November 3, 2020.  Compl. ¶127. (App. 149a-151a). </p><p>Further, Pease testified how a senior USPS employee told him on November 4, 2020 that “An order came down from the Wisconsin/Illinois Chapter of the Postal Service that 100,000 ballots” had been misplaced and described how the USPS dispatched employees to “find[] … the ballots.” Id. (App. 150a).</p></blockquote><p>It’s pretty clear already that Texas has both the facts and the law on its side. That doesn’t mean it will win, of course, because the law is really little more than a game of giving the judge(s) the legal justification to do what he thinks best. But Texas has provided the Supreme Court with considerably more ammunition than the PA-GA-MI-WI cabal.</p><p>I especially like that Texas has called out the “heads we win, tails you lose” defense that Michigan is trying to play. I find that sort of Catch-22 nonsense to be particularly obnoxious.</p></div>",
  "content_text": "Texas doesn’t hesitate\nto shoot right back\nat the assertions made by the four states about its claims. This is just the first section, which deals with the various assertions made in the four responses that Texas’s claims have no basis in fact.\nDefendant States’ factual defense of the administration of the 2020 election lacks merit. Thus, Texas states a claim on those issues.\nA. Pennsylvania’s critiques of the evidence are false.\nPennsylvania attacks Dr. Cicchetti’s probability analysis calculating that the statistical chances of Mr. Biden’s winning the election in the Defendant States individually and collectively, given the known facts, are less than one in a quadrillion. Penn. Br. 6-8. Pennsylvania argues that Dr Cicchetti did not take into account that “votes counted later were indisputably not ‘randomly drawn’ from the same population of votes” in his analysis.  Penn. Br. 6-8.\nPennsylvania is wrong.\nFirst, Dr. Cicchetti did take into account the possibility that votes were not randomly drawn in the later time period but, as stated in his original Declaration, he is not aware of any data that would support such an assertion. See Supplemental Declaration of Charles Cicchetti (“Supp. Cicchetti Decl.”) ¶¶ 2-3. (App. 152a-153a). Second, although Pennsylvania argues that such data is “indisputabl[e]”, Pennsylvania offers in support nothing other than counsel’s assertion. Unsworn statements of counsel, however, are not evidence. See Frazier v. United States, 335 U.S. 497, 503 (1948).\nIn fact, Pennsylvania’s rebuttal to Dr. Cicchetti’s analysis consists solely of ad hominem attacks, calling it “nonsense” and “worthless”.  Penn Br. 6, 8. Notably, a subsequent analysis by Dr. Cicchetti, comparing Mr. Biden’s underperformance in the Top-50 urban areas in the Country relative to former Secretary Clinton’s performance in the 2016 election, reinforces the unusual statistical improbability of Mr. Biden’s vote totals in the five urban areas in the Defendant States. See Supp. Cicchetti Decl. at ¶¶ 4-12, 20-21. (App. 154a-158a).\nPennsylvania also tries to explain away the reported 400,000 discrepancy between the number of mail-in ballots Pennsylvania sent out as reported on November 2, 2020 (2.7 million) and the figure reported on November 4, 2020 (3.1 million) as described in the Ryan Report. Penn. Br. 6-8; Compl. ¶ 59.\nPennsylvania again conclusorily asserts that the discrepancy is purportedly due to the fact that “[o]f the 3.1 million ballots sent out, 2.7 million were mail-in ballots and 400,000 were absentee ballots.” Pennsylvania Br. 6.  However, as fifteen Pennsylvania legislators stated in the Ryan Report, signed on December 4, 2020: “This discrepancy … has not been explained.” Compl. ¶ 59. Compl. ¶ 59 (App. 143a-44a).\nThe Ryan Report states further: “This apparent discrepancy can only be evaluated by reviewing all transaction logs into the SURE system…” (App. 144a). Pennsylvania’s unsupported explanation has no merit.\nNotably, Pennsylvania says nothing about the 118,426 ballots that had no mail date, were nonsensically returned before the mailed date, or were improbably returned one day after the mail date. Lastly, Pennsylvania argues that it did not break its promise to this Court to segregate ballots received after November 3, 2020.  Penn. Br. 6.  Justice Alito’s order dated November 6, 2020 belies that argument. See Compl. ¶ 8.  And because Pennsylvania broke its promise to this Court, it is not possible to determine how many tens, or even hundreds of thousands of illegal late ballots were wrongfully counted. Compl. ¶ 55.\nB. Georgia’s critiques of the evidence are false.\nGeorgia argues that the “[r]ejection rates for signatures on absentee ballots remained largely unchanged” as between the 2018 and 2020 elections, referring the Court to Wood v. Raffensperger, No. 1:20-cv-04651-SDG, 2020 WL 6817513, at *10 (N.D. Ga. Nov. 20, 2020) (“Wood”). Georgia Br. 4.  Georgia’s reliance on Wood is misplaced because the analysis therein related to rejection rates for absentee ballots—as opposed to the mail-in ballots analyzed by Dr. Cicchetti. Supp. Cicchetti Decl. ¶¶ 13-19. (App. 158a-60a). Georgia’s rejection rate comparison is therefore inapposite.  Id.\nSpecifically, the district court in Wood cited to “ECF 33-6” (id. at n.30) which is the affidavit of Chris Harvey, Georgia Director of Elections.  First, the Harvey Affidavit itself does not cite any evidence for signature rejection rates; rather, it relies solely upon a complaint in an unrelated action. Supp. Cicchetti Decl. ¶¶ 14-15. (App. 158a-59a) (citing Democratic Party of Georgia et al. v. Raffensperger).   Second, as explained by Dr. Cicchetti, the Harvey Affidavit relies on 2018 data which does not provide an accurate comparison with a presidential election year. Id. ¶¶ 19, 22. (App. 160a-62a).  More importantly, the Harvey affidavit discusses absentee ballots—not mail-in ballots at issue here and as analyzed by Dr. Cicchetti.  Mail-in ballots are subject to much higher rejection rates. Indeed, in 2018, the rejection rate for mail-in ballots was actually 3.32{e61d147451bc60549e96d95b5c07be35845e0345eab7ed5d54cc3d49f812ab5c} or more than twenty times higher than the rejection rate for the absentee ballots that Georgia incorrectly compares to dispute Dr. Cicchetti’s analysis. .  Id. at ¶¶ 16-18. (App. 159a-60a).   In short, Georgia’s attempt to rebut Dr. Cicchetti’s analysis fails. Id. ¶ 22. (App. 161a-62a).\nC. Michigan’s critiques of the evidence are false.\nMichigan’s argument against the evidence of irregularities in Wayne County’s election process fares no better.  First, Michigan concedes that, with respect to the ballots issued pursuant to the Secretary of State’s unlawful mailing of ballot applications and online ballot applications—which also did not comply with statutory signature verification requirements— “there is no way to associate the voter who used a particular application with his or her ballot after it is voted.” Mich. Br. 9; Compl. ¶¶ 81-87. Michigan’s “heads we win, tails you lose” defense should be rejected.  This is a problem solely of the Secretary of State’s own making.\nMichigan also admits that it “is at a loss to explain the[] allegations” showing that Wayne County lists 174,384 absentee ballots that do not tie to a registered voter.  Mich. Br. 15; Compl. ¶ 97.  That is precisely the point.  And it illustrates exactly why the Court should grant Plaintiff’s motion.\nSimilarly, Michigan’s argument that the fact that 71{e61d147451bc60549e96d95b5c07be35845e0345eab7ed5d54cc3d49f812ab5c} of Detroit’s Absent Voter Counting Boards (“AVCBs”) were unbalanced provides no basis not to certify results is false. Mich. Br. 16.  In fact, while Michigan asserts that this “can happen for a number of innocuous reasons” it nonetheless offers no explanation for the highly suspicious circumstances: that this out of balance situation resulted in more than 174,000 votes not being tied to a registered voter; that two members of the Wayne County Board of Canvassers initially voted against certification based on these issues, then voted in favor of certification after receiving both threats and assurances of an immediate audit; and then rescinded their certification votes after the promised audit was refused.  Compl. ¶¶ 99-101. Texas understands that these issues involving Wayne County’s irregular votes have not been adjudicated, and Michigan does not contend otherwise. But it is suggestive at this preliminary stage of the proceeding.\nLastly, Michigan’s attempts to argue away the evidence showing that Wayne County had a policy of not performing signature verifications as required under MCL § 168.765a(6) are misplaced. Mich. Br. 14-15; Compl. ¶¶ 85-87, 92-95.  Michigan cites the affidavit of Christopher Thomas, a consultant for Detroit, used in litigation in Michigan state court, as evidence for its assertion. Mich. Br. 11, 15-16.\nThomas, however, does not state that he personally observed signatures being verified in accordance with MCL § 168.765a(6).  That statute requires that the clerk place a “written statement” or “stamp” on each ballot envelope where the voter signature is placed, indicating that the voter signature was in fact checked and verified with the signature on file with the State. Compl. ¶ 92.  Thus, contrary to Michigan’s argument, Thomas’ assertions do not rebut the testimony of Jessy Jacob, a decades-long City of Detroit employee stating that election workers were instructed not to compare signatures. Id. ¶ 94.  In fact, a poll challenger, Lisa Gage, testified in an affidavit that has not been submitted in any prior litigation, that not a single one of the several hundred to a thousand ballot envelopes she observed had a written statement or stamp indicating the voter signature had been verified at the TCF Center in accordance with MCL § 168.765a(6). Affidavit of Lisa Gage ¶ 17. (App. 165a).\nD. Wisconsin’s critiques of the evidence are false.\nWisconsin argues that “Texas offers no proof of a single voter who cast a ballot in the general election who did not qualify for indefinite confinement status.”  Wisc. Br. 31. Under Wisconsin law, “indefinite confinement status” allows a voter to avoid Wisconsin’s statutory photo identification and signature verification requirements.  Compl. ¶¶ 115-17. The number of people claiming this special status exploded from fewer than 57,000 voters in 2016 to nearly 216,000 in 2020.  Compl. ¶ 122.  Wisconsin claims this increase was due to more people voting by mail in 2020.  Wisc. Br. 31.\nVoting by mail, however, has nothing to do with being classified as “indefinitely confined.” Wisconsin offers no plausible justification for this nearly four-fold increase in voters claiming this special status.\nWisconsin also ignores the fact that the Wisconsin Supreme Court found that clerks in Dane County and Milwaukee County had earlier violated Wisconsin law by issuing guidance stating that all voters should identify themselves as “indefinitely confined” on absentee ballot applications because of the COVID-19 pandemic.  Compl. ¶¶ 118-19.  Despite that order, the WEC again violated Wisconsin law and issued a directive to the Wisconsin clerks prohibiting removal of voters from the registry for indefinite-confinement status even if the voter is no longer “indefinitely confined,” thereby cementing this improper practice in the 2020 general election. Id. at ¶¶ 120-21.\nLastly, Wisconsin ignores the sworn testimony of Ethan J. Pease, a box truck delivery driver subcontracted to the U.S. Postal Service (“USPS”) to deliver truckloads of mail-in ballots to the sorting center in Madison, WI, who testified that USPS employees were backdating ballots received after November 3, 2020.  Compl. ¶127. (App. 149a-151a).\nFurther, Pease testified how a senior USPS employee told him on November 4, 2020 that “An order came down from the Wisconsin/Illinois Chapter of the Postal Service that 100,000 ballots” had been misplaced and described how the USPS dispatched employees to “find[] … the ballots.” Id. (App. 150a).\nIt’s pretty clear already that Texas has both the facts and the law on its side. That doesn’t mean it will win, of course, because the law is really little more than a game of giving the judge(s) the legal justification to do what he thinks best. But Texas has provided the Supreme Court with considerably more ammunition than the PA-GA-MI-WI cabal.\nI especially like that Texas has called out the “heads we win, tails you lose” defense that Michigan is trying to play. I find that sort of Catch-22 nonsense to be particularly obnoxious.",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-12-11T16:16:08+00:00"
}