{
  "url": "https://voxday.net/2020/12/10/how-the-sbc-was-converged/",
  "scraped_at": "2025-12-21T22:28:34.159870",
  "title": "How the SBC was converged",
  "date_display": "December 10, 2020",
  "date_iso": "2020-12-10T15:22:12+00:00",
  "date_from_url": "2020-12-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> As usual, listening to the self-appointed experts who inevitably recommend that more resources and influence be directed their way <a href=\"https://randyadams.org/2020/12/09/does-namb-and-the-erlc-believe-the-end-justifies-the-means/\" rel=\"noopener noreferrer\" target=\"_blank\">has led to convergence</a>, declining members, declining revenues, and organizational failure for the Southern Baptist Convention:</p><blockquote><p>Most of my writing on Southern Baptist Convention (SBC) issues has focused on our diminished effectiveness in advancing the Great Commission and what we must do to become more evangelistically effective. That is what I care about most, reaching every person with the good news of Jesus Christ. Some of you have learned something of my thinking through a series of articles I wrote in February and March about “saving the SBC ship,” and giving the ship back to those who built it.</p><p>My essential contention is that the SBC took the wrong road when it adopted the Great Commission Resurgence (GCR) recommendations in 2010 and the annual reports of the SBC prove it. The last 10 years are the worst decade in the 175-year history of the SBC in terms of decline. The GCR put the SBC on a road in which the national entities gained power and financial resources, and local Associations and State Conventions lost influence and resources. The practical effect was that the SBC became more “top-down” as tens of millions of dollars were shifted to the national SBC from more local cooperative partners. Although I serve the Northwest Baptist Convention (NWBC) of churches, and stewardship of the NWBC is my primary concern, most of our churches are affiliated with the SBC and the road taken by the SBC in 2010 greatly affects our work in the Northwest. My most recent article on this, illustrated with charts, can be read at <a href=\"https://randyadams.org/2020/10/14/the-crisis-of-decline-in-the-sbc-why/.\" rel=\"noopener noreferrer\" target=\"_blank\">The Crisis of the Decline in the SBC</a>.</p></blockquote><p>It’s the same damned – literally damned- thing every single time. FFS, when are Christians going to learn that being tolerant and nice and inclusive is quite literally the broad and easy way to Hell? If the world is celebrating you, your books are on all the bestseller lists, and the media is saying nice things about you, then you are doing Christianity wrong!</p><p>The world hates Jesus Christ. If it doesn’t hate you, then you’re probably not much of a Christian. The ERLC people are liars. And they serve their Father, the Devil.</p><blockquote><p>Recently the ERLC was caught claiming that the SBC is a “hierarchy” and “umbrella” organization of all Southern Baptist churches and organizations in an amicus brief filed in support of NAMB.</p></blockquote><p>Give them enough time and they’ll be filing amicus briefs in favor of NAMBLA. </p></div>",
  "content_text": "As usual, listening to the self-appointed experts who inevitably recommend that more resources and influence be directed their way\nhas led to convergence\n, declining members, declining revenues, and organizational failure for the Southern Baptist Convention:\nMost of my writing on Southern Baptist Convention (SBC) issues has focused on our diminished effectiveness in advancing the Great Commission and what we must do to become more evangelistically effective. That is what I care about most, reaching every person with the good news of Jesus Christ. Some of you have learned something of my thinking through a series of articles I wrote in February and March about “saving the SBC ship,” and giving the ship back to those who built it.\nMy essential contention is that the SBC took the wrong road when it adopted the Great Commission Resurgence (GCR) recommendations in 2010 and the annual reports of the SBC prove it. The last 10 years are the worst decade in the 175-year history of the SBC in terms of decline. The GCR put the SBC on a road in which the national entities gained power and financial resources, and local Associations and State Conventions lost influence and resources. The practical effect was that the SBC became more “top-down” as tens of millions of dollars were shifted to the national SBC from more local cooperative partners. Although I serve the Northwest Baptist Convention (NWBC) of churches, and stewardship of the NWBC is my primary concern, most of our churches are affiliated with the SBC and the road taken by the SBC in 2010 greatly affects our work in the Northwest. My most recent article on this, illustrated with charts, can be read at\nThe Crisis of the Decline in the SBC\n.\nIt’s the same damned – literally damned- thing every single time. FFS, when are Christians going to learn that being tolerant and nice and inclusive is quite literally the broad and easy way to Hell? If the world is celebrating you, your books are on all the bestseller lists, and the media is saying nice things about you, then you are doing Christianity wrong!\nThe world hates Jesus Christ. If it doesn’t hate you, then you’re probably not much of a Christian. The ERLC people are liars. And they serve their Father, the Devil.\nRecently the ERLC was caught claiming that the SBC is a “hierarchy” and “umbrella” organization of all Southern Baptist churches and organizations in an amicus brief filed in support of NAMB.\nGive them enough time and they’ll be filing amicus briefs in favor of NAMBLA.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-12-10T15:22:12+00:00"
}