{
  "url": "https://voxday.net/2020/12/26/important-blog-concepts/",
  "scraped_at": "2025-12-21T22:30:58.788546",
  "title": "Important blog concepts",
  "date_display": "December 26, 2020",
  "date_iso": "2020-12-26T14:05:47+00:00",
  "date_from_url": "2020-12-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Things that you should know if you wish to comment here. They are inspired, of course, by my favorite scene in the late, great Umberto Eco’s <i>Foucault’s Pendulum</i>.</p><ul style=\"text-align: left;\"><li><b>Inquisitional autoimpedimentation: </b>the art of asking me for tech support in order to be able to comment on the blog.</li><li><b>Pertinaxic adverselectational taciturnitation:</b> the science of silencing yourself by regularly taking positions that are so predictably contrarian that you get yourself banned.</li><li><b>Atromonomaniaical exiliation:</b> The art of removing yourself from the commentary pool by exhibiting an obsessive fixation on a single subject, regardless of the topic being discussed.</li><li><b>Civilostentatious animic angustiation: </b>The act of putting your psychological trauma on public display through your commentary.</li></ul></div>",
  "content_text": "Things that you should know if you wish to comment here. They are inspired, of course, by my favorite scene in the late, great Umberto Eco’s\nFoucault’s Pendulum\n.\nInquisitional autoimpedimentation:\nthe art of asking me for tech support in order to be able to comment on the blog.\nPertinaxic adverselectational taciturnitation:\nthe science of silencing yourself by regularly taking positions that are so predictably contrarian that you get yourself banned.\nAtromonomaniaical exiliation:\nThe art of removing yourself from the commentary pool by exhibiting an obsessive fixation on a single subject, regardless of the topic being discussed.\nCivilostentatious animic angustiation:\nThe act of putting your psychological trauma on public display through your commentary.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-12-26T14:05:47+00:00"
}