{
  "url": "https://voxday.net/2020/12/21/its-really-not-that-complicated/",
  "scraped_at": "2025-12-21T22:30:19.340737",
  "title": "It’s really not that complicated",
  "date_display": "December 21, 2020",
  "date_iso": "2020-12-21T13:23:55+00:00",
  "date_from_url": "2020-12-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> Patreon confirms that its lawsuit against the 72 Bears isn’t complex.</p><blockquote><p>PLEASE TAKE NOTICE that Plaintiff Patreon, Inc. does not oppose Defendants’ Motion to Designate Case as Not Complex, filed December 9, 2020.  The parties stipulated on October 7, 2020 that this case should not be designated as complex. </p></blockquote><p>So as I surmised at the time, the belated designation of the Patreon case as complex litigation was just a mistake by the Clerk of the Court rather than shenanigans on anyone’s part. That mistake has been corrected and the only real consequence of this is the delay of what is best understood as a motion to dismiss being heard by Judge Schulman from December 16 to January 20.</p><p>The result of that hearing are not seriously in doubt, since as the Legal Legion has explained it to me, Patreon’s lawyers have never grasped that California law generally does not permit two simultaneous iterations of the same proceeding in different jurisdictions. Their lawyers appear to have misunderstood the case law that permits questions of arbitrability to be heard by a court BEFORE an arbitration begins in much the same way that an arbitration award can be challenged AFTER an arbitration ends.</p><p>But, as Judge Schulman’s order on the preliminary injunction has already explained, the courts are not generally permitted to, nor can they reasonably be expected to, interfere with <i>ongoing </i>arbitration proceedings once they have begun. So, the most likely outcome is that Judge Schulman will throw the Patreon case out for being untimely, and tell them to challenge the awards in the future if they don’t like the way the arbitrations turn out.</p><p>Which they probably won’t. The fact that Patreon has recently changed its terms of use to preclude arbitration rather than mandate it, and has removed its illegal forced waivers of jury trials and class actions, would appear to provide a fairly reliable guide to how Patreon thinks the arbitrations are going.</p></div>",
  "content_text": "Patreon confirms that its lawsuit against the 72 Bears isn’t complex.\nPLEASE TAKE NOTICE that Plaintiff Patreon, Inc. does not oppose Defendants’ Motion to Designate Case as Not Complex, filed December 9, 2020.  The parties stipulated on October 7, 2020 that this case should not be designated as complex.\nSo as I surmised at the time, the belated designation of the Patreon case as complex litigation was just a mistake by the Clerk of the Court rather than shenanigans on anyone’s part. That mistake has been corrected and the only real consequence of this is the delay of what is best understood as a motion to dismiss being heard by Judge Schulman from December 16 to January 20.\nThe result of that hearing are not seriously in doubt, since as the Legal Legion has explained it to me, Patreon’s lawyers have never grasped that California law generally does not permit two simultaneous iterations of the same proceeding in different jurisdictions. Their lawyers appear to have misunderstood the case law that permits questions of arbitrability to be heard by a court BEFORE an arbitration begins in much the same way that an arbitration award can be challenged AFTER an arbitration ends.\nBut, as Judge Schulman’s order on the preliminary injunction has already explained, the courts are not generally permitted to, nor can they reasonably be expected to, interfere with\nongoing\narbitration proceedings once they have begun. So, the most likely outcome is that Judge Schulman will throw the Patreon case out for being untimely, and tell them to challenge the awards in the future if they don’t like the way the arbitrations turn out.\nWhich they probably won’t. The fact that Patreon has recently changed its terms of use to preclude arbitration rather than mandate it, and has removed its illegal forced waivers of jury trials and class actions, would appear to provide a fairly reliable guide to how Patreon thinks the arbitrations are going.",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-12-21T13:23:55+00:00"
}