{
  "url": "https://voxday.net/2020/12/21/lawyers-dont-do-strategy/",
  "scraped_at": "2025-12-21T22:30:17.098799",
  "title": "Lawyers don’t do strategy",
  "date_display": "December 21, 2020",
  "date_iso": "2020-12-21T11:14:21+00:00",
  "date_from_url": "2020-12-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And they certainly don’t make strategic decisions. But <a href=\"https://www.thegatewaypundit.com/2020/12/betrayed-within-patrick-byrne-blasts-white-house-staff-attending-election-meeting-president-trump-sydney-powell-gen-flynn/\" rel=\"noopener\" target=\"_blank\">this report by Patrick Byrn</a>e concerning a recent meeting at the White House would sound a lot more concerning if it wasn’t obviously limited to the President’s legal team:</p><blockquote><p>“I was there for the full 4.5 hour meeting. Claims military coup/martial law were discussed is 100{e61d147451bc60549e96d95b5c07be35845e0345eab7ed5d54cc3d49f812ab5c} fabrication. Trump is lied to by his own advisers, who tell staff “get the president to concede“ while they stall Trump. Meadows + Lawyers Eric, Derek, GC Pat Cippollone (leaker).”</p><p>“Meadows and legal staff led by GC Cippolone reflexively shoot down every sober discussion or idea presented. Their frame of mind is automatic: “we better not try that, it may not work, it would hurt your reputation in the press…“ No kidding, they say stuff like that. Tell DJT.”</p><p>Byrne named the advisors he believes are hurting Trump, “Pat Cippollone and two other lawyers. Eric and Derek. Meadows wants him to concede and transition also.”</p><p>Responding to a poster who offered an opinion on why the establishment is intent on getting rid of Trump, “I’m convinced the US Establishment including the Republican Establishment have decided to end the Trump era. They want Biden/Harris and the Globalist Reset. The reason they have resorted to such extreme measures is because the Reset is time critical. They need the US on board now,” Byrne replied, “Correct.”</p><p>Byrne responded to several questions about the meeting and Trump’s attitude, It is 100{e61d147451bc60549e96d95b5c07be35845e0345eab7ed5d54cc3d49f812ab5c} winnable. No martial law required. Sydney and Flynn presented a course that I estimate has 50{e61d147451bc60549e96d95b5c07be35845e0345eab7ed5d54cc3d49f812ab5c} – 75{e61d147451bc60549e96d95b5c07be35845e0345eab7ed5d54cc3d49f812ab5c} chance of victory. His staff just try to convince him to do nothing but accept it. As a CEO, my heart broke to see what he is going through. He is betrayed from within.”…”He truly believe he won and he truly did win. I did not vote for him, but I don’t want to see our country hijacked in a psyop.”…”Too nice. Thinks he will look bad in press. Nonsense like that.”…He wants to fight on. They are bending over backwards to come up with reasons to tell him he can’t do anything. He needs to fire them all or he loses.”</p></blockquote><p>One thing I’ve learned over the last few years is that lawyers are, for the most part, among the most cowardly people on the planet. They’re only the big tough intimidating courtroom giants they are portrayed as being on television when they are on the offensive and believe they are untouchable because the conflict doesn’t directly concern them. They tend to fold the minute that even the slightest criticism is directed at them personally; I’ve heard genuine panic in the voice of a top lawyer from a very high status firm when she was simply told to “stop lying”. The Legal Legion is most definitely <i>not even close</i> to the norm in the legal world.</p><p>Basically, they live in complete terror of the judges all the time, and unless a strategy offers a 100-percent chance of success, they don’t like it. “It may not work so we better not try it” rings absolutely true. They really don’t like genuine conflict and they are not accustomed to it; they remind me of point fighters facing the prospect of going into the full-contact ring for the first time.</p><p>That being said, there is zero chance that this group, with that lawerly mindset, has anything whatsoever to do with the NSA and military intelligence teams that set the election trap and is reported to “have it all”. So, while I think Byrne’s report is likely real, I don’t think it is as relevant as it sounds, because I think this is the legal plan team, as opposed to the legislative plan team, as opposed to the defend-the-Constitution team. And I doubt President Trump has much confidence in them, because he has a lot more experience with lawyers and knows far more about them than I do.</p></div>",
  "content_text": "And they certainly don’t make strategic decisions. But\nthis report by Patrick Byrn\ne concerning a recent meeting at the White House would sound a lot more concerning if it wasn’t obviously limited to the President’s legal team:\n“I was there for the full 4.5 hour meeting. Claims military coup/martial law were discussed is 100{e61d147451bc60549e96d95b5c07be35845e0345eab7ed5d54cc3d49f812ab5c} fabrication. Trump is lied to by his own advisers, who tell staff “get the president to concede“ while they stall Trump. Meadows + Lawyers Eric, Derek, GC Pat Cippollone (leaker).”\n“Meadows and legal staff led by GC Cippolone reflexively shoot down every sober discussion or idea presented. Their frame of mind is automatic: “we better not try that, it may not work, it would hurt your reputation in the press…“ No kidding, they say stuff like that. Tell DJT.”\nByrne named the advisors he believes are hurting Trump, “Pat Cippollone and two other lawyers. Eric and Derek. Meadows wants him to concede and transition also.”\nResponding to a poster who offered an opinion on why the establishment is intent on getting rid of Trump, “I’m convinced the US Establishment including the Republican Establishment have decided to end the Trump era. They want Biden/Harris and the Globalist Reset. The reason they have resorted to such extreme measures is because the Reset is time critical. They need the US on board now,” Byrne replied, “Correct.”\nByrne responded to several questions about the meeting and Trump’s attitude, It is 100{e61d147451bc60549e96d95b5c07be35845e0345eab7ed5d54cc3d49f812ab5c} winnable. No martial law required. Sydney and Flynn presented a course that I estimate has 50{e61d147451bc60549e96d95b5c07be35845e0345eab7ed5d54cc3d49f812ab5c} – 75{e61d147451bc60549e96d95b5c07be35845e0345eab7ed5d54cc3d49f812ab5c} chance of victory. His staff just try to convince him to do nothing but accept it. As a CEO, my heart broke to see what he is going through. He is betrayed from within.”…”He truly believe he won and he truly did win. I did not vote for him, but I don’t want to see our country hijacked in a psyop.”…”Too nice. Thinks he will look bad in press. Nonsense like that.”…He wants to fight on. They are bending over backwards to come up with reasons to tell him he can’t do anything. He needs to fire them all or he loses.”\nOne thing I’ve learned over the last few years is that lawyers are, for the most part, among the most cowardly people on the planet. They’re only the big tough intimidating courtroom giants they are portrayed as being on television when they are on the offensive and believe they are untouchable because the conflict doesn’t directly concern them. They tend to fold the minute that even the slightest criticism is directed at them personally; I’ve heard genuine panic in the voice of a top lawyer from a very high status firm when she was simply told to “stop lying”. The Legal Legion is most definitely\nnot even close\nto the norm in the legal world.\nBasically, they live in complete terror of the judges all the time, and unless a strategy offers a 100-percent chance of success, they don’t like it. “It may not work so we better not try it” rings absolutely true. They really don’t like genuine conflict and they are not accustomed to it; they remind me of point fighters facing the prospect of going into the full-contact ring for the first time.\nThat being said, there is zero chance that this group, with that lawerly mindset, has anything whatsoever to do with the NSA and military intelligence teams that set the election trap and is reported to “have it all”. So, while I think Byrne’s report is likely real, I don’t think it is as relevant as it sounds, because I think this is the legal plan team, as opposed to the legislative plan team, as opposed to the defend-the-Constitution team. And I doubt President Trump has much confidence in them, because he has a lot more experience with lawyers and knows far more about them than I do.",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-12-21T11:14:21+00:00"
}