{
  "url": "https://voxday.net/2020/12/18/losing-the-advantage-at-sea/",
  "scraped_at": "2025-12-21T22:29:56.918056",
  "title": "Losing the advantage at sea",
  "date_display": "December 18, 2020",
  "date_iso": "2020-12-18T16:00:06+00:00",
  "date_from_url": "2020-12-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The three U.S. maritime services contemplate losing naval supremacy within the next decade in their co-authored strategic report entitled <i><a href=\"https://media.defense.gov/2020/Dec/17/2002553481/-1/-1/0/TRISERVICESTRATEGY.PDF/TRISERVICESTRATEGY.PDF\" rel=\"noopener\" target=\"_blank\">Advantage at Sea</a></i>:</p><blockquote><p>New and converging technologies will have profound impacts on the security environment. Artificial intelligence, autonomy, additive manufacturing, quantum computing, and new communications and energy technologies could each, individually, generate enormous disruptive change. In combination, the effects of these technologies, and others, will be multiplicative and unpredictable. Militaries that effectively integrate them will undoubtedly gain significant warfighting advantages. </p><p>The United States and its allies will be challenged to build the necessary capability and capacity required to address these many threats. Increasingly sophisticated weapon systems and a shrinking defense industrial base will raise the price and extend the timelines for developing and procuring new weapons and platforms. Continuous budget pressures, including the economic impact of COVID-19, may constrain resources available for defense.</p><p>PROBLEM STATEMENT</p><p>China’s and Russia’s revisionist approaches in the maritime environment threaten U.S. interests, undermine alliances and partnerships, and degrade the free and open international order. Moreover, China’s and Russia’s aggressive naval growth and modernization are eroding U.S. military advantages. <b>Unchecked, these trends will leave the Naval Service unprepared to ensure our advantage at sea and protect national interests within the next decade.</b></p><p>IMPLICATIONS FOR THE NAVAL SERVICE</p><p><b>Alliances and partnerships remain our key strategic advantage. </b>Our allies, partners, and alliances such as NATO are an enduring asymmetric advantage over our rivals. They uphold international norms, generate naval power, and provide access to valuable strategic maritime positions. We must strengthen and expand our network of relationships to ensure our success in competition, crisis, and conflict.</p><p><b>Activities short of war can achieve strategic-level effects. </b>The maritime domain is particularly vulnerable to malign behavior below the threshold of war and incremental gains from malign activities can accumulate into long-term advantages. Rivals are exploiting new avenues to advance their interests, including weaponizing social media, infiltrating global supply chains, and using space and cyber as warfighting domains. We must compete in these spaces.</p><p><b>Prevailing in competition is more than a conceptual challenge.</b> Countering malign behaviors short of armed conflict requires sufficient naval capacity and integration to maintain forward presence, as well as targeted capabilities that expand our response options. To sustain deterrence and prevent competition from escalating into conflict, we must maintain our critical military advantages.</p><p><b>Operating forward deters coercive behavior and conventional aggression.</b> We cannot build trust and interoperability with our maritime allies and partners from a distance. </p><p><b>Nor can we contest malign activities without being present. </b>Our force generation models must ensure we have sufficient combat-credible naval forces available to deter aggression, preempt a fait accompli, and win in conflict, all backed up by rapid surge capability and capacity.</p><p><b>Contested seas require a renewed emphasis on sea control.</b> Denying our adversaries’ use of the seas thwarts their direct wartime objectives and disrupts their efforts to threaten our allies and the American homeland from the maritime domain. We must increase our emphasis on controlling the seas in conflict to provide joint and allied forces with the freedom of maneuver to attack adversary forces and impose costs globally.</p><p><b>Maintaining advantage at sea requires modernization. </b>In persistently surveilled, contested environments, agile naval forces offer dynamic and flexible options from which to project combat power. We must maintain our advantage at sea with new platforms, new thinking, and new technologies that enhance distributed naval operations, and develop our people and culture to meet the challenges of a complex security environment.</p></blockquote><p>Granted, the military services customarily exaggerate the dangers posed by potential threats in order to justify ever-increasing budgets. But it’s apparent that the threats being posed to U.S. naval supremacy by the new Russian and Chinese technologies are real, and it is particularly interesting to see the awareness of the unrestricted 5GW reflected in the document, and to see it highlighted so prominently in the Problem Statment: “Activities short of war can achieve strategic-level effects.”</p></div>",
  "content_text": "The three U.S. maritime services contemplate losing naval supremacy within the next decade in their co-authored strategic report entitled\nAdvantage at Sea\n:\nNew and converging technologies will have profound impacts on the security environment. Artificial intelligence, autonomy, additive manufacturing, quantum computing, and new communications and energy technologies could each, individually, generate enormous disruptive change. In combination, the effects of these technologies, and others, will be multiplicative and unpredictable. Militaries that effectively integrate them will undoubtedly gain significant warfighting advantages.\nThe United States and its allies will be challenged to build the necessary capability and capacity required to address these many threats. Increasingly sophisticated weapon systems and a shrinking defense industrial base will raise the price and extend the timelines for developing and procuring new weapons and platforms. Continuous budget pressures, including the economic impact of COVID-19, may constrain resources available for defense.\nPROBLEM STATEMENT\nChina’s and Russia’s revisionist approaches in the maritime environment threaten U.S. interests, undermine alliances and partnerships, and degrade the free and open international order. Moreover, China’s and Russia’s aggressive naval growth and modernization are eroding U.S. military advantages.\nUnchecked, these trends will leave the Naval Service unprepared to ensure our advantage at sea and protect national interests within the next decade.\nIMPLICATIONS FOR THE NAVAL SERVICE\nAlliances and partnerships remain our key strategic advantage.\nOur allies, partners, and alliances such as NATO are an enduring asymmetric advantage over our rivals. They uphold international norms, generate naval power, and provide access to valuable strategic maritime positions. We must strengthen and expand our network of relationships to ensure our success in competition, crisis, and conflict.\nActivities short of war can achieve strategic-level effects.\nThe maritime domain is particularly vulnerable to malign behavior below the threshold of war and incremental gains from malign activities can accumulate into long-term advantages. Rivals are exploiting new avenues to advance their interests, including weaponizing social media, infiltrating global supply chains, and using space and cyber as warfighting domains. We must compete in these spaces.\nPrevailing in competition is more than a conceptual challenge.\nCountering malign behaviors short of armed conflict requires sufficient naval capacity and integration to maintain forward presence, as well as targeted capabilities that expand our response options. To sustain deterrence and prevent competition from escalating into conflict, we must maintain our critical military advantages.\nOperating forward deters coercive behavior and conventional aggression.\nWe cannot build trust and interoperability with our maritime allies and partners from a distance.\nNor can we contest malign activities without being present.\nOur force generation models must ensure we have sufficient combat-credible naval forces available to deter aggression, preempt a fait accompli, and win in conflict, all backed up by rapid surge capability and capacity.\nContested seas require a renewed emphasis on sea control.\nDenying our adversaries’ use of the seas thwarts their direct wartime objectives and disrupts their efforts to threaten our allies and the American homeland from the maritime domain. We must increase our emphasis on controlling the seas in conflict to provide joint and allied forces with the freedom of maneuver to attack adversary forces and impose costs globally.\nMaintaining advantage at sea requires modernization.\nIn persistently surveilled, contested environments, agile naval forces offer dynamic and flexible options from which to project combat power. We must maintain our advantage at sea with new platforms, new thinking, and new technologies that enhance distributed naval operations, and develop our people and culture to meet the challenges of a complex security environment.\nGranted, the military services customarily exaggerate the dangers posed by potential threats in order to justify ever-increasing budgets. But it’s apparent that the threats being posed to U.S. naval supremacy by the new Russian and Chinese technologies are real, and it is particularly interesting to see the awareness of the unrestricted 5GW reflected in the document, and to see it highlighted so prominently in the Problem Statment: “Activities short of war can achieve strategic-level effects.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2020-12-18T16:00:06+00:00"
}