{
  "url": "https://voxday.net/2020/12/11/michigans-defense-at-scotus-2/",
  "scraped_at": "2025-12-21T22:28:45.214472",
  "title": "Michigan’s defense at SCOTUS",
  "date_display": "December 11, 2020",
  "date_iso": "2020-12-11T13:00:00+00:00",
  "date_from_url": "2020-12-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.michigan.gov/documents/ag/Texas_v._Michigan_--_Response_to_Bill_of_Complaint_Filed_710292_7.pdf\" rel=\"noopener\" target=\"_blank\">The Michigan response</a> to the Texas lawsuit is less histrionic and more superficially substantive than the Pennsylvania response, but it relies upon the same deceptive logic that depends heavily upon the previous judicial shenanigans of the lower courts. The Attorneys General are trying to use the decisions of the various lower courts to refuse to look at the evidence of various violations of their own state laws as an excuse to claim that the Supreme Court has no need to look at the evidence of those violations because the lower courts already did. Which, of course, they didn’t.</p><p>Essentially, the four states are relying upon the idea that even though their actions appear to violate the written laws, because their state courts said those actions were okay, the law was not violated. It’s a variant of the case law citations that one sees in court and arbitration, and is heavily reliant upon procedure rather than substance.</p><blockquote><p>The Constitution has entrusted the states to determine their electors in a presidential election. Consistent with Michigan law, the State of Michigan has certified its presidential vote and the election in Michigan is over. The challenge here is an unprecedented one, without factual foundation or a valid legal basis. </p><p>This Court should summarily dismiss the motion to file the bill of complaint. To do otherwise would make this Court the arbiter of all future national elections. </p><p>The base of Texas’s claims rests on an assertion that Michigan has violated its own election laws. Not true. That claim has been rejected in the federal and state courts in Michigan, and just yesterday the Michigan Supreme Court rejected a last-ditch effort to request an audit. Not only is the complaint meritless here, but its jurisdictional flaws abound and provide solid ground to dispose of this action. </p><p>To begin, Texas has not alleged a sufficient case or controversy to support its standing to invoke this Court’s original jurisdiction. But even if Texas clears that hurdle, the Court’s prudential factors weigh against exercising jurisdiction. Texas does not have a cognizable interest in how Michigan runs its elections, and there plainly are alternative forums to raise these issues. Indeed, the lower courts have already found that similar claims lack legal and factual merit. </p><p>Laches also applies to bar review of Texas’s complaint. Texas delayed weeks and then filed at the last hour, and that delay has prejudiced Michigan. Michigan certified the election results on November 23. The State is entitled to enjoy the benefit of the “safe harbor” provision created by Congress, 3 U.S.C. § 5. </p><p>But even if the Court were to exercise jurisdiction, there is no merit to Texas’s constitutional claims. </p><p>First, Texas lacks standing to bring its Electors Clause claim where its asserted injury is nothing more than a generalized grievance that the Clause was violated. And even if Texas has standing, its substantive claim fails because Michigan officials did not violate any of the election laws cited by Texas in conducting its election. Michigan’s election was administered lawfully; the Electors Clause was not violated. </p><p>Second, Texas’s equal protection claim fails where it does not identify a group that has been given preference or advantage—the hallmark of such a claim. </p><p>And there has been no devaluation of any person’s— or group of persons’—votes above or beneath any others’. There has been no violation of equal protection. </p><p>Third, Texas’s substantive due process claim, assuming that is the claim being brought, fails where the alleged injury—vote dilution—is properly addressed under equal protection, and it fails there. </p><p>Finally, Texas fails to establish any of the requisite factors necessary for granting an injunction. It has no likelihood of success on the merits of its claims, and the remaining factors strongly weigh in favor of denying the extraordinary relief Texas seeks—disenfranchising millions of voters. </p><p>This Court should deny Texas’s motion to file a bill of complaint and its motion for injunctive relief.  </p></blockquote><p>And speaking of Michigan, this recent post on the official state website urging voters <a href=\"https://www.michigan.gov/som/0,4669,7-192-47796-546936--,00.html\" rel=\"noopener\" target=\"_blank\">“to be wary of false claims”</a> indicates that they know they’ve been caught red-handed with the Dominion machines. It’s about as convincing as Hunter Biden urging people to be wary of deepfake videos that show him having sex with his relatives and foreign spies.</p><blockquote><p>On Sunday, individuals with no apparent technical expertise in election technology were permitted to gather images of Dominion voting equipment in Antrim County. While the information they gathered is subject to a court-issued protective order, the Michigan Department of State warns voters to be wary of the claims that the group may make in coming days. Members of the group have previously made false statements, shared fake documents and made baseless claims about the election that have been widely debunked and rejected in multiple courts.</p><p> “It is disappointing, though not surprising, that the primary goal of this group is to continue spreading false information designed to erode the public’s confidence in the election. By doing so, they injure our democracy and dishonor the 5.5. million Michigan citizens who cast ballots,” said Michigan Department of State spokesperson Jake Rollow. “As Attorney General William Barr, the FBI and CISA have found, this was the most secure election in our nation’s history and, despite unprecedented scrutiny, there has been no evidence of widespread fraud identified whatsoever.”</p><p>If any candidate truly thought that the Dominion machines failed to correctly count ballots, they could and should have requested a hand-recount of ballots. No recounts of state elections were requested in Antrim County.</p><p> The Antrim County unofficial reporting error has already been thoroughly explained and did not impact tabulation. It was prompted by the clerk not updating media drives in some of the machines in Antrim County, an accidental human error. Reporting errors are common, and always caught and corrected in the county canvass, if not before, as was the case in Antrim County. More information is available on the MDOS Fact Check webpage, Michigan.gov/SOSFactCheck.</p><p>To further safeguard public confidence, the Bureau of Elections will be working with clerks to conduct an audit of all ballots in Antrim County. While there is no evidence the tabulators malfunctioned in any way, the audit of all ballots cast in the presidential election will confirm all machines counted ballots properly and will disprove the ongoing disinformation campaign attempting to undermine confidence in the election. </p></blockquote><p>They believe that if they just stick to the lies faithfully enough, eventually reality will conform to their deception. </p></div>",
  "content_text": "The Michigan response\nto the Texas lawsuit is less histrionic and more superficially substantive than the Pennsylvania response, but it relies upon the same deceptive logic that depends heavily upon the previous judicial shenanigans of the lower courts. The Attorneys General are trying to use the decisions of the various lower courts to refuse to look at the evidence of various violations of their own state laws as an excuse to claim that the Supreme Court has no need to look at the evidence of those violations because the lower courts already did. Which, of course, they didn’t.\nEssentially, the four states are relying upon the idea that even though their actions appear to violate the written laws, because their state courts said those actions were okay, the law was not violated. It’s a variant of the case law citations that one sees in court and arbitration, and is heavily reliant upon procedure rather than substance.\nThe Constitution has entrusted the states to determine their electors in a presidential election. Consistent with Michigan law, the State of Michigan has certified its presidential vote and the election in Michigan is over. The challenge here is an unprecedented one, without factual foundation or a valid legal basis.\nThis Court should summarily dismiss the motion to file the bill of complaint. To do otherwise would make this Court the arbiter of all future national elections.\nThe base of Texas’s claims rests on an assertion that Michigan has violated its own election laws. Not true. That claim has been rejected in the federal and state courts in Michigan, and just yesterday the Michigan Supreme Court rejected a last-ditch effort to request an audit. Not only is the complaint meritless here, but its jurisdictional flaws abound and provide solid ground to dispose of this action.\nTo begin, Texas has not alleged a sufficient case or controversy to support its standing to invoke this Court’s original jurisdiction. But even if Texas clears that hurdle, the Court’s prudential factors weigh against exercising jurisdiction. Texas does not have a cognizable interest in how Michigan runs its elections, and there plainly are alternative forums to raise these issues. Indeed, the lower courts have already found that similar claims lack legal and factual merit.\nLaches also applies to bar review of Texas’s complaint. Texas delayed weeks and then filed at the last hour, and that delay has prejudiced Michigan. Michigan certified the election results on November 23. The State is entitled to enjoy the benefit of the “safe harbor” provision created by Congress, 3 U.S.C. § 5.\nBut even if the Court were to exercise jurisdiction, there is no merit to Texas’s constitutional claims.\nFirst, Texas lacks standing to bring its Electors Clause claim where its asserted injury is nothing more than a generalized grievance that the Clause was violated. And even if Texas has standing, its substantive claim fails because Michigan officials did not violate any of the election laws cited by Texas in conducting its election. Michigan’s election was administered lawfully; the Electors Clause was not violated.\nSecond, Texas’s equal protection claim fails where it does not identify a group that has been given preference or advantage—the hallmark of such a claim.\nAnd there has been no devaluation of any person’s— or group of persons’—votes above or beneath any others’. There has been no violation of equal protection.\nThird, Texas’s substantive due process claim, assuming that is the claim being brought, fails where the alleged injury—vote dilution—is properly addressed under equal protection, and it fails there.\nFinally, Texas fails to establish any of the requisite factors necessary for granting an injunction. It has no likelihood of success on the merits of its claims, and the remaining factors strongly weigh in favor of denying the extraordinary relief Texas seeks—disenfranchising millions of voters.\nThis Court should deny Texas’s motion to file a bill of complaint and its motion for injunctive relief.\nAnd speaking of Michigan, this recent post on the official state website urging voters\n“to be wary of false claims”\nindicates that they know they’ve been caught red-handed with the Dominion machines. It’s about as convincing as Hunter Biden urging people to be wary of deepfake videos that show him having sex with his relatives and foreign spies.\nOn Sunday, individuals with no apparent technical expertise in election technology were permitted to gather images of Dominion voting equipment in Antrim County. While the information they gathered is subject to a court-issued protective order, the Michigan Department of State warns voters to be wary of the claims that the group may make in coming days. Members of the group have previously made false statements, shared fake documents and made baseless claims about the election that have been widely debunked and rejected in multiple courts.\n“It is disappointing, though not surprising, that the primary goal of this group is to continue spreading false information designed to erode the public’s confidence in the election. By doing so, they injure our democracy and dishonor the 5.5. million Michigan citizens who cast ballots,” said Michigan Department of State spokesperson Jake Rollow. “As Attorney General William Barr, the FBI and CISA have found, this was the most secure election in our nation’s history and, despite unprecedented scrutiny, there has been no evidence of widespread fraud identified whatsoever.”\nIf any candidate truly thought that the Dominion machines failed to correctly count ballots, they could and should have requested a hand-recount of ballots. No recounts of state elections were requested in Antrim County.\nThe Antrim County unofficial reporting error has already been thoroughly explained and did not impact tabulation. It was prompted by the clerk not updating media drives in some of the machines in Antrim County, an accidental human error. Reporting errors are common, and always caught and corrected in the county canvass, if not before, as was the case in Antrim County. More information is available on the MDOS Fact Check webpage, Michigan.gov/SOSFactCheck.\nTo further safeguard public confidence, the Bureau of Elections will be working with clerks to conduct an audit of all ballots in Antrim County. While there is no evidence the tabulators malfunctioned in any way, the audit of all ballots cast in the presidential election will confirm all machines counted ballots properly and will disprove the ongoing disinformation campaign attempting to undermine confidence in the election.\nThey believe that if they just stick to the lies faithfully enough, eventually reality will conform to their deception.",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-12-11T13:00:00+00:00"
}