{
  "url": "https://voxday.net/2020/12/04/nspm-13-invoked/",
  "scraped_at": "2025-12-21T22:27:24.342348",
  "title": "NSPM #13 invoked",
  "date_display": "December 4, 2020",
  "date_iso": "2020-12-04T10:15:58+00:00",
  "date_from_url": "2020-12-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>NC Scout explains some of <a href=\"https://www.americanpartisan.org/2020/12/natural-news-situation-update-dec-3rd-trump-invokes-foreign-interference-provision-of-his-2018-executive-order-authorizing-military-response-to-cyber-warfare-see-nspm-13/\" rel=\"noopener noreferrer\" target=\"_blank\">the strangely specific language utilized</a> by the President in his historic speech on December 2nd on <i>American Partisan</i>:</p><blockquote><p>Ask yourself this question: What was the purpose of yesterday’s White House speech about election fraud and vote rigging?</p><p>If you think it was all about Trump communicating to the people, think again. This speech was really about Trump communicating with Chris Miller and the DoD about foreign interference in the U.S. election while laying out the key national security justifications that are necessary to invoke what I’m calling the “national security option” for defending the United States against an attempted cyber warfare coup….</p><p>About 30 minutes into the speech, he invokes legal language that clearly references Trump’s Sep. 12, 2018 executive order which describes remedies for foreign interference in U.S. elections. Here’s what Trump says:</p><p><i>The only conceivable reason why you would block commonsense measures to verify legal eligibility for voting, is you are <b>trying to encourage, enable, solicit or carry out fraud.</b> It is important for Americans to understand that these destructive changes to our election laws were NOT a necessary response to the pandemic. The pandemic simply gave the Democrats an excuse to do what they were trying to do with many many years.</i></p><p>Note carefully the phrase, “…trying to encourage, enable, solicit or carry out fraud.”</p><p>Where have we heard something very similar before? In the 2018 EO, which describes who will be subjected to having all their assets seized by the United States government — and note that this applies to corporations, individuals, partnerships and even non-profits: (emphasis added)</p><p><i>Sec. 2. a (ii) to have <b>materially assisted, sponsored, or provided financial, material, or technological support for</b>, or goods or services to or in support of, any activity described in subsection (a)(i)</i></p><p><i>Sec. 2. a (i) to have <b>directly or indirectly engaged in, sponsored, concealed, or otherwise been complicit in foreign interference</b> in a United States election;</i></p><p>Thus, Trump just invoked the 2018 EO and sent an undeniable signal to Chris Miller at the DoD (as well as many other groups) that the Democrats, the treasonous media and the complicit Big Tech giants have all engaged in concealing, advocating or supporting “foreign interference” in the U.S. election.</p></blockquote><p>It was also a clear warning to the Supreme Court and the state legislatures. If they don’t do their duty, the President will, and he has firmly established the legal grounds for his doing so. But what may be the most encouraging aspect of the article is the way the author traces the legal establishment of the cyber warfare infrastructure used to observe and record the 2020 election sting back to September 2018.</p><p><i>What we now know with absolute certainty is that <b>Trump, Miller, Cohen-Watnick and other key players put the cyber warfare infrastructure in place in 2018</b> that would allow them to unleash a domestic military response to arrest, detain and prosecute all those who were complicit in the attack on America.</i></p></div>",
  "content_text": "NC Scout explains some of\nthe strangely specific language utilized\nby the President in his historic speech on December 2nd on\nAmerican Partisan\n:\nAsk yourself this question: What was the purpose of yesterday’s White House speech about election fraud and vote rigging?\nIf you think it was all about Trump communicating to the people, think again. This speech was really about Trump communicating with Chris Miller and the DoD about foreign interference in the U.S. election while laying out the key national security justifications that are necessary to invoke what I’m calling the “national security option” for defending the United States against an attempted cyber warfare coup….\nAbout 30 minutes into the speech, he invokes legal language that clearly references Trump’s Sep. 12, 2018 executive order which describes remedies for foreign interference in U.S. elections. Here’s what Trump says:\nThe only conceivable reason why you would block commonsense measures to verify legal eligibility for voting, is you are\ntrying to encourage, enable, solicit or carry out fraud.\nIt is important for Americans to understand that these destructive changes to our election laws were NOT a necessary response to the pandemic. The pandemic simply gave the Democrats an excuse to do what they were trying to do with many many years.\nNote carefully the phrase, “…trying to encourage, enable, solicit or carry out fraud.”\nWhere have we heard something very similar before? In the 2018 EO, which describes who will be subjected to having all their assets seized by the United States government — and note that this applies to corporations, individuals, partnerships and even non-profits: (emphasis added)\nSec. 2. a (ii) to have\nmaterially assisted, sponsored, or provided financial, material, or technological support for\n, or goods or services to or in support of, any activity described in subsection (a)(i)\nSec. 2. a (i) to have\ndirectly or indirectly engaged in, sponsored, concealed, or otherwise been complicit in foreign interference\nin a United States election;\nThus, Trump just invoked the 2018 EO and sent an undeniable signal to Chris Miller at the DoD (as well as many other groups) that the Democrats, the treasonous media and the complicit Big Tech giants have all engaged in concealing, advocating or supporting “foreign interference” in the U.S. election.\nIt was also a clear warning to the Supreme Court and the state legislatures. If they don’t do their duty, the President will, and he has firmly established the legal grounds for his doing so. But what may be the most encouraging aspect of the article is the way the author traces the legal establishment of the cyber warfare infrastructure used to observe and record the 2020 election sting back to September 2018.\nWhat we now know with absolute certainty is that\nTrump, Miller, Cohen-Watnick and other key players put the cyber warfare infrastructure in place in 2018\nthat would allow them to unleash a domestic military response to arrest, detain and prosecute all those who were complicit in the attack on America.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-12-04T10:15:58+00:00"
}