{
  "url": "https://voxday.net/2020/12/06/thats-not-an-accident-2/",
  "scraped_at": "2025-12-21T22:27:48.877258",
  "title": "That’s not an accident",
  "date_display": "December 6, 2020",
  "date_iso": "2020-12-06T15:49:38+00:00",
  "date_from_url": "2020-12-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not even a hacked car, <a href=\"https://twitter.com/trustrestored/status/1335269154992115714\" rel=\"noopener noreferrer\" target=\"_blank\">given the description</a>.</p><p><i></i></p><blockquote><p><i>#HarrisonDeal car exploded (witnesses heard the explosion over a mile away).  Vehicle left as molten metal, engine block ejected 50-60 yards away.  That’s not an accident. That’s a car bomb disguised as an accident.</i></p><p>– Land of the Free</p></blockquote><p>Unlike most people, I have actually crashed a car, set it on fire, and seen the fuel tank explode. </p><p>It wasn’t even a crash per se, it just an unfortunate accident when I went off the road in a road rally in a 1977 MGB during the midst of a serious summer drought. Once the car came to a halt, unharmed, we heard something crackling underneath us and very soon after, smelled smoke. The catalytic converter had set the very dry field alight. A soon as I realized the car was stuck, we promptly bailed and ran toward the nearest farmhouse. </p><p>The fireman arrived too late to do anything about the car, but they did manage to prevent the fire from engulfing the whole field or endangering any homes. When the gas tank exploded, it wasn’t like a bomb blast and it didn’t do anything more than blow the trunk cover up, with a dull <i>crump </i>that sent a brief stream of very black smoke up amidst the regular grey smoke from the fire. It didn’t even blow the cover off entirely, and MGB’s are essentially made out of tin.</p><p>Neither gasoline nor diesel explode in a manner resembling movie effects. They ignite and they burn, to be sure, but they don’t explode. So whatever made the Deal car explode so violently, it wasn’t anything that one would normally find in a civilian automobile or truck.</p><p>However, I doubt the engine block could have been ejected that far and I haven’t seen that in any of the eyewitness accounts. The amount of explosive required to do that would have been unlikely to leave any survivors in the other vehicles, which suggests someone is confusing that detail with details from Michael Hasting’s “accident”.</p><p>Anyhow, this suggests that the President should make his move sooner rather than later, lest the innocent suffer. And from the strategic perspective, a demonstrated inability to protect those around the elected officials who are already afraid to do their duty is not going to convince them to do it.</p><p><a href=\"https://twitter.com/trustrestored/status/1335269154992115714\"></a></p></div>",
  "content_text": "It’s not even a hacked car,\ngiven the description\n.\n#HarrisonDeal car exploded (witnesses heard the explosion over a mile away).  Vehicle left as molten metal, engine block ejected 50-60 yards away.  That’s not an accident. That’s a car bomb disguised as an accident.\n– Land of the Free\nUnlike most people, I have actually crashed a car, set it on fire, and seen the fuel tank explode.\nIt wasn’t even a crash per se, it just an unfortunate accident when I went off the road in a road rally in a 1977 MGB during the midst of a serious summer drought. Once the car came to a halt, unharmed, we heard something crackling underneath us and very soon after, smelled smoke. The catalytic converter had set the very dry field alight. A soon as I realized the car was stuck, we promptly bailed and ran toward the nearest farmhouse.\nThe fireman arrived too late to do anything about the car, but they did manage to prevent the fire from engulfing the whole field or endangering any homes. When the gas tank exploded, it wasn’t like a bomb blast and it didn’t do anything more than blow the trunk cover up, with a dull\ncrump\nthat sent a brief stream of very black smoke up amidst the regular grey smoke from the fire. It didn’t even blow the cover off entirely, and MGB’s are essentially made out of tin.\nNeither gasoline nor diesel explode in a manner resembling movie effects. They ignite and they burn, to be sure, but they don’t explode. So whatever made the Deal car explode so violently, it wasn’t anything that one would normally find in a civilian automobile or truck.\nHowever, I doubt the engine block could have been ejected that far and I haven’t seen that in any of the eyewitness accounts. The amount of explosive required to do that would have been unlikely to leave any survivors in the other vehicles, which suggests someone is confusing that detail with details from Michael Hasting’s “accident”.\nAnyhow, this suggests that the President should make his move sooner rather than later, lest the innocent suffer. And from the strategic perspective, a demonstrated inability to protect those around the elected officials who are already afraid to do their duty is not going to convince them to do it.",
  "tags": [
    "film"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-12-06T15:49:38+00:00"
}