{
  "url": "https://voxday.net/2020/12/23/the-bbcs-war-on-christmas/",
  "scraped_at": "2025-12-21T22:30:42.280011",
  "title": "The BBC’s war on Christmas",
  "date_display": "December 23, 2020",
  "date_iso": "2020-12-23T23:45:51+00:00",
  "date_from_url": "2020-12-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The War on Christmas <a href=\"https://arkhavencomics.com/2020/12/23/fxs-charles-dickens-a-christmas-carol/\" rel=\"noopener\" target=\"_blank\">has gone international</a> and is part of the greater war on the West, if the Dark Herald’s review of <i>A Christmas Carol</i> is any guide.</p><blockquote><p>FX’s version of <i>A Christmas Carol</i> is hideous, hollow and Woke. I can’t do a proper review of it because I didn’t watch it all the way to the end. I threw in the towel when I figured out that Mrs. Cratchit was prostituting herself in Victorian back alleys to buy Tiny Tim medicine. </p><p>My hackles were raised in the opening credits when I saw that harbinger doom, “made in cooperation with the BBC.” I will grant that the BBC used to make some excellent stuff but that nameplate has long since been turned into pelt to be paraded around in by Woketards demanding respect. </p><p>It does follow the outline of Dicken’s novel and a few of the memorable lines are used but the whole of the work is completely corrupted. The Christianity has been completely removed from what was a very Christian story of redemption. Scrooge at the end is sorry that he’s been a jerk but he explicitly states, “I refuse redemption. I refuse to change.”</p></blockquote><p>The Prometheans never, ever, stop trying to take Jesus Christ out of Christmas. It’s one of the easiest ways to clearly identify them. Whether it is <i>White Christmas</i> or <i>Scrooged</i>, the objective is always the same.</p><p><b>UPDATE: </b>A reader questions my reference to <i>White Christmas</i> in this regard, specifically, the lovely song by Irving Berlin.</p><p><i>Wait a sec…. White Christmas? Can someone enlighten me on that?</i></p><p>The second-best novelist to graduate from Bucknell can certainly do so:</p><blockquote><p>I heard myself next praising the greatest Diasporist of all, the father of the new Diasporist movement, Irving Berlin. “People ask where I got the idea. Well, I got it listening to the radio. The radio was playing ‘Easter Parade’ and I thought, But this is Jewish genius on a par with the Ten Commandments. God gave Moses the Ten Commandments and then He gave to Irving Berlin ‘Easter Parade’ and ‘White Christmas.’ The two holidays that celebrate the divinity of Christ—the divinity that’s the very heart of the Jewish rejection of Christianity—and what does Irving Berlin brilliantly do? He de-Christs them both! Easter he turns into a fashion show and Christmas into a holiday about snow. Gone is the gore and the murder of Christ—down with the crucifix and up with the bonnet! <i>He turns their religion into schlock.</i> But nicely! Nicely! So nicely the goyim don’t even know what hit ’em. They love it. <i>Everybody </i>loves it.</p></blockquote><p>It’s a great song. No question. It’s also an early and extraordinarily effective shot in the War on Christmas.</p></div>",
  "content_text": "The War on Christmas\nhas gone international\nand is part of the greater war on the West, if the Dark Herald’s review of\nA Christmas Carol\nis any guide.\nFX’s version of\nA Christmas Carol\nis hideous, hollow and Woke. I can’t do a proper review of it because I didn’t watch it all the way to the end. I threw in the towel when I figured out that Mrs. Cratchit was prostituting herself in Victorian back alleys to buy Tiny Tim medicine.\nMy hackles were raised in the opening credits when I saw that harbinger doom, “made in cooperation with the BBC.” I will grant that the BBC used to make some excellent stuff but that nameplate has long since been turned into pelt to be paraded around in by Woketards demanding respect.\nIt does follow the outline of Dicken’s novel and a few of the memorable lines are used but the whole of the work is completely corrupted. The Christianity has been completely removed from what was a very Christian story of redemption. Scrooge at the end is sorry that he’s been a jerk but he explicitly states, “I refuse redemption. I refuse to change.”\nThe Prometheans never, ever, stop trying to take Jesus Christ out of Christmas. It’s one of the easiest ways to clearly identify them. Whether it is\nWhite Christmas\nor\nScrooged\n, the objective is always the same.\nUPDATE:\nA reader questions my reference to\nWhite Christmas\nin this regard, specifically, the lovely song by Irving Berlin.\nWait a sec…. White Christmas? Can someone enlighten me on that?\nThe second-best novelist to graduate from Bucknell can certainly do so:\nI heard myself next praising the greatest Diasporist of all, the father of the new Diasporist movement, Irving Berlin. “People ask where I got the idea. Well, I got it listening to the radio. The radio was playing ‘Easter Parade’ and I thought, But this is Jewish genius on a par with the Ten Commandments. God gave Moses the Ten Commandments and then He gave to Irving Berlin ‘Easter Parade’ and ‘White Christmas.’ The two holidays that celebrate the divinity of Christ—the divinity that’s the very heart of the Jewish rejection of Christianity—and what does Irving Berlin brilliantly do? He de-Christs them both! Easter he turns into a fashion show and Christmas into a holiday about snow. Gone is the gore and the murder of Christ—down with the crucifix and up with the bonnet!\nHe turns their religion into schlock.\nBut nicely! Nicely! So nicely the goyim don’t even know what hit ’em. They love it.\nEverybody\nloves it.\nIt’s a great song. No question. It’s also an early and extraordinarily effective shot in the War on Christmas.",
  "tags": [
    "Judeochristianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-12-23T23:45:51+00:00"
}