{
  "url": "https://voxday.net/2020/12/05/the-legislatures-have-the-power/",
  "scraped_at": "2025-12-21T22:27:47.021773",
  "title": "The legislatures have the power",
  "date_display": "December 5, 2020",
  "date_iso": "2020-12-05T23:36:53+00:00",
  "date_from_url": "2020-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Literally, the plenary power required to decide, absolutely and unilaterally, <a href=\"https://macris.substack.com/p/can-state-legislatures-appoint-presidential\" rel=\"noopener noreferrer\" target=\"_blank\">which presidential electors are appointed</a>. The Supreme Court doesn’t have it. The voters, legitimate and fraudulent, don’t have it. Only the state legislatures do, no matter what the Fake News and the fraud-defending lawyers try to tell you. From The Tree of Woe, Alexander Macris explains the legal and historical truth of the matter:</p><blockquote><p>What does “plenary power” mean? Plenary power is the most powerful authority that the Constitution grants to any branch of government.</p><p>According to Wikipedia, plenary power is <i>“a complete and absolute power to take action on a particular issue, with no limitations. In U.S. Constitutional law, a plenary power is a power that has been granted to a body or person in absolute terms, with no review of or limitations upon the exercise of that power. The assignment of a plenary power to one body divests all other bodies from the right to exercise that power, where not otherwise entitled. Plenary powers are not subject to judicial review in a particular instance or in general.”</i></p><p>According to Justipedia, <i>“Plenary power is an absolute power that is complete and allows for the holder to make unilateral decisions regarding a certain subject.”</i></p><p>By using the word “plenary,” the <i>McPherson </i>Court is stating that the state legislatures have complete, absolute power over the appointment of electors. Full stop.</p><p>McPherson is an old case, but it has been repeatedly upheld. In <i>Bush v. Palm Beach County Canvassing Board</i>, No. 00-836, Op. at 4 (Dec. 4, 2000), the Court wrote:</p><blockquote><p>In the selection of Presidential electors, the legislature is not acting solely under the authority given it by the people of the State, but by virtue of a direct grant of authority made under Art. II, §1, cl. 2, of the United States Constitution. <i>Bush v. Palm Beach County Canvassing Board</i>, No. 00-836, Op. at 4 (Dec. 4, 2000)</p><p>This direct grant of authority “operates as a limitation upon the State in respect of any attempt to circumscribe the legislative power.” <i>Bush</i>, supra, at 5 (quoting <i>McPherson</i>, 146 U.S. at 25).</p><p>State courts may not invoke even the state constitution to circumscribe this state legislative power. <i>Bush</i>, supra, at 5, 7.</p></blockquote><p>Bush v. Gore (2000) cited <i>McPherson </i>and Chief Justice Rehnquist, in his concurring opinion, expanded further:</p><blockquote><p>There are a few exceptional cases in which the Constitution imposes a duty or confers a power on a particular branch of a State’s government. This is one of them. Article II, § 1, cl. 2, provides that “[e]ach State shall appoint, in such Manner as the Legislature thereof may direct,” electors for President and Vice President…</p><p>In McPherson v. Blacker, 146 U.S. 1 (1892), we explained that Art. II, § 1, cl. 2, “convey[s] the broadest power of determination” and “leaves it to the legislature exclusively to define the method” of appointment. 146 U.S., at 27…</p><p>[I]n a Presidential election the clearly expressed intent of the legislature must prevail…</p></blockquote><p>More recently, in <i>DNC vs. Wisconsin State Legislature</i>, 592 US __ (2020), Justice Kavanaugh wrote a concurring opinion that stated:</p><blockquote><p>Article II expressly provides that the rules for Presidential elections are established by the States “in such Manner as the Legislature thereof may direct.” §1, cl. 2 (emphasis added). The text of Article II means that “the clearly expressed intent of the legislature must prevail” and that a state court may not depart from the state election code enacted by the legislature. Bush v. Gore, 531 U. S. 98, 120 (2000) (Rehnquist, C. J., concurring); see Bush v. Palm Beach County Canvassing Bd., 531 U. S. 70, 76–78 (2000) (per curiam); McPherson v. Blacker, 146 U. S. 1, 25 (1892). In a Presidential election, in other words, a state court’s “significant departure from the legislative scheme for appointing Presidential electors presents a federal constitutional question.” Bush v. Gore, 531 U. S., at 113 (Rehnquist, C. J., concurring). As Chief Justice Rehnquist explained in Bush v. Gore, the important federal judicial role in reviewing state-court decisions about state law in a federal Presidential election “does not imply a disrespect for state courts but rather a respect for the constitutionally prescribed role of state legislatures.”</p></blockquote><p>So, to summarize:</p><ul style=\"text-align: left;\"><li>The US Constitution grants the power to direct the manner by which presidential electors are appointed to the state legislature.</li><li>This grant of power is plenary, e.g. complete and absolute. The state legislature’s clearly expressed intent must always prevail.</li><li>The grant of power is exclusive to the state legislature. The state courts cannot overturn the state legislature on these matters.</li></ul><p>Based on the above, there is no question whatsoever that the state legislature can appoint the presidential electors if it wants to. And, historically, state legislatures have done so dozens of times – in fact, 7{3aedcb51dac2fbb83a885d32b07950f3050377138d02430f831f0a3ede84357a} of all presidential electors in US history have been directly appointed!</p></blockquote><p>Read the whole thing. It is not merely a compelling case, it is a conclusive one. And it makes legal roadkill of the ludicrous Lawrence Tribe in the process, which is nice.</p><p>The state legislatures have the duty and responsibility to take matters into their own hands and address this unprecedented assault on the electoral system and the U.S. Constitution. And they should recall that if they don’t, the President has the moral duty and the Constitutional responsibility to hold them accountable for their failure.</p></div>",
  "content_text": "Literally, the plenary power required to decide, absolutely and unilaterally,\nwhich presidential electors are appointed\n. The Supreme Court doesn’t have it. The voters, legitimate and fraudulent, don’t have it. Only the state legislatures do, no matter what the Fake News and the fraud-defending lawyers try to tell you. From The Tree of Woe, Alexander Macris explains the legal and historical truth of the matter:\nWhat does “plenary power” mean? Plenary power is the most powerful authority that the Constitution grants to any branch of government.\nAccording to Wikipedia, plenary power is\n“a complete and absolute power to take action on a particular issue, with no limitations. In U.S. Constitutional law, a plenary power is a power that has been granted to a body or person in absolute terms, with no review of or limitations upon the exercise of that power. The assignment of a plenary power to one body divests all other bodies from the right to exercise that power, where not otherwise entitled. Plenary powers are not subject to judicial review in a particular instance or in general.”\nAccording to Justipedia,\n“Plenary power is an absolute power that is complete and allows for the holder to make unilateral decisions regarding a certain subject.”\nBy using the word “plenary,” the\nMcPherson\nCourt is stating that the state legislatures have complete, absolute power over the appointment of electors. Full stop.\nMcPherson is an old case, but it has been repeatedly upheld. In\nBush v. Palm Beach County Canvassing Board\n, No. 00-836, Op. at 4 (Dec. 4, 2000), the Court wrote:\nIn the selection of Presidential electors, the legislature is not acting solely under the authority given it by the people of the State, but by virtue of a direct grant of authority made under Art. II, §1, cl. 2, of the United States Constitution.\nBush v. Palm Beach County Canvassing Board\n, No. 00-836, Op. at 4 (Dec. 4, 2000)\nThis direct grant of authority “operates as a limitation upon the State in respect of any attempt to circumscribe the legislative power.”\nBush\n, supra, at 5 (quoting\nMcPherson\n, 146 U.S. at 25).\nState courts may not invoke even the state constitution to circumscribe this state legislative power.\nBush\n, supra, at 5, 7.\nBush v. Gore (2000) cited\nMcPherson\nand Chief Justice Rehnquist, in his concurring opinion, expanded further:\nThere are a few exceptional cases in which the Constitution imposes a duty or confers a power on a particular branch of a State’s government. This is one of them. Article II, § 1, cl. 2, provides that “[e]ach State shall appoint, in such Manner as the Legislature thereof may direct,” electors for President and Vice President…\nIn McPherson v. Blacker, 146 U.S. 1 (1892), we explained that Art. II, § 1, cl. 2, “convey[s] the broadest power of determination” and “leaves it to the legislature exclusively to define the method” of appointment. 146 U.S., at 27…\n[I]n a Presidential election the clearly expressed intent of the legislature must prevail…\nMore recently, in\nDNC vs. Wisconsin State Legislature\n, 592 US __ (2020), Justice Kavanaugh wrote a concurring opinion that stated:\nArticle II expressly provides that the rules for Presidential elections are established by the States “in such Manner as the Legislature thereof may direct.” §1, cl. 2 (emphasis added). The text of Article II means that “the clearly expressed intent of the legislature must prevail” and that a state court may not depart from the state election code enacted by the legislature. Bush v. Gore, 531 U. S. 98, 120 (2000) (Rehnquist, C. J., concurring); see Bush v. Palm Beach County Canvassing Bd., 531 U. S. 70, 76–78 (2000) (per curiam); McPherson v. Blacker, 146 U. S. 1, 25 (1892). In a Presidential election, in other words, a state court’s “significant departure from the legislative scheme for appointing Presidential electors presents a federal constitutional question.” Bush v. Gore, 531 U. S., at 113 (Rehnquist, C. J., concurring). As Chief Justice Rehnquist explained in Bush v. Gore, the important federal judicial role in reviewing state-court decisions about state law in a federal Presidential election “does not imply a disrespect for state courts but rather a respect for the constitutionally prescribed role of state legislatures.”\nSo, to summarize:\nThe US Constitution grants the power to direct the manner by which presidential electors are appointed to the state legislature.\nThis grant of power is plenary, e.g. complete and absolute. The state legislature’s clearly expressed intent must always prevail.\nThe grant of power is exclusive to the state legislature. The state courts cannot overturn the state legislature on these matters.\nBased on the above, there is no question whatsoever that the state legislature can appoint the presidential electors if it wants to. And, historically, state legislatures have done so dozens of times – in fact, 7{3aedcb51dac2fbb83a885d32b07950f3050377138d02430f831f0a3ede84357a} of all presidential electors in US history have been directly appointed!\nRead the whole thing. It is not merely a compelling case, it is a conclusive one. And it makes legal roadkill of the ludicrous Lawrence Tribe in the process, which is nice.\nThe state legislatures have the duty and responsibility to take matters into their own hands and address this unprecedented assault on the electoral system and the U.S. Constitution. And they should recall that if they don’t, the President has the moral duty and the Constitutional responsibility to hold them accountable for their failure.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-12-05T23:36:53+00:00"
}