{
  "url": "https://voxday.net/2020/12/29/the-dead-horse-twitches/",
  "scraped_at": "2025-12-21T22:31:18.512282",
  "title": "The dead horse twitches",
  "date_display": "December 29, 2020",
  "date_iso": "2020-12-29T15:30:06+00:00",
  "date_from_url": "2020-12-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> John Scalzi reports <a href=\"https://whatever.scalzi.com/2020/12/26/whatever-2020-top-posts-and-general-notes/\" rel=\"noopener\" target=\"_blank\">his annual blog readership</a> numbers:</p><blockquote><p>In a more general sense, 2020 has been a pretty decent year for visitorship to Whatever. Indeed, for the first time in several years, the site gained on-site readership, which is an encouraging thing. The site’s high water mark for direct visits was 2012, and since then the on-site readership has declined precipitously, following the general trend for blogs in the social media era, down to about a third of that traffic in 2019. This decline in direct views been compensated for somewhat over the years by readership through RSS, email and WordPress’ own newsfeed feature, and I can drive traffic to the site via Twitter for particular pieces. That said, there’s no arguing that there’s been a downward trend on the site from eight years ago.</p><p>2020 saw the first uptick in on-site visits in years, to about 3 million visits; in fact, 2020 posted better on-site viewership than either 2019 or 2018. Which, again: Encouraging! I don’t want to overstate the bump — on-site traffic is only barely above 2018 levels, and well behind 2017.</p></blockquote><p>Why yes, as is our annual New Year’s custom, we will most certainly beat this dead horse! It’s a tradition anticipated by longtime readers every year. But you’ll have to wait three days for the final numbers to come in. I’ll send a free ebook edition of <i>Corrosion </i>by Johan Kalsi to whoever’s estimate in this post’s comments comes closest to the number of Google pageviews for the blog in 2020.</p><p>For all my undisguised contempt for the mediocrity that is Scalzi, the one thing I will say for him is that more writers should be willing to report their numbers, for good or for ill, the way that he has since he stopped trying to exaggerate his traffic to the media. Doing so helps others put their own efforts and ambitions in context.</p></div>",
  "content_text": "John Scalzi reports\nhis annual blog readership\nnumbers:\nIn a more general sense, 2020 has been a pretty decent year for visitorship to Whatever. Indeed, for the first time in several years, the site gained on-site readership, which is an encouraging thing. The site’s high water mark for direct visits was 2012, and since then the on-site readership has declined precipitously, following the general trend for blogs in the social media era, down to about a third of that traffic in 2019. This decline in direct views been compensated for somewhat over the years by readership through RSS, email and WordPress’ own newsfeed feature, and I can drive traffic to the site via Twitter for particular pieces. That said, there’s no arguing that there’s been a downward trend on the site from eight years ago.\n2020 saw the first uptick in on-site visits in years, to about 3 million visits; in fact, 2020 posted better on-site viewership than either 2019 or 2018. Which, again: Encouraging! I don’t want to overstate the bump — on-site traffic is only barely above 2018 levels, and well behind 2017.\nWhy yes, as is our annual New Year’s custom, we will most certainly beat this dead horse! It’s a tradition anticipated by longtime readers every year. But you’ll have to wait three days for the final numbers to come in. I’ll send a free ebook edition of\nCorrosion\nby Johan Kalsi to whoever’s estimate in this post’s comments comes closest to the number of Google pageviews for the blog in 2020.\nFor all my undisguised contempt for the mediocrity that is Scalzi, the one thing I will say for him is that more writers should be willing to report their numbers, for good or for ill, the way that he has since he stopped trying to exaggerate his traffic to the media. Doing so helps others put their own efforts and ambitions in context.",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-12-29T15:30:06+00:00"
}