{
  "url": "https://voxday.net/2020/12/17/unrestricted-war-in-action/",
  "scraped_at": "2025-12-21T22:29:44.132676",
  "title": "Unrestricted war in action",
  "date_display": "December 17, 2020",
  "date_iso": "2020-12-17T12:07:44+00:00",
  "date_from_url": "2020-12-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t think anyone is slow-rolling the intelligence reports. The problem is more likely that the ongoing hacks are bringing more clarity and providing more context every day. Kevin McCullough <a href=\"https://twitter.com/KMCRadio/status/1339413669575331840\" rel=\"noopener\" target=\"_blank\">reports on Twitter</a>:</p><p><i>BREAKING: It appears that China’s attempt to interfere in the elections of 2020, was so intense that it may take a bit longer to codify and report on. Significant since they are so close to the Biden’s, the left, &amp; Dominion.</i></p><p>Keep in mind this was all laid out by a pair of extraordinary Chinese army strategists, Qiao Lang and Wang Xiangsui, more than 20 years ago. From <i>Unrestricted Warfare</i>:</p><blockquote><p>In a world of unprecedented complexity, the form and the scope of application of means is also in a state of continuous change, and a better means used alone will have no advantage over several means used in combination. Thus, supra-means combinations are becoming extremely necessary…. During a war between two countries, during the fighting and killing by two armies, is it necessary to use special means to wage psychological war aimed at soldiers’ families far back in the rear area? When protecting a country’s financial security, can assassination be used to deal with financial speculators? Can “surgical” strikes be made without a declaration of war against areas which are sources of drugs or other smuggled goods? <b>Can special funds be set up to exert greater influence on another country’s government and legislature through lobbying? And could buying or gaining control of stocks be used to turn another country’s newspapers and television stations into the tools of media warfare?</b></p><p>Apart from the justifiability of the use of the means, that is, whether or not they conform to generally recognized rules of morality, another point in common among the above questions is that they all touch on the use of means in a supra-national, supra-domain way. They are also issues in what we are talking about when we say “supra-means combinations.”</p></blockquote><p>President Trump is not exaggerating when he says the election fraud is a national security issue. The current situation goes well beyond a Constitutional or election crisis.</p></div>",
  "content_text": "I don’t think anyone is slow-rolling the intelligence reports. The problem is more likely that the ongoing hacks are bringing more clarity and providing more context every day. Kevin McCullough\nreports on Twitter\n:\nBREAKING: It appears that China’s attempt to interfere in the elections of 2020, was so intense that it may take a bit longer to codify and report on. Significant since they are so close to the Biden’s, the left, & Dominion.\nKeep in mind this was all laid out by a pair of extraordinary Chinese army strategists, Qiao Lang and Wang Xiangsui, more than 20 years ago. From\nUnrestricted Warfare\n:\nIn a world of unprecedented complexity, the form and the scope of application of means is also in a state of continuous change, and a better means used alone will have no advantage over several means used in combination. Thus, supra-means combinations are becoming extremely necessary…. During a war between two countries, during the fighting and killing by two armies, is it necessary to use special means to wage psychological war aimed at soldiers’ families far back in the rear area? When protecting a country’s financial security, can assassination be used to deal with financial speculators? Can “surgical” strikes be made without a declaration of war against areas which are sources of drugs or other smuggled goods?\nCan special funds be set up to exert greater influence on another country’s government and legislature through lobbying? And could buying or gaining control of stocks be used to turn another country’s newspapers and television stations into the tools of media warfare?\nApart from the justifiability of the use of the means, that is, whether or not they conform to generally recognized rules of morality, another point in common among the above questions is that they all touch on the use of means in a supra-national, supra-domain way. They are also issues in what we are talking about when we say “supra-means combinations.”\nPresident Trump is not exaggerating when he says the election fraud is a national security issue. The current situation goes well beyond a Constitutional or election crisis.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-12-17T12:07:44+00:00"
}