{
  "url": "https://voxday.net/2010/10/31/90-democra/",
  "scraped_at": "2026-01-08T23:41:26.341679",
  "title": "90% Democrat",
  "date_display": "October 31, 2010",
  "date_iso": "2010-10-31T12:05:00+00:00",
  "date_from_url": "2010-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That’s what Nate Silver says about the odds for Senate on October 29th.  I suggested it would go Republican back on July 14th.  Regardless, we’ll see what happens soon enough.</p><blockquote><p>Senate: Republican chances of taking over the Senate are up a tick to 11 percent Saturday from 10 percent Friday.</p></blockquote><p>Needless to say, with regards to the most important issues facing the nation, it doesn’t matter which of the ruling party’s two factions holds the legislative branch.  Republicans are even more loyal to the banks than the bought-and-paid-for Democrats thanks to their ideological confusion of corporatism for capitalism.  But speaking of my far-fetched predictions, here’s another <a href=\"http://politicalwire.com/archives/2010/10/30/half_of_democrats_think_obama_should_face_primary.html\">very interesting poll</a>.</p><p><i>“Half of Democrats Think Obama Should Face Primary.  An AP-Knowledge Networks poll finds that 47% of Democrats think Presidential Obama should be challenged for the 2012 Democratic presidential nomination”</i></p></div>",
  "content_text": "That’s what Nate Silver says about the odds for Senate on October 29th.  I suggested it would go Republican back on July 14th.  Regardless, we’ll see what happens soon enough.\nSenate: Republican chances of taking over the Senate are up a tick to 11 percent Saturday from 10 percent Friday.\nNeedless to say, with regards to the most important issues facing the nation, it doesn’t matter which of the ruling party’s two factions holds the legislative branch.  Republicans are even more loyal to the banks than the bought-and-paid-for Democrats thanks to their ideological confusion of corporatism for capitalism.  But speaking of my far-fetched predictions, here’s another\nvery interesting poll\n.\n“Half of Democrats Think Obama Should Face Primary.  An AP-Knowledge Networks poll finds that 47% of Democrats think Presidential Obama should be challenged for the 2012 Democratic presidential nomination”",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-31T12:05:00+00:00"
}