{
  "url": "https://voxday.net/2010/10/13/bankrupting-big-banks/",
  "scraped_at": "2026-01-08T23:39:44.911562",
  "title": "Bankrupting the big banks",
  "date_display": "October 13, 2010",
  "date_iso": "2010-10-13T02:30:00+00:00",
  "date_from_url": "2010-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Great Foreclosure Fraud is not about clerical errors or defaulting homeowners. <i><a href=\"http://www.msnbc.msn.com/id/21134540/vp/39582228#39582228\">It never was</a></i>.  It’s about the way in which the U.S. banks selling mortgage-backed securities fraudulently ripped off the pension funds the taxpayer-owned GSEs, and the foreign banks.</p><blockquote><p>In addition to Fannie and Freddie, there are millions… billions… trillions of dollars in mortgage-backed securities out there that are now very much in doubt.  And the pension funds have been pushing for some time now for information about the securitizers, the big banks who bought the mortgages and put them in pools and sold the MBS, whether they should have to buy back the mortages for not meeting the contractual requirements.  Those may have varied from contract to contract, but I guarantee that every one of them required that there be proper paperwork and a right to foreclose if the debts aren’t paid.  If those banks have to buy back all that stuff, it’s a big liability….</p><p>There’s a pretty good chance that if they had to buy back a lot of those mortgages because they did not meet the contractual representations and warranties as it’s called, the mortgages were not what they were required to be and in almost every contract if they weren’t what they were required to be the back was required to buy them back, that’s probably more than they can buy back.  We may be back where we were two years ago.  There was an article in the Washington Post yesterday morning where someone said this is going to be so bad for the banks we might have to have another TARP.  That ain’t gonna happen, not in this lifetime…. we certainly aren’t going to give the banks, or lend the banks, more money to get them back to solvency.<br> – Congressman Brad Miller (D-NC)</br></p></blockquote><p>The reason the giant banks are desperately trying to avoid turning over the mortgage-backed security documents and resisting subpoenas is because they will be forced into bankruptcy as soon as any of the investors get their hands on them.</p><p>UPDATE: Citi delineates the three possible outcomes:</p><blockquote><p>Levitin articulated three possible outcomes to the aforementioned issues and assigned an equal likelihood to each. In his best case scenario, these issues are deemed merely technical in nature and are successfully resolved but it takes at least year to do so and all foreclosures are delayed by at least a year. Levitin disputed the claim by banks that these issues can be resolved in a month or so and attributed the banks’ claims to “legal posturing.” In the medium case scenario, litigation ensues and it takes years to sort out these matters. In the worst case scenario, the aforementioned issues become a “systemic problem” which causes the mortgage market to grind to a halt as title insurers refuse to insure mortgages involving existing homes.</p></blockquote><p>He left out the fact that in the medium scenario, all of the MBS-selling banks go bankrupt.  Which is to say, the big four with their $7 trillion in assets, (45% of which I have estimated are worthless), at the very least.</p></div>",
  "content_text": "The Great Foreclosure Fraud is not about clerical errors or defaulting homeowners.\nIt never was\n.  It’s about the way in which the U.S. banks selling mortgage-backed securities fraudulently ripped off the pension funds the taxpayer-owned GSEs, and the foreign banks.\nIn addition to Fannie and Freddie, there are millions… billions… trillions of dollars in mortgage-backed securities out there that are now very much in doubt.  And the pension funds have been pushing for some time now for information about the securitizers, the big banks who bought the mortgages and put them in pools and sold the MBS, whether they should have to buy back the mortages for not meeting the contractual requirements.  Those may have varied from contract to contract, but I guarantee that every one of them required that there be proper paperwork and a right to foreclose if the debts aren’t paid.  If those banks have to buy back all that stuff, it’s a big liability….\nThere’s a pretty good chance that if they had to buy back a lot of those mortgages because they did not meet the contractual representations and warranties as it’s called, the mortgages were not what they were required to be and in almost every contract if they weren’t what they were required to be the back was required to buy them back, that’s probably more than they can buy back.  We may be back where we were two years ago.  There was an article in the Washington Post yesterday morning where someone said this is going to be so bad for the banks we might have to have another TARP.  That ain’t gonna happen, not in this lifetime…. we certainly aren’t going to give the banks, or lend the banks, more money to get them back to solvency.\n– Congressman Brad Miller (D-NC)\nThe reason the giant banks are desperately trying to avoid turning over the mortgage-backed security documents and resisting subpoenas is because they will be forced into bankruptcy as soon as any of the investors get their hands on them.\nUPDATE: Citi delineates the three possible outcomes:\nLevitin articulated three possible outcomes to the aforementioned issues and assigned an equal likelihood to each. In his best case scenario, these issues are deemed merely technical in nature and are successfully resolved but it takes at least year to do so and all foreclosures are delayed by at least a year. Levitin disputed the claim by banks that these issues can be resolved in a month or so and attributed the banks’ claims to “legal posturing.” In the medium case scenario, litigation ensues and it takes years to sort out these matters. In the worst case scenario, the aforementioned issues become a “systemic problem” which causes the mortgage market to grind to a halt as title insurers refuse to insure mortgages involving existing homes.\nHe left out the fact that in the medium scenario, all of the MBS-selling banks go bankrupt.  Which is to say, the big four with their $7 trillion in assets, (45% of which I have estimated are worthless), at the very least.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-13T01:30:00+00:00"
}