{
  "url": "https://voxday.net/2010/10/25/beating-down-doubters/",
  "scraped_at": "2026-01-08T23:40:55.009059",
  "title": "Beating down the doubters",
  "date_display": "October 25, 2010",
  "date_iso": "2010-10-25T17:15:00+00:00",
  "date_from_url": "2010-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bill Black explains how <a href=\"http://www.huffingtonpost.com/william-k-black/post_1115_b_772820.html\">the mortgage fraud was actually worse</a> than I’d previously described.  While I have explained how the foreclosure fraud was the inevitable consequence of the mortgage transfer fraud, there is growing evidence that the banks knew that 100 percent of certain loan categories would default <i>at the time they were making those loans</i> and yet still utilized them as backing for the securities they were selling:</p><blockquote><p>Our call for closing down control frauds and stopping the foreclosure frauds typically meets with three objections. First, it is claimed that while there were some bad apple lenders, much of the fraud was committed by borrowers. Our proposal would let fraudulent borrowers remain in homes to which they are not entitled, punishing the banks that were duped. Second, the biggest banks are too important to foreclose. And third, it is not possible to resolve a “too big to fail” institution.</p><p>Let us deal with the “borrower fraud” argument first because it is the area containing the most erroneous assumptions. There was fraud at every step in the home finance food chain: the appraisers were paid to overvalue real estate; mortgage brokers were paid to induce borrowers to accept loan terms they could not possibly afford; loan applications overstated the borrowers’ incomes; speculators lied when they claimed that six different homes were their principal dwelling; mortgage securitizers made false reps and warranties about the quality of the packaged loans; credit ratings agencies were overpaid to overrate the securities sold on to investors; and investment banks stuffed collateralized debt obligations with toxic securities that were handpicked by hedge fund managers to ensure they would self destruct.</p><p>That homeowners would default on the nonprime mortgages was a foregone conclusion throughout the industry — indeed, it was the desired outcome. This was something the lending side knew, but which few on the borrowing side could have realized.</p></blockquote><p>Notice that <a href=\"http://market-ticker.org/akcs-www?post=170209\">the Federal Reserve has now seen fit to comment</a> upon “reported irregularities in foreclosure practices at a number of large financial institutions” and Helicopter Ben is hewing very closely to the line that contains the most erroneous assumptions.  This is to be expected; both national parties and the Fed are going to do everything they can to point fingers at everyone but the responsible parties as long as they can.  But they’re not going to be able to get away with it for four reasons.</p><p>1) The fraud is too blatant and widespread.<br> 2) The political downside to backing the banks is too severe.  Note that even Obama, who has yet to meet an ex-Goldmanite he doesn’t want in his cabinet, didn’t dare to let HR 3808 pass.<br> 3) They ripped off many powerful institutions, both foreign and domestic.  As events have shown, they can’t buy off every judge, county clerk, pension fund manager, and attorney general in the country.<br> 4) It’s not a matter of merely federal law.  Land title issues are a State matter, not a federal one.  Therefore, the power of the pro-bank politicians and government agencies, which is centralized at the national level, is less effective than usual.</br></br></br></p><p>UPDATE: But, but, it’s all about the <i>deadbeats</i>!  Zerohedge summarizes FDIC head Sheila Bair’s <a href=\"http://www.zerohedge.com/article/bofa-takes-out-lows-sheila-bair-says-servicers-issues-could-be-very-damaging-require-decisiv\">recent comments</a>:</p><p><i>1.  LITIGATION FROM SERVICER ISSUES COULD BE `VERY DAMAGING’<br> 2.  FORECLOSURE PROBLEMS WILL REQUIRE `GLOBAL SOLUTION’<br> 3.  MORE PROBLEMS’ WILL ARISE IN MORTGAGE SERVICING</br></br></i></p><p>Now, why would a <i>global</i> solution be required, he asked innocently?  Why would litigation be very damaging and to whom?  And how can Ms Bair be so certain that more problems will arise?</p></div>",
  "content_text": "Bill Black explains how\nthe mortgage fraud was actually worse\nthan I’d previously described.  While I have explained how the foreclosure fraud was the inevitable consequence of the mortgage transfer fraud, there is growing evidence that the banks knew that 100 percent of certain loan categories would default\nat the time they were making those loans\nand yet still utilized them as backing for the securities they were selling:\nOur call for closing down control frauds and stopping the foreclosure frauds typically meets with three objections. First, it is claimed that while there were some bad apple lenders, much of the fraud was committed by borrowers. Our proposal would let fraudulent borrowers remain in homes to which they are not entitled, punishing the banks that were duped. Second, the biggest banks are too important to foreclose. And third, it is not possible to resolve a “too big to fail” institution.\nLet us deal with the “borrower fraud” argument first because it is the area containing the most erroneous assumptions. There was fraud at every step in the home finance food chain: the appraisers were paid to overvalue real estate; mortgage brokers were paid to induce borrowers to accept loan terms they could not possibly afford; loan applications overstated the borrowers’ incomes; speculators lied when they claimed that six different homes were their principal dwelling; mortgage securitizers made false reps and warranties about the quality of the packaged loans; credit ratings agencies were overpaid to overrate the securities sold on to investors; and investment banks stuffed collateralized debt obligations with toxic securities that were handpicked by hedge fund managers to ensure they would self destruct.\nThat homeowners would default on the nonprime mortgages was a foregone conclusion throughout the industry — indeed, it was the desired outcome. This was something the lending side knew, but which few on the borrowing side could have realized.\nNotice that\nthe Federal Reserve has now seen fit to comment\nupon “reported irregularities in foreclosure practices at a number of large financial institutions” and Helicopter Ben is hewing very closely to the line that contains the most erroneous assumptions.  This is to be expected; both national parties and the Fed are going to do everything they can to point fingers at everyone but the responsible parties as long as they can.  But they’re not going to be able to get away with it for four reasons.\n1) The fraud is too blatant and widespread.\n2) The political downside to backing the banks is too severe.  Note that even Obama, who has yet to meet an ex-Goldmanite he doesn’t want in his cabinet, didn’t dare to let HR 3808 pass.\n3) They ripped off many powerful institutions, both foreign and domestic.  As events have shown, they can’t buy off every judge, county clerk, pension fund manager, and attorney general in the country.\n4) It’s not a matter of merely federal law.  Land title issues are a State matter, not a federal one.  Therefore, the power of the pro-bank politicians and government agencies, which is centralized at the national level, is less effective than usual.\nUPDATE: But, but, it’s all about the\ndeadbeats\n!  Zerohedge summarizes FDIC head Sheila Bair’s\nrecent comments\n:\n1.  LITIGATION FROM SERVICER ISSUES COULD BE `VERY DAMAGING’\n2.  FORECLOSURE PROBLEMS WILL REQUIRE `GLOBAL SOLUTION’\n3.  MORE PROBLEMS’ WILL ARISE IN MORTGAGE SERVICING\nNow, why would a\nglobal\nsolution be required, he asked innocently?  Why would litigation be very damaging and to whom?  And how can Ms Bair be so certain that more problems will arise?",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-25T16:15:00+00:00"
}