{
  "url": "https://voxday.net/2010/10/20/behind-curve/",
  "scraped_at": "2026-01-08T23:40:23.586716",
  "title": "Behind the curve",
  "date_display": "October 20, 2010",
  "date_iso": "2010-10-20T07:14:00+00:00",
  "date_from_url": "2010-10-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There are four economics blogs which I follow on a regular basis, the Market Ticker, Mish, the Mises Institute, and Calculated Risk.  They’re all considerably different, but CR is arguably the most useful in keeping track of the mainstream perspective because he does such a great job of publishing statistical updates and because he subscribes to more conventional economic theory than I do.  So, I was curious as to why CR had been paying so little attention to the Great Mortgage Fraud, especially since he places particular importance on the housing sector as an engine for driving an economy out of recession.  After reading his first post on the matter which indicated an opinion which appeared to <a href=\"http://www.calculatedriskblog.com/2010/10/why-did-mortgage-servicers-use-robo.html\">downplay the issue</a>, I shot him an email suggesting that he might not be quite as up on the burning issue du jour as is his usual wont; he was well ahead of the curve on both the housing bubble and the bank failures.  So, it was with more than my usual interest that I read <a href=\"http://www.calculatedriskblog.com/2010/10/foreclosure-gate-investigations-and.html\">his latest post on the subject</a>:</p><blockquote><p>I fully support these investigations, but I’ve downplayed “foreclosure-gate” because I thought the impact on housing and the economy would be minor – depending of course on the length of the foreclosure delays. Many other people disagree with my view – and please remember I’m not always right.</p><p>It is important to separate out two other issues. The first is MERS (the “Mortgage Electronic Registration System”). There are many interesting issues with MERS – and plenty of litigation – but my feeling is that the defects are curable, and these issues will have little impact on the economy. Since I think the impact will be minor, once again I’ve mostly been ignoring these issues.</p><p>The third issue is repurchase requests based on Reps and Warranties for mortgages. This is an important story for the banks. I’ve been mentioning the increasing push-backs from the GSEs (Fannie and Freddie). That isn’t a new story. The important development today was that several major bond investors are pressuring BofA to repurchase defective mortgages. Although I’ve been following this story, I haven’t mentioned it – and some people think I’ve been “behind the curve”. Could be.</p></blockquote><p>CR is completely correct to note the multiple facets of the situation.  Unlike most of those who have minimized the issue or taken the banking industry’s defense line, he clearly recognizes that the issue is not limited to foreclosures and deadbeat borrowers.  And his reasoning is perfectly sound, for as he adds in a comment: “I know others think the impact will be huge… I think they are wrong, especially about foreclosure-gate and MERS. The push-backs will take time and I expect the losses will be spread over several years, and just doesn’t seem like a “blowup” event.”</p><p>The reason I disagree with CR’s conclusion is three-fold.  First, because his econonomic perspective is essentially a mainstream Samuelsonian one, he doesn’t take the economic impact of the continued decline in bank credit into account even though he is the Internet’s primary chronicler of bank failure and the latest FDIC shenanigans.  (NB: I use CR as the source for updating my own bank failure spreadsheets.)  Not being an Austrian, he is looking at economic indicators that are presently much less dire than credit indicators such as TOTLL and Z1.  The economic environment is already precarious, which reduces the probability of the consequences of the mass bank fraud being contained to the financial sector.</p><p>Second, I don’t think the security push-backs are going to take time and be spread out over several years because the big banks are not only on the verge of bankruptcy, they are already insolvent.  More importantly, all of the counter-parties to whom reimbursement are owed already know this.  Therefore, they are not going to be content to wait and see the matter resolved slowly by federal regulators in the manner preferred by the big banks and their managerial staffs because every victim of the grand securities fraud is going to want to be first in line to get their money back lest they not receive anything at all.</p><p>And third, the amount of criminal wrongdoing here is far too excessive, far too obvious, and far too jurisdictionally widespread to permit it to be ignored under the banking industry’s usual “get out of prosecution free” card.  (There is no other word for it, not when Wachovia got away scot-free after <i>admitting that they laundered billions</i> in <a href=\"http://www.bloomberg.com/news/2010-06-29/banks-financing-mexico-s-drug-cartels-admitted-in-wells-fargo-s-u-s-deal.html\">Mexican drug money</a>.) While there is no question that the federal agencies are not going to aggressively prosecute a series of frauds that they clearly permitted and even abetted, the same is not true of the agencies of the states whose tax coffers and pension funds were ripped off by the voracious banksters.  And the states have more investigators as well as more autonomy than the SEC and other federal agencies.  In short, I suspect the situation is beyond Wall Street-owned Washington’s ability to firewall it.</p><p>But, we will see.  This is a complex matter and intelligent minds can reasonably disagree.  If CR is ultimately correct, I won’t hesitate to congratulate him on his perspicacity.  But I have to admit, I expect to be congratulating the Market Ticker instead.</p></div>",
  "content_text": "There are four economics blogs which I follow on a regular basis, the Market Ticker, Mish, the Mises Institute, and Calculated Risk.  They’re all considerably different, but CR is arguably the most useful in keeping track of the mainstream perspective because he does such a great job of publishing statistical updates and because he subscribes to more conventional economic theory than I do.  So, I was curious as to why CR had been paying so little attention to the Great Mortgage Fraud, especially since he places particular importance on the housing sector as an engine for driving an economy out of recession.  After reading his first post on the matter which indicated an opinion which appeared to\ndownplay the issue\n, I shot him an email suggesting that he might not be quite as up on the burning issue du jour as is his usual wont; he was well ahead of the curve on both the housing bubble and the bank failures.  So, it was with more than my usual interest that I read\nhis latest post on the subject\n:\nI fully support these investigations, but I’ve downplayed “foreclosure-gate” because I thought the impact on housing and the economy would be minor – depending of course on the length of the foreclosure delays. Many other people disagree with my view – and please remember I’m not always right.\nIt is important to separate out two other issues. The first is MERS (the “Mortgage Electronic Registration System”). There are many interesting issues with MERS – and plenty of litigation – but my feeling is that the defects are curable, and these issues will have little impact on the economy. Since I think the impact will be minor, once again I’ve mostly been ignoring these issues.\nThe third issue is repurchase requests based on Reps and Warranties for mortgages. This is an important story for the banks. I’ve been mentioning the increasing push-backs from the GSEs (Fannie and Freddie). That isn’t a new story. The important development today was that several major bond investors are pressuring BofA to repurchase defective mortgages. Although I’ve been following this story, I haven’t mentioned it – and some people think I’ve been “behind the curve”. Could be.\nCR is completely correct to note the multiple facets of the situation.  Unlike most of those who have minimized the issue or taken the banking industry’s defense line, he clearly recognizes that the issue is not limited to foreclosures and deadbeat borrowers.  And his reasoning is perfectly sound, for as he adds in a comment: “I know others think the impact will be huge… I think they are wrong, especially about foreclosure-gate and MERS. The push-backs will take time and I expect the losses will be spread over several years, and just doesn’t seem like a “blowup” event.”\nThe reason I disagree with CR’s conclusion is three-fold.  First, because his econonomic perspective is essentially a mainstream Samuelsonian one, he doesn’t take the economic impact of the continued decline in bank credit into account even though he is the Internet’s primary chronicler of bank failure and the latest FDIC shenanigans.  (NB: I use CR as the source for updating my own bank failure spreadsheets.)  Not being an Austrian, he is looking at economic indicators that are presently much less dire than credit indicators such as TOTLL and Z1.  The economic environment is already precarious, which reduces the probability of the consequences of the mass bank fraud being contained to the financial sector.\nSecond, I don’t think the security push-backs are going to take time and be spread out over several years because the big banks are not only on the verge of bankruptcy, they are already insolvent.  More importantly, all of the counter-parties to whom reimbursement are owed already know this.  Therefore, they are not going to be content to wait and see the matter resolved slowly by federal regulators in the manner preferred by the big banks and their managerial staffs because every victim of the grand securities fraud is going to want to be first in line to get their money back lest they not receive anything at all.\nAnd third, the amount of criminal wrongdoing here is far too excessive, far too obvious, and far too jurisdictionally widespread to permit it to be ignored under the banking industry’s usual “get out of prosecution free” card.  (There is no other word for it, not when Wachovia got away scot-free after\nadmitting that they laundered billions\nin\nMexican drug money\n.) While there is no question that the federal agencies are not going to aggressively prosecute a series of frauds that they clearly permitted and even abetted, the same is not true of the agencies of the states whose tax coffers and pension funds were ripped off by the voracious banksters.  And the states have more investigators as well as more autonomy than the SEC and other federal agencies.  In short, I suspect the situation is beyond Wall Street-owned Washington’s ability to firewall it.\nBut, we will see.  This is a complex matter and intelligent minds can reasonably disagree.  If CR is ultimately correct, I won’t hesitate to congratulate him on his perspicacity.  But I have to admit, I expect to be congratulating the Market Ticker instead.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-20T06:14:00+00:00"
}