{
  "url": "https://voxday.net/2010/10/27/brothel-or-burqah-reality/",
  "scraped_at": "2026-01-08T23:41:07.855421",
  "title": "Brothel or burqah: the reality",
  "date_display": "October 27, 2010",
  "date_iso": "2010-10-27T18:31:00+00:00",
  "date_from_url": "2010-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You can’t say I didn’t warn you about the choice <a href=\"http://www.dailymail.co.uk/femail/article-1324039/Like-Lauren-Booth-ARE-modern-British-career-women-converting-Islam.html\">an increasing number of Western women</a> are presently making:</p><blockquote><p>Tony Blair’s sister-in-law announced her conversion to Islam last weekend. Journalist Lauren Booth embraced the faith after what she describes as a ‘holy experience’ in Iran.  She is just one of a growing number of modern British career women to do so….  According to Kevin Brice from ­Swansea University, who has specialised in studying white conversion to Islam, these women are part of an intriguing trend.  He explains: ‘They seek spirituality, a higher meaning, and tend to be deep thinkers. The other type of women who turn to Islam are what I call “converts of convenience”. They’ll assume the trappings of the religion to please their Muslim husband and his family, but won’t necessarily attend mosque, pray or fast.’…</p><p>For a significant amount of women, their first contact with Islam comes from ­dating a Muslim boyfriend.</p></blockquote><p>Although this may be shocking to the typical half-sapient and maleducated secular mind, numbed as it is from between 12 and 27 years of unmitigated feminist and multicultural propaganda, it was entirely predictable.  And was, in fact, predicted by numerous parties.  The primary reason neither the Greeks nor America’s Founding Fathers permitted women to vote is because they are much more intellectually malleable than men.  Even the most fervent feminist will enthusiastically embrace the submission of Islam if a man is able to inspire her rationalization hamster to spin in that direction.</p><p>Osama bin Laden was correct in stating that Islam is the strong horse in comparison with secular post-Christian America.  Secular post-Christianity is both rootless and pointless; it has neither <i>raison d’etre</i> nor does it provide anyone with objectives beyond the momentary and the material.  While the abstract thinkers of the cognitive elite can come up with higher purposes of their own, (most of which involve placing themselves in control of other people and wind up getting a lot of people killed), such self-serving intellectual ephemeralities are incapable of satisfying the spiritual hunger of the masses.</p><p>In turning away from its historical identity as Christendom, the West has created a vast spiritual void and already the weaker souls are drifting into the pagan madness that Chesterton, Lewis, and other Christian savants predicted in the previous century.  There will never be an atheist society, because human society can no more abide a spiritual vaccuum than nature can abide a material one.</p></div>",
  "content_text": "You can’t say I didn’t warn you about the choice\nan increasing number of Western women\nare presently making:\nTony Blair’s sister-in-law announced her conversion to Islam last weekend. Journalist Lauren Booth embraced the faith after what she describes as a ‘holy experience’ in Iran.  She is just one of a growing number of modern British career women to do so….  According to Kevin Brice from ­Swansea University, who has specialised in studying white conversion to Islam, these women are part of an intriguing trend.  He explains: ‘They seek spirituality, a higher meaning, and tend to be deep thinkers. The other type of women who turn to Islam are what I call “converts of convenience”. They’ll assume the trappings of the religion to please their Muslim husband and his family, but won’t necessarily attend mosque, pray or fast.’…\nFor a significant amount of women, their first contact with Islam comes from ­dating a Muslim boyfriend.\nAlthough this may be shocking to the typical half-sapient and maleducated secular mind, numbed as it is from between 12 and 27 years of unmitigated feminist and multicultural propaganda, it was entirely predictable.  And was, in fact, predicted by numerous parties.  The primary reason neither the Greeks nor America’s Founding Fathers permitted women to vote is because they are much more intellectually malleable than men.  Even the most fervent feminist will enthusiastically embrace the submission of Islam if a man is able to inspire her rationalization hamster to spin in that direction.\nOsama bin Laden was correct in stating that Islam is the strong horse in comparison with secular post-Christian America.  Secular post-Christianity is both rootless and pointless; it has neither\nraison d’etre\nnor does it provide anyone with objectives beyond the momentary and the material.  While the abstract thinkers of the cognitive elite can come up with higher purposes of their own, (most of which involve placing themselves in control of other people and wind up getting a lot of people killed), such self-serving intellectual ephemeralities are incapable of satisfying the spiritual hunger of the masses.\nIn turning away from its historical identity as Christendom, the West has created a vast spiritual void and already the weaker souls are drifting into the pagan madness that Chesterton, Lewis, and other Christian savants predicted in the previous century.  There will never be an atheist society, because human society can no more abide a spiritual vaccuum than nature can abide a material one.",
  "tags": [
    "Christianity",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-27T17:31:00+00:00"
}