{
  "url": "https://voxday.net/2010/10/16/dialogue-with-ilana/",
  "scraped_at": "2026-01-08T23:40:03.240103",
  "title": "A dialogue with Ilana  (UPDATED)",
  "date_display": "October 16, 2010",
  "date_iso": "2010-10-16T18:45:00+00:00",
  "date_from_url": "2010-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which we discuss the Great MBS/Foreclosure Fraud.  Keep in mind that Ilana and I are not only WND colleagues, but like-minded libertarians as well, so please note that this isn’t the least bit personal on either side.  I think <a href=\"http://barelyablog.com/?p=30130\">Ilana’s objections</a> are important and illustrative of the challenge in accepting the existence of an institutional fraud of this magnitude, hence this detailed response.</p><blockquote><p>It must be obvious to readers of this site that I would strongly disagree with the case my colleague Vox Day makes against the strict rule of law and for grand-conspiracy….</p><p>Distilled, the argument for all-out sweetness and love for the foreclosed upon is that, because the banks are embroiled in the fractional reserve system, they should suffer the worst of fates.</p><p>That’s like saying that because the legal system is generally corrupt, murderers should go free; or because an owner who sells a parcel of land partakes in the property tax theft, the buyer should not have to pay him. Or because businesses often act like exuberant idiots during a phase of the business cycle—some as offenders; others as victims—their customers need not pay them. And on and on.</p><p>This is chaos theory; create chaos, and out of it, something good may come. And never mind that not all bankers are crooks; that not all of them understand the theoretical aspects of the system in which they are embroiled; and that not nearly enough bad things are said about the defaulters.</p><p>As to Vox’s point, it does not follow from “the mere fact of their focus on the borrowing parties rather than the banks,” that this “is proof that they are intentionally evading the real issue.”</p><p>Not in logic, at least.</p><p>Finally, the laws of economics are natural laws. Whoever is involved, it is categorically good that responsible buyers get to pick up foreclosed properties, and that the mortgage miasma is cleared and cleansed away.</p></blockquote><p>To be honest, I completely missed her statement about my supposed opposition to “the strict rule of law”, otherwise I would have addressed that in my following email by pointing out that the “strict rule of law” completely forbade everything that the mortgage banks did in ignoring the land title system in favor of pushing 65 million mortgage transfers through MERS in only six years instead.  But here was my actual response to her:</p><p><i>With all due respect, it is clear you don’t understand the issues at stake in the “foreclosure fraud” issue.  You’re missing the relevant point because you’re only looking at the second wave of the frauds, rather than the first.  The greater portion of the fraud occurred long before the very first defaulting homeowner was late on his first payment.  There is absolutely no question – none – that the banks are <br> guilty of massive amounts of criminal and tax fraud prior to their subsequent commitment of the foreclosure-related frauds.</br></i></p><p>What happened was that the banks wanted to create mortgage-backed securities, but selling the securities legally required transferring the notes and titles as per the land title system.  But that would have cost a lot in filing fees and all but eliminated their profits, so they simply ignored the law, created an electronic registry called MERS, and thereby ripped off large financial investors by selling worthless paper.  The foreclosure-based fraud about which you have such doubts is merely the cover-up that resulted from the way in which a need to foreclose exposed the initial fraud.</p><p>I haven’t gotten permission from Ilana yet to post her email verbatim, but I will summarize it as follows, (and either replace the summary or correct it depending upon her preference.)</p><blockquote><p>“We have a 3-stage process, not a 2-stage process. Bankers, most of whom really don’t know squat about Austrian theory, were compelled by law to grant rotten loans to the protected species of the politicians. They invented a product to do that.</p><p>Sounds quite creative; sounds like the unintended consequences of politics.</p><p>I began reading <a href=\"http://dailycaller.com/2010/10/14/thedc-op-ed-one-nation-under-fraud/\">the column you recommended</a>.  It begins with a one-case study as its proof. This is statistically worse than insignificant. It graduates to assertion. Then adds another one-case study.   You may be right, but the data in the column you provided does not prove your case.</p><p>Understand: I am not a partisan here; I’m not pro-banker. So far, I just don’t see good evidence for your case.”</p></blockquote><p>This was my response:</p><p><i>I’m afraid you’re still a little too under the influence of the banking industry’s defense theory. You are repeating some of their talking points and focusing on some irrelevant side issues instead of the salient matters. What is irrelevant about the “one-case study” and the anecdotes being “statistically worse than insignificant” is that they are merely illustrative examples of an easily provable fact that applies to more than 60 million mortgages. It is quite clear that you do not know what the local land title laws are, (and being a Canadian by way of South Africa, I certainly wouldn’t expect you to; I’ve been in Europe for a decade and I have absolutely no idea what the local property laws are), so your attempt to use general principles to try theorizing around that gap in your knowledge is doomed to failure.</i></p><p>It’s not even possible for you to suggest that “the unintended consequences of politics” compelled the bankers to provide the loans to the favored classes because a) most of the relevant land title laws involved are older than the United States; they derive from the English common law, b) the MBS-selling preceded most of the laws that “compelled” them, and b) the number of loans that were fraudulently transferred far exceed the number of mortages sold that required any compelling. To quote Wikipedia: “What the case law is consistently holding is that MERS cannot do what it has purported to do (and has done in what appears to be over sixty (60) million mortgage transactions nationally).” The lawyers for MERS have even admitted this in court! “During the course of the hearing, the Court repeatedly raised the “MERS as nominee” issues to counsel for the Defendants, [MERS and OneWestBank] with said counsel finally admitting, upon repeated inquiry by the Court, that MERS cannot transfer promissory notes.”</p><p>So, this isn’t a case of bad politicians causing bad behavior by the banks. In fact, the bad politicians, the bad bureaucrats, and some of the bad state and federal courts have been repeatedly attempting to cover for the bad behavior by the banks. The banks are absolutely not on the side of freedom and capitalism here; they are deeply and actively involved in the corrupt politics themselves. Natural law also points to the guilt of the banks; they forgave the mortgage debt through their actions, then attempted to retroactively claim they had not forgiven it.</p><p>On a related, note, Jim Sinclair shares <a href=\"http://jsmineset.com/2010/10/11/securitized-mortgage-debt-the-shot-that-will-kill-many-financial-entities/\">some interesting information</a>.</p><blockquote><p>I had dinner with my former partner, then lead director of and CEO of Bear Stearns. I could not contain myself so I asked him why he did so much business in OTC derivatives which were certain to bankrupt them. The answer I got was it was more than 50% of their profit. The right answer should have been it was more than 80% of their earnings.</p></blockquote><p>UPDATE I: Ilana wrote back to note that she intends to further contemplate the matter.  She added:</p><blockquote><p>“You know very well that my problem with your argument, Vox, is that it teeters on grand conspiracy. One of your readers in the comments section picked this up quite well.  The state and its cronies preside over the disintegration of civil society, but they do so reflexively, rather than as a matter of collusion and conspiracy.”</p></blockquote><p>Perhaps it does teeter on grand conspiracy.  But as I have pointed out in the past, calling something conspiracy doesn’t make it go away and the undeniable fact is that 65 million mortgages were transferred through MERS since 2004. Furthermore, it is highly probable that many of them, and perhaps even all 65 million, were transferred illegally according to laws that predate the Carter administration by decades, if not centuries.  My skepticism is well known to readers and critics alike and it NEVER occurred to me that the mortgage fraud could possibly run this deep and this wide.  I was sure that the reason the banks were mysteriously reluctant to foreclose upon properties in default was because doing so would expose their accounting irregularities with regards to the book value of the defaulting properties.  It almost defies imagination that any bank would ever knowingly destroy the paper trail that is the only security for its interest in the loans it has made.  And yet, we now know that many of them, including all the big, bailed-out banks, did.</p></div>",
  "content_text": "In which we discuss the Great MBS/Foreclosure Fraud.  Keep in mind that Ilana and I are not only WND colleagues, but like-minded libertarians as well, so please note that this isn’t the least bit personal on either side.  I think\nIlana’s objections\nare important and illustrative of the challenge in accepting the existence of an institutional fraud of this magnitude, hence this detailed response.\nIt must be obvious to readers of this site that I would strongly disagree with the case my colleague Vox Day makes against the strict rule of law and for grand-conspiracy….\nDistilled, the argument for all-out sweetness and love for the foreclosed upon is that, because the banks are embroiled in the fractional reserve system, they should suffer the worst of fates.\nThat’s like saying that because the legal system is generally corrupt, murderers should go free; or because an owner who sells a parcel of land partakes in the property tax theft, the buyer should not have to pay him. Or because businesses often act like exuberant idiots during a phase of the business cycle—some as offenders; others as victims—their customers need not pay them. And on and on.\nThis is chaos theory; create chaos, and out of it, something good may come. And never mind that not all bankers are crooks; that not all of them understand the theoretical aspects of the system in which they are embroiled; and that not nearly enough bad things are said about the defaulters.\nAs to Vox’s point, it does not follow from “the mere fact of their focus on the borrowing parties rather than the banks,” that this “is proof that they are intentionally evading the real issue.”\nNot in logic, at least.\nFinally, the laws of economics are natural laws. Whoever is involved, it is categorically good that responsible buyers get to pick up foreclosed properties, and that the mortgage miasma is cleared and cleansed away.\nTo be honest, I completely missed her statement about my supposed opposition to “the strict rule of law”, otherwise I would have addressed that in my following email by pointing out that the “strict rule of law” completely forbade everything that the mortgage banks did in ignoring the land title system in favor of pushing 65 million mortgage transfers through MERS in only six years instead.  But here was my actual response to her:\nWith all due respect, it is clear you don’t understand the issues at stake in the “foreclosure fraud” issue.  You’re missing the relevant point because you’re only looking at the second wave of the frauds, rather than the first.  The greater portion of the fraud occurred long before the very first defaulting homeowner was late on his first payment.  There is absolutely no question – none – that the banks are\nguilty of massive amounts of criminal and tax fraud prior to their subsequent commitment of the foreclosure-related frauds.\nWhat happened was that the banks wanted to create mortgage-backed securities, but selling the securities legally required transferring the notes and titles as per the land title system.  But that would have cost a lot in filing fees and all but eliminated their profits, so they simply ignored the law, created an electronic registry called MERS, and thereby ripped off large financial investors by selling worthless paper.  The foreclosure-based fraud about which you have such doubts is merely the cover-up that resulted from the way in which a need to foreclose exposed the initial fraud.\nI haven’t gotten permission from Ilana yet to post her email verbatim, but I will summarize it as follows, (and either replace the summary or correct it depending upon her preference.)\n“We have a 3-stage process, not a 2-stage process. Bankers, most of whom really don’t know squat about Austrian theory, were compelled by law to grant rotten loans to the protected species of the politicians. They invented a product to do that.\nSounds quite creative; sounds like the unintended consequences of politics.\nI began reading\nthe column you recommended\n.  It begins with a one-case study as its proof. This is statistically worse than insignificant. It graduates to assertion. Then adds another one-case study.   You may be right, but the data in the column you provided does not prove your case.\nUnderstand: I am not a partisan here; I’m not pro-banker. So far, I just don’t see good evidence for your case.”\nThis was my response:\nI’m afraid you’re still a little too under the influence of the banking industry’s defense theory. You are repeating some of their talking points and focusing on some irrelevant side issues instead of the salient matters. What is irrelevant about the “one-case study” and the anecdotes being “statistically worse than insignificant” is that they are merely illustrative examples of an easily provable fact that applies to more than 60 million mortgages. It is quite clear that you do not know what the local land title laws are, (and being a Canadian by way of South Africa, I certainly wouldn’t expect you to; I’ve been in Europe for a decade and I have absolutely no idea what the local property laws are), so your attempt to use general principles to try theorizing around that gap in your knowledge is doomed to failure.\nIt’s not even possible for you to suggest that “the unintended consequences of politics” compelled the bankers to provide the loans to the favored classes because a) most of the relevant land title laws involved are older than the United States; they derive from the English common law, b) the MBS-selling preceded most of the laws that “compelled” them, and b) the number of loans that were fraudulently transferred far exceed the number of mortages sold that required any compelling. To quote Wikipedia: “What the case law is consistently holding is that MERS cannot do what it has purported to do (and has done in what appears to be over sixty (60) million mortgage transactions nationally).” The lawyers for MERS have even admitted this in court! “During the course of the hearing, the Court repeatedly raised the “MERS as nominee” issues to counsel for the Defendants, [MERS and OneWestBank] with said counsel finally admitting, upon repeated inquiry by the Court, that MERS cannot transfer promissory notes.”\nSo, this isn’t a case of bad politicians causing bad behavior by the banks. In fact, the bad politicians, the bad bureaucrats, and some of the bad state and federal courts have been repeatedly attempting to cover for the bad behavior by the banks. The banks are absolutely not on the side of freedom and capitalism here; they are deeply and actively involved in the corrupt politics themselves. Natural law also points to the guilt of the banks; they forgave the mortgage debt through their actions, then attempted to retroactively claim they had not forgiven it.\nOn a related, note, Jim Sinclair shares\nsome interesting information\n.\nI had dinner with my former partner, then lead director of and CEO of Bear Stearns. I could not contain myself so I asked him why he did so much business in OTC derivatives which were certain to bankrupt them. The answer I got was it was more than 50% of their profit. The right answer should have been it was more than 80% of their earnings.\nUPDATE I: Ilana wrote back to note that she intends to further contemplate the matter.  She added:\n“You know very well that my problem with your argument, Vox, is that it teeters on grand conspiracy. One of your readers in the comments section picked this up quite well.  The state and its cronies preside over the disintegration of civil society, but they do so reflexively, rather than as a matter of collusion and conspiracy.”\nPerhaps it does teeter on grand conspiracy.  But as I have pointed out in the past, calling something conspiracy doesn’t make it go away and the undeniable fact is that 65 million mortgages were transferred through MERS since 2004. Furthermore, it is highly probable that many of them, and perhaps even all 65 million, were transferred illegally according to laws that predate the Carter administration by decades, if not centuries.  My skepticism is well known to readers and critics alike and it NEVER occurred to me that the mortgage fraud could possibly run this deep and this wide.  I was sure that the reason the banks were mysteriously reluctant to foreclose upon properties in default was because doing so would expose their accounting irregularities with regards to the book value of the defaulting properties.  It almost defies imagination that any bank would ever knowingly destroy the paper trail that is the only security for its interest in the loans it has made.  And yet, we now know that many of them, including all the big, bailed-out banks, did.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-16T17:45:00+00:00"
}