{
  "url": "https://voxday.net/2010/10/06/et-tu-jona/",
  "scraped_at": "2026-01-08T23:39:09.124579",
  "title": "Et tu, Jonah",
  "date_display": "October 6, 2010",
  "date_iso": "2010-10-06T17:15:00+00:00",
  "date_from_url": "2010-10-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mr. Golberg <a href=\"http://www.nationalreview.com/articles/248807/america%E2%80%99s-assassination-list-jonah-goldberg\">takes an astonishing position</a> on the Obama administration’s assertion of a right to assassinate American citizens without trial:</p><blockquote><p>Some civil libertarians seem to think we can never, ever kill an American citizen without a trial by jury (and perhaps not even then). That argument would have been silly during the days of conventional warfare. Now it’s plain crazy.  And the Obama administration is right. This is no job for courts. Wars and how we fight them are political decisions, properly left to Congress and the president.</p></blockquote><p>Jonah should know better.  He is, after all, the one who built the case against the pragmatic, “it’s just this one brick” approach of progressive totalitarianism in his very good <i>Liberal Fascism</i>.  He further compounds his error when, <a href=\"http://www.nationalreview.com/corner/248930/re-assassination-jonah-goldberg\">after being correctly called on his erroneous reasoning</a> by a reader, he attempts to justify his position by bringing up the example of World War II.</p><p><i>“Surely, “the battlefield” is a very amorphous term these days. An American fighting in Nazi uniform in 1943 could be killed and even singled out for killing without a trial by jury, or at least I think that’s the case. Awlaki — like all of al Qaeda — refuses to  play by the rules even the Nazis agreed to. I’m at a loss as to why they should be rewarded for it.”</i></p><p>Of course, the only reason that an American fighting in Nazi uniform – more likely Wehrmacht, but never mind that – could be killed on the battlefield was because no one knew he was an American.  The Constitution clearly and <i>explicitly</i> deals with the question of treason in time of war, which makes since because it was written by men who had recently fought in the Revolutionary War, so it is ludicrous to appeal to some pragmatic sense of sobriety and sanity and claim that it supersedes the Constitution.</p><p><b>Article III<br> [Section 3.] Treason against the United States shall consist only in levying War against them, or in adhering to their Enemies, giving them Aid and Comfort. No Person shall be convicted of Treason unless on the Testimony of two Witnesses to the same overt Act, or on Confession in open Court.</br></b></p><p>Jonah isn’t one of National Review’s Trotskyites, so it is a little disappointing to see him toeing the anti-constitutional neocon line on this issue.</p></div>",
  "content_text": "Mr. Golberg\ntakes an astonishing position\non the Obama administration’s assertion of a right to assassinate American citizens without trial:\nSome civil libertarians seem to think we can never, ever kill an American citizen without a trial by jury (and perhaps not even then). That argument would have been silly during the days of conventional warfare. Now it’s plain crazy.  And the Obama administration is right. This is no job for courts. Wars and how we fight them are political decisions, properly left to Congress and the president.\nJonah should know better.  He is, after all, the one who built the case against the pragmatic, “it’s just this one brick” approach of progressive totalitarianism in his very good\nLiberal Fascism\n.  He further compounds his error when,\nafter being correctly called on his erroneous reasoning\nby a reader, he attempts to justify his position by bringing up the example of World War II.\n“Surely, “the battlefield” is a very amorphous term these days. An American fighting in Nazi uniform in 1943 could be killed and even singled out for killing without a trial by jury, or at least I think that’s the case. Awlaki — like all of al Qaeda — refuses to  play by the rules even the Nazis agreed to. I’m at a loss as to why they should be rewarded for it.”\nOf course, the only reason that an American fighting in Nazi uniform – more likely Wehrmacht, but never mind that – could be killed on the battlefield was because no one knew he was an American.  The Constitution clearly and\nexplicitly\ndeals with the question of treason in time of war, which makes since because it was written by men who had recently fought in the Revolutionary War, so it is ludicrous to appeal to some pragmatic sense of sobriety and sanity and claim that it supersedes the Constitution.\nArticle III\n[Section 3.] Treason against the United States shall consist only in levying War against them, or in adhering to their Enemies, giving them Aid and Comfort. No Person shall be convicted of Treason unless on the Testimony of two Witnesses to the same overt Act, or on Confession in open Court.\nJonah isn’t one of National Review’s Trotskyites, so it is a little disappointing to see him toeing the anti-constitutional neocon line on this issue.",
  "tags": [
    "trainwreck",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-06T16:15:00+00:00"
}