{
  "url": "https://voxday.net/2010/10/07/feminists-discover-economics/",
  "scraped_at": "2026-01-08T23:39:12.794910",
  "title": "Feminists discover economics",
  "date_display": "October 7, 2010",
  "date_iso": "2010-10-07T08:31:00+00:00",
  "date_from_url": "2010-10-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or at least, <a href=\"http://www.hookingupsmart.com/2010/10/05/hookinguprealities/college-math-slut-lush-slush/\">the basic concept of supply</a>, although they remain innocent about the consequences of its intersection with demand.  It’s rather like watching monkeys figure out that the bright sparkly stuff dancing on top of the wood is hot:</p><blockquote><p><i>“There is this notion of slut shaming in the media and it happens on a more personal level among people who shame one another. There is also something that is discussed on other websites but never in the wider media – something called slut rejection. The latter is what heterosexual men who seek a life partner supposedly engage in. I have personal experience with this. My ex did not try to shame me but upon knowing more about me, he just sort of faded away. Its so wrong that women may have to lie or not say anything and either strategy is prone to backfire. I believe that if men had less alternatives, that is if most or many women had a fruitful sexual history, then that would become the norm and therefore acceptable.”</i></p><p>That’s quite a remarkable statement, don’t you think? The feminist solution to slut shaming is to recruit so many women to sluthood that the supply of sexually inexperienced women will disappear. Men will have their fun in college, and when it comes time to marry, their only choice will be from among “fruitful” women. It’s interesting because it’s an acknowledgement that men can’t be rehabbed into the feminist way of thinking. The Women’s Movement tore down many walls, but the male brain is the last frontier, and the feminist siege cannot succeed in eradicating this last double standard.</p></blockquote><p>As we have learned to expect, the feminist reaction to unforeseen and undesirable consequences is an intrinsically fascistic one of removing options from others rather than rethinking her assumptions.  Susan Walsh’s observations of this breakthrough moment in feminist intellectual history are correct.  The constant attacks by anchor-jawed, furry-armed Pandagonian warpigs on what they call “slut-shaming” is little more than an attempt to reduce the supply of sexually inexperienced competitors for long-term relationship status.  Seeing that forty years of constant K-BA propaganda has barely altered the male preference for female sexual inexperience in a life-long mate, they have begun to give up on the idea of haranguing men in favor of focusing on what has been a much more successful strategy of converting young women into easily accessible sex toys.</p><p>This may sound insane given what 6,000 years of written history about civilizations and their fate, and in fact it is both insane as well as societally destructive.  But one must never forget that women are not only hypergamous, they are also <i>solipsistic</i>.  In other words, most women assume that what they believe is good for them is therefore good for society, to the extent that they even recognize the existence of any society outside of their own selves.  The feminist slogan “The personal is political”, which dates back to a 1969 essay in the <i>Feminist Revolution</i> collection does not quite do the concept justice; “the self is society” would be a more accurate description.</p><p>This is the primary difference between a nihilistic practitioner of the crimson arts like Roissy and the feminists.  The male predators recognize and accept the societal destructiveness of their attitudes and behavior.  The feminists not only do not recognize their societal destructiveness, they stubbornly deny it.  This is the difference between selfishness and solipsism.</p><p>Needless to say, the feminist strategy of supply restriction is doomed to failure just like every other totalitarian attack on the supply of anything that Man particularly desires.  As we have seen in 30 years of war on drugs, it would not work even if it were encoded into law and utilized government force.  American men are already turning to foreign women who have not been rendered less attractive to them by feminist attitudes and bestial behavior; the more successful feminists are in ruining those they consider to be their competitors, the fewer American women will find American men willing to marry them or American men they want to marry.  Those who still seek to marry and are deemed marriageable by women will not come to accept hard-ridden Alpha leavings any more than they do already.  Instead they will either seek out non-American women who are increasingly available to them via the Internet and immigration or they will not marry at all; there is no need to commit to a woman who has been riding the copulatory carousel when one can simply insert a quarter instead.</p><p>Mrs. Walsh’s reader is to be commended, however, for recognizing <a href=\"http://www.milobookclub.com/2010/07/09/mailvox-hierarchy-of-female/\">a reality that so many women still fail to recognize</a>.  Every new sexual partner taken by a woman renders her marginally less attractive to men interested in permanent commitments and reduces her potential marital value.</p></div>",
  "content_text": "Or at least,\nthe basic concept of supply\n, although they remain innocent about the consequences of its intersection with demand.  It’s rather like watching monkeys figure out that the bright sparkly stuff dancing on top of the wood is hot:\n“There is this notion of slut shaming in the media and it happens on a more personal level among people who shame one another. There is also something that is discussed on other websites but never in the wider media – something called slut rejection. The latter is what heterosexual men who seek a life partner supposedly engage in. I have personal experience with this. My ex did not try to shame me but upon knowing more about me, he just sort of faded away. Its so wrong that women may have to lie or not say anything and either strategy is prone to backfire. I believe that if men had less alternatives, that is if most or many women had a fruitful sexual history, then that would become the norm and therefore acceptable.”\nThat’s quite a remarkable statement, don’t you think? The feminist solution to slut shaming is to recruit so many women to sluthood that the supply of sexually inexperienced women will disappear. Men will have their fun in college, and when it comes time to marry, their only choice will be from among “fruitful” women. It’s interesting because it’s an acknowledgement that men can’t be rehabbed into the feminist way of thinking. The Women’s Movement tore down many walls, but the male brain is the last frontier, and the feminist siege cannot succeed in eradicating this last double standard.\nAs we have learned to expect, the feminist reaction to unforeseen and undesirable consequences is an intrinsically fascistic one of removing options from others rather than rethinking her assumptions.  Susan Walsh’s observations of this breakthrough moment in feminist intellectual history are correct.  The constant attacks by anchor-jawed, furry-armed Pandagonian warpigs on what they call “slut-shaming” is little more than an attempt to reduce the supply of sexually inexperienced competitors for long-term relationship status.  Seeing that forty years of constant K-BA propaganda has barely altered the male preference for female sexual inexperience in a life-long mate, they have begun to give up on the idea of haranguing men in favor of focusing on what has been a much more successful strategy of converting young women into easily accessible sex toys.\nThis may sound insane given what 6,000 years of written history about civilizations and their fate, and in fact it is both insane as well as societally destructive.  But one must never forget that women are not only hypergamous, they are also\nsolipsistic\n.  In other words, most women assume that what they believe is good for them is therefore good for society, to the extent that they even recognize the existence of any society outside of their own selves.  The feminist slogan “The personal is political”, which dates back to a 1969 essay in the\nFeminist Revolution\ncollection does not quite do the concept justice; “the self is society” would be a more accurate description.\nThis is the primary difference between a nihilistic practitioner of the crimson arts like Roissy and the feminists.  The male predators recognize and accept the societal destructiveness of their attitudes and behavior.  The feminists not only do not recognize their societal destructiveness, they stubbornly deny it.  This is the difference between selfishness and solipsism.\nNeedless to say, the feminist strategy of supply restriction is doomed to failure just like every other totalitarian attack on the supply of anything that Man particularly desires.  As we have seen in 30 years of war on drugs, it would not work even if it were encoded into law and utilized government force.  American men are already turning to foreign women who have not been rendered less attractive to them by feminist attitudes and bestial behavior; the more successful feminists are in ruining those they consider to be their competitors, the fewer American women will find American men willing to marry them or American men they want to marry.  Those who still seek to marry and are deemed marriageable by women will not come to accept hard-ridden Alpha leavings any more than they do already.  Instead they will either seek out non-American women who are increasingly available to them via the Internet and immigration or they will not marry at all; there is no need to commit to a woman who has been riding the copulatory carousel when one can simply insert a quarter instead.\nMrs. Walsh’s reader is to be commended, however, for recognizing\na reality that so many women still fail to recognize\n.  Every new sexual partner taken by a woman renders her marginally less attractive to men interested in permanent commitments and reduces her potential marital value.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-07T07:31:00+00:00"
}