{
  "url": "https://voxday.net/2010/10/24/hearts-and-minds-of-hate/",
  "scraped_at": "2026-01-08T23:40:45.873405",
  "title": "Hearts and minds of hate",
  "date_display": "October 24, 2010",
  "date_iso": "2010-10-24T11:05:00+00:00",
  "date_from_url": "2010-10-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nicholas Kristof <a href=\"http://www.nytimes.com/2010/10/24/opinion/24kristof.html?hp\">underlines the intrinsic absurdity</a> of the current line of neocon justification for the Afghan Occupation:</p><blockquote><p>[I]t seems to me a historic mistake to justify our huge military presence in Afghanistan as a bulwark to protect the women. In fact, most women I interviewed favored making a deal with the Taliban — simply because it would bring peace. For them, the Taliban regime was awful, but a perpetual war may be worse.  Take Pari Gol, a woman from Helmand Province whom I met here in Kabul. She despises the Taliban and told me on this trip that back in 2001, “I prayed that the Taliban would be defeated, and God listened to my prayers.”</p><p>Yet in the fighting since then, she said, her home was destroyed and her husband and daughter were both killed by American airstrikes. She is now living in a mud hut here — fuming at the Taliban, the Americans and the Afghan government. “I hate all of them,” she told me.</p></blockquote><p>It is a huge mistake.  The occupation of Afghanistan cannot be justified under any reasonable measure anymore.  It should be obvious that the neocons are not going to win many of the required hearts and minds when their “liberation” of Afghan women comes via the deaths of their husbands and children.  No doubt there are a few pro-abortion, anti-marriage feminists who would see this as a perfectly viable strategy, but should come as no surprise to sane observers that the <i>violent military occupation</i> of a country very seldom causes the occupiers to be loved.</p><p>Given that the latest Wikileaks documents prove that America’s occupation of Iraq has killed <a href=\"http://www.iraqbodycount.org/analysis/numbers/warlogs/\">nearly three times more innocent and uninvolved civilians</a> than all enemy “insurgents”, “terrorists”, or “violent extremists” combined, it is eminently clear that the Bush-Rumsfeld strategery has completely failed.  And the Obama administration has been making a classic strategic mistake in stubbornly reinforcing failure; we are fortunate that it has not been successful in expanding the war to include Iran and Pakistan as well.</p><p><i>“The Iraq War Logs released by WikiLeaks on 23 October 2010, contain 54,910 records compiled by the United States military whose numerical fields register 109,032 violent deaths between January 2004 and December 2009. These casualty records contain four categories of casualties, ‘Civilian’ (66,081 deaths), ‘Host Nation’ (15,196 deaths), ‘Enemy’ (23,984 deaths), and ‘Friendly’ (3,771 deaths).”</i></p><p>Perceptive observers will note the way in which the views of the Afghan women are consistent with the theory of Game.  The relative security of the Taliban are preferred to the risks of war and the nominal “freedom” it promises.  The fact that they are almost certainly right in this case does not alter the fact that the inherent female preference exists.</p></div>",
  "content_text": "Nicholas Kristof\nunderlines the intrinsic absurdity\nof the current line of neocon justification for the Afghan Occupation:\n[I]t seems to me a historic mistake to justify our huge military presence in Afghanistan as a bulwark to protect the women. In fact, most women I interviewed favored making a deal with the Taliban — simply because it would bring peace. For them, the Taliban regime was awful, but a perpetual war may be worse.  Take Pari Gol, a woman from Helmand Province whom I met here in Kabul. She despises the Taliban and told me on this trip that back in 2001, “I prayed that the Taliban would be defeated, and God listened to my prayers.”\nYet in the fighting since then, she said, her home was destroyed and her husband and daughter were both killed by American airstrikes. She is now living in a mud hut here — fuming at the Taliban, the Americans and the Afghan government. “I hate all of them,” she told me.\nIt is a huge mistake.  The occupation of Afghanistan cannot be justified under any reasonable measure anymore.  It should be obvious that the neocons are not going to win many of the required hearts and minds when their “liberation” of Afghan women comes via the deaths of their husbands and children.  No doubt there are a few pro-abortion, anti-marriage feminists who would see this as a perfectly viable strategy, but should come as no surprise to sane observers that the\nviolent military occupation\nof a country very seldom causes the occupiers to be loved.\nGiven that the latest Wikileaks documents prove that America’s occupation of Iraq has killed\nnearly three times more innocent and uninvolved civilians\nthan all enemy “insurgents”, “terrorists”, or “violent extremists” combined, it is eminently clear that the Bush-Rumsfeld strategery has completely failed.  And the Obama administration has been making a classic strategic mistake in stubbornly reinforcing failure; we are fortunate that it has not been successful in expanding the war to include Iran and Pakistan as well.\n“The Iraq War Logs released by WikiLeaks on 23 October 2010, contain 54,910 records compiled by the United States military whose numerical fields register 109,032 violent deaths between January 2004 and December 2009. These casualty records contain four categories of casualties, ‘Civilian’ (66,081 deaths), ‘Host Nation’ (15,196 deaths), ‘Enemy’ (23,984 deaths), and ‘Friendly’ (3,771 deaths).”\nPerceptive observers will note the way in which the views of the Afghan women are consistent with the theory of Game.  The relative security of the Taliban are preferred to the risks of war and the nominal “freedom” it promises.  The fact that they are almost certainly right in this case does not alter the fact that the inherent female preference exists.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-24T10:05:00+00:00"
}