{
  "url": "https://voxday.net/2010/10/20/in-defense-of-double-standards/",
  "scraped_at": "2026-01-08T23:40:25.407864",
  "title": "In defense of double-standards",
  "date_display": "October 20, 2010",
  "date_iso": "2010-10-20T13:30:00+00:00",
  "date_from_url": "2010-10-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Donna Reed complains that women are criticized for the same behavior in which men indulge:</p><blockquote><p>Her wanting to explore and have her fun before she settles hardly qualifies as a tramp. Tons and TONS of men do this same thing but what do we call them?</p></blockquote><p>That completely depends upon how “fun” is defined.  Considering that <a href=\"http://www.milobookclub.com/2010/10/19/warning-hamster-at-work/\">the woman concerned</a> a) needed to break up with her boyfriend, b) was by her own admission envious of her single friends being able to go out with other men, and c) Ms Reed claims that “Tons and TONS of men” are doing “this same thing”, it is perfectly clear that what the little would-be tramp wanted to do was exactly what I described in the original post, namely, spend a few years riding the carousel before settling down.</p><p>But that’s obvious and one requires a furiously spinning rationalization hamster in order to claim that the young woman merely wanted to break it off with the perfect long-term relationship guy in order to spend time “taking trips with best friends, dancing, and doing anything silly and fun with your pals”.  (Of course, as has been pointed out before, “taking trips” aka “travel” is femalespeak for “have sex with strange men”, so I suppose the assertion is not so much incorrect as an incompetent attempt at camouflage.)  There is simply no question that the young woman very much wants to go out and get herself ravished a few times by a few different men.  It is the bestial temptation that is there to either be resisted by her reason or justified by her hamster.</p><p>The more interesting question that Donna Reed raises is this: how and why can anyone object to a sex-based double standard?  There is no double-standard if we are discussing morality; fornication and adultery are considered sins for both sexes alike.  Therefore, to assert the existence of a double-standard inherently takes the discussion completely outside the subject of morality and puts it in the realm of mere social acceptability.</p><p>Now, the supposed double standard is that men who have sex with many women are studs whereas women who have sex with many men are sluts.  But different labels for men and women with similar attributes are not a double standard; is it a double standard that attractive men are called “handsome” and attractive women are called “pretty”?  Of course not.  The labels derive from the observable fact that men’s attraction to women has a negative correlation with her sexual experience while women’s attraction to men has a positive correlation with his sexual experience.</p><p>Note that we’re talking about attraction here, not the reasoned pursuit of a life-long mate.  As is usually the case, what a woman <i>says</i> about the men to whom she is attracted is irrelevant as the fact of the matter is that the virginal adult male is a figure of scorn in modern society whereas the virginal adult female is despised only by her fellow women in the same manner that they hate beautiful women.</p><p>So, the <i>female</i> standard for men is that men with less sexual experience are less attractive.  The <i>male</i> standard for women is that women with less sexual experience are more attractive.  This is not a single double standard, but rather <i>two</i> distinct standards held by two different groups of people about two different groups.</p></div>",
  "content_text": "Donna Reed complains that women are criticized for the same behavior in which men indulge:\nHer wanting to explore and have her fun before she settles hardly qualifies as a tramp. Tons and TONS of men do this same thing but what do we call them?\nThat completely depends upon how “fun” is defined.  Considering that\nthe woman concerned\na) needed to break up with her boyfriend, b) was by her own admission envious of her single friends being able to go out with other men, and c) Ms Reed claims that “Tons and TONS of men” are doing “this same thing”, it is perfectly clear that what the little would-be tramp wanted to do was exactly what I described in the original post, namely, spend a few years riding the carousel before settling down.\nBut that’s obvious and one requires a furiously spinning rationalization hamster in order to claim that the young woman merely wanted to break it off with the perfect long-term relationship guy in order to spend time “taking trips with best friends, dancing, and doing anything silly and fun with your pals”.  (Of course, as has been pointed out before, “taking trips” aka “travel” is femalespeak for “have sex with strange men”, so I suppose the assertion is not so much incorrect as an incompetent attempt at camouflage.)  There is simply no question that the young woman very much wants to go out and get herself ravished a few times by a few different men.  It is the bestial temptation that is there to either be resisted by her reason or justified by her hamster.\nThe more interesting question that Donna Reed raises is this: how and why can anyone object to a sex-based double standard?  There is no double-standard if we are discussing morality; fornication and adultery are considered sins for both sexes alike.  Therefore, to assert the existence of a double-standard inherently takes the discussion completely outside the subject of morality and puts it in the realm of mere social acceptability.\nNow, the supposed double standard is that men who have sex with many women are studs whereas women who have sex with many men are sluts.  But different labels for men and women with similar attributes are not a double standard; is it a double standard that attractive men are called “handsome” and attractive women are called “pretty”?  Of course not.  The labels derive from the observable fact that men’s attraction to women has a negative correlation with her sexual experience while women’s attraction to men has a positive correlation with his sexual experience.\nNote that we’re talking about attraction here, not the reasoned pursuit of a life-long mate.  As is usually the case, what a woman\nsays\nabout the men to whom she is attracted is irrelevant as the fact of the matter is that the virginal adult male is a figure of scorn in modern society whereas the virginal adult female is despised only by her fellow women in the same manner that they hate beautiful women.\nSo, the\nfemale\nstandard for men is that men with less sexual experience are less attractive.  The\nmale\nstandard for women is that women with less sexual experience are more attractive.  This is not a single double standard, but rather\ntwo\ndistinct standards held by two different groups of people about two different groups.",
  "tags": [
    "society",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-20T12:30:00+00:00"
}