{
  "url": "https://voxday.net/2010/10/18/in-which-we-are-called-ou/",
  "scraped_at": "2026-01-08T23:40:14.468425",
  "title": "In which we are called out",
  "date_display": "October 18, 2010",
  "date_iso": "2010-10-18T17:15:00+00:00",
  "date_from_url": "2010-10-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Chateau comments upon America reaching <a href=\"http://roissy.wordpress.com/2010/10/18/the-crazy-cat-lady-stage-of-america/\">the Crazy Cat Lady Stage</a>:</p><blockquote><p>The crazy cat lady stage of America — yep, that about sums it up. So what follows? Who knows. It’s possible the pendulum will swing back, perhaps violently.  As we here at the Chateau relish provoking reminding the readers, giving women the right to vote has been a disaster for liberty-loving small-government patriots. Do any of the mainstream conservative or libertarian bloggers have anything to say about Lott’s study? Their cowardly silence speaks volumes.</p></blockquote><p>I responded thusly:</p><p><i>Cowardly silence?  On women’s suffrage?  Just to just to give one conservative and one libertarian example, Ann Coulter and I have both been very clear on our opposition to women’s suffrage.  I have written on the subject numerous times; here’s <a href=\"http://www.milobookclub.com/2007/11/05/ann-is-crystal-clear/\">one example from 2007</a>:</i></p><p>“What Ann understands and so many nominal conservatives do not is that women’s suffrage is completely incompatible with human liberty or a republic as described in the U.S. Constitution. The two cannot co-exist. One cannot defend freedom on the basis of emotion, as fear always runs to promises of security, however nebulous.”</p><p>Women’s suffrage has been a complete and unmitigated disaster across the West and it is doubtful that any society can survive it for long.</p><p>The fact is that it is impossible to rationally defend women’s suffrage in a system of limited democracy on ANY grounds except to assert that it is an intrinsic and self-evident societal good.  One may or may not agree with that, but regardless, to simply label something an intrinsic and self-evident good is not tantamount to actually making a case for it.  To even <i>attempt</i> to begin making a genuine argument for women’s suffrage usually requires a fundamental error in confusing “the act of legal voting” with “freedom” and/or “human liberty”.  But neither voting nor democracy are synonymous with freedom or societal well-being, which is precisely why the Founding Fathers limited the franchise so strictly and why so many of supposed champions of democracy are actively opposed to further expanding democracy in America beyond the equalitarian expansion of the electorate presently permitted to select its nominal representatives.</p><p>If a single American feminist has embraced the concept of genuine democracy with a 100 percent national franchise, which I support as being vastly preferable to modern American pseudo-democracy and in which there are absolutely no anti-democratic strictures on the will of the people of either sex, I have yet to hear of it.  Which should suffice to demonstrate that whatever the feminist rationale in support of women’s suffrage might be, it doesn’t appear to be based on a principled commitment to democracy.</p></div>",
  "content_text": "Chateau comments upon America reaching\nthe Crazy Cat Lady Stage\n:\nThe crazy cat lady stage of America — yep, that about sums it up. So what follows? Who knows. It’s possible the pendulum will swing back, perhaps violently.  As we here at the Chateau relish provoking reminding the readers, giving women the right to vote has been a disaster for liberty-loving small-government patriots. Do any of the mainstream conservative or libertarian bloggers have anything to say about Lott’s study? Their cowardly silence speaks volumes.\nI responded thusly:\nCowardly silence?  On women’s suffrage?  Just to just to give one conservative and one libertarian example, Ann Coulter and I have both been very clear on our opposition to women’s suffrage.  I have written on the subject numerous times; here’s\none example from 2007\n:\n“What Ann understands and so many nominal conservatives do not is that women’s suffrage is completely incompatible with human liberty or a republic as described in the U.S. Constitution. The two cannot co-exist. One cannot defend freedom on the basis of emotion, as fear always runs to promises of security, however nebulous.”\nWomen’s suffrage has been a complete and unmitigated disaster across the West and it is doubtful that any society can survive it for long.\nThe fact is that it is impossible to rationally defend women’s suffrage in a system of limited democracy on ANY grounds except to assert that it is an intrinsic and self-evident societal good.  One may or may not agree with that, but regardless, to simply label something an intrinsic and self-evident good is not tantamount to actually making a case for it.  To even\nattempt\nto begin making a genuine argument for women’s suffrage usually requires a fundamental error in confusing “the act of legal voting” with “freedom” and/or “human liberty”.  But neither voting nor democracy are synonymous with freedom or societal well-being, which is precisely why the Founding Fathers limited the franchise so strictly and why so many of supposed champions of democracy are actively opposed to further expanding democracy in America beyond the equalitarian expansion of the electorate presently permitted to select its nominal representatives.\nIf a single American feminist has embraced the concept of genuine democracy with a 100 percent national franchise, which I support as being vastly preferable to modern American pseudo-democracy and in which there are absolutely no anti-democratic strictures on the will of the people of either sex, I have yet to hear of it.  Which should suffice to demonstrate that whatever the feminist rationale in support of women’s suffrage might be, it doesn’t appear to be based on a principled commitment to democracy.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-18T16:15:00+00:00"
}