{
  "url": "https://voxday.net/2010/10/13/in-which-verdict-is-announced/",
  "scraped_at": "2026-01-08T23:39:46.728580",
  "title": "In which the verdict is announced",
  "date_display": "October 13, 2010",
  "date_iso": "2010-10-13T08:15:00+00:00",
  "date_from_url": "2010-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Roissy <a href=\"http://roissy.wordpress.com/2010/10/12/the-duke-rejection-list/\">deigns to issue a bull</a> on the Duke Powerpoint and does not disappoint:</p><blockquote><p>I wasn’t interested at first, having scanned the notorious Powerpoint and concluded that it was just another story of a whore riding the (alpha) cock carousel who happened to forego discretion and publicize her sluttery, nothing to see here move along dystopia down the hall and to your left. But a closer inspection of Owen’s tell-all reveals a river of scorned subconsciousness that the mainstream feminist bloggers have predictably failed to notice – this chick was rejected by each and every one of these high status men she banged.</p><p>“But how can that be?”, some of the duller among you will ask. “None of the men turned her down for sex.”</p><p>Don’t you know it’s different for women? Failing to get laid is not how women are rejected; they are rejected when they don’t receive romance, love, and long term commitment….</p><p>Bottom line: a male Karen Owen would actually see his sexual market value *rise*, while Owen’s value as a girlfriend and potential wife has undoubtedly fallen. This — plus the raw hypergamy on display by her choice of sexual partners and her ability to effortlessly fulfill that limbic impulse — is the underlying message of Owen’s cutesy confessional. And it’s the message that the legacy media, the middle-aged vicars of vicariousness, and the feminists are trying hard to miss.</p></blockquote><p>I didn’t bother reading the Powerpoint myself, having reached that season of life where Cicero and game design documents are vastly more interesting than yet another vicarious rehash of the college years.  But this is <i>exactly</i> the same conclusion I reached based on what I saw in the Deadspin and Jezebel articles; a plain, but sufficiently slender 6 with the usual hypergamous instincts fornicating over her <a href=\"http://www.milobookclub.com/2010/07/09/mailvox-hierarchy-of-female/\">socio-sexual value</a> with higher status young men who would never consider dating her, let alone marrying her.  Roissy nailed it, right down to the expected manface.</p><p>Madonna/Whore is more than a male psychological complex, it is also a significant life choice that women have to make regardless of whether they are consciously aware of making it or not.  There are exceptions, of course, as there must be in applying a binary principle to a population of 150 million, but in general, if a young woman has reason to believe she has a reasonable shot at attracting an alpha with whom to settle down, she has to forgo the short-term option of spending four to twelve years riding the alpha carousel if she wants to marry one.  And she can’t be tempted into imitating the behavior of the lower-ranking young women who can never hope to do more than take the occasional carousel spin because in doing so she lowers her own rank.</p><p>Because all questions of value are intrinsically economic in nature, the vital Austrian question of time preferences – spend now or save and spend later – therefore applies.  And it should not be surprising that so few young women grasp this fairly obvious fact, since they are natural and instinctive Keynesians who tend to believe that spending their resources magically creates more demand for them.  But one shouldn’t have to study economics to understand that it is scarcity that drives high-priced value.</p></div>",
  "content_text": "Roissy\ndeigns to issue a bull\non the Duke Powerpoint and does not disappoint:\nI wasn’t interested at first, having scanned the notorious Powerpoint and concluded that it was just another story of a whore riding the (alpha) cock carousel who happened to forego discretion and publicize her sluttery, nothing to see here move along dystopia down the hall and to your left. But a closer inspection of Owen’s tell-all reveals a river of scorned subconsciousness that the mainstream feminist bloggers have predictably failed to notice – this chick was rejected by each and every one of these high status men she banged.\n“But how can that be?”, some of the duller among you will ask. “None of the men turned her down for sex.”\nDon’t you know it’s different for women? Failing to get laid is not how women are rejected; they are rejected when they don’t receive romance, love, and long term commitment….\nBottom line: a male Karen Owen would actually see his sexual market value *rise*, while Owen’s value as a girlfriend and potential wife has undoubtedly fallen. This — plus the raw hypergamy on display by her choice of sexual partners and her ability to effortlessly fulfill that limbic impulse — is the underlying message of Owen’s cutesy confessional. And it’s the message that the legacy media, the middle-aged vicars of vicariousness, and the feminists are trying hard to miss.\nI didn’t bother reading the Powerpoint myself, having reached that season of life where Cicero and game design documents are vastly more interesting than yet another vicarious rehash of the college years.  But this is\nexactly\nthe same conclusion I reached based on what I saw in the Deadspin and Jezebel articles; a plain, but sufficiently slender 6 with the usual hypergamous instincts fornicating over her\nsocio-sexual value\nwith higher status young men who would never consider dating her, let alone marrying her.  Roissy nailed it, right down to the expected manface.\nMadonna/Whore is more than a male psychological complex, it is also a significant life choice that women have to make regardless of whether they are consciously aware of making it or not.  There are exceptions, of course, as there must be in applying a binary principle to a population of 150 million, but in general, if a young woman has reason to believe she has a reasonable shot at attracting an alpha with whom to settle down, she has to forgo the short-term option of spending four to twelve years riding the alpha carousel if she wants to marry one.  And she can’t be tempted into imitating the behavior of the lower-ranking young women who can never hope to do more than take the occasional carousel spin because in doing so she lowers her own rank.\nBecause all questions of value are intrinsically economic in nature, the vital Austrian question of time preferences – spend now or save and spend later – therefore applies.  And it should not be surprising that so few young women grasp this fairly obvious fact, since they are natural and instinctive Keynesians who tend to believe that spending their resources magically creates more demand for them.  But one shouldn’t have to study economics to understand that it is scarcity that drives high-priced value.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-13T07:15:00+00:00"
}