{
  "url": "https://voxday.net/2010/10/14/limits-of-human-attraction/",
  "scraped_at": "2026-01-08T23:39:52.223114",
  "title": "The limits of human attraction",
  "date_display": "October 14, 2010",
  "date_iso": "2010-10-14T10:45:00+00:00",
  "date_from_url": "2010-10-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In response to Retha’s attempt to protest that sin is not attactive to Christian women:</p><blockquote><p>Are you trying to say you know me better than I know myself?   Vox, when you make comments about women in general, you speak a lot of truth. But do not assume to know how any one particular women you never met will react or have reacted to something. I know from experience that this was not how I reacted to a serial fornicator who tried dating me.</p></blockquote><p>Retha’s response reveals some interesting aspects of the differences between the male and female minds here.  First, this is a spectacular example of female solipsism; she is attempting to rebut the concept that Christian women are not immune to female hypergamy by citing a single example of her own failure to be attracted by a sexually successful suitor.  Second, it is an blatant theological error to claim that Christian women are not attracted to sin, indeed, the fact that the Bible bans women from positions of leadership within the Church and household make it rather clear that they are to considered more spiritually susceptible to sin, and therefore presumably more attracted to it, than men.  Given that all men and women alike are fallen, it is absurd for her to claim that she, or any other Christian woman, is immune to the appeal of the world.  As Billy Graham is once supposed to have said: “if you don’t think sin is fun, you’re not doing it right.”</p><p>With regards to the question of whether I know her better than she knows herself, I can only answer that because her response is a very conventionally female one, there is little reason to believe that she is a behavioral outlier beyond her creditable commitment to her faith.  In other words, given a reasonable portion of the information that she possesses regarding any situation involving male-female interaction, I believe that not only me, but many men of sufficient knowledge of Game would be able to predict her future actions better than she can because they have no rationalization hamster nor hormonal cycle clouding their perceptions.</p><p>Women are not static creatures.  They are extraordinarily dynamic, which is one of the things that makes them so fascinating and so unpredictable to those who do not recognize the primary motivational factors involved.  As economists are gradually coming to accept, human behavior is seldom rational by any exterior metric.  And the interior metrics of women tend to vacillate greatly, and more to the point, often without them consciously realizing they have changed.  Some of these vacillations are predictable, which is why male predators are able to anticipate and take advantage of female dynamism with such reliable success.</p><p>The fact that Retha found one serial fornicator unattractive doesn’t indicate that it was his success with women alone that turned her off unless he was significantly higher status than her. Hence the “a little bit of beta” that is advised for alphas who are slumming.  (In such cases, the woman’s rationalization hamster can’t spin its wheel fast enough to convince her that she’ll be able to hold his interest over time, so she rejects him first in proactive self-defense.)  Given that Retha has, according to her, rejected literally <i>every</i> man that has ever expressed interest in her throughout the course of her life, it should not at all surprising that she rejected the serial fornicator too.  Was the unattractiveness of sin the sole reason for that particular rejection?  It’s doubtful, especially since he is neither the first nor the last male sinner she will encounter.</p><p>But Retha is not wrong in stating the completely obvious.  There are always statistical outliers and when you play the probabilities, you will certainly lose from time to time.  It is certainly within the realm of possibility that Retha is one of the few women to whom the bad boys genuinely hold negative appeal and that she would be more sexually attracted to a meek and virginal omega than an arrogant and experienced alpha.  I don’t buy it for a second, but it is at least possible. Thanks to the Internet, we know the limits of human attraction are disturbingly wide, perhaps even boundless.  (You know that somewhere out there, there is a site for people who are deeply attracted to molluscs.  With pictures.)</p><p>In summary, the answer is yes, unless you happen to be a statistical freak of some sort.  One should always assume that a woman is going to behave like a normal woman unless one is in possession of reliable information indicating otherwise, just as one should always assume that a man is going to behave like a normal man.  Now, we are not mere animals.  We have the capacity to rationally control our behavior.  But the very fact that we need to exert that control over our irrational instincts indicates that they a) exist, and b) influence our feelings, thoughts, and behavior in a potentially predictable manner.</p></div>",
  "content_text": "In response to Retha’s attempt to protest that sin is not attactive to Christian women:\nAre you trying to say you know me better than I know myself?   Vox, when you make comments about women in general, you speak a lot of truth. But do not assume to know how any one particular women you never met will react or have reacted to something. I know from experience that this was not how I reacted to a serial fornicator who tried dating me.\nRetha’s response reveals some interesting aspects of the differences between the male and female minds here.  First, this is a spectacular example of female solipsism; she is attempting to rebut the concept that Christian women are not immune to female hypergamy by citing a single example of her own failure to be attracted by a sexually successful suitor.  Second, it is an blatant theological error to claim that Christian women are not attracted to sin, indeed, the fact that the Bible bans women from positions of leadership within the Church and household make it rather clear that they are to considered more spiritually susceptible to sin, and therefore presumably more attracted to it, than men.  Given that all men and women alike are fallen, it is absurd for her to claim that she, or any other Christian woman, is immune to the appeal of the world.  As Billy Graham is once supposed to have said: “if you don’t think sin is fun, you’re not doing it right.”\nWith regards to the question of whether I know her better than she knows herself, I can only answer that because her response is a very conventionally female one, there is little reason to believe that she is a behavioral outlier beyond her creditable commitment to her faith.  In other words, given a reasonable portion of the information that she possesses regarding any situation involving male-female interaction, I believe that not only me, but many men of sufficient knowledge of Game would be able to predict her future actions better than she can because they have no rationalization hamster nor hormonal cycle clouding their perceptions.\nWomen are not static creatures.  They are extraordinarily dynamic, which is one of the things that makes them so fascinating and so unpredictable to those who do not recognize the primary motivational factors involved.  As economists are gradually coming to accept, human behavior is seldom rational by any exterior metric.  And the interior metrics of women tend to vacillate greatly, and more to the point, often without them consciously realizing they have changed.  Some of these vacillations are predictable, which is why male predators are able to anticipate and take advantage of female dynamism with such reliable success.\nThe fact that Retha found one serial fornicator unattractive doesn’t indicate that it was his success with women alone that turned her off unless he was significantly higher status than her. Hence the “a little bit of beta” that is advised for alphas who are slumming.  (In such cases, the woman’s rationalization hamster can’t spin its wheel fast enough to convince her that she’ll be able to hold his interest over time, so she rejects him first in proactive self-defense.)  Given that Retha has, according to her, rejected literally\nevery\nman that has ever expressed interest in her throughout the course of her life, it should not at all surprising that she rejected the serial fornicator too.  Was the unattractiveness of sin the sole reason for that particular rejection?  It’s doubtful, especially since he is neither the first nor the last male sinner she will encounter.\nBut Retha is not wrong in stating the completely obvious.  There are always statistical outliers and when you play the probabilities, you will certainly lose from time to time.  It is certainly within the realm of possibility that Retha is one of the few women to whom the bad boys genuinely hold negative appeal and that she would be more sexually attracted to a meek and virginal omega than an arrogant and experienced alpha.  I don’t buy it for a second, but it is at least possible. Thanks to the Internet, we know the limits of human attraction are disturbingly wide, perhaps even boundless.  (You know that somewhere out there, there is a site for people who are deeply attracted to molluscs.  With pictures.)\nIn summary, the answer is yes, unless you happen to be a statistical freak of some sort.  One should always assume that a woman is going to behave like a normal woman unless one is in possession of reliable information indicating otherwise, just as one should always assume that a man is going to behave like a normal man.  Now, we are not mere animals.  We have the capacity to rationally control our behavior.  But the very fact that we need to exert that control over our irrational instincts indicates that they a) exist, and b) influence our feelings, thoughts, and behavior in a potentially predictable manner.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-14T09:45:00+00:00"
}