{
  "url": "https://voxday.net/2010/10/22/mailvox-student-exhibits-mastery/",
  "scraped_at": "2026-01-08T23:40:40.080765",
  "title": "Mailvox: the student exhibits mastery",
  "date_display": "October 22, 2010",
  "date_iso": "2010-10-22T13:15:00+00:00",
  "date_from_url": "2010-10-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A sends in an after-action report of an encounter with a self-styled champion of evolutionary psychology:</p><blockquote><p>Evolutionary Psychology has always been a thorn in my side, and while I agree with the fundamentals of Game, I’ve never thought of it as any proof positive that EP as a whole was viable. I’m admittedly not an expert on the subject — both my degrees are in the field of humanities — so I always find myself drawn to your blog when EP (or any evolutionary field for that matter) is the topic of conversation.</p><p>I typically don’t post to forums, including Vox Popoli, as I see my time quickly get sucked away by the activity, but recently at another forum I found myself compelled to post because I so strongly disagreed with the statements of another poster who is an adamant supporter of both TENS and EP.  When it came to EP, rather than get sucked into an assumptive argument, I took a page out the VP book and just flat-out questioned the science behind evo-psych, including its ability to make measurable predictions, etc. His response managed to simultaneously be laughably predictable and surprising to me. As to my challenges to EP, this is all he could muster:</p><p><i>“I didn’t expect you to be credulous towards my claims, and unfortunately I don’t have carefully compiled case studies to present…Psychology is enormously complex, and it would be unrealistic to expect the sort of definite predictions that can be made of simple systems…this comment of yours is analogous to saying that because a meteorologist’s predictions are only accurate 50% of the time, meteorology is not science. You have a right to such an opinion, but while holding such an opinion, it would be unlikely that you would develop much understanding of the science of meteorology.”</i></p><p>This retreat was of course entirely expected, but the part that threw me for a loop is what he continually fell back on as his defense — a claim that my discourse with him was entirely predicted by him based on evo-psych:</p><p><i>“However, I have discussed the pattern of events occurring in our dialog on this forum in the past, and anyone who paid attention can observe for themselves whether things play out as I’ve described. My response to you was more for the purpose of illustrating the pattern to long time readers here, than for the purpose of persuading you that I’m correct.”</i></p><p>In summation, his attempted defense was that our discourse was not one of simple and genuine disagreement, but rather a challenge for pack dominance. That he could not back up these assumptive claims or his ex post facto prediction seems typical of the dogged defenders of EP.  Previously, I would have engaged in a discussion of the minutiae of social behaviors, but this time I went directly to the foundation of these pet theories and happily watched as he engaged in foolish hand-waving. I just wanted to drop you this email to say thanks to you and the Ilk for providing me with a vital technique for taking guys like this to the woodshed.</p></blockquote><p>I was greatly pleased to be apprised of this fine example of foundational sapping put into action.  While I am often disappointed by the poor quality of argumentation exhibited by commenters on this blog who, despite literal years of examples having been set before them, still a) rely upon emotional rhetoric, b) attempt illegitimate logical shortcuts, c) fail to comprehend the argument they are criticizing, and d) inappropriately apply otherwise effective techniques, so it is a real pleasure to read a correct and competent application of one of my favorite techniques.</p><p>Foundational sapping is extremely effective because it simultaneously attacks both the argument and the individual presenting it without utilizing any unfair <i>ad hominem</i> or committing any other logical fallacies.  And because it is based on the sound principle of MPAI, it is applicable in most circumstances.  Not all, but most.  Very few individuals actually know anywhere nearly as much as they pretend to know, and intelligent, educated people are <i>far</i> more prone to engage in intellectual bluffing than most because a) they have a larger knowledge base from which to bluff, and b) they are often quick enough to latch on to a hint and use it to conceal their lack of relevant knowledge.  But despite their pretensions, they usually provide indications that they don’t have a firm grasp on their subject; in the first quote, for example, note the ungrammatical use of the word “credulous”.  Lofty language used improperly is a strong sign of an intellectual charlatan.</p><p>This is why I constantly stress the importance of <i>asking questions</i> in debate.  (Granted, I don’t do it often in the comments, but that’s because I have set the stage with my post and will usually recognize when a predictable counter-argument is being made.  Most of my questions are intended to confirm that someone is making an expected counter-argument.)  While the conventional Socratic method is less effective than most people seem to imagine, mostly due to its common use of false constructions to which the interlocutor is required to agree, its focus on the use of questions to pin down the interlocutor’s precise position renders it an important part of one’s intellectual arsenal.</p><p>Some readers will have noticed that those who consider themselves to be defenders of “science and reason” not only dislike asking questions, but in some cases even claim they have no need to know, let alone understand, what their interlocutor is saying.  (Look up the borderline retarded Courtier’s Reply, by way of example.)  This is why they either avoid debates or get repeatedly trounced by every half-competent opponent; an unwillingness to understand the argument made by the other side is almost perfectly synonymous with making a commitment to lose the debate.</p><p>Foundational sapping requires not only understanding the argument being made, but more importantly, understanding the basic assumptions that support it.  As A discovered with the would-be champion of evolutionary psychology, very few individuals possess even a rudimentary comprehension of the basic assumptions that provide the foundations of their argument, so the easiest and most reasonable way to defeat the argument as well as incidentally destroy the credibility of the individual presenting it is to ask questions that concern those foundations.  And when the interlocutor rapidly retreats into hand-waving and strange self-laudatory pronouncements, you will know that not only have you won the encounter, but that the interlocutor knows it as well.  As does everyone witnessing it.</p><p>Of course, the converse side of utilizing this method of debate is the awareness of how easily it can be turned against you if you are foolish enough to take untenable positions with the notion of bluffing your way through.  I don’t recommend doing so; the ability to say “I don’t know” is not an admission of weakness or stupidity, but rather an important sign of intellectual integrity and intelligence.  On a tangential note, argumentative bluffers always suspect everyone else is bluffing too; they invariably interpret a failure or refusal to initially provide supporting evidence is certain proof of an inability to do so.  Baiting and trapping this sort of individual is so easy that a child could do it.</p><p>The best thing is that on those rare occasions when you find yourself in a discussion with someone who actually knows what they are talking about, you will usually learn something that is either interesting or useful.  Even if you end up getting your head metaphorically handed to you, the experience will allow you to make more effective arguments in the future.  One should not enter into argumentative discussions with a “win or lose’ mentality, but rather a “win or learn” one.  There is no shame in being bested by someone of superior intelligence or information, the only shame is in the inability to either admit that one has been bested or learn from the experience.</p></div>",
  "content_text": "A sends in an after-action report of an encounter with a self-styled champion of evolutionary psychology:\nEvolutionary Psychology has always been a thorn in my side, and while I agree with the fundamentals of Game, I’ve never thought of it as any proof positive that EP as a whole was viable. I’m admittedly not an expert on the subject — both my degrees are in the field of humanities — so I always find myself drawn to your blog when EP (or any evolutionary field for that matter) is the topic of conversation.\nI typically don’t post to forums, including Vox Popoli, as I see my time quickly get sucked away by the activity, but recently at another forum I found myself compelled to post because I so strongly disagreed with the statements of another poster who is an adamant supporter of both TENS and EP.  When it came to EP, rather than get sucked into an assumptive argument, I took a page out the VP book and just flat-out questioned the science behind evo-psych, including its ability to make measurable predictions, etc. His response managed to simultaneously be laughably predictable and surprising to me. As to my challenges to EP, this is all he could muster:\n“I didn’t expect you to be credulous towards my claims, and unfortunately I don’t have carefully compiled case studies to present…Psychology is enormously complex, and it would be unrealistic to expect the sort of definite predictions that can be made of simple systems…this comment of yours is analogous to saying that because a meteorologist’s predictions are only accurate 50% of the time, meteorology is not science. You have a right to such an opinion, but while holding such an opinion, it would be unlikely that you would develop much understanding of the science of meteorology.”\nThis retreat was of course entirely expected, but the part that threw me for a loop is what he continually fell back on as his defense — a claim that my discourse with him was entirely predicted by him based on evo-psych:\n“However, I have discussed the pattern of events occurring in our dialog on this forum in the past, and anyone who paid attention can observe for themselves whether things play out as I’ve described. My response to you was more for the purpose of illustrating the pattern to long time readers here, than for the purpose of persuading you that I’m correct.”\nIn summation, his attempted defense was that our discourse was not one of simple and genuine disagreement, but rather a challenge for pack dominance. That he could not back up these assumptive claims or his ex post facto prediction seems typical of the dogged defenders of EP.  Previously, I would have engaged in a discussion of the minutiae of social behaviors, but this time I went directly to the foundation of these pet theories and happily watched as he engaged in foolish hand-waving. I just wanted to drop you this email to say thanks to you and the Ilk for providing me with a vital technique for taking guys like this to the woodshed.\nI was greatly pleased to be apprised of this fine example of foundational sapping put into action.  While I am often disappointed by the poor quality of argumentation exhibited by commenters on this blog who, despite literal years of examples having been set before them, still a) rely upon emotional rhetoric, b) attempt illegitimate logical shortcuts, c) fail to comprehend the argument they are criticizing, and d) inappropriately apply otherwise effective techniques, so it is a real pleasure to read a correct and competent application of one of my favorite techniques.\nFoundational sapping is extremely effective because it simultaneously attacks both the argument and the individual presenting it without utilizing any unfair\nad hominem\nor committing any other logical fallacies.  And because it is based on the sound principle of MPAI, it is applicable in most circumstances.  Not all, but most.  Very few individuals actually know anywhere nearly as much as they pretend to know, and intelligent, educated people are\nfar\nmore prone to engage in intellectual bluffing than most because a) they have a larger knowledge base from which to bluff, and b) they are often quick enough to latch on to a hint and use it to conceal their lack of relevant knowledge.  But despite their pretensions, they usually provide indications that they don’t have a firm grasp on their subject; in the first quote, for example, note the ungrammatical use of the word “credulous”.  Lofty language used improperly is a strong sign of an intellectual charlatan.\nThis is why I constantly stress the importance of\nasking questions\nin debate.  (Granted, I don’t do it often in the comments, but that’s because I have set the stage with my post and will usually recognize when a predictable counter-argument is being made.  Most of my questions are intended to confirm that someone is making an expected counter-argument.)  While the conventional Socratic method is less effective than most people seem to imagine, mostly due to its common use of false constructions to which the interlocutor is required to agree, its focus on the use of questions to pin down the interlocutor’s precise position renders it an important part of one’s intellectual arsenal.\nSome readers will have noticed that those who consider themselves to be defenders of “science and reason” not only dislike asking questions, but in some cases even claim they have no need to know, let alone understand, what their interlocutor is saying.  (Look up the borderline retarded Courtier’s Reply, by way of example.)  This is why they either avoid debates or get repeatedly trounced by every half-competent opponent; an unwillingness to understand the argument made by the other side is almost perfectly synonymous with making a commitment to lose the debate.\nFoundational sapping requires not only understanding the argument being made, but more importantly, understanding the basic assumptions that support it.  As A discovered with the would-be champion of evolutionary psychology, very few individuals possess even a rudimentary comprehension of the basic assumptions that provide the foundations of their argument, so the easiest and most reasonable way to defeat the argument as well as incidentally destroy the credibility of the individual presenting it is to ask questions that concern those foundations.  And when the interlocutor rapidly retreats into hand-waving and strange self-laudatory pronouncements, you will know that not only have you won the encounter, but that the interlocutor knows it as well.  As does everyone witnessing it.\nOf course, the converse side of utilizing this method of debate is the awareness of how easily it can be turned against you if you are foolish enough to take untenable positions with the notion of bluffing your way through.  I don’t recommend doing so; the ability to say “I don’t know” is not an admission of weakness or stupidity, but rather an important sign of intellectual integrity and intelligence.  On a tangential note, argumentative bluffers always suspect everyone else is bluffing too; they invariably interpret a failure or refusal to initially provide supporting evidence is certain proof of an inability to do so.  Baiting and trapping this sort of individual is so easy that a child could do it.\nThe best thing is that on those rare occasions when you find yourself in a discussion with someone who actually knows what they are talking about, you will usually learn something that is either interesting or useful.  Even if you end up getting your head metaphorically handed to you, the experience will allow you to make more effective arguments in the future.  One should not enter into argumentative discussions with a “win or lose’ mentality, but rather a “win or learn” one.  There is no shame in being bested by someone of superior intelligence or information, the only shame is in the inability to either admit that one has been bested or learn from the experience.",
  "tags": [
    "mailvox",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-22T12:15:00+00:00"
}