{
  "url": "https://voxday.net/2010/10/16/mailvox-fixing-historical-illiteracy/",
  "scraped_at": "2026-01-08T23:40:01.410866",
  "title": "Mailvox: fixing historical illiteracy",
  "date_display": "October 16, 2010",
  "date_iso": "2010-10-16T17:47:00+00:00",
  "date_from_url": "2010-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>BN inquires on where to start:</p><blockquote><p>I was wondering if you’d be kind enough to suggest a starting point for a person like myself who has become more and more interested in fixing my historical illiteracy problem.  I’m looking for both advice on what to read in terms of a decent survey of world history and also what particular portions of human history are worth diving into and reading up on in finer-grained detail than the survey level.  I’m not even sure where to start because it seems like drinking from a fire hose with all the possible resources out there.  Any advice?</p></blockquote><p>I would start by dividing up world history into sections and deciding where to go from there.  Here is how I tend to think of them.</p><p>Ancients: Greeks, Romans, Egyptians.<br> Medieval: England, Crusades, France, Germany<br> Renaissance: England, Italy, Netherlands<br> Generals: Alexander, Caesar, Genghis Khan, Napoleon<br> Asian: China, Japan, Post-WWII<br> American: Colonial, 19th Century, Civil War, 20th Century</br></br></br></br></br></p><p>While one could argue in favor of the Khmer kings or the Mayan empire, if you are up on those six general topics, you will at least be much more historically literate than nearly anyone you will encounter in casual conversation.  For a brief overview, I would start with something like <i>The Columbia History of the World</i>.  Then pick whatever topic looks most interesting at the moment and select two books/series for each of the subsections that I listed above, one historical and one original.</p><p>For example, if you picked Ancients, an excellent start would be Plutarch’s Lives, which pairs the lives of famous Greeks with famouse Romans.  Then, for an original document, I would suggest reading Caesar’s Commentaries on the Conquest of Gaul and the Civil Wars.  More to come….</p></div>",
  "content_text": "BN inquires on where to start:\nI was wondering if you’d be kind enough to suggest a starting point for a person like myself who has become more and more interested in fixing my historical illiteracy problem.  I’m looking for both advice on what to read in terms of a decent survey of world history and also what particular portions of human history are worth diving into and reading up on in finer-grained detail than the survey level.  I’m not even sure where to start because it seems like drinking from a fire hose with all the possible resources out there.  Any advice?\nI would start by dividing up world history into sections and deciding where to go from there.  Here is how I tend to think of them.\nAncients: Greeks, Romans, Egyptians.\nMedieval: England, Crusades, France, Germany\nRenaissance: England, Italy, Netherlands\nGenerals: Alexander, Caesar, Genghis Khan, Napoleon\nAsian: China, Japan, Post-WWII\nAmerican: Colonial, 19th Century, Civil War, 20th Century\nWhile one could argue in favor of the Khmer kings or the Mayan empire, if you are up on those six general topics, you will at least be much more historically literate than nearly anyone you will encounter in casual conversation.  For a brief overview, I would start with something like\nThe Columbia History of the World\n.  Then pick whatever topic looks most interesting at the moment and select two books/series for each of the subsections that I listed above, one historical and one original.\nFor example, if you picked Ancients, an excellent start would be Plutarch’s Lives, which pairs the lives of famous Greeks with famouse Romans.  Then, for an original document, I would suggest reading Caesar’s Commentaries on the Conquest of Gaul and the Civil Wars.  More to come….",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-16T16:47:00+00:00"
}