{
  "url": "https://voxday.net/2010/10/30/mailvox-jesus-and-war/",
  "scraped_at": "2026-01-08T23:41:22.692498",
  "title": "Mailvox: Jesus and war",
  "date_display": "October 30, 2010",
  "date_iso": "2010-10-30T15:06:00+00:00",
  "date_from_url": "2010-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>LJ has his doubts:</p><blockquote><p>Read your bit on Jesus and war.  It is hard to believe Jesus would support all the death that War brings to innocent children. What would he say about our inability to put money into education for the poor. You are fooling yourself.</p></blockquote><p>I’m always a little taken aback when people begin with a reasonable, if mistaken, point, and then go on to make asses of themselves by making baseless declarative statements about me.  How am I fooling myself?  And with regards to what?  While everyone is certainly welcome to disagree with me, you have to either know nothing about me or be almost completely unfamiliar with this blog to believe that my opinions are formed on the same basis of that amorphous collection of vaguely remembered elementary school classes, parental biases, college lectures, personal insecurities, peer pressures, and emotional reactions that go into forming most people’s opinions.</p><p>Now, as to the subject in question, Jesus doesn’t speak much on war, but it is clear that he doesn’t regard it as the be-all and end-all of evil that most people today seem to consider it, except when the media and the White House have whipped them up into a frenzy of support for another round of long-distance bombing.</p><p>First, God Himself wages war against men. <i>“You fear the sword, and the sword is what I will bring against you, declares the Sovereign LORD.”</i> – Ezekiel 11:8.</p><p>Second, Jesus did not come to bring peace. <i>“Do not suppose that I have come to bring peace to the earth. I did not come to bring peace, but a sword.”</i> – Matthew 10:33</p><p>Third, Jesus intends to make serious war upon mankind in the future. <i>“I saw heaven standing open and there before me was a white horse, whose rider is called Faithful and True. With justice he judges and makes war. His eyes are like blazing fire, and on his head are many crowns. He has a name written on him that no one knows but he himself. He is dressed in a robe dipped in blood, and his name is the Word of God. The armies of heaven were following him, riding on white horses and dressed in fine linen, white and clean. Out of his mouth comes a sharp sword with which to strike down the nations. “He will rule them with an iron scepter.”  He treads the winepress of the fury of the wrath of God Almighty. On his robe and on his thigh he has this name written: KING OF KINGS AND LORD OF LORDS.”</i> – Revelation 19:11</p><p>Fourth, I’ve never seen any evidence that Jesus cares particularly about education, either for the poor or anyone else, to say nothing of any moral duty to pay for the education of poor children.</p><p>In conclusion, it would appear that LJ doesn’t know the Bible nor the first thing about what Jesus would say about anything.  The efforts of the New Atheists notwithstanding, spouting an opinion in complete ignorance is unlikely to convince anyone of anything.</p></div>",
  "content_text": "LJ has his doubts:\nRead your bit on Jesus and war.  It is hard to believe Jesus would support all the death that War brings to innocent children. What would he say about our inability to put money into education for the poor. You are fooling yourself.\nI’m always a little taken aback when people begin with a reasonable, if mistaken, point, and then go on to make asses of themselves by making baseless declarative statements about me.  How am I fooling myself?  And with regards to what?  While everyone is certainly welcome to disagree with me, you have to either know nothing about me or be almost completely unfamiliar with this blog to believe that my opinions are formed on the same basis of that amorphous collection of vaguely remembered elementary school classes, parental biases, college lectures, personal insecurities, peer pressures, and emotional reactions that go into forming most people’s opinions.\nNow, as to the subject in question, Jesus doesn’t speak much on war, but it is clear that he doesn’t regard it as the be-all and end-all of evil that most people today seem to consider it, except when the media and the White House have whipped them up into a frenzy of support for another round of long-distance bombing.\nFirst, God Himself wages war against men.\n“You fear the sword, and the sword is what I will bring against you, declares the Sovereign LORD.”\n– Ezekiel 11:8.\nSecond, Jesus did not come to bring peace.\n“Do not suppose that I have come to bring peace to the earth. I did not come to bring peace, but a sword.”\n– Matthew 10:33\nThird, Jesus intends to make serious war upon mankind in the future.\n“I saw heaven standing open and there before me was a white horse, whose rider is called Faithful and True. With justice he judges and makes war. His eyes are like blazing fire, and on his head are many crowns. He has a name written on him that no one knows but he himself. He is dressed in a robe dipped in blood, and his name is the Word of God. The armies of heaven were following him, riding on white horses and dressed in fine linen, white and clean. Out of his mouth comes a sharp sword with which to strike down the nations. “He will rule them with an iron scepter.”  He treads the winepress of the fury of the wrath of God Almighty. On his robe and on his thigh he has this name written: KING OF KINGS AND LORD OF LORDS.”\n– Revelation 19:11\nFourth, I’ve never seen any evidence that Jesus cares particularly about education, either for the poor or anyone else, to say nothing of any moral duty to pay for the education of poor children.\nIn conclusion, it would appear that LJ doesn’t know the Bible nor the first thing about what Jesus would say about anything.  The efforts of the New Atheists notwithstanding, spouting an opinion in complete ignorance is unlikely to convince anyone of anything.",
  "tags": [
    "Christianity",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-30T14:06:00+00:00"
}