{
  "url": "https://voxday.net/2010/10/15/mailvox-in-which-solution-is-proposed/",
  "scraped_at": "2026-01-08T23:39:59.570320",
  "title": "Mailvox: In which a solution is proposed",
  "date_display": "October 15, 2010",
  "date_iso": "2010-10-15T15:48:00+00:00",
  "date_from_url": "2010-10-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The prophetic tale of the Great Home Distribution:</p><p>“The house next door has stood empty for four months now, ever since our neighbors were foreclosed on and evicted. The bank isn’t even <i>trying </i>to sell it. Instead, a week or<br> two ago they sent over a crew to blow out the waterlines, fill ’em with antifreeze, and basically winterize the place, as you would do if you had a cabin in the deep north woods and were planning to close it up for the winter.</br></p><p>The kicker: the bank involved is one of those “evil” banks that’s currently in the news for possible mortgage fraud.</p><p>So here is my question for you: how soon do you think it will be before the fed.gov starts <i>seizing </i>such houses (since the title trails are hopelessly f*cked-up anyway), declaring them Affordable Housing, and redistributing them to the Deserving Poor?</p><p>After all, it’s worked so well in Zimbabwe and Venezuela. If you can seize the property of wealthy landowners and redistribute it to the peasants, you can count on the loyal support of the peasants in the next election — or riot.</p><p>Can’t you just see The Chosen One and his teleprompter up there on the podium? Thundering, “If we lose this election, the Republicans will take away <i>your </i>home!”   (Because after all, once the gov’t has given it to you, it’s yours, right? Even if you didn’t work for it, don’t deserve it, and they had to steal it from someone else to give it to you?)</p><p>Interesting times, indeed.  Figure the first couple such houses will go, with great fanfare, to the widows and families of Iraq and Afghan war casualties, or to a few wheelchair-bound disabled vets themselves. After all, who could object to giving extravagant gov largesse to widows, orphans, and cripples?</p><p>Then, once it becomes old news, the Great Redistribution begins…”</p></div>",
  "content_text": "The prophetic tale of the Great Home Distribution:\n“The house next door has stood empty for four months now, ever since our neighbors were foreclosed on and evicted. The bank isn’t even\ntrying\nto sell it. Instead, a week or\ntwo ago they sent over a crew to blow out the waterlines, fill ’em with antifreeze, and basically winterize the place, as you would do if you had a cabin in the deep north woods and were planning to close it up for the winter.\nThe kicker: the bank involved is one of those “evil” banks that’s currently in the news for possible mortgage fraud.\nSo here is my question for you: how soon do you think it will be before the fed.gov starts\nseizing\nsuch houses (since the title trails are hopelessly f*cked-up anyway), declaring them Affordable Housing, and redistributing them to the Deserving Poor?\nAfter all, it’s worked so well in Zimbabwe and Venezuela. If you can seize the property of wealthy landowners and redistribute it to the peasants, you can count on the loyal support of the peasants in the next election — or riot.\nCan’t you just see The Chosen One and his teleprompter up there on the podium? Thundering, “If we lose this election, the Republicans will take away\nyour\nhome!”   (Because after all, once the gov’t has given it to you, it’s yours, right? Even if you didn’t work for it, don’t deserve it, and they had to steal it from someone else to give it to you?)\nInteresting times, indeed.  Figure the first couple such houses will go, with great fanfare, to the widows and families of Iraq and Afghan war casualties, or to a few wheelchair-bound disabled vets themselves. After all, who could object to giving extravagant gov largesse to widows, orphans, and cripples?\nThen, once it becomes old news, the Great Redistribution begins…”",
  "tags": [
    "banks",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-15T14:48:00+00:00"
}