{
  "url": "https://voxday.net/2010/10/01/mailvox-atheist-on-religion-survey/",
  "scraped_at": "2026-01-08T23:38:41.699491",
  "title": "Mailvox: an atheist on the religion survey",
  "date_display": "October 1, 2010",
  "date_iso": "2010-10-01T14:15:00+00:00",
  "date_from_url": "2010-10-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>S contemplates the Pew quiz:</p><blockquote><p>I read with considerable interest your post earlier today about the Pew religious knowledge quiz. I took the test and was surprised to discover that even though I’m an atheist (and am apparently rather unusual in professing that I don’t really hate religion and have no particular desire to destroy the concept of God), I scored 73%. So, not great, but not bad either. By way of background, I’ve got an undergraduate degree in Maths and Economics, and a Master’s in financial Mathematics. I seemed to do pretty well compared to both believers and non-believers from all backgrounds.</p><p>The reason I write today about this is that I just finished watching Bill Maher “debating” Bill O’Reilly on the Factor tonight after taking that quiz and was appalled by the immaturity and folly of a supposedly “enlightened” atheist. Now I’m not a big fan of O’Reilly’s, but I was stunned to see just how utterly ignorant a militant atheist like Bill Maher is about Christianity, which he apparently hates with a vengeance. He seems to think that the Bible is the literal word of God, when even an atheist like me understands that this is not the way the Bible is written, nor is it the way the Bible is canonically interpreted. He thinks that Christian scripture and law is derived from the Old Testament- he quoted from Deuteronomy stating the Mosaic law that he who breaks the Sabbath shall be killed, even though the actual quote is from Exodus, and Maher quoted it out of context. He seems to believe that Christianity and science are incompatible, but I’ve accepted for a long time now that the Enlightenment simply could not have happened without Judeo-Christian tradition, law, and science.</p><p>Vox, I doubt you and I will ever agree about the existence or nature of God. However, I find myself strongly agreeing with you about these pinheads (to coin a phrase) who call themselves atheists but who are little more than “social autists” with little understanding of what they criticise. And even where we inevitably disagree, I suspect that our disagreements will generally be far more genial and fair-minded than anything that atheists like Bill Maher are capable of. Thanks for the great writing; I certainly look forward to reading a lot more of it to come.</p></blockquote><p>S understands, in a way that many do not, that I have absolutely no problem with atheists qua atheists.  I was, after all, agnostic for a long time and I still find myself generally more comfortable in secular intellectual culture than in American evangelical culture.  For example, if you peruse my reading list for 2010, you will look in vain for the religious self-help books and rehashed theological fiction that make up the vast majority of CBA publishing today.  I’d much rather kick back in the Comfy Chair and read Balzac or Procopius than anything that is likely to appear in a Northwestern Bookstore.</p><p>The fact is that I neither despise nor pity those who don’t believe in God.  My opinion about them is similar to what it would be of those who don’t believe in gravity because they cannot see it.  (See the actual force, not its effects.)  Because the effects of rejecting God are both clearly delineated and observable, I simply find it a little strange that some people cannot see those effects and on that basis deny the existence of the causal factor.  But that doesn’t bother or upset me, it merely causes me to mentally shrug my shoulders and think, “well, good luck with that”.</p><p>On the other hand, having a very small degree of orange-green color blindness, I can completely understand the bewildered feeling of an individual who simply does not see the big orange letter on the green background to which another individual is pointing, wondering what on Earth he could possibly be seeing.</p><p>The atheists with whom I do have a problem, and for whom I regularly demonstrate a great deal of contempt, are the liars, the cheats, the deceivers, and the malicious.  If one genuinely believes that religion is a crutch for the weak and psychologically needed, what does it say about those who are so eager to kick that crutch out from under those who clearly need its support?  And, as an armchair intellectual, I find their willful ignorance of history, religion, and philosophy to be as astonishing as it is irksome.  Intelligent?  I don’t even consider them to be <i>educated</i>.  To claim that religion either causes war or is an important strategic element of war is to be <i>every bit as ignorant</i> as the apocryphal Flat Earth proponents so often cited; the significant difference being that the Religion Causes War Society not only exists but is even willing to expound their ludicrous and historically illiterate arguments in public.</p><p>Anyhow, I very much welcome atheists of S’s stripe here.  I don’t expect <i>anyone</i> to agree with me all the time about anything; my best and oldest friend has made a habit of playing Devil’s Advocate in our conversations for more than three decades.  The reason I value the questions and the doubts of intelligent atheists who are more interested in rational debate than in exhibiting their psychological issues is because they help keep the Christians and other theists from lapsing into intellectual sloth and thereby prevent this blog from devolving into the sort of circle jerk that has rendered the New Atheism so toothless.</p><p>But speaking of the quiz, it is worth pointing out, as Bethyada noted yesterday, that the Pew Forum ignored its own definitions of “atheist” and “agnostic” in reporting the results.  Whereas self-identified atheists and agnostics scored 20.9, the Pew Forum defined an atheist as “someone who does not believe in God” and an agnostic as “someone who is unsure that God exists”.  Therefore, the “nothing in particular” crowd should have been included in the “atheists and agnostics” group – supporting the case made in TIA, these Low Church Atheists outnumber the self-identified High Church ones by a factor of 4.5 – which reduces the atheist and agnostic score to 17.4, <i>below that of white evangelicals</i> at 17.6.</p></div>",
  "content_text": "S contemplates the Pew quiz:\nI read with considerable interest your post earlier today about the Pew religious knowledge quiz. I took the test and was surprised to discover that even though I’m an atheist (and am apparently rather unusual in professing that I don’t really hate religion and have no particular desire to destroy the concept of God), I scored 73%. So, not great, but not bad either. By way of background, I’ve got an undergraduate degree in Maths and Economics, and a Master’s in financial Mathematics. I seemed to do pretty well compared to both believers and non-believers from all backgrounds.\nThe reason I write today about this is that I just finished watching Bill Maher “debating” Bill O’Reilly on the Factor tonight after taking that quiz and was appalled by the immaturity and folly of a supposedly “enlightened” atheist. Now I’m not a big fan of O’Reilly’s, but I was stunned to see just how utterly ignorant a militant atheist like Bill Maher is about Christianity, which he apparently hates with a vengeance. He seems to think that the Bible is the literal word of God, when even an atheist like me understands that this is not the way the Bible is written, nor is it the way the Bible is canonically interpreted. He thinks that Christian scripture and law is derived from the Old Testament- he quoted from Deuteronomy stating the Mosaic law that he who breaks the Sabbath shall be killed, even though the actual quote is from Exodus, and Maher quoted it out of context. He seems to believe that Christianity and science are incompatible, but I’ve accepted for a long time now that the Enlightenment simply could not have happened without Judeo-Christian tradition, law, and science.\nVox, I doubt you and I will ever agree about the existence or nature of God. However, I find myself strongly agreeing with you about these pinheads (to coin a phrase) who call themselves atheists but who are little more than “social autists” with little understanding of what they criticise. And even where we inevitably disagree, I suspect that our disagreements will generally be far more genial and fair-minded than anything that atheists like Bill Maher are capable of. Thanks for the great writing; I certainly look forward to reading a lot more of it to come.\nS understands, in a way that many do not, that I have absolutely no problem with atheists qua atheists.  I was, after all, agnostic for a long time and I still find myself generally more comfortable in secular intellectual culture than in American evangelical culture.  For example, if you peruse my reading list for 2010, you will look in vain for the religious self-help books and rehashed theological fiction that make up the vast majority of CBA publishing today.  I’d much rather kick back in the Comfy Chair and read Balzac or Procopius than anything that is likely to appear in a Northwestern Bookstore.\nThe fact is that I neither despise nor pity those who don’t believe in God.  My opinion about them is similar to what it would be of those who don’t believe in gravity because they cannot see it.  (See the actual force, not its effects.)  Because the effects of rejecting God are both clearly delineated and observable, I simply find it a little strange that some people cannot see those effects and on that basis deny the existence of the causal factor.  But that doesn’t bother or upset me, it merely causes me to mentally shrug my shoulders and think, “well, good luck with that”.\nOn the other hand, having a very small degree of orange-green color blindness, I can completely understand the bewildered feeling of an individual who simply does not see the big orange letter on the green background to which another individual is pointing, wondering what on Earth he could possibly be seeing.\nThe atheists with whom I do have a problem, and for whom I regularly demonstrate a great deal of contempt, are the liars, the cheats, the deceivers, and the malicious.  If one genuinely believes that religion is a crutch for the weak and psychologically needed, what does it say about those who are so eager to kick that crutch out from under those who clearly need its support?  And, as an armchair intellectual, I find their willful ignorance of history, religion, and philosophy to be as astonishing as it is irksome.  Intelligent?  I don’t even consider them to be\neducated\n.  To claim that religion either causes war or is an important strategic element of war is to be\nevery bit as ignorant\nas the apocryphal Flat Earth proponents so often cited; the significant difference being that the Religion Causes War Society not only exists but is even willing to expound their ludicrous and historically illiterate arguments in public.\nAnyhow, I very much welcome atheists of S’s stripe here.  I don’t expect\nanyone\nto agree with me all the time about anything; my best and oldest friend has made a habit of playing Devil’s Advocate in our conversations for more than three decades.  The reason I value the questions and the doubts of intelligent atheists who are more interested in rational debate than in exhibiting their psychological issues is because they help keep the Christians and other theists from lapsing into intellectual sloth and thereby prevent this blog from devolving into the sort of circle jerk that has rendered the New Atheism so toothless.\nBut speaking of the quiz, it is worth pointing out, as Bethyada noted yesterday, that the Pew Forum ignored its own definitions of “atheist” and “agnostic” in reporting the results.  Whereas self-identified atheists and agnostics scored 20.9, the Pew Forum defined an atheist as “someone who does not believe in God” and an agnostic as “someone who is unsure that God exists”.  Therefore, the “nothing in particular” crowd should have been included in the “atheists and agnostics” group – supporting the case made in TIA, these Low Church Atheists outnumber the self-identified High Church ones by a factor of 4.5 – which reduces the atheist and agnostic score to 17.4,\nbelow that of white evangelicals\nat 17.6.",
  "tags": [
    "atheism",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-01T13:15:00+00:00"
}