{
  "url": "https://voxday.net/2010/10/09/mailvox-homeschool-or-die-2/",
  "scraped_at": "2026-01-08T23:39:25.662626",
  "title": "Mailvox: homeschool or die!",
  "date_display": "October 9, 2010",
  "date_iso": "2010-10-09T18:29:00+00:00",
  "date_from_url": "2010-10-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yet another example.  Which makes one wonder: what good is that all-important socialization <a href=\"http://news.yahoo.com/s/ap/20101008/ap_on_re_us/us_bullying_one_town\">to a corpse</a>?</p><blockquote><p>It was the fourth time in little more than two years that a bullied high school student in this small Cleveland suburb on Lake Erie died by his or her own hand — three suicides, one overdose of antidepressants. One was bullied for being gay, another for having a learning disability, another for being a boy who happened to like wearing pink.</p></blockquote><p>The emailer who sent me this article wondered where the parents were. <i>“How come they never have the parents of the bullies on the news? After all, what kind of kid walks around knocking books out people’s hands and calling them faggot? What kind of kid’s take pleasure in doing these kinds of cruel things to people? They weren’t provoked after all. I mean, I know from experience that the kid with the stuffed toy was just asking to get picked on, but I can’t imagine going out of my way every day to make someone else miserable.”</i></p><p>I don’t think it’s profitable thinking about the parents of the bullies.  They may be unintelligent, unreflective bullies themselves, or more likely, they either a) have no absolutely idea what their children are doing to other children, b) they are in denial, or c) they’re total idiots who believe their little cretins are permitted everything.  I actually had a run-in with the latter some months ago; the morons actually believed that their little thug-in-training shouldn’t even be <i>threatened</i> with being hit back after he, unprovoked, <i>hit another kid in the face with a hockey stick</i>.  Needless to say, the little thug is going to be wondering what the hell happened the first time he runs into someone who doesn’t give a damn that his parents have declared him off-limits to playground justice.</p><p>My question is where the parents of the bullied children are.  Protecting one’s children is a parent’s paramount duty.  If one’s child is genuinely being seriously bullied to the point of personal danger, first train the child to defend himself by massively violent overreaction.  Chances are very high that he’d be never be directly bothered again.</p><p>But in the unlikely event that fails, then the adult must directly confront the bullies and let them know in no uncertain terms that one will cheerfully spend the rest of one’s life in jail for multiple charges of homicide and desecration of a human corpse rather than permit one’s child to come to harm.  And if spending a few days in jail on an assault and battery charge is necessary to send the message in a manner that it is received, then so be it.  If your kid knows one thing, just one solitary thing, he should know that you have his back.  No matter what.</p></div>",
  "content_text": "Yet another example.  Which makes one wonder: what good is that all-important socialization\nto a corpse\n?\nIt was the fourth time in little more than two years that a bullied high school student in this small Cleveland suburb on Lake Erie died by his or her own hand — three suicides, one overdose of antidepressants. One was bullied for being gay, another for having a learning disability, another for being a boy who happened to like wearing pink.\nThe emailer who sent me this article wondered where the parents were.\n“How come they never have the parents of the bullies on the news? After all, what kind of kid walks around knocking books out people’s hands and calling them faggot? What kind of kid’s take pleasure in doing these kinds of cruel things to people? They weren’t provoked after all. I mean, I know from experience that the kid with the stuffed toy was just asking to get picked on, but I can’t imagine going out of my way every day to make someone else miserable.”\nI don’t think it’s profitable thinking about the parents of the bullies.  They may be unintelligent, unreflective bullies themselves, or more likely, they either a) have no absolutely idea what their children are doing to other children, b) they are in denial, or c) they’re total idiots who believe their little cretins are permitted everything.  I actually had a run-in with the latter some months ago; the morons actually believed that their little thug-in-training shouldn’t even be\nthreatened\nwith being hit back after he, unprovoked,\nhit another kid in the face with a hockey stick\n.  Needless to say, the little thug is going to be wondering what the hell happened the first time he runs into someone who doesn’t give a damn that his parents have declared him off-limits to playground justice.\nMy question is where the parents of the bullied children are.  Protecting one’s children is a parent’s paramount duty.  If one’s child is genuinely being seriously bullied to the point of personal danger, first train the child to defend himself by massively violent overreaction.  Chances are very high that he’d be never be directly bothered again.\nBut in the unlikely event that fails, then the adult must directly confront the bullies and let them know in no uncertain terms that one will cheerfully spend the rest of one’s life in jail for multiple charges of homicide and desecration of a human corpse rather than permit one’s child to come to harm.  And if spending a few days in jail on an assault and battery charge is necessary to send the message in a manner that it is received, then so be it.  If your kid knows one thing, just one solitary thing, he should know that you have his back.  No matter what.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-09T17:29:00+00:00"
}