{
  "url": "https://voxday.net/2010/10/12/mailvox-global-consequences-of/",
  "scraped_at": "2026-01-08T23:39:36.632648",
  "title": "Mailvox:  the global consequences of Ricardianism",
  "date_display": "October 12, 2010",
  "date_iso": "2010-10-12T10:37:00+00:00",
  "date_from_url": "2010-10-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>S asks a follow-up question of his own:</p><blockquote><p>Thank you for taking the time <a href=\"http://www.milobookclub.com/2010/09/14/mailvox-praxeology-and-free-trade/\">to answer my questions</a> regarding the Ricardian doctrine of free trade from an Austrian perspective last week, and for answering <a href=\"http://www.milobookclub.com/2010/09/16/mailvox-defending-free-trade/\">EJ’s follow-up</a> as well. I do have an additional question to ask on this subject. I agree with you about the problems with the “Ricardian Vice” of freezing all but a few variables in place and then coming to conclusions on the assumption of ceteris paribus. I agree that the doctrine of free trade does not take into account temporal limits on the acting man’s preferences. And I agree that these two problems combined reveal that the logical foundation of free trade is more than a little unstable. The question remains: what can be done about it?</p><p>I ask because on most questions about economics, applied praxeology dictates that government attempts to “manage” the economy or allocate resources will lead to inefficient outcomes. Why, then, should the same not apply to trade economics? How is the government to know exactly which industries should be slapped with tariffs and which industries should be left alone? Since Hayek proved that no single individual or government entity can ever have enough information to know everything about the economy at any given time, what then is the “correct” Austrian conclusion regarding trade tariffs?</p></blockquote><p>The first thing to point out is that government-imposed trade restrictions are not synonymous with either “managing the economy” or “allocating resources.  For example, a uniform 15% tariff on all imports doesn’t do anything except to provide a competitive advantage to all domestic producers.  It doesn’t favor one sector over another, except to the extent that one sector is more dependent upon foreign inputs than another, and it doesn’t involve any government management or allocation of resources at all.</p><p>Applying the correct Misean-derived logic regarding the impossibility of socialist calculation, (Hayek only refined the concept first conceived by Ludwig von Mises), we can conclude that government cannot and should not be involved in making decisions regarding which domestic industries should be protected from foreign competition and which should be abandoned to it.  However, it is a complete failure of logic to conclude on this basis that domestic industries should not be protected from foreign competition because the impossibility of calculation does not go so far as to preclude a government’s ability to distinguish between foreign and domestic production, let alone a foreigner and a citizen.  And to deny that a national government can justly prefer the well-being of its domestic producers and citizens to that of foreign producers and non-citizens is no different than denying a national government’s right, (to say nothing of its <i>responsibility</i>), to defend its borders against military invasion.</p><p>It is, of course, no accident that the Ricardian supporters of free trade usually refuse to recognize either the USA’s right to defend its borders from foreign migration or the right of foreign nations to defend their borders from US military attacks.  After all, what is the substantive difference between an “invasion” by a sufficient number of foreign soldiers to impose a new government by force and the “immigration” of a sufficient number of foreign civilians to impose a new government by their voting preferences?  What is the logical rationale for resisting one and accepting the other?</p><p>There is strong empirical and logical support for a uniform protection of domestic industry; the fact that the Ricardian crowd has been reliably dishonest about the historical effects of the Smoot-Hawley tariff, the positive effects of tariffs during the 19th century, and the probable effects of free trade agreements like NAFTA should give serious pause to those who, like me, have tended to assume that free trade was an unmitigated societal positive without stopping to seriously consider all of the logical consequences.</p><p>If you stop and carefully think through the matter, it eventually becomes obvious that unfettered globalism is both the underlying conceptual foundation as well as the ultimate consequence of Ricardian free trade.  To accept the concept of free trade and its necessary consequences such as open immigration and universal citizenship, it is therefore necessary to reject the U.S. Constitution and the idea of limited government as well as everything that history has taught us about cultural, ethnic, national, and religious differences.</p><p>Ricardianism is a doctrine no less utopian, and no less ultimately destructive to society, than Marxist scientific socialism, feminist equalitarianism, and the pseudo-scientific New Atheism.  Note that its primary justification of collective enrichment at the expense of certain individuals is virtually identical to the Marxist justification of socialist distribution and is one of the many theoretical connections between Marx and Ricardo.  This will be a hard lesson for many conservatives and libertarians to accept, as the idea that the doctrine of free trade is ultimately and inevitably anti-liberty is somewhat counter-intuitive.  But the verdict of the logic is inescapable.</p></div>",
  "content_text": "S asks a follow-up question of his own:\nThank you for taking the time\nto answer my questions\nregarding the Ricardian doctrine of free trade from an Austrian perspective last week, and for answering\nEJ’s follow-up\nas well. I do have an additional question to ask on this subject. I agree with you about the problems with the “Ricardian Vice” of freezing all but a few variables in place and then coming to conclusions on the assumption of ceteris paribus. I agree that the doctrine of free trade does not take into account temporal limits on the acting man’s preferences. And I agree that these two problems combined reveal that the logical foundation of free trade is more than a little unstable. The question remains: what can be done about it?\nI ask because on most questions about economics, applied praxeology dictates that government attempts to “manage” the economy or allocate resources will lead to inefficient outcomes. Why, then, should the same not apply to trade economics? How is the government to know exactly which industries should be slapped with tariffs and which industries should be left alone? Since Hayek proved that no single individual or government entity can ever have enough information to know everything about the economy at any given time, what then is the “correct” Austrian conclusion regarding trade tariffs?\nThe first thing to point out is that government-imposed trade restrictions are not synonymous with either “managing the economy” or “allocating resources.  For example, a uniform 15% tariff on all imports doesn’t do anything except to provide a competitive advantage to all domestic producers.  It doesn’t favor one sector over another, except to the extent that one sector is more dependent upon foreign inputs than another, and it doesn’t involve any government management or allocation of resources at all.\nApplying the correct Misean-derived logic regarding the impossibility of socialist calculation, (Hayek only refined the concept first conceived by Ludwig von Mises), we can conclude that government cannot and should not be involved in making decisions regarding which domestic industries should be protected from foreign competition and which should be abandoned to it.  However, it is a complete failure of logic to conclude on this basis that domestic industries should not be protected from foreign competition because the impossibility of calculation does not go so far as to preclude a government’s ability to distinguish between foreign and domestic production, let alone a foreigner and a citizen.  And to deny that a national government can justly prefer the well-being of its domestic producers and citizens to that of foreign producers and non-citizens is no different than denying a national government’s right, (to say nothing of its\nresponsibility\n), to defend its borders against military invasion.\nIt is, of course, no accident that the Ricardian supporters of free trade usually refuse to recognize either the USA’s right to defend its borders from foreign migration or the right of foreign nations to defend their borders from US military attacks.  After all, what is the substantive difference between an “invasion” by a sufficient number of foreign soldiers to impose a new government by force and the “immigration” of a sufficient number of foreign civilians to impose a new government by their voting preferences?  What is the logical rationale for resisting one and accepting the other?\nThere is strong empirical and logical support for a uniform protection of domestic industry; the fact that the Ricardian crowd has been reliably dishonest about the historical effects of the Smoot-Hawley tariff, the positive effects of tariffs during the 19th century, and the probable effects of free trade agreements like NAFTA should give serious pause to those who, like me, have tended to assume that free trade was an unmitigated societal positive without stopping to seriously consider all of the logical consequences.\nIf you stop and carefully think through the matter, it eventually becomes obvious that unfettered globalism is both the underlying conceptual foundation as well as the ultimate consequence of Ricardian free trade.  To accept the concept of free trade and its necessary consequences such as open immigration and universal citizenship, it is therefore necessary to reject the U.S. Constitution and the idea of limited government as well as everything that history has taught us about cultural, ethnic, national, and religious differences.\nRicardianism is a doctrine no less utopian, and no less ultimately destructive to society, than Marxist scientific socialism, feminist equalitarianism, and the pseudo-scientific New Atheism.  Note that its primary justification of collective enrichment at the expense of certain individuals is virtually identical to the Marxist justification of socialist distribution and is one of the many theoretical connections between Marx and Ricardo.  This will be a hard lesson for many conservatives and libertarians to accept, as the idea that the doctrine of free trade is ultimately and inevitably anti-liberty is somewhat counter-intuitive.  But the verdict of the logic is inescapable.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-12T09:37:00+00:00"
}