{
  "url": "https://voxday.net/2010/10/20/mailvox-first-they-came-for-defaulters/",
  "scraped_at": "2026-01-08T23:40:29.083395",
  "title": "Mailvox: first they came for the defaulters",
  "date_display": "October 20, 2010",
  "date_iso": "2010-10-20T20:15:00+00:00",
  "date_from_url": "2010-10-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No doubt it’s very satisfying to pontificate about the sanctity of contracts and the moral importance of paying one’s debts when considering the weighty question of whether mortgage bank fraud is outweighs the pecuniary sin of a defaulting homeowner in borrowing more money than they could reasonably afford.  They didn’t make the payments, they should lose the house to <i>somebody</i>, right?  What does any of this have to do with you?  After all, you have always made all of the necessary payments on your mortgage because you are a fine, morally upstanding, and responsible debtor.</p><p>Of course, you may look at the matter just a little differently once you discover that not owing money to a bank doesn’t prevent it from home seizing and selling your home.  R sent the following email:</p><blockquote><p>Tonight, my girlfriend comes home to her house in Honolulu Hawaii only to find a foreclosure notice and public auction notice on November 19th, at the First District Court of Honolulu Hawaii.</p><p>Only problem is that Bank of America posted the notice.  And her mortgage is with Wells-Fargo Bank.</p><p>And she’s never been served notice at all.  Neither has her attorney.</p><p>But her home is going up for sale on the 19th of November.. just like that.  Perhaps this fraud needs to be known more, just before election day on November 2nd, 2010, because I really believe that most Americans do NOT know what is going on.</p></blockquote><p>Of course, this can’t possibly happen to <i>you</i>.  Surely this guy’s girlfriend has somehow done something to justify having her home put up for auction.  She’s probably late on her payments to Wells Fargo or perhaps Wells Fargo sold the mortgage to Bank of America and she should have been paying them.  Or maybe Hawaii still has some crazy property laws left over from the reign of Queen Liliuokalani.  Because everyone knows <i>they can’t do that</i>, and anyhow, your bank is a really good bank, they aren’t like the evil giant banks, and they were so nice and helpful when that last little detail came up before closing.  So obviously nothing like this could ever happen to you….</p></div>",
  "content_text": "No doubt it’s very satisfying to pontificate about the sanctity of contracts and the moral importance of paying one’s debts when considering the weighty question of whether mortgage bank fraud is outweighs the pecuniary sin of a defaulting homeowner in borrowing more money than they could reasonably afford.  They didn’t make the payments, they should lose the house to\nsomebody\n, right?  What does any of this have to do with you?  After all, you have always made all of the necessary payments on your mortgage because you are a fine, morally upstanding, and responsible debtor.\nOf course, you may look at the matter just a little differently once you discover that not owing money to a bank doesn’t prevent it from home seizing and selling your home.  R sent the following email:\nTonight, my girlfriend comes home to her house in Honolulu Hawaii only to find a foreclosure notice and public auction notice on November 19th, at the First District Court of Honolulu Hawaii.\nOnly problem is that Bank of America posted the notice.  And her mortgage is with Wells-Fargo Bank.\nAnd she’s never been served notice at all.  Neither has her attorney.\nBut her home is going up for sale on the 19th of November.. just like that.  Perhaps this fraud needs to be known more, just before election day on November 2nd, 2010, because I really believe that most Americans do NOT know what is going on.\nOf course, this can’t possibly happen to\nyou\n.  Surely this guy’s girlfriend has somehow done something to justify having her home put up for auction.  She’s probably late on her payments to Wells Fargo or perhaps Wells Fargo sold the mortgage to Bank of America and she should have been paying them.  Or maybe Hawaii still has some crazy property laws left over from the reign of Queen Liliuokalani.  Because everyone knows\nthey can’t do that\n, and anyhow, your bank is a really good bank, they aren’t like the evil giant banks, and they were so nice and helpful when that last little detail came up before closing.  So obviously nothing like this could ever happen to you….",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-20T19:15:00+00:00"
}