{
  "url": "https://voxday.net/2010/10/05/mailvox-homophobia-hypothesis/",
  "scraped_at": "2026-01-08T23:38:59.971971",
  "title": "Mailvox: the homophobia hypothesis",
  "date_display": "October 5, 2010",
  "date_iso": "2010-10-05T10:04:00+00:00",
  "date_from_url": "2010-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>CM was one of the few first-time emailers to write in regarding the Clementi suicide who managed to remain coherent, civil, and emotionally continent in objection to my post on the subject:</p><blockquote><p>My evangelical brother told me about your blogging on the Clementi suicide.  He directed me to it because he thought I had made a few observations consonant (the kid had a false sense of security, believing that official bureaucratic pronouncements matched sentiments on the ground; online coming-out is too easy and lowers the threshold for the kind of cussedness that being openly gay requires) with yours.  While he cautioned that I’d still disagree with “half of it”, I wasn’t prepared to read such low snark—nor to be so misunderstood.</p><p>Poor Tyler Clementi got in over his head by bringing a man home to his dorm before developing a thicker skin.  When faced with bureaucratic indifference, some revulsion or amused contempt from his dorm-mates, and possibly hostility, blame or hysteria from his lover and/or parents, he couldn’t take it.  A dutiful kid, he probably naively expected  support rather than to have his sense of violation compounded.   It was not because he felt shame at being identified as gay or despaired over his “evil” act of sexual discovery.</p><p>You really ought to go over to Salon and read the far more thoughtful, nuanced responses to <a href=\"http://www.salon.com/life/broadsheet/2010/10/01/clementi_suicide_roommate_open2010/index.html\">this article</a>.  They far surpass the article itself, your blog item, and the comments at your blog.</p></blockquote><p>As his was a reasonable email, I did as requested and found myself actually laughing out loud at the article, although in CM’s defense, it must be noted that he was recommending the <i>responses</i> to the Salon article and not the article itself.  The writer’s attempt to blame a gay conversion therapist and James Dobson as well as the ever notorious “society” is more than a little amusing; apparently the Boston Red Sox and Clementi himself are about the only ones whose hands are not dripping with Clementi’s blood.  To quote the author: “The guilty parties are everywhere”!</p><p>That’s helpful.  It would appear someone needs to let Mr. Fenton know that the man <i>committed suicide</i> and by definition, he is the only individual who can possibly be held directly responsible for the action.  But on to those surpassing comments….</p><p><i>“A couple of Asian Americans college students at an Ivy League with regular tolerance campaigns hardly seem like the types to be in lockstep with the conservative Christian agenda.”</i></p><p><i>“In other words, the writer would like to see large swaths of people jailed, not becuase of their involvement in any particular crime, but because they hold beliefs that the writer opposes.  Thanks for the clarification, L.M. Fenton. It is always good to know exactly where your political opponents stand. Understanding that that the left-wing and the homosexual rights community wants to criminalize their opposition for holding fast to their public views is helpful to this debate.”</i></p><p><i>“I disagree with focusing on the pranksters for the sole or even bulk of the blame. Only weak people jump from bridges and weak child jumpers belong to the ones who raised them.”</i></p><p><i>“Indeed, these are not Christo-fascist redneck southerners here, but two highly educated privileged young people at an elite liberal college, and on top of that, neither of the are white and likely neither are Christian. Most people of Indian descent are Hindu or Muslim and most people of Asian descent Buddhist or Muslim; heck, they could be atheists or agnostics for all we know. But I’ll bet neither of them are Pentecostal Christian Conservatives and I’ll bet neither Ravi nor Wei would have the faintest idea who James Dobson is.  Unfortunately, like the Phoebe Prince incident, it may turn out that Mr. Clementi was already depressed and unhappy and even suicidal BEFORE this incident took place. It wouldn’t make it right — it was absolutely deplorable, ugly behavior — but it might explain why he killed himself instead of (say) beating the crap out of Mr. Ravi.”</i></p><p>These comments may be more thoughtful than a blog post which I admittedly scribbled in minutes, but I really don’t see much difference between what I wrote and most of the comments that don’t echo the “we are all guilty” theme.  I certainly can’t say that I disagree with any of the ones quoted above.  Moreover, it is worth pointing out that the “homophobia kills homosexuals” hypothesis is both logically unsound and empirically incorrect.  Unlike most of my hysterical critics, I happen to be somewhat familiar with recent research into suicide statistics as part of the process of responding to Richard Dawkins’s claims about the psychological damage of being raised Catholic while writing <i>The Irrational Atheist</i>.</p><p>The orientationally-challenged argue thusly.  Or more accurately, they would argue thusly if they had the emotional continence to actually present their argument in a rational manner:</p><p>1.  Homosexuality is psychologically healthy and is not shameful.  Therefore, homosexuals do not kill themselves out of shame of their sexual predilection.<br> 2.  However, homosexuals are known to kill themselves at higher rates than psychologically normal individuals do.<br> 3.  Therefore, there must be some external force that supersedes their psychological normality and causes some of them to kill themselves.<br> 4.  Society, particularly Christian society, rejects homosexuals.<br> 5.  Therefore, it is the social rejection of society, especially Christian society, which is serves as that external force causing otherwise psychological healthy homosexuals to kill themselves out of shame, guilt, fear, and/or social rejection.</br></br></br></br></p><p>The logical structure of this argument is sound enough.  And yet, the argument also happens to be completely wrong.  If it were true, then we should be able to observe the following material consequences as a matter of course.</p><p>1.  Tolerant societies that have adopted social measures such as homogamy and orientational equality laws will have lower male suicide rates, especially among the orientationally challenged, than less tolerant societies.</p><p>2.  Religious societies where the orientationally challenged are most rejected will have the highest male suicide rates, especially among the orientationally challenged.</p><p>3.  Male Suicide rates will have fallen over time as societies have grown more socially progressive and tolerant of the orientationally-challenged.  These declines will be most marked in the most tolerant societies.</p><p>Now let’s look at the facts.  We will define a tolerant society where homogamy or civil unions are recognized; here are six tolerant societies: Belgium, Austria, Switzerland, France, Sweden, the Netherlands. Next we will define moderate religious society, where homosexuality is generally considered to be wrong, but not illegal: Ireland, USA, Italy, Mexico, Honduras, Paraguay.  And finally, we will define an intolerant society as one where homosexuality is illegal: Saudi Arabia, Algeria, Libya, Cameroon, Kenya, Uganda.</p><p>According to <a href=\"http://www.who.int/mental_health/prevention/suicide_rates/en/\">the World Health Organization</a>, the average male suicide rate for tolerant secular societies is 21.6 per 100,000.  The average male suicide rate for moderate religious societies is 9.6 per 100,000.  And the average male suicide rate for intolerant societies is unknown because as it turns out, none of them publicly report suicide rates.  However, in searching for these unreported rates, I did find a study that reported primary indicators of high societal suicide rates that can be used to estimate them; perhaps one day I’ll see about doing so for these countries.</p><p>One of the only countries where the specific issue has been studied is in the heavily secular and tolerant country of Norway where <a href=\"http://people.ucalgary.ca/~ptrembla/homosexuality-suicide/02-norway-gay-lesbian-suicide.htm\">20% of gay men</a> between the ages of 16-24 attempt suicide at least once.  It would appear highly unreasonable to attempt to blame either James Dobson or intolerant Southern Baptists for the self-destructive actions of young gay atheist Norwegians.</p><p>So it is clear that the first logical conclusion of the homophobia hypothesis is false.  The second conclusion is unclear, but the available evidence suggests it is false.  As for the third conclusion, it is also false since suicide rates are trending upward rather than falling, especially among young men.</p><p>a) <i>“In 21 of the 30 countries in the World Health Organization (WHO) European region, suicide rates in males aged 15-19 rose between 1979 and 1996.”</i></p><p>b) <i>“Canadian suicide rates greatly increased in the 1960s and 1970s and, while they have levelled out in the 1980s, they are still at the highest level in Canadian history. Between 1960 and 1978, the overall suicide rate rose from 7.6 per 100,000 population to 14.8, according to Statistics Canada figures.”</i></p><p>c) <i>“Each year, almost 5,000 young people, ages 15 to 24, kill themselves [in the United States]. The rate of suicide for this age group has nearly tripled since 1960, making it the third leading cause of death in adolescents and the second leading cause of death among college age youth.”</i></p><p>Although the case against it is not yet absolutely conclusive, there is definitely sufficient evidence to conclude that the “homophobic society causes suicide” argument is false.  The homophobia hypothesis empirically fails, and logic points to false assumptions being made the first and fifth points.  This conclusion is supported by the fact that, far from being a causal factor in suicide, religion tends to be the strongest <i>inhibiting</i> factor known to social science. <i>“Numerous studies have found a statistical relationship between normative religious beliefs (as indicated by church attendance, church membership, or religious sanctions against suicide) and national or regional suicide rates (e.g., Huang, 1996; Kelleher, Chambers, Corcoran, Williamson, &amp; Keeley, 1998; Neeleman, Halpern, Leon, &amp; Lewis, 1997). Across different regions of the United States, higher levels of Catholic Church membership are associated with lower suicide rates (Burr, McCall, &amp; Powell-Griner, 1994). The Ukraine’s western provinces, where more people attend church, have lower suicide rates than its eastern provinces, where fewer people attend church (Kondrichin &amp; Lester, 2002). Nations that publish relatively more religious books tend to have lower suicide rates (Cutright &amp; Fernquist, 2001; Fernquist, 2003a).”</i></p><p>In addition to their flaming hysteria, one of the most amusing things about the homocritics was their frequent reference to my supposed “ignorance” when it is completely clear that they don’t know even the most basic facts about suicide or its causal factors.  Even so, does the failure of the homophobia hypothesis mean that my idea about the dichotomy between shame over one’s orientation and gay rights propaganda creating a psychological disturbance encouraging one to commit suicide is correct?  No, of course not.  In fact, I have come across an alternative thesis that I consider to potentially present a stronger logic.  But more on that in a future post.</p></div>",
  "content_text": "CM was one of the few first-time emailers to write in regarding the Clementi suicide who managed to remain coherent, civil, and emotionally continent in objection to my post on the subject:\nMy evangelical brother told me about your blogging on the Clementi suicide.  He directed me to it because he thought I had made a few observations consonant (the kid had a false sense of security, believing that official bureaucratic pronouncements matched sentiments on the ground; online coming-out is too easy and lowers the threshold for the kind of cussedness that being openly gay requires) with yours.  While he cautioned that I’d still disagree with “half of it”, I wasn’t prepared to read such low snark—nor to be so misunderstood.\nPoor Tyler Clementi got in over his head by bringing a man home to his dorm before developing a thicker skin.  When faced with bureaucratic indifference, some revulsion or amused contempt from his dorm-mates, and possibly hostility, blame or hysteria from his lover and/or parents, he couldn’t take it.  A dutiful kid, he probably naively expected  support rather than to have his sense of violation compounded.   It was not because he felt shame at being identified as gay or despaired over his “evil” act of sexual discovery.\nYou really ought to go over to Salon and read the far more thoughtful, nuanced responses to\nthis article\n.  They far surpass the article itself, your blog item, and the comments at your blog.\nAs his was a reasonable email, I did as requested and found myself actually laughing out loud at the article, although in CM’s defense, it must be noted that he was recommending the\nresponses\nto the Salon article and not the article itself.  The writer’s attempt to blame a gay conversion therapist and James Dobson as well as the ever notorious “society” is more than a little amusing; apparently the Boston Red Sox and Clementi himself are about the only ones whose hands are not dripping with Clementi’s blood.  To quote the author: “The guilty parties are everywhere”!\nThat’s helpful.  It would appear someone needs to let Mr. Fenton know that the man\ncommitted suicide\nand by definition, he is the only individual who can possibly be held directly responsible for the action.  But on to those surpassing comments….\n“A couple of Asian Americans college students at an Ivy League with regular tolerance campaigns hardly seem like the types to be in lockstep with the conservative Christian agenda.”\n“In other words, the writer would like to see large swaths of people jailed, not becuase of their involvement in any particular crime, but because they hold beliefs that the writer opposes.  Thanks for the clarification, L.M. Fenton. It is always good to know exactly where your political opponents stand. Understanding that that the left-wing and the homosexual rights community wants to criminalize their opposition for holding fast to their public views is helpful to this debate.”\n“I disagree with focusing on the pranksters for the sole or even bulk of the blame. Only weak people jump from bridges and weak child jumpers belong to the ones who raised them.”\n“Indeed, these are not Christo-fascist redneck southerners here, but two highly educated privileged young people at an elite liberal college, and on top of that, neither of the are white and likely neither are Christian. Most people of Indian descent are Hindu or Muslim and most people of Asian descent Buddhist or Muslim; heck, they could be atheists or agnostics for all we know. But I’ll bet neither of them are Pentecostal Christian Conservatives and I’ll bet neither Ravi nor Wei would have the faintest idea who James Dobson is.  Unfortunately, like the Phoebe Prince incident, it may turn out that Mr. Clementi was already depressed and unhappy and even suicidal BEFORE this incident took place. It wouldn’t make it right — it was absolutely deplorable, ugly behavior — but it might explain why he killed himself instead of (say) beating the crap out of Mr. Ravi.”\nThese comments may be more thoughtful than a blog post which I admittedly scribbled in minutes, but I really don’t see much difference between what I wrote and most of the comments that don’t echo the “we are all guilty” theme.  I certainly can’t say that I disagree with any of the ones quoted above.  Moreover, it is worth pointing out that the “homophobia kills homosexuals” hypothesis is both logically unsound and empirically incorrect.  Unlike most of my hysterical critics, I happen to be somewhat familiar with recent research into suicide statistics as part of the process of responding to Richard Dawkins’s claims about the psychological damage of being raised Catholic while writing\nThe Irrational Atheist\n.\nThe orientationally-challenged argue thusly.  Or more accurately, they would argue thusly if they had the emotional continence to actually present their argument in a rational manner:\n1.  Homosexuality is psychologically healthy and is not shameful.  Therefore, homosexuals do not kill themselves out of shame of their sexual predilection.\n2.  However, homosexuals are known to kill themselves at higher rates than psychologically normal individuals do.\n3.  Therefore, there must be some external force that supersedes their psychological normality and causes some of them to kill themselves.\n4.  Society, particularly Christian society, rejects homosexuals.\n5.  Therefore, it is the social rejection of society, especially Christian society, which is serves as that external force causing otherwise psychological healthy homosexuals to kill themselves out of shame, guilt, fear, and/or social rejection.\nThe logical structure of this argument is sound enough.  And yet, the argument also happens to be completely wrong.  If it were true, then we should be able to observe the following material consequences as a matter of course.\n1.  Tolerant societies that have adopted social measures such as homogamy and orientational equality laws will have lower male suicide rates, especially among the orientationally challenged, than less tolerant societies.\n2.  Religious societies where the orientationally challenged are most rejected will have the highest male suicide rates, especially among the orientationally challenged.\n3.  Male Suicide rates will have fallen over time as societies have grown more socially progressive and tolerant of the orientationally-challenged.  These declines will be most marked in the most tolerant societies.\nNow let’s look at the facts.  We will define a tolerant society where homogamy or civil unions are recognized; here are six tolerant societies: Belgium, Austria, Switzerland, France, Sweden, the Netherlands. Next we will define moderate religious society, where homosexuality is generally considered to be wrong, but not illegal: Ireland, USA, Italy, Mexico, Honduras, Paraguay.  And finally, we will define an intolerant society as one where homosexuality is illegal: Saudi Arabia, Algeria, Libya, Cameroon, Kenya, Uganda.\nAccording to\nthe World Health Organization\n, the average male suicide rate for tolerant secular societies is 21.6 per 100,000.  The average male suicide rate for moderate religious societies is 9.6 per 100,000.  And the average male suicide rate for intolerant societies is unknown because as it turns out, none of them publicly report suicide rates.  However, in searching for these unreported rates, I did find a study that reported primary indicators of high societal suicide rates that can be used to estimate them; perhaps one day I’ll see about doing so for these countries.\nOne of the only countries where the specific issue has been studied is in the heavily secular and tolerant country of Norway where\n20% of gay men\nbetween the ages of 16-24 attempt suicide at least once.  It would appear highly unreasonable to attempt to blame either James Dobson or intolerant Southern Baptists for the self-destructive actions of young gay atheist Norwegians.\nSo it is clear that the first logical conclusion of the homophobia hypothesis is false.  The second conclusion is unclear, but the available evidence suggests it is false.  As for the third conclusion, it is also false since suicide rates are trending upward rather than falling, especially among young men.\na)\n“In 21 of the 30 countries in the World Health Organization (WHO) European region, suicide rates in males aged 15-19 rose between 1979 and 1996.”\nb)\n“Canadian suicide rates greatly increased in the 1960s and 1970s and, while they have levelled out in the 1980s, they are still at the highest level in Canadian history. Between 1960 and 1978, the overall suicide rate rose from 7.6 per 100,000 population to 14.8, according to Statistics Canada figures.”\nc)\n“Each year, almost 5,000 young people, ages 15 to 24, kill themselves [in the United States]. The rate of suicide for this age group has nearly tripled since 1960, making it the third leading cause of death in adolescents and the second leading cause of death among college age youth.”\nAlthough the case against it is not yet absolutely conclusive, there is definitely sufficient evidence to conclude that the “homophobic society causes suicide” argument is false.  The homophobia hypothesis empirically fails, and logic points to false assumptions being made the first and fifth points.  This conclusion is supported by the fact that, far from being a causal factor in suicide, religion tends to be the strongest\ninhibiting\nfactor known to social science.\n“Numerous studies have found a statistical relationship between normative religious beliefs (as indicated by church attendance, church membership, or religious sanctions against suicide) and national or regional suicide rates (e.g., Huang, 1996; Kelleher, Chambers, Corcoran, Williamson, & Keeley, 1998; Neeleman, Halpern, Leon, & Lewis, 1997). Across different regions of the United States, higher levels of Catholic Church membership are associated with lower suicide rates (Burr, McCall, & Powell-Griner, 1994). The Ukraine’s western provinces, where more people attend church, have lower suicide rates than its eastern provinces, where fewer people attend church (Kondrichin & Lester, 2002). Nations that publish relatively more religious books tend to have lower suicide rates (Cutright & Fernquist, 2001; Fernquist, 2003a).”\nIn addition to their flaming hysteria, one of the most amusing things about the homocritics was their frequent reference to my supposed “ignorance” when it is completely clear that they don’t know even the most basic facts about suicide or its causal factors.  Even so, does the failure of the homophobia hypothesis mean that my idea about the dichotomy between shame over one’s orientation and gay rights propaganda creating a psychological disturbance encouraging one to commit suicide is correct?  No, of course not.  In fact, I have come across an alternative thesis that I consider to potentially present a stronger logic.  But more on that in a future post.",
  "tags": [
    "mailvox",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-05T09:04:00+00:00"
}