{
  "url": "https://voxday.net/2010/10/14/mailvox-game-and-christian-man/",
  "scraped_at": "2026-01-08T23:39:54.088871",
  "title": "Mailvox: Game and the Christian man",
  "date_display": "October 14, 2010",
  "date_iso": "2010-10-14T15:00:00+00:00",
  "date_from_url": "2010-10-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AG asks for advice on dealing with the cold equations:</p><blockquote><p>I’m a 22 years old Christian male.  I’m by no means a natural alpha, but I’m a pretty bright guy and it is quite easy for me to make myself attractive to women.  Social reticence becomes “aloofness”, not knowing what to say (and not saying anything) becomes “mysteriousness” — you get the idea.  Maybe it’s not that simple, but from experience I know that attracting women is not tough for me.  My dilemma is this: every Christian male I know seems to either be a reformed badboy (like you) or very beta.  With the court system completed stacked against men, a failed marriage can completely destroy a guy.  What’s a guy like me to do?  Let out my inner badboy for the next 8 years and then beg God for mercy or just be the nice Christian beta and hope everything works out?  Neither option seems appealing at all.  You’re one of the few people I can think of that is a Christian and views women and modern America in a realistic way.  I can’t figure out what to do and I would really love to hear your thoughts.</p></blockquote><p>Paul is quite clear on sinning that grace might abound and it is no wiser to indulge in rampant sex for a few years with the idea that you’ll eventually set it aside than it is to decide to spend the next eight years in a coked-up state before getting clean.  I remember one evening at the Digital Ghetto when the White Buffalo, Big Chilly, Horn, and Micron were all happily ensconced around Bongzilla.  (I stayed very far away from the herb after an unpleasant experience with a PCP-laced joint at DV8.)  Micron had cracked a joke about how they were all killing brain cells, but Horn protested that he had read a study reporting that it took ten years of regular marijuana usage to have a negative impact on one’s brain.</p><p>At which point, Big Chilly smiled – he had gone to high school with Horn – and said: “And how long have you been smoking?”  At that point, he had three years left, but that was more than 15 years ago and he certainly hasn’t quit.  So, the point is that you’re kidding yourself if you think you can simply dive into the corruption of the world and expect to come out clean on the other side according to your schedule.</p><p>But no one said you have to be the nice Christian beta either.  Alpha isn’t the notches on the bedpost; they are merely the consequence of the <i>attitude</i>.  If you are a leader, a woman will follow you anywhere, including to church.  I have seen it happen.  And a Christian man shouldn’t consider himself bound to act like a beta, let alone gamma, around women, in fact, he should be <i>totally</i> indifferent to the opinion of the scarlet women of the world, which is a fundamentally alpha quality.</p><p>I think you are confusing Churchianity for Christianity in equating betatude with faith.  If you’re afraid to correct someone because it might hurt their feelings, if you can’t open your mouth without deprecating yourself, if you are more afraid to tell a woman not to gossip or stuff her face than tell an adulterer that his behavior is wrong, you are a Churchian using Christianity as an excuse for your inner gamma.  You’ve already learned that you don’t have to be an arrogant bastard in order to get the girls’ hamsters spinning madly, trying to figure you out.  Now you just need to take the next step and learn how to open your mouth without taking three steps back.</p><p>The reason Game works is that it is a pale, corrupted reflection of the truth.  But what is its most central message?  It sounds like one of Paul’s most important themes!  For neither God nor Game have given you a spirit of fear.  The Christian man should approach a woman to whom he is attracted with the same total lack of fear as the most hardened master of Game; if she’s not the one, then what do you care if she rejects you?  The sooner she does, the better!</p></div>",
  "content_text": "AG asks for advice on dealing with the cold equations:\nI’m a 22 years old Christian male.  I’m by no means a natural alpha, but I’m a pretty bright guy and it is quite easy for me to make myself attractive to women.  Social reticence becomes “aloofness”, not knowing what to say (and not saying anything) becomes “mysteriousness” — you get the idea.  Maybe it’s not that simple, but from experience I know that attracting women is not tough for me.  My dilemma is this: every Christian male I know seems to either be a reformed badboy (like you) or very beta.  With the court system completed stacked against men, a failed marriage can completely destroy a guy.  What’s a guy like me to do?  Let out my inner badboy for the next 8 years and then beg God for mercy or just be the nice Christian beta and hope everything works out?  Neither option seems appealing at all.  You’re one of the few people I can think of that is a Christian and views women and modern America in a realistic way.  I can’t figure out what to do and I would really love to hear your thoughts.\nPaul is quite clear on sinning that grace might abound and it is no wiser to indulge in rampant sex for a few years with the idea that you’ll eventually set it aside than it is to decide to spend the next eight years in a coked-up state before getting clean.  I remember one evening at the Digital Ghetto when the White Buffalo, Big Chilly, Horn, and Micron were all happily ensconced around Bongzilla.  (I stayed very far away from the herb after an unpleasant experience with a PCP-laced joint at DV8.)  Micron had cracked a joke about how they were all killing brain cells, but Horn protested that he had read a study reporting that it took ten years of regular marijuana usage to have a negative impact on one’s brain.\nAt which point, Big Chilly smiled – he had gone to high school with Horn – and said: “And how long have you been smoking?”  At that point, he had three years left, but that was more than 15 years ago and he certainly hasn’t quit.  So, the point is that you’re kidding yourself if you think you can simply dive into the corruption of the world and expect to come out clean on the other side according to your schedule.\nBut no one said you have to be the nice Christian beta either.  Alpha isn’t the notches on the bedpost; they are merely the consequence of the\nattitude\n.  If you are a leader, a woman will follow you anywhere, including to church.  I have seen it happen.  And a Christian man shouldn’t consider himself bound to act like a beta, let alone gamma, around women, in fact, he should be\ntotally\nindifferent to the opinion of the scarlet women of the world, which is a fundamentally alpha quality.\nI think you are confusing Churchianity for Christianity in equating betatude with faith.  If you’re afraid to correct someone because it might hurt their feelings, if you can’t open your mouth without deprecating yourself, if you are more afraid to tell a woman not to gossip or stuff her face than tell an adulterer that his behavior is wrong, you are a Churchian using Christianity as an excuse for your inner gamma.  You’ve already learned that you don’t have to be an arrogant bastard in order to get the girls’ hamsters spinning madly, trying to figure you out.  Now you just need to take the next step and learn how to open your mouth without taking three steps back.\nThe reason Game works is that it is a pale, corrupted reflection of the truth.  But what is its most central message?  It sounds like one of Paul’s most important themes!  For neither God nor Game have given you a spirit of fear.  The Christian man should approach a woman to whom he is attracted with the same total lack of fear as the most hardened master of Game; if she’s not the one, then what do you care if she rejects you?  The sooner she does, the better!",
  "tags": [
    "Christianity",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-14T14:00:00+00:00"
}