{
  "url": "https://voxday.net/2010/10/23/mailvox-hollywood-history/",
  "scraped_at": "2026-01-08T23:40:41.921944",
  "title": "Mailvox: Hollywood history",
  "date_display": "October 23, 2010",
  "date_iso": "2010-10-23T12:00:00+00:00",
  "date_from_url": "2010-10-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Hitler was not the German National Socialist Workers Party.  Nor was the converse true.  Imprecision in language often leads to needless confusion, which is why DJ felt it necessary to ask for clarification regarding an apparent historical contradiction:</p><blockquote><p>In your book <i>The Irrational Atheist</i>, you mentioned that Hitler received 95% of the vote at one time. On Bill Maher’s show <a href=\"http://www.breitbart.tv/rob-reiner-compares-tea-party-nazis-waiting-for-hitler/\">Mr Reiner mentioned</a> that he never received 33% of the vote, which is correct?</p></blockquote><p>In general, if there is a discrepancy between something I have written and something that a Hollywood figure assserts on Bill Maher’s show, I suggest it is entirely safe to assume that the Hollywood figure is incorrect.  It never hurts to check, of course, but seriously….  In this particular case, Mr. Reiner happens to be wrong, and wrong on no less than three levels.  The Weimar Republic was a parliamentary system, not a presidential one, so the German electorate was not voting for Hitler in the national elections to which Mr. Reiner is clearly referring; they were voting for National Socialist parliamentarians.  That’s a mere technicality and would not normally justify comment except that Mr. Reiner’s statement is more than a little misleading given the American context of his remarks; keep in mind that Margaret Thatcher, (or more precisely, the parliamentarians of the Conservative Party, a group which included Mrs. Thatcher), only won 35.8% of the vote in the 1979 UK election.</p><p>Moreover, the statement also happens to be factually wrong.  The National Socialists won 43.9% of the popular vote in the March 5, 1933 election, taking 288 of the 647 seats (44.5%) in the Reichstag.  And that 1933 election was actually <i>the third straight one</i> in which the National Socialists won more than 33% of the popular vote, as they had won 37.3% and 33.1% in the previous two national elections.  There was nothing democratically illegitimate about the National Socialists; the hitherto dominant Social Democrats (SDP) never controlled more than the 39% of the parliamentary seats that they won at the peak of their electoral strength in 1919.</p><p>As for my statement, I was not referring to the general elections, but rather to the four post-1933 national plebiscites that retroactively combined the offices of Reich Chancellor and Reich President and transferred the joint authority of the combined office to Adolf Hitler, approved the Austrian Anschluss, undsoweiter.</p><p><i>“What’s staggering about Hitler’s democratic appeal is not that he managed to win an average of 95.9 percent of the vote in the four plebiscites, but that he did so with 95.5 percent of the registered voters showing up to vote. That’s a serious democratic mandate!”</i><br> – The Irrational Atheist, p. 188</br></p></div>",
  "content_text": "Hitler was not the German National Socialist Workers Party.  Nor was the converse true.  Imprecision in language often leads to needless confusion, which is why DJ felt it necessary to ask for clarification regarding an apparent historical contradiction:\nIn your book\nThe Irrational Atheist\n, you mentioned that Hitler received 95% of the vote at one time. On Bill Maher’s show\nMr Reiner mentioned\nthat he never received 33% of the vote, which is correct?\nIn general, if there is a discrepancy between something I have written and something that a Hollywood figure assserts on Bill Maher’s show, I suggest it is entirely safe to assume that the Hollywood figure is incorrect.  It never hurts to check, of course, but seriously….  In this particular case, Mr. Reiner happens to be wrong, and wrong on no less than three levels.  The Weimar Republic was a parliamentary system, not a presidential one, so the German electorate was not voting for Hitler in the national elections to which Mr. Reiner is clearly referring; they were voting for National Socialist parliamentarians.  That’s a mere technicality and would not normally justify comment except that Mr. Reiner’s statement is more than a little misleading given the American context of his remarks; keep in mind that Margaret Thatcher, (or more precisely, the parliamentarians of the Conservative Party, a group which included Mrs. Thatcher), only won 35.8% of the vote in the 1979 UK election.\nMoreover, the statement also happens to be factually wrong.  The National Socialists won 43.9% of the popular vote in the March 5, 1933 election, taking 288 of the 647 seats (44.5%) in the Reichstag.  And that 1933 election was actually\nthe third straight one\nin which the National Socialists won more than 33% of the popular vote, as they had won 37.3% and 33.1% in the previous two national elections.  There was nothing democratically illegitimate about the National Socialists; the hitherto dominant Social Democrats (SDP) never controlled more than the 39% of the parliamentary seats that they won at the peak of their electoral strength in 1919.\nAs for my statement, I was not referring to the general elections, but rather to the four post-1933 national plebiscites that retroactively combined the offices of Reich Chancellor and Reich President and transferred the joint authority of the combined office to Adolf Hitler, approved the Austrian Anschluss, undsoweiter.\n“What’s staggering about Hitler’s democratic appeal is not that he managed to win an average of 95.9 percent of the vote in the four plebiscites, but that he did so with 95.5 percent of the registered voters showing up to vote. That’s a serious democratic mandate!”\n– The Irrational Atheist, p. 188",
  "tags": [
    "history",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-23T11:00:00+00:00"
}