{
  "url": "https://voxday.net/2010/10/21/more-sf-stupidity/",
  "scraped_at": "2026-01-08T23:40:34.564658",
  "title": "Bring me the head of Elizabeth Moon",
  "date_display": "October 21, 2010",
  "date_iso": "2010-10-21T14:45:00+00:00",
  "date_from_url": "2010-10-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The science fiction community is not just fat and unemployable, by and large, <a href=\"http://worldsf.wordpress.com/2010/09/16/elizabeth-moon-on-islam/\">they’re also significantly less intelligent, educated, and informed</a> than they think they are.  Consider this ridiculous reaction to Elizabeth Moon’s perfectly reasonable statement about her lack of enthusiasm for the so-called Ground Zero mosque:</p><blockquote><p>If you change the first paragraph to reflect the 1995 Oklahoma City bombing (and make a couple of minor edits for clarity) you get something that highlights the assumptions made in the original post:</p><p>I know–I do not dispute–that many Christians had nothing to do with the attack, did not approve of them, would have stopped them if they could. I do not dispute that there are moderate, even liberal, Christians, that many Christians have all the virtues of civilized persons and are admirable in all those ways. I am totally, 100%, appalled at those who want to burn the Bible (which, by the way, I have read in English translation, with the same attention I’ve given to other holy books) or throw paint on churches or beat up Christians. But Christians fail to recognize how much forbearance they’ve had. Schools in my area held consciousness-raising sessions for kids about not teasing children in Christian-defined clothing…but not about not teasing Jewish children or racial minorities. More law enforcement was dedicated to protecting churches than synagogues–and synagogues are still targeted for vandalism. What I heard, in my area, after Oklahoma City, was not condemnation by local churches of the attack–but an immediate cry for protection even before anything happened. Our religious group, and many others (not, obviously all) already had in place a “peace and reconciliation” program that urged us to understand, forgive, pray for, not just innocent Christians but the attackers themselves. It sponsored a talk by a Christian from a local church–but the talk was all about how wonderful Christianity was–totally ignoring the historical roots of Christian violence.</p></blockquote><p>This is a impressively stupid analogy, given that the reported OK City bomber, Timothy McVeigh, <i>was not a Christian</i>.  His religion, by his own attestation, was “science”, although strangely enough I have yet to hear scientists blamed for OK City.  And it is downright bizarre to accuse Ms Moon of being a racist, given the rather obvious fact that Islam <i>is not a race</i>.</p><p>However, there can be no doubt that Ms Moon is <a href=\"http://e-moon60.livejournal.com/335480.html\">clearly guilty of showing the greatest disrespect</a> for Progressive America’s Most Favored Minority.  Therefore, I disagree with those who call for her to be stripped of her status as Guest of Honor at WisCon.  She should clearly be stripped of her SFWA membership, her books should be publicly burned, after which proceedings she should be stoned on stage at WisCon.  I have written SFWA President-For-Life John Scalzi regarding this very serious situation and expressed my expectations that he will not only put this deeply appropriate punishment for holding an opinion contra the <s>SWPL</s>SFWA majority in motion, but throw the first stone himself.</p><p>UPDATE: <i>“SF3 has <a href=\"http://sf3.org/2010/10/elizabeth-moon/\">withdrawn the invitation</a> to Elizabeth Moon to attend WisCon 35 as guest of honor.”</i></p><p>I am SHOCKED and OUTRAGED by this action by the committee of SF3!  Elizabeth Moon must not be permitted to hide from her hurtful and racist words!  She must be punished!  In PUBLIC!  She must be stoned!  On STAGE!  Her books must be BURNED!</p></div>",
  "content_text": "The science fiction community is not just fat and unemployable, by and large,\nthey’re also significantly less intelligent, educated, and informed\nthan they think they are.  Consider this ridiculous reaction to Elizabeth Moon’s perfectly reasonable statement about her lack of enthusiasm for the so-called Ground Zero mosque:\nIf you change the first paragraph to reflect the 1995 Oklahoma City bombing (and make a couple of minor edits for clarity) you get something that highlights the assumptions made in the original post:\nI know–I do not dispute–that many Christians had nothing to do with the attack, did not approve of them, would have stopped them if they could. I do not dispute that there are moderate, even liberal, Christians, that many Christians have all the virtues of civilized persons and are admirable in all those ways. I am totally, 100%, appalled at those who want to burn the Bible (which, by the way, I have read in English translation, with the same attention I’ve given to other holy books) or throw paint on churches or beat up Christians. But Christians fail to recognize how much forbearance they’ve had. Schools in my area held consciousness-raising sessions for kids about not teasing children in Christian-defined clothing…but not about not teasing Jewish children or racial minorities. More law enforcement was dedicated to protecting churches than synagogues–and synagogues are still targeted for vandalism. What I heard, in my area, after Oklahoma City, was not condemnation by local churches of the attack–but an immediate cry for protection even before anything happened. Our religious group, and many others (not, obviously all) already had in place a “peace and reconciliation” program that urged us to understand, forgive, pray for, not just innocent Christians but the attackers themselves. It sponsored a talk by a Christian from a local church–but the talk was all about how wonderful Christianity was–totally ignoring the historical roots of Christian violence.\nThis is a impressively stupid analogy, given that the reported OK City bomber, Timothy McVeigh,\nwas not a Christian\n.  His religion, by his own attestation, was “science”, although strangely enough I have yet to hear scientists blamed for OK City.  And it is downright bizarre to accuse Ms Moon of being a racist, given the rather obvious fact that Islam\nis not a race\n.\nHowever, there can be no doubt that Ms Moon is\nclearly guilty of showing the greatest disrespect\nfor Progressive America’s Most Favored Minority.  Therefore, I disagree with those who call for her to be stripped of her status as Guest of Honor at WisCon.  She should clearly be stripped of her SFWA membership, her books should be publicly burned, after which proceedings she should be stoned on stage at WisCon.  I have written SFWA President-For-Life John Scalzi regarding this very serious situation and expressed my expectations that he will not only put this deeply appropriate punishment for holding an opinion contra the\nSWPL\nSFWA majority in motion, but throw the first stone himself.\nUPDATE:\n“SF3 has\nwithdrawn the invitation\nto Elizabeth Moon to attend WisCon 35 as guest of honor.”\nI am SHOCKED and OUTRAGED by this action by the committee of SF3!  Elizabeth Moon must not be permitted to hide from her hurtful and racist words!  She must be punished!  In PUBLIC!  She must be stoned!  On STAGE!  Her books must be BURNED!",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-21T13:45:00+00:00"
}