{
  "url": "https://voxday.net/2010/10/21/muslim-is-new-black/",
  "scraped_at": "2026-01-08T23:40:30.927165",
  "title": "Muslim is the new black",
  "date_display": "October 21, 2010",
  "date_iso": "2010-10-21T07:41:00+00:00",
  "date_from_url": "2010-10-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to admit, I do find <a href=\"http://www.latimes.com/news/nationworld/nation/la-na-juan-williams-20101021,0,2593969.story\">the latest employment incident</a> to be moderately amusing.  I mean, it’s not exactly news that NPR is Ground Zero for SWPL political correctness, so its actions are educational in certain regards:</p><blockquote><p>National Public Radio terminated the contract of commentator Juan Williams after he said on Fox’s “The O’Reilly Factor” that people wearing Muslim garb on airplanes made him “worried” and “nervous.”</p></blockquote><p>Of course, people wearing Muslim garb on airplanes make everyone, including other Muslims, nervous everywhere from Moscow to New Dehli.  This is most likely because Muslims, unlike every other religious group, have been known to <i>blow up airplanes</i> upon which they are flying.  And it’s not as if the SWPL management at NPR doesn’t know this, but they would literally rather die than face the cognitive dissonance between reality and their progressive ideology.</p><p>It is interesting to learn that Muslims now outrank blacks in the progressive hierarchy, though.  It wasn’t all that long ago when blacks were at the top of the pyramid; I wonder if Jesse Jackson could survive his “Hymietown” remark if he made it today.  We know from <i>l’affaire de Sanchez</i> that Jews still outrank Hispanics, but the Williams firing calls into question who is presently SWPL America’s Most Favored Minority.</p></div>",
  "content_text": "I have to admit, I do find\nthe latest employment incident\nto be moderately amusing.  I mean, it’s not exactly news that NPR is Ground Zero for SWPL political correctness, so its actions are educational in certain regards:\nNational Public Radio terminated the contract of commentator Juan Williams after he said on Fox’s “The O’Reilly Factor” that people wearing Muslim garb on airplanes made him “worried” and “nervous.”\nOf course, people wearing Muslim garb on airplanes make everyone, including other Muslims, nervous everywhere from Moscow to New Dehli.  This is most likely because Muslims, unlike every other religious group, have been known to\nblow up airplanes\nupon which they are flying.  And it’s not as if the SWPL management at NPR doesn’t know this, but they would literally rather die than face the cognitive dissonance between reality and their progressive ideology.\nIt is interesting to learn that Muslims now outrank blacks in the progressive hierarchy, though.  It wasn’t all that long ago when blacks were at the top of the pyramid; I wonder if Jesse Jackson could survive his “Hymietown” remark if he made it today.  We know from\nl’affaire de Sanchez\nthat Jews still outrank Hispanics, but the Williams firing calls into question who is presently SWPL America’s Most Favored Minority.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-21T06:41:00+00:00"
}