{
  "url": "https://voxday.net/2010/10/11/noble-opportunity-for-everyone/",
  "scraped_at": "2026-01-08T23:39:34.788764",
  "title": "A noble opportunity to contribute",
  "date_display": "October 11, 2010",
  "date_iso": "2010-10-11T14:30:00+00:00",
  "date_from_url": "2010-10-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am confident that the American people, being staunchly committed to their hallowed and time-honored principles of diversity, social justice, and the sanctity of public union contracts, <a href=\"http://www.humanevents.com/article.php?id=39336\">will welcome this opportunity</a> to ensure that no retired government employee is denied the right to live large while not working at home instead of not working at the office:</p><blockquote><p>Democrats in the Senate on Thursday held a recess hearing covering a taxpayer bailout of union pensions and a plan to seize private 401(k) plans to more “fairly” distribute taxpayer-funded pensions to everyone.</p></blockquote><p>This is precisely why I never contributed a dime to any 401(k) plan.  Even in my misspent youth, I understood that which Congress gives, Congress will take away the moment it decides it wants to do so.  Fortunately for those who have been diligently salting away their retirement money in these plans, since 2008 we have repeatedly been shown that Congress is much more prone to listen to the voice of the outraged masses than to a statistically insignificant but wealthy and politically influential special interest group that is demanding large sums of money.</p><p>Wait a minute….</p></div>",
  "content_text": "I am confident that the American people, being staunchly committed to their hallowed and time-honored principles of diversity, social justice, and the sanctity of public union contracts,\nwill welcome this opportunity\nto ensure that no retired government employee is denied the right to live large while not working at home instead of not working at the office:\nDemocrats in the Senate on Thursday held a recess hearing covering a taxpayer bailout of union pensions and a plan to seize private 401(k) plans to more “fairly” distribute taxpayer-funded pensions to everyone.\nThis is precisely why I never contributed a dime to any 401(k) plan.  Even in my misspent youth, I understood that which Congress gives, Congress will take away the moment it decides it wants to do so.  Fortunately for those who have been diligently salting away their retirement money in these plans, since 2008 we have repeatedly been shown that Congress is much more prone to listen to the voice of the outraged masses than to a statistically insignificant but wealthy and politically influential special interest group that is demanding large sums of money.\nWait a minute….",
  "tags": [
    "politics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-11T13:30:00+00:00"
}