{
  "url": "https://voxday.net/2010/10/07/notes-from-cicero/",
  "scraped_at": "2026-01-08T23:39:14.613136",
  "title": "Notes from Cicero",
  "date_display": "October 7, 2010",
  "date_iso": "2010-10-07T14:45:00+00:00",
  "date_from_url": "2010-10-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For some time now, I have been intending to make notes on the various bits and pieces I pick up while reading and post them here for whatever edification they might happen to offer you.  And I very much recommend Mahan’s two-volume <i>Life of Nelson</i>; unfortunately I failed to mark any of the salient points it contained while I was reading it.  But here are two little things that caught my attention in my present reading, which is the first volume of Cicero’s extant letters:</p><p>1.  Those who believe in the New Economics aka Keynesianism will find it somewhat difficult to explain how despite more than two thousand years of technological development and the advancement of economic science, interest rates are still pretty much the same.  As of this week, a 30-year fixed-rate mortage is around 4.5 percent.  Plus ça change….</p><p><i>To P. Sestius in Macedonia: “In point of fact, money is plentiful at six per cent., and the success of my measures has caused me to be regarded as a good security.”</i></p><p>2.  Deflation has not always been considered a disastrous thing by the educated classes, at least by those not beholden to the bankers.  And it is ominous to note his optimistic description of Rome and compare it to the present state of our latter-day Rome on the Potomac.</p><p><i>To Atticus in Epirus:  In short, I was cheered to the echo. For the subject of my speech was the dignity of the senate, its harmony with the equites, the unanimity of Italy, the dying embers of the conspiracy, the fall in prices, the establishment of peace. You know my thunder when these are my themes.</i></p></div>",
  "content_text": "For some time now, I have been intending to make notes on the various bits and pieces I pick up while reading and post them here for whatever edification they might happen to offer you.  And I very much recommend Mahan’s two-volume\nLife of Nelson\n; unfortunately I failed to mark any of the salient points it contained while I was reading it.  But here are two little things that caught my attention in my present reading, which is the first volume of Cicero’s extant letters:\n1.  Those who believe in the New Economics aka Keynesianism will find it somewhat difficult to explain how despite more than two thousand years of technological development and the advancement of economic science, interest rates are still pretty much the same.  As of this week, a 30-year fixed-rate mortage is around 4.5 percent.  Plus ça change….\nTo P. Sestius in Macedonia: “In point of fact, money is plentiful at six per cent., and the success of my measures has caused me to be regarded as a good security.”\n2.  Deflation has not always been considered a disastrous thing by the educated classes, at least by those not beholden to the bankers.  And it is ominous to note his optimistic description of Rome and compare it to the present state of our latter-day Rome on the Potomac.\nTo Atticus in Epirus:  In short, I was cheered to the echo. For the subject of my speech was the dignity of the senate, its harmony with the equites, the unanimity of Italy, the dying embers of the conspiracy, the fall in prices, the establishment of peace. You know my thunder when these are my themes.",
  "tags": [
    "books",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-07T13:45:00+00:00"
}