{
  "url": "https://voxday.net/2010/10/18/obama-is-behind-curve/",
  "scraped_at": "2026-01-08T23:40:12.601592",
  "title": "Obama is behind the curve",
  "date_display": "October 18, 2010",
  "date_iso": "2010-10-18T14:15:00+00:00",
  "date_from_url": "2010-10-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>His adminstration is still tap-dancing around the central issue of the mortgage frauds despite the fact that everyone who is paying attention now knows that the foreclosure fraud is only the tip of the iceberg.  Notice how <a href=\"http://www.huffingtonpost.com/shaun-donovan/how-we-can-really-help-fa_b_765528.html\">the PR communique from his U.S. Secretary for Housing and Urban Development</a> completely ignores everything but the foreclosure aspect and tries to portray illegal banking actions as “a bank mistake”:</p><blockquote><p>No one should lose their home as a result of a bank mistake. No one. That is why the Obama Administration has a comprehensive review of the situation underway and will respond with the full force of the law where problems are found. The Financial Fraud Enforcement Task Force that President Obama established last November has made this issue priority number one. Bringing together more than 20 federal agencies, 94 US Attorney’s Offices and dozens of state and local partners to form the broadest coalition of law enforcement, investigatory and regulatory agencies ever assembled to combat fraud, the Task Force is examining this issue and the Attorney General has said publicly that if it finds any wrongdoing the members of the task force will take the appropriate action. The Federal Housing Administration and Federal Housing Finance Agency have launched reviews to make sure servicers are in full compliance with the law. The Office of the Comptroller of the Currency has directed seven of the nation’s largest servicers to review their foreclosure processes, fix the processing problems and determine whether there is specific harm that has been caused in individual cases.</p><p>The message all these institutions are sending is the same: banks must follow the law — and those that haven’t should immediately fix what is wrong.</p></blockquote><p>What an unsurprising and incompetent PR-driven response.  But it’s informative to note that a top administration official is willing to come right out and state that banks that have broken the law will not be prosecuted, but have merely to “fix what is wrong” in order to escape punishment.  As I posted yesterday, there is absolutely no Rule of Law in the United States anymore.  There is not even a serious pretense of it.</p><p>If a member of the non-favored classes breaks the law, he is arrested, prosecuted, and tried <i>if he is lucky</i>.  If he is not, (in which case he may not have even broken a law, but merely been targeted by a bureaucratic agent), he is subjected to a non-judicial procedure and asset-stripped.  If, however, a bank does not “follow the law”, it is expected to merely “fix the mistake”.  Moreover, it is an explicit announcement that the Obama administration fully intends for foreclosures to continue less only those that are most PR-damaging to the banks.</p><p>It certainly settles the issue regarding Obama’s political intelligence.  Like McCain in 2008, he has sent a very public message that he is taking Wall Street’s side against the rest of America.</p></div>",
  "content_text": "His adminstration is still tap-dancing around the central issue of the mortgage frauds despite the fact that everyone who is paying attention now knows that the foreclosure fraud is only the tip of the iceberg.  Notice how\nthe PR communique from his U.S. Secretary for Housing and Urban Development\ncompletely ignores everything but the foreclosure aspect and tries to portray illegal banking actions as “a bank mistake”:\nNo one should lose their home as a result of a bank mistake. No one. That is why the Obama Administration has a comprehensive review of the situation underway and will respond with the full force of the law where problems are found. The Financial Fraud Enforcement Task Force that President Obama established last November has made this issue priority number one. Bringing together more than 20 federal agencies, 94 US Attorney’s Offices and dozens of state and local partners to form the broadest coalition of law enforcement, investigatory and regulatory agencies ever assembled to combat fraud, the Task Force is examining this issue and the Attorney General has said publicly that if it finds any wrongdoing the members of the task force will take the appropriate action. The Federal Housing Administration and Federal Housing Finance Agency have launched reviews to make sure servicers are in full compliance with the law. The Office of the Comptroller of the Currency has directed seven of the nation’s largest servicers to review their foreclosure processes, fix the processing problems and determine whether there is specific harm that has been caused in individual cases.\nThe message all these institutions are sending is the same: banks must follow the law — and those that haven’t should immediately fix what is wrong.\nWhat an unsurprising and incompetent PR-driven response.  But it’s informative to note that a top administration official is willing to come right out and state that banks that have broken the law will not be prosecuted, but have merely to “fix what is wrong” in order to escape punishment.  As I posted yesterday, there is absolutely no Rule of Law in the United States anymore.  There is not even a serious pretense of it.\nIf a member of the non-favored classes breaks the law, he is arrested, prosecuted, and tried\nif he is lucky\n.  If he is not, (in which case he may not have even broken a law, but merely been targeted by a bureaucratic agent), he is subjected to a non-judicial procedure and asset-stripped.  If, however, a bank does not “follow the law”, it is expected to merely “fix the mistake”.  Moreover, it is an explicit announcement that the Obama administration fully intends for foreclosures to continue less only those that are most PR-damaging to the banks.\nIt certainly settles the issue regarding Obama’s political intelligence.  Like McCain in 2008, he has sent a very public message that he is taking Wall Street’s side against the rest of America.",
  "tags": [
    "banks",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-18T13:15:00+00:00"
}