{
  "url": "https://voxday.net/2010/10/27/portrait-in-conservative-cluelessness/",
  "scraped_at": "2026-01-08T23:41:04.176671",
  "title": "A portrait in conservative cluelessness",
  "date_display": "October 27, 2010",
  "date_iso": "2010-10-27T10:21:00+00:00",
  "date_from_url": "2010-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Can someone just get this chick the job she obviously wants on Fox already?  I have absolutely nothing against <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=220297\">attractive blondes babbling nonsensically in ignorance</a>, I just don’t think it belongs on the op/ed page:</p><blockquote><p>What have we come to when we believe drunken college students over police officers? That is exactly the case in Boston. Several “eye witnesses” claim the authorities overreacted when they shot at 20-year-old D.J. Henry’s car in front of a local bar, which resulted in his death and the injury of his passenger. It has been reported that D.J. was supposed to be the designated driver and was only there to pick up some friends. I find that hard to believe considering his blood alcohol level was nearly twice the legal limit.</p><p>Understandably, D.J.’s parents are outraged and devastated, calling for an investigation by the U.S. Department of Justice. I can’t imagine the pain they must be going through. This is a tough one because on one hand you have parents who just lost their son, and on the other you have a drunken kid who allegedly fled from the cops when he was approached and hit two of them with his car as he accelerated. It’s not like D.J. was just minding his own business and the cops walked up to the car and shot him. He put himself at risk when he knowingly got behind the wheel while he was intoxicated.</p><p>Where does personal responsibility come into play? D.J.’s blood alcohol level was .13. He was in the driver’s seat and the cops were called to the bar due to an “unruly crowd” outside. Should they have let him drive home? Of course not; they’re going to do their job and approach him. If the authorities hadn’t gone up to the car and instead just let D.J. drive home, what would the consequences have been? Driving under the influence could have resulted in an accident….</p><p>The cops were doing their job. It seems like when they do that, their investigations are “fatally flawed,” as D.J.’s family put it – but when they don’t do their job they’re incompetent and negligent. Are we to blame police officers when they try to protect and serve?</p></blockquote><p>Americans will stop believing “drunken college students over police officers” when police officers stop destroying evidence, lying about what happened, and exonerating themselves of any wrongdoing after leaving a trail of dead bodies behind them.  Someone needs to explain to little Chrissy Chatterfield that “protecting and serving” does not involve murdering men who happen to be lightly intoxicated behind the wheel of a car.  Or legally carrying while shopping at CostCo.  Or sitting at home minding their own business with a door left open to provide a breeze on a hot summer evening.  There are no shortage of unjustifiable police murders for which none of the responsible cops were even prosecuted.</p><p>What passes for her logic is darkly hilarious; it’s good for the police to kill a man in order to prevent the highly unlikely possibility that he might kill someone else in an accident.  By this reckoning, police snipers should be stationed outside every bar and nightclub parking lot in America, picking off anyone who looks like they might have had more than two drinks.  And more importantly, the police had absolutely no idea that the guy was drunk.  They didn’t shoot him because he had a BAC of 0.13, which despite the absurd legal limits is barely into the range that is even detectable without testing, they shot him because he didn’t follow their confusing and imprecise orders.  (At his body weight, D.J. Henry had probably had all of 5 drinks that evening.)  Randy Moss would be dead if the Minneapolis police were similarly inclined to homicide.</p><p>Take note of the scare quotes around “eyewitneses”.  Does little Miss Chatterfield not believe that these people were there on the scene?  Does she have any reason to doubt their eyewitness testimony, which just happens to be the primary foundation of every legal system dating back to the Old Testament?  Of course not, she’s just a clueless, conservative cop-lover who believes that providing a psychopath with a blue uniform and a gun magically transforms him into a heroic and faultless doer of good.</p><p>Miss Chatterfield may be on the cops’ side, but what she is too young and foolish to understand is that they are most certainly not on her side.  Since her interactions with the police are probably limited to Norman Rockwell paintings and crying to get out of the occasional speeding ticket, she has no idea of the extent to which the police departments of America have been militarized, corrupted by drug war money, and populated by criminals.  This asinine article is exhibit A in the mindless conservative support for the police that must come to an end in order to restore legitimacy to what is presently little more than a lawless government badge gang.</p><p> UPDATE: I missed the fact that WND’s cheerleader for the police state didn’t even manage to get the right <i>state</i>, let alone city, in her rush to defend a police shooting.  D.J. Henry was shot and killed in Thornwood, New York by the Pleasantville police.  The case, exactly or otherwise, had no connection with Boston.</p><p>UPDATE II:  Well, I suppose this would be one effective means of addressing police brutality: <i>“The entire police force of a small town in northern Mexico resigned after gunmen attacked their recently-opened headquarters with grenades and assault rifles, local news agencies reported quoting the town’s Mayor on Wednesday.”</i></p><p>I suppose it’s not so fun to wave your badge and your gun when the people start shooting back.</p></div>",
  "content_text": "Can someone just get this chick the job she obviously wants on Fox already?  I have absolutely nothing against\nattractive blondes babbling nonsensically in ignorance\n, I just don’t think it belongs on the op/ed page:\nWhat have we come to when we believe drunken college students over police officers? That is exactly the case in Boston. Several “eye witnesses” claim the authorities overreacted when they shot at 20-year-old D.J. Henry’s car in front of a local bar, which resulted in his death and the injury of his passenger. It has been reported that D.J. was supposed to be the designated driver and was only there to pick up some friends. I find that hard to believe considering his blood alcohol level was nearly twice the legal limit.\nUnderstandably, D.J.’s parents are outraged and devastated, calling for an investigation by the U.S. Department of Justice. I can’t imagine the pain they must be going through. This is a tough one because on one hand you have parents who just lost their son, and on the other you have a drunken kid who allegedly fled from the cops when he was approached and hit two of them with his car as he accelerated. It’s not like D.J. was just minding his own business and the cops walked up to the car and shot him. He put himself at risk when he knowingly got behind the wheel while he was intoxicated.\nWhere does personal responsibility come into play? D.J.’s blood alcohol level was .13. He was in the driver’s seat and the cops were called to the bar due to an “unruly crowd” outside. Should they have let him drive home? Of course not; they’re going to do their job and approach him. If the authorities hadn’t gone up to the car and instead just let D.J. drive home, what would the consequences have been? Driving under the influence could have resulted in an accident….\nThe cops were doing their job. It seems like when they do that, their investigations are “fatally flawed,” as D.J.’s family put it – but when they don’t do their job they’re incompetent and negligent. Are we to blame police officers when they try to protect and serve?\nAmericans will stop believing “drunken college students over police officers” when police officers stop destroying evidence, lying about what happened, and exonerating themselves of any wrongdoing after leaving a trail of dead bodies behind them.  Someone needs to explain to little Chrissy Chatterfield that “protecting and serving” does not involve murdering men who happen to be lightly intoxicated behind the wheel of a car.  Or legally carrying while shopping at CostCo.  Or sitting at home minding their own business with a door left open to provide a breeze on a hot summer evening.  There are no shortage of unjustifiable police murders for which none of the responsible cops were even prosecuted.\nWhat passes for her logic is darkly hilarious; it’s good for the police to kill a man in order to prevent the highly unlikely possibility that he might kill someone else in an accident.  By this reckoning, police snipers should be stationed outside every bar and nightclub parking lot in America, picking off anyone who looks like they might have had more than two drinks.  And more importantly, the police had absolutely no idea that the guy was drunk.  They didn’t shoot him because he had a BAC of 0.13, which despite the absurd legal limits is barely into the range that is even detectable without testing, they shot him because he didn’t follow their confusing and imprecise orders.  (At his body weight, D.J. Henry had probably had all of 5 drinks that evening.)  Randy Moss would be dead if the Minneapolis police were similarly inclined to homicide.\nTake note of the scare quotes around “eyewitneses”.  Does little Miss Chatterfield not believe that these people were there on the scene?  Does she have any reason to doubt their eyewitness testimony, which just happens to be the primary foundation of every legal system dating back to the Old Testament?  Of course not, she’s just a clueless, conservative cop-lover who believes that providing a psychopath with a blue uniform and a gun magically transforms him into a heroic and faultless doer of good.\nMiss Chatterfield may be on the cops’ side, but what she is too young and foolish to understand is that they are most certainly not on her side.  Since her interactions with the police are probably limited to Norman Rockwell paintings and crying to get out of the occasional speeding ticket, she has no idea of the extent to which the police departments of America have been militarized, corrupted by drug war money, and populated by criminals.  This asinine article is exhibit A in the mindless conservative support for the police that must come to an end in order to restore legitimacy to what is presently little more than a lawless government badge gang.\nUPDATE: I missed the fact that WND’s cheerleader for the police state didn’t even manage to get the right\nstate\n, let alone city, in her rush to defend a police shooting.  D.J. Henry was shot and killed in Thornwood, New York by the Pleasantville police.  The case, exactly or otherwise, had no connection with Boston.\nUPDATE II:  Well, I suppose this would be one effective means of addressing police brutality:\n“The entire police force of a small town in northern Mexico resigned after gunmen attacked their recently-opened headquarters with grenades and assault rifles, local news agencies reported quoting the town’s Mayor on Wednesday.”\nI suppose it’s not so fun to wave your badge and your gun when the people start shooting back.",
  "tags": [
    "media",
    "NWA was right"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-27T09:21:00+00:00"
}