{
  "url": "https://voxday.net/2010/10/29/republicans-will-fix-nothing/",
  "scraped_at": "2026-01-08T23:41:16.992458",
  "title": "Republicans will fix nothing",
  "date_display": "October 29, 2010",
  "date_iso": "2010-10-29T09:27:00+00:00",
  "date_from_url": "2010-10-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.thefreeenterprisenation.org/sp/The-FEN-2010-National-Pre-Election-Poll-Results.aspx\">There is the evidence</a>.  It also proves MPAI, needless to say, as 92% of Republicans believe Congress or Obama are to blame for the current economic slump, (wait, aren’t we in a recovery?), and only around six percent understand that the bankers are to blame.  The worst thing is that about 50% of them genuinely think <i>Obama</i> is to blame, when there is <i>no possible way</i> he can be held responsible for it.  While he has most definitely exacerbated the situation by his Hooverian response to it, the die was not only cast, but the results were known <i>before he even took office!</i> We already know that the Republican elite has zero desire to force the banks to take responsibility for their criminal and economically destructive actions; this poll indicates that there will be very little grass roots pressure on them to do what they don’t want to do because the voter anger has been successfully redirected to date.</p><p>Remarkably, the Democrats are somewhat better in assigning the blame where it belongs.  Nearly 25 percent of them hold the bankers responsible, although they clearly don’t recognize that their hero Obama is completely owned by Goldman Sachs.  (When the guy is appointing ex-Goldmanites to administration positions outside the Treasury, you know it’s completely out of control.)  And at least Bush was in office when the meltdown began, although if he can be blamed for pushing TARP, he can’t reasonably be blamed for the Fed keeping interest rates low and blowing multiple financial bubbles.</p><p>Anyhow, it is quite clear that the electoral devastation about to be wreaked upon Democrats by Republicans (which, you may recall, I was one of the first to predict), is not going to have a salutary effect upon the situation because the Republican Party and the greater part of the Tea Party insist on believing that the perpetrators of the primary causal factor were among the victims.  They will surely dig in a different part of the hole than did the Democrats, but we can be confident that they will continue making it deeper.  The battle between Republicans and Democrats is an internecine battle between the Keynesians known as Neo-Keynesians and the Keynesians known as Monetarists.  Both sides subscribe to a false economic theory and both are beholden to the banks, and as both the names and the polls indicate, the Republicans are more strongly beholden to them than are the Democrats.</p><p>This means that Obama and the new Republican majorities, (or if I am only half-correct, House majority) will be eager to announce bipartisan cooperation in finding a means of saddling the taxpayer with TARP II, in which the cost of the fraudulent mortgage-backed security put-backs is shifted from the banks that committed the fraud to the taxpayer while their myriad of proven crimes are swept under the carpet.  And the passage of that heroic, bipartisan, and much-publicized “reform” will mark the effective end of the Tea Party, even if its zombie corpse remains an animated political identity for decades to come.</p></div>",
  "content_text": "There is the evidence\n.  It also proves MPAI, needless to say, as 92% of Republicans believe Congress or Obama are to blame for the current economic slump, (wait, aren’t we in a recovery?), and only around six percent understand that the bankers are to blame.  The worst thing is that about 50% of them genuinely think\nObama\nis to blame, when there is\nno possible way\nhe can be held responsible for it.  While he has most definitely exacerbated the situation by his Hooverian response to it, the die was not only cast, but the results were known\nbefore he even took office!\nWe already know that the Republican elite has zero desire to force the banks to take responsibility for their criminal and economically destructive actions; this poll indicates that there will be very little grass roots pressure on them to do what they don’t want to do because the voter anger has been successfully redirected to date.\nRemarkably, the Democrats are somewhat better in assigning the blame where it belongs.  Nearly 25 percent of them hold the bankers responsible, although they clearly don’t recognize that their hero Obama is completely owned by Goldman Sachs.  (When the guy is appointing ex-Goldmanites to administration positions outside the Treasury, you know it’s completely out of control.)  And at least Bush was in office when the meltdown began, although if he can be blamed for pushing TARP, he can’t reasonably be blamed for the Fed keeping interest rates low and blowing multiple financial bubbles.\nAnyhow, it is quite clear that the electoral devastation about to be wreaked upon Democrats by Republicans (which, you may recall, I was one of the first to predict), is not going to have a salutary effect upon the situation because the Republican Party and the greater part of the Tea Party insist on believing that the perpetrators of the primary causal factor were among the victims.  They will surely dig in a different part of the hole than did the Democrats, but we can be confident that they will continue making it deeper.  The battle between Republicans and Democrats is an internecine battle between the Keynesians known as Neo-Keynesians and the Keynesians known as Monetarists.  Both sides subscribe to a false economic theory and both are beholden to the banks, and as both the names and the polls indicate, the Republicans are more strongly beholden to them than are the Democrats.\nThis means that Obama and the new Republican majorities, (or if I am only half-correct, House majority) will be eager to announce bipartisan cooperation in finding a means of saddling the taxpayer with TARP II, in which the cost of the fraudulent mortgage-backed security put-backs is shifted from the banks that committed the fraud to the taxpayer while their myriad of proven crimes are swept under the carpet.  And the passage of that heroic, bipartisan, and much-publicized “reform” will mark the effective end of the Tea Party, even if its zombie corpse remains an animated political identity for decades to come.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-29T08:27:00+00:00"
}