{
  "url": "https://voxday.net/2010/10/13/sam-harris-and-moral-landscape/",
  "scraped_at": "2026-01-08T23:39:50.382481",
  "title": "Sam Harris and The Moral Landscape",
  "date_display": "October 13, 2010",
  "date_iso": "2010-10-13T20:03:00+00:00",
  "date_from_url": "2010-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I suspect that some of you will be interested to hear that I picked up a copy of <i>The Moral Landscape: How Science Can Determine Human Values</i> by Sam Harris today.  I’m planning to finish reading Cicero’s letters before I dive into it, but you can anticipate a review in about two weeks or so.  I’ve also sent an email to his publicist requesting an interview; while Sam and I have exchanged email in the past, that’s on a different computer that is presently stowed away.  But note that any interview I do will be a non-critical one; it will not be a debate.  The point of a literary interview is to help the author accurately get the views expressed in his book out to the public, not to criticize them, and I’m not interested in limiting myself to interviewing authors with whom I more or less agree.</p><p>As you know, I refuse to pronounce judgment on a book, any book, without reading it, although I certainly don’t mind expressing my uninformed doubts should I have them prior to doing so.  In this case, I have to applaud Sam for having the intellectual courage to seize the bull by the horns; unlike his fellow New Atheists (except Daniel Dennett), he has recognized the weak point of the lack of universal warrant and is attempting to do something about it.  As to whether he has the intellectual firepower to successfully make his case, well, that may be another matter entirely.  We shall presently see.</p><p>I couldn’t quite resist reading the first page or three… and all I’m going to say at the moment is that it is clear that unlike his fellow atheist Michael Shermer, Sam is unfamiliar with the core concepts of the Austrian School of Economics.  Those who are familiar with how I operate and can put two and two together should be able to figure out why this seemingly unrelated field is relevant as well as where I’m going with this, in fact, I have even mentioned this specific issue in the past.  I also found two major – at this point, I shall merely describe them as <i>points of interest</i> – in the first three pages.</p><p>As for that sound you hear, it is merely the blades being sharpened.  Just in case they should turn out to be necessary, you understand.</p></div>",
  "content_text": "I suspect that some of you will be interested to hear that I picked up a copy of\nThe Moral Landscape: How Science Can Determine Human Values\nby Sam Harris today.  I’m planning to finish reading Cicero’s letters before I dive into it, but you can anticipate a review in about two weeks or so.  I’ve also sent an email to his publicist requesting an interview; while Sam and I have exchanged email in the past, that’s on a different computer that is presently stowed away.  But note that any interview I do will be a non-critical one; it will not be a debate.  The point of a literary interview is to help the author accurately get the views expressed in his book out to the public, not to criticize them, and I’m not interested in limiting myself to interviewing authors with whom I more or less agree.\nAs you know, I refuse to pronounce judgment on a book, any book, without reading it, although I certainly don’t mind expressing my uninformed doubts should I have them prior to doing so.  In this case, I have to applaud Sam for having the intellectual courage to seize the bull by the horns; unlike his fellow New Atheists (except Daniel Dennett), he has recognized the weak point of the lack of universal warrant and is attempting to do something about it.  As to whether he has the intellectual firepower to successfully make his case, well, that may be another matter entirely.  We shall presently see.\nI couldn’t quite resist reading the first page or three… and all I’m going to say at the moment is that it is clear that unlike his fellow atheist Michael Shermer, Sam is unfamiliar with the core concepts of the Austrian School of Economics.  Those who are familiar with how I operate and can put two and two together should be able to figure out why this seemingly unrelated field is relevant as well as where I’m going with this, in fact, I have even mentioned this specific issue in the past.  I also found two major – at this point, I shall merely describe them as\npoints of interest\n– in the first three pages.\nAs for that sound you hear, it is merely the blades being sharpened.  Just in case they should turn out to be necessary, you understand.",
  "tags": [
    "atheism",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-13T19:03:00+00:00"
}