{
  "url": "https://voxday.net/2010/10/28/training-in-action/",
  "scraped_at": "2026-01-08T23:41:13.327498",
  "title": "Training in action",
  "date_display": "October 28, 2010",
  "date_iso": "2010-10-28T16:30:00+00:00",
  "date_from_url": "2010-10-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> This is an interesting little clip of four clueless guys attempting to take on a guy who appears to possess a moderate amount of boxing experience.  Notice how he keeps moving sideways and backward into open space, only occasionally stepping forward when the opportunity, or in one case, the need, presents itself.  The most important thing is that he limits himself to short, quick jabs and crosses; by doing so he avoids committing completely to a strike and thereby leaving himself open.  He stays focused on defense throughout and does an excellent job of throwing his opponents down to the ground in order to buy himself more time and clear space whenever he can.</p><p>Now, imagine if the guy’s training had incorporated some jujitsu and he’d been throwing some elbows and the occasional low kick of his own instead of only punches… more than the one guy in the white would have been down.  Of course, the four guys should have surrounded him from the start, but they had no way of knowing he was a boxer and in the heat of the moment, it’s almost impossible for more than two people to coordinate their actions anyway.</p><p>For me, the best moment is when he steps into the white-shirted guy’s second attempt to kick him, catches him off balance on one leg, and puts him down.  It reminded me of how one fights a Tae Kwan Do kicker; the minute they plant and start to move their rear leg, <i>step in hard</i>.  It’s harder to do than it sounds, because the instinctive reaction is to step back.  And Mr. White Shirt is a perfect example of how not to fight.  He’s aggressive, but hapless, consistently leading with his face and telegraphing his moves so badly that not a single one of his five attacks even lands, let alone does any harm.</p><p>Compare that guy with <a href=\"http://viewstreetfights.com/wp-content/plugins/vipers-video-quicktags/resources/jw-flv-player/player.swf?file=http%3A%2F%2Fviewstreetfights.com%2Fwp-content%2Fuploads%2F2010%2F01%2Fboxervs2.flv\">this man defending his girlfriend</a>.  He also shows obvious signs of training, but demonstrates less situational awareness and fighting experience as well as inferior technique.  Part of this is because he is taking a more aggressive approach, but he makes the mistake of repeatedly extending himself and twice leaves himself open to an attack by the unengaged opponent, at one point even <i>turning his back</i> on the first guy he attacked.  He also leads with his rear hand twice; although he gets away with it here thanks to his opponents’ lack of training, trying that against the first guy would have almost surely met with the rude interruption of a jab to the face.</p><p>I was also surprised at his lack of finishing, as I was completely expecting him to kick the first guy in the face when he turned around at the end.  But then, the guy had gestured at him, so perhaps he was taught to go to submission rather than incapacitation.</p></div>",
  "content_text": "This is an interesting little clip of four clueless guys attempting to take on a guy who appears to possess a moderate amount of boxing experience.  Notice how he keeps moving sideways and backward into open space, only occasionally stepping forward when the opportunity, or in one case, the need, presents itself.  The most important thing is that he limits himself to short, quick jabs and crosses; by doing so he avoids committing completely to a strike and thereby leaving himself open.  He stays focused on defense throughout and does an excellent job of throwing his opponents down to the ground in order to buy himself more time and clear space whenever he can.\nNow, imagine if the guy’s training had incorporated some jujitsu and he’d been throwing some elbows and the occasional low kick of his own instead of only punches… more than the one guy in the white would have been down.  Of course, the four guys should have surrounded him from the start, but they had no way of knowing he was a boxer and in the heat of the moment, it’s almost impossible for more than two people to coordinate their actions anyway.\nFor me, the best moment is when he steps into the white-shirted guy’s second attempt to kick him, catches him off balance on one leg, and puts him down.  It reminded me of how one fights a Tae Kwan Do kicker; the minute they plant and start to move their rear leg,\nstep in hard\n.  It’s harder to do than it sounds, because the instinctive reaction is to step back.  And Mr. White Shirt is a perfect example of how not to fight.  He’s aggressive, but hapless, consistently leading with his face and telegraphing his moves so badly that not a single one of his five attacks even lands, let alone does any harm.\nCompare that guy with\nthis man defending his girlfriend\n.  He also shows obvious signs of training, but demonstrates less situational awareness and fighting experience as well as inferior technique.  Part of this is because he is taking a more aggressive approach, but he makes the mistake of repeatedly extending himself and twice leaves himself open to an attack by the unengaged opponent, at one point even\nturning his back\non the first guy he attacked.  He also leads with his rear hand twice; although he gets away with it here thanks to his opponents’ lack of training, trying that against the first guy would have almost surely met with the rude interruption of a jab to the face.\nI was also surprised at his lack of finishing, as I was completely expecting him to kick the first guy in the face when he turned around at the end.  But then, the guy had gestured at him, so perhaps he was taught to go to submission rather than incapacitation.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-28T15:30:00+00:00"
}