{
  "url": "https://voxday.net/2010/10/17/two-wrongs-and-rule-of-force/",
  "scraped_at": "2026-01-08T23:40:08.738729",
  "title": "Two wrongs and the Rule of Force",
  "date_display": "October 17, 2010",
  "date_iso": "2010-10-17T20:15:00+00:00",
  "date_from_url": "2010-10-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Karl Denninger explains why it is justifiable for people to begin <a href=\"http://market-ticker.org/akcs-www?post=169420\">seizing property on their own behalf</a>:</p><blockquote><p>Look, this is what happens when you sit idly by and countenance rampant and outrageous lawbreaking: The people decide they’ll do it too!…  Two wrongs don’t make a right – just more wrongs. But the lesson here isn’t that a couple and their kids “re-took” possession and claim their original foreclosure was “illegal.”  I don’t know if it was or wasn’t – what I know is that the chain of lawlessness didn’t start with them, and it is impossible to condemn their actions standing alone.</p><p>If the foreclosure was unlawful and initiated with “robosigned” and bogus documents then it was.  The Earls apparently attempted to demand a jury trial on the facts (including these facts) and were told to go to hell.  Someone hasn’t read their Constitution lately – it says that for all controversies exceeding $20, you have a right to a trial by jury (7th Amendment).  It doesn’t say that if it’s inconvenient for a bank and might expose criminal fraud for which bank officers could be imprisoned the judge can tell you to pound sand.  That, standing alone, broke the chain of lawful behavior in the instant case.</p><p>This is where lawlessness leads us – to more lawlessness.  Once you commit a lawless act against someone and are not punished for it you have invited them to retaliate with complete disregard for the law in their response.  You are only required to deal ethically and morally with an ethical and moral entity across the table – one who ignores the law loses their right to demand that respect in return.</p></blockquote><p>Two wrongs don’t make a right, but they do create both a justification and a motivation for human action.  Once the government refused to enforce the law that protected the people from the fraudulent depredations of the banks and then denied them their Constitutional right to a jury trial, it abrogated its right to demand that those same individuals behave in a reasonable and law-abiding manner.  It’s not a question of the Rule of Law since it is an observable fact that there is no law as such in the United States anymore, there is nothing more than the public pretense of law and the sporadic enforcement of that pretense on parties who do not belong to the government-favored classes.  The Rule of Law has been replaced by the much weaker and more delicate Rule of Force.</p><p>This is nothing new, as Cicero’s letters make it clear that the latter days of the Roman Republic featured a similarly dynamic and amorphous pretense of law.  America as you knew it, as you <i>imagined it to be</i>, is no more.  It has been gone for some time now and it was laid to rest by the same cancerous forces of greed, lawlessness, and ambition that have brought every other great society in human history to its eventual end.</p></div>",
  "content_text": "Karl Denninger explains why it is justifiable for people to begin\nseizing property on their own behalf\n:\nLook, this is what happens when you sit idly by and countenance rampant and outrageous lawbreaking: The people decide they’ll do it too!…  Two wrongs don’t make a right – just more wrongs. But the lesson here isn’t that a couple and their kids “re-took” possession and claim their original foreclosure was “illegal.”  I don’t know if it was or wasn’t – what I know is that the chain of lawlessness didn’t start with them, and it is impossible to condemn their actions standing alone.\nIf the foreclosure was unlawful and initiated with “robosigned” and bogus documents then it was.  The Earls apparently attempted to demand a jury trial on the facts (including these facts) and were told to go to hell.  Someone hasn’t read their Constitution lately – it says that for all controversies exceeding $20, you have a right to a trial by jury (7th Amendment).  It doesn’t say that if it’s inconvenient for a bank and might expose criminal fraud for which bank officers could be imprisoned the judge can tell you to pound sand.  That, standing alone, broke the chain of lawful behavior in the instant case.\nThis is where lawlessness leads us – to more lawlessness.  Once you commit a lawless act against someone and are not punished for it you have invited them to retaliate with complete disregard for the law in their response.  You are only required to deal ethically and morally with an ethical and moral entity across the table – one who ignores the law loses their right to demand that respect in return.\nTwo wrongs don’t make a right, but they do create both a justification and a motivation for human action.  Once the government refused to enforce the law that protected the people from the fraudulent depredations of the banks and then denied them their Constitutional right to a jury trial, it abrogated its right to demand that those same individuals behave in a reasonable and law-abiding manner.  It’s not a question of the Rule of Law since it is an observable fact that there is no law as such in the United States anymore, there is nothing more than the public pretense of law and the sporadic enforcement of that pretense on parties who do not belong to the government-favored classes.  The Rule of Law has been replaced by the much weaker and more delicate Rule of Force.\nThis is nothing new, as Cicero’s letters make it clear that the latter days of the Roman Republic featured a similarly dynamic and amorphous pretense of law.  America as you knew it, as you\nimagined it to be\n, is no more.  It has been gone for some time now and it was laid to rest by the same cancerous forces of greed, lawlessness, and ambition that have brought every other great society in human history to its eventual end.",
  "tags": [
    "banks",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-17T19:15:00+00:00"
}