{
  "url": "https://voxday.net/2010/10/19/warning-hamster-at-work/",
  "scraped_at": "2026-01-08T23:40:18.146546",
  "title": "Warning: hamster at work",
  "date_display": "October 19, 2010",
  "date_iso": "2010-10-19T10:29:00+00:00",
  "date_from_url": "2010-10-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is what it looks like when a woman’s rationalization hamster <a href=\"http://www.startribune.com/lifestyle/104726584.html?elr=KArks7PYDiaK7DUHPYDiaK7DUiacyKUzyaP37D_MDua_eyD5PcOiUr\">is actively at work</a>:</p><blockquote><p>I’m 23 years old and have been dating my boyfriend for just over two years. I love him, and I love spending time with him. He’s everything I’ve always wanted in a long-term partner: caring, intelligent, thoughtful and hardworking.</p><p>But lately, I can’t seem to shake this “antsy” feeling….  I’ve been thinking maybe it would be good for us to take a break so I could clear my head and figure out what I really want. Is that a disastrous idea?</p></blockquote><p>This is precisely why men should pay very little attention when women, particularly young unmarried women, tell them what they think they want.  What they want is very often mutually contradictory; shockingly few women fully grasp the basic concept of opportunity cost: IF you do X, THEN you cannot do Y.</p><p>Consider the “advice-seeker”, who isn’t actually seeking advice but rather permission/rational cover to do what she intends to do regardless of what anyone says.  She is at the peak of her attractiveness to men, she has already landed a man who provides “everything she wanted <i>in a long-term partner</i>“, but she is unable to shake an “antsy” feeling.  No doubt those familiar with Game theory were laughing when they read that, instantly recognizing what is quite clearly the usual desire to spend a few years riding the Alpha carousel.</p><p>Gammas and Deltas, note that it doesn’t matter in the least how perfect you are as a potential husband, gentleman, and provider.  In most cases, a woman’s decision about pursuing a long-term relationship has very little do with your own behavior within that relationship and everything to do with what holds the tie-breaking vote in her individual case, reason or the rationalization hamster.  Whereas reason will vote for a happy married life with the “caring, intelligent, thoughtful and hardworking” delta, the rationalization hamster is furiously throwing out one irrational “reason” after another to justify allowing herself to be mounted by a series of passing Alphas.  (Note: women seldom come right out and phrase it this clearly, they usually describe it as “being young”, “having fun”, “enjoying myself”, and occasionally “taking a break”.)</p><p>What the woman really wants is to spend the next four years riding the Alpha carousel, then to come back to her current boyfriend, who will of course have spent that time loyally pining away after her and will happily marry her when she is no longer sufficiently attractive to command the level of Alpha interest to which she has become accustomed.  It’s not an impossible dream, but it is a highly improbable one.  On an anecdotal note, I have NEVER seen any woman of my acquaintance over the age of 27 end up with a higher-quality, higher-status man than the highest-quality, highest-status man with whom she was seriously involved prior to that age.</p><p>Is “taking a break” a disastrous idea?  It all comes down to a woman’s time-preferences.  If peak short term pleasure is her absolute priority, then obviously the carousel is the way to go.  If greater long-term satisfaction is her objective, then yes, throwing away everything she’s always wanted in a long-term partner is almost criminally stupid.  (The complete uselessness of the female advice columnist goes without saying, which is why there is no need to comment upon what passes for her “advice”.)  And while it is certainly possible that marriage to her ideal delta may not work out as well as she imagines, it is also true that the carousel rides on offer may not turn out to be of the status/quality that she hopes for either.</p><p>This leads me to contemplating a related email in which GK asked about my acceptance of evolutionary psychology:</p><blockquote><p>My impression from what I’ve read of your writings is that you don’t believe in evolution but agree with some things that could fall under the umbrella of evolutionary psychology. E.g., the whole “game” thing — if I’m understanding you correctly — sounds very much like the kind of stuff you hear from the EP folk.</p><p>EP has a mechanism for explaining why a character trait that provides a selective advantage (e.g., women wanting to mate with the alpha male) would be passed on and come to dominate the population. Do you accept that general notion?  Of course it’s entirely possible to believe in evolutionary psychology and reject macro evolution. Is that your position?</p></blockquote><p>No, my belief in the utility of Game theory has absolutely nothing to do with evolutionary psychology, which I completely reject.  In fact, I outright reject evolutionary psychology whereas I am merely skeptical about evolution by (probably) natural selection.  The key phrase is “mechanism for explaining”, which means that evolutionary psychology is nothing more than creative fiction.  It has a scientific basis no stronger than the Biblical “Curse of Eve” and represents the confusion of “could” with “is”.  Is any one scenario posited by an evolutionary psychologist correct?  Perhaps.  But the total inability to provide any metric to determine the probability of the correctness of any given scenario renders it no more scientific or useful than 17th century Basque poetry.  The history of science is littered with many commonly accepted “coulds” that weren’t; for example the idea that tribes of European hunter-gathers adopted agriculture from the Middle East rather than <a href=\"http://isteve.blogspot.com/2010/10/are-europeans-all-middle-easterners.html\">being supplanted by Middle Eastern immigrants</a> is now being called into question.  Plus ça change….</p><p>This isn’t to say that it is worthless to attempt to discover the whys and wherefores behind the operation of Game.  But accepting the idea that something works is not tantamount to accepting every idea attempting to explain why it works.  It’s important to recall that the operative theory of Game preceded the attempts of amateur evolutionary psychologists to retroactively explain it.  At times, it appears that no few male scientists have little white rationalization lab rats of their own.</p></div>",
  "content_text": "This is what it looks like when a woman’s rationalization hamster\nis actively at work\n:\nI’m 23 years old and have been dating my boyfriend for just over two years. I love him, and I love spending time with him. He’s everything I’ve always wanted in a long-term partner: caring, intelligent, thoughtful and hardworking.\nBut lately, I can’t seem to shake this “antsy” feeling….  I’ve been thinking maybe it would be good for us to take a break so I could clear my head and figure out what I really want. Is that a disastrous idea?\nThis is precisely why men should pay very little attention when women, particularly young unmarried women, tell them what they think they want.  What they want is very often mutually contradictory; shockingly few women fully grasp the basic concept of opportunity cost: IF you do X, THEN you cannot do Y.\nConsider the “advice-seeker”, who isn’t actually seeking advice but rather permission/rational cover to do what she intends to do regardless of what anyone says.  She is at the peak of her attractiveness to men, she has already landed a man who provides “everything she wanted\nin a long-term partner\n“, but she is unable to shake an “antsy” feeling.  No doubt those familiar with Game theory were laughing when they read that, instantly recognizing what is quite clearly the usual desire to spend a few years riding the Alpha carousel.\nGammas and Deltas, note that it doesn’t matter in the least how perfect you are as a potential husband, gentleman, and provider.  In most cases, a woman’s decision about pursuing a long-term relationship has very little do with your own behavior within that relationship and everything to do with what holds the tie-breaking vote in her individual case, reason or the rationalization hamster.  Whereas reason will vote for a happy married life with the “caring, intelligent, thoughtful and hardworking” delta, the rationalization hamster is furiously throwing out one irrational “reason” after another to justify allowing herself to be mounted by a series of passing Alphas.  (Note: women seldom come right out and phrase it this clearly, they usually describe it as “being young”, “having fun”, “enjoying myself”, and occasionally “taking a break”.)\nWhat the woman really wants is to spend the next four years riding the Alpha carousel, then to come back to her current boyfriend, who will of course have spent that time loyally pining away after her and will happily marry her when she is no longer sufficiently attractive to command the level of Alpha interest to which she has become accustomed.  It’s not an impossible dream, but it is a highly improbable one.  On an anecdotal note, I have NEVER seen any woman of my acquaintance over the age of 27 end up with a higher-quality, higher-status man than the highest-quality, highest-status man with whom she was seriously involved prior to that age.\nIs “taking a break” a disastrous idea?  It all comes down to a woman’s time-preferences.  If peak short term pleasure is her absolute priority, then obviously the carousel is the way to go.  If greater long-term satisfaction is her objective, then yes, throwing away everything she’s always wanted in a long-term partner is almost criminally stupid.  (The complete uselessness of the female advice columnist goes without saying, which is why there is no need to comment upon what passes for her “advice”.)  And while it is certainly possible that marriage to her ideal delta may not work out as well as she imagines, it is also true that the carousel rides on offer may not turn out to be of the status/quality that she hopes for either.\nThis leads me to contemplating a related email in which GK asked about my acceptance of evolutionary psychology:\nMy impression from what I’ve read of your writings is that you don’t believe in evolution but agree with some things that could fall under the umbrella of evolutionary psychology. E.g., the whole “game” thing — if I’m understanding you correctly — sounds very much like the kind of stuff you hear from the EP folk.\nEP has a mechanism for explaining why a character trait that provides a selective advantage (e.g., women wanting to mate with the alpha male) would be passed on and come to dominate the population. Do you accept that general notion?  Of course it’s entirely possible to believe in evolutionary psychology and reject macro evolution. Is that your position?\nNo, my belief in the utility of Game theory has absolutely nothing to do with evolutionary psychology, which I completely reject.  In fact, I outright reject evolutionary psychology whereas I am merely skeptical about evolution by (probably) natural selection.  The key phrase is “mechanism for explaining”, which means that evolutionary psychology is nothing more than creative fiction.  It has a scientific basis no stronger than the Biblical “Curse of Eve” and represents the confusion of “could” with “is”.  Is any one scenario posited by an evolutionary psychologist correct?  Perhaps.  But the total inability to provide any metric to determine the probability of the correctness of any given scenario renders it no more scientific or useful than 17th century Basque poetry.  The history of science is littered with many commonly accepted “coulds” that weren’t; for example the idea that tribes of European hunter-gathers adopted agriculture from the Middle East rather than\nbeing supplanted by Middle Eastern immigrants\nis now being called into question.  Plus ça change….\nThis isn’t to say that it is worthless to attempt to discover the whys and wherefores behind the operation of Game.  But accepting the idea that something works is not tantamount to accepting every idea attempting to explain why it works.  It’s important to recall that the operative theory of Game preceded the attempts of amateur evolutionary psychologists to retroactively explain it.  At times, it appears that no few male scientists have little white rationalization lab rats of their own.",
  "tags": [
    "science",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-19T09:29:00+00:00"
}