{
  "url": "https://voxday.net/2010/10/25/why-tea-party-is-female/",
  "scraped_at": "2026-01-08T23:40:56.870623",
  "title": "Why the Tea Party is female",
  "date_display": "October 25, 2010",
  "date_iso": "2010-10-25T20:30:00+00:00",
  "date_from_url": "2010-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>RT notices something:</p><blockquote><p>Is it just my imagination, or is the Tea party dominated by women? I have always regarded the Republican party as the masculine side of the equation, and the Democrat Party as the feminine. The Tea party, which threatens to supplant the Republican party seems to be dominated by rough, opinionated, conservative women. It certainly is where I live, and even in my state, and I get the impression that’s the case nationally. The impetus seems to be coming from women who hold the limelight and get all the work done. Is that because men are abandoning politics, or is it because they have become feminized?</p></blockquote><p>The Tea Party is mostly female because it is a mass entry into politics by a portion of the electorate that has historically been politically ignorant and inert.  It is mostly middle class and female because it is made up of people who have the time and resources to get involved with political activism; these are the wives of the middle class men whose economic interests have suffered and are less likely to be able to put in the time and effort involved.</p><p>Since it is a female-driven movement, we can be confident that it will quickly lose its focus and be seduced away from its nominal purpose by callous and cold-hearted men, <a href=\"http://market-ticker.org/akcs-www?post=170167\">as Karl Denninger has already noted</a>.  This assumption is supported by the fact that Sarah Palin is the current darling of the Tea Party, the very woman who <i>suspended her campaign for vice-president</i> in order to permit John McCain to rush back to Washington and help the Bush administration and the Congressional Democrats hold down the American taxpayer for their financial raping by the banking industry.  The idea that a woman who supported TARP and the bank bailouts and believes that government inaction is not an option during times of economic difficulty will not turn around and betray a movement of political neophytes at the first opportunity defies belief.</p><p>The other reason, of course, is that men are much more skeptical than women.  I have said from the beginning that the Tea Party will prove ineffectual and have seen no evidence to alter my thinking in the least.  (Remember, I predicted that the Republicans would regain the House and Senate months ago; the Tea Party is a consequential factor, not a causal one.)  While many women are finally cognizant of the cancerous state of America, they are still ignorant enough to believe that politics can be the cure.  But while it’s not impossible, it is highly improbable.</p><p>The fact that many, if not most, Tea Partiers still support The Global Struggle Against Violent Extremism after nine years of near-total futility tells you all you need to know about their eventual effectiveness.  Hell, half of them are probably concerned about defending the banks <i>from Obama</i>.</p><p>In conclusion, I quote Britain’s finest politician, Daniel Hannan: <i>“[T]he reason there is a Tea Party here is not because of some perverse American characteristic of being anti-tax. It’s that people think that they can do something about it through the ballot box.”</i></p><p>It sounds inspiring.  It <i>is</i> inspiring.  But the key word there is “think”.</p></div>",
  "content_text": "RT notices something:\nIs it just my imagination, or is the Tea party dominated by women? I have always regarded the Republican party as the masculine side of the equation, and the Democrat Party as the feminine. The Tea party, which threatens to supplant the Republican party seems to be dominated by rough, opinionated, conservative women. It certainly is where I live, and even in my state, and I get the impression that’s the case nationally. The impetus seems to be coming from women who hold the limelight and get all the work done. Is that because men are abandoning politics, or is it because they have become feminized?\nThe Tea Party is mostly female because it is a mass entry into politics by a portion of the electorate that has historically been politically ignorant and inert.  It is mostly middle class and female because it is made up of people who have the time and resources to get involved with political activism; these are the wives of the middle class men whose economic interests have suffered and are less likely to be able to put in the time and effort involved.\nSince it is a female-driven movement, we can be confident that it will quickly lose its focus and be seduced away from its nominal purpose by callous and cold-hearted men,\nas Karl Denninger has already noted\n.  This assumption is supported by the fact that Sarah Palin is the current darling of the Tea Party, the very woman who\nsuspended her campaign for vice-president\nin order to permit John McCain to rush back to Washington and help the Bush administration and the Congressional Democrats hold down the American taxpayer for their financial raping by the banking industry.  The idea that a woman who supported TARP and the bank bailouts and believes that government inaction is not an option during times of economic difficulty will not turn around and betray a movement of political neophytes at the first opportunity defies belief.\nThe other reason, of course, is that men are much more skeptical than women.  I have said from the beginning that the Tea Party will prove ineffectual and have seen no evidence to alter my thinking in the least.  (Remember, I predicted that the Republicans would regain the House and Senate months ago; the Tea Party is a consequential factor, not a causal one.)  While many women are finally cognizant of the cancerous state of America, they are still ignorant enough to believe that politics can be the cure.  But while it’s not impossible, it is highly improbable.\nThe fact that many, if not most, Tea Partiers still support The Global Struggle Against Violent Extremism after nine years of near-total futility tells you all you need to know about their eventual effectiveness.  Hell, half of them are probably concerned about defending the banks\nfrom Obama\n.\nIn conclusion, I quote Britain’s finest politician, Daniel Hannan:\n“[T]he reason there is a Tea Party here is not because of some perverse American characteristic of being anti-tax. It’s that people think that they can do something about it through the ballot box.”\nIt sounds inspiring.  It\nis\ninspiring.  But the key word there is “think”.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-25T19:30:00+00:00"
}