{
  "url": "https://voxday.net/2010/10/11/wnd-column_11-4/",
  "scraped_at": "2026-01-08T23:39:32.922916",
  "title": "WND column",
  "date_display": "October 11, 2010",
  "date_iso": "2010-10-11T07:31:00+00:00",
  "date_from_url": "2010-10-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b><a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=213757\">A Den of Vipers and Thieves</a></b></p><p><i>“Gentlemen, I have had men watching you for a long time and I am convinced that you have used the funds of the bank to speculate in the breadstuffs of the country. When you won, you divided the profits amongst you, and when you lost, you charged it to the bank. You tell me that if I take the deposits from the bank and annul its charter, I shall ruin ten thousand families. That may be true, gentlemen, but that is your sin! Should I let you go on, you will ruin fifty thousand families, and that would be my sin! You are a den of vipers and thieves.”</i><br> – Andrew Jackson</br></p><p>The French famously say that the more things change, the more they stay the same. While the particular form that the latest banking fraud has taken is different – there were no option ARMs, mortgage-backed security tranches or electronic mortgage registration systems in the 1830s – the United States found itself similarly afflicted by the financial predations of a private central bank.</p><p> ADDENDUM TO THE COLUMN:  Unsurprisingly, those freedom-loving Republicans and champions of the Rule of Law in the conservative media are following the grand tradition of presidential candidate John McCain by rushing to the wrong side of the issue and the defense of the impoverished bankers of Wall Street.</p><p><i>Talk about a financial scandal. A consumer borrows money to buy a house, doesn’t make the mortgage payments, and then loses the house in foreclosure—only to learn that the wrong guy at the bank signed the foreclosure paperwork. Can you imagine? The affidavit was supposed to be signed by the nameless, faceless employee in the back office who reviewed the file, not the other nameless, faceless employee who sits in the front. </i><br> – <a href=\"http://online.wsj.com/article/SB10001424052748704696304575538440995389092.html?mod=WSJ_hps_sections_opinion\">The Wall Street Journal</a></br></p><p><i>The No. 2 House Republican, Rep. Eric Cantor of Virginia, said a national moratorium would remove the protections that lenders need.  “You’re going to shut down the housing industry” with a national stoppage, Cantor said. “People have to take responsibility for themselves.”</i><br> – <a href=\"http://news.yahoo.com/s/ap/20101010/ap_on_bi_ge/us_foreclosures_white_house\">The Associated Press</a></br></p><p>This is pure banking propaganda.  The idea that the foreclosure fraud is simply a little clerical error and that homeowners are attempting to capitalize on a minor issue of missing paperwork is a blatant and shameless lie.  The mere fact of their focus on the borrowing parties rather than the banks is proof that they are intentionally evading the real issue.  Karl Denninger, who has been on this for three years now, <a href=\"http://market-ticker.org/akcs-www?blog=Market-Ticker&amp;page=2\">explains it more succinctly</a> than anyone. <i>“The issue is not about which paper-pusher signed documents.  The issue is whether the origination and securitization of this paper in the first instance was fraudulent, and whether we now we have a Watergate-style coverup of what a gang of brigands did to steal literal trillions of dollars!”</i> As he further elucidates, there are three primary parts to the problem; notice that the latter two have <i>absolutely nothing</i> to do with the borrowers that the Republican Cantor declares must “take responsibility for themselves”.  But if a poor Hispanic family living in an overpriced house have to take responsibility for themselves, why don’t the bankers who are holding Cantor’s leash have to do likewise?</p><blockquote><p>1.  Borrowers overstated income, assets or both.  In some cases they did so willingly and knowingly.  In others loan officers changed numbers to “ram it through” the computer-operated approval systems, submitting files multiple times while doctoring figures.  In the latter case perhaps the borrower knew, perhaps not – many people didn’t read the entire 100+ page stack of paper at closing.  That’s dumb but it’s not criminal.  Changing the figures or lying, on the other hand, is criminal.</p><p>2.  Lenders stuffed paper they either knew was bad or had the ability and legal duty to verify the provenance of but intentionally did not into securities sold to investors.  This has been disclosed in FCIC hearings and is no longer speculative, although as I noted in 2007 it had to be the case because it was the only way the deals that were being done could have possibly been done.  This was an act of deception and in my opinion (along with many others, including plenty of attorneys) meets the legal definition of fraud.</p><p>3.  The land title system in this nation was intentionally subverted and corrupted by both intentional act and intentional laziness, all driven by the motive of profit.  Original paperwork was either shipped overseas or intentionally destroyed.  In even more cases it was not conveyed as legally required by the trust documents.  This has massively-corrupted the chain of title for perhaps as much as one third to one half of all residential housing units in this country and if not corrected will render these homes unmarketable in the future.  This is the vastly unappreciated problem with what has been done to date.</p></blockquote><p>If the Republican leadership is dumb enough to attempt to defend this large-scale banking fraud against the interests of defaulting homeowners and responsible taxpayers alike, they’re going to risk throwing away the entire advantage that they have derived from two years of Obama’s political incompetence.  This is the one thing they could do that would force the Tea Partiers to leave the Republican Party and transform into a genuine third party.  And it’s not impossible; remember, it was a Republican who introduced HR3808 and it was the Republican leadership that was complicit in allowing it to pass on an unrecorded voice vote.</p></div>",
  "content_text": "A Den of Vipers and Thieves\n“Gentlemen, I have had men watching you for a long time and I am convinced that you have used the funds of the bank to speculate in the breadstuffs of the country. When you won, you divided the profits amongst you, and when you lost, you charged it to the bank. You tell me that if I take the deposits from the bank and annul its charter, I shall ruin ten thousand families. That may be true, gentlemen, but that is your sin! Should I let you go on, you will ruin fifty thousand families, and that would be my sin! You are a den of vipers and thieves.”\n– Andrew Jackson\nThe French famously say that the more things change, the more they stay the same. While the particular form that the latest banking fraud has taken is different – there were no option ARMs, mortgage-backed security tranches or electronic mortgage registration systems in the 1830s – the United States found itself similarly afflicted by the financial predations of a private central bank.\nADDENDUM TO THE COLUMN:  Unsurprisingly, those freedom-loving Republicans and champions of the Rule of Law in the conservative media are following the grand tradition of presidential candidate John McCain by rushing to the wrong side of the issue and the defense of the impoverished bankers of Wall Street.\nTalk about a financial scandal. A consumer borrows money to buy a house, doesn’t make the mortgage payments, and then loses the house in foreclosure—only to learn that the wrong guy at the bank signed the foreclosure paperwork. Can you imagine? The affidavit was supposed to be signed by the nameless, faceless employee in the back office who reviewed the file, not the other nameless, faceless employee who sits in the front.\n–\nThe Wall Street Journal\nThe No. 2 House Republican, Rep. Eric Cantor of Virginia, said a national moratorium would remove the protections that lenders need.  “You’re going to shut down the housing industry” with a national stoppage, Cantor said. “People have to take responsibility for themselves.”\n–\nThe Associated Press\nThis is pure banking propaganda.  The idea that the foreclosure fraud is simply a little clerical error and that homeowners are attempting to capitalize on a minor issue of missing paperwork is a blatant and shameless lie.  The mere fact of their focus on the borrowing parties rather than the banks is proof that they are intentionally evading the real issue.  Karl Denninger, who has been on this for three years now,\nexplains it more succinctly\nthan anyone.\n“The issue is not about which paper-pusher signed documents.  The issue is whether the origination and securitization of this paper in the first instance was fraudulent, and whether we now we have a Watergate-style coverup of what a gang of brigands did to steal literal trillions of dollars!”\nAs he further elucidates, there are three primary parts to the problem; notice that the latter two have\nabsolutely nothing\nto do with the borrowers that the Republican Cantor declares must “take responsibility for themselves”.  But if a poor Hispanic family living in an overpriced house have to take responsibility for themselves, why don’t the bankers who are holding Cantor’s leash have to do likewise?\n1.  Borrowers overstated income, assets or both.  In some cases they did so willingly and knowingly.  In others loan officers changed numbers to “ram it through” the computer-operated approval systems, submitting files multiple times while doctoring figures.  In the latter case perhaps the borrower knew, perhaps not – many people didn’t read the entire 100+ page stack of paper at closing.  That’s dumb but it’s not criminal.  Changing the figures or lying, on the other hand, is criminal.\n2.  Lenders stuffed paper they either knew was bad or had the ability and legal duty to verify the provenance of but intentionally did not into securities sold to investors.  This has been disclosed in FCIC hearings and is no longer speculative, although as I noted in 2007 it had to be the case because it was the only way the deals that were being done could have possibly been done.  This was an act of deception and in my opinion (along with many others, including plenty of attorneys) meets the legal definition of fraud.\n3.  The land title system in this nation was intentionally subverted and corrupted by both intentional act and intentional laziness, all driven by the motive of profit.  Original paperwork was either shipped overseas or intentionally destroyed.  In even more cases it was not conveyed as legally required by the trust documents.  This has massively-corrupted the chain of title for perhaps as much as one third to one half of all residential housing units in this country and if not corrected will render these homes unmarketable in the future.  This is the vastly unappreciated problem with what has been done to date.\nIf the Republican leadership is dumb enough to attempt to defend this large-scale banking fraud against the interests of defaulting homeowners and responsible taxpayers alike, they’re going to risk throwing away the entire advantage that they have derived from two years of Obama’s political incompetence.  This is the one thing they could do that would force the Tea Partiers to leave the Republican Party and transform into a genuine third party.  And it’s not impossible; remember, it was a Republican who introduced HR3808 and it was the Republican leadership that was complicit in allowing it to pass on an unrecorded voice vote.",
  "tags": [
    "banks",
    "WND"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-11T06:31:00+00:00"
}