{
  "url": "https://voxday.net/2010/10/29/women-hate-freedo/",
  "scraped_at": "2026-01-08T23:41:18.802875",
  "title": "Women oppose freedom",
  "date_display": "October 29, 2010",
  "date_iso": "2010-10-29T14:30:00+00:00",
  "date_from_url": "2010-10-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is no way to avoid this obvious conclusion.  The vast majority of women are absolutely and diametrically opposed to every form of freedom unless it happens to align with what she happens to want to do at the moment.  One of the latest feminist calls to arms is <a href=\"http://www.nbcnewyork.com/news/local-beat/NYC-Considers-a-Not-Catcall-Zone-106135039.html?dr\">this direct assault on the freedom of speech</a>:</p><blockquote><p>Whistles, catcalls and lewd come-ons from strangers are all too familiar to New York City women, who say they are harassed multiple times a day as they walk down the street. Now lawmakers are examining whether to do something to discourage it.  A City Council committee heard testimony Thursday from women who said men regularly follow them, yell at them and make them feel unsafe and uncomfortable. Advocates told stories of preteens and teenagers being hounded by adult men outside city schools and pleaded for government to address the problem.</p></blockquote><p>Problem?  What problem?  A man is merely exercising his Constitutional right to free speech in a public place that happens to make a woman <i>feel unsafe and uncomfortable</i> is a <i>problem</i> that the state must solve?  I feel a lot more than a little unsafe and uncomfortable when a man is exercising his Constitutional right to free speech in a public place in order to advocate higher taxes, more bank bailouts, more gun laws, and more government intervention.  If we’re going to throw out the freedom of speech and ban the dangerous sort, let’s ban that kind of talk first and then we can worry about whistles and catcalls.</p><p>Men who value human freedom must staunchly oppose all forms of equality, particularly sexual equality, for three reasons:</p><p>1.  Equality does not exist in any material, legal, or spiritual form.<br> 2.  Equalitarianism is the primary reason for the material decline of the quasi-democratic West as well as its decreasing freedom.<br> 3.  Most women do not believe in equality themselves and have historically used the concept as a stalking horse for imposing statism in order to ensure privileged female status through government force.  For example, consider <a href=\"http://newstaging.spectator.widearea.co.uk/the-magazine/features/6391918/whos-the-daddy.thtml\">the female opposition</a> to DNA-based paternity testing:</br></br></p><p><i>“DNA tests are an anti-feminist appliance of science, a change in the balance of power between the sexes that we’ve hardly come to terms with. And that holds true even though many women have the economic potential to provide for their children themselves…Uncertainty allows mothers to select for their children the father who would be best for them. The point is that paternity was ambiguous and it was effectively up to the mother to name her child’s father, or not… Many men have, of course, ended up raising children who were not genetically their own, but really, does it matter…in making paternity conditional on a test rather than the say-so of the mother, it has removed from women a powerful instrument of choice.”</i></p><p>I should be very interested in seeing anyone attempt to make a rational case for how human freedom can be expanded by ensuring that a sizable portion of the electorate is vehemently opposed to nearly every aspect of it.</p></div>",
  "content_text": "There is no way to avoid this obvious conclusion.  The vast majority of women are absolutely and diametrically opposed to every form of freedom unless it happens to align with what she happens to want to do at the moment.  One of the latest feminist calls to arms is\nthis direct assault on the freedom of speech\n:\nWhistles, catcalls and lewd come-ons from strangers are all too familiar to New York City women, who say they are harassed multiple times a day as they walk down the street. Now lawmakers are examining whether to do something to discourage it.  A City Council committee heard testimony Thursday from women who said men regularly follow them, yell at them and make them feel unsafe and uncomfortable. Advocates told stories of preteens and teenagers being hounded by adult men outside city schools and pleaded for government to address the problem.\nProblem?  What problem?  A man is merely exercising his Constitutional right to free speech in a public place that happens to make a woman\nfeel unsafe and uncomfortable\nis a\nproblem\nthat the state must solve?  I feel a lot more than a little unsafe and uncomfortable when a man is exercising his Constitutional right to free speech in a public place in order to advocate higher taxes, more bank bailouts, more gun laws, and more government intervention.  If we’re going to throw out the freedom of speech and ban the dangerous sort, let’s ban that kind of talk first and then we can worry about whistles and catcalls.\nMen who value human freedom must staunchly oppose all forms of equality, particularly sexual equality, for three reasons:\n1.  Equality does not exist in any material, legal, or spiritual form.\n2.  Equalitarianism is the primary reason for the material decline of the quasi-democratic West as well as its decreasing freedom.\n3.  Most women do not believe in equality themselves and have historically used the concept as a stalking horse for imposing statism in order to ensure privileged female status through government force.  For example, consider\nthe female opposition\nto DNA-based paternity testing:\n“DNA tests are an anti-feminist appliance of science, a change in the balance of power between the sexes that we’ve hardly come to terms with. And that holds true even though many women have the economic potential to provide for their children themselves…Uncertainty allows mothers to select for their children the father who would be best for them. The point is that paternity was ambiguous and it was effectively up to the mother to name her child’s father, or not… Many men have, of course, ended up raising children who were not genetically their own, but really, does it matter…in making paternity conditional on a test rather than the say-so of the mother, it has removed from women a powerful instrument of choice.”\nI should be very interested in seeing anyone attempt to make a rational case for how human freedom can be expanded by ensuring that a sizable portion of the electorate is vehemently opposed to nearly every aspect of it.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-10-29T13:30:00+00:00"
}