{
  "url": "https://voxday.net/2022/06/11/%e5%a4%a9%e9%9f%b3/",
  "scraped_at": "2026-01-08T13:21:36.075058",
  "title": "天音",
  "date_display": "June 11, 2022",
  "date_iso": "2022-06-11T10:25:59+00:00",
  "date_from_url": "2022-06-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Chinese Ilk have created <a href=\"https://voxdaychinese.wordpress.com/\">a translated variant of this blog</a>, which is going to become increasingly important as it belatedly dawns upon everyone that the winner of the Russ-Ukrainian-NATO war and ultimate successor to the neo-liberal world order is China. That East Asian Studies major is turning out to be rather useful after all, although definitely not in the way I expected.</p><p>It’s going to be a long time, probably decades, before most Americans and Europeans understand, much less accept, this, of course. After all, there are still British people who genuinely believe that Great Britain is a major world power.</p><p>Welcome to Chung Kuo.</p><p><strong>UPDATE: </strong>Chinese-speaking Ilk have also added a Simplified Chinese version on Weibo <a href=\"https://weibo.com/u/7764280225\">天音 (微博)</a>.</p><p><em><a href=\"https://social.infogalactic.com/micropost/5c01493d-14f4-4d33-a40f-5900e3981fa2\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Chinese Ilk have created\na translated variant of this blog\n, which is going to become increasingly important as it belatedly dawns upon everyone that the winner of the Russ-Ukrainian-NATO war and ultimate successor to the neo-liberal world order is China. That East Asian Studies major is turning out to be rather useful after all, although definitely not in the way I expected.\nIt’s going to be a long time, probably decades, before most Americans and Europeans understand, much less accept, this, of course. After all, there are still British people who genuinely believe that Great Britain is a major world power.\nWelcome to Chung Kuo.\nUPDATE:\nChinese-speaking Ilk have also added a Simplified Chinese version on Weibo\n天音 (微博)\n.\nDISCUSS ON SG",
  "tags": [
    "China"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-11T22:10:52+00:00"
}