{
  "url": "https://voxday.net/2022/06/01/a-portrait-in-criminal-defamation/",
  "scraped_at": "2026-01-08T13:20:37.345595",
  "title": "A Portrait in Criminal Defamation",
  "date_display": "June 1, 2022",
  "date_iso": "2022-06-01T19:36:53+00:00",
  "date_from_url": "2022-06-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Earlier today, I received an email from someone named Roland Gamp, which quoted an email from someone else named Catherine Boss, supposedly sent on Monday, which I did not see or receive. He wrote:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>My colleague Catherine Boss sent you an enquiry on Monday (see email below). Unfortunately, we have not yet received a reply from you to our questions. In the meantime, we have found further statements from you which make your radical right-wing stance clear and which are racist, sexist and discriminatory. We would like once again to give you the opportunity to comment. We are extending the deadline and you could respond until 4 pm today in the afternoon. If we do not hear anything by then, we will note in the article that you have not responded to requests.</p><p>Thank you very much and kind regards,</p><p>Roland Gamp<br/>Reporter Recherchedesk Tamedia<br/>+41 79 [redacted] (Mobile)<br/>roland.gamp@tamedia.ch</p><p>Tamedia AG, Werdstrasse 21, CH-8021 Zürich</p></blockquote><p>I responded to him as follows.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Dear Mr. Gamp and Ms Boss,</p><p>I am pleased to respond to your request for comment. Please note in your article that I have responded in a timely manner to your urgent request and be very sure to accurately quote my following response to you in full.</p><p>“I look forward to the opportunity to file a criminal defamation complaint against Mr. Roland Gamp and Ms Catherine Boss, as well as their employer, the TX Group media house, under Articles 173 and 177 of the Swiss Criminal Code.”</p><p>Regards,<br/>Vox Day</p></blockquote><p>Amusingly enough, these intrepid reporters appeared to take my clear warning that they were about to step over the line of criminal defamation in Switzerland as mere rhetoric. Which is to say that they did not quote my response, as I specifically required, and instead ran an error-filled hit piece attempting to discredit me as a “misogynist” and a Hitler sympathist, among other things, as well as demanding my prosecution by the authorities for offenses “against the anti-racist norm.”</p><p>Needless to say, the Legal Legion is already on the case and we will definitely be filing criminal complaints of defamation (Article 173) and insult (Article 177) against Messrs. Sylvain Besson and Roland Gamp, and Ms Catherine Boss.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong><a href=\"https://www.tdg.ch/une-figure-de-la-droite-radicale-americaine-sempare-dun-chateau-suisse-896279767594\">A figure of the American radical right takes over a Swiss castle</a></strong><br/>The castle of Cressier, in Fribourg, has been bought by the misogynist and nationalist blogger Vox Day. He wants to turn it into a hotel to accommodate his supporters. The Commune says “to monitor the situation”.</p><p>It is a place full of history and, according to the Confederation, a “cultural property of national importance”. The castle of Cressier, in the canton of Fribourg, is a delightful residence of blonde stone, with rooms decorated with frescoes and surrounded by a vast garden. It has just been bought by a foreigner, and not just any foreigner: its new owner is a prominent blogger of the American radical right, who intends to save “white people”.</p><p>He is 53 years old and lives with his family in the Broye region of Vaud. He presents himself as a philosopher, editor and author, notably of comic books and video games. He speaks only under his pen name, Vox Day.</p><p>In the United States, Vox Day is considered an important representative of the alt-right, which has gained visibility in the wake of Donald Trump. According to American researcher Damon Berry, Vox Day defines the alt-right as nationalist, opposed to globalization, gender equality, and committed to the “right to exist” of ethnically homogenous states. This places it on the extreme right of the European political spectrum.</p><p>On the internet, Vox Day summarizes the alt-right – to which he avoids being directly attached – as the defense of “the existence of the white man and the future of white children”. The blogger also confesses a certain admiration for Adolf Hitler. “National Socialism is not only human logic, it is also much more logical and true than communism, feminism or secular Zionism,” the Minnesota-born American writes on his blog.</p><p>That Vox Day has set its sights on the Château de Cressier is perhaps no accident. The old house belonged for a long time to Gonzague de Reynold, a conservative writer from Fribourg, an admirer of the authoritarian regimes of the 1930s, who became a leading figure of the Swiss “spiritual defense” during the Second World War.</p><p>On social networks, the list of extremist and misogynistic statements of Vox Day is long. In 2015, he stated in an interview that African-Americans are genetically 500 times more likely than white Americans to be prone to violence. After an Islamist attack in Manchester in 2017, he posts a photo of Norwegian Anders Behring Breivik, the right-wing extremist who killed 69 young people on the Norwegian island of Utøya, with the caption, “Saint Breivik, pray for us.”</p><p>Vox Day has no problem displaying a retrograde view of women. “If a society cannot persuade women to marry, bear and raise children, it has no choice but to force them to do so or die,” he wrote in a tweet that has since been made inaccessible, as Vox Day has been banned from Twitter.</p><p>On the war in Ukraine, his opinion is just as clear-cut: the aggression is the work of “imperial America”, which has put Russia in a situation of compulsion. He calls the West “Clown World”, while Russia would represent “Sovereign World”. At the end of February, he titled his blog, “Grandiose stupidity in Switzerland.” And criticized the fact that the President of the Confederation Ignazio Cassis has sided with the European Union sanctions.</p><p>Finally, Vox Day posts the same opinions about the coronavirus pandemic. The vaccine has killed more people than Covid itself, he wrote in March.</p><p>Where does Vox Day publish his tirades from? On the internet, he gives the impression of living in Italy. But our research shows that the right-wing populist and his family of five have been living in the countryside of the Broye vaudoise for over ten years.</p><p>His messages are aimed at an American audience, but he is clearly broadcasting them from Switzerland. This raises the question of whether some of his statements fall under the anti-racist norm. This type of offence must be prosecuted by the authorities. To date, we are not aware of any proceedings against him.</p><p>Vox Day has been expelled from the American Science Fiction Writers Club. He is also blocked from Twitter. Instead, he developed the site “Infogalactic”, described as a “Wikipedia for the alt-right” by the “Washington Post”. He also created a social network, “Social Galactic”, which is owned by a company in Zug.</p><p>For the time being, the historic monument is already available for rent, for about 400 francs per night. In Cressier, the Commune only recently learned that the castle was available for rent, after having conducted research. They thought that the family of T. B. would eventually move from the canton of Vaud to Cressier.</p><p>For the commune’s mayor, David Humair, the case presents a “challenge,” as he puts it. But so far, we have had absolutely no problems with the new owners,” he says. And as long as it stays that way, I don’t see any need to act.” He’s not responsible for the political stance of his residents; that’s their private business, the mayor says again. “But we are carefully monitoring the situation since the arrival of this person in Cressier and we are ready to take action if necessary,” he says. Without specifying what exactly he means by that.</p><p>As for Vox Day, he refused to answer our questions, contenting himself with threatening us with a criminal complaint for defamation.</p><p>In Switzerland, Vox Day’s ideology is disseminated in books that can be purchased from the Zurich publisher Orell Füssli. On its website, the American author offers “Cuckservative”, a book that shows “how 50 years of immigration has lowered the average IQ in the United States”. Orell Füssli explains that it does not ban books from its catalog because of the authors’ personal opinions. A wide range of books contributes to the diversity of opinions, according to the publisher. Which says only two Vox Day books have been sold on its site since 2016.</p></blockquote><p>Swiss SJWs are at least a decade behind their US counterparts, who have learned to be considerably more careful before swinging for the fences like this. How many errors did you notice? I count 12 factual errors and 3 egregious misrepresentations, but I may have missed one or two. They also haven’t gotten the message from the US media that a) the once-terrifying Alt-Right is now a well-coiffed CNN mouthpiece, and b) the threat to Clown World doesn’t just come from sovereign nations such as China and Russia, but also Christian Nationalists like yours truly.</p><p>Unsurprisingly, this inept hit piece relies upon both misinformation and disinformation, omitting the aspects of my words that provide the obvious context necessary to understand their meaning. For example, it’s not hard to see how this sentence could be portrayed as “a certain admiration for Hitler”, right?</p><p><em>“National Socialism is not only human logic, it is also much more logical and true than communism, feminism or secular Zionism.”</em></p><p>But you’d have to be profoundly dishonest to do so, since it cannot reasonably be portrayed that way once <em>the very next sentence</em> is quoted. See the post dated <a href=\"https://voxday.net/2015/03/17/adolf-hitler-published-author/\">17 March 2015.</a></p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Salomon’s statement [that <em>Mein Kampf </em>is outside human logic] is more outrageous than anything Hitler wrote in the book. National Socialism is not only human logic, it is considerably more logical, and truthful, than Communism, feminism, or secular Zionism. That was part of the tragedy of Germany’s descent into it. Unlike the first two ideologies, it actually functioned effectively.</p><p>National Socialism is also cruel, pitiless, and militaristic, but those are undeniably human failings.</p><p>Indeed, one of the most striking things about <em>Mein Kampf </em>is that it is not, as one would tend to imagine, a wild-eyed, frothing-at-the-mouth sort of text. Perhaps the most disturbing thing about it is how reasonable Hitler often sounds throughout. And that is possibly the best reason of all that it should be published; it is a vivid reminder that far from being “outside of human logic”, every rational man is capable of choosing between good and evil, and choosing between setting himself to achieving great good and committing great harm.</p></blockquote><p>And, of course, their attempt to defame me as being sympathetic to National Socialism, and therefore, Hitler, required omitting pretty much every single reference I’ve ever made to both National Socialism and Hitler over the last 21 years, to say nothing of my publication of Martin van Creveld’s <em>Hitler in Hell</em>. It’s not as if my opinion on either subject is hard to find, and the proven fact is that I have absolutely zero sympathy for Adolf Hitler, the only German leader who somehow managed to be both more evil and less competent than Angela Merkel.</p><ul class=\"wp-block-list\"><li>The list of things that Hitler did wrong is considerably longer than the list of things he did right. I mean, successfully bluffing the French and British governments, and stabbing the Soviets in the back first, hardly makes up for a) launching a two-front war by b) invading Russia, then c) unnecessarily declaring war on the most powerful industrial nation on Earth. Hitler wasn’t merely a complete failure, he was a <em>guaranteed </em>failure before the end of 1941.</li><li>I always find it amusing when people call me a Nazi. I have considerably more contempt for Nazis than the most sincere Nazi-hater. Those who hate the Nazis fear them and consider them to be evil and scary villains. I don’t fear them and I consider them to be inept, ignorant losers. I’m not counter-signaling here; I don’t counter-signal Communists or people with Down’s Syndrome either.</li><li> I oppose 20 of the 25 points of <a href=\"http://en.wikipedia.org/wiki/National_Socialist_Program\">the National Socialist political program</a>, which is considerably more than the average Democrat or Republican does.</li></ul><p>But this is nothing new. Conflict is in the air we breathe. And yes, that is a familiar sound you’re hearing. <em>snicker-snack….</em></p><p><strong>UPDATE: </strong>Three portraits, actually. You know, not only did these intrepid exemplars of attack journalism fail to provide any links to this blog or any other source, but they also mysteriously failed to mention is that <a href=\"https://www.similarweb.com/website/24heures.ch/#overview\">according to SimilarWeb</a>, this blog (4M) gets nearly 2x the traffic that their news site (2.2M) does.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img alt=\"\" class=\"wp-image-53619\" decoding=\"async\" fetchpriority=\"high\" height=\"329\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2022/06/image-2-1024x658.png\" srcset=\"https://voxday.net/wp-content/uploads/2022/06/image-2-1024x658.png 1024w, https://voxday.net/wp-content/uploads/2022/06/image-2-300x193.png 300w, https://voxday.net/wp-content/uploads/2022/06/image-2-768x494.png 768w, https://voxday.net/wp-content/uploads/2022/06/image-2-1536x987.png 1536w, https://voxday.net/wp-content/uploads/2022/06/image-2-2048x1317.png 2048w\" width=\"512\"/></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/66668ea4-cdaf-4789-8cc3-f88af62b802c\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Earlier today, I received an email from someone named Roland Gamp, which quoted an email from someone else named Catherine Boss, supposedly sent on Monday, which I did not see or receive. He wrote:\nMy colleague Catherine Boss sent you an enquiry on Monday (see email below). Unfortunately, we have not yet received a reply from you to our questions. In the meantime, we have found further statements from you which make your radical right-wing stance clear and which are racist, sexist and discriminatory. We would like once again to give you the opportunity to comment. We are extending the deadline and you could respond until 4 pm today in the afternoon. If we do not hear anything by then, we will note in the article that you have not responded to requests.\nThank you very much and kind regards,\nRoland Gamp\nReporter Recherchedesk Tamedia\n+41 79 [redacted] (Mobile)\nroland.gamp@tamedia.ch\nTamedia AG, Werdstrasse 21, CH-8021 Zürich\nI responded to him as follows.\nDear Mr. Gamp and Ms Boss,\nI am pleased to respond to your request for comment. Please note in your article that I have responded in a timely manner to your urgent request and be very sure to accurately quote my following response to you in full.\n“I look forward to the opportunity to file a criminal defamation complaint against Mr. Roland Gamp and Ms Catherine Boss, as well as their employer, the TX Group media house, under Articles 173 and 177 of the Swiss Criminal Code.”\nRegards,\nVox Day\nAmusingly enough, these intrepid reporters appeared to take my clear warning that they were about to step over the line of criminal defamation in Switzerland as mere rhetoric. Which is to say that they did not quote my response, as I specifically required, and instead ran an error-filled hit piece attempting to discredit me as a “misogynist” and a Hitler sympathist, among other things, as well as demanding my prosecution by the authorities for offenses “against the anti-racist norm.”\nNeedless to say, the Legal Legion is already on the case and we will definitely be filing criminal complaints of defamation (Article 173) and insult (Article 177) against Messrs. Sylvain Besson and Roland Gamp, and Ms Catherine Boss.\nA figure of the American radical right takes over a Swiss castle\nThe castle of Cressier, in Fribourg, has been bought by the misogynist and nationalist blogger Vox Day. He wants to turn it into a hotel to accommodate his supporters. The Commune says “to monitor the situation”.\nIt is a place full of history and, according to the Confederation, a “cultural property of national importance”. The castle of Cressier, in the canton of Fribourg, is a delightful residence of blonde stone, with rooms decorated with frescoes and surrounded by a vast garden. It has just been bought by a foreigner, and not just any foreigner: its new owner is a prominent blogger of the American radical right, who intends to save “white people”.\nHe is 53 years old and lives with his family in the Broye region of Vaud. He presents himself as a philosopher, editor and author, notably of comic books and video games. He speaks only under his pen name, Vox Day.\nIn the United States, Vox Day is considered an important representative of the alt-right, which has gained visibility in the wake of Donald Trump. According to American researcher Damon Berry, Vox Day defines the alt-right as nationalist, opposed to globalization, gender equality, and committed to the “right to exist” of ethnically homogenous states. This places it on the extreme right of the European political spectrum.\nOn the internet, Vox Day summarizes the alt-right – to which he avoids being directly attached – as the defense of “the existence of the white man and the future of white children”. The blogger also confesses a certain admiration for Adolf Hitler. “National Socialism is not only human logic, it is also much more logical and true than communism, feminism or secular Zionism,” the Minnesota-born American writes on his blog.\nThat Vox Day has set its sights on the Château de Cressier is perhaps no accident. The old house belonged for a long time to Gonzague de Reynold, a conservative writer from Fribourg, an admirer of the authoritarian regimes of the 1930s, who became a leading figure of the Swiss “spiritual defense” during the Second World War.\nOn social networks, the list of extremist and misogynistic statements of Vox Day is long. In 2015, he stated in an interview that African-Americans are genetically 500 times more likely than white Americans to be prone to violence. After an Islamist attack in Manchester in 2017, he posts a photo of Norwegian Anders Behring Breivik, the right-wing extremist who killed 69 young people on the Norwegian island of Utøya, with the caption, “Saint Breivik, pray for us.”\nVox Day has no problem displaying a retrograde view of women. “If a society cannot persuade women to marry, bear and raise children, it has no choice but to force them to do so or die,” he wrote in a tweet that has since been made inaccessible, as Vox Day has been banned from Twitter.\nOn the war in Ukraine, his opinion is just as clear-cut: the aggression is the work of “imperial America”, which has put Russia in a situation of compulsion. He calls the West “Clown World”, while Russia would represent “Sovereign World”. At the end of February, he titled his blog, “Grandiose stupidity in Switzerland.” And criticized the fact that the President of the Confederation Ignazio Cassis has sided with the European Union sanctions.\nFinally, Vox Day posts the same opinions about the coronavirus pandemic. The vaccine has killed more people than Covid itself, he wrote in March.\nWhere does Vox Day publish his tirades from? On the internet, he gives the impression of living in Italy. But our research shows that the right-wing populist and his family of five have been living in the countryside of the Broye vaudoise for over ten years.\nHis messages are aimed at an American audience, but he is clearly broadcasting them from Switzerland. This raises the question of whether some of his statements fall under the anti-racist norm. This type of offence must be prosecuted by the authorities. To date, we are not aware of any proceedings against him.\nVox Day has been expelled from the American Science Fiction Writers Club. He is also blocked from Twitter. Instead, he developed the site “Infogalactic”, described as a “Wikipedia for the alt-right” by the “Washington Post”. He also created a social network, “Social Galactic”, which is owned by a company in Zug.\nFor the time being, the historic monument is already available for rent, for about 400 francs per night. In Cressier, the Commune only recently learned that the castle was available for rent, after having conducted research. They thought that the family of T. B. would eventually move from the canton of Vaud to Cressier.\nFor the commune’s mayor, David Humair, the case presents a “challenge,” as he puts it. But so far, we have had absolutely no problems with the new owners,” he says. And as long as it stays that way, I don’t see any need to act.” He’s not responsible for the political stance of his residents; that’s their private business, the mayor says again. “But we are carefully monitoring the situation since the arrival of this person in Cressier and we are ready to take action if necessary,” he says. Without specifying what exactly he means by that.\nAs for Vox Day, he refused to answer our questions, contenting himself with threatening us with a criminal complaint for defamation.\nIn Switzerland, Vox Day’s ideology is disseminated in books that can be purchased from the Zurich publisher Orell Füssli. On its website, the American author offers “Cuckservative”, a book that shows “how 50 years of immigration has lowered the average IQ in the United States”. Orell Füssli explains that it does not ban books from its catalog because of the authors’ personal opinions. A wide range of books contributes to the diversity of opinions, according to the publisher. Which says only two Vox Day books have been sold on its site since 2016.\nSwiss SJWs are at least a decade behind their US counterparts, who have learned to be considerably more careful before swinging for the fences like this. How many errors did you notice? I count 12 factual errors and 3 egregious misrepresentations, but I may have missed one or two. They also haven’t gotten the message from the US media that a) the once-terrifying Alt-Right is now a well-coiffed CNN mouthpiece, and b) the threat to Clown World doesn’t just come from sovereign nations such as China and Russia, but also Christian Nationalists like yours truly.\nUnsurprisingly, this inept hit piece relies upon both misinformation and disinformation, omitting the aspects of my words that provide the obvious context necessary to understand their meaning. For example, it’s not hard to see how this sentence could be portrayed as “a certain admiration for Hitler”, right?\n“National Socialism is not only human logic, it is also much more logical and true than communism, feminism or secular Zionism.”\nBut you’d have to be profoundly dishonest to do so, since it cannot reasonably be portrayed that way once\nthe very next sentence\nis quoted. See the post dated\n17 March 2015.\nSalomon’s statement [that\nMein Kampf\nis outside human logic] is more outrageous than anything Hitler wrote in the book. National Socialism is not only human logic, it is considerably more logical, and truthful, than Communism, feminism, or secular Zionism. That was part of the tragedy of Germany’s descent into it. Unlike the first two ideologies, it actually functioned effectively.\nNational Socialism is also cruel, pitiless, and militaristic, but those are undeniably human failings.\nIndeed, one of the most striking things about\nMein Kampf\nis that it is not, as one would tend to imagine, a wild-eyed, frothing-at-the-mouth sort of text. Perhaps the most disturbing thing about it is how reasonable Hitler often sounds throughout. And that is possibly the best reason of all that it should be published; it is a vivid reminder that far from being “outside of human logic”, every rational man is capable of choosing between good and evil, and choosing between setting himself to achieving great good and committing great harm.\nAnd, of course, their attempt to defame me as being sympathetic to National Socialism, and therefore, Hitler, required omitting pretty much every single reference I’ve ever made to both National Socialism and Hitler over the last 21 years, to say nothing of my publication of Martin van Creveld’s\nHitler in Hell\n. It’s not as if my opinion on either subject is hard to find, and the proven fact is that I have absolutely zero sympathy for Adolf Hitler, the only German leader who somehow managed to be both more evil and less competent than Angela Merkel.\nThe list of things that Hitler did wrong is considerably longer than the list of things he did right. I mean, successfully bluffing the French and British governments, and stabbing the Soviets in the back first, hardly makes up for a) launching a two-front war by b) invading Russia, then c) unnecessarily declaring war on the most powerful industrial nation on Earth. Hitler wasn’t merely a complete failure, he was a\nguaranteed\nfailure before the end of 1941.\nI always find it amusing when people call me a Nazi. I have considerably more contempt for Nazis than the most sincere Nazi-hater. Those who hate the Nazis fear them and consider them to be evil and scary villains. I don’t fear them and I consider them to be inept, ignorant losers. I’m not counter-signaling here; I don’t counter-signal Communists or people with Down’s Syndrome either.\nI oppose 20 of the 25 points of\nthe National Socialist political program\n, which is considerably more than the average Democrat or Republican does.\nBut this is nothing new. Conflict is in the air we breathe. And yes, that is a familiar sound you’re hearing.\nsnicker-snack….\nUPDATE:\nThree portraits, actually. You know, not only did these intrepid exemplars of attack journalism fail to provide any links to this blog or any other source, but they also mysteriously failed to mention is that\naccording to SimilarWeb\n, this blog (4M) gets nearly 2x the traffic that their news site (2.2M) does.\nDISCUSS ON SG",
  "tags": [
    "law",
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-02T01:25:03+00:00"
}