{
  "url": "https://voxday.net/2022/06/27/canada-is-at-war-with-russia/",
  "scraped_at": "2026-01-08T13:23:04.202410",
  "title": "Canada is at War with Russia",
  "date_display": "June 27, 2022",
  "date_iso": "2022-06-27T16:24:56+00:00",
  "date_from_url": "2022-06-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Canadian observes that despite not declaring war, <a href=\"https://yvesengler.com/2022/06/26/troops-on-the-ground-prove-canada-is-at-war-with-russia/\">Canada is actively at war with Russia</a>, complete with troops on the ground.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Canada is at war with Russia. But the government doesn’t want to talk about it.</p><p>On Saturday <em>The New York Times</em> reported that Canadian special forces are part of a NATO network providing weapons and training to Ukrainian forces. The elite troops are also in the country gathering intelligence on Russian operations.</p><p>The Department of National Defence refused <em>Ottawa Citizen</em> military reporter David Pugliese’s request for comment on the US paper’s revelations. But in late January <em>Global News</em> and <em>CTV </em>reported that the usually highly secretive special forces were sent to Ukraine. (Canadian special forces have been dispatched secretly to many war zones.)</p><p>Alongside special forces, an unknown number of former Canadian troops have been fighting in Ukraine. There have been a bevy of stories about Canadians traveling to Ukraine to join the fight and organizers initially claimed over 500 individuals joined while the Russian government recently estimated that 600 Canadians were fighting there (Both the Canadian organizers and Moscow would have reasons to inflate the numbers). Early on, Foreign Minister Mélanie Joly and Defence Minister Anita Anand both encouraged Canadians to join the fight, which may have violated Canada’s Foreign Enlistment Act.</p><p>Top commanders have also joined the war. After more than 30 years in the Canadian Forces lieutenant-general Trevor Cadieu retired on April 5 (amidst a rape investigation) and was in Ukraine days later.</p><cite>Troops on the ground prove Canada is at war with Russia, 26 June 2022</cite></blockquote><p>And, of course <a href=\"https://www.nytimes.com/2022/06/25/us/politics/commandos-russia-ukraine.html\">the New York Times article</a> to which he refers proves that the USA is also actively at war with Russia.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>As Russian troops press ahead with a grinding campaign to seize eastern Ukraine, the nation’s ability to resist the onslaught depends more than ever on help from the United States and its allies — including a stealthy network of commandos and spies rushing to provide weapons, intelligence and training, according to U.S. and European officials.</p><p>Much of this work happens outside Ukraine, at bases in Germany, France and Britain, for example. But even as the Biden administration has declared it will not deploy American troops to Ukraine, some C.I.A. personnel have continued to operate in the country secretly, mostly in the capital, Kyiv, directing much of the vast amounts of intelligence the United States is sharing with Ukrainian forces, according to current and former officials.</p><p>At the same time, a few dozen commandos from other NATO countries, including Britain, France, Canada and Lithuania, also have been working inside Ukraine. The United States withdrew its own 150 military instructors before the war began in February, but commandos from these allies either remained or have gone in and out of the country since then, training and advising Ukrainian troops and providing an on-the-ground conduit for weapons and other aid, three U.S. officials said.</p><p>Few other details have emerged about what the C.I.A. personnel or the commandos are doing, but their presence in the country — on top of the diplomatic staff members who returned after Russia gave up its siege of Kyiv — hints at the scale of the secretive effort to assist Ukraine that is underway and the risks that Washington and its allies are taking.</p><cite>Commando Network Coordinates Flow of Weapons in Ukraine, Officials Say, <em>The New York Times</em>, 25 June 2022</cite></blockquote><p>The wordspellers seem to imagine that as long as they don’t actually say the magic word – war – and as long as they call their soldiers things like “commandos” and “special forces operators” and “advisers” and “intelligence agents”, they can pretend they don’t actually have “soldiers” engaging in hostilities against the Russian forces.</p><p>But war is not rhetoric. Russia is now perfectly entitled to start firing hypersonic missiles at Canada and the USA, and doing to Toronto and Washington DC what they’ve already done to Lysychansk.</p><p><em><a href=\"https://social.infogalactic.com/micropost/41e36175-b726-4ce5-9327-b50bb02e4c6d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A Canadian observes that despite not declaring war,\nCanada is actively at war with Russia\n, complete with troops on the ground.\nCanada is at war with Russia. But the government doesn’t want to talk about it.\nOn Saturday\nThe New York Times\nreported that Canadian special forces are part of a NATO network providing weapons and training to Ukrainian forces. The elite troops are also in the country gathering intelligence on Russian operations.\nThe Department of National Defence refused\nOttawa Citizen\nmilitary reporter David Pugliese’s request for comment on the US paper’s revelations. But in late January\nGlobal News\nand\nCTV\nreported that the usually highly secretive special forces were sent to Ukraine. (Canadian special forces have been dispatched secretly to many war zones.)\nAlongside special forces, an unknown number of former Canadian troops have been fighting in Ukraine. There have been a bevy of stories about Canadians traveling to Ukraine to join the fight and organizers initially claimed over 500 individuals joined while the Russian government recently estimated that 600 Canadians were fighting there (Both the Canadian organizers and Moscow would have reasons to inflate the numbers). Early on, Foreign Minister Mélanie Joly and Defence Minister Anita Anand both encouraged Canadians to join the fight, which may have violated Canada’s Foreign Enlistment Act.\nTop commanders have also joined the war. After more than 30 years in the Canadian Forces lieutenant-general Trevor Cadieu retired on April 5 (amidst a rape investigation) and was in Ukraine days later.\nTroops on the ground prove Canada is at war with Russia, 26 June 2022\nAnd, of course\nthe New York Times article\nto which he refers proves that the USA is also actively at war with Russia.\nAs Russian troops press ahead with a grinding campaign to seize eastern Ukraine, the nation’s ability to resist the onslaught depends more than ever on help from the United States and its allies — including a stealthy network of commandos and spies rushing to provide weapons, intelligence and training, according to U.S. and European officials.\nMuch of this work happens outside Ukraine, at bases in Germany, France and Britain, for example. But even as the Biden administration has declared it will not deploy American troops to Ukraine, some C.I.A. personnel have continued to operate in the country secretly, mostly in the capital, Kyiv, directing much of the vast amounts of intelligence the United States is sharing with Ukrainian forces, according to current and former officials.\nAt the same time, a few dozen commandos from other NATO countries, including Britain, France, Canada and Lithuania, also have been working inside Ukraine. The United States withdrew its own 150 military instructors before the war began in February, but commandos from these allies either remained or have gone in and out of the country since then, training and advising Ukrainian troops and providing an on-the-ground conduit for weapons and other aid, three U.S. officials said.\nFew other details have emerged about what the C.I.A. personnel or the commandos are doing, but their presence in the country — on top of the diplomatic staff members who returned after Russia gave up its siege of Kyiv — hints at the scale of the secretive effort to assist Ukraine that is underway and the risks that Washington and its allies are taking.\nCommando Network Coordinates Flow of Weapons in Ukraine, Officials Say,\nThe New York Times\n, 25 June 2022\nThe wordspellers seem to imagine that as long as they don’t actually say the magic word – war – and as long as they call their soldiers things like “commandos” and “special forces operators” and “advisers” and “intelligence agents”, they can pretend they don’t actually have “soldiers” engaging in hostilities against the Russian forces.\nBut war is not rhetoric. Russia is now perfectly entitled to start firing hypersonic missiles at Canada and the USA, and doing to Toronto and Washington DC what they’ve already done to Lysychansk.\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-27T16:24:59+00:00"
}