{
  "url": "https://voxday.net/2022/06/30/china-holds-the-usa-accountable/",
  "scraped_at": "2026-01-08T13:23:22.114126",
  "title": "China Holds the USA Accountable",
  "date_display": "June 30, 2022",
  "date_iso": "2022-06-30T12:29:48+00:00",
  "date_from_url": "2022-06-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For all that it makes Americans extremely uncomfortable and quick to cite a panoply of irrelevant tangential facts that don’t excuse their ancestors’ actions, the absolute historical fact is that the European colonists – English and Spanish – committed imperialist genocide against the various American Indian tribes. And China is now <a href=\"https://social.infogalactic.com/micropost/945b68f9-18b1-40a7-9201-1adbbd128839\">utilizing these historical facts to great rhetorical effect</a> to undermine the USA’s false claim to the moral high ground; for all the horrific crimes of the Mao era, at least the Chinese only victimized their own people.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>CRI: </strong>We noticed that a report from the US Department of the Interior last month said a large number of Native American children died at Indian boarding schools. After that, more and more survivors and their descendants have spoken out and accused the US government of genocide against American Indians. Do you have any comment?</p><p><strong>Zhao Lijian:</strong> We are deeply sympathetic to the tragic experience of the Native American children. Those so-called boarding schools that carried the motto “Kill the Indian, save the man” were in essence crime scenes of the US cultural genocide against Native Americans. What happened at these schools is also important evidence of the racial genocide committed by the US against Native Americans. More and more facts have come to light and shown that the US committed systemic genocide against Native Americans in three dimensions, which has lasted hundreds of years and continues to this day. </p><p>First, the US has committed physical genocide against the Native American population. Statistics show that since its independence in 1776, the US government has launched over 1,500 attacks on Indian tribes to slaughter the Indians. Before the arrival of white settlers in 1492, there were five million Indians, yet the number plummeted to 600,000 by 1800 and only 237,000 in 1900. Among them, more than a dozen tribes, such as the Pequot, Mohegan, and Massachusetts, were completely extinct. The US government also applied forced sterilization to Indians. Between 1930 and 1976, the US Bureau of Indian Affairs forcibly sterilized approximately 70,000 Indian women through the “Indian Health Service program”. In early 1970s, more than 42% of Indian women of childbearing age were sterilized.</p><p>Second, the US has committed spiritual and cultural genocide against Native Americans. They have long suffered hostility, discrimination and oblivion. The inter-generational inheritance of indigenous spirits and culture of Native Americans have long been hindered. In the 1870s and ’80s, the US government adopted a policy of “forced assimilation” to obliterate the social fabric and culture of Indian tribes and destroy the ethnic and tribal identity of the Indians. To attain the dual goal of cultural assimilation and taking Indian lands for itself, the US government began with forcing Native American children into the Indian boarding schools, banning them from speaking their native language, wearing their traditional clothes, or carrying out traditional activities. The children also suffered serious abuse and torment. US-based scholar Preston McBride estimates that the total number of deaths could be as high as 40,000, adding that “basically every school had a graveyard.” Even today, the US is still trying to deliberately obliterate the historical memory and information of the indigenous people in education and media reports. According to a report by National Indian Education Association, 87% of state-level US history textbooks do not mention the post-1900 history of indigenous people. </p><p>Third, the US has committed deprivation of the rights of Native Americans. The US has systematically deprived Native Americans and other ethnic minorities of a wide range of their rights, leaving them mired in a crisis of survival and scarcity of rights. A report by the Indian Health Service shows that Native Americans born today have a life expectancy that is 5.5 years less than the national average, and they have the highest infant mortality rate. The suicide rate of Native American adolescents is 1.9 times that of the national average. By June 2022, the COVID-19 mortality rate among Native Americans is about 2.1 times that of the White population. From 1969 to 2009, the US government conducted 928 nuclear tests in the Shoshone tribal region, resulting in nuclear fallout of around 620 kilotons. Cancer incidence rate in Native Americans’ reservations is far higher than other areas. High levels of radioactive substance has been detected in the systems of about a quarter of Navajo women and infants. According to 2018 US Census Data, the poverty rate among Native Americans was 25.4%, far higher than 8.1% among the White population.</p><p>Genocide against Native Americans is an original sin of the US that can never be erased. The untold tragedies of Native Americans should never be forgotten. The US government has every reason to admit its crimes of genocide against Native Americans, and offer sincere apologies and repentance to the victims and their descendants. The US government should also credibly make up for the trauma Native Americans are suffering, and seriously face up to grave human rights issues and crimes of racism that exist within the US.</p><cite>Zhao Lijian, Foreign Ministry, 29 June 2022</cite></blockquote><p>Before you react like a Pavlovian dog hearing a dinner bell, please remember this, White American:<strong> YOU ARE THE INDIAN NOW. </strong></p><p>All of the lies and twisted truths you repeated in order to try to rationalize the sins of the past are now being told to justify your dispossession. The only difference is that the replacement peoples are unlikely to treat your great-great-grandchildren quite as kindly as your great-great-great-grandfather treated some of my ancestors. Imagine the lies and twisted truths that will be accepted as historical fact by the Post-Americans once Americans are a statistical minority similar to the American Indian population today.</p><p>Contemplate how many of your Asian and African great-grandchildren will be in my position, with most of their Asian and African peers refusing to believe that they have any European ancestors. After all, they won’t LOOK white…</p><p>What is happening today is directly traceable to the sins of the founding fathers and their abominable behavior toward “the merciless Indian Savages”, as the Declaration of Independence described them. Note in particular that the very concept of racism, upon which the entire American population has been condemned and crucified, <a href=\"https://voxday.net/2021/12/28/racism-is-pro-human-diversity/\">was specifically coined by an American</a> in order to destroy the American Indian. It is, therefore, both ironic and fitting that “racism” has been the primary weapon utilized in the rhetorical demolition of America.</p><p>I don’t remind you of these historical wrongs because I want revenge for my Indian ancestors or because I dream of Chung Kuo. What is done is done, and nothing is going to change that. To the contrary, I remind you of them because I do not wish for the American to go the way of the American Indian.</p><p>Perhaps, unlike the American Indian tribes, Americans can put all their ideological and individual differences aside in time to unite against the foreign peoples invading their lands and prevent their replacement. But most likely, as Sitting Bull and <a href=\"https://infogalactic.com/info/Ghost_Dance\">the Ghost Dancers</a> learned to their dismay, it is already too late. It may be worth noting, in this regard, that while in 1890, the population of the United States, excluding the Indian and Negro minorities, was around 55 million, the post-1965 foreign population resident in the USA is presently about twice that number.</p><p><em><a href=\"https://social.infogalactic.com/micropost/945b68f9-18b1-40a7-9201-1adbbd128839\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "For all that it makes Americans extremely uncomfortable and quick to cite a panoply of irrelevant tangential facts that don’t excuse their ancestors’ actions, the absolute historical fact is that the European colonists – English and Spanish – committed imperialist genocide against the various American Indian tribes. And China is now\nutilizing these historical facts to great rhetorical effect\nto undermine the USA’s false claim to the moral high ground; for all the horrific crimes of the Mao era, at least the Chinese only victimized their own people.\nCRI:\nWe noticed that a report from the US Department of the Interior last month said a large number of Native American children died at Indian boarding schools. After that, more and more survivors and their descendants have spoken out and accused the US government of genocide against American Indians. Do you have any comment?\nZhao Lijian:\nWe are deeply sympathetic to the tragic experience of the Native American children. Those so-called boarding schools that carried the motto “Kill the Indian, save the man” were in essence crime scenes of the US cultural genocide against Native Americans. What happened at these schools is also important evidence of the racial genocide committed by the US against Native Americans. More and more facts have come to light and shown that the US committed systemic genocide against Native Americans in three dimensions, which has lasted hundreds of years and continues to this day.\nFirst, the US has committed physical genocide against the Native American population. Statistics show that since its independence in 1776, the US government has launched over 1,500 attacks on Indian tribes to slaughter the Indians. Before the arrival of white settlers in 1492, there were five million Indians, yet the number plummeted to 600,000 by 1800 and only 237,000 in 1900. Among them, more than a dozen tribes, such as the Pequot, Mohegan, and Massachusetts, were completely extinct. The US government also applied forced sterilization to Indians. Between 1930 and 1976, the US Bureau of Indian Affairs forcibly sterilized approximately 70,000 Indian women through the “Indian Health Service program”. In early 1970s, more than 42% of Indian women of childbearing age were sterilized.\nSecond, the US has committed spiritual and cultural genocide against Native Americans. They have long suffered hostility, discrimination and oblivion. The inter-generational inheritance of indigenous spirits and culture of Native Americans have long been hindered. In the 1870s and ’80s, the US government adopted a policy of “forced assimilation” to obliterate the social fabric and culture of Indian tribes and destroy the ethnic and tribal identity of the Indians. To attain the dual goal of cultural assimilation and taking Indian lands for itself, the US government began with forcing Native American children into the Indian boarding schools, banning them from speaking their native language, wearing their traditional clothes, or carrying out traditional activities. The children also suffered serious abuse and torment. US-based scholar Preston McBride estimates that the total number of deaths could be as high as 40,000, adding that “basically every school had a graveyard.” Even today, the US is still trying to deliberately obliterate the historical memory and information of the indigenous people in education and media reports. According to a report by National Indian Education Association, 87% of state-level US history textbooks do not mention the post-1900 history of indigenous people.\nThird, the US has committed deprivation of the rights of Native Americans. The US has systematically deprived Native Americans and other ethnic minorities of a wide range of their rights, leaving them mired in a crisis of survival and scarcity of rights. A report by the Indian Health Service shows that Native Americans born today have a life expectancy that is 5.5 years less than the national average, and they have the highest infant mortality rate. The suicide rate of Native American adolescents is 1.9 times that of the national average. By June 2022, the COVID-19 mortality rate among Native Americans is about 2.1 times that of the White population. From 1969 to 2009, the US government conducted 928 nuclear tests in the Shoshone tribal region, resulting in nuclear fallout of around 620 kilotons. Cancer incidence rate in Native Americans’ reservations is far higher than other areas. High levels of radioactive substance has been detected in the systems of about a quarter of Navajo women and infants. According to 2018 US Census Data, the poverty rate among Native Americans was 25.4%, far higher than 8.1% among the White population.\nGenocide against Native Americans is an original sin of the US that can never be erased. The untold tragedies of Native Americans should never be forgotten. The US government has every reason to admit its crimes of genocide against Native Americans, and offer sincere apologies and repentance to the victims and their descendants. The US government should also credibly make up for the trauma Native Americans are suffering, and seriously face up to grave human rights issues and crimes of racism that exist within the US.\nZhao Lijian, Foreign Ministry, 29 June 2022\nBefore you react like a Pavlovian dog hearing a dinner bell, please remember this, White American:\nYOU ARE THE INDIAN NOW.\nAll of the lies and twisted truths you repeated in order to try to rationalize the sins of the past are now being told to justify your dispossession. The only difference is that the replacement peoples are unlikely to treat your great-great-grandchildren quite as kindly as your great-great-great-grandfather treated some of my ancestors. Imagine the lies and twisted truths that will be accepted as historical fact by the Post-Americans once Americans are a statistical minority similar to the American Indian population today.\nContemplate how many of your Asian and African great-grandchildren will be in my position, with most of their Asian and African peers refusing to believe that they have any European ancestors. After all, they won’t LOOK white…\nWhat is happening today is directly traceable to the sins of the founding fathers and their abominable behavior toward “the merciless Indian Savages”, as the Declaration of Independence described them. Note in particular that the very concept of racism, upon which the entire American population has been condemned and crucified,\nwas specifically coined by an American\nin order to destroy the American Indian. It is, therefore, both ironic and fitting that “racism” has been the primary weapon utilized in the rhetorical demolition of America.\nI don’t remind you of these historical wrongs because I want revenge for my Indian ancestors or because I dream of Chung Kuo. What is done is done, and nothing is going to change that. To the contrary, I remind you of them because I do not wish for the American to go the way of the American Indian.\nPerhaps, unlike the American Indian tribes, Americans can put all their ideological and individual differences aside in time to unite against the foreign peoples invading their lands and prevent their replacement. But most likely, as Sitting Bull and\nthe Ghost Dancers\nlearned to their dismay, it is already too late. It may be worth noting, in this regard, that while in 1890, the population of the United States, excluding the Indian and Negro minorities, was around 55 million, the post-1965 foreign population resident in the USA is presently about twice that number.\nDISCUSS ON SG",
  "tags": [
    "China",
    "history",
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-30T13:09:16+00:00"
}