{
  "url": "https://voxday.net/2022/06/09/forever-swept-away/",
  "scraped_at": "2026-01-08T13:21:21.992422",
  "title": "Forever Swept Away",
  "date_display": "June 9, 2022",
  "date_iso": "2022-06-09T10:03:08+00:00",
  "date_from_url": "2022-06-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Alastair Crooke points out that <a href=\"https://thesaker.is/open-thread-9/#comment-1104177\">we are witnessing the end</a> to what he describes as the neoliberal cosmopolitan economic order upon which globalization was constructed.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The First World War signalled the end to a mercantilist order that had evolved under the aegis of European powers. One hundred years later, a very different economic order was in place (neoliberal cosmopolitanism). Believed by its architects to be universal and everlasting, globalisation transfixed the world for an extended moment, but then started the subsidence from its zenith – precisely at the moment the West was giving vent to its triumphalism at the fall of the Berlin Wall. NATO – as the order’s regulatory system – addressed its attendant ‘identity crisis’ by pushing for eastward expansion toward Russia’s western borders, disregarding the guarantees it had given, and Moscow’s virulent objections.</p><p>This radical alienation of Russia triggered its pivot to China. Europe and the U.S. however, declined to consider issues of due ‘balance’ within global structures, and simply glossed over the realities of a world order in momentous metamorphosis: with the steady decline of the U.S. already apparent; with a European faux ‘unity’ that masked its own inherent imbalances; and in the context of a hyper-financialised economic structure which lethally sucked out the juice from the real economy.</p><p>The present war in Ukraine therefore simply is an adjunct – the accelerant to this existing process of ‘liberal order’ decomposition. It is not its centre. Fundamentally geo-strategic in their origin, the explosive dynamics to today’s disintegration can be seen as blowback from the mismatch from diverse peoples’ looking now to solutions tailored to suit their non-western civilisations, and from the western insistence on its ‘one size fits all’ Order. Ukraine thus is a symptom, but is not per se, the deeper disorder itself.</p><p>Tom Luongo has remarked – in connection with the ‘messy’, confusing events of today – that that which he fears most, is so many people analysing the intersection of geopolitics, markets and ideology, and doing so with such striking complacency. “There is a stunning amount of normalcy bias in the punditocracy, too much ‘cooler heads will prevail’ and not enough ‘everyone’s got a plan until they’re punched in the mouth’”.</p><p>What Luongo’s retort doesn’t fully explain is the shrillness, the outrage, with which any doubting of the accredited ‘punditocracy’ of the moment is met. Plainly, there is a deeper fear stalking the lower depths of western psyche that is not being made fully explicit.</p><p>Wolfgang Münchau, formerly at the <em>Financial Times</em>, now authoring <em>EuroIntelligence</em>, describes how such a canonised Zeitgeist implicitly has imprisoned Europe in a cage of adverse dynamics which threaten its economy, its autonomy, its globalism and its being.</p><p>Münchau relates how both the pandemic and Ukraine had taught him that it was one thing to proclaim an interconnected globalism ‘as cliché’, but <em>“It is quite another to observe what actually happens on the ground when those connections get torn apart … Western sanctions were based on a formally correct, but misleading premise – one that I believed myself – at least up to a point: That Russia is more dependent on us than we are on Russia … Russia however is a provider of primary and secondary commodities, on which the world has become dependent. But when the largest exporter of those commodities disappears, the rest of the world experiences physical shortages and rising prices”</em>. He continues:</p><p><em>“Did we think this through? Did the foreign ministries that drew up the sanctions discuss at any point what we would do if Russia were to blockade the Black Sea and not allow Ukrainian wheat to leave the ports?… Or, did we think we can adequately address a global starvation crisis by pointing the finger at Putin”?</em></p><p><em>“The lockdown taught us a lot about our vulnerability to supply chain shocks. It has reminded Europeans that there have only two routes to ship goods en masse to Asia and back: either by container, or by rail through Russia. We had no plan for a pandemic, no plan for a war, and no plan for when both are happening at the same time. The containers are stuck in Shanghai. The railways closed because of the war.</em></p><p><em>“I am not sure the west is ready to confront the consequences of its actions: persistent inflation, reduced industrial output, lower growth, and higher unemployment. To me, economic sanctions look like the last hurrah of a dysfunctional concept known as The West. The Ukraine war is a catalyst of massive de-globalisation”.</em></p><p>Münchau’s response is that unless we cut a deal with Putin, with the removal of sanctions as a component, he sees “a danger of the world becoming subject to two trading blocs: the west and the rest. Supply chains will be reorganised to stay within them. Russia’s energy, wheat, metals, and rare earths will still be consumed, but not here – We [just] keep with the Big Macs”.</p><p>So again, ‘one’ searches for an answer: Why are the Euro-élites so shrill, so passionate in their support for Ukraine? And risk heart-attack from the sheer vehemence of their hatred for Putin? After all, most Europeans and Americans until this year knew next-to-nought about Ukraine.</p><p>We know the answer: the deeper fear is that all the landmarks to liberal life – for reasons they do not understand – are about to be forever swept away.</p><cite><em>The World Doesn’t Work That Way Anymore</em>, Alastair Crooke</cite></blockquote><p>Note that this is not a <em>prediction</em>. This is an <em>observation </em>of what is already happening, of what is already in progress. It is the <em>actualization </em>of what I have been predicting since 2004. And it is now readily apparent that the 2033 scenario originally articulated 18 years ago remains very much in play. Cooke summarizes his observations in a single cogent  paragraph.</p><p>“<em>Here is the point: The fixation with Ukraine essentially is but a gloss pasted over the realities of a global order in decomposition. The latter is the source of the wider disorder. Ukraine is but one small piece on the chess board, and its outcome will not fundamentally change that ‘reality’. Even a ‘win’ in Ukraine would not grant ‘immortality’ to the neoliberal rules-based order. The noxious fumes emanating from the global financial system are wholly unconnected to Ukraine – but are that much more significant for they go to the heart of the ‘disorder’ within the western ‘liberal order’.</em>“</p><p>And while I, like everyone else, remain uncertain about what will eventually replace the failing current order, I nevertheless anticipate the inevitable change due to the fact that lords of the neoliberal order have, in its incipient death throes, helpfully clarified for us precisely how wicked and awful and terrible it truly was while producing the fattest, most licentious, most solipsistic, and most credulous populations in human history.</p><p>Whatever difficulties and challenges the collapse of the neoliberal rules-based order poses us, we can be confident that they will not be worse than the horrors that were intended for us in a Clown World without end. It’s an unusually astute article, so <a href=\"https://thesaker.is/open-thread-9/#comment-1104177\">read the whole thing</a>, which tends to explain the panic implicit in the recent statement</p><p><em><a href=\"https://social.infogalactic.com/micropost/481b2ff6-20f6-49c3-b8b4-6e22fec99604\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Alastair Crooke points out that\nwe are witnessing the end\nto what he describes as the neoliberal cosmopolitan economic order upon which globalization was constructed.\nThe First World War signalled the end to a mercantilist order that had evolved under the aegis of European powers. One hundred years later, a very different economic order was in place (neoliberal cosmopolitanism). Believed by its architects to be universal and everlasting, globalisation transfixed the world for an extended moment, but then started the subsidence from its zenith – precisely at the moment the West was giving vent to its triumphalism at the fall of the Berlin Wall. NATO – as the order’s regulatory system – addressed its attendant ‘identity crisis’ by pushing for eastward expansion toward Russia’s western borders, disregarding the guarantees it had given, and Moscow’s virulent objections.\nThis radical alienation of Russia triggered its pivot to China. Europe and the U.S. however, declined to consider issues of due ‘balance’ within global structures, and simply glossed over the realities of a world order in momentous metamorphosis: with the steady decline of the U.S. already apparent; with a European faux ‘unity’ that masked its own inherent imbalances; and in the context of a hyper-financialised economic structure which lethally sucked out the juice from the real economy.\nThe present war in Ukraine therefore simply is an adjunct – the accelerant to this existing process of ‘liberal order’ decomposition. It is not its centre. Fundamentally geo-strategic in their origin, the explosive dynamics to today’s disintegration can be seen as blowback from the mismatch from diverse peoples’ looking now to solutions tailored to suit their non-western civilisations, and from the western insistence on its ‘one size fits all’ Order. Ukraine thus is a symptom, but is not per se, the deeper disorder itself.\nTom Luongo has remarked – in connection with the ‘messy’, confusing events of today – that that which he fears most, is so many people analysing the intersection of geopolitics, markets and ideology, and doing so with such striking complacency. “There is a stunning amount of normalcy bias in the punditocracy, too much ‘cooler heads will prevail’ and not enough ‘everyone’s got a plan until they’re punched in the mouth’”.\nWhat Luongo’s retort doesn’t fully explain is the shrillness, the outrage, with which any doubting of the accredited ‘punditocracy’ of the moment is met. Plainly, there is a deeper fear stalking the lower depths of western psyche that is not being made fully explicit.\nWolfgang Münchau, formerly at the\nFinancial Times\n, now authoring\nEuroIntelligence\n, describes how such a canonised Zeitgeist implicitly has imprisoned Europe in a cage of adverse dynamics which threaten its economy, its autonomy, its globalism and its being.\nMünchau relates how both the pandemic and Ukraine had taught him that it was one thing to proclaim an interconnected globalism ‘as cliché’, but\n“It is quite another to observe what actually happens on the ground when those connections get torn apart … Western sanctions were based on a formally correct, but misleading premise – one that I believed myself – at least up to a point: That Russia is more dependent on us than we are on Russia … Russia however is a provider of primary and secondary commodities, on which the world has become dependent. But when the largest exporter of those commodities disappears, the rest of the world experiences physical shortages and rising prices”\n. He continues:\n“Did we think this through? Did the foreign ministries that drew up the sanctions discuss at any point what we would do if Russia were to blockade the Black Sea and not allow Ukrainian wheat to leave the ports?… Or, did we think we can adequately address a global starvation crisis by pointing the finger at Putin”?\n“The lockdown taught us a lot about our vulnerability to supply chain shocks. It has reminded Europeans that there have only two routes to ship goods en masse to Asia and back: either by container, or by rail through Russia. We had no plan for a pandemic, no plan for a war, and no plan for when both are happening at the same time. The containers are stuck in Shanghai. The railways closed because of the war.\n“I am not sure the west is ready to confront the consequences of its actions: persistent inflation, reduced industrial output, lower growth, and higher unemployment. To me, economic sanctions look like the last hurrah of a dysfunctional concept known as The West. The Ukraine war is a catalyst of massive de-globalisation”.\nMünchau’s response is that unless we cut a deal with Putin, with the removal of sanctions as a component, he sees “a danger of the world becoming subject to two trading blocs: the west and the rest. Supply chains will be reorganised to stay within them. Russia’s energy, wheat, metals, and rare earths will still be consumed, but not here – We [just] keep with the Big Macs”.\nSo again, ‘one’ searches for an answer: Why are the Euro-élites so shrill, so passionate in their support for Ukraine? And risk heart-attack from the sheer vehemence of their hatred for Putin? After all, most Europeans and Americans until this year knew next-to-nought about Ukraine.\nWe know the answer: the deeper fear is that all the landmarks to liberal life – for reasons they do not understand – are about to be forever swept away.\nThe World Doesn’t Work That Way Anymore\n, Alastair Crooke\nNote that this is not a\nprediction\n. This is an\nobservation\nof what is already happening, of what is already in progress. It is the\nactualization\nof what I have been predicting since 2004. And it is now readily apparent that the 2033 scenario originally articulated 18 years ago remains very much in play. Cooke summarizes his observations in a single cogent  paragraph.\n“\nHere is the point: The fixation with Ukraine essentially is but a gloss pasted over the realities of a global order in decomposition. The latter is the source of the wider disorder. Ukraine is but one small piece on the chess board, and its outcome will not fundamentally change that ‘reality’. Even a ‘win’ in Ukraine would not grant ‘immortality’ to the neoliberal rules-based order. The noxious fumes emanating from the global financial system are wholly unconnected to Ukraine – but are that much more significant for they go to the heart of the ‘disorder’ within the western ‘liberal order’.\n“\nAnd while I, like everyone else, remain uncertain about what will eventually replace the failing current order, I nevertheless anticipate the inevitable change due to the fact that lords of the neoliberal order have, in its incipient death throes, helpfully clarified for us precisely how wicked and awful and terrible it truly was while producing the fattest, most licentious, most solipsistic, and most credulous populations in human history.\nWhatever difficulties and challenges the collapse of the neoliberal rules-based order poses us, we can be confident that they will not be worse than the horrors that were intended for us in a Clown World without end. It’s an unusually astute article, so\nread the whole thing\n, which tends to explain the panic implicit in the recent statement\nDISCUSS ON SG",
  "tags": [
    "decline and fall",
    "economics",
    "globalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-09T11:48:30+00:00"
}