{
  "url": "https://voxday.net/2022/06/09/historical-injustices/",
  "scraped_at": "2026-01-08T13:21:23.830812",
  "title": "Historical Injustices",
  "date_display": "June 9, 2022",
  "date_iso": "2022-06-09T12:30:55+00:00",
  "date_from_url": "2022-06-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>China is making it clear that it is not only aligned with Russia, but also with Palestine. And, one therefore has to assume, with Iran.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Al Jazeera: </strong>An international commission of inquiry set up by the UN Human Rights Council released an 18-page report today, saying that Israel’s occupation of Palestinian territory and discrimination against Palestinians are the root causes of recurrent tensions and protraction of conflict in the region. It also says that “Israel has no intention of ending the occupation”. What is China’s comment?</p><p><strong>Zhao Lijian: </strong>The underlying reason for the recurring conflicts between Israel and Palestine and ongoing tensions over the occupied Palestinian territory is that the historical injustices done to the Palestinian people have been left unaddressed for too long and that the Palestinian people’s legitimate aspiration of establishing an independent state has long been denied. The international community needs to work more actively with a greater sense of urgency for an early resumption of peace talks between Palestine and Israel on the basis of the two-state solution, so as to achieve a comprehensive, just and lasting solution to the question of Palestine at an early date.</p><cite>Zhao Lijian, Foreign Ministry, 8 June 2022</cite></blockquote><p>Conflict has a way of clarifying things. It would appear the Chinese didn’t take very kindly to <a href=\"https://www.haaretz.com/2006-06-23/ty-article/questions-of-survival/0000017f-e02e-d804-ad7f-f1feba260000\">the neocon plan to jump to China</a>, or possibly India, in the aftermath of the USA’s economic collapse. And I am skeptical that hurling accusations of anti-semitism at the Chinese government is likely to favorably impress the Chinese.</p><p><em><a href=\"https://social.infogalactic.com/micropost/117be327-38f7-474e-a266-e46de091fc71\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "China is making it clear that it is not only aligned with Russia, but also with Palestine. And, one therefore has to assume, with Iran.\nAl Jazeera:\nAn international commission of inquiry set up by the UN Human Rights Council released an 18-page report today, saying that Israel’s occupation of Palestinian territory and discrimination against Palestinians are the root causes of recurrent tensions and protraction of conflict in the region. It also says that “Israel has no intention of ending the occupation”. What is China’s comment?\nZhao Lijian:\nThe underlying reason for the recurring conflicts between Israel and Palestine and ongoing tensions over the occupied Palestinian territory is that the historical injustices done to the Palestinian people have been left unaddressed for too long and that the Palestinian people’s legitimate aspiration of establishing an independent state has long been denied. The international community needs to work more actively with a greater sense of urgency for an early resumption of peace talks between Palestine and Israel on the basis of the two-state solution, so as to achieve a comprehensive, just and lasting solution to the question of Palestine at an early date.\nZhao Lijian, Foreign Ministry, 8 June 2022\nConflict has a way of clarifying things. It would appear the Chinese didn’t take very kindly to\nthe neocon plan to jump to China\n, or possibly India, in the aftermath of the USA’s economic collapse. And I am skeptical that hurling accusations of anti-semitism at the Chinese government is likely to favorably impress the Chinese.\nDISCUSS ON SG",
  "tags": [
    "China",
    "neoclowns"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-09T12:31:33+00:00"
}