{
  "url": "https://voxday.net/2022/06/21/interview-with-razorfist/",
  "scraped_at": "2026-01-08T13:22:27.704182",
  "title": "Interview with Razorfist",
  "date_display": "June 21, 2022",
  "date_iso": "2022-06-21T15:27:23+00:00",
  "date_from_url": "2022-06-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Dark Herald <a href=\"https://boundingintocomics.com/2022/06/21/interview-razorfist-speaks-with-us-on-his-upcoming-novel-pulp-cover-art-and-the-possibility-of-a-genre-revival/\">interviews Razorfist for Bounding Into Comics</a> about his new Dark Legion book, DEATH MASK as well as the decline and inevitable rise of pulp fiction:</em></p><p><strong>DARK HERALD: </strong>Your Nightvale series appears to be strongly inspired by pulp era adventure stories. Pulp fiction was fairly common through the 1980s, but then interest started to taper off over the next twenty years. Why do you think that happened?</p><p><strong>RAZÖRFIST:</strong> “Logistically speaking, what killed the pulps were the wood rationing and shortages of the mid-’40s.”</p><p>“The Shadow, the most popular of the ‘hero’ pulps for a long while, dropped to a shorter digest format and even cut Walter Gibson’s pay to keep the lights on. He would ultimately quit Street &amp; Smith over it. Most pulp publishers were already dead after World War 2 and just didn’t realize it until the bills came due all at once over the next decade.</p><p>In the ’50s, those old yellow paperbacks (for a time, distributed via vending machine) seemed to replace Pulp as Television and Comics came to the fore. Ultimately, those got thicker and more pretentious until they became the ‘elevated’ gas station literature you see today”</p><p>“With thirty different titles ‘written’ by James Patterson, none of which he was ever even dimly aware of. They did sort of morph into the ‘genre fiction’ you’re alluding to throughout the ’80s. And in a weird way, they live on through Star Trek and Star Wars books, Battletech and so on.</p><p>These publishing houses are essentially printing pulp. It’s just a bit more bloated and seems to have aspirations to be more than it is. Sorry to say, it isn’t and never will be. Which is exactly the way I like it.”</p><p><strong>DARK HERALD:</strong> I’ve recently run into a few other authors like you and Sky Hernstrom that have written new Robert Howard style high adventures. Do you think there is pulp revival underway? Also, who else do you know of who is working in contemporary Pulp?</p><p><strong>RAZÖRFIST: </strong>“Yeah, I’ve read some of Sky’s stuff in Cirsova and enjoyed it. The first ‘New Pulp’ writer I was aware of was Barry Reese, who does a Shadow-esque vigilante series featuring characters like ‘The Peregrine’ and ‘Lazarus Grey’.”</p><p>“I think a Pulp Revival is inevitable. Whether it happens now or decades hence. Attention spans have fallen. Smart devices are tucked away in every pocket. Short fiction and bite-sized stories seem the way to go.</p><p>Yet, the ‘Phonebook Fantasy’ writers seem to have a minimum page count of 500 and fill the majority of it with worldbuilding bloat. And despite the name, it isn’t all that novel, either. None of them are doing anything terribly interesting to justify it.</p><p>Writing straightforward Fantasy is fine – I love it to death – It’s the pretense that it’s anything more that I can’t abide. And the smug superiority as they look down their nose at shorter, more plot-driven fiction.”</p><p><em><a href=\"https://social.infogalactic.com/micropost/d63ec5c7-4289-4a3d-914b-8c20a4c0f92a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Dark Herald\ninterviews Razorfist for Bounding Into Comics\nabout his new Dark Legion book, DEATH MASK as well as the decline and inevitable rise of pulp fiction:\nDARK HERALD:\nYour Nightvale series appears to be strongly inspired by pulp era adventure stories. Pulp fiction was fairly common through the 1980s, but then interest started to taper off over the next twenty years. Why do you think that happened?\nRAZÖRFIST:\n“Logistically speaking, what killed the pulps were the wood rationing and shortages of the mid-’40s.”\n“The Shadow, the most popular of the ‘hero’ pulps for a long while, dropped to a shorter digest format and even cut Walter Gibson’s pay to keep the lights on. He would ultimately quit Street & Smith over it. Most pulp publishers were already dead after World War 2 and just didn’t realize it until the bills came due all at once over the next decade.\nIn the ’50s, those old yellow paperbacks (for a time, distributed via vending machine) seemed to replace Pulp as Television and Comics came to the fore. Ultimately, those got thicker and more pretentious until they became the ‘elevated’ gas station literature you see today”\n“With thirty different titles ‘written’ by James Patterson, none of which he was ever even dimly aware of. They did sort of morph into the ‘genre fiction’ you’re alluding to throughout the ’80s. And in a weird way, they live on through Star Trek and Star Wars books, Battletech and so on.\nThese publishing houses are essentially printing pulp. It’s just a bit more bloated and seems to have aspirations to be more than it is. Sorry to say, it isn’t and never will be. Which is exactly the way I like it.”\nDARK HERALD:\nI’ve recently run into a few other authors like you and Sky Hernstrom that have written new Robert Howard style high adventures. Do you think there is pulp revival underway? Also, who else do you know of who is working in contemporary Pulp?\nRAZÖRFIST:\n“Yeah, I’ve read some of Sky’s stuff in Cirsova and enjoyed it. The first ‘New Pulp’ writer I was aware of was Barry Reese, who does a Shadow-esque vigilante series featuring characters like ‘The Peregrine’ and ‘Lazarus Grey’.”\n“I think a Pulp Revival is inevitable. Whether it happens now or decades hence. Attention spans have fallen. Smart devices are tucked away in every pocket. Short fiction and bite-sized stories seem the way to go.\nYet, the ‘Phonebook Fantasy’ writers seem to have a minimum page count of 500 and fill the majority of it with worldbuilding bloat. And despite the name, it isn’t all that novel, either. None of them are doing anything terribly interesting to justify it.\nWriting straightforward Fantasy is fine – I love it to death – It’s the pretense that it’s anything more that I can’t abide. And the smug superiority as they look down their nose at shorter, more plot-driven fiction.”\nDISCUSS ON SG",
  "tags": [
    "books",
    "interview"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-21T15:27:55+00:00"
}