{
  "url": "https://voxday.net/2022/06/06/no-confidence-in-bozo/",
  "scraped_at": "2026-01-08T13:21:05.990561",
  "title": "No Confidence in Bozo",
  "date_display": "June 6, 2022",
  "date_iso": "2022-06-06T09:36:01+00:00",
  "date_from_url": "2022-06-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Given that Boris Johnson appears to be as shameless as he is sexually incontinent, it is unlikely that he will resign even after having been caught lying to his party, his nation, and the British Parliament regarding what the British media calls Partygate. But it will be interesting to see <a href=\"https://www.dailymail.co.uk/news/article-10888475/PM-face-vote-no-confidence-TONIGHT-does-work.html\">how many Conservative MPs have had enough</a> of his buffoonish imitation of a cartoon Churchill, although given the fecklessness of the Labour Party leadership and the absence of any creditable alternatives besides Jacob Rees-Mogg, one would expect him to survive the vote.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Boris Johnson is facing a dramatic vote of no confidence today as rebel Tory MPs chose their moment to strike.</p><p>Sir Graham Brady, chairman of the backbench 1922 Committee, confirmed this morning that he has now received the 54 letters from Conservative MPs needed to trigger a vote. The secret ballot, which will take place at Westminster today between 6pm and 8pm, raises the possibility that Mr Johnson’s tenure could come to a crashing end less than three years after he won a stunning 80-strong Commons majority.</p><p>It comes after a steady stream of Tory MPs called publicly for the Prime Minister to stand down in the wake of Sue Gray’s report into illegal Covid parties in No 10 and Whitehall. In order to oust the Prime Minister however the rebels will need 180 MPs, and allies of Mr Johnson – including members of the Cabinet – have made clear he is determined to fight to stay on.</p></blockquote><p>Besides Rees-Mogg, who is unfortunately <a href=\"https://www.jacobreesmogg.com/russian-invasion-of-ukraine\">every bit as clueless about World War Clown</a> as Johnson, Dominick Cummings is about the only first-class political mind in the UK these days, but he’s even more hated by the media and even less likely to ever be elected Prime Minister than I am. He was, however, certainly right about the prospects for the Johnson administration last fall.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Reminder… Last autumn pundits were telling you to prepare for a decade of ‘unassailable Boris’ who had sorted out No10 with ‘grownups’ and ‘gripped’ Whitehall, his relationship with the Chancellor was solid, breaking the ‘no income tax’ guarantee was ‘popular’(!), and Boris had nothing to fear from the old Vote Leave team.</p><p>I told you No10 was a shitshow, would collapse in chaos, the PM and Chancellor relationship was broken, the tax increases would be a policy and political disaster particularly given the looming cost of living nightmare, and I said — I’ve sold all my shares, prepare for supply chain meltdown, Putin whacking Europe including over energy, energy spikes, and financial market chaos.</p><p>Boris is happy to escalate because he thinks the more MPs think about war the less likely they bin him before July and if he makes it to August he has a good shot at surviving to the election. So he sends out the human handgrenade — my nickname for Liz Truss because she blows up all she touches — to redefine our goal as pushing Russia out of Crimea, thus setting us up for either humiliating failure or world war.</p></blockquote><p>And today, he was proven correct about the timing of the vote of no confidence, as it has come more than a month before 21 July 2022. So one hopes he will post a prediction of the result before the votes come in.</p><p><em>I still think the letters will come in before MPs rise for summer…</em></p><p><strong>UPDATE: </strong>Not looking great for Bozo. Even if he wins, as one expects he will, it may not be by enough to preserve his political viability. Most British Prime Ministers who win no-confidence votes end up resigning within months.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Theresa May faced a vote of confidence in her leadership on December 12 2018. News that the contest would take place was announced early that morning by Sir Graham Brady – then, as now, the chairman of the backbench 1922 Committee of MPs – with the ballot taking place the same day between 6pm and 8pm. By 12.16pm that day, Theresa May had got to the public backing of the 158 Tory MPs she needed to win the vote. And the Daily Mail’s deputy political editor John Stevens points out today: ‘It is now 1pm and Boris Johnson is only up to 82.’</p></blockquote><p>My impression is that no one in their right mind wants to even think about going to war against the Sino-Russian alliance with Boris Johnson at the helm.</p><p><strong>UPDATE:</strong> He needed 180, he got 211. So, he survives for now. But the 148 no-confidence votes were much higher than anticipated, and indicates that the Johnson ministry is probably nearing its end.</p><p><em><a href=\"https://social.infogalactic.com/micropost/74a80899-f077-4a63-8295-0509849abf25\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Given that Boris Johnson appears to be as shameless as he is sexually incontinent, it is unlikely that he will resign even after having been caught lying to his party, his nation, and the British Parliament regarding what the British media calls Partygate. But it will be interesting to see\nhow many Conservative MPs have had enough\nof his buffoonish imitation of a cartoon Churchill, although given the fecklessness of the Labour Party leadership and the absence of any creditable alternatives besides Jacob Rees-Mogg, one would expect him to survive the vote.\nBoris Johnson is facing a dramatic vote of no confidence today as rebel Tory MPs chose their moment to strike.\nSir Graham Brady, chairman of the backbench 1922 Committee, confirmed this morning that he has now received the 54 letters from Conservative MPs needed to trigger a vote. The secret ballot, which will take place at Westminster today between 6pm and 8pm, raises the possibility that Mr Johnson’s tenure could come to a crashing end less than three years after he won a stunning 80-strong Commons majority.\nIt comes after a steady stream of Tory MPs called publicly for the Prime Minister to stand down in the wake of Sue Gray’s report into illegal Covid parties in No 10 and Whitehall. In order to oust the Prime Minister however the rebels will need 180 MPs, and allies of Mr Johnson – including members of the Cabinet – have made clear he is determined to fight to stay on.\nBesides Rees-Mogg, who is unfortunately\nevery bit as clueless about World War Clown\nas Johnson, Dominick Cummings is about the only first-class political mind in the UK these days, but he’s even more hated by the media and even less likely to ever be elected Prime Minister than I am. He was, however, certainly right about the prospects for the Johnson administration last fall.\nReminder… Last autumn pundits were telling you to prepare for a decade of ‘unassailable Boris’ who had sorted out No10 with ‘grownups’ and ‘gripped’ Whitehall, his relationship with the Chancellor was solid, breaking the ‘no income tax’ guarantee was ‘popular’(!), and Boris had nothing to fear from the old Vote Leave team.\nI told you No10 was a shitshow, would collapse in chaos, the PM and Chancellor relationship was broken, the tax increases would be a policy and political disaster particularly given the looming cost of living nightmare, and I said — I’ve sold all my shares, prepare for supply chain meltdown, Putin whacking Europe including over energy, energy spikes, and financial market chaos.\nBoris is happy to escalate because he thinks the more MPs think about war the less likely they bin him before July and if he makes it to August he has a good shot at surviving to the election. So he sends out the human handgrenade — my nickname for Liz Truss because she blows up all she touches — to redefine our goal as pushing Russia out of Crimea, thus setting us up for either humiliating failure or world war.\nAnd today, he was proven correct about the timing of the vote of no confidence, as it has come more than a month before 21 July 2022. So one hopes he will post a prediction of the result before the votes come in.\nI still think the letters will come in before MPs rise for summer…\nUPDATE:\nNot looking great for Bozo. Even if he wins, as one expects he will, it may not be by enough to preserve his political viability. Most British Prime Ministers who win no-confidence votes end up resigning within months.\nTheresa May faced a vote of confidence in her leadership on December 12 2018. News that the contest would take place was announced early that morning by Sir Graham Brady – then, as now, the chairman of the backbench 1922 Committee of MPs – with the ballot taking place the same day between 6pm and 8pm. By 12.16pm that day, Theresa May had got to the public backing of the 158 Tory MPs she needed to win the vote. And the Daily Mail’s deputy political editor John Stevens points out today: ‘It is now 1pm and Boris Johnson is only up to 82.’\nMy impression is that no one in their right mind wants to even think about going to war against the Sino-Russian alliance with Boris Johnson at the helm.\nUPDATE:\nHe needed 180, he got 211. So, he survives for now. But the 148 no-confidence votes were much higher than anticipated, and indicates that the Johnson ministry is probably nearing its end.\nDISCUSS ON SG",
  "tags": [
    "politics",
    "UK"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-06T20:05:14+00:00"
}