{
  "url": "https://voxday.net/2022/06/16/running-on-empty/",
  "scraped_at": "2026-01-08T13:21:59.015235",
  "title": "Running on Empty",
  "date_display": "June 16, 2022",
  "date_iso": "2022-06-16T14:05:01+00:00",
  "date_from_url": "2022-06-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Tree of Woe <a href=\"https://treeofwoe.substack.com/p/running-on-empty-part-iv?utm_source=email&amp;s=r\">contemplates the global economic order</a> and the reinvention of the Third World in a four-part series.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Part I of this series explained that the US dollar is the world’s first reserve currency that is not backed by precious metals. Instead it is backed by other people’s oil. Because of a secret treaty between the US and Saudi Arabia, petroleum can only be purchased with dollars. Every country needs oil, so everyone country needs dollars and sells imports to the US to get them. Demand for dollars has made the USD the primary American export, allowing the US to deindustrialize and financialize its economy.</p><p>Part II explained how the petrodollar has grossly enriched American asset holders (stocks, bonds, and real estate) and painfully impoverished American wage earners. Under the petrodollar system, dollars are created by private banks for profit. These dollars are recycled into the economy by OPEC nations, causing stocks, bonds, and real estate to rise. This profitable exchange is enforced by American military might, which punishes any country that seeks to exit the petrodollar system.</p><p>Part III explained that for the petrodollar system to function, America needs to be able to project power worldwide to secure international trade and enforce the system. America secures global commerce and projects military power by commanding the World Ocean, by which 90% of all goods are trafficked. To overcome America’s naval supremacy, both Russia and China have sought to establish control of the World Island, the Eurasian supercontinent that houses most of the world’s population and resources. The Russo-Ukraine War is a proxy war between the uncontested master of the World Ocean (America) and the would-be masters of the World Island (China and Russa).</p><p>In Part IV, we’ll discuss how faulty expectations by both sides in the Russo-Ukraine War have led to sanctions of such severity might cause the petrodollar system to break down.</p></blockquote><p>It’s an excellent series, and you’d expect, although my perspective on the military situation is a little bit different. I don’t think Russia <span style=\"text-decoration: underline;\">expected</span> to quickly knock Ukraine out of the war. I think they <span style=\"text-decoration: underline;\">hoped</span> to do so with their opening gambit that included the lightning light infantry assault on Kiev, but that Operation Z never depended upon it.</p><p>The relatively small number of troops utilized, the way in which Russia has not heavily utilized its air and sea superiority, the second-rate units utilized, and the way Russia has methodically focused on attrition warfare in the Donbass all demonstrate that Russia has been holding its forces in ready to take on NATO directly. Just as the Germans were surprised by Russian manufacturing capabilities, Russian shell production has resulted in NATO complaining about Russia’s overwhelming artillery advantage, with the Russian forces able to fire <a href=\"https://www.nytimes.com/2022/06/10/world/europe/ukraine-ammo-shortage-artillery.html\">up to 60,000 shells and rockets per day</a> several months after we were informed that Russia was going to run out of ammunition within two weeks.</p><p>However, this doesn’t undermine Tree of Woe’s case so much as it underlines it. Russia has clearly been planning for a long and unrestricted confrontation with NATO and the USA from the start, one which includes both the military and the economic conflicts. Which is precisely why I think it is highly unlikely that the special military operation is going to end with a Ukrainian surrender and a negotiated settlement that brings Russia back into the neoliberal economic order.</p><p>While the World Ocean would cheerfully settle for that now, both Russia and China are obviously aware that it would merely mean putting off the larger conflict for a few years and giving their adversaries time to better prepare for it.</p><p><em><a href=\"https://social.infogalactic.com/micropost/cc74ffc0-0998-4e8f-825c-ebbf48126191/comment/bbcebd7b-0ad8-45b2-8f04-df64b3e99b66\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Tree of Woe\ncontemplates the global economic order\nand the reinvention of the Third World in a four-part series.\nPart I of this series explained that the US dollar is the world’s first reserve currency that is not backed by precious metals. Instead it is backed by other people’s oil. Because of a secret treaty between the US and Saudi Arabia, petroleum can only be purchased with dollars. Every country needs oil, so everyone country needs dollars and sells imports to the US to get them. Demand for dollars has made the USD the primary American export, allowing the US to deindustrialize and financialize its economy.\nPart II explained how the petrodollar has grossly enriched American asset holders (stocks, bonds, and real estate) and painfully impoverished American wage earners. Under the petrodollar system, dollars are created by private banks for profit. These dollars are recycled into the economy by OPEC nations, causing stocks, bonds, and real estate to rise. This profitable exchange is enforced by American military might, which punishes any country that seeks to exit the petrodollar system.\nPart III explained that for the petrodollar system to function, America needs to be able to project power worldwide to secure international trade and enforce the system. America secures global commerce and projects military power by commanding the World Ocean, by which 90% of all goods are trafficked. To overcome America’s naval supremacy, both Russia and China have sought to establish control of the World Island, the Eurasian supercontinent that houses most of the world’s population and resources. The Russo-Ukraine War is a proxy war between the uncontested master of the World Ocean (America) and the would-be masters of the World Island (China and Russa).\nIn Part IV, we’ll discuss how faulty expectations by both sides in the Russo-Ukraine War have led to sanctions of such severity might cause the petrodollar system to break down.\nIt’s an excellent series, and you’d expect, although my perspective on the military situation is a little bit different. I don’t think Russia\nexpected\nto quickly knock Ukraine out of the war. I think they\nhoped\nto do so with their opening gambit that included the lightning light infantry assault on Kiev, but that Operation Z never depended upon it.\nThe relatively small number of troops utilized, the way in which Russia has not heavily utilized its air and sea superiority, the second-rate units utilized, and the way Russia has methodically focused on attrition warfare in the Donbass all demonstrate that Russia has been holding its forces in ready to take on NATO directly. Just as the Germans were surprised by Russian manufacturing capabilities, Russian shell production has resulted in NATO complaining about Russia’s overwhelming artillery advantage, with the Russian forces able to fire\nup to 60,000 shells and rockets per day\nseveral months after we were informed that Russia was going to run out of ammunition within two weeks.\nHowever, this doesn’t undermine Tree of Woe’s case so much as it underlines it. Russia has clearly been planning for a long and unrestricted confrontation with NATO and the USA from the start, one which includes both the military and the economic conflicts. Which is precisely why I think it is highly unlikely that the special military operation is going to end with a Ukrainian surrender and a negotiated settlement that brings Russia back into the neoliberal economic order.\nWhile the World Ocean would cheerfully settle for that now, both Russia and China are obviously aware that it would merely mean putting off the larger conflict for a few years and giving their adversaries time to better prepare for it.\nDISCUSS ON SG",
  "tags": [
    "economics",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-16T19:05:45+00:00"
}