{
  "url": "https://voxday.net/2022/06/13/seven-kill-clot-structures/",
  "scraped_at": "2026-01-08T13:21:45.306903",
  "title": "Seven Kill Clot Structures",
  "date_display": "June 13, 2022",
  "date_iso": "2022-06-13T17:17:08+00:00",
  "date_from_url": "2022-06-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The vaxxed aren’t out of the woods yet. A microscopic analysis of the “blood clots” that have been found in those killed by the vaccines proves that they are not blood clots, but rather, <a href=\"https://www.naturalnews.com/2022-06-12-blood-clots-microscopy-suddenly-died.html\">auto-assembling protein structures</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>We don’t yet know what all these structures are. We know what they are not, however: They are not simply clotted blood cells. If they were, then at the 1500x magnification shown in the last photo, above, we would be able to see individual blood cells. These are not blood cells, they are protein structures.</p><p>Protein structures circulating in the blood like this, building up over time, are clearly being constructed by the body’s cells. The ribosomes in the cells instruct the body what proteins to construct. These ribosomes are hijacked by mRNA gene therapy injections, which overwrite new instructions to the cells, causing them to manufacture something other than human.</p><p>I believe the structures you are seeing above are the result of mRNA protein synthesis instructions which have been injected into people under the false umbrella of “vaccines.” I welcome input from other experts who may have other theories or explanations of where this is coming from.</p><p>More research is needed to confirm the function and composition of these structures, yet because of the extreme censorship and “science authoritarianism” that now exists in the world, no lab or university will dare examine these clots and honestly report the results. To do so would risk losing all NIH funding and federal grants, since the very same people who engineer vaccines and bioweapons also control most science funding in America. Thus, only independent scientists, labs and journalists will dare tell the truth about these clots.</p><p>In conclusion, they are not “blood” clots. They are structures in the blood. They are “structural clots” or “fibrous clots” that are extremely large and are being constructed inside the body over time.</p><p>My grave concern is that every person who has been injected with mRNA instructions may be constructing these fibrous structures inside their bodies at this very minute, and that it’s only a matter of time before they block major arteries or cause heart attacks, strokes or other acute causes of “Sudden Adult Death Syndrome” (SADS).</p><p>I believe these structures may very well explain why so many seemingly healthy adults are suddenly dying.</p></blockquote><p>The problem here is that it’s theoretically <em>possible </em>that these structures are self-constructing in every vaxxed individual, in which case every single one of them is going to die long before their expected life spans have run out. That’s obviously not necessarily the case, but it’s too soon to rule it out because we have zero information about how fast these structures assemble themselves on average.</p><p>The good news is that now that the medical community has been alerted to their existence, it may be possible to develop a technology that will dissolve these structural clots before they start fatally damming the blood flow of the majority of the vaccinated and producing a pandemic of Suddenly.</p><p><em><a href=\"https://social.infogalactic.com/micropost/78c79722-6339-45ef-b070-18722478c33f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The vaxxed aren’t out of the woods yet. A microscopic analysis of the “blood clots” that have been found in those killed by the vaccines proves that they are not blood clots, but rather,\nauto-assembling protein structures\n.\nWe don’t yet know what all these structures are. We know what they are not, however: They are not simply clotted blood cells. If they were, then at the 1500x magnification shown in the last photo, above, we would be able to see individual blood cells. These are not blood cells, they are protein structures.\nProtein structures circulating in the blood like this, building up over time, are clearly being constructed by the body’s cells. The ribosomes in the cells instruct the body what proteins to construct. These ribosomes are hijacked by mRNA gene therapy injections, which overwrite new instructions to the cells, causing them to manufacture something other than human.\nI believe the structures you are seeing above are the result of mRNA protein synthesis instructions which have been injected into people under the false umbrella of “vaccines.” I welcome input from other experts who may have other theories or explanations of where this is coming from.\nMore research is needed to confirm the function and composition of these structures, yet because of the extreme censorship and “science authoritarianism” that now exists in the world, no lab or university will dare examine these clots and honestly report the results. To do so would risk losing all NIH funding and federal grants, since the very same people who engineer vaccines and bioweapons also control most science funding in America. Thus, only independent scientists, labs and journalists will dare tell the truth about these clots.\nIn conclusion, they are not “blood” clots. They are structures in the blood. They are “structural clots” or “fibrous clots” that are extremely large and are being constructed inside the body over time.\nMy grave concern is that every person who has been injected with mRNA instructions may be constructing these fibrous structures inside their bodies at this very minute, and that it’s only a matter of time before they block major arteries or cause heart attacks, strokes or other acute causes of “Sudden Adult Death Syndrome” (SADS).\nI believe these structures may very well explain why so many seemingly healthy adults are suddenly dying.\nThe problem here is that it’s theoretically\npossible\nthat these structures are self-constructing in every vaxxed individual, in which case every single one of them is going to die long before their expected life spans have run out. That’s obviously not necessarily the case, but it’s too soon to rule it out because we have zero information about how fast these structures assemble themselves on average.\nThe good news is that now that the medical community has been alerted to their existence, it may be possible to develop a technology that will dissolve these structural clots before they start fatally damming the blood flow of the majority of the vaccinated and producing a pandemic of Suddenly.\nDISCUSS ON SG",
  "tags": [
    "science",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-13T17:17:10+00:00"
}