{
  "url": "https://voxday.net/2022/06/07/sjws-discover-unintended-consequences/",
  "scraped_at": "2026-01-08T13:21:07.840899",
  "title": "SJWs Discover Unintended Consequences",
  "date_display": "June 7, 2022",
  "date_iso": "2022-06-07T09:56:33+00:00",
  "date_from_url": "2022-06-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Academic SJWs at Stanford are alarmed to discover that when individuals are deplatformed from mainstream platforms, they build their own platforms and become even stronger. Naturally, their response to this is not to conclude that individuals should not be deplatformed, but rather that the platforms should be themselves deplatformed.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Previous research has found that deplatforming toxic users tends to decrease overall reach and income for content producers. However, while deplatforming users, apps, and companies on mainstream platforms may have resulted in a less toxic ecosystem and prevented the spread of hateful messaging on those platforms, it also helped materially preserve Gab as a platform and financially enriched its owners.</p><p>Our findings document several unintended real-world side effects of the deplatforming of both users and platforms, raising the possibility that other interventions on mainstream platforms such as downranking and limiting visibility might curb toxic content more effectively than shifting the problem elsewhere. If deplatforming is deemed the most desirable solution for a given scenario, it may be that this deplatforming would need to be more thorough and widespread to be effective. Hence, more study is needed in several areas:</p><p>• What dynamics and characteristics determine whether deplatforming is effective in reducing toxic message spread across the social media ecosystem as a whole?</p><p>• What is the real-world net effect of attempting to deplatform platforms or apps themselves, versus merely disabling or moderating user accounts on mainstream platforms?</p><p>• What determines whether a deplatforming will result in continued or increased revenue for its targets and associated communities?</p><p>• Beyond deplatforming toxic individuals and services, are further actions possible (or desirable) to ensure that revenue does not flow to toxic venues?</p><p>For example, payment processors have already cut ties with Gab—is there more that could be done to disrupt other financial flows? Answering these questions may prove crucial to developing more holistically effective Trust and Safety practices at the platform, infrastructure, and regulatory levels.</p><cite><em>Gabufacturing Dissent: An in-depth analysis of Gab</em>, David Thiel and Miles McCain, Stanford Internet Observatory, June 1, 2022</cite></blockquote><p>The eventual recommendation of the academics is obviously going to be putting pressure on hosting services, payment systems, the media, and even governments to deplatform and otherwise attempt to silence those who have been designated Toxic Content Producers, because the reduced interest in the mainstream-approved content, the inability of the mainstream platforms to produce profits, and the exposure of <a href=\"https://www.rt.com/business/556731-musk-threatens-quit-twitter-deal/\">massive amounts of platform fraud</a>, are making the alternative platforms increasingly competitive with their mainstream counterparts.</p><p>Of course, pursuing this course of action is eventually going to lead these academic SJWs to discover the same bitter reality that has recently dismayed the politicians of Clown World: while Toxic Content Producers are being deplatformed by Clown World, Clown World is itself being deplatformed by Toxic Content World, which happens to make up the vast majority of the planet and controls the vast majority of its resources.</p><p>The biggest winners of the Content Wars are going to be those who are able to successfully bridge The Great Bifurcation of the two semi-global economies, and the battle-hardening of those who have been repeatedly deplatformed, dehosted, and demonetized is going to give a massive advantage to the Toxic Content Producers.</p><p><strong><em>The Ride Never Ends.</em></strong></p><p><em><a href=\"https://social.infogalactic.com/micropost/ca895e3e-b80c-4291-8512-f2e548406682\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Academic SJWs at Stanford are alarmed to discover that when individuals are deplatformed from mainstream platforms, they build their own platforms and become even stronger. Naturally, their response to this is not to conclude that individuals should not be deplatformed, but rather that the platforms should be themselves deplatformed.\nPrevious research has found that deplatforming toxic users tends to decrease overall reach and income for content producers. However, while deplatforming users, apps, and companies on mainstream platforms may have resulted in a less toxic ecosystem and prevented the spread of hateful messaging on those platforms, it also helped materially preserve Gab as a platform and financially enriched its owners.\nOur findings document several unintended real-world side effects of the deplatforming of both users and platforms, raising the possibility that other interventions on mainstream platforms such as downranking and limiting visibility might curb toxic content more effectively than shifting the problem elsewhere. If deplatforming is deemed the most desirable solution for a given scenario, it may be that this deplatforming would need to be more thorough and widespread to be effective. Hence, more study is needed in several areas:\n• What dynamics and characteristics determine whether deplatforming is effective in reducing toxic message spread across the social media ecosystem as a whole?\n• What is the real-world net effect of attempting to deplatform platforms or apps themselves, versus merely disabling or moderating user accounts on mainstream platforms?\n• What determines whether a deplatforming will result in continued or increased revenue for its targets and associated communities?\n• Beyond deplatforming toxic individuals and services, are further actions possible (or desirable) to ensure that revenue does not flow to toxic venues?\nFor example, payment processors have already cut ties with Gab—is there more that could be done to disrupt other financial flows? Answering these questions may prove crucial to developing more holistically effective Trust and Safety practices at the platform, infrastructure, and regulatory levels.\nGabufacturing Dissent: An in-depth analysis of Gab\n, David Thiel and Miles McCain, Stanford Internet Observatory, June 1, 2022\nThe eventual recommendation of the academics is obviously going to be putting pressure on hosting services, payment systems, the media, and even governments to deplatform and otherwise attempt to silence those who have been designated Toxic Content Producers, because the reduced interest in the mainstream-approved content, the inability of the mainstream platforms to produce profits, and the exposure of\nmassive amounts of platform fraud\n, are making the alternative platforms increasingly competitive with their mainstream counterparts.\nOf course, pursuing this course of action is eventually going to lead these academic SJWs to discover the same bitter reality that has recently dismayed the politicians of Clown World: while Toxic Content Producers are being deplatformed by Clown World, Clown World is itself being deplatformed by Toxic Content World, which happens to make up the vast majority of the planet and controls the vast majority of its resources.\nThe biggest winners of the Content Wars are going to be those who are able to successfully bridge The Great Bifurcation of the two semi-global economies, and the battle-hardening of those who have been repeatedly deplatformed, dehosted, and demonetized is going to give a massive advantage to the Toxic Content Producers.\nThe Ride Never Ends.\nDISCUSS ON SG",
  "tags": [
    "media",
    "politics",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-07T10:12:42+00:00"
}