{
  "url": "https://voxday.net/2022/06/06/some-thoughts-on-hitler/",
  "scraped_at": "2026-01-08T13:21:02.367924",
  "title": "Some Thoughts on Hitler",
  "date_display": "June 6, 2022",
  "date_iso": "2022-06-06T07:39:06+00:00",
  "date_from_url": "2022-06-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In the aftermath of having been publicly accused of harboring “sympathies for Hitler” by certain individuals in the Swiss media on the basis of a single accurate reference to National Socialism, I’ve been cataloguing the public record of my statements in my books, columns and blog posts concerning the late leader of Germany over the last 21 years on the advice of the lawyers. As it happens, I went into some detail on the subject in the first part of Chapter XII of <em>THE IRRATIONAL ATHEIST</em>, published by BenBella Books in 2008.</p><p><strong>HITLER, THE INQUISITION, THE CRUSADES AND HUMAN SACRIFICE</strong></p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>“Now, you will stay in the Comfy Chair until lunch time, with only a cup of coffee at eleven.”</em></p><cite>– Cardinal Ximinez</cite></blockquote><p>It would be impossible to write a book of this sort without addressing the three subjects that inevitably come up when atheists are contending with Christians. Just as atheists anticipate the need to answer for Stalin and Mao, Christians are expected to answer for the Inquisition and the Crusades. And both sides recognize the need to deal with the Hitler Question. Like Einstein,(1) the Führer made enough ambiguous statements to leave the matter up for discussion, unlike Einstein,(2) no one is eager to claim Hitler and his National Socialists as members of their intellectual camp.</p><p>The Unholy Trinity have no choice but to concern themselves with the matter, of course, and they do so largely in the manner that one has come to expect from them.(3) Harris wastes eight pages attempting to tar the Catholic Church and Pope Pius XII with guilt by insufficient opposition,(4) then on the basis of no evidence whatsoever, declares that Auschwitz was a logical and inevitable consequence of the Christian faith.(5) Hitchens also complains about the Catholic Church and relates a few irrelevant anecdotes about Italian Fascists and Irish Blue Shirts, but then shows genuine insight when he notes that the Hitler regime shows us “with terrible clarity what can happen when men usurp the role of gods.”</p><p>Dawkins, on the other hand, demonstrates that he is perfectly capable of presenting a reasonable case when he chooses to do so and lays out some reasonable evidence for the reader to reach his own conclusion on the matter. He avoids making the common case for Hitler’s religious faith on the basis of his abused childhood,(6) wisely, considering that one could apply precisely the same argument to Christopher Hitchens and Dawkins himself. Instead, after quoting Hitler’s public statements which state outright that he is a Christian, and a very devout one at that, Dawkins quotes private statements which reveal a deep hatred for Christianity surpassing that possessed by even the most militant New Atheist.</p><p><em>“It is possible that Hitler had by 1941 experienced some kind of deconversion or disillusionment with Christianity. Or is the resolution of the contradictions simply that he was an opportunistic liar whose words cannot be trusted, in either direction?”</em>(7)</p><p>It is worth noting that most of the statements which indicate Hitler’s Christian faith were made in public, prior to 1934, when he was still a politician running for elected office. Given his subsequent actions once he had secured political power, there is no reason to believe that Hitler meant them any more sincerely than George W. Bush intended to keep his promise to pursue a “more humble foreign policy” three years before he launched an invasion to bring democracy and freedom to the Middle East. But Hitler was no atheist, neither was he agnostic, the evidence tends to suggest that he was a pagan(8) who was skeptical, but open to the possibility of acquiring temporal power through supernatural means.</p><p>The Thule Society which founded the German Workers Party that was the predecessor of the Nazi Party was an esoteric society connected with the occultist Madam Blavatsky and the Theosophists. Hitler was the 55th member of the DAP, which was renamed the National Socialist German Workers Party, or NASDAP, only four months after he joined on October 19, 1919. While the Nazis suppressed their early connection with the Thule Society and even arrested its founder, Rudolf von Sebottendorff, when he published a book about the relationship between Hitler and the society, the Nazi interest in esoteric matters, primarily on the part of Heinrich Himmler and the SS, is well known and has played a role in everything from Charles Stross’s excellent novel, <em>The Atrocity Archives</em>, to <em>Wolfenstein 3D</em> and the Indiana Jones movies.</p><p>It is not known to what extent Hitler shared Himmler’s enthusiasm for the supernatural, but it is reasonable to assume that if he was as skeptical about its existence as the New Atheists are today, he would not have allowed the Reichsführer-SS and founder of the Studiengesellschaft für Geistesurgeschichte, Deutsches Ahnenerbe(9) an annual budget of the modern equivalent of $5.6 million to spend on occult research, medical experiments and expeditions to Sweden, Syria, Iraq, Finland and Tibet.</p><p>And yet, if Dawkins is not quite able to definitively conclude that Adolf Hitler was not a Christian, Robert Wistrich, the professor of modern Jewish history at Hebrew University, has no such qualms.<br/>In “Hitler and the Holocaust”, Wistrich writes:</p><p><em>“Indeed, the leading Nazis – Hitler, Himmler, Rosenberg, Goebbels, and Bormann – were all fanatically anti-Christian, though this was partly hidden from the German public…. The conviction that Judaism, Christianity and Bolshevism represented one single pathological phenomenon of decadence became a veritable leitmotif for Hitler around the time that the “Final Solution” had been conceived of as an operational plan.”</em>(10)</p><p>But the most convincing proof that Hitler was neither an atheist nor a Christian can be seen in two documents that the various New Atheists and Wistrich were probably not aware of at the time they wrote their books. The first of these was prepared by the Office of Strategic Services in preparation for the Nuremburg trials in 1945. Released to the public in 2001, the report from the archives of of Gen. William J. Donovan, special assistant to the U.S. chief of counsel at the Tribunal, is a fascinating description of the Third Reich’s methodical plan to coopt, pervert and ultimately usurp the Catholic and Protestant churches of Germany. As an editor of the the Nuremberg Project for the Rutgers Journal of Law and Religion described it: “They wanted to eliminate the Jews altogether, but they were also looking to eliminate Christianity.”(11)</p><p><em>The first installment, entitled “The Nazi Master Plan; The Persecution of Christian Churches”, shows how the Nazis planned to supplant Christianity with a religion based on racial superiority. The report, prepared by the Office of Strategic Services – a forerunner of the CIA – says: “Important leaders of the National Socialist party would have liked… complete extirpation of Christianity and the substitution of a purely racial religion.”</em>(12)</p><p>The second document is equally significant. It is the 30-point plan for a National Reich Church, drawn up by Alfred Rosenburg, the Nazi ideologist who was Reich Minister for the Occupied Eastern Territories and head of the Centre of National Socialist Ideological and Educational Research. Three of its more significant points are as follows:</p><ol class=\"wp-block-list\"><li>The National Reich Church is determined to exterminate irrevocably and by every means the strange and foreign Christian faiths imported into Germany in the ill-omened year 800.</li><li>The National Reich Church demands immediate cessation of the publishing and dissemination of the Bible in Germany as well as the publication of Sunday papers, pamphlets, publications and books of a religious nature.</li><li>The National Reich Church does not acknowledge forgiveness of sins. It represents the standpoint which it will always proclaim that a sin once committed will be ruthlessly punished by the honorable and indestructible laws of nature and punishment will follow during the sinner’s lifetime.</li></ol><p>One need not be a theologian to recognize that whatever religion happens to lurk behind a church that does not recognize the forgiveness of sins and is determined to suppress the Bible, it is not Christianity.</p><p>Although the only logical conclusion is that Hitler was neither a Christian nor an atheist, there are still lessons that Christians and atheists can learn from his pagan totalitarianism. Christians must recognize that it is possible for their institutions to be infiltrated and utilized for evil purposes even as they religiously attend church and participate in the mainstream of society. Had more German Christians demonstrated the courage of the evangelical Confessing Church and openly opposed Hitler, as did the pastors who signed the 1934 Barman Declaration,(13) much tragedy might well have been averted. Despite the deception that was undeniably involved, Christians have no excuse for being blind to such things, not when they have been warned in the Bible to be on their guard against deceitful wolves in sheep’s clothing.</p><p>As for atheists, they must recognize that science is a deadly foundation on which to build future utopias, and it should make them more than a little uncomfortable to consider the striking similarities in the following three quotes, one from a Humanist, one from a New Atheist and the other from a leading Nazi.</p><ul class=\"wp-block-list\"><li><em>“Religion is something left over from the infancy of our intelligence; it will fade away as we adopt reason and science as our guidelines.“</em> – Bertrand Russell</li><li><em>“The dogma of Christianity gets worn away before the advance of science. Religion will have to make more and more concessions. Gradually the myths crumble.”</em> – Adolf Hitler</li><li><em>“Religion has run out of justifications. Thanks to the telescope and the microscope, it no longer offers an explanation of anything important.”</em> – Christopher Hitchens</li></ul><p>CHAPTER 12 FOOTNOTES</p><ol class=\"wp-block-list\"><li>I concur with Richard Dawkins on this point, despite a few metaphorical statements about God. It is not reasonable to conclude that Albert Einstein was anything but an agnostic or atheist.</li><li>What is unexpected, however, is how much the Nazi Martin Bormann’s description of a metaphorical God sounds almost exactly like Albert Einstein’s as described by Richard Dawkins.</li><li>Given the non-polemical nature of his book, Daniel Dennett commendably sees no reason to mention the matter.</li><li>Harris, <em>The End of Faith</em>, 104. Harris finds it extraordinary that no German Catholics were excommunicated, but then, other than Hitler, there were no former Catholics in the Nazi hierarchy. The most notable Catholic, former Reichkanzler Franz von Papen, was jailed after speaking out against Hitler after Kristallnacht and was acquitted at Nuremberg.</li><li>How strange that it should happen only once in more than 2,000 years, and at the behest of a few fanatical anti-Christians, no less. I further note that the Buddhist Harris neglects to mention the fact that Professor Walter Wüst, who commanded the SS-Ahnenerbe under Himmler after February 1937, publicly declared that Hitler’s ideologies corresponded with those of the Gautama Buddha.</li><li>I seem to recall someone informing us that a Catholic upbringing is even worse than sexual abuse for a child.</li><li>Dawkins, <em>The God Delusion</em>, 276. Given that Hitler was not only a politician, but a stunningly effective one, the answer has to be yes.</li><li>Hitler once made an interesting statement to Bormann about the foolishness of restoring Odin worship, which he refers to as “our old mythology”. As he goes on to talk about getting rid of Christianity, it’s apparent that his goal is to create a new and better Teutonic mythology compatible with science and philosophy.</li><li>The Study Society for Primordial Intellectual Science, German Ancestral Heritage, usually known as the Ahnenerbe, was an SS department set up by Himmler to investigate the ancestral German heritage. It is this group which attempted to find the Holy Grail and other mystic treasures, as portrayed in the movies. <em>The Atrocity Archives</em>, by Charles Stross, are probably the most interesting fictional portrayal of this occultic bureaucracy; my own novella which briefly touches on the subject, “The Lesser Evil”, can be found in the short story collection entitled <em>The Altar of Hate</em>.</li><li>Robert S. Wistrich, <em>Hitler and the Holocaust </em>(New York, 2001), 131-132</li><li>Edward Colimore, “Papers Reveal Nazi Aim: End Christianity” <em>The Philadelphia Inquirer</em>, January 9, 2002.</li><li>“Nazi Trial Documents Made Public”. BBC News, January 11, 2002. The entire OSS report can be downloaded in four PDF files from http://www.lawandreligion.com/nurinst1.shtml.</li><li>“We reject the false doctrine that the Church could have permission to hand over the form of its message and of its order to whatever it itself might wish or to the vicissitudes of the prevailing ideological and political convictions of the day.” The Barmen Declaration, The Confessing Synod of the German Evangelical Church, 1934.</li></ol><p><em>PS: If anyone can send me the transcripts of my debates with Andrew Anglin and Greg Johnson on the subject of National Socialism, that would be appreciated.</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/e2bf4813-3758-4cda-b0b2-acbeaa73b7a0\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "In the aftermath of having been publicly accused of harboring “sympathies for Hitler” by certain individuals in the Swiss media on the basis of a single accurate reference to National Socialism, I’ve been cataloguing the public record of my statements in my books, columns and blog posts concerning the late leader of Germany over the last 21 years on the advice of the lawyers. As it happens, I went into some detail on the subject in the first part of Chapter XII of\nTHE IRRATIONAL ATHEIST\n, published by BenBella Books in 2008.\nHITLER, THE INQUISITION, THE CRUSADES AND HUMAN SACRIFICE\n“Now, you will stay in the Comfy Chair until lunch time, with only a cup of coffee at eleven.”\n– Cardinal Ximinez\nIt would be impossible to write a book of this sort without addressing the three subjects that inevitably come up when atheists are contending with Christians. Just as atheists anticipate the need to answer for Stalin and Mao, Christians are expected to answer for the Inquisition and the Crusades. And both sides recognize the need to deal with the Hitler Question. Like Einstein,(1) the Führer made enough ambiguous statements to leave the matter up for discussion, unlike Einstein,(2) no one is eager to claim Hitler and his National Socialists as members of their intellectual camp.\nThe Unholy Trinity have no choice but to concern themselves with the matter, of course, and they do so largely in the manner that one has come to expect from them.(3) Harris wastes eight pages attempting to tar the Catholic Church and Pope Pius XII with guilt by insufficient opposition,(4) then on the basis of no evidence whatsoever, declares that Auschwitz was a logical and inevitable consequence of the Christian faith.(5) Hitchens also complains about the Catholic Church and relates a few irrelevant anecdotes about Italian Fascists and Irish Blue Shirts, but then shows genuine insight when he notes that the Hitler regime shows us “with terrible clarity what can happen when men usurp the role of gods.”\nDawkins, on the other hand, demonstrates that he is perfectly capable of presenting a reasonable case when he chooses to do so and lays out some reasonable evidence for the reader to reach his own conclusion on the matter. He avoids making the common case for Hitler’s religious faith on the basis of his abused childhood,(6) wisely, considering that one could apply precisely the same argument to Christopher Hitchens and Dawkins himself. Instead, after quoting Hitler’s public statements which state outright that he is a Christian, and a very devout one at that, Dawkins quotes private statements which reveal a deep hatred for Christianity surpassing that possessed by even the most militant New Atheist.\n“It is possible that Hitler had by 1941 experienced some kind of deconversion or disillusionment with Christianity. Or is the resolution of the contradictions simply that he was an opportunistic liar whose words cannot be trusted, in either direction?”\n(7)\nIt is worth noting that most of the statements which indicate Hitler’s Christian faith were made in public, prior to 1934, when he was still a politician running for elected office. Given his subsequent actions once he had secured political power, there is no reason to believe that Hitler meant them any more sincerely than George W. Bush intended to keep his promise to pursue a “more humble foreign policy” three years before he launched an invasion to bring democracy and freedom to the Middle East. But Hitler was no atheist, neither was he agnostic, the evidence tends to suggest that he was a pagan(8) who was skeptical, but open to the possibility of acquiring temporal power through supernatural means.\nThe Thule Society which founded the German Workers Party that was the predecessor of the Nazi Party was an esoteric society connected with the occultist Madam Blavatsky and the Theosophists. Hitler was the 55th member of the DAP, which was renamed the National Socialist German Workers Party, or NASDAP, only four months after he joined on October 19, 1919. While the Nazis suppressed their early connection with the Thule Society and even arrested its founder, Rudolf von Sebottendorff, when he published a book about the relationship between Hitler and the society, the Nazi interest in esoteric matters, primarily on the part of Heinrich Himmler and the SS, is well known and has played a role in everything from Charles Stross’s excellent novel,\nThe Atrocity Archives\n, to\nWolfenstein 3D\nand the Indiana Jones movies.\nIt is not known to what extent Hitler shared Himmler’s enthusiasm for the supernatural, but it is reasonable to assume that if he was as skeptical about its existence as the New Atheists are today, he would not have allowed the Reichsführer-SS and founder of the Studiengesellschaft für Geistesurgeschichte, Deutsches Ahnenerbe(9) an annual budget of the modern equivalent of $5.6 million to spend on occult research, medical experiments and expeditions to Sweden, Syria, Iraq, Finland and Tibet.\nAnd yet, if Dawkins is not quite able to definitively conclude that Adolf Hitler was not a Christian, Robert Wistrich, the professor of modern Jewish history at Hebrew University, has no such qualms.\nIn “Hitler and the Holocaust”, Wistrich writes:\n“Indeed, the leading Nazis – Hitler, Himmler, Rosenberg, Goebbels, and Bormann – were all fanatically anti-Christian, though this was partly hidden from the German public…. The conviction that Judaism, Christianity and Bolshevism represented one single pathological phenomenon of decadence became a veritable leitmotif for Hitler around the time that the “Final Solution” had been conceived of as an operational plan.”\n(10)\nBut the most convincing proof that Hitler was neither an atheist nor a Christian can be seen in two documents that the various New Atheists and Wistrich were probably not aware of at the time they wrote their books. The first of these was prepared by the Office of Strategic Services in preparation for the Nuremburg trials in 1945. Released to the public in 2001, the report from the archives of of Gen. William J. Donovan, special assistant to the U.S. chief of counsel at the Tribunal, is a fascinating description of the Third Reich’s methodical plan to coopt, pervert and ultimately usurp the Catholic and Protestant churches of Germany. As an editor of the the Nuremberg Project for the Rutgers Journal of Law and Religion described it: “They wanted to eliminate the Jews altogether, but they were also looking to eliminate Christianity.”(11)\nThe first installment, entitled “The Nazi Master Plan; The Persecution of Christian Churches”, shows how the Nazis planned to supplant Christianity with a religion based on racial superiority. The report, prepared by the Office of Strategic Services – a forerunner of the CIA – says: “Important leaders of the National Socialist party would have liked… complete extirpation of Christianity and the substitution of a purely racial religion.”\n(12)\nThe second document is equally significant. It is the 30-point plan for a National Reich Church, drawn up by Alfred Rosenburg, the Nazi ideologist who was Reich Minister for the Occupied Eastern Territories and head of the Centre of National Socialist Ideological and Educational Research. Three of its more significant points are as follows:\nThe National Reich Church is determined to exterminate irrevocably and by every means the strange and foreign Christian faiths imported into Germany in the ill-omened year 800.\nThe National Reich Church demands immediate cessation of the publishing and dissemination of the Bible in Germany as well as the publication of Sunday papers, pamphlets, publications and books of a religious nature.\nThe National Reich Church does not acknowledge forgiveness of sins. It represents the standpoint which it will always proclaim that a sin once committed will be ruthlessly punished by the honorable and indestructible laws of nature and punishment will follow during the sinner’s lifetime.\nOne need not be a theologian to recognize that whatever religion happens to lurk behind a church that does not recognize the forgiveness of sins and is determined to suppress the Bible, it is not Christianity.\nAlthough the only logical conclusion is that Hitler was neither a Christian nor an atheist, there are still lessons that Christians and atheists can learn from his pagan totalitarianism. Christians must recognize that it is possible for their institutions to be infiltrated and utilized for evil purposes even as they religiously attend church and participate in the mainstream of society. Had more German Christians demonstrated the courage of the evangelical Confessing Church and openly opposed Hitler, as did the pastors who signed the 1934 Barman Declaration,(13) much tragedy might well have been averted. Despite the deception that was undeniably involved, Christians have no excuse for being blind to such things, not when they have been warned in the Bible to be on their guard against deceitful wolves in sheep’s clothing.\nAs for atheists, they must recognize that science is a deadly foundation on which to build future utopias, and it should make them more than a little uncomfortable to consider the striking similarities in the following three quotes, one from a Humanist, one from a New Atheist and the other from a leading Nazi.\n“Religion is something left over from the infancy of our intelligence; it will fade away as we adopt reason and science as our guidelines.“\n– Bertrand Russell\n“The dogma of Christianity gets worn away before the advance of science. Religion will have to make more and more concessions. Gradually the myths crumble.”\n– Adolf Hitler\n“Religion has run out of justifications. Thanks to the telescope and the microscope, it no longer offers an explanation of anything important.”\n– Christopher Hitchens\nCHAPTER 12 FOOTNOTES\nI concur with Richard Dawkins on this point, despite a few metaphorical statements about God. It is not reasonable to conclude that Albert Einstein was anything but an agnostic or atheist.\nWhat is unexpected, however, is how much the Nazi Martin Bormann’s description of a metaphorical God sounds almost exactly like Albert Einstein’s as described by Richard Dawkins.\nGiven the non-polemical nature of his book, Daniel Dennett commendably sees no reason to mention the matter.\nHarris,\nThe End of Faith\n, 104. Harris finds it extraordinary that no German Catholics were excommunicated, but then, other than Hitler, there were no former Catholics in the Nazi hierarchy. The most notable Catholic, former Reichkanzler Franz von Papen, was jailed after speaking out against Hitler after Kristallnacht and was acquitted at Nuremberg.\nHow strange that it should happen only once in more than 2,000 years, and at the behest of a few fanatical anti-Christians, no less. I further note that the Buddhist Harris neglects to mention the fact that Professor Walter Wüst, who commanded the SS-Ahnenerbe under Himmler after February 1937, publicly declared that Hitler’s ideologies corresponded with those of the Gautama Buddha.\nI seem to recall someone informing us that a Catholic upbringing is even worse than sexual abuse for a child.\nDawkins,\nThe God Delusion\n, 276. Given that Hitler was not only a politician, but a stunningly effective one, the answer has to be yes.\nHitler once made an interesting statement to Bormann about the foolishness of restoring Odin worship, which he refers to as “our old mythology”. As he goes on to talk about getting rid of Christianity, it’s apparent that his goal is to create a new and better Teutonic mythology compatible with science and philosophy.\nThe Study Society for Primordial Intellectual Science, German Ancestral Heritage, usually known as the Ahnenerbe, was an SS department set up by Himmler to investigate the ancestral German heritage. It is this group which attempted to find the Holy Grail and other mystic treasures, as portrayed in the movies.\nThe Atrocity Archives\n, by Charles Stross, are probably the most interesting fictional portrayal of this occultic bureaucracy; my own novella which briefly touches on the subject, “The Lesser Evil”, can be found in the short story collection entitled\nThe Altar of Hate\n.\nRobert S. Wistrich,\nHitler and the Holocaust\n(New York, 2001), 131-132\nEdward Colimore, “Papers Reveal Nazi Aim: End Christianity”\nThe Philadelphia Inquirer\n, January 9, 2002.\n“Nazi Trial Documents Made Public”. BBC News, January 11, 2002. The entire OSS report can be downloaded in four PDF files from http://www.lawandreligion.com/nurinst1.shtml.\n“We reject the false doctrine that the Church could have permission to hand over the form of its message and of its order to whatever it itself might wish or to the vicissitudes of the prevailing ideological and political convictions of the day.” The Barmen Declaration, The Confessing Synod of the German Evangelical Church, 1934.\nPS: If anyone can send me the transcripts of my debates with Andrew Anglin and Greg Johnson on the subject of National Socialism, that would be appreciated.\nDISCUSS ON SG",
  "tags": [
    "history",
    "law",
    "media",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-06T07:51:33+00:00"
}