{
  "url": "https://voxday.net/2022/06/17/summer-book-sale/",
  "scraped_at": "2026-01-08T13:22:00.856824",
  "title": "Summer Book Sale",
  "date_display": "June 17, 2022",
  "date_iso": "2022-06-17T12:44:59+00:00",
  "date_from_url": "2022-06-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>This is not a Castalia sale, but rather, one by a number of our friends, allies, and associates. Please don’t hesitate to support them if there is anything you happen to find interesting. We will, however, have a publishing announcement this weekend.</em></p><p>Check out the <a href=\"https://aetherczar.com/?p=5412\">Super Summer Book Sale</a> running now through Tuesday June 21. Indie and small-press authors have banded together to offer over 160 ebooks priced at $0.99 with many titles free. The sale includes over sixty works new to the sale, and <a href=\"https://terrorhousepress.com/libertycon-book-sale/\">Terror House Press</a> has joined in offering their entire catalog of ebooks for $0.99. Science fiction, fantasy, and adventure from established and emerging talents – there’s something for everyone.</p><p>The sale includes works from John C. Wright, Peter Grant, Russell May, Leigh Bracket, Tom Kratman, John Ringo, David Weber, H.G. Wells, Robert Kroese, and the sale also features “Centrism Games,” the first offering from Professor Rachel Fulton Brown and her Dragon Common Room.</p><p><a href=\"https://threadreaderapp.com/thread/1533838153747865601.html\">Author Larry Correia recently explained</a>, “There’s a lot of really good stuff out there that isn’t woke garbage. There’s a lot of amazing art from brilliant people that’s more focused on entertaining that shoving message down your throat… [T]here are lots of great authors out there who get zilch attention, in an industry that actively black balls them for wrongthink.”</p><p>So support non-woke creators and get yourself some great summer reading books from authors who don’t hate you, today!</p></div>",
  "content_text": "This is not a Castalia sale, but rather, one by a number of our friends, allies, and associates. Please don’t hesitate to support them if there is anything you happen to find interesting. We will, however, have a publishing announcement this weekend.\nCheck out the\nSuper Summer Book Sale\nrunning now through Tuesday June 21. Indie and small-press authors have banded together to offer over 160 ebooks priced at $0.99 with many titles free. The sale includes over sixty works new to the sale, and\nTerror House Press\nhas joined in offering their entire catalog of ebooks for $0.99. Science fiction, fantasy, and adventure from established and emerging talents – there’s something for everyone.\nThe sale includes works from John C. Wright, Peter Grant, Russell May, Leigh Bracket, Tom Kratman, John Ringo, David Weber, H.G. Wells, Robert Kroese, and the sale also features “Centrism Games,” the first offering from Professor Rachel Fulton Brown and her Dragon Common Room.\nAuthor Larry Correia recently explained\n, “There’s a lot of really good stuff out there that isn’t woke garbage. There’s a lot of amazing art from brilliant people that’s more focused on entertaining that shoving message down your throat… [T]here are lots of great authors out there who get zilch attention, in an industry that actively black balls them for wrongthink.”\nSo support non-woke creators and get yourself some great summer reading books from authors who don’t hate you, today!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2022-06-17T12:45:01+00:00"
}