{
  "url": "https://voxday.net/2022/06/12/switzerlands-return-to-poverty/",
  "scraped_at": "2026-01-08T13:21:37.958328",
  "title": "Switzerland’s Return to Poverty",
  "date_display": "June 12, 2022",
  "date_iso": "2022-06-12T15:22:40+00:00",
  "date_from_url": "2022-06-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The once-neutral country chooses a course that will inevitably lead it toward <a href=\"https://www.swissinfo.ch/eng/swiss-adopt-russian-oil-ban-and-other-sanctions-over-ukraine-war/47663920\">economic and geopolitical irrelevance</a> if it is not abandoned:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Swiss government has adopted the latest set of European Union sanctions against Russia and Belarus over the war in Ukraine, including an embargo on crude oil imports and certain refined petroleum products from Russia.</p><p>The Federal Council on Friday decided to adopt the sixth package of sanctions agreed by EU countries on June 3. It includes an embargo that will be introduced progressively on all Russian crude oil delivered by sea to Europe from early December; a ban on all Russian refined oil products will be introduced two months later.</p></blockquote><p>This is really unbelievable from a historical perspective. The Federal Council appears to have forgotten that for centuries, Switzerland was a very poor country that had virtually nothing to offer anyone except Alpine transit routes and its young men’s service as mercenaries. To this day, its national cuisine involves little more than bread and cheese.</p><p>Switzerland became wealthy as a result of two things: banking secrecy, and neutrality. It gave up the former under US pressure in 2010, and formally abandoned the latter in 2022. (One could reasonably make a case for it technically having done so when it joined the UN in 2002, but the more recent action is the more conclusive one.) Compounding the self-destructive effects of nuking its political neutrality, it actually did so <em>on behalf of the losing party</em>, which now almost guarantees that instead of serving as a central business connection between whatever replaces the declining neoliberal order in the former West and the rising Silk Road order in the North, South, and East, Switzerland’s current leaders have foolishly chosen to follow the lead of the increasingly irrelevant West European Co-Prosperity Sphere and taken the risk of rendering their country a very small and uncompetitive node on the wrong side of the Great Bifurcation.</p><p>This isn’t a prediction. This is an observation of <a href=\"https://www.finews.com/news/english-news/51782-switzerland-losing-ground-as-top-financial-center\">a process that is already taking place</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>For the past 200 years, Switzerland has been the number one financial center to attract wealth from other countries. Yet, it will unlikely be able to hang on to its pole position, as wealth increasingly flows to other places. And this isn’t the only area where Switzerland is falling behind.</p><p>Although Switzerland reaped the gains from 2021’s buoyant financial markets, growing 5.5 percent, the report points to more challenging years ahead for the financial center.</p><p>A big blow will come in the next four years when Switzerland falls out of the world’s top three financial centers, into fourth position behind the U.S., Hong Kong, and the U.K. in terms of onshore, cross-border and financial assets held. While Swiss financial assets are expected to grow 2.8 percent by 2026, the report says assets in the U.K. will rise by 3.3 percent (see below).</p><p>Switzerland will take another hit next year when Hong Kong overtakes it as the top financial center for cross-border wealth, ending Switzerland’s 200-dominance as the world’s strongest magnet for foreign wealth.</p><cite>Switzerland Losing Ground Among Top Financial Centers, <em>FINews</em></cite></blockquote><p>Going from neutral to reverse is no way forward.</p><p><em><a href=\"https://social.infogalactic.com/micropost/c09b9bd5-69b7-401a-b259-3395e874bf97\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The once-neutral country chooses a course that will inevitably lead it toward\neconomic and geopolitical irrelevance\nif it is not abandoned:\nThe Swiss government has adopted the latest set of European Union sanctions against Russia and Belarus over the war in Ukraine, including an embargo on crude oil imports and certain refined petroleum products from Russia.\nThe Federal Council on Friday decided to adopt the sixth package of sanctions agreed by EU countries on June 3. It includes an embargo that will be introduced progressively on all Russian crude oil delivered by sea to Europe from early December; a ban on all Russian refined oil products will be introduced two months later.\nThis is really unbelievable from a historical perspective. The Federal Council appears to have forgotten that for centuries, Switzerland was a very poor country that had virtually nothing to offer anyone except Alpine transit routes and its young men’s service as mercenaries. To this day, its national cuisine involves little more than bread and cheese.\nSwitzerland became wealthy as a result of two things: banking secrecy, and neutrality. It gave up the former under US pressure in 2010, and formally abandoned the latter in 2022. (One could reasonably make a case for it technically having done so when it joined the UN in 2002, but the more recent action is the more conclusive one.) Compounding the self-destructive effects of nuking its political neutrality, it actually did so\non behalf of the losing party\n, which now almost guarantees that instead of serving as a central business connection between whatever replaces the declining neoliberal order in the former West and the rising Silk Road order in the North, South, and East, Switzerland’s current leaders have foolishly chosen to follow the lead of the increasingly irrelevant West European Co-Prosperity Sphere and taken the risk of rendering their country a very small and uncompetitive node on the wrong side of the Great Bifurcation.\nThis isn’t a prediction. This is an observation of\na process that is already taking place\n.\nFor the past 200 years, Switzerland has been the number one financial center to attract wealth from other countries. Yet, it will unlikely be able to hang on to its pole position, as wealth increasingly flows to other places. And this isn’t the only area where Switzerland is falling behind.\nAlthough Switzerland reaped the gains from 2021’s buoyant financial markets, growing 5.5 percent, the report points to more challenging years ahead for the financial center.\nA big blow will come in the next four years when Switzerland falls out of the world’s top three financial centers, into fourth position behind the U.S., Hong Kong, and the U.K. in terms of onshore, cross-border and financial assets held. While Swiss financial assets are expected to grow 2.8 percent by 2026, the report says assets in the U.K. will rise by 3.3 percent (see below).\nSwitzerland will take another hit next year when Hong Kong overtakes it as the top financial center for cross-border wealth, ending Switzerland’s 200-dominance as the world’s strongest magnet for foreign wealth.\nSwitzerland Losing Ground Among Top Financial Centers,\nFINews\nGoing from neutral to reverse is no way forward.\nDISCUSS ON SG",
  "tags": [
    "banks",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-12T17:34:56+00:00"
}