{
  "url": "https://voxday.net/2022/06/19/the-fault-of-the-west/",
  "scraped_at": "2026-01-08T13:22:13.496320",
  "title": "The Fault of the West",
  "date_display": "June 19, 2022",
  "date_iso": "2022-06-19T10:05:09+00:00",
  "date_from_url": "2022-06-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>An excellent <a href=\"https://www.lifesitenews.com/opinion/abp-vigano-freemasonry-is-using-the-who-and-the-bergoglian-church-to-advance-its-global-coup/\">interview of Archbishop Viganò</a> by Armando Manocchia. While it’s focused on Italy, it’s applicable across the entire Empire of Lies. Read the whole thing.</em></p><p><strong>Archbishop Viganò:</strong> The fault of the West is to have believed the lies of the Revolution, – which was also a Great Reset – to have allowed itself to be dragged into a whirlpool of rebellion and apostasy, of violence and death. But isn’t that ultimately what happened to Adam and Eve when they let themselves be tempted by the Serpent? Even then Satan’s promise was patently false and mendacious, but Adam and Eve succumbed to the tempter’s words – You will be like gods! – and they discovered that they had been deceived.</p><p>What did we Westerners think we could achieve by cutting off the heads of kings, nobles and prelates? What did we think could improve, with characters like Fouchet, Danton, Robespierre and the whole jumble of corrupt assassins that was supposed to replace those who were guillotined? Did any of us really think that allowing divorce was progress? Or that giving the mother the right to kill the child she carries in her womb was a conquest of freedom? Or that poisoning the elderly in their sleep or the sick or the poor is a sign of civilization? Is there anyone who is honestly convinced that the ostentation of the most abominable vices is a fundamental right, or that a person can change his sex, grotesquely modifying what Nature has already decided? Those who accept these horrors do so only because these horrors are imposed as a model of “civilization” and “progress,” and those who accept them want to follow the masses without standing out.</p><p>The problem is that contemporary man is the son of the Revolution, unconsciously indoctrinated into “political correctness,” to relativism, to the idea that there is no objective truth and that all ideas are equally acceptable. This disease of thought is the first cause of the success of the adversaries, because many people ally themselves with accepting their principles without understanding that it is precisely those ideas that have made it possible to transform our society [in such a destructive way].</p><p>Enslavement to the European Union – and its infernal ideology – was just one of the last steps by which Italy was given the coup de grace. That is why, when I hear praise for the Revolution, the declaration of human rights, the Enlightenment, the Risorgimento and the Expedition of the Thousand [a legendary patriotic moment in the history of Italian reunification in 1860], I shudder: globalism is the metastasis of all modern errors, which only the Church – from her very beginning – has known how to condemn with foresight. And in fact, if globalism has experienced an acceleration, we owe it precisely to the fact that since Vatican II the hierarchy has been transformed from being a sworn enemy of the Masonic conspiracy into its zealous ally.</p><p><strong>A Manocchia: </strong><em>The West is undergoing a constant and unstoppable demographic decline, with all of the consequences that this entails. The current “Vulgate” maintains that it is a worrying phenomenon for humanity because it will cause greater poverty. Could demographic decline be the main cause of economic decline? This phenomenon does not seem to concern the governments of Western countries. Why is this so, in your opinion?</em></p><p><strong>Archbishop Viganò: </strong>We know, by the explicit admission of the globalists, that their main purpose is to drastically reduce the world’s population. Italian Minister for Ecological Transition Roberto Cingolani – who coincidentally comes from the Leonardo [aerospace, defense and security] company – claims that the planet is “designed” for no more than three billion people. He should graciously explain to us how he proposes to eliminate the difference, and above all who has ever authorized him – along with his government, the European Union, the U.N., the WHO and the whole globalist mafia – to decide motu proprio to proceed in this direction with abortion, euthanasia, pandemics, experimental serums, wars, famines, and mass homosexuality. Who appointed them “horsemen of the Apocalypse”? Who approved their project by popular vote, assuming that such a project could ever be proposed for approval by a nation’s citizens?</p><p>It does not surprise me, therefore, that Western leaders are not concerned about the falling birth rate, the data of which for our country is largely offset by the presence of many non-EU citizens, who are much more prolific than Italians. The decrease in population is the result of the premises that have been set precisely for this purpose, just as the lockdowns served to destroy the economy that had already been lain prostrate by competition from multinational corporations and unfair taxation. In short: we are being governed by members of a global lobby of criminal conspirators who tell us directly that their plan is to eliminate us, and the whole time we are sitting here wondering why we have to wear masks on buses and not in restaurants.</p><p><em>The archbishop is absolutely correct: globalism is not only the metastasis of all modern errors, it is the latest iteration of the Dream of Babel. And each and every concept and ideology that serves globalism, from democracy, equality, and free trade to transgenderism, thought policing, and usury, are rooted in the same satanic inspiration.</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/6a7e8853-53a7-47bb-a786-14834b4d89a1\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "An excellent\ninterview of Archbishop Viganò\nby Armando Manocchia. While it’s focused on Italy, it’s applicable across the entire Empire of Lies. Read the whole thing.\nArchbishop Viganò:\nThe fault of the West is to have believed the lies of the Revolution, – which was also a Great Reset – to have allowed itself to be dragged into a whirlpool of rebellion and apostasy, of violence and death. But isn’t that ultimately what happened to Adam and Eve when they let themselves be tempted by the Serpent? Even then Satan’s promise was patently false and mendacious, but Adam and Eve succumbed to the tempter’s words – You will be like gods! – and they discovered that they had been deceived.\nWhat did we Westerners think we could achieve by cutting off the heads of kings, nobles and prelates? What did we think could improve, with characters like Fouchet, Danton, Robespierre and the whole jumble of corrupt assassins that was supposed to replace those who were guillotined? Did any of us really think that allowing divorce was progress? Or that giving the mother the right to kill the child she carries in her womb was a conquest of freedom? Or that poisoning the elderly in their sleep or the sick or the poor is a sign of civilization? Is there anyone who is honestly convinced that the ostentation of the most abominable vices is a fundamental right, or that a person can change his sex, grotesquely modifying what Nature has already decided? Those who accept these horrors do so only because these horrors are imposed as a model of “civilization” and “progress,” and those who accept them want to follow the masses without standing out.\nThe problem is that contemporary man is the son of the Revolution, unconsciously indoctrinated into “political correctness,” to relativism, to the idea that there is no objective truth and that all ideas are equally acceptable. This disease of thought is the first cause of the success of the adversaries, because many people ally themselves with accepting their principles without understanding that it is precisely those ideas that have made it possible to transform our society [in such a destructive way].\nEnslavement to the European Union – and its infernal ideology – was just one of the last steps by which Italy was given the coup de grace. That is why, when I hear praise for the Revolution, the declaration of human rights, the Enlightenment, the Risorgimento and the Expedition of the Thousand [a legendary patriotic moment in the history of Italian reunification in 1860], I shudder: globalism is the metastasis of all modern errors, which only the Church – from her very beginning – has known how to condemn with foresight. And in fact, if globalism has experienced an acceleration, we owe it precisely to the fact that since Vatican II the hierarchy has been transformed from being a sworn enemy of the Masonic conspiracy into its zealous ally.\nA Manocchia:\nThe West is undergoing a constant and unstoppable demographic decline, with all of the consequences that this entails. The current “Vulgate” maintains that it is a worrying phenomenon for humanity because it will cause greater poverty. Could demographic decline be the main cause of economic decline? This phenomenon does not seem to concern the governments of Western countries. Why is this so, in your opinion?\nArchbishop Viganò:\nWe know, by the explicit admission of the globalists, that their main purpose is to drastically reduce the world’s population. Italian Minister for Ecological Transition Roberto Cingolani – who coincidentally comes from the Leonardo [aerospace, defense and security] company – claims that the planet is “designed” for no more than three billion people. He should graciously explain to us how he proposes to eliminate the difference, and above all who has ever authorized him – along with his government, the European Union, the U.N., the WHO and the whole globalist mafia – to decide motu proprio to proceed in this direction with abortion, euthanasia, pandemics, experimental serums, wars, famines, and mass homosexuality. Who appointed them “horsemen of the Apocalypse”? Who approved their project by popular vote, assuming that such a project could ever be proposed for approval by a nation’s citizens?\nIt does not surprise me, therefore, that Western leaders are not concerned about the falling birth rate, the data of which for our country is largely offset by the presence of many non-EU citizens, who are much more prolific than Italians. The decrease in population is the result of the premises that have been set precisely for this purpose, just as the lockdowns served to destroy the economy that had already been lain prostrate by competition from multinational corporations and unfair taxation. In short: we are being governed by members of a global lobby of criminal conspirators who tell us directly that their plan is to eliminate us, and the whole time we are sitting here wondering why we have to wear masks on buses and not in restaurants.\nThe archbishop is absolutely correct: globalism is not only the metastasis of all modern errors, it is the latest iteration of the Dream of Babel. And each and every concept and ideology that serves globalism, from democracy, equality, and free trade to transgenderism, thought policing, and usury, are rooted in the same satanic inspiration.\nDISCUSS ON SG",
  "tags": [
    "globalism",
    "Judeochristianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-19T10:05:12+00:00"
}