{
  "url": "https://voxday.net/2022/06/02/the-elite-faked-their-vaxxes/",
  "scraped_at": "2026-01-08T13:20:42.852426",
  "title": "The Elite Faked Their Vaxxes",
  "date_display": "June 2, 2022",
  "date_iso": "2022-06-02T16:03:56+00:00",
  "date_from_url": "2022-06-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As we all suspected even before the likes of Boris Johnson were being publicly “vaccinated” by syringes with the cap on, it appears that a significant portion of the corporate elite may have arranged <a href=\"https://www.sott.net/article/468242-Police-charge-big-pharma-boss-with-falsifying-his-Covid-vaccination-status\">to avoid the experimental gene therapies</a> to which the masses were repeatedly subjected.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Jose Maria Fernandez Sousa-Faro, president of European pharmaceuticals giant PharmaMar, has been charged by police with being falsely vaccinated against Covid-19. Dr. Sousa-Faro has been caught up in a scandal in Europe involving people being added to the National Immunization Registry in exchange for large sums of money, with many of them familiar faces and household names.</p><p>Police allege that Sousa-Faro arranged to be injected with a saline solution instead of a Covid-19 vaccination and paid thousands of dollars to have his name added to Spain’s immunization register, as confirmed by police sources and reported by El Periodico de Espana.</p><p>Dr. Sousa-Faro is among more than 2,200 celebrities and European elites on the list drawn up by National Police of those falsely vaccinated against Covid. According to <em>El Mundo</em>, Spanish police carried out the investigation called Operation Jenner which uncovered the vast network of celebrities and elites who have paid money to have their names fraudulently entered on the National Immunization Register, despite refusing to be vaccinated.</p><p>The leader of the network was a nursing assistant at the La Paz University Hospital, where he is accused of charging more than €200,000 euros for fraudulently registering 2,200 people as vaccinated in the National Registry against Covid-19. He has been arrested and is currently in custody.</p></blockquote><p>On a surprise scale of 1 to 100, this is about a 4. It was fairly obvious that the globalist elites were getting saline because they haven’t been dropping dead at the same rate as ordinary people. About the only thing I find surprising is that it doesn’t appear to have been officially organized by some high-level WHO agency.</p><p>I suspect at least twice as many people are unvaccinated as are presently believed to be.</p><p><em><a href=\"https://social.infogalactic.com/micropost/876712bb-6e0e-4369-8ed3-4e6b86035868/comment/72affb99-5e50-4dcf-82ec-558a07130757\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "As we all suspected even before the likes of Boris Johnson were being publicly “vaccinated” by syringes with the cap on, it appears that a significant portion of the corporate elite may have arranged\nto avoid the experimental gene therapies\nto which the masses were repeatedly subjected.\nJose Maria Fernandez Sousa-Faro, president of European pharmaceuticals giant PharmaMar, has been charged by police with being falsely vaccinated against Covid-19. Dr. Sousa-Faro has been caught up in a scandal in Europe involving people being added to the National Immunization Registry in exchange for large sums of money, with many of them familiar faces and household names.\nPolice allege that Sousa-Faro arranged to be injected with a saline solution instead of a Covid-19 vaccination and paid thousands of dollars to have his name added to Spain’s immunization register, as confirmed by police sources and reported by El Periodico de Espana.\nDr. Sousa-Faro is among more than 2,200 celebrities and European elites on the list drawn up by National Police of those falsely vaccinated against Covid. According to\nEl Mundo\n, Spanish police carried out the investigation called Operation Jenner which uncovered the vast network of celebrities and elites who have paid money to have their names fraudulently entered on the National Immunization Register, despite refusing to be vaccinated.\nThe leader of the network was a nursing assistant at the La Paz University Hospital, where he is accused of charging more than €200,000 euros for fraudulently registering 2,200 people as vaccinated in the National Registry against Covid-19. He has been arrested and is currently in custody.\nOn a surprise scale of 1 to 100, this is about a 4. It was fairly obvious that the globalist elites were getting saline because they haven’t been dropping dead at the same rate as ordinary people. About the only thing I find surprising is that it doesn’t appear to have been officially organized by some high-level WHO agency.\nI suspect at least twice as many people are unvaccinated as are presently believed to be.\nDISCUSS ON SG",
  "tags": [
    "corpocracy",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-02T16:03:58+00:00"
}