{
  "url": "https://voxday.net/2022/06/30/the-war-for-the-future-of-man/",
  "scraped_at": "2026-01-08T13:23:20.287306",
  "title": "The War for the Future of Man",
  "date_display": "June 30, 2022",
  "date_iso": "2022-06-30T10:26:50+00:00",
  "date_from_url": "2022-06-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An extremely important <a href=\"https://translated.turbopages.org/proxy_u/ru-en.en.438a1a50-62bd35a5-47cf3344-74722d776562/https/russtrat.ru/analytics/16-iyunya-2022-0010-10743\">interview about WWIII</a> with the man who could not unreasonably be considered Russia’s Wang Hunin, who forecast the current conflict after 2008. Definitely read <a href=\"https://translated.turbopages.org/proxy_u/ru-en.en.438a1a50-62bd35a5-47cf3344-74722d776562/https/russtrat.ru/analytics/16-iyunya-2022-0010-10743\">the whole thing</a>.</p><p><em>RUSSTRAT Institute presents a transcript of the speech of Sergey Glazyev, Member of the Board (Minister) for Integration and Macroeconomics of the EEC, at the round table “Russia” held on June 1, 2022 in IA REGNUM: what image of the future meets the goals of national development?”, organized by the RUSSTRAT Institute and REGNUM News Agency.</em></p><p>We are now addressing the fundamental questions of our existence. And a special military operation is a catalyst for this process of understanding our place in the world, and of course, we need an image of the future. I would like to draw your attention to the fact that the special military operation, which was initially announced as denazification, demilitarization – we understand what this means for Ukraine – is now gradually raising the stakes on this front.</p><p>Everyone is already saying that this is a global hybrid war, although it was clear from the beginning that the special operation should be considered in a much broader context. Now many people believe that this is a civilizational war, where different worldview systems are opposed. It is clear that this is a war of good and evil and a war for the survival of humanity in the end.</p><p>Before we talk about the image of our future, I would like to draw your attention to the patterns of long-term socio-economic and political development. We – I mean a group of scientists from the Academy of Sciences who work in long cycles of economic and social development-first of all, we managed to foresee this particular war in 2022. Back in the 14th year, it was clear that the challenge that we faced and the result of which was reunification with the Crimea, will necessarily affect the entire Russian world, including the territory of Ukraine. I even published a book, <em>The Last World War</em>.</p><p>Somewhere, what we see today was absolutely and almost precisely formulated, including the number of Ukrainian Armed Forces and the role of the Americans and the British in this occupation of Ukraine, as well as the cultivation of Ukrainian Nazism. All this was predicted almost to the last detail. We are continuing our research. According to which the peak of the confrontation falls on 2024. This is the forecast that my colleague gave 10 years ago, even before the current military operation and even before 2014. And then there were no new political seven-year cycles.</p><p>Why 2024 and why are we in such a situation of hybrid warfare? The fact is that the modern period is characterized by two simultaneous revolutionary events. The first is the technological revolution, which used to be talked about a lot. It is called differently, we say that it is a change of technological structures. And always this change in technological patterns occurs through the economic depression, which in this cycle began in the world in 2008 – with the beginning of the global financial crisis.</p><p>And during this transition phase, a new technological order has already been formed, a well-known complex of nano-engineering information and communication technologies, which is evolving not only into the economy. But also in the ways of conducting military operations, too. We actually see that we are facing more than just an enemy based in the Pentagon and Mi6. Our troops are facing artificial intelligence. This is already a war of a new technological order.</p><p>But a more important point is the change in world economic patterns in the context of our current topic. The change of national economic structures is a process that occurs once a century and during which the management system changes. Previously, we would call this the process of socio-political revolution, but, speaking in a modern way, this is a radical change in the institutions of world economic relations, industrial relations and the entire system of managing socio-economic development, which is also accompanied by a change in the centers of the world economy.</p><p>The global economy is rapidly shifting to Southeast Asia, which already accounts for more than half of gross domestic product growth. And in this new center of the world economy, a completely different management system has been formed compared to the one in which we live today. I must say that the change in world economic patterns, as you can see in this picture at the top. These are world economic patterns with a once-in-a-century shift cycle. And at the bottom are technological ones, the change of technological structures, which have a cycle of change phases of about 50 years.</p><p>Technological patterns are well known in the literature as long Kondratiev waves, more precisely, the life cycles of technological patterns and their growth phase are a long “Kondratiev wave”. The growth phase of the world economy is a century-long cycle of capital accumulation.</p><p>Once a century, there is a dangerous resonance when we simultaneously face a technological revolution, a socio-economic revolution, and a socio-political revolution. In the course of this process, not only the technology changes, but also the mindset changes. The ideology is changing, if you will. As an example, we will cite the previous phase of changing world economic patterns. </p><p><strong>This is a process that always, unfortunately, occurs through world wars. World wars in this case are caused by the fact that the ruling elite of the previous center of the world economy does not want to part with its hegemony and tries with all its might to keep it, up to the outbreak of a world war</strong>. </p><p><em><a href=\"https://social.infogalactic.com/micropost/db0794c0-b80b-4455-927f-3824ff8d136b\">DISCUSS ON SG</a></em></p><p><span id=\"more-53971\"></span></p><p>100 years ago, when the colonial world economic system was replaced by an imperial one, the world went through two wars, the First and Second World Wars, with the Great Depression between them.</p><p>The colonial world economic system is a system of industrial relations based on a private family firm. In political terms, the greatest extent of this world economic structure was obtained by the British Empire. Where the combination of public administration institutions, the core of which was the monarchical rule of Great Britain, with private capitalist entrepreneurship, gave rise to the English bourgeois oligarchy, which managed to organize large monopolies of the trade and manufacturing type, which ensured Britain’s dominance on the seas and oceans.</p><p>This is the world economic structure of the colonies, where the Russian Empire also played a significant role. This way of life had exhausted its possibilities of development by the end of the nineteenth century. This was due to the fact that the possibilities of using slave labor were exhausted. The model is well described by Marx. When people were trafficked as human goods, on a huge scale-not only in the colonies, but also in the metropolises. People were exploited for 12 hours a day, seven days a week. Private capital used such labor as the main source of enrichment. There was no labor law, no trade unions, no welfare state. All this appeared with the imperial world economic structure.</p><p>But here it is important to understand that the UK has reached the limits of development and countries with more advanced management systems have begun to step on its heels. Including the Russian Empire, Germany, Austria-Hungary, and the United States. The British secret services instigated the First World War, as a result of which Britain became a world leader. It would seem that it has increased as much as possible, but only 20 years have passed – and the Great Depression has been dragged in. No measures to save the British Empire helped. They then – as today the United States is against China-waged a trade war against the United States, imposed an embargo on the import of American goods.</p><p>In the end, although the British Empire remained among the winners during the Second World War, it could not take advantage of the victory due to the archaic nature of its management system. No one wanted her anymore. It no longer provided any economic progress. Economic growth based on the exploitation of slave labor has ceased to produce surplus product. The British Empire collapsed just 2 years after the Second World War. This is important for us now from the point of view of historical analogy.</p><p>A new world economic order. We called it Imperial, because for the first time in the world, it covered almost the entire planet. Two-thirds of the world. The other third was the Soviet Union. Its world economic structure was based on a social state, on vertically integrated large-scale production structures. It focuses on the issue of money and the use of money not so much as capital, but as a tool for financing economic growth.</p><p>In general, the world economic order was in three ideological varieties. The first two are well known to us. The Soviet system with scientific and industrial associations led by the Communist Party, which built socialism with a claim to communism. The American system, which was based on multinational corporations and the boundless issue of the dollar, which allowed them to lead world expansion.</p><p>And the third system, which sank into oblivion thanks to the feat of the Soviet people – the system of European fascism, in which German national socialism, together with the Italian corporate state and with Nazis of all stripes from various other European countries, tried to impose their Nazi version of this world economic system on the world.</p><p>I note that the colonial world economic system actually turned out to be absolutely uncompetitive. Britain lost the war in Europe to German fascism in just two years, and only the power of the Soviet Union and the help of the United States, a country that already had a new system of governance, managed to crush this fascist scenario. And then the colonial system of Britain ordered to live for a long time.</p><p>In other words, this historical experience shows that the change in world economic patterns passes through the public consciousness, of course. And the emergence of a new management system, and this is primarily relations between people, cannot but be combined with a new system of ideas, views and principles.</p><p>Now we have a similar process going on. We are moving away from the imperial world economy, where only the United States remains. There, this transition began with the collapse of the Soviet Union. Just like 100 years ago, it has been going on for 30 years. Just like the previous transition lasted almost from 14 to 1947. So the current transition has been going on for a third of a century.</p><p>After the collapse of the Soviet Union, which was the first to fail to meet the demands of scientific and technological progress, we now see the collapse of the United States. The United States is no longer a world leader. In an attempt to overcome the global financial crisis by pumping money, the United States eventually led the situation to the breakdown of the entire financial system and increasing inflation, which is already reaching 30% at enterprise prices.</p><p>We saw the self-discrediting of the American system in the last presidential election, which was virtually rigged. America is not a more attractive image. In addition, compared to China and India, which have been doing brilliantly over the past 15 years, both the US and the EU, despite a fourfold increase in the monetary base, have not been able to embark on sustainable economic development. The efficiency of the Western management system — here, if we take the efficiency – the money issue is 20-25%. Only every 4th or 5th euro that is issued gets into the manufacturing sector.</p><p><strong>China and India have developed a fundamentally different management system that combines strategic central planning with market competition</strong>, where the state plays a dominant role in organizing money circulation and provides private businesses with unlimited access to money if this leads to an increase in public welfare.</p><p>All forecasts show that by the end of this decade, the old world economic structure will be reduced by more than half by now, and the core of the Asian accumulation cycle – China, India, Indochina, Japan, and Korea – will already be absolutely dominant in all macroeconomic indicators.</p><p>This process is irreversible, but the closer this obvious transition is, the less forces remain in the core of the old world economic system, the more aggressive they become. This is where the same hybrid warfare mechanism that the British used in both World War I and World War II works. We called them hybrid wars because they were fought over territory.</p><p>As part of the new world economic order, wars are now being waged for the consciousness and minds of citizens of different countries, and, unlike the war of the last century, <strong>the current war is primarily a war for dominance in the public consciousness. Therefore, the main front is the information and cognitive front. Here questions of ideology are the main ones.</strong></p><p>The second most important front is the monetary and financial one, where the United States and the European Union still dominate. And only in the third turn are tanks, missiles and planes used, which are actually designed to punish the defeated within the framework of this hybrid-world war. That is, to frighten, destroy any desire for resistance, and so on.</p><p>Just as Great Britain unleashed the First World War, when it already understood that the combined power of Germany, Russia, and Austria-Hungary exceeded that of Britain and only a few years remained for a turning point in world leadership, so the American ruling elite started a world hybrid war. At the same time, as we can see, the US trade war against China is unfolding. The sanctions war against us has already been going on for more than 8 years – and this aggravation of geopolitical tensions today results in dramatic events, in which we are fully involved today.</p><p>What is the difference between the new world economic system and the previous one, the imperial one? Please note that the state that is now formed in China and India, it takes into itself all the achievements of state-building in previous eras. This is a social state. It is a democratic State governed by the rule of law, but it is also sovereign. That is, the peculiarity of the new world economic order is that the leading state does not try to impose its own models on all other countries.</p><p>If in the imperial world economic order there were three models, two of which took place – Soviet and American, and the third, which did not take place – German-Fascist. They tried to remake the whole world in their own image. Create the same fractals everywhere as in the center.</p><p><strong>In the new world economic order, world economic sovereignty is being restored. This is a crucial point. In this new world economic order, the state is restoring moral values</strong>. <strong>It is a humane state, fair, intellectual, responsible and, in short, ideologically speaking, it is a socialist state.</strong></p><p>But in China, we see a familiar image of the Communist Party at the head of this state. India has the largest democracy in the world, but let’s not discount Gandhian socialism. All these traditions are alive and the management models-I would like to draw your attention – in China and India are quite close. State control over the banking system, unlimited lending to the growth of production, the use of the market for the purposes of economic efficiency of market competition.</p><p>The state encourages private entrepreneurship, and it gives unlimited incentives if it generates income. Hence the growth of the welfare of the people. If private entrepreneurship is conducted destructively, speculates, or tries to profit from the destabilization of the economy, such entrepreneurship is strictly blocked. Both China and India have strict currency controls and capital transfers are not allowed. Money is provided from 0% to 4-6%, depending on the priority of loans. Targeted credit issuance is widely used as a strategic planning tool.</p><p>We called it integral, because the state gathers society here. It gathers different social groups around the main criterion-the rise of social welfare. Accordingly, the entire economic policy is built under this criterion. Let us compare the essence of the economic policy pursued in the new world economic order.</p><p>Here, comparing the existing models of the Washington consensus, I will draw attention to the main difference. First, the goal of the economy is not to make money in any way. The goal of the economy is to raise public welfare.</p><p>Therefore, hence-strategic planning, hence-the use of money as a tool. Hence progressive taxation and practical measures to ensure social justice. All the requirements of the welfare state are in education and healthcare. Which should be free of charge and ensure the reproduction of human capital in the fullest possible way. The tax system of the tax budget is focused on development, and not just on the so-called “functions of a police bureaucratic state”. Prices are regulated based on the desired proportions of economic reproduction<strong>.</strong></p><p><strong>In labor relations, cooperation dominates, and the antagonism between labor and capital disappears completely. In our understanding, the national enterprise is the dominant form of private ownership. An enterprise in which workers are also owners.</strong></p><p>This is how Huawei, Xiaomi and others grow up, which grow out of cooperatives. That is, it is an <strong>economy of social partnership, where money is profit and everything that torments our economy with the export of capital, all this is limited in the system of economic regulation so that people’s income grows. </strong>And the entrepreneur grew in proportion to his contribution to the rise of public welfare.</p><p>And there are no questions about whether an industrial, agricultural, scientific and technical policy is needed. These are all obvious key areas of government policy that manage the market mechanism in the way that is necessary to raise public welfare.</p><p>Turning now to the ideological versions of this new world economic order. The construction of socialism continues in China. Although with Chinese characteristics, but it should be understood in this way. If Soviet socialism sought to make the whole world happy, we wanted to achieve a socialist system all over the world, spending a lot of money on it, then <strong>socialism with Chinese characteristics means that the socialist idea and the national idea go together</strong>.</p><p>And in China, we see the following slogans: this is a society of universal prosperity, this is the great revival of the Chinese nation. <strong>That is, here the idea of socialism and positive nationalism, which does not pretend to national exclusivity, but puts the welfare of its own country at the forefront, is a key characteristic</strong>.</p><p>This is what we see in India. A combination of socialism, market economy and national idea. The national idea, although it is applied in terms of increasing welfare. This is understandable for a country with a huge population that has lived in poverty for centuries. For them, the rise of prosperity is a key moment, no national idea. Moreover, unlike Soviet socialism, which grew up in an environment of a “besieged fortress” and at the same time inevitably had mobilization features and suppression of personal freedom in order to save society and the state, there are no such risks here. Not in China, not in India.</p><p>But it is clear that the future development of the world in the foreseeable future will take place in the same way as in the 20th century, where there was competition between the communist Soviet Union and democratic America. Now the confrontation will unfold between the “democratic West”, communist China and democratic India. The question is where we will be located.</p><p>There is a third version of this ideology of a new world economic order. It is, in fact, a continuation of the Nazi Western, so to speak, ideological vector. Racism dominated the British Empire in the 19th century, and Nazism dominated Europe for a long time during the Second World War.</p><p>And now the receivers of this misanthropic form fill it with the content of posthumanism. An electronic concentration camp, everyone must march in formation and comply with the requirements of the World Health Organization or other analogues of the world government.</p><p>In other words, this is the idea of moving to a posthumanistic, posthuman state, when people are considered as a tool of manipulation. More precisely, the object of manipulation – and the ideology is built under the atomization of society.</p><p><strong>That is, the main ideological vector is the deprivation of people of any collective identity. National identity, gender identity. In general, the human identity even. People begin to perceive themselves as anything-cyborgs, animals, plants.</strong> <strong>Dehumanization is underway, and this kind of posthuman material is embedded in easily manipulated and artificial intelligence, replacing ideologues, in general, imposing their own behavior models on this posthuman world and forcing people to behave as the world’s artificial oligarchic management needs</strong>.</p><p>At the same time, we see the development of methods that allow us to bring this posthuman society to any state. Up to collective self-destruction. I am sure that if they start injecting a vaccine with some kind of poison, there are already mechanisms, most will build up and take this vaccine.</p><p>We are in this transitional world state on the periphery, to put it bluntly. After the collapse of the Soviet Union, we found ourselves on the economic periphery of the United States. Our country was used as a typical peripheral country, from which resources were pumped by billions of tons, capital was pumped out. The brain drain from us there is what the Bologna system was for.</p><p>Those who pushed the Bologna system were all too shy to put it bluntly – the Bologna system is needed in order to ease the brain drain. That we trained qualified personnel here for free, so that they could easily and naturally move around, get a master’s degree abroad and stay there. We were turned into a peripheral country with all its characteristics.</p><p>Now, after the West went to war with us and erected barriers in almost all directions, we are talking about a change in the management paradigm. But we must understand that so far this change in our management system has not even affected us at all. It is on the other side that barriers have been erected that have cut off our control system. That is, they have made it difficult to export capital, but I note that as soon as the situation has stabilized a little, our monetary authorities are starting to export capital again.</p><p>They are starting to encourage the export of capital again! At least take it in rubles, even if you take the money from us! That is, our “money power” works the same way as before. They are not given the opportunity to create conditions for capital outflows, they have, in fact, abolished the possibility of applying the budget rule, but all this still remains and the budget rule has not yet disappeared. It simply cannot be used in the context of the seizure of foreign exchange reserves.</p><p>They introduced a mandatory sale of foreign currency earnings in order to stabilize the exchange rate. Now they want to keep their foreign currency earnings abroad, and they will probably confiscate them in the same way as the state foreign exchange reserves. In other words, our monetary policy remains deeply peripheral, and it still follows the rules of the IMF and the Washington Consensus.</p><p>Because of the sanctions, the public suddenly realized that we are a very rich country, that we could live twice as well as we do, because the outflow of capital has stopped. As soon as the outflow of capital stopped, the ruble immediately rose, purchasing power increased by 1.5 times, and the ruble strengthened further. That is, until now, the main objective function of the “monetary authorities” was to enrich currency speculators.</p><p>This is exactly what the Central Bank worked for. Targeting inflation is ridiculous, because the main factor of inflation is the devaluation of the ruble exchange rate in a situation where the ruble exchange rate is formed by speculators, primarily international speculators. And only 5% of transactions on the Moscow Exchange are transactions for exporters and importers.</p><p>It is obvious that the ruble exchange rate has been manipulated for all these 8 years. On this basis, tens of billions of dollars were exported from Russia. It was currency speculators, where the main role was played by American speculators, who were the main beneficiaries of the current monetary policy. Now, due to political sanctions, this has become impossible. We are being forced, forced to switch to a new management system.</p><p>What should be the management system? There is no need to guess here. We see examples of this new management system in China and India. This is, of course, a mixed management system, where the main setting works for the purpose of improving public welfare. The State is engaged in strategic planning.</p><p>Here is Elena Vladimirovna Panina , one of the authors of the law on strategic planning, who put a lot of effort into its promotion. We have had the law for many years. But at first its implementation was postponed, now it ends up writing tens of thousands of documents on strategic planning, but there are no mechanisms for its implementation.</p><p>Although if you look at it, we have everything separately exists. The mechanism of private and public partnership, special contracts, multilateral investment agreements, special refinancing tools that the Central Bank could use to bring cheap loans for increasing investment. All of this is available separately, but the system doesn’t work as a whole.</p><p>We have been proposing for many years to switch to a system of advanced development, where the emphasis would be on strategy and modernization of economic development based on a new technological order. According to our estimates, we could achieve growth of at least 8% per year by using idle production facilities, saturating the economy with money and enabling enterprises to receive loans at a maximum of 2-3% for the final borrower, for financing investments, for increasing production.</p><p>This is the most complete use of our scientific and technical potential, this is an in-depth processing of raw materials. We have no restrictions on economic growth, except for the artificially high cost of credit created by the “monetary authorities”. Businesses can’t take out loans at no more than 18% or 11%, but they need to take out loans at 1-3% per annum, as is done in China and India.</p><p>Here we are in the Eurasian Union fighting against the export of roundwood, we have imposed an embargo, but for some reason the wood is being taken to China. Because in China, the state allocated as much money as it needed, at 0.2% per annum for 10 years – in order for businesses to create an infrastructure for processing, packaging and harvesting Siberian forest.</p><p>They created the infrastructure, they then began to provide seasonal interest-free loans to our harvesters, and, unable to take a loan from us, our loggers go to China and take loans there. And they bring them wood-voluntarily and without any compulsion. Inside the country, they do not have the opportunity to take loans in order to harvest wood in the season and then, after selling the products, return them back.</p><p>That is, we really see the possibility of achieving high growth rates of at least 8% per year, so I cannot agree with the forecasts of our official departments, which draw us (following Washington) minus 8% this year. Where does minus 8% come from? From the world bank and the monetary fund.</p><p>Washington is trying to impose on us such a pessimistic forecast that “you will have minus 10, because you started a military operation.” Where does the minus 10% figure come from? The EU cuts off exports to Russia and imports from Russia too. Then, using the econometric model, they hypothesize that Russia’s foreign trade will shrink by 30%. And according to this model, which, in fact, is an extrapolation of the existing relationships in the economy, they say that in this case you will have minus 10% of GDP. Although the president tells us that we need to use the opportunities.</p><p>At the last Eurasian Economic Forum, he said that foreign companies are leaving – and maybe it’s better, let them leave, let’s create these industries ourselves. Let’s do import substitution. Let’s fill the outgoing quota of the European Union with our own production. We will develop cooperation in the Eurasian Union and develop relations with our Asian partners.</p><p>That is, if we deal with the development of the economy, where money is not an end in itself, but is a tool for crediting production, then we can fully go this year without a downturn. On the contrary, we can turn this crisis and the departure of our European competitors into an economic boom. The boom of entrepreneurship. To do this, you need to give loans.</p><p>We need to implement the goals of raising public welfare. And not through simple cash injections to support people’s lives, but through the creation of new industries, new jobs. The President has said this many times, but as a result, what we have today in terms of measures to stimulate economic development is, in fact, a continuation of covid-19 small regulatory eases. Unfortunately, there are no real opportunities to increase import substitution investments and implement long-term development programs in terms of reducing the bureaucratic pressure.</p><p>Concluding my speech, I would like to say that the image of the future, I think, is quite obvious. If we understand that before the end of this century, most likely, the American hybrid war will end in collapse for them. They probably don’t realize it yet in their Russophobia, which is located in their subcortex. Therefore, having China as the main enemy, they attacked us, since Russophobia is inherent in Anglo-Saxon geopolitics.</p><p>Geopolitics, which teaches American and British politicians, is based on books of the 19th-20th century-from Halford Mackinder to Zbigniew Brzezinski, and they everywhere have the main idea-this is “how to break up Russia”. Geopolitics is a classic pseudoscience on the topic “how to destroy Russia in any of its historical forms”.</p><p>They became victims of their genetic Russophobic orientation. They lost to China in the trade war, and now they’re on to us. When Crimea was reunited with us, I repeatedly said that sanctions would have been imposed in any case. If they were reunited with Crimea or, on the contrary, disgraced themselves, there would still be sanctions. And today’s war, we also understand, was inevitable. Just 8 years ago, it was possible to do without war and take the entire south-east of Ukraine without a single shot, people themselves came to us.</p><p>Now we have to correct this delay at the cost of great efforts and sacrifices.</p><p>But this conflict was inevitable precisely because of the genetic Russophobia of the American-British ruling elite, which is the core of the ideological and economic core of the Western world. And they are trying to erase us, as they say, without any equivocation, I would say.</p><p>Don’t underestimate it. When the Polish prime minister says “erase”, it means naturally erase, as it was in 1917, when the Russian Empire was erased. As it was after the Troubles, when the Moscow Kingdom was erased. That is, there were precedents when Russia was erased-ideologically, culturally, even to the point of destroying all monuments as far as they could reach, burning chronicles, and so on.</p><p>This is their plan. They think that Russia is the key to world domination. In their delusional minds, this is true. In the basics of their Anglo-Saxon geopolitics, since Mackinder’s time, they teach that in order to control the world, you need to control Eurasia, they call it the big island. In Eurasia, the main one who keeps control, this is Russia.</p><p>Therefore, in order to control the world, it is necessary to capture Russia, split it up, and destroy it. Then the next goal is the destruction of Iran, this is absolutely obvious. And then they think that by encircling China from all sides and isolating it from the rest of the world, they will maintain their dominance, maintain their hegemony<strong>.</strong></p><p><strong>This is an absolutely utopian project, they will lose the war. </strong>They are already losing a key advantage right before our eyes. The same notorious sanctions that caused us to lose foreign exchange reserves and our offshore business today does not know how to continue working.</p><p>In fact, from the point of view of further prospects for a hybrid war, this is a trump card draw, because they had the main advantage in issuing the world currency. And then they played their trump card. They no longer have a global currency, and no one believes them any more – neither politically, ideologically, or economically. A mass exodus from the dollar has begun.</p><p>The Chinese are selling their dollar reserves. Their satellites are still afraid to do this, but here those who sell dollars faster will lose less. Quite obvious. Let’s not forget that half of the dollars that Americans print on a massive scale are located outside the United States. This wave of dollars is coming back to America today. If earlier it was thought that it was good that capital was being drawn into the country, now the avalanche is clearly acquiring inflationary consequences and the collapse of the giant financial bubbles that make up the Western financial and economic system is not far off.</p><p>Today we are thinking about creating a new settlement currency that would be linked to exchange-traded goods. We are building a “One Train, one Way”alliance with China. We are trying to restore international law in the Eurasian integration and strictly adhere to the principles of voluntariness and respect for sovereignty, mutual benefit, and transparency. In other words, we create an attractive image of the new world order. A new world economic order.</p><p>The trouble is that without faster economic growth, our image of the future will not be convincing. Please note that our Eurasian ideologues, for example, Trubetskoy, they brilliantly foresaw the collapse of the Soviet Union in the late 20s of the last century, which was then just getting back on its feet.</p><p>He said that after the workers ‘and peasants’ state has exhausted itself, a new community, a superclass one, will be formed. The Soviet Union will lose its ideological core and collapse. Then comes the era of nationalism. The fragments of the Soviet Union will be tempted by nationalist ideas in order to bring our great country back together. And then it is necessary to overcome nationalism and get rid of Nazism, of course.</p><p>No national or other exclusivity should be allowed! And the basis for a new union can only be an understanding of the commonality of its history. Notice how the Chinese intercept the slogans of the Eurasians. China calls on all nations to unite in a common destiny for humanity. What are the “peoples of one destiny”? These are the peoples of one country. This understanding of the common destiny of humanity is, in fact, the ideological basis of the great Eurasian partnership that our president is talking about.</p><p><strong>But in order to be a leader in this partnership, and not a periphery, it is necessary to ensure advanced rates of economic development. This requires the ideology of a common cause, a common good.</strong></p><p>In conclusion, I will briefly say that this ideology should absorb the achievements of socialism. It is no coincidence that both China and India are dominated by socialist ideology, and with different political constructs. Socialism as an idea of the common good, where the main meaning of the state is service to society. The state does not serve certain social groups, as we have an oligarchy or bureaucracy or someone else. The state is seriously and truly engaged in improving public welfare.</p><p>Therefore, of course, the socialist idea must be present. Without it, a new way of life is impossible, and besides, it has already developed. Socialism should once again return as the dominant ideology, the core of the global economic system of Southeast Asia. If we look at the Japanese model or the Korean one, we will also see the familiar features of the socialist ideology. This is a planning state, a development state.</p><p>As for the issue of ethical values. The new technological order really challenges humanity in the sense that it is technologically possible to move to a post-humanoid state. The emergence of cyborgs, mind manipulation, artificial intelligence. These are all signs of a transition to a posthuman civilization, and if we lose our traditional ethical standards, if we allow this new oligarchic world government to dominate, then no good will come of it. In this case, humanity is finished.</p><p>And, since we are at the forefront of a hybrid war, we can really assume that <strong>the war with the West is going on for the fate of humanity. </strong>And the West today has no image of the future. Universal chipization, artificial intelligence and dehumanization, LGBT people, the destruction of the family, the termination of all forms of human identity – this is an image of death, not the future. This is what the West brings us. Since we are in direct confrontation with him, we can assume that we are really fighting for the preservation of humanity.</p><p>The question is, what should be the ideology here? Obviously, it should be based on traditional values. In short, this should be the image of Christian socialism that has already been largely vulgarized in Europe. With the understanding that we have not only Christian socialism, but also Islamic socialism, Buddhist socialism. I would call this ideology a socially conservative synthesis. A combination of traditional moral values that grew out of the great religions, with the demands of social justice, the social state and the development state.</p></div>",
  "content_text": "An extremely important\ninterview about WWIII\nwith the man who could not unreasonably be considered Russia’s Wang Hunin, who forecast the current conflict after 2008. Definitely read\nthe whole thing\n.\nRUSSTRAT Institute presents a transcript of the speech of Sergey Glazyev, Member of the Board (Minister) for Integration and Macroeconomics of the EEC, at the round table “Russia” held on June 1, 2022 in IA REGNUM: what image of the future meets the goals of national development?”, organized by the RUSSTRAT Institute and REGNUM News Agency.\nWe are now addressing the fundamental questions of our existence. And a special military operation is a catalyst for this process of understanding our place in the world, and of course, we need an image of the future. I would like to draw your attention to the fact that the special military operation, which was initially announced as denazification, demilitarization – we understand what this means for Ukraine – is now gradually raising the stakes on this front.\nEveryone is already saying that this is a global hybrid war, although it was clear from the beginning that the special operation should be considered in a much broader context. Now many people believe that this is a civilizational war, where different worldview systems are opposed. It is clear that this is a war of good and evil and a war for the survival of humanity in the end.\nBefore we talk about the image of our future, I would like to draw your attention to the patterns of long-term socio-economic and political development. We – I mean a group of scientists from the Academy of Sciences who work in long cycles of economic and social development-first of all, we managed to foresee this particular war in 2022. Back in the 14th year, it was clear that the challenge that we faced and the result of which was reunification with the Crimea, will necessarily affect the entire Russian world, including the territory of Ukraine. I even published a book,\nThe Last World War\n.\nSomewhere, what we see today was absolutely and almost precisely formulated, including the number of Ukrainian Armed Forces and the role of the Americans and the British in this occupation of Ukraine, as well as the cultivation of Ukrainian Nazism. All this was predicted almost to the last detail. We are continuing our research. According to which the peak of the confrontation falls on 2024. This is the forecast that my colleague gave 10 years ago, even before the current military operation and even before 2014. And then there were no new political seven-year cycles.\nWhy 2024 and why are we in such a situation of hybrid warfare? The fact is that the modern period is characterized by two simultaneous revolutionary events. The first is the technological revolution, which used to be talked about a lot. It is called differently, we say that it is a change of technological structures. And always this change in technological patterns occurs through the economic depression, which in this cycle began in the world in 2008 – with the beginning of the global financial crisis.\nAnd during this transition phase, a new technological order has already been formed, a well-known complex of nano-engineering information and communication technologies, which is evolving not only into the economy. But also in the ways of conducting military operations, too. We actually see that we are facing more than just an enemy based in the Pentagon and Mi6. Our troops are facing artificial intelligence. This is already a war of a new technological order.\nBut a more important point is the change in world economic patterns in the context of our current topic. The change of national economic structures is a process that occurs once a century and during which the management system changes. Previously, we would call this the process of socio-political revolution, but, speaking in a modern way, this is a radical change in the institutions of world economic relations, industrial relations and the entire system of managing socio-economic development, which is also accompanied by a change in the centers of the world economy.\nThe global economy is rapidly shifting to Southeast Asia, which already accounts for more than half of gross domestic product growth. And in this new center of the world economy, a completely different management system has been formed compared to the one in which we live today. I must say that the change in world economic patterns, as you can see in this picture at the top. These are world economic patterns with a once-in-a-century shift cycle. And at the bottom are technological ones, the change of technological structures, which have a cycle of change phases of about 50 years.\nTechnological patterns are well known in the literature as long Kondratiev waves, more precisely, the life cycles of technological patterns and their growth phase are a long “Kondratiev wave”. The growth phase of the world economy is a century-long cycle of capital accumulation.\nOnce a century, there is a dangerous resonance when we simultaneously face a technological revolution, a socio-economic revolution, and a socio-political revolution. In the course of this process, not only the technology changes, but also the mindset changes. The ideology is changing, if you will. As an example, we will cite the previous phase of changing world economic patterns.\nThis is a process that always, unfortunately, occurs through world wars. World wars in this case are caused by the fact that the ruling elite of the previous center of the world economy does not want to part with its hegemony and tries with all its might to keep it, up to the outbreak of a world war\n.\nDISCUSS ON SG\n100 years ago, when the colonial world economic system was replaced by an imperial one, the world went through two wars, the First and Second World Wars, with the Great Depression between them.\nThe colonial world economic system is a system of industrial relations based on a private family firm. In political terms, the greatest extent of this world economic structure was obtained by the British Empire. Where the combination of public administration institutions, the core of which was the monarchical rule of Great Britain, with private capitalist entrepreneurship, gave rise to the English bourgeois oligarchy, which managed to organize large monopolies of the trade and manufacturing type, which ensured Britain’s dominance on the seas and oceans.\nThis is the world economic structure of the colonies, where the Russian Empire also played a significant role. This way of life had exhausted its possibilities of development by the end of the nineteenth century. This was due to the fact that the possibilities of using slave labor were exhausted. The model is well described by Marx. When people were trafficked as human goods, on a huge scale-not only in the colonies, but also in the metropolises. People were exploited for 12 hours a day, seven days a week. Private capital used such labor as the main source of enrichment. There was no labor law, no trade unions, no welfare state. All this appeared with the imperial world economic structure.\nBut here it is important to understand that the UK has reached the limits of development and countries with more advanced management systems have begun to step on its heels. Including the Russian Empire, Germany, Austria-Hungary, and the United States. The British secret services instigated the First World War, as a result of which Britain became a world leader. It would seem that it has increased as much as possible, but only 20 years have passed – and the Great Depression has been dragged in. No measures to save the British Empire helped. They then – as today the United States is against China-waged a trade war against the United States, imposed an embargo on the import of American goods.\nIn the end, although the British Empire remained among the winners during the Second World War, it could not take advantage of the victory due to the archaic nature of its management system. No one wanted her anymore. It no longer provided any economic progress. Economic growth based on the exploitation of slave labor has ceased to produce surplus product. The British Empire collapsed just 2 years after the Second World War. This is important for us now from the point of view of historical analogy.\nA new world economic order. We called it Imperial, because for the first time in the world, it covered almost the entire planet. Two-thirds of the world. The other third was the Soviet Union. Its world economic structure was based on a social state, on vertically integrated large-scale production structures. It focuses on the issue of money and the use of money not so much as capital, but as a tool for financing economic growth.\nIn general, the world economic order was in three ideological varieties. The first two are well known to us. The Soviet system with scientific and industrial associations led by the Communist Party, which built socialism with a claim to communism. The American system, which was based on multinational corporations and the boundless issue of the dollar, which allowed them to lead world expansion.\nAnd the third system, which sank into oblivion thanks to the feat of the Soviet people – the system of European fascism, in which German national socialism, together with the Italian corporate state and with Nazis of all stripes from various other European countries, tried to impose their Nazi version of this world economic system on the world.\nI note that the colonial world economic system actually turned out to be absolutely uncompetitive. Britain lost the war in Europe to German fascism in just two years, and only the power of the Soviet Union and the help of the United States, a country that already had a new system of governance, managed to crush this fascist scenario. And then the colonial system of Britain ordered to live for a long time.\nIn other words, this historical experience shows that the change in world economic patterns passes through the public consciousness, of course. And the emergence of a new management system, and this is primarily relations between people, cannot but be combined with a new system of ideas, views and principles.\nNow we have a similar process going on. We are moving away from the imperial world economy, where only the United States remains. There, this transition began with the collapse of the Soviet Union. Just like 100 years ago, it has been going on for 30 years. Just like the previous transition lasted almost from 14 to 1947. So the current transition has been going on for a third of a century.\nAfter the collapse of the Soviet Union, which was the first to fail to meet the demands of scientific and technological progress, we now see the collapse of the United States. The United States is no longer a world leader. In an attempt to overcome the global financial crisis by pumping money, the United States eventually led the situation to the breakdown of the entire financial system and increasing inflation, which is already reaching 30% at enterprise prices.\nWe saw the self-discrediting of the American system in the last presidential election, which was virtually rigged. America is not a more attractive image. In addition, compared to China and India, which have been doing brilliantly over the past 15 years, both the US and the EU, despite a fourfold increase in the monetary base, have not been able to embark on sustainable economic development. The efficiency of the Western management system — here, if we take the efficiency – the money issue is 20-25%. Only every 4th or 5th euro that is issued gets into the manufacturing sector.\nChina and India have developed a fundamentally different management system that combines strategic central planning with market competition\n, where the state plays a dominant role in organizing money circulation and provides private businesses with unlimited access to money if this leads to an increase in public welfare.\nAll forecasts show that by the end of this decade, the old world economic structure will be reduced by more than half by now, and the core of the Asian accumulation cycle – China, India, Indochina, Japan, and Korea – will already be absolutely dominant in all macroeconomic indicators.\nThis process is irreversible, but the closer this obvious transition is, the less forces remain in the core of the old world economic system, the more aggressive they become. This is where the same hybrid warfare mechanism that the British used in both World War I and World War II works. We called them hybrid wars because they were fought over territory.\nAs part of the new world economic order, wars are now being waged for the consciousness and minds of citizens of different countries, and, unlike the war of the last century,\nthe current war is primarily a war for dominance in the public consciousness. Therefore, the main front is the information and cognitive front. Here questions of ideology are the main ones.\nThe second most important front is the monetary and financial one, where the United States and the European Union still dominate. And only in the third turn are tanks, missiles and planes used, which are actually designed to punish the defeated within the framework of this hybrid-world war. That is, to frighten, destroy any desire for resistance, and so on.\nJust as Great Britain unleashed the First World War, when it already understood that the combined power of Germany, Russia, and Austria-Hungary exceeded that of Britain and only a few years remained for a turning point in world leadership, so the American ruling elite started a world hybrid war. At the same time, as we can see, the US trade war against China is unfolding. The sanctions war against us has already been going on for more than 8 years – and this aggravation of geopolitical tensions today results in dramatic events, in which we are fully involved today.\nWhat is the difference between the new world economic system and the previous one, the imperial one? Please note that the state that is now formed in China and India, it takes into itself all the achievements of state-building in previous eras. This is a social state. It is a democratic State governed by the rule of law, but it is also sovereign. That is, the peculiarity of the new world economic order is that the leading state does not try to impose its own models on all other countries.\nIf in the imperial world economic order there were three models, two of which took place – Soviet and American, and the third, which did not take place – German-Fascist. They tried to remake the whole world in their own image. Create the same fractals everywhere as in the center.\nIn the new world economic order, world economic sovereignty is being restored. This is a crucial point. In this new world economic order, the state is restoring moral values\n.\nIt is a humane state, fair, intellectual, responsible and, in short, ideologically speaking, it is a socialist state.\nBut in China, we see a familiar image of the Communist Party at the head of this state. India has the largest democracy in the world, but let’s not discount Gandhian socialism. All these traditions are alive and the management models-I would like to draw your attention – in China and India are quite close. State control over the banking system, unlimited lending to the growth of production, the use of the market for the purposes of economic efficiency of market competition.\nThe state encourages private entrepreneurship, and it gives unlimited incentives if it generates income. Hence the growth of the welfare of the people. If private entrepreneurship is conducted destructively, speculates, or tries to profit from the destabilization of the economy, such entrepreneurship is strictly blocked. Both China and India have strict currency controls and capital transfers are not allowed. Money is provided from 0% to 4-6%, depending on the priority of loans. Targeted credit issuance is widely used as a strategic planning tool.\nWe called it integral, because the state gathers society here. It gathers different social groups around the main criterion-the rise of social welfare. Accordingly, the entire economic policy is built under this criterion. Let us compare the essence of the economic policy pursued in the new world economic order.\nHere, comparing the existing models of the Washington consensus, I will draw attention to the main difference. First, the goal of the economy is not to make money in any way. The goal of the economy is to raise public welfare.\nTherefore, hence-strategic planning, hence-the use of money as a tool. Hence progressive taxation and practical measures to ensure social justice. All the requirements of the welfare state are in education and healthcare. Which should be free of charge and ensure the reproduction of human capital in the fullest possible way. The tax system of the tax budget is focused on development, and not just on the so-called “functions of a police bureaucratic state”. Prices are regulated based on the desired proportions of economic reproduction\n.\nIn labor relations, cooperation dominates, and the antagonism between labor and capital disappears completely. In our understanding, the national enterprise is the dominant form of private ownership. An enterprise in which workers are also owners.\nThis is how Huawei, Xiaomi and others grow up, which grow out of cooperatives. That is, it is an\neconomy of social partnership, where money is profit and everything that torments our economy with the export of capital, all this is limited in the system of economic regulation so that people’s income grows.\nAnd the entrepreneur grew in proportion to his contribution to the rise of public welfare.\nAnd there are no questions about whether an industrial, agricultural, scientific and technical policy is needed. These are all obvious key areas of government policy that manage the market mechanism in the way that is necessary to raise public welfare.\nTurning now to the ideological versions of this new world economic order. The construction of socialism continues in China. Although with Chinese characteristics, but it should be understood in this way. If Soviet socialism sought to make the whole world happy, we wanted to achieve a socialist system all over the world, spending a lot of money on it, then\nsocialism with Chinese characteristics means that the socialist idea and the national idea go together\n.\nAnd in China, we see the following slogans: this is a society of universal prosperity, this is the great revival of the Chinese nation.\nThat is, here the idea of socialism and positive nationalism, which does not pretend to national exclusivity, but puts the welfare of its own country at the forefront, is a key characteristic\n.\nThis is what we see in India. A combination of socialism, market economy and national idea. The national idea, although it is applied in terms of increasing welfare. This is understandable for a country with a huge population that has lived in poverty for centuries. For them, the rise of prosperity is a key moment, no national idea. Moreover, unlike Soviet socialism, which grew up in an environment of a “besieged fortress” and at the same time inevitably had mobilization features and suppression of personal freedom in order to save society and the state, there are no such risks here. Not in China, not in India.\nBut it is clear that the future development of the world in the foreseeable future will take place in the same way as in the 20th century, where there was competition between the communist Soviet Union and democratic America. Now the confrontation will unfold between the “democratic West”, communist China and democratic India. The question is where we will be located.\nThere is a third version of this ideology of a new world economic order. It is, in fact, a continuation of the Nazi Western, so to speak, ideological vector. Racism dominated the British Empire in the 19th century, and Nazism dominated Europe for a long time during the Second World War.\nAnd now the receivers of this misanthropic form fill it with the content of posthumanism. An electronic concentration camp, everyone must march in formation and comply with the requirements of the World Health Organization or other analogues of the world government.\nIn other words, this is the idea of moving to a posthumanistic, posthuman state, when people are considered as a tool of manipulation. More precisely, the object of manipulation – and the ideology is built under the atomization of society.\nThat is, the main ideological vector is the deprivation of people of any collective identity. National identity, gender identity. In general, the human identity even. People begin to perceive themselves as anything-cyborgs, animals, plants.\nDehumanization is underway, and this kind of posthuman material is embedded in easily manipulated and artificial intelligence, replacing ideologues, in general, imposing their own behavior models on this posthuman world and forcing people to behave as the world’s artificial oligarchic management needs\n.\nAt the same time, we see the development of methods that allow us to bring this posthuman society to any state. Up to collective self-destruction. I am sure that if they start injecting a vaccine with some kind of poison, there are already mechanisms, most will build up and take this vaccine.\nWe are in this transitional world state on the periphery, to put it bluntly. After the collapse of the Soviet Union, we found ourselves on the economic periphery of the United States. Our country was used as a typical peripheral country, from which resources were pumped by billions of tons, capital was pumped out. The brain drain from us there is what the Bologna system was for.\nThose who pushed the Bologna system were all too shy to put it bluntly – the Bologna system is needed in order to ease the brain drain. That we trained qualified personnel here for free, so that they could easily and naturally move around, get a master’s degree abroad and stay there. We were turned into a peripheral country with all its characteristics.\nNow, after the West went to war with us and erected barriers in almost all directions, we are talking about a change in the management paradigm. But we must understand that so far this change in our management system has not even affected us at all. It is on the other side that barriers have been erected that have cut off our control system. That is, they have made it difficult to export capital, but I note that as soon as the situation has stabilized a little, our monetary authorities are starting to export capital again.\nThey are starting to encourage the export of capital again! At least take it in rubles, even if you take the money from us! That is, our “money power” works the same way as before. They are not given the opportunity to create conditions for capital outflows, they have, in fact, abolished the possibility of applying the budget rule, but all this still remains and the budget rule has not yet disappeared. It simply cannot be used in the context of the seizure of foreign exchange reserves.\nThey introduced a mandatory sale of foreign currency earnings in order to stabilize the exchange rate. Now they want to keep their foreign currency earnings abroad, and they will probably confiscate them in the same way as the state foreign exchange reserves. In other words, our monetary policy remains deeply peripheral, and it still follows the rules of the IMF and the Washington Consensus.\nBecause of the sanctions, the public suddenly realized that we are a very rich country, that we could live twice as well as we do, because the outflow of capital has stopped. As soon as the outflow of capital stopped, the ruble immediately rose, purchasing power increased by 1.5 times, and the ruble strengthened further. That is, until now, the main objective function of the “monetary authorities” was to enrich currency speculators.\nThis is exactly what the Central Bank worked for. Targeting inflation is ridiculous, because the main factor of inflation is the devaluation of the ruble exchange rate in a situation where the ruble exchange rate is formed by speculators, primarily international speculators. And only 5% of transactions on the Moscow Exchange are transactions for exporters and importers.\nIt is obvious that the ruble exchange rate has been manipulated for all these 8 years. On this basis, tens of billions of dollars were exported from Russia. It was currency speculators, where the main role was played by American speculators, who were the main beneficiaries of the current monetary policy. Now, due to political sanctions, this has become impossible. We are being forced, forced to switch to a new management system.\nWhat should be the management system? There is no need to guess here. We see examples of this new management system in China and India. This is, of course, a mixed management system, where the main setting works for the purpose of improving public welfare. The State is engaged in strategic planning.\nHere is Elena Vladimirovna Panina , one of the authors of the law on strategic planning, who put a lot of effort into its promotion. We have had the law for many years. But at first its implementation was postponed, now it ends up writing tens of thousands of documents on strategic planning, but there are no mechanisms for its implementation.\nAlthough if you look at it, we have everything separately exists. The mechanism of private and public partnership, special contracts, multilateral investment agreements, special refinancing tools that the Central Bank could use to bring cheap loans for increasing investment. All of this is available separately, but the system doesn’t work as a whole.\nWe have been proposing for many years to switch to a system of advanced development, where the emphasis would be on strategy and modernization of economic development based on a new technological order. According to our estimates, we could achieve growth of at least 8% per year by using idle production facilities, saturating the economy with money and enabling enterprises to receive loans at a maximum of 2-3% for the final borrower, for financing investments, for increasing production.\nThis is the most complete use of our scientific and technical potential, this is an in-depth processing of raw materials. We have no restrictions on economic growth, except for the artificially high cost of credit created by the “monetary authorities”. Businesses can’t take out loans at no more than 18% or 11%, but they need to take out loans at 1-3% per annum, as is done in China and India.\nHere we are in the Eurasian Union fighting against the export of roundwood, we have imposed an embargo, but for some reason the wood is being taken to China. Because in China, the state allocated as much money as it needed, at 0.2% per annum for 10 years – in order for businesses to create an infrastructure for processing, packaging and harvesting Siberian forest.\nThey created the infrastructure, they then began to provide seasonal interest-free loans to our harvesters, and, unable to take a loan from us, our loggers go to China and take loans there. And they bring them wood-voluntarily and without any compulsion. Inside the country, they do not have the opportunity to take loans in order to harvest wood in the season and then, after selling the products, return them back.\nThat is, we really see the possibility of achieving high growth rates of at least 8% per year, so I cannot agree with the forecasts of our official departments, which draw us (following Washington) minus 8% this year. Where does minus 8% come from? From the world bank and the monetary fund.\nWashington is trying to impose on us such a pessimistic forecast that “you will have minus 10, because you started a military operation.” Where does the minus 10% figure come from? The EU cuts off exports to Russia and imports from Russia too. Then, using the econometric model, they hypothesize that Russia’s foreign trade will shrink by 30%. And according to this model, which, in fact, is an extrapolation of the existing relationships in the economy, they say that in this case you will have minus 10% of GDP. Although the president tells us that we need to use the opportunities.\nAt the last Eurasian Economic Forum, he said that foreign companies are leaving – and maybe it’s better, let them leave, let’s create these industries ourselves. Let’s do import substitution. Let’s fill the outgoing quota of the European Union with our own production. We will develop cooperation in the Eurasian Union and develop relations with our Asian partners.\nThat is, if we deal with the development of the economy, where money is not an end in itself, but is a tool for crediting production, then we can fully go this year without a downturn. On the contrary, we can turn this crisis and the departure of our European competitors into an economic boom. The boom of entrepreneurship. To do this, you need to give loans.\nWe need to implement the goals of raising public welfare. And not through simple cash injections to support people’s lives, but through the creation of new industries, new jobs. The President has said this many times, but as a result, what we have today in terms of measures to stimulate economic development is, in fact, a continuation of covid-19 small regulatory eases. Unfortunately, there are no real opportunities to increase import substitution investments and implement long-term development programs in terms of reducing the bureaucratic pressure.\nConcluding my speech, I would like to say that the image of the future, I think, is quite obvious. If we understand that before the end of this century, most likely, the American hybrid war will end in collapse for them. They probably don’t realize it yet in their Russophobia, which is located in their subcortex. Therefore, having China as the main enemy, they attacked us, since Russophobia is inherent in Anglo-Saxon geopolitics.\nGeopolitics, which teaches American and British politicians, is based on books of the 19th-20th century-from Halford Mackinder to Zbigniew Brzezinski, and they everywhere have the main idea-this is “how to break up Russia”. Geopolitics is a classic pseudoscience on the topic “how to destroy Russia in any of its historical forms”.\nThey became victims of their genetic Russophobic orientation. They lost to China in the trade war, and now they’re on to us. When Crimea was reunited with us, I repeatedly said that sanctions would have been imposed in any case. If they were reunited with Crimea or, on the contrary, disgraced themselves, there would still be sanctions. And today’s war, we also understand, was inevitable. Just 8 years ago, it was possible to do without war and take the entire south-east of Ukraine without a single shot, people themselves came to us.\nNow we have to correct this delay at the cost of great efforts and sacrifices.\nBut this conflict was inevitable precisely because of the genetic Russophobia of the American-British ruling elite, which is the core of the ideological and economic core of the Western world. And they are trying to erase us, as they say, without any equivocation, I would say.\nDon’t underestimate it. When the Polish prime minister says “erase”, it means naturally erase, as it was in 1917, when the Russian Empire was erased. As it was after the Troubles, when the Moscow Kingdom was erased. That is, there were precedents when Russia was erased-ideologically, culturally, even to the point of destroying all monuments as far as they could reach, burning chronicles, and so on.\nThis is their plan. They think that Russia is the key to world domination. In their delusional minds, this is true. In the basics of their Anglo-Saxon geopolitics, since Mackinder’s time, they teach that in order to control the world, you need to control Eurasia, they call it the big island. In Eurasia, the main one who keeps control, this is Russia.\nTherefore, in order to control the world, it is necessary to capture Russia, split it up, and destroy it. Then the next goal is the destruction of Iran, this is absolutely obvious. And then they think that by encircling China from all sides and isolating it from the rest of the world, they will maintain their dominance, maintain their hegemony\n.\nThis is an absolutely utopian project, they will lose the war.\nThey are already losing a key advantage right before our eyes. The same notorious sanctions that caused us to lose foreign exchange reserves and our offshore business today does not know how to continue working.\nIn fact, from the point of view of further prospects for a hybrid war, this is a trump card draw, because they had the main advantage in issuing the world currency. And then they played their trump card. They no longer have a global currency, and no one believes them any more – neither politically, ideologically, or economically. A mass exodus from the dollar has begun.\nThe Chinese are selling their dollar reserves. Their satellites are still afraid to do this, but here those who sell dollars faster will lose less. Quite obvious. Let’s not forget that half of the dollars that Americans print on a massive scale are located outside the United States. This wave of dollars is coming back to America today. If earlier it was thought that it was good that capital was being drawn into the country, now the avalanche is clearly acquiring inflationary consequences and the collapse of the giant financial bubbles that make up the Western financial and economic system is not far off.\nToday we are thinking about creating a new settlement currency that would be linked to exchange-traded goods. We are building a “One Train, one Way”alliance with China. We are trying to restore international law in the Eurasian integration and strictly adhere to the principles of voluntariness and respect for sovereignty, mutual benefit, and transparency. In other words, we create an attractive image of the new world order. A new world economic order.\nThe trouble is that without faster economic growth, our image of the future will not be convincing. Please note that our Eurasian ideologues, for example, Trubetskoy, they brilliantly foresaw the collapse of the Soviet Union in the late 20s of the last century, which was then just getting back on its feet.\nHe said that after the workers ‘and peasants’ state has exhausted itself, a new community, a superclass one, will be formed. The Soviet Union will lose its ideological core and collapse. Then comes the era of nationalism. The fragments of the Soviet Union will be tempted by nationalist ideas in order to bring our great country back together. And then it is necessary to overcome nationalism and get rid of Nazism, of course.\nNo national or other exclusivity should be allowed! And the basis for a new union can only be an understanding of the commonality of its history. Notice how the Chinese intercept the slogans of the Eurasians. China calls on all nations to unite in a common destiny for humanity. What are the “peoples of one destiny”? These are the peoples of one country. This understanding of the common destiny of humanity is, in fact, the ideological basis of the great Eurasian partnership that our president is talking about.\nBut in order to be a leader in this partnership, and not a periphery, it is necessary to ensure advanced rates of economic development. This requires the ideology of a common cause, a common good.\nIn conclusion, I will briefly say that this ideology should absorb the achievements of socialism. It is no coincidence that both China and India are dominated by socialist ideology, and with different political constructs. Socialism as an idea of the common good, where the main meaning of the state is service to society. The state does not serve certain social groups, as we have an oligarchy or bureaucracy or someone else. The state is seriously and truly engaged in improving public welfare.\nTherefore, of course, the socialist idea must be present. Without it, a new way of life is impossible, and besides, it has already developed. Socialism should once again return as the dominant ideology, the core of the global economic system of Southeast Asia. If we look at the Japanese model or the Korean one, we will also see the familiar features of the socialist ideology. This is a planning state, a development state.\nAs for the issue of ethical values. The new technological order really challenges humanity in the sense that it is technologically possible to move to a post-humanoid state. The emergence of cyborgs, mind manipulation, artificial intelligence. These are all signs of a transition to a posthuman civilization, and if we lose our traditional ethical standards, if we allow this new oligarchic world government to dominate, then no good will come of it. In this case, humanity is finished.\nAnd, since we are at the forefront of a hybrid war, we can really assume that\nthe war with the West is going on for the fate of humanity.\nAnd the West today has no image of the future. Universal chipization, artificial intelligence and dehumanization, LGBT people, the destruction of the family, the termination of all forms of human identity – this is an image of death, not the future. This is what the West brings us. Since we are in direct confrontation with him, we can assume that we are really fighting for the preservation of humanity.\nThe question is, what should be the ideology here? Obviously, it should be based on traditional values. In short, this should be the image of Christian socialism that has already been largely vulgarized in Europe. With the understanding that we have not only Christian socialism, but also Islamic socialism, Buddhist socialism. I would call this ideology a socially conservative synthesis. A combination of traditional moral values that grew out of the great religions, with the demands of social justice, the social state and the development state.",
  "tags": [
    "economics",
    "history",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-30T10:40:55+00:00"
}