{
  "url": "https://voxday.net/2022/06/29/the-war-spreads-to-asia/",
  "scraped_at": "2026-01-08T13:23:14.924422",
  "title": "The War Spreads to Asia",
  "date_display": "June 29, 2022",
  "date_iso": "2022-06-29T10:14:09+00:00",
  "date_from_url": "2022-06-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>NATO is attempting to bring Japan, South Korea, Australia, and New Zealand <a href=\"https://www.rt.com/news/558051-china-blasts-asian-nato/\">into its underpowered alliance</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>NATO should stop looking for “imaginary enemies” in the Asia-Pacific and never be allowed to set up a version of the bloc in the region, China’s envoy to the UN has said.</p><p>“We firmly oppose certain elements clamoring for NATO’s involvement in the Asia-Pacific, or an Asia-Pacific version of NATO on the back of military alliances,” Zhang Jun said at a UN Security Council meeting on Tuesday.</p><p>The diplomat’s statement came after Japan, South Korea, Australia and New Zealand were invited for the first time to attend the annual NATO summit, which opened on Tuesday in Madrid, Spain.</p><p>John Kirby, a senior White House security official, said last week that the participation of the four nations was not an attempt to forge “an Asian version of NATO,” but “an indication of the linkage of global security between Europe and the Indo-Pacific.”</p></blockquote><p>Translation: they’re not attempting to forge an Asian version of NATO, they’re going to bring their Asian satrapies into NATO.</p><p>This is complete nonsense. All four states don’t even begin to counterbalance the military and economic weight of China. But it could be worse; they could have invited the island of Taiwan to join NATO, although I suppose we can’t entirely rule out the possibility that they’ll be dumb enough to do that too.</p><p>And China is clearly not happy with NATO’s actions.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>As a product of the Cold War and the world’s largest military alliance, NATO has long clung to the outdated security concept and become a tool for certain country to maintain hegemony. NATO’s so-called new Strategic Concept is just “old wine in a new bottle”. It still has not changed the Cold War mentality of creating imaginary enemies and bloc confrontation. We solemnly urge NATO to immediately stop spreading false and provocative statements against China. What NATO should do is to give up the Cold War mentality, zero-sum game mindset and the practice of making enemies, and stop seeking to disrupt Asia and the whole world after it has disrupted Europe.</p><cite>Zhao Lijian, Foreign Ministry, 28 June 2022</cite></blockquote><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>NATO directly caused and continuously strengthened Europe’s security dilemma and the outbreak of the Russia-Ukraine conflict is a manifestation of its disastrous consequences. Facts have proven that the extreme pursuit of absolute security under the name of collective defense will eventually lead to confrontation between camps. In other words, NATO is by no means an antidote to Europe’s security crisis, but poison. If anyone spreads such poison to East Asia, which is called “the oasis of world peace and development,” the behavior is insidious and appalling…  In any case, NATO cannot change the nature of being a military and political bloc. Its very existence poses a threat to world peace and stability.</p><cite>Asia-Pacific countries should not stand under ‘dangerous wall’ of NATO, <em>Global Times</em>, 29 June 2022</cite></blockquote><p>The most significant thing about NATO’s expansion to the South Pacific, other than the fact that the US military is now observably preparing for direct military conflict with both Russia and China at the same time, is that the Philippines were not invited, presumably to avoid the humiliation of having the invitation declined. This suggests that the Philippines are continuing to exit the US orbit and will side with China once the war actually comes to the Pacific.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>At the invitation of the Philippine government, Special Representative of President Xi Jinping and Vice President Wang Qishan will lead a delegation to attend the inauguration ceremony of President Ferdinand Romualdez Marcos on June 30 in Manila, the Philippines.</p><p><strong>CCTV: </strong>Could you share the arrangements for Vice President Wang Qishan’s trip to the Philippines and China’s expectation for the trip?</p><p><strong>Zhao Lijian: </strong>China and the Philippines are close neighbors facing each other across the sea and important cooperation partners. China always sees the Philippines as a priority in its neighborhood diplomacy. With the concerted efforts of both sides, China-Philippines relations have been growing with a sound momentum, delivering tangible benefits to both peoples. Not long ago, President Xi Jinping had a phone conversation with President-elect Ferdinand Romualdez Marcos. They reached important common understandings on staying committed to good-neighborliness and friendship and pursuing shared development, which pointed the way forward for bilateral relations.</p><p>Vice President Wang Qishan’s upcoming trip to the Philippines as President Xi Jinping’s Special Representative for President Marcos’ inauguration ceremony fully demonstrates the great importance China attaches to the Philippines and bilateral relations. We believe this trip will help both sides to carry forward our friendship, cement mutual trust, expand cooperation, open up broader prospects for bilateral relations, and bring more benefits to both countries and peoples.</p></blockquote><p>So, does anyone still seriously believe all this is just about Ukraine?</p><p><em><a href=\"https://social.infogalactic.com/micropost/bd38e653-fb42-4a8c-8c34-15dc534ac55f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "NATO is attempting to bring Japan, South Korea, Australia, and New Zealand\ninto its underpowered alliance\n:\nNATO should stop looking for “imaginary enemies” in the Asia-Pacific and never be allowed to set up a version of the bloc in the region, China’s envoy to the UN has said.\n“We firmly oppose certain elements clamoring for NATO’s involvement in the Asia-Pacific, or an Asia-Pacific version of NATO on the back of military alliances,” Zhang Jun said at a UN Security Council meeting on Tuesday.\nThe diplomat’s statement came after Japan, South Korea, Australia and New Zealand were invited for the first time to attend the annual NATO summit, which opened on Tuesday in Madrid, Spain.\nJohn Kirby, a senior White House security official, said last week that the participation of the four nations was not an attempt to forge “an Asian version of NATO,” but “an indication of the linkage of global security between Europe and the Indo-Pacific.”\nTranslation: they’re not attempting to forge an Asian version of NATO, they’re going to bring their Asian satrapies into NATO.\nThis is complete nonsense. All four states don’t even begin to counterbalance the military and economic weight of China. But it could be worse; they could have invited the island of Taiwan to join NATO, although I suppose we can’t entirely rule out the possibility that they’ll be dumb enough to do that too.\nAnd China is clearly not happy with NATO’s actions.\nAs a product of the Cold War and the world’s largest military alliance, NATO has long clung to the outdated security concept and become a tool for certain country to maintain hegemony. NATO’s so-called new Strategic Concept is just “old wine in a new bottle”. It still has not changed the Cold War mentality of creating imaginary enemies and bloc confrontation. We solemnly urge NATO to immediately stop spreading false and provocative statements against China. What NATO should do is to give up the Cold War mentality, zero-sum game mindset and the practice of making enemies, and stop seeking to disrupt Asia and the whole world after it has disrupted Europe.\nZhao Lijian, Foreign Ministry, 28 June 2022\nNATO directly caused and continuously strengthened Europe’s security dilemma and the outbreak of the Russia-Ukraine conflict is a manifestation of its disastrous consequences. Facts have proven that the extreme pursuit of absolute security under the name of collective defense will eventually lead to confrontation between camps. In other words, NATO is by no means an antidote to Europe’s security crisis, but poison. If anyone spreads such poison to East Asia, which is called “the oasis of world peace and development,” the behavior is insidious and appalling…  In any case, NATO cannot change the nature of being a military and political bloc. Its very existence poses a threat to world peace and stability.\nAsia-Pacific countries should not stand under ‘dangerous wall’ of NATO,\nGlobal Times\n, 29 June 2022\nThe most significant thing about NATO’s expansion to the South Pacific, other than the fact that the US military is now observably preparing for direct military conflict with both Russia and China at the same time, is that the Philippines were not invited, presumably to avoid the humiliation of having the invitation declined. This suggests that the Philippines are continuing to exit the US orbit and will side with China once the war actually comes to the Pacific.\nAt the invitation of the Philippine government, Special Representative of President Xi Jinping and Vice President Wang Qishan will lead a delegation to attend the inauguration ceremony of President Ferdinand Romualdez Marcos on June 30 in Manila, the Philippines.\nCCTV:\nCould you share the arrangements for Vice President Wang Qishan’s trip to the Philippines and China’s expectation for the trip?\nZhao Lijian:\nChina and the Philippines are close neighbors facing each other across the sea and important cooperation partners. China always sees the Philippines as a priority in its neighborhood diplomacy. With the concerted efforts of both sides, China-Philippines relations have been growing with a sound momentum, delivering tangible benefits to both peoples. Not long ago, President Xi Jinping had a phone conversation with President-elect Ferdinand Romualdez Marcos. They reached important common understandings on staying committed to good-neighborliness and friendship and pursuing shared development, which pointed the way forward for bilateral relations.\nVice President Wang Qishan’s upcoming trip to the Philippines as President Xi Jinping’s Special Representative for President Marcos’ inauguration ceremony fully demonstrates the great importance China attaches to the Philippines and bilateral relations. We believe this trip will help both sides to carry forward our friendship, cement mutual trust, expand cooperation, open up broader prospects for bilateral relations, and bring more benefits to both countries and peoples.\nSo, does anyone still seriously believe all this is just about Ukraine?\nDISCUSS ON SG",
  "tags": [
    "China",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-29T14:06:27+00:00"
}