{
  "url": "https://voxday.net/2022/06/08/they-called-their-shot/",
  "scraped_at": "2026-01-08T13:21:18.697990",
  "title": "They Called Their Shot",
  "date_display": "June 8, 2022",
  "date_iso": "2022-06-08T11:50:39+00:00",
  "date_from_url": "2022-06-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><figure class=\"wp-block-embed aligncenter is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\"><div class=\"jetpack-video-wrapper\"><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\" frameborder=\"0\" height=\"360\" referrerpolicy=\"strict-origin-when-cross-origin\" src=\"https://www.youtube.com/embed/g16jTDd7Bbg?feature=oembed\" title=\"The X-Files Predicted The Pandemic, The Riots &amp; The Vaccine\" width=\"640\"></iframe></div></div></figure><p>It doesn’t really matter if the satanic elite of Clown World are divinely bound to announce their intentions or if they are simply narcissistic psychopaths who revel more in the knowledge that they are getting away with their wicked deeds than they do in the deeds themselves, the simple fact of the matter is that they do announce their future intentions, albeit always in a manner that provides them with plausible deniability both before and after the fact.</p><p>This <em>X-Files</em> episode is not an accident. This is not an astonishing coincidence. This is how, and why, it is relatively easy to interpret current events utilizing well-informed conspiracy analysis. Even when this episode was first broadcast, I immediately noticed the expositional clumsiness and contemplated the possibility that it was blown cover as cover, although I must admit that I forgot about it as time passed. But it was not the only such announcement. This habitual revelation under the cloak of fiction is another reason why anyone who submitted to the vaccine – which I will remind you was relentlessly pushed by international corporations and global depopulationists – was not only blitheringly stupid, but required almost wilful ignorance to do so.</p><p>We were warned. We were <em>repeatedly </em>warned. And I can assure you, it vastly amused the wicked of Clown World to see how many of us flat-out refused to believe their repeated warnings. The truth really is out there.</p><p><em><a href=\"https://social.infogalactic.com/micropost/38317a65-b2a5-4dcf-bffc-647bc30be98a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It doesn’t really matter if the satanic elite of Clown World are divinely bound to announce their intentions or if they are simply narcissistic psychopaths who revel more in the knowledge that they are getting away with their wicked deeds than they do in the deeds themselves, the simple fact of the matter is that they do announce their future intentions, albeit always in a manner that provides them with plausible deniability both before and after the fact.\nThis\nX-Files\nepisode is not an accident. This is not an astonishing coincidence. This is how, and why, it is relatively easy to interpret current events utilizing well-informed conspiracy analysis. Even when this episode was first broadcast, I immediately noticed the expositional clumsiness and contemplated the possibility that it was blown cover as cover, although I must admit that I forgot about it as time passed. But it was not the only such announcement. This habitual revelation under the cloak of fiction is another reason why anyone who submitted to the vaccine – which I will remind you was relentlessly pushed by international corporations and global depopulationists – was not only blitheringly stupid, but required almost wilful ignorance to do so.\nWe were warned. We were\nrepeatedly\nwarned. And I can assure you, it vastly amused the wicked of Clown World to see how many of us flat-out refused to believe their repeated warnings. The truth really is out there.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "globalism",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-08T11:51:49+00:00"
}