{
  "url": "https://voxday.net/2022/06/22/they-chose-the-hard-way-2/",
  "scraped_at": "2026-01-08T13:22:31.375530",
  "title": "They Chose the Hard Way",
  "date_display": "June 22, 2022",
  "date_iso": "2022-06-22T10:31:47+00:00",
  "date_from_url": "2022-06-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The mentally- and historically-challenged “leaders” of the skinsuit “West” simply refuse to accept the reality that Russia is not surrounded by them, they are surrounded by the rest of the World. Which means the USA and its European satrapies have less of a chance of winning WWIII than Austria-Hungary had in WWI and Germany had in WWII.</p><p>Say, whose side are Austria and Germany on this time? Are you starting to notice a pattern here?</p><p><strong>ITEM</strong>: IEA warns Europe to prepare for total shutdown of Russian gas exports.</p><p><strong>ITEM:</strong> Lithuania expands Kaliningrad blockade.</p><p><strong>ITEM:</strong> Putin announces deployment of S-500 air defense systems.</p><p>It’s the third item that is the most significant, because it indicates that Russia is now preparing to contest European air superiority with NATO. There is no need for S-500s, or even S-400s, for that matter, to defeat the air forces of Kiev. Now wven the <em>Washington Post</em> has finally figured out that <a href=\"https://www.nytimes.com/2022/06/20/opinion/international-world/ukraine-war-america.html\">the USA is already at war with Russia</a>; one wonders how long it will take the intrepid reporters there to notice that China has been actively engaged in unrestricted warfare against the USA for the last 23 years.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Last month, leaks by U.S. officials revealed that the United States helped Ukraine to kill Russian generals and strike a Russian warship, and Mr. Biden signed a $40 billion aid package for Ukraine, a lot of which is for military assistance like weaponry and intelligence sharing. The bill, which Ms. Jayapal and Mr. DeFazio voted for, comes on top of billions of prior military support. The Biden administration also announced, this month, that it will send rocket systems to Ukraine that could theoretically strike inside Russian territory, and it reportedly has plans to sell the Ukrainian government four drones that can be armed with Hellfire missiles.</p><p>Are we at war in Ukraine? If we swapped places — if Russian apparatchiks admitted helping to kill American generals or sink a U.S. Navy vessel — I doubt we’d find much ambiguity there. At the very least, what the United States is doing in Ukraine is not not war. If we have so far avoided calling it war and can continue to do so, maybe that’s only because we’ve become so uncertain of the meaning of the word.</p></blockquote><p>The neocons and their servants can play all the legalistic word games they like, but the fun is going to end when a major US or UK city takes a direct hit from a Sarmat. It’s actions, not words, that define reality.</p><p>So, buckle up and enjoy the fireworks.</p><p><em><a href=\"https://social.infogalactic.com/micropost/1342c517-bbb1-4ada-8d6c-32bf39b5f9a0\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The mentally- and historically-challenged “leaders” of the skinsuit “West” simply refuse to accept the reality that Russia is not surrounded by them, they are surrounded by the rest of the World. Which means the USA and its European satrapies have less of a chance of winning WWIII than Austria-Hungary had in WWI and Germany had in WWII.\nSay, whose side are Austria and Germany on this time? Are you starting to notice a pattern here?\nITEM\n: IEA warns Europe to prepare for total shutdown of Russian gas exports.\nITEM:\nLithuania expands Kaliningrad blockade.\nITEM:\nPutin announces deployment of S-500 air defense systems.\nIt’s the third item that is the most significant, because it indicates that Russia is now preparing to contest European air superiority with NATO. There is no need for S-500s, or even S-400s, for that matter, to defeat the air forces of Kiev. Now wven the\nWashington Post\nhas finally figured out that\nthe USA is already at war with Russia\n; one wonders how long it will take the intrepid reporters there to notice that China has been actively engaged in unrestricted warfare against the USA for the last 23 years.\nLast month, leaks by U.S. officials revealed that the United States helped Ukraine to kill Russian generals and strike a Russian warship, and Mr. Biden signed a $40 billion aid package for Ukraine, a lot of which is for military assistance like weaponry and intelligence sharing. The bill, which Ms. Jayapal and Mr. DeFazio voted for, comes on top of billions of prior military support. The Biden administration also announced, this month, that it will send rocket systems to Ukraine that could theoretically strike inside Russian territory, and it reportedly has plans to sell the Ukrainian government four drones that can be armed with Hellfire missiles.\nAre we at war in Ukraine? If we swapped places — if Russian apparatchiks admitted helping to kill American generals or sink a U.S. Navy vessel — I doubt we’d find much ambiguity there. At the very least, what the United States is doing in Ukraine is not not war. If we have so far avoided calling it war and can continue to do so, maybe that’s only because we’ve become so uncertain of the meaning of the word.\nThe neocons and their servants can play all the legalistic word games they like, but the fun is going to end when a major US or UK city takes a direct hit from a Sarmat. It’s actions, not words, that define reality.\nSo, buckle up and enjoy the fireworks.\nDISCUSS ON SG",
  "tags": [
    "globalism",
    "neocons",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-22T10:33:28+00:00"
}