{
  "url": "https://voxday.net/2022/06/24/you-dont-say-13/",
  "scraped_at": "2026-01-08T13:22:51.696061",
  "title": "You Don’t Say",
  "date_display": "June 24, 2022",
  "date_iso": "2022-06-24T23:35:51+00:00",
  "date_from_url": "2022-06-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The vaxx trials for children <a href=\"https://www.foxnews.com/opinion/cdc-recommends-covid-19-vaccines-babies-kids-under-5-6-things-parents-need-know\">have not gone well</a>. This didn’t stop the CDC from recommending it. It appears the monsters are seeking to find another way to sacrifice children to their evil god now that abortion “rights” are no more.</p><p><strong>ITEM: </strong>There were no cases of severe COVID illness in either the vaccine or placebo group.</p><p><strong>ITEM:</strong> There were more overall hospitalizations (unspecified) in the vaccine group. Out of a total of 7 children requiring hospitalization, 6 were in the vaccine group and 1 was in the placebo group.</p><p><strong>ITEM: </strong>The vaxxes were associated with a 370% increased risk of getting COVID-19.</p><p><strong>ITEM: </strong>CDC Director Rochelle Walensky announced a new recommendation to vaccinate all 20 million children 6 months to 5 years of age.</p><p>Both vaxxes are unsafe, inversely effective, and unnecessary, so naturally the CDC is endorsing it.</p><p><em><a href=\"https://social.infogalactic.com/micropost/0b741c9c-d271-45a8-abe5-ec9e6f814da0\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The vaxx trials for children\nhave not gone well\n. This didn’t stop the CDC from recommending it. It appears the monsters are seeking to find another way to sacrifice children to their evil god now that abortion “rights” are no more.\nITEM:\nThere were no cases of severe COVID illness in either the vaccine or placebo group.\nITEM:\nThere were more overall hospitalizations (unspecified) in the vaccine group. Out of a total of 7 children requiring hospitalization, 6 were in the vaccine group and 1 was in the placebo group.\nITEM:\nThe vaxxes were associated with a 370% increased risk of getting COVID-19.\nITEM:\nCDC Director Rochelle Walensky announced a new recommendation to vaccinate all 20 million children 6 months to 5 years of age.\nBoth vaxxes are unsafe, inversely effective, and unnecessary, so naturally the CDC is endorsing it.\nDISCUSS ON SG",
  "tags": [
    "trainwreck",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-06-24T23:35:53+00:00"
}