{
  "url": "https://voxday.net/2026/01/07/answering-mccarthy/",
  "scraped_at": "2026-01-08T20:40:57.344615",
  "title": "Answering McCarthy",
  "date_display": "January 7, 2026",
  "date_iso": "2026-01-07T18:56:20+00:00",
  "date_from_url": "2026-01-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Just to be clear, I am a massive fan of Dennis McCarthy. The work he has done in demonstrating that Lord Thomas North was the true author of the Shakespearean plays is one of the most astonishing demonstrations of historical research I’ve ever seen. He’s a true iconoclast.</p><p>That being said, he obviously hasn’t done any similarly methodical work with regards to evolution and Darwin, because if he had, he would have been perfectly capable of writing <em><a href=\"https://www.amazon.com/dp/B0GF8RQFY4\">Probability Zero</a></em> himself. Still, since he has called out those who challenge Darwin’s <em>On the Origin of Species</em>, I will confront <a href=\"https://dennismccarthy.substack.com/p/the-comic-that-frustrates-all-creationists\">the points he raises</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>What is important here is that the premises that Darwin relies on are easy-to-understand facts that no one can or does dispute. And this, in turn, naturally implies the transformation of species over time. Those who challenge Darwin’s <em>On the Origin of Species</em> should have to confront these points. To paraphrase and add more detail to the comic above:</p><p>Since volcanic islands form in the middle of oceans, plants and animals have to reach them by crossing wide marine barriers.</p><p>Species on oceanic islands also tend to be endemic (or particular) to those islands—appearing nowhere else in the world (e.g., the marine iguanas of Galápagos or Hawaii’s colorful birds known as honeycreepers).</p><p>Yet these new island species tend to most closely resemble—but are not identical to—plants and animals from the nearest continent. For example, the iguanas and finches of Galápagos resemble the iguanas and finches of South America. Still, these island taxa are their own species and have clearly differentiated from their continental counterparts.</p><p>So how did this happen? Darwin came up with the only reasonable answer. Obviously, a small group of iguanas, finches, etc., on Galápagos originally reached the islands from South America—and then… well, they had to change. They had to transform from the types of iguanas and finches he saw in South America into these new Galápagan species that inhabit the islands today.</p><p>What other reasonable explanation is there?</p></blockquote><p>I can and do dispute it. In fact, I will disprove it without even needing to resort to any of the work that I have done in writing<em> Probability Zero</em>. The much more reasonable explanation that has hitherto eluded him is that those island taxa are not their own species and have not differentiated from their continental counterparts at the genetic level. Neither natural selection nor Darwin have anything to do with it.</p><p>Please note that I wrote the previous sentence before doing any research whatsoever. Which I have now done.</p><p>And unsurprisingly, the available empirical data entirely supports my explanation and undermines the Darwinian one that McCarthy erroneously assumes to be unassailable. As it turns out, the empirical Galápagos data is perfectly consistent with MITTENS and its reproductive constraints on the speed of evolution. And it is extremely awkward for the standard neo-Darwinian narrative, which claims these systems demonstrate natural selection generating new species through accumulated beneficial mutations.</p><p>They do not. As we have reliably observed to be the case, the actual genomic evidence undercuts that story in several ways.</p><p>For the finches: The celebrated beak diversity—the textbook example of adaptive radiation—turns out not to be built from new mutations at all. The ALX1 haplotypes responsible for blunt versus pointed beaks predate the radiation itself. The finches aren’t demonstrating the power of mutation-plus-selection to generate novelty; they’re demonstrating the reshuffling of pre-existing variation. This is precisely the Incomplete Lineage Sorting problem discussed in PZ—phenotypic differentiation running ahead of genetic differentiation, with perceived “species” that can’t be distinguished by standard molecular markers because there hasn’t been time for the alleles to sort.</p><p>Researchers found that DNA methylation patterns correlated well with phylogenetic distance among finch species, while copy number variations in actual DNA sequence did not. The genomes are, in their words, “extremely similar” across species. The morphological diversity appears to be driven by differential gene expression rather than by accumulated sequence changes. Darwin was not involved.</p><p>For the iguanas: 4.5 million years of supposed divergence, yet marine and land iguanas remain interfertile. The genetic differentiation within marine iguana populations, despite dramatic local adaptations, is only 30,000-50,000 years deep. The morphological and physiological gulf between marine and land iguanas is enormous, but the genetic distance doesn’t match.</p><p>The Galapagos systems actually show:</p><ul class=\"wp-block-list\"><li>Morphological change outpacing genetic fixation — exactly what we’d expect if the standard model’s fixation timescales are correct but grossly insufficient for the claimed transformations.</li><li>Pre-existing variation doing the heavy lifting. These are not new mutations being selected, but ancestral polymorphisms being sorted and reshuffled.</li><li>Retained interfertility despite “speciation” which demonstrates that the genetic barriers required for true reproductive isolation haven’t accumulated</li><li>Hybridization and introgression are the major forces, which actively work against the fixation of lineage-specific mutations by homogenizing gene pools</li></ul><p>With all due respect to Mr. McCarthy, I have legitimately done to Darwin what he did to Shakespeare, and more. In both cases, the historical record will be corrected, sooner or later. And should he ever be interested in reviewing the evidence, I would be delighted to send him a copy of <em>Probability Zero</em>.</p><p><strong>UPDATE: </strong>Mr. McCarthy <a href=\"https://dennismccarthy.substack.com/p/the-comic-that-frustrates-all-creationists-b51\">reposted his July article today</a> and I’d encourage everyone to read it. And remember, you can’t expect people to contemplate what they don’t know. The Galapagos island argument is a perfectly sensible one, it’s merely been outmoded by developments in technology and science. I left a comment there as well, because I have tremendous respect for the man.</p><p><em>First, huge fan of your work. Regardless of what we happen to agree or disagree on.</em></p><p><em>I’d encourage you to take a look at PROBABILITY ZERO which very clearly demonstrates the mathematical impossibility of natural selection accounting for much in the way of variation, much less speciation. One thing that will very likely surprise you is that the top mathematicians and physicists have known that it was nonsense since 1966, when they absolutely destroyed Mayr, the father of the Modern Synthesis, and three other top biologists at the Wistar Symposium.</em></p><p><em>However, they didn’t have access to the genomic data that we do now, so the biologists were able to very convincingly play dumb, since the transcript shows they didn’t understand what the mathematicians were talking about anyhow. Now that we have the data, it’s easy to show that at its absolute peak, natural selection can only account for a maximum of 0.00013 percent of the observed genomic differences between Man and the CHLCA.</em></p><p><em>The book also addresses parallel fixation, neutral theory, and drift in detail, and even provides a more accurate fixation model than Wright-Fisher or Kimura, because insects and humans don’t reproduce like bacteria.</em></p><p><em><a href=\"https://socialgalactic.com/micropost/421d1794-4b86-420a-bf3c-438f408b321d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Just to be clear, I am a massive fan of Dennis McCarthy. The work he has done in demonstrating that Lord Thomas North was the true author of the Shakespearean plays is one of the most astonishing demonstrations of historical research I’ve ever seen. He’s a true iconoclast.\nThat being said, he obviously hasn’t done any similarly methodical work with regards to evolution and Darwin, because if he had, he would have been perfectly capable of writing\nProbability Zero\nhimself. Still, since he has called out those who challenge Darwin’s\nOn the Origin of Species\n, I will confront\nthe points he raises\n.\nWhat is important here is that the premises that Darwin relies on are easy-to-understand facts that no one can or does dispute. And this, in turn, naturally implies the transformation of species over time. Those who challenge Darwin’s\nOn the Origin of Species\nshould have to confront these points. To paraphrase and add more detail to the comic above:\nSince volcanic islands form in the middle of oceans, plants and animals have to reach them by crossing wide marine barriers.\nSpecies on oceanic islands also tend to be endemic (or particular) to those islands—appearing nowhere else in the world (e.g., the marine iguanas of Galápagos or Hawaii’s colorful birds known as honeycreepers).\nYet these new island species tend to most closely resemble—but are not identical to—plants and animals from the nearest continent. For example, the iguanas and finches of Galápagos resemble the iguanas and finches of South America. Still, these island taxa are their own species and have clearly differentiated from their continental counterparts.\nSo how did this happen? Darwin came up with the only reasonable answer. Obviously, a small group of iguanas, finches, etc., on Galápagos originally reached the islands from South America—and then… well, they had to change. They had to transform from the types of iguanas and finches he saw in South America into these new Galápagan species that inhabit the islands today.\nWhat other reasonable explanation is there?\nI can and do dispute it. In fact, I will disprove it without even needing to resort to any of the work that I have done in writing\nProbability Zero\n. The much more reasonable explanation that has hitherto eluded him is that those island taxa are not their own species and have not differentiated from their continental counterparts at the genetic level. Neither natural selection nor Darwin have anything to do with it.\nPlease note that I wrote the previous sentence before doing any research whatsoever. Which I have now done.\nAnd unsurprisingly, the available empirical data entirely supports my explanation and undermines the Darwinian one that McCarthy erroneously assumes to be unassailable. As it turns out, the empirical Galápagos data is perfectly consistent with MITTENS and its reproductive constraints on the speed of evolution. And it is extremely awkward for the standard neo-Darwinian narrative, which claims these systems demonstrate natural selection generating new species through accumulated beneficial mutations.\nThey do not. As we have reliably observed to be the case, the actual genomic evidence undercuts that story in several ways.\nFor the finches: The celebrated beak diversity—the textbook example of adaptive radiation—turns out not to be built from new mutations at all. The ALX1 haplotypes responsible for blunt versus pointed beaks predate the radiation itself. The finches aren’t demonstrating the power of mutation-plus-selection to generate novelty; they’re demonstrating the reshuffling of pre-existing variation. This is precisely the Incomplete Lineage Sorting problem discussed in PZ—phenotypic differentiation running ahead of genetic differentiation, with perceived “species” that can’t be distinguished by standard molecular markers because there hasn’t been time for the alleles to sort.\nResearchers found that DNA methylation patterns correlated well with phylogenetic distance among finch species, while copy number variations in actual DNA sequence did not. The genomes are, in their words, “extremely similar” across species. The morphological diversity appears to be driven by differential gene expression rather than by accumulated sequence changes. Darwin was not involved.\nFor the iguanas: 4.5 million years of supposed divergence, yet marine and land iguanas remain interfertile. The genetic differentiation within marine iguana populations, despite dramatic local adaptations, is only 30,000-50,000 years deep. The morphological and physiological gulf between marine and land iguanas is enormous, but the genetic distance doesn’t match.\nThe Galapagos systems actually show:\nMorphological change outpacing genetic fixation — exactly what we’d expect if the standard model’s fixation timescales are correct but grossly insufficient for the claimed transformations.\nPre-existing variation doing the heavy lifting. These are not new mutations being selected, but ancestral polymorphisms being sorted and reshuffled.\nRetained interfertility despite “speciation” which demonstrates that the genetic barriers required for true reproductive isolation haven’t accumulated\nHybridization and introgression are the major forces, which actively work against the fixation of lineage-specific mutations by homogenizing gene pools\nWith all due respect to Mr. McCarthy, I have legitimately done to Darwin what he did to Shakespeare, and more. In both cases, the historical record will be corrected, sooner or later. And should he ever be interested in reviewing the evidence, I would be delighted to send him a copy of\nProbability Zero\n.\nUPDATE:\nMr. McCarthy\nreposted his July article today\nand I’d encourage everyone to read it. And remember, you can’t expect people to contemplate what they don’t know. The Galapagos island argument is a perfectly sensible one, it’s merely been outmoded by developments in technology and science. I left a comment there as well, because I have tremendous respect for the man.\nFirst, huge fan of your work. Regardless of what we happen to agree or disagree on.\nI’d encourage you to take a look at PROBABILITY ZERO which very clearly demonstrates the mathematical impossibility of natural selection accounting for much in the way of variation, much less speciation. One thing that will very likely surprise you is that the top mathematicians and physicists have known that it was nonsense since 1966, when they absolutely destroyed Mayr, the father of the Modern Synthesis, and three other top biologists at the Wistar Symposium.\nHowever, they didn’t have access to the genomic data that we do now, so the biologists were able to very convincingly play dumb, since the transcript shows they didn’t understand what the mathematicians were talking about anyhow. Now that we have the data, it’s easy to show that at its absolute peak, natural selection can only account for a maximum of 0.00013 percent of the observed genomic differences between Man and the CHLCA.\nThe book also addresses parallel fixation, neutral theory, and drift in detail, and even provides a more accurate fixation model than Wright-Fisher or Kimura, because insects and humans don’t reproduce like bacteria.\nDISCUSS ON SG",
  "tags": [
    "evolution",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2026-01-08T02:01:06+00:00"
}