{
  "url": "https://voxday.net/2020/08/27/antifa-are-hired-convicts/",
  "scraped_at": "2025-12-21T13:05:53.757547",
  "title": "Antifa are hired convicts",
  "date_display": "August 27, 2020",
  "date_iso": "2020-08-27T15:13:14+00:00",
  "date_from_url": "2020-08-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Consider criminal backgrounds of the three “victims” who were shot, two of them fatally, after attacking an armed teenager in Kenosha, Wisconsin this week:</p><ul><li><strike>Joseph Rosenbaum</strike>, convicted pedophile. Served 12.5 years for sexual contact with a minor.</li><li>Gaige Grosskreutz, a convicted burglar who was illegally carrying a gun.</li><li><strike>Anthony Huber</strike>, convicted domestic abuser. Convicted of multiple domestic abuse counts, ADW, battery, false imprisonment, and “strangulation and suffocation”.</li></ul><p>The Wisconsin government shouldn’t be charging Kyle Rittenhouse with murder, they should be giving him a medal! And these “protests” are about as genuine as the astroturf in the Superdome. Meanwhile, a commenter at Instapundit makes a very pertinent observation about the Kenosha riots.</p><blockquote class=\"tr_bq\" style=\"clear: both; text-align: left;\"><p>Joseph Rosenbaum appears in another video, and I can’t find it now, where he is face to face with armed militia. Rosenbaum is a short guy who goes up against big guys to prove that he, a short guy, is more of a badass than the bigger guy.. You can see it in that other video. But the problem is, the armed militia KEEP BACKING UP. while the protesters keep advancing and closing the distance until the protesters are again face to face with the armed militia. The (apparent) leader of the armed militia keeps grabbing his militiamen and pulling them back from the confrontation. The protesters are not afraid of the militiamen who have guns, because the militiamen have demonstrated that they WILL NOT SHOOT, and will back up. If you are going to a riot with a firearm, and will not shoot, then don’t go armed to a riot. If you are going to a riot to protect property, then don’t back up. If you are not going to fight, then don’t go to the riot.</p></blockquote><p>Carrying a weapon you are afraid to use is worse than no weapon at all. Showing up for a battle you are unwilling to fight is worse than not showing up at all.</p><p><b>UPDATE: </b>It occurs to me if Trump wants to take another five points from Biden, he should issue a Federal pardon to Kyle Rittenhouse, invite him to the White House, and give him a medal.</p></div>",
  "content_text": "Consider criminal backgrounds of the three “victims” who were shot, two of them fatally, after attacking an armed teenager in Kenosha, Wisconsin this week:\nJoseph Rosenbaum\n, convicted pedophile. Served 12.5 years for sexual contact with a minor.\nGaige Grosskreutz, a convicted burglar who was illegally carrying a gun.\nAnthony Huber\n, convicted domestic abuser. Convicted of multiple domestic abuse counts, ADW, battery, false imprisonment, and “strangulation and suffocation”.\nThe Wisconsin government shouldn’t be charging Kyle Rittenhouse with murder, they should be giving him a medal! And these “protests” are about as genuine as the astroturf in the Superdome. Meanwhile, a commenter at Instapundit makes a very pertinent observation about the Kenosha riots.\nJoseph Rosenbaum appears in another video, and I can’t find it now, where he is face to face with armed militia. Rosenbaum is a short guy who goes up against big guys to prove that he, a short guy, is more of a badass than the bigger guy.. You can see it in that other video. But the problem is, the armed militia KEEP BACKING UP. while the protesters keep advancing and closing the distance until the protesters are again face to face with the armed militia. The (apparent) leader of the armed militia keeps grabbing his militiamen and pulling them back from the confrontation. The protesters are not afraid of the militiamen who have guns, because the militiamen have demonstrated that they WILL NOT SHOOT, and will back up. If you are going to a riot with a firearm, and will not shoot, then don’t go armed to a riot. If you are going to a riot to protect property, then don’t back up. If you are not going to fight, then don’t go to the riot.\nCarrying a weapon you are afraid to use is worse than no weapon at all. Showing up for a battle you are unwilling to fight is worse than not showing up at all.\nUPDATE:\nIt occurs to me if Trump wants to take another five points from Biden, he should issue a Federal pardon to Kyle Rittenhouse, invite him to the White House, and give him a medal.",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-08-27T14:13:14+00:00"
}