{
  "url": "https://voxday.net/2020/08/15/attention-castalia-subscribers/",
  "scraped_at": "2025-12-21T13:04:38.243944",
  "title": "Attention Castalia Subscribers",
  "date_display": "August 15, 2020",
  "date_iso": "2020-08-15T15:00:03+00:00",
  "date_from_url": "2020-08-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>A message from our sponsor:</i></p><p>During our long months of social distancing we started to realize the value of other humans. After weeks of eating expired dippin’ dots and watching 90’s romcoms alone while talking to a gecko on the wall, being around other humans started to seem like a good idea. Especially once we realized that the gecko had been dead for at least a month, presumably from a bad batch of bat soup.</p><p>His name was Bobby. We buried him in a tiny mask.</p><p>This was the turning of the tide. It is time to reach out again, as we now realize in our heart that all humans are special, even those that support us at the lowest tier possible. And so, we embrace every patron because we know your real value, and not because we may feel vaguely guilty over completely blowing off last month for perfectly valid medical reasons concerning social and temporal distancing.</p><p>So, to all of our patrons, this month we will give you more than you ever asked for. With the gracious permission of the author, for July and August we are giving <u>every</u> patron the download codes for both the ebook and audiobook productions of both <i>The Lawdog Files</i> and <i>The Lawdog Files: African Adventures</i>.</p><p>The coupon will expire September 15, 2020, so you still have several weeks left to become <a href=\"https://www.patreon.com/castalia\">a Castalia patron</a> and avail yourself of what Squeaks the pygmy mongoose himself would swear was the most excellent opportunity since that magic day that Ali Cheap-Cheap dropped a burlap bag of “beef” on his personal residence.</p></div>",
  "content_text": "A message from our sponsor:\nDuring our long months of social distancing we started to realize the value of other humans. After weeks of eating expired dippin’ dots and watching 90’s romcoms alone while talking to a gecko on the wall, being around other humans started to seem like a good idea. Especially once we realized that the gecko had been dead for at least a month, presumably from a bad batch of bat soup.\nHis name was Bobby. We buried him in a tiny mask.\nThis was the turning of the tide. It is time to reach out again, as we now realize in our heart that all humans are special, even those that support us at the lowest tier possible. And so, we embrace every patron because we know your real value, and not because we may feel vaguely guilty over completely blowing off last month for perfectly valid medical reasons concerning social and temporal distancing.\nSo, to all of our patrons, this month we will give you more than you ever asked for. With the gracious permission of the author, for July and August we are giving\nevery\npatron the download codes for both the ebook and audiobook productions of both\nThe Lawdog Files\nand\nThe Lawdog Files: African Adventures\n.\nThe coupon will expire September 15, 2020, so you still have several weeks left to become\na Castalia patron\nand avail yourself of what Squeaks the pygmy mongoose himself would swear was the most excellent opportunity since that magic day that Ali Cheap-Cheap dropped a burlap bag of “beef” on his personal residence.",
  "tags": [
    "Castalia"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-08-15T14:00:03+00:00"
}