{
  "url": "https://voxday.net/2020/08/13/awake-library-edition/",
  "scraped_at": "2025-12-21T13:04:23.180937",
  "title": "Awake Library edition",
  "date_display": "August 13, 2020",
  "date_iso": "2020-08-13T13:02:09+00:00",
  "date_from_url": "2020-08-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://social.infogalactic.com/images/posts/94caa058-c46b-430f-8b8c-9e22cd6b9c99/original-f244a00c7c25abd20ffcd27d67d86659.jpg?v=63764532299\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"650\" data-original-width=\"480\" decoding=\"async\" height=\"400\" loading=\"lazy\" src=\"https://social.infogalactic.com/images/posts/94caa058-c46b-430f-8b8c-9e22cd6b9c99/original-f244a00c7c25abd20ffcd27d67d86659.jpg?v=63764532299\" width=\"295\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"650\" data-original-width=\"480\" data-src=\"https://social.infogalactic.com/images/posts/94caa058-c46b-430f-8b8c-9e22cd6b9c99/original-f244a00c7c25abd20ffcd27d67d86659.jpg?v=63764532299\" decoding=\"async\" height=\"400\" loading=\"lazy\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20480%20650%22%3E%3C/svg%3E\" width=\"295\"/></a></div><p>This is not a mockup, this is a photo of the actual stamped and silver-foiled cowhide from the bindery. The interior cases have been printed for weeks, and I’m told that the bindery expects to ship the third book in the Castalia Library series to both US and international subscribers by the end of the month.</p><p>However, we’re still very much delayed on the Libraria versions, as the goatskin tannery went from lockdown to August vacation with barely a few weeks in between. I’m told they expect to ship all the goatskins for <i>The Missionaries</i>, <i>Awake</i>, and <i>The Divine Comedy</i> to the bindery during the third week of September, and we will keep you informed on the progress of those books. This is the downside of working with Italian suppliers; the quality is excellent but they work on Italian time.</p><p>The cowhide tannery is on vacation too, so the soonest we can reasonably expect to ship the Library version of <i>The Divine Comedy</i> is the end of September. We’re still finalizing the cover design, but, the interiors have already been printed, and we’re sending the first volume of Plutarch to the printer by the end of this weekend.</p><p>Please understand that the production disruptions caused by Corona-chan have not come to an end by any means, and that we are not sitting on our hands, but are actively working to keep routing around them. For example, we had originally planned to produce the Plutarchs in a larger size, but 6 x 9 is the largest paper size that the printer can currently obtain in the quality that we require. So, we adjusted our designs and proceeded accordingly. And, obviously, the delay in producing the Library books has pushed back the Junior Classics, but we’re hoping to at least get the ebook and regular hardcovers out before the end of the year.</p><p>In other Library news, the two Plutarch volumes are going to be monsters of around 768 pages each. The covers are going to be very cool and reflective of the dual Graeco-Roman nature of the text. We’ve also decided on Books 7 and 8, although we have not yet decided on the order. They will be <i>Summa Elvetica</i> by Vox Day and <i>Politics </i>by Aristotle. If you have a preference as to which you’d like to see released first, please let us know in the comments.</p></div>",
  "content_text": "This is not a mockup, this is a photo of the actual stamped and silver-foiled cowhide from the bindery. The interior cases have been printed for weeks, and I’m told that the bindery expects to ship the third book in the Castalia Library series to both US and international subscribers by the end of the month.\nHowever, we’re still very much delayed on the Libraria versions, as the goatskin tannery went from lockdown to August vacation with barely a few weeks in between. I’m told they expect to ship all the goatskins for\nThe Missionaries\n,\nAwake\n, and\nThe Divine Comedy\nto the bindery during the third week of September, and we will keep you informed on the progress of those books. This is the downside of working with Italian suppliers; the quality is excellent but they work on Italian time.\nThe cowhide tannery is on vacation too, so the soonest we can reasonably expect to ship the Library version of\nThe Divine Comedy\nis the end of September. We’re still finalizing the cover design, but, the interiors have already been printed, and we’re sending the first volume of Plutarch to the printer by the end of this weekend.\nPlease understand that the production disruptions caused by Corona-chan have not come to an end by any means, and that we are not sitting on our hands, but are actively working to keep routing around them. For example, we had originally planned to produce the Plutarchs in a larger size, but 6 x 9 is the largest paper size that the printer can currently obtain in the quality that we require. So, we adjusted our designs and proceeded accordingly. And, obviously, the delay in producing the Library books has pushed back the Junior Classics, but we’re hoping to at least get the ebook and regular hardcovers out before the end of the year.\nIn other Library news, the two Plutarch volumes are going to be monsters of around 768 pages each. The covers are going to be very cool and reflective of the dual Graeco-Roman nature of the text. We’ve also decided on Books 7 and 8, although we have not yet decided on the order. They will be\nSumma Elvetica\nby Vox Day and\nPolitics\nby Aristotle. If you have a preference as to which you’d like to see released first, please let us know in the comments.",
  "tags": [
    "Castalia"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-08-13T12:02:09+00:00"
}