{
  "url": "https://voxday.net/2020/08/05/but-they-changed-the-world/",
  "scraped_at": "2025-12-21T13:03:29.313212",
  "title": "But they changed the world!",
  "date_display": "August 5, 2020",
  "date_iso": "2020-08-05T15:00:01+00:00",
  "date_from_url": "2020-08-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.fox5ny.com/news/baby-boomers-score-lower-on-cognitive-functioning-than-members-of-previous-generations-study-finds\">The cognitive decline of the Baby Boomers</a> in comparison with past generations is not exactly a surprise.</p><blockquote><p>American baby boomers scored lower on a test of cognitive functioning than did members of previous generations, according to a new nationwide study by researchers at Ohio State University.</p><p>The study, published in the Journals of Gerontology, described how the average cognition scores of adults aged 51 and older have been improving from generation to generation, starting with the greatest generation (born 1890-1923) to war babies (born 1942-1947).</p><p>But the study showed there were significant declines in the scores for early baby boomers (1948-1953) through the mid-baby boomers (1954-1959).</p></blockquote><p>It would appear that pot, pina coladas, and narcissism are not good for the mind or the soul. What is somewhat of a surprise, however, is that <a href=\"https://www.fox10phoenix.com/news/study-baby-boomers-are-more-sensitive-than-millennials\">Boomers are even more sensitive</a> than the Millennials they deride as “snowflakes”.</p><blockquote class=\"tr_bq\"><p>Baby boomers are the most sensitive generation according to a recent study published in the <i>Journal of Psychology and Aging</i>. Baby boomers, or people between the ages of 55 to 73, are more likely to be narcissistic and hypersensitive. Findings suggested those in the baby boom generation were more likely to be full of themselves and more likely to impose their opinions on others.</p></blockquote><p>Sadly, the researchers were unable to determine the relative sensitivity of Generation X, as none of their GenX respondents could be bothered to respond to their questions.</p></div>",
  "content_text": "The cognitive decline of the Baby Boomers\nin comparison with past generations is not exactly a surprise.\nAmerican baby boomers scored lower on a test of cognitive functioning than did members of previous generations, according to a new nationwide study by researchers at Ohio State University.\nThe study, published in the Journals of Gerontology, described how the average cognition scores of adults aged 51 and older have been improving from generation to generation, starting with the greatest generation (born 1890-1923) to war babies (born 1942-1947).\nBut the study showed there were significant declines in the scores for early baby boomers (1948-1953) through the mid-baby boomers (1954-1959).\nIt would appear that pot, pina coladas, and narcissism are not good for the mind or the soul. What is somewhat of a surprise, however, is that\nBoomers are even more sensitive\nthan the Millennials they deride as “snowflakes”.\nBaby boomers are the most sensitive generation according to a recent study published in the\nJournal of Psychology and Aging\n. Baby boomers, or people between the ages of 55 to 73, are more likely to be narcissistic and hypersensitive. Findings suggested those in the baby boom generation were more likely to be full of themselves and more likely to impose their opinions on others.\nSadly, the researchers were unable to determine the relative sensitivity of Generation X, as none of their GenX respondents could be bothered to respond to their questions.",
  "tags": [
    "BabyBoomers"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-08-05T14:00:01+00:00"
}