{
  "url": "https://voxday.net/2020/08/09/expectations-of-excellence/",
  "scraped_at": "2025-12-21T13:03:54.171016",
  "title": "Expectations of excellence",
  "date_display": "August 9, 2020",
  "date_iso": "2020-08-09T12:04:44+00:00",
  "date_from_url": "2020-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While I hate Juve with a passion that is only exceeded by my loathing for Manchester United, I have nothing but respect and admiration for their relentless expectations of excellence. The Italian champions just fired their second manager in two years for the crime of only winning the Serie A title.</p><blockquote><p>Juventus fired coach Maurizio Sarri on Saturday after his first season in charge ended with the team’s Champions League exit. Despite winning the Italian title, Sarri paid the price for the round-of-16 loss to Lyon on Friday.</p><p>“The club would like to thank the coach for having written a new page in Juventus’ history with the victory of the ninth consecutive championship, the culmination of a personal journey that led him to climb all the divisions of Italian football,” the team said.</p><p>Serie A success won’t be enough for the club’s gamble to be validated, given that it’s won nine straight domestic titles, and the last two have been followed by managers hitting the exit. Champions League success is the ultimate goal, and since Cristiano Ronaldo was acquired from Real Madrid two years ago to help Juventus return to Europe’s summit, its Champions League performances have ended in a quarterfinal exit under Massimiliano Allegri and a last-16 exit under Sarri.</p></blockquote><p>This relentless and remorseless pursuit of excellence is the philosophy that I hope to inculcate in Castalia, in Unauthorized, in Infogalactic, in the LLOE, in my own writing, and in every other project in which I am involved.</p><p>And it’s fascinating to see Andrea Pirlo who was a brilliant manager on the field for the Mondiale-winning Azzurri as well as six Seria A-winning teams, ascend to the highest level of club football management. It will be interesting to see if <i>Il Maestro’s</i> on-field skills translate effectively to the sidelines or not.</p></div>",
  "content_text": "While I hate Juve with a passion that is only exceeded by my loathing for Manchester United, I have nothing but respect and admiration for their relentless expectations of excellence. The Italian champions just fired their second manager in two years for the crime of only winning the Serie A title.\nJuventus fired coach Maurizio Sarri on Saturday after his first season in charge ended with the team’s Champions League exit. Despite winning the Italian title, Sarri paid the price for the round-of-16 loss to Lyon on Friday.\n“The club would like to thank the coach for having written a new page in Juventus’ history with the victory of the ninth consecutive championship, the culmination of a personal journey that led him to climb all the divisions of Italian football,” the team said.\nSerie A success won’t be enough for the club’s gamble to be validated, given that it’s won nine straight domestic titles, and the last two have been followed by managers hitting the exit. Champions League success is the ultimate goal, and since Cristiano Ronaldo was acquired from Real Madrid two years ago to help Juventus return to Europe’s summit, its Champions League performances have ended in a quarterfinal exit under Massimiliano Allegri and a last-16 exit under Sarri.\nThis relentless and remorseless pursuit of excellence is the philosophy that I hope to inculcate in Castalia, in Unauthorized, in Infogalactic, in the LLOE, in my own writing, and in every other project in which I am involved.\nAnd it’s fascinating to see Andrea Pirlo who was a brilliant manager on the field for the Mondiale-winning Azzurri as well as six Seria A-winning teams, ascend to the highest level of club football management. It will be interesting to see if\nIl Maestro’s\non-field skills translate effectively to the sidelines or not.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-08-09T11:04:44+00:00"
}