{
  "url": "https://voxday.net/2020/08/01/it-is-a-possibility/",
  "scraped_at": "2025-12-21T13:03:04.393423",
  "title": "It is a possibility",
  "date_display": "August 1, 2020",
  "date_iso": "2020-08-01T17:21:34+00:00",
  "date_from_url": "2020-08-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t know who Tim Pool is, but he is warning his 584k subscribers <a href=\"https://twitter.com/Timcast/status/1289560224769089538\">about the demise of Patreon</a>:</p><blockquote><p>If you still use Patreon you should consider warning your subscribers about potential disruption</p><p>Due to the legal defeat they recently faced some lawyers are speculating that Patreon will collapse under the weight of legal costs</p><p>You Could LOSE Your entire income stream</p></blockquote><p>I just think it’s funny they still don’t understand how many people want to burn them down to the ground and dance on the glowing cinders.</p><p>The way the whole situation has evolved is rather interesting. For generations, companies have understood very clearly that they had to maintain positive relationships with their customers in order to stay in business. Hence the outmoded corporate doctrine that “the customer is always right”.</p><p>However, the combination of practical monopolies and the venture-to-IPO model has tended to sever the historical link between the consumer and the corporation, to the point that many technology companies no longer depend upon their consumers for their operating income. To the contrary, they have transformed consumers into users that are nothing more than raw material for their real customers. This is why they simply don’t possess a culture of giving a damn about their users, let alone harboring any regard for a single user they don’t like for one reason or another.</p><p>Their problem is their failure to understand that although the technology corporations are not financially dependent upon consumers, they nevertheless possess the same legal responsibilities toward their consumers that they did before, so their survival still relies upon maintaining the good will of the very users they now regard as irrelevant. And, as I noted in <i>Corporate Cancer</i>, because they remain caught between the Scylla of class action litigation – now complete with jury trials – and the Charybdis of mass individual arbitration, there is no way to legally finesse their way out of the situation.</p><p>Even worse, every attempt to legally thread the needle by their legal Odysseuses only renders them more vulnerable to being held responsible for the deceptive practices that are necessarily involved, such as Patreon’s false, misleading, and unenforceable “waivers” on class action and trial-by-jury.</p><p>The only way out is to accept the fact that their continued survival requires the goodwill of their users, but this necessitates a fundamental change in corporate culture that may not be possible for more than a few converged technology corporations.</p></div>",
  "content_text": "I don’t know who Tim Pool is, but he is warning his 584k subscribers\nabout the demise of Patreon\n:\nIf you still use Patreon you should consider warning your subscribers about potential disruption\nDue to the legal defeat they recently faced some lawyers are speculating that Patreon will collapse under the weight of legal costs\nYou Could LOSE Your entire income stream\nI just think it’s funny they still don’t understand how many people want to burn them down to the ground and dance on the glowing cinders.\nThe way the whole situation has evolved is rather interesting. For generations, companies have understood very clearly that they had to maintain positive relationships with their customers in order to stay in business. Hence the outmoded corporate doctrine that “the customer is always right”.\nHowever, the combination of practical monopolies and the venture-to-IPO model has tended to sever the historical link between the consumer and the corporation, to the point that many technology companies no longer depend upon their consumers for their operating income. To the contrary, they have transformed consumers into users that are nothing more than raw material for their real customers. This is why they simply don’t possess a culture of giving a damn about their users, let alone harboring any regard for a single user they don’t like for one reason or another.\nTheir problem is their failure to understand that although the technology corporations are not financially dependent upon consumers, they nevertheless possess the same legal responsibilities toward their consumers that they did before, so their survival still relies upon maintaining the good will of the very users they now regard as irrelevant. And, as I noted in\nCorporate Cancer\n, because they remain caught between the Scylla of class action litigation – now complete with jury trials – and the Charybdis of mass individual arbitration, there is no way to legally finesse their way out of the situation.\nEven worse, every attempt to legally thread the needle by their legal Odysseuses only renders them more vulnerable to being held responsible for the deceptive practices that are necessarily involved, such as Patreon’s false, misleading, and unenforceable “waivers” on class action and trial-by-jury.\nThe only way out is to accept the fact that their continued survival requires the goodwill of their users, but this necessitates a fundamental change in corporate culture that may not be possible for more than a few converged technology corporations.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-08-01T16:21:34+00:00"
}