{
  "url": "https://voxday.net/2020/08/01/lauren-southern-goes-after-patreon/",
  "scraped_at": "2025-12-21T13:03:02.522648",
  "title": "Lauren Southern goes after Patreon",
  "date_display": "August 1, 2020",
  "date_iso": "2020-08-01T12:31:57+00:00",
  "date_from_url": "2020-08-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Patreon’s problems <a href=\"https://nationalfile.com/exclusive-lauren-southern-taking-first-steps-to-sue-patreon/\">are rapidly metastasizing</a>:</p><blockquote><p>Lauren Southern revealed that she is taking the first steps into suing Patreon for deplatforming her. Earlier this week, Patreon lost a lawsuit against fans of Owen Benjamin, who was kicked off the platform due to allegedly violating their policies on hate speech, inspiring Southern to take similar action against the platform.</p><p>Southern, the Canadian investigative journalist, was one of the first prominent conservatives to be removed from Patreon in 2017. Southern went on to crowd fund documentaries without the help of the platform.</p><p>Speaking to National File, Southern revealed that she is speaking with attorney Marc Randazza, the lawyer who handled the cases of the Owen Benjamin fans, on Friday “to see what steps we can take going forward with Patreon.”</p><p>“After the initial case was won this week, I tweeted that any former donors of mine should get in touch if they want to join us in an action against Patreon,” Southern told National File, before acknowledging that “While the initial judgement declared that ‘Patreon changed the rules in the middle of the game’ by changing their Terms of Service, this may not apply to our case.”</p><p>Southern continued, “If you have logged into Patreon and accept the new ToS, then you likely will not be eligible to join this action. However, anyone who has deleted their account since the ToS change, or simply not logged in, would not be affected by this.”</p></blockquote><p>As it happens, she’s incorrect. <i>Every single user</i> of Patreon has a very strong, virtually open-and-shut legal case against Patreon, as its deceptive practices are literally written into <i>every single version</i> of its Terms of Use, including all three enacted in 2020. While its true that Lauren’s supporters will have additional claims related to her deplatforming, the media coverage considerably underestimates the vulnerability of Patreon’s position due to its lack of knowledge of California law.</p><p>Which lack of knowledge it clearly shares with Patreon’s outside counsel. The amusing thing is that it was Patreon’s attempt to strike back at the 72 Bears that led the Legal Legion to the analysis revealing what in retrospect is an absurdly obvious self-destruct button that almost anyone can press at will.</p><p>Sadly, this excludes me, as I am not, and I have never been, a Patreon user. I just like to read rulebooks. Frankly, if lawyers knew anything at all about wargames, the first questions they should ask an opposing disputant is if they play Advanced Squad Leader and for how long. If the answers are “yes” and “more than 10 years”, immediately advise the client to settle.</p><p>The intricacies of case law and legal theory are like retarded child’s play compared to the ASL rules for everything from routing to vehicular attacks. Consider, for example, the procedure required to calculate the correct Firepower (FP) total while conducting an Overrun attack on exposed infantry by a vehicle.</p><blockquote class=\"tr_bq\"><p><b>7.11 FP:</b> The FP base for an OVR is one FP for an unarmored vehicle, two FP for an AFV, or four FP for an AFV whose MA is manned and functioning and is not a MG, FT, MTR, ATR or IFE-capable. The FP base is modified by adding to it the tripled (TPBF) and halved (Bounding First Fire) FP of all manned and functioning MG/IFE armament on the vehicle [<i>EXC: RMG do not add to OVR FP</i>]. CE armored halftrack (only) Passengers can add one-half (and the Passengers/Riders of other vehicles can add one-fourth) of their printed FP to an OVR, but this too is subject to TPBF. All FT FP is added normally with no TPBF/halving adjustment. The total FP of an OVR is halved if the vehicle becomes Immobile or destroyed before it can resolve its OVR (in addition to any halving vs a concealed target; A12.13), but combat results vs Passengers/Riders after an OVR declaration do not affect the OVR FP. The halving of FP for Motion/ Non-Stopped Fire does not apply to OVR FP. </p></blockquote><p>Of course, one can’t blindly apply the rules as written, as one has to keep in mind the game’s equivalent of case law, which consists of the expert exegeses, the examples and the errata as well.</p><blockquote class=\"tr_bq\"><p>The IFT DR will be on the 8 FP column, with a +1 DRM because all of the Tiger’s AF are equal to or better than 8. This +1 DRM is found in Note 3 on the AFV Destruction Table, and also in Rule 7.11. Note, however, the typo at the end of Rule 7.11: it should read ‘+1 if all AF are greater than or equal to 8.’ </p></blockquote><p>Wait, what typo? That doesn’t look right! (checks rulebook version) Oh, never mind, that reference to Rule 7.11 refers to <b>C 7.11 TK# DERIVATION </b>rather than <b>D 7.11 FP</b>, so no +1 DRM.(1)</p><p>Now are you beginning to understand why Terms of Use and legal citations are so easy and relaxing to read by comparison? And in not-entirely-unrelated news, the Daily Dot <a href=\"https://www.dailydot.com/debug/patreon-suing-owen-benjamin-fans/\">updates its hit piece</a> on Big Bear:</p><blockquote class=\"tr_bq\"><p><b>Update 8:35am CT, July 31: </b>On July 30, Patreon lost the suit in California state court. The claims will now be arbitrated individually.</p></blockquote><p><i><br/></i><i>(1) Of course, as is my wont, I left a little trap for the first ASLer tempted to sperg about this. 100 points to the first non-ASLer who can spot what it is. -100 points to the first ASLer to fall for it. If you play ASL and you see it, keep your mouth shut and see who doesn’t.</i></p></div>",
  "content_text": "Patreon’s problems\nare rapidly metastasizing\n:\nLauren Southern revealed that she is taking the first steps into suing Patreon for deplatforming her. Earlier this week, Patreon lost a lawsuit against fans of Owen Benjamin, who was kicked off the platform due to allegedly violating their policies on hate speech, inspiring Southern to take similar action against the platform.\nSouthern, the Canadian investigative journalist, was one of the first prominent conservatives to be removed from Patreon in 2017. Southern went on to crowd fund documentaries without the help of the platform.\nSpeaking to National File, Southern revealed that she is speaking with attorney Marc Randazza, the lawyer who handled the cases of the Owen Benjamin fans, on Friday “to see what steps we can take going forward with Patreon.”\n“After the initial case was won this week, I tweeted that any former donors of mine should get in touch if they want to join us in an action against Patreon,” Southern told National File, before acknowledging that “While the initial judgement declared that ‘Patreon changed the rules in the middle of the game’ by changing their Terms of Service, this may not apply to our case.”\nSouthern continued, “If you have logged into Patreon and accept the new ToS, then you likely will not be eligible to join this action. However, anyone who has deleted their account since the ToS change, or simply not logged in, would not be affected by this.”\nAs it happens, she’s incorrect.\nEvery single user\nof Patreon has a very strong, virtually open-and-shut legal case against Patreon, as its deceptive practices are literally written into\nevery single version\nof its Terms of Use, including all three enacted in 2020. While its true that Lauren’s supporters will have additional claims related to her deplatforming, the media coverage considerably underestimates the vulnerability of Patreon’s position due to its lack of knowledge of California law.\nWhich lack of knowledge it clearly shares with Patreon’s outside counsel. The amusing thing is that it was Patreon’s attempt to strike back at the 72 Bears that led the Legal Legion to the analysis revealing what in retrospect is an absurdly obvious self-destruct button that almost anyone can press at will.\nSadly, this excludes me, as I am not, and I have never been, a Patreon user. I just like to read rulebooks. Frankly, if lawyers knew anything at all about wargames, the first questions they should ask an opposing disputant is if they play Advanced Squad Leader and for how long. If the answers are “yes” and “more than 10 years”, immediately advise the client to settle.\nThe intricacies of case law and legal theory are like retarded child’s play compared to the ASL rules for everything from routing to vehicular attacks. Consider, for example, the procedure required to calculate the correct Firepower (FP) total while conducting an Overrun attack on exposed infantry by a vehicle.\n7.11 FP:\nThe FP base for an OVR is one FP for an unarmored vehicle, two FP for an AFV, or four FP for an AFV whose MA is manned and functioning and is not a MG, FT, MTR, ATR or IFE-capable. The FP base is modified by adding to it the tripled (TPBF) and halved (Bounding First Fire) FP of all manned and functioning MG/IFE armament on the vehicle [\nEXC: RMG do not add to OVR FP\n]. CE armored halftrack (only) Passengers can add one-half (and the Passengers/Riders of other vehicles can add one-fourth) of their printed FP to an OVR, but this too is subject to TPBF. All FT FP is added normally with no TPBF/halving adjustment. The total FP of an OVR is halved if the vehicle becomes Immobile or destroyed before it can resolve its OVR (in addition to any halving vs a concealed target; A12.13), but combat results vs Passengers/Riders after an OVR declaration do not affect the OVR FP. The halving of FP for Motion/ Non-Stopped Fire does not apply to OVR FP.\nOf course, one can’t blindly apply the rules as written, as one has to keep in mind the game’s equivalent of case law, which consists of the expert exegeses, the examples and the errata as well.\nThe IFT DR will be on the 8 FP column, with a +1 DRM because all of the Tiger’s AF are equal to or better than 8. This +1 DRM is found in Note 3 on the AFV Destruction Table, and also in Rule 7.11. Note, however, the typo at the end of Rule 7.11: it should read ‘+1 if all AF are greater than or equal to 8.’\nWait, what typo? That doesn’t look right! (checks rulebook version) Oh, never mind, that reference to Rule 7.11 refers to\nC 7.11 TK# DERIVATION\nrather than\nD 7.11 FP\n, so no +1 DRM.(1)\nNow are you beginning to understand why Terms of Use and legal citations are so easy and relaxing to read by comparison? And in not-entirely-unrelated news, the Daily Dot\nupdates its hit piece\non Big Bear:\nUpdate 8:35am CT, July 31:\nOn July 30, Patreon lost the suit in California state court. The claims will now be arbitrated individually.\n(1) Of course, as is my wont, I left a little trap for the first ASLer tempted to sperg about this. 100 points to the first non-ASLer who can spot what it is. -100 points to the first ASLer to fall for it. If you play ASL and you see it, keep your mouth shut and see who doesn’t.",
  "tags": [
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-08-01T11:31:57+00:00"
}