{
  "url": "https://voxday.net/2020/08/15/machiavelli-and-the-holocaust-laws/",
  "scraped_at": "2025-12-21T13:04:35.655101",
  "title": "Machiavelli and the Holocaust laws",
  "date_display": "August 15, 2020",
  "date_iso": "2020-08-15T11:57:52+00:00",
  "date_from_url": "2020-08-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From <i>The History of Florence</i> by Niccolo Machiavelli:</p><blockquote class=\"tr_bq\"><p>Nor is it possible for a public to enact a law more pernicious than one relating to matters which have long transpired.</p></blockquote><p>Machiavelli was discussing here the fate of the <i>ammoniti</i>, or the descendants of the Ghibellines who were banned by law from holding any office of government in Florence after the victory of the Guelphic party in 1356. He states that this law “laid the foundation of many evils” and noted “none felt so particularly injured with it as the Ricci; for they knew themselves to have occasioned it, they saw it involved the ruin of the republic, and their enemies, the Albizzi, contrary to their intention, became great in consequence.”</p><p>History always repeats itself. The direct attacks on the First Amendment rights of Americans by U.S. citizens who are not, and never will be, Americans, are not only going to fail, they are going to ruin the republic and make great their enemies.</p><p>There is a reason the Prometheans don’t want you to study history and why the Shapiros and Pragers relentlessly lie about it and retroactively attempt to revise it. There is nothing new under the sun. If you know history and you recognize which patterns apply to current events, you will have a very good idea what is going to happen.</p></div>",
  "content_text": "From\nThe History of Florence\nby Niccolo Machiavelli:\nNor is it possible for a public to enact a law more pernicious than one relating to matters which have long transpired.\nMachiavelli was discussing here the fate of the\nammoniti\n, or the descendants of the Ghibellines who were banned by law from holding any office of government in Florence after the victory of the Guelphic party in 1356. He states that this law “laid the foundation of many evils” and noted “none felt so particularly injured with it as the Ricci; for they knew themselves to have occasioned it, they saw it involved the ruin of the republic, and their enemies, the Albizzi, contrary to their intention, became great in consequence.”\nHistory always repeats itself. The direct attacks on the First Amendment rights of Americans by U.S. citizens who are not, and never will be, Americans, are not only going to fail, they are going to ruin the republic and make great their enemies.\nThere is a reason the Prometheans don’t want you to study history and why the Shapiros and Pragers relentlessly lie about it and retroactively attempt to revise it. There is nothing new under the sun. If you know history and you recognize which patterns apply to current events, you will have a very good idea what is going to happen.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-08-15T10:57:52+00:00"
}