{
  "url": "https://voxday.net/2020/08/19/mailvox-choose-this-day-whom-you-will-serve/",
  "scraped_at": "2025-12-21T13:05:00.238456",
  "title": "Mailvox: choose this day whom you will serve",
  "date_display": "August 19, 2020",
  "date_iso": "2020-08-19T18:09:12+00:00",
  "date_from_url": "2020-08-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A reader is concerned about what he perceives as anti-semitism:</p><blockquote><p>There are a number of us, Jews, Christians, and mixed Judeo-Christians (like myself), who enjoy reading your blog.  My friends and I meet over coffee (and/or beer and/or dinner) and the topics you highlight come up for discussion quite often. Educationally, we’re a highly varied group, anywhere from incomplete 10th Grade to multiple post-grad degrees (almost all in the hard sciences); politically, from just balancing the see-saw slightly left of center to falling off the right edge of the bench.</p><p>What we all have noticed is an increasing tilt towards anti-Semitism.  There isn’t one of us who’s going to stop reading your blog (no one’s dumb enough to cut off his nose), but it is noticeable (and disconcerting) that we do mention amongst ourselves from time to time.</p></blockquote><p>They should be disconcerted. As the US empire spirals into breakup and the chickens of the largest invasion in human history come home to roost, the halcyon days of pretense and civic nationalism and ethnic propaganda and historical revisionism are over. It’s no longer possible for anyone, however philo- or anti-semite, to pretend that people of one nation can also be part of another nation, or that political power in the hands of not-Americans is even remotely compatible with the unalienable rights of Americans. And on a related note, the Sino-Jewish war for the intellectual high ground in the USA <a href=\"https://www.unz.com/runz/american-pravda-racial-discrimination-at-harvard/\">has begun in earnest</a>.</p><p>The most observably evil organizations in the USA, from the ADL to the Hellmouth, are run by Satan worshippers who hide behind their ethnic identity and seem to genuinely believe that crying Holocaust will forever protect them from criticism of their evil actions 70 years later. While I don’t believe in the inexorable genetic determinism of DNA, the observable facts are observable and observation is the exact opposite of an intellectual crime.</p><p>Here is what should truly disconcert these disconcerted readers. Being an extreme outlier myself, I don’t personally care even a little bit about an individual’s ethnic heritage. I don’t concern myself with my own ethnic identity or allow it to influence my analysis about anything, so imagine how much less I care about anyone else’s. Macro is not micro, and the only thing I care about on the macro level is the truth. The objective, observable, and undeniable truth, however uncomfortable it might be for me or anyone else.</p><p>So, if you’re going to reject the truth and call it anti-semitic, or any other pejorative term, a) that’s your problem, not mine, and b) that doesn’t change reality by one single atom or iota. Because the fact, the objective, observable, and undeniable fact, is that I am anti-satanic, anti-globalist, anti-imperialist, and anti-promethean. If that somehow leads you to believe that I am anti-semitic, then you should probably look very, very hard at where your logic is leading you and whom you are serving.</p><p>Anyhow, anti-semitism is merely one of the charges that have been hurled at me since I was getting death threats from CAIR back in 2001, and I’ve been on the ADL hate list since 2016. So, I sincerely hope you will excuse me continuing to not give a quantum of a fragment of a damn what anyone else happens to think one way or another.</p></div>",
  "content_text": "A reader is concerned about what he perceives as anti-semitism:\nThere are a number of us, Jews, Christians, and mixed Judeo-Christians (like myself), who enjoy reading your blog.  My friends and I meet over coffee (and/or beer and/or dinner) and the topics you highlight come up for discussion quite often. Educationally, we’re a highly varied group, anywhere from incomplete 10th Grade to multiple post-grad degrees (almost all in the hard sciences); politically, from just balancing the see-saw slightly left of center to falling off the right edge of the bench.\nWhat we all have noticed is an increasing tilt towards anti-Semitism.  There isn’t one of us who’s going to stop reading your blog (no one’s dumb enough to cut off his nose), but it is noticeable (and disconcerting) that we do mention amongst ourselves from time to time.\nThey should be disconcerted. As the US empire spirals into breakup and the chickens of the largest invasion in human history come home to roost, the halcyon days of pretense and civic nationalism and ethnic propaganda and historical revisionism are over. It’s no longer possible for anyone, however philo- or anti-semite, to pretend that people of one nation can also be part of another nation, or that political power in the hands of not-Americans is even remotely compatible with the unalienable rights of Americans. And on a related note, the Sino-Jewish war for the intellectual high ground in the USA\nhas begun in earnest\n.\nThe most observably evil organizations in the USA, from the ADL to the Hellmouth, are run by Satan worshippers who hide behind their ethnic identity and seem to genuinely believe that crying Holocaust will forever protect them from criticism of their evil actions 70 years later. While I don’t believe in the inexorable genetic determinism of DNA, the observable facts are observable and observation is the exact opposite of an intellectual crime.\nHere is what should truly disconcert these disconcerted readers. Being an extreme outlier myself, I don’t personally care even a little bit about an individual’s ethnic heritage. I don’t concern myself with my own ethnic identity or allow it to influence my analysis about anything, so imagine how much less I care about anyone else’s. Macro is not micro, and the only thing I care about on the macro level is the truth. The objective, observable, and undeniable truth, however uncomfortable it might be for me or anyone else.\nSo, if you’re going to reject the truth and call it anti-semitic, or any other pejorative term, a) that’s your problem, not mine, and b) that doesn’t change reality by one single atom or iota. Because the fact, the objective, observable, and undeniable fact, is that I am anti-satanic, anti-globalist, anti-imperialist, and anti-promethean. If that somehow leads you to believe that I am anti-semitic, then you should probably look very, very hard at where your logic is leading you and whom you are serving.\nAnyhow, anti-semitism is merely one of the charges that have been hurled at me since I was getting death threats from CAIR back in 2001, and I’ve been on the ADL hate list since 2016. So, I sincerely hope you will excuse me continuing to not give a quantum of a fragment of a damn what anyone else happens to think one way or another.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-08-19T17:09:12+00:00"
}