{
  "url": "https://voxday.net/2020/08/05/qanon-is-winning-the-narrative-battle/",
  "scraped_at": "2025-12-21T13:03:27.493563",
  "title": "Qanon is winning the Narrative battle",
  "date_display": "August 5, 2020",
  "date_iso": "2020-08-05T12:02:32+00:00",
  "date_from_url": "2020-08-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The media is beginning to worry that it is losing control of the Narrative</p><blockquote><p><b>Why it matters:</b> QAnon is not just one fringe conspiracy theory — it’s a sprawling network of falsehoods that’s seeping into the mainstream. Its growing influence is sowing fear and confusion around some of today’s most important issues, such as election integrity and the coronavirus pandemic.</p><p><b>Catch up quick</b>: QAnon is a far-right conspiracy theory that alleges the “deep state” is engaged in a global fight to take down President Trump.</p><p>QAnon rose out of the 2016 Pizzagate conspiracy theory and has grown into a decentralized network that analyzes cryptic prophecies dropped in remote online forums by “Q,” who claims, without ever offering evidence, to be a Trump administration official with high-level clearance.</p><p>Q maintains President Trump is secretly fighting a child-selling cabal in the U.S., though the conspiracy has spiraled to cover a vast array of claims, from JFK Jr. having faked his death to help Trump behind the scenes to the coronavirus being a hoax or a biological weapon engineered in either case by sinister elites.</p><p><b>By the numbers:</b> Conspiracy theories tied to QAnon are growing more popular.</p><p>There was more than 10 times as much Google search interest in QAnon in mid-July than in mid-January, according to Google Trends data.</p><p>QAnon pages and groups on Facebook had nearly 10 times more likes at the end of last month than they did last July, according to data tracked by the Atlantic Council and shared with Axios.</p><p>There has been a 190{4e01b0bc4ab012654d0c5016d8cbf558644ab2e53259aa2c40b66b3b20e8967d} increase in the daily average number of tweets with popular QAnon hashtags since March as compared to the seven months prior, according to data from GroupSense provided to Axios.</p></blockquote><p>Of course, the readily confirmable fact is that the Qanon narrative has proven to be vastly more reliable, and a better predictive model, than the mainstream media narrative. Which means that it would be better described as a sprawling network of uncomfortable truths that is seeping into the public consciousness.</p></div>",
  "content_text": "The media is beginning to worry that it is losing control of the Narrative\nWhy it matters:\nQAnon is not just one fringe conspiracy theory — it’s a sprawling network of falsehoods that’s seeping into the mainstream. Its growing influence is sowing fear and confusion around some of today’s most important issues, such as election integrity and the coronavirus pandemic.\nCatch up quick\n: QAnon is a far-right conspiracy theory that alleges the “deep state” is engaged in a global fight to take down President Trump.\nQAnon rose out of the 2016 Pizzagate conspiracy theory and has grown into a decentralized network that analyzes cryptic prophecies dropped in remote online forums by “Q,” who claims, without ever offering evidence, to be a Trump administration official with high-level clearance.\nQ maintains President Trump is secretly fighting a child-selling cabal in the U.S., though the conspiracy has spiraled to cover a vast array of claims, from JFK Jr. having faked his death to help Trump behind the scenes to the coronavirus being a hoax or a biological weapon engineered in either case by sinister elites.\nBy the numbers:\nConspiracy theories tied to QAnon are growing more popular.\nThere was more than 10 times as much Google search interest in QAnon in mid-July than in mid-January, according to Google Trends data.\nQAnon pages and groups on Facebook had nearly 10 times more likes at the end of last month than they did last July, according to data tracked by the Atlantic Council and shared with Axios.\nThere has been a 190{4e01b0bc4ab012654d0c5016d8cbf558644ab2e53259aa2c40b66b3b20e8967d} increase in the daily average number of tweets with popular QAnon hashtags since March as compared to the seven months prior, according to data from GroupSense provided to Axios.\nOf course, the readily confirmable fact is that the Qanon narrative has proven to be vastly more reliable, and a better predictive model, than the mainstream media narrative. Which means that it would be better described as a sprawling network of uncomfortable truths that is seeping into the public consciousness.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-08-05T11:02:32+00:00"
}