{
  "url": "https://voxday.net/2020/08/28/the-hypocrisy-of-blm/",
  "scraped_at": "2025-12-21T13:05:57.440248",
  "title": "The hypocrisy of BLM",
  "date_display": "August 28, 2020",
  "date_iso": "2020-08-28T10:43:04+00:00",
  "date_from_url": "2020-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is why <a href=\"https://www.si.com/soccer/2020/08/27/real-salt-lake-owner-disrespect-player-strike\">owners should crack down hard</a> on protesting players and league employees. Neither the league employees nor the players actually harbor any genuine respect whatsoever for people expressing their beliefs, if those beliefs happen to be different than their own politically correct propaganda.</p><blockquote><p>Real Salt Lake owner Dell Loy Hansen said he felt “disrespected” by his players after they made the decision to not play against LAFC on Wednesday.</p><p>The club opted to sit out Wednesday’s MLS contest in the wake of the Jacob Blake shooting in Kenosha, Wis.</p><p>Real Salt Lake and LAFC decided not to play as a show of solidarity with NBA, WNBA and MLB teams who also opted to protest racial injustice.</p><p>“All I can say is they supported other issues nationally; they clearly did not support our city or our organization,” Hansen said on Wednesday. “It’s a moment of sadness. It’s like somebody stabbed you and you’re trying to figure out a way to pull the knife out and move forward. That’s what it feels like. The disrespect is profound to me personally.”</p><p>Hansen and Real Salt Lake recently brought 40 employees back into the organization following a slate of furloughs in April. But Hansen said that decision may be reversed after Wednesday’s strike.</p><p>“We will not be inviting fans back to the stadium in the future, so tomorrow. …I start cutting 40 to 50 jobs again,” Hansen said. “We would not go through the risk of inviting people back to have that kind of an outcome.”</p><p>A Thursday report from <i>The Athletic</i> detailed Hansen’s history of racist comments since he took over as Real Salt Lake’s owners. MLS issued another statement in response to this story, announcing its intentions to investigate the matter.</p><p>“We are deeply concerned about the allegations made in a report published this evening concerning language used by and the conduct of Dell Loy Hansen. Major League Soccer has zero tolerance for this type of language or conduct and will immediately commence an investigation.”</p><p>The MLS Players’ Association released a statement in response to The Athletic’s story, calling Hansen’s remarks “sickening” and demanding Hansen be forced to sell the team if the allegations are substantiated.</p></blockquote><p>We’re supposed to believe that anti-American beliefs are not only acceptable, but laudable, while simply preferring your own kind is justification for violating your property rights.</p><p>There is absolutely no place for social justice in any civilized society. Social justice is intrinsically anti-Western. Don’t respect it, don’t compromise with it, and don’t tolerate it.</p></div>",
  "content_text": "This is why\nowners should crack down hard\non protesting players and league employees. Neither the league employees nor the players actually harbor any genuine respect whatsoever for people expressing their beliefs, if those beliefs happen to be different than their own politically correct propaganda.\nReal Salt Lake owner Dell Loy Hansen said he felt “disrespected” by his players after they made the decision to not play against LAFC on Wednesday.\nThe club opted to sit out Wednesday’s MLS contest in the wake of the Jacob Blake shooting in Kenosha, Wis.\nReal Salt Lake and LAFC decided not to play as a show of solidarity with NBA, WNBA and MLB teams who also opted to protest racial injustice.\n“All I can say is they supported other issues nationally; they clearly did not support our city or our organization,” Hansen said on Wednesday. “It’s a moment of sadness. It’s like somebody stabbed you and you’re trying to figure out a way to pull the knife out and move forward. That’s what it feels like. The disrespect is profound to me personally.”\nHansen and Real Salt Lake recently brought 40 employees back into the organization following a slate of furloughs in April. But Hansen said that decision may be reversed after Wednesday’s strike.\n“We will not be inviting fans back to the stadium in the future, so tomorrow. …I start cutting 40 to 50 jobs again,” Hansen said. “We would not go through the risk of inviting people back to have that kind of an outcome.”\nA Thursday report from\nThe Athletic\ndetailed Hansen’s history of racist comments since he took over as Real Salt Lake’s owners. MLS issued another statement in response to this story, announcing its intentions to investigate the matter.\n“We are deeply concerned about the allegations made in a report published this evening concerning language used by and the conduct of Dell Loy Hansen. Major League Soccer has zero tolerance for this type of language or conduct and will immediately commence an investigation.”\nThe MLS Players’ Association released a statement in response to The Athletic’s story, calling Hansen’s remarks “sickening” and demanding Hansen be forced to sell the team if the allegations are substantiated.\nWe’re supposed to believe that anti-American beliefs are not only acceptable, but laudable, while simply preferring your own kind is justification for violating your property rights.\nThere is absolutely no place for social justice in any civilized society. Social justice is intrinsically anti-Western. Don’t respect it, don’t compromise with it, and don’t tolerate it.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-08-28T09:43:04+00:00"
}