{
  "url": "https://voxday.net/2020/08/14/unappreciated-and-unawarded/",
  "scraped_at": "2025-12-21T13:04:30.199396",
  "title": "Unappreciated and unawarded",
  "date_display": "August 14, 2020",
  "date_iso": "2020-08-14T17:33:07+00:00",
  "date_from_url": "2020-08-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And it wasn’t just unawarded. <i>Midnight’s War</i> somehow didn’t even qualify as one of the 36 runners-up despite being one of the top 10 ranked in Popularity and earning a higher rating than two out of the three Silver winners.</p><p>This tells me that Arkhaven needs to seriously rethink our plan to use Webtoons as a platform. While some of the winning stories were pretty good, precisely <u>none</u> of the art in any of the winners or runners-up was even close to that of <i>Midnight’s War</i>. It’s now clear that it’s just not the sort of thing that they are ever going to promote to their readership.</p><p>Perhaps we’ll look for a platform more in tune with Western art or perhaps we’ll build our own platform. But we definitely won’t be putting anything except <i>Hypergamouse, Quantum Mortis, </i>and <i>Go Monster Go!</i> up there, at least for the time being. If you think my reaction is too severe, consider the artwork from the top prize winner below, and then compare it to <a href=\"https://www.webtoons.com/en/challenge/midnights-war/list?title_no=463673\">the art for <i>Midnight’s War</i></a>.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://social.infogalactic.com/images/posts/12a4812e-d921-4c3f-aaf9-65bad592cd03/original-00b940425ca90d21aa40a56117d3d6eb.jpg?v=63764501453\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"493\" data-original-width=\"480\" decoding=\"async\" src=\"https://social.infogalactic.com/images/posts/12a4812e-d921-4c3f-aaf9-65bad592cd03/original-00b940425ca90d21aa40a56117d3d6eb.jpg?v=63764501453\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"493\" data-original-width=\"480\" data-src=\"https://social.infogalactic.com/images/posts/12a4812e-d921-4c3f-aaf9-65bad592cd03/original-00b940425ca90d21aa40a56117d3d6eb.jpg?v=63764501453\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20480%20493%22%3E%3C/svg%3E\"/></a></div><p><b>UPDATE: </b>There is no mystery concerning the missing webcomics. I pulled AH, CDA, and Jeeves down last night; MW will also be taken down as soon as it’s not locked for the contest by Webtoons. I don’t have the time to keep updating 30-panel episodes if the platform is not part of our core strategy. For Arkhaven Patreon subscribers, we’ll return to direct digital downloads.</p><p><b>UPDATE:</b> <i>Midnight’s War</i> and <i>Quantum Mortis</i> have been removed as well. We are going to build our own platform.</p></div>",
  "content_text": "And it wasn’t just unawarded.\nMidnight’s War\nsomehow didn’t even qualify as one of the 36 runners-up despite being one of the top 10 ranked in Popularity and earning a higher rating than two out of the three Silver winners.\nThis tells me that Arkhaven needs to seriously rethink our plan to use Webtoons as a platform. While some of the winning stories were pretty good, precisely\nnone\nof the art in any of the winners or runners-up was even close to that of\nMidnight’s War\n. It’s now clear that it’s just not the sort of thing that they are ever going to promote to their readership.\nPerhaps we’ll look for a platform more in tune with Western art or perhaps we’ll build our own platform. But we definitely won’t be putting anything except\nHypergamouse, Quantum Mortis,\nand\nGo Monster Go!\nup there, at least for the time being. If you think my reaction is too severe, consider the artwork from the top prize winner below, and then compare it to\nthe art for\nMidnight’s War\n.\nUPDATE:\nThere is no mystery concerning the missing webcomics. I pulled AH, CDA, and Jeeves down last night; MW will also be taken down as soon as it’s not locked for the contest by Webtoons. I don’t have the time to keep updating 30-panel episodes if the platform is not part of our core strategy. For Arkhaven Patreon subscribers, we’ll return to direct digital downloads.\nUPDATE:\nMidnight’s War\nand\nQuantum Mortis\nhave been removed as well. We are going to build our own platform.",
  "tags": [
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-08-14T16:33:07+00:00"
}