{
  "url": "https://voxday.net/2020/08/25/where-do-all-these-betrayers-come-from/",
  "scraped_at": "2025-12-21T13:05:32.513567",
  "title": "Where do all these betrayers come from?",
  "date_display": "August 25, 2020",
  "date_iso": "2020-08-25T09:43:21+00:00",
  "date_from_url": "2020-08-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As one of Melania’s “friends” writes a book about her private conversations, Anonymous Conservative explains how all of these problematic people <a href=\"https://www.anonymousconservative.com/blog/news-briefs-08-25-2020/\">just happen to have people in their lives</a> who not only have no personal loyalty to them, but just happen to have been making recordings of their conversations from the start:</p><blockquote><p>Once you are isolated, then they can send in their people, briefed on your likes and dislikes, and arrange a chance meeting. Knowing just how to click with you, suddenly you have a friend. And once that friend is there, they can bring in others. And if they want you on tape saying something specific, look at how they can arrange circumstances….</p><p>Not everyone will get that treatment, but if you intend to succeed and begin to succeed at your intention, It is going to happen to you. Just look at how many people around Trump were recording covertly, that we have heard about. There was his fucking lawyer of all people, Cohen, the niece with the book, Omarosa, the Access Hollywood crew, this one, almost Rosenstein, the FBI, the CIA, and probably multiple agents from them. And I’ll bet there were three of four for every one of those, at least, who never managed to get anything useful and you haven’t heard about them. It is not a coincidence all of these people and more were running tape on Trump and his family. That is what it is like to be the target of Cabal’s intelligence operations. If you aspire to exert influence, understand it is not unlikely that your “friends” were sent in to work against you. If fact, it is probably more than likely.</p></blockquote><p>This is why it is vital to speak exactly the same truth in your personal life that you do in your public one. It is also why you should never, ever, let your guard down when speaking with anyone, no matter how strongly they’ve backed you or how enthusiastically they’ve supported you. Especially these days of the Panaudiocon, when even the televisions and computers, to say nothing of Alexa and Siri, are actively listening to everyone, it is simply necessary to discipline your tongue in all circumstances.</p><p>In East Germany, 620,000 people worked undercover for the secret state police. That’s 3.8 percent of the population; the US equivalent is 12.3 million. Now ask yourself this question: what are the chances that none of those social surveillance agents are paying any attention to a confirmed dissident and thought criminal like you?</p><p>Keep your old friends. And keep a polite, but firm, distance from everyone else, especially those who want to become your new best friend.</p></div>",
  "content_text": "As one of Melania’s “friends” writes a book about her private conversations, Anonymous Conservative explains how all of these problematic people\njust happen to have people in their lives\nwho not only have no personal loyalty to them, but just happen to have been making recordings of their conversations from the start:\nOnce you are isolated, then they can send in their people, briefed on your likes and dislikes, and arrange a chance meeting. Knowing just how to click with you, suddenly you have a friend. And once that friend is there, they can bring in others. And if they want you on tape saying something specific, look at how they can arrange circumstances….\nNot everyone will get that treatment, but if you intend to succeed and begin to succeed at your intention, It is going to happen to you. Just look at how many people around Trump were recording covertly, that we have heard about. There was his fucking lawyer of all people, Cohen, the niece with the book, Omarosa, the Access Hollywood crew, this one, almost Rosenstein, the FBI, the CIA, and probably multiple agents from them. And I’ll bet there were three of four for every one of those, at least, who never managed to get anything useful and you haven’t heard about them. It is not a coincidence all of these people and more were running tape on Trump and his family. That is what it is like to be the target of Cabal’s intelligence operations. If you aspire to exert influence, understand it is not unlikely that your “friends” were sent in to work against you. If fact, it is probably more than likely.\nThis is why it is vital to speak exactly the same truth in your personal life that you do in your public one. It is also why you should never, ever, let your guard down when speaking with anyone, no matter how strongly they’ve backed you or how enthusiastically they’ve supported you. Especially these days of the Panaudiocon, when even the televisions and computers, to say nothing of Alexa and Siri, are actively listening to everyone, it is simply necessary to discipline your tongue in all circumstances.\nIn East Germany, 620,000 people worked undercover for the secret state police. That’s 3.8 percent of the population; the US equivalent is 12.3 million. Now ask yourself this question: what are the chances that none of those social surveillance agents are paying any attention to a confirmed dissident and thought criminal like you?\nKeep your old friends. And keep a polite, but firm, distance from everyone else, especially those who want to become your new best friend.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-08-25T08:43:21+00:00"
}