{
  "url": "https://voxday.net/2018/08/14/a-dialogue-with-the-new-york-times/",
  "scraped_at": "2025-12-19T21:16:31.212774",
  "title": "A dialogue with The New York Times",
  "date_display": "August 14, 2018",
  "date_iso": "2018-08-14T00:51:35+00:00",
  "date_from_url": "2018-08-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>NYT:<i> </i></b><i>Good morning and hope you have been well. I am writing to get insights from you on why the turnout, as reported, was low for the Unite The Right rally yesterday?  Your previous emails to me were quite helpful and insightful and I am hoping you could provide me with some perspective on yesterday’s rally.</i><br><b><br/></b><b>VD: </b>Because the Unite The Right was Fake Right all along. It has nothing to do with the genuine right wing. The organizer was a left-wing fraud from the start. You guys in the media keep falling for the act, but no one else is anymore.</br></p><p><b>NYT: </b><i>That’s very interesting. Thanks for responding so quickly. What do you mean by fake right?What are some examples of the organizer being a fake. What has he done? Has this belief caused division within the right? Trying to fully understand.</i></p><p><b>VD:</b> He’s not a right-winger. He’s not of the political or ideological right. He’s an Obama supporter. He belonged to Occupy. This isn’t that hard. Look it up.</p><p><b>NYT: </b><i>Last question: Why does Unite The Right have nothing to do wih the genuine right wing? What issues are you referring to?</i></p><p><b>VD: </b>Because it’s run by socialists, atheists, and pan-racial imperialists. As I said, they are Fake Right. They may be to the right of communists and Che Guevara, but that’s about it. It’s a false flag.</p><p>These are the sort of questions I don’t really mind from the mainstream media. Obviously, I ignore the vast majority of contacts, but I happen to be acquainted with this particular reporter and it is safe to answer his questions because he has never – literally never – quoted me in the paper or anywhere else. This is partly because my answers are so completely orthogonal to the paper’s narrative, and partly due to the fact that he usually contacts me when he is trying to resolve his cognitive dissonance between the NYT narrative and the observable facts.</p><p>The mere fact that he contacted me about the rally is informative, though, because it confirms my suspicion that the mainstream media is genuinely confused as to why no one from the Right bothered to show up for the well-publicized, well-covered rally that was supposed to unite them. They have no idea how to even go about explaining the massive difference between their anticipation of the event and how it actually turned out.</p></div>",
  "content_text": "NYT:\nGood morning and hope you have been well. I am writing to get insights from you on why the turnout, as reported, was low for the Unite The Right rally yesterday?  Your previous emails to me were quite helpful and insightful and I am hoping you could provide me with some perspective on yesterday’s rally.\nVD:\nBecause the Unite The Right was Fake Right all along. It has nothing to do with the genuine right wing. The organizer was a left-wing fraud from the start. You guys in the media keep falling for the act, but no one else is anymore.\nNYT:\nThat’s very interesting. Thanks for responding so quickly. What do you mean by fake right?What are some examples of the organizer being a fake. What has he done? Has this belief caused division within the right? Trying to fully understand.\nVD:\nHe’s not a right-winger. He’s not of the political or ideological right. He’s an Obama supporter. He belonged to Occupy. This isn’t that hard. Look it up.\nNYT:\nLast question: Why does Unite The Right have nothing to do wih the genuine right wing? What issues are you referring to?\nVD:\nBecause it’s run by socialists, atheists, and pan-racial imperialists. As I said, they are Fake Right. They may be to the right of communists and Che Guevara, but that’s about it. It’s a false flag.\nThese are the sort of questions I don’t really mind from the mainstream media. Obviously, I ignore the vast majority of contacts, but I happen to be acquainted with this particular reporter and it is safe to answer his questions because he has never – literally never – quoted me in the paper or anywhere else. This is partly because my answers are so completely orthogonal to the paper’s narrative, and partly due to the fact that he usually contacts me when he is trying to resolve his cognitive dissonance between the NYT narrative and the observable facts.\nThe mere fact that he contacted me about the rally is informative, though, because it confirms my suspicion that the mainstream media is genuinely confused as to why no one from the Right bothered to show up for the well-publicized, well-covered rally that was supposed to unite them. They have no idea how to even go about explaining the massive difference between their anticipation of the event and how it actually turned out.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-13T23:51:35+00:00"
}