{
  "url": "https://voxday.net/2018/08/12/a-fascinating-choice-of-words/",
  "scraped_at": "2025-12-19T21:16:18.264790",
  "title": "A fascinating choice of words",
  "date_display": "August 12, 2018",
  "date_iso": "2018-08-12T17:00:00+00:00",
  "date_from_url": "2018-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Donald J. Trump@realDonaldTrump<br><i> …..Will the FBI ever recover it’s once stellar reputation, so badly damaged by Comey, McCabe, Peter S and his lover, the lovely Lisa Page, and other top officials now dismissed or fired? So many of the great men and women of the FBI have been hurt by these clowns and losers!</i><br><i><br/></i>Clowns…. A truly <i>intriguing </i>choice of words there by the President of the United States.</br></br></p><p>And since it worked so well for the GameJournoPros, the failing newspapers of the world are openly colluding to declare that <a href=\"https://money.cnn.com/2018/08/11/media/boston-globe-free-press-editorial/index.html\">Newspaper Readers are Dead</a>:</p><blockquote><p>The Boston Globe has been contacting newspaper editorial boards and proposing a “coordinated response” to President Trump’s escalating “enemy of the people” rhetoric.</p><p>“We propose to publish an editorial on August 16 on the dangers of the administration’s assault on the press and ask others to commit to publishing their own editorials on the same date,” The Globe said in its pitch to fellow papers.</p><p>The effort began just a few days ago.</p><p>As of Saturday, “we have more than 100 publications signed up, and I expect that number to grow in the coming days,” Marjorie Pritchard, the Globe’s deputy editorial page editor, told CNN.</p></blockquote><p>Talk about collusion! It’s amusing that they think this is going to help them in any way, shape, or form. To the contrary, it is going to help underline the God-Emperor’s point. They are not merely the enemy of the people, they are the <i>unified </i>enemy of the people.</p><p>They believe they’re making a point about the importance of an independent press by pushing the same narrative simultaneously, in coordinated unison. These people really are stupid.</p></div>",
  "content_text": "Donald J. Trump@realDonaldTrump\n…..Will the FBI ever recover it’s once stellar reputation, so badly damaged by Comey, McCabe, Peter S and his lover, the lovely Lisa Page, and other top officials now dismissed or fired? So many of the great men and women of the FBI have been hurt by these clowns and losers!\nClowns…. A truly\nintriguing\nchoice of words there by the President of the United States.\nAnd since it worked so well for the GameJournoPros, the failing newspapers of the world are openly colluding to declare that\nNewspaper Readers are Dead\n:\nThe Boston Globe has been contacting newspaper editorial boards and proposing a “coordinated response” to President Trump’s escalating “enemy of the people” rhetoric.\n“We propose to publish an editorial on August 16 on the dangers of the administration’s assault on the press and ask others to commit to publishing their own editorials on the same date,” The Globe said in its pitch to fellow papers.\nThe effort began just a few days ago.\nAs of Saturday, “we have more than 100 publications signed up, and I expect that number to grow in the coming days,” Marjorie Pritchard, the Globe’s deputy editorial page editor, told CNN.\nTalk about collusion! It’s amusing that they think this is going to help them in any way, shape, or form. To the contrary, it is going to help underline the God-Emperor’s point. They are not merely the enemy of the people, they are the\nunified\nenemy of the people.\nThey believe they’re making a point about the importance of an independent press by pushing the same narrative simultaneously, in coordinated unison. These people really are stupid.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-12T16:00:00+00:00"
}