{
  "url": "https://voxday.net/2018/08/28/aristotle-and-the-holocaust/",
  "scraped_at": "2025-12-19T21:18:41.891268",
  "title": "Aristotle and the Holocaust",
  "date_display": "August 28, 2018",
  "date_iso": "2018-08-28T15:35:41+00:00",
  "date_from_url": "2018-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ron Unz boldly <a href=\"http://www.unz.com/runz/american-pravda-holocaust-denial/\">casts considerable doubt</a> on the central article of the globalist catechism:</p><blockquote><p>Another obvious matter casts further doubt upon the historical quality of those five immensely thick volumes of standard Holocaust narrative, which together occupy nearly a linear foot on my bookshelves. For prosecutors of any crime, establishing a plausible motive is certainly an important goal, and in the case of the Jewish Holocaust, these authors would seem to have an easy task at hand. Hitler and his German colleagues had always claimed that the Jews overwhelmingly dominated Bolshevik Communism, and much of their struggle against the former was in order to prevent further bloody deeds of the latter. So surely devoting an early chapter or so to describing this central Nazi doctrine would provide an airtight explanation of what drove the Nazis to their fiendish slaughters, rendering fully explicable the horrifying events that would occupy the remainder of their text.</p><p>Yet oddly enough, an examination of their indexes for “Bolsheviks,” “Communism,” and all variants reveals almost no discussion of this important issue. Goldhagen’s 1996 book provides just a couple of short sentences spread across his 600 pages, and the other works seem to contain virtually nothing at all. Since all of these Holocaust books almost totally avoid Hitler’s self-declared motive for his anti-Jewish actions, they are forced to desperately search for alternative explanations, seeking clues buried deep within the German past or turning to psychanalytical speculations or perhaps deciding that what they describe as the greatest massacre in all human history was undertaken out of sheer Nazi wickedness.</p><p>The obvious reason for this glaring omission is that the authors are constructing a morality-play in which the Jews must be portrayed as absolutely blameless victims, and even hinting at their role in the numerous Communist atrocities that long preceded the rise of the Third Reich might cause readers to consider both sides of the issue. When purported historians go to absurd lengths to hide such glaring facts, they unmask themselves as propagandists, and we must be very cautious about trusting their reliability and candor in all other matters, whether great or small.</p><p>Indeed, the issue of Communism raises a far larger matter, one having rather touchy implications. Sometimes two simple compounds are separately inert, but when combined together may possess tremendous explosive force. From my introductory history classes and readings in high school, certain things had always seemed glaringly obvious to me even if the conclusions remained unmentionable, and I once assumed they were just as apparent to most others as well. But over the years I have begun to wonder whether perhaps this might not be correct.</p><p>Back in those late Cold War days, the death toll of innocent civilians from the Bolshevik Revolution and the first two decades of the Soviet Regime was generally reckoned at running well into the tens of millions when we include the casualties of the Russian Civil War, the government-induced famines, the Gulag, and the executions. I’ve heard that these numbers have been substantially revised downwards to perhaps as little as twenty million or so, but no matter. Although determined Soviet apologists may dispute such very large figures, they have always been part of the standard narrative history taught within the West.</p><p>Meanwhile, all historians know perfectly well that the Bolshevik leaders were overwhelmingly Jewish, with three of the five revolutionaries Lenin named as his plausible successors coming from that background. Although only around 4{e1b6c4ee08d0f44a6a5b11eb06b9139d63cfe72acbaefd7257f78696d447c626} of Russia’s population was Jewish, a few years ago Vladimir Putin stated that Jews constituted perhaps 80-85{e1b6c4ee08d0f44a6a5b11eb06b9139d63cfe72acbaefd7257f78696d447c626} of the early Soviet government, an estimate fully consistent with the contemporaneous claims of Winston Churchill, <i>Times of London</i> correspondent Robert Wilton, and the officers of American Military Intelligence. Recent books by Alexander Solzhenitsyn, Yuri Slezkine, and others have all painted a very similar picture. And prior to World War II, Jews remained enormously over-represented in the Communist leadership, especially dominating the Gulag administration and the top ranks of the dreaded NKVD.</p><p>Both of these simple facts have been widely accepted in America throughout my entire lifetime. But combine them together with the relatively tiny size of worldwide Jewry, around 16 million prior to World War II, and the inescapable conclusion is that in per capita terms Jews were the greatest mass-murderers of the twentieth century, holding that unfortunate distinction by an enormous margin and with no other nationality coming even remotely close. And yet, by the astonishing alchemy of Hollywood, the greatest killers of the last one hundred years have somehow been transmuted into being seen as the greatest victims, a transformation so seemingly implausible that future generations will surely be left gasping in awe.</p><p>Today’s American Neocons are just as heavily Jewish as were the Bolsheviks of a hundred years ago, and they have greatly benefited from the political immunity provided by this totally bizarre inversion of historical reality. Partly as a consequence of their media-fabricated victimhood status, they have managed to seize control over much of our political system, especially our foreign policy, and have spent the last few years doing their utmost to foment an absolutely insane war with nuclear-armed Russia. If they do manage to achieve that unfortunate goal, they will surely outdo the very impressive human body-count racked up by their ethnic ancestors, perhaps even by an order-of-magnitude or more.</p></blockquote><p>More importantly, the American Neocons ARE the Bolsheviks, specifically, the Trotsky faction. But everyone here already knew that.</p><p>However, Ron Unz’s iconoclastic piece got me thinking about the logic of the historical situation as we know it and some of the anomalies that have proven so difficult to resolve in a satisfying manner, massive anomalies that have led to criminal accusations of Holocaust denial on the one hand and charges of shameless historical mythmaking on the other. But what if <i>both parties </i>are basically correct concerning their primary points of emphasis? What happens if, in the spirit of theoretical skepticism, we simply apply straightforward logic to the facts as we observe them to be.</p><ul><li><b>Major Premise:</b> A very large quantity of Jews were killed in the 1936 to 1945 time frame.</li><li><b>Minor Premise:</b> The meticulously bureaucratic Germans, for whom historians possess a tremendous quantity of historical documents related to the WWII era, do not appear to have kept any records of any of the many aspects of the logistical and operative decisions and actions required for the major premise, nor did they have the motive or the opportunity to thoroughly eliminate those records. </li><li><b>Conclusion:</b><i> Someone other than the Germans killed most of those Jews.</i></li></ul><div>Now, who could that someone else be? It would have to be someone who was alive in the relevant time period and possessed the following attributes:</div><div><ul><li>Access to Eastern Europe and Russia.</li><li>A willingness to commit mass murder.</li><li>Control over large-scale military and logistical forces.</li><li>Significant influence over Western government figures and the media.</li><li>A master of propaganda.</li><li>Lethal hostility to Jewish Bolshevists.</li><li>An expert at playing “let’s you and him fight”.</li></ul><div>Can you think of anyone who might fit that bill? And recall that it was not until just eight years ago when it was finally confirmed <a href=\"https://infogalactic.com/info/Katyn_massacre\">the massacre of 22,000 Poles in 1940</a> that took place in the Katyn Forest was approved by the Soviet Politburo and was committed by Soviet forces, rather than by the Nazis as had been previously believed.<p>From <a href=\"https://infogalactic.com/info/Stalin_and_antisemitism\">Infogalactic</a>:</p><p><i>Following the Soviet invasion of Poland, Stalin began a policy of relocating Jews to the Jewish Autonomous Oblast and other parts of Siberia. Throughout the war, similar movements were executed in regions considered vulnerable to Nazi invasion with the various target ethnic groups of the Nazi genocide.</i></p><p>Doesn’t that sound a little… conveniently coincidental? Was Stalin relocating these target ethnic groups out of the goodness of his otherwise black heart? And how did he know those ethnic groups were at risk during the 22 months between September 1939 and June 1941, given that the Nazi invasion of 1941 is supposed to have taken him by complete surprise?</p><p>Now, I’m not saying that this hypothetical Soviet Holocaust was actually the historical case. I’m not a historian, I wasn’t there, and I have absolutely no idea what actually happened. I’m simply pointing out that logic suggests one <i>possible </i>explanation for the fact that detailed documents capable of definitively settling the historical account of the Holocaust once and for all to everyone’s satisfaction have not yet been found is because historians and scholars <i>have been looking in the wrong place</i> all along. This conclusion would also explain why so many Stalin-era documents are still sealed and kept strictly off-limits from researchers despite the fall of the Soviet Union. What other historical secret would merit such keeping even after so many years besides alien contact or the uncorrupted body of Jesus Christ of Nazareth?</p><p>And finally, a Soviet Holocaust might also explain the insane neocon obsession with going to war with Russia. Are they really <i>that </i>bitter about the Tsars, who vanished into history more than 100 years ago? Or is it possible they are seeking revenge for a more recent historical offense?</p></div></div></div>",
  "content_text": "Ron Unz boldly\ncasts considerable doubt\non the central article of the globalist catechism:\nAnother obvious matter casts further doubt upon the historical quality of those five immensely thick volumes of standard Holocaust narrative, which together occupy nearly a linear foot on my bookshelves. For prosecutors of any crime, establishing a plausible motive is certainly an important goal, and in the case of the Jewish Holocaust, these authors would seem to have an easy task at hand. Hitler and his German colleagues had always claimed that the Jews overwhelmingly dominated Bolshevik Communism, and much of their struggle against the former was in order to prevent further bloody deeds of the latter. So surely devoting an early chapter or so to describing this central Nazi doctrine would provide an airtight explanation of what drove the Nazis to their fiendish slaughters, rendering fully explicable the horrifying events that would occupy the remainder of their text.\nYet oddly enough, an examination of their indexes for “Bolsheviks,” “Communism,” and all variants reveals almost no discussion of this important issue. Goldhagen’s 1996 book provides just a couple of short sentences spread across his 600 pages, and the other works seem to contain virtually nothing at all. Since all of these Holocaust books almost totally avoid Hitler’s self-declared motive for his anti-Jewish actions, they are forced to desperately search for alternative explanations, seeking clues buried deep within the German past or turning to psychanalytical speculations or perhaps deciding that what they describe as the greatest massacre in all human history was undertaken out of sheer Nazi wickedness.\nThe obvious reason for this glaring omission is that the authors are constructing a morality-play in which the Jews must be portrayed as absolutely blameless victims, and even hinting at their role in the numerous Communist atrocities that long preceded the rise of the Third Reich might cause readers to consider both sides of the issue. When purported historians go to absurd lengths to hide such glaring facts, they unmask themselves as propagandists, and we must be very cautious about trusting their reliability and candor in all other matters, whether great or small.\nIndeed, the issue of Communism raises a far larger matter, one having rather touchy implications. Sometimes two simple compounds are separately inert, but when combined together may possess tremendous explosive force. From my introductory history classes and readings in high school, certain things had always seemed glaringly obvious to me even if the conclusions remained unmentionable, and I once assumed they were just as apparent to most others as well. But over the years I have begun to wonder whether perhaps this might not be correct.\nBack in those late Cold War days, the death toll of innocent civilians from the Bolshevik Revolution and the first two decades of the Soviet Regime was generally reckoned at running well into the tens of millions when we include the casualties of the Russian Civil War, the government-induced famines, the Gulag, and the executions. I’ve heard that these numbers have been substantially revised downwards to perhaps as little as twenty million or so, but no matter. Although determined Soviet apologists may dispute such very large figures, they have always been part of the standard narrative history taught within the West.\nMeanwhile, all historians know perfectly well that the Bolshevik leaders were overwhelmingly Jewish, with three of the five revolutionaries Lenin named as his plausible successors coming from that background. Although only around 4{e1b6c4ee08d0f44a6a5b11eb06b9139d63cfe72acbaefd7257f78696d447c626} of Russia’s population was Jewish, a few years ago Vladimir Putin stated that Jews constituted perhaps 80-85{e1b6c4ee08d0f44a6a5b11eb06b9139d63cfe72acbaefd7257f78696d447c626} of the early Soviet government, an estimate fully consistent with the contemporaneous claims of Winston Churchill,\nTimes of London\ncorrespondent Robert Wilton, and the officers of American Military Intelligence. Recent books by Alexander Solzhenitsyn, Yuri Slezkine, and others have all painted a very similar picture. And prior to World War II, Jews remained enormously over-represented in the Communist leadership, especially dominating the Gulag administration and the top ranks of the dreaded NKVD.\nBoth of these simple facts have been widely accepted in America throughout my entire lifetime. But combine them together with the relatively tiny size of worldwide Jewry, around 16 million prior to World War II, and the inescapable conclusion is that in per capita terms Jews were the greatest mass-murderers of the twentieth century, holding that unfortunate distinction by an enormous margin and with no other nationality coming even remotely close. And yet, by the astonishing alchemy of Hollywood, the greatest killers of the last one hundred years have somehow been transmuted into being seen as the greatest victims, a transformation so seemingly implausible that future generations will surely be left gasping in awe.\nToday’s American Neocons are just as heavily Jewish as were the Bolsheviks of a hundred years ago, and they have greatly benefited from the political immunity provided by this totally bizarre inversion of historical reality. Partly as a consequence of their media-fabricated victimhood status, they have managed to seize control over much of our political system, especially our foreign policy, and have spent the last few years doing their utmost to foment an absolutely insane war with nuclear-armed Russia. If they do manage to achieve that unfortunate goal, they will surely outdo the very impressive human body-count racked up by their ethnic ancestors, perhaps even by an order-of-magnitude or more.\nMore importantly, the American Neocons ARE the Bolsheviks, specifically, the Trotsky faction. But everyone here already knew that.\nHowever, Ron Unz’s iconoclastic piece got me thinking about the logic of the historical situation as we know it and some of the anomalies that have proven so difficult to resolve in a satisfying manner, massive anomalies that have led to criminal accusations of Holocaust denial on the one hand and charges of shameless historical mythmaking on the other. But what if\nboth parties\nare basically correct concerning their primary points of emphasis? What happens if, in the spirit of theoretical skepticism, we simply apply straightforward logic to the facts as we observe them to be.\nMajor Premise:\nA very large quantity of Jews were killed in the 1936 to 1945 time frame.\nMinor Premise:\nThe meticulously bureaucratic Germans, for whom historians possess a tremendous quantity of historical documents related to the WWII era, do not appear to have kept any records of any of the many aspects of the logistical and operative decisions and actions required for the major premise, nor did they have the motive or the opportunity to thoroughly eliminate those records.\nConclusion:\nSomeone other than the Germans killed most of those Jews.\nNow, who could that someone else be? It would have to be someone who was alive in the relevant time period and possessed the following attributes:\nAccess to Eastern Europe and Russia.\nA willingness to commit mass murder.\nControl over large-scale military and logistical forces.\nSignificant influence over Western government figures and the media.\nA master of propaganda.\nLethal hostility to Jewish Bolshevists.\nAn expert at playing “let’s you and him fight”.\nCan you think of anyone who might fit that bill? And recall that it was not until just eight years ago when it was finally confirmed\nthe massacre of 22,000 Poles in 1940\nthat took place in the Katyn Forest was approved by the Soviet Politburo and was committed by Soviet forces, rather than by the Nazis as had been previously believed.\nFrom\nInfogalactic\n:\nFollowing the Soviet invasion of Poland, Stalin began a policy of relocating Jews to the Jewish Autonomous Oblast and other parts of Siberia. Throughout the war, similar movements were executed in regions considered vulnerable to Nazi invasion with the various target ethnic groups of the Nazi genocide.\nDoesn’t that sound a little… conveniently coincidental? Was Stalin relocating these target ethnic groups out of the goodness of his otherwise black heart? And how did he know those ethnic groups were at risk during the 22 months between September 1939 and June 1941, given that the Nazi invasion of 1941 is supposed to have taken him by complete surprise?\nNow, I’m not saying that this hypothetical Soviet Holocaust was actually the historical case. I’m not a historian, I wasn’t there, and I have absolutely no idea what actually happened. I’m simply pointing out that logic suggests one\npossible\nexplanation for the fact that detailed documents capable of definitively settling the historical account of the Holocaust once and for all to everyone’s satisfaction have not yet been found is because historians and scholars\nhave been looking in the wrong place\nall along. This conclusion would also explain why so many Stalin-era documents are still sealed and kept strictly off-limits from researchers despite the fall of the Soviet Union. What other historical secret would merit such keeping even after so many years besides alien contact or the uncorrupted body of Jesus Christ of Nazareth?\nAnd finally, a Soviet Holocaust might also explain the insane neocon obsession with going to war with Russia. Are they really\nthat\nbitter about the Tsars, who vanished into history more than 100 years ago? Or is it possible they are seeking revenge for a more recent historical offense?",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-28T14:35:41+00:00"
}