{
  "url": "https://voxday.net/2018/08/26/comicsgate-is-sad-puppies/",
  "scraped_at": "2025-12-19T21:18:19.848971",
  "title": "Comicsgate is Sad Puppies",
  "date_display": "August 26, 2018",
  "date_iso": "2018-08-26T10:30:09+00:00",
  "date_from_url": "2018-08-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We don’t have a name. We don’t need a name. But it is eminently clear that the growing community around Arkhaven and Dark Legion are to Comicsgate what the Rabid Puppies were to the Sad Puppies. Comicsgate is the Tea Party to our Trumpslide. And you all know how those things turned out.</p><p>It is deeply amusing to see how the comics-SJWs are reacting in such an over-the-top manner to as harmless and inoffensive a group as Comicsgate, which is about as self-consciously centrist and politically correct and equalitarian as one can get. <a href=\"http://boundingintocomics.com/2018/08/25/bill-sienkiewicz-tells-fans-you-wont-be-missed-one-damned-bit-in-facebook-tirade/\">Just ask their defenders</a>:</p><blockquote><p>No one believes comics is a ‘boys club.’ Female creators have been a phenomenal core element of many celebrated characters and stories from across the medium. From Pia Guerra’s amazing art in Y: The Last Man, to June Brigman’s fan-favorite Power Pack, or even Hiromui Arakawa’s global sensation Full Metal Alchemist, women have long been celebrated and embraced by comic fans.</p><p>To call the movement racist is also in poor taste, as people of color are represented heavily in the movement. Race has also been a non-factor in comics for some time, with creators like Christopher Priest who is currently producing a fantastic run on DC’s Deathstroke, Image Co-Founder and current DC Comics Co-Publisher Jim Lee, and long-time The Amazing Spider-Man artist Humberto Ramos enjoying long and celebrated runs and careers. If the goal of the movement is as intolerant as Sienkiewicz believes, then creators such as the aforementioned would be denounced and lambasted by ComicsGate, rather than receiving the praise and support seen for these and many other non-white creators.</p></blockquote><p>It’s just a matter of time before Comicsgate is bragging that they pick up their litter and denouncing DC as the Real Racists. Sooner or later, they will learn that Being the Good Guy and Moderation and Talking Sense to the Enemy are neither strategies nor tactics, get rabid, and begin to fall in with us. Because the comics-SJWs are NEVER going to stop attacking them and calling them names, no matter how much they cuck and appease and ritualistically denounce us.</p><blockquote><p>“So stop being awful ambassadors for the worst of our natures. Stop being brownshirts. Stop being goddamned ugly dicks. And to re-jigger an ugly phrase you sling at women, I’m instead going to channel it here in the spirit of my Aussie friends: Stop being such insufferable clueless cunts.</p><p>The medium didn’t call on you to be the best version of assholes you could be. Neither did we.</p><p>Knock it off.</p><p>Either step up. Or step off.</p><p>We, Comics, and The Audience- will be absolutley fine without you.</p><p>And you won’t be missed one damned bit.”</p></blockquote><p>Absolutely fine? Perhaps, if an annual 10 percent decline in sales can be redefined as “fine”. Eight more years of that and we’ll have the comics industry to ourselves. But to be clear, I’m not at all <i>against </i>Comicsgate, I’m just amused by it. It’s harmless and largely irrelevant, but if it keeps the SJWs occupied while we overrun their flanks and baggage train, that suits me just fine.</p><p>That being said, after the <i>Alt-Hero: Q</i> campaign begins and the incendiary <i>Alt-Hero #4: The War in Paris</i> is published, I don’t know how much longer the SJWs will be able to restrain themselves from going openly after us. Not once they see how we are finding success in directly assaulting their assumptions about Diversity and their sanctimonious equalitarian pieties, while Marvel and DC <a href=\"http://boundingintocomics.com/2018/08/23/marvel-hires-sjw-ironheart-backlash/\">proceed headlong down the road to oblivion</a>.</p><blockquote><p>On Monday, Marvel announced that Riri Williams, the teenage super hero who took over the mantle of Iron Man in the wake of Civil War II, will debut in her own solo book this November. Riri Williams: Ironheart will feature several developments for the fledgling super hero: her first solo title, a brand new suit designed by Kevin Libranda, and the comic book debut of her writer Eve Ewing, whose announcement was met with a wave of backlash from the comic community.</p><p>Despite her lack of comic book writing history, one may ask how she came to be hired by Marvel. The answer is one that has appalled fans and caused further criticism of Marvel’s editorial board: she was hired because she looked like Riri and started a petition. The currently supported reason Ewing’s name was put forth to write Ironheart is because of Ewing’s supportive fans began spreading a petition to hire her based on a series of tweets in which she expressed the desire to write the book. These tweets were also supported by “evidence” provided by Ewing, which included the fact that she looked like Riri and had a small collection of various graphic novels on her bookshelf.</p></blockquote><p>And yes, the Dark Lord laughed. You know, this just might be the right time to introduce a series about a billionaire in a high-tech suit with a pretty blonde consort.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-tC34RNg8wwI/WW8qZ5J15YI/AAAAAAAAChs/ce_qVJGKzLI-3AMg_FW9QRDFCvLkBVLSgCPcBGAYYCw/s1600/SDL-SB_512.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"548\" data-original-width=\"512\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"https://1.bp.blogspot.com/-tC34RNg8wwI/WW8qZ5J15YI/AAAAAAAAChs/ce_qVJGKzLI-3AMg_FW9QRDFCvLkBVLSgCPcBGAYYCw/s400/SDL-SB_512.jpg\" width=\"372\"/></a></div></div>",
  "content_text": "We don’t have a name. We don’t need a name. But it is eminently clear that the growing community around Arkhaven and Dark Legion are to Comicsgate what the Rabid Puppies were to the Sad Puppies. Comicsgate is the Tea Party to our Trumpslide. And you all know how those things turned out.\nIt is deeply amusing to see how the comics-SJWs are reacting in such an over-the-top manner to as harmless and inoffensive a group as Comicsgate, which is about as self-consciously centrist and politically correct and equalitarian as one can get.\nJust ask their defenders\n:\nNo one believes comics is a ‘boys club.’ Female creators have been a phenomenal core element of many celebrated characters and stories from across the medium. From Pia Guerra’s amazing art in Y: The Last Man, to June Brigman’s fan-favorite Power Pack, or even Hiromui Arakawa’s global sensation Full Metal Alchemist, women have long been celebrated and embraced by comic fans.\nTo call the movement racist is also in poor taste, as people of color are represented heavily in the movement. Race has also been a non-factor in comics for some time, with creators like Christopher Priest who is currently producing a fantastic run on DC’s Deathstroke, Image Co-Founder and current DC Comics Co-Publisher Jim Lee, and long-time The Amazing Spider-Man artist Humberto Ramos enjoying long and celebrated runs and careers. If the goal of the movement is as intolerant as Sienkiewicz believes, then creators such as the aforementioned would be denounced and lambasted by ComicsGate, rather than receiving the praise and support seen for these and many other non-white creators.\nIt’s just a matter of time before Comicsgate is bragging that they pick up their litter and denouncing DC as the Real Racists. Sooner or later, they will learn that Being the Good Guy and Moderation and Talking Sense to the Enemy are neither strategies nor tactics, get rabid, and begin to fall in with us. Because the comics-SJWs are NEVER going to stop attacking them and calling them names, no matter how much they cuck and appease and ritualistically denounce us.\n“So stop being awful ambassadors for the worst of our natures. Stop being brownshirts. Stop being goddamned ugly dicks. And to re-jigger an ugly phrase you sling at women, I’m instead going to channel it here in the spirit of my Aussie friends: Stop being such insufferable clueless cunts.\nThe medium didn’t call on you to be the best version of assholes you could be. Neither did we.\nKnock it off.\nEither step up. Or step off.\nWe, Comics, and The Audience- will be absolutley fine without you.\nAnd you won’t be missed one damned bit.”\nAbsolutely fine? Perhaps, if an annual 10 percent decline in sales can be redefined as “fine”. Eight more years of that and we’ll have the comics industry to ourselves. But to be clear, I’m not at all\nagainst\nComicsgate, I’m just amused by it. It’s harmless and largely irrelevant, but if it keeps the SJWs occupied while we overrun their flanks and baggage train, that suits me just fine.\nThat being said, after the\nAlt-Hero: Q\ncampaign begins and the incendiary\nAlt-Hero #4: The War in Paris\nis published, I don’t know how much longer the SJWs will be able to restrain themselves from going openly after us. Not once they see how we are finding success in directly assaulting their assumptions about Diversity and their sanctimonious equalitarian pieties, while Marvel and DC\nproceed headlong down the road to oblivion\n.\nOn Monday, Marvel announced that Riri Williams, the teenage super hero who took over the mantle of Iron Man in the wake of Civil War II, will debut in her own solo book this November. Riri Williams: Ironheart will feature several developments for the fledgling super hero: her first solo title, a brand new suit designed by Kevin Libranda, and the comic book debut of her writer Eve Ewing, whose announcement was met with a wave of backlash from the comic community.\nDespite her lack of comic book writing history, one may ask how she came to be hired by Marvel. The answer is one that has appalled fans and caused further criticism of Marvel’s editorial board: she was hired because she looked like Riri and started a petition. The currently supported reason Ewing’s name was put forth to write Ironheart is because of Ewing’s supportive fans began spreading a petition to hire her based on a series of tweets in which she expressed the desire to write the book. These tweets were also supported by “evidence” provided by Ewing, which included the fact that she looked like Riri and had a small collection of various graphic novels on her bookshelf.\nAnd yes, the Dark Lord laughed. You know, this just might be the right time to introduce a series about a billionaire in a high-tech suit with a pretty blonde consort.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-26T09:30:09+00:00"
}