{
  "url": "https://voxday.net/2018/08/12/darkstream-no-pardon-for-pedo-partiers/",
  "scraped_at": "2025-12-19T21:16:16.399394",
  "title": "Darkstream: no pardon for pedo-partiers",
  "date_display": "August 12, 2018",
  "date_iso": "2018-08-12T15:04:26+00:00",
  "date_from_url": "2018-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/rPlLjlwNX94\" width=\"512\"></iframe></div><p>From the transcript <a href=\"https://youtu.be/rPlLjlwNX94\">of the Darkstream</a>.</p><p>Lo and behold, we have discovered why  Disney acted with such alacrity in  firing James Gunn, the director of Guardians of the Galaxy, <i>Guardians of the Galaxy</i> 2, and he was supposed to be the  director for <i>Guardians of the Galaxy</i> 3. He’d already written the script, apparently, and then, after the  weaponized autists of the chans and  Mike Cernovich let everybody know what  was going on with James Gunn’s historic  tweets, Disney suddenly acted very very  quickly, very very uncharacteristically, and they fired the guy.</p><p>Now this is was  very unusual because Disney, in the past,  has actually brought in people who who  were convicted child molesters. There’s a  guy named Victor Salvia who had been  convicted of molesting a young man and  they actually hired him to make a film  called <i>Powder </i>and this was a big  controversy back, I don’t know, fifteen  years ago or something like that. Now we’d like  to think that Disney learned something  from this, but the reality is they haven’t learned anything, but they have apparently learned to stop digging the hole deeper. So  that’s what I think a lot of people both  in Hollywood and in the media didn’t  understand there.</p><p>You have cuckservatives like David French, you have the  always ludicrous  Benny Shapiro, you have these people  saying, “oh well you know he shouldn’t  have been fired for, you know, some  jokes.” And you saw that all over the the  left-wing internet media, “no, it’s just jokes, some old jokes, you know, the evil people, the Alt-Right  dug up old jokes.” The thing is, the  telling thing is, they didn’t actually  link to any of them. They didn’t quote  any of them, and the reason that they  couldn’t was because <a href=\"https://qdrop.pub/data/media/d9113738bf6c982eef606629c8a54c565a4e321b74dd97dda2fba59029ded1cc.jpg\">most of them were so bad</a>. Most of them were simply beyond  the pale, and not only that, the frequency  of them indicated what can only be  described as an unhealthy level of an  interest.</p><p>Now, I personally think that  it’s absolutely fine, in fact, I think  it’s an absolute imperative, to go ahead  and get guys like these deplatformed under any means necessary. You know  if you make a joke about Africans, if you  make a joke about the Holocaust, if you  make a joke about any of a  dozen or more different identity groups  or historical events, they will attempt to fire you on that  basis. If you joke about it, if you joke about something  they consider racist, then that proves  that you are a racist, a white  supremacist, a bigot, and a hater for all eternity, and therefore, in the words of Ben  Shapiro, you must be hunted down and and  destroyed and fired. Suddenly, when  someone is joking repeatedly about  molesting children, about harming and  raping children, they claim, “oh that’s funny, oh that’s great, you know, we’re all  just having fun here.”</p><p>How does that make  any sense at all?</p></div>",
  "content_text": "From the transcript\nof the Darkstream\n.\nLo and behold, we have discovered why  Disney acted with such alacrity in  firing James Gunn, the director of Guardians of the Galaxy,\nGuardians of the Galaxy\n2, and he was supposed to be the  director for\nGuardians of the Galaxy\n3. He’d already written the script, apparently, and then, after the  weaponized autists of the chans and  Mike Cernovich let everybody know what  was going on with James Gunn’s historic  tweets, Disney suddenly acted very very  quickly, very very uncharacteristically, and they fired the guy.\nNow this is was  very unusual because Disney, in the past,  has actually brought in people who who  were convicted child molesters. There’s a  guy named Victor Salvia who had been  convicted of molesting a young man and  they actually hired him to make a film  called\nPowder\nand this was a big  controversy back, I don’t know, fifteen  years ago or something like that. Now we’d like  to think that Disney learned something  from this, but the reality is they haven’t learned anything, but they have apparently learned to stop digging the hole deeper. So  that’s what I think a lot of people both  in Hollywood and in the media didn’t  understand there.\nYou have cuckservatives like David French, you have the  always ludicrous  Benny Shapiro, you have these people  saying, “oh well you know he shouldn’t  have been fired for, you know, some  jokes.” And you saw that all over the the  left-wing internet media, “no, it’s just jokes, some old jokes, you know, the evil people, the Alt-Right  dug up old jokes.” The thing is, the  telling thing is, they didn’t actually  link to any of them. They didn’t quote  any of them, and the reason that they  couldn’t was because\nmost of them were so bad\n. Most of them were simply beyond  the pale, and not only that, the frequency  of them indicated what can only be  described as an unhealthy level of an  interest.\nNow, I personally think that  it’s absolutely fine, in fact, I think  it’s an absolute imperative, to go ahead  and get guys like these deplatformed under any means necessary. You know  if you make a joke about Africans, if you  make a joke about the Holocaust, if you  make a joke about any of a  dozen or more different identity groups  or historical events, they will attempt to fire you on that  basis. If you joke about it, if you joke about something  they consider racist, then that proves  that you are a racist, a white  supremacist, a bigot, and a hater for all eternity, and therefore, in the words of Ben  Shapiro, you must be hunted down and and  destroyed and fired. Suddenly, when  someone is joking repeatedly about  molesting children, about harming and  raping children, they claim, “oh that’s funny, oh that’s great, you know, we’re all  just having fun here.”\nHow does that make  any sense at all?",
  "tags": [
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-12T14:04:26+00:00"
}