{
  "url": "https://voxday.net/2018/08/16/darkstream-two-strikes-against-stefan/",
  "scraped_at": "2025-12-19T21:17:00.489925",
  "title": "Darkstream: Two strikes against Stefan",
  "date_display": "August 16, 2018",
  "date_iso": "2018-08-16T15:00:11+00:00",
  "date_from_url": "2018-08-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/2t3-yA-W4Ck\" width=\"512\"></iframe></div><p>From the transcript <a href=\"https://youtu.be/2t3-yA-W4Ck\">of the Darkstream</a>:</p><p>What we have to understand is that if Pewdiepie is not important enough to the  platform providers,  nobody is. If Alex Jones is not important  enough to the platform providers, nobody  is, and that means we have to always be  ready to build the platform. We have to  build our own platforms, and now  maybe I made a mistake a couple years  ago  in focusing first on replacing Wikipedia. You know, I always have a strategic  perspective, maybe sometimes it’s  an excessively strategic perspective, but we chose to do Infogalactic  first because it was one of the more  challenging ones. Twitter, one of  these will pop up left right and  center. YouTube is difficult because of  the way that it’s run at such huge losses. Facebook, you know, we figured it’s  doable but a lot of people were also  attempting to do that</p><p>Now if you  look at Oneway, you can see how easy  it was for them to have a Twitter  functionality yeah there was Freez Peach there was all kinds of stuff, so with Infogalactic what was  important to us was making sure that  people had a non-SJW-controlled  information source and now we do. We  haven’t started really pushing it yet  because our functionality is not yet different, but the important thing is  you need to always be ready. The Darkstream is already on BitChute; most of the the archived videos  are already on BitChute, we only really  bothered with the last two months or so, you  know, that’s kind of when we found our  our groove as it were, but we’re ready.</p><p> If you’re  listening to this and you’re not  subscribed to <a href=\"https://www.bitchute.com/channel/darkstream/\">the BitChute Darkstream channel</a> I  would encourage you to do so, because we  don’t know how long YouTube is going to  permit me to stream. They might leave me  indefinitely, you know, I have a small  audience and it’s quite possible that  they’ve decided the press attention  that it would give me would actually be  worse than just letting me continue with  my three, six, ten  thousand whatever subscribers. It’s very  clear that they are primarily concerned about the  people with hundreds of thousands of  subscribers, for the most part, but this thought policing is not going to stop!</p><p>There  are some who are theorizing that this is  only taking place in preparation for the  midterm elections, and that once the  midterm elections are done and it’s not  possible for the big social media  influencers to affect the election in  any way that they’ll ease up and that  sort of thing, but the reality is that  they’re not going to ease up. Because  they’re going to be very disappointed  when the long-prophesied Blue Wave does  not arrive, when they realize that the  2018 elections indicate that Trump has  overperformed and is almost certain to  be reelected in 2020. I believe that we are  going to see the SJW-controlled Left go  completely berserk after their  disappointment from the 2018 midterms, and so this isn’t going to stop, and it’s  important – I stress again, it’s  important – for the Right to be thinking  actively in terms of building and  supporting infrastructure.</p></div>",
  "content_text": "From the transcript\nof the Darkstream\n:\nWhat we have to understand is that if Pewdiepie is not important enough to the  platform providers,  nobody is. If Alex Jones is not important  enough to the platform providers, nobody  is, and that means we have to always be  ready to build the platform. We have to  build our own platforms, and now  maybe I made a mistake a couple years  ago  in focusing first on replacing Wikipedia. You know, I always have a strategic  perspective, maybe sometimes it’s  an excessively strategic perspective, but we chose to do Infogalactic  first because it was one of the more  challenging ones. Twitter, one of  these will pop up left right and  center. YouTube is difficult because of  the way that it’s run at such huge losses. Facebook, you know, we figured it’s  doable but a lot of people were also  attempting to do that\nNow if you  look at Oneway, you can see how easy  it was for them to have a Twitter  functionality yeah there was Freez Peach there was all kinds of stuff, so with Infogalactic what was  important to us was making sure that  people had a non-SJW-controlled  information source and now we do. We  haven’t started really pushing it yet  because our functionality is not yet different, but the important thing is  you need to always be ready. The Darkstream is already on BitChute; most of the the archived videos  are already on BitChute, we only really  bothered with the last two months or so, you  know, that’s kind of when we found our  our groove as it were, but we’re ready.\nIf you’re  listening to this and you’re not  subscribed to\nthe BitChute Darkstream channel\nI  would encourage you to do so, because we  don’t know how long YouTube is going to  permit me to stream. They might leave me  indefinitely, you know, I have a small  audience and it’s quite possible that  they’ve decided the press attention  that it would give me would actually be  worse than just letting me continue with  my three, six, ten  thousand whatever subscribers. It’s very  clear that they are primarily concerned about the  people with hundreds of thousands of  subscribers, for the most part, but this thought policing is not going to stop!\nThere  are some who are theorizing that this is  only taking place in preparation for the  midterm elections, and that once the  midterm elections are done and it’s not  possible for the big social media  influencers to affect the election in  any way that they’ll ease up and that  sort of thing, but the reality is that  they’re not going to ease up. Because  they’re going to be very disappointed  when the long-prophesied Blue Wave does  not arrive, when they realize that the  2018 elections indicate that Trump has  overperformed and is almost certain to  be reelected in 2020. I believe that we are  going to see the SJW-controlled Left go  completely berserk after their  disappointment from the 2018 midterms, and so this isn’t going to stop, and it’s  important – I stress again, it’s  important – for the Right to be thinking  actively in terms of building and  supporting infrastructure.",
  "tags": [
    "#AltTech"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-16T14:00:11+00:00"
}