{
  "url": "https://voxday.net/2018/08/06/just-another-skull/",
  "scraped_at": "2025-12-19T21:15:20.753004",
  "title": "Just another skull",
  "date_display": "August 6, 2018",
  "date_iso": "2018-08-06T17:03:11+00:00",
  "date_from_url": "2018-08-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Scalzi laments that the Evil Legion of Evil has shown people across the Right that there is no information value in rhetoric and that <a href=\"https://web.archive.org/web/20180805221212/https://whatever.scalzi.com/\">SJWs exist solely for the skull-taking</a>:</p><blockquote><p>It’s really frustrating to me that more people don’t understand that racist/alt-right people have gamified their rhetoric; they’re not interested in discussion, they’re slapping down cards from a “Debate: The Gathering” stack, and the only goal is taking heads.</p><p>They gamify their rhetoric because essentially this shit is a low-stake game for them, whereas for other people it’s their actual lives. That’s an advantage they have. If they lose, they shuffle their cards and go on to the next thing. If others lose, their life takes a hit.</p><p>And because their rhetorical strategy is essentially card-based, actual knowledge of issues is unimportant and probably a hinderance. They don’t want or need to understand the issues that affect others, they just need you to play their game so they can win.</p><p>I don’t have time anymore to diddle about with children who think other people’s lives are some sort of turn-based game, especially when all they want is to hurt other people. And it bothers me more people, especially those with power, don’t understand this shit.</p><p>I’m not going to tell people not to engage with these chuckleheads. But don’t engage with them on their terms. Engage with them on your own. One, they hate that, and two, it exposes what they’re doing as a pointless, hateful exercise, and them as awful people.</p><p>In sum: Understand what these folks are doing. Refuse to play along. And if you choose, point out to others the hollowness of their game. Because their “game” is to hurt other people, and then go on to the next target. Their game is other people’s lives.</p></blockquote><p>The amusing thing about this is the complete lack of awareness McRapey shows regarding why we have no stakes in their game. We’ve already been disqualified. We’ve already been counted out. We’ve already been expelled. So we don’t give a quantum of a damn for their opinion, their rules, their careers, or their lives any more. We are coming after them, relentlessly, and it costs us absolutely nothing to do so. Indeed, we will profit by it.</p><p>We aren’t interested in discussion. We aren’t interested in debate. <i>And we know they aren’t either. </i>They never were.<i> </i>So now we seek only to expose them, to ruin them, and to take their sad little skulls as trophies. Metaphorically, of course. (whistles innocently, kicks a suspiciously round object out of view of the webcam)</p><p>It doesn’t matter how they engage with us. It doesn’t matter if they engage with us. We are winning and we are going to continue to win until they are no more. We’re not locked in here with them, <i>they are locked in here with us</i>. And the VFM are hungry.</p><p>UPDATE: RIP Whatever:</p><blockquote class=\"tr_bq\"><p>So, I don’t know if you know this, but next month will mark the 20th anniversary of the existence of Whatever. This is a fact that among other things is causing me both practical and existential reflection on what this place is, and what it means to me, and what is the best way to keep doing it moving forward, particularly in an age where “blogs” are not the center of online gravity that they used to be…. I’m not calling it an official hiatus mostly because I have enough going on that it doesn’t make sense to go away completely, but I also don’t want y’all to worry if you don’t see me posting a lot here between now and September.</p></blockquote><p><i>WE. ARE. AMUSED. </i>Everyone who remembers the old school blogosphere knows what this post means.</p></div>",
  "content_text": "John Scalzi laments that the Evil Legion of Evil has shown people across the Right that there is no information value in rhetoric and that\nSJWs exist solely for the skull-taking\n:\nIt’s really frustrating to me that more people don’t understand that racist/alt-right people have gamified their rhetoric; they’re not interested in discussion, they’re slapping down cards from a “Debate: The Gathering” stack, and the only goal is taking heads.\nThey gamify their rhetoric because essentially this shit is a low-stake game for them, whereas for other people it’s their actual lives. That’s an advantage they have. If they lose, they shuffle their cards and go on to the next thing. If others lose, their life takes a hit.\nAnd because their rhetorical strategy is essentially card-based, actual knowledge of issues is unimportant and probably a hinderance. They don’t want or need to understand the issues that affect others, they just need you to play their game so they can win.\nI don’t have time anymore to diddle about with children who think other people’s lives are some sort of turn-based game, especially when all they want is to hurt other people. And it bothers me more people, especially those with power, don’t understand this shit.\nI’m not going to tell people not to engage with these chuckleheads. But don’t engage with them on their terms. Engage with them on your own. One, they hate that, and two, it exposes what they’re doing as a pointless, hateful exercise, and them as awful people.\nIn sum: Understand what these folks are doing. Refuse to play along. And if you choose, point out to others the hollowness of their game. Because their “game” is to hurt other people, and then go on to the next target. Their game is other people’s lives.\nThe amusing thing about this is the complete lack of awareness McRapey shows regarding why we have no stakes in their game. We’ve already been disqualified. We’ve already been counted out. We’ve already been expelled. So we don’t give a quantum of a damn for their opinion, their rules, their careers, or their lives any more. We are coming after them, relentlessly, and it costs us absolutely nothing to do so. Indeed, we will profit by it.\nWe aren’t interested in discussion. We aren’t interested in debate.\nAnd we know they aren’t either.\nThey never were.\nSo now we seek only to expose them, to ruin them, and to take their sad little skulls as trophies. Metaphorically, of course. (whistles innocently, kicks a suspiciously round object out of view of the webcam)\nIt doesn’t matter how they engage with us. It doesn’t matter if they engage with us. We are winning and we are going to continue to win until they are no more. We’re not locked in here with them,\nthey are locked in here with us\n. And the VFM are hungry.\nUPDATE: RIP Whatever:\nSo, I don’t know if you know this, but next month will mark the 20th anniversary of the existence of Whatever. This is a fact that among other things is causing me both practical and existential reflection on what this place is, and what it means to me, and what is the best way to keep doing it moving forward, particularly in an age where “blogs” are not the center of online gravity that they used to be…. I’m not calling it an official hiatus mostly because I have enough going on that it doesn’t make sense to go away completely, but I also don’t want y’all to worry if you don’t see me posting a lot here between now and September.\nWE. ARE. AMUSED.\nEveryone who remembers the old school blogosphere knows what this post means.",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-06T16:03:11+00:00"
}