{
  "url": "https://voxday.net/2018/08/23/mailvox-a-very-cringeworthy-video/",
  "scraped_at": "2025-12-19T21:17:52.316829",
  "title": "Mailvox: “a very cringeworthy video”",
  "date_display": "August 23, 2018",
  "date_iso": "2018-08-23T00:05:07+00:00",
  "date_from_url": "2018-08-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>This reaction to <a href=\"https://www.youtube.com/watch?v=O7u3Lu-kzgg\">the recent Voxiversity video</a> is a beautiful example of its kind. It really has to be read in full to be appreciated. Thanks to the more than 500 comments on the video, it has become abundantly clear that Jordan Peterson is little more than a short-term philosophical drug for life’s losers that makes them feel a little better about themselves for a while; they respond to criticism of him rather like a crackhead being denied a desperately-needed hit.</i><br> <span style=\"white-space: pre;\"> </span><br><b>Largesse1000</b><br>This is a very cringeworthy video. The editing is quite shocking, and totally distracts from any points you choose to make. Yes, some of his many fans are deluded and seeking leadership, and he is frequently obscure, however, he has more than proved himself worthy of his current position. It is simply not true to say his elevation has been born through adulation. He has been made in opposition to great criticism. A lesser person, you for instance, would have crumpled after a few months. He has balls. That’s the first thing. Next, for his simple referencing of Solzenhitsyn, Frankl and Dostoevsky to a new generation he is to be greatly commended. No, Aristotle and other greats are not mentioned, so fucking what? He was not writing a treatise on Western thought, just a string of ideas. Finally, his central message is very simple, namely life is hard if you live it and suffering is always present. This is a core idea of Christianity and Buddhism and exists because it is true. This is liberating to many who have been told that perfection is a goal, happiness is achievable and self worth is defined by how many bucket list items you tick off. He has simply reinstated a core experience of life and articulated in a way that people can understand. It has transformed people’s lives, whether you find him phoney or not. No one has managed to do this for about 70 years, no one. Therapists, gurus, and even traditions religion has failed in this, and it took an obscure professor from Canada to do this. You have been accused of jealously, and that accusation stands. The hatchet job here is quite pathetic, since you just pick away at trivia. I have stated clear arguments above, which demonstrate very simply that he has done a good thing, by introducing just a few core ideas (complexity of life, suffering, personal responsibility and the importance of the individual to the West). To criticise this is pure madness, and articulate as you are, your words are completely hollow. I suggest, without respect, you shut the fuck up, or actually comment on the positive contributions of this man over the last three years. I will now watch your channel and comment increasingly if I deem it fit. Some may read my thoughts. Some of us are sick of opinionated little clever shits, who do fuck all in the real world while assuming some sort of superiority in the digital. Ultimately it has no meaning. Peterson has let it all hang out, he has demonstrated integrity and seeks the good. He is not perfect, will be ephemeral, and will be followed by some sheep. However, give the man his due. You are jealous, and it is a very unpleasant character trait. I gained nothing from this video, accept the urge to come around your house and smash your fucking PC up. Now be a good chap, go and have a wank and take your hot chocolate.</br></br></br></p></div>",
  "content_text": "This reaction to\nthe recent Voxiversity video\nis a beautiful example of its kind. It really has to be read in full to be appreciated. Thanks to the more than 500 comments on the video, it has become abundantly clear that Jordan Peterson is little more than a short-term philosophical drug for life’s losers that makes them feel a little better about themselves for a while; they respond to criticism of him rather like a crackhead being denied a desperately-needed hit.\nLargesse1000\nThis is a very cringeworthy video. The editing is quite shocking, and totally distracts from any points you choose to make. Yes, some of his many fans are deluded and seeking leadership, and he is frequently obscure, however, he has more than proved himself worthy of his current position. It is simply not true to say his elevation has been born through adulation. He has been made in opposition to great criticism. A lesser person, you for instance, would have crumpled after a few months. He has balls. That’s the first thing. Next, for his simple referencing of Solzenhitsyn, Frankl and Dostoevsky to a new generation he is to be greatly commended. No, Aristotle and other greats are not mentioned, so fucking what? He was not writing a treatise on Western thought, just a string of ideas. Finally, his central message is very simple, namely life is hard if you live it and suffering is always present. This is a core idea of Christianity and Buddhism and exists because it is true. This is liberating to many who have been told that perfection is a goal, happiness is achievable and self worth is defined by how many bucket list items you tick off. He has simply reinstated a core experience of life and articulated in a way that people can understand. It has transformed people’s lives, whether you find him phoney or not. No one has managed to do this for about 70 years, no one. Therapists, gurus, and even traditions religion has failed in this, and it took an obscure professor from Canada to do this. You have been accused of jealously, and that accusation stands. The hatchet job here is quite pathetic, since you just pick away at trivia. I have stated clear arguments above, which demonstrate very simply that he has done a good thing, by introducing just a few core ideas (complexity of life, suffering, personal responsibility and the importance of the individual to the West). To criticise this is pure madness, and articulate as you are, your words are completely hollow. I suggest, without respect, you shut the fuck up, or actually comment on the positive contributions of this man over the last three years. I will now watch your channel and comment increasingly if I deem it fit. Some may read my thoughts. Some of us are sick of opinionated little clever shits, who do fuck all in the real world while assuming some sort of superiority in the digital. Ultimately it has no meaning. Peterson has let it all hang out, he has demonstrated integrity and seeks the good. He is not perfect, will be ephemeral, and will be followed by some sheep. However, give the man his due. You are jealous, and it is a very unpleasant character trait. I gained nothing from this video, accept the urge to come around your house and smash your fucking PC up. Now be a good chap, go and have a wank and take your hot chocolate.",
  "tags": [
    "Voxiversity"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-22T23:05:07+00:00"
}