{
  "url": "https://voxday.net/2018/08/18/mailvox-youre-not-listening/",
  "scraped_at": "2025-12-19T21:17:20.601232",
  "title": "Mailvox: you’re not LISTENING",
  "date_display": "August 18, 2018",
  "date_iso": "2018-08-18T19:09:43+00:00",
  "date_from_url": "2018-08-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A few days ago, despite my constant refrain of how to deal with the media, I received an email from someone asking if he should talk to the big media organization that wanted to ask him some questions, that wanted to let him give his side of the story. I can’t help but notice that in the entire written history of the mainstream media, no reporter has ever asked anyone to answer questions in order to publicly sacrifice his name and reputation to the reporter’s editor’s preconceived narrative.</p><p>My response to him was about what you’d expect: <i>“What part of never talk to the media do you not understand?”</i> There are no exceptions for special clever boys. There are no exceptions for narcissists, drama queens, or attention seekers. There are no exceptions.</p><p>However, in retrospect, I think I could have provided him with wiser and more effective counsel, which I shall share with all of you in case you find yourselves in similar circumstances someday. When an interview is requested by a mainstream journalist, or a reporter wants to talk to you in order to get your side of the story, just respond to him – or her – as follows:</p><p><i>“I don’t talk to enemies of the people.”</i></p><p>That’s it. Nothing more and nothing less. Don’t respond to the subsequent denials, protestations, assurances, accusations, and demands.</p><p><i>“I don’t talk to enemies of the people.”</i> Drop the mic and walk away, mission accomplished.</p></div>",
  "content_text": "A few days ago, despite my constant refrain of how to deal with the media, I received an email from someone asking if he should talk to the big media organization that wanted to ask him some questions, that wanted to let him give his side of the story. I can’t help but notice that in the entire written history of the mainstream media, no reporter has ever asked anyone to answer questions in order to publicly sacrifice his name and reputation to the reporter’s editor’s preconceived narrative.\nMy response to him was about what you’d expect:\n“What part of never talk to the media do you not understand?”\nThere are no exceptions for special clever boys. There are no exceptions for narcissists, drama queens, or attention seekers. There are no exceptions.\nHowever, in retrospect, I think I could have provided him with wiser and more effective counsel, which I shall share with all of you in case you find yourselves in similar circumstances someday. When an interview is requested by a mainstream journalist, or a reporter wants to talk to you in order to get your side of the story, just respond to him – or her – as follows:\n“I don’t talk to enemies of the people.”\nThat’s it. Nothing more and nothing less. Don’t respond to the subsequent denials, protestations, assurances, accusations, and demands.\n“I don’t talk to enemies of the people.”\nDrop the mic and walk away, mission accomplished.",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-18T18:09:43+00:00"
}