{
  "url": "https://voxday.net/2018/08/27/mailvox-the-archetypal-forked-tongue/",
  "scraped_at": "2025-12-19T21:18:29.028111",
  "title": "Mailvox: the archetypal forked tongue",
  "date_display": "August 27, 2018",
  "date_iso": "2018-08-27T11:35:35+00:00",
  "date_from_url": "2018-08-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Voxiversity viewer shares his initial skepticism about Jordanetics:</p><blockquote><p>I’ll tell you the point when I started having doubts about Jordan Peterson. You may remember that Jordan Peterson went out of his way at one point praising Milo and saying how he embodies an archetypal trickster persona. It was quite a passionate and interesting analysis. Fast forward a year or so and Jordan Peterson is talking with some twat from the New York Times who pronounces Milo a “racist.” Now, that is obviously not true when you consider the fact that Milo’s husband is black! And Jordan Peterson KNOWS that Milo is not a racist. Suddenly he starts to denounce Milo and nod his head in agreement with the suggestion that Milo is a “racist.” WTF??</p><p>So I guess Jordan Peterson can’t stand up for someone who is being maligned by some twat from the New York Times. Meanwhile, he spent the whole talk discussing the important of “not telling little lies.”</p></blockquote><p>Jordan Peterson knows perfectly well which side he’s on and it’s not the side of the Beautiful, the Good, and the True. It’s a pity that so few of the conservatives that he has successfully bamboozled with his bafflegarble do.</p><p>It’s fascinating to see that there have already been more than 800 comments on <a href=\"https://www.youtube.com/watch?v=O7u3Lu-kzgg\">the most recent Voxiversity video</a> and more downvotes for it than there hitherto have been for all the Voxiversity and the Darkstream videos combined. Based on the number of comments like the one above, we could do at least four more videos tearing apart the fraud that is Peterson and never repeat ourselves once. The hysterical reaction of his fans and the variety of inept ways they attempt to disqualify the video clearly indicates that they know, on some level, that the leader of their little cult is eventually going to be exposed as a charlatan.</p><blockquote class=\"tr_bq\"><p>I don’t care if you agree with him or not, for a man who never tries to attack someone’s character, the editing and insulting takes down any real argument you have, regardless of religion being flat out baseless and without logic, when it comes to god isn’t it the Christian way to let people believe in what they believe in their own way, or do you need to be as authoritarian as possible, and before you call me some leftist soy boy or cuckservative I’m a centrist, with a long history of reading about the idea of religion and god, and while I don’t agree with everything Peterson says, he conducts himself with remarkable civility, try to learn about that﻿.</p></blockquote><p>It’s always fascinating to see a rhetoric-speaker utilize pseudo-rhetoric in an attempt to disqualify dialectic. How could one’s decorative rhetoric, however vicious, possibly have <i>any effect whatsoever</i> on the underlying logical syllogisms? And it never ceases to amaze me how little Jordan Peterson’s fans actually know about what he believes, says, writes, and does.</p></div>",
  "content_text": "A Voxiversity viewer shares his initial skepticism about Jordanetics:\nI’ll tell you the point when I started having doubts about Jordan Peterson. You may remember that Jordan Peterson went out of his way at one point praising Milo and saying how he embodies an archetypal trickster persona. It was quite a passionate and interesting analysis. Fast forward a year or so and Jordan Peterson is talking with some twat from the New York Times who pronounces Milo a “racist.” Now, that is obviously not true when you consider the fact that Milo’s husband is black! And Jordan Peterson KNOWS that Milo is not a racist. Suddenly he starts to denounce Milo and nod his head in agreement with the suggestion that Milo is a “racist.” WTF??\nSo I guess Jordan Peterson can’t stand up for someone who is being maligned by some twat from the New York Times. Meanwhile, he spent the whole talk discussing the important of “not telling little lies.”\nJordan Peterson knows perfectly well which side he’s on and it’s not the side of the Beautiful, the Good, and the True. It’s a pity that so few of the conservatives that he has successfully bamboozled with his bafflegarble do.\nIt’s fascinating to see that there have already been more than 800 comments on\nthe most recent Voxiversity video\nand more downvotes for it than there hitherto have been for all the Voxiversity and the Darkstream videos combined. Based on the number of comments like the one above, we could do at least four more videos tearing apart the fraud that is Peterson and never repeat ourselves once. The hysterical reaction of his fans and the variety of inept ways they attempt to disqualify the video clearly indicates that they know, on some level, that the leader of their little cult is eventually going to be exposed as a charlatan.\nI don’t care if you agree with him or not, for a man who never tries to attack someone’s character, the editing and insulting takes down any real argument you have, regardless of religion being flat out baseless and without logic, when it comes to god isn’t it the Christian way to let people believe in what they believe in their own way, or do you need to be as authoritarian as possible, and before you call me some leftist soy boy or cuckservative I’m a centrist, with a long history of reading about the idea of religion and god, and while I don’t agree with everything Peterson says, he conducts himself with remarkable civility, try to learn about that﻿.\nIt’s always fascinating to see a rhetoric-speaker utilize pseudo-rhetoric in an attempt to disqualify dialectic. How could one’s decorative rhetoric, however vicious, possibly have\nany effect whatsoever\non the underlying logical syllogisms? And it never ceases to amaze me how little Jordan Peterson’s fans actually know about what he believes, says, writes, and does.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-27T10:35:35+00:00"
}