{
  "url": "https://voxday.net/2018/08/24/mailvox-the-inutility-of-self-help/",
  "scraped_at": "2025-12-19T21:18:05.142219",
  "title": "Mailvox: the inutility of self-help",
  "date_display": "August 24, 2018",
  "date_iso": "2018-08-24T15:00:13+00:00",
  "date_from_url": "2018-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I mentioned <a href=\"https://www.youtube.com/watch?v=IgxGKYtqKAY\">in the recent Darkstream</a> how dubious I am of both self-help books and therapy, prompting this perceptive comment.</p><blockquote class=\"tr_bq\"><p>So true! I used to visit with a young man whom I’d see off and on. He was always scarfing up the self-help books. He was in his late 20’s, but lived with his parents, didn’t even own a car, had to use his brother’s truck. His parents even paid for him to attend a self-help conference somewhere for a week and he would propound on the ideas ad infinitum if you’d let him, but he never became self-sustaining or able to support himself to this day. I saw him a couple of weeks ago at a bus stop and gave him a ride and he is still at it. </p></blockquote><p>Talk-talk may be better than war-war, but it is no substitute for act-act. The thing is, if you stop and think about it, there is absolutely no reason that therapy or self-help books <i>should </i>make any difference whatsoever to the average individual, given what we know about the inability of information to transform the rhetorical mind.</p><p>From <a href=\"https://www.youtube.com/watch?v=IgxGKYtqKAY\">the transcript</a>:</p><p>I’m not into self-help stuff. I have  resolutely ignored all self-help stuff  dating back to the days of Tony Robinson. I frankly regard them as being, by  and large, scams. I think that  if you’re going to help yourself, it’s  probably not going to come in the form  of a book, it’s probably not going to  come in the form of a television show or  a series of video lectures. Now I  understand that that people <i>feel </i>that  they are helped through reading these  books, that they <i>feel </i>that they are  improving their lives by seeing  therapists and all these sort of things, but one thing I’ve noticed about people  who go to therapists and people who read  self-help books is that they never seem  to get better.</p><p>By which I mean, once somebody starts going to a  therapist they never seem to stop. When  they start reading self-help books, if  you see the kind of person who buys  self-help books, what you tend to notice if you’re at their house, or if  you’re at their apartment, is that they  have a library <i>full</i> of self-help books. This is why I’ve  always been intrinsically dubious of of  people who rely upon  this kind of stuff, and these kind of  people, and you know, when I see people  who actually improve their lives, they  tend to go to the gym. I’ve seen  many, many people start off as skinny little guys with  spaghetti noodle arms who have  no confidence and get no attention from  anyone, and seen them transform  themselves over the period of two or  three years. It’s always  kind of fun to see these  guys come in, and they’re not  really in shape, they’re very out  of shape, they’re very lacking in self-confidence  and that sort of thing, and then you see them improve over time.</p><p>And then one day you see them walk in, and they’re there with their  girlfriend who is moderately  attractive. and you know that  their life has improved. Somebody just said, “I really think  most people use those self-help books to  distract themselves from their real  problems and to avoid making real  changes.” I think that is true.</p></div>",
  "content_text": "I mentioned\nin the recent Darkstream\nhow dubious I am of both self-help books and therapy, prompting this perceptive comment.\nSo true! I used to visit with a young man whom I’d see off and on. He was always scarfing up the self-help books. He was in his late 20’s, but lived with his parents, didn’t even own a car, had to use his brother’s truck. His parents even paid for him to attend a self-help conference somewhere for a week and he would propound on the ideas ad infinitum if you’d let him, but he never became self-sustaining or able to support himself to this day. I saw him a couple of weeks ago at a bus stop and gave him a ride and he is still at it.\nTalk-talk may be better than war-war, but it is no substitute for act-act. The thing is, if you stop and think about it, there is absolutely no reason that therapy or self-help books\nshould\nmake any difference whatsoever to the average individual, given what we know about the inability of information to transform the rhetorical mind.\nFrom\nthe transcript\n:\nI’m not into self-help stuff. I have  resolutely ignored all self-help stuff  dating back to the days of Tony Robinson. I frankly regard them as being, by  and large, scams. I think that  if you’re going to help yourself, it’s  probably not going to come in the form  of a book, it’s probably not going to  come in the form of a television show or  a series of video lectures. Now I  understand that that people\nfeel\nthat  they are helped through reading these  books, that they\nfeel\nthat they are  improving their lives by seeing  therapists and all these sort of things, but one thing I’ve noticed about people  who go to therapists and people who read  self-help books is that they never seem  to get better.\nBy which I mean, once somebody starts going to a  therapist they never seem to stop. When  they start reading self-help books, if  you see the kind of person who buys  self-help books, what you tend to notice if you’re at their house, or if  you’re at their apartment, is that they  have a library\nfull\nof self-help books. This is why I’ve  always been intrinsically dubious of of  people who rely upon  this kind of stuff, and these kind of  people, and you know, when I see people  who actually improve their lives, they  tend to go to the gym. I’ve seen  many, many people start off as skinny little guys with  spaghetti noodle arms who have  no confidence and get no attention from  anyone, and seen them transform  themselves over the period of two or  three years. It’s always  kind of fun to see these  guys come in, and they’re not  really in shape, they’re very out  of shape, they’re very lacking in self-confidence  and that sort of thing, and then you see them improve over time.\nAnd then one day you see them walk in, and they’re there with their  girlfriend who is moderately  attractive. and you know that  their life has improved. Somebody just said, “I really think  most people use those self-help books to  distract themselves from their real  problems and to avoid making real  changes.” I think that is true.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-24T14:00:13+00:00"
}