{
  "url": "https://voxday.net/2018/08/22/men-are-not-intimidated/",
  "scraped_at": "2025-12-19T21:17:46.444517",
  "title": "Men are not intimidated",
  "date_display": "August 22, 2018",
  "date_iso": "2018-08-22T10:09:27+00:00",
  "date_from_url": "2018-08-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I never bought into the “men reject me because they are intimidated by my awesome wonderfulness” line to which so many feminist old maids resort. And if a recent study is to be believed, it turns out that when smart, highly educated women are being rejected en masse by men, it’s not their intimidating intelligence that is the problem. In fact, when they blame men for being intimidated by intelligence, it turns out that <a href=\"http://www.dailymail.co.uk/sciencetech/article-6085003/Women-dont-want-clever-partner-men-exceptionally-handsome.html\">they’re probably just projecting</a> their own feelings onto their male counterparts.</p><blockquote><p>A study by researchers at the University of Western Australia found that women did not want exceptionally clever or handsome men. But the same did not hold true for men – who are not put off by extreme levels of intelligence or good looks, they found.</p><p>Researchers asked hundreds of people what they found attractive in a potential romantic partner. Participants rated four qualities – good looks, cleverness, kindness and being easy-going.</p><p>They were asked to say how attracted they would be to potential partners who were, for example, kinder than 1 per cent of the population. They were then asked the same for 10 per cent, 25 per cent, 50 per cent, 75 per cent, 90 per cent and 99 per cent of the population. For each percentage, participants rated the partners on a six-point scale from ‘extremely unattracted’ to ‘extremely attracted’.</p><p>The results showed that the more the quality was present, the more attractive the person was as a partner – most of the time. But for females, partners lost their appeal at the top of the scale for some traits.</p><p>Women said a partner would be more attractive if they were more intelligent than 90 per cent of the population. However, attractiveness decreased if the person was more intelligent than 99 per cent of the population. The same drop-off was seen for physical attractiveness and being easy-going, according to the findings published in the <i>British Journal of Psychology</i>.</p></blockquote><p>Being in the top one percent of intelligence myself, and having been friends with a male Calvin Klein model, I can attest that as far as women are concerned, there can definitely be too much of a good thing. I remember one very attractive girl who was – to my point of view, inexplicably – focusing her attention on me rather on than my much better-looking friend explaining that she wanted to be the pretty one in the relationship.</p><p>This may help explain why so many very handsome men wind up with women who are relatively plain by comparison, although the fact that very good-looking men tend to be lazy and prefer being pursued by moderately attractive women to exerting any effort competing for their beauty peers also plays a role. And actually, if they are at a disadvantage, that laziness is probably justified. I found it interesting that my model friend usually dated girls who were not all that pretty and wound up marrying a woman who is cute, but not particularly striking.</p><p>The thing about intelligence is that it’s very hard to ascertain by those who aren’t within a standard deviation or so. Most people can’t do much better than “pretty sure he is smarter than me” and midwits can’t even manage that. So, men with IQs over 137 will only tend to disattract women whose IQs are above 130 or so, which is not even two percent of the female population.</p></div>",
  "content_text": "I never bought into the “men reject me because they are intimidated by my awesome wonderfulness” line to which so many feminist old maids resort. And if a recent study is to be believed, it turns out that when smart, highly educated women are being rejected en masse by men, it’s not their intimidating intelligence that is the problem. In fact, when they blame men for being intimidated by intelligence, it turns out that\nthey’re probably just projecting\ntheir own feelings onto their male counterparts.\nA study by researchers at the University of Western Australia found that women did not want exceptionally clever or handsome men. But the same did not hold true for men – who are not put off by extreme levels of intelligence or good looks, they found.\nResearchers asked hundreds of people what they found attractive in a potential romantic partner. Participants rated four qualities – good looks, cleverness, kindness and being easy-going.\nThey were asked to say how attracted they would be to potential partners who were, for example, kinder than 1 per cent of the population. They were then asked the same for 10 per cent, 25 per cent, 50 per cent, 75 per cent, 90 per cent and 99 per cent of the population. For each percentage, participants rated the partners on a six-point scale from ‘extremely unattracted’ to ‘extremely attracted’.\nThe results showed that the more the quality was present, the more attractive the person was as a partner – most of the time. But for females, partners lost their appeal at the top of the scale for some traits.\nWomen said a partner would be more attractive if they were more intelligent than 90 per cent of the population. However, attractiveness decreased if the person was more intelligent than 99 per cent of the population. The same drop-off was seen for physical attractiveness and being easy-going, according to the findings published in the\nBritish Journal of Psychology\n.\nBeing in the top one percent of intelligence myself, and having been friends with a male Calvin Klein model, I can attest that as far as women are concerned, there can definitely be too much of a good thing. I remember one very attractive girl who was – to my point of view, inexplicably – focusing her attention on me rather on than my much better-looking friend explaining that she wanted to be the pretty one in the relationship.\nThis may help explain why so many very handsome men wind up with women who are relatively plain by comparison, although the fact that very good-looking men tend to be lazy and prefer being pursued by moderately attractive women to exerting any effort competing for their beauty peers also plays a role. And actually, if they are at a disadvantage, that laziness is probably justified. I found it interesting that my model friend usually dated girls who were not all that pretty and wound up marrying a woman who is cute, but not particularly striking.\nThe thing about intelligence is that it’s very hard to ascertain by those who aren’t within a standard deviation or so. Most people can’t do much better than “pretty sure he is smarter than me” and midwits can’t even manage that. So, men with IQs over 137 will only tend to disattract women whose IQs are above 130 or so, which is not even two percent of the female population.",
  "tags": [
    "AlphaGame"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-22T09:09:27+00:00"
}