{
  "url": "https://voxday.net/2018/08/25/not-even-close-to-done/",
  "scraped_at": "2025-12-19T21:18:10.670805",
  "title": "Not even close to done",
  "date_display": "August 25, 2018",
  "date_iso": "2018-08-25T13:14:45+00:00",
  "date_from_url": "2018-08-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So, I spent my 50th birthday on the soccer field. As it was our last practice before our first game, pretty much everyone was there and our captain was relentless. We played for nearly two hours, in the heat, with only two short water breaks of about 3-4 minutes each.</p><p>I’ve found that I hit the first level of fatigue now almost immediately. It creates a challenge because I hit it about 10-15 minutes before everyone else given that my teammates can be as much as 20 years younger. So, I’ve learned to play in energy conservation mode from the start, which helps me get past that initial period of danger without anyone being the wiser. I’m also diligent about taking my guy out of the play by positioning so his teammates don’t pass to him, and demoralizing him by demonstrating that he can’t get past me the first couple of times that he tries to make a run. A little energy expenditure early can save a lot for the rest of the game, because a guy who doesn’t believe he can get past you doesn’t even try. Plus it tends to make him wary of getting caught out of position when you make a run and drop back deeper into his own end.</p><p>On the positive side, once everyone is fully fatigued in the second half, I tend to have an advantage because I’m so much more accustomed to dealing with it. My side was down 6-4 when I beat the opposing wing down the side to earn a corner, took the corner kick, and our defensive midfielder scored on the header. Then, about two minutes later, we had another attack and I made a long run to anticipate following the shot. The opposing goalie saved it, but couldn’t hang onto it, and I put the rebound into the net. 6-6. I couldn’t help but laugh after that, because as we jogged back to our side, one of our midfielders pointed at me and shouted, “How old are you again? How old are you?”</p><p>Afterwards, Spacebunny showed up with caramel-chocolate brownies, chilled cava, and a single sad, warm beer. Never mind the latter, it’s a family joke. Not the most typical of birthday celebrations, but we all had a good time and it definitely beat the birthday at the fish farm decades ago.</p><p>At the game, I was pleased to discover that I’d managed to hold on to my starting spot on the left wing, although we got off to a bad start against the league’s best team, a team that hasn’t lost since we beat them three years ago, when they literally ping-ponged right through the center of our defense for an easy goal. But we didn’t quit; I got back in time to stuff a one-on-one with our keeper, then block a shot on a rebound, before making a long pass that led to a nice first goal from one of the center-mids. We got a second goal on a perfect free kick from our former captain, then I took myself out for one of the new guys.</p><p>I didn’t play as well in the second half, as we were under constant pressure, playing in a defensive shell against a much-superior technical team. Several of their guys still play for their club’s first team and they are very, <i>very </i>good. I did manage a few clearances, but also made two dangerous passes to the inside that could have gone badly wrong. We’re still a bit rusty, I think, because our attackers kept failing to pass the ball to the wings when we ran forward to support them, which was a real problem because every time they lost the ball, we found ourselves 30 meters out of position. Drives me crazy when they do that; if the wing comes forward on an open side, the attacker MUST pass him the ball in order to avoid giving a free side to the other team’s counterattack.</p><p>Anyhow, I put an awkward rebound shot over the goal after one of our attackers blew a pretty good opportunity, our best guy in the air missed a clean header on a corner, and we failed to put them away when we had the chance. The defending champions never gave up, and they managed to score the equalizer on a corner in the last minute after being awarded what felt like about 50 free kicks in the last 10 minutes. So, it finished 2-2, which was a really good result for us even though it felt disappointing given how we’d dominated the first half. It was certainly a better start to the season than I’d expected when I found out we’d be playing the three-time champions at their place to open it.</p></div>",
  "content_text": "So, I spent my 50th birthday on the soccer field. As it was our last practice before our first game, pretty much everyone was there and our captain was relentless. We played for nearly two hours, in the heat, with only two short water breaks of about 3-4 minutes each.\nI’ve found that I hit the first level of fatigue now almost immediately. It creates a challenge because I hit it about 10-15 minutes before everyone else given that my teammates can be as much as 20 years younger. So, I’ve learned to play in energy conservation mode from the start, which helps me get past that initial period of danger without anyone being the wiser. I’m also diligent about taking my guy out of the play by positioning so his teammates don’t pass to him, and demoralizing him by demonstrating that he can’t get past me the first couple of times that he tries to make a run. A little energy expenditure early can save a lot for the rest of the game, because a guy who doesn’t believe he can get past you doesn’t even try. Plus it tends to make him wary of getting caught out of position when you make a run and drop back deeper into his own end.\nOn the positive side, once everyone is fully fatigued in the second half, I tend to have an advantage because I’m so much more accustomed to dealing with it. My side was down 6-4 when I beat the opposing wing down the side to earn a corner, took the corner kick, and our defensive midfielder scored on the header. Then, about two minutes later, we had another attack and I made a long run to anticipate following the shot. The opposing goalie saved it, but couldn’t hang onto it, and I put the rebound into the net. 6-6. I couldn’t help but laugh after that, because as we jogged back to our side, one of our midfielders pointed at me and shouted, “How old are you again? How old are you?”\nAfterwards, Spacebunny showed up with caramel-chocolate brownies, chilled cava, and a single sad, warm beer. Never mind the latter, it’s a family joke. Not the most typical of birthday celebrations, but we all had a good time and it definitely beat the birthday at the fish farm decades ago.\nAt the game, I was pleased to discover that I’d managed to hold on to my starting spot on the left wing, although we got off to a bad start against the league’s best team, a team that hasn’t lost since we beat them three years ago, when they literally ping-ponged right through the center of our defense for an easy goal. But we didn’t quit; I got back in time to stuff a one-on-one with our keeper, then block a shot on a rebound, before making a long pass that led to a nice first goal from one of the center-mids. We got a second goal on a perfect free kick from our former captain, then I took myself out for one of the new guys.\nI didn’t play as well in the second half, as we were under constant pressure, playing in a defensive shell against a much-superior technical team. Several of their guys still play for their club’s first team and they are very,\nvery\ngood. I did manage a few clearances, but also made two dangerous passes to the inside that could have gone badly wrong. We’re still a bit rusty, I think, because our attackers kept failing to pass the ball to the wings when we ran forward to support them, which was a real problem because every time they lost the ball, we found ourselves 30 meters out of position. Drives me crazy when they do that; if the wing comes forward on an open side, the attacker MUST pass him the ball in order to avoid giving a free side to the other team’s counterattack.\nAnyhow, I put an awkward rebound shot over the goal after one of our attackers blew a pretty good opportunity, our best guy in the air missed a clean header on a corner, and we failed to put them away when we had the chance. The defending champions never gave up, and they managed to score the equalizer on a corner in the last minute after being awarded what felt like about 50 free kicks in the last 10 minutes. So, it finished 2-2, which was a really good result for us even though it felt disappointing given how we’d dominated the first half. It was certainly a better start to the season than I’d expected when I found out we’d be playing the three-time champions at their place to open it.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-25T12:14:45+00:00"
}