{
  "url": "https://voxday.net/2018/08/30/shut-up-wesley-they-explained/",
  "scraped_at": "2025-12-19T21:19:01.688231",
  "title": "Shut up, Wesley, they explained",
  "date_display": "August 30, 2018",
  "date_iso": "2018-08-30T17:14:02+00:00",
  "date_from_url": "2018-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Wil Wheaton <a href=\"https://archive.fo/Kb0YP#selection-457.0-1061.1\">finds himself banned</a> from Mastadon. Whatever that is. Apparently for insufficient diversity:</p><blockquote><p>Wil Wheaton isn’t here. @wilw@mastodon.cloud<br>I have been notified by an Admin here that they are getting 60 reports a day about my account. As far as I can tell, I’m not breaking any rules, and I’ve done my best to be a good person here. But this admin is going to suspend my account. It’s the Admin’s instance, so I fully support their choice to eliminate a source of frustration, but something to consider: a person who is doing nothing wrong can be run off one instance by a mob from another instance. That seems … not cool.</br></p><p>Wil Wheaton isn’t here. @wilw@mastodon.cloud<br>But it’s been made very, very clear to me that I am not welcome in the Fediverse, and I hear you. I hoped to find an alternative to the birdsite where I could find the same fun community that existed over there in the beginning, and it’s clear to me that I won’t be finding that. Before I leave, I want to just make something very clear, because I’ve spent most of my life being yelled at by people who don’t know me at all, and I want the record to be clear.</br></p><p>Wil Wheaton isn’t here. @wilw@mastodon.cloud<br>During GamerGate, I was dogpiled and mobbed and brigaded and attacked by thousands of accounts. I started using a blocklist that was supposed to help stop that. I did not know that the blocklist I signed up for also had a lot of trans women on it. When I found out, I did everything I could to remove those women from the list I shared. When there were still innocents on the list, I stopped sharing the list entirely. Despite this, a mob has decided that I’m anti-trans.</br></p><p>Wil Wheaton isn’t here. @wilw@mastodon.cloud<br>This lie that I am anti-trans, or anti-LGBQ, is deeply hurtful to me (I know it’s nothing like the pain LGBTQ people deal with every day, as they simply try to *exist* in a world that treats them so badly, but it is still hurtful in its own way to me). I just want to make it extremely clear: that is a lie, and the people spreading it are misinformed. So I’m leaving the Fediverse, which has treated me with more cruelty, vitriol, hatred, and contempt than than anyone on the birdsite ever did.</br></p><p>Wil Wheaton isn’t here. @wilw@mastodon.cloud<br>I know that I’m well-off, well-known, and as a CIS white hetro dude in America, I live life on the lowest difficulty setting. I know that I have very little to complain about.  But I still have feelings, and I really do care about the world and the people in it. What I see is a lot of anger and cruelty directed at the IDEA of me, from people who I just hope don’t realize that it really does hurt me, in my heart, to be accused of being someone I am not,  and to be the target of a hateful mob.</br></p><p>Wil Wheaton isn’t here. @wilw@mastodon.cloud<br>Anyway, take your victory lap and collect your prizes. You’ve made it clear that I’m not welcome here, and even though I disagree with the action this Admin is taking (banning me when I didn’t break any rules doesn’t seem right), I respect and support the Admin’s decision to run their instance the way they see fit. Please do your very best to be kind to each other. The world is a terrible place right now, and that’s largely because it is what we make it. Bye.</br></p></blockquote><p>Oh, the irony. <i>“Wil ditched Twitter because they wouldn’t ban Alex Jones.</i>” This is a microcosm of what is happening in the Democratic Party right now. It doesn’t matter how they abase themselves. It doesn’t matter if they pledge their lives and fortunes. It doesn’t matter if they are genuinely true believers. They are not Diversity and there is no place for them either any more than there is for those they called “Nazis” and “Neo-Nazis” and “white supremacists”.</p><p>Which, of course, is why the Alt-Right is inevitable.</p><p>The best part is that this happened because Wil Wheaton used Randi Harper’s anti-GamerGate blocklist.</p></div>",
  "content_text": "Wil Wheaton\nfinds himself banned\nfrom Mastadon. Whatever that is. Apparently for insufficient diversity:\nWil Wheaton isn’t here. @wilw@mastodon.cloud\nI have been notified by an Admin here that they are getting 60 reports a day about my account. As far as I can tell, I’m not breaking any rules, and I’ve done my best to be a good person here. But this admin is going to suspend my account. It’s the Admin’s instance, so I fully support their choice to eliminate a source of frustration, but something to consider: a person who is doing nothing wrong can be run off one instance by a mob from another instance. That seems … not cool.\nWil Wheaton isn’t here. @wilw@mastodon.cloud\nBut it’s been made very, very clear to me that I am not welcome in the Fediverse, and I hear you. I hoped to find an alternative to the birdsite where I could find the same fun community that existed over there in the beginning, and it’s clear to me that I won’t be finding that. Before I leave, I want to just make something very clear, because I’ve spent most of my life being yelled at by people who don’t know me at all, and I want the record to be clear.\nWil Wheaton isn’t here. @wilw@mastodon.cloud\nDuring GamerGate, I was dogpiled and mobbed and brigaded and attacked by thousands of accounts. I started using a blocklist that was supposed to help stop that. I did not know that the blocklist I signed up for also had a lot of trans women on it. When I found out, I did everything I could to remove those women from the list I shared. When there were still innocents on the list, I stopped sharing the list entirely. Despite this, a mob has decided that I’m anti-trans.\nWil Wheaton isn’t here. @wilw@mastodon.cloud\nThis lie that I am anti-trans, or anti-LGBQ, is deeply hurtful to me (I know it’s nothing like the pain LGBTQ people deal with every day, as they simply try to *exist* in a world that treats them so badly, but it is still hurtful in its own way to me). I just want to make it extremely clear: that is a lie, and the people spreading it are misinformed. So I’m leaving the Fediverse, which has treated me with more cruelty, vitriol, hatred, and contempt than than anyone on the birdsite ever did.\nWil Wheaton isn’t here. @wilw@mastodon.cloud\nI know that I’m well-off, well-known, and as a CIS white hetro dude in America, I live life on the lowest difficulty setting. I know that I have very little to complain about.  But I still have feelings, and I really do care about the world and the people in it. What I see is a lot of anger and cruelty directed at the IDEA of me, from people who I just hope don’t realize that it really does hurt me, in my heart, to be accused of being someone I am not,  and to be the target of a hateful mob.\nWil Wheaton isn’t here. @wilw@mastodon.cloud\nAnyway, take your victory lap and collect your prizes. You’ve made it clear that I’m not welcome here, and even though I disagree with the action this Admin is taking (banning me when I didn’t break any rules doesn’t seem right), I respect and support the Admin’s decision to run their instance the way they see fit. Please do your very best to be kind to each other. The world is a terrible place right now, and that’s largely because it is what we make it. Bye.\nOh, the irony.\n“Wil ditched Twitter because they wouldn’t ban Alex Jones.\n” This is a microcosm of what is happening in the Democratic Party right now. It doesn’t matter how they abase themselves. It doesn’t matter if they pledge their lives and fortunes. It doesn’t matter if they are genuinely true believers. They are not Diversity and there is no place for them either any more than there is for those they called “Nazis” and “Neo-Nazis” and “white supremacists”.\nWhich, of course, is why the Alt-Right is inevitable.\nThe best part is that this happened because Wil Wheaton used Randi Harper’s anti-GamerGate blocklist.",
  "tags": [
    "#GamerGate"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-30T16:14:02+00:00"
}