{
  "url": "https://voxday.net/2018/08/22/the-crazy-christs-cultists-are-unhappy/",
  "scraped_at": "2025-12-19T21:17:50.476073",
  "title": "The Crazy Christ’s cultists are unhappy",
  "date_display": "August 22, 2018",
  "date_iso": "2018-08-22T15:32:28+00:00",
  "date_from_url": "2018-08-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In less than 24 hours, there have already been over ten thousand views of <a href=\"https://www.youtube.com/watch?v=O7u3Lu-kzgg\">the latest Voxiversity video</a>. One early commenter correctly anticipated the calm and measured response of Jordan Peterson’s fans to it.</p><p><b>David. D</b><br><i>Great video Vox, now let’s wait for all the Peterson fanboys to tell us how jealous and bitter you are, without providing any good arguments to refute what you defend in the video.﻿</i></br></p><p>He was not disappointed. Nor was he incorrect about their near-complete inability to even begin dealing with the substantive issues raised about Peterson’s lack of courage, character, and intellectual integrity. A representative collection of their comments follows the break:</p><p><a name=\"more\"></a></p><p><b>Andris Falks</b><br>Cheap ad hominum attacks on people who have done in few years more to help wide variety of people then you will in your entire life is the low of your life Vox. Nobody is perfect, nobody can know everything that is written, what matters are results and JBP has some amazing results – he has helped possibly MILLIONS of people to get out of nihilism, postmodernism and find at least some resemblance of meaning in life. It seems to me you are in fact envious of JBP and feel deeply unappreciated in comparison to him. And trust me, there are many reasons for that and no cheap ad hominum attack videos will help you.﻿</br></p><p><b>Tigerairlines</b><br>I don’t care if you agree with him or not, for a man who never tries to attack someone’s character, the editing and insulting takes down any real argument you have, regardless of religion being flat out baseless and without logic, when it comes to god isn’t it the Christian way to let people believe in what they believe in their own way, or do you need to be as authoritarian as possible, and before you call me some leftist soy boy or cuckservative I’m a centrist, with a long history of reading about the idea of religion and god, and while I don’t agree with everything Peterson says, he conducts himself with remarkable civility, try to learn about that﻿.</br></p><p><b>ATurquoise Bolo</b><br>I don’t really agree with you here.  I don’t think you’ve actually listened to him on his purpose or intentions.   It would be like me saying this video is disingenuous on the basis that you’re jealous of his success and the ear he’s gained of the general public.  He’s trying to teach people to think for themselves and doesn’t encourage blind faith in what he’s said and what he thinks.  Honestly he’s the first psychologist I’ve found any helpful advice from when I watched his lectures prior to his incredible fame.  His goal is really to come up with an alternative to the corrupt universities.  I don’t think he’s ever said anything about not being a nationalist, and he literally stood up against infringement on freedom of speech, and he talks about the errors of Marxism and how he took the perspective of Orwell on them when he met more than just the leaders as a young man.  He wants to help people who genuinely need it, and he doesn’t want people to try to change the world without having an actual goal and the ability to manage their own lives.  He’s trying to get rid of mindless activists and mindless Marxists.  I’ve read his books, I’ve enjoyed them, and whether you understand it or not, my generation didn’t get the why of certain behaviors let alone the how.  Perhaps you’ve been out of the United States education system too long.  Whatever you may say, you didn’t give him a fair shake and it appears it’s only motivated by your need for a 100{de0369dfe3e4b53b642ec4c59899fbdd53f4c1f0d4d3d5766811416432dc2910} Christian who also wants to organize a fight against globalism.  Ironically, he agrees with you on Christianity being integral to western victimization and appears to want people to act as if God is real.  Believe it or not, that’s why I’m a Christian: because it is psychologically and empirically more beneficial to both myself and my family.  Believe it or not, that journey has been traveled by many before and after they listened to Peterson.  If you don’t like him justifying common sense through evidence and reason in his book then just read his essay on writing an essay and you might grasp some of the reasons he’s lecturing and touring.  But telling people that he’s like Soros simply because he’s taking his message international and asking people to think for themselves first and foremost is reprehensible and shows that you’re catering to an audience unwilling to hear anyone out after they’ve been ” discredited” by you.  If you watch his class lectures you’ll see him do exactly the same thing while communicating with his students, yet his years of lectures also communicate the same message, slightly changing over time to respond to current events.  Is it because you aren’t as smart or is it because your ideology doesn’t allow you to move and respond outside of a framework?  But more importantly, do you fail to understand the one flaw in his efforts that I agree with his lefty detractors on?  His ideas can be used for nationalism if it becomes a necessity.  He tells people to do what they can to improve their home, their community, their state, their country.  How does that stop them from being nationalist, and even identitarian in the end?  It doesn’t, it just tells them how to be better at it, and more thoughtful in their aims.﻿</br></p><p> <b>w reed</b><br>Pathetic attempt to spear Dr. Peterson. Sure he is a bit old school but at least he is honest. You sir are not honest and you know it!</br></p><p><b>TheHarperbow</b><br>Let me guess, your actually just upset he doesn’t believe in your dogmatic Christian beliefs? Therefore, he’s deserving of whatever pseudo-intellectual smear you can throw his way. You claim “Most of his fans haven’t even read his stuff, but I have.” Also, you’re bitterness and snarky undertone in your passive aggressive rhetoric shines light on the fact that your simply offended he has strong arguments which threaten your own. You can disagree with Peterson without vilifying him. However, your video is a reflection of your inability to recognize this fact as well as a manifestation of your insecurity of your own beliefs. In other words, your simply not as intelligent as you seem to think you are.﻿</br></p><p><b>jonathan spencer</b><br>I understand Peterson’s ideas  quite well. I understand his conception of God/divinity and truth. I think the Jungian approach, which,at least partially, describes his metaphysics is extremely coherent and needs to be contended with by serious thinkers. This video is simplistic, disingenuous and is high on rhetoric. It takes Petersons output out of  context. Chooses a few low hanging fruit and puts all its energies into discrediting Peterson. It’s pulp. It’s uses ad hominem tactics (a bankrupt tactic of the left ).Many ideas JP has aren’t from the man himself, they’re based on deep wells of truth which we don’t understand very well now. It’s easy to get him and his ideas all wrong. The truth is all this JP aversion is pure politics, and from the far left that means the truth is irrelevant, it’s all about using any trick in the book to win the day. For a student of ideas, it’s just boring. But it’s a necessary fight unfortunately. When people like Peterson are called Nazis, I guess real Nazis must be thin on the ground.﻿</br></p><p><b>Fair Discussion</b><br>I think you have a wall of ignorance to pass. I think you’re too smart for you’re own good. If I could, I’d suggest getting much deeper into the study of ‘intelligence capacity’, and ‘evolutionary psychology’. I think some of the concepts might open  your mind.  Jordan isn’t a god among men, nor a prophet of some form. He never claims to be. What he claims to be, is someone who is attempting to progress humanity altruistically. Now whilst you might have a problem yourself coming to grips the fact in purity that multiple forms of ultimate realities are reprovingly correct. Quantum Physics. ‘Historical’ Jesus. Sub-Consciousness. Undoubtedly, you don’t have to see him as a god, to see how hard he works to actually create progress. He is one of the most widely known names right now, because he worked for it, he spent time educating himself, challenging and conditioning himself, and then marketing himself. To be ignorant of that, is to be ignorant of one of the greatest attempts to progress humanity, whether wrong or not, how about you help, instead of create tension, and ignorance for others? You’re obviously smart enough to understand the concept, that a YouTube video will inspire some to think something out of trust. You are very well educated, and versed in philosophy and rhetoric, that is obvious. Though I’d like to ask you to step out of that mindset before making such large accusations against someone whom is just trying to make the world better. If you really care, reach out to him, have a discussion. Help progress this world together. Let me tell you though, as much as it is an opinion. Watching such intelligent people attack each other is becoming more disgusting to watch. Speak to each other, work for the progress of humanity. Stop doubting, and criticizing one another, then wondering why the world is progressing in such a slow manner. Every body has to talk about someone else’s ignorance. Get involved in the larger picture, not your own picture.﻿</br></p><p><b>Greg Gustin</b><br>This video is mostly false statements.  Not tiny incorrect statements, but false statements that are 180 degrees off.  I don’t know what could be worse, the fact that someone did this video in good faith, but had an IQ that was so low they completely mis-characterized everything out of sheer stupidity, or that they were malicious enough to put this together as a hit piece to target the most brilliant man many of us have had the pleasure to listen to.  Either way, shame on you, this is garbage!﻿</br></p><p><b>YT19890151</b><br>This video really exposes its author as a charlatan. If you are going to attempt to expose one of the worlds leading intellectuals, with thousands of hours of lectures online, 2 published, bestselling books and (if my memory serves me well) over 700 citations on published Psychology papers, in the top 0.1 percentile of clinical psychologists on the planet you’re gonna need more than a 14 minute video :’)  You talk like he’s just some dipshit with absolutely no idea what he’s talking about. That requires a comical level of arrogance :’)﻿</br></p><p><b>Steve Eaton</b><br>A video which sets out to expose hypocrisy and poor arguments turns out to be hypocritical and poorly argued.  Leaving aside the ridiculous childish voice and video changing tools – firstly, at 4:13 you say that Peterson’s thoughts “are not too advanced for ordinary people to follow”. That’s precisely why he’s so popular. If your definition of genius is someone you don’t understand, then go interact with the intellectually disabled, because they, too, can make little sense. Does this make them genius?  I’m also not sure how you can say someone with two Bachelor degrees, a PhD, and who has authored over a hundred academic papers is poorly educated. By definition Peterson is well-educated, whether you agree with him or not.</br></p><p>5:15 – why does he need to have read the whole bible before talking about it? You can’t talk about one episode in a box set before the entire season is finished?<br>5:23 – ‘The readily observable fact is…’ Readily observable? What kind of phrase is that? How is the reading habits of Peterson’s fans observable by just about anyone? What makes this statement – that Peterson’s fans haven’t read his work, a fact? You never actually say.<br>5:47 – Why does Maps of Meaning have to reference the people you decide it should reference? A book isn’t credible unless it references specific philosophers according to an anonymous vlogger?</br></br></p><p>I could continue ripping your little video to shreds, half minute by half minute, but it should be obvious to all that you’re using Peterson’s name to bring people in so you can increase your viewing figures and brag to people you’ll never meet. You’ve read these books, clearly Peterson hasn’t. You’ve read Peterson’s books, clearly Peterson’s fans haven’t. Yeah, yeah, well aren’t you a special little boy oh learned one. If you don’t like Peterson it’s interesting you’d dedicate so much of your time to reading his work. Since you’re okay to post character assassinations online, here’s one for you – this post was fueled by your jealousy; you desperately want the world to consider you intelligent (which they don’t) and struggle with the notion that despite the hours you’ve spent holding philosophy books in coffee shops, hoping in vain that people are actually noticing you and your reading matter even though the book is open at an arbitrary page carrying text you can’t understand, nobody thinks you’re anything special. You’re the kind of wannabe intellectual that makes people groan inwardly when you enter a room. You probably make a big deal about being an atheist or, even better, an agnostic. That way you can always start a dire debate with someone. Bore off. Let me ask you this – If you’re so smart, why haven’t you figured out that if you don’t like Peterson’s perspectives, you can just ignore him?﻿</p><p><b>Phil Kesler</b><br>Disagree with Peterson on religion and morality, as well as his redefining of ‘truth’, but this video is pure propaganda. Mostly out of context quotes followed by vague strawman’s and manipulative editing. The video creator fails to contend with Peterson’s arguments in any substantive manner while demonstrating a lack of intelligence.﻿</br></p><p><b>Freddie de Giles</b><br>This might have been interesting, but all the flashy editing and mocking of JP leads me to assume you’re arguments have no solid content. Because if they did, you’d just have used solid arguments, instead of trying razzle dazzle us. What was the purpose of the slowed down voices, images of him crying etc.?</br></p></div>",
  "content_text": "In less than 24 hours, there have already been over ten thousand views of\nthe latest Voxiversity video\n. One early commenter correctly anticipated the calm and measured response of Jordan Peterson’s fans to it.\nDavid. D\nGreat video Vox, now let’s wait for all the Peterson fanboys to tell us how jealous and bitter you are, without providing any good arguments to refute what you defend in the video.﻿\nHe was not disappointed. Nor was he incorrect about their near-complete inability to even begin dealing with the substantive issues raised about Peterson’s lack of courage, character, and intellectual integrity. A representative collection of their comments follows the break:\nAndris Falks\nCheap ad hominum attacks on people who have done in few years more to help wide variety of people then you will in your entire life is the low of your life Vox. Nobody is perfect, nobody can know everything that is written, what matters are results and JBP has some amazing results – he has helped possibly MILLIONS of people to get out of nihilism, postmodernism and find at least some resemblance of meaning in life. It seems to me you are in fact envious of JBP and feel deeply unappreciated in comparison to him. And trust me, there are many reasons for that and no cheap ad hominum attack videos will help you.﻿\nTigerairlines\nI don’t care if you agree with him or not, for a man who never tries to attack someone’s character, the editing and insulting takes down any real argument you have, regardless of religion being flat out baseless and without logic, when it comes to god isn’t it the Christian way to let people believe in what they believe in their own way, or do you need to be as authoritarian as possible, and before you call me some leftist soy boy or cuckservative I’m a centrist, with a long history of reading about the idea of religion and god, and while I don’t agree with everything Peterson says, he conducts himself with remarkable civility, try to learn about that﻿.\nATurquoise Bolo\nI don’t really agree with you here.  I don’t think you’ve actually listened to him on his purpose or intentions.   It would be like me saying this video is disingenuous on the basis that you’re jealous of his success and the ear he’s gained of the general public.  He’s trying to teach people to think for themselves and doesn’t encourage blind faith in what he’s said and what he thinks.  Honestly he’s the first psychologist I’ve found any helpful advice from when I watched his lectures prior to his incredible fame.  His goal is really to come up with an alternative to the corrupt universities.  I don’t think he’s ever said anything about not being a nationalist, and he literally stood up against infringement on freedom of speech, and he talks about the errors of Marxism and how he took the perspective of Orwell on them when he met more than just the leaders as a young man.  He wants to help people who genuinely need it, and he doesn’t want people to try to change the world without having an actual goal and the ability to manage their own lives.  He’s trying to get rid of mindless activists and mindless Marxists.  I’ve read his books, I’ve enjoyed them, and whether you understand it or not, my generation didn’t get the why of certain behaviors let alone the how.  Perhaps you’ve been out of the United States education system too long.  Whatever you may say, you didn’t give him a fair shake and it appears it’s only motivated by your need for a 100{de0369dfe3e4b53b642ec4c59899fbdd53f4c1f0d4d3d5766811416432dc2910} Christian who also wants to organize a fight against globalism.  Ironically, he agrees with you on Christianity being integral to western victimization and appears to want people to act as if God is real.  Believe it or not, that’s why I’m a Christian: because it is psychologically and empirically more beneficial to both myself and my family.  Believe it or not, that journey has been traveled by many before and after they listened to Peterson.  If you don’t like him justifying common sense through evidence and reason in his book then just read his essay on writing an essay and you might grasp some of the reasons he’s lecturing and touring.  But telling people that he’s like Soros simply because he’s taking his message international and asking people to think for themselves first and foremost is reprehensible and shows that you’re catering to an audience unwilling to hear anyone out after they’ve been ” discredited” by you.  If you watch his class lectures you’ll see him do exactly the same thing while communicating with his students, yet his years of lectures also communicate the same message, slightly changing over time to respond to current events.  Is it because you aren’t as smart or is it because your ideology doesn’t allow you to move and respond outside of a framework?  But more importantly, do you fail to understand the one flaw in his efforts that I agree with his lefty detractors on?  His ideas can be used for nationalism if it becomes a necessity.  He tells people to do what they can to improve their home, their community, their state, their country.  How does that stop them from being nationalist, and even identitarian in the end?  It doesn’t, it just tells them how to be better at it, and more thoughtful in their aims.﻿\nw reed\nPathetic attempt to spear Dr. Peterson. Sure he is a bit old school but at least he is honest. You sir are not honest and you know it!\nTheHarperbow\nLet me guess, your actually just upset he doesn’t believe in your dogmatic Christian beliefs? Therefore, he’s deserving of whatever pseudo-intellectual smear you can throw his way. You claim “Most of his fans haven’t even read his stuff, but I have.” Also, you’re bitterness and snarky undertone in your passive aggressive rhetoric shines light on the fact that your simply offended he has strong arguments which threaten your own. You can disagree with Peterson without vilifying him. However, your video is a reflection of your inability to recognize this fact as well as a manifestation of your insecurity of your own beliefs. In other words, your simply not as intelligent as you seem to think you are.﻿\njonathan spencer\nI understand Peterson’s ideas  quite well. I understand his conception of God/divinity and truth. I think the Jungian approach, which,at least partially, describes his metaphysics is extremely coherent and needs to be contended with by serious thinkers. This video is simplistic, disingenuous and is high on rhetoric. It takes Petersons output out of  context. Chooses a few low hanging fruit and puts all its energies into discrediting Peterson. It’s pulp. It’s uses ad hominem tactics (a bankrupt tactic of the left ).Many ideas JP has aren’t from the man himself, they’re based on deep wells of truth which we don’t understand very well now. It’s easy to get him and his ideas all wrong. The truth is all this JP aversion is pure politics, and from the far left that means the truth is irrelevant, it’s all about using any trick in the book to win the day. For a student of ideas, it’s just boring. But it’s a necessary fight unfortunately. When people like Peterson are called Nazis, I guess real Nazis must be thin on the ground.﻿\nFair Discussion\nI think you have a wall of ignorance to pass. I think you’re too smart for you’re own good. If I could, I’d suggest getting much deeper into the study of ‘intelligence capacity’, and ‘evolutionary psychology’. I think some of the concepts might open  your mind.  Jordan isn’t a god among men, nor a prophet of some form. He never claims to be. What he claims to be, is someone who is attempting to progress humanity altruistically. Now whilst you might have a problem yourself coming to grips the fact in purity that multiple forms of ultimate realities are reprovingly correct. Quantum Physics. ‘Historical’ Jesus. Sub-Consciousness. Undoubtedly, you don’t have to see him as a god, to see how hard he works to actually create progress. He is one of the most widely known names right now, because he worked for it, he spent time educating himself, challenging and conditioning himself, and then marketing himself. To be ignorant of that, is to be ignorant of one of the greatest attempts to progress humanity, whether wrong or not, how about you help, instead of create tension, and ignorance for others? You’re obviously smart enough to understand the concept, that a YouTube video will inspire some to think something out of trust. You are very well educated, and versed in philosophy and rhetoric, that is obvious. Though I’d like to ask you to step out of that mindset before making such large accusations against someone whom is just trying to make the world better. If you really care, reach out to him, have a discussion. Help progress this world together. Let me tell you though, as much as it is an opinion. Watching such intelligent people attack each other is becoming more disgusting to watch. Speak to each other, work for the progress of humanity. Stop doubting, and criticizing one another, then wondering why the world is progressing in such a slow manner. Every body has to talk about someone else’s ignorance. Get involved in the larger picture, not your own picture.﻿\nGreg Gustin\nThis video is mostly false statements.  Not tiny incorrect statements, but false statements that are 180 degrees off.  I don’t know what could be worse, the fact that someone did this video in good faith, but had an IQ that was so low they completely mis-characterized everything out of sheer stupidity, or that they were malicious enough to put this together as a hit piece to target the most brilliant man many of us have had the pleasure to listen to.  Either way, shame on you, this is garbage!﻿\nYT19890151\nThis video really exposes its author as a charlatan. If you are going to attempt to expose one of the worlds leading intellectuals, with thousands of hours of lectures online, 2 published, bestselling books and (if my memory serves me well) over 700 citations on published Psychology papers, in the top 0.1 percentile of clinical psychologists on the planet you’re gonna need more than a 14 minute video :’)  You talk like he’s just some dipshit with absolutely no idea what he’s talking about. That requires a comical level of arrogance :’)﻿\nSteve Eaton\nA video which sets out to expose hypocrisy and poor arguments turns out to be hypocritical and poorly argued.  Leaving aside the ridiculous childish voice and video changing tools – firstly, at 4:13 you say that Peterson’s thoughts “are not too advanced for ordinary people to follow”. That’s precisely why he’s so popular. If your definition of genius is someone you don’t understand, then go interact with the intellectually disabled, because they, too, can make little sense. Does this make them genius?  I’m also not sure how you can say someone with two Bachelor degrees, a PhD, and who has authored over a hundred academic papers is poorly educated. By definition Peterson is well-educated, whether you agree with him or not.\n5:15 – why does he need to have read the whole bible before talking about it? You can’t talk about one episode in a box set before the entire season is finished?\n5:23 – ‘The readily observable fact is…’ Readily observable? What kind of phrase is that? How is the reading habits of Peterson’s fans observable by just about anyone? What makes this statement – that Peterson’s fans haven’t read his work, a fact? You never actually say.\n5:47 – Why does Maps of Meaning have to reference the people you decide it should reference? A book isn’t credible unless it references specific philosophers according to an anonymous vlogger?\nI could continue ripping your little video to shreds, half minute by half minute, but it should be obvious to all that you’re using Peterson’s name to bring people in so you can increase your viewing figures and brag to people you’ll never meet. You’ve read these books, clearly Peterson hasn’t. You’ve read Peterson’s books, clearly Peterson’s fans haven’t. Yeah, yeah, well aren’t you a special little boy oh learned one. If you don’t like Peterson it’s interesting you’d dedicate so much of your time to reading his work. Since you’re okay to post character assassinations online, here’s one for you – this post was fueled by your jealousy; you desperately want the world to consider you intelligent (which they don’t) and struggle with the notion that despite the hours you’ve spent holding philosophy books in coffee shops, hoping in vain that people are actually noticing you and your reading matter even though the book is open at an arbitrary page carrying text you can’t understand, nobody thinks you’re anything special. You’re the kind of wannabe intellectual that makes people groan inwardly when you enter a room. You probably make a big deal about being an atheist or, even better, an agnostic. That way you can always start a dire debate with someone. Bore off. Let me ask you this – If you’re so smart, why haven’t you figured out that if you don’t like Peterson’s perspectives, you can just ignore him?﻿\nPhil Kesler\nDisagree with Peterson on religion and morality, as well as his redefining of ‘truth’, but this video is pure propaganda. Mostly out of context quotes followed by vague strawman’s and manipulative editing. The video creator fails to contend with Peterson’s arguments in any substantive manner while demonstrating a lack of intelligence.﻿\nFreddie de Giles\nThis might have been interesting, but all the flashy editing and mocking of JP leads me to assume you’re arguments have no solid content. Because if they did, you’d just have used solid arguments, instead of trying razzle dazzle us. What was the purpose of the slowed down voices, images of him crying etc.?",
  "tags": [
    "anklebiters"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-22T14:32:28+00:00"
}