{
  "url": "https://voxday.net/2018/08/15/the-pot-alarmed-by-the-kettle/",
  "scraped_at": "2025-12-19T21:16:47.651205",
  "title": "The pot, alarmed by the kettle",
  "date_display": "August 15, 2018",
  "date_iso": "2018-08-15T12:03:41+00:00",
  "date_from_url": "2018-08-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s beyond ironic that Americans are supposed to be alarmed <a href=\"https://www.thedailybeast.com/chinese-police-are-spying-on-uighurson-american-soil?ref=home\">by China’s global reach</a>:</p><blockquote><p>China is compiling a global registry of its ethnic minorities who have fled persecution, threatening to detain the families of those who don’t comply. The message: Nowhere is safe.</p><p>A major human rights crisis is unfolding in northwestern China, according to the United Nations, which said last week that there were credible reports that the Chinese government is holding one million or more ethnic minorities in secretive detention camps.</p><p>Yet even for those who have escaped China, surveillance and intimidation have followed. As part of a massive campaign to monitor and intimidate its ethnic minorities no matter where they are, Chinese authorities are creating a global registry of Uighurs who live outside of China, threatening to detain their relatives if they do not provide personal and identifying information to Chinese police. This campaign is now reaching even Uighurs who live in the United States.</p><p>A few months ago, Barna, who lives in a major U.S. city and requested that her real name not be revealed, received an odd message from her mother, who lives in China. Barna’s mother asked her to send her U.S. car license plate number, her phone number, her U.S. bank card number, and a photo of her ID card. Barna’s mother said that China is creating a new ID card system that includes all Chinese, even those who are abroad.</p></blockquote><p>Unlike the USA, China doesn’t tax its non-resident citizens. Unlike the USA, China doesn’t have multiple global surveillance systems coordinated with four other countries spying on its citizens. Unlike the USA, China isn’t threatening its nationals with foreign bank accounts with fines and criminal penalties. Unlike the USA, China is limiting its renditions to its own nationals. And unlike the USA, China isn’t assassinating its own citizens around the world with drone strikes.</p><p>So, pardon me if I am neither surprised nor panicked by the news that China is beginning to engage in some of the same international activities as its global rival. It’s <i>particularly </i>ironic when people post their concerns about Huawei technology being used to spy on its users, as they log into Facebook on their Google-powered smartphone.</p></div>",
  "content_text": "It’s beyond ironic that Americans are supposed to be alarmed\nby China’s global reach\n:\nChina is compiling a global registry of its ethnic minorities who have fled persecution, threatening to detain the families of those who don’t comply. The message: Nowhere is safe.\nA major human rights crisis is unfolding in northwestern China, according to the United Nations, which said last week that there were credible reports that the Chinese government is holding one million or more ethnic minorities in secretive detention camps.\nYet even for those who have escaped China, surveillance and intimidation have followed. As part of a massive campaign to monitor and intimidate its ethnic minorities no matter where they are, Chinese authorities are creating a global registry of Uighurs who live outside of China, threatening to detain their relatives if they do not provide personal and identifying information to Chinese police. This campaign is now reaching even Uighurs who live in the United States.\nA few months ago, Barna, who lives in a major U.S. city and requested that her real name not be revealed, received an odd message from her mother, who lives in China. Barna’s mother asked her to send her U.S. car license plate number, her phone number, her U.S. bank card number, and a photo of her ID card. Barna’s mother said that China is creating a new ID card system that includes all Chinese, even those who are abroad.\nUnlike the USA, China doesn’t tax its non-resident citizens. Unlike the USA, China doesn’t have multiple global surveillance systems coordinated with four other countries spying on its citizens. Unlike the USA, China isn’t threatening its nationals with foreign bank accounts with fines and criminal penalties. Unlike the USA, China is limiting its renditions to its own nationals. And unlike the USA, China isn’t assassinating its own citizens around the world with drone strikes.\nSo, pardon me if I am neither surprised nor panicked by the news that China is beginning to engage in some of the same international activities as its global rival. It’s\nparticularly\nironic when people post their concerns about Huawei technology being used to spy on its users, as they log into Facebook on their Google-powered smartphone.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-15T11:03:41+00:00"
}