{
  "url": "https://voxday.net/2018/08/12/the-futility-of-social-media-bans/",
  "scraped_at": "2025-12-19T21:16:14.526429",
  "title": "The futility of social media bans",
  "date_display": "August 12, 2018",
  "date_iso": "2018-08-12T10:05:23+00:00",
  "date_from_url": "2018-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not surprised that the well-publicized social media bans <a href=\"https://www.mystatesman.com/business/bans-don-seem-lessening-reach-alex-jones-infowars/Xo1jC96JodMuYqZDYMVQjO/\">aren’t harming Alex Jones</a>. The truth is that social media doesn’t actually matter all that much for those who already have a strong base of supporters. It’s the content that matters much more than the medium.</p><blockquote><p>Some of the nation’s largest technology and social media companies have tried to stop Alex Jones and his conspiracy theories. But in a digital world, their attempts seem to have barely slowed him down.</p><p>After YouTube, Facebook and others this week removed content by Jones and his website, the InfoWars leader, talk show host and Austin resident fired back, accusing the companies of censorship and urging his audience to fight back against what he called an “unprecedented attack.”</p><p>Meanwhile, Jones’ website and other online platforms have remained popular destinations.</p><p>InfoWars continues to see more than 1 million page visits per day and has trended upward this month, according to Amazon’s Alexa website traffic report, which also said InfoWars averages more than 25 million page views per month.</p></blockquote><p>Being banned from Twitter last year and having links to my blog blocked by Twitter and Facebook haven’t had any serious effect on my blog either. Last year at this time, the monthly traffic average for VP alone was 2,500,791. Now it is 2,604,358, which represents 4.1 percent annual growth.</p><p>Given the massive Twitter audiences that Mike Cernovich and Jack Posobiec have developed – I had 33k when I was banned – it’s likely that the bans have somewhat slowed the growth of the blog and Voxiversity. But they obviously haven’t stopped it, which I suspect is one reason why the tech media giants have only engaged in fairly limited banning in response to the demands of their SJWs, who would prefer to ban everyone who is a Republican, who ever voted for a Republican, or is to the Right of Che Guevara.</p><p>These bans are a very delicate balancing game for the social media giants. They already know we have built a few alternative platforms and have the ability to build more. And they are very well aware that there is a tipping point somewhere at which too many bans will trigger a snowball effect that will more than decimate their user bases. After all, both Facebook and Twitter <a href=\"https://nypost.com/2018/08/09/facebook-lost-4000000000-monthly-page-views-over-two-years/\">are already in decline</a>.</p><blockquote class=\"tr_bq\"><p>CNBC describes the drop at Facebook as “severe” and goes on to round out its list this way: “The five websites receiving the most traffic in the US in the last several years have been Google, Facebook, YouTube, Yahoo and Amazon, in that order. However, Facebook has seen a severe decline in monthly page visits, from 8.5 billion to 4.7 billion in the last two years, according to the study. Although Facebook’s app traffic has grown, it is not enough to make up for that loss, the study said.”</p></blockquote></div>",
  "content_text": "I’m not surprised that the well-publicized social media bans\naren’t harming Alex Jones\n. The truth is that social media doesn’t actually matter all that much for those who already have a strong base of supporters. It’s the content that matters much more than the medium.\nSome of the nation’s largest technology and social media companies have tried to stop Alex Jones and his conspiracy theories. But in a digital world, their attempts seem to have barely slowed him down.\nAfter YouTube, Facebook and others this week removed content by Jones and his website, the InfoWars leader, talk show host and Austin resident fired back, accusing the companies of censorship and urging his audience to fight back against what he called an “unprecedented attack.”\nMeanwhile, Jones’ website and other online platforms have remained popular destinations.\nInfoWars continues to see more than 1 million page visits per day and has trended upward this month, according to Amazon’s Alexa website traffic report, which also said InfoWars averages more than 25 million page views per month.\nBeing banned from Twitter last year and having links to my blog blocked by Twitter and Facebook haven’t had any serious effect on my blog either. Last year at this time, the monthly traffic average for VP alone was 2,500,791. Now it is 2,604,358, which represents 4.1 percent annual growth.\nGiven the massive Twitter audiences that Mike Cernovich and Jack Posobiec have developed – I had 33k when I was banned – it’s likely that the bans have somewhat slowed the growth of the blog and Voxiversity. But they obviously haven’t stopped it, which I suspect is one reason why the tech media giants have only engaged in fairly limited banning in response to the demands of their SJWs, who would prefer to ban everyone who is a Republican, who ever voted for a Republican, or is to the Right of Che Guevara.\nThese bans are a very delicate balancing game for the social media giants. They already know we have built a few alternative platforms and have the ability to build more. And they are very well aware that there is a tipping point somewhere at which too many bans will trigger a snowball effect that will more than decimate their user bases. After all, both Facebook and Twitter\nare already in decline\n.\nCNBC describes the drop at Facebook as “severe” and goes on to round out its list this way: “The five websites receiving the most traffic in the US in the last several years have been Google, Facebook, YouTube, Yahoo and Amazon, in that order. However, Facebook has seen a severe decline in monthly page visits, from 8.5 billion to 4.7 billion in the last two years, according to the study. Although Facebook’s app traffic has grown, it is not enough to make up for that loss, the study said.”",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-12T09:05:23+00:00"
}