{
  "url": "https://voxday.net/2018/08/05/the-genius-of-poe/",
  "scraped_at": "2025-12-19T21:15:08.303986",
  "title": "The genius of Poe",
  "date_display": "August 5, 2018",
  "date_iso": "2018-08-05T12:00:05+00:00",
  "date_from_url": "2018-08-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Despite being a mild Edgar Allen Poe aficionado, I wasn’t familiar with his <i>Eureka</i>, which is a sort of brilliant stream-of-consciousness intellectual exploration that is almost exactly what Jordan Peterson, in his fevered, cousin-devouring dreams, must have imagined his <i>Maps of Meaning </i>would be. I’ve been reading <i>Eureka </i>and finding it to be an absolute delight, particularly in Poe’s prophetic anticipation of the instrinsic limitations of the methodology of modern science, which he described in the summary of a letter said to have been written in 2848.</p><blockquote><p>“Well, Aries Tottle flourished supreme, until the advent of one Hog, surnamed ‘the Ettrick shepherd,’ who preached an entirely different system, which he called the<i> à posteriori</i> or inductive. His plan referred altogether to sensation. He proceeded by observing, analyzing, and classifying facts—<i>instantiæ Naturæ</i>, as they were somewhat affectedly called—and arranging them into general laws. In a word, while the mode of Aries rested on noumena, that of Hog depended on phenomena; and so great was the admiration excited by this latter system that, at its first introduction, Aries fell into general disrepute. Finally, however, he recovered ground, and was permitted to divide the empire of Philosophy with his more modern rival:—the savans contenting themselves with proscribing all other competitors, past, present, and to come; putting an end to all controversy on the topic by the promulgation of a Median law, to the effect that the Aristotelian and Baconian roads are, and of right ought to be, the solo possible avenues to knowledge:—‘Baconian,’ you must know, my dear friend,” adds the letter-writer at this point, “was an adjective invented as equivalent to Hog-ian, and at the same time more dignified and euphonious.</p><p>“Now I do assure you most positively”—proceeds the epistle—“that I represent these matters fairly; and you can easily understand how restrictions so absurd on their very face must have operated, in those days, to retard the progress of true Science, which makes its most important advances—as all History will show—by seemingly intuitive leaps. These ancient ideas confined investigation to crawling; and I need not suggest to you that crawling, among varieties of locomotion, is a very capital thing of its kind;—but because the tortoise is sure of foot, for this reason must we clip the wings of the eagles? For many centuries, so great was the infatuation, about Hog especially, that a virtual stop was put to all thinking, properly so called. No man dared utter a truth for which he felt himself indebted to his soul alone. It mattered not whether the truth was even demonstrably such; for the dogmatizing philosophers of that epoch regarded only the road by which it professed to have been attained. The end, with them, was a point of no moment, whatever:—‘the means!’ they vociferated—‘let us look at the means!’—and if, on scrutiny of the means, it was found to come neither under the category Hog, nor under the category Aries (which means ram), why then the savans went no farther, but, calling the thinker a fool and branding him a ‘theorist,’ would never, thenceforward, have any thing to do either with him or with his truths.</p></blockquote><p>The more things change, the more they stay the same. It’s also fascinating to see how the Mozart-Salieri relationship seems to play out again and again over time, the inevitable public rivalries between the original thinkers with integrity and talent and the popular pretenders with neither. Sometimes the Mozarts win out, sometimes the Griswolds do. But time always eventually exposes the latter, as your complete failure to recognize the name of Poe’s bitter would-be rival should suffice to demonstrate.</p><p>On a possibly-but-not-necessarily-unrelated note, I found this email from a reader to be more than a little amusing.</p><blockquote class=\"tr_bq\"><p>I was over at my sister’s place today and saw a copy of <i>The Irrational Atheist</i> in their library. When I asked about it, her husband, who is a recent MDiv graduate, told me that it was assigned reading in seminary. Amen. </p></blockquote><p>Anyhow, “Hogian” is an apt description of the science-loving dogmatists who demand “proof” and “evidence” for event the simplest and most straightforward claims. They inevitably confuse the means with the end, and not infrequently go so far to claim, without any apparent sense of irony intended, that any factual statement made without evidential support and reliable sourcing being subsequently provided is inherently untrue.</p></div>",
  "content_text": "Despite being a mild Edgar Allen Poe aficionado, I wasn’t familiar with his\nEureka\n, which is a sort of brilliant stream-of-consciousness intellectual exploration that is almost exactly what Jordan Peterson, in his fevered, cousin-devouring dreams, must have imagined his\nMaps of Meaning\nwould be. I’ve been reading\nEureka\nand finding it to be an absolute delight, particularly in Poe’s prophetic anticipation of the instrinsic limitations of the methodology of modern science, which he described in the summary of a letter said to have been written in 2848.\n“Well, Aries Tottle flourished supreme, until the advent of one Hog, surnamed ‘the Ettrick shepherd,’ who preached an entirely different system, which he called the\nà posteriori\nor inductive. His plan referred altogether to sensation. He proceeded by observing, analyzing, and classifying facts—\ninstantiæ Naturæ\n, as they were somewhat affectedly called—and arranging them into general laws. In a word, while the mode of Aries rested on noumena, that of Hog depended on phenomena; and so great was the admiration excited by this latter system that, at its first introduction, Aries fell into general disrepute. Finally, however, he recovered ground, and was permitted to divide the empire of Philosophy with his more modern rival:—the savans contenting themselves with proscribing all other competitors, past, present, and to come; putting an end to all controversy on the topic by the promulgation of a Median law, to the effect that the Aristotelian and Baconian roads are, and of right ought to be, the solo possible avenues to knowledge:—‘Baconian,’ you must know, my dear friend,” adds the letter-writer at this point, “was an adjective invented as equivalent to Hog-ian, and at the same time more dignified and euphonious.\n“Now I do assure you most positively”—proceeds the epistle—“that I represent these matters fairly; and you can easily understand how restrictions so absurd on their very face must have operated, in those days, to retard the progress of true Science, which makes its most important advances—as all History will show—by seemingly intuitive leaps. These ancient ideas confined investigation to crawling; and I need not suggest to you that crawling, among varieties of locomotion, is a very capital thing of its kind;—but because the tortoise is sure of foot, for this reason must we clip the wings of the eagles? For many centuries, so great was the infatuation, about Hog especially, that a virtual stop was put to all thinking, properly so called. No man dared utter a truth for which he felt himself indebted to his soul alone. It mattered not whether the truth was even demonstrably such; for the dogmatizing philosophers of that epoch regarded only the road by which it professed to have been attained. The end, with them, was a point of no moment, whatever:—‘the means!’ they vociferated—‘let us look at the means!’—and if, on scrutiny of the means, it was found to come neither under the category Hog, nor under the category Aries (which means ram), why then the savans went no farther, but, calling the thinker a fool and branding him a ‘theorist,’ would never, thenceforward, have any thing to do either with him or with his truths.\nThe more things change, the more they stay the same. It’s also fascinating to see how the Mozart-Salieri relationship seems to play out again and again over time, the inevitable public rivalries between the original thinkers with integrity and talent and the popular pretenders with neither. Sometimes the Mozarts win out, sometimes the Griswolds do. But time always eventually exposes the latter, as your complete failure to recognize the name of Poe’s bitter would-be rival should suffice to demonstrate.\nOn a possibly-but-not-necessarily-unrelated note, I found this email from a reader to be more than a little amusing.\nI was over at my sister’s place today and saw a copy of\nThe Irrational Atheist\nin their library. When I asked about it, her husband, who is a recent MDiv graduate, told me that it was assigned reading in seminary. Amen.\nAnyhow, “Hogian” is an apt description of the science-loving dogmatists who demand “proof” and “evidence” for event the simplest and most straightforward claims. They inevitably confuse the means with the end, and not infrequently go so far to claim, without any apparent sense of irony intended, that any factual statement made without evidential support and reliable sourcing being subsequently provided is inherently untrue.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-05T11:00:05+00:00"
}