{
  "url": "https://voxday.net/2018/08/31/the-truth-wins-out/",
  "scraped_at": "2025-12-19T21:19:10.933046",
  "title": "The truth wins out",
  "date_display": "August 31, 2018",
  "date_iso": "2018-08-31T12:41:08+00:00",
  "date_from_url": "2018-08-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jordanetics is gradually losing its hold on people. More and more people are becoming aware that Jordan Peterson is not only a liar, he is a complete lunatic who should be in a padded cell for his own protection. And all that is required to convince them of this <a href=\"https://youtu.be/yW_hoDnifIc\">is repeatedly quoting Jordan Peterson’s own words</a> from his own speeches and books at length.</p><ul><li><i>I was highly skeptical on your attacks against Peterson for a long while. It took me awhile to come around, but when you’re right you’re right, hat’s off to you.﻿</i></li><li><i>Same here. After his third or fourth Darkstream about Peterson and a few blog posts. I started realizing that he was correct.﻿</i></li><li><i>I was hesitant at first to listen to Vox when he started explaining what was really going on.  I’d started to become invested in Peterson.  But the arguments and examples can’t be ignored.  I will not flinch from unpleasant truths.  Peterson being a leftist shuck and jive artist with emotional problems is one of those truths.﻿</i></li><li><i>Vox you called it from the start. I think you were the first person I heard call out Peterson. I could smell something funny, but couldn’t really tell. But you knew it. And called it.</i></li><li><i>From what Peterson has stated: this is classic SSRI and/or benzodiazapine withdrawal, akethesia, manic psychosis. This buckaroo is having a breakdown, especially if he’s been experimenting with drugs . Bravo Vox for shining light on this fraud with a messiah complex. Someone should section 35 this clown Peterson.﻿</i></li><li><i>JBP is a complete fruitcake.. You’re 100{e1b6c4ee08d0f44a6a5b11eb06b9139d63cfe72acbaefd7257f78696d447c626} right about him. Thanks for opening my eyes on that topic.﻿</i></li><li><i>Damn he really is totally crazy! How are people still not seeing it when he is throwing it right out there?﻿</i></li><li><i> I thought that it was rambling, incoherent, badly written nonsense. I didn’t know it was chock full of sexual deviancy.</i></li><li><i>The proof Jordan Peterson is crazy is that he is STILL promoting Maps Of Meaning 2 decades after he wrote it.﻿</i></li><li><i>I’m no Christian, but Day’s critiques of Peterson are accurate.﻿</i></li><li><i>J Peterson is a liar and a coward</i></li></ul><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/yW_hoDnifIc\" width=\"512\"></iframe></div><p>From the transcript <a href=\"https://www.youtube.com/watch?v=yW_hoDnifIc\">of the Darkstream</a>:</p><p>Okay, so  now let me let me point this out: if you  have a 25-day stretch of terror and  impending doom and you cannot sleep for  however long it was – it wasn’t 25 days, we  know it wasn’t 25 days, unless of course  he has actually transcended the Material  Plane like L. Ron Hubbard and is now  doing his work beyond the limitations of  the human body – if that happens from <i>drinking apple cider</i> there is nothing  wrong with your body, there is something wrong with your <i>head!</i> You are simply  insane, okay?</p><p>This guy is an utter and total lunatic, but just so you understand, this is not new. I’ve been  telling you that the guy is insane since  I read his <i>Maps of Meaning</i>. Now, because I  brought your attention to it, a lot of you are  now familiar with the whole Jordan  Peterson wants to bang  his cousin and dreams about  cannibalizing her while the world is ending thing. If you notice, apocalyptic doom is a  consistent theme with him. All right, so this is also from <i>Maps of Meaning, </i>and buckle your seat belts because some of you, if  you’ve read it, then you know where I’m going with this  one. Trust me, if you thought the whole  cousin thing was bad, just wait. Please keep in mind that I am reading from  Jordan Peterson’s <i>Maps of Meaning</i>.</p><p><i>I  dreamed I saw my maternal grandmother  sitting by the bank of a swimming pool, which was also a river. Her genital  region was exposed dimly. It had the  appearance of a thick mane of hair. She  was stroking herself absentmindedly. She  walked over to me with a handful of  pubic hair compacted into something  resembling a large artist’s paintbrush. She pushed this at my face.  I raised my arm several times to deflect  her hand. Finally, unwilling to hurt her or  interfere with her any further, I let her  have her way. She stroked my face with  the brush gently and said, like a child, isn’t it soft?</i></p><p>This guy has <i>serious </i>incest issues. Every time he’s dreaming about his  female relatives, it has something to do  with sex, and if you put this together with the  fact that he was brought in to try to dismiss  the idea that there was a official  conspiracy to try to conceal some known  child molesters in Canada, you know  there is something very, very, very hinky  going on in the Peterson family.</p><p>David Eig<br><i>Challenge him to a debate. It won’t turn out well for you Vox.﻿</i></br></p><p>Darkstream by Vox Day<br><i>I hereby challenge Jordan Peterson to a public written debate, to be published simultaneously on my blog and the site of his choosing.﻿</i><br><i><br/></i><br> Now all of the Jordanetics cultists who have been repeatedly telling me that I should challenge him to a debate can go and pester Peterson about debating me. I’m confident they’re all going to get right on that. I’m sure they won’t make any excuses for his failure to accept the challenge.</br></br></br></p></div>",
  "content_text": "Jordanetics is gradually losing its hold on people. More and more people are becoming aware that Jordan Peterson is not only a liar, he is a complete lunatic who should be in a padded cell for his own protection. And all that is required to convince them of this\nis repeatedly quoting Jordan Peterson’s own words\nfrom his own speeches and books at length.\nI was highly skeptical on your attacks against Peterson for a long while. It took me awhile to come around, but when you’re right you’re right, hat’s off to you.﻿\nSame here. After his third or fourth Darkstream about Peterson and a few blog posts. I started realizing that he was correct.﻿\nI was hesitant at first to listen to Vox when he started explaining what was really going on.  I’d started to become invested in Peterson.  But the arguments and examples can’t be ignored.  I will not flinch from unpleasant truths.  Peterson being a leftist shuck and jive artist with emotional problems is one of those truths.﻿\nVox you called it from the start. I think you were the first person I heard call out Peterson. I could smell something funny, but couldn’t really tell. But you knew it. And called it.\nFrom what Peterson has stated: this is classic SSRI and/or benzodiazapine withdrawal, akethesia, manic psychosis. This buckaroo is having a breakdown, especially if he’s been experimenting with drugs . Bravo Vox for shining light on this fraud with a messiah complex. Someone should section 35 this clown Peterson.﻿\nJBP is a complete fruitcake.. You’re 100{e1b6c4ee08d0f44a6a5b11eb06b9139d63cfe72acbaefd7257f78696d447c626} right about him. Thanks for opening my eyes on that topic.﻿\nDamn he really is totally crazy! How are people still not seeing it when he is throwing it right out there?﻿\nI thought that it was rambling, incoherent, badly written nonsense. I didn’t know it was chock full of sexual deviancy.\nThe proof Jordan Peterson is crazy is that he is STILL promoting Maps Of Meaning 2 decades after he wrote it.﻿\nI’m no Christian, but Day’s critiques of Peterson are accurate.﻿\nJ Peterson is a liar and a coward\nFrom the transcript\nof the Darkstream\n:\nOkay, so  now let me let me point this out: if you  have a 25-day stretch of terror and  impending doom and you cannot sleep for  however long it was – it wasn’t 25 days, we  know it wasn’t 25 days, unless of course  he has actually transcended the Material  Plane like L. Ron Hubbard and is now  doing his work beyond the limitations of  the human body – if that happens from\ndrinking apple cider\nthere is nothing  wrong with your body, there is something wrong with your\nhead!\nYou are simply  insane, okay?\nThis guy is an utter and total lunatic, but just so you understand, this is not new. I’ve been  telling you that the guy is insane since  I read his\nMaps of Meaning\n. Now, because I  brought your attention to it, a lot of you are  now familiar with the whole Jordan  Peterson wants to bang  his cousin and dreams about  cannibalizing her while the world is ending thing. If you notice, apocalyptic doom is a  consistent theme with him. All right, so this is also from\nMaps of Meaning,\nand buckle your seat belts because some of you, if  you’ve read it, then you know where I’m going with this  one. Trust me, if you thought the whole  cousin thing was bad, just wait. Please keep in mind that I am reading from  Jordan Peterson’s\nMaps of Meaning\n.\nI  dreamed I saw my maternal grandmother  sitting by the bank of a swimming pool, which was also a river. Her genital  region was exposed dimly. It had the  appearance of a thick mane of hair. She  was stroking herself absentmindedly. She  walked over to me with a handful of  pubic hair compacted into something  resembling a large artist’s paintbrush. She pushed this at my face.  I raised my arm several times to deflect  her hand. Finally, unwilling to hurt her or  interfere with her any further, I let her  have her way. She stroked my face with  the brush gently and said, like a child, isn’t it soft?\nThis guy has\nserious\nincest issues. Every time he’s dreaming about his  female relatives, it has something to do  with sex, and if you put this together with the  fact that he was brought in to try to dismiss  the idea that there was a official  conspiracy to try to conceal some known  child molesters in Canada, you know  there is something very, very, very hinky  going on in the Peterson family.\nDavid Eig\nChallenge him to a debate. It won’t turn out well for you Vox.﻿\nDarkstream by Vox Day\nI hereby challenge Jordan Peterson to a public written debate, to be published simultaneously on my blog and the site of his choosing.﻿\nNow all of the Jordanetics cultists who have been repeatedly telling me that I should challenge him to a debate can go and pester Peterson about debating me. I’m confident they’re all going to get right on that. I’m sure they won’t make any excuses for his failure to accept the challenge.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-31T11:41:08+00:00"
}