{
  "url": "https://voxday.net/2018/08/14/the-good-conservative/",
  "scraped_at": "2025-12-19T21:16:42.204080",
  "title": "The good conservative",
  "date_display": "August 14, 2018",
  "date_iso": "2018-08-14T17:00:11+00:00",
  "date_from_url": "2018-08-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Is an irrelevant political commentator. The Z-man <a href=\"http://thezman.com/wordpress/?p=14738#comments\">explains why</a>:</p><blockquote><p>One of the first things I learned about conservatism, way back in the before times, was that William F. Buckley made conservatism respectable. In the 1980’s, Buckley became a rock star, riding the wave of enthusiasm for Ronald Reagan. Like a lot of young men in that age, I was caught up in it. Being a conservative was suddenly cool and everyone credited Buckley for making it possible. It was hard to argue with the claim. Bill Buckley was a charming, intelligent and sophisticated guy. Who would not want to be like Bill?</p><p>The part that no one seemed to notice back then, at least not the people involved in the conservative movement, was that the whole point of the thing was to make the people in it respectable, as judged by their alleged opponents. Pretty much the only thing they really cared about was being seen as respectable. It’s why guys like George Will were not fans of Ronald Reagan initially. They worried that his earthy sense of humor and popularity with normal people would not go over well with their friends on the Left.</p><p>A big part of being respectable, at least in modern politics, is drawing the line between yourself and those who are not respectable. In the 80’s, when conservatism was booming, no one thought much about all the people that had been read out of the conservative movement in order for guys like Bill Buckley to be respectable. That was the thing though, by the 80’s, conservatism was nothing but drawing lines between the respectable and the unacceptable, in order to be in good standing with the Left.</p></blockquote><p>I’ve never understood why conservatives care so much about the good opinion of the Left. I don’t care about the good opinion of the Left, of conservatives, or of the Devil. Sure, I don’t care all that much about <i>anyone’s</i> opinion, but even so, what could possibly be the point in placing any value on your professed enemy’s regard?</p><p>It comes down to social status-seeking and narcissism, I guess. And greed. There always seem to be billionaires happy to fund those who are willing to play gatekeeper to the Right.</p></div>",
  "content_text": "Is an irrelevant political commentator. The Z-man\nexplains why\n:\nOne of the first things I learned about conservatism, way back in the before times, was that William F. Buckley made conservatism respectable. In the 1980’s, Buckley became a rock star, riding the wave of enthusiasm for Ronald Reagan. Like a lot of young men in that age, I was caught up in it. Being a conservative was suddenly cool and everyone credited Buckley for making it possible. It was hard to argue with the claim. Bill Buckley was a charming, intelligent and sophisticated guy. Who would not want to be like Bill?\nThe part that no one seemed to notice back then, at least not the people involved in the conservative movement, was that the whole point of the thing was to make the people in it respectable, as judged by their alleged opponents. Pretty much the only thing they really cared about was being seen as respectable. It’s why guys like George Will were not fans of Ronald Reagan initially. They worried that his earthy sense of humor and popularity with normal people would not go over well with their friends on the Left.\nA big part of being respectable, at least in modern politics, is drawing the line between yourself and those who are not respectable. In the 80’s, when conservatism was booming, no one thought much about all the people that had been read out of the conservative movement in order for guys like Bill Buckley to be respectable. That was the thing though, by the 80’s, conservatism was nothing but drawing lines between the respectable and the unacceptable, in order to be in good standing with the Left.\nI’ve never understood why conservatives care so much about the good opinion of the Left. I don’t care about the good opinion of the Left, of conservatives, or of the Devil. Sure, I don’t care all that much about\nanyone’s\nopinion, but even so, what could possibly be the point in placing any value on your professed enemy’s regard?\nIt comes down to social status-seeking and narcissism, I guess. And greed. There always seem to be billionaires happy to fund those who are willing to play gatekeeper to the Right.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-14T16:00:11+00:00"
}