{
  "url": "https://voxday.net/2018/08/11/tripcode-compromised/",
  "scraped_at": "2025-12-19T21:16:05.300688",
  "title": "Tripcode compromised",
  "date_display": "August 11, 2018",
  "date_iso": "2018-08-11T11:45:22+00:00",
  "date_from_url": "2018-08-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>We are under HEAVY attack.</i><br><i>AB(C) took control</i><br><i>Tripcode compromised</i><br><i><br/></i>Neon Revolt <a href=\"https://www.neonrevolt.com/2018/08/10/now-they-all-lose-newq-qanon-greatawakening/\">pointed out what looks like a Clown operation</a> taking advantage of the tripcode:</br></br></br></p><blockquote><p>An Appeal to Patriots</p><p>I’m scared for my country, and I am especially scared for you good people who look to this space for guidance.  I have seen how my folks are suffering.  No one has money.   Half of my family is suffering from issues relating to drug abuse.  Honest work is getting hard to find for the ill-connected.  I see the accomplishments of my parents and grandparents and wonder how so many of my generation are barely holding on, fighting hard to stay in the middle class.</p><p>Ways of life that have existed for a century are vanishing, often because of decisions made via algorithms whose inner workings cannot be comprehended by any single living human being.  The world is shifting away under our feet, largely due to inscrutable forces with no historical parallel.   Change is everywhere and can be sourced to nowhere.  Sneering elites in government and the media look down on us and assure us that this is all our fault.  It is difficult to know who to trust.</p><p>In times like these, we reach out for any comfort we can find.  We want to help, we want to put our meager power together with others and fix it all. There are people out there in the world who will take advantage of this powerful need.  Politicians, business leaders, religions…and others.</p><p>I firmly believe that all of you love the United States of America, and revere the work of our Founding Fathers, mighty men who led the world in skill and learning.  Men like Jefferson and Madison, Washington and Hamilton.  Men who revered reason and the exploration of natural law.  Over and over again in their writings, they expound the world view of the Enlightenment, among whose core values is that there is a singular, true natural order established by our Creator, and that all things must obey that law, and that this natural law is fundamentally knowable by human kind.  That from that order flows the equality of men, and the rights to life, liberty, and the pursuit of happiness.</p><p>On this basis our Fathers forged our great nation.  They did not always agree on what should be built upon that firm foundation, but through conflict and struggle with one another they built the great compromise that is embodied by our Constitution, whose fruit has been unparalleled freedom.</p><p>It is my belief that anyone who betrays those founding values by asking us to suspend trust in well-constructed arguments and the knowable is betraying the foundation of our law, our history, and our civilization.  I believe that exhortations to abandon friends and family in favor of numerology and cryptic messages are the products of charlatans, not patriots.</p><p>It is my belief that Q is a charlatan.</p><p>It is my belief that Q is a young, untrained American man who is playing games with your faith, your hope, and your love of country, mostly because he finds it amusing.  I believe he may call you to violence, not to save our home, but merely for entertainment.</p><p>There are many arguments for this, but I will name a few that Q has been gleefully rubbing our noses in since the beginning.</p><p>Firstly, his name itself.  “Q”, after the Department of Energy’s Q clearance.  I have had the opportunity to work in our country’s national labs, and have worked with some of those clever, hard-working folks that hold Q clearance.  A Q clearance grants access to carefully compartmentalized nuclear weapons information.  One who holds a Q clearance is a scientist, engineer, or manager who is deemed trustworthy by classifying authorities.  Q clearance holders are people who employ our nation’s most dangerous technical secrets to manufacture and maintain weaponry than can end the world in a flash of baleful fire.</p><p>They are not experts in spycraft and combat operations.</p><p>If, for some curious reason, our President put a Q clearance individual in charge of such an operation, it is not believable that anyone would issue commands and share national security information with strangers via a cobbled-together web site of uncertain security…particularly if said website’s claim to fame was a loud public argument about about video games.</p><p>If that catastrophic chain of events were to take place somehow, this nuclear/black ops guru would not stoop so low as to secure this essential line of communication with a DES/crypt(3) based tripcode hash, with the excuse that it is necessary in order to maintain portability between 4chan-style image boards.  This is not a concern of a serious man.  Plus, DES has been considered extremely insecure for a quarter-century and can be cracked in hours on commodity hardware, as has been demonstrated here.  That presumptive hero would, under no circumstances, embed an insult and a lie into that very cryptographic signature (see technical discussion that follows for details).</p><p>The person who would do that is not a patriot, not an operator, and not a hero.  This person is a vain child.</p><p>It is hard as hell for me to admit when I’ve been fooled. I have been in that place.  It is humiliating. I beg you not to turn away from this message, and to absorb the short-term suffering that recognition and repentance entails.  I don’t think that you will find it impossible, because you are tough.  If you have trusted Q, you have lived a hard existence these last months.  The world is hard enough as it is without shouldering the responsibility of fighting a hyper-competent, irredeemably evil enemy on your own.  It is a terribly isolating thing.</p><p>To escape and survive, you’ve likely made friends with others who believe, and you’ve endured this difficult world-view together.  Embrace that friendship and camaraderie, because it is a rare thing in our lonely age!  Take that energy, together, and go out and use it as our Founders intended.  Register each other to vote, canvas, run for office, persuade your fellows, read everything, and trust only that which is worth your heart, your effort, your blood and treasure.  Most of all, do not be discouraged for long, because your country still needs you.  Our foes are merely human, and can be overcome by you and me and others with true faith and sincere human effort.</p><p>Technical discussion:<br>I am not a infosec expert, so please feel view this analysis with a skeptical eye, and as always, do your own research!<br>Q verifies his identity via a cryptographic signature, or “tripcodes.”  These tripcode hashes (e.g. CbboFOtcZs ) are based on the DES/crypt(3) encryption algorithm.  DES (Digital Encryption Standard) was standardized in 1977 and has been largely deprecated due to widely-known weaknesses.  A good primer on these weaknesses from way back in 1997 can be found here: http://personal.stevens.edu/~khockenb/crypt3.html .   Tripcodes are created via the algorithm described here: http://www.thefullwiki.org/Tripcode.  I suspect that if such an operation were carried out, the coordinator would at least sign messages using an algorithm from the NSA Suite B, such as the Advanced Encryption Standard (AES) — or even a PGP signature — so that an opponent couldn’t hijack his identity as easily as has been done here.  He may upgrade his standards after reading this, but frankly, it is a far too late to matter.<br>Using an open source password cracker (hashcat), publicly available information, and a little guess work about Q’s favored key space, a user can successfully recover all of the passwords that correspond to Q tripcodes. These are posted below in chronological order of use:<br>Tripcode:  ITPb.qbhqo  -&gt;  Password:  Matlock<br>Tripcode:  UW.yye1fxo  -&gt;  Password:  M@tlock!<br>Tripcode:  xowAT4Z3VQ  -&gt;  Password:  Freed@m-<br>Tripcode:  2jsTvXXmXs  -&gt;  Password:  F!ghtF!g<br>Tripcode:  4pRcUA0lBE  -&gt;  Password:  NowC@mes<br>Tripcode:  CbboFOtcZs  -&gt;  Password:  StoRMkiL<br>Tripcode:  A6yxsPKia.  -&gt;  Password:  WeAReQ@Q<br>Note that Q seems to be unaware that the algorithm only takes the first 8 characters of the password and ignores the rest.  In the past, Q has claimed to have baked meaning and foreknowledge of future events into these passwords, in particular, the 4pRcUA0lBE:NowC@mes tripcode-password pair.  If I understand correctly, Q claims that the full password was “NowC@mesTHEP@in—23,” with 23 signifying the date of an important event, but anything beginning with “NowC@mes” would yield the same tripcode signature.  This weakness severely undercuts any claimed predictive power and indicates a possible intent to mislead.  For example, all of the following passwords should yield the same tripcode, 4pRcUA0lBE:<br>NowC@mesTheKing      — Q is Snoop Dogg<br>NowC@mesTheSun       — Q is Ringo Starr<br>NowC@mesTheAnswer-42 — Q is Douglas Adams<br>These can all be tested at at minichan’s tripcode test page. https://minichan.org/triptest?name=A{64c1a3d9a40559511922326ab01596b0c1a24761117e0e4906b04888ba2118a8}23NowC{64c1a3d9a40559511922326ab01596b0c1a24761117e0e4906b04888ba2118a8}40mesTheAnswer-42 .</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>To directly test all of these examples with a DES cypher, go to https://www.functions-online.com/crypt.html , paste the password in, and use the second and third characters of the password as the salt.  The tripcode will be the final ten characters of the resulting DES hash. Most concerning to me is the penultimate password, which contains the word “StoRM,” which is Q’s prophesied calamity which will sweep away those Q calls out as enemies and may involve mass arrests, executions, and institution of martial law in the worst case.  The second part, “kiL”, is self-explanatory.  Both of these are especially concerning since Q has been ramping of his rhetoric of late.  I urge everyone to be VERY careful before taking action which could injure anyone, especially yourself, your family, and your fellow patriots, at Q’s direction.  I do not believe he has our values or best interests at heart.</p><p>Finally, many of you know someone who has handled highly classified information, worked in SCIFs, and communicated securely in a professional context.  I urge you to seek their wisdom in this matter, to evaluate to feasibility of Q’s claims.  I also urge you to study the National Industrial Security Program Operating Manual (NISPOM), which covers handling and protection of national security information in exhaustive detail, then contrast its instructions with what “Q” is doing.</p><p>It is my hope that I am blowing this all out of proportion, and I apologize if I am making mountains out of molehills. However, I feel that it is my duty to pass this on to you all, just in case.  God bless you, and thank you again for your time and all your hard work.</p></blockquote><p>Hello, fellow Patriots! This concern-trolling aimed at discrediting and disqualifying Q, more than anything we’ve seen yet, is evidence that the Q project is legitimate on some level, regardless of how it originally started. This deeply concerned troll protests WAY too much, and as anyone with any literary ability can see, the above pastebin was written by at least three different people, each pushing a different aspect of the desired narrative.</p><p>It should also demonstrate to you the importance of controlled opposition and explain why the likes of Ben Shapiro, Jordan Peterson, Candace Owen, and the next conservative du jour are being constantly pushed on you. They desperately need conservatives to “keep the faith in the system”, to “Take that energy, together, and go out and use it as our Founders intended.” They do not want you noticing anomalies, observing underlying patterns, and asking uncomfortable questions about them.</p><p>The rhetoric is total nonsense, which you will note is a commonly observed theme among the conops. This is the worst of it: <i>“Anyone who betrays those founding values by asking us to suspend trust in well-constructed arguments and the knowable is betraying the foundation of our law, our history, and our civilization.”</i><br><i><br/></i>Really? Skepticism about syllogisms and scientage is treason? That’s a fascinating claim. And to the contrary, history shows that asking questions is an important element of the religious faith that is the basis for Western Civilization. Of course, this isn’t the first time that a man who asks questions has troubled the authorities. Nearly thousand years ago, a man asked his followers, “Who do you say I am?”</br></p><p><i>It is my belief that Q is a young, untrained American man who is playing games with your faith, your hope, and your love of country, mostly because he finds it amusing.  I believe he may call you to violence, not to save our home, but merely for entertainment.</i></p><p>Oh Sweet Saint Detective Comics! Do you realize what this means? <i style=\"font-weight: bold;\">Q is THE JOKER!</i></p></div>",
  "content_text": "We are under HEAVY attack.\nAB(C) took control\nTripcode compromised\nNeon Revolt\npointed out what looks like a Clown operation\ntaking advantage of the tripcode:\nAn Appeal to Patriots\nI’m scared for my country, and I am especially scared for you good people who look to this space for guidance.  I have seen how my folks are suffering.  No one has money.   Half of my family is suffering from issues relating to drug abuse.  Honest work is getting hard to find for the ill-connected.  I see the accomplishments of my parents and grandparents and wonder how so many of my generation are barely holding on, fighting hard to stay in the middle class.\nWays of life that have existed for a century are vanishing, often because of decisions made via algorithms whose inner workings cannot be comprehended by any single living human being.  The world is shifting away under our feet, largely due to inscrutable forces with no historical parallel.   Change is everywhere and can be sourced to nowhere.  Sneering elites in government and the media look down on us and assure us that this is all our fault.  It is difficult to know who to trust.\nIn times like these, we reach out for any comfort we can find.  We want to help, we want to put our meager power together with others and fix it all. There are people out there in the world who will take advantage of this powerful need.  Politicians, business leaders, religions…and others.\nI firmly believe that all of you love the United States of America, and revere the work of our Founding Fathers, mighty men who led the world in skill and learning.  Men like Jefferson and Madison, Washington and Hamilton.  Men who revered reason and the exploration of natural law.  Over and over again in their writings, they expound the world view of the Enlightenment, among whose core values is that there is a singular, true natural order established by our Creator, and that all things must obey that law, and that this natural law is fundamentally knowable by human kind.  That from that order flows the equality of men, and the rights to life, liberty, and the pursuit of happiness.\nOn this basis our Fathers forged our great nation.  They did not always agree on what should be built upon that firm foundation, but through conflict and struggle with one another they built the great compromise that is embodied by our Constitution, whose fruit has been unparalleled freedom.\nIt is my belief that anyone who betrays those founding values by asking us to suspend trust in well-constructed arguments and the knowable is betraying the foundation of our law, our history, and our civilization.  I believe that exhortations to abandon friends and family in favor of numerology and cryptic messages are the products of charlatans, not patriots.\nIt is my belief that Q is a charlatan.\nIt is my belief that Q is a young, untrained American man who is playing games with your faith, your hope, and your love of country, mostly because he finds it amusing.  I believe he may call you to violence, not to save our home, but merely for entertainment.\nThere are many arguments for this, but I will name a few that Q has been gleefully rubbing our noses in since the beginning.\nFirstly, his name itself.  “Q”, after the Department of Energy’s Q clearance.  I have had the opportunity to work in our country’s national labs, and have worked with some of those clever, hard-working folks that hold Q clearance.  A Q clearance grants access to carefully compartmentalized nuclear weapons information.  One who holds a Q clearance is a scientist, engineer, or manager who is deemed trustworthy by classifying authorities.  Q clearance holders are people who employ our nation’s most dangerous technical secrets to manufacture and maintain weaponry than can end the world in a flash of baleful fire.\nThey are not experts in spycraft and combat operations.\nIf, for some curious reason, our President put a Q clearance individual in charge of such an operation, it is not believable that anyone would issue commands and share national security information with strangers via a cobbled-together web site of uncertain security…particularly if said website’s claim to fame was a loud public argument about about video games.\nIf that catastrophic chain of events were to take place somehow, this nuclear/black ops guru would not stoop so low as to secure this essential line of communication with a DES/crypt(3) based tripcode hash, with the excuse that it is necessary in order to maintain portability between 4chan-style image boards.  This is not a concern of a serious man.  Plus, DES has been considered extremely insecure for a quarter-century and can be cracked in hours on commodity hardware, as has been demonstrated here.  That presumptive hero would, under no circumstances, embed an insult and a lie into that very cryptographic signature (see technical discussion that follows for details).\nThe person who would do that is not a patriot, not an operator, and not a hero.  This person is a vain child.\nIt is hard as hell for me to admit when I’ve been fooled. I have been in that place.  It is humiliating. I beg you not to turn away from this message, and to absorb the short-term suffering that recognition and repentance entails.  I don’t think that you will find it impossible, because you are tough.  If you have trusted Q, you have lived a hard existence these last months.  The world is hard enough as it is without shouldering the responsibility of fighting a hyper-competent, irredeemably evil enemy on your own.  It is a terribly isolating thing.\nTo escape and survive, you’ve likely made friends with others who believe, and you’ve endured this difficult world-view together.  Embrace that friendship and camaraderie, because it is a rare thing in our lonely age!  Take that energy, together, and go out and use it as our Founders intended.  Register each other to vote, canvas, run for office, persuade your fellows, read everything, and trust only that which is worth your heart, your effort, your blood and treasure.  Most of all, do not be discouraged for long, because your country still needs you.  Our foes are merely human, and can be overcome by you and me and others with true faith and sincere human effort.\nTechnical discussion:\nI am not a infosec expert, so please feel view this analysis with a skeptical eye, and as always, do your own research!\nQ verifies his identity via a cryptographic signature, or “tripcodes.”  These tripcode hashes (e.g. CbboFOtcZs ) are based on the DES/crypt(3) encryption algorithm.  DES (Digital Encryption Standard) was standardized in 1977 and has been largely deprecated due to widely-known weaknesses.  A good primer on these weaknesses from way back in 1997 can be found here: http://personal.stevens.edu/~khockenb/crypt3.html .   Tripcodes are created via the algorithm described here: http://www.thefullwiki.org/Tripcode.  I suspect that if such an operation were carried out, the coordinator would at least sign messages using an algorithm from the NSA Suite B, such as the Advanced Encryption Standard (AES) — or even a PGP signature — so that an opponent couldn’t hijack his identity as easily as has been done here.  He may upgrade his standards after reading this, but frankly, it is a far too late to matter.\nUsing an open source password cracker (hashcat), publicly available information, and a little guess work about Q’s favored key space, a user can successfully recover all of the passwords that correspond to Q tripcodes. These are posted below in chronological order of use:\nTripcode:  ITPb.qbhqo  ->  Password:  Matlock\nTripcode:  UW.yye1fxo  ->  Password:  M@tlock!\nTripcode:  xowAT4Z3VQ  ->  Password:  Freed@m-\nTripcode:  2jsTvXXmXs  ->  Password:  F!ghtF!g\nTripcode:  4pRcUA0lBE  ->  Password:  NowC@mes\nTripcode:  CbboFOtcZs  ->  Password:  StoRMkiL\nTripcode:  A6yxsPKia.  ->  Password:  WeAReQ@Q\nNote that Q seems to be unaware that the algorithm only takes the first 8 characters of the password and ignores the rest.  In the past, Q has claimed to have baked meaning and foreknowledge of future events into these passwords, in particular, the 4pRcUA0lBE:NowC@mes tripcode-password pair.  If I understand correctly, Q claims that the full password was “NowC@mesTHEP@in—23,” with 23 signifying the date of an important event, but anything beginning with “NowC@mes” would yield the same tripcode signature.  This weakness severely undercuts any claimed predictive power and indicates a possible intent to mislead.  For example, all of the following passwords should yield the same tripcode, 4pRcUA0lBE:\nNowC@mesTheKing      — Q is Snoop Dogg\nNowC@mesTheSun       — Q is Ringo Starr\nNowC@mesTheAnswer-42 — Q is Douglas Adams\nThese can all be tested at at minichan’s tripcode test page. https://minichan.org/triptest?name=A{64c1a3d9a40559511922326ab01596b0c1a24761117e0e4906b04888ba2118a8}23NowC{64c1a3d9a40559511922326ab01596b0c1a24761117e0e4906b04888ba2118a8}40mesTheAnswer-42 .\nTo directly test all of these examples with a DES cypher, go to https://www.functions-online.com/crypt.html , paste the password in, and use the second and third characters of the password as the salt.  The tripcode will be the final ten characters of the resulting DES hash. Most concerning to me is the penultimate password, which contains the word “StoRM,” which is Q’s prophesied calamity which will sweep away those Q calls out as enemies and may involve mass arrests, executions, and institution of martial law in the worst case.  The second part, “kiL”, is self-explanatory.  Both of these are especially concerning since Q has been ramping of his rhetoric of late.  I urge everyone to be VERY careful before taking action which could injure anyone, especially yourself, your family, and your fellow patriots, at Q’s direction.  I do not believe he has our values or best interests at heart.\nFinally, many of you know someone who has handled highly classified information, worked in SCIFs, and communicated securely in a professional context.  I urge you to seek their wisdom in this matter, to evaluate to feasibility of Q’s claims.  I also urge you to study the National Industrial Security Program Operating Manual (NISPOM), which covers handling and protection of national security information in exhaustive detail, then contrast its instructions with what “Q” is doing.\nIt is my hope that I am blowing this all out of proportion, and I apologize if I am making mountains out of molehills. However, I feel that it is my duty to pass this on to you all, just in case.  God bless you, and thank you again for your time and all your hard work.\nHello, fellow Patriots! This concern-trolling aimed at discrediting and disqualifying Q, more than anything we’ve seen yet, is evidence that the Q project is legitimate on some level, regardless of how it originally started. This deeply concerned troll protests WAY too much, and as anyone with any literary ability can see, the above pastebin was written by at least three different people, each pushing a different aspect of the desired narrative.\nIt should also demonstrate to you the importance of controlled opposition and explain why the likes of Ben Shapiro, Jordan Peterson, Candace Owen, and the next conservative du jour are being constantly pushed on you. They desperately need conservatives to “keep the faith in the system”, to “Take that energy, together, and go out and use it as our Founders intended.” They do not want you noticing anomalies, observing underlying patterns, and asking uncomfortable questions about them.\nThe rhetoric is total nonsense, which you will note is a commonly observed theme among the conops. This is the worst of it:\n“Anyone who betrays those founding values by asking us to suspend trust in well-constructed arguments and the knowable is betraying the foundation of our law, our history, and our civilization.”\nReally? Skepticism about syllogisms and scientage is treason? That’s a fascinating claim. And to the contrary, history shows that asking questions is an important element of the religious faith that is the basis for Western Civilization. Of course, this isn’t the first time that a man who asks questions has troubled the authorities. Nearly thousand years ago, a man asked his followers, “Who do you say I am?”\nIt is my belief that Q is a young, untrained American man who is playing games with your faith, your hope, and your love of country, mostly because he finds it amusing.  I believe he may call you to violence, not to save our home, but merely for entertainment.\nOh Sweet Saint Detective Comics! Do you realize what this means?\nQ is THE JOKER!",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-11T10:45:22+00:00"
}