{
  "url": "https://voxday.net/2018/08/06/what-else-did-you-expect-2/",
  "scraped_at": "2025-12-19T21:15:22.607552",
  "title": "What else did you expect?",
  "date_display": "August 6, 2018",
  "date_iso": "2018-08-06T19:54:13+00:00",
  "date_from_url": "2018-08-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am rolling my eyes at the hysterics that have greeted the news that <a href=\"https://www.rt.com/usa/435254-youtube-bans-alex-jones-infowars/\">YouTube has banned the Infowars channel</a> in coordination with Apple and Spotify banning its podcasts and Facebook banning its Facebook page.</p><blockquote><p>Paul Joseph Watson✔@PrisonPlanet<br>The Alex Jones Channel has been permanently DELETED by YouTube. This is a coordinated PURGE. This is political censorship.</br></p><p>Paul Joseph Watson✔@PrisonPlanet<br>Apple, Spotify, Facebook and now Google (which owns YouTube) – all within 12 hours of each other. A coordinated purge. This is a total abuse of power.</br></p></blockquote><p>BFD and book-freaking-hoo. When Alex asked me what the next step would be, I told him that they would be deplatforming the Right and attempting to defund it. This was not merely predictable, it was <i>obvious</i>. This is the exact opposite of a surprise. Complaining and crying about it will accomplish precisely nothing.</p><p>This is why we have to build our own platforms, as I have been advising for years. This is why you are shortsighted and strategically-challenged if you allow yourself to be dependent in any way on the platforms of your enemy, even if doing so maximizes your profits and is in your immediate short-term interests.</p><p>UPDATE: Before anyone starts worrying that I’ve been banned by Facebook, I deactivated my account myself. I would have deleted it, but the damned DELETE ACCOUNT page would not load no matter which browser I tried. I’ll delete it when I get the chance.</p></div>",
  "content_text": "I am rolling my eyes at the hysterics that have greeted the news that\nYouTube has banned the Infowars channel\nin coordination with Apple and Spotify banning its podcasts and Facebook banning its Facebook page.\nPaul Joseph Watson✔@PrisonPlanet\nThe Alex Jones Channel has been permanently DELETED by YouTube. This is a coordinated PURGE. This is political censorship.\nPaul Joseph Watson✔@PrisonPlanet\nApple, Spotify, Facebook and now Google (which owns YouTube) – all within 12 hours of each other. A coordinated purge. This is a total abuse of power.\nBFD and book-freaking-hoo. When Alex asked me what the next step would be, I told him that they would be deplatforming the Right and attempting to defund it. This was not merely predictable, it was\nobvious\n. This is the exact opposite of a surprise. Complaining and crying about it will accomplish precisely nothing.\nThis is why we have to build our own platforms, as I have been advising for years. This is why you are shortsighted and strategically-challenged if you allow yourself to be dependent in any way on the platforms of your enemy, even if doing so maximizes your profits and is in your immediate short-term interests.\nUPDATE: Before anyone starts worrying that I’ve been banned by Facebook, I deactivated my account myself. I would have deleted it, but the damned DELETE ACCOUNT page would not load no matter which browser I tried. I’ll delete it when I get the chance.",
  "tags": [
    "#AltTech"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-06T18:54:13+00:00"
}