{
  "url": "https://voxday.net/2018/08/24/why-the-bright-hate-the-dim/",
  "scraped_at": "2025-12-19T21:18:06.971080",
  "title": "Why the bright hate the dim",
  "date_display": "August 24, 2018",
  "date_iso": "2018-08-24T16:38:08+00:00",
  "date_from_url": "2018-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John C. Wright <a href=\"http://www.scifiwright.com/2018/08/the-sin-of-lucifer/\">asks a non-rhetorical question</a>:</p><blockquote class=\"tr_bq\"><p>In the ongoing and ever-losing battle with my own personal dragons of pride, I took to wondering: why is the proud man angry or peeved with the stupidity (real or imagined) of his fellows? I ask because one would think a saint would be very patient with someone who was stupid, if it were honest stupidity, and not merely laziness in thinking. Whereas the devil (or Lex Luthor) is always in a state of haughtiest annoyance, because he is brighter than those around him. Their stupidity proves his superiority – yet it irks him. Why?</p></blockquote><p>I think there are different reasons that irk different people. Speaking only for myself, I truly don’t mind people being stupid or being absorbed in interests that I consider to be stupid, pointless, or uninteresting. Let’s face it, I consider the average individual to be almost unfathomably stupid, if not actually retarded, and that doesn’t anger me any more than the fact that Spacebunny’s Ridgeback can’t work out differential equations. That being said, I do get extremely annoyed when one of the great masses of my intellectual inferiors takes it upon himself to attempt to correct me, almost invariably incorrectly, and in a manner that indicates that he didn’t even begin to understand what I wrote or said.</p><p>Take it or leave it, as you like, but don’t discuss it with me, don’t ask me about it unless I’ve indicated I am available for questions, and don’t even think about trying to “correct” me.</p><p>I also dislike when people tell me things that are obviously false or illogical and present them as factual, or even as conclusively true. I tend to regard this as a personal insult, since I find it offensive that they would imagine that I would not see through their transparent pretensions. This is probably why I hate midwits and gammas so much, and why the idiotic way in which they smugly posture and strike false poses is something I simply will not tolerate in my presence or on my blog.</p><p>It’s also somewhat beside the point that someone else’s stupidity “proves” my intellectual superiority to him. This is the one thing that normal people and midwits cannot ever seem to grasp about the highly intelligent. <i>WE KNOW</i>. We have <i>always </i>known. We can’t help but know. There is no way to avoid noticing it. You might need the proof, but we don’t and <i>we never have</i>. Because being smarter is no different than being taller, being faster, or being stronger; it’s just a readily observable state of relative being. That an outside observer can’t see the intelligence gap as easily, and that it bothers people more than other differences, doesn’t actually change anything.</p><p>As a child, all I ever wanted from the dim-witted was to be left alone. And they could not, <i>would not</i>, do that! Now, I don’t hate them, perhaps because over the last three decades I’ve successfully managed to arrange my life to minimize my daily contact with normal people. I can go days without ever speaking so much as a single word to anyone with an IQ below 120. But while I don’t blame the dim for their lack of intelligence, I find that I can’t blame the intelligent individuals who hate and despise them after enduring years of malicious abuse at their hands either. Because dim or not, it’s really not difficult to simply leave people the hell alone.</p><p>But before anyone gets too self-congratulatory about their intellectual superiority, here is an observation that will likely offend many of the more intelligent readers. I have noticed that the smart, but third-rate mind (which usually falls in the 130 to 145 range) inevitably feels the compulsion to explain itself because it needs the external confirmation of its self-assessment. First- and second-rate minds never require that confirmation because they are a) more confident in their self-assessment, and b) too accustomed to no one understanding or believing what they are saying from an early age.</p><p>Lest you dismiss what I am saying as simple arrogance, I would encourage you to keep in mind that the most reliably destructive behavior I have ever witnessed on the part of the highly intelligent is the equalitarian assumption that if they can grasp an idea or master an activity, so can anyone else with equal ease. Also, since I am literally retarded when it comes to spatial relations as well as protanomalous, I have a much deeper understanding of what it is like to be totally unable to see things than the average 3SD+ individual.</p><p>UPDATE: If you want to make life easier for the smart guy on your team and get along better with him, don’t repeatedly ask questions “just to confirm” things. It’s a maddening habit, and you can tell that you’re annoying the smart guy, whether he shows it or not, when he says things like, “the answer is still yes.” In fact, the word “still” serves as a pretty reliable indicator that the smart guy regards you as at least mildly retarded, particularly when it is spoken in patient, pleasant tones. The unspoken implication is that he suspects you will be genuinely surprised when you see the sun rise again tomorrow.</p></div>",
  "content_text": "John C. Wright\nasks a non-rhetorical question\n:\nIn the ongoing and ever-losing battle with my own personal dragons of pride, I took to wondering: why is the proud man angry or peeved with the stupidity (real or imagined) of his fellows? I ask because one would think a saint would be very patient with someone who was stupid, if it were honest stupidity, and not merely laziness in thinking. Whereas the devil (or Lex Luthor) is always in a state of haughtiest annoyance, because he is brighter than those around him. Their stupidity proves his superiority – yet it irks him. Why?\nI think there are different reasons that irk different people. Speaking only for myself, I truly don’t mind people being stupid or being absorbed in interests that I consider to be stupid, pointless, or uninteresting. Let’s face it, I consider the average individual to be almost unfathomably stupid, if not actually retarded, and that doesn’t anger me any more than the fact that Spacebunny’s Ridgeback can’t work out differential equations. That being said, I do get extremely annoyed when one of the great masses of my intellectual inferiors takes it upon himself to attempt to correct me, almost invariably incorrectly, and in a manner that indicates that he didn’t even begin to understand what I wrote or said.\nTake it or leave it, as you like, but don’t discuss it with me, don’t ask me about it unless I’ve indicated I am available for questions, and don’t even think about trying to “correct” me.\nI also dislike when people tell me things that are obviously false or illogical and present them as factual, or even as conclusively true. I tend to regard this as a personal insult, since I find it offensive that they would imagine that I would not see through their transparent pretensions. This is probably why I hate midwits and gammas so much, and why the idiotic way in which they smugly posture and strike false poses is something I simply will not tolerate in my presence or on my blog.\nIt’s also somewhat beside the point that someone else’s stupidity “proves” my intellectual superiority to him. This is the one thing that normal people and midwits cannot ever seem to grasp about the highly intelligent.\nWE KNOW\n. We have\nalways\nknown. We can’t help but know. There is no way to avoid noticing it. You might need the proof, but we don’t and\nwe never have\n. Because being smarter is no different than being taller, being faster, or being stronger; it’s just a readily observable state of relative being. That an outside observer can’t see the intelligence gap as easily, and that it bothers people more than other differences, doesn’t actually change anything.\nAs a child, all I ever wanted from the dim-witted was to be left alone. And they could not,\nwould not\n, do that! Now, I don’t hate them, perhaps because over the last three decades I’ve successfully managed to arrange my life to minimize my daily contact with normal people. I can go days without ever speaking so much as a single word to anyone with an IQ below 120. But while I don’t blame the dim for their lack of intelligence, I find that I can’t blame the intelligent individuals who hate and despise them after enduring years of malicious abuse at their hands either. Because dim or not, it’s really not difficult to simply leave people the hell alone.\nBut before anyone gets too self-congratulatory about their intellectual superiority, here is an observation that will likely offend many of the more intelligent readers. I have noticed that the smart, but third-rate mind (which usually falls in the 130 to 145 range) inevitably feels the compulsion to explain itself because it needs the external confirmation of its self-assessment. First- and second-rate minds never require that confirmation because they are a) more confident in their self-assessment, and b) too accustomed to no one understanding or believing what they are saying from an early age.\nLest you dismiss what I am saying as simple arrogance, I would encourage you to keep in mind that the most reliably destructive behavior I have ever witnessed on the part of the highly intelligent is the equalitarian assumption that if they can grasp an idea or master an activity, so can anyone else with equal ease. Also, since I am literally retarded when it comes to spatial relations as well as protanomalous, I have a much deeper understanding of what it is like to be totally unable to see things than the average 3SD+ individual.\nUPDATE: If you want to make life easier for the smart guy on your team and get along better with him, don’t repeatedly ask questions “just to confirm” things. It’s a maddening habit, and you can tell that you’re annoying the smart guy, whether he shows it or not, when he says things like, “the answer is still yes.” In fact, the word “still” serves as a pretty reliable indicator that the smart guy regards you as at least mildly retarded, particularly when it is spoken in patient, pleasant tones. The unspoken implication is that he suspects you will be genuinely surprised when you see the sun rise again tomorrow.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-08-24T15:38:08+00:00"
}