{
  "url": "https://voxday.net/2004/06/25/confused-quasi-conservatives/",
  "scraped_at": "2025-12-19T20:33:11.718096",
  "title": "Confused quasi-conservatives",
  "date_display": "June 25, 2004",
  "date_iso": "2004-06-25T07:10:00+00:00",
  "date_from_url": "2004-06-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Cliff Kincaid writes of Pat Buchanan: It was shocking news that Patrick J. Buchanan, Ronald Reagan’s communications director, is getting $500,000 to write a Bush-bashing book to be titled, <em>Where the Right Went Wrong</em>…. there are disturbing indications that Buchanan, who left the Republican Party in 2000, may even back Ralph Nader for president.  Buchanan’s American Conservative Magazine featured a front-page article, “Ralph Nader: Conservatively Speaking. The long-time progressive makes a pitch for the disenfranchised Right”….</p><p>Yet Buchanan’s magazine sounds increasingly like a left-wing publication with its constant talk of America’s “empire” around the world. This is a variation of the old Soviet line that the U.S. wants to dominate and control the world. It’s disconcerting to see conservatives who played key roles in fighting communism using such noxious terminology.</p><p>First, Pat Buchanan is never going to endorse Ralph Nader, who is a neosocialist egomaniac.  However, there is a real point of connection between a leftist like Nader, true conservative like Buchanan and a libertarian such as myself.  All three of us are diametrically opposed to the sacrifice of national sovereignty embraced by the Democratic Party and the dominant Bush-worshipping faction of the Republican Party.</p><p>What Kincaid and many other economically-illiterate Republicans fail to understand is that America does have an empire.  It is a shadow empire, to be sure, but it weighs more heavily and is felt more strongly than the Roman or British empires ever were in their dominions.  Ironically, the empire of the Imperial Dollar has never been more fragile or more in danger of collapsing than today, and with its inevitable collapse will come the reduction of America’s stature on the world stage.</p><p>Nader’s solutions are likely to prove disastrous than helpful, but unlike Bush and Kerry, he is neither invested in the present system of interlocking globalist institutions nor interested in sacrificing American interests to them.  Pat Buchanan realizes this, and in the very fact of the two distinctly different men finding common ground, demonstrates how the most deadly danger to the long-term existence of America lies within.</p></div>",
  "content_text": "Cliff Kincaid writes of Pat Buchanan: It was shocking news that Patrick J. Buchanan, Ronald Reagan’s communications director, is getting $500,000 to write a Bush-bashing book to be titled,\nWhere the Right Went Wrong\n…. there are disturbing indications that Buchanan, who left the Republican Party in 2000, may even back Ralph Nader for president.  Buchanan’s American Conservative Magazine featured a front-page article, “Ralph Nader: Conservatively Speaking. The long-time progressive makes a pitch for the disenfranchised Right”….\nYet Buchanan’s magazine sounds increasingly like a left-wing publication with its constant talk of America’s “empire” around the world. This is a variation of the old Soviet line that the U.S. wants to dominate and control the world. It’s disconcerting to see conservatives who played key roles in fighting communism using such noxious terminology.\nFirst, Pat Buchanan is never going to endorse Ralph Nader, who is a neosocialist egomaniac.  However, there is a real point of connection between a leftist like Nader, true conservative like Buchanan and a libertarian such as myself.  All three of us are diametrically opposed to the sacrifice of national sovereignty embraced by the Democratic Party and the dominant Bush-worshipping faction of the Republican Party.\nWhat Kincaid and many other economically-illiterate Republicans fail to understand is that America does have an empire.  It is a shadow empire, to be sure, but it weighs more heavily and is felt more strongly than the Roman or British empires ever were in their dominions.  Ironically, the empire of the Imperial Dollar has never been more fragile or more in danger of collapsing than today, and with its inevitable collapse will come the reduction of America’s stature on the world stage.\nNader’s solutions are likely to prove disastrous than helpful, but unlike Bush and Kerry, he is neither invested in the present system of interlocking globalist institutions nor interested in sacrificing American interests to them.  Pat Buchanan realizes this, and in the very fact of the two distinctly different men finding common ground, demonstrates how the most deadly danger to the long-term existence of America lies within.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-25T06:10:00+00:00"
}