{
  "url": "https://voxday.net/2004/06/09/divorce-link/",
  "scraped_at": "2025-12-19T20:31:13.995745",
  "title": "The divorce link",
  "date_display": "June 9, 2004",
  "date_iso": "2004-06-09T23:15:00+00:00",
  "date_from_url": "2004-06-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From <a href=\"http://www.nps.gov/wori/declaration.htm\">the Declaration of Sentiments</a>: “He has so framed the laws of divorce, as to what shall be the proper causes of divorce, in case of separation, to whom the guardianship of the children shall be given; as to be wholly regardless of the happiness of the women – the law, in all cases, going upon a false supposition of the supremacy of man, and giving all power into his hands.”</p><p>So, one of the first things women wanted to do upon getting the vote they were demanding was change the divorce laws.  This was declared publicly by the Seneca Falls Convention in 1848.  It took 72 years, but women got the vote in 1920.  Only 49 years later, the first no-fault divorce law was signed by Ronald Reagan in California.  Women now initiate 75-80 percent of all American divorces and I don’t think anyone would argue the fact that the divorce courts are significantly biased towards women.</p><p>Probably a complete coincidence.  Thanks for the tip, Bufelda, I’d forgotten about that.</p></div>",
  "content_text": "From\nthe Declaration of Sentiments\n: “He has so framed the laws of divorce, as to what shall be the proper causes of divorce, in case of separation, to whom the guardianship of the children shall be given; as to be wholly regardless of the happiness of the women – the law, in all cases, going upon a false supposition of the supremacy of man, and giving all power into his hands.”\nSo, one of the first things women wanted to do upon getting the vote they were demanding was change the divorce laws.  This was declared publicly by the Seneca Falls Convention in 1848.  It took 72 years, but women got the vote in 1920.  Only 49 years later, the first no-fault divorce law was signed by Ronald Reagan in California.  Women now initiate 75-80 percent of all American divorces and I don’t think anyone would argue the fact that the divorce courts are significantly biased towards women.\nProbably a complete coincidence.  Thanks for the tip, Bufelda, I’d forgotten about that.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-09T22:15:00+00:00"
}