{
  "url": "https://voxday.net/2004/06/28/eco-on-political-correctness/",
  "scraped_at": "2025-12-19T20:33:40.316039",
  "title": "Eco on Political Correctness",
  "date_display": "June 28, 2004",
  "date_iso": "2004-06-28T10:22:00+00:00",
  "date_from_url": "2004-06-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s probably bordering on insane to use Umberto Eco, who is considered notoriously difficult reading in Italy, as translation practice, but the upside is that it makes reading everything else pretty easy by comparison.  The downside is that he enjoys creating plays on words and idiomatic turns of phrase that are completely incomprehensible to me.  Still, the challenge is intriguing.  The article appeared in L’espresso on June 11; as always, I can guarantee several glaring mistakes and blame for all infelicities should be laid at my door, not that of the Great One himself.</p><p><b><a href=\"http://www.espressonline.it/eol/free/jsp/detail.jsp?m1s=o&amp;m2s=null&amp;idCategory=4789&amp;idContent=559564\">La Pistola dell’Ostrega</a></b>(1)</p><p>Political Correctness is a true and proper movement born in the American universities of liberal and radical inspiration, therefore of the Left, with an eye towards acknowledging multiculturalism and reducing some of the ingrained linguistic vices that established lines of discrimination confronting various minorities.  And therefore they began to say “blacks” and later “Afro Americans” instead of “negroes”, and “gay” instead of the thousands of other notorious appellations reserved for disparaging homosexuals.</p><p>Naturally, this campaign for the purification of the language has produced a true fundamentalism, which has led to the notable case in which some feminists proposed to no longer say “history” since it begins with the pronoun “his”, as they thought this meant that the story was “his”, but  instead to say “herstory” – her story – obviously ignoring the Greco-Latin etymology which has no gender implications.</p><p>However, the tendency has assumed also neoconservative, or frankly, reactionary aspects.  If you decide to no longer call people in wheelchairs handicapped or even disabled, but “differently abled” and after do not construct access ramps in public places, it is evident that you have hypocritically removed the word but not the problem.  And the same is true if you substitute saying “indefinitely unoccupied” for fired or “in a program of transition to change careers” for dismissed.  Who knows why a banker isn’t ashamed of his title and  doesn’t insist on being called an operator in the field of savings.  If it’s not working, changing the name won’t fix it.</p><p>On these and an infinity of other problems, Edoardo Crisafulli amuses in his book “The Politically Correct and Linguistic Liberty”, which strips naked all these contradictions.  He takes on both sides, pro and con, and is always very entertaining.  Reading it, however, I came to reflect on the curious case of our country.  While Political Correctness exploded elsewhere, in our case it was diffused and instead we are always developing more and more Political Incorrectness.  If, at one time, one would read a newspaper and a politician would say: “As a politics of convergence is emerging, one would prefer an asymptotic choice that eliminated single points of intersection”; today he prefers to say: “Dialogue?  To Hell with that dirty son of a bitch!”</p><p>It is true that at one time in old Communist circles they used to label the adversary as “horseflies” and in speaking during a fracas, they might have chosen to use a lexicon more incontinent than that of a longshoreman, but that was in a time when there were no limits to what one could say – it was accepted as an affectation – as was once the case in the gentlemen’s clubs of venerated memory – where the gentlemen were not verbally inhibited.  Today, instead, the technique of an insult is televised, a sign of unconcious faith in the valor of democracy.</p><p>It probably began with Bossi(2), in which his manly hardness obviously alludes to the softness of other people, and the appellation of “Berluskaz(3)” was unmistakable but the thing spread widely.  Stefano Bartezzaghi, writing under the name <i>Venerdi di Repubblica</i>, cites the play of insults today in circulation, but in good fun, all things considered.</p><p>Therefore, I too must contribute to the sweetness of Politically Incorrect Italian, and as I have consulted a series of dictionaries and dialects, permit me to suggest some polite and good-natured expressions with which to insult your enemy, graceful words: pistola dell’ostrega, papaciugo, imbolsito, crapapelata, piffero, marocchino, pivellone, ciulandario, morlacco, badalucco, pischimpirola…[long, long list of like insults removed for the sake of brevity].</p><p>(1) Ostrega can’t be found in most dictionaries.  The title, as near as I can tell, means “the weapon (pistol) of gosh”, although for a while I thought he was playing off the term “strega” witch or “ostrica” oyster.  This led me to wonder if there wasn’t some deeper profundity there, but Vittorio emails to explain: <i>“ostrega” is an old exclamation in Venetian dialect.</i><br> <br>(2) Vittorio also adds: <i>in the 1980’s the Northern League, led by Umberto Bossi, had a celebrated slogan “The League is the one that is hard” used against PC.  That’s where “celodurismo” comes from.  I don’t know about “celoflocismo”.</i> My undestanding is that Eco is implying overtones of hardness and softness as they relate to male tumescence.  Alessandro also writes to explain: <i>Celodurismo is a neologism in Italian politics derived from the (in)famous phrase by Umberto Bossi: “ce l’ho duro” meaning “I got an hard-on and I can keep it up for hours!”, so that celodurismo means a rough and boasting attitude which is typical of Umberto Bossi and his mates of the Lega Nord political party. Actually, I never heard of celoflocismo, but it surely derives from “ce l’ho floscio” which is quite the contrary of “ce l’ho duro” so that celoflocismo means the contrary of celodurismo.</i><br> <br>(3) “Berluskaz” is likely a combination of “Berlusconi” and “catzo”, saying that Silvio Berlusconi, the Prime Minister and owner of AC Milan, is a motherf—–.  Well, they won the Scudetto this year, so deal.</br></br></br></br></p></div>",
  "content_text": "It’s probably bordering on insane to use Umberto Eco, who is considered notoriously difficult reading in Italy, as translation practice, but the upside is that it makes reading everything else pretty easy by comparison.  The downside is that he enjoys creating plays on words and idiomatic turns of phrase that are completely incomprehensible to me.  Still, the challenge is intriguing.  The article appeared in L’espresso on June 11; as always, I can guarantee several glaring mistakes and blame for all infelicities should be laid at my door, not that of the Great One himself.\nLa Pistola dell’Ostrega\n(1)\nPolitical Correctness is a true and proper movement born in the American universities of liberal and radical inspiration, therefore of the Left, with an eye towards acknowledging multiculturalism and reducing some of the ingrained linguistic vices that established lines of discrimination confronting various minorities.  And therefore they began to say “blacks” and later “Afro Americans” instead of “negroes”, and “gay” instead of the thousands of other notorious appellations reserved for disparaging homosexuals.\nNaturally, this campaign for the purification of the language has produced a true fundamentalism, which has led to the notable case in which some feminists proposed to no longer say “history” since it begins with the pronoun “his”, as they thought this meant that the story was “his”, but  instead to say “herstory” – her story – obviously ignoring the Greco-Latin etymology which has no gender implications.\nHowever, the tendency has assumed also neoconservative, or frankly, reactionary aspects.  If you decide to no longer call people in wheelchairs handicapped or even disabled, but “differently abled” and after do not construct access ramps in public places, it is evident that you have hypocritically removed the word but not the problem.  And the same is true if you substitute saying “indefinitely unoccupied” for fired or “in a program of transition to change careers” for dismissed.  Who knows why a banker isn’t ashamed of his title and  doesn’t insist on being called an operator in the field of savings.  If it’s not working, changing the name won’t fix it.\nOn these and an infinity of other problems, Edoardo Crisafulli amuses in his book “The Politically Correct and Linguistic Liberty”, which strips naked all these contradictions.  He takes on both sides, pro and con, and is always very entertaining.  Reading it, however, I came to reflect on the curious case of our country.  While Political Correctness exploded elsewhere, in our case it was diffused and instead we are always developing more and more Political Incorrectness.  If, at one time, one would read a newspaper and a politician would say: “As a politics of convergence is emerging, one would prefer an asymptotic choice that eliminated single points of intersection”; today he prefers to say: “Dialogue?  To Hell with that dirty son of a bitch!”\nIt is true that at one time in old Communist circles they used to label the adversary as “horseflies” and in speaking during a fracas, they might have chosen to use a lexicon more incontinent than that of a longshoreman, but that was in a time when there were no limits to what one could say – it was accepted as an affectation – as was once the case in the gentlemen’s clubs of venerated memory – where the gentlemen were not verbally inhibited.  Today, instead, the technique of an insult is televised, a sign of unconcious faith in the valor of democracy.\nIt probably began with Bossi(2), in which his manly hardness obviously alludes to the softness of other people, and the appellation of “Berluskaz(3)” was unmistakable but the thing spread widely.  Stefano Bartezzaghi, writing under the name\nVenerdi di Repubblica\n, cites the play of insults today in circulation, but in good fun, all things considered.\nTherefore, I too must contribute to the sweetness of Politically Incorrect Italian, and as I have consulted a series of dictionaries and dialects, permit me to suggest some polite and good-natured expressions with which to insult your enemy, graceful words: pistola dell’ostrega, papaciugo, imbolsito, crapapelata, piffero, marocchino, pivellone, ciulandario, morlacco, badalucco, pischimpirola…[long, long list of like insults removed for the sake of brevity].\n(1) Ostrega can’t be found in most dictionaries.  The title, as near as I can tell, means “the weapon (pistol) of gosh”, although for a while I thought he was playing off the term “strega” witch or “ostrica” oyster.  This led me to wonder if there wasn’t some deeper profundity there, but Vittorio emails to explain:\n“ostrega” is an old exclamation in Venetian dialect.\n(2) Vittorio also adds:\nin the 1980’s the Northern League, led by Umberto Bossi, had a celebrated slogan “The League is the one that is hard” used against PC.  That’s where “celodurismo” comes from.  I don’t know about “celoflocismo”.\nMy undestanding is that Eco is implying overtones of hardness and softness as they relate to male tumescence.  Alessandro also writes to explain:\nCelodurismo is a neologism in Italian politics derived from the (in)famous phrase by Umberto Bossi: “ce l’ho duro” meaning “I got an hard-on and I can keep it up for hours!”, so that celodurismo means a rough and boasting attitude which is typical of Umberto Bossi and his mates of the Lega Nord political party. Actually, I never heard of celoflocismo, but it surely derives from “ce l’ho floscio” which is quite the contrary of “ce l’ho duro” so that celoflocismo means the contrary of celodurismo.\n(3) “Berluskaz” is likely a combination of “Berlusconi” and “catzo”, saying that Silvio Berlusconi, the Prime Minister and owner of AC Milan, is a motherf—–.  Well, they won the Scudetto this year, so deal.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-28T09:22:00+00:00"
}