{
  "url": "https://voxday.net/2004/06/29/fleeing-from-fascis/",
  "scraped_at": "2025-12-19T20:33:47.702087",
  "title": "Fleeing from fascism",
  "date_display": "June 29, 2004",
  "date_iso": "2004-06-29T10:16:00+00:00",
  "date_from_url": "2004-06-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>Dark Window <a href=\"http://darkwindow.blogspot.com/2004/06/vox-day-ponders-fascism.html\">hurls accusations of goofiness</a>:</b> [Vox’s] new column implies that it’s actually modern-day liberals who are the fascists and to prove his point, he gives us his own translation of Mussolini’s Fascist Manifesto. I encourage you to go read the article itself as it’s a little long to quote here at length…. Frankly, I don’t like it when any side throws around highly-charged names like Nazi or Fascist or Communist to describe a political foe. And unfortunately, this seems to be happening with alarming regularity these days. These terms come flying from both Left and Right and although the people throwing them will generally say they’re simply pointing out similarities between a particular person and a particular historical policy of one of the above-mentioned groups, their actual intention is obviously not to engage in a close historical reading of political theory. Rather, it’s to generate the extremely visceral reactions associated with things like the Final Solution or Gulags or Death Camps or Totalitarianism. I think it’s wrong when either side engages in this activity and, frankly, I think it generally masks an inability to debate the merits of particular issues or policies. It’s far easier to call somebody a Nazi or a Commie than it is to participate in a reasoned debate.</p><p>Now, I like Dark Window and I agree that the name-calling is often pointless, however, as one who has extensively read through the history and intellectual development of Fascist, National Socialist and Communist ideologies, (as well as other, less famous leftist variants), I am not simply attempting to generate visceral reactions.  Instead, I am methodically demonstrating how the Left has been successful in hiding the direct relationship between its modern forms and its historical forms for which most people harbor great loathing.  So, I have to salute DW for making what is the only possible argument against the left-wing nature of facism.  Unfortunately for him, it is ultimately a weak one.</p><p>But back to Vox. His main argument seems to be that since Mussolini used what amounts to a propoganda piece to advocate things like women’s suffrage, a minimum wage, and systemization of national transportation, that liberals are far more fascist than conservatives or libertarians.  The mistake Vox makes is to draw the simplistic conclusion that if Mussolini wrote something in his manifesto, it’s what fascism came to be and what we mean when we use the term today.</p><p>It would only amount to a mere propaganda piece if Mussolini had not subsequently enacted those very measures he was advocating in his manifesto.  Take women’s suffrage  for example: Mussolini took power in 1922 and women were granted suffrage in 1925, albeit with some restrictions.  He did precisely as he promised in the manifesto when the Charter of Labour was enacted, setting up twenty-two syndicates where membership was compulsory for employers and employees, each controlled by a party member.  Furthermore, if the manifesto is to be viewed as nothing but a meaningless propaganda piece, it seems most strange that it should threaten the Catholic Church, which was still a popular institution in Italy.</p><p>As with most American liberals, Dark Window is uncomfortable with the simplistic notion that written documents, such as the U.S. Constitution, mean what they say.  This discomfort with textual precision is why the modern Left has such a difficult time coming to terms with aggressive forces such as the global jihad, as they cannot believe that bin Laden is so simplistic as to announce his intentions.  Why would he, they think, when they themselves are sophisticated enough hide their true intentions?</p><p>Quite the contrary, the manifesto was written to wrest control of the government by gaining wide popular acceptance through political compromise. The words of the manifesto bear very little resemblance to what is meant by modern political theorists when they describe the doctrines of fascism. Once Mussolini gained power, he governed in a very different manner than that espoused in his manifesto. Industries were not nationalized but run under a structure of corporatism strongly influenced by the Church. Even more importantly, the driving factor of actual fascism was not to create an egalitarian society but to centralize power in the hands of a small and strongly nationalistic ruling body.</p><p>Modern political theorists either define the term so broadly as to be almost meaningless, or turn it back around in a circular definition equally devoid of meaning.  What is fascism?  The governing philosophy of Benito Mussolini’s party.  What was the governing philosophy of Benito Mussolini’s historical party?  Facism.  The Church corporatism, or <i>corporativismo</i> to which DW refers is simply a form of collective class collaboration proposed by Pope Leo as an alternative to Marxian class conflict, but it has nothing to do with Christianity or capitalism and is yet another collectivist left-wing concept.  Furthermore, Mussolini never had any intention of coming to power through compromise, as his planned 1922 march on Rome clearly shows.</p><p>What is amusing here is that DW fails to recognize that the driving factor of EVERY left-wing ideology is to centralize power in the hands of a small ruling body.  This is true of Bolshevist Marxist-Leninism, of Maoist Communism, of the Khmer Rouge, of the National Socialists, and, it must be noted, of the corrupt Democratic-Republican globalist cabal.  It is surely the height of irony that the heirs of Marxian dialectic cannot seem to recognize it at work in their own ideologies.</p><p>Finally, DW’s position is wholly anti-intellectual.  Taken to its conclusion, it suggests that ideas which cannot be put immediately into practice have no standing.  The Left often attempts to have its cake and eat it too, in its common argument that Soviet Communism as practiced between 1917 and 1989 is not true communism as theorized by Marx, but Italian Fascism as practiced between 1922 and 1939, on the other hand, is true facism, all contradictions to fascist theory as theorized by Giovanni Gentile notwithstanding.</p><p>“And yet, the only serious question is if it is more ironic to tar a libertarian or a member of the Religious Right with the fascist brush, as one seldom hears James Dobson calling for the government seizure of all church-owned property.”  That’s your only serious question, Vox? Considering the very strong ties between the Catholic Church and Mussolini’s fascist party during the early years of power and the Church’s strong influence over him and his policies during his entire reign, your example seems to break down. Because if there’s one thing Dobson is calling for, it’s more religious influence on our national leaders.</p><p>The “strong ties” to which DW refers are precisely the opposite of what he is implying.  Far from a partnership, the Church-Party relationship was an uneasy one of two opposing parties unable to gain sole supremacy.  Once Mussolini realized that in confronting the Catholic Church he was taking on “a colossal force”, he arranged to make accomodations in much the same way that Lenin made capitalistic compromises in his New Economic Program of 1925.  Did Lenin therefore have strong ties to capitalism?  If one reads the actual text of the <a href=\"http://www.aloha.net/~mikesch/treaty.htm\">Lateran Treaties</a>, one quickly realizes that this is essentially a bribe, providing the Church with the land and sovereignty of what is now the independent Vatican in return for a free hand in the governance of Italy.</p><p>“In 1925, Mussolini encapsulated the heart of fascist philosophy in a memorable phrase: Tutto nello Stato, niente al di fuori dello Stato, nulla contro lo Stato. This means “Everything in the State, nothing outside the State, nothing against the State.” Now, I ask you, in the Year of Our Lord 2004, does that sound more like a Libertarian, a Republican or a Democrat?” If you read that in light of Mussolini’s actions, you know that his definition of “the State” is far different than what Vox is implying. Replace “State” with “Strong Nationalistic Leader” and ask that last question again.</p><p>Here DW completely loses the plot.   Mussolini may have come to believe that he was the State, (and certainly his assertion “the Fascist State is itself conscious and has itself a will and a personality” is suspicious), but regardless of whether he is referring to himself, a vanguard of the People or a freely elected representative body, he shares with today’s Democrats a belief that there is nothing outside the lawful purview of the national government.</p><p><em>PS – Just to set the record straight, it was not Dark Window or any of those who took up his Vox Challenge that made accusations of facism.  I received several emails subsequent to the suffrage post that also made statements regarding my ancestry, my sexual preferences and the amount of fecal matter in my intestines.  Now, DW can be hysterical, to be sure, but usually in the funny sense – Up yours, Luxembourg!</em></p><p>PPS – Dark Window adds: Update: Vox has posted an enjoyable and spirited response to this piece over at his own blog. Sadly, I will not be at home much the next couple of days so in lieu of a proper riposte on my part, I simply direct you over to him and invite you to formulate your own conclusions. In this instance, I happily cede the last word to him.</p><p>I can’t take any joy in having the last word here, as he’s clearly off to spend a week meditating in the forest as he mourns the tragic passing of Les Bleus, dead of self-asphyxiation.</p></div>",
  "content_text": "Dark Window\nhurls accusations of goofiness\n:\n[Vox’s] new column implies that it’s actually modern-day liberals who are the fascists and to prove his point, he gives us his own translation of Mussolini’s Fascist Manifesto. I encourage you to go read the article itself as it’s a little long to quote here at length…. Frankly, I don’t like it when any side throws around highly-charged names like Nazi or Fascist or Communist to describe a political foe. And unfortunately, this seems to be happening with alarming regularity these days. These terms come flying from both Left and Right and although the people throwing them will generally say they’re simply pointing out similarities between a particular person and a particular historical policy of one of the above-mentioned groups, their actual intention is obviously not to engage in a close historical reading of political theory. Rather, it’s to generate the extremely visceral reactions associated with things like the Final Solution or Gulags or Death Camps or Totalitarianism. I think it’s wrong when either side engages in this activity and, frankly, I think it generally masks an inability to debate the merits of particular issues or policies. It’s far easier to call somebody a Nazi or a Commie than it is to participate in a reasoned debate.\nNow, I like Dark Window and I agree that the name-calling is often pointless, however, as one who has extensively read through the history and intellectual development of Fascist, National Socialist and Communist ideologies, (as well as other, less famous leftist variants), I am not simply attempting to generate visceral reactions.  Instead, I am methodically demonstrating how the Left has been successful in hiding the direct relationship between its modern forms and its historical forms for which most people harbor great loathing.  So, I have to salute DW for making what is the only possible argument against the left-wing nature of facism.  Unfortunately for him, it is ultimately a weak one.\nBut back to Vox. His main argument seems to be that since Mussolini used what amounts to a propoganda piece to advocate things like women’s suffrage, a minimum wage, and systemization of national transportation, that liberals are far more fascist than conservatives or libertarians.  The mistake Vox makes is to draw the simplistic conclusion that if Mussolini wrote something in his manifesto, it’s what fascism came to be and what we mean when we use the term today.\nIt would only amount to a mere propaganda piece if Mussolini had not subsequently enacted those very measures he was advocating in his manifesto.  Take women’s suffrage  for example: Mussolini took power in 1922 and women were granted suffrage in 1925, albeit with some restrictions.  He did precisely as he promised in the manifesto when the Charter of Labour was enacted, setting up twenty-two syndicates where membership was compulsory for employers and employees, each controlled by a party member.  Furthermore, if the manifesto is to be viewed as nothing but a meaningless propaganda piece, it seems most strange that it should threaten the Catholic Church, which was still a popular institution in Italy.\nAs with most American liberals, Dark Window is uncomfortable with the simplistic notion that written documents, such as the U.S. Constitution, mean what they say.  This discomfort with textual precision is why the modern Left has such a difficult time coming to terms with aggressive forces such as the global jihad, as they cannot believe that bin Laden is so simplistic as to announce his intentions.  Why would he, they think, when they themselves are sophisticated enough hide their true intentions?\nQuite the contrary, the manifesto was written to wrest control of the government by gaining wide popular acceptance through political compromise. The words of the manifesto bear very little resemblance to what is meant by modern political theorists when they describe the doctrines of fascism. Once Mussolini gained power, he governed in a very different manner than that espoused in his manifesto. Industries were not nationalized but run under a structure of corporatism strongly influenced by the Church. Even more importantly, the driving factor of actual fascism was not to create an egalitarian society but to centralize power in the hands of a small and strongly nationalistic ruling body.\nModern political theorists either define the term so broadly as to be almost meaningless, or turn it back around in a circular definition equally devoid of meaning.  What is fascism?  The governing philosophy of Benito Mussolini’s party.  What was the governing philosophy of Benito Mussolini’s historical party?  Facism.  The Church corporatism, or\ncorporativismo\nto which DW refers is simply a form of collective class collaboration proposed by Pope Leo as an alternative to Marxian class conflict, but it has nothing to do with Christianity or capitalism and is yet another collectivist left-wing concept.  Furthermore, Mussolini never had any intention of coming to power through compromise, as his planned 1922 march on Rome clearly shows.\nWhat is amusing here is that DW fails to recognize that the driving factor of EVERY left-wing ideology is to centralize power in the hands of a small ruling body.  This is true of Bolshevist Marxist-Leninism, of Maoist Communism, of the Khmer Rouge, of the National Socialists, and, it must be noted, of the corrupt Democratic-Republican globalist cabal.  It is surely the height of irony that the heirs of Marxian dialectic cannot seem to recognize it at work in their own ideologies.\nFinally, DW’s position is wholly anti-intellectual.  Taken to its conclusion, it suggests that ideas which cannot be put immediately into practice have no standing.  The Left often attempts to have its cake and eat it too, in its common argument that Soviet Communism as practiced between 1917 and 1989 is not true communism as theorized by Marx, but Italian Fascism as practiced between 1922 and 1939, on the other hand, is true facism, all contradictions to fascist theory as theorized by Giovanni Gentile notwithstanding.\n“And yet, the only serious question is if it is more ironic to tar a libertarian or a member of the Religious Right with the fascist brush, as one seldom hears James Dobson calling for the government seizure of all church-owned property.”  That’s your only serious question, Vox? Considering the very strong ties between the Catholic Church and Mussolini’s fascist party during the early years of power and the Church’s strong influence over him and his policies during his entire reign, your example seems to break down. Because if there’s one thing Dobson is calling for, it’s more religious influence on our national leaders.\nThe “strong ties” to which DW refers are precisely the opposite of what he is implying.  Far from a partnership, the Church-Party relationship was an uneasy one of two opposing parties unable to gain sole supremacy.  Once Mussolini realized that in confronting the Catholic Church he was taking on “a colossal force”, he arranged to make accomodations in much the same way that Lenin made capitalistic compromises in his New Economic Program of 1925.  Did Lenin therefore have strong ties to capitalism?  If one reads the actual text of the\nLateran Treaties\n, one quickly realizes that this is essentially a bribe, providing the Church with the land and sovereignty of what is now the independent Vatican in return for a free hand in the governance of Italy.\n“In 1925, Mussolini encapsulated the heart of fascist philosophy in a memorable phrase: Tutto nello Stato, niente al di fuori dello Stato, nulla contro lo Stato. This means “Everything in the State, nothing outside the State, nothing against the State.” Now, I ask you, in the Year of Our Lord 2004, does that sound more like a Libertarian, a Republican or a Democrat?” If you read that in light of Mussolini’s actions, you know that his definition of “the State” is far different than what Vox is implying. Replace “State” with “Strong Nationalistic Leader” and ask that last question again.\nHere DW completely loses the plot.   Mussolini may have come to believe that he was the State, (and certainly his assertion “the Fascist State is itself conscious and has itself a will and a personality” is suspicious), but regardless of whether he is referring to himself, a vanguard of the People or a freely elected representative body, he shares with today’s Democrats a belief that there is nothing outside the lawful purview of the national government.\nPS – Just to set the record straight, it was not Dark Window or any of those who took up his Vox Challenge that made accusations of facism.  I received several emails subsequent to the suffrage post that also made statements regarding my ancestry, my sexual preferences and the amount of fecal matter in my intestines.  Now, DW can be hysterical, to be sure, but usually in the funny sense – Up yours, Luxembourg!\nPPS – Dark Window adds: Update: Vox has posted an enjoyable and spirited response to this piece over at his own blog. Sadly, I will not be at home much the next couple of days so in lieu of a proper riposte on my part, I simply direct you over to him and invite you to formulate your own conclusions. In this instance, I happily cede the last word to him.\nI can’t take any joy in having the last word here, as he’s clearly off to spend a week meditating in the forest as he mourns the tragic passing of Les Bleus, dead of self-asphyxiation.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-29T09:16:00+00:00"
}