{
  "url": "https://voxday.net/2004/06/29/how-they-cling-to-their-misconceptions/",
  "scraped_at": "2025-12-19T20:33:53.274025",
  "title": "How they cling to their misconceptions",
  "date_display": "June 29, 2004",
  "date_iso": "2004-06-29T21:49:00+00:00",
  "date_from_url": "2004-06-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bellatrys comments over at Dark Window:</p><blockquote><p>Anyone who starts talking ‘Kinder, Kirche, Kuche!” talk *deserves* to be tarred with the fascist brush.<br/></p></blockquote><p>This is an interesting confession.  So anyone who supports children, church and women being able to stay at home with their children “deserves to be tarred with the fascist brush”.  This would make approximately 75 percent of the planet fascist, but never mind that.  The fact that both Hitler, (who was not a fascist), and Mussolini, (who was), saw the Catholic Church as one of their most dangerous and troublesome rivals doesn’t seem to trouble this poor leftist.  Note too, that while the actual party manifesto written by the party founder is to be cast aside as mere propaganda, subsequent actions notwithstanding, a general <b>slogan</b> belonging to a <b>different party</b> in a <b>different country</b> somehow suffices to shine a light on my true fascist ideology.  Stupendous stuff, Sherlock!<br/></p></div>",
  "content_text": "Bellatrys comments over at Dark Window:\nAnyone who starts talking ‘Kinder, Kirche, Kuche!” talk *deserves* to be tarred with the fascist brush.\nThis is an interesting confession.  So anyone who supports children, church and women being able to stay at home with their children “deserves to be tarred with the fascist brush”.  This would make approximately 75 percent of the planet fascist, but never mind that.  The fact that both Hitler, (who was not a fascist), and Mussolini, (who was), saw the Catholic Church as one of their most dangerous and troublesome rivals doesn’t seem to trouble this poor leftist.  Note too, that while the actual party manifesto written by the party founder is to be cast aside as mere propaganda, subsequent actions notwithstanding, a general\nslogan\nbelonging to a\ndifferent party\nin a\ndifferent country\nsomehow suffices to shine a light on my true fascist ideology.  Stupendous stuff, Sherlock!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-29T20:49:00+00:00"
}