{
  "url": "https://voxday.net/2004/06/25/is-it-blonde-or-libera/",
  "scraped_at": "2025-12-19T20:33:16.309858",
  "title": "Is it the blonde or the liberal?",
  "date_display": "June 25, 2004",
  "date_iso": "2004-06-25T10:02:00+00:00",
  "date_from_url": "2004-06-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now, I actually agree with the basic position <a href=\"http://blondesense.blogspot.com/2004/06/they-cant-raise-kids-and-they-cant.html\">Blondesense</a> is attempting to articulate here.  But a particular paragraph leaped out at me, as I happened to have translated Benito Mussolini’s Manifesto of the Fascist Struggle only an hour before.</p><p>Well, hell no, Mr. Smith. It’s still up to the parental units to decide what their kids watch and if it’s questionable, don’t bring the stuff into the house or turn on the TV if they are not sure if a program is appropriate. If the government wants to do something about the media, how about rolling back all the fascist deregulation of the media and allow independent companies to own some of it thus allowing democracy to flourish, duh.</p><p>Fascist deregulation.  A fascinating phrase!  Not only were the Fascists not exactly known for deregulating things, but to the contrary they demanded regulation – and often outright nationalization – of almost everything in Italy.  In addition to demanding a National Council of experts from a variety of fields and creating a General Commission with cabinet-level power, they sought a national policy of furthering Italian culture, a sort of National Endowment for the Arts combined with the FCC and the US Olympic Committee.  Mussolini famously declared: “<em>Tutto nello Stato… nulla contro lo Stato.</em>”  Everything in the State, nothing against the State.  And by “the State” he meant the government.</p><p>Now, it certainly would be desirable for more independent companies to own elements of the media.  And what prevents this?  Primarily government ownership and regulation of the airwaves, as well as the many government restrictions relating to investment and the management of capital.  The only answer is more deregulation, not less, still less the government seizure and control advocated by the historical Fascists and their modern descendants.  National Public Radio is the epitome of a modern facist institution; the giant media corporations are only quasi-fascist by comparison, their Third Way corporatism notwithstanding.</p><p>Finally, democracy is not freedom and the two should never be confused.  How is a more independent media likely to bring about the near-term demolition of the tri-partite structure of government and the replacement of the constitutional republic with a national referendum-driven system?  Unless, of course, by democracy you mean a system of proportionate representation designed expressly to limit democracy, which we already have, in which case it has presumably already been flourishing for, lo, these past 215 years.</p><p>As the argument finally stumbles towards its corrrect conclusion that the government has no responsibility to ensure that all visual entertainment is child-friendly, the fact that the resident blonde would never make such asinine and ignorant statements forces me to conclude this is simply another case of attempted thinking while liberal.</p></div>",
  "content_text": "Now, I actually agree with the basic position\nBlondesense\nis attempting to articulate here.  But a particular paragraph leaped out at me, as I happened to have translated Benito Mussolini’s Manifesto of the Fascist Struggle only an hour before.\nWell, hell no, Mr. Smith. It’s still up to the parental units to decide what their kids watch and if it’s questionable, don’t bring the stuff into the house or turn on the TV if they are not sure if a program is appropriate. If the government wants to do something about the media, how about rolling back all the fascist deregulation of the media and allow independent companies to own some of it thus allowing democracy to flourish, duh.\nFascist deregulation.  A fascinating phrase!  Not only were the Fascists not exactly known for deregulating things, but to the contrary they demanded regulation – and often outright nationalization – of almost everything in Italy.  In addition to demanding a National Council of experts from a variety of fields and creating a General Commission with cabinet-level power, they sought a national policy of furthering Italian culture, a sort of National Endowment for the Arts combined with the FCC and the US Olympic Committee.  Mussolini famously declared: “\nTutto nello Stato… nulla contro lo Stato.\n”  Everything in the State, nothing against the State.  And by “the State” he meant the government.\nNow, it certainly would be desirable for more independent companies to own elements of the media.  And what prevents this?  Primarily government ownership and regulation of the airwaves, as well as the many government restrictions relating to investment and the management of capital.  The only answer is more deregulation, not less, still less the government seizure and control advocated by the historical Fascists and their modern descendants.  National Public Radio is the epitome of a modern facist institution; the giant media corporations are only quasi-fascist by comparison, their Third Way corporatism notwithstanding.\nFinally, democracy is not freedom and the two should never be confused.  How is a more independent media likely to bring about the near-term demolition of the tri-partite structure of government and the replacement of the constitutional republic with a national referendum-driven system?  Unless, of course, by democracy you mean a system of proportionate representation designed expressly to limit democracy, which we already have, in which case it has presumably already been flourishing for, lo, these past 215 years.\nAs the argument finally stumbles towards its corrrect conclusion that the government has no responsibility to ensure that all visual entertainment is child-friendly, the fact that the resident blonde would never make such asinine and ignorant statements forces me to conclude this is simply another case of attempted thinking while liberal.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-25T09:02:00+00:00"
}