{
  "url": "https://voxday.net/2004/06/13/its-brits/",
  "scraped_at": "2025-12-19T20:31:41.763551",
  "title": "It’s the Brits?",
  "date_display": "June 13, 2004",
  "date_iso": "2004-06-13T11:08:00+00:00",
  "date_from_url": "2004-06-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Debka: MI6, the operational arm of British expansion, historically opted for the Middle East camp opposed to Israel and <a href=\"http://www.debka.com/article.php?aid=862\">cultivated a special relationship with Yasser Arafat</a> going back decades. Strictly speaking, Egyptian intelligence invented the Palestinian national leader and used his services between the 1960s and well into the 1990s. Even today, the Egyptian official assigned to keeping tabs on him is intelligence minister General Omar Suleiman. It is less well known that during those decades, British intelligence ran a covert operation to build him up as a world figure. London saw in him a vehicle for planting British influence deep inside the Arab-Muslim orbit (which is why he was never received in Islamic revolutionary Tehran) and an instrument for keeping Israeli intelligence in check and limiting its influence in Washington.</p><p>These ties were somewhat loosened after the 1993 Oslo peace accord, when he relocated from Tunis to Gaza and Ramallah. But they were never abandoned.  The British have performed two key services for the Palestinian cause:</p><p>A. They sponsored the concept of Palestinian statehood as a means of reducing the Jewish state to what London considered its natural dimensions, sitting behind Arafat’s shoulder and lobbying the international case for a Palestinian state year after year until it was taken up by President Bush. Few Israelis are aware of the pivotal role parts of MI6 through the British Foreign Office played over the years in developing and shaping Palestinian diplomatic and PR strategy, helping to make the Palestinian cause far more resonant internationally than the Israeli case – even when Arafat openly espoused and practiced terrorism.</p><p>B. They instigated the first Palestinian uprising against Israel in 1987; it was not provoked by Arafat then still in Tunis or even the PLO leadership, but MI6 agents operating in the Rafah refugee camp of the southern Gaza Strip. The trigger was a road accident in which an Israeli army truck ran over a group of Palestinian children. The local protest raised spread quickly and was presented opportunistically to the media as a “popular uprising.”</p><p>I have no idea if this is true or not, except that Arafat is an Egyptian and the nephew of the Nazi-loving Grand Mufti of Jerusalem.  I found it interesting in that it illustrates the point that the public very seldom has an accurate picture of what is going on behind closed doors.  Whatever the truth may be about various geopolitical situations, it almost certainly isn’t what is being discussed openly in the newspapers every day.</p></div>",
  "content_text": "From Debka: MI6, the operational arm of British expansion, historically opted for the Middle East camp opposed to Israel and\ncultivated a special relationship with Yasser Arafat\ngoing back decades. Strictly speaking, Egyptian intelligence invented the Palestinian national leader and used his services between the 1960s and well into the 1990s. Even today, the Egyptian official assigned to keeping tabs on him is intelligence minister General Omar Suleiman. It is less well known that during those decades, British intelligence ran a covert operation to build him up as a world figure. London saw in him a vehicle for planting British influence deep inside the Arab-Muslim orbit (which is why he was never received in Islamic revolutionary Tehran) and an instrument for keeping Israeli intelligence in check and limiting its influence in Washington.\nThese ties were somewhat loosened after the 1993 Oslo peace accord, when he relocated from Tunis to Gaza and Ramallah. But they were never abandoned.  The British have performed two key services for the Palestinian cause:\nA. They sponsored the concept of Palestinian statehood as a means of reducing the Jewish state to what London considered its natural dimensions, sitting behind Arafat’s shoulder and lobbying the international case for a Palestinian state year after year until it was taken up by President Bush. Few Israelis are aware of the pivotal role parts of MI6 through the British Foreign Office played over the years in developing and shaping Palestinian diplomatic and PR strategy, helping to make the Palestinian cause far more resonant internationally than the Israeli case – even when Arafat openly espoused and practiced terrorism.\nB. They instigated the first Palestinian uprising against Israel in 1987; it was not provoked by Arafat then still in Tunis or even the PLO leadership, but MI6 agents operating in the Rafah refugee camp of the southern Gaza Strip. The trigger was a road accident in which an Israeli army truck ran over a group of Palestinian children. The local protest raised spread quickly and was presented opportunistically to the media as a “popular uprising.”\nI have no idea if this is true or not, except that Arafat is an Egyptian and the nephew of the Nazi-loving Grand Mufti of Jerusalem.  I found it interesting in that it illustrates the point that the public very seldom has an accurate picture of what is going on behind closed doors.  Whatever the truth may be about various geopolitical situations, it almost certainly isn’t what is being discussed openly in the newspapers every day.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-13T10:08:00+00:00"
}