{
  "url": "https://voxday.net/2004/06/28/kerrys-divorce-papers/",
  "scraped_at": "2025-12-19T20:33:42.142400",
  "title": "Kerry’s divorce papers",
  "date_display": "June 28, 2004",
  "date_iso": "2004-06-28T10:35:00+00:00",
  "date_from_url": "2004-06-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t see how Democrats will be able to argue that a Senate candidate’s divorce records must be unsealed, but a presidential candidate’s are private.  I’m sure they’ll find a way, though, since they proudly spit on the concept of intellectual consistency – then wonder why no one respects their intellects.</p><p>I find it interesting that so many politicians are divorced; I don’t think it’s so much that the job is demanding as it is the fact that the profession attracts the very worst sort of neurotic control freaks.  Unsealed or not, however, I don’t believe the papers will tell us anything new.  We already know that Kerry is a complete <i>arruso</i> who has to be kept hidden away from the public in order to maintain any level of support.</p><p>Of course, if he wins, it could make for an even more amusing presidency than Slick Willie’s.  It will be entertaining to see his supporters turn on him like rabid dogs once they realize what a thoroughly dislikeable man he is.</p><p><i>Jack took Jeri to the club<br> <br>To swing out in the open<br> <br>Jack fell down at Jeri’s frown<br> <br>And John slipped down the slope then</br></br></br></br></br></br></i></p></div>",
  "content_text": "I don’t see how Democrats will be able to argue that a Senate candidate’s divorce records must be unsealed, but a presidential candidate’s are private.  I’m sure they’ll find a way, though, since they proudly spit on the concept of intellectual consistency – then wonder why no one respects their intellects.\nI find it interesting that so many politicians are divorced; I don’t think it’s so much that the job is demanding as it is the fact that the profession attracts the very worst sort of neurotic control freaks.  Unsealed or not, however, I don’t believe the papers will tell us anything new.  We already know that Kerry is a complete\narruso\nwho has to be kept hidden away from the public in order to maintain any level of support.\nOf course, if he wins, it could make for an even more amusing presidency than Slick Willie’s.  It will be entertaining to see his supporters turn on him like rabid dogs once they realize what a thoroughly dislikeable man he is.\nJack took Jeri to the club\nTo swing out in the open\nJack fell down at Jeri’s frown\nAnd John slipped down the slope then",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-28T09:35:00+00:00"
}