{
  "url": "https://voxday.net/2004/06/14/mailvox-truly-important-stuff/",
  "scraped_at": "2025-12-19T20:31:50.974503",
  "title": "Mailvox: the truly important stuff",
  "date_display": "June 14, 2004",
  "date_iso": "2004-06-14T10:16:00+00:00",
  "date_from_url": "2004-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://darkwindow.blogspot.com\">A friendly foe</a> writes:  It feels good, Vox.  I was finally able to use one of your columns for its intended purpose today.  That kind of scares, though.  What’s next?  Will I soon be following the advice of Rabbi Boteach, too? Anyway, I’m mainly writing to ask if you got to see that incredible France-England match.  I’m guessing you probably don’t care much for my Bleus simply on principle but even you have to admit that Zidane was off the hook!  That was unbelievable.</p><p>I don’t think he’ll have to worry about paying heed to the Rabbi’s advice, not unless he’s planning to become the next Britney Spears, Michael Jackson or Madonna.  As for Les Bleus, I’m a little conflicted.  I can’t hate the team that supplied Henry, Viera, Wiltord and Pires to my Gunners, but I really can’t cheer for them either.</p><p>Space Bunny and I watched the game and were very disappointed for the Lions.  She’s a big England fan and felt especially bad for David Beckham.  I was worried about that free kick, Zidane is still, as he once said, “at the pinnacle of his art”.  And why is England STILL not practicing penalties – I take better penalties than that. I was surprised how flat the Blues were otherwise, though.  I’m not impressed by Trezeguet, as he doesn’t make enough runs to keep teams from keeping two and three defenders on Henry.  It didn’t hurt England that Sol Campbell and Ashley Cole know Henry better than anyone, of course.  Still, I saw nothing in the Swiss-Croatian game that leads me to believe that England will have any trouble going through despite the loss.</p><p>Vassell for Owen and Hargreaves for Scholes were good moves, but I thought it was a huge mistake to put Heskey in for Rooney, although I never imagined it coming back to bite Sven as it did.  Rooney had been effective in tracking back to help the midfielders all game; Heskey as usual, was nearly useless up front, then came back and plowed over Zidane to give up the fatal free kick.  I know they keep naming Heskey to the squad because Rooney, Owen and Vassell are all so short, but I’d still rather have Kevin Phillips or even Teddy Sheringham as a fourth striker over him.</p><p>As for the other games, I suspect that Portugal’s “Golden Generation” will be viewed as more of an Age of Brass.  Their loss to the USA in the World Cup is looking like less and less of a shock in hindsight, as Greece was clearly the superior team, their dearth of stardom notwithstanding. What an embarrassment for the hosts!  Spain simply toyed with Russia, so much so that I wouldn’t be overly surprised if the Greeks upset the Russians and stole the second spot from Portugal.</p><p>In today’s games, I like Italy over Denmark and Sweden over Bulgaria.  Both Scandinavian teams usually play well in the European championships, especially the Danes, but I think the Azzurri are due this year.</p></div>",
  "content_text": "A friendly foe\nwrites:  It feels good, Vox.  I was finally able to use one of your columns for its intended purpose today.  That kind of scares, though.  What’s next?  Will I soon be following the advice of Rabbi Boteach, too? Anyway, I’m mainly writing to ask if you got to see that incredible France-England match.  I’m guessing you probably don’t care much for my Bleus simply on principle but even you have to admit that Zidane was off the hook!  That was unbelievable.\nI don’t think he’ll have to worry about paying heed to the Rabbi’s advice, not unless he’s planning to become the next Britney Spears, Michael Jackson or Madonna.  As for Les Bleus, I’m a little conflicted.  I can’t hate the team that supplied Henry, Viera, Wiltord and Pires to my Gunners, but I really can’t cheer for them either.\nSpace Bunny and I watched the game and were very disappointed for the Lions.  She’s a big England fan and felt especially bad for David Beckham.  I was worried about that free kick, Zidane is still, as he once said, “at the pinnacle of his art”.  And why is England STILL not practicing penalties – I take better penalties than that. I was surprised how flat the Blues were otherwise, though.  I’m not impressed by Trezeguet, as he doesn’t make enough runs to keep teams from keeping two and three defenders on Henry.  It didn’t hurt England that Sol Campbell and Ashley Cole know Henry better than anyone, of course.  Still, I saw nothing in the Swiss-Croatian game that leads me to believe that England will have any trouble going through despite the loss.\nVassell for Owen and Hargreaves for Scholes were good moves, but I thought it was a huge mistake to put Heskey in for Rooney, although I never imagined it coming back to bite Sven as it did.  Rooney had been effective in tracking back to help the midfielders all game; Heskey as usual, was nearly useless up front, then came back and plowed over Zidane to give up the fatal free kick.  I know they keep naming Heskey to the squad because Rooney, Owen and Vassell are all so short, but I’d still rather have Kevin Phillips or even Teddy Sheringham as a fourth striker over him.\nAs for the other games, I suspect that Portugal’s “Golden Generation” will be viewed as more of an Age of Brass.  Their loss to the USA in the World Cup is looking like less and less of a shock in hindsight, as Greece was clearly the superior team, their dearth of stardom notwithstanding. What an embarrassment for the hosts!  Spain simply toyed with Russia, so much so that I wouldn’t be overly surprised if the Greeks upset the Russians and stole the second spot from Portugal.\nIn today’s games, I like Italy over Denmark and Sweden over Bulgaria.  Both Scandinavian teams usually play well in the European championships, especially the Danes, but I think the Azzurri are due this year.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-14T09:16:00+00:00"
}