{
  "url": "https://voxday.net/2004/06/09/mailvox-im-not-gay-im-englis/",
  "scraped_at": "2025-12-19T20:31:06.698339",
  "title": "Mailvox: I’m not gay, I’m English",
  "date_display": "June 9, 2004",
  "date_iso": "2004-06-09T10:34:00+00:00",
  "date_from_url": "2004-06-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bartholomew leaps into the arena: Here’s my response to your unpalatable idea, as recently posted on my own blog. You will note that I have separated the two questions of a) has allowing women to vote led to harmful results? and b) should a group be banned from voting because its members tend to vote for things that lead to harmful results? I am concerned here mainly with the latter proposition.</p><p>Fair enough.  We’ve mostly been dealing with (a).  But (b) is another reasonable point for discussion.</p><p>Your recent comment about children is not valid: it is not discriminatory to deny them the vote because everyone was once a child and so subject to the same restriction.</p><p>No, it is perfectly valid.  By this reasoning, we can discriminate freely against the elderly because almost everyone will be old one day.  Furthermore, discrimination against children is justified on their inability to make responsible decisions, not the universal nature of childhood.</p><p>1. Democracies use constitutions and independent judiciaries to guard against mobocracy, rather than denial of the franchise to particular groups ofadults. While this may not be perfect, there is no evidence that there was less mobocracy in times when women or others were denied the franchise.</p><p>Sure there is.  The Founders were concerned about a mob voting itself bread and circuses, while Joseph Schumpeter predicted the inevitable devolution of any universal democracy into socialist tyranny.  An analysis of federal spending per capita <a href=\"http://www.voxday.net/archive/2003/082503.html\">easily illustrates this </a>playing out right now.</p><p>Perhaps this is not spelt out in the Declaration of Independence or the Bill of Rights, but if Vox Days interpretation of those documents is correct that only means that the USA is not the very best example of democracy after all, and could learn from others (Im British, by the way).</p><p>The USA is not a democracy, never was, and was expressly designed not to be.  In his first formal point, Bartholomew demonstrates that he has no understanding of the source of American rights and liberties.</p><p>2. If women as a whole can be denied the franchise because a majority of them support views of government he dislikes (leading to what he considers the social ills outlined above), then why not apply this rule to other groups should they show the same preferences? Answer: because if such a rule were applied to other groups it would be manifestly unfair, and in many examples would be racist.</p><p>First, it would indeed be very good sense to deny those groups who are determined to sabotage their self-interest.  Precisely this reasoning is presently being used to deny the Iraqi people the right to self-determination; I don’t know any so-called “democrats” who actually favor allowing open elections in Iraq as I do.  Are they racist too?</p><p>Second, women are a unique group in that they are provably biologically different.  These biological differences have a direct effect on their ability to think and reason, as numerous scientific studies have proven that women have measurably different brains than men.  There are spiritual (Christian), scientific (evolutionary), and psychosexual reasons that women are inordinately inclined to favor the “security” offered by Big Daddy government intervention.  This is not true for any other group, except, possibly, the homosexual community, if one accepts the homosexual argument that their abnormality has a genetic base.</p><p>3. His argument is that he has judged certain ideas to be bad, and because a majority of women support those ideas they therefore should not be allowed to vote. So why shouldnt I call for religious conservatives to be disenfranchised on the grounds that they vote for what I consider bad ideas?</p><p>What are hate crimes for?  I fully expect the openly religious to be disenfranchised in the future.  They’re already being fined.  We’ll be fortunate if it stops with only losing the vote.</p><p>Well, a) I would be supporting an undesirable principle of exclusion; b) I understand that without the accountability that only comes with a universal franchise even good ideas will not be implemented well; c) I have confidence that as long as democracy endures the good ideas will eventually triumph. Vox Day does not have that confidence about his own ideas, it seems, which is why he wants them imposed by banning people from voting. 4. If women were denied the vote, they would protest,as they did in many countries before they got the vote, and many men would support them. The civil strife would be overwhelming.</p><p>He sees exclusion as undesirable; neither I nor the Founding Fathers do.  What accountability comes with a universal franchise?  I obviously don’t have that confidence, as I believe that most people, given the chance to vote themselves largesse from others, will do so every single time.  History would seem to support this very strongly.  The civil strife would be as nothing as what is going to happen once the present system collapses under the weight of centralization.  One of the many nice things about women is that they’re not prone to serious violence.</p><p>No doubt Vox Day, who is willing to contemplate the mass murder thousands of Palestinians for a greater good, would not shy away from quelling the complainants with brutal force. But thats not libertarianism. Or Christianity.</p><p>According to the Palestinian Center for Human Rights, <a href=\"http://pchrgaza.org/Intifada/Killings_stat.htm\">2,233 Palestinians have been killed </a>in the present conflict since mid-2000, more than 1,000 since I wrote the offending article.  Apparently Bartholomew was more upset by a suggestion that might actually help bring a final end to the conflict than he is by the actual “mass murder” of thousands of Palestinians.  Or perhaps he believes that refraining from the intentional murder of children is hopelessly beyond those dusky savages now that the British Empire has laid down the White Man’s Burden.  But I don’t have to contemplate anything; the world is witnessing it.  As for a need for force, I’ll take my chances.  Generally speaking, the ladies would rather talk than fight.</p><p>Universal suffrage is neither libertarian nor Christian.  A perusal of either philosophy would demonstrate that, as would the fact that voting is mandatory in many totalitarian states.  Even the UN Declaration of Human Rights tempers Article 21 (3) <em>The will of the people shall be the basis of the authority of government; this will shall be expressed in periodic and genuine elections which shall be by universal and equal suffrage and shall be held by secret vote or by equivalent free voting procedures.</em> with Article 29 (3) <em>These rights and freedoms may in no case be exercised contrary to the purposes and principles of the United Nations.</em></p></div>",
  "content_text": "Bartholomew leaps into the arena: Here’s my response to your unpalatable idea, as recently posted on my own blog. You will note that I have separated the two questions of a) has allowing women to vote led to harmful results? and b) should a group be banned from voting because its members tend to vote for things that lead to harmful results? I am concerned here mainly with the latter proposition.\nFair enough.  We’ve mostly been dealing with (a).  But (b) is another reasonable point for discussion.\nYour recent comment about children is not valid: it is not discriminatory to deny them the vote because everyone was once a child and so subject to the same restriction.\nNo, it is perfectly valid.  By this reasoning, we can discriminate freely against the elderly because almost everyone will be old one day.  Furthermore, discrimination against children is justified on their inability to make responsible decisions, not the universal nature of childhood.\n1. Democracies use constitutions and independent judiciaries to guard against mobocracy, rather than denial of the franchise to particular groups ofadults. While this may not be perfect, there is no evidence that there was less mobocracy in times when women or others were denied the franchise.\nSure there is.  The Founders were concerned about a mob voting itself bread and circuses, while Joseph Schumpeter predicted the inevitable devolution of any universal democracy into socialist tyranny.  An analysis of federal spending per capita\neasily illustrates this\nplaying out right now.\nPerhaps this is not spelt out in the Declaration of Independence or the Bill of Rights, but if Vox Days interpretation of those documents is correct that only means that the USA is not the very best example of democracy after all, and could learn from others (Im British, by the way).\nThe USA is not a democracy, never was, and was expressly designed not to be.  In his first formal point, Bartholomew demonstrates that he has no understanding of the source of American rights and liberties.\n2. If women as a whole can be denied the franchise because a majority of them support views of government he dislikes (leading to what he considers the social ills outlined above), then why not apply this rule to other groups should they show the same preferences? Answer: because if such a rule were applied to other groups it would be manifestly unfair, and in many examples would be racist.\nFirst, it would indeed be very good sense to deny those groups who are determined to sabotage their self-interest.  Precisely this reasoning is presently being used to deny the Iraqi people the right to self-determination; I don’t know any so-called “democrats” who actually favor allowing open elections in Iraq as I do.  Are they racist too?\nSecond, women are a unique group in that they are provably biologically different.  These biological differences have a direct effect on their ability to think and reason, as numerous scientific studies have proven that women have measurably different brains than men.  There are spiritual (Christian), scientific (evolutionary), and psychosexual reasons that women are inordinately inclined to favor the “security” offered by Big Daddy government intervention.  This is not true for any other group, except, possibly, the homosexual community, if one accepts the homosexual argument that their abnormality has a genetic base.\n3. His argument is that he has judged certain ideas to be bad, and because a majority of women support those ideas they therefore should not be allowed to vote. So why shouldnt I call for religious conservatives to be disenfranchised on the grounds that they vote for what I consider bad ideas?\nWhat are hate crimes for?  I fully expect the openly religious to be disenfranchised in the future.  They’re already being fined.  We’ll be fortunate if it stops with only losing the vote.\nWell, a) I would be supporting an undesirable principle of exclusion; b) I understand that without the accountability that only comes with a universal franchise even good ideas will not be implemented well; c) I have confidence that as long as democracy endures the good ideas will eventually triumph. Vox Day does not have that confidence about his own ideas, it seems, which is why he wants them imposed by banning people from voting. 4. If women were denied the vote, they would protest,as they did in many countries before they got the vote, and many men would support them. The civil strife would be overwhelming.\nHe sees exclusion as undesirable; neither I nor the Founding Fathers do.  What accountability comes with a universal franchise?  I obviously don’t have that confidence, as I believe that most people, given the chance to vote themselves largesse from others, will do so every single time.  History would seem to support this very strongly.  The civil strife would be as nothing as what is going to happen once the present system collapses under the weight of centralization.  One of the many nice things about women is that they’re not prone to serious violence.\nNo doubt Vox Day, who is willing to contemplate the mass murder thousands of Palestinians for a greater good, would not shy away from quelling the complainants with brutal force. But thats not libertarianism. Or Christianity.\nAccording to the Palestinian Center for Human Rights,\n2,233 Palestinians have been killed\nin the present conflict since mid-2000, more than 1,000 since I wrote the offending article.  Apparently Bartholomew was more upset by a suggestion that might actually help bring a final end to the conflict than he is by the actual “mass murder” of thousands of Palestinians.  Or perhaps he believes that refraining from the intentional murder of children is hopelessly beyond those dusky savages now that the British Empire has laid down the White Man’s Burden.  But I don’t have to contemplate anything; the world is witnessing it.  As for a need for force, I’ll take my chances.  Generally speaking, the ladies would rather talk than fight.\nUniversal suffrage is neither libertarian nor Christian.  A perusal of either philosophy would demonstrate that, as would the fact that voting is mandatory in many totalitarian states.  Even the UN Declaration of Human Rights tempers Article 21 (3)\nThe will of the people shall be the basis of the authority of government; this will shall be expressed in periodic and genuine elections which shall be by universal and equal suffrage and shall be held by secret vote or by equivalent free voting procedures.\nwith Article 29 (3)\nThese rights and freedoms may in no case be exercised contrary to the purposes and principles of the United Nations.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-09T09:34:00+00:00"
}