{
  "url": "https://voxday.net/2004/06/10/mailvox-whats-so-bad-about-divorce/",
  "scraped_at": "2025-12-19T20:31:19.541966",
  "title": "Mailvox: what’s so bad about divorce?",
  "date_display": "June 10, 2004",
  "date_iso": "2004-06-10T12:09:00+00:00",
  "date_from_url": "2004-06-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Leo writes: 1) What is wrong with women working? Vox, you seem to be taking it as God-given fact that women working outside of the home is a Bad Thing. I disagree completely – it adds to GNP, it gives employers more people to choose from. As well as the fact that women, as individuals, have the right to decide what they want to do. You’ve included this as a bad thing, a negative consequence, but you’ve not said *why*.</p><p>Did you miss the bit about falling real wages?  An extreme example might help you understand.  The USA doubles the size of the work force by importing Chinese workers.  Is this good for the economy?  Or will it accomplish very little, except cutting wages in half?  If it’s so good, I’m sure we can find 100 million volunteers to move into the country.</p><p>Now, women should have the right to decide what they want to do, but as matters stand, the increase in inflation, the fall in real wages and the rise in taxes means that two incomes are required where once one sufficed.  It’s still a choice, to be sure.  Do you want a lower standard of living, or do you want to farm your children out to day care and government schools while you go work.  I’d go with the former, but it’s hard to blame those who choose the latter.  Unfortunately, the latter tends to increase stress on the family, leading to divorce, etc.  The greatest irony, is that women are mostly working to pay for the Social Security benefits of the 65+ men who used to work, but thanks to the entitlement designed to help widows and orphans, are now collecting a check and playing golf.</p><p>2) I consider no-fault divorce laws to be a good thing. People get married by mistake; people get married young and then mature into different, incompatible people. Why should these couples be required by law to stay together- I know the fundamentalists’ reason for saying this, but how can you argue the viewpoint as a libertarian?</p><p>As Larry pointed out, why should a marriage contract be any less binding than a fitness club membership?  The right to make private contracts, sans third party involvement, is sacrosanct to libertarians.  The government should not concern itself with recognizing marriage or divorce in any way.  It did not do so for thousands of years and there is no need or benefit for it to do so now.  Quite the contrary, as is being demonstrated in <a href=\"http://www.mises.org/fullstory.asp?control=1524\">Denmark</a>, Holland and Massachusetts.</p></div>",
  "content_text": "Leo writes: 1) What is wrong with women working? Vox, you seem to be taking it as God-given fact that women working outside of the home is a Bad Thing. I disagree completely – it adds to GNP, it gives employers more people to choose from. As well as the fact that women, as individuals, have the right to decide what they want to do. You’ve included this as a bad thing, a negative consequence, but you’ve not said *why*.\nDid you miss the bit about falling real wages?  An extreme example might help you understand.  The USA doubles the size of the work force by importing Chinese workers.  Is this good for the economy?  Or will it accomplish very little, except cutting wages in half?  If it’s so good, I’m sure we can find 100 million volunteers to move into the country.\nNow, women should have the right to decide what they want to do, but as matters stand, the increase in inflation, the fall in real wages and the rise in taxes means that two incomes are required where once one sufficed.  It’s still a choice, to be sure.  Do you want a lower standard of living, or do you want to farm your children out to day care and government schools while you go work.  I’d go with the former, but it’s hard to blame those who choose the latter.  Unfortunately, the latter tends to increase stress on the family, leading to divorce, etc.  The greatest irony, is that women are mostly working to pay for the Social Security benefits of the 65+ men who used to work, but thanks to the entitlement designed to help widows and orphans, are now collecting a check and playing golf.\n2) I consider no-fault divorce laws to be a good thing. People get married by mistake; people get married young and then mature into different, incompatible people. Why should these couples be required by law to stay together- I know the fundamentalists’ reason for saying this, but how can you argue the viewpoint as a libertarian?\nAs Larry pointed out, why should a marriage contract be any less binding than a fitness club membership?  The right to make private contracts, sans third party involvement, is sacrosanct to libertarians.  The government should not concern itself with recognizing marriage or divorce in any way.  It did not do so for thousands of years and there is no need or benefit for it to do so now.  Quite the contrary, as is being demonstrated in\nDenmark\n, Holland and Massachusetts.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-10T11:09:00+00:00"
}