{
  "url": "https://voxday.net/2004/06/05/mailvox-imagining-anti-semites/",
  "scraped_at": "2025-12-19T20:30:29.687059",
  "title": "Mailvox: imagining anti-semites",
  "date_display": "June 5, 2004",
  "date_iso": "2004-06-05T14:57:00+00:00",
  "date_from_url": "2004-06-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Alex writes: Vox=”That’s just bizarre. How does this make sense when Cheney, Rumsfeld and Rice are usually described as neocons, considering that none of them are Jewish?”</p><p>This is made clear in the very next sentence written by VDH… really, Im surprised at this kneejerk blog. VDH makes strong arguments and has done the research to back them up. You jump too quickly to damn when things don’t make sense to you, perhaps b/c they rub brusquely against your assumptions.</p><p>VDH=”Cabal” and “Nazi-like” are also used by others and with increasing frequency to promote the old idea of crafty, sneaky people pulling the wool over honest naifs (no doubt aw-shucks, unsophisticated folks such as Cheney, Rumsfeld, Powell, and Rice).”</p><p>Alex, surely you’re not so poorly read that you don’t realize VDH simply made that up wholesale, echoing fellow NROniks Mowbray, Frum and Goldberg.  No one thinks anyone is pulling the wool over Cheney, Rumsfeld, Powell and Rice.  Name one person who does – VDH certainly doesn’t.  Indeed, it flies directly in the face of the usual caricature of Cheney pulling Bush’s strings from behind the scenes.  The vast majority who oppose Rumfeldian neoconservativism have never heard of Wolfowitz, Perle or Feith, much less Leo Strauss.</p><p>In fact, VDH goes so far as to specifically disavow the two primary definitions of neoconservative used by the neocons themselves – a particularly stupid thing to do – and echoes Mowbray’s silly hit piece that tried to pin anti-semitism on General Zinni, who, as <a href=\"http://www.voxday.net/archive/2004/010504.html\">I pointed out in a previous column</a>, never identified a single neocon in the interview with the Washington Post that so riled the neocons and their friends.  A strong argument?  VDH’s uncharacteristically lightweight assertion doesn’t even rise to the level of an argument at all!</p><p>What we’re seeing here is the neocons clumsily attempting to silence their critics in the same manner that the ADL attempted to shut down <em>The Passion of the Christ</em>.  I expect the tactic to work about as well, too.</p></div>",
  "content_text": "Alex writes: Vox=”That’s just bizarre. How does this make sense when Cheney, Rumsfeld and Rice are usually described as neocons, considering that none of them are Jewish?”\nThis is made clear in the very next sentence written by VDH… really, Im surprised at this kneejerk blog. VDH makes strong arguments and has done the research to back them up. You jump too quickly to damn when things don’t make sense to you, perhaps b/c they rub brusquely against your assumptions.\nVDH=”Cabal” and “Nazi-like” are also used by others and with increasing frequency to promote the old idea of crafty, sneaky people pulling the wool over honest naifs (no doubt aw-shucks, unsophisticated folks such as Cheney, Rumsfeld, Powell, and Rice).”\nAlex, surely you’re not so poorly read that you don’t realize VDH simply made that up wholesale, echoing fellow NROniks Mowbray, Frum and Goldberg.  No one thinks anyone is pulling the wool over Cheney, Rumsfeld, Powell and Rice.  Name one person who does – VDH certainly doesn’t.  Indeed, it flies directly in the face of the usual caricature of Cheney pulling Bush’s strings from behind the scenes.  The vast majority who oppose Rumfeldian neoconservativism have never heard of Wolfowitz, Perle or Feith, much less Leo Strauss.\nIn fact, VDH goes so far as to specifically disavow the two primary definitions of neoconservative used by the neocons themselves – a particularly stupid thing to do – and echoes Mowbray’s silly hit piece that tried to pin anti-semitism on General Zinni, who, as\nI pointed out in a previous column\n, never identified a single neocon in the interview with the Washington Post that so riled the neocons and their friends.  A strong argument?  VDH’s uncharacteristically lightweight assertion doesn’t even rise to the level of an argument at all!\nWhat we’re seeing here is the neocons clumsily attempting to silence their critics in the same manner that the ADL attempted to shut down\nThe Passion of the Christ\n.  I expect the tactic to work about as well, too.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-05T13:57:00+00:00"
}