{
  "url": "https://voxday.net/2004/06/25/mbeki-knows-bes/",
  "scraped_at": "2025-12-19T20:33:09.887362",
  "title": "Mbeki knows best",
  "date_display": "June 25, 2004",
  "date_iso": "2004-06-25T06:59:00+00:00",
  "date_from_url": "2004-06-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is a bitter joke in South Africa: what is the difference between Thabo Mbeki and Robert Mugabe?  About ten years.  As Mugabe drives Zimbabwe ever deeper into socialist nightmare by murdering the nation’s only productive class and confiscating their property in order to turn it over to feckless squatters, <a href=\"http://www.mg.co.za/Content/l3.asp?ao=117698\">Mbeki gives South Africans clear warning</a> of his long-term intentions to transform that country into yet another Left-wing African hellhole.</p><p>“In this climate taxation is depicted as the confiscation of what is properly our own — an intolerable burden that should be reduced. The social, the collective and the public realm are portrayed as the enemies of prosperity and individual autonomy… and worse are opposed to the moral basis of society grounded as it should be in the absolute responsibility of individuals to shoulder their burdens and exercise their rights alone.”</p><p>He [Mbeki] noted that [UK columnist Will] Hutton argues that Western democracies had been characterised by “one broad family of ideas that might be called Left — a belief in the social, reduction in inequality, the provision of public services, the principle that workers should be treated as assets rather than commodities, regulation of enterprise, rehabilitation of criminals, tolerance and respect for minorities — and another broad family of ideas that might be called Right: An honouring of our inherited institutional fabric, a respect for order, a belief that private property rights and profit are essential to the operation of the market economy, a suspicion of worker rights, faith in the remedial value of punitive justice and distrust of the new.”</p><p>Mbeki emphasised that there could “be no doubt about where we stand” with regard to this “great divide”. It is to pursue the goals contained in what Hutton called ideas “that might be called” Left.</p><p>At least Mbeki, unlike the majority of American Democrats who should more properly be termed Democratic Socialists, understands what it is he is rejecting in turning his back on law, order, private property, and age-old institutions.  He is the more intelligent form of political evil, whereas the American “liberal” is, by comparison, evil’s idiot cousin, always deluding himself that he is honoring the past by defecating on the present and “fighting” to destroy the future.</p></div>",
  "content_text": "There is a bitter joke in South Africa: what is the difference between Thabo Mbeki and Robert Mugabe?  About ten years.  As Mugabe drives Zimbabwe ever deeper into socialist nightmare by murdering the nation’s only productive class and confiscating their property in order to turn it over to feckless squatters,\nMbeki gives South Africans clear warning\nof his long-term intentions to transform that country into yet another Left-wing African hellhole.\n“In this climate taxation is depicted as the confiscation of what is properly our own — an intolerable burden that should be reduced. The social, the collective and the public realm are portrayed as the enemies of prosperity and individual autonomy… and worse are opposed to the moral basis of society grounded as it should be in the absolute responsibility of individuals to shoulder their burdens and exercise their rights alone.”\nHe [Mbeki] noted that [UK columnist Will] Hutton argues that Western democracies had been characterised by “one broad family of ideas that might be called Left — a belief in the social, reduction in inequality, the provision of public services, the principle that workers should be treated as assets rather than commodities, regulation of enterprise, rehabilitation of criminals, tolerance and respect for minorities — and another broad family of ideas that might be called Right: An honouring of our inherited institutional fabric, a respect for order, a belief that private property rights and profit are essential to the operation of the market economy, a suspicion of worker rights, faith in the remedial value of punitive justice and distrust of the new.”\nMbeki emphasised that there could “be no doubt about where we stand” with regard to this “great divide”. It is to pursue the goals contained in what Hutton called ideas “that might be called” Left.\nAt least Mbeki, unlike the majority of American Democrats who should more properly be termed Democratic Socialists, understands what it is he is rejecting in turning his back on law, order, private property, and age-old institutions.  He is the more intelligent form of political evil, whereas the American “liberal” is, by comparison, evil’s idiot cousin, always deluding himself that he is honoring the past by defecating on the present and “fighting” to destroy the future.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-25T05:59:00+00:00"
}