{
  "url": "https://voxday.net/2004/06/17/mind-ro/",
  "scraped_at": "2025-12-19T20:32:09.510356",
  "title": "Mind rot",
  "date_display": "June 17, 2004",
  "date_iso": "2004-06-17T08:47:00+00:00",
  "date_from_url": "2004-06-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Andrew Sullivan is quoted by Jonah Goldberg: But it’s time to say something very clearly: Bush’s endorsement of antigay discrimination in the U.S. Constitution itself is a deal-breaker. I can’t endorse him this fall. Like many other gay men and women who have supported him, despite serious disagreements, I feel betrayed, abused, attacked….  I will be excoriated by the same people who always denounce anyone who doesn’t toe the Democratic Party line. “What took you so long?” they sneer. Hope, engagement, principle are my answers. I do not regret trying to make conservatism safe for gays. It’s still possible to be in favor of small government, low taxes, a tough foreign policy, and to be a proud gay man. My principles haven’t changed. Nor will they anytime soon. But when a president allies himself with forces that really do want to keep gay people in jail, therapy, or the closet, it’s time to break off. The deal is broken. And no amount of rationalization can make it whole again.</p><p>The thing that is so typically stupid about Sullivan – who, with Michael Kinsley, ludicrously regards himself as above all conflicts of interest – is that if he were truly a conservative, he could easily justify a break with Bush over the president’s implacable assault on small government.  But, as always, Sullivan is guided by his abnormal desires above all else.  As NRO’s Katherine Lopez correctly predicted: “I do wish Sullivan would save time and come out for Kerry now. In just a matter of time he will come up with the rationalizations, but it’s taking him painfully long to get on with it.”</p><p>“<em>I feel betrayed, abused, attacked….</em>”  Notice how Sullivan’s feelings guide his philosophy.  I have far more respect for Michelangelo Signorile than I do for Andrew Sullivan.  It’s one thing to be hopelessly and reliably wrong, it’s another to be constantly flailing about in a state of complete cognitive dissonance.  It will be a relief to everyone, including Mr. Sullivan himself, when he finally pulls a David Brock and returns to the left’s warm maternal fold.  He’s been a counterfeit conservative from the start, not unlike the man he now so dramatically abjures.</p></div>",
  "content_text": "Andrew Sullivan is quoted by Jonah Goldberg: But it’s time to say something very clearly: Bush’s endorsement of antigay discrimination in the U.S. Constitution itself is a deal-breaker. I can’t endorse him this fall. Like many other gay men and women who have supported him, despite serious disagreements, I feel betrayed, abused, attacked….  I will be excoriated by the same people who always denounce anyone who doesn’t toe the Democratic Party line. “What took you so long?” they sneer. Hope, engagement, principle are my answers. I do not regret trying to make conservatism safe for gays. It’s still possible to be in favor of small government, low taxes, a tough foreign policy, and to be a proud gay man. My principles haven’t changed. Nor will they anytime soon. But when a president allies himself with forces that really do want to keep gay people in jail, therapy, or the closet, it’s time to break off. The deal is broken. And no amount of rationalization can make it whole again.\nThe thing that is so typically stupid about Sullivan – who, with Michael Kinsley, ludicrously regards himself as above all conflicts of interest – is that if he were truly a conservative, he could easily justify a break with Bush over the president’s implacable assault on small government.  But, as always, Sullivan is guided by his abnormal desires above all else.  As NRO’s Katherine Lopez correctly predicted: “I do wish Sullivan would save time and come out for Kerry now. In just a matter of time he will come up with the rationalizations, but it’s taking him painfully long to get on with it.”\n“\nI feel betrayed, abused, attacked….\n”  Notice how Sullivan’s feelings guide his philosophy.  I have far more respect for Michelangelo Signorile than I do for Andrew Sullivan.  It’s one thing to be hopelessly and reliably wrong, it’s another to be constantly flailing about in a state of complete cognitive dissonance.  It will be a relief to everyone, including Mr. Sullivan himself, when he finally pulls a David Brock and returns to the left’s warm maternal fold.  He’s been a counterfeit conservative from the start, not unlike the man he now so dramatically abjures.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-17T07:47:00+00:00"
}