{
  "url": "https://voxday.net/2004/06/23/rabbia-per-il-risultato-di-oporto/",
  "scraped_at": "2025-12-19T20:32:57.013378",
  "title": "Rabbia per il risultato di Oporto",
  "date_display": "June 23, 2004",
  "date_iso": "2004-06-23T06:46:00+00:00",
  "date_from_url": "2004-06-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That’s the headline – angry with the result from Oporto.  And, here come the conspiracies.  Never mind the fact that the Danes and the Swedes were the best two teams in the group and deserved to progress.  Italy almost lost to Bulgaria – they would have if Bulgaria’s striker had been capable of putting away an excellent one-on-one chance with Buffon.  But instead of accepting their own responsibility, they’d rather complain that the other teams were too clever, as the Corriere della Sera writes of the tomatoes they will throw at Denmark for allowing the late tying goal: <em>Chissà come si dice «imbarazzati» in danese, e magari in svedese.</em> “Who knows how you say embarrassed in Danish, and maybe in Swedish.”</p><p>What’s silly is that Italy was losing at the time the Swedes scored and the Azzurri have no one to blame but themselves for not putting away either Denmark or Sweden in the first two games.  Italy was dominating Sweden in the first half, they went into their trademark defensive shell in the second and gave the two points away.  The Italian press was screaming that Trappatoni was too conservative after the World Cup; it so happens that they were right and he should have been replaced.  The Swedes destroyed Bulgaria, the Danes beat them soundly and Italy had to score in the 94th minute to steal the win.</p><p>Italy and Spain have conclusively proven that you can have all the talent in the world, but if your manager is going to saddle you with a defensive approach that simply hopes individual talent will create something out of nothing, you’re going to lose.  I’d much rather see the wide-open styles of the Scandinavians going forward anyhow.</p><p>PS – the Pan-Gargler blogged that he’s getting tired of all the soccer and baseball blogging on the net.  To him, I quote the greatest one-line put-down of all time.  “You can’t spell Citrus without UT.”</p></div>",
  "content_text": "That’s the headline – angry with the result from Oporto.  And, here come the conspiracies.  Never mind the fact that the Danes and the Swedes were the best two teams in the group and deserved to progress.  Italy almost lost to Bulgaria – they would have if Bulgaria’s striker had been capable of putting away an excellent one-on-one chance with Buffon.  But instead of accepting their own responsibility, they’d rather complain that the other teams were too clever, as the Corriere della Sera writes of the tomatoes they will throw at Denmark for allowing the late tying goal:\nChissà come si dice «imbarazzati» in danese, e magari in svedese.\n“Who knows how you say embarrassed in Danish, and maybe in Swedish.”\nWhat’s silly is that Italy was losing at the time the Swedes scored and the Azzurri have no one to blame but themselves for not putting away either Denmark or Sweden in the first two games.  Italy was dominating Sweden in the first half, they went into their trademark defensive shell in the second and gave the two points away.  The Italian press was screaming that Trappatoni was too conservative after the World Cup; it so happens that they were right and he should have been replaced.  The Swedes destroyed Bulgaria, the Danes beat them soundly and Italy had to score in the 94th minute to steal the win.\nItaly and Spain have conclusively proven that you can have all the talent in the world, but if your manager is going to saddle you with a defensive approach that simply hopes individual talent will create something out of nothing, you’re going to lose.  I’d much rather see the wide-open styles of the Scandinavians going forward anyhow.\nPS – the Pan-Gargler blogged that he’s getting tired of all the soccer and baseball blogging on the net.  To him, I quote the greatest one-line put-down of all time.  “You can’t spell Citrus without UT.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-23T05:46:00+00:00"
}