{
  "url": "https://voxday.net/2004/06/29/shifting-sands-of-argumen/",
  "scraped_at": "2025-12-19T20:33:45.830945",
  "title": "Shifting sands of argument",
  "date_display": "June 29, 2004",
  "date_iso": "2004-06-29T07:33:00+00:00",
  "date_from_url": "2004-06-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>Naked Writing <a href=\"http://nakedwriting.com/archives/2004/06/the_numbers_gam_1.html\">takes exception to my clarification of the Spanish Inquisition</a>:</b> It wasn’t that bad. That’s what I’m reading at several sites devoted to the faithful point that the Inquisition “wasn’t that bad.” Instead of millions killed, as popular sentiment maintains, the Roman Catholic Church itself “only” killed a few hundred thousand for heresy and witchcraft crimes – the grand excess of others who died actually perished at the hands of the secular authorities in Roman Catholic countries, carrying out harsh penalties for witchcraft and heresy under their own ensign as opposed to that of the Church. Above that, the other the pains and deaths of those eras attributed to the Inquistion was either Protestant propaganda designed to shift the blame from Protestant states and churches trials for similar crimes onto the memory of those states allied with the RCC.</p><p>What else can one say?  Executing 6,000 people over hundreds of years is not as bad as murdering millions, is it?  If millions of deaths is no worse than a few thousand, then why do so many people have their panties in a bunch over Stalin, Hitler and Mao?  The USA has executed more than 6,000 people in less than half the lifespan of the Spanish Inquisition, should our country then be regarded with the same historical horror as is the Inquisition?  Facts are facts, and the facts are that the common knowledge about the Inquisition is utterly, totally and completely wrong.</p><p>The problem is, the argument that non-theists such as myself make regarding the tragedy of these deaths, isn’t one easily absolved by lowering the body count. Saying that the terrors behind the Inquisition “wasn’t that bad” because “only” 25,000 people were killed in Germany or that the population of the Duchy of Lichenstein was “only” reduced by 10% instead of far higher numbers misses the point. And mounting an argument, as several of those sited do, that Church backed investigations into heresy and witchcraft accusations was better because the Church was “less” likely to use torture . The critique, the point, the crime non-theists point to existed the moment the first person was singled out for an accusation.</p><p>That may be the argument that this individual makes, but it’s not one that anyone else is making.  The argument everyone else makes is that the Spanish Inquisition was a terrible human tragedy in which the Church murdered millions of innocent individuals for the crime of not being Christian.  And that simply isn’t true.  The Inquisition was State law equivalent to current Saudi law that requires citizens in Saudi Arabia to be Muslim, and was far more civilized as it simply exiled those who refused to comply instead of beheading them.  Interesting, that “non-theists” are more troubled by events 500 years ago instead of what is happening right now.  Are they cowards, racists or simply anti-Christian bigots?  I’m not sure, perhaps all three.</p><p>That anyone, at anytime, in any place, for any reason, was maimed, tortured or otherwise victimized because their take on the illusory and intangible was different than the majority’s, are grounds enough for anger.</p><p>You can tell this person is a left-liberal, as he is of the opinion that meaningless posturing counts for something.  Notice how this insensibly mutates the argument from a specific assertion that the Spanish Inquisition was terrible because it slaughtered so many victims into an amorphous condemnation of All Bad Things.</p><p>The “evidence” that Majority Believers — the Orthodox of whatever stripe, creed, faith, understanding, or religion — put forward as evidence proving that their take is the right and correct, is just as fleeting, nebulous and non-existent as every other, heterodox heretic to grace either the rack or the stake. For no matter what flavor of mist one prefers, it is still, in the end, mist, evaporating quickly under the morning light of ration inquiry. It fails to solidify no matter its name “Orthodoxy” or “Heresy.” Be it 1 dead or 1 million, all those who were felled, were so over nothing.</p><p>Naked writing, naked assertions.  Under this individual’s reasoning, one would deny gravity because one cannot see it.  As for the latter statement, it reveals utter ignorance of the very reason the Spanish Inquisition came into being, namely, the fact that Spain was still in the process of expelling the Moorish invaders in completing La Reconquista – the Spanish Inquisition began in 1478 while the Ten Years War for the final piece of the Reconquest, Granada, did not even start until 1481 – and many Moors and Jews not loyal to the Spanish throne were making false conversions to the state religion rather than face expulsion.  Contrary to the Naked Writer’s assertion, the Inquisition was not “over nothing” but was a serious State matter of settling past scores and quelling internal insurrection.  While other Inquisitions focused on heretics, the Spanish Inquisition was far more concerned with hunting down <i>conversos</i>.  The uprisings of the Mudejares in 1500-1502 and the Moriscos in 1568-1571 indicates that these royal concerns were not unfounded.</p><p>Jewish history is rather more sober on the entire subject than the later Protestant propaganda, as it tends to concentrate more on the expulsion of their people from Queen Isabella’s Andalusia (1483) and the rest of Spain (1492), and admits that many of the Jews who remained did make false conversions.  Considering that the American people were quite willing to round up Japanese-Americans over the imagined threat of a Japanese invasion, it seems a little strange to condemn the Spanish people, who had been living under the heel of foreign invaders for 700 years, for wishing to ensure that they were completely rid of all their former occupiers following the long-awaited triumph of the Reconquest.</p></div>",
  "content_text": "Naked Writing\ntakes exception to my clarification of the Spanish Inquisition\n:\nIt wasn’t that bad. That’s what I’m reading at several sites devoted to the faithful point that the Inquisition “wasn’t that bad.” Instead of millions killed, as popular sentiment maintains, the Roman Catholic Church itself “only” killed a few hundred thousand for heresy and witchcraft crimes – the grand excess of others who died actually perished at the hands of the secular authorities in Roman Catholic countries, carrying out harsh penalties for witchcraft and heresy under their own ensign as opposed to that of the Church. Above that, the other the pains and deaths of those eras attributed to the Inquistion was either Protestant propaganda designed to shift the blame from Protestant states and churches trials for similar crimes onto the memory of those states allied with the RCC.\nWhat else can one say?  Executing 6,000 people over hundreds of years is not as bad as murdering millions, is it?  If millions of deaths is no worse than a few thousand, then why do so many people have their panties in a bunch over Stalin, Hitler and Mao?  The USA has executed more than 6,000 people in less than half the lifespan of the Spanish Inquisition, should our country then be regarded with the same historical horror as is the Inquisition?  Facts are facts, and the facts are that the common knowledge about the Inquisition is utterly, totally and completely wrong.\nThe problem is, the argument that non-theists such as myself make regarding the tragedy of these deaths, isn’t one easily absolved by lowering the body count. Saying that the terrors behind the Inquisition “wasn’t that bad” because “only” 25,000 people were killed in Germany or that the population of the Duchy of Lichenstein was “only” reduced by 10% instead of far higher numbers misses the point. And mounting an argument, as several of those sited do, that Church backed investigations into heresy and witchcraft accusations was better because the Church was “less” likely to use torture . The critique, the point, the crime non-theists point to existed the moment the first person was singled out for an accusation.\nThat may be the argument that this individual makes, but it’s not one that anyone else is making.  The argument everyone else makes is that the Spanish Inquisition was a terrible human tragedy in which the Church murdered millions of innocent individuals for the crime of not being Christian.  And that simply isn’t true.  The Inquisition was State law equivalent to current Saudi law that requires citizens in Saudi Arabia to be Muslim, and was far more civilized as it simply exiled those who refused to comply instead of beheading them.  Interesting, that “non-theists” are more troubled by events 500 years ago instead of what is happening right now.  Are they cowards, racists or simply anti-Christian bigots?  I’m not sure, perhaps all three.\nThat anyone, at anytime, in any place, for any reason, was maimed, tortured or otherwise victimized because their take on the illusory and intangible was different than the majority’s, are grounds enough for anger.\nYou can tell this person is a left-liberal, as he is of the opinion that meaningless posturing counts for something.  Notice how this insensibly mutates the argument from a specific assertion that the Spanish Inquisition was terrible because it slaughtered so many victims into an amorphous condemnation of All Bad Things.\nThe “evidence” that Majority Believers — the Orthodox of whatever stripe, creed, faith, understanding, or religion — put forward as evidence proving that their take is the right and correct, is just as fleeting, nebulous and non-existent as every other, heterodox heretic to grace either the rack or the stake. For no matter what flavor of mist one prefers, it is still, in the end, mist, evaporating quickly under the morning light of ration inquiry. It fails to solidify no matter its name “Orthodoxy” or “Heresy.” Be it 1 dead or 1 million, all those who were felled, were so over nothing.\nNaked writing, naked assertions.  Under this individual’s reasoning, one would deny gravity because one cannot see it.  As for the latter statement, it reveals utter ignorance of the very reason the Spanish Inquisition came into being, namely, the fact that Spain was still in the process of expelling the Moorish invaders in completing La Reconquista – the Spanish Inquisition began in 1478 while the Ten Years War for the final piece of the Reconquest, Granada, did not even start until 1481 – and many Moors and Jews not loyal to the Spanish throne were making false conversions to the state religion rather than face expulsion.  Contrary to the Naked Writer’s assertion, the Inquisition was not “over nothing” but was a serious State matter of settling past scores and quelling internal insurrection.  While other Inquisitions focused on heretics, the Spanish Inquisition was far more concerned with hunting down\nconversos\n.  The uprisings of the Mudejares in 1500-1502 and the Moriscos in 1568-1571 indicates that these royal concerns were not unfounded.\nJewish history is rather more sober on the entire subject than the later Protestant propaganda, as it tends to concentrate more on the expulsion of their people from Queen Isabella’s Andalusia (1483) and the rest of Spain (1492), and admits that many of the Jews who remained did make false conversions.  Considering that the American people were quite willing to round up Japanese-Americans over the imagined threat of a Japanese invasion, it seems a little strange to condemn the Spanish people, who had been living under the heel of foreign invaders for 700 years, for wishing to ensure that they were completely rid of all their former occupiers following the long-awaited triumph of the Reconquest.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-29T06:33:00+00:00"
}