{
  "url": "https://voxday.net/2004/06/04/sign-of-null-se/",
  "scraped_at": "2025-12-19T20:30:18.233064",
  "title": "The sign of the null set",
  "date_display": "June 4, 2004",
  "date_iso": "2004-06-04T16:45:00+00:00",
  "date_from_url": "2004-06-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>L <a href=\"http://bloggerblaster.blogspot.com/2004_06_01_bloggerblaster_archive.html#108620786613462030\">writes on Nate’s blog</a>: women who have the same credentials and the same responsibilities as the men in their fields are often paid less than their male colleagues. women are often denied promotions and tenure. women are often denied the opportunity to attend school. women are often subjected to the decisions of the male figures in their lives without ever being given a chance to think or to speak or to express their own opinion.</p><p>Ah yes, the whiny meanderings of a self-professed feminist are always amusing.  Since they’re all afraid to post here, or even email me anymore, I’m forced to make do with the leavings of others.</p><p>I should mention that the above is just a selection of her stream-of-barely-consciousness, but it is nicely representative.  As to her complaints: 1) Women are paid less when they work less.  2) So are men.  3) 56 percent of U.S. college students are female, so clearly we need to deny even more women the opportunity to advanced education if we’re going to have gender equity. 4) It’s impossible to deny anyone the chance to think, although Nate’s visitor seems to have passed on her opportunity to do so before writing.</p><p>Bah – this is child’s play.</p></div>",
  "content_text": "L\nwrites on Nate’s blog\n: women who have the same credentials and the same responsibilities as the men in their fields are often paid less than their male colleagues. women are often denied promotions and tenure. women are often denied the opportunity to attend school. women are often subjected to the decisions of the male figures in their lives without ever being given a chance to think or to speak or to express their own opinion.\nAh yes, the whiny meanderings of a self-professed feminist are always amusing.  Since they’re all afraid to post here, or even email me anymore, I’m forced to make do with the leavings of others.\nI should mention that the above is just a selection of her stream-of-barely-consciousness, but it is nicely representative.  As to her complaints: 1) Women are paid less when they work less.  2) So are men.  3) 56 percent of U.S. college students are female, so clearly we need to deny even more women the opportunity to advanced education if we’re going to have gender equity. 4) It’s impossible to deny anyone the chance to think, although Nate’s visitor seems to have passed on her opportunity to do so before writing.\nBah – this is child’s play.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-04T15:45:00+00:00"
}