{
  "url": "https://voxday.net/2004/06/27/socialisms-idiot-cousin/",
  "scraped_at": "2025-12-19T20:33:30.974967",
  "title": "Socialism’s idiot cousin",
  "date_display": "June 27, 2004",
  "date_iso": "2004-06-27T09:15:00+00:00",
  "date_from_url": "2004-06-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Hindrocket <a href=\"http://www.powerlineblog.com/archives/007014.php\">writes on Powerline</a>: The Democrats’ position is that it is OK for Democrats to produce that show images of Adolf Hitler morphing into George Bush; but it is terrible for Republicans to reproduce those images to point out how nuts the Democrats are. Not all Democrats are crazy. But the Democratic Party has gone insane.</p><p>And then there’s the fact that there is about a 75 percent overlap between the historical NASDAP program and modern Democratic Party policies.  Democrats often remind me of children, with their almost total inability to remember what they did and said yesterday combined with typically over-the-top emotional reactions to anyone who dares point out obvious inconsistencies and errors in their words, policies and actions.</p><p>I despise the current Republican leadership.  I believe they are taking the country directly in the wrong direction in a variety of ways.  However, I do take them seriously, whereas Democrats simply make me laugh in utter disbelief as they flail wildly about.  It takes true ignorance to argue for demonstrably fascist policies while simultaneously tarring the ideological opposition as fascists.  Apparently the Kerry campaign knows its idiot audience well, as this latest propaganda effort demonstrates real contempt for its Democratic base’s memory and analytical ability.</p></div>",
  "content_text": "Hindrocket\nwrites on Powerline\n: The Democrats’ position is that it is OK for Democrats to produce that show images of Adolf Hitler morphing into George Bush; but it is terrible for Republicans to reproduce those images to point out how nuts the Democrats are. Not all Democrats are crazy. But the Democratic Party has gone insane.\nAnd then there’s the fact that there is about a 75 percent overlap between the historical NASDAP program and modern Democratic Party policies.  Democrats often remind me of children, with their almost total inability to remember what they did and said yesterday combined with typically over-the-top emotional reactions to anyone who dares point out obvious inconsistencies and errors in their words, policies and actions.\nI despise the current Republican leadership.  I believe they are taking the country directly in the wrong direction in a variety of ways.  However, I do take them seriously, whereas Democrats simply make me laugh in utter disbelief as they flail wildly about.  It takes true ignorance to argue for demonstrably fascist policies while simultaneously tarring the ideological opposition as fascists.  Apparently the Kerry campaign knows its idiot audience well, as this latest propaganda effort demonstrates real contempt for its Democratic base’s memory and analytical ability.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-27T08:15:00+00:00"
}