{
  "url": "https://voxday.net/2004/06/16/submission/",
  "scraped_at": "2025-12-19T20:32:05.831266",
  "title": "Submission",
  "date_display": "June 16, 2004",
  "date_iso": "2004-06-16T18:26:00+00:00",
  "date_from_url": "2004-06-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s fascinating to read Doug Kenline’s <a href=\"http://dougkenline.blogspot.com/2004_06_13_dougkenline_archive.html#108723800284885663\">decision to submit</a> to the will of the collection of Puerto Rican revenue agencies that is the IRS.  It reads rather like Winston’s embrace of Big Brother, with the added pathos that Doug clearly believes that what he’s doing is wrong.  There’s even a demonic Greek choir of tax cheerleaders welcoming him back to the fold.</p><p>But I don’t fault Doug for submitting, any more than I fault those millions of people who know better but choose to continue filing because they fear experiencing what Doug has gone through for the past few years.  It’s extraordinarily difficult to live the conventional American life and not submit.  A corporate job, a mortgage, a bank account, all these things can and will be used against you in a Tax Court of counterfeit law.  Unless you want to pull a Fred Reed, sip margaritas and siesta with the signorinas, it’s tremendously difficult.</p><p>Now, none of this surprises me or has any impact on me whatsoever.  The truth is what is is, and the fact that the service is able to make effective use of third parties in order to bend many targets to its will is of no account.  If anything, it tends to suggest the weakness of its legal position.  But legalities make little difference since the IRS has operated outside legal parameters from the very beginning.  I have understood the true nature of the IRS since my first, accidental encounter with them some years ago, when an agent was kind enough to explain to me that petty things like the law and the Constitution were irrelevant, as nothing was involved except the reality of force.  It is an old story, indeed, one of the oldest.</p><p>No one ever said that following the truth would be easy.  Quite the opposite, as a matter of fact.</p></div>",
  "content_text": "It’s fascinating to read Doug Kenline’s\ndecision to submit\nto the will of the collection of Puerto Rican revenue agencies that is the IRS.  It reads rather like Winston’s embrace of Big Brother, with the added pathos that Doug clearly believes that what he’s doing is wrong.  There’s even a demonic Greek choir of tax cheerleaders welcoming him back to the fold.\nBut I don’t fault Doug for submitting, any more than I fault those millions of people who know better but choose to continue filing because they fear experiencing what Doug has gone through for the past few years.  It’s extraordinarily difficult to live the conventional American life and not submit.  A corporate job, a mortgage, a bank account, all these things can and will be used against you in a Tax Court of counterfeit law.  Unless you want to pull a Fred Reed, sip margaritas and siesta with the signorinas, it’s tremendously difficult.\nNow, none of this surprises me or has any impact on me whatsoever.  The truth is what is is, and the fact that the service is able to make effective use of third parties in order to bend many targets to its will is of no account.  If anything, it tends to suggest the weakness of its legal position.  But legalities make little difference since the IRS has operated outside legal parameters from the very beginning.  I have understood the true nature of the IRS since my first, accidental encounter with them some years ago, when an agent was kind enough to explain to me that petty things like the law and the Constitution were irrelevant, as nothing was involved except the reality of force.  It is an old story, indeed, one of the oldest.\nNo one ever said that following the truth would be easy.  Quite the opposite, as a matter of fact.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-16T17:26:00+00:00"
}