{
  "url": "https://voxday.net/2004/06/25/umberto-eco-on-end-of-democracy/",
  "scraped_at": "2025-12-19T20:33:18.147734",
  "title": "Umberto Eco on the end of democracy",
  "date_display": "June 25, 2004",
  "date_iso": "2004-06-25T13:39:00+00:00",
  "date_from_url": "2004-06-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Big Chilly once told me that he greatly respected how I often use my<br> public platform for mysterious and seemingly nonsensical purposes.  In<br> that light, it gives me great pleasure to present more of that for which<br> no one is asking, a translation of an article by Umberto Eco which<br> appeared on June 25th in L’espresso: <a href=\"http://www.espressonline.it/eol/free/jsp/detail.jsp?m1s=o&amp;m2s=null&amp;idCategory=4789&amp;idContent=576580\">Apparire piu come essere</a>.<br> <b> </b></br></br></br></br></br></p><blockquote class=\"tr_bq\"><p> <b>To appear more than to be</b></p><p>Sixty-four years before Christ, Marcus Tullius Cicero, already a<br> celebrated orator but the epitome of a New Man, estranged from the<br> nobility, decided to declare himself a candidate for Consul.  His<br> brother, Quintus Tullius, wrote for him a manual in which he was<br> instructed how to make an impression.  In the front of the current<br> Italian edition, (<em>Manuele del candidato – Istruzioni per vincere le elezioni, editore Manni, 8 euros</em>),<br> are comments by Luca Canali, in which he lucidly describes the<br> histoical circumstances and the personalities of that campaign.  Furio<br> Colombo writes the introduction, with a reflective essay on the First<br> Republic.</br></br></br></br></br></br></br></br></br></p><p>In fact, there are many similarities between our Second Republic and<br> this Roman Republic, in the virtues, (very small), as well as the<br> defects.  The example of Rome, over the course of more than two<br> millenia, has continued to hold much influence on many successive<br> visions of the State.  As Colombo records, the antique model of the<br> Roman Republic inspired the authors of the Federalist Papers, which<br> delineated the fundamental lines of the American Constitution.  They saw<br> in Rome, more than in Athens, the example of what was truly a democracy<br> of the people.  In their pragmatic realism, the neocons around Bush<br> were inspired by the image of imperial Rome and many of their actual<br> political discussions gave recourse to the idea of an empire, that of a<br> “Pax Americana” which makes explicit reference to the ideology of the<br> “Pax Romana”.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>I must note that the image of electoral competition that emerges in<br> the 20 pages of Quintus is of extremely small virtue compared to that<br> which had inspired the federalists of the 18th century.  Quintus does<br> not seem to even consider the possibility of a political man who boldly<br> confronts the electorate in the face of dissent with a courageous<br> project, with the hope of conquering the voters on the powerful strength<br> of a utopian idea.  As Canali also notes, totally absent from these<br> pages is any notion of debating ideas; instead, there is recommendation<br> to never expose oneself on any political issue, so as to avoid making<br> enemies.  The candidate envisioned by Quintus must only be sure to<br> appear fascinating, doing favors and other self-promotion, never saying<br> no to anyone but leaving everyone with the impression he will do what<br> they want.  The memory of the electorate is short, and before long they<br> will forget old promises….</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>At the end of the letter we ask: but is democracy truly only this, a<br> form of conquering the public favor that is founded on nothing but<br> appearances and a strategy of deceit?  It is certainly so, and it cannot<br> be differently if this system, (which, as Churchill said, is imperfect,<br> but is less imperfect than all the others), allows one to arrive at<br> power only through consensus and not through force and violence.  But we<br> must not forget that these instructions for a political campaign were<br> written at moment when Roman democracy was already in crisis.</br></br></br></br></br></br></br></p><p>It was not long after when Caesar definitively took power with the<br> assistance of his legions, and with his life Marcus Tullius paid the<br> passage from a regime founded on consensus to a regime founded on the<br> fist of the State.  But one cannot avoid the thought that Roman<br> democracy had begun to die when its politicians understood that they no<br> longer had to be serious about their policies but had only to engineer<br> the obtaining of the sympathies of those we might well call television<br> viewers.</br></br></br></br></br></br></br></p></blockquote><p>This demonstrates that there is truly nothing new under the sun.  In<br> our modern arrogance, we believe that we are different, that our<br> pseudo-democracy, (as false in every way to the democratic ideal as was<br> its Roman predecessor), is a light illuminating all mankind.  Quintus<br> Tullius might easily have been Dick Morris or Karl Rove, advising<br> hollow-suited frauds such as Bill Clinton and George Bush.</br></br></br></br></br></p><p>The laws of history are not as easily discerned as the laws of<br> physics, but they are every bit as inexorable.  Eco gives us one more<br> reason to believe that we are living in the last days of the American<br> Republic.</br></br></br></p></div>",
  "content_text": "Big Chilly once told me that he greatly respected how I often use my\npublic platform for mysterious and seemingly nonsensical purposes.  In\nthat light, it gives me great pleasure to present more of that for which\nno one is asking, a translation of an article by Umberto Eco which\nappeared on June 25th in L’espresso:\nApparire piu come essere\n.\nTo appear more than to be\nSixty-four years before Christ, Marcus Tullius Cicero, already a\ncelebrated orator but the epitome of a New Man, estranged from the\nnobility, decided to declare himself a candidate for Consul.  His\nbrother, Quintus Tullius, wrote for him a manual in which he was\ninstructed how to make an impression.  In the front of the current\nItalian edition, (\nManuele del candidato – Istruzioni per vincere le elezioni, editore Manni, 8 euros\n),\nare comments by Luca Canali, in which he lucidly describes the\nhistoical circumstances and the personalities of that campaign.  Furio\nColombo writes the introduction, with a reflective essay on the First\nRepublic.\nIn fact, there are many similarities between our Second Republic and\nthis Roman Republic, in the virtues, (very small), as well as the\ndefects.  The example of Rome, over the course of more than two\nmillenia, has continued to hold much influence on many successive\nvisions of the State.  As Colombo records, the antique model of the\nRoman Republic inspired the authors of the Federalist Papers, which\ndelineated the fundamental lines of the American Constitution.  They saw\nin Rome, more than in Athens, the example of what was truly a democracy\nof the people.  In their pragmatic realism, the neocons around Bush\nwere inspired by the image of imperial Rome and many of their actual\npolitical discussions gave recourse to the idea of an empire, that of a\n“Pax Americana” which makes explicit reference to the ideology of the\n“Pax Romana”.\nI must note that the image of electoral competition that emerges in\nthe 20 pages of Quintus is of extremely small virtue compared to that\nwhich had inspired the federalists of the 18th century.  Quintus does\nnot seem to even consider the possibility of a political man who boldly\nconfronts the electorate in the face of dissent with a courageous\nproject, with the hope of conquering the voters on the powerful strength\nof a utopian idea.  As Canali also notes, totally absent from these\npages is any notion of debating ideas; instead, there is recommendation\nto never expose oneself on any political issue, so as to avoid making\nenemies.  The candidate envisioned by Quintus must only be sure to\nappear fascinating, doing favors and other self-promotion, never saying\nno to anyone but leaving everyone with the impression he will do what\nthey want.  The memory of the electorate is short, and before long they\nwill forget old promises….\nAt the end of the letter we ask: but is democracy truly only this, a\nform of conquering the public favor that is founded on nothing but\nappearances and a strategy of deceit?  It is certainly so, and it cannot\nbe differently if this system, (which, as Churchill said, is imperfect,\nbut is less imperfect than all the others), allows one to arrive at\npower only through consensus and not through force and violence.  But we\nmust not forget that these instructions for a political campaign were\nwritten at moment when Roman democracy was already in crisis.\nIt was not long after when Caesar definitively took power with the\nassistance of his legions, and with his life Marcus Tullius paid the\npassage from a regime founded on consensus to a regime founded on the\nfist of the State.  But one cannot avoid the thought that Roman\ndemocracy had begun to die when its politicians understood that they no\nlonger had to be serious about their policies but had only to engineer\nthe obtaining of the sympathies of those we might well call television\nviewers.\nThis demonstrates that there is truly nothing new under the sun.  In\nour modern arrogance, we believe that we are different, that our\npseudo-democracy, (as false in every way to the democratic ideal as was\nits Roman predecessor), is a light illuminating all mankind.  Quintus\nTullius might easily have been Dick Morris or Karl Rove, advising\nhollow-suited frauds such as Bill Clinton and George Bush.\nThe laws of history are not as easily discerned as the laws of\nphysics, but they are every bit as inexorable.  Eco gives us one more\nreason to believe that we are living in the last days of the American\nRepublic.",
  "tags": [
    "Eco",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2004-06-25T12:39:00+00:00"
}