{
  "url": "https://voxday.net/2004/06/14/unworthy-of-shoes/",
  "scraped_at": "2025-12-19T20:31:52.866890",
  "title": "Unworthy of the shoes",
  "date_display": "June 14, 2004",
  "date_iso": "2004-06-14T13:37:00+00:00",
  "date_from_url": "2004-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jonah Goldberg agrees with my assertion that <a href=\"http://www.nationalreview.com/goldberg/goldberg200406140834.asp\">Bush is no Reagan</a>:  Bush seems to have abandoned the rhetorical high ground. Reagan declared that government wasn’t the solution, it was the problem. In countless ways, Bush has been saying the reverse. And once you concede that the “government has to move” every time “somebody” hurts, you’ve pretty much abandoned your dogma and picked up the opposition’s.  What makes things even worse is that while Bush may be good and decent and unfairly criticized for a host of things, he’s a terrible spokesman for conservative principles.</p><p>I suggest that this is because George W. Bush is not, and has never been, a conservative.  Is there one thing he has done that Bob Dole, the tax collector for the welfare state, would not have?  Less than a year later, even Republican professional consultants are admitting that the Medicare entitlement is a disaster in both practical and political terms, and just imagine if his immigration amnesty had not been so vehemently resisted by the Republican Congress.</p><p>I’d thought that the homogamy issue would give Bush a slam dunk in the election, but the president, timorous creature that he is, is afraid to run on the issue.  I am beginning to suspect that Joseph Farah is correct and Bush’s cowardice and lack of conservative conviction may cost him the election, despite John Kerry’s incompetence.</p><p>Reagan, one must remember, was always considered an over-principled extremist.  He dared to take risks.  He also won by landslides in a political environment that was markedly less open to conservative ideas than today.</p></div>",
  "content_text": "Jonah Goldberg agrees with my assertion that\nBush is no Reagan\n:  Bush seems to have abandoned the rhetorical high ground. Reagan declared that government wasn’t the solution, it was the problem. In countless ways, Bush has been saying the reverse. And once you concede that the “government has to move” every time “somebody” hurts, you’ve pretty much abandoned your dogma and picked up the opposition’s.  What makes things even worse is that while Bush may be good and decent and unfairly criticized for a host of things, he’s a terrible spokesman for conservative principles.\nI suggest that this is because George W. Bush is not, and has never been, a conservative.  Is there one thing he has done that Bob Dole, the tax collector for the welfare state, would not have?  Less than a year later, even Republican professional consultants are admitting that the Medicare entitlement is a disaster in both practical and political terms, and just imagine if his immigration amnesty had not been so vehemently resisted by the Republican Congress.\nI’d thought that the homogamy issue would give Bush a slam dunk in the election, but the president, timorous creature that he is, is afraid to run on the issue.  I am beginning to suspect that Joseph Farah is correct and Bush’s cowardice and lack of conservative conviction may cost him the election, despite John Kerry’s incompetence.\nReagan, one must remember, was always considered an over-principled extremist.  He dared to take risks.  He also won by landslides in a political environment that was markedly less open to conservative ideas than today.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-14T12:37:00+00:00"
}