{
  "url": "https://voxday.net/2004/06/01/vox-tox-second-whack/",
  "scraped_at": "2025-12-19T20:29:57.939999",
  "title": "Vox Tox: the second whack",
  "date_display": "June 1, 2004",
  "date_iso": "2004-06-01T07:08:00+00:00",
  "date_from_url": "2004-06-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not planning on doing a daily Vox Tox or anything – once a week is most likely – but I didn’t think the Libertarian nomination should pass <a href=\"http://voxday.net/tox\">without comment</a>.  I also had some interesting email that called for addressing and I wanted to see if using a different recording method might help a bit.</p><p>For those who are interested, I’m using an Open Source recording program called Audacity.  I record with that, run the Amplify effect on my voice, then paste the music into the beginning, middle and end.  I then export it as an MP3.  Unfortunately, the program gives me no control over whether the MP3 is exported at 128, 96 or 64.  I did try exporting it as an .OGG, but that reduced the size of the 17 meg file by less than one meg.</p><p>Anyhow, let me know if you think the quality is better or worse than last time.  I also had an idea… there’s a number of different bloggers out there audioblogging, and someone with more time to devote to this than me could pull them together, do a little mixing and stream them using Pirate Radio.</p></div>",
  "content_text": "I’m not planning on doing a daily Vox Tox or anything – once a week is most likely – but I didn’t think the Libertarian nomination should pass\nwithout comment\n.  I also had some interesting email that called for addressing and I wanted to see if using a different recording method might help a bit.\nFor those who are interested, I’m using an Open Source recording program called Audacity.  I record with that, run the Amplify effect on my voice, then paste the music into the beginning, middle and end.  I then export it as an MP3.  Unfortunately, the program gives me no control over whether the MP3 is exported at 128, 96 or 64.  I did try exporting it as an .OGG, but that reduced the size of the 17 meg file by less than one meg.\nAnyhow, let me know if you think the quality is better or worse than last time.  I also had an idea… there’s a number of different bloggers out there audioblogging, and someone with more time to devote to this than me could pull them together, do a little mixing and stream them using Pirate Radio.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-01T06:08:00+00:00"
}