{
  "url": "https://voxday.net/2004/06/22/what-media-bias-2/",
  "scraped_at": "2025-12-19T20:32:51.481558",
  "title": "What media bias?",
  "date_display": "June 22, 2004",
  "date_iso": "2004-06-22T14:20:00+00:00",
  "date_from_url": "2004-06-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Few studies provide an objective measure of the slant of news, and none has provided a way to link such a measure to ideological measures of other political actors.  That is, none of the existing measures can say, for example, whether the New York Times is more liberal than Tom Daschle or whether Fox News is more conservative than Bill Frist.  We provide such a measure.  Namely, we compute an ADA score for various news outlets, including the New York Times, the Los Angeles Times, USA Today, the Drudge Report, Fox News’ Special Report, and all three networks’ nightly news shows.</p><p>Our results show <a href=\"http://216.239.51.104/search?q=cache:tCEKSNVW-OYJ:mason.gmu.edu/~atabarro/MediaBias.doc+drudge%3F&amp;hl=en\">a very significant liberal bias</a>. All of the news outlets except Fox News’ Special Report received a score to the left of the average member of Congress.  Moreover, by one of our measures all but three of these media outlets (Special Report, the Drudge Report, and ABC’s World News Tonight) were closer to the average Democrat in Congress than to the median member of the House of Representatives.  One of our measures found that the Drudge Report is the most centrist of all media outlets in our sample.  Our other measure found that Fox News’ Special Report is the most centrist.  These findings refer strictly to the news stories of the outlets.  That is, we omitted editorials, book reviews, and letters to the editor from our sample….</p><p>11.2 Republican average<br> <br>26.4 Fox News’ Special Report<br> <br>40.0 Senate average<br> <br>44.1 Drudge Report<br> <br>44.5 House average<br> <br>54.8 ABC World News<br> <br>58.4 LA Times<br> <br>62.5 NBC Nightly News<br> <br>62.6 USA Today<br> <br>64.5 CBS Evening News<br> <br>64.6 New York Times<br> <br>74.1 Democratic average</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Of course, the fact that these are all big corporations trumps everything they are reporting, printing and broadcasting.  If you’re Eric Alterman, or dumb enough to be mistaken for him, that is.</p></div>",
  "content_text": "Few studies provide an objective measure of the slant of news, and none has provided a way to link such a measure to ideological measures of other political actors.  That is, none of the existing measures can say, for example, whether the New York Times is more liberal than Tom Daschle or whether Fox News is more conservative than Bill Frist.  We provide such a measure.  Namely, we compute an ADA score for various news outlets, including the New York Times, the Los Angeles Times, USA Today, the Drudge Report, Fox News’ Special Report, and all three networks’ nightly news shows.\nOur results show\na very significant liberal bias\n. All of the news outlets except Fox News’ Special Report received a score to the left of the average member of Congress.  Moreover, by one of our measures all but three of these media outlets (Special Report, the Drudge Report, and ABC’s World News Tonight) were closer to the average Democrat in Congress than to the median member of the House of Representatives.  One of our measures found that the Drudge Report is the most centrist of all media outlets in our sample.  Our other measure found that Fox News’ Special Report is the most centrist.  These findings refer strictly to the news stories of the outlets.  That is, we omitted editorials, book reviews, and letters to the editor from our sample….\n11.2 Republican average\n26.4 Fox News’ Special Report\n40.0 Senate average\n44.1 Drudge Report\n44.5 House average\n54.8 ABC World News\n58.4 LA Times\n62.5 NBC Nightly News\n62.6 USA Today\n64.5 CBS Evening News\n64.6 New York Times\n74.1 Democratic average\nOf course, the fact that these are all big corporations trumps everything they are reporting, printing and broadcasting.  If you’re Eric Alterman, or dumb enough to be mistaken for him, that is.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-22T13:20:00+00:00"
}