{
  "url": "https://voxday.net/2004/06/30/wheres-my-bottle/",
  "scraped_at": "2025-12-19T20:33:56.998066",
  "title": "Where’s my bottle?",
  "date_display": "June 30, 2004",
  "date_iso": "2004-06-30T07:32:00+00:00",
  "date_from_url": "2004-06-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Urs Meier, the referee who single-handedly knocked England out of Euro 2004, has the nerve to say:</p><blockquote><p> I’m absolutely shocked by what’s gone on and the attacks from The Sun, the supporters and the other newspapers. I’m really shocked because the decision was 100 per cent correct and the whole world saw this decision was correct.</p></blockquote><p>Meier certainly doesn’t deserve the death threats he’s been getting, but all the stick he’s been receiving from the English press is absolutely justified.  Their outrage would probably be significantly mitigated if he simply admitted that he made an honest and all-too-typical mistake of awarding a phantom foul in the box.  But instead he flings this “100 percent correct” nonsense around and makes even lukewarm England supporters like me want to punch him in the face.</p><p>The truth of the matter is easy to ascertain.  All that’s required is a simple review of all the fouls called in the penalty box when there is a chaotic situation and the referee can’t see exactly what is going on.  I’d be willing to bet that <em>at least</em> 90 percent of the whistles blown are fouls called on the attacking team.  This defies belief, and the unfair bias can be proved by comparing the ratio with the ratio of fouls called in the open field of play.</p><p>The only thing I hate more than phantom fouls in the box are diving strikers and phantom offsides calls.  UEFA has done a good job dealing with the latter two, it’s now clearly time to do something about the former.<br/></p></div>",
  "content_text": "Urs Meier, the referee who single-handedly knocked England out of Euro 2004, has the nerve to say:\nI’m absolutely shocked by what’s gone on and the attacks from The Sun, the supporters and the other newspapers. I’m really shocked because the decision was 100 per cent correct and the whole world saw this decision was correct.\nMeier certainly doesn’t deserve the death threats he’s been getting, but all the stick he’s been receiving from the English press is absolutely justified.  Their outrage would probably be significantly mitigated if he simply admitted that he made an honest and all-too-typical mistake of awarding a phantom foul in the box.  But instead he flings this “100 percent correct” nonsense around and makes even lukewarm England supporters like me want to punch him in the face.\nThe truth of the matter is easy to ascertain.  All that’s required is a simple review of all the fouls called in the penalty box when there is a chaotic situation and the referee can’t see exactly what is going on.  I’d be willing to bet that\nat least\n90 percent of the whistles blown are fouls called on the attacking team.  This defies belief, and the unfair bias can be proved by comparing the ratio with the ratio of fouls called in the open field of play.\nThe only thing I hate more than phantom fouls in the box are diving strikers and phantom offsides calls.  UEFA has done a good job dealing with the latter two, it’s now clearly time to do something about the former.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-30T06:32:00+00:00"
}