{
  "url": "https://voxday.net/2004/06/26/wrinkled-whores/",
  "scraped_at": "2025-12-19T20:33:23.658963",
  "title": "The wrinkled whores",
  "date_display": "June 26, 2004",
  "date_iso": "2004-06-26T07:18:00+00:00",
  "date_from_url": "2004-06-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The entire S&amp;P price action in the Futures is being controlled by one counter party. All the guys strongly hate them: their CME clearing number is 990N and they clear through Gelber trading.  That one account is solely responsible for the current level of the S&amp;P.</p><p>They are the ones that are throwing the S&amp;P up overnight. Then they are the ones that are sitting on the bid all day long, supporting the market action. The S&amp;P pits have been decimated, absolutely ruined. There is no volatility, so all the traders have left. Now the hot pit is the Eurodollar pit. Go figure, that used to be like watching paint dry. All the traders I have talked to view the market as being rigged. They keep waiting for the price action to break loose, but it never does.</p><p>They are stunned by the lack of volatility. And furious. Time after time after time 990 just sits there on the bid. Don’t they ever go away. They just absorb the entire market and then push the price wherever they want it to go. “Gee, I wonder who that counter party is.” They are all terrified of shorting, because every time they do, they get drilled. I thought it was just my systems that weren’t working that well, but they are far more dispirited than I. Intervention at its finest, your tax dollars at work, providing the ultimate tax to us all.</p><p>We have watched 2000 contract market orders on the Bid at key down levels of – 50 and – 100 on those rare days when 990N decides the program trading will revert to a well-defined pattern of “allowable” retracements. The Mini’s are being rigged in order to provide “support” for swollen price levels. They have to be for now, as without the daily rigging, “Price” would revert to its inherent “Value”, a disturbing proposition to those benefiting from the financial economy’s adolescent denials.</p><p>Counterparties provide an important function in any exchange, liquidity. Given the incessant “intervention” by 990N, there is very little liquidity beneath these markets to provide real support.  I am actually writing you to alert you to this complete market manipulation and to see if you had any pull to get the word out to different traders and the media. I am one of the biggest S&amp;P traders in the world as far as volume per day in that I average over 40,000 round turns per day on the screen in the e-mini. I tell you this because that is how I know one house is completely manipulating the market everyday because of all the trades I do with this guy. I know it sounds hard to believe that one person can control a world market but trust me: this is occurring. He works for the firm Gelber, which is house 990.</p><p>This is the basic premise for his game. He waits until the market is relatively slow, around 9:30 to 10:00 everyday, usually when the “paper trade” starts to subside then he begins a theme, mostly always long and he begins to buy. He is always looking for confirmation of his theme with what other people are doing.  When the market stops trading in his direction he then drops in a offer of 300 to 700 which he sees if anyone is interested in buying it. If there is no interest he then buys the order from himself, with the order actually trading. He does this enough times until he attracts other buyers which then hits price points and the market runs violently in his direction.</p><p>I am sure I do not have to tell you that this is completely illegal to do. He started doing this with 300 lots back in November, now he has made so much money doing it that he is up to 2000 lots. He is completely in control of the market (illegally) the majority of the time.  My firm and I have contacted the Merc on three different occasions with video proof that I recorded of my trading. It shows blatantly this guy crossing his orders thousands of times a day. The first person we talked to in compliance admitted that he saw something there when they reviewed the video of the trades I taped of him. He was mysteriously fired the next day.</p><p>We then came up with more examples for them to review and in the beginning they claimed he wasn’t doing it. We called them a third time, this time talking to the head of compliance and he finally admitted that they had the guy under investigation because they saw something, but in the meantime he is still allowed to trade and make millions until their “investigation” is concluded.</p><p>They obviously love the volume the guy is putting up and how it makes the emini S&amp;P look from a standpoint of a liquid market. But if the public had knowledge of what this guy was doing I don’t think they would be too impressed with the liquidity. There is obviously some kind of cover-up. Do any of the pit traders you know have knowledge this is happening? And do you have any advice on how I can anonymously get the word out with what this guy is doing? I know you are not a true tick by tick “scalper,” but this is getting to the point where it is starting to effect everyone in the marketplace.</p><p>I have no way of knowing if this is true or not, but both the VIX as well as Adam Hamilton’s analysis demonstrate that <a href=\"http://www.321gold.com/editorials/hamilton/hamilton062604.html\">volatility has been at a historically low level</a> for an incredibly long period of time, which is anecdotal support for what this trader is asserting.  I have no doubt the markets are manipulated – they are regulated, after all, which is nothing but open manipulation, and one has to presume that the Working Group of Financial Markets was created for a reason.</p><p>You might think that we have a free market in this country, but a few minutes reflection about the myriad of regulatory agencies and their actions will soon convince you otherwise.</p></div>",
  "content_text": "The entire S&P price action in the Futures is being controlled by one counter party. All the guys strongly hate them: their CME clearing number is 990N and they clear through Gelber trading.  That one account is solely responsible for the current level of the S&P.\nThey are the ones that are throwing the S&P up overnight. Then they are the ones that are sitting on the bid all day long, supporting the market action. The S&P pits have been decimated, absolutely ruined. There is no volatility, so all the traders have left. Now the hot pit is the Eurodollar pit. Go figure, that used to be like watching paint dry. All the traders I have talked to view the market as being rigged. They keep waiting for the price action to break loose, but it never does.\nThey are stunned by the lack of volatility. And furious. Time after time after time 990 just sits there on the bid. Don’t they ever go away. They just absorb the entire market and then push the price wherever they want it to go. “Gee, I wonder who that counter party is.” They are all terrified of shorting, because every time they do, they get drilled. I thought it was just my systems that weren’t working that well, but they are far more dispirited than I. Intervention at its finest, your tax dollars at work, providing the ultimate tax to us all.\nWe have watched 2000 contract market orders on the Bid at key down levels of – 50 and – 100 on those rare days when 990N decides the program trading will revert to a well-defined pattern of “allowable” retracements. The Mini’s are being rigged in order to provide “support” for swollen price levels. They have to be for now, as without the daily rigging, “Price” would revert to its inherent “Value”, a disturbing proposition to those benefiting from the financial economy’s adolescent denials.\nCounterparties provide an important function in any exchange, liquidity. Given the incessant “intervention” by 990N, there is very little liquidity beneath these markets to provide real support.  I am actually writing you to alert you to this complete market manipulation and to see if you had any pull to get the word out to different traders and the media. I am one of the biggest S&P traders in the world as far as volume per day in that I average over 40,000 round turns per day on the screen in the e-mini. I tell you this because that is how I know one house is completely manipulating the market everyday because of all the trades I do with this guy. I know it sounds hard to believe that one person can control a world market but trust me: this is occurring. He works for the firm Gelber, which is house 990.\nThis is the basic premise for his game. He waits until the market is relatively slow, around 9:30 to 10:00 everyday, usually when the “paper trade” starts to subside then he begins a theme, mostly always long and he begins to buy. He is always looking for confirmation of his theme with what other people are doing.  When the market stops trading in his direction he then drops in a offer of 300 to 700 which he sees if anyone is interested in buying it. If there is no interest he then buys the order from himself, with the order actually trading. He does this enough times until he attracts other buyers which then hits price points and the market runs violently in his direction.\nI am sure I do not have to tell you that this is completely illegal to do. He started doing this with 300 lots back in November, now he has made so much money doing it that he is up to 2000 lots. He is completely in control of the market (illegally) the majority of the time.  My firm and I have contacted the Merc on three different occasions with video proof that I recorded of my trading. It shows blatantly this guy crossing his orders thousands of times a day. The first person we talked to in compliance admitted that he saw something there when they reviewed the video of the trades I taped of him. He was mysteriously fired the next day.\nWe then came up with more examples for them to review and in the beginning they claimed he wasn’t doing it. We called them a third time, this time talking to the head of compliance and he finally admitted that they had the guy under investigation because they saw something, but in the meantime he is still allowed to trade and make millions until their “investigation” is concluded.\nThey obviously love the volume the guy is putting up and how it makes the emini S&P look from a standpoint of a liquid market. But if the public had knowledge of what this guy was doing I don’t think they would be too impressed with the liquidity. There is obviously some kind of cover-up. Do any of the pit traders you know have knowledge this is happening? And do you have any advice on how I can anonymously get the word out with what this guy is doing? I know you are not a true tick by tick “scalper,” but this is getting to the point where it is starting to effect everyone in the marketplace.\nI have no way of knowing if this is true or not, but both the VIX as well as Adam Hamilton’s analysis demonstrate that\nvolatility has been at a historically low level\nfor an incredibly long period of time, which is anecdotal support for what this trader is asserting.  I have no doubt the markets are manipulated – they are regulated, after all, which is nothing but open manipulation, and one has to presume that the Working Group of Financial Markets was created for a reason.\nYou might think that we have a free market in this country, but a few minutes reflection about the myriad of regulatory agencies and their actions will soon convince you otherwise.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-26T06:18:00+00:00"
}