{
  "url": "https://voxday.net/2004/06/22/your-papers-please/",
  "scraped_at": "2025-12-19T20:32:49.645110",
  "title": "Your papers, please",
  "date_display": "June 22, 2004",
  "date_iso": "2004-06-22T14:05:00+00:00",
  "date_from_url": "2004-06-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Slashdot: Today the Supreme Court of the United States ruled that <a href=\"http://slashdot.org/article.pl?sid=04/06/22/0130243\">anybody can be compelled at any time to identify themselves</a>, if a police officer asks. People who refuse to identify themselves, even if they are not suspected of a crime, will be arrested. Sound Orwellian? The Supreme Court also said people who are suspected of another crime might not be subject to arrest for not revealing their name. On this latter point, someone will have to bring a separate case. And the SCOTUS is at liberty not to hear any case it doesn’t like. The case is Hiibel v. Sixth Judicial District Court of Nevada.</p><p>What did Europe say after 9/11?  We are all Americans?  I think they had it backwards.  Now, thanks to these black-robed defenders of our Constitutional rights, we are all to be good Chermans.  It is now a crime to remain silent – so much for that right.</p><p>How long will it be before it becomes a crime to give a false name as well?  Then, you will obviously be required to provide identification proving you are who you say you are. Thank goodness we can elect a Republican Congress and President to stop these egregious abuses of liberty!  Wait a minute….</p></div>",
  "content_text": "From Slashdot: Today the Supreme Court of the United States ruled that\nanybody can be compelled at any time to identify themselves\n, if a police officer asks. People who refuse to identify themselves, even if they are not suspected of a crime, will be arrested. Sound Orwellian? The Supreme Court also said people who are suspected of another crime might not be subject to arrest for not revealing their name. On this latter point, someone will have to bring a separate case. And the SCOTUS is at liberty not to hear any case it doesn’t like. The case is Hiibel v. Sixth Judicial District Court of Nevada.\nWhat did Europe say after 9/11?  We are all Americans?  I think they had it backwards.  Now, thanks to these black-robed defenders of our Constitutional rights, we are all to be good Chermans.  It is now a crime to remain silent – so much for that right.\nHow long will it be before it becomes a crime to give a false name as well?  Then, you will obviously be required to provide identification proving you are who you say you are. Thank goodness we can elect a Republican Congress and President to stop these egregious abuses of liberty!  Wait a minute….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-06-22T13:05:00+00:00"
}