{
  "url": "https://voxday.net/2024/01/16/a-boomer-on-gab/",
  "scraped_at": "2026-01-08T14:21:12.407289",
  "title": "A Boomer on Gab",
  "date_display": "January 16, 2024",
  "date_iso": "2024-01-16T14:13:33+00:00",
  "date_from_url": "2024-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><strong>BOOMER: </strong><em>Soon you all can move out of mom’s basement…..</em></p><p><strong>VD: </strong>We’ll have to move out. Mom reverse-mortgaged the house and will die engulfed in debt, so there’s nothing to inherit and nowhere to live.</p><p><strong>BOOMER: </strong><em>Go earn your own house, like everyone I know. I inherited nothing.</em></p><p><strong>VD: </strong> The Boomers inherited more, and will leave less behind them as a percentage of what they inherited, than any generation in memory. You’re a historically wicked generation.</p><p><strong>BOOMER: </strong> <em>Boohooo Mommy didn’t leave me anything. You sound childish, I wouldn’t have left you anything either.</em></p><p><strong>VD: </strong> I know you wouldn’t have. You’re not a good man. A good man leaves an inheritance to his children and to his children’s children.</p><p>Even their rhetoric is nothing but self-owns.</p><p><em><a href=\"https://social.infogalactic.com/micropost/4afd9d1b-728b-4726-b7f9-115bb9c74dc7\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "BOOMER:\nSoon you all can move out of mom’s basement…..\nVD:\nWe’ll have to move out. Mom reverse-mortgaged the house and will die engulfed in debt, so there’s nothing to inherit and nowhere to live.\nBOOMER:\nGo earn your own house, like everyone I know. I inherited nothing.\nVD:\nThe Boomers inherited more, and will leave less behind them as a percentage of what they inherited, than any generation in memory. You’re a historically wicked generation.\nBOOMER:\nBoohooo Mommy didn’t leave me anything. You sound childish, I wouldn’t have left you anything either.\nVD:\nI know you wouldn’t have. You’re not a good man. A good man leaves an inheritance to his children and to his children’s children.\nEven their rhetoric is nothing but self-owns.\nDISCUSS ON SG",
  "tags": [
    "Baby Boomers",
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-01-16T16:43:46+00:00"
}