{
  "url": "https://voxday.net/2024/01/08/australia-abandons-free-speech/",
  "scraped_at": "2026-01-08T14:20:26.543151",
  "title": "Australia Abandons Free Speech",
  "date_display": "January 8, 2024",
  "date_iso": "2024-01-08T15:58:38+00:00",
  "date_from_url": "2024-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s fascinating how these states that literally go to war and invade other countries over “freedom” <a href=\"https://japantoday.com/category/world/australia-bans-nazi-salute-and-public-display-of-terror-group-symbols2\">so rapidly abandon it</a> in certain circumstances:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Laws banning the Nazi salute and the display or sale of symbols associated with terror groups came into effect in Australia on Monday as the government responds to a rise in antisemitic incidents following the Israel-Gaza war.</p><p>The law makes it an offense punishable by up to 12 months in prison to publicly perform the Nazi salute or display the Nazi swastika or the double-sig rune associated with the Schutzstaffel (SS) paramilitary group.</p><p>The sale and trade of these symbols is similarly prohibited.</p></blockquote><p>Well, that should certainly put an end to the risk that the <em>Nationalsozialistische Deutsche Arbeiterpartei </em>will rise from the ashes of its defeat after 79 years and take power Down Under! Thank goodness Australian politicians are on guard against the risk of a political blitzkrieg. It’s rather like how the EU is all about “democracy”, unless the people vote against the dictates of their unelected superstate.</p><p>Clown World is just <em>relentlessly </em>fake and gay. Never, ever, believe a single thing that the clowns say about their supposed principles or motivations. It is nothing but lies all the way down to the Hell out of which they climbed.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-61155\" decoding=\"async\" fetchpriority=\"high\" height=\"512\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/01/image-10.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/01/image-10.png 512w, https://voxday.net/wp-content/uploads/2024/01/image-10-300x300.png 300w, https://voxday.net/wp-content/uploads/2024/01/image-10-150x150.png 150w\" width=\"512\"/></figure></div><p>You may be interested to note that the Bing AI image generator is now blocking prompts that contain the phrase “rainbow wigs”. The original prompt for this image was: <em>demonic clowns wearing rainbow wigs climbing out of a huge fiery pit. Dark fantasy style, red glow.</em> It was blocked, and based on some additional experimentation, I believe it was the connection of “demonic” with “rainbow”.</p><p>Clown World fears memes because Clown World relies upon lies and memes point toward the truth. So, as Sun Tzu said: meme them until they block your prompt, then meme them some more.</p><p><em><a href=\"https://social.infogalactic.com/micropost/92c08761-5d8b-4e59-88c3-72cab45b5db0\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s fascinating how these states that literally go to war and invade other countries over “freedom”\nso rapidly abandon it\nin certain circumstances:\nLaws banning the Nazi salute and the display or sale of symbols associated with terror groups came into effect in Australia on Monday as the government responds to a rise in antisemitic incidents following the Israel-Gaza war.\nThe law makes it an offense punishable by up to 12 months in prison to publicly perform the Nazi salute or display the Nazi swastika or the double-sig rune associated with the Schutzstaffel (SS) paramilitary group.\nThe sale and trade of these symbols is similarly prohibited.\nWell, that should certainly put an end to the risk that the\nNationalsozialistische Deutsche Arbeiterpartei\nwill rise from the ashes of its defeat after 79 years and take power Down Under! Thank goodness Australian politicians are on guard against the risk of a political blitzkrieg. It’s rather like how the EU is all about “democracy”, unless the people vote against the dictates of their unelected superstate.\nClown World is just\nrelentlessly\nfake and gay. Never, ever, believe a single thing that the clowns say about their supposed principles or motivations. It is nothing but lies all the way down to the Hell out of which they climbed.\nYou may be interested to note that the Bing AI image generator is now blocking prompts that contain the phrase “rainbow wigs”. The original prompt for this image was:\ndemonic clowns wearing rainbow wigs climbing out of a huge fiery pit. Dark fantasy style, red glow.\nIt was blocked, and based on some additional experimentation, I believe it was the connection of “demonic” with “rainbow”.\nClown World fears memes because Clown World relies upon lies and memes point toward the truth. So, as Sun Tzu said: meme them until they block your prompt, then meme them some more.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "MemeWars",
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-01-08T15:58:39+00:00"
}