{
  "url": "https://voxday.net/2024/01/03/connected-somehow/",
  "scraped_at": "2026-01-08T14:19:55.306610",
  "title": "Connected Somehow",
  "date_display": "January 3, 2024",
  "date_iso": "2024-01-03T10:47:22+00:00",
  "date_from_url": "2024-01-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>NFL players <a href=\"https://www.outkick.com/jimmy-kimmel-legal-action-aaron-rodgers-epstein-client-list/\">are hammering Jimmy Kimmel</a> over the Epstein Client List. He may not be on the actual list, but he’s almost certainly a ticket taker who is connected to some truly awful people.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Jimmy Kimmel claims Aaron Rodgers is a “tin foil hatter” for wanting to know the names on the Jeffrey Epstein client list.</p><p><strong>DAVID BAKHTIARI: </strong>Tell me you’re on the Jeffrey Epstein client list, without telling me you’re on the Jeffrey Epstein client list….</p><p><strong>AARON RODGERS:</strong> “That’s supposed to be coming out soon. A lot of people — including Jimmy Kimmel — are really hoping that doesn’t come out.”</p><p><strong>JIMMY KIMMEL: </strong>Dear Aasshole: for the record, I’ve not met, flown with, visited, or had any contact whatsoever with Epstein, nor will you find my name on any “list” other than the clearly-phony nonsense that soft-brained wackos like yourself can’t seem to distinguish from reality. Your reckless words put my family in danger. Keep it up and we will debate the facts further in court. @AaronRodgers12</p> <cite>JIMMY KIMMEL THREATENS LEGAL ACTION, Outkick the Coverage, 2 January 2024</cite></blockquote><p>Well, that’s not at all suspicious, is it? Spoken like a truly innocent man, is it not? I don’t know that I’ve ever read a flat-out denial that raised so many more questions than it answered.</p><p>Longtime NFL players at the level of Bakhtiari and Rodgers, and well-connected former players who are now in the media like Pat McAfee, are all well-acquainted with celebrities like Kimmel. They also know a lot about who is, and who is not, a ticket taker. It should not be a surprise that many of them, perhaps most of them, whose success is derived from intrinsic talent and hard work, should openly despise those whose “success” is handed to them by nothing more than their willingness to do terrible things and serve Satan.</p><p>Kimmel has long been a mystery to NFL fans. His career was hugely elevated through the NFL pregame shows as some sort of “comedian” despite the fact that he was nothing more than Adam Carolla’s sidekick, he wasn’t funny, and he didn’t know anything about football. It was really jarring at the time, as if some twenty-something loser was selected at random and inflicted upon NFL fans for no reason that anyone could understand. And since then, he’s become one of the richest and most famous talking heads in Hollywood.</p><p>His hypersensitive public reaction to Rodgers tends to suggest that he is not at all happy about the Epstein Client List coming out, perhaps because a large number of his personal connections are going to be on it even though he himself is not. It’s pretty clear that a lot of NFL players know something about Kimmel, and it is something that they consider to be despicable.</p><p><em><a href=\"https://social.infogalactic.com/micropost/656cd8aa-a9a7-442a-b425-4445fad97c1b\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "NFL players\nare hammering Jimmy Kimmel\nover the Epstein Client List. He may not be on the actual list, but he’s almost certainly a ticket taker who is connected to some truly awful people.\nJimmy Kimmel claims Aaron Rodgers is a “tin foil hatter” for wanting to know the names on the Jeffrey Epstein client list.\nDAVID BAKHTIARI:\nTell me you’re on the Jeffrey Epstein client list, without telling me you’re on the Jeffrey Epstein client list….\nAARON RODGERS:\n“That’s supposed to be coming out soon. A lot of people — including Jimmy Kimmel — are really hoping that doesn’t come out.”\nJIMMY KIMMEL:\nDear Aasshole: for the record, I’ve not met, flown with, visited, or had any contact whatsoever with Epstein, nor will you find my name on any “list” other than the clearly-phony nonsense that soft-brained wackos like yourself can’t seem to distinguish from reality. Your reckless words put my family in danger. Keep it up and we will debate the facts further in court. @AaronRodgers12\nJIMMY KIMMEL THREATENS LEGAL ACTION, Outkick the Coverage, 2 January 2024\nWell, that’s not at all suspicious, is it? Spoken like a truly innocent man, is it not? I don’t know that I’ve ever read a flat-out denial that raised so many more questions than it answered.\nLongtime NFL players at the level of Bakhtiari and Rodgers, and well-connected former players who are now in the media like Pat McAfee, are all well-acquainted with celebrities like Kimmel. They also know a lot about who is, and who is not, a ticket taker. It should not be a surprise that many of them, perhaps most of them, whose success is derived from intrinsic talent and hard work, should openly despise those whose “success” is handed to them by nothing more than their willingness to do terrible things and serve Satan.\nKimmel has long been a mystery to NFL fans. His career was hugely elevated through the NFL pregame shows as some sort of “comedian” despite the fact that he was nothing more than Adam Carolla’s sidekick, he wasn’t funny, and he didn’t know anything about football. It was really jarring at the time, as if some twenty-something loser was selected at random and inflicted upon NFL fans for no reason that anyone could understand. And since then, he’s become one of the richest and most famous talking heads in Hollywood.\nHis hypersensitive public reaction to Rodgers tends to suggest that he is not at all happy about the Epstein Client List coming out, perhaps because a large number of his personal connections are going to be on it even though he himself is not. It’s pretty clear that a lot of NFL players know something about Kimmel, and it is something that they consider to be despicable.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "media",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-01-03T10:53:39+00:00"
}