{
  "url": "https://voxday.net/2024/01/11/everyone-watched-and-learned/",
  "scraped_at": "2026-01-08T14:20:45.169551",
  "title": "Everyone Watched… and Learned",
  "date_display": "January 11, 2024",
  "date_iso": "2024-01-11T13:55:48+00:00",
  "date_from_url": "2024-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Thomas Friedman was correct about the battle in Ukraine <a href=\"https://www.nytimes.com/2022/04/03/opinion/ukraine-russia-wired.html\">being massively significant</a> with regards to the future direction of the world, but he had it precisely backwards with regards to what the inevitable conclusions of the various third parties watching the conflict would be.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>While the battle on the ground that triggered World War Wired is ostensibly over who should control Ukraine, do not be fooled. This has quickly turned into “the big battle” between the two most dominant political systems in the world today: free-market, “rule-of-law democracy versus authoritarian kleptocracy,” the Swedish expert on the Russian economy Anders Aslund remarked to me.</p><p>Though this war is far from over, and Vladimir Putin may still find a way to prevail and come out stronger, if he doesn’t, it could be a watershed in the conflict between democratic and undemocratic systems. It is worth recalling that World War II put an end to fascism, and that the Cold War put an end to orthodox communism, eventually even in China. So, what happens on the streets of Kyiv, Mariupol and the Donbas region could influence political systems far beyond Ukraine and far into the future.</p><p>Indeed, other autocratic leaders, like China’s, are watching Russia carefully. They see its economy being weakened by Western sanctions, thousands of its young technologists fleeing to escape a government denying them access to the internet and credible news and its inept army seemingly unable to gather, share and funnel accurate information to the top. Those leaders have to be asking themselves: “Holy cow — am I that vulnerable? Am I presiding over a similar house of cards?”</p><p>Everyone is watching.</p> <cite>Putin Had No Clue How Many of Us Would Be Watching, THE NEW YORK TIMES, 4 August 2022</cite></blockquote><p>Directly counter to the Clown World narrative, it is the self-styled “democratic” systems championed by credentialed neoclowns like Friedman that have been exposed as ineffective and fragile frauds. In fact, in his 2018 book entitled <em>Losing Military Supremacy</em>, Andrei Martyanov described as “the strategic folly of the 21st century” something that has already come to pass.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>In what can only be described as the strategic folly of the 21st century—the United States missed a historic opportunity to ally with Russia based on equal and mutually beneficial relations. This opportunity today is gone. Pushing Russia, through condescension, blackmail, humiliation and ignorance, away from itself in the 1990s, the United States committed the cardinal sin of Anglo-Saxon and now neo-conservative geopolitical calculus—they pushed Russia and China together, while simultaneously providing China with all the necessary tools, from investment to access to markets, thus making her the largest economy in the world. Today, the United States faces two nuclear and industrial superpowers, one of which fields a world-class armed forces. If the military-political, as opposed to merely economic, alliance between Russia and China, is ever formalized—this will spell the final doom for the United States as a global power. </p> <cite>Andrei Martyanov <em>LOSING MILITARY SUPREMACY</em>, 2018</cite></blockquote><p>That military-politico-economic alliance has already been formalized in the form of BRICS, and exceeds the scope of which Martyanov expected would be necessary to “spell the final doom of the United States as a global power”. WWIII is already as over as WWII was the moment Japan attacked Pearl Harbor; given the combined demographic and industrial power that BRICS can bring to bear, the eventual outcome is not even <em>remotely</em> in doubt. While there are still a lot of questions of what the post-WWIII, post-Clown World world, post-liberal world will look like, and who will be the foremost power, there can be absolutely no doubt about which side is going to win it. And it’s not going to be NATO, the USA, the liberal world order, or Clown World.</p><p>History is a reliable guide in this context. All the geostrategic analysis, however excellent, isn’t even necessary. The oldest society and its decadent empire ruled by foreigners, with its massive amount of debt and an aging currency, never wins. It is always eventually challenged, then superseded, by nations with newer and less-corrupted societal organizations.</p><p>Clown World and its liberal Enlightenment philosophy has had a successful, though not particularly long historical run. But its fundamental philosophies have proven themselves to be both false, as well as an insufficient foundation for national, or even societal, survival. Its fate is certain and its collapse has begun, although it obviously hasn’t been completed yet.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-61219\" decoding=\"async\" fetchpriority=\"high\" height=\"512\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/01/image-18.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/01/image-18.png 512w, https://voxday.net/wp-content/uploads/2024/01/image-18-300x300.png 300w, https://voxday.net/wp-content/uploads/2024/01/image-18-150x150.png 150w\" width=\"512\"/></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/6df6e537-c91a-4b01-af1b-3270f6f1d493\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Thomas Friedman was correct about the battle in Ukraine\nbeing massively significant\nwith regards to the future direction of the world, but he had it precisely backwards with regards to what the inevitable conclusions of the various third parties watching the conflict would be.\nWhile the battle on the ground that triggered World War Wired is ostensibly over who should control Ukraine, do not be fooled. This has quickly turned into “the big battle” between the two most dominant political systems in the world today: free-market, “rule-of-law democracy versus authoritarian kleptocracy,” the Swedish expert on the Russian economy Anders Aslund remarked to me.\nThough this war is far from over, and Vladimir Putin may still find a way to prevail and come out stronger, if he doesn’t, it could be a watershed in the conflict between democratic and undemocratic systems. It is worth recalling that World War II put an end to fascism, and that the Cold War put an end to orthodox communism, eventually even in China. So, what happens on the streets of Kyiv, Mariupol and the Donbas region could influence political systems far beyond Ukraine and far into the future.\nIndeed, other autocratic leaders, like China’s, are watching Russia carefully. They see its economy being weakened by Western sanctions, thousands of its young technologists fleeing to escape a government denying them access to the internet and credible news and its inept army seemingly unable to gather, share and funnel accurate information to the top. Those leaders have to be asking themselves: “Holy cow — am I that vulnerable? Am I presiding over a similar house of cards?”\nEveryone is watching.\nPutin Had No Clue How Many of Us Would Be Watching, THE NEW YORK TIMES, 4 August 2022\nDirectly counter to the Clown World narrative, it is the self-styled “democratic” systems championed by credentialed neoclowns like Friedman that have been exposed as ineffective and fragile frauds. In fact, in his 2018 book entitled\nLosing Military Supremacy\n, Andrei Martyanov described as “the strategic folly of the 21st century” something that has already come to pass.\nIn what can only be described as the strategic folly of the 21st century—the United States missed a historic opportunity to ally with Russia based on equal and mutually beneficial relations. This opportunity today is gone. Pushing Russia, through condescension, blackmail, humiliation and ignorance, away from itself in the 1990s, the United States committed the cardinal sin of Anglo-Saxon and now neo-conservative geopolitical calculus—they pushed Russia and China together, while simultaneously providing China with all the necessary tools, from investment to access to markets, thus making her the largest economy in the world. Today, the United States faces two nuclear and industrial superpowers, one of which fields a world-class armed forces. If the military-political, as opposed to merely economic, alliance between Russia and China, is ever formalized—this will spell the final doom for the United States as a global power.\nAndrei Martyanov\nLOSING MILITARY SUPREMACY\n, 2018\nThat military-politico-economic alliance has already been formalized in the form of BRICS, and exceeds the scope of which Martyanov expected would be necessary to “spell the final doom of the United States as a global power”. WWIII is already as over as WWII was the moment Japan attacked Pearl Harbor; given the combined demographic and industrial power that BRICS can bring to bear, the eventual outcome is not even\nremotely\nin doubt. While there are still a lot of questions of what the post-WWIII, post-Clown World world, post-liberal world will look like, and who will be the foremost power, there can be absolutely no doubt about which side is going to win it. And it’s not going to be NATO, the USA, the liberal world order, or Clown World.\nHistory is a reliable guide in this context. All the geostrategic analysis, however excellent, isn’t even necessary. The oldest society and its decadent empire ruled by foreigners, with its massive amount of debt and an aging currency, never wins. It is always eventually challenged, then superseded, by nations with newer and less-corrupted societal organizations.\nClown World and its liberal Enlightenment philosophy has had a successful, though not particularly long historical run. But its fundamental philosophies have proven themselves to be both false, as well as an insufficient foundation for national, or even societal, survival. Its fate is certain and its collapse has begun, although it obviously hasn’t been completed yet.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "decline and fall",
    "neoclowns",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-01-11T13:55:50+00:00"
}