{
  "url": "https://voxday.net/2024/01/10/like-father-like-son/",
  "scraped_at": "2026-01-08T14:20:41.735133",
  "title": "Like Father, Like Son",
  "date_display": "January 10, 2024",
  "date_iso": "2024-01-10T20:35:47+00:00",
  "date_from_url": "2024-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is <a href=\"https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/after-pro-bowl-snub-antoine-winfield-jr-named-nfc-defensive-player-of-the-week\">why you should listen</a> to your father. Especially when he knows very well what he’s talking about:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Antoine Winfield Jr. was named NFC defensive player of the week for Week 18.</p><p>One of the best defensive plays of the year was made by Winfield Sunday against the Panthers: With Carolina receiver D.J. Chark seemingly set for an easy touchdown, Winfield ran him down just before he got to the goal line and knocked the ball out of Chark’s hands. The ball went into the end zone and out of bounds to give it back to the Buccaneers, a huge turnover and touchdown-saving play.</p><p>According to NFL Next Gen Stats, Winfield was 23 yards away from Chark at the time the pass was thrown. For Winfield to make up that much distance and force a fumble before Chark got to the end zone was an extraordinary effort.</p></blockquote><p>Extraordinary effort runs in the family. His father was my favorite Viking since Fran Tarkenton. Despite being exactly my size – 5’9″, 180 pounds – he was <a href=\"https://www.youtube.com/watch?v=ouuq_hFiqd4\">one of the hardest hitters in the NFL</a>. He wasn’t a shutdown corner, but there has never been anyone you would rather have defend the first down marker in the open field. It didn’t matter if it was a slot receiver, a tight end, or a fullback coming out of the backfield with the ball, the ballcarrier would absolutely be cut down <em>hard</em>, with all momentum extinguished, before he could make it past the invisible line. And despite being a starter, Winfield wasn’t too proud to play special teams; look at how <a href=\"https://youtu.be/ojoU2zT4qSw?t=141\">he laid the smack down</a> on a Packer’s punt returner.</p><p>Winfield made two of the greatest defensive plays I’ve ever seen, in the same game, against the Packers. The first play, facing a big halfback running behind a pulling guard, he dropped to his knees, let the guard fall over him, then popped up and dropped the ballcarrier. The second play, there were two blockers between him and the running back who’d just caught a screen pass. He twisted sideways between the two lineman, then dropped the ballcarrier.</p><p>Anyhow, it’s a lot of fun to see Winfield’s son not only following in his footsteps, but even <a href=\"https://www.youtube.com/watch?v=WIWqLak4g5Y\">exceeding his NFL accomplishments</a> by winning a Super Bowl. Their relationship is an object lesson in excellence in fatherhood, and they’re <a href=\"https://www.youtube.com/watch?v=wI6HTI-hf_M\">obviously close to this day</a>.</p><p>Also, his dad is 100-percent correct. Budda Baker making the Pro Bowl over Winfield Jr. this season <a href=\"https://eu.azcentral.com/story/sports/nfl/cardinals/2024/01/05/antonie-winfield-rips-nfl-for-budda-baker-making-pro-bowl-over-his-son/72119227007/\">is a ludicrously bad joke</a>.</p><p><em><a href=\"https://social.infogalactic.com/micropost/eb6f3329-4657-4c57-bc4d-fd7b84c2f3d6\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This is\nwhy you should listen\nto your father. Especially when he knows very well what he’s talking about:\nAntoine Winfield Jr. was named NFC defensive player of the week for Week 18.\nOne of the best defensive plays of the year was made by Winfield Sunday against the Panthers: With Carolina receiver D.J. Chark seemingly set for an easy touchdown, Winfield ran him down just before he got to the goal line and knocked the ball out of Chark’s hands. The ball went into the end zone and out of bounds to give it back to the Buccaneers, a huge turnover and touchdown-saving play.\nAccording to NFL Next Gen Stats, Winfield was 23 yards away from Chark at the time the pass was thrown. For Winfield to make up that much distance and force a fumble before Chark got to the end zone was an extraordinary effort.\nExtraordinary effort runs in the family. His father was my favorite Viking since Fran Tarkenton. Despite being exactly my size – 5’9″, 180 pounds – he was\none of the hardest hitters in the NFL\n. He wasn’t a shutdown corner, but there has never been anyone you would rather have defend the first down marker in the open field. It didn’t matter if it was a slot receiver, a tight end, or a fullback coming out of the backfield with the ball, the ballcarrier would absolutely be cut down\nhard\n, with all momentum extinguished, before he could make it past the invisible line. And despite being a starter, Winfield wasn’t too proud to play special teams; look at how\nhe laid the smack down\non a Packer’s punt returner.\nWinfield made two of the greatest defensive plays I’ve ever seen, in the same game, against the Packers. The first play, facing a big halfback running behind a pulling guard, he dropped to his knees, let the guard fall over him, then popped up and dropped the ballcarrier. The second play, there were two blockers between him and the running back who’d just caught a screen pass. He twisted sideways between the two lineman, then dropped the ballcarrier.\nAnyhow, it’s a lot of fun to see Winfield’s son not only following in his footsteps, but even\nexceeding his NFL accomplishments\nby winning a Super Bowl. Their relationship is an object lesson in excellence in fatherhood, and they’re\nobviously close to this day\n.\nAlso, his dad is 100-percent correct. Budda Baker making the Pro Bowl over Winfield Jr. this season\nis a ludicrously bad joke\n.\nDISCUSS ON SG",
  "tags": [
    "sports",
    "SSH"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-01-10T20:36:48+00:00"
}