{
  "url": "https://voxday.net/2024/01/27/mailvox-nationalism-and-non-leadership/",
  "scraped_at": "2026-01-08T14:22:24.730955",
  "title": "Mailvox: Nationalism and Non-Leadership",
  "date_display": "January 27, 2024",
  "date_iso": "2024-01-27T19:05:25+00:00",
  "date_from_url": "2024-01-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A recent exchange with a longtime VP reader.</p><p><strong>DC: </strong><em>I consider Christian Nationalism a dead issue we are still just mucking around with in the US.</em></p><p><strong>VD: </strong>I wouldn’t say it’s a dead issue, I’d say it’s an intellectual issue with very little relevance today.</p><p><strong>DC: </strong><em>For the US it became a relevant issue which it still might be? But it was effectively still born as the proponents did such a poor job out the gate.</em></p><p><strong>VD: </strong>It had nothing to do with that. Ideology is irrelevant anyhow. The time just isn’t right yet. Most Christians still think it’s 1980, if not 1950. They can’t even conceive of any need for Christian Nationalism so long as the government isn’t performing pagan sacrifices in public every national holiday. Christian Nationalism will be a reaction to pagan imperialism.</p><p><strong>DC: </strong><em>Much more believable path forward than anything I’ve read.</em></p><p><strong>VD: </strong>Of course. Because most of the writings on it are people attempting to redefine and pervert the concept. Most public intellectuals, such as they are, are simply professional activists for an ethnicity or an ideology. All of their analyses are rooted in politics, not in history, and always just happen to point in the same direction no matter the topic at hand. Which makes them worthless for more objective purposes.</p><p><strong>DC: </strong><em>I find the same sort of problem with analysis of the role of men and women in the church. The theologians try to make an ahistorical, timeless, systematic theology of men and women ignoring all of history as a guide and not even putting the answer in today’s context. That’s how we got the ridiculous, new “servant leadership” theology for men which at its root is a compromise with the feminists. “Don’t be mad women and we will carry your bags for you in Target, not have friends, and watch the kids while you go drink with your friends!” SERVANT LEADING! I have probably read in-depth six books in the last 18 months on men and women in the church. Most of them simply degrade into rank Biblicism and try to write a timeless theology out of a scant few verses to exclude women from being Elders, and in the case of Piper, policemen. They are proof-texting themselves into theological stalemates which end in nihilism. Servant Leadership theology made neither servants nor leaders, instead it turned men into butlers who ask their wives for permission.</em></p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-61499\" decoding=\"async\" fetchpriority=\"high\" height=\"512\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/01/image-66.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/01/image-66.png 512w, https://voxday.net/wp-content/uploads/2024/01/image-66-300x300.png 300w, https://voxday.net/wp-content/uploads/2024/01/image-66-150x150.png 150w\" width=\"512\"/></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/9af9cc92-b1c8-4424-883e-75d561227401\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A recent exchange with a longtime VP reader.\nDC:\nI consider Christian Nationalism a dead issue we are still just mucking around with in the US.\nVD:\nI wouldn’t say it’s a dead issue, I’d say it’s an intellectual issue with very little relevance today.\nDC:\nFor the US it became a relevant issue which it still might be? But it was effectively still born as the proponents did such a poor job out the gate.\nVD:\nIt had nothing to do with that. Ideology is irrelevant anyhow. The time just isn’t right yet. Most Christians still think it’s 1980, if not 1950. They can’t even conceive of any need for Christian Nationalism so long as the government isn’t performing pagan sacrifices in public every national holiday. Christian Nationalism will be a reaction to pagan imperialism.\nDC:\nMuch more believable path forward than anything I’ve read.\nVD:\nOf course. Because most of the writings on it are people attempting to redefine and pervert the concept. Most public intellectuals, such as they are, are simply professional activists for an ethnicity or an ideology. All of their analyses are rooted in politics, not in history, and always just happen to point in the same direction no matter the topic at hand. Which makes them worthless for more objective purposes.\nDC:\nI find the same sort of problem with analysis of the role of men and women in the church. The theologians try to make an ahistorical, timeless, systematic theology of men and women ignoring all of history as a guide and not even putting the answer in today’s context. That’s how we got the ridiculous, new “servant leadership” theology for men which at its root is a compromise with the feminists. “Don’t be mad women and we will carry your bags for you in Target, not have friends, and watch the kids while you go drink with your friends!” SERVANT LEADING! I have probably read in-depth six books in the last 18 months on men and women in the church. Most of them simply degrade into rank Biblicism and try to write a timeless theology out of a scant few verses to exclude women from being Elders, and in the case of Piper, policemen. They are proof-texting themselves into theological stalemates which end in nihilism. Servant Leadership theology made neither servants nor leaders, instead it turned men into butlers who ask their wives for permission.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "mailvox",
    "nationalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-01-27T19:10:49+00:00"
}