{
  "url": "https://voxday.net/2024/01/16/neoclowns-seek-round-3/",
  "scraped_at": "2026-01-08T14:21:10.926441",
  "title": "Neoclowns Seek Round 3",
  "date_display": "January 16, 2024",
  "date_iso": "2024-01-16T10:48:45+00:00",
  "date_from_url": "2024-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently two proxy defeats for NATO at the hands of Russia, in Georgia and in Ukraine, haven’t been enough, as leaked plans published in Bild indicate that the neoclowns won’t be content <a href=\"https://sputnikglobe.com/20240115/germany-gearing-up-for-nato-russia-war-after-ukraines-defeat---bild-1116167994.html\">until NATO is directly defeated</a> in Europe.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>As the West continues to wage a hybrid proxy war against Russia in Ukraine, supplying the Kiev regime with modern weapons systems, it has been hyping up allegations of a broader “Russian threat” for all of Western Europe and NATO – claims that have been dismissed as false and ridiculed by the Kremlin.<br/>“Germany is gearing up for “war between NATO’s forces and Russia,” which could begin in the summer of 2025, Bild has written, citing a “secret” Bundeswehr document.</p><p>According to the alleged “training scenario” of the German Ministry of Defense, “on ‘Day X,’ NATO’s commander-in-chief will give the order to move 300,000 troops to the eastern flank, including 30,000 Bundeswehr soldiers,” the tabloid states. The escalation could reportedly begin as early as February 2024 with the start of Russia’s active offensive against the positions of the Ukrainian Armed Forces. By June of the same year, according to Bild, Russia will have forced Kiev’s military to retreat.</p><p>Without offering any specific details, the publication noted that the most likely location for a “clash” will purportedly be the so-called “Suwalki Gap” or “Suwalki Corridor” (Przesmyk suwalski). This is a section about 100 km long near the city of Suwalki in the northeast of Poland, located between Belarus and Russia’s Kaliningrad region.</p><p>In July, according to the “secret document,” Russia might allegedly launch “cyber attacks and other forms of hybrid warfare” against the Baltic countries. Furthermore, “clashes” would occur which Moscow ostensibly could use as a pretext to begin large-scale exercises on its territory and in Belarus, as per the authors. By October Russia could allegedly transfer troops and medium-range missiles to its Kaliningrad region, and December might see a border conflict erupt in the Suwalki Corridor.</p><p>According to Bild, the “secret document” also indicates that when Washington is temporarily left without a leader as a result of the presidential elections in the United States in 2014, “Russia, with the support of Belarus, will repeat the 2014 invasion of Ukraine on NATO territory.” No further clarification is offered to these wild scenarios and off-mark references. One can guess what the mention of 2014 events refers to the Euromaidan (lit. “Euro Square”) coup fomented and sponsored by the West that culminated in the ouster of Ukraine’s government, and its replacement with a pro-US, and pro-NATO regime hostile to Russia. Furthermore, Ukraine is not a member of NATO, and its chances of gaining the coveted status in the alliance remain uncertain.</p><p>“Actions of Russia and the West, culminating in the dispatch of hundreds of thousands of NATO soldiers and the inevitable outbreak of war in the summer of 2025 are described down to the exact month and location,” the publication stated in reference to the ‘secret’ Bundeswehr plan.</p></blockquote><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-61301\" decoding=\"async\" fetchpriority=\"high\" height=\"587\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/01/image-28.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/01/image-28.png 512w, https://voxday.net/wp-content/uploads/2024/01/image-28-262x300.png 262w\" width=\"512\"/></figure></div><p>One wonders with what army NATO is supposedly going to be fighting this war. The vaunted Polish army? The Texas National Guard? And, more importantly, with what ammunition, artillery, and air support? And while I have no doubt that this “leak” is actually pure wishful thinking on the part of Donald Kagan’s neoclown crew, and has been released with the intention of baiting Russia into some sort of precipitate action, it’s pretty clear that Russia isn’t falling for it, as <em>Russia Today </em><a href=\"https://www.rt.com/news/590703-germany-comment-russian-attack-claim/\">has reported</a>:</p><p><em>Moscow has ridiculed the claims, calling them a “hoax.” Kremlin spokesman Dmitry Peskov told journalists on Monday that he refused to “even comment on this report.” Meanwhile, Russian Foreign Ministry spokeswoman Maria Zakharova also brushed the claims off as a “last year’s powerful zodiac forecast.”</em></p><p>Russia has no need to go to war with NATO in the next year. Both the German and the US economies are rapidly collapsing, not because of Russia or China, but due to the greening of the former and the parasitical financialization of the latter. The Yemeni stranglehold on the Red Sea isn’t exactly helping either the Clown World economies either.</p><p>What Russia will likely be doing in 2025 instead of fighting a third round with NATO is supporting the rising nationalist parties across Europe by offering logistical support to the third-world remigration programs that will a) <a href=\"https://www.ynetnews.com/article/hyjkurwta\">be massively popular</a> and b) put the final nail in the coffin of the neoliberal globalization that is the foundation of the Clown World Order. The AfD isn’t looking to bankrupt Germany or fight Russia on the USA’s behalf, and pushing the German people toward another defeat at the hands of Russia will likely be enough to break the CDU/CSU and SPD/Green alliance that has been methodically destroying Germany.</p><p><em>Germany on edge as far-right’s bold mass deportation plan shakes nation</em></p><p>This isn’t to say it isn’t possible for NATO to force Russia into taking the Baltic States in the same way Ukraine forced Russia into taking the Donbass. But outside of the Baltics, there aren’t many ethnic Russians, and if we learned one thing from the failed Ukraine offensive, it is that Russia is perfectly content to defend itself and let the NATO forces dash itself to pieces against its fortifications.</p><p>Furthermore, I don’t see how the USA can possibly send 200,000 troops to Europe so long as Israel is engaged in hostilities in the Middle East. The US military isn’t strong enough to fight on two major fronts anymore, and if the US were to commit to go to war in Eastern Europe, it would be effectively hanging Israel out to dry by making it clear to everyone that the US cavalry would not be coming to its rescue.</p><p><em><a href=\"https://social.infogalactic.com/micropost/1607f3db-230b-46cb-8e5d-94e64edb219d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Apparently two proxy defeats for NATO at the hands of Russia, in Georgia and in Ukraine, haven’t been enough, as leaked plans published in Bild indicate that the neoclowns won’t be content\nuntil NATO is directly defeated\nin Europe.\nAs the West continues to wage a hybrid proxy war against Russia in Ukraine, supplying the Kiev regime with modern weapons systems, it has been hyping up allegations of a broader “Russian threat” for all of Western Europe and NATO – claims that have been dismissed as false and ridiculed by the Kremlin.\n“Germany is gearing up for “war between NATO’s forces and Russia,” which could begin in the summer of 2025, Bild has written, citing a “secret” Bundeswehr document.\nAccording to the alleged “training scenario” of the German Ministry of Defense, “on ‘Day X,’ NATO’s commander-in-chief will give the order to move 300,000 troops to the eastern flank, including 30,000 Bundeswehr soldiers,” the tabloid states. The escalation could reportedly begin as early as February 2024 with the start of Russia’s active offensive against the positions of the Ukrainian Armed Forces. By June of the same year, according to Bild, Russia will have forced Kiev’s military to retreat.\nWithout offering any specific details, the publication noted that the most likely location for a “clash” will purportedly be the so-called “Suwalki Gap” or “Suwalki Corridor” (Przesmyk suwalski). This is a section about 100 km long near the city of Suwalki in the northeast of Poland, located between Belarus and Russia’s Kaliningrad region.\nIn July, according to the “secret document,” Russia might allegedly launch “cyber attacks and other forms of hybrid warfare” against the Baltic countries. Furthermore, “clashes” would occur which Moscow ostensibly could use as a pretext to begin large-scale exercises on its territory and in Belarus, as per the authors. By October Russia could allegedly transfer troops and medium-range missiles to its Kaliningrad region, and December might see a border conflict erupt in the Suwalki Corridor.\nAccording to Bild, the “secret document” also indicates that when Washington is temporarily left without a leader as a result of the presidential elections in the United States in 2014, “Russia, with the support of Belarus, will repeat the 2014 invasion of Ukraine on NATO territory.” No further clarification is offered to these wild scenarios and off-mark references. One can guess what the mention of 2014 events refers to the Euromaidan (lit. “Euro Square”) coup fomented and sponsored by the West that culminated in the ouster of Ukraine’s government, and its replacement with a pro-US, and pro-NATO regime hostile to Russia. Furthermore, Ukraine is not a member of NATO, and its chances of gaining the coveted status in the alliance remain uncertain.\n“Actions of Russia and the West, culminating in the dispatch of hundreds of thousands of NATO soldiers and the inevitable outbreak of war in the summer of 2025 are described down to the exact month and location,” the publication stated in reference to the ‘secret’ Bundeswehr plan.\nOne wonders with what army NATO is supposedly going to be fighting this war. The vaunted Polish army? The Texas National Guard? And, more importantly, with what ammunition, artillery, and air support? And while I have no doubt that this “leak” is actually pure wishful thinking on the part of Donald Kagan’s neoclown crew, and has been released with the intention of baiting Russia into some sort of precipitate action, it’s pretty clear that Russia isn’t falling for it, as\nRussia Today\nhas reported\n:\nMoscow has ridiculed the claims, calling them a “hoax.” Kremlin spokesman Dmitry Peskov told journalists on Monday that he refused to “even comment on this report.” Meanwhile, Russian Foreign Ministry spokeswoman Maria Zakharova also brushed the claims off as a “last year’s powerful zodiac forecast.”\nRussia has no need to go to war with NATO in the next year. Both the German and the US economies are rapidly collapsing, not because of Russia or China, but due to the greening of the former and the parasitical financialization of the latter. The Yemeni stranglehold on the Red Sea isn’t exactly helping either the Clown World economies either.\nWhat Russia will likely be doing in 2025 instead of fighting a third round with NATO is supporting the rising nationalist parties across Europe by offering logistical support to the third-world remigration programs that will a)\nbe massively popular\nand b) put the final nail in the coffin of the neoliberal globalization that is the foundation of the Clown World Order. The AfD isn’t looking to bankrupt Germany or fight Russia on the USA’s behalf, and pushing the German people toward another defeat at the hands of Russia will likely be enough to break the CDU/CSU and SPD/Green alliance that has been methodically destroying Germany.\nGermany on edge as far-right’s bold mass deportation plan shakes nation\nThis isn’t to say it isn’t possible for NATO to force Russia into taking the Baltic States in the same way Ukraine forced Russia into taking the Donbass. But outside of the Baltics, there aren’t many ethnic Russians, and if we learned one thing from the failed Ukraine offensive, it is that Russia is perfectly content to defend itself and let the NATO forces dash itself to pieces against its fortifications.\nFurthermore, I don’t see how the USA can possibly send 200,000 troops to Europe so long as Israel is engaged in hostilities in the Middle East. The US military isn’t strong enough to fight on two major fronts anymore, and if the US were to commit to go to war in Eastern Europe, it would be effectively hanging Israel out to dry by making it clear to everyone that the US cavalry would not be coming to its rescue.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "neoclowns",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-01-16T11:59:53+00:00"
}