{
  "url": "https://voxday.net/2024/01/24/no-help-from-beijing/",
  "scraped_at": "2026-01-08T14:22:10.727520",
  "title": "No Help From Beijing",
  "date_display": "January 24, 2024",
  "date_iso": "2024-01-24T20:28:09+00:00",
  "date_from_url": "2024-01-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>China makes it clear that so long as the Gazacaust continues, <a href=\"http://belfast.china-consulate.gov.cn/eng/wjbfyrth_3/202401/t20240124_11232341.htm\">it will not lift a finger</a> to dissuade the Yemenis from shutting down the Red Sea to US and Israeli vessels:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Reuters: </strong><em>The Financial Times reported that the United States has asked China to urge Tehran to rein in the Iranian-aligned Houthis rebels attacking commercial ships in the Red Sea, but has seen little sign of help from Beijing. This is according to US officials. The report said the US has repeatedly raised the matter with top Chinese officials in the past three months. Could we confirm with the Ministry if these discussions with the US took place? Has China been in touch with Iran or the Houthis about the Red Sea attacks? If so, what was discussed or any outcomes that China is hoping for?</em></p><p><strong>Wang Wenbin:</strong> We are deeply concerned over the recent rapid escalation of tensions in the Red Sea. The Red Sea is an important international trade route for goods and energy. China has been in close communication with various parties and worked actively to alleviate the tension in the Red Sea. China calls for a stop of causing disturbance to civilian ships, and urges relevant parties to avoid adding fuel to the fire in the Red Sea and jointly safeguard the safety of the Red Sea shipping route in accordance with the law. It must be stressed that the tension in the Red Sea is a manifestation of the spillover of the Gaza conflict. The priority now is to end the fighting in Gaza as soon as possible to avoid further escalation and prevent the situation from getting out of control. In the meanwhile, we believe that the Security Council has never authorized the use of force by any country on Yemen and the sovereignty and territorial integrity of Yemen and other coastal countries of the Red Sea need to be earnestly respected. China stands ready to work with all parties to help cool down the situation and safeguard the security and stability of the Red Sea region.</p> <cite>Foreign Ministry Spokesperson Wang Wenbin’s Regular Press Conference on January 24, 2024</cite></blockquote><p>While the Chinese diplomats can still be a little primitive on the rhetorical side, they are very, very good about maintaining frame and staying on message. The last thing Clown World’s media wants is to expose the link between the Red Sea shutdown and the Gazacaust, so the adroit way in which the deputy director of the Foreign Ministry Information Department deftly tied the two together and made the connection clear in response to the reporter’s question is both comical and impressive.</p><p>Especially when he managed to throw in a shot at the USA’s undeclared and illegal war against Yemen at the same time.</p><p><em><a href=\"https://social.infogalactic.com/micropost/8ec353d1-881f-48e6-b996-53f66059bfa2\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "China makes it clear that so long as the Gazacaust continues,\nit will not lift a finger\nto dissuade the Yemenis from shutting down the Red Sea to US and Israeli vessels:\nReuters:\nThe Financial Times reported that the United States has asked China to urge Tehran to rein in the Iranian-aligned Houthis rebels attacking commercial ships in the Red Sea, but has seen little sign of help from Beijing. This is according to US officials. The report said the US has repeatedly raised the matter with top Chinese officials in the past three months. Could we confirm with the Ministry if these discussions with the US took place? Has China been in touch with Iran or the Houthis about the Red Sea attacks? If so, what was discussed or any outcomes that China is hoping for?\nWang Wenbin:\nWe are deeply concerned over the recent rapid escalation of tensions in the Red Sea. The Red Sea is an important international trade route for goods and energy. China has been in close communication with various parties and worked actively to alleviate the tension in the Red Sea. China calls for a stop of causing disturbance to civilian ships, and urges relevant parties to avoid adding fuel to the fire in the Red Sea and jointly safeguard the safety of the Red Sea shipping route in accordance with the law. It must be stressed that the tension in the Red Sea is a manifestation of the spillover of the Gaza conflict. The priority now is to end the fighting in Gaza as soon as possible to avoid further escalation and prevent the situation from getting out of control. In the meanwhile, we believe that the Security Council has never authorized the use of force by any country on Yemen and the sovereignty and territorial integrity of Yemen and other coastal countries of the Red Sea need to be earnestly respected. China stands ready to work with all parties to help cool down the situation and safeguard the security and stability of the Red Sea region.\nForeign Ministry Spokesperson Wang Wenbin’s Regular Press Conference on January 24, 2024\nWhile the Chinese diplomats can still be a little primitive on the rhetorical side, they are very, very good about maintaining frame and staying on message. The last thing Clown World’s media wants is to expose the link between the Red Sea shutdown and the Gazacaust, so the adroit way in which the deputy director of the Foreign Ministry Information Department deftly tied the two together and made the connection clear in response to the reporter’s question is both comical and impressive.\nEspecially when he managed to throw in a shot at the USA’s undeclared and illegal war against Yemen at the same time.\nDISCUSS ON SG",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2024-01-24T20:28:11+00:00"
}