{
  "url": "https://voxday.net/2024/01/25/retreat-from-syria/",
  "scraped_at": "2026-01-08T14:22:12.582069",
  "title": "Retreat From Syria",
  "date_display": "January 25, 2024",
  "date_iso": "2024-01-25T11:59:56+00:00",
  "date_from_url": "2024-01-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The US military is showing <a href=\"https://foreignpolicy.com/2024/01/24/america-is-planning-to-withdraw-from-syria-and-create-a-disaster/\">definite signs of imperial overstretch</a>. Its proxies are overwhelmed in Ukraine, the IDF appears to be bogged down in Gaza, the Navy can’t keep the Red Sea clear for cargo transports, and Iran’s proxies have hit US military bases 118 times without much in the way of resistance.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Since Hamas’s brutal attack against Israel on Oct. 7 and the resulting Israeli military campaign in the Gaza Strip, tensions and hostilities across the Middle East have reached fever pitch. And with such a complex regional crisis playing out, it should not come as a surprise that the Biden administration is reconsidering its military priorities in the region.</p><p>It should be cause for significant concern, however, that this could involve a full withdrawal of U.S. troops from Syria. While no definitive decision has been made to leave, four sources within the Defense and State departments said the White House is no longer invested in sustaining a mission that it perceives as unnecessary. Active internal discussions are now underway to determine how and when a withdrawal may take place.</p></blockquote><p>The US should withdraw from Syria. It should withdraw from the entire Middle East, and Europe too. But it’s one thing to be vaguely aware that one might have limitations, it’s another thing entirely to be smart enough to actually respect them and reduce one’s imperial ambitions.</p><p>Simplicius offers <a href=\"https://simplicius76.substack.com/p/iranian-axis-grinds-down-us-will\">a succinct explanation</a>: <em>My take is this: in short, the US is being run out of town by Iran. Their bluff was called and US knows their puny strikes can do nothing to truly degrade Iran’s highly decentralized hybrid warfare systems and groups. Iran has risen to become a hegemon verging on a Great Power of the region. The US has a few obsolete fleets which cannot keep up blow for blow with Iran in exchanged rounds of ammo. Iran can saturate them forever with drones and cheap rockets which the US is spending millions per every fired shot to intercept.</em></p><p>He’s not wrong. The problem is that there are two powerful forces resisting the acknowledgement of the inevitable: American exceptionalism and the will of the foreign ruling elite. It will probably be necessary for the former to be shattered before it is possible for the latter to be successfully resisted.</p><p>This may explain why the IDF has withdrawn a number of brigades from Gaza even as its anti-Iranian rhetoric has recently heated up. It should be obvious to the Israeli strategists that time is not on their side, and that no matter what the actual odds might be, their best chance for defeating Iran is right now, while the US military is still present in the region.</p><p>The point of no return has been reached for the Imperial USA. And the choice is between WWIII and probable defeat or a face-saving acceptance of imperial decline which will fool absolutely no one.</p><p><em><a href=\"https://social.infogalactic.com/micropost/3aae71b5-7bd9-434d-963c-95f1648d6132\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The US military is showing\ndefinite signs of imperial overstretch\n. Its proxies are overwhelmed in Ukraine, the IDF appears to be bogged down in Gaza, the Navy can’t keep the Red Sea clear for cargo transports, and Iran’s proxies have hit US military bases 118 times without much in the way of resistance.\nSince Hamas’s brutal attack against Israel on Oct. 7 and the resulting Israeli military campaign in the Gaza Strip, tensions and hostilities across the Middle East have reached fever pitch. And with such a complex regional crisis playing out, it should not come as a surprise that the Biden administration is reconsidering its military priorities in the region.\nIt should be cause for significant concern, however, that this could involve a full withdrawal of U.S. troops from Syria. While no definitive decision has been made to leave, four sources within the Defense and State departments said the White House is no longer invested in sustaining a mission that it perceives as unnecessary. Active internal discussions are now underway to determine how and when a withdrawal may take place.\nThe US should withdraw from Syria. It should withdraw from the entire Middle East, and Europe too. But it’s one thing to be vaguely aware that one might have limitations, it’s another thing entirely to be smart enough to actually respect them and reduce one’s imperial ambitions.\nSimplicius offers\na succinct explanation\n:\nMy take is this: in short, the US is being run out of town by Iran. Their bluff was called and US knows their puny strikes can do nothing to truly degrade Iran’s highly decentralized hybrid warfare systems and groups. Iran has risen to become a hegemon verging on a Great Power of the region. The US has a few obsolete fleets which cannot keep up blow for blow with Iran in exchanged rounds of ammo. Iran can saturate them forever with drones and cheap rockets which the US is spending millions per every fired shot to intercept.\nHe’s not wrong. The problem is that there are two powerful forces resisting the acknowledgement of the inevitable: American exceptionalism and the will of the foreign ruling elite. It will probably be necessary for the former to be shattered before it is possible for the latter to be successfully resisted.\nThis may explain why the IDF has withdrawn a number of brigades from Gaza even as its anti-Iranian rhetoric has recently heated up. It should be obvious to the Israeli strategists that time is not on their side, and that no matter what the actual odds might be, their best chance for defeating Iran is right now, while the US military is still present in the region.\nThe point of no return has been reached for the Imperial USA. And the choice is between WWIII and probable defeat or a face-saving acceptance of imperial decline which will fool absolutely no one.\nDISCUSS ON SG",
  "tags": [
    "decline and fall",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-01-25T12:12:32+00:00"
}