{
  "url": "https://voxday.net/2024/01/17/sigma-game-on-substack/",
  "scraped_at": "2026-01-08T14:21:23.422481",
  "title": "Sigma Game on Substack",
  "date_display": "January 17, 2024",
  "date_iso": "2024-01-17T11:44:22+00:00",
  "date_from_url": "2024-01-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been working on the much-requested Socio-Sexual Hierarchy book and it’s going very well. Assuming we can get both <em>AH:Q</em> and the first <em>Midnight’s War </em>omnibus out to backers in the next few weeks, which we should be able to do, the crowdfund for the SSH book and the <em>Hypergamous </em>book will probably take place sometime in March, which is also when I anticipate finishing what was originally planned to be a 60k-word book, but will probably end up clocking in closer to 90k.</p><p>However, due to the growing mainstream interest in the SSH, particularly in the Sigma and Gamma profiles, I decided it would be a) necessary to have a central site for discussing the concepts that was absolutely not here and b) more immediately accessible to the new readers coming from outside the broader community who aren’t interested in economics, politics, fiction, games, history, or my copious media baggage.</p><p>So, I set up <a href=\"https://sigmagame.substack.com/\">a Sigma Game substack</a>. It will last as long as it lasts; no doubt it will come under relentless attack from Gammas and other anklebiters, which should serve to make certain SSH-related concepts readily apparent in a way that no amount of books, posts, and articles written by me ever could. It’s always nice when antifragility is built right into the foundation. It’s a pity that Substack comments can’t be limited to free subscribers, rather than just to paid subscribers, though.</p><p><a href=\"https://sigmagame.substack.com/publish/posts/detail/140763962?referrer=%2Fpublish%2Fhome\">The first post</a> is an analysis of a 2012 Alpha Game post in which I supported Dr. Helen’s contention that shame was not an effective tool for encouraging single men to marry. And a review of the recent data would appear to strongly confirm that contention.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Twelve years later, as anticipated, shame has entirely failed as a strategy to encourage more young men to get married. To the contrary, men have even begun to demonstrate less interest in pursuing sex as well as marriage. And the marriage rate has fallen another 8.6 percent in the interlude, from 16.3 per 1,000 in 2011 to 14.9 per 1,000 in 2021.</p> <cite>Higher Education and the Decline of Marriage, SIGMA GAME, 17 January 2024</cite></blockquote><p>I don’t intend to post more than once or twice a week <a href=\"https://sigmagame.substack.com/\">on Sigma Game</a>, but otherwise it can be reasonably considered a revival of the Alpha Game blog. How long I will actively maintain it, I do not know; if the book proves popular enough, I might even transfer it to its own site on one of the UATV servers. But, in any event, it’s there now, so feel free to check it out and subscribe to it if you are so inclined.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><a href=\"https://sigmagame.substack.com/\"><img alt=\"\" class=\"wp-image-61326\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" sizes=\"(max-width: 400px) 100vw, 400px\" src=\"https://voxday.net/wp-content/uploads/2024/01/image-32.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/01/image-32.png 400w, https://voxday.net/wp-content/uploads/2024/01/image-32-300x300.png 300w, https://voxday.net/wp-content/uploads/2024/01/image-32-150x150.png 150w\" width=\"400\"/></a></figure></div><p><strong>UPDATE: </strong>Okay, that was fast. Thanks to everyone who checked it out, especially those who have already subscribed.</p><p><strong>UPDATE: </strong>Given the surprisingly high level of interest there, I may have to contemplate doing a daily Sigma Game post.</p><p><em>Congratulations! Your posts have been read a total of 1000 times.</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/aeef0850-44e2-415e-99c3-a58d29d531e4\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I’ve been working on the much-requested Socio-Sexual Hierarchy book and it’s going very well. Assuming we can get both\nAH:Q\nand the first\nMidnight’s War\nomnibus out to backers in the next few weeks, which we should be able to do, the crowdfund for the SSH book and the\nHypergamous\nbook will probably take place sometime in March, which is also when I anticipate finishing what was originally planned to be a 60k-word book, but will probably end up clocking in closer to 90k.\nHowever, due to the growing mainstream interest in the SSH, particularly in the Sigma and Gamma profiles, I decided it would be a) necessary to have a central site for discussing the concepts that was absolutely not here and b) more immediately accessible to the new readers coming from outside the broader community who aren’t interested in economics, politics, fiction, games, history, or my copious media baggage.\nSo, I set up\na Sigma Game substack\n. It will last as long as it lasts; no doubt it will come under relentless attack from Gammas and other anklebiters, which should serve to make certain SSH-related concepts readily apparent in a way that no amount of books, posts, and articles written by me ever could. It’s always nice when antifragility is built right into the foundation. It’s a pity that Substack comments can’t be limited to free subscribers, rather than just to paid subscribers, though.\nThe first post\nis an analysis of a 2012 Alpha Game post in which I supported Dr. Helen’s contention that shame was not an effective tool for encouraging single men to marry. And a review of the recent data would appear to strongly confirm that contention.\nTwelve years later, as anticipated, shame has entirely failed as a strategy to encourage more young men to get married. To the contrary, men have even begun to demonstrate less interest in pursuing sex as well as marriage. And the marriage rate has fallen another 8.6 percent in the interlude, from 16.3 per 1,000 in 2011 to 14.9 per 1,000 in 2021.\nHigher Education and the Decline of Marriage, SIGMA GAME, 17 January 2024\nI don’t intend to post more than once or twice a week\non Sigma Game\n, but otherwise it can be reasonably considered a revival of the Alpha Game blog. How long I will actively maintain it, I do not know; if the book proves popular enough, I might even transfer it to its own site on one of the UATV servers. But, in any event, it’s there now, so feel free to check it out and subscribe to it if you are so inclined.\nUPDATE:\nOkay, that was fast. Thanks to everyone who checked it out, especially those who have already subscribed.\nUPDATE:\nGiven the surprisingly high level of interest there, I may have to contemplate doing a daily Sigma Game post.\nCongratulations! Your posts have been read a total of 1000 times.\nDISCUSS ON SG",
  "tags": [
    "Alpha Game",
    "Sigma Game",
    "SSH",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-01-17T23:50:26+00:00"
}