{
  "url": "https://voxday.net/2024/01/09/the-coining-of-the-term-midwit/",
  "scraped_at": "2026-01-08T14:20:31.317250",
  "title": "The Coining of the Term: Midwit",
  "date_display": "January 9, 2024",
  "date_iso": "2024-01-09T00:45:48+00:00",
  "date_from_url": "2024-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Along with “Sigma Male” and “Gamma”, the term “midwit” appears to have become increasingly popular on the Internet, thanks chiefly to what is now known as “the Midwit Meme”. I was certainly surprised to hear a comedian use it on Simon Evans’s show on <em>GB News</em> this week. And, needless to say, it hasn’t taken long for people “helping” others to understand it to begin explaining it incorrectly.</p><p><em><strong>Tablet: </strong>A midwit is typically described as someone with an IQ score between 85 and 115</em></p><p>No, this is incorrect. A midwit has an IQ in the 105 to 120 range. The very need for the term is derived from the observation that the individual so described possesses a level of intelligence that is sufficiently above average to inspire him to overrate himself. The <em>Tablet </em>redefinition is based on the visuals of the meme rather than the core concept.</p><p><strong><em>The Spectator:</em> </strong><em>According to something called the Meming Wiki, “midwit” has been “in use on 4chan and other online spaces since around 2013.”</em></p><p>For those who happen to have an interest in etymological history, I believe <a href=\"https://en.meming.world/wiki/Midwit\">the Meming Wiki is correct</a> and the neologism was first coined <a href=\"https://voxday.net/2012/02/17/tragedy-of-mid-witted/\">on 17 February 2012</a>. It’s rather amusing to learn that one of my favorite memes, and one which I have myself utilized on occasion, may have been inspired in some way by the term.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>As we often see on this blog, those who possess above-average intelligence and trouble to occasionally read newspapers and magazines tend to genuinely be under the erroneous impression that they possess superlative intelligence. But while having an IQ between one and two standard deviations above the norm is unusual, it is hardly rare, and in historical terms it is distinctly pedestrian.</p><p>The astonishing thing about Miss Wright’s confession isn’t that she was clueless and solipsistic little snob, but rather, that she still appears to believe that she is highly intelligent on the basis of familiarity with the works of a trivial and silly science fiction writer with a poor grasp of history. If she had any brains at all worth noting, then she wouldn’t have needed someone else to point out that clever people are everywhere; in addition to the ease with which this can be observed in the material world, even a basic knowledge of intelligence statistics would indicate that this must be the case.</p><p>If this erstwhile pirate wench had simply noted that Mensa, with its 130/132 IQ floor, potentially represents the top 2 percent of the population, she would have known that there are some 6.2 MILLION Americans who are significantly above the “read a book” level that she sets as a significant benchmark.</p><p>The difference between the mid-wit and the genuinely intelligent is usually fairly easy to identify. The mid-witted individual tends to compare himself to those below the average and concludes that because he isn’t like them, he must be a genius.</p> <cite>The Tragedy of the Mid-Witted, 17 February 2012</cite></blockquote><p>It took nearly two years before the term “midwittery” first appeared here on the blog, although I seem to recall it being used in casual conversation several times before first being utilized in the post <em><a href=\"Mailvox: Answers for MJ 1\">Mailvox: Answers for MJ 1</a></em> on 1 February 2014:</p><p><em>As for the idea that an all-powerful and all-loving God should wish to stop and be able to stop evil, to say nothing of the idea that the existence of evil therefore disproves the existence of such a god, well, that doesn’t even rise to the level of midwittery. One has to have a truly average mind and remain ignorant of basic Biblical knowledge to find either of those concepts even remotely convincing.</em></p><p>It’s far from impossible that someone else may have previously utilized what is a fairly basic term in some other context, but given the way it is regularly attached to the specific 115-IQ range identified, it appears that the neologism was coined here. However, I think it is probably a stretch to assume, as <em>The Spectator</em> does, that the dismissive term “mid” is derived from midwit, although I suppose it is possible.</p><p><em><a href=\"https://social.infogalactic.com/micropost/0e632436-e8c6-4bde-992e-9fb4bfd3521e\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Along with “Sigma Male” and “Gamma”, the term “midwit” appears to have become increasingly popular on the Internet, thanks chiefly to what is now known as “the Midwit Meme”. I was certainly surprised to hear a comedian use it on Simon Evans’s show on\nGB News\nthis week. And, needless to say, it hasn’t taken long for people “helping” others to understand it to begin explaining it incorrectly.\nTablet:\nA midwit is typically described as someone with an IQ score between 85 and 115\nNo, this is incorrect. A midwit has an IQ in the 105 to 120 range. The very need for the term is derived from the observation that the individual so described possesses a level of intelligence that is sufficiently above average to inspire him to overrate himself. The\nTablet\nredefinition is based on the visuals of the meme rather than the core concept.\nThe Spectator:\nAccording to something called the Meming Wiki, “midwit” has been “in use on 4chan and other online spaces since around 2013.”\nFor those who happen to have an interest in etymological history, I believe\nthe Meming Wiki is correct\nand the neologism was first coined\non 17 February 2012\n. It’s rather amusing to learn that one of my favorite memes, and one which I have myself utilized on occasion, may have been inspired in some way by the term.\nAs we often see on this blog, those who possess above-average intelligence and trouble to occasionally read newspapers and magazines tend to genuinely be under the erroneous impression that they possess superlative intelligence. But while having an IQ between one and two standard deviations above the norm is unusual, it is hardly rare, and in historical terms it is distinctly pedestrian.\nThe astonishing thing about Miss Wright’s confession isn’t that she was clueless and solipsistic little snob, but rather, that she still appears to believe that she is highly intelligent on the basis of familiarity with the works of a trivial and silly science fiction writer with a poor grasp of history. If she had any brains at all worth noting, then she wouldn’t have needed someone else to point out that clever people are everywhere; in addition to the ease with which this can be observed in the material world, even a basic knowledge of intelligence statistics would indicate that this must be the case.\nIf this erstwhile pirate wench had simply noted that Mensa, with its 130/132 IQ floor, potentially represents the top 2 percent of the population, she would have known that there are some 6.2 MILLION Americans who are significantly above the “read a book” level that she sets as a significant benchmark.\nThe difference between the mid-wit and the genuinely intelligent is usually fairly easy to identify. The mid-witted individual tends to compare himself to those below the average and concludes that because he isn’t like them, he must be a genius.\nThe Tragedy of the Mid-Witted, 17 February 2012\nIt took nearly two years before the term “midwittery” first appeared here on the blog, although I seem to recall it being used in casual conversation several times before first being utilized in the post\nMailvox: Answers for MJ 1\non 1 February 2014:\nAs for the idea that an all-powerful and all-loving God should wish to stop and be able to stop evil, to say nothing of the idea that the existence of evil therefore disproves the existence of such a god, well, that doesn’t even rise to the level of midwittery. One has to have a truly average mind and remain ignorant of basic Biblical knowledge to find either of those concepts even remotely convincing.\nIt’s far from impossible that someone else may have previously utilized what is a fairly basic term in some other context, but given the way it is regularly attached to the specific 115-IQ range identified, it appears that the neologism was coined here. However, I think it is probably a stretch to assume, as\nThe Spectator\ndoes, that the dismissive term “mid” is derived from midwit, although I suppose it is possible.\nDISCUSS ON SG",
  "tags": [
    "history",
    "MemeWars",
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-01-09T00:52:23+00:00"
}