{
  "url": "https://voxday.net/2024/01/21/the-attack-on-substack/",
  "scraped_at": "2026-01-08T14:21:48.069150",
  "title": "The Attack on Substack",
  "date_display": "January 21, 2024",
  "date_iso": "2024-01-21T12:27:44+00:00",
  "date_from_url": "2024-01-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Simplicius, the great chronicler of the NATO-Russian war in Ukraine, comments on <a href=\"https://simplicius76.substack.com/p/year-of-troubles-the-hatchets-come\">the attempts to police and deplatform</a> Substack contributors:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>As of several weeks back, Substack has been under a massive seemingly coordinated attack from subversive forces seeking to create a viral exodus from the site by reputationally damaging it. Unfortunately, it seems the program is of such wide scope as to even target individual high volume accounts, of which I appear to be one—as I too have now come under the hatchetmen’s blade of deplatformization…</p><p>It’s very clear to see why this is happening now, of all times. Just as Substack may have owed its initial popularity to the trench-war surrounding the 2020 election, J6, and Covid, Substack likewise stands to be at the center of what is certainly going to be an unprecedented, controversial, and dangerous historical firestorm later this year, and early next.</p><p>Think that’s silly? A middling platform by the standards of market capitalization and total users can’t possibly be such a ‘dangerous’ bugbear to the elites, can it? Yet those who’ve been following will know that some of the empire’s most dangerous dissident voices reside exclusively on Substack. Does Matt Taibbi, Alex Berenson, Seymour Hersh, and many others ring a bell? Some of these Substack writers have been central to the most momentous political scandals and revelatory bombshells of recent times. Hell, Taibbi even paid for it with a retaliatory federal case against him.</p><p>That’s right: Substack gives succor to dissidents viewed as grave dangers to the establishment, and they cannot allow Substack to remain unfettered going into the critical end of 2024 cycle.</p><p>That is why the attack had to come now, to begin seeding the groundwork to try and discredit and eventually dismantle one of the last remaining free speech bastions on the internet. And they’re doing that with the same ol’ tired shtick, claiming some tiny obscure holdout of “Nazis” is not only denning on the site, but are forcing their way into people’s recommends.</p><p>This quite obviously stinks of the same type of contortion Media Matters was accused of just last month, wherein they were said to game the system by refreshing ads hundreds of times until landing on the chance ‘desired result’, which then served as smear-piece fodder about ‘dangerously’ unwanted ads appearing unbidden next to their content.</p><p>The largest of the self-exiled, Casey Newton, wrote up what sounds like a semi-reasonable explanation, though he admits the Atlantic hitpiece was the initial spur which led to his re-evaluation of Substack. He further admits it only really revolved around six main offending newsletters, though “[his] analysis” found “dozens” more—which advocated the ghastly and unbearable “replacement theory”:</p><p>Really? The replacement theory Biden himself admitted on video to not only being true, but a “good thing”, is akin to “hate speech”? This is the “Nazi stuff” we’re talking about here?</p><p>Most troublingly, the rat openly admitted to going straight to Stripe itself to squeal on Substack—what appears an obvious attempt to get Substack shut down at the merchant bank level.</p> <cite>Year of Troubles: The Hatches Come Out, SIMPLICIUS, 19 January 2024</cite></blockquote><p>It’s always the same game, the same motivations, and the same tactics. It will be interesting to see if Substack resists the pressure and remains viable, or if it submits to it and begins the same inevitable decline toward irrelevance that we’ve already seen from dying platforms like Blogger, Buzzfeed, Vice, YouTube, Patreon, Indiegogo, and other organizations that were either allied, or submissive, to Clown World’s SJW thought police.</p><p>This is one reason why <a href=\"https://sigmagame.substack.com/\">my new Sigma Game substack</a>, which I created to provide a central location for the forthcoming SSH book, presently has no paid subscriptions despite the generous pledges that have been made; there is no point in either permitting even the slightest amount of dependence upon it or allowing it to be utilized against Substack until the company decides whether it will submit to the thought police or stand against them.</p><p>UATV will eventually offer a written aspect that will fulfill a similar function, but one that will, as SocialGalactic is to Gab, be a community-focused platform rather than one that is intended for a broad public audience like Substack. Since the subscriptions are free, I’d recommend sending a strong message to Substack by first <a href=\"https://sigmagame.substack.com/\">subscribing to Sigma Game</a>, and then to the stacks that are recommended there, including Simplicius.</p><p>In any event, this is absolutely nothing new. Whatever happens, we resist and we persist.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-61394\" decoding=\"async\" fetchpriority=\"high\" height=\"512\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/01/image-49.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/01/image-49.png 512w, https://voxday.net/wp-content/uploads/2024/01/image-49-300x300.png 300w, https://voxday.net/wp-content/uploads/2024/01/image-49-150x150.png 150w\" width=\"512\"/></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/1710d59d-76ed-4924-836a-b96573a8c0c3\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Simplicius, the great chronicler of the NATO-Russian war in Ukraine, comments on\nthe attempts to police and deplatform\nSubstack contributors:\nAs of several weeks back, Substack has been under a massive seemingly coordinated attack from subversive forces seeking to create a viral exodus from the site by reputationally damaging it. Unfortunately, it seems the program is of such wide scope as to even target individual high volume accounts, of which I appear to be one—as I too have now come under the hatchetmen’s blade of deplatformization…\nIt’s very clear to see why this is happening now, of all times. Just as Substack may have owed its initial popularity to the trench-war surrounding the 2020 election, J6, and Covid, Substack likewise stands to be at the center of what is certainly going to be an unprecedented, controversial, and dangerous historical firestorm later this year, and early next.\nThink that’s silly? A middling platform by the standards of market capitalization and total users can’t possibly be such a ‘dangerous’ bugbear to the elites, can it? Yet those who’ve been following will know that some of the empire’s most dangerous dissident voices reside exclusively on Substack. Does Matt Taibbi, Alex Berenson, Seymour Hersh, and many others ring a bell? Some of these Substack writers have been central to the most momentous political scandals and revelatory bombshells of recent times. Hell, Taibbi even paid for it with a retaliatory federal case against him.\nThat’s right: Substack gives succor to dissidents viewed as grave dangers to the establishment, and they cannot allow Substack to remain unfettered going into the critical end of 2024 cycle.\nThat is why the attack had to come now, to begin seeding the groundwork to try and discredit and eventually dismantle one of the last remaining free speech bastions on the internet. And they’re doing that with the same ol’ tired shtick, claiming some tiny obscure holdout of “Nazis” is not only denning on the site, but are forcing their way into people’s recommends.\nThis quite obviously stinks of the same type of contortion Media Matters was accused of just last month, wherein they were said to game the system by refreshing ads hundreds of times until landing on the chance ‘desired result’, which then served as smear-piece fodder about ‘dangerously’ unwanted ads appearing unbidden next to their content.\nThe largest of the self-exiled, Casey Newton, wrote up what sounds like a semi-reasonable explanation, though he admits the Atlantic hitpiece was the initial spur which led to his re-evaluation of Substack. He further admits it only really revolved around six main offending newsletters, though “[his] analysis” found “dozens” more—which advocated the ghastly and unbearable “replacement theory”:\nReally? The replacement theory Biden himself admitted on video to not only being true, but a “good thing”, is akin to “hate speech”? This is the “Nazi stuff” we’re talking about here?\nMost troublingly, the rat openly admitted to going straight to Stripe itself to squeal on Substack—what appears an obvious attempt to get Substack shut down at the merchant bank level.\nYear of Troubles: The Hatches Come Out, SIMPLICIUS, 19 January 2024\nIt’s always the same game, the same motivations, and the same tactics. It will be interesting to see if Substack resists the pressure and remains viable, or if it submits to it and begins the same inevitable decline toward irrelevance that we’ve already seen from dying platforms like Blogger, Buzzfeed, Vice, YouTube, Patreon, Indiegogo, and other organizations that were either allied, or submissive, to Clown World’s SJW thought police.\nThis is one reason why\nmy new Sigma Game substack\n, which I created to provide a central location for the forthcoming SSH book, presently has no paid subscriptions despite the generous pledges that have been made; there is no point in either permitting even the slightest amount of dependence upon it or allowing it to be utilized against Substack until the company decides whether it will submit to the thought police or stand against them.\nUATV will eventually offer a written aspect that will fulfill a similar function, but one that will, as SocialGalactic is to Gab, be a community-focused platform rather than one that is intended for a broad public audience like Substack. Since the subscriptions are free, I’d recommend sending a strong message to Substack by first\nsubscribing to Sigma Game\n, and then to the stacks that are recommended there, including Simplicius.\nIn any event, this is absolutely nothing new. Whatever happens, we resist and we persist.\nDISCUSS ON SG",
  "tags": [
    "SJW",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-01-21T13:40:18+00:00"
}