{
  "url": "https://voxday.net/2024/01/01/traffic-report-2023/",
  "scraped_at": "2026-01-08T14:19:44.600592",
  "title": "Traffic Report 2023",
  "date_display": "January 1, 2024",
  "date_iso": "2024-01-01T12:14:32+00:00",
  "date_from_url": "2024-01-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At last, this blog appears to be, like its author, clearly past its peak. As I mentioned <a href=\"https://voxday.net/2023/01/01/traffic-report-2022/\">last year</a>, the torch has been effectively passed to the community as a whole, and to other platforms and media. It’s neither frustrating nor to be lamented that the ideas can be transmitted so efficiently now that they reach people who have absolutely no direct contact with VP, the Darkstream, or any other traditional communications vehicle. <em>See: Sigma Male.</em> To the contrary, the current situation is to be viewed as an accomplishment and as a relief.</p><p>This is not an elegy or a farewell note for <em>Vox Popoli</em>. It’s simply a clear-eyed observation of how things have been playing out of late. Whether we like it or not, everything has a lifespan, time is limited, and it therefore behooves us to be realistic and practical about where things are, so that we can focus our efforts and energy appropriately. That’s why I track these numbers and write these summaries.</p><p>In 2023, Vox Popoli had 10,593,334 WordPress pageviews, down 11.9 percent from last year. The blog is now running at an average rate of 29,023 daily pageviews, down 10.1 percent from an average 32,926 last year. Total historic blog views closed out the year at 275,166,140. The running annual pageview totals are as follows:</p><p>2008: 3,496,757</p><p>2009: 4,414,801</p><p>2010: 4,827,183</p><p>2011: 5,422,628</p><p>2012: 6,098,774</p><p>2013: 9,340,663</p><p>2014: 11,236,085</p><p>2015: 16,211,875</p><p>2016: 25,817,343</p><p>2017: 31,216,357</p><p>2018: 32,260,094</p><p>2019: 32,757,068</p><p>2020: 41,338,037</p><p>2021: 38,884,355</p><p>2022: 12,018,040</p><p>2023: 10,593,334</p><p>The big news for 2023 was that I finally finished, and published, the complete edition of <em><a href=\"https://arkhavencomics.com/product/a-sea-of-skulls/\">A SEA OF SKULLS</a></em>. It appears to have been received well by the Selenoth fans as a worthy successor to <em>A THRONE OF BONES</em>, and since it is not available for review on Amazon, I will post the first mini-review that I have received from a reader here later today. I have already started working on the final book in the <em>Arts of Dark and Light</em> series, which will be called <em>A GRAVE OF GODS</em>, and which I plan to publish in 2026.</p><p>Last year I said that “the Bindery, Selenoth, and a revival of Castalia’s traditional publishing are my top priorities for the new year.” We made excellent progress on all three fronts, and we have improved the infrastructure to the point that we can expect to publish one or more conventional books a month in 2024. We also expect to print, bind, and ship <em>The Iliad</em> and <em>The Odyssey</em> to the Bindery backers this year; those who missed the crowdfund but wish to support the Bindery will be given the opportunity to purchase copies before we start printing them.</p><p>The biggest new development in 2023 was the launch of the Castalia History subscription. This was a massive success, as it is already two-thirds as large as the Castalia Library subscription. Books 2 and 3 are scheduled to be bound the first week of February and Book 1 will be bound soon after. Book 4 will be announced tomorrow, both here, <a href=\"https://www.librarything.com/ngroups/22493/Castalia-Library-Collectors\">on LibraryThing</a>, and via the mailing list tomorrow. With regards to 2024, we recently signed deals with two major publishers and acquired the rights to two significant series, one fiction, one history, so we will be introducing two special limited edition subscriptions later this year.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-61072\" decoding=\"async\" fetchpriority=\"high\" height=\"399\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/01/image-4.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/01/image-4.png 512w, https://voxday.net/wp-content/uploads/2024/01/image-4-300x234.png 300w\" width=\"512\"><figcaption class=\"wp-element-caption\"><em>THE CAMBRIDGE MEDIEVAL HISTORY</em> Vols. I and II</figcaption></img></figure></div><p>Both Castalia and Unauthorized are extremely healthy and technologically sound. Arkhaven remains strong despite the ongoing collapse of the comics industry, and has even introduced a new and improved frontend. While we are, as usual, behind on a number of our projects, and while we face a variety of challenges, the infrastructure is more solid than it has ever been, and for the first time, we are not reliant upon any cloud services of any kind for any of our various projects. In general, 2023 was a solid year and I believe it has laid the a foundation for a 2024 that promises to be both interesting and a strong step forward.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><noscript><img alt=\"\" class=\"wp-image-61067\" decoding=\"async\" height=\"489\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/01/image-3.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/01/image-3.png 512w, https://voxday.net/wp-content/uploads/2024/01/image-3-300x287.png 300w\" width=\"512\"/></noscript><img alt=\"\" class=\"lazyload wp-image-61067\" data-sizes=\"(max-width: 512px) 100vw, 512px\" data-src=\"https://voxday.net/wp-content/uploads/2024/01/image-3.png\" data-srcset=\"https://voxday.net/wp-content/uploads/2024/01/image-3.png 512w, https://voxday.net/wp-content/uploads/2024/01/image-3-300x287.png 300w\" decoding=\"async\" height=\"489\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20489%22%3E%3C/svg%3E\" width=\"512\"/></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/2ae90802-351d-429e-b445-f9e20c7f880e\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "At last, this blog appears to be, like its author, clearly past its peak. As I mentioned\nlast year\n, the torch has been effectively passed to the community as a whole, and to other platforms and media. It’s neither frustrating nor to be lamented that the ideas can be transmitted so efficiently now that they reach people who have absolutely no direct contact with VP, the Darkstream, or any other traditional communications vehicle.\nSee: Sigma Male.\nTo the contrary, the current situation is to be viewed as an accomplishment and as a relief.\nThis is not an elegy or a farewell note for\nVox Popoli\n. It’s simply a clear-eyed observation of how things have been playing out of late. Whether we like it or not, everything has a lifespan, time is limited, and it therefore behooves us to be realistic and practical about where things are, so that we can focus our efforts and energy appropriately. That’s why I track these numbers and write these summaries.\nIn 2023, Vox Popoli had 10,593,334 WordPress pageviews, down 11.9 percent from last year. The blog is now running at an average rate of 29,023 daily pageviews, down 10.1 percent from an average 32,926 last year. Total historic blog views closed out the year at 275,166,140. The running annual pageview totals are as follows:\n2008: 3,496,757\n2009: 4,414,801\n2010: 4,827,183\n2011: 5,422,628\n2012: 6,098,774\n2013: 9,340,663\n2014: 11,236,085\n2015: 16,211,875\n2016: 25,817,343\n2017: 31,216,357\n2018: 32,260,094\n2019: 32,757,068\n2020: 41,338,037\n2021: 38,884,355\n2022: 12,018,040\n2023: 10,593,334\nThe big news for 2023 was that I finally finished, and published, the complete edition of\nA SEA OF SKULLS\n. It appears to have been received well by the Selenoth fans as a worthy successor to\nA THRONE OF BONES\n, and since it is not available for review on Amazon, I will post the first mini-review that I have received from a reader here later today. I have already started working on the final book in the\nArts of Dark and Light\nseries, which will be called\nA GRAVE OF GODS\n, and which I plan to publish in 2026.\nLast year I said that “the Bindery, Selenoth, and a revival of Castalia’s traditional publishing are my top priorities for the new year.” We made excellent progress on all three fronts, and we have improved the infrastructure to the point that we can expect to publish one or more conventional books a month in 2024. We also expect to print, bind, and ship\nThe Iliad\nand\nThe Odyssey\nto the Bindery backers this year; those who missed the crowdfund but wish to support the Bindery will be given the opportunity to purchase copies before we start printing them.\nThe biggest new development in 2023 was the launch of the Castalia History subscription. This was a massive success, as it is already two-thirds as large as the Castalia Library subscription. Books 2 and 3 are scheduled to be bound the first week of February and Book 1 will be bound soon after. Book 4 will be announced tomorrow, both here,\non LibraryThing\n, and via the mailing list tomorrow. With regards to 2024, we recently signed deals with two major publishers and acquired the rights to two significant series, one fiction, one history, so we will be introducing two special limited edition subscriptions later this year.\nTHE CAMBRIDGE MEDIEVAL HISTORY\nVols. I and II\nBoth Castalia and Unauthorized are extremely healthy and technologically sound. Arkhaven remains strong despite the ongoing collapse of the comics industry, and has even introduced a new and improved frontend. While we are, as usual, behind on a number of our projects, and while we face a variety of challenges, the infrastructure is more solid than it has ever been, and for the first time, we are not reliant upon any cloud services of any kind for any of our various projects. In general, 2023 was a solid year and I believe it has laid the a foundation for a 2024 that promises to be both interesting and a strong step forward.\nDISCUSS ON SG",
  "tags": [
    "books",
    "news"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-01-01T13:25:21+00:00"
}