{
  "url": "https://voxday.net/2024/01/31/trumps-trade-war-2-0/",
  "scraped_at": "2026-01-08T14:22:47.265798",
  "title": "Trump’s Trade War 2.0",
  "date_display": "January 31, 2024",
  "date_iso": "2024-01-31T10:40:58+00:00",
  "date_from_url": "2024-01-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Contra economists from both the Democratic and Republican parties, <a href=\"https://www.rt.com/business/591395-trump-china-tariffs-trade-war/\">a trade war in 2025</a> would be a very, very good thing for the US economy:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Former US President Donald Trump has told advisers he wants to impose a 60% tariff on all imports from China if he wins this year’s election, the Washington Post reported on Saturday, citing three unnamed people familiar with the plan. The measure would trigger major disruptions to the US and to economies around the world, which would far exceed the impact of the trade wars initiated by Trump during his first presidential term, economists from both the Democratic and Republican parties told the newspaper.</p><p>During his current presidential campaign, Trump has pledged to revoke China’s status as a “most favored nation” for trade. The designation is applied to almost all nations that do business with the US, and the White House can introduce any tariffs on imported goods from countries that do not have it. According to the GOP front-runner, tariffs on foreign goods raise vital revenue for the US budget, and current import levies are among the world’s lowest.</p><p>China ranks third in the list of US trading partners, behind Mexico and Canada. In November, Beijing accounted for 11.7% of total US foreign trade.</p></blockquote><p><a href=\"https://voxday.net/2018/09/18/darkstream-trade-war-is-good-for-the-u-s-economy/\">As I pointed out six years ago</a> on Chinese state television, a trade war is very much to the advantage of the United States economy. The net effect of the Western sanctions regime on the Russian economy only serves to underline my original point: a trade war is, by definition, always beneficial to the trading party that has a negative trade balance. And the USA has a massive trade deficit vis-a-vis China. Unlike a naval war in the Pacific, an air war in the Middle East, or worse, a ground war in Europe, this is one war that the USA literally cannot lose.</p><p>The reason the Russian economy didn’t suffer from the trade war the West imposed upon it despite having a trade surplus is because the West is now actually the smaller of the two global markets by a significant margin, both in terms of population and purchasing power parity. What Russia lost in Western trade, it more than gained in trade with the BRICSIA countries. And from the defense manufacturers to fast food chains, Russia’s industries benefited massively from the protection from Western imports that was inadvertently provided by the sanctions regime.</p><p>As recent history has demonstrated, the Clown World economists are totally wrong, even by their own Samuelsonian metrics.</p><p><em><a href=\"https://social.infogalactic.com/micropost/fd5daf8e-54a6-4827-b114-ddd2f9a3ed14\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Contra economists from both the Democratic and Republican parties,\na trade war in 2025\nwould be a very, very good thing for the US economy:\nFormer US President Donald Trump has told advisers he wants to impose a 60% tariff on all imports from China if he wins this year’s election, the Washington Post reported on Saturday, citing three unnamed people familiar with the plan. The measure would trigger major disruptions to the US and to economies around the world, which would far exceed the impact of the trade wars initiated by Trump during his first presidential term, economists from both the Democratic and Republican parties told the newspaper.\nDuring his current presidential campaign, Trump has pledged to revoke China’s status as a “most favored nation” for trade. The designation is applied to almost all nations that do business with the US, and the White House can introduce any tariffs on imported goods from countries that do not have it. According to the GOP front-runner, tariffs on foreign goods raise vital revenue for the US budget, and current import levies are among the world’s lowest.\nChina ranks third in the list of US trading partners, behind Mexico and Canada. In November, Beijing accounted for 11.7% of total US foreign trade.\nAs I pointed out six years ago\non Chinese state television, a trade war is very much to the advantage of the United States economy. The net effect of the Western sanctions regime on the Russian economy only serves to underline my original point: a trade war is, by definition, always beneficial to the trading party that has a negative trade balance. And the USA has a massive trade deficit vis-a-vis China. Unlike a naval war in the Pacific, an air war in the Middle East, or worse, a ground war in Europe, this is one war that the USA literally cannot lose.\nThe reason the Russian economy didn’t suffer from the trade war the West imposed upon it despite having a trade surplus is because the West is now actually the smaller of the two global markets by a significant margin, both in terms of population and purchasing power parity. What Russia lost in Western trade, it more than gained in trade with the BRICSIA countries. And from the defense manufacturers to fast food chains, Russia’s industries benefited massively from the protection from Western imports that was inadvertently provided by the sanctions regime.\nAs recent history has demonstrated, the Clown World economists are totally wrong, even by their own Samuelsonian metrics.\nDISCUSS ON SG",
  "tags": [
    "China",
    "economics",
    "free trade",
    "Russia"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-01-31T17:39:23+00:00"
}