{
  "url": "https://voxday.net/2024/01/13/you-get-what-you-give/",
  "scraped_at": "2026-01-08T14:20:57.655757",
  "title": "You Get What You Gave",
  "date_display": "January 13, 2024",
  "date_iso": "2024-01-13T10:59:53+00:00",
  "date_from_url": "2024-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An aging woman laments how the post-Boomer youth <a href=\"https://www.dailymail.co.uk/news/article-12957211/So-youngsters-ditched-respect-elders-Emma-Cowing-dilemma-ages.html\">no longer respect the elderly</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Once revered, age is now a sign of your irrelevance to modern life.</p><p>The word boomer – short for baby boomer, anyone who was born between 1946 and 1964 – has become an insult for older people who are out of touch…</p><p>I’ll be honest – and in saying this I’m aware I may receive some ageist insults myself in response – I don’t think it was like this when I was young.</p><p>Elders were respected. Their words carried weight and gravitas.</p><p>They were more likely to be cared for within family homes when the time came, and within society, too.</p><p>Most importantly they were listened to, rather than being swiftly dismissed as irrelevant.</p></blockquote><p>It wasn’t like this when I was young either. But the Boomers are actively disrespected by the succeeding generation because they broke the tradition of respect for their elders. Now that they are the elders, they are harvesting the fruit of the seeds they planted in their youth. The first problem is that they never grew up. When I was a kid, I can’t count how many times I was told by my friends’ Boomer parents “don’t call me Mr. Johnson, Mr. Johnson is my father.” So, many members of Generation X grew up accustomed to referring to their elders as their peers, by their first names.</p><p>The second problem is that they had less interest in their children and their children’s activities than they probably should have. Every member of Generation X can tell stories of what sounds like a near-feral childhood, of being kicked out of the house in the morning and only being allowed to go back inside for meals and sundown. This wasn’t necessarily a bad thing, as it turns out, but when your parents require the television to remind them that you exist at 10 PM at night, it’s probably taking a good thing too far.</p><p>And while I was fortunate that my parents took an interest in my athletic activities, it wasn’t uncommon for my dad to be the only father<em> </em>at a number of my soccer games and track meets. And my mother religiously attended the high school soccer games for all four of her boys, although she somehow managed to do so without ever quite grasping the offsides rule. But as a general rule, our parents were simply not very interested in anything we did, no matter what it was.</p><p>The third problem was a real eye-opener, however, when Generation X began having children and discovered that as little interest as the Boomers had in us, they had even less in their grandchildren. Many of us were close to our own grandparents, indeed, some of us were much closer to them than we were to our parents. So it was shocking to discover that our parents didn’t even want to babysit their own grandchildren for a few hours a week, and were prone to vanishing across the country, or around the world, for months at a time on vacations and cruises rather than spend any substantial time with their grandkids. In contrast, I remember being sent to stay with my grandparents in Virginia for an entire month <em>during the school year</em>, and they were delighted to have me there.  And I still remember that visit and look back on it as being absolutely idyllic.</p><p>So this disinterest was not only bewildering to us, but also prevented any close relationships from being developed between Boomer grandparents and Millennial or Z grandchildren.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-61251\" decoding=\"async\" fetchpriority=\"high\" height=\"512\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/01/image-22.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/01/image-22.png 512w, https://voxday.net/wp-content/uploads/2024/01/image-22-300x300.png 300w, https://voxday.net/wp-content/uploads/2024/01/image-22-150x150.png 150w\" width=\"512\"/></figure></div><p>Fourth and finally, given the behavior demonstrated over the last 50 years, it shouldn’t come as a surprise to any of the younger generations that many, perhaps even most Boomers, who collectively were the recipients of the greatest transfer of wealth in human history, are going to die leaving absolutely nothing at all to their children or to their grandchildren. Their homes and their second homes have already been sold or reverse-mortgaged to fund their five annual cruises; they’ve funded their retirements with debt that will never be repaid.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Census Bureau data confirmed that most Baby Boomers’ wealth is tied up in their homes. In the past, the family home would be the most significant piece of an inheritance, but now, seniors can tap into their home’s wealth before they pass with a reverse mortgage. The wealth and the home go back to the mortgage company rather than staying in the family. Many seniors would rather live in luxury during their final days than offer their kids financial assistance.</p> <cite>Generational Wealth Lost: Why Boomers Aren’t Leaving Their Kids an Inheritance</cite></blockquote><p>So, it shouldn’t be surprising that young people who neither know nor owe anything to an elderly population that has never shown any interest in them do not treat their elders with the respect that we used to back in the day. Because today’s elders, quite frankly, never earned it.</p><p><em> A good man leaveth an inheritance to his children’s children</em><br/>–Proverbs 13:22</p><p><strong>UPDATE:</strong> A GenX response. No doubt we’ll be hearing from the Boomers soon…</p><p><em>I completely agree with this. I’m a GenXer and when my kids were little it seemed like my mom thought it was such a chore to watch our kids even just once a month. Now that my children are married and having children, I just don’t get my mom’s reluctance to babysit because I LOVE being with my grandchild. My husband and I both love being grandparents and we help out whenever and however we can. The joy we find in being grandparents has made us realize that, for whatever reason, our parents did not love their grandkids anywhere near as much as we love our grandkids. I just don’t get it.</em></p><p>Or as much as our grandparents loved us. I don’t get it either.</p><p><em><a href=\"https://social.infogalactic.com/micropost/f8daa644-bfd0-41ce-8ee4-f716e155341d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "An aging woman laments how the post-Boomer youth\nno longer respect the elderly\n:\nOnce revered, age is now a sign of your irrelevance to modern life.\nThe word boomer – short for baby boomer, anyone who was born between 1946 and 1964 – has become an insult for older people who are out of touch…\nI’ll be honest – and in saying this I’m aware I may receive some ageist insults myself in response – I don’t think it was like this when I was young.\nElders were respected. Their words carried weight and gravitas.\nThey were more likely to be cared for within family homes when the time came, and within society, too.\nMost importantly they were listened to, rather than being swiftly dismissed as irrelevant.\nIt wasn’t like this when I was young either. But the Boomers are actively disrespected by the succeeding generation because they broke the tradition of respect for their elders. Now that they are the elders, they are harvesting the fruit of the seeds they planted in their youth. The first problem is that they never grew up. When I was a kid, I can’t count how many times I was told by my friends’ Boomer parents “don’t call me Mr. Johnson, Mr. Johnson is my father.” So, many members of Generation X grew up accustomed to referring to their elders as their peers, by their first names.\nThe second problem is that they had less interest in their children and their children’s activities than they probably should have. Every member of Generation X can tell stories of what sounds like a near-feral childhood, of being kicked out of the house in the morning and only being allowed to go back inside for meals and sundown. This wasn’t necessarily a bad thing, as it turns out, but when your parents require the television to remind them that you exist at 10 PM at night, it’s probably taking a good thing too far.\nAnd while I was fortunate that my parents took an interest in my athletic activities, it wasn’t uncommon for my dad to be the only father\nat a number of my soccer games and track meets. And my mother religiously attended the high school soccer games for all four of her boys, although she somehow managed to do so without ever quite grasping the offsides rule. But as a general rule, our parents were simply not very interested in anything we did, no matter what it was.\nThe third problem was a real eye-opener, however, when Generation X began having children and discovered that as little interest as the Boomers had in us, they had even less in their grandchildren. Many of us were close to our own grandparents, indeed, some of us were much closer to them than we were to our parents. So it was shocking to discover that our parents didn’t even want to babysit their own grandchildren for a few hours a week, and were prone to vanishing across the country, or around the world, for months at a time on vacations and cruises rather than spend any substantial time with their grandkids. In contrast, I remember being sent to stay with my grandparents in Virginia for an entire month\nduring the school year\n, and they were delighted to have me there.  And I still remember that visit and look back on it as being absolutely idyllic.\nSo this disinterest was not only bewildering to us, but also prevented any close relationships from being developed between Boomer grandparents and Millennial or Z grandchildren.\nFourth and finally, given the behavior demonstrated over the last 50 years, it shouldn’t come as a surprise to any of the younger generations that many, perhaps even most Boomers, who collectively were the recipients of the greatest transfer of wealth in human history, are going to die leaving absolutely nothing at all to their children or to their grandchildren. Their homes and their second homes have already been sold or reverse-mortgaged to fund their five annual cruises; they’ve funded their retirements with debt that will never be repaid.\nThe Census Bureau data confirmed that most Baby Boomers’ wealth is tied up in their homes. In the past, the family home would be the most significant piece of an inheritance, but now, seniors can tap into their home’s wealth before they pass with a reverse mortgage. The wealth and the home go back to the mortgage company rather than staying in the family. Many seniors would rather live in luxury during their final days than offer their kids financial assistance.\nGenerational Wealth Lost: Why Boomers Aren’t Leaving Their Kids an Inheritance\nSo, it shouldn’t be surprising that young people who neither know nor owe anything to an elderly population that has never shown any interest in them do not treat their elders with the respect that we used to back in the day. Because today’s elders, quite frankly, never earned it.\nA good man leaveth an inheritance to his children’s children\n–Proverbs 13:22\nUPDATE:\nA GenX response. No doubt we’ll be hearing from the Boomers soon…\nI completely agree with this. I’m a GenXer and when my kids were little it seemed like my mom thought it was such a chore to watch our kids even just once a month. Now that my children are married and having children, I just don’t get my mom’s reluctance to babysit because I LOVE being with my grandchild. My husband and I both love being grandparents and we help out whenever and however we can. The joy we find in being grandparents has made us realize that, for whatever reason, our parents did not love their grandkids anywhere near as much as we love our grandkids. I just don’t get it.\nOr as much as our grandparents loved us. I don’t get it either.\nDISCUSS ON SG",
  "tags": [
    "Baby Boomers",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-01-13T13:50:43+00:00"
}