{
  "url": "https://voxday.net/2013/03/02/70000-readers-per-day_2/",
  "scraped_at": "2025-12-14T22:21:54.755547",
  "title": "70,000 readers per day!",
  "date_display": "March 2, 2013",
  "date_iso": "2013-03-02T14:00:00+00:00",
  "date_from_url": "2013-03-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One thing you have to keep in mind when dealing with the Left is that<br> leftists very seldom tell the truth about anything.  They depend upon misleading others.  That is why, if you notice a leftist is putting<br> particular stress on something, that is a glowing-red, beeping signal<br> that if you look a little closer, you’ll discover that whatever they are claiming is, if not entirely false, at least somewhat exaggerated.</br></br></br></p><p>Item 1: <a href=\"http://www.freerepublic.com/focus/f-news/2992736/posts\">Rachel Maddow</a>.  <i>“A<br> poster on Twitter, upon seeing what he thought were very similar posts<br> referencing MSNBC host Rachel Maddow’s show, did some searching and<br> found out that Maddow has been using phony twitter accounts to boost her<br> “mentions” on the popular website.  As can be seen by screenshots<br> collected by a tweeter named @LeftyBollocks, Maddow has massive amount<br> of accounts posting the exact same claim that “Confession: I yell at my<br> TV while watching Rachel #Maddow talk about filibuster reform in the<br> same way most people do during football.”</br></br></br></br></br></br></br></br></i></p><p>Item 2: <a href=\"http://www.nytimes.com/2012/07/07/books/in-redshirts-john-scalzi-gives-expendables-a-life.html\">John Scalzi</a>.   <i>“Handily<br> demolishing the burger that he had chosen over a Midtown restaurant’s<br> fancier Mediterranean fare, Mr. Scalzi was anything but grim; he smiled<br> readily and giggled heartily. He is comfortable with the business of<br> promotion: An affable speaker, he is familiar with the patois of fandom<br> and is adept at generating buzz through the nerd mafia of like-minded<br> collaborators. He already reaches up to 50,000 readers a day through his<br> popular blog, “Whatever.” (“Taunting the tauntable since 1998” is the<br> slogan on its home page.)” </br></br></br></br></br></br></br></br></i></p><p>Item 3: <a href=\"http://www.sfsignal.com/archives/2013/02/finalists-2012-nebula-awards-with-free-fiction-links/\">2012 Nebula Awards</a>.<i>  </i>The SFWA Nebula ballots went out today.  As usual, Tor had 2 of the 6 nominations for Best Novel, but as Tor’s defenders are quick to point out, that could be accounted for by the fact that it publishes the most novels in the increasingly mislabeled field of “science fiction”.  However, even more questionable is the fact that three of the seven Best Novelette nominees were published on Tor.com, which is one fewer nomination than Asimov, Analog, F&amp;SF, and Black Gate received for all short fiction combined.  Another apparent anomaly was that two writers, Aliette de Bodard and Kenneth Liu, received five nominations between them for the three shorter fiction awards, up from three last year.  Now, it would appear that either the two writers are the second comings of Asimov and Heinlein who will dominate the field of science fiction for decades to come or there is something else at work here.</p><p>The numerate among us<br> will recognize that 50,000 readers per day is 18.25 million readers per<br> year.  Now recall that McRapey was more than a little pleased to have hit <a href=\"http://www.milobookclub.com/2012/12/26/running-down-john-scalzi/\">8.2 million in 2012</a>,<br> up from 5.4 million in 2011.  That 8.2 million refers to<br> Wordpress views that amount to 7.8 million in Google pageview terms.  Now to<br> demonstrate how absurd that shows the “50,000 readers a day” claim to be, note that two months into 2013 I am presently right on pace to hit 25,309,493 readers<br> in 2013 by the NYT metric.  That’s 69,341 daily, which rounds nicely up<br> to <b>70,000 readers per day!</b></br></br></br></br></br></br></br></p><p>How seriously would<br> you take me if I claimed I had up to 70,000 readers per day?  That’s<br> precisely how seriously you should take any the posturing of any left-winger<br> about his popularity, his influence, or even his “bestselling” status, said <i>the three-time Billboard top 40 recording artist</i>.</br></br></br></p><p>These examples demonstrate why you should never,<br> ever give anyone on the Left even the smallest benefit of the doubt.  They always, at<br> the very least, stretch the truth.  They sockpuppet.  They pretend to<br> read things they have not.  They claim to have bought things they have<br> never seen.  They claim to have published three books when they have<br> only published one.  This reliable pattern of left-wing dishonesty is why I don’t<br> hesitate to call out fake reviewers and point out apparent shenanigans<br> even before I have gathered the incontrovertible and conclusive proof; experience and pattern<br> recognition have taught me that where there is the smoke of anomalies<br> and numbers not adding up, there is usually the fire of someone who is<br> “comfortable with the business of promotion” and “adept at generating<br> buzz”.</br></br></br></br></br></br></br></br></br></br></br></p><p>It is always unwise to place any trust whatsoever in those who live by attempting to redefine reality through their lies.</p></div>",
  "content_text": "One thing you have to keep in mind when dealing with the Left is that\nleftists very seldom tell the truth about anything.  They depend upon misleading others.  That is why, if you notice a leftist is putting\nparticular stress on something, that is a glowing-red, beeping signal\nthat if you look a little closer, you’ll discover that whatever they are claiming is, if not entirely false, at least somewhat exaggerated.\nItem 1:\nRachel Maddow\n.\n“A\nposter on Twitter, upon seeing what he thought were very similar posts\nreferencing MSNBC host Rachel Maddow’s show, did some searching and\nfound out that Maddow has been using phony twitter accounts to boost her\n“mentions” on the popular website.  As can be seen by screenshots\ncollected by a tweeter named @LeftyBollocks, Maddow has massive amount\nof accounts posting the exact same claim that “Confession: I yell at my\nTV while watching Rachel #Maddow talk about filibuster reform in the\nsame way most people do during football.”\nItem 2:\nJohn Scalzi\n.\n“Handily\ndemolishing the burger that he had chosen over a Midtown restaurant’s\nfancier Mediterranean fare, Mr. Scalzi was anything but grim; he smiled\nreadily and giggled heartily. He is comfortable with the business of\npromotion: An affable speaker, he is familiar with the patois of fandom\nand is adept at generating buzz through the nerd mafia of like-minded\ncollaborators. He already reaches up to 50,000 readers a day through his\npopular blog, “Whatever.” (“Taunting the tauntable since 1998” is the\nslogan on its home page.)”\nItem 3:\n2012 Nebula Awards\n.\nThe SFWA Nebula ballots went out today.  As usual, Tor had 2 of the 6 nominations for Best Novel, but as Tor’s defenders are quick to point out, that could be accounted for by the fact that it publishes the most novels in the increasingly mislabeled field of “science fiction”.  However, even more questionable is the fact that three of the seven Best Novelette nominees were published on Tor.com, which is one fewer nomination than Asimov, Analog, F&SF, and Black Gate received for all short fiction combined.  Another apparent anomaly was that two writers, Aliette de Bodard and Kenneth Liu, received five nominations between them for the three shorter fiction awards, up from three last year.  Now, it would appear that either the two writers are the second comings of Asimov and Heinlein who will dominate the field of science fiction for decades to come or there is something else at work here.\nThe numerate among us\nwill recognize that 50,000 readers per day is 18.25 million readers per\nyear.  Now recall that McRapey was more than a little pleased to have hit\n8.2 million in 2012\n,\nup from 5.4 million in 2011.  That 8.2 million refers to\nWordpress views that amount to 7.8 million in Google pageview terms.  Now to\ndemonstrate how absurd that shows the “50,000 readers a day” claim to be, note that two months into 2013 I am presently right on pace to hit 25,309,493 readers\nin 2013 by the NYT metric.  That’s 69,341 daily, which rounds nicely up\nto\n70,000 readers per day!\nHow seriously would\nyou take me if I claimed I had up to 70,000 readers per day?  That’s\nprecisely how seriously you should take any the posturing of any left-winger\nabout his popularity, his influence, or even his “bestselling” status, said\nthe three-time Billboard top 40 recording artist\n.\nThese examples demonstrate why you should never,\never give anyone on the Left even the smallest benefit of the doubt.  They always, at\nthe very least, stretch the truth.  They sockpuppet.  They pretend to\nread things they have not.  They claim to have bought things they have\nnever seen.  They claim to have published three books when they have\nonly published one.  This reliable pattern of left-wing dishonesty is why I don’t\nhesitate to call out fake reviewers and point out apparent shenanigans\neven before I have gathered the incontrovertible and conclusive proof; experience and pattern\nrecognition have taught me that where there is the smoke of anomalies\nand numbers not adding up, there is usually the fire of someone who is\n“comfortable with the business of promotion” and “adept at generating\nbuzz”.\nIt is always unwise to place any trust whatsoever in those who live by attempting to redefine reality through their lies.",
  "tags": [
    "McRapey",
    "media",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-02T14:00:00+00:00"
}