{
  "url": "https://voxday.net/2013/03/30/a-heart-warming-tale/",
  "scraped_at": "2025-12-14T22:24:27.897970",
  "title": "A heart-warming tale",
  "date_display": "March 30, 2013",
  "date_iso": "2013-03-30T14:20:00+00:00",
  "date_from_url": "2013-03-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.munchkinwrangler.com/2013/03/30/so-i-was-wrong-about-the-self-publishing-thing/\">Of frustration and giving up</a>:</p><blockquote class=\"tr_bq\"><p> Somewhere out there is a literary agent (who shall remain unnamed<br> here) who asked for science fiction submissions on Twitter the Friday<br> before last. I was in bed at the time, reading my Twitter feed on the<br> iPad (as one does), so I got out of bed again to send that agent a query<br> letter that followed the requirements of the agency in question.</br></br></br></br></p><p>I woke up the next morning to find a form rejection in my inbox. That<br> agent had rejected the query without having asked for sample pages–<i>without even having read a single word of the novel. </i>And<br> it was a nice, short, courteous, and professional query letter, not two<br> lines of HAY U WANT TO B MY AGENTZ? CHK YES OR NO LULZ.</br></br></br></p><p>I said a very naughty word at the computer screen and felt something<br> in my head go SNAP. Then I had Scrivener compile the ebook files for the<br> novel, bought some cover art, made a book cover, uploaded everything to<br> Amazon’s Kindle Direct Publishing service, and told people on my blog<br> that the novel is available for sale.</br></br></br></br></p></blockquote><p>I haven’t read <i>Terms of Enlistment</i> yet, but it came to my attention because apparently some of the people who have been buying <i>The Wardog’s Coin</i> also picked up Marko Kloos’s book and appear to think rather well of it.  (Marko, if you happen to read this, send me a review copy and I will reciprocate.)</p><p>I’ve been published by a major New York publisher.  And I’ve been published by a small independent publisher in a manner that very nearly amounts to self-publishing.  And while the people at Pocket always treated me very well, and I have absolutely no complaints about my experience there, I will say that I VASTLY prefer the independent publishing.  Simply the ability to select the cover artists with whom I prefer to work alone makes it worthwhile to me; I’m still convinced that what wrecked the Eternal Warriors series was Pocket’s disastrous decision to abandon the Rowena covers for a stock-photo, pseudo-Left Behind look that only managed to get the trade paperbacks banished from the Science Fiction and Fantasy section.  And it’s wonderful to decide to publish, pull the trigger, and see the book reviews appearing the very next day instead of waiting more than two years for the finished book to be completed.</p><p>My support for self-publishing doesn’t mean I won’t ever publish with a conventional publisher again.  I’m talking to a few of them right now since it would be good if there were ways for people to buy the beautiful doorstopper besides sight-unseen from Amazon.  But I’m not in any particular hurry to do so, (my main priorities are a) the game, b) Book Two, and c) the stories for the Summa hardcover), and I’m only going to partner with a publisher who truly understands my objectives and is willing to work with me in the same constructive and mutually beneficial manner that Hinterlands does.</p></div>",
  "content_text": "Of frustration and giving up\n:\nSomewhere out there is a literary agent (who shall remain unnamed\nhere) who asked for science fiction submissions on Twitter the Friday\nbefore last. I was in bed at the time, reading my Twitter feed on the\niPad (as one does), so I got out of bed again to send that agent a query\nletter that followed the requirements of the agency in question.\nI woke up the next morning to find a form rejection in my inbox. That\nagent had rejected the query without having asked for sample pages–\nwithout even having read a single word of the novel.\nAnd\nit was a nice, short, courteous, and professional query letter, not two\nlines of HAY U WANT TO B MY AGENTZ? CHK YES OR NO LULZ.\nI said a very naughty word at the computer screen and felt something\nin my head go SNAP. Then I had Scrivener compile the ebook files for the\nnovel, bought some cover art, made a book cover, uploaded everything to\nAmazon’s Kindle Direct Publishing service, and told people on my blog\nthat the novel is available for sale.\nI haven’t read\nTerms of Enlistment\nyet, but it came to my attention because apparently some of the people who have been buying\nThe Wardog’s Coin\nalso picked up Marko Kloos’s book and appear to think rather well of it.  (Marko, if you happen to read this, send me a review copy and I will reciprocate.)\nI’ve been published by a major New York publisher.  And I’ve been published by a small independent publisher in a manner that very nearly amounts to self-publishing.  And while the people at Pocket always treated me very well, and I have absolutely no complaints about my experience there, I will say that I VASTLY prefer the independent publishing.  Simply the ability to select the cover artists with whom I prefer to work alone makes it worthwhile to me; I’m still convinced that what wrecked the Eternal Warriors series was Pocket’s disastrous decision to abandon the Rowena covers for a stock-photo, pseudo-Left Behind look that only managed to get the trade paperbacks banished from the Science Fiction and Fantasy section.  And it’s wonderful to decide to publish, pull the trigger, and see the book reviews appearing the very next day instead of waiting more than two years for the finished book to be completed.\nMy support for self-publishing doesn’t mean I won’t ever publish with a conventional publisher again.  I’m talking to a few of them right now since it would be good if there were ways for people to buy the beautiful doorstopper besides sight-unseen from Amazon.  But I’m not in any particular hurry to do so, (my main priorities are a) the game, b) Book Two, and c) the stories for the Summa hardcover), and I’m only going to partner with a publisher who truly understands my objectives and is willing to work with me in the same constructive and mutually beneficial manner that Hinterlands does.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-30T14:20:00+00:00"
}