{
  "url": "https://voxday.net/2013/03/17/a-major-major-game-changer/",
  "scraped_at": "2025-12-14T22:23:17.400008",
  "title": "“A major, MAJOR game changer”",
  "date_display": "March 17, 2013",
  "date_iso": "2013-03-17T13:10:00+00:00",
  "date_from_url": "2013-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The CEO of Saxo Bank comments <a href=\"http://www.zerohedge.com/news/2013-03-16/saxo-bank-ceo-full-blown-socialism-and-i-still-cant-believe-it-happened\">on the Cypriot bank raids</a>:</p><blockquote class=\"tr_bq\"><p> This is full-blown socialism. It is difficult to describe the weekend bailout package to Cyprus in any other way. The confiscation of 6.75 percent of small depositors’ money and 9.9 percent of big depositors’ funds is without precedence that I can think of in a supposedly civilised and democratic society. But maybe the European Union (EU) is no longer a civilised democracy?</p><p>I heard rumours about this when I visited Limassol last week, but dismissed them as completely outlandish. And yet, here we are. The consequences are unpredictable, but we are clearly looking at a significant paradigm shift.</p><p>This is a breach of fundamental property rights, dictated to a small country by foreign powers and it must make every bank depositor in Europe shiver. Although the representatives at the bailout press conference tried to present this as a one-off, they were not willing to rule out similar measures elsewhere – not that it would have mattered much as the trust is gone anyway. It is now difficult to expect any kind of limitation to what measures the Troika and EU might take when the crisis really starts to bite.</p><p>If you can do this once, you can do it again. if you can confiscate 10 percent of a bank customer’s money, you can confiscate 25, 50 or even 100 percent. I now believe we will see worse as the panic increases, with politicians desperately trying to keep the EUR alive.</p><p>Depositors in other prospective bailout countries must be running scared – is it safe to keep money in an Italian, Spanish or Greek bank any more? I dont know, must be the answer. Is it prudent to take the risk? You decide. I fear this will lead to massive capital outflows from weak Eurozone countries, just about the last thing they need right now. Even from the EU as a whole, I suspect, as the banking union is in place in most countries already.</p><p>Another open question is what will happen to the huge number of brokerages based in Cyprus? There is about 100 or more FX and other brokers currently operating under the relatively light Cypriot regulation. How will this impact the trustworthiness of these many small institutions? What IS the exact impact on the client deposits they might be holding in Cyprus? Will anyone dare to do business with them going forward?</p><p>This is a major, MAJOR game changer and the fallout will be with us for a long time to come. I believe it could be the beginning of the end for the Eurozone as this is an unbelievable blow to the already challenged trust that might be left among investors. Talk about a possible own goal.</p><p>Market reaction? it must be very good for gold – and for safe-haven countries like Switzerland, Singapore and economically more healthy non-Euro countries in, for example, Scandinavia. I would think the EUR and associated markets will be undermined by increasing lack of confidence when the full implications become clear for investors.</p><p>This is full-blown socialism and I still cannot believe this really happened.</p></blockquote><p>I think it is safe to say that it is very bad news when the actions of the international bankers appalls even their lesser brethren, and when the initial test-action exceeds the worst expectations of about only people <a href=\"http://www.zerohedge.com/news/2013-03-16/everyone-shocked-what-just-happened-and-why-just-beginning\">to correctly anticipate it coming</a>.</p><p>And note that they expect similar actions to take place in the USA as well.  Meanwhile, none of the smugly verbose defenders of the people on the Left appear to have even noticed anything has happened… most likely because this sort of thing is completely beyond their capacity to even comprehend, let alone analyze or anticipate.</p><p>You will recall that I have been warning readers to stay out of the stock market and the banking system to the greatest extent possible for some time now.  This is only one of the many reasons why.  Those who were confident in the security of their 401ks should probably reconsider their opinions in light of these mandatory depository “contributions” to the cause of debt restructuring.  As <a href=\"http://market-ticker.org/akcs-www?post=218812\">Karl Denninger puts it</a>: <i>“$100 bills in your hand have just been declared to be worth<br> somewhere between 7-10% more than those “deposited” and “stored” in a<br> bank.”</br></br></i></p><p>I have to admit, once more I’m shown to be somewhat of an optimist.  I expected them to begin with pension and 401k seizures, I never imagined they would go right for the deposits.  But then, as a gangster of an earlier era said, the banks are where the money is.  And in case you were wondering what was going to bring the heavily overbought stock market’s 10-day winning streak to a customarily nasty end, you would appear to have gotten your answer.</p><p>UPDATE: Germany and the IMF were <a href=\"http://www.zerohedge.com/news/2013-03-16/germany-and-imfs-initial-deposit-haircut-demand-40-total\">originally demanding 40 PERCENT</a> of all bank deposits.</p><p>UPDATE II: The Monday bank holiday in Cyprus <a href=\"http://www.zerohedge.com/news/2013-03-17/cyprus-bank-holiday-extended-through-tuesday-confusion-spreads\">has already been extended to Tuesday</a>, and will likely be extended to Wednesday as well.  Pay attention, this is how it will happen elsewhere.  If you wait until the announcements hit, you will not be able to do anything until it is too late.</p><p>UPDATE III: Now the Cypriot Parliament is belatedly wondering if robbing the entire savings class is a health-conscious decision and <a href=\"http://www.marinij.com/business/ci_22810447/cyprus-parliament-delays-vote-bank-deposits-tax\">dragging its heels</a>.<i> “Cyprus’ parliament on Sunday postponed a debate<br> and vote on a controversial levy on all bank deposits that the<br> cash-strapped country’s creditors had demanded in exchange for (EURO)10<br> billion ($13 billion) in rescue money.      The vote, which had been<br> expected later Sunday, has been pushed back to Monday afternoon,<br> parliamentary official Antonis Koutalianos said.      The<br> announcement set off an immediate scramble among top European officials,<br> with reports that the European Central Bank was pressuring Cypriot<br> authorities to hold the vote without delay.”</br></br></br></br></br></br></br></br></i></p><p>I expect the confiscations will go through, such things almost always do, but notice how it is always the executive branch that is the first to surrender.  And what a surprise, that the anti-democratic fascists of the EU failed to take into account that they’d have to get the support of the parliament in order to complete their little bank heist.  Also, look for the “Russian money laundering” angle to be talked up on the financial news in an attempt to justify the theft and reduce fears outside of Cyprus, which is, of course, the only place that any thing of the sort could possibly happen just this one time due to impossible-to-foresee emergency circumstances.</p><p>UPDATE IV: In what surely is completely unrelated news, the Russian Navy had an announcement today as well: <i>“Russia will dispatch a permanent group of five to six combat ships to<br> the Mediterranean Sea, Russian Navy chief Admiral Viktor Chirkov said.<br> Frigates and cruisers will make up the core of the fleet.”</br></br></i></p></div>",
  "content_text": "The CEO of Saxo Bank comments\non the Cypriot bank raids\n:\nThis is full-blown socialism. It is difficult to describe the weekend bailout package to Cyprus in any other way. The confiscation of 6.75 percent of small depositors’ money and 9.9 percent of big depositors’ funds is without precedence that I can think of in a supposedly civilised and democratic society. But maybe the European Union (EU) is no longer a civilised democracy?\nI heard rumours about this when I visited Limassol last week, but dismissed them as completely outlandish. And yet, here we are. The consequences are unpredictable, but we are clearly looking at a significant paradigm shift.\nThis is a breach of fundamental property rights, dictated to a small country by foreign powers and it must make every bank depositor in Europe shiver. Although the representatives at the bailout press conference tried to present this as a one-off, they were not willing to rule out similar measures elsewhere – not that it would have mattered much as the trust is gone anyway. It is now difficult to expect any kind of limitation to what measures the Troika and EU might take when the crisis really starts to bite.\nIf you can do this once, you can do it again. if you can confiscate 10 percent of a bank customer’s money, you can confiscate 25, 50 or even 100 percent. I now believe we will see worse as the panic increases, with politicians desperately trying to keep the EUR alive.\nDepositors in other prospective bailout countries must be running scared – is it safe to keep money in an Italian, Spanish or Greek bank any more? I dont know, must be the answer. Is it prudent to take the risk? You decide. I fear this will lead to massive capital outflows from weak Eurozone countries, just about the last thing they need right now. Even from the EU as a whole, I suspect, as the banking union is in place in most countries already.\nAnother open question is what will happen to the huge number of brokerages based in Cyprus? There is about 100 or more FX and other brokers currently operating under the relatively light Cypriot regulation. How will this impact the trustworthiness of these many small institutions? What IS the exact impact on the client deposits they might be holding in Cyprus? Will anyone dare to do business with them going forward?\nThis is a major, MAJOR game changer and the fallout will be with us for a long time to come. I believe it could be the beginning of the end for the Eurozone as this is an unbelievable blow to the already challenged trust that might be left among investors. Talk about a possible own goal.\nMarket reaction? it must be very good for gold – and for safe-haven countries like Switzerland, Singapore and economically more healthy non-Euro countries in, for example, Scandinavia. I would think the EUR and associated markets will be undermined by increasing lack of confidence when the full implications become clear for investors.\nThis is full-blown socialism and I still cannot believe this really happened.\nI think it is safe to say that it is very bad news when the actions of the international bankers appalls even their lesser brethren, and when the initial test-action exceeds the worst expectations of about only people\nto correctly anticipate it coming\n.\nAnd note that they expect similar actions to take place in the USA as well.  Meanwhile, none of the smugly verbose defenders of the people on the Left appear to have even noticed anything has happened… most likely because this sort of thing is completely beyond their capacity to even comprehend, let alone analyze or anticipate.\nYou will recall that I have been warning readers to stay out of the stock market and the banking system to the greatest extent possible for some time now.  This is only one of the many reasons why.  Those who were confident in the security of their 401ks should probably reconsider their opinions in light of these mandatory depository “contributions” to the cause of debt restructuring.  As\nKarl Denninger puts it\n:\n“$100 bills in your hand have just been declared to be worth\nsomewhere between 7-10% more than those “deposited” and “stored” in a\nbank.”\nI have to admit, once more I’m shown to be somewhat of an optimist.  I expected them to begin with pension and 401k seizures, I never imagined they would go right for the deposits.  But then, as a gangster of an earlier era said, the banks are where the money is.  And in case you were wondering what was going to bring the heavily overbought stock market’s 10-day winning streak to a customarily nasty end, you would appear to have gotten your answer.\nUPDATE: Germany and the IMF were\noriginally demanding 40 PERCENT\nof all bank deposits.\nUPDATE II: The Monday bank holiday in Cyprus\nhas already been extended to Tuesday\n, and will likely be extended to Wednesday as well.  Pay attention, this is how it will happen elsewhere.  If you wait until the announcements hit, you will not be able to do anything until it is too late.\nUPDATE III: Now the Cypriot Parliament is belatedly wondering if robbing the entire savings class is a health-conscious decision and\ndragging its heels\n.\n“Cyprus’ parliament on Sunday postponed a debate\nand vote on a controversial levy on all bank deposits that the\ncash-strapped country’s creditors had demanded in exchange for (EURO)10\nbillion ($13 billion) in rescue money.      The vote, which had been\nexpected later Sunday, has been pushed back to Monday afternoon,\nparliamentary official Antonis Koutalianos said.      The\nannouncement set off an immediate scramble among top European officials,\nwith reports that the European Central Bank was pressuring Cypriot\nauthorities to hold the vote without delay.”\nI expect the confiscations will go through, such things almost always do, but notice how it is always the executive branch that is the first to surrender.  And what a surprise, that the anti-democratic fascists of the EU failed to take into account that they’d have to get the support of the parliament in order to complete their little bank heist.  Also, look for the “Russian money laundering” angle to be talked up on the financial news in an attempt to justify the theft and reduce fears outside of Cyprus, which is, of course, the only place that any thing of the sort could possibly happen just this one time due to impossible-to-foresee emergency circumstances.\nUPDATE IV: In what surely is completely unrelated news, the Russian Navy had an announcement today as well:\n“Russia will dispatch a permanent group of five to six combat ships to\nthe Mediterranean Sea, Russian Navy chief Admiral Viktor Chirkov said.\nFrigates and cruisers will make up the core of the fleet.”",
  "tags": [
    "banks",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-17T13:10:00+00:00"
}