{
  "url": "https://voxday.net/2013/03/16/because-you-invaded-their-country/",
  "scraped_at": "2025-12-14T22:23:11.830494",
  "title": "Because you invaded their country",
  "date_display": "March 16, 2013",
  "date_iso": "2013-03-16T15:30:00+00:00",
  "date_from_url": "2013-03-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An Indian man wonders why no British people <a href=\"http://www.dailymail.co.uk/news/article-2294307/Father-punched-face-18-times-racist-thugs-200-witnesses-packed-tram--person-intervened.html\">were willing to intervene</a> when he was being beaten up on a train:</p><blockquote class=\"tr_bq\"><p> ‘Why would nobody help me?’ Father punched in the face 18 times by racist thugs in front of 200 witnesses on a packed tram… and not one person intervened. Prakash Patel, 56, attacked while on a tram in Manchester with his daughter</p></blockquote><p>Can you imagine this happening in the England in which Mr. Patel first settled 30 years ago?  No more than you can probably imagine a German complaining that French civilians didn’t come to his assistance when the French Resistance attacked him.  Meanwhile, Mr. Patel’s daughter is very fortunate that they were Indians being attacked in England and not <a href=\"http://www.dailymail.co.uk/news/article-2294315/Swiss-tourist-39-gang-raped-India-husband-attacked-men-armed-sticks.html\">Swiss being attacked in India</a>.</p><p>The <i>bien-pensant</i> can cluck like chickens about how terrible it is that humanity does not suffer invasion of its territories and subjugation of its peoples with all the gentle good humor of lambs being led to the slaughter if they like; they will do so to no avail.  Recall that most still regard Winston Churchill, Davy Crockett, and the men of the USS Arizona heroes for their resistance of failed conquests far less credible than those attempted by Mr. Patel and his third world cohorts. The “racist thugs” of today will be the heroes of tomorrow, just as the multicuturalists thought so well of by the<i> </i>progressives and well-behaved conservatives of today will eventually be considered insane monsters of history in the vein of the Nazis and Communists.</p><p>Multiculturalism is worse than murder.  It is even worse than mass murder, being more akin to genocide. It is attempted sociocide.  As for the self-hating fifth columnists who piously mouth PC sacraments like “racists have no place in our society”, I suggest they go and try settling in India or Jamaica or Nigeria so they can discover how the people they are so eagerly welcoming to settle in their country truly feel about racial differences.</p><p>It doesn’t matter in the slightest how one feels personally about these matters.  It doesn’t matter how pure-in-heart and anti-racist you believe yourself to be. It doesn’t matter that people of various sub-species and races have lived in relative harmony for ten, twenty, or even one hundred years. Cultural friction, like gravity, <i>always wins in the end</i>. History shows, history makes it abundantly clear, that eventually the cultural differences will trigger sufficient violence to restore the violated borders once more.  It is as completely futile to blame “racism” for the inevitable violence as it is to wage war on “terror”.  Doing so is a fundamental category error.</p><p>Immigration is when a small number of foreigners are permitted to settle within a country by the native people.  Invasion is when tens of thousands or more foreigners settle in a country against the wishes of the native people, regardless of whether they happen to be armed or not. Both Europe and the USA have suffered quiet and undeclared large-scale invasions; only now are the natives beginning to wake up and become restless.</p><p>And the reason they will become considerably more violent is explained by Mr. Patel himself: “He said he would consider leaving Britain in the wake of the attack were it not for the fact that his family is so well established here.”  In other words, the invaders will not leave until they are forced to do so, as we have seen in India, in Zimbabwe, as we are presently seeing in South Africa, and as we will eventually see in England and the USA.</p><p>Now, there is certainly a case to be made that there is no need to harbor any sympathy for the British, considering how they themselves invaded more than half the countries around the world.  But it is blatantly dishonest to pretend the British people are not being invaded against their will, as dishonest as it would be to deny the invasions of the British imperial era.</p><p>The honest monohumanist, assuming one can be found, will be inclined to ask “why are you racist?”  To which one can only respond: “on what basis do you assume that this time, for the first time in over six thousand years of recorded history, it will be different?”</p></div>",
  "content_text": "An Indian man wonders why no British people\nwere willing to intervene\nwhen he was being beaten up on a train:\n‘Why would nobody help me?’ Father punched in the face 18 times by racist thugs in front of 200 witnesses on a packed tram… and not one person intervened. Prakash Patel, 56, attacked while on a tram in Manchester with his daughter\nCan you imagine this happening in the England in which Mr. Patel first settled 30 years ago?  No more than you can probably imagine a German complaining that French civilians didn’t come to his assistance when the French Resistance attacked him.  Meanwhile, Mr. Patel’s daughter is very fortunate that they were Indians being attacked in England and not\nSwiss being attacked in India\n.\nThe\nbien-pensant\ncan cluck like chickens about how terrible it is that humanity does not suffer invasion of its territories and subjugation of its peoples with all the gentle good humor of lambs being led to the slaughter if they like; they will do so to no avail.  Recall that most still regard Winston Churchill, Davy Crockett, and the men of the USS Arizona heroes for their resistance of failed conquests far less credible than those attempted by Mr. Patel and his third world cohorts. The “racist thugs” of today will be the heroes of tomorrow, just as the multicuturalists thought so well of by the\nprogressives and well-behaved conservatives of today will eventually be considered insane monsters of history in the vein of the Nazis and Communists.\nMulticulturalism is worse than murder.  It is even worse than mass murder, being more akin to genocide. It is attempted sociocide.  As for the self-hating fifth columnists who piously mouth PC sacraments like “racists have no place in our society”, I suggest they go and try settling in India or Jamaica or Nigeria so they can discover how the people they are so eagerly welcoming to settle in their country truly feel about racial differences.\nIt doesn’t matter in the slightest how one feels personally about these matters.  It doesn’t matter how pure-in-heart and anti-racist you believe yourself to be. It doesn’t matter that people of various sub-species and races have lived in relative harmony for ten, twenty, or even one hundred years. Cultural friction, like gravity,\nalways wins in the end\n. History shows, history makes it abundantly clear, that eventually the cultural differences will trigger sufficient violence to restore the violated borders once more.  It is as completely futile to blame “racism” for the inevitable violence as it is to wage war on “terror”.  Doing so is a fundamental category error.\nImmigration is when a small number of foreigners are permitted to settle within a country by the native people.  Invasion is when tens of thousands or more foreigners settle in a country against the wishes of the native people, regardless of whether they happen to be armed or not. Both Europe and the USA have suffered quiet and undeclared large-scale invasions; only now are the natives beginning to wake up and become restless.\nAnd the reason they will become considerably more violent is explained by Mr. Patel himself: “He said he would consider leaving Britain in the wake of the attack were it not for the fact that his family is so well established here.”  In other words, the invaders will not leave until they are forced to do so, as we have seen in India, in Zimbabwe, as we are presently seeing in South Africa, and as we will eventually see in England and the USA.\nNow, there is certainly a case to be made that there is no need to harbor any sympathy for the British, considering how they themselves invaded more than half the countries around the world.  But it is blatantly dishonest to pretend the British people are not being invaded against their will, as dishonest as it would be to deny the invasions of the British imperial era.\nThe honest monohumanist, assuming one can be found, will be inclined to ask “why are you racist?”  To which one can only respond: “on what basis do you assume that this time, for the first time in over six thousand years of recorded history, it will be different?”",
  "tags": [
    "immigration",
    "Invasion"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-16T15:30:00+00:00"
}