{
  "url": "https://voxday.net/2013/03/31/christ-is-risen-2/",
  "scraped_at": "2025-12-14T22:24:31.601634",
  "title": "Christ is risen",
  "date_display": "March 31, 2013",
  "date_iso": "2013-03-31T07:45:00+00:00",
  "date_from_url": "2013-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>“On the evening of that first day of the<br> week, when the disciples were together, with the doors locked for fear<br> of the Jewish leaders, Jesus came and stood among them and said, “Peace be with you!” After he said this, he showed them his hands and side. The disciples were overjoyed when they saw the Lord.</br></br></i></p><p><i>Again Jesus said, “Peace be with you! As the Father has sent me, I am sending you.” And with that he breathed on them and said, “Receive the Holy Spirit. If you forgive anyone’s sins, their sins are forgiven; if you do not forgive them, they are not forgiven.” </i></p><p><i>Now Thomas, one of the Twelve, was not with the disciples when Jesus came. So the other disciples told him, “We have seen the Lord!” But<br> he said to them, “Unless I see the nail marks in his hands and put my<br> finger where the nails were, and put my hand into his side, I will not believe.” </br></br></i></p><p><i>A<br> week later his disciples were in the house again, and Thomas was with<br> them. Though the doors were locked, Jesus came and stood among them and<br> said, “Peace be with you!”  Then he said to Thomas, “Put your finger here; see my hands. Reach out your hand and put it into my side. Stop doubting and believe.” </br></br></br></i></p><p><i>Thomas said to him, “My Lord and my God!” </i></p><p><i>Then Jesus told him, “Because you have seen me, you have believed; blessed are those who have not seen and yet have believed.””</i><br> – John 20:19-29<i> </i></br></p><p>The other day, Moonshadow wrote: “I’m looking forward to your Easter blog post. My circumstances are difficult and I’m in need of some hope. My trust in God has been sorely tested over the years, but it still remains.”</p><p>One of the great misconceptions of the various flavors of Churchianity is that Jesus Christ is some sort of icon, a magic token that will Make Your Life Better so long as the proper incantations are uttered. The Prosperity Gospel proclaims that Jesus will give you a bigger house and a nicer car. The Liberation Theology declares that Jesus is a divine socialist who came to redistribute wealth on the basis of everyone’s needs. The Feminist Gospel asserts that Jesus will relieve women of the oppressive burden of household and sexual drudgery. But regardless of his particular flavor, the Churchian is known for neither his love nor his faith, but his tolerance and his conformity.</p><p>This is not Christianity.</p><p>We are, all of us, infected by the Churchian disease to some extent. We have all listened to women pastors tell us how safe they feel cuddled in Jesus’s strong and protective arms, to televangelists with slicked-back hair promising miracle cures and new jobs, to priests who promise that if we only endorse homosexuality with sufficient enthusiasm, the Church will rise in the estimation of the world and both pews and coffers will be filled again to overflowing.</p><p>This is not Christianity.</p><p>Christianity is about the Divine becoming Man amidst blood and animal shit.  Christianity revolves around an innocent man rejected by his people, despised by the elite, declared a criminal by the court, and murdered by the government under the false color of law. Christianity describes a world that is fallen, sinful, and ruled by an evil, sadistic, prideful, immortal liar.</p><p>We Christians today are weak. We are soft, fat, and flaccid in our faith. We are the beneficiaries of the greatest explosion of global wealth and one of the longest periods of peace in the history of the world, and we are quite understandably daunted by the sober realization that this Golden Age is rapidly coming to an end. We are lotus eaters, hedonized if not entirely hedonistic, and the soothing whispers of Mammon have enervated our will, our strength, and even our faith. We are the sad and pathetic heirs of the Church Militant, an embarrassment to our predecessors and eminently unworthy of our Lord and Savior.</p><p>And yet, we are who we are. We, who worship Our Lord and Savior, Jesus Christ, are the remnants of the victorious Divine Invasion.</p><p>On this day many centuries ago, there was little more than twelve frightened and despairing men.  From that small and unprepossessing foundation, the Risen Lord Jesus Christ constructed a Church that brought the Good News to all mankind, that civilized barbarians around the world, that remains the oldest and greatest human institution, and that, despite its corruption and decadence, continues to resist the every-hungry Gates of Hell.</p><p>If God could do that with men like Peter, the denier, and Thomas, the doubter who believed only what he could see, what can He not do with those He has blessed because we have not seen and yet have believed?</p><p>Jesus never promised us a rose garden on this earth, ruled as it is by the wicked prince who killed him. He promised that we would be hated. He promised that we would be condemned. He promised that we would see our families and our nations divided. He promised that we would be persecuted. He promised wars and the rumors of wars. And yet, somehow, when what he promised comes to pass, we find ourselves troubled and our faith shaken by the very things that should serve to confirm it.</p><p>It is not hard to see why so many people of every culture and creed around the world are frightened and losing hope. If you are not concerned, deeply concerned, about the state of the world today, you are either in denial or you are not paying attention. The rule of law is dissolving and the collective illusions upon which our civilization depends are rapidly fading away.  We have lost our trust in our institutions, in our traditions, in our icons, and in our leaders. We have lost our confidence in the certainty of the Worker’s Paradise, in the exceptionalism of America, in the inevitability of the shiny, sexy, secular scientopia, and in the idea of peace on earth through the good will of the globalist bureaucracies.  We have lost our faith in Progress.</p><p>We are rapidly coming to understand that there is no hope to be found in Man or the things of Man’s making. But the truth is, the observable historical reality is, there has never been any hope but one. And the foundation of that hope is precisely what we Christians are celebrating today: the Resurrection of Jesus Christ.</p><p>He is Risen! Christ is Risen!</p></div>",
  "content_text": "“On the evening of that first day of the\nweek, when the disciples were together, with the doors locked for fear\nof the Jewish leaders, Jesus came and stood among them and said, “Peace be with you!” After he said this, he showed them his hands and side. The disciples were overjoyed when they saw the Lord.\nAgain Jesus said, “Peace be with you! As the Father has sent me, I am sending you.” And with that he breathed on them and said, “Receive the Holy Spirit. If you forgive anyone’s sins, their sins are forgiven; if you do not forgive them, they are not forgiven.”\nNow Thomas, one of the Twelve, was not with the disciples when Jesus came. So the other disciples told him, “We have seen the Lord!” But\nhe said to them, “Unless I see the nail marks in his hands and put my\nfinger where the nails were, and put my hand into his side, I will not believe.”\nA\nweek later his disciples were in the house again, and Thomas was with\nthem. Though the doors were locked, Jesus came and stood among them and\nsaid, “Peace be with you!”  Then he said to Thomas, “Put your finger here; see my hands. Reach out your hand and put it into my side. Stop doubting and believe.”\nThomas said to him, “My Lord and my God!”\nThen Jesus told him, “Because you have seen me, you have believed; blessed are those who have not seen and yet have believed.””\n– John 20:19-29\nThe other day, Moonshadow wrote: “I’m looking forward to your Easter blog post. My circumstances are difficult and I’m in need of some hope. My trust in God has been sorely tested over the years, but it still remains.”\nOne of the great misconceptions of the various flavors of Churchianity is that Jesus Christ is some sort of icon, a magic token that will Make Your Life Better so long as the proper incantations are uttered. The Prosperity Gospel proclaims that Jesus will give you a bigger house and a nicer car. The Liberation Theology declares that Jesus is a divine socialist who came to redistribute wealth on the basis of everyone’s needs. The Feminist Gospel asserts that Jesus will relieve women of the oppressive burden of household and sexual drudgery. But regardless of his particular flavor, the Churchian is known for neither his love nor his faith, but his tolerance and his conformity.\nThis is not Christianity.\nWe are, all of us, infected by the Churchian disease to some extent. We have all listened to women pastors tell us how safe they feel cuddled in Jesus’s strong and protective arms, to televangelists with slicked-back hair promising miracle cures and new jobs, to priests who promise that if we only endorse homosexuality with sufficient enthusiasm, the Church will rise in the estimation of the world and both pews and coffers will be filled again to overflowing.\nThis is not Christianity.\nChristianity is about the Divine becoming Man amidst blood and animal shit.  Christianity revolves around an innocent man rejected by his people, despised by the elite, declared a criminal by the court, and murdered by the government under the false color of law. Christianity describes a world that is fallen, sinful, and ruled by an evil, sadistic, prideful, immortal liar.\nWe Christians today are weak. We are soft, fat, and flaccid in our faith. We are the beneficiaries of the greatest explosion of global wealth and one of the longest periods of peace in the history of the world, and we are quite understandably daunted by the sober realization that this Golden Age is rapidly coming to an end. We are lotus eaters, hedonized if not entirely hedonistic, and the soothing whispers of Mammon have enervated our will, our strength, and even our faith. We are the sad and pathetic heirs of the Church Militant, an embarrassment to our predecessors and eminently unworthy of our Lord and Savior.\nAnd yet, we are who we are. We, who worship Our Lord and Savior, Jesus Christ, are the remnants of the victorious Divine Invasion.\nOn this day many centuries ago, there was little more than twelve frightened and despairing men.  From that small and unprepossessing foundation, the Risen Lord Jesus Christ constructed a Church that brought the Good News to all mankind, that civilized barbarians around the world, that remains the oldest and greatest human institution, and that, despite its corruption and decadence, continues to resist the every-hungry Gates of Hell.\nIf God could do that with men like Peter, the denier, and Thomas, the doubter who believed only what he could see, what can He not do with those He has blessed because we have not seen and yet have believed?\nJesus never promised us a rose garden on this earth, ruled as it is by the wicked prince who killed him. He promised that we would be hated. He promised that we would be condemned. He promised that we would see our families and our nations divided. He promised that we would be persecuted. He promised wars and the rumors of wars. And yet, somehow, when what he promised comes to pass, we find ourselves troubled and our faith shaken by the very things that should serve to confirm it.\nIt is not hard to see why so many people of every culture and creed around the world are frightened and losing hope. If you are not concerned, deeply concerned, about the state of the world today, you are either in denial or you are not paying attention. The rule of law is dissolving and the collective illusions upon which our civilization depends are rapidly fading away.  We have lost our trust in our institutions, in our traditions, in our icons, and in our leaders. We have lost our confidence in the certainty of the Worker’s Paradise, in the exceptionalism of America, in the inevitability of the shiny, sexy, secular scientopia, and in the idea of peace on earth through the good will of the globalist bureaucracies.  We have lost our faith in Progress.\nWe are rapidly coming to understand that there is no hope to be found in Man or the things of Man’s making. But the truth is, the observable historical reality is, there has never been any hope but one. And the foundation of that hope is precisely what we Christians are celebrating today: the Resurrection of Jesus Christ.\nHe is Risen! Christ is Risen!",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-31T06:45:00+00:00"
}