{
  "url": "https://voxday.net/2013/03/15/everybody-screws-up/",
  "scraped_at": "2025-12-14T22:23:08.533774",
  "title": "Everybody screws up",
  "date_display": "March 15, 2013",
  "date_iso": "2013-03-15T19:32:00+00:00",
  "date_from_url": "2013-03-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was a bit embarrassed about my little digging-related miscalculation in <i>A Throne of Bones</i>.  I felt a little better about it after encountering a mistake in Isaac Asimov’s <i>Forward the Foundation</i>, in which a<br> highly improbable nightly murder rate was asserted on Trantor.  And<br> given the level of attention to detail for which David Foster Wallace,<br> supposedly one of the greatest novelists of the last 30 years, is<br> rightly lauded, I feel downright positive about my own blunder after catching the following error in this passage from <i>Infinite Jest</i>.  Apparently, the longer the book, the more likely it is that the possibility of a basic error approaches certainty.</br></br></br></br></p><blockquote class=\"tr_bq\"><p> 1610h.<br> E.T.A. Weight Room. Freestyle circuits. The clank and click of various<br> resistance-systems. Lyle on the towel dispenser conferring with an<br> extremely moist Graham Rader. Schacht doing sit-ups, the board almost<br> vertical, his face purple and forehead pulsing. Troeltsch by the squat<br> rack blowing his nose into a towel. Coyle doing military presses with a<br> bare bar. Carol Spodek curling, intent on the mirror. Rader nodding as<br> Lyle bends and leans in. Hal up on the spotter-shelf in back of the<br> incline-bench in the shadow of the monster copper beech through the west<br> window doing single-leg toe-raises, for the ankle. Ingersoll at the<br> shoulder-pull, steadily upping the weight against Lyle’s advice. Keith<br> (‘The Viking’) Freer 68 and the steroidic fifteen-year-old Eliot<br> Kornspan spotting each other on massive barbell-curls next to the water<br> cooler’s bench, taking turns bellowing encouragement. Hal keeps pausing<br> to lean down and spit into an old NASA glass on the floor by the little<br> shelf. E.T.A. Trainer Barry Loach walking around with a clipboard he<br> doesn’t write anything down on, but watching people intently and nodding<br> a lot. Axford with one shoe off in the corner, doing something to his<br> bare foot. Michael Pemulis seated cross-legged on the cooler’s bench<br> just off Kornspan’s left hip, doing facial isometrics, trying to<br> eavesdrop on Lyle and Rader, wincing whenever Kornspan and Freer roar at<br> each other.<br> ‘Three more! Get it up there!’<br> ‘Hoooowaaaaa.’<br> ‘Get that shit up there man!’<br> ‘Gwwwhoooooowaaaaa!’<br> ‘It raped your sister! It killed your fucking mother man!’<br> ‘Huhl huhl huhl huhl gwwwww.’<br> ‘Do it!’<br> Pemulis<br> makes his face very long for a while and then very short and broad,<br> then all sort of hollow and distended like one of Bacon’s popes.<br> ‘Well<br> suppose’ — Pemulis can just make out Lyle — ‘Suppose I were to give you<br> a key ring with ten keys. With, no, with a hundred keys, and I were to<br> tell you that one of these keys will unlock it, this door we’re<br> imagining opening in onto all you want to be, as a player. How many of<br> the keys would you be willing to try?’<br> Troeltsch calls over to<br> Pemulis, ‘Do the deLint-jerking-off face again!’ Pemulis for a second<br> lets his mouth gape slackly and his eyes roll way up and flutters his<br> lids, moving his fist.<br> ‘Well I’d try every darn one,’ Rader tells Lyle.<br> ‘Huhl. Huhl. Gwwwwwwww.’<br> ‘Motherfucker! Fucker!’<br> Pemulis’s wince looks like a type of facial isometric.<br> ‘Do Bridget having a tantrum! Do Schacht in a stall!’<br> Pemulis makes a shush-finger.<br> Lyle<br> never whispers, but it’s just about the same. ‘Then you are willing to<br> make mistakes, you see. You are saying you will accept 99% error. The<br> paralyzed perfectionist you say you are would stand there before that<br> door. Jingling the keys. Afraid to try the first key.’<br> Pemulis pulls<br> his lower lip down as far as it will go and contracts his cheek muscles.<br> Cords stand out on Freer’s neck as he screams at Kornspan. There’s a<br> little hanging mist of spittle and sweat. Kornspan looks like he’s about<br> to have a stroke. There are 90 kg. on the bar, which itself is 20 kg.<br> ‘One more you fuck. Fucking take it.’<br> ‘Fuck me. Fuck meyou fuck. Gwwwwww.’<br> ‘Take the pain.’<br> Freer has one finger under the bar, barely helping. Kornspan’s red face is leaping around on his skull.<br/> Carol Spodek’s smaller bar goes silently up and down.<br/> Troeltsch<br/> comes over and sits down and saws at the back of his neck with the<br/> towel, looking up at Kornspan. ‘I don’t think all the curls I’ve ever<br/> done all together add up to 110,’ he said.<br/> Kornspan’s making sounds that don’t sound like they’re coming from his throat.<br/> ‘Yes!<br/> Yiiissss!’ roars Freer. The bar crashes to the rubber floor, making<br/> Pemulis wince. Every vein on Kornspan stands out and pulses. His stomach<br/> looks pregnant. He puts his hands on his thighs and leans forward, a<br/> string of something hanging from his mouth.<br/> ‘Way to fucking take it<br/> baby,’ Freer says, going over to the box on the dispenser to get rosin<br/> for his hands, watching himself walk toward the mirror.<br/> Pemulis<br/> starts very slowly to lean over toward Kornspan, looking around<br/> confidentially. He gets so his face is right up near the side of<br/> Kornspan’s mesomorphic head and whispers. ‘Hey. Eliot. Hey.’<br/> Kornspan, bent over, chest heaving, rolls his head a little his way. Pemulis whispers: ‘Pussy.’</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>It’s an amusing scene, but first<br/> of all, no 15-year old boys, with or without steroids, have ever done a<br/> single 110 kg curl, let alone more than four.  That’s nearly 250<br/> pounds. Even at my most bulked up, when I was benching 325 pounds, I never curled more than four reps at 150.  These days, I usually top out with 4×52 kg, which is only a bit more than 115 pounds.</p><p>Based on the fact<br/> that Wallace mentions 90 kg being on the bar, it’s pretty clear that he actually meant<br/> 90 pounds, which is one 45-pound plate per side.  Still impressive, as with<br/> the bar, (another 45 pounds), it is 135 pounds.  Which is readily doable, although still not reasonably conceivable for 15-year old tennis players who are described as having one arm more developed than the other.</p></div>",
  "content_text": "I was a bit embarrassed about my little digging-related miscalculation in\nA Throne of Bones\n.  I felt a little better about it after encountering a mistake in Isaac Asimov’s\nForward the Foundation\n, in which a\nhighly improbable nightly murder rate was asserted on Trantor.  And\ngiven the level of attention to detail for which David Foster Wallace,\nsupposedly one of the greatest novelists of the last 30 years, is\nrightly lauded, I feel downright positive about my own blunder after catching the following error in this passage from\nInfinite Jest\n.  Apparently, the longer the book, the more likely it is that the possibility of a basic error approaches certainty.\n1610h.\nE.T.A. Weight Room. Freestyle circuits. The clank and click of various\nresistance-systems. Lyle on the towel dispenser conferring with an\nextremely moist Graham Rader. Schacht doing sit-ups, the board almost\nvertical, his face purple and forehead pulsing. Troeltsch by the squat\nrack blowing his nose into a towel. Coyle doing military presses with a\nbare bar. Carol Spodek curling, intent on the mirror. Rader nodding as\nLyle bends and leans in. Hal up on the spotter-shelf in back of the\nincline-bench in the shadow of the monster copper beech through the west\nwindow doing single-leg toe-raises, for the ankle. Ingersoll at the\nshoulder-pull, steadily upping the weight against Lyle’s advice. Keith\n(‘The Viking’) Freer 68 and the steroidic fifteen-year-old Eliot\nKornspan spotting each other on massive barbell-curls next to the water\ncooler’s bench, taking turns bellowing encouragement. Hal keeps pausing\nto lean down and spit into an old NASA glass on the floor by the little\nshelf. E.T.A. Trainer Barry Loach walking around with a clipboard he\ndoesn’t write anything down on, but watching people intently and nodding\na lot. Axford with one shoe off in the corner, doing something to his\nbare foot. Michael Pemulis seated cross-legged on the cooler’s bench\njust off Kornspan’s left hip, doing facial isometrics, trying to\neavesdrop on Lyle and Rader, wincing whenever Kornspan and Freer roar at\neach other.\n‘Three more! Get it up there!’\n‘Hoooowaaaaa.’\n‘Get that shit up there man!’\n‘Gwwwhoooooowaaaaa!’\n‘It raped your sister! It killed your fucking mother man!’\n‘Huhl huhl huhl huhl gwwwww.’\n‘Do it!’\nPemulis\nmakes his face very long for a while and then very short and broad,\nthen all sort of hollow and distended like one of Bacon’s popes.\n‘Well\nsuppose’ — Pemulis can just make out Lyle — ‘Suppose I were to give you\na key ring with ten keys. With, no, with a hundred keys, and I were to\ntell you that one of these keys will unlock it, this door we’re\nimagining opening in onto all you want to be, as a player. How many of\nthe keys would you be willing to try?’\nTroeltsch calls over to\nPemulis, ‘Do the deLint-jerking-off face again!’ Pemulis for a second\nlets his mouth gape slackly and his eyes roll way up and flutters his\nlids, moving his fist.\n‘Well I’d try every darn one,’ Rader tells Lyle.\n‘Huhl. Huhl. Gwwwwwwww.’\n‘Motherfucker! Fucker!’\nPemulis’s wince looks like a type of facial isometric.\n‘Do Bridget having a tantrum! Do Schacht in a stall!’\nPemulis makes a shush-finger.\nLyle\nnever whispers, but it’s just about the same. ‘Then you are willing to\nmake mistakes, you see. You are saying you will accept 99% error. The\nparalyzed perfectionist you say you are would stand there before that\ndoor. Jingling the keys. Afraid to try the first key.’\nPemulis pulls\nhis lower lip down as far as it will go and contracts his cheek muscles.\nCords stand out on Freer’s neck as he screams at Kornspan. There’s a\nlittle hanging mist of spittle and sweat. Kornspan looks like he’s about\nto have a stroke. There are 90 kg. on the bar, which itself is 20 kg.\n‘One more you fuck. Fucking take it.’\n‘Fuck me. Fuck meyou fuck. Gwwwwww.’\n‘Take the pain.’\nFreer has one finger under the bar, barely helping. Kornspan’s red face is leaping around on his skull.\nCarol Spodek’s smaller bar goes silently up and down.\nTroeltsch\ncomes over and sits down and saws at the back of his neck with the\ntowel, looking up at Kornspan. ‘I don’t think all the curls I’ve ever\ndone all together add up to 110,’ he said.\nKornspan’s making sounds that don’t sound like they’re coming from his throat.\n‘Yes!\nYiiissss!’ roars Freer. The bar crashes to the rubber floor, making\nPemulis wince. Every vein on Kornspan stands out and pulses. His stomach\nlooks pregnant. He puts his hands on his thighs and leans forward, a\nstring of something hanging from his mouth.\n‘Way to fucking take it\nbaby,’ Freer says, going over to the box on the dispenser to get rosin\nfor his hands, watching himself walk toward the mirror.\nPemulis\nstarts very slowly to lean over toward Kornspan, looking around\nconfidentially. He gets so his face is right up near the side of\nKornspan’s mesomorphic head and whispers. ‘Hey. Eliot. Hey.’\nKornspan, bent over, chest heaving, rolls his head a little his way. Pemulis whispers: ‘Pussy.’\nIt’s an amusing scene, but first\nof all, no 15-year old boys, with or without steroids, have ever done a\nsingle 110 kg curl, let alone more than four.  That’s nearly 250\npounds. Even at my most bulked up, when I was benching 325 pounds, I never curled more than four reps at 150.  These days, I usually top out with 4×52 kg, which is only a bit more than 115 pounds.\nBased on the fact\nthat Wallace mentions 90 kg being on the bar, it’s pretty clear that he actually meant\n90 pounds, which is one 45-pound plate per side.  Still impressive, as with\nthe bar, (another 45 pounds), it is 135 pounds.  Which is readily doable, although still not reasonably conceivable for 15-year old tennis players who are described as having one arm more developed than the other.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-15T19:32:00+00:00"
}