{
  "url": "https://voxday.net/2013/03/07/genotribes-and-superracis/",
  "scraped_at": "2025-12-14T22:22:23.389943",
  "title": "Genotribes and superracism",
  "date_display": "March 7, 2013",
  "date_iso": "2013-03-07T14:00:00+00:00",
  "date_from_url": "2013-03-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Steve Sailer not only points to one of the fatal flaws of the evolutionary model but manages to lay the foundation for <a href=\"http://isteve.blogspot.com/2013/03/do-species-exist.html\">a new form of scientific super-racism</a>:</p><blockquote class=\"tr_bq\"><p> Thus, there have been, last I checked, a couple of dozen different definitions of species put forward by biologists. Ernst Mayr proposed the simplest: interfertility defines a species. That’s something you can wrap your head around. But there are problems. What about species that reproduce asexually? Among sexually reproducing species, how can you tell whether or not two of the 400 different types of mussels are interfertile or not? As we know from pandas, captive breeding programs are tricky. And what about types of animals who are interfertile but seem worth differentiating, such as dog, wolves, and coyotes?</p><p>Indeed, it was while I was thinking about the Endangered Species Act and<br> the issues surrounding specieshood during the biodiversity debates of<br> the 1990s kicked off by Edward O. Wilson’s campaign to save the<br> rainforests that led me to try to ground the study of human biodiversity<br> in something less woozy than the notion of race as subspecies. Instead,<br> I reasoned, something we <i>know</i> exists for every human is a<br> genetic family tree and a biological extended family. If we go back to<br> thinking about racial groups as extended families, one given a higher<br> degree of coherence and endurance by partial inbreeding, then we have a<br> stronger, broader concept that can be used in vastly more human<br> situations than in just trying to differentiate continental-scale racial<br> groups by skin color in the post-1492 world.</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>If I, as a confirmed scientific sub-speciesist, am considered to be a racist on the basis of my acceptance of the current state of biology, then what words can possibly suffice to properly condemn one who would divide humanity on even more substantive grounds than mere genetic science?</p><p>But what could we call these extended families with higher degrees of coherence and endurance by partial inbreeding?  One would be tempted to suggest the term “genotribes” were it not for the fact that we are reliably informed that tribalism is the root of all human evil.</p></div>",
  "content_text": "Steve Sailer not only points to one of the fatal flaws of the evolutionary model but manages to lay the foundation for\na new form of scientific super-racism\n:\nThus, there have been, last I checked, a couple of dozen different definitions of species put forward by biologists. Ernst Mayr proposed the simplest: interfertility defines a species. That’s something you can wrap your head around. But there are problems. What about species that reproduce asexually? Among sexually reproducing species, how can you tell whether or not two of the 400 different types of mussels are interfertile or not? As we know from pandas, captive breeding programs are tricky. And what about types of animals who are interfertile but seem worth differentiating, such as dog, wolves, and coyotes?\nIndeed, it was while I was thinking about the Endangered Species Act and\nthe issues surrounding specieshood during the biodiversity debates of\nthe 1990s kicked off by Edward O. Wilson’s campaign to save the\nrainforests that led me to try to ground the study of human biodiversity\nin something less woozy than the notion of race as subspecies. Instead,\nI reasoned, something we\nknow\nexists for every human is a\ngenetic family tree and a biological extended family. If we go back to\nthinking about racial groups as extended families, one given a higher\ndegree of coherence and endurance by partial inbreeding, then we have a\nstronger, broader concept that can be used in vastly more human\nsituations than in just trying to differentiate continental-scale racial\ngroups by skin color in the post-1492 world.\nIf I, as a confirmed scientific sub-speciesist, am considered to be a racist on the basis of my acceptance of the current state of biology, then what words can possibly suffice to properly condemn one who would divide humanity on even more substantive grounds than mere genetic science?\nBut what could we call these extended families with higher degrees of coherence and endurance by partial inbreeding?  One would be tempted to suggest the term “genotribes” were it not for the fact that we are reliably informed that tribalism is the root of all human evil.",
  "tags": [
    "evolution",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-07T14:00:00+00:00"
}