{
  "url": "https://voxday.net/2013/03/11/how-not-to-be-sfwa-president-ii/",
  "scraped_at": "2025-12-14T22:22:41.839411",
  "title": "How not to be SFWA president II",
  "date_display": "March 11, 2013",
  "date_iso": "2013-03-11T10:10:00+00:00",
  "date_from_url": "2013-03-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Scalzi doubles down, not only in terms of jacking up his levels of emotion, irrationality, and vulgarity, but by <a href=\"http://whatever.scalzi.com/2013/03/10/new-writers-ebook-publishers-and-the-power-to-negotiate/\">expanding his attack on Random House</a> to include ALL publishers who utilize a no-advance model:</p><blockquote class=\"tr_bq\"><p> So why are so many eBook-only publishers attempting to run with the “no advances” business model? If I had to guess, I would say because many of these then-erstwhile publishers assumed that publishing electronically had a low financial threshold of entry (not true, if you’re serious about it) and they fancied being publishers, so they started their businesses undercapitalized, and are now currently in the process of passing the consequences of that undercapitalization unto the authors they would like to work with. Alternately, as appears to be the case with Random House, they’re looking for a way to pass as much of the initial cost of publishing onto the author as possible, and one of the best ways to bring down those initial costs is to avoid paying the author anything up front. Both of these are bad business models, although one is more maliciously so, and both are to be avoided. Just because someone has stupidly or maliciously planned their business, doesn’t mean you’re obliged to sign a contract with them.</p><p>But, these publishers and their defenders may say (and have said), the publisher takes all the risk in producing a book! Yeah? Hey, to publishers and their defenders who say that: Fuck you. Fuck you for asserting that the author has shouldered no risk, when she’s invested the time, opportunity cost and material outlay required to create a manuscript. Fuck you for asserting the the author sees no risk to her own career from the choices that the publisher imposes on the publishing process that the author has no control of: everything from cover art (which, if horrible and/or out of step with the market, can sink a book) to the size and distribution of the initial print run, to the marketing plan the publisher has for retail.</p><p>Fuck you for lightly passing over the risk that the author has if the book fails — that any additional books in the contract might be cancelled or put out with the bare minimum of contractual obligation, that the author might not be able to sell another book to the publisher or other publishers because of a track record of poor sales — and for lightly passing over the fact the a publisher mitigates its own risk of the failure of a single book by having an entire portfolio of releases. If one single book fails but the publisher’s line holds up generally, then the risk the publisher encounters to its livelihood is minimal. The risk to the author, on the other hand, is substantially greater. Yes, to all of that, “fuck you,” is probably the politest thing to say in response.</p></blockquote><p>Now, I could certainly point out that this is an incredibly stupid, unprofessional, and irresponsible thing to do, especially in light of how the Guardian has already mistaken one of his previous posts on the subject <a href=\"http://www.guardian.co.uk/books/2013/mar/08/random-house-contracts-new-ebook-imprint\">for the SFWA’s position</a>.  So, given the dedicated journalistic commitment to calm and reasonable discourse, it would not be a surprise if we soon see headlines of this sort: SFWA To All Publishers: “FUCK YOU”.</p><p>However, I think that’s all readily apparent.  Being an Award-Winning Cruelty Artist, I happen to find it much more amusing to demonstrate that Scalzi simply doesn’t know what he’s talking about, and moreover, to show that his observed inability to understand the potential benefits of the no-advance, revenue-share system has already cost him hundreds of thousands of dollars in 2012 alone.</p><p>Scalzi <a href=\"http://whatever.scalzi.com/2013/01/16/the-state-of-a-genre-title-2013/\">has publicly stated</a> that Tor sold<br> 35,667 eBook versions of <i>Redshirts </i>at $11.99, 17,008 audiobooks at $19.95 and 26,604 hardcovers at $24.95.  If we assume that he gets the<br> standard 20% royalty on ebooks that Tor author Robert Sawyer says <a class=\"bbc_url\" href=\"http://sfwriter.com/2010/01/amazons-70-royalty.html\" rel=\"nofollow external\" title=\"External link\">Tor is paying its authors</a>, the customary 10(5K)-12.5(5K)-15% on hardcovers, and <a href=\"http://www.rachellegardner.com/2010/12/royalty-rates/\">8% on audio books</a>, his royalty revenues under the traditional publishing model he is defending so vigorously are likely in the vicinity of the following:</br></br></p><p>Ebook: $59,870.62<br> Hardcover: $90,479.22<br> <u>Audiobook: $27,144.77</u><br> Total royalties: <b>$177,494.61</b></br></br></br></p><p>That’s excellent performance by any measure, almost surely in excess of whatever advance he received for <i>Redshirts</i>.  One must congratulate Scalzi on his ability to write fiction that people want to buy, regardless of what one thinks of the man or the fiction.  However, one also has to seriously question his financial acumen, because if he had the very sort of publishing deal that he is claiming is so dreadful and indefensible, he would have done considerably better.</p><p>Let’s be realistic and assume that in addition to the revenue-sharing model, his contract contains an amount of chargeable overhead as many of these 50/50 contracts do.  The largest of which I am aware permitted the publisher to charge the author up to a maximum of $10,000 from the author’s royalties.  Based on the same channel discount structure as above, but this time splitting the resulting revenue equally between Tor and the author results in the following figures:</p><p>Ebook: $149,676.57<br> Hardcover: $165,942.45<br> <u>Audiobook: $84,827.40</u><br> Total royalties: $400,446.42<br> <u>(less overhead charge $10,000)</u><br> Net author revenue: <b>$390,446.42.  </b></br></br></br></br></br></p><p>In other words, Scalzi has already thrown away $212,951.81 in additional royalty revenue due to his insistence on an advance and his inability to understand that the no-advance, 50/50 revenue-sharing model is not intrinsically unfair, disadvantageous to the writer, or predatory.  In fact, if he wasn’t such an angry and short-sighted fool, he would go to Tor and very politely ask them to publish his future books under the very no-advance model he is so vigorously decrying.  As it stands, every dollar he henceforth collects from Tor on <i>Redshirts </i>represents $2.55 (and counting) that he would have received had he the courage and foresight to accept the risk of foregoing a pre-payment on his royalties.</p><p>No doubt some authors believe that it is a good idea to heed the advice of a successful author when it comes to book contracts.  And that is quite often true.  But is it really a good idea to avoid no-advance, 50/50 publishing deals on the advice of an author dumb enough to hand over 54.5 percent of his potential royalties to the publisher for nothing more than the privilege of collecting part of the income beforehand?</p><p>UPDATE:  John Scalzi demonstrates that he not only can’t do math, <a href=\"http://whatever.scalzi.com/2013/03/10/new-writers-ebook-publishers-and-the-power-to-negotiate/#comment-448614\">he can’t read either</a>:</p><blockquote class=\"tr_bq\"><p> The<br> fellow in question has no idea how my contract is structured, so he<br> hasn’t the slightest idea what I’m making. I will say his estimates<br> amuse me. His estimates about production and marketing costs likewise<br> suggest a profound ignorance of the real world (that $10,000 would have<br> covered this for a week, at most). Additionally, if the fellow is trying<br> to use the example of an outlier (i.e., a bestselling author with a<br> large and healthy following) in an overly-simplistic “all other things<br> being equal” sort of comparison, grounded in bad numbers, to show why<br> these sorts of contracts might be beneficial to other writers,<br> particularly new writers, then he’s, at best, once again letting his<br> need to get his mancrush on get in the way of clear and rational<br> thinking, or useful advice to other authors.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>Ignorant and<br> mendacious is not a great combination, basically. And that’s all I will<br> say about that. It’s nice he’s still making money for those various<br> organizations, however.</br></br></br></p><p>As noted here, I have no problems with<br> authors choosing not to take advances — or making any other sort of<br> contractual maneuvers they choose — when the author has decided that it<br> is in his or her own best interests to do so, based on several factors.<br> This is manifestly different from the publisher having “no advances” as<br> its default setting. Anyone who doesn’t recognize the difference between<br> those two probably should not be dispensing career advice to anyone<br> else.</br></br></br></br></br></br></br></p></blockquote><p>First, Scalzi is attempting to have it both<br> ways here.  I cited the standard royalty rates for ebooks, hardcovers,<br> and audio books from Tor Books in doing my calculations.  It is entirely<br> possible that as one of their leading authors, he gets better royalty<br> rates from them, although I very much doubt he is getting the 50 percent<br> royalties that Hydra is offering or that I get from my publishers.  The<br> numbers are not bad, they are standard and other writers, particularly<br> new writers, are not likely to get better royalty rates than those I<br> cited.</br></br></br></br></br></br></br></br></p><p>They are certainly more relevant than the numbers<br> that John is keeping to himself, which is certainly his right, but to which he<br> cannot reasonably appeal.  And, insofar as his royalties depart from those that new writers will receive he is making the very outlier mistake that he<br> erroneously accuses me of making.</br></br></br></p><p>Furthermore, I said absolutely<br> nothing about “production and marketing costs”, but rather, referred to<br> a fixed amount that is expected to help cover the publisher’s overhead<br> costs involved in publishing the book.  In my various book contracts,<br> that fixed amount ranges from zero to $10,000 and comes out of my 50<br> percent share.  Far from showing any “profound ignorance of the real<br> world”, it simply showed Scalzi’s lack of reading ability and<br> unfamiliarity with the revenue-sharing model.</br></br></br></br></br></br></br></p><p>Notice that he is backing down now that his argument has been exposed as ridiculous and materially self-defeating.  Suddenly the problem isn’t “no advances”,  but “no advances as its default setting”.</p><p>UPDATE II: The little rabbits actually manage to make Scalzi’s inept response look downright intelligent when they try to weigh in:<br> <i><br/></i><br> <i>“Claiming that 10000 USD cover all the expenses involved in marketing and<br> producing Redshirts (Posters. Book tours. Wil Wheaton. Cover designs.<br> Typesetting. Editing. Proofreading.) is so fallacious that it renders<br> every other point invalid.”</br></br></br></i></br></br></p><p>Well, I suppose it might if anyone had ever made such a stupid and fallacious claim.  But no one did anything of the sort, least of all me.<i><br/></i></p></div>",
  "content_text": "John Scalzi doubles down, not only in terms of jacking up his levels of emotion, irrationality, and vulgarity, but by\nexpanding his attack on Random House\nto include ALL publishers who utilize a no-advance model:\nSo why are so many eBook-only publishers attempting to run with the “no advances” business model? If I had to guess, I would say because many of these then-erstwhile publishers assumed that publishing electronically had a low financial threshold of entry (not true, if you’re serious about it) and they fancied being publishers, so they started their businesses undercapitalized, and are now currently in the process of passing the consequences of that undercapitalization unto the authors they would like to work with. Alternately, as appears to be the case with Random House, they’re looking for a way to pass as much of the initial cost of publishing onto the author as possible, and one of the best ways to bring down those initial costs is to avoid paying the author anything up front. Both of these are bad business models, although one is more maliciously so, and both are to be avoided. Just because someone has stupidly or maliciously planned their business, doesn’t mean you’re obliged to sign a contract with them.\nBut, these publishers and their defenders may say (and have said), the publisher takes all the risk in producing a book! Yeah? Hey, to publishers and their defenders who say that: Fuck you. Fuck you for asserting that the author has shouldered no risk, when she’s invested the time, opportunity cost and material outlay required to create a manuscript. Fuck you for asserting the the author sees no risk to her own career from the choices that the publisher imposes on the publishing process that the author has no control of: everything from cover art (which, if horrible and/or out of step with the market, can sink a book) to the size and distribution of the initial print run, to the marketing plan the publisher has for retail.\nFuck you for lightly passing over the risk that the author has if the book fails — that any additional books in the contract might be cancelled or put out with the bare minimum of contractual obligation, that the author might not be able to sell another book to the publisher or other publishers because of a track record of poor sales — and for lightly passing over the fact the a publisher mitigates its own risk of the failure of a single book by having an entire portfolio of releases. If one single book fails but the publisher’s line holds up generally, then the risk the publisher encounters to its livelihood is minimal. The risk to the author, on the other hand, is substantially greater. Yes, to all of that, “fuck you,” is probably the politest thing to say in response.\nNow, I could certainly point out that this is an incredibly stupid, unprofessional, and irresponsible thing to do, especially in light of how the Guardian has already mistaken one of his previous posts on the subject\nfor the SFWA’s position\n.  So, given the dedicated journalistic commitment to calm and reasonable discourse, it would not be a surprise if we soon see headlines of this sort: SFWA To All Publishers: “FUCK YOU”.\nHowever, I think that’s all readily apparent.  Being an Award-Winning Cruelty Artist, I happen to find it much more amusing to demonstrate that Scalzi simply doesn’t know what he’s talking about, and moreover, to show that his observed inability to understand the potential benefits of the no-advance, revenue-share system has already cost him hundreds of thousands of dollars in 2012 alone.\nScalzi\nhas publicly stated\nthat Tor sold\n35,667 eBook versions of\nRedshirts\nat $11.99, 17,008 audiobooks at $19.95 and 26,604 hardcovers at $24.95.  If we assume that he gets the\nstandard 20% royalty on ebooks that Tor author Robert Sawyer says\nTor is paying its authors\n, the customary 10(5K)-12.5(5K)-15% on hardcovers, and\n8% on audio books\n, his royalty revenues under the traditional publishing model he is defending so vigorously are likely in the vicinity of the following:\nEbook: $59,870.62\nHardcover: $90,479.22\nAudiobook: $27,144.77\nTotal royalties:\n$177,494.61\nThat’s excellent performance by any measure, almost surely in excess of whatever advance he received for\nRedshirts\n.  One must congratulate Scalzi on his ability to write fiction that people want to buy, regardless of what one thinks of the man or the fiction.  However, one also has to seriously question his financial acumen, because if he had the very sort of publishing deal that he is claiming is so dreadful and indefensible, he would have done considerably better.\nLet’s be realistic and assume that in addition to the revenue-sharing model, his contract contains an amount of chargeable overhead as many of these 50/50 contracts do.  The largest of which I am aware permitted the publisher to charge the author up to a maximum of $10,000 from the author’s royalties.  Based on the same channel discount structure as above, but this time splitting the resulting revenue equally between Tor and the author results in the following figures:\nEbook: $149,676.57\nHardcover: $165,942.45\nAudiobook: $84,827.40\nTotal royalties: $400,446.42\n(less overhead charge $10,000)\nNet author revenue:\n$390,446.42.\nIn other words, Scalzi has already thrown away $212,951.81 in additional royalty revenue due to his insistence on an advance and his inability to understand that the no-advance, 50/50 revenue-sharing model is not intrinsically unfair, disadvantageous to the writer, or predatory.  In fact, if he wasn’t such an angry and short-sighted fool, he would go to Tor and very politely ask them to publish his future books under the very no-advance model he is so vigorously decrying.  As it stands, every dollar he henceforth collects from Tor on\nRedshirts\nrepresents $2.55 (and counting) that he would have received had he the courage and foresight to accept the risk of foregoing a pre-payment on his royalties.\nNo doubt some authors believe that it is a good idea to heed the advice of a successful author when it comes to book contracts.  And that is quite often true.  But is it really a good idea to avoid no-advance, 50/50 publishing deals on the advice of an author dumb enough to hand over 54.5 percent of his potential royalties to the publisher for nothing more than the privilege of collecting part of the income beforehand?\nUPDATE:  John Scalzi demonstrates that he not only can’t do math,\nhe can’t read either\n:\nThe\nfellow in question has no idea how my contract is structured, so he\nhasn’t the slightest idea what I’m making. I will say his estimates\namuse me. His estimates about production and marketing costs likewise\nsuggest a profound ignorance of the real world (that $10,000 would have\ncovered this for a week, at most). Additionally, if the fellow is trying\nto use the example of an outlier (i.e., a bestselling author with a\nlarge and healthy following) in an overly-simplistic “all other things\nbeing equal” sort of comparison, grounded in bad numbers, to show why\nthese sorts of contracts might be beneficial to other writers,\nparticularly new writers, then he’s, at best, once again letting his\nneed to get his mancrush on get in the way of clear and rational\nthinking, or useful advice to other authors.\nIgnorant and\nmendacious is not a great combination, basically. And that’s all I will\nsay about that. It’s nice he’s still making money for those various\norganizations, however.\nAs noted here, I have no problems with\nauthors choosing not to take advances — or making any other sort of\ncontractual maneuvers they choose — when the author has decided that it\nis in his or her own best interests to do so, based on several factors.\nThis is manifestly different from the publisher having “no advances” as\nits default setting. Anyone who doesn’t recognize the difference between\nthose two probably should not be dispensing career advice to anyone\nelse.\nFirst, Scalzi is attempting to have it both\nways here.  I cited the standard royalty rates for ebooks, hardcovers,\nand audio books from Tor Books in doing my calculations.  It is entirely\npossible that as one of their leading authors, he gets better royalty\nrates from them, although I very much doubt he is getting the 50 percent\nroyalties that Hydra is offering or that I get from my publishers.  The\nnumbers are not bad, they are standard and other writers, particularly\nnew writers, are not likely to get better royalty rates than those I\ncited.\nThey are certainly more relevant than the numbers\nthat John is keeping to himself, which is certainly his right, but to which he\ncannot reasonably appeal.  And, insofar as his royalties depart from those that new writers will receive he is making the very outlier mistake that he\nerroneously accuses me of making.\nFurthermore, I said absolutely\nnothing about “production and marketing costs”, but rather, referred to\na fixed amount that is expected to help cover the publisher’s overhead\ncosts involved in publishing the book.  In my various book contracts,\nthat fixed amount ranges from zero to $10,000 and comes out of my 50\npercent share.  Far from showing any “profound ignorance of the real\nworld”, it simply showed Scalzi’s lack of reading ability and\nunfamiliarity with the revenue-sharing model.\nNotice that he is backing down now that his argument has been exposed as ridiculous and materially self-defeating.  Suddenly the problem isn’t “no advances”,  but “no advances as its default setting”.\nUPDATE II: The little rabbits actually manage to make Scalzi’s inept response look downright intelligent when they try to weigh in:\n“Claiming that 10000 USD cover all the expenses involved in marketing and\nproducing Redshirts (Posters. Book tours. Wil Wheaton. Cover designs.\nTypesetting. Editing. Proofreading.) is so fallacious that it renders\nevery other point invalid.”\nWell, I suppose it might if anyone had ever made such a stupid and fallacious claim.  But no one did anything of the sort, least of all me.",
  "tags": [
    "McRapey",
    "SFWA",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-11T10:10:00+00:00"
}