{
  "url": "https://voxday.net/2013/03/11/inflation-vs-deflation-vii_11/",
  "scraped_at": "2025-12-14T22:22:45.478617",
  "title": "Inflation vs deflation VII",
  "date_display": "March 11, 2013",
  "date_iso": "2013-03-11T20:16:00+00:00",
  "date_from_url": "2013-03-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nate responds with post entitled <a href=\"http://bloggerblaster.blogspot.ch/2013/03/the-great-debate-half-truism_11.html\">“Half-Truism”</a>:<i> </i></p><blockquote class=\"tr_bq\"><p> <i>“There are those who say that he cure for inflation is deflation.<br>  And… there are those, though they are few, who say that the cure for<br> the man who has been run over by a motorcar, is to have the same<br> motorcar run over him in the opposite direction.” </br></br></br></i><br> – Ludwig Von Mises, “Lecture on Inflation”, 1968</br></p><p>Broad definition…  narrow<br> definition…  it is readily apparent the<br> broader definition is what I am referring to here. But one must remember that I<br> am actually no longer using Mises’ definitions at all. I am defining money as<br> it relates to the commodity competition… not its nature.  I call it fiat money not because it has<br> government force behind it, but because it is that government force that makes<br> the commodity win the commodity competition and therefore become the<br> money.  Credit money doesn’t exist at all<br> in physical form and thus doesn’t compete in the competition and is not<br> actually money. </br></br></br></br></br></br></br></br></br></p><p>As you have noticed by now these responses are coming slower<br> and slower.  That’s because, by the very<br> nature of the problem, as we drill down, more and more remedial teaching is<br> required.   There is a knowledge base<br> that is required to understand these points… and we must first make sure the<br> reader has it.</br></br></br></br></br></p></blockquote><p>I shall respond to this within the next day or three, as before.</p></div>",
  "content_text": "Nate responds with post entitled\n“Half-Truism”\n:\n“There are those who say that he cure for inflation is deflation.\nAnd… there are those, though they are few, who say that the cure for\nthe man who has been run over by a motorcar, is to have the same\nmotorcar run over him in the opposite direction.”\n– Ludwig Von Mises, “Lecture on Inflation”, 1968\nBroad definition…  narrow\ndefinition…  it is readily apparent the\nbroader definition is what I am referring to here. But one must remember that I\nam actually no longer using Mises’ definitions at all. I am defining money as\nit relates to the commodity competition… not its nature.  I call it fiat money not because it has\ngovernment force behind it, but because it is that government force that makes\nthe commodity win the commodity competition and therefore become the\nmoney.  Credit money doesn’t exist at all\nin physical form and thus doesn’t compete in the competition and is not\nactually money.\nAs you have noticed by now these responses are coming slower\nand slower.  That’s because, by the very\nnature of the problem, as we drill down, more and more remedial teaching is\nrequired.   There is a knowledge base\nthat is required to understand these points… and we must first make sure the\nreader has it.\nI shall respond to this within the next day or three, as before.",
  "tags": [
    "debate",
    "economics",
    "inflation"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-11T20:16:00+00:00"
}