{
  "url": "https://voxday.net/2013/03/08/inflation-vs-deflation-vii/",
  "scraped_at": "2025-12-14T22:22:29.880156",
  "title": "Inflation vs Deflation VII",
  "date_display": "March 8, 2013",
  "date_iso": "2013-03-08T16:41:00+00:00",
  "date_from_url": "2013-03-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In his post entitled <a href=\"http://bloggerblaster.blogspot.com/2013/03/the-great-debate-fiat-or-shenanigans.html\">Fiat or Shenanigans</a>, Nate contested the idea that US money is credit money and not fiat money with the characteristics of credit money:</p><blockquote class=\"tr_bq\"><p> Remember I said our money was fiat money… with characteristics of credit money.  Right?  Vox says I am wrong about that.  And… while I considered rushing off to donate some money to an unrelated charity in his name and make a video about it…  instead… I just decided I would address his well made point like an adult…  mostly…</p><p>Vox said: <i>“Nate’s first mistake is the identification of credit money as fiat money, even though he clearly has his suspicions concerning the problematic nature of the distinction as it applies to the US monetary system.  That this distinction is false can be demonstrated in two ways, first with a legitimate appeal to authority and history, and second by the money creation process.”</i></p><p>He then provides a quote from Mises, that I agree, does indeed say that fiat money doesn’t yet exist and probably hasn’t existed.  Vox appeals to Mises who appeals to history.   And Nate points out… well shit…  this book was written in 1912…  it appears we have some more history to investigate before that holds water doesn’t it?  Well lets look at this new history then… especially… recent history.</p><p>Say what does our buddy Murray have to say about fiat money?</p><p>“Under a fiat money standard, governments (or their central banks) may obligate themselves to bail out, with increased issues of standard money, any bank or any major bank in distress. In the late nineteenth century, the principle became accepted that the central bank must act as the “lender of last resort”, which will lend money freely to banks threatened with failure. Another recent American device to abolish the confidence limitation on bank credit is “deposit insurance”, whereby the government guar­antees to furnish paper money to redeem the banks’ demand li­abilities. These and similar devices remove the market brakes on rampant credit expansion.”</p></blockquote><p> While the quote from Mises does date back to the 1912 text, Mises himself lived until 1973 and witnessed all of the innovations mentioned, even the removal of the convertibility to gold by President Nixon.  I am not aware of any point at which he changed his opinion on this matter, nor does Nate suggest that he did.</p><p>Given the fact that the FDIC’s deposit insurance observably does not take the form of paper money being furnished to redeem the failing banks’ demand liabilities, but rather transfers those liabilities to other banks in the system without any paper money at all being furnished to anyone, I think it is safe to conclude that Murray does not have a sufficient grasp on the difference between fiat money and credit money for his statements to be relevant here.  Moreover, the statement that the central bank is “the lender of last resort” itself tends to underline the fact that the “deposits” are, in fact, credit and not pure fiat.  The central bank is not actually “lending money” to banks under duress, it is merely inflating the amount of credit at their disposal.</p><p>Recall that when you make a payment from your ebanking account, the bank declares it will make the payment “provided there is sufficient credit” on your account.  It’s all credit, both in electronic form and paper form.</p><p>Nate continues:</p><blockquote class=\"tr_bq\"><p> Are we done?  No… no no no… we’re along way from done.   Remember.. Mises characterized fiat money by legal privilege.  Legal Privilege?   Consult the MisesWiki!  According to Hülsmann, there are four groups of legal privileges granted by the state (usually more than one is granted):</p><ol><li>legalized counterfeiting – the promises of banks are allowed to be more “elastic”. For example, a coin marked “an ounce of gold” will be allowed to have any amount of gold or none, and can have any meaning. Banknotes were named “promises to pay”, but were obscure on the details.</li><li> monopoly – only some monetary products may be produced by law, like a specific metal; or only the banknotes or coins of a certain bank. This limits the freedom of choice of users of money and benefits the producers and first recipients at the detriment of others.</li><li>legal tender is a money, that must be accepted in exchanges under a predefined price. Some monies may be driven out of the market due to Gresham’s Law.</li><li> legalized suspension of payments allows banks to avoid paying their obligations, while receiving payments from their debtors. If a bank is freed from contractual obligations to redeem its money and it is also legal tender, its banknotes become genuine paper money. With legal privileges are the banks allowed to behave more irresponsibly, which increases moral hazard.</li></ol></blockquote><p>Here we get to the crux of Nate’s error.  Nate is correct to point out that the Federal Reserve’s credit money is declared to be legal tender and is legally privileged by the federal government.  In this sense, he is correct in saying that the US monetary system is fiat money.  However, this only is the wider sense in which the Mises Institute <a href=\"http://wiki.mises.org/wiki/Fiat_money\">defines the term</a>:</p><p><i>Often called paper money, fiat money is in a wider sense any money declared to be legal tender by government fiat (ie law). In the narrower sense used here, fiat money is an intrinsically useless good used as a means of payment and a storable object.</i></p><p>The narrower sense of fiat money is clearly the sense Mises was using the term when he declared “most of those kinds of money that are not commodity money must be classified as credit money” and questioned whether fiat money had ever existed.  And that narrower sense cannot possibly apply to the Federal Reserve notes, as most “dollars” are a) not a good, useless or otherwise, b) not a storable object, and c) not a risk-free convertible claim to real money.</p><p>Nate would be correct to claim credit money is fiat money in the wider sense, but then, I completely agree with that.  I am simply declaring that US currency is credit money that is not fiat money in the narrower sense.  Nate is incorrect to say that it is fiat money in the narrower sense, which is the sense that most people believe it to be.  Nate continues:</p><blockquote class=\"tr_bq\"><p> Now are we done?  Well… not really.  Because what I’ve done here isn’t intellectually honest, in the sense that I have not represented the whole of Vox’s point.  The reason I hated Chapter three is not because of confusing terms like fiduciary media.  Its because Credit Money itself is a category error.</p><p>Credit money is a description of leverage. But…  Leverage can be applied to all types of money….  Thus… Credit Money… is a subcategory.  Credit Money is what happens when you take money of any other type.. and then leverage it up for lending purposes….  Leverage is something that happens to Money Types.  It isn’t a money type itself.  Its like including cancer cells in a discussion of  human  cells because they form in the human body.  Cancer cells aren’t human cells.</p><p>We must always go back to competition.</p><p>Money is money because of the constant commodity competition   Every day the competition is on going… and every day one commodity is winning.  that one commodity that is winning… is the money.   The money types… are explanations of WHY the competition is being won.  Fiat money is fiat money because the government helped it win artificially and it wouldn’t have won otherwise.  Take away the government advantage… and its not the money anymore. Commodity money types?  Well they have no artificial government advantage.</p><p>That is the true definition of sound money.</p><p>Its money that wins the competition… every minute of every day…  the on going competition… not some past competition .. on its own without aid of the government.</p><p>All modern paper currencies are fiat money.</p><p>The bits that are loaned into creation from thin air?  Those are credit money too… but it is dishonest to ignore the fact that it is fiat money as well.  Loans may have created the individual dollar bills… but those dollar bills wouldn’t be money… if it wasn’t Fiat.</p><p>May God have Mercy on my soul…   Ludwig Von Mises… was wrong.  You cannot disregard the fiat nature of the original money… just because most of it was created through leverage.</p><p>So Fiat?  Shenanigans?</p><p>The answer is both.  Not one.  Not the other.   Both.  To fail to grasp that… will totally blind you to the inherit problems of our current economic system.  The money is fiat money and credit money.. because much of which was created via leverage… but also much of it was created through counterfeiting.   This is why I created the word “clusterfutastrophe” while attempting to parse the US money supply.</p></blockquote><p>Nate is stumbling towards the truth here, which is that credit money is fiat money in the wider sense but not the narrower one, but is still stumbling.  He is still hung up on the basic concept of credit money, which is why he erroneously calls it a category error.  What he is failing to grasp is the central importance of credit in the monetary process, one which precedes the role that government plays in either guaranteeing the credit claims or establishing the legal privilege of those claims.</p><p>“When all exchanges have to be settled in ready cash, then the possibility of performing them by means of cancellation is limited to the case exemplified by the butcher and baker and only then on the assumption, which of course only occasionally hold good, that the demands of both parties are simultaneous. At the most, it is possible to imagine that several other persons might join in and so a small circle be built up within which drafts could be used for the settlement of transactions without the actual use of money. But even in this case simultaneity would still be necessary, and, several persons being involved, would be still seldomer achieved.</p><p>These difficulties could not be overcome until credit set business free from dependence on the simultaneous occurrence of demand and supply. This, in fact, is where the importance of credit for the monetary system lies. But this could not have its full effect so long as all exchange was still direct exchange, so long even as money had not established itself as a common medium of exchange. The instrumentality of credit permits transactions between two persons to be treated as simultaneous for purposes of settlement even if they actually take place at different times”<br>  – Mises, <i>The Theory of Money and Credit</i>, p. 282</br></p><p>The important aspect of credit is not its ability to be leveraged, which is a consequence of the characteristics of money rather than an integral aspect of credit, but rather its ability to transcend time.  It is the fact that the credit is a claim to money rather than to some other commodity that permits its expansion beyond the existing money supply.</p><p>“A person who has a thousand loaves of bread at his immediate disposal will not dare to issue more than a thousand tickets each of which gives its holder the right to demand at any time the delivery of a loaf of bread. It is otherwise with money…. The fact that is peculiar to money alone is not that mature and secure claims to money are as highly valued in commerce as the sums of money to which they refer, but rather that such claims are complete substitutes for money, and, as such, are able to fulfil all the functions of money in those markets in which their essential characteristics of maturity and security are recognized. It is this circumstance that makes. it possible to issue more of this sort of substitute than the issuer is always in a position to convert.  And so the fiduciary medium comes into being in addition to the money certificate. Fiduciary media increase the supply of money in the broader sense of the word; they are consequently able to influence the objective<br> exchange-value of money.”<br>  – Mises, <i>The Theory of Money and Credit</i>, p. 267</br></br></p><p>Note that the credit aspect not only predates the broader fiat aspects, but is, in fact, intrinsically necessary for the eventual expansion.  Nate concludes with a question</p><blockquote class=\"tr_bq\"><p> Its not that there is no money.   I already explained that there is always money.  Money…is like energy.  It cannot ever be destroyed.  It can change forms… its velocity can change.  But it cannot be destroyed.  The problem is… our system is so screwed up through fiat and leverage… that we can’t even measure the money supply any more.  Come Vox… be sensible… you’re absolutely right to point out that the leverage can’t be ignored… but you were wrong to suggest that the fiat aspects can.  Now tell us Vox…  What IS the best way to measure the abomination posing as the US money supply?  He asked knowingly…</p></blockquote><p>First, I’ll point out that since we have a system “in which the actual transfer of money has been completely superseded by fiduciary media”, it doesn’t matter that we can’t measure the money supply anymore.  Because we’re no longer using actual money, we are merely using possibility of money in order to support the extensive system of potential claims to theoretical future money.  Or, as Nate rightly calls it, a financial abomination.  As strange as this sounds, it was anticipated at least 101 years ago, as Mises notes:</p><p>“Use is made of money, but not physical use of actually existing money or money substitutes. Money which is not present performs an economic function; it has its effect solely by reason of the possibility of its being able to be present.”</p><p>In answer to Nate’s question, the best way is to measure the sum total of all the current outstanding claims.  This is approximated in the Federal Reserve’s Z1 Flow of Funds Accounts, specifically the L1 credit market debt outstanding report.  And it is the expansion of this supply, though not strictly speaking “inflation” per se, that effects exchange value and therefore the prices of goods and services.</p></div>",
  "content_text": "In his post entitled\nFiat or Shenanigans\n, Nate contested the idea that US money is credit money and not fiat money with the characteristics of credit money:\nRemember I said our money was fiat money… with characteristics of credit money.  Right?  Vox says I am wrong about that.  And… while I considered rushing off to donate some money to an unrelated charity in his name and make a video about it…  instead… I just decided I would address his well made point like an adult…  mostly…\nVox said:\n“Nate’s first mistake is the identification of credit money as fiat money, even though he clearly has his suspicions concerning the problematic nature of the distinction as it applies to the US monetary system.  That this distinction is false can be demonstrated in two ways, first with a legitimate appeal to authority and history, and second by the money creation process.”\nHe then provides a quote from Mises, that I agree, does indeed say that fiat money doesn’t yet exist and probably hasn’t existed.  Vox appeals to Mises who appeals to history.   And Nate points out… well shit…  this book was written in 1912…  it appears we have some more history to investigate before that holds water doesn’t it?  Well lets look at this new history then… especially… recent history.\nSay what does our buddy Murray have to say about fiat money?\n“Under a fiat money standard, governments (or their central banks) may obligate themselves to bail out, with increased issues of standard money, any bank or any major bank in distress. In the late nineteenth century, the principle became accepted that the central bank must act as the “lender of last resort”, which will lend money freely to banks threatened with failure. Another recent American device to abolish the confidence limitation on bank credit is “deposit insurance”, whereby the government guar­antees to furnish paper money to redeem the banks’ demand li­abilities. These and similar devices remove the market brakes on rampant credit expansion.”\nWhile the quote from Mises does date back to the 1912 text, Mises himself lived until 1973 and witnessed all of the innovations mentioned, even the removal of the convertibility to gold by President Nixon.  I am not aware of any point at which he changed his opinion on this matter, nor does Nate suggest that he did.\nGiven the fact that the FDIC’s deposit insurance observably does not take the form of paper money being furnished to redeem the failing banks’ demand liabilities, but rather transfers those liabilities to other banks in the system without any paper money at all being furnished to anyone, I think it is safe to conclude that Murray does not have a sufficient grasp on the difference between fiat money and credit money for his statements to be relevant here.  Moreover, the statement that the central bank is “the lender of last resort” itself tends to underline the fact that the “deposits” are, in fact, credit and not pure fiat.  The central bank is not actually “lending money” to banks under duress, it is merely inflating the amount of credit at their disposal.\nRecall that when you make a payment from your ebanking account, the bank declares it will make the payment “provided there is sufficient credit” on your account.  It’s all credit, both in electronic form and paper form.\nNate continues:\nAre we done?  No… no no no… we’re along way from done.   Remember.. Mises characterized fiat money by legal privilege.  Legal Privilege?   Consult the MisesWiki!  According to Hülsmann, there are four groups of legal privileges granted by the state (usually more than one is granted):\nlegalized counterfeiting – the promises of banks are allowed to be more “elastic”. For example, a coin marked “an ounce of gold” will be allowed to have any amount of gold or none, and can have any meaning. Banknotes were named “promises to pay”, but were obscure on the details.\nmonopoly – only some monetary products may be produced by law, like a specific metal; or only the banknotes or coins of a certain bank. This limits the freedom of choice of users of money and benefits the producers and first recipients at the detriment of others.\nlegal tender is a money, that must be accepted in exchanges under a predefined price. Some monies may be driven out of the market due to Gresham’s Law.\nlegalized suspension of payments allows banks to avoid paying their obligations, while receiving payments from their debtors. If a bank is freed from contractual obligations to redeem its money and it is also legal tender, its banknotes become genuine paper money. With legal privileges are the banks allowed to behave more irresponsibly, which increases moral hazard.\nHere we get to the crux of Nate’s error.  Nate is correct to point out that the Federal Reserve’s credit money is declared to be legal tender and is legally privileged by the federal government.  In this sense, he is correct in saying that the US monetary system is fiat money.  However, this only is the wider sense in which the Mises Institute\ndefines the term\n:\nOften called paper money, fiat money is in a wider sense any money declared to be legal tender by government fiat (ie law). In the narrower sense used here, fiat money is an intrinsically useless good used as a means of payment and a storable object.\nThe narrower sense of fiat money is clearly the sense Mises was using the term when he declared “most of those kinds of money that are not commodity money must be classified as credit money” and questioned whether fiat money had ever existed.  And that narrower sense cannot possibly apply to the Federal Reserve notes, as most “dollars” are a) not a good, useless or otherwise, b) not a storable object, and c) not a risk-free convertible claim to real money.\nNate would be correct to claim credit money is fiat money in the wider sense, but then, I completely agree with that.  I am simply declaring that US currency is credit money that is not fiat money in the narrower sense.  Nate is incorrect to say that it is fiat money in the narrower sense, which is the sense that most people believe it to be.  Nate continues:\nNow are we done?  Well… not really.  Because what I’ve done here isn’t intellectually honest, in the sense that I have not represented the whole of Vox’s point.  The reason I hated Chapter three is not because of confusing terms like fiduciary media.  Its because Credit Money itself is a category error.\nCredit money is a description of leverage. But…  Leverage can be applied to all types of money….  Thus… Credit Money… is a subcategory.  Credit Money is what happens when you take money of any other type.. and then leverage it up for lending purposes….  Leverage is something that happens to Money Types.  It isn’t a money type itself.  Its like including cancer cells in a discussion of  human  cells because they form in the human body.  Cancer cells aren’t human cells.\nWe must always go back to competition.\nMoney is money because of the constant commodity competition   Every day the competition is on going… and every day one commodity is winning.  that one commodity that is winning… is the money.   The money types… are explanations of WHY the competition is being won.  Fiat money is fiat money because the government helped it win artificially and it wouldn’t have won otherwise.  Take away the government advantage… and its not the money anymore. Commodity money types?  Well they have no artificial government advantage.\nThat is the true definition of sound money.\nIts money that wins the competition… every minute of every day…  the on going competition… not some past competition .. on its own without aid of the government.\nAll modern paper currencies are fiat money.\nThe bits that are loaned into creation from thin air?  Those are credit money too… but it is dishonest to ignore the fact that it is fiat money as well.  Loans may have created the individual dollar bills… but those dollar bills wouldn’t be money… if it wasn’t Fiat.\nMay God have Mercy on my soul…   Ludwig Von Mises… was wrong.  You cannot disregard the fiat nature of the original money… just because most of it was created through leverage.\nSo Fiat?  Shenanigans?\nThe answer is both.  Not one.  Not the other.   Both.  To fail to grasp that… will totally blind you to the inherit problems of our current economic system.  The money is fiat money and credit money.. because much of which was created via leverage… but also much of it was created through counterfeiting.   This is why I created the word “clusterfutastrophe” while attempting to parse the US money supply.\nNate is stumbling towards the truth here, which is that credit money is fiat money in the wider sense but not the narrower one, but is still stumbling.  He is still hung up on the basic concept of credit money, which is why he erroneously calls it a category error.  What he is failing to grasp is the central importance of credit in the monetary process, one which precedes the role that government plays in either guaranteeing the credit claims or establishing the legal privilege of those claims.\n“When all exchanges have to be settled in ready cash, then the possibility of performing them by means of cancellation is limited to the case exemplified by the butcher and baker and only then on the assumption, which of course only occasionally hold good, that the demands of both parties are simultaneous. At the most, it is possible to imagine that several other persons might join in and so a small circle be built up within which drafts could be used for the settlement of transactions without the actual use of money. But even in this case simultaneity would still be necessary, and, several persons being involved, would be still seldomer achieved.\nThese difficulties could not be overcome until credit set business free from dependence on the simultaneous occurrence of demand and supply. This, in fact, is where the importance of credit for the monetary system lies. But this could not have its full effect so long as all exchange was still direct exchange, so long even as money had not established itself as a common medium of exchange. The instrumentality of credit permits transactions between two persons to be treated as simultaneous for purposes of settlement even if they actually take place at different times”\n– Mises,\nThe Theory of Money and Credit\n, p. 282\nThe important aspect of credit is not its ability to be leveraged, which is a consequence of the characteristics of money rather than an integral aspect of credit, but rather its ability to transcend time.  It is the fact that the credit is a claim to money rather than to some other commodity that permits its expansion beyond the existing money supply.\n“A person who has a thousand loaves of bread at his immediate disposal will not dare to issue more than a thousand tickets each of which gives its holder the right to demand at any time the delivery of a loaf of bread. It is otherwise with money…. The fact that is peculiar to money alone is not that mature and secure claims to money are as highly valued in commerce as the sums of money to which they refer, but rather that such claims are complete substitutes for money, and, as such, are able to fulfil all the functions of money in those markets in which their essential characteristics of maturity and security are recognized. It is this circumstance that makes. it possible to issue more of this sort of substitute than the issuer is always in a position to convert.  And so the fiduciary medium comes into being in addition to the money certificate. Fiduciary media increase the supply of money in the broader sense of the word; they are consequently able to influence the objective\nexchange-value of money.”\n– Mises,\nThe Theory of Money and Credit\n, p. 267\nNote that the credit aspect not only predates the broader fiat aspects, but is, in fact, intrinsically necessary for the eventual expansion.  Nate concludes with a question\nIts not that there is no money.   I already explained that there is always money.  Money…is like energy.  It cannot ever be destroyed.  It can change forms… its velocity can change.  But it cannot be destroyed.  The problem is… our system is so screwed up through fiat and leverage… that we can’t even measure the money supply any more.  Come Vox… be sensible… you’re absolutely right to point out that the leverage can’t be ignored… but you were wrong to suggest that the fiat aspects can.  Now tell us Vox…  What IS the best way to measure the abomination posing as the US money supply?  He asked knowingly…\nFirst, I’ll point out that since we have a system “in which the actual transfer of money has been completely superseded by fiduciary media”, it doesn’t matter that we can’t measure the money supply anymore.  Because we’re no longer using actual money, we are merely using possibility of money in order to support the extensive system of potential claims to theoretical future money.  Or, as Nate rightly calls it, a financial abomination.  As strange as this sounds, it was anticipated at least 101 years ago, as Mises notes:\n“Use is made of money, but not physical use of actually existing money or money substitutes. Money which is not present performs an economic function; it has its effect solely by reason of the possibility of its being able to be present.”\nIn answer to Nate’s question, the best way is to measure the sum total of all the current outstanding claims.  This is approximated in the Federal Reserve’s Z1 Flow of Funds Accounts, specifically the L1 credit market debt outstanding report.  And it is the expansion of this supply, though not strictly speaking “inflation” per se, that effects exchange value and therefore the prices of goods and services.",
  "tags": [
    "debate",
    "economics",
    "inflation"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-08T16:41:00+00:00"
}