{
  "url": "https://voxday.net/2013/03/22/inflation-vs-deflation-viii/",
  "scraped_at": "2025-12-14T22:23:45.795855",
  "title": "Inflation vs deflation VIII",
  "date_display": "March 22, 2013",
  "date_iso": "2013-03-22T11:41:00+00:00",
  "date_from_url": "2013-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As is probably becoming rapidly apparent, this debate over inflation vs deflation, despite its esoteric nature, is turning out to be much more practical and relevant than anyone would have previously imagined it to be. The events in Cyprus make this more a discussion of current events than a purely academic matter.  In his <a href=\"http://bloggerblaster.blogspot.com/2013/03/the-great-debate-half-truism_11.html\">most recent post on the subject</a>, Nate began with an admission concerning that we are both talking about the same definition of fiat in one sense of the term.</p><blockquote class=\"tr_bq\"><p>  Broad definition…  narrow<br> definition…  it is readily apparent the<br> broader definition is what I am referring to here. But one must remember that I<br> am actually no longer using Mises’ definitions at all. I am defining money as<br> it relates to the commodity competition… not its nature.  I call it fiat money not because it has<br> government force behind it, but because it is that government force that makes<br> the commodity win the commodity competition and therefore become the<br> money.  Credit money doesn’t exist at all<br> in physical form and thus doesn’t compete in the competition and is not<br> actually money.  </br></br></br></br></br></br></br></br></br></p></blockquote><p>Why he calls it fiat doesn’t really matter for the purposes of this debate.  However, while he is right to say that credit money is not actually money, (you may recall that I defined it as a “money surrogate”), he is incorrect in stating that it doesn’t exist in physical form.  It does exist; the paper dollars you hold in your pocket and the paper Euros that the depositors in Cyprus are presently unable to obtain are both representatives of a form of credit money.  Now it is true that the paper to mark all current credit claims are seldom, if ever, printed, this doesn’t change the fact that some of them are printed and that they are actual physical representations of the outstanding credit claims.</p><blockquote class=\"tr_bq\"><p> What is important to note… and what Vox is missing… is that<br> it when the credit money is created by time-shifting like this is not<br> considered inflationary.  The interest is<br> rewarding those who have saved, and it all washes out in the end.  The interest rate, which is the price of<br> time-shifting money, fluctuates as demand for time-shifting increases and<br> decreases… and that.. all by itself… mitigates the boom and bust cycle created<br> by the lending.  As more people borrow,<br> the price of borrowing goes up… bringing that number back down.  As fewer people borrow the price is lowered<br> so more will borrow… bringing the number of borrowers back up.  We find a happy medium where the interest<br> rate is moving around, but the purchasing power is relatively stable.  The risk banks take when leveraging money also<br> influence that price… which we call the interest rate. All of this works<br> together nicely.  Which is why when Mises<br> talks about inflation he always talks about government. </br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><div class=\"MsoNormal\"> This is indeed how it is supposed to work.  It is how economists are taught that it works.  But it doesn’t work this way and Nate is incorrect in stating that the creation of credit money is not inflationary.  There are several ways of demonstrating that this is the case.  The one I will utilize here is to look at the supply and demand curve and what happens when credit money is injected.<p>The creation of credit money always has an immediate effect on prices because it increases the applicable demand.  I shouldn’t need to draw any SD curves, as we can see the effect that expanded home loans had in the housing market, that increased student loans have on the price of tuition, and even in the health care market, where governments borrow the money that is used to pay for the “free” health care delivered to indigent patients.  No cash is being printed, and yet credit money is being created, transactions are taking place, and prices are rising.  While these effects are localized to the relevant markets I suspect the reason why economists historically failed to connect them to the broad increase in price levels that is usually described as inflation is because until relatively recently, it was not possible to obtain general, pre-approved credit for even the smallest transactions.</p></div><div class=\"MsoNormal\"> <br> The economists failed to anticipate either the “credit card” or the debit card, which allows the depositor to tap directly into the credit expansion system without the need to interfere with the expansion by withdrawing the physical debt markers.  And those few who did failed to grasp the full extent of the eventual consequences.  This is why the bankers and governments are so firmly against cash economies; it is actually less about control and tracking, (although obviously governments appreciate the potential benefits of the latter), but because a wholly digital system theoretically allows for unlimited credit expansion… from the traditional perspective.</br></div><blockquote class=\"tr_bq\"><div class=\"MsoNormal\"> That is how it is supposed to work.  And when its working like that… we can look<br> at the amount of money in a given account that exists above and beyond the<br> deposits in that account and we call it credit money.  Because it exists above and beyond the<br> deposits in the account, it has no physical representation.  The coins, or dollar bills, do not<br> exist.  I need you to be clear on<br> this.  I have a checking account with say…$45,000<br> in it.  If I go to the bank and ask them<br> for $45,000 in cash… they will laugh in my face.   However, debit cards are swiped, and the<br> credit money is accepted exactly like cash is accepted.  That is the miracle.  And it is a miracle… of faith.  </br></br></br></br></br></br></br></br></div></blockquote><div class=\"MsoNormal\"> The key phrase being “when it is working like that”.  Nate is correct on all the details here, except that he is still failing to recognize that it is ALL the money in a given account that is credit money, not merely “the amount of money in a given account that exists above and beyond the<br> deposits in that account”.  This should be abundantly clear in light of the Cypriot situation, where the banks cannot open because, despite their nominal billions on deposit, they have literally no paper markers left to give out even though there are numerous levels of government that are capable of declaring fiat markers to represent those credit claims.  The problem is not that there is no government to print the fiat, but rather, the fact that no one wants to be stuck with the underlying credit claims.</br></div><blockquote class=\"tr_bq\"><div class=\"MsoNormal\"> So now that we understand borrowing and lending we can<br> discuss what is wrong.  And what is wrong…<br> is the central bank.   Central banks<br> break the link between savers and lenders. <br> Rather than the deposits being the source that creates the leverage, you<br> now have a central bank that is merely using the deposits to rationalize its<br> decisions to expand credit.  The deposits<br> of savers are reduced to mere justification. <br>   </br></br></br></br></br></br></br></br></div><div class=\"MsoNormal\"></div><div class=\"MsoNormal\"> The central bank sits on high, and manipulates the interest<br> rate… which eliminates its ability to mitigate the booms and busts of the business<br> cycle.  Then on top of that… the evil<br> bastards then set themselves up as the Credit Gods… passing out credit as they see<br> fit… attempting to manage an economy every bit as much as the communists ever<br> did, and failing just as spectacularly.</br></br></br></br></br></div><div class=\"MsoNormal\"></div><div class=\"MsoNormal\"> If you get nothing else… I hope and pray you grasp<br> that.  </br></div></blockquote><div class=\"MsoNormal\"> I can’t argue with anything here, except to note that as has been demonstrated with MF Global, the deposits themselves are, quite literally and legally, loans from the depositor to the bank or fidiciary entity.</div><blockquote class=\"tr_bq\"><div class=\"MsoNormal\"> So if you have made it this far you now realize that the<br> money in your checking account doesn’t actually exist.  its not that the<br> banks just don’t keep that much cash stored.  There isn’t that much<br> cash in existence.  Not even close.  </br></br></br></div><div class=\"MsoNormal\"></div><div class=\"MsoNormal\"> So now that the terror has sunk in… what is the urge that<br> you’re squelching down right now?  Is it the urge to go borrow more money?  Or is it the urge… to go get your cash and<br> stick it under your bed?</br></br></div><div class=\"MsoNormal\"></div><div class=\"MsoNormal\"> Exactly.  And now you<br> see why Vox’s measure of the money supply is incorrect.   M1 is the real<br> money.  M2 and TSM2 are close approximations of the<br> purchasing power currently available… though obfuscated through<br> shenanigans.  Z1… well Z1..  Is just a measure of claims on money.  It<br> doesn’t reflect a limit on new future<br> claims.  At best it can serve as an<br> indicator of how much new credit money is being created.  Z1 will never<br> be able to show deflation.  That’s because Z1 doesn’t show a credit<br> limit…<br> it shows a credit balance.  See if I have<br> a $5000 credit limit on my credit card… and I owe $5000… then my credit<br> card is<br> showing up as $5000 on the Z1 report.  If<br> I pay my credit card down to a balance of $2000, then my credit card is<br> showing<br/> up as $2000 on Z1 which Vox would then say is a reduction in purchasing<br/> power<br/> of $3000.  This is incorrect.  My high credit is still $5000.  I can go<br/> spend that $3000 in credit money any<br/> time I want to.  Z1 is certainly a<br/> valuable tool, but it is a limited one.  Now…<br/> as has been said… one cannot print borrowers… so if the rate of credit<br/> growth<br/> is slowing, or going down instead of up it can mean bad things…for<br/> example the<br/> delivery system for new credit can be interrupted.  That said, if one<br/> considers the nature of the<br/> financial abomination that we have before us, I can certainly not fault<br/> Vox for<br/> going that way.  However, it is not where<br/> I go.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></div></blockquote><div class=\"MsoNormal\"> Here is where Nate begins to go more seriously awry.  M1 and M2 are not real money anymore than Z1 is, they are merely money substitutes whereas Z1 is a money surrogate that encompasses them both.  I recognize that Nate is not using the Misean definitions any longer, but I don’t see that his rationale for refusing to do so is necessarily justified or even relevant to determining the inflation/deflation question.  More importantly, his distinction between credit limit and credit outstanding is, if not necessarily false, entirely irrelevant.  It is only credit outstanding that matters; the “limit” is an entirely artificial one that, in this case, represents the extent to which the bank is willing to enable Nate to expand the credit supply.  But that’s not an actual limit in the sense that Nate’s decision to not use his potential credit or even to pay down his outstanding credit is, which is the limit I mentioned in <a href=\"http://www.milobookclub.com/2009/06/18/limits-of-demand/\">Limits of Demand</a> when I proposed it as an alternative mechanism for powering the Austrian Business Cycle.  Nor is there any macro credit limit; this is why Bernanke and the European Central Bank imagine, erreoneously, that they can expand it indefinitely as they see fit.</div><div class=\"MsoNormal\"> <br/> But, as we saw in 2008, outstanding credit can and will contract.  Even a slowed expansion of the sort we have seen since 2009 can have a deleterious effect on an economy which depends on a reliable 2.4 percent growth rate per quarter.</div><blockquote class=\"tr_bq\"><div class=\"MsoNormal\"> The whole reason credit money works, is<br/> because there is a faith-based link from that credit money directly to<br/> cash.  Thus, the money, right now, is cash.  What you’re seeing is<br/> precisely what happened<br/> in the Great Depression.  People wanted<br/> their cash.  They hid it inside walls and<br/> buried it in jars.  Banks collapsed destroying<br/> massive amounts of credit money, but folks still wanted their cash.  But<br/> Vox fails to recognize a critical<br/> underlying difference between then, and today. <br/> He looks at those in control… the government and the central bankers…<br/> and he sees them expanding credit.  He<br/> understands the system better than almost everyone, including the<br/> central<br/> bankers, and thus he uses that understanding to predict how the system<br/> will<br/> behave.  He expects it to behave the way<br/> it behaved in the 1930s. </div></blockquote><div class=\"MsoNormal\"> The link is stronger than Nate asserts.  These days, credit money is cash and cash is credit money.  And Nate also credits me with more confidence than I actually possess.  I know the system won’t behave the way it did in the 1930s, in fact, that is precisely what concerns me most.  Unlike before, the banks are not being permitted to collapse, which is why Z1 hasn’t collapsed yet either.  But the bad loans still exist even though they still haven’t been written off.  We are in strange and unpredictable waters here.</div><blockquote class=\"tr_bq\"><div class=\"MsoNormal\"> I have to take you back again to the competition which<br/> Vox , to his peril, ignores. So we have these commodities battling it<br/> out<br/> in a competition of demand.  Not supply.  Demand. <br/> The one most in demand wins and becomes the money.  The demand is the<br/> key.  People want that commodity.  They want it badly and everyone knows<br/> they<br/> want it badly.  So because everyone knows<br/> they want that commodity badly… everyone knows that they will be able<br/> to<br/> trade that commodity.  They have faith…<br/> faith friends… that they will be able to exchange that commodity in the<br/> future<br/> for other goods and services they require</div><div class=\"MsoNormal\"></div><div class=\"MsoNormal\"> That’s all good and well if we’re talking about something like<br/> Gold or Platinum or Silver.  People want<br/> it because of what it is… and what it is will not change.  But fiat money?  Well… they want it because of all manner of<br/> government related enhancements.  If it<br/> weren’t for those enhancements… they wouldn’t want it at all.  But those enhancements exist…  so long as<br/> the people have faith in that government. And that is why I define it as fiat<br/> money.</div></blockquote><p>I suspect Nate has made a fatal error here, because recent events show that faith in government, in the banking system, and even in cash itself is rapidly dissolving.  Everyone now understands that the Cypriot banks don’t have 7 billion cash euros in their vaults, but more importantly, they now also understand that the government can instantly make 10 percent of it disappear regardless of whether if it was in cash form or not.</p><p>And when money surrogates, money substitutes, or solid money itself disappears, that is a deflationary action.  Our continued differences of opinion notwithstanding, I think we’ve now covered sufficient theoretical ground that we can move on to the practical aspect of the debate, so I will conclude by asking Nate three questions. </p><ol><li>If the expected outcome is, as he suggests, inflationary, due to the central bank printing presses why has the European Central Bank not simply used the bank holiday to print the required 13.5 billion euros and allowed its customers to withdraw as much of it happens to suit them?  </li><li>Why is the ECB risking the Cypriot banking system, the wrath of the Russian depositors, and the fate of the European Union itself on these various schemes rather than simply printing the cash and permitting its withdrawal?</li><li>Imagine an American analog, where a bank with billions in deposits but already emptied of all its cash was simply shut down without the usual FDIC shell game of “transferring its deposits” to another bank.  Would this be a deflationary action?</li></ol></div>",
  "content_text": "As is probably becoming rapidly apparent, this debate over inflation vs deflation, despite its esoteric nature, is turning out to be much more practical and relevant than anyone would have previously imagined it to be. The events in Cyprus make this more a discussion of current events than a purely academic matter.  In his\nmost recent post on the subject\n, Nate began with an admission concerning that we are both talking about the same definition of fiat in one sense of the term.\nBroad definition…  narrow\ndefinition…  it is readily apparent the\nbroader definition is what I am referring to here. But one must remember that I\nam actually no longer using Mises’ definitions at all. I am defining money as\nit relates to the commodity competition… not its nature.  I call it fiat money not because it has\ngovernment force behind it, but because it is that government force that makes\nthe commodity win the commodity competition and therefore become the\nmoney.  Credit money doesn’t exist at all\nin physical form and thus doesn’t compete in the competition and is not\nactually money.\nWhy he calls it fiat doesn’t really matter for the purposes of this debate.  However, while he is right to say that credit money is not actually money, (you may recall that I defined it as a “money surrogate”), he is incorrect in stating that it doesn’t exist in physical form.  It does exist; the paper dollars you hold in your pocket and the paper Euros that the depositors in Cyprus are presently unable to obtain are both representatives of a form of credit money.  Now it is true that the paper to mark all current credit claims are seldom, if ever, printed, this doesn’t change the fact that some of them are printed and that they are actual physical representations of the outstanding credit claims.\nWhat is important to note… and what Vox is missing… is that\nit when the credit money is created by time-shifting like this is not\nconsidered inflationary.  The interest is\nrewarding those who have saved, and it all washes out in the end.  The interest rate, which is the price of\ntime-shifting money, fluctuates as demand for time-shifting increases and\ndecreases… and that.. all by itself… mitigates the boom and bust cycle created\nby the lending.  As more people borrow,\nthe price of borrowing goes up… bringing that number back down.  As fewer people borrow the price is lowered\nso more will borrow… bringing the number of borrowers back up.  We find a happy medium where the interest\nrate is moving around, but the purchasing power is relatively stable.  The risk banks take when leveraging money also\ninfluence that price… which we call the interest rate. All of this works\ntogether nicely.  Which is why when Mises\ntalks about inflation he always talks about government.\nThis is indeed how it is supposed to work.  It is how economists are taught that it works.  But it doesn’t work this way and Nate is incorrect in stating that the creation of credit money is not inflationary.  There are several ways of demonstrating that this is the case.  The one I will utilize here is to look at the supply and demand curve and what happens when credit money is injected.\nThe creation of credit money always has an immediate effect on prices because it increases the applicable demand.  I shouldn’t need to draw any SD curves, as we can see the effect that expanded home loans had in the housing market, that increased student loans have on the price of tuition, and even in the health care market, where governments borrow the money that is used to pay for the “free” health care delivered to indigent patients.  No cash is being printed, and yet credit money is being created, transactions are taking place, and prices are rising.  While these effects are localized to the relevant markets I suspect the reason why economists historically failed to connect them to the broad increase in price levels that is usually described as inflation is because until relatively recently, it was not possible to obtain general, pre-approved credit for even the smallest transactions.\nThe economists failed to anticipate either the “credit card” or the debit card, which allows the depositor to tap directly into the credit expansion system without the need to interfere with the expansion by withdrawing the physical debt markers.  And those few who did failed to grasp the full extent of the eventual consequences.  This is why the bankers and governments are so firmly against cash economies; it is actually less about control and tracking, (although obviously governments appreciate the potential benefits of the latter), but because a wholly digital system theoretically allows for unlimited credit expansion… from the traditional perspective.\nThat is how it is supposed to work.  And when its working like that… we can look\nat the amount of money in a given account that exists above and beyond the\ndeposits in that account and we call it credit money.  Because it exists above and beyond the\ndeposits in the account, it has no physical representation.  The coins, or dollar bills, do not\nexist.  I need you to be clear on\nthis.  I have a checking account with say…$45,000\nin it.  If I go to the bank and ask them\nfor $45,000 in cash… they will laugh in my face.   However, debit cards are swiped, and the\ncredit money is accepted exactly like cash is accepted.  That is the miracle.  And it is a miracle… of faith.\nThe key phrase being “when it is working like that”.  Nate is correct on all the details here, except that he is still failing to recognize that it is ALL the money in a given account that is credit money, not merely “the amount of money in a given account that exists above and beyond the\ndeposits in that account”.  This should be abundantly clear in light of the Cypriot situation, where the banks cannot open because, despite their nominal billions on deposit, they have literally no paper markers left to give out even though there are numerous levels of government that are capable of declaring fiat markers to represent those credit claims.  The problem is not that there is no government to print the fiat, but rather, the fact that no one wants to be stuck with the underlying credit claims.\nSo now that we understand borrowing and lending we can\ndiscuss what is wrong.  And what is wrong…\nis the central bank.   Central banks\nbreak the link between savers and lenders.\nRather than the deposits being the source that creates the leverage, you\nnow have a central bank that is merely using the deposits to rationalize its\ndecisions to expand credit.  The deposits\nof savers are reduced to mere justification.\nThe central bank sits on high, and manipulates the interest\nrate… which eliminates its ability to mitigate the booms and busts of the business\ncycle.  Then on top of that… the evil\nbastards then set themselves up as the Credit Gods… passing out credit as they see\nfit… attempting to manage an economy every bit as much as the communists ever\ndid, and failing just as spectacularly.\nIf you get nothing else… I hope and pray you grasp\nthat.\nI can’t argue with anything here, except to note that as has been demonstrated with MF Global, the deposits themselves are, quite literally and legally, loans from the depositor to the bank or fidiciary entity.\nSo if you have made it this far you now realize that the\nmoney in your checking account doesn’t actually exist.  its not that the\nbanks just don’t keep that much cash stored.  There isn’t that much\ncash in existence.  Not even close.\nSo now that the terror has sunk in… what is the urge that\nyou’re squelching down right now?  Is it the urge to go borrow more money?  Or is it the urge… to go get your cash and\nstick it under your bed?\nExactly.  And now you\nsee why Vox’s measure of the money supply is incorrect.   M1 is the real\nmoney.  M2 and TSM2 are close approximations of the\npurchasing power currently available… though obfuscated through\nshenanigans.  Z1… well Z1..  Is just a measure of claims on money.  It\ndoesn’t reflect a limit on new future\nclaims.  At best it can serve as an\nindicator of how much new credit money is being created.  Z1 will never\nbe able to show deflation.  That’s because Z1 doesn’t show a credit\nlimit…\nit shows a credit balance.  See if I have\na $5000 credit limit on my credit card… and I owe $5000… then my credit\ncard is\nshowing up as $5000 on the Z1 report.  If\nI pay my credit card down to a balance of $2000, then my credit card is\nshowing\nup as $2000 on Z1 which Vox would then say is a reduction in purchasing\npower\nof $3000.  This is incorrect.  My high credit is still $5000.  I can go\nspend that $3000 in credit money any\ntime I want to.  Z1 is certainly a\nvaluable tool, but it is a limited one.  Now…\nas has been said… one cannot print borrowers… so if the rate of credit\ngrowth\nis slowing, or going down instead of up it can mean bad things…for\nexample the\ndelivery system for new credit can be interrupted.  That said, if one\nconsiders the nature of the\nfinancial abomination that we have before us, I can certainly not fault\nVox for\ngoing that way.  However, it is not where\nI go.\nHere is where Nate begins to go more seriously awry.  M1 and M2 are not real money anymore than Z1 is, they are merely money substitutes whereas Z1 is a money surrogate that encompasses them both.  I recognize that Nate is not using the Misean definitions any longer, but I don’t see that his rationale for refusing to do so is necessarily justified or even relevant to determining the inflation/deflation question.  More importantly, his distinction between credit limit and credit outstanding is, if not necessarily false, entirely irrelevant.  It is only credit outstanding that matters; the “limit” is an entirely artificial one that, in this case, represents the extent to which the bank is willing to enable Nate to expand the credit supply.  But that’s not an actual limit in the sense that Nate’s decision to not use his potential credit or even to pay down his outstanding credit is, which is the limit I mentioned in\nLimits of Demand\nwhen I proposed it as an alternative mechanism for powering the Austrian Business Cycle.  Nor is there any macro credit limit; this is why Bernanke and the European Central Bank imagine, erreoneously, that they can expand it indefinitely as they see fit.\nBut, as we saw in 2008, outstanding credit can and will contract.  Even a slowed expansion of the sort we have seen since 2009 can have a deleterious effect on an economy which depends on a reliable 2.4 percent growth rate per quarter.\nThe whole reason credit money works, is\nbecause there is a faith-based link from that credit money directly to\ncash.  Thus, the money, right now, is cash.  What you’re seeing is\nprecisely what happened\nin the Great Depression.  People wanted\ntheir cash.  They hid it inside walls and\nburied it in jars.  Banks collapsed destroying\nmassive amounts of credit money, but folks still wanted their cash.  But\nVox fails to recognize a critical\nunderlying difference between then, and today.\nHe looks at those in control… the government and the central bankers…\nand he sees them expanding credit.  He\nunderstands the system better than almost everyone, including the\ncentral\nbankers, and thus he uses that understanding to predict how the system\nwill\nbehave.  He expects it to behave the way\nit behaved in the 1930s.\nThe link is stronger than Nate asserts.  These days, credit money is cash and cash is credit money.  And Nate also credits me with more confidence than I actually possess.  I know the system won’t behave the way it did in the 1930s, in fact, that is precisely what concerns me most.  Unlike before, the banks are not being permitted to collapse, which is why Z1 hasn’t collapsed yet either.  But the bad loans still exist even though they still haven’t been written off.  We are in strange and unpredictable waters here.\nI have to take you back again to the competition which\nVox , to his peril, ignores. So we have these commodities battling it\nout\nin a competition of demand.  Not supply.  Demand.\nThe one most in demand wins and becomes the money.  The demand is the\nkey.  People want that commodity.  They want it badly and everyone knows\nthey\nwant it badly.  So because everyone knows\nthey want that commodity badly… everyone knows that they will be able\nto\ntrade that commodity.  They have faith…\nfaith friends… that they will be able to exchange that commodity in the\nfuture\nfor other goods and services they require\nThat’s all good and well if we’re talking about something like\nGold or Platinum or Silver.  People want\nit because of what it is… and what it is will not change.  But fiat money?  Well… they want it because of all manner of\ngovernment related enhancements.  If it\nweren’t for those enhancements… they wouldn’t want it at all.  But those enhancements exist…  so long as\nthe people have faith in that government. And that is why I define it as fiat\nmoney.\nI suspect Nate has made a fatal error here, because recent events show that faith in government, in the banking system, and even in cash itself is rapidly dissolving.  Everyone now understands that the Cypriot banks don’t have 7 billion cash euros in their vaults, but more importantly, they now also understand that the government can instantly make 10 percent of it disappear regardless of whether if it was in cash form or not.\nAnd when money surrogates, money substitutes, or solid money itself disappears, that is a deflationary action.  Our continued differences of opinion notwithstanding, I think we’ve now covered sufficient theoretical ground that we can move on to the practical aspect of the debate, so I will conclude by asking Nate three questions.\nIf the expected outcome is, as he suggests, inflationary, due to the central bank printing presses why has the European Central Bank not simply used the bank holiday to print the required 13.5 billion euros and allowed its customers to withdraw as much of it happens to suit them?\nWhy is the ECB risking the Cypriot banking system, the wrath of the Russian depositors, and the fate of the European Union itself on these various schemes rather than simply printing the cash and permitting its withdrawal?\nImagine an American analog, where a bank with billions in deposits but already emptied of all its cash was simply shut down without the usual FDIC shell game of “transferring its deposits” to another bank.  Would this be a deflationary action?",
  "tags": [
    "debate",
    "economics",
    "inflation"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-22T11:41:00+00:00"
}