{
  "url": "https://voxday.net/2013/03/18/it-can-happen-in-usa/",
  "scraped_at": "2025-12-14T22:23:21.068558",
  "title": "It can happen in the USA",
  "date_display": "March 18, 2013",
  "date_iso": "2013-03-18T10:43:00+00:00",
  "date_from_url": "2013-03-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That doesn’t mean it will happen, of course.  Due to the different structure wealth is stored in various countries, and the fact that the banks require balance-sheet assets rather than cash to cover their debts, I expect US pension funds and stock markets will be tapped before bank deposits are stolen.</p><p>However, MF Global has already demonstrated that legally speaking, in the USA, money on deposit is not your own, but rather, belongs to the custodial corporation to use as it sees fit, including as collateral for loans to the custodian.  <i>“The settled position of the law is that when you deposit, the  bank<br> becomes the owner of the money deposited and you become a creditor  to<br> the bank.” </br></br></i> It’s not your money, you’re just loaning the money to the bank, which may or may not pay you back, just like anyone else to whom you loan money.  It’s also worth noting that the FDIC cannot and will not provide protection against this sort of government seizure.  From one of Karl’s readers:</p><blockquote class=\"tr_bq\"><p> “One of my prep school classmates is one of the head lawyers of the FDIC. I called him tonight and he was completely briefed and aware of the Cyprus situation. When I mentioned the ticker to him, he laughed because he said the FDIC, FSLIC and SIPC have no jurisdiction nor provide any protection against taxes or fees, which Gen kind of implied. A bank run, of course is a different story, but the government can tax you to death and the FDIC, FSLIC and SIPC will just stand by and watch. They also will not cover you for a seizure that is related to a crime, like fraud, terrorism or narcotics violations.”</p></blockquote><p>In other words, you’ve been warned.  If you’re still leaving more in the financial system than the bare minimum you need in order to keep your personal finances flowing, you should be aware that you are taking a distinctly non-zero risk.</p><p>It is becoming increasingly clear that Cyprus is a test case.  If the bank heist passes the Cypriot parliament and does not spark bank runs throughout Europe as a result, we will almost certainly see more heists take place.  Italy is <a href=\"http://www.zerohedge.com/news/2013-03-17/german-commerzbank-suggests-wealth-tax-italy-next\">most likely next</a>, although Spain and Ireland would also be reasonable candidates, because the EU is aware it will have to act there before Beppe Grillo and his <i>grillini</i> win a majority in the next election and are in a position to prevent them from doing so.  Keep in mind <a href=\"http://www.businessinsider.com/beppe-grillo-at-30-in-italian-poll-2013-3\">the poll mentioned below</a> was conducted before the recent events in Cyprus.</p><p>“A new poll shows surging support for Grillo. The election only added to his<br> momentum, and he’s now at 30 percent. Almost as worrisome for Europe:<br> Berlusconi’s PDL has also gained since the election.”</br></br></p><p>Nor is there any mistaking how Grillo’s MoVimento 5 Stelle is looking at the Cyprus situation<i>: “Signori brutte notizie da Cipro. Il Fondo Monetario con la complicità dell’UE prenderà coattamente il 10% da ogni conto corrente bancario. Dovrebbe essere una notizia da prima pagina su ogni quotidiano e invece non mi sembra di averla vista, potrei sbagliarmi comunque. Siamo davvero sicuri che questa è l’Europa che vogliamo? Gente che vive a migliaia di chilometri di distanza e che prende decisioni così importanti senza interpellare i cittadini.”</i></p><p>“Gentlemen, terrible news out of Cyprus.  The IMF, with the complicity of the EU, will forcibly take 10 percent from every bank account.  This should be front page news on every newspaper and instead, although I could be mistaken, I haven’t seen it anywhere.  Are we really certain that this is the Europe we want?  People living thousands of kilometers away making decisions this important without consulting the citizens?”</p><p>The neocons at the American Spectator and other places are screaming that Grillo is a fascist.  They’re not entirely wrong, but what they conveniently leave out of the equation is that the EU is fascist as well.  The only difference is that the EU is a form of international fascism that runs interference for the global banks, (as seen in Cyprus), whereas MoVimento 5 Stelle is an Italian nationalist movement, and as such, is vastly preferable to the EU and its globalist masters.</p></div>",
  "content_text": "That doesn’t mean it will happen, of course.  Due to the different structure wealth is stored in various countries, and the fact that the banks require balance-sheet assets rather than cash to cover their debts, I expect US pension funds and stock markets will be tapped before bank deposits are stolen.\nHowever, MF Global has already demonstrated that legally speaking, in the USA, money on deposit is not your own, but rather, belongs to the custodial corporation to use as it sees fit, including as collateral for loans to the custodian.\n“The settled position of the law is that when you deposit, the  bank\nbecomes the owner of the money deposited and you become a creditor  to\nthe bank.”\nIt’s not your money, you’re just loaning the money to the bank, which may or may not pay you back, just like anyone else to whom you loan money.  It’s also worth noting that the FDIC cannot and will not provide protection against this sort of government seizure.  From one of Karl’s readers:\n“One of my prep school classmates is one of the head lawyers of the FDIC. I called him tonight and he was completely briefed and aware of the Cyprus situation. When I mentioned the ticker to him, he laughed because he said the FDIC, FSLIC and SIPC have no jurisdiction nor provide any protection against taxes or fees, which Gen kind of implied. A bank run, of course is a different story, but the government can tax you to death and the FDIC, FSLIC and SIPC will just stand by and watch. They also will not cover you for a seizure that is related to a crime, like fraud, terrorism or narcotics violations.”\nIn other words, you’ve been warned.  If you’re still leaving more in the financial system than the bare minimum you need in order to keep your personal finances flowing, you should be aware that you are taking a distinctly non-zero risk.\nIt is becoming increasingly clear that Cyprus is a test case.  If the bank heist passes the Cypriot parliament and does not spark bank runs throughout Europe as a result, we will almost certainly see more heists take place.  Italy is\nmost likely next\n, although Spain and Ireland would also be reasonable candidates, because the EU is aware it will have to act there before Beppe Grillo and his\ngrillini\nwin a majority in the next election and are in a position to prevent them from doing so.  Keep in mind\nthe poll mentioned below\nwas conducted before the recent events in Cyprus.\n“A new poll shows surging support for Grillo. The election only added to his\nmomentum, and he’s now at 30 percent. Almost as worrisome for Europe:\nBerlusconi’s PDL has also gained since the election.”\nNor is there any mistaking how Grillo’s MoVimento 5 Stelle is looking at the Cyprus situation\n: “Signori brutte notizie da Cipro. Il Fondo Monetario con la complicità dell’UE prenderà coattamente il 10% da ogni conto corrente bancario. Dovrebbe essere una notizia da prima pagina su ogni quotidiano e invece non mi sembra di averla vista, potrei sbagliarmi comunque. Siamo davvero sicuri che questa è l’Europa che vogliamo? Gente che vive a migliaia di chilometri di distanza e che prende decisioni così importanti senza interpellare i cittadini.”\n“Gentlemen, terrible news out of Cyprus.  The IMF, with the complicity of the EU, will forcibly take 10 percent from every bank account.  This should be front page news on every newspaper and instead, although I could be mistaken, I haven’t seen it anywhere.  Are we really certain that this is the Europe we want?  People living thousands of kilometers away making decisions this important without consulting the citizens?”\nThe neocons at the American Spectator and other places are screaming that Grillo is a fascist.  They’re not entirely wrong, but what they conveniently leave out of the equation is that the EU is fascist as well.  The only difference is that the EU is a form of international fascism that runs interference for the global banks, (as seen in Cyprus), whereas MoVimento 5 Stelle is an Italian nationalist movement, and as such, is vastly preferable to the EU and its globalist masters.",
  "tags": [
    "banks",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-18T10:43:00+00:00"
}