{
  "url": "https://voxday.net/2013/03/25/it-was-always-going-to-happen/",
  "scraped_at": "2025-12-14T22:24:03.519301",
  "title": "It was always bound to happen",
  "date_display": "March 25, 2013",
  "date_iso": "2013-03-25T18:03:00+00:00",
  "date_from_url": "2013-03-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In a move that will surprise absolutely no one, Amynda Marcotte <a href=\"http://www.slate.com/blogs/xx_factor/2013/03/22/leaning_in_man_style_women_just_need_their_own_housewives_to_get_ahead.html\">finally comes out of the closet</a>:</p><blockquote class=\"tr_bq\"><p> What’s an ambitious woman to do? Obviously, the price tag put on your<br> employment is just another version of the pay gap, and for some reason,<br> the elegant solution of professional women refusing to have children<br> until someone fixes this situation has been taken off the table. It’s a<br> major conundrum. So why not look to men for answers? Men have managed<br> the sticky situation of both having a job and having a home life for<br> decades now. Their solution is possibly even more elegant in its<br> simplicity than the “don’t have children” one: Marry a woman. </br></br></br></br></br></br></br></p></blockquote><p>I think it became fairly obvious that she wasn’t cut out for a life of heteronormative happiness when she invented the concept of “near rape”, a term that customarily translates from the femmesprache as “first date”.</p></div>",
  "content_text": "In a move that will surprise absolutely no one, Amynda Marcotte\nfinally comes out of the closet\n:\nWhat’s an ambitious woman to do? Obviously, the price tag put on your\nemployment is just another version of the pay gap, and for some reason,\nthe elegant solution of professional women refusing to have children\nuntil someone fixes this situation has been taken off the table. It’s a\nmajor conundrum. So why not look to men for answers? Men have managed\nthe sticky situation of both having a job and having a home life for\ndecades now. Their solution is possibly even more elegant in its\nsimplicity than the “don’t have children” one: Marry a woman.\nI think it became fairly obvious that she wasn’t cut out for a life of heteronormative happiness when she invented the concept of “near rape”, a term that customarily translates from the femmesprache as “first date”.",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-25T18:03:00+00:00"
}