{
  "url": "https://voxday.net/2013/03/30/mailvox-failed-metaphor/",
  "scraped_at": "2025-12-14T22:24:26.062458",
  "title": "Mailvox: the failed metaphor",
  "date_display": "March 30, 2013",
  "date_iso": "2013-03-30T10:48:00+00:00",
  "date_from_url": "2013-03-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Congratulations to A. Man, who is the 150th commenter in the last five years to announce that I have, yet again, jumped the shark.  It’s amusing how often that metaphor has been heard from overly optimistic critics during the time when the readership has grown from 240k to 930k per month, especially when these critics are often the very same individuals who demand to know where they can find any indication of the economic and societal collapse I have predicted:</p><blockquote class=\"tr_bq\"><p> <i>“Feminists are objectively worse than Nazis”</i></p><p>It’s nice to see that you were able to fully clear the shark.<br> <i><br>“This<br> is what the feminist’s vaunted concept of equality means.  This is what<br> it has always meant: the legal protection of a woman from all and any<br> consequences of her actions.  This includes a woman’s ability to break<br> any contract at will, to steal from anyone as she pleases, and murder<br> even the most innocent without having to even hear a whisper of protest<br> to make her uncomfortable.”</br></br></br></br></br></br></br></i></br></p><p>The odd thing is that you know this<br> isn’t true, you know this statement cant be defended…and yet you make<br> it still. How does that work? What kind of reconciliation do you do in<br> your mind?</br></br></br></p></blockquote><p>First, feminists are objectively worse than National Socialists.  I have demonstrated this in both logical and empirical terms.  The unborn and the recently born are much more helpless than international Jewry. The cost in human lives of feminism is quite clearly greater than the cost of National Socialism or Fascism ever was.  It could be debated whether feminism or communism has been more costly in those terms, but the mere fact that the matter is debatable suffices to prove what a terrible and evil ideology feminism is.</p><p>Second, the statement not only is true, but it can be easily defended. There is no reconciliation necessary to defend it because it is based on straightforward observation.  I direct the following questions to A. Man.</p><ol><li>Did American women not demand, and do they not presently possess, the right to break marital contracts at will?</li><li>Have feminists not defended the right of women to kill men who abuse them?</li><li>Does the feminist definition of abuse include non-physical abuse?</li><li>Have feminists called for ban on actions that make a woman feel uncomfortable?</li></ol></div>",
  "content_text": "Congratulations to A. Man, who is the 150th commenter in the last five years to announce that I have, yet again, jumped the shark.  It’s amusing how often that metaphor has been heard from overly optimistic critics during the time when the readership has grown from 240k to 930k per month, especially when these critics are often the very same individuals who demand to know where they can find any indication of the economic and societal collapse I have predicted:\n“Feminists are objectively worse than Nazis”\nIt’s nice to see that you were able to fully clear the shark.\n“This\nis what the feminist’s vaunted concept of equality means.  This is what\nit has always meant: the legal protection of a woman from all and any\nconsequences of her actions.  This includes a woman’s ability to break\nany contract at will, to steal from anyone as she pleases, and murder\neven the most innocent without having to even hear a whisper of protest\nto make her uncomfortable.”\nThe odd thing is that you know this\nisn’t true, you know this statement cant be defended…and yet you make\nit still. How does that work? What kind of reconciliation do you do in\nyour mind?\nFirst, feminists are objectively worse than National Socialists.  I have demonstrated this in both logical and empirical terms.  The unborn and the recently born are much more helpless than international Jewry. The cost in human lives of feminism is quite clearly greater than the cost of National Socialism or Fascism ever was.  It could be debated whether feminism or communism has been more costly in those terms, but the mere fact that the matter is debatable suffices to prove what a terrible and evil ideology feminism is.\nSecond, the statement not only is true, but it can be easily defended. There is no reconciliation necessary to defend it because it is based on straightforward observation.  I direct the following questions to A. Man.\nDid American women not demand, and do they not presently possess, the right to break marital contracts at will?\nHave feminists not defended the right of women to kill men who abuse them?\nDoes the feminist definition of abuse include non-physical abuse?\nHave feminists called for ban on actions that make a woman feel uncomfortable?",
  "tags": [
    "mailvox",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-30T10:48:00+00:00"
}