{
  "url": "https://voxday.net/2013/03/28/mailvox-mileage-it-varies/",
  "scraped_at": "2025-12-14T22:24:17.086028",
  "title": "Mailvox: the mileage, it varies",
  "date_display": "March 28, 2013",
  "date_iso": "2013-03-28T13:00:00+00:00",
  "date_from_url": "2013-03-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It has been interesting to see the diversity of reaction to the two stories that make up <a href=\"http://www.amazon.com/dp/B00C1TMVBY\">THE WARDOG’S COIN</a>.  One of the ebook’s first reviewers preferred the title story to its accompaniment, and he had some questions, particularly about “Qalabi Dawn”, that I think I can address without any spoilers:</p><blockquote class=\"tr_bq\"><p> The first story was so good that even the debatable defects of the second made the book merit 5 stars. And at least half the defects of the second may simply be in the intrinsic difficulty of creating understanding of something so radically different. Still: are these cat people merely different tribes? Or different species? I was reading some as tiger-people for quite a while, rather than lion-people. My bad reading? But ignore that; it’s trivial.</p><p>I admit I wondered more… you’ve got a Sergent who is pretty rough and tumble. And yet he uses the word “insomnia”? Is this Vox’s voice leaking through the character? Or are you hinting he’s a lot smarter than the average bear? Similarly, the Capitaine is almost too poncily polished. Intended? I assume so, and the diplomatic interaction with the Elven King + battlefield is interesting and beautifully done.</p></blockquote><p>As I suspect many readers are beginning to understand, I’m not inclined to explain or portray things that the perspective characters don’t know or simply wouldn’t tend to think about.  Just as it is said that fish don’t think about water, a Chiu chieftain is not inclined to think about the structure of his society when he has no reason to do so.  That doesn’t mean the structure doesn’t exist, or that I’m not willing to discuss it, only that there are an amount of worldbuilding details that are never going to appear in any one story or novel.  Selenoth is not as grand and finely detailed a structure as Middle Earth, but it is larger in scope and scale than many fictional universes, including Westeros/Essos.</p><p><a href=\"http://www.voxday.net/mart/TWC_200.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.voxday.net/mart/TWC_200.png\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.voxday.net/mart/TWC_200.png\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a>In answer to the question about the catpeople, the Simba<br> are lion people, the Duma are leopard people, and the Chiu are cheetah people.  (This is confusing for Swahili speakers, as Chiu means leopard, but I figured that English was the primary concern.) All of the Khatuuli are descendants of Baasia; they are quite<br> literally demonspawn.  The three primary varieties of People are<br> further divided into tribes with one dominant male, and they are<br> further divided in that some of them, their elite, tend to be<br> mchawe, or shapechangers, with three different shapes, mwana, mnyama,<br> and the common sehumu form.  Their priestly caste, the<br> Neheb-Kau, are all shapechangers who have abandoned their tribes and given their allegience to the priesthood.  And I’m pleased that the overall sense of the demonspawn is striking at least some readers as radically different; while I am opposed to reinventing wheels, (orcs, elves, dwarves, etc), I hope it is clear that this is not due to any dearth of imagination or creative capacity.</br></br></br></br></br></br></br></p><p>The story of the origins of the demonspawn are told in a novella entitled “The Last Witchking”, which will be published in the forthcoming <i>Summa Elvetica</i> hardcover.</p><p> I think it is naturally difficult to write characters of very different intelligence<br> than the author possesses.  Mediocre authors tend to make every perspective character into an<br> idealized version of themselves; one always knows with whom a bad<br> author identifies because there is that one character who is interminably witty and<br> always verbally bests every other character with the perfect quip, obscure citation, or Bible verse. Some authors make me suspect that the dialogue in their books is chiefly a vehicle for retroactively winning every past verbal altercation in which they belatedly thought of a killer riposte long after it was over.</br></br></br></br></p><p>That being said, the sergent is intelligent, he simply isn’t educated. I’m not<br> sure “insomnia” qualifies as an overly educated word, but I have no doubt there are<br> numerous such slippages with regards to the sergent’s inner<br> monologue.  The capitaine, on the other hand, comes from an aristocratic family that has seen better days; his backstory would make for an interesting novella in its own right. But despite their observable differences, he and the sergent genuinely like and<br> respect each other, which is important because the story revolves around their complicity.  In some ways, The Wardog’s Coin is a very dark story,<br> although I don’t know how many readers will see it in that light.</br></br></br></br></br></p><p>Since the events of TWC take place before ATOB, it is unlikely I<br> will bring either of them back in the main series.  However, there is one character<br> who will certainly appear in Book Two, and as a full perspective character,<br> no less.  And don’t forget, if you haven’t picked up <a href=\"http://www.amazon.com/dp/B009OP9G0C\">A MAGIC BROKEN</a> yet, it is still free on Amazon today.</br></br></br></p><p>UPDATE: TWC debuted in Amazon’s <a href=\"http://www.amazon.com/gp/bestsellers/digital-text/157072011/ref=pd_zg_hrsr_kstore_1_5_last\">Top 10 in the War category</a>, which I have to say was rather unexpected. I consider it to be Epic Fantasy myself, but I can see where it might qualify, especially if one is going to count books like World War Z.  It’s also #3 in Hot New War Fiction, behind Neal Stephenson’s third book in the Mongoliad, which I very much hope is better than the disappointing first one.</p></div>",
  "content_text": "It has been interesting to see the diversity of reaction to the two stories that make up\nTHE WARDOG’S COIN\n.  One of the ebook’s first reviewers preferred the title story to its accompaniment, and he had some questions, particularly about “Qalabi Dawn”, that I think I can address without any spoilers:\nThe first story was so good that even the debatable defects of the second made the book merit 5 stars. And at least half the defects of the second may simply be in the intrinsic difficulty of creating understanding of something so radically different. Still: are these cat people merely different tribes? Or different species? I was reading some as tiger-people for quite a while, rather than lion-people. My bad reading? But ignore that; it’s trivial.\nI admit I wondered more… you’ve got a Sergent who is pretty rough and tumble. And yet he uses the word “insomnia”? Is this Vox’s voice leaking through the character? Or are you hinting he’s a lot smarter than the average bear? Similarly, the Capitaine is almost too poncily polished. Intended? I assume so, and the diplomatic interaction with the Elven King + battlefield is interesting and beautifully done.\nAs I suspect many readers are beginning to understand, I’m not inclined to explain or portray things that the perspective characters don’t know or simply wouldn’t tend to think about.  Just as it is said that fish don’t think about water, a Chiu chieftain is not inclined to think about the structure of his society when he has no reason to do so.  That doesn’t mean the structure doesn’t exist, or that I’m not willing to discuss it, only that there are an amount of worldbuilding details that are never going to appear in any one story or novel.  Selenoth is not as grand and finely detailed a structure as Middle Earth, but it is larger in scope and scale than many fictional universes, including Westeros/Essos.\nIn answer to the question about the catpeople, the Simba\nare lion people, the Duma are leopard people, and the Chiu are cheetah people.  (This is confusing for Swahili speakers, as Chiu means leopard, but I figured that English was the primary concern.) All of the Khatuuli are descendants of Baasia; they are quite\nliterally demonspawn.  The three primary varieties of People are\nfurther divided into tribes with one dominant male, and they are\nfurther divided in that some of them, their elite, tend to be\nmchawe, or shapechangers, with three different shapes, mwana, mnyama,\nand the common sehumu form.  Their priestly caste, the\nNeheb-Kau, are all shapechangers who have abandoned their tribes and given their allegience to the priesthood.  And I’m pleased that the overall sense of the demonspawn is striking at least some readers as radically different; while I am opposed to reinventing wheels, (orcs, elves, dwarves, etc), I hope it is clear that this is not due to any dearth of imagination or creative capacity.\nThe story of the origins of the demonspawn are told in a novella entitled “The Last Witchking”, which will be published in the forthcoming\nSumma Elvetica\nhardcover.\nI think it is naturally difficult to write characters of very different intelligence\nthan the author possesses.  Mediocre authors tend to make every perspective character into an\nidealized version of themselves; one always knows with whom a bad\nauthor identifies because there is that one character who is interminably witty and\nalways verbally bests every other character with the perfect quip, obscure citation, or Bible verse. Some authors make me suspect that the dialogue in their books is chiefly a vehicle for retroactively winning every past verbal altercation in which they belatedly thought of a killer riposte long after it was over.\nThat being said, the sergent is intelligent, he simply isn’t educated. I’m not\nsure “insomnia” qualifies as an overly educated word, but I have no doubt there are\nnumerous such slippages with regards to the sergent’s inner\nmonologue.  The capitaine, on the other hand, comes from an aristocratic family that has seen better days; his backstory would make for an interesting novella in its own right. But despite their observable differences, he and the sergent genuinely like and\nrespect each other, which is important because the story revolves around their complicity.  In some ways, The Wardog’s Coin is a very dark story,\nalthough I don’t know how many readers will see it in that light.\nSince the events of TWC take place before ATOB, it is unlikely I\nwill bring either of them back in the main series.  However, there is one character\nwho will certainly appear in Book Two, and as a full perspective character,\nno less.  And don’t forget, if you haven’t picked up\nA MAGIC BROKEN\nyet, it is still free on Amazon today.\nUPDATE: TWC debuted in Amazon’s\nTop 10 in the War category\n, which I have to say was rather unexpected. I consider it to be Epic Fantasy myself, but I can see where it might qualify, especially if one is going to count books like World War Z.  It’s also #3 in Hot New War Fiction, behind Neal Stephenson’s third book in the Mongoliad, which I very much hope is better than the disappointing first one.",
  "tags": [
    "books",
    "Selenoth"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-28T13:00:00+00:00"
}