{
  "url": "https://voxday.net/2013/03/10/mailvox-republican-hatred-of-ron-pau/",
  "scraped_at": "2025-12-14T22:22:36.915593",
  "title": "Mailvox: Republican hatred of Ron Paul",
  "date_display": "March 10, 2013",
  "date_iso": "2013-03-10T12:13:00+00:00",
  "date_from_url": "2013-03-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Stickwick wonders why conservatives react in such a stereotypically liberal manner to Ron Paul:</p><blockquote class=\"tr_bq\"><p> I have a question about the conservative perception of Ron Paul. Rachel Lucas seems like a reasonable right-of-center person whose political views are moving towards libertarianism. In fact, she now refers to herself as a libertarian. However, she still hangs on to the idea of American interventionism. In <a href=\"http://www.rachellucas.com/2013/03/im-genuinely-sorry-i-ever-supported-john-mccain/\">a recent post</a> she criticizes McCain for his criticism of Rand Paul and for his overly-interventionist policy, but agrees with Ace that *some* interventionism is necessary:</p><p>I don’t agree with it, but at least their position is stated reasonably. What I find odd is how her commenters are using this as an opportunity to dump all over Ron Paul. Here’s a typical example:</p><p><i>“For the record, I cannot STAND Ron Paul. Fiscally he makes sense, but in every other conceivable way he’s a senile, batshit crazy old fuck.”</i></p><p>Why do some right-of-center people get so vitriolic about Ron Paul? They go right past “I strongly disagree with his ideas on foreign policy,” and straight to “crazy old fuck.” This is exactly the sort of thing they denounce when the left gets personal in its attacks or calls right-of-center ideology a “mental disorder.”</p><p>Why do conservatives call Ron Paul crazy instead of just disagreeing with him? Would you shed some light on this?</p></blockquote><p>It’s not at all hard to understand why so many conservatives hate Ron Paul with all the fury of a thousand suns.  The reason is that he shames them for their hypocrisy.  He reveals the inconsistency in their non-conservatism.  He forces them to confront the fact that they are not the proponents of small government and liberty they believe themselves to be.</p><p>Big government, international interventionist, and monetarist “conservatives” hate Ron Paul for exactly the same reason the Pharisees and Sadducees hated Jesus Christ.  Because he exposes their intrinsically false nature to themselves.  And the reason they dismiss him as crazy instead of responding rationally to the arguments he presents is because they know they cannot do so without losing.</p></div>",
  "content_text": "Stickwick wonders why conservatives react in such a stereotypically liberal manner to Ron Paul:\nI have a question about the conservative perception of Ron Paul. Rachel Lucas seems like a reasonable right-of-center person whose political views are moving towards libertarianism. In fact, she now refers to herself as a libertarian. However, she still hangs on to the idea of American interventionism. In\na recent post\nshe criticizes McCain for his criticism of Rand Paul and for his overly-interventionist policy, but agrees with Ace that *some* interventionism is necessary:\nI don’t agree with it, but at least their position is stated reasonably. What I find odd is how her commenters are using this as an opportunity to dump all over Ron Paul. Here’s a typical example:\n“For the record, I cannot STAND Ron Paul. Fiscally he makes sense, but in every other conceivable way he’s a senile, batshit crazy old fuck.”\nWhy do some right-of-center people get so vitriolic about Ron Paul? They go right past “I strongly disagree with his ideas on foreign policy,” and straight to “crazy old fuck.” This is exactly the sort of thing they denounce when the left gets personal in its attacks or calls right-of-center ideology a “mental disorder.”\nWhy do conservatives call Ron Paul crazy instead of just disagreeing with him? Would you shed some light on this?\nIt’s not at all hard to understand why so many conservatives hate Ron Paul with all the fury of a thousand suns.  The reason is that he shames them for their hypocrisy.  He reveals the inconsistency in their non-conservatism.  He forces them to confront the fact that they are not the proponents of small government and liberty they believe themselves to be.\nBig government, international interventionist, and monetarist “conservatives” hate Ron Paul for exactly the same reason the Pharisees and Sadducees hated Jesus Christ.  Because he exposes their intrinsically false nature to themselves.  And the reason they dismiss him as crazy instead of responding rationally to the arguments he presents is because they know they cannot do so without losing.",
  "tags": [
    "mailvox",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-10T12:13:00+00:00"
}