{
  "url": "https://voxday.net/2013/03/14/on-bookgame-fron/",
  "scraped_at": "2025-12-14T22:22:58.037394",
  "title": "On the book/game front",
  "date_display": "March 14, 2013",
  "date_iso": "2013-03-14T09:35:00+00:00",
  "date_from_url": "2013-03-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2013/03/Selenoth_360.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2013/03/Selenoth_360.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2013/03/Selenoth_360.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>1. <i>The Wardog’s Coin</i> is finished.  Marcher Lord is presently giving it the editorial polishing and then the novelette will be published in accompaniment with its B-side, <i>Qalabi Dawn</i>.  With nearly 30k words between the two of them; it should be on Amazon for $1.99 before the end of the month.  As with AMB, I’ll be sending out the ebook to those who have promised to review it; if you’re interested, send me an email with TWC in the subject and specify if you prefer epub or mobi format. The title novelette is about a Savondese mercenary who finds himself, and his mercenary company, drawn into the service of the elven king of Merithaim courtesy of an insufficiently researched contract. It is set in Selenoth and introduces a new perspective character who will be appearing in TAODAL: Book Two.</p><p>2. A Selenoth-based game will be coming out for mobile platforms towards the end of this year, such as Android and iOS. I won’t say anything more about it now, except that it’s going to be a very different sort of game than anyone is likely to anticipate, and it is going to contain one or two innovations that I expect to be of interest to various people outside of the game industry proper.</p><p>3. While <i>Summa Elvetica</i> was a failure in a way that the much less ambitious <i>A Throne of Bones</i> was not, I’m still pleased to learn that SE has its fans who are not put off by its unconventional approach to story-telling.  <a href=\"http://seekingnewearth.wordpress.com/2013/03/06/summa-elvetica/\">Seeking the New Earth</a> has posted a nice review of it:</p><blockquote class=\"tr_bq\"><p> The moment I knew that I did not merely like the novel, but loved it, comes here. I don’t want to spoil it, but I will say this: Marcus discovers evidence that leads him to write the Summa Elvetica, an official treatise on elves, for the church. And what he discovers actually made me cheer. Beale shows his mastery in showing, not telling, in that particular scene, and it lifts the rest of the novel from “pretty good” to “great.”</p><p>The conclusion of the novel nearly disappointed me. I thought Beale would go the hackneyed route of, “The church is shown the truth but chooses to ignore it.” Ah, but he has another trick up his sleeve to bring this story to a satisfying conclusion.</p><p>Oh! The story ended, but there’s almost a hundred pages left?</p><p>Beale actually wrote the Summa Elvetica. He wrote a treatise in the style of the medieval church. It’s included as an appendix. OK, that’s neat and all, but how many of us read medieval religious treatises?</p><p>Oh. It’s only a few pages. What else?</p><p>Beale includes two short stories set within the world of <i>Summa Elvetica </i>that shine more brightly than the novel. Honestly, the book’s worth the price of admission for either of these two stories. I’m delighted they’re included.</p></blockquote><p>4.  Koanic Soul has posted <a href=\"http://www.koanicsoul.com/blog/2013/01/26/a-throne-of-bones-pot-roast-and-morphine-2-day-supply/\">a review of <i>A Throne of Bones</i></a>, (warning: considerable spoilers) that is much more accessible and much less insane than one would ever have imagined. Frankly, I was disappointed, as I was expecting long treatises on the conjectured skull shapes and eye sockets of the various major characters.  Or something like that.  Based on the title of his post, it appears Koanic may have reversed the analogy below, but regardless, it’s nice to hear that TAODAR compares favorably with ASOIAF in one way or another.</p><blockquote class=\"tr_bq\"><p> My preferred form of stimulation is intellectual. Vox’s latest book, <i>A Throne of Bones</i>, is like a 2-day morphine high. Just buy it. If you need convincing, here my review. Vox Day is to RR Martin as a box of pastries is to a pot roast<br> dinner. One may taste better at the beginning, but the other you<br> wouldn’t mind eating for the rest of your life.</br></br></p></blockquote><p> 5. Speaking of ASOIAF, I was more than a little amused by <a href=\"http://asoiaf.westeros.org/index.php/topic/80972-a-rebuke-of-a-song-of-ice-and-fire/\">this discussion on the Martin fan site Westeros.org</a>, which is nominally about <i>A Throne of Bones</i>, but is more devoted to my various ideological and personal shortcomings by Martin fans who haven’t bothered to read the book before opining on the author.  This comment about my discourse with R. Scott Bakker, in particular, made me laugh out loud:</p><p><i>“When you’re the condescending douche in an argument with Bakker you’re in trouble.”</i></p><p>Such is the burden of life as a superintelligence.<i> </i>One ignores at the price of being considered arrogant. One explains at the price of being deemed condescending.<i> </i><i><br/></i></p></div>",
  "content_text": "1.\nThe Wardog’s Coin\nis finished.  Marcher Lord is presently giving it the editorial polishing and then the novelette will be published in accompaniment with its B-side,\nQalabi Dawn\n.  With nearly 30k words between the two of them; it should be on Amazon for $1.99 before the end of the month.  As with AMB, I’ll be sending out the ebook to those who have promised to review it; if you’re interested, send me an email with TWC in the subject and specify if you prefer epub or mobi format. The title novelette is about a Savondese mercenary who finds himself, and his mercenary company, drawn into the service of the elven king of Merithaim courtesy of an insufficiently researched contract. It is set in Selenoth and introduces a new perspective character who will be appearing in TAODAL: Book Two.\n2. A Selenoth-based game will be coming out for mobile platforms towards the end of this year, such as Android and iOS. I won’t say anything more about it now, except that it’s going to be a very different sort of game than anyone is likely to anticipate, and it is going to contain one or two innovations that I expect to be of interest to various people outside of the game industry proper.\n3. While\nSumma Elvetica\nwas a failure in a way that the much less ambitious\nA Throne of Bones\nwas not, I’m still pleased to learn that SE has its fans who are not put off by its unconventional approach to story-telling.\nSeeking the New Earth\nhas posted a nice review of it:\nThe moment I knew that I did not merely like the novel, but loved it, comes here. I don’t want to spoil it, but I will say this: Marcus discovers evidence that leads him to write the Summa Elvetica, an official treatise on elves, for the church. And what he discovers actually made me cheer. Beale shows his mastery in showing, not telling, in that particular scene, and it lifts the rest of the novel from “pretty good” to “great.”\nThe conclusion of the novel nearly disappointed me. I thought Beale would go the hackneyed route of, “The church is shown the truth but chooses to ignore it.” Ah, but he has another trick up his sleeve to bring this story to a satisfying conclusion.\nOh! The story ended, but there’s almost a hundred pages left?\nBeale actually wrote the Summa Elvetica. He wrote a treatise in the style of the medieval church. It’s included as an appendix. OK, that’s neat and all, but how many of us read medieval religious treatises?\nOh. It’s only a few pages. What else?\nBeale includes two short stories set within the world of\nSumma Elvetica\nthat shine more brightly than the novel. Honestly, the book’s worth the price of admission for either of these two stories. I’m delighted they’re included.\n4.  Koanic Soul has posted\na review of\nA Throne of Bones\n, (warning: considerable spoilers) that is much more accessible and much less insane than one would ever have imagined. Frankly, I was disappointed, as I was expecting long treatises on the conjectured skull shapes and eye sockets of the various major characters.  Or something like that.  Based on the title of his post, it appears Koanic may have reversed the analogy below, but regardless, it’s nice to hear that TAODAR compares favorably with ASOIAF in one way or another.\nMy preferred form of stimulation is intellectual. Vox’s latest book,\nA Throne of Bones\n, is like a 2-day morphine high. Just buy it. If you need convincing, here my review. Vox Day is to RR Martin as a box of pastries is to a pot roast\ndinner. One may taste better at the beginning, but the other you\nwouldn’t mind eating for the rest of your life.\n5. Speaking of ASOIAF, I was more than a little amused by\nthis discussion on the Martin fan site Westeros.org\n, which is nominally about\nA Throne of Bones\n, but is more devoted to my various ideological and personal shortcomings by Martin fans who haven’t bothered to read the book before opining on the author.  This comment about my discourse with R. Scott Bakker, in particular, made me laugh out loud:\n“When you’re the condescending douche in an argument with Bakker you’re in trouble.”\nSuch is the burden of life as a superintelligence.\nOne ignores at the price of being considered arrogant. One explains at the price of being deemed condescending.",
  "tags": [
    "books",
    "games"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-14T09:35:00+00:00"
}