{
  "url": "https://voxday.net/2013/03/26/persecution-in-america/",
  "scraped_at": "2025-12-14T22:24:07.131977",
  "title": "Persecution in America",
  "date_display": "March 26, 2013",
  "date_iso": "2013-03-26T13:00:00+00:00",
  "date_from_url": "2013-03-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s fascinating, is it not, how those who deny Jesus Christ, from Roman emperors to petty academic professors, <a href=\"http://pjmedia.com/tatler/2013/03/25/jesus-stomping-professor-fau-story-continues-with-non-apology-then-apology-and-now-charges-filed-against-student-who-complained/\">are observably obsessed</a> with forcing others to symbolically reject the name of Man’s Lord and Savior:</p><blockquote class=\"tr_bq\"><p> A professor at Florida Atlantic University (FAU) Davie campus named<br> Deandre Poole teaches an “Intercultural Communication” class from a<br> textbook by the same name.  The textbook calls for an exercise where<br> students write the name of Jesus in large letters on a piece of paper<br> and then stomp on it.</br></br></br></br></p><p>Enter Ryan Rotela, a student in the class who happens to be a devout<br> Mormon. Rotela refused to stomp and complained to Professor Poole,<br> telling him, “Never do the assignment again because it’s offensive.” <br> Rotela also told the professor that he was going to complain to the<br> university.  Then, according to Rotela, FAU responded by suspending him<br> from Poole’s class.</br></br></br></br></br></p></blockquote><p>It gets worse; the university is now going after the student, not the professor.  That’s obviously questionable.  But as the PJ Tatler rightly puts it, the more important question is this: “Why was there only one student in the class who found stomping on Jesus objectionable?”</p><p>Never forget, this is the sort of “tolerance” that the atheists and pagans grant to the Christians after successfully demanding respect and tolerance from Western Christian culture.  It is becoming increasingly obvious that the genuine tolerance that was given to them may have been a serious mistake of cataclysmic proportions for everyone, including the atheists and pagans who have been granted free reign and are foolishly using their freedom to bring down a civilization more than a millennium in the making.</p></div>",
  "content_text": "It’s fascinating, is it not, how those who deny Jesus Christ, from Roman emperors to petty academic professors,\nare observably obsessed\nwith forcing others to symbolically reject the name of Man’s Lord and Savior:\nA professor at Florida Atlantic University (FAU) Davie campus named\nDeandre Poole teaches an “Intercultural Communication” class from a\ntextbook by the same name.  The textbook calls for an exercise where\nstudents write the name of Jesus in large letters on a piece of paper\nand then stomp on it.\nEnter Ryan Rotela, a student in the class who happens to be a devout\nMormon. Rotela refused to stomp and complained to Professor Poole,\ntelling him, “Never do the assignment again because it’s offensive.”\nRotela also told the professor that he was going to complain to the\nuniversity.  Then, according to Rotela, FAU responded by suspending him\nfrom Poole’s class.\nIt gets worse; the university is now going after the student, not the professor.  That’s obviously questionable.  But as the PJ Tatler rightly puts it, the more important question is this: “Why was there only one student in the class who found stomping on Jesus objectionable?”\nNever forget, this is the sort of “tolerance” that the atheists and pagans grant to the Christians after successfully demanding respect and tolerance from Western Christian culture.  It is becoming increasingly obvious that the genuine tolerance that was given to them may have been a serious mistake of cataclysmic proportions for everyone, including the atheists and pagans who have been granted free reign and are foolishly using their freedom to bring down a civilization more than a millennium in the making.",
  "tags": [
    "Christianity",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-26T13:00:00+00:00"
}