{
  "url": "https://voxday.net/2013/03/12/pirates-and-post-timorous/",
  "scraped_at": "2025-12-14T22:22:47.303512",
  "title": "Pirates, preferences, and the post-timorous",
  "date_display": "March 12, 2013",
  "date_iso": "2013-03-12T09:19:00+00:00",
  "date_from_url": "2013-03-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Adam Carolla has a pirate ship.  It is not a coincidence that he is one of the few men who harbor <a href=\"http://dailycaller.com/2013/03/09/adam-carolla-rips-the-huffington-post-media-you-guys-all-have-blood-on-your-hands/\">no fear of being called “raciss”</a> by the cowards in the media and on the Internet. But he’s far from the only one and the numbers of the racially post-timorous are rapidly growing as more and more individuals of European descent become increasingly tribal by virtue of their increased exposure to Africans, Hispanics, Asians, and others from non-European tribes.</p><blockquote class=\"tr_bq\"><p> “The Huffington Post has come out with a story that says ‘Adam Carolla to Gavin Newsom: ‘What’s wrong with blacks and Latinos?’’” Carolla said. “That’s not what I said to Gavin Newsom. I didn’t bring up blacks and Latinos. He brought up blacks and Latinos. But let me take this moment to now talk to all the pussies that are out there trying to stir things up and turn me into a racist. I got news for you: Me saying parents should stick around and raise the children – me saying families and cultures should focus on education — is not radical or revolutionary. It’s the fucking truth.”</p><p>Carolla, author of “Not Taco Bell Material,” said that while Newsom is quick to blame “the system,” Newsom happens to be a part of what’s wrong that system.</p><p>“You are the system, Gavin Newsom,” Carolla said. “Fix the system, but you won’t fix the system, because you know what it takes to fix the system and you’re a fucking coward. And guys like Huffington Post — you guys fucking line up behind these people and let me tell you something, you guys all have blood on your hands, because the problem could be fixed. It’s a problem, and it’s a problem that involves bodies. People die every year.”</p><p>“There’s people getting shot,” Carolla added. “There’s brown people shooting other brown people on the streets of Chicago every fucking day of the week. And you guys sit there silently. If it was a Sandy Hook situation or anything else, you’d be all up in arms. But you can’t say a word, so you sit there with your fucking coward hands over your fucking little cowardly soup coolers. And then when somebody has the guts to say something — to speak the truth for fucking one hot second, you jump up his ass and call him a racist. Thus, you silence the media. Now you perpetuate the problem….</p><p>“So let me tell you something — I got something called a pirate ship,<br> Huffington Post,” Carolla said. “I don’t give a fuck about you and your<br> fucking opinions…. Keep going, Huffington Post,” he said. “Keep pointing fingers at<br> people who speak out. Good job, media. Silence everyone who says there’s<br> a problem. Silence everyone who attempts to take a problem and really<br> earnestly get them out of poverty, to really earnestly try to look at<br> the problem realistically, to look at the problem of violence, to look<br> at the problem of education, to look at the socio-economic problem —<br> someone who really honestly tries to take a look at this problem. You<br> silence them by calling them a racist. </br></br></br></br></br></br></br></br></br></p></blockquote><p>The reality from which the conservative, mainstream, and progressive medias are all averting their eyes is that a substantial percentage of the minority population of America are, <a href=\"http://www.nytimes.com/2013/03/07/opinion/coates-the-good-racist-people.html?smid=pl-share\">in the words of Ta-Nehisi Coates about his wife</a>, at war with white people. No amount of unscientific racial goodthink, no <i>bien-pensant</i> justifications for inordinately criminal behavior by people of a certain color, no ritual confessions of anti-racism by people living in pure lily-white communities is going to change that fact.</p><p>Jews understand tribe.  Africans understand tribe.  Hispanics understand tribe.  Asians understand tribe.  But because they collectively and intentionally rejected their tribal identity in favor of an amorphous Anglo-Saxon creed to which virtually none of them understand or subscribe anymore, white Americans will continue to be bewildered and victimized as a result of failing to understand the games being played until they rediscover the concept of tribal loyalty to one’s own kind.</p><p>And rediscover it they will, whether they want to or not. As <a href=\"http://www.washingtonpost.com/opinions/how-the-demographic-shift-could-hurt-democrats-too/2013/03/08/de82ab38-8128-11e2-a350-49866afab584_story.html\">the Washington Post article</a> about the growing “racial consciousness” of liberal white Democrats forced to confront an unexpected Hispanic intrusion into their middle class lives illustrates, it is only a matter of time and sufficient inter-tribal contact.</p><blockquote class=\"tr_bq\"><p> It’s assumed that, as the United States becomes increasingly non-white,<br> white Democrats will continue to support the party. But a substantial<br> amount of social-science evidence suggests a different conclusion: As<br> the United States becomes more racially and ethnically diverse, liberal<br> whites might start leaning Republican….</br></br></br></br></p><p>The results were clear. After coming into contact, for just minutes<br> each day, with two more Latinos than they would otherwise see or<br> interact with, the riders, who were mostly white and liberal, were<br> sharply more opposed to allowing more immigrants into the country and<br> favored returning the children of illegal immigrants to their parents’<br> home country. It was a stark shift from their pre-experiment interviews,<br> during which they expressed more neutral attitudes.</br></br></br></br></br></br></p><p>Political<br> scientists, economists, sociologists and psychologists have long noted<br> that, under most circumstances, when people from different ethnic,<br> racial and religious groups come into new contact, conflict ensues.</br></br></br></p></blockquote><p>The process of white tribal rediscovery likely to be more than a little ugly, as are the some of the potential consequences.  Just as the legacy of importing Africans continues to resonate in a negative manner hundreds of years after the initial importation, the problems related to the legacy of importing Hispanics, Asians, Jews, and other tribal peoples will likely be an order of magnitude or two higher. A peaceful geographic breakup of the Union is probably the best for which we can hope.</p><p>Ultimately, it isn’t about race per se, as race is a clumsy and outdated term that doesn’t fit well with the genetic science that is rapidly eroding the great myth of human equality.  It is about tribe, a fractal concept that encompasses race but goes considerably beyond it.  And tribal differences are so profound, that as Steve Sailer notes, they <a href=\"http://isteve.blogspot.com/2013/03/facebooks-race-gap-in-likes-bigger-than.html\">are more easily distinguished on the basis of preferences</a> than religion, ideology, sexual orientation or even sex.</p><blockquote class=\"tr_bq\"><p> A <a href=\"http://www.pnas.org/content/suppl/2013/03/07/1218772110.DCSupplemental/st01.pdf\">new study</a> out of <a href=\"http://www.pnas.org/content/early/2013/03/06/1218772110.full.pdf+html?with-ds=yes\">Cambridge University</a><br> uses a database of Facebook “likes” to predict demographic and<br> personality information about individuals. Race (black v. white,<br> ignoring other races) turns out to be the easiest to predict based on<br> what stuff people like. The Cambridge model gets race right 95% of the<br> time, compared to only 93% of the time for sex.</br></br></br></br></br></p></blockquote></div>",
  "content_text": "Adam Carolla has a pirate ship.  It is not a coincidence that he is one of the few men who harbor\nno fear of being called “raciss”\nby the cowards in the media and on the Internet. But he’s far from the only one and the numbers of the racially post-timorous are rapidly growing as more and more individuals of European descent become increasingly tribal by virtue of their increased exposure to Africans, Hispanics, Asians, and others from non-European tribes.\n“The Huffington Post has come out with a story that says ‘Adam Carolla to Gavin Newsom: ‘What’s wrong with blacks and Latinos?’’” Carolla said. “That’s not what I said to Gavin Newsom. I didn’t bring up blacks and Latinos. He brought up blacks and Latinos. But let me take this moment to now talk to all the pussies that are out there trying to stir things up and turn me into a racist. I got news for you: Me saying parents should stick around and raise the children – me saying families and cultures should focus on education — is not radical or revolutionary. It’s the fucking truth.”\nCarolla, author of “Not Taco Bell Material,” said that while Newsom is quick to blame “the system,” Newsom happens to be a part of what’s wrong that system.\n“You are the system, Gavin Newsom,” Carolla said. “Fix the system, but you won’t fix the system, because you know what it takes to fix the system and you’re a fucking coward. And guys like Huffington Post — you guys fucking line up behind these people and let me tell you something, you guys all have blood on your hands, because the problem could be fixed. It’s a problem, and it’s a problem that involves bodies. People die every year.”\n“There’s people getting shot,” Carolla added. “There’s brown people shooting other brown people on the streets of Chicago every fucking day of the week. And you guys sit there silently. If it was a Sandy Hook situation or anything else, you’d be all up in arms. But you can’t say a word, so you sit there with your fucking coward hands over your fucking little cowardly soup coolers. And then when somebody has the guts to say something — to speak the truth for fucking one hot second, you jump up his ass and call him a racist. Thus, you silence the media. Now you perpetuate the problem….\n“So let me tell you something — I got something called a pirate ship,\nHuffington Post,” Carolla said. “I don’t give a fuck about you and your\nfucking opinions…. Keep going, Huffington Post,” he said. “Keep pointing fingers at\npeople who speak out. Good job, media. Silence everyone who says there’s\na problem. Silence everyone who attempts to take a problem and really\nearnestly get them out of poverty, to really earnestly try to look at\nthe problem realistically, to look at the problem of violence, to look\nat the problem of education, to look at the socio-economic problem —\nsomeone who really honestly tries to take a look at this problem. You\nsilence them by calling them a racist.\nThe reality from which the conservative, mainstream, and progressive medias are all averting their eyes is that a substantial percentage of the minority population of America are,\nin the words of Ta-Nehisi Coates about his wife\n, at war with white people. No amount of unscientific racial goodthink, no\nbien-pensant\njustifications for inordinately criminal behavior by people of a certain color, no ritual confessions of anti-racism by people living in pure lily-white communities is going to change that fact.\nJews understand tribe.  Africans understand tribe.  Hispanics understand tribe.  Asians understand tribe.  But because they collectively and intentionally rejected their tribal identity in favor of an amorphous Anglo-Saxon creed to which virtually none of them understand or subscribe anymore, white Americans will continue to be bewildered and victimized as a result of failing to understand the games being played until they rediscover the concept of tribal loyalty to one’s own kind.\nAnd rediscover it they will, whether they want to or not. As\nthe Washington Post article\nabout the growing “racial consciousness” of liberal white Democrats forced to confront an unexpected Hispanic intrusion into their middle class lives illustrates, it is only a matter of time and sufficient inter-tribal contact.\nIt’s assumed that, as the United States becomes increasingly non-white,\nwhite Democrats will continue to support the party. But a substantial\namount of social-science evidence suggests a different conclusion: As\nthe United States becomes more racially and ethnically diverse, liberal\nwhites might start leaning Republican….\nThe results were clear. After coming into contact, for just minutes\neach day, with two more Latinos than they would otherwise see or\ninteract with, the riders, who were mostly white and liberal, were\nsharply more opposed to allowing more immigrants into the country and\nfavored returning the children of illegal immigrants to their parents’\nhome country. It was a stark shift from their pre-experiment interviews,\nduring which they expressed more neutral attitudes.\nPolitical\nscientists, economists, sociologists and psychologists have long noted\nthat, under most circumstances, when people from different ethnic,\nracial and religious groups come into new contact, conflict ensues.\nThe process of white tribal rediscovery likely to be more than a little ugly, as are the some of the potential consequences.  Just as the legacy of importing Africans continues to resonate in a negative manner hundreds of years after the initial importation, the problems related to the legacy of importing Hispanics, Asians, Jews, and other tribal peoples will likely be an order of magnitude or two higher. A peaceful geographic breakup of the Union is probably the best for which we can hope.\nUltimately, it isn’t about race per se, as race is a clumsy and outdated term that doesn’t fit well with the genetic science that is rapidly eroding the great myth of human equality.  It is about tribe, a fractal concept that encompasses race but goes considerably beyond it.  And tribal differences are so profound, that as Steve Sailer notes, they\nare more easily distinguished on the basis of preferences\nthan religion, ideology, sexual orientation or even sex.\nA\nnew study\nout of\nCambridge University\nuses a database of Facebook “likes” to predict demographic and\npersonality information about individuals. Race (black v. white,\nignoring other races) turns out to be the easiest to predict based on\nwhat stuff people like. The Cambridge model gets race right 95% of the\ntime, compared to only 93% of the time for sex.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-12T09:19:00+00:00"
}