{
  "url": "https://voxday.net/2013/03/18/standoff-in-cyprus/",
  "scraped_at": "2025-12-14T22:23:26.604496",
  "title": "Standoff in Cyprus",
  "date_display": "March 18, 2013",
  "date_iso": "2013-03-18T19:39:00+00:00",
  "date_from_url": "2013-03-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The IMF/EU bank heist is being put on hold because <a href=\"http://www.zerohedge.com/news/2013-03-18/majority-cypriot-parties-refuse-support-deposit-loss-law\">the president can’t get the votes</a> to approve the theft.  Zerohedge reports:</p><blockquote class=\"tr_bq\"><p> Moments ago the state-run CYBC media reported perhaps the most material news ahead of tomorrow’s Cyprus parliamentary vote, which at this point will likely be rescheduled once more, for the simple reason that yet another key Cypriot party, DIKO, has come out and decided to vote against the depositor-loss law on the Parliament’s docket tomorrow. This is notable because while yesterday JPM, in its “bazooka” assessment speculated that DIKO would vote for the law which made sense previously as DIKO had supported president Anastasiades in his election bid, which gave a pro-bailout vote a one vote margin. As a result of today’s flip, the party’s 9 votes will now be aligned with the “anti” votes of AKEL  and EDEK, whose combined 33 votes mean the proposed bailout law has no chance of passing as they have the needed 29 votes to block any bail-in out proposal!</p></blockquote><p>That’s 33 against and 20 for.  It should be interesting to learn to what extent the EU and the Cypriot president were bluffing when they claimed a financial armageddon would result from a failure of the bailout plan.  I suspect it’s going to look at lot more like the consequences of the US sequester, which absolutely no one in the USA appears to have even noticed.</p><p>Jim Sinclair <a href=\"http://kingworldnews.com/kingworldnews/KWN_DailyWeb/Entries/2013/3/18_Sinclair_-_All_Hell_Is_Breaking_Loose_After_Cyprus_Catastrophe.html\">notes</a>: “The government leaders in Cyprus are trying to back-pedal right now in<br> order to save their lives.  Let me say it again, they are trying to save<br> their own lives.  Remember, ‘revenge is best served cold.’  This means<br> the revenge never comes at the moment of the miscreant act.  But it will<br> come in time.  To take money from the leading economic<br> entities in Russia, is to take money from the former KGB officers, and<br> taking money from them is extremely dangerous.  I think the reality has<br> quickly set in for the leaders of Cyprus that they have aided in the<br> confiscation of the most serious and dangerous money you could possibly<br> touch.  It has these leaders more afraid for their lives than their bank<br> accounts.”</br></br></br></br></br></br></br></br></br></br></p><p>UPDATE: <i>“the Eurogroup will give Cyprus more flexibility on bank levy, and that Cyprus should safeguard depositors under €100,000, even as the full €5.8 billion deposit goal must still be hit.”</i></p><p>Perhaps my math skills are insufficient to grok the sense, but I don’t see how increasing the hit Russian depositors are going to take from 10% to 15.6% is going to make frightened parliamentarians any more sanguine about voting for the $75 billion bank heist.<i> </i></p></div>",
  "content_text": "The IMF/EU bank heist is being put on hold because\nthe president can’t get the votes\nto approve the theft.  Zerohedge reports:\nMoments ago the state-run CYBC media reported perhaps the most material news ahead of tomorrow’s Cyprus parliamentary vote, which at this point will likely be rescheduled once more, for the simple reason that yet another key Cypriot party, DIKO, has come out and decided to vote against the depositor-loss law on the Parliament’s docket tomorrow. This is notable because while yesterday JPM, in its “bazooka” assessment speculated that DIKO would vote for the law which made sense previously as DIKO had supported president Anastasiades in his election bid, which gave a pro-bailout vote a one vote margin. As a result of today’s flip, the party’s 9 votes will now be aligned with the “anti” votes of AKEL  and EDEK, whose combined 33 votes mean the proposed bailout law has no chance of passing as they have the needed 29 votes to block any bail-in out proposal!\nThat’s 33 against and 20 for.  It should be interesting to learn to what extent the EU and the Cypriot president were bluffing when they claimed a financial armageddon would result from a failure of the bailout plan.  I suspect it’s going to look at lot more like the consequences of the US sequester, which absolutely no one in the USA appears to have even noticed.\nJim Sinclair\nnotes\n: “The government leaders in Cyprus are trying to back-pedal right now in\norder to save their lives.  Let me say it again, they are trying to save\ntheir own lives.  Remember, ‘revenge is best served cold.’  This means\nthe revenge never comes at the moment of the miscreant act.  But it will\ncome in time.  To take money from the leading economic\nentities in Russia, is to take money from the former KGB officers, and\ntaking money from them is extremely dangerous.  I think the reality has\nquickly set in for the leaders of Cyprus that they have aided in the\nconfiscation of the most serious and dangerous money you could possibly\ntouch.  It has these leaders more afraid for their lives than their bank\naccounts.”\nUPDATE:\n“the Eurogroup will give Cyprus more flexibility on bank levy, and that Cyprus should safeguard depositors under €100,000, even as the full €5.8 billion deposit goal must still be hit.”\nPerhaps my math skills are insufficient to grok the sense, but I don’t see how increasing the hit Russian depositors are going to take from 10% to 15.6% is going to make frightened parliamentarians any more sanguine about voting for the $75 billion bank heist.",
  "tags": [
    "banks",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-18T19:39:00+00:00"
}