{
  "url": "https://voxday.net/2013/03/31/statewrecked/",
  "scraped_at": "2025-12-14T22:24:34.914876",
  "title": "Statewrecked",
  "date_display": "March 31, 2013",
  "date_iso": "2013-03-31T17:30:00+00:00",
  "date_from_url": "2013-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The next stage in the financial crisis must be coming sooner, rather than later, for the NYT to publish <a href=\"http://www.nytimes.com/2013/03/31/opinion/sunday/sundown-in-america.html\">an open warning like this one</a> by David Stockman:</p><blockquote class=\"tr_bq\"><p> As the federal government and its central-bank sidekick, the Fed, have groped for one goal after another — smoothing out the business cycle, minimizing inflation and unemployment at the same time, rolling out a giant social insurance blanket, promoting homeownership, subsidizing medical care, propping up old industries (agriculture, automobiles) and fostering new ones (“clean” energy, biotechnology) and, above all, bailing out Wall Street — they have now succumbed to overload, overreach and outside capture by powerful interests. The modern Keynesian state is broke, paralyzed and mired in empty ritual incantations about stimulating “demand,” even as it fosters a mutant crony capitalism that periodically lavishes the top 1 percent with speculative windfalls.</p><p>The culprits are bipartisan, though you’d never guess that from the blather that passes for political discourse these days. The state-wreck originated in 1933, when Franklin D. Roosevelt opted for fiat money (currency not fundamentally backed by gold), economic nationalism and capitalist cartels in agriculture and industry….</p><p>The United States is broke — fiscally, morally, intellectually — and the<br> Fed has incited a global currency war (Japan just signed up, the<br> Brazilians and Chinese are angry, and the German-dominated euro zone is<br> crumbling) that will soon overwhelm it. When the latest bubble pops,<br> there will be nothing to stop the collapse. If this sounds like advice<br> to get out of the markets and hide out in cash, it is. </br></br></br></br></br></p></blockquote><p>This would appear to be some sort of warning shot across the bow of Wall Street.  And when he talks about getting out of the markets and hiding out in cash, don’t forget that leaving your money in the bank is absolutely NOT getting into cash.</p></div>",
  "content_text": "The next stage in the financial crisis must be coming sooner, rather than later, for the NYT to publish\nan open warning like this one\nby David Stockman:\nAs the federal government and its central-bank sidekick, the Fed, have groped for one goal after another — smoothing out the business cycle, minimizing inflation and unemployment at the same time, rolling out a giant social insurance blanket, promoting homeownership, subsidizing medical care, propping up old industries (agriculture, automobiles) and fostering new ones (“clean” energy, biotechnology) and, above all, bailing out Wall Street — they have now succumbed to overload, overreach and outside capture by powerful interests. The modern Keynesian state is broke, paralyzed and mired in empty ritual incantations about stimulating “demand,” even as it fosters a mutant crony capitalism that periodically lavishes the top 1 percent with speculative windfalls.\nThe culprits are bipartisan, though you’d never guess that from the blather that passes for political discourse these days. The state-wreck originated in 1933, when Franklin D. Roosevelt opted for fiat money (currency not fundamentally backed by gold), economic nationalism and capitalist cartels in agriculture and industry….\nThe United States is broke — fiscally, morally, intellectually — and the\nFed has incited a global currency war (Japan just signed up, the\nBrazilians and Chinese are angry, and the German-dominated euro zone is\ncrumbling) that will soon overwhelm it. When the latest bubble pops,\nthere will be nothing to stop the collapse. If this sounds like advice\nto get out of the markets and hide out in cash, it is.\nThis would appear to be some sort of warning shot across the bow of Wall Street.  And when he talks about getting out of the markets and hiding out in cash, don’t forget that leaving your money in the bank is absolutely NOT getting into cash.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-31T16:30:00+00:00"
}