{
  "url": "https://voxday.net/2013/03/22/the-secret-names-of-seleno/",
  "scraped_at": "2025-12-14T22:23:47.645155",
  "title": "The Secret Names of Selenoth",
  "date_display": "March 22, 2013",
  "date_iso": "2013-03-22T14:00:00+00:00",
  "date_from_url": "2013-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Daniel reviews <a href=\"http://www.amazon.com/Throne-Bones-Arts-Light-ebook/dp/B00AHK8LGI/ref=sr_1_1?s=digital-text&amp;ie=UTF8&amp;qid=1354668010&amp;sr=1-1\"><i>A Throne of Bones</i></a> from a literary perspective:</p><blockquote class=\"tr_bq\"><p> Subtext flows fast through the story, providing a skeleton that never<br> shows through the story’s skirts. However, if you want elegant critiques<br> on the distancing effects of television, the nature of cruelty, the<br> excellence of warfare, the culture of the Church, the narrowness of<br> postmodern expectation, the daft inner workings of pseudoscience, the<br> shortcomings of theory versus application, the invisible nature of<br> Modalism, or the psychological impact of human flight you’ll find them,<br> like a rake in his prime, waiting, ready and rich.</br></br></br></br></br></br></br></p><p>But this is a<br> book designed with a single primary purpose, to revive epic fantasy as a<br> rooted form, and most readers of fantasy are going to receive this<br> story as such.</br></br></br></p><p>They will not be disappointed.</p><p>Names are<br> important in A Throne of Bones, and I’ll highlight two: Selenoth, the<br> continent upon which the action takes is, a nod, I believe, to the<br> element selenium, which occurs naturally in volcanic areas. Considering<br> the photosensitivity of the material, it seems natural that the land<br> provides an elemental basis to the development of Selenoth’s primeval<br> magic.</br></br></br></br></br></br></p><p>Even more interesting, however is the name of the main<br> country: Amorr. Yes, it is a play on the legendary “secret name” of<br> Rome, which provides a clever signal that this strange society will in<br> some way mirror the Roman republic. However, more deeply, it is also a<br> direct tip to the Latin word for “love” and this is where, if the magic<br> of Selenoth draws the bow, the arrow of Amorr strikes the heart.</br></br></br></br></br></p><p>Day<br> is, after all, an incorrigible romantic, and not of the hopeless<br> variety. The nostalgia, realism and richness of Selenoth is crystalized<br> through the lens of Amorr, and, to put a fine point on it, love is all<br> around. Love in degraded, if happy, form in the camp followers and<br> brothels among the soldiery. Love between sibling reavers on a mission<br> to draw former victim states into an alliance against certain doom. In a<br> scene stunning, dreadful, long-coming but still shocking scene, love<br> grips in stoic, complex anguish.*</br></br></br></br></br></br></br></br></p><p>The raw and needful love<br> between man and wife. Long-distance love between the clever (yet<br> earnest) and the cruel (yet sympathetic). Love of complex relational<br> intrigues. Love of language. Love of order. Love of family, of honor, of<br> duty.</br></br></br></br></p><p>Love of dragons. Love of gold. Love of knowledge. Love of<br> good men, of good life, of good death. A love of the hope that all<br> things, not some or most, will pass away, and yet that all things, not<br> some or most, will be restored by the hand of the Almighty. Every page,<br> for its grit and realism, its tragedy, folly and danger, the thwarted<br> plans, curses, whoredom, brutality, the death of youth, the loss of<br> ideals, the temporary victory of murder and evil, is an out and out love<br> letter to the Immaculate. Death, in all its towering, all-consuming<br> bleakness, is small, and soon to be swallowed by a love so great it lays<br> its life down, and in defeat, quite literally overcomes all.</br></br></br></br></br></br></br></br></br></p><p>A<br> Throne of Bones is doorstopping fantasy for far more than its physical<br> dimensions. Metaphysically, it shuts the door to the world we know and<br> provides an escape to a better reality, and one far more dangerous than<br> the one in which we now dwell. It expresses longings (to master dragons,<br> to find treasure, to save the world on a mission from God, to restore<br> and enjoy the family, to live abundantly and in reality, enjoy and<br> defend the relationships that matter, and many, many more) in such<br> richness of detail.</br></br></br></br></br></br></br></br></p><p>An aside: fantasists are the bastard children<br> of organized theology. I don’t mean that fantasy is allegory, and<br> certainly not direct, symbol for symbol theology. Instead due in part to<br> the fact that every fantasy, from Phantastes to His Dark Materials, are<br> created worlds that don’t pop into existence at random. They each have<br> creators who can’t help that they leave traces of themselves in the<br> handiwork of their model worlds. While science fiction is typically a<br> practical exercise or applied thought experiment in galactic or atomic<br> creation, fantasy distinguishes itself by fabricating the middle ground:<br> the world as it is commonly known. A Throne of Bones expresses a<br> theology that views an Almighty who is coming to restore all things, and<br> the things, even in corrupted state, have their origins in good. Evil<br> is small and dark and nothing, whose major temporary advantage is its<br> ability to poison hope and occlude the truth.</br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Ensoulment, the<br> major theme of the previous novel in the series, Summa Elvetica, gets to<br> play in A Throne of Bones in a way that was impossible when it was the<br/> primary pack mule for the plot of the previous work. As previously<br/> established, love is not possible without ensoulment. What is most<br/> fascinating is to see the care in which the author has ensouled each of<br/> his own characters, down to the idiotically short-lived and naturally<br/> evil goblin cannon fodder.</br></br></p><p>Forget if elves might be ensouled. Can goblins win a fight?</p><p>The<br/> book has tremendous surf. There are waves of no fewer than seven<br/> chapters that are powerful, climactic, moving: not just great writing,<br/> but great in meaning. I have been surprised to see (more than once)<br/> complaints about dropped plot threads (such as the dragon) which to me<br/> were quite obviously not dropped, characters that do not naturally<br/> develop (such as Severa) who seems to me to very naturally develop and<br/> comparisons to A Song of Ice and Fire where I see very little<br/> resemblance.</p><p>A major criticism I have of the book is something I<br/> naturally expected after reading a chapter or two: music. The book<br/> itself is not lyrical, but technical (though elegant in technique), but<br/> the world of Selenoth, especially with its peculiar response to the<br/> Immaculate, simply cries out for various bits of poetry, hymn and common<br/> song to be in greater evidence. Aside from a muscular (and welcome)<br/> public recitation of poetry (during which Corvus, the listener, falls<br/> asleep!) they are not.</p><p>I know, I know. Bad form knocking a book<br/> an entire half-star (out of ten) for what it did not include, but it<br/> really was that noticeable. It isn’t like the author hasn’t included<br/> poetics in previous works: the decision had to be conscious, and all I<br/> can say is that I missed the music. The reader gets smells, sights,<br/> sounds, textures and action, but the lack of music is curious. The<br/> lyrics are there, mixed in with more mundane plot-drivers – they are<br/> simply not drawn out and set to music to make it more obvious for the<br/> reader. There are prayers, but no psalms.</p><p>On the other hand,<br/> despite an off-hand reference to musicians, there are also no minstrel<br/> bards to be found, and of that I can’t complain.</p><p>Despite its<br/> length, A Throne of Bones is a fast read, and perhaps would benefit from<br/> the occasional gear-shifting song cycle or original poem, just to<br/> remind the reader to linger and look around a moment longer.</p><p>Of<br/> course, to truly succeed, the series will need to out-do itself until<br/> the penultimate book (where, if the series is to be great, it must peak,<br/> then echo that peak through the final book and achieve an elegant<br/> slight downslope), which will certainly be a challenge, perhaps an epic<br/> one. However, I simply can’t express the joy in knowing this is a<br/> planned set – a part of a larger story (but don’t worry, this one stands<br/> just fine on its own. Though it ends with a satisfying suspense, it is<br/> no annoying cliffhanger. It will build expectation for what comes next,<br/> but also satisfies.) – and that I have only just begun a lifelong escape<br/> into the reality of Selenoth and Amorr: or, as I think of their secret<br/> names – Magic and Love.</p><p>A Throne of Bones (Vox Day, Hardcover Edition)<br/> 9 out of 10</p><p>*One<br/> note on this, yet trying to avoid major spoilers* – the scene of<br/> anguish is subtle and intensely complex, and argues, in a very brief<br/> moment, a detailed theological argument. I view it as a significant<br/> underpinning to the way the world of Selenoth “works” from a creator’s<br/> point of view – a creator who fully intends to restore all things, and<br/> one who therefore allows space for a man to work out many critical and<br/> seemingly impossible choices for himself.</p></blockquote><p>While every author enjoys knowing that his readers enjoy his work and appreciates support, it is a particular pleasure to read substantive reviews written by those readers who not only enjoy the book, but show a deeper understanding of it as well.  Daniel is too generous, I think, in that while there was some development of Severa’s character it was too crude and clumsy due to the time constraints; I tend to find female characters more difficult to write because their motivations and thought processes are so different from my own.  And his criticism concerning the lack of music is well-placed; there is a distinct lack of melody to accompany the constant rhythm of the legions on the march.</p><p>I did, however, agree with him concerning how neither dragon story amounted to any sort of dropped plot-thread.  While I freely admit to favoring subtlety and dropping hints to labored explanations of precisely what happened in all circumstances, that’s not the same as simply leaving a plot point unaddressed. My philosophy is to refrain from telling the reader any more than the perspective character can reasonably expect to know, and I’m not going to divert a character’s inner dialogue for the purposes of exposition any more than is absolutely necessary. </p><p>I was impressed that Daniel correctly nailed both meanings of the city’s name; those who thought it was simply a singularly inept attempt to disguise the name of Rome clearly don’t know much about Roman history.  There are various theories concerning what Pliny described as “the other name of Rome which it is held sinful to disclose except during the rites of the mysteries”; some say it was Amor, others Hirpa.  I incline towards the Amor theory myself, thanks to a number of historical plays on words in both Latin and Greek that juxtapose Roma, Amor, and Eros.</p><p>Anyhow, I take this sort of review as a challenge to, as Daniel suggests, see each book outdo the next.  I don’t know if my skills are up to the task, but if I fail it will not be through a failure to try.</p><p>In related news, I expect Hinterlands to release <i>The Wardog’s Coin</i> in ebook next week, which will consist of the title story and “Qalabi Dawn”.  For those who would like to obtain a physical copy of the ebooks, Hinterlands will be publishing a hardcover version of <i>Summa Elvetica</i> in May, that will possess a newly designed spine to match those of the <i>Arts of Dark and Light</i> series, and in addition to the titular novel, will contain the following stories: “Master of Cats”, “Birth of an Order”, “A Magic Broken”, “The Wardog’s Coin”, “Qalabi Dawn”, “The Hoblets of Wiccam Fensboro”, and “The Last Witchking”.  I don’t know the exact page count yet, but it should be around 450 pages.</p></div>",
  "content_text": "Daniel reviews\nA Throne of Bones\nfrom a literary perspective:\nSubtext flows fast through the story, providing a skeleton that never\nshows through the story’s skirts. However, if you want elegant critiques\non the distancing effects of television, the nature of cruelty, the\nexcellence of warfare, the culture of the Church, the narrowness of\npostmodern expectation, the daft inner workings of pseudoscience, the\nshortcomings of theory versus application, the invisible nature of\nModalism, or the psychological impact of human flight you’ll find them,\nlike a rake in his prime, waiting, ready and rich.\nBut this is a\nbook designed with a single primary purpose, to revive epic fantasy as a\nrooted form, and most readers of fantasy are going to receive this\nstory as such.\nThey will not be disappointed.\nNames are\nimportant in A Throne of Bones, and I’ll highlight two: Selenoth, the\ncontinent upon which the action takes is, a nod, I believe, to the\nelement selenium, which occurs naturally in volcanic areas. Considering\nthe photosensitivity of the material, it seems natural that the land\nprovides an elemental basis to the development of Selenoth’s primeval\nmagic.\nEven more interesting, however is the name of the main\ncountry: Amorr. Yes, it is a play on the legendary “secret name” of\nRome, which provides a clever signal that this strange society will in\nsome way mirror the Roman republic. However, more deeply, it is also a\ndirect tip to the Latin word for “love” and this is where, if the magic\nof Selenoth draws the bow, the arrow of Amorr strikes the heart.\nDay\nis, after all, an incorrigible romantic, and not of the hopeless\nvariety. The nostalgia, realism and richness of Selenoth is crystalized\nthrough the lens of Amorr, and, to put a fine point on it, love is all\naround. Love in degraded, if happy, form in the camp followers and\nbrothels among the soldiery. Love between sibling reavers on a mission\nto draw former victim states into an alliance against certain doom. In a\nscene stunning, dreadful, long-coming but still shocking scene, love\ngrips in stoic, complex anguish.*\nThe raw and needful love\nbetween man and wife. Long-distance love between the clever (yet\nearnest) and the cruel (yet sympathetic). Love of complex relational\nintrigues. Love of language. Love of order. Love of family, of honor, of\nduty.\nLove of dragons. Love of gold. Love of knowledge. Love of\ngood men, of good life, of good death. A love of the hope that all\nthings, not some or most, will pass away, and yet that all things, not\nsome or most, will be restored by the hand of the Almighty. Every page,\nfor its grit and realism, its tragedy, folly and danger, the thwarted\nplans, curses, whoredom, brutality, the death of youth, the loss of\nideals, the temporary victory of murder and evil, is an out and out love\nletter to the Immaculate. Death, in all its towering, all-consuming\nbleakness, is small, and soon to be swallowed by a love so great it lays\nits life down, and in defeat, quite literally overcomes all.\nA\nThrone of Bones is doorstopping fantasy for far more than its physical\ndimensions. Metaphysically, it shuts the door to the world we know and\nprovides an escape to a better reality, and one far more dangerous than\nthe one in which we now dwell. It expresses longings (to master dragons,\nto find treasure, to save the world on a mission from God, to restore\nand enjoy the family, to live abundantly and in reality, enjoy and\ndefend the relationships that matter, and many, many more) in such\nrichness of detail.\nAn aside: fantasists are the bastard children\nof organized theology. I don’t mean that fantasy is allegory, and\ncertainly not direct, symbol for symbol theology. Instead due in part to\nthe fact that every fantasy, from Phantastes to His Dark Materials, are\ncreated worlds that don’t pop into existence at random. They each have\ncreators who can’t help that they leave traces of themselves in the\nhandiwork of their model worlds. While science fiction is typically a\npractical exercise or applied thought experiment in galactic or atomic\ncreation, fantasy distinguishes itself by fabricating the middle ground:\nthe world as it is commonly known. A Throne of Bones expresses a\ntheology that views an Almighty who is coming to restore all things, and\nthe things, even in corrupted state, have their origins in good. Evil\nis small and dark and nothing, whose major temporary advantage is its\nability to poison hope and occlude the truth.\nEnsoulment, the\nmajor theme of the previous novel in the series, Summa Elvetica, gets to\nplay in A Throne of Bones in a way that was impossible when it was the\nprimary pack mule for the plot of the previous work. As previously\nestablished, love is not possible without ensoulment. What is most\nfascinating is to see the care in which the author has ensouled each of\nhis own characters, down to the idiotically short-lived and naturally\nevil goblin cannon fodder.\nForget if elves might be ensouled. Can goblins win a fight?\nThe\nbook has tremendous surf. There are waves of no fewer than seven\nchapters that are powerful, climactic, moving: not just great writing,\nbut great in meaning. I have been surprised to see (more than once)\ncomplaints about dropped plot threads (such as the dragon) which to me\nwere quite obviously not dropped, characters that do not naturally\ndevelop (such as Severa) who seems to me to very naturally develop and\ncomparisons to A Song of Ice and Fire where I see very little\nresemblance.\nA major criticism I have of the book is something I\nnaturally expected after reading a chapter or two: music. The book\nitself is not lyrical, but technical (though elegant in technique), but\nthe world of Selenoth, especially with its peculiar response to the\nImmaculate, simply cries out for various bits of poetry, hymn and common\nsong to be in greater evidence. Aside from a muscular (and welcome)\npublic recitation of poetry (during which Corvus, the listener, falls\nasleep!) they are not.\nI know, I know. Bad form knocking a book\nan entire half-star (out of ten) for what it did not include, but it\nreally was that noticeable. It isn’t like the author hasn’t included\npoetics in previous works: the decision had to be conscious, and all I\ncan say is that I missed the music. The reader gets smells, sights,\nsounds, textures and action, but the lack of music is curious. The\nlyrics are there, mixed in with more mundane plot-drivers – they are\nsimply not drawn out and set to music to make it more obvious for the\nreader. There are prayers, but no psalms.\nOn the other hand,\ndespite an off-hand reference to musicians, there are also no minstrel\nbards to be found, and of that I can’t complain.\nDespite its\nlength, A Throne of Bones is a fast read, and perhaps would benefit from\nthe occasional gear-shifting song cycle or original poem, just to\nremind the reader to linger and look around a moment longer.\nOf\ncourse, to truly succeed, the series will need to out-do itself until\nthe penultimate book (where, if the series is to be great, it must peak,\nthen echo that peak through the final book and achieve an elegant\nslight downslope), which will certainly be a challenge, perhaps an epic\none. However, I simply can’t express the joy in knowing this is a\nplanned set – a part of a larger story (but don’t worry, this one stands\njust fine on its own. Though it ends with a satisfying suspense, it is\nno annoying cliffhanger. It will build expectation for what comes next,\nbut also satisfies.) – and that I have only just begun a lifelong escape\ninto the reality of Selenoth and Amorr: or, as I think of their secret\nnames – Magic and Love.\nA Throne of Bones (Vox Day, Hardcover Edition)\n9 out of 10\n*One\nnote on this, yet trying to avoid major spoilers* – the scene of\nanguish is subtle and intensely complex, and argues, in a very brief\nmoment, a detailed theological argument. I view it as a significant\nunderpinning to the way the world of Selenoth “works” from a creator’s\npoint of view – a creator who fully intends to restore all things, and\none who therefore allows space for a man to work out many critical and\nseemingly impossible choices for himself.\nWhile every author enjoys knowing that his readers enjoy his work and appreciates support, it is a particular pleasure to read substantive reviews written by those readers who not only enjoy the book, but show a deeper understanding of it as well.  Daniel is too generous, I think, in that while there was some development of Severa’s character it was too crude and clumsy due to the time constraints; I tend to find female characters more difficult to write because their motivations and thought processes are so different from my own.  And his criticism concerning the lack of music is well-placed; there is a distinct lack of melody to accompany the constant rhythm of the legions on the march.\nI did, however, agree with him concerning how neither dragon story amounted to any sort of dropped plot-thread.  While I freely admit to favoring subtlety and dropping hints to labored explanations of precisely what happened in all circumstances, that’s not the same as simply leaving a plot point unaddressed. My philosophy is to refrain from telling the reader any more than the perspective character can reasonably expect to know, and I’m not going to divert a character’s inner dialogue for the purposes of exposition any more than is absolutely necessary.\nI was impressed that Daniel correctly nailed both meanings of the city’s name; those who thought it was simply a singularly inept attempt to disguise the name of Rome clearly don’t know much about Roman history.  There are various theories concerning what Pliny described as “the other name of Rome which it is held sinful to disclose except during the rites of the mysteries”; some say it was Amor, others Hirpa.  I incline towards the Amor theory myself, thanks to a number of historical plays on words in both Latin and Greek that juxtapose Roma, Amor, and Eros.\nAnyhow, I take this sort of review as a challenge to, as Daniel suggests, see each book outdo the next.  I don’t know if my skills are up to the task, but if I fail it will not be through a failure to try.\nIn related news, I expect Hinterlands to release\nThe Wardog’s Coin\nin ebook next week, which will consist of the title story and “Qalabi Dawn”.  For those who would like to obtain a physical copy of the ebooks, Hinterlands will be publishing a hardcover version of\nSumma Elvetica\nin May, that will possess a newly designed spine to match those of the\nArts of Dark and Light\nseries, and in addition to the titular novel, will contain the following stories: “Master of Cats”, “Birth of an Order”, “A Magic Broken”, “The Wardog’s Coin”, “Qalabi Dawn”, “The Hoblets of Wiccam Fensboro”, and “The Last Witchking”.  I don’t know the exact page count yet, but it should be around 450 pages.",
  "tags": [
    "books",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-22T14:00:00+00:00"
}