{
  "url": "https://voxday.net/2013/03/27/the-wardogs-coin/",
  "scraped_at": "2025-12-14T22:24:12.277166",
  "title": "The Wardog’s Coin",
  "date_display": "March 27, 2013",
  "date_iso": "2013-03-27T13:00:00+00:00",
  "date_from_url": "2013-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://2.bp.blogspot.com/-fLBbLCx8giw/UVJ_sU9F3JI/AAAAAAAAAcA/qjHoCEZWktc/s1600/TWC_900b.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2013/03/TWC_900b.jpg\" width=\"213\"/></a></div><p>I am pleased to announce that Hinterlands has released <a href=\"http://www.amazon.com/The-Wardogs-Coin-ebook/dp/B00C1TMVBY\">THE WARDOG’S COIN</a>, an 85-page ebook that consists of the title novella and a novelette, both of which are set in Selenoth, the world of A THRONE OF BONES.  It is available on Amazon for $1.99.</p><p>The title story is about a human mercenary company which finds itself in<br> the employ of an elf king. Outnumbered and under attack from an army of<br> orcs and goblins, the Company discovers it is no longer fighting for<br> pay, but for survival in an alien land. The second story, Qalabi Dawn, features a young<br> tribal chieftain, Shabaka No-Tail, who seeks to find a way to unite the<br> fractious tribes of The People before the implacable legions of the Dead<br> God invade the desert to carry out their crusade of total<br> extermination. In both stories, the borders of the world of Selenoth as it is known to the reader are expanded to some small extent.</br></br></br></br></br></br></br></p><p>Thanks to Jartstar, who did an excellent job on the cover.  Look very closely at the coin; the level of detail there is remarkable. Thanks also to the four proofreaders; this ebook should be considerably cleaner from the get-go than its predecessors.  Also, to celebrate the new publication, Hinterlands is giving away <a href=\"http://www.amazon.com/dp/B009OP9G0C\">A Magic Broken</a> for free on Amazon today.</p></div>",
  "content_text": "I am pleased to announce that Hinterlands has released\nTHE WARDOG’S COIN\n, an 85-page ebook that consists of the title novella and a novelette, both of which are set in Selenoth, the world of A THRONE OF BONES.  It is available on Amazon for $1.99.\nThe title story is about a human mercenary company which finds itself in\nthe employ of an elf king. Outnumbered and under attack from an army of\norcs and goblins, the Company discovers it is no longer fighting for\npay, but for survival in an alien land. The second story, Qalabi Dawn, features a young\ntribal chieftain, Shabaka No-Tail, who seeks to find a way to unite the\nfractious tribes of The People before the implacable legions of the Dead\nGod invade the desert to carry out their crusade of total\nextermination. In both stories, the borders of the world of Selenoth as it is known to the reader are expanded to some small extent.\nThanks to Jartstar, who did an excellent job on the cover.  Look very closely at the coin; the level of detail there is remarkable. Thanks also to the four proofreaders; this ebook should be considerably cleaner from the get-go than its predecessors.  Also, to celebrate the new publication, Hinterlands is giving away\nA Magic Broken\nfor free on Amazon today.",
  "tags": [
    "books",
    "Selenoth"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-27T13:00:00+00:00"
}