{
  "url": "https://voxday.net/2013/03/13/white-smoke-spotted/",
  "scraped_at": "2025-12-14T22:22:56.467415",
  "title": "White smoke spotted",
  "date_display": "March 13, 2013",
  "date_iso": "2013-03-13T18:24:00+00:00",
  "date_from_url": "2013-03-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"ap-story-p\"> <i>“The Catholic church has chosen a new pope. White<br> smoke is billowing from the chimney of the Sistine Chapel, meaning 115<br> cardinals in a papal conclave have elected a new leader for the world’s<br> 1.2 billion Catholics. The new pope is<br> expected to appear on the balcony of St. Peter’s Basilica within an<br> hour, after a church official announces “Habemus Papum” – “We have a<br> pope” – and gives the name of the new pontiff in Latin.”</br></br></br></br></br></br></i></div><div class=\"ap-story-p\"></div><div class=\"ap-story-p\"> And a million conspiracy theorists held their breath… and were disappointed.<p><i>“Cardinal Jorge Bergoglio from Argentina has been elected the new leader of the Catholic Church. The 76-year-old – now known as Pope Francis I — was the archbishop of Buenos Aries and was appointed by Pope John Paul II.</i><i> Bergoglio became the first pope from the Americas elected and the first from outside Europe in more than a millenium.”</i></p></div></div>",
  "content_text": "“The Catholic church has chosen a new pope. White\nsmoke is billowing from the chimney of the Sistine Chapel, meaning 115\ncardinals in a papal conclave have elected a new leader for the world’s\n1.2 billion Catholics. The new pope is\nexpected to appear on the balcony of St. Peter’s Basilica within an\nhour, after a church official announces “Habemus Papum” – “We have a\npope” – and gives the name of the new pontiff in Latin.”\nAnd a million conspiracy theorists held their breath… and were disappointed.\n“Cardinal Jorge Bergoglio from Argentina has been elected the new leader of the Catholic Church. The 76-year-old – now known as Pope Francis I — was the archbishop of Buenos Aries and was appointed by Pope John Paul II.\nBergoglio became the first pope from the Americas elected and the first from outside Europe in more than a millenium.”",
  "tags": [
    "Christianity",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-13T18:24:00+00:00"
}