{
  "url": "https://voxday.net/2013/03/21/wre-technology-conference-edition/",
  "scraped_at": "2025-12-14T22:23:40.652176",
  "title": "WRE: technology conference edition",
  "date_display": "March 21, 2013",
  "date_iso": "2013-03-21T08:56:00+00:00",
  "date_from_url": "2013-03-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is customary for women to lament the way men are openly hostile to their presence when they insert themselves into hacker fests and technology conferences.  And yet, it is hardly difficult to understand why men tend to be less than enthusiastic about opening themselves up to be <a href=\"http://venturebeat.com/2013/03/20/playhaven-developer-fired-for-making-sexual-jokes-after-sendgrids-developer-evangelist-outs-him-on-twitter/#Q7WlkHdBR2L1HojU.99\">patrolled by volunteer speech police</a> and self-appointed equality cops.</p><blockquote class=\"tr_bq\"><p> A Playhaven developer was fired after making sexual jokes in the audience during a keynote session at PyCon, a conference for Python developers. Now Adria Richards, a developer evangelist for SendGrid, is getting rape and death threats via Twitter.</p><p>Richards was sitting in the audience immediately in front of two developers. After someone made a comment about forking a software repository, the two began making jokes about forking in a sexual manner, and “big dongles.” After listening for some time, Richards got fed up, took a picture of the two, and posted it to Twitter:</p><p>    Not cool.Jokes about forking repo’s in a sexual way and “big” dongles.Right behind me #pycon twitter.com/adriarichards/…<br>     — Adria Richards (@adriarichards) March 17, 2013</br></p><p>One of those two developers is Alex Reid, an engineer at PlayHaven, the mobile gaming monetization and marketing company. The developer on the left, whose name is not yet known but goes by mr-hank on Hacker News, was apparently fired by PlayHaven for the incident.</p></blockquote><p>Adria Richards, having successfully gained the attention she was there to seek, tries to justify her actions in the usual self-lionizing language: “Adria Richards explained her perspective on her blog, <a href=\"http://butyoureagirl.com/14015/forking-and-dongle-jokes-dont-belong-at-tech-conferences/\" rel=\"noopener\" target=\"_blank\">But You’re a Girl</a>,<br> saying that she took the comments for as long as she could, but when<br> she saw a picture of a little girl onstage, she felt she needed to make a<br> stand for her, and all the women who have not considered technology as a<br> career path “because the ass clowns behind me would make it impossible<br> for her to do so.”</br></br></br></br></br></p><p>What Richards clearly doesn’t realize is that she is the parasitical ass clown making it more difficult for women to pursue technology as a career path.  What sort of idiot employer would want to hire disruptive, self-seeking, controlling employees actively looking for causes to fight instead good engineers who will simply do their jobs and may happen to tell a mildly offensive joke now and then in the process?  At this point, I have no doubt that the conference organizers are regretting their decision to permit Adria Richards to attend.</p><p>After all, who wants to attend the sort of conference where merely being overheard by a fellow attendee comes with a proven risk of losing your job?  I’m not a Python developer, but if I was, I’d certainly wouldn’t bother to clear a spot on my calendar for it.  And as a game developer, I’m certainly going to be looking at PlayHaven with a deeply skeptical eye going forward.</p><p>As one female developer – in other words a woman who actually works in the industry, as opposed to patrols it on behalf of her equalitarian ideology – correctly observed: <i>“Honestly, I feel like this kind of crazy shit makes it harder for women to manage in tech.”</i>  It does.  It absolutely does. People like Richards are parasites who have no place in technology because they contribute nothing, they create nothing, they construct nothing, they only destroy.  They only seek to destroy.</p><p>Even the lowly white knights who desperately desire to be considered good and proper equalitarians <a href=\"http://pastebin.com/JaNh0w5F\">understand the problem</a>:  <i>“She damages the reputation of everyone trying to make this industry more<br> female-friendly. She’s done the opposite of making men and women feel<br> more comfortable working together; now men will be looking over their<br> shoulder every time a woman is present in the workplace or a conference<br> because hey, she might do what Adria did. This is not an environment<br> anyone wants to work in.”</br></br></br></br></br></i></p><p>It is reported that 20 percent of  the 2013 attendees at PyCon were female.  If the men who attended this year have any sense at all, that percentage will be considerably higher next year.  Meanwhile, those of us who don’t give a quantum of a damn about making “industry more female-friendly”, but are focused on creating compelling, entertaining, and useful technologies, see our skepticism vindicated.  Again.</p><p>UPDATE:  Apparently SendGrid was unimpressed with their employees decision to evangelize feminist speech control rather than SMTP relay services.  It is a wise move on their part, and should serve as an object lesson to other would-be though police.</p><p><i>“Effective immediately, SendGrid has terminated the employment of Adria Richards. While we generally are sensitive and confidential with respect to employee matters, the situation has taken on a public nature. We have taken action that we believe is in the overall best interests of SendGrid, its employees, and our customers. As we continue to process the vast amount of information, we will post something more comprehensive.</i>“</p></div>",
  "content_text": "It is customary for women to lament the way men are openly hostile to their presence when they insert themselves into hacker fests and technology conferences.  And yet, it is hardly difficult to understand why men tend to be less than enthusiastic about opening themselves up to be\npatrolled by volunteer speech police\nand self-appointed equality cops.\nA Playhaven developer was fired after making sexual jokes in the audience during a keynote session at PyCon, a conference for Python developers. Now Adria Richards, a developer evangelist for SendGrid, is getting rape and death threats via Twitter.\nRichards was sitting in the audience immediately in front of two developers. After someone made a comment about forking a software repository, the two began making jokes about forking in a sexual manner, and “big dongles.” After listening for some time, Richards got fed up, took a picture of the two, and posted it to Twitter:\nNot cool.Jokes about forking repo’s in a sexual way and “big” dongles.Right behind me #pycon twitter.com/adriarichards/…\n— Adria Richards (@adriarichards) March 17, 2013\nOne of those two developers is Alex Reid, an engineer at PlayHaven, the mobile gaming monetization and marketing company. The developer on the left, whose name is not yet known but goes by mr-hank on Hacker News, was apparently fired by PlayHaven for the incident.\nAdria Richards, having successfully gained the attention she was there to seek, tries to justify her actions in the usual self-lionizing language: “Adria Richards explained her perspective on her blog,\nBut You’re a Girl\n,\nsaying that she took the comments for as long as she could, but when\nshe saw a picture of a little girl onstage, she felt she needed to make a\nstand for her, and all the women who have not considered technology as a\ncareer path “because the ass clowns behind me would make it impossible\nfor her to do so.”\nWhat Richards clearly doesn’t realize is that she is the parasitical ass clown making it more difficult for women to pursue technology as a career path.  What sort of idiot employer would want to hire disruptive, self-seeking, controlling employees actively looking for causes to fight instead good engineers who will simply do their jobs and may happen to tell a mildly offensive joke now and then in the process?  At this point, I have no doubt that the conference organizers are regretting their decision to permit Adria Richards to attend.\nAfter all, who wants to attend the sort of conference where merely being overheard by a fellow attendee comes with a proven risk of losing your job?  I’m not a Python developer, but if I was, I’d certainly wouldn’t bother to clear a spot on my calendar for it.  And as a game developer, I’m certainly going to be looking at PlayHaven with a deeply skeptical eye going forward.\nAs one female developer – in other words a woman who actually works in the industry, as opposed to patrols it on behalf of her equalitarian ideology – correctly observed:\n“Honestly, I feel like this kind of crazy shit makes it harder for women to manage in tech.”\nIt does.  It absolutely does. People like Richards are parasites who have no place in technology because they contribute nothing, they create nothing, they construct nothing, they only destroy.  They only seek to destroy.\nEven the lowly white knights who desperately desire to be considered good and proper equalitarians\nunderstand the problem\n:\n“She damages the reputation of everyone trying to make this industry more\nfemale-friendly. She’s done the opposite of making men and women feel\nmore comfortable working together; now men will be looking over their\nshoulder every time a woman is present in the workplace or a conference\nbecause hey, she might do what Adria did. This is not an environment\nanyone wants to work in.”\nIt is reported that 20 percent of  the 2013 attendees at PyCon were female.  If the men who attended this year have any sense at all, that percentage will be considerably higher next year.  Meanwhile, those of us who don’t give a quantum of a damn about making “industry more female-friendly”, but are focused on creating compelling, entertaining, and useful technologies, see our skepticism vindicated.  Again.\nUPDATE:  Apparently SendGrid was unimpressed with their employees decision to evangelize feminist speech control rather than SMTP relay services.  It is a wise move on their part, and should serve as an object lesson to other would-be though police.\n“Effective immediately, SendGrid has terminated the employment of Adria Richards. While we generally are sensitive and confidential with respect to employee matters, the situation has taken on a public nature. We have taken action that we believe is in the overall best interests of SendGrid, its employees, and our customers. As we continue to process the vast amount of information, we will post something more comprehensive.\n“",
  "tags": [
    "technology",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-03-21T08:56:00+00:00"
}