{
  "url": "https://voxday.net/2023/08/18/cyberpunk-the-revival/",
  "scraped_at": "2026-01-08T14:06:29.609225",
  "title": "Cyberpunk: The Revival",
  "date_display": "August 18, 2023",
  "date_iso": "2023-08-18T15:41:56+00:00",
  "date_from_url": "2023-08-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Original Cyberpunk is celebrating 40 years of an original American literary style by putting together a special edition of<em> Stupefying Stories</em> <a href=\"https://stupefyingstories.blogspot.com/2023/08/remembering-future-40-years-with.html\">dedicated to cyberpunk</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The question here for SF writers is: okay, posit that our students now all have Rocketbooks. We know what it’s designed to do and how it’s supposed to be used. Now, how will our characters misuse it, for things they aren’t supposed to do?</p><p>That, to me, remains the core question of cyberpunk. What makes a technology disruptive isn’t using it in the way the people who created it intended it should be used. Those people can only think of the right way to use a thing. The disruption comes later, when the people who grew up living with that technology start thinking of all the wrong ways to use it. When this happens, they come up with misuses the creators never dreamed might be possible, because the creators lack the fluency of someone who has grown up speaking the language of the thing.</p><p>So in 1980 I asked myself: in this bright and shiny high-tech future that’s coming in fast and hard, how are socially maladjusted younger people—let’s call them “punks”—living at the bottom of the socioeconomic food chain, going to misuse this tech to get an edge over the eloi living above them?</p><p>Then I wrote a story that tried to explore one possible answer to this question.</p><p><em><strong>Sidebar: </strong>Do I really need to explain again how between 1980 and 1982 this story was read and rejected by every short-fiction editor then working in SF publishing, and it most often came back with the standard, “Nice try kid, real close,” quasi-personal brush-off so often given to young and unknown writers?</em></p><p>Cyberpunk science fiction blossomed brilliantly and failed rapidly in the late 1980s to early 1990s, because the same thing happened to cyberpunk as happens to every other successful new thing in any branch of pop culture. At first it was a wonderful breath of fresh air into a stale and dying genre, as scores of new people with new talents and new ideas flooded into writing SF. Then publishers fixated on the commercial success of <em>Neuromancer</em>, and in a few short years cyberpunk fiction went from being something unexpected, fresh, and wildly original to being a trendy fashion statement—to being the flavor of the month—to being a hoary trope, complete with a set of stylistic markers and time-honored forms as immutable as an IEEE standard, to which one must pay heed if one is to write True Cyberpunk. It became, for the most part, <em>Neuromancer </em>fanfic, and the market was soon glutted with an enormous amount of “me too” work that copied the style of the genre’s pioneers but added nothing new to the vocabulary.</p><p>Whereupon cyberpunk fiction, as a genre, suffocated on its own vomit and died.</p><p>Now it’s 2023, and the 40th anniversary of the first magazine publication of “Cyberpunk” is fast approaching. It feels necessary to do something to mark the occasion, so right now we’re reading submissions for an all-cyberpunk issue of <em>Stupefying Stories</em>. No grand ambitions, this time. No book proposals. To do something like Cyberpunk 2.0 now would require either the backing of a major publisher, which I’m unlikely to get, or a Kickstarter campaign the likes of which I have neither the time, patience, or knowledge to run. Even if we were to start working on it right now, we couldn’t possibly have Cyberpunk 2.0 finished and released before the summer of 2024.</p><p>So a special issue of <em>Stupefying Stories</em> it is, then. And what I would truly, deeply, dearly love to see in my submissions inbox are at least a few stories that don’t try to recapitulate the 1980s vision of cyberpunk, but instead start fresh, from the baseline of now.</p></blockquote><p>Like many writers my age, some of my earliest attempts at fiction were heavily influenced by <em>Burning Chrome</em>(1), <em>Count Zero</em>(2), and <em>Mona Lisa Overdrive</em>, though most of them were never finished and none survived the transition from my Mac SE through the various PCs I’ve owned.</p><p>But I’ll be making a submission to the Cyberpunk Special Edition, and if you’re one of the established or aspiring authors in the wider Castalia community and its tangential environs, I hope you will too.</p><p>(1) This was very nearly the name of a certain techno band.</p><p>(2) Yep. That was indeed <a href=\"https://www.youtube.com/watch?v=CrE7w6MkP2w\">the reference</a>. We were recording soundtracks to books before we were doing them for games and movies.</p><p><em><a href=\"https://social.infogalactic.com/micropost/17bb98e4-f022-4224-9abe-305558e5170b\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Original Cyberpunk is celebrating 40 years of an original American literary style by putting together a special edition of\nStupefying Stories\ndedicated to cyberpunk\n.\nThe question here for SF writers is: okay, posit that our students now all have Rocketbooks. We know what it’s designed to do and how it’s supposed to be used. Now, how will our characters misuse it, for things they aren’t supposed to do?\nThat, to me, remains the core question of cyberpunk. What makes a technology disruptive isn’t using it in the way the people who created it intended it should be used. Those people can only think of the right way to use a thing. The disruption comes later, when the people who grew up living with that technology start thinking of all the wrong ways to use it. When this happens, they come up with misuses the creators never dreamed might be possible, because the creators lack the fluency of someone who has grown up speaking the language of the thing.\nSo in 1980 I asked myself: in this bright and shiny high-tech future that’s coming in fast and hard, how are socially maladjusted younger people—let’s call them “punks”—living at the bottom of the socioeconomic food chain, going to misuse this tech to get an edge over the eloi living above them?\nThen I wrote a story that tried to explore one possible answer to this question.\nSidebar:\nDo I really need to explain again how between 1980 and 1982 this story was read and rejected by every short-fiction editor then working in SF publishing, and it most often came back with the standard, “Nice try kid, real close,” quasi-personal brush-off so often given to young and unknown writers?\nCyberpunk science fiction blossomed brilliantly and failed rapidly in the late 1980s to early 1990s, because the same thing happened to cyberpunk as happens to every other successful new thing in any branch of pop culture. At first it was a wonderful breath of fresh air into a stale and dying genre, as scores of new people with new talents and new ideas flooded into writing SF. Then publishers fixated on the commercial success of\nNeuromancer\n, and in a few short years cyberpunk fiction went from being something unexpected, fresh, and wildly original to being a trendy fashion statement—to being the flavor of the month—to being a hoary trope, complete with a set of stylistic markers and time-honored forms as immutable as an IEEE standard, to which one must pay heed if one is to write True Cyberpunk. It became, for the most part,\nNeuromancer\nfanfic, and the market was soon glutted with an enormous amount of “me too” work that copied the style of the genre’s pioneers but added nothing new to the vocabulary.\nWhereupon cyberpunk fiction, as a genre, suffocated on its own vomit and died.\nNow it’s 2023, and the 40th anniversary of the first magazine publication of “Cyberpunk” is fast approaching. It feels necessary to do something to mark the occasion, so right now we’re reading submissions for an all-cyberpunk issue of\nStupefying Stories\n. No grand ambitions, this time. No book proposals. To do something like Cyberpunk 2.0 now would require either the backing of a major publisher, which I’m unlikely to get, or a Kickstarter campaign the likes of which I have neither the time, patience, or knowledge to run. Even if we were to start working on it right now, we couldn’t possibly have Cyberpunk 2.0 finished and released before the summer of 2024.\nSo a special issue of\nStupefying Stories\nit is, then. And what I would truly, deeply, dearly love to see in my submissions inbox are at least a few stories that don’t try to recapitulate the 1980s vision of cyberpunk, but instead start fresh, from the baseline of now.\nLike many writers my age, some of my earliest attempts at fiction were heavily influenced by\nBurning Chrome\n(1),\nCount Zero\n(2), and\nMona Lisa Overdrive\n, though most of them were never finished and none survived the transition from my Mac SE through the various PCs I’ve owned.\nBut I’ll be making a submission to the Cyberpunk Special Edition, and if you’re one of the established or aspiring authors in the wider Castalia community and its tangential environs, I hope you will too.\n(1) This was very nearly the name of a certain techno band.\n(2) Yep. That was indeed\nthe reference\n. We were recording soundtracks to books before we were doing them for games and movies.\nDISCUSS ON SG",
  "tags": [
    "history",
    "music",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-08-18T17:54:19+00:00"
}