{
  "url": "https://voxday.net/2023/08/19/dont-make-it-harder/",
  "scraped_at": "2026-01-08T14:06:34.770787",
  "title": "Don’t Make it Harder",
  "date_display": "August 19, 2023",
  "date_iso": "2023-08-19T14:31:35+00:00",
  "date_from_url": "2023-08-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At least, not any harder than it’s going to be. Karl Denninger, a genuine American hero who saved more lives than anyone else I’ve ever known, <a href=\"https://market-ticker.org/akcs-www?post=249527\">warns those under 40</a> that they’ve never seen the sort of economic challenges that are heading their way:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>You’ve never seen tough.</p><p>I mean it.</p><p>No, 2000 wasn’t tough.</p><p>No, 2008 wasn’t tough.</p><p>If you’re 33 now you were ten in 2000. If you’re 40 now you were barely an adult in 2000 and not even born or beyond infancy in the last “actual tough” — the late 1970s and early 1980s.</p><p>I thought that what we face now was likely coming in 2008. I was wrong. People managed to “kick the can” another time, but in doing so we made it a lot worse. What we had to absorb then was about a late 1970s / early 1980s problem. What we did was greatly increase the seriousness of the damage by deferring it for another 10 or so years, and then we wildly added to that when the virus showed up. Maybe the pandemic response was in some part an intentional attempt to evade taking the economic medicine then and maybe not, but whatever the case may be you can’t go backwards and thus here we are.</p><p>What’s coming is going to be worse than the late 1970s or early 80s. It is inescapable. Continuing to try to put it off will simply compound it more and increase the risk that we lose our society entirely. Jerome Powell, chair of The Fed, knows this which is why those who believe he will cut rates “soon” are wrong; he’s not stupid and he is fully aware of what has happened in other nations that kept playing this game one too many times, with no way to know in advance when the next time is “one too many.”</p><p>An utterly huge percentage of people I grew up with, who were coming of age in the late 1970s and early 1980s, are dead. They’re not dead because of a virus, or just natural “stuff” — they’re dead because they slowly killed themselves, usually with drugs or alcohol. This includes someone in my immediate family and a several more within my growing-up social circle — including people I was extremely unhappy to have to cut loose.</p><p>That’s significant because typically other than through accidents or violence (e.g. car wrecks and homicide) statistically nobody dies once you get out of childhood until you get into your late 50s or 60s and the diseases of older age start to catch up with your poor lifestyle or just bad luck and genetics. Yeah, there are exceptions — but not many.</p><p>You don’t want that to happen to you as it often comes with years of disability first and there’s still time — if you act now.</p><p>Hard times are coming folks.</p></blockquote><p>Now, before the younger generation’s dismiss Denninger’s warning as the customary Boomer dramatics about walking uphill to school both ways in the snow, what he is talking about here is <span style=\"text-decoration: underline;\">not</span> the way in which the new normal is more difficult than the old normal. Yes, it’s much harder to get ahead now, it’s much harder get a college degree, to get a good job, or to afford a middle-class lifestyle, and the economic mean has observably declined steadily since real wages peaked in 1973.</p><p>He’s not talking about the current normal. What he’s talking about is genuine economic crisis, when people who own homes can’t keep them, when there are no jobs of any kind to be found, and when interest rates are not only in the double-digits, but the teens, so any kind of financing for anything is completely unaffordable.</p><p>Remember, we didn’t see actual credit deflation after 2008, but mere credit disinflation.</p><p>The point that he’s making is that since times are going to be difficult, don’t make them more difficult for yourself and your family by making stupid and short-sighted decisions, because the consequences are likely to be considerably more serious and long-lasting than the average young individual can reasonably imagine.</p><p>I’ve seen the casualties among my friends and family too. So be smarter than we were. Be better than we were. Because the one thing, perhaps the only thing, that you have going for you is that the GenXers are providing you with the sort of advice that we should have gotten, but for the most part didn’t get, from our predecessors.</p><p>So if you can avoid wasting the decade or so that most of us did, you might actually wind up ahead of the game in the end.</p><p><em><a href=\"https://social.infogalactic.com/micropost/c433d61b-398a-45b2-8a95-be094effa725\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "At least, not any harder than it’s going to be. Karl Denninger, a genuine American hero who saved more lives than anyone else I’ve ever known,\nwarns those under 40\nthat they’ve never seen the sort of economic challenges that are heading their way:\nYou’ve never seen tough.\nI mean it.\nNo, 2000 wasn’t tough.\nNo, 2008 wasn’t tough.\nIf you’re 33 now you were ten in 2000. If you’re 40 now you were barely an adult in 2000 and not even born or beyond infancy in the last “actual tough” — the late 1970s and early 1980s.\nI thought that what we face now was likely coming in 2008. I was wrong. People managed to “kick the can” another time, but in doing so we made it a lot worse. What we had to absorb then was about a late 1970s / early 1980s problem. What we did was greatly increase the seriousness of the damage by deferring it for another 10 or so years, and then we wildly added to that when the virus showed up. Maybe the pandemic response was in some part an intentional attempt to evade taking the economic medicine then and maybe not, but whatever the case may be you can’t go backwards and thus here we are.\nWhat’s coming is going to be worse than the late 1970s or early 80s. It is inescapable. Continuing to try to put it off will simply compound it more and increase the risk that we lose our society entirely. Jerome Powell, chair of The Fed, knows this which is why those who believe he will cut rates “soon” are wrong; he’s not stupid and he is fully aware of what has happened in other nations that kept playing this game one too many times, with no way to know in advance when the next time is “one too many.”\nAn utterly huge percentage of people I grew up with, who were coming of age in the late 1970s and early 1980s, are dead. They’re not dead because of a virus, or just natural “stuff” — they’re dead because they slowly killed themselves, usually with drugs or alcohol. This includes someone in my immediate family and a several more within my growing-up social circle — including people I was extremely unhappy to have to cut loose.\nThat’s significant because typically other than through accidents or violence (e.g. car wrecks and homicide) statistically nobody dies once you get out of childhood until you get into your late 50s or 60s and the diseases of older age start to catch up with your poor lifestyle or just bad luck and genetics. Yeah, there are exceptions — but not many.\nYou don’t want that to happen to you as it often comes with years of disability first and there’s still time — if you act now.\nHard times are coming folks.\nNow, before the younger generation’s dismiss Denninger’s warning as the customary Boomer dramatics about walking uphill to school both ways in the snow, what he is talking about here is\nnot\nthe way in which the new normal is more difficult than the old normal. Yes, it’s much harder to get ahead now, it’s much harder get a college degree, to get a good job, or to afford a middle-class lifestyle, and the economic mean has observably declined steadily since real wages peaked in 1973.\nHe’s not talking about the current normal. What he’s talking about is genuine economic crisis, when people who own homes can’t keep them, when there are no jobs of any kind to be found, and when interest rates are not only in the double-digits, but the teens, so any kind of financing for anything is completely unaffordable.\nRemember, we didn’t see actual credit deflation after 2008, but mere credit disinflation.\nThe point that he’s making is that since times are going to be difficult, don’t make them more difficult for yourself and your family by making stupid and short-sighted decisions, because the consequences are likely to be considerably more serious and long-lasting than the average young individual can reasonably imagine.\nI’ve seen the casualties among my friends and family too. So be smarter than we were. Be better than we were. Because the one thing, perhaps the only thing, that you have going for you is that the GenXers are providing you with the sort of advice that we should have gotten, but for the most part didn’t get, from our predecessors.\nSo if you can avoid wasting the decade or so that most of us did, you might actually wind up ahead of the game in the end.\nDISCUSS ON SG",
  "tags": [
    "economics",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-08-19T15:09:22+00:00"
}