{
  "url": "https://voxday.net/2023/08/11/fbi-1-boomerwaffen-0/",
  "scraped_at": "2026-01-08T14:05:47.333974",
  "title": "FBI 1, Boomerwaffen 0",
  "date_display": "August 11, 2023",
  "date_iso": "2023-08-11T23:43:25+00:00",
  "date_from_url": "2023-08-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not a great start for the Gadsden Flag crowd. <a href=\"https://gab.com/NeonRevolt/posts/110872967575659921\">Fedposting has consequences</a>, so don’t advocate revolution and violence against the US government unless you’re actually prepared for the FBI to show up at your door with guns blazing. Neon Revolt is skeptical that the Boomers will learn any more from the execution of Craig Robertson than they did from Waco, 9/11, Ruby Ridge, Oklahoma City, and every other exercise of executive branch action.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The FBI summarily executing a mobility-scooter Boomer for his angry Facebook rantings just goes to highlight this one fact: The America that Boomers <em>think</em> exists <em>does not exist any more</em> and they may not truly understand what was lost under their watch until the Rainbow Bolsheviks roll up to their homes and shoot them dead in the face for wrongthink.</p></blockquote><p>It would be nice to think he was wrong, but there simply isn’t any evidence that he is. The fact is that the FBI showed up at an old man’s door because he was expressing himself on Facebook, then shot and killed him. That’s not America. That’s the exact opposite of America as its ideals are expressed in the words, actions, and documents of its Founding Fathers.</p><p><em><a href=\"https://social.infogalactic.com/micropost/3bd06557-c91f-4b85-a7cb-a1e9e6f20856\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Not a great start for the Gadsden Flag crowd.\nFedposting has consequences\n, so don’t advocate revolution and violence against the US government unless you’re actually prepared for the FBI to show up at your door with guns blazing. Neon Revolt is skeptical that the Boomers will learn any more from the execution of Craig Robertson than they did from Waco, 9/11, Ruby Ridge, Oklahoma City, and every other exercise of executive branch action.\nThe FBI summarily executing a mobility-scooter Boomer for his angry Facebook rantings just goes to highlight this one fact: The America that Boomers\nthink\nexists\ndoes not exist any more\nand they may not truly understand what was lost under their watch until the Rainbow Bolsheviks roll up to their homes and shoot them dead in the face for wrongthink.\nIt would be nice to think he was wrong, but there simply isn’t any evidence that he is. The fact is that the FBI showed up at an old man’s door because he was expressing himself on Facebook, then shot and killed him. That’s not America. That’s the exact opposite of America as its ideals are expressed in the words, actions, and documents of its Founding Fathers.\nDISCUSS ON SG",
  "tags": [
    "Baby Boomers",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-08-11T23:43:41+00:00"
}