{
  "url": "https://voxday.net/2023/08/30/more-dangerous-than-china/",
  "scraped_at": "2026-01-08T14:07:44.987939",
  "title": "More Dangerous than China",
  "date_display": "August 30, 2023",
  "date_iso": "2023-08-30T13:35:00+00:00",
  "date_from_url": "2023-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Martin Armstrong of Armstrong Economics is absolutely correct to spotlight an anti-American enemy <a href=\"https://www.armstrongeconomics.com/armstrongeconomics101/opinion/the-greatest-threat-is-always-from-within/\">far more dangerous to Americans</a> than the Russians or the Chinese:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>QUESTION:</strong> Do you think the Neocons are more dangerous than Russia or China?</p><p><strong>ANSWER:</strong> Absolutely. In Chess, you face your adversary. You know your enemy, and you try to unravel his strategy. In geopolitics, the greatest danger is always the enemy within your own ranks. For a handful of silver, it was a Greek who showed the path for the Persians to come behind the Spartans through the hills and annihilate them from behind in the Battle of Thermopylae. Judas also betrayed Jesus for a handful of silver. History has proven countless times that your greatest enemy always emerges from within.</p><p>Any politician who now supports Ukraine and spouts out the BS we will be next is unworthy of any public office, including sanitation cleaning toilets. They have NO place in politics and should NEVER be allowed to take the White House, regardless of their party. The Neocons have created endless wars on their own theory that democracy should dominate the world. Their version of democracy is really tyranny, for we have no right to vote on taxes, vaccines, lockdowns, or war. We are drafted with not right to vote and ordered to die on a foreign battlefield because of their theory in which we have no say whatsoever.</p></blockquote><p>He’s correct. The reason the Founding Fathers specified both “enemies foreign and domestic” is because they were well-read in history and they understood that the enemy within is every bit as dangerous, and quite often more so, than the enemy without.</p><p>I expect the neocons and their cultural war colleagues will be seen by history as the US equivalent of Rome’s Praetorian Guard, making and unmaking political leaders at will as it profits them to do so. The US is no more capable of surviving its neocons than Rome survived its praetorians.</p><p><em><a href=\"https://social.infogalactic.com/micropost/df73fe33-c13f-41b7-b760-c79afda9c6b2\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Martin Armstrong of Armstrong Economics is absolutely correct to spotlight an anti-American enemy\nfar more dangerous to Americans\nthan the Russians or the Chinese:\nQUESTION:\nDo you think the Neocons are more dangerous than Russia or China?\nANSWER:\nAbsolutely. In Chess, you face your adversary. You know your enemy, and you try to unravel his strategy. In geopolitics, the greatest danger is always the enemy within your own ranks. For a handful of silver, it was a Greek who showed the path for the Persians to come behind the Spartans through the hills and annihilate them from behind in the Battle of Thermopylae. Judas also betrayed Jesus for a handful of silver. History has proven countless times that your greatest enemy always emerges from within.\nAny politician who now supports Ukraine and spouts out the BS we will be next is unworthy of any public office, including sanitation cleaning toilets. They have NO place in politics and should NEVER be allowed to take the White House, regardless of their party. The Neocons have created endless wars on their own theory that democracy should dominate the world. Their version of democracy is really tyranny, for we have no right to vote on taxes, vaccines, lockdowns, or war. We are drafted with not right to vote and ordered to die on a foreign battlefield because of their theory in which we have no say whatsoever.\nHe’s correct. The reason the Founding Fathers specified both “enemies foreign and domestic” is because they were well-read in history and they understood that the enemy within is every bit as dangerous, and quite often more so, than the enemy without.\nI expect the neocons and their cultural war colleagues will be seen by history as the US equivalent of Rome’s Praetorian Guard, making and unmaking political leaders at will as it profits them to do so. The US is no more capable of surviving its neocons than Rome survived its praetorians.\nDISCUSS ON SG",
  "tags": [
    "decline and fall",
    "neoclowns",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-08-30T13:35:00+00:00"
}