{
  "url": "https://voxday.net/2023/08/04/one-race-the-canine-race/",
  "scraped_at": "2026-01-08T14:04:57.756412",
  "title": "One Race, the Canine Race",
  "date_display": "August 4, 2023",
  "date_iso": "2023-08-04T12:33:12+00:00",
  "date_from_url": "2023-08-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No wonder social justice warriors don’t want to contemplate the mathematics of genetic populations any more than the evolutionists do. Because the more numerate you are, the more it is clear that genetic science has not only demolished the myth of evolution by natural selection, but also the myth of human equality.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-58988\" decoding=\"async\" fetchpriority=\"high\" height=\"802\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/08/image-6.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/08/image-6.png 512w, https://voxday.net/wp-content/uploads/2023/08/image-6-192x300.png 192w\" width=\"512\"/></figure></div><p>Now, whether the charts are correct or not – and the jury is still out on that – the unarguable and easily verifiable fact is that Sub-Saharan Africans are not even entirely the same species as Europeans and other humans. Indeed, one can quite reasonably argue that Sub-Saharan Africans are the only true humans, as they are unadulterated <em>Homo sapiens sapiens</em> whereas other human races are a mix of <em>Homo sapiens</em> with other species and/or subspecies, depending upon how <em>Homo denisova</em>, <em>Homo neanderthalensis</em>, and other homids that contributed to the modern human gene pool are most correctly categorized.</p><p>Of course scientists are alarmed by the fact that the more we learn about genetics, the more the defense of one’s own genetics, culture, and language – aka “racism” – is grounded in strong scientific justification. So, some of them are already expending considerable effort in the usual word magick in order to deny the unavoidably observable. It’s not just because this long paper, <em><a href=\"https://evolution-outreach.biomedcentral.com/articles/10.1186/s12052-019-0109-y\">Human Races Are Not Like Dog Breeds: Refuting a Racist Analogy</a></em>, was authored by five female scientists that it doesn’t include any math or statistical analysis.</p><p>It’s never a good sign when a published scientific paper fails what would be an easy question on the pre-1990 SAT. <em>African is to European as a) Grey Wolf is to Red Wolf, b) Grey Wolf is to Coyote, c) Grey Wolf is to Malamute, d) Grey Wolf is to Chihuahua.</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/ada50488-9578-402a-8f3e-55ba704cc6e4\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "No wonder social justice warriors don’t want to contemplate the mathematics of genetic populations any more than the evolutionists do. Because the more numerate you are, the more it is clear that genetic science has not only demolished the myth of evolution by natural selection, but also the myth of human equality.\nNow, whether the charts are correct or not – and the jury is still out on that – the unarguable and easily verifiable fact is that Sub-Saharan Africans are not even entirely the same species as Europeans and other humans. Indeed, one can quite reasonably argue that Sub-Saharan Africans are the only true humans, as they are unadulterated\nHomo sapiens sapiens\nwhereas other human races are a mix of\nHomo sapiens\nwith other species and/or subspecies, depending upon how\nHomo denisova\n,\nHomo neanderthalensis\n, and other homids that contributed to the modern human gene pool are most correctly categorized.\nOf course scientists are alarmed by the fact that the more we learn about genetics, the more the defense of one’s own genetics, culture, and language – aka “racism” – is grounded in strong scientific justification. So, some of them are already expending considerable effort in the usual word magick in order to deny the unavoidably observable. It’s not just because this long paper,\nHuman Races Are Not Like Dog Breeds: Refuting a Racist Analogy\n, was authored by five female scientists that it doesn’t include any math or statistical analysis.\nIt’s never a good sign when a published scientific paper fails what would be an easy question on the pre-1990 SAT.\nAfrican is to European as a) Grey Wolf is to Red Wolf, b) Grey Wolf is to Coyote, c) Grey Wolf is to Malamute, d) Grey Wolf is to Chihuahua.\nDISCUSS ON SG",
  "tags": [
    "evolution",
    "science",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-08-04T13:27:36+00:00"
}