{
  "url": "https://voxday.net/2023/08/07/oppenheimer-and-the-manhatten-psyop/",
  "scraped_at": "2026-01-08T14:05:13.900570",
  "title": "Oppenheimer and the Manhatten PsyOp",
  "date_display": "August 7, 2023",
  "date_iso": "2023-08-07T10:13:26+00:00",
  "date_from_url": "2023-08-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Who would ever have imagined that Barbie may have been the more historically accurate of the two big movies this summer? Miles Mathis watches the Oppenheimer movie and concludes that it’s an inept attempt to cover for the fact that <a href=\"http://mileswmathis.com/updates.html\">the Manhattan Project was a fraud</a> from the very start.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>At minute 47, we finally get to the Manhattan Project, and the strangest missed clue in the whole mystery is put right on the chalkboard. Oppenheimer suggests to Groves they create a secret base for the project? Where? Well, on Oppenheimer’s private ranch in New Mexico. . . Pause on that. Swish it around in your mouth for a while and taste it as if you are just swallowing for the first time. This is as strange as having the codebreaking project at Bletchley Park, or actually much stranger. In the 1940s the US military already had bases all over the country, with many in the west being out in the middle of nowhere and almost unknown. They didn’t need a new secret base, and if they did you would expect the brass to pick the location, not the 38-year-old Oppenheimer. Opie was allegedly a physicist, not an expert on US geography. So having Opie draw this up on the chalkboard as an X, and the X turn out to be his private ranch, is a magnificent and visual clue to the fake. We are supposed to believe this all happened on the private ranch of some rich guy out in the middle of nowhere? But as you see, it was perfect: it was the perfect place to hide a huge bomb project, but was also the perfect place to hide the LACK of a huge bomb project. All the secrecy would hide a project, but it would also hide the LACK of a project. What if there was nothing out there at all but some cacti and tumbleweeds? Would we know the difference to this day? No.</p><p>Here’s something else most people don’t know. Most of the uranium for the Manhattan Project supposedly came from the Shinkolobwe Mine in the Belgian Congo, Africa. But it was derelict, being flooded and then closed in 1936. The US allegedly reopened it in 1944, which seems a little late, doesn’t it, especially since they first had to pump out all the water. To answer this little problem, we are told this Belgian mining company had stockpiled 1,200 tonnes of uranium in a warehouse in Staten Island. That’s convenient isn’t it? Sometime after 1936, after being closed, this company decided to stockpile all that uranium in New York? And why would they do that? In 1936 there was no call for uranium since no one was building bombs back then. But they just put 1,200 tonnes of it in Staten Island for a rainy day, because, you know why not?</p><p>And how is this for suspicious? After the war, ore containing 1% of U3O8 was considered fantastic, but this uranium in the warehouse in Staten Island just happened to be 65%, over 65 times higher in the needed yellowcake. What luck, right? Never before or since had uranium of that mix been found, but we happened to have it sitting in a warehouse in Staten Island. <em>Right next to the Ark of the Covenant.</em></p> <cite>Oppenheimer was a Fraud, 5 August 2023</cite></blockquote><p>The more one reviews the details of 20th Century history, the more obvious it becomes that <em>literally everything</em> has been fake and gay for a lot longer than the last twenty years of open Clown World rule. There isn’t a single item of the mainstream history narrative that can be assumed to be generally true. At this point, it is more likely that space, nukes, and dinosaurs are all more or less fraudulent than they are actually as was taught to us in our schools and universities.</p><p>Be skeptical, be very, very skeptical, that anything is as you were told it was, if you haven’t personally gone over at least a substantial percentage of the details of the sort that Miles Mathis points out in his recent paper on the Manhatten Project. Because the closer one looks at these things, the more obviously manufactured they appear to be, and the devil’s hand is revealed in the ridiculous details.</p><p>What is astonishing is the ease with which these false historical events can be debunked with a level of knowledge that goes no deeper than Wikipedia. And it would certainly be nice if somewhere, someone is keeping an account of human history that is actually more or less an accurate record of real things that actually happened.</p><p><a href=\"https://social.infogalactic.com/micropost/c1278147-a3c0-4667-9f53-dc15e7f5d236\"><em>DISCUSS ON SG</em></a></p></div>",
  "content_text": "Who would ever have imagined that Barbie may have been the more historically accurate of the two big movies this summer? Miles Mathis watches the Oppenheimer movie and concludes that it’s an inept attempt to cover for the fact that\nthe Manhattan Project was a fraud\nfrom the very start.\nAt minute 47, we finally get to the Manhattan Project, and the strangest missed clue in the whole mystery is put right on the chalkboard. Oppenheimer suggests to Groves they create a secret base for the project? Where? Well, on Oppenheimer’s private ranch in New Mexico. . . Pause on that. Swish it around in your mouth for a while and taste it as if you are just swallowing for the first time. This is as strange as having the codebreaking project at Bletchley Park, or actually much stranger. In the 1940s the US military already had bases all over the country, with many in the west being out in the middle of nowhere and almost unknown. They didn’t need a new secret base, and if they did you would expect the brass to pick the location, not the 38-year-old Oppenheimer. Opie was allegedly a physicist, not an expert on US geography. So having Opie draw this up on the chalkboard as an X, and the X turn out to be his private ranch, is a magnificent and visual clue to the fake. We are supposed to believe this all happened on the private ranch of some rich guy out in the middle of nowhere? But as you see, it was perfect: it was the perfect place to hide a huge bomb project, but was also the perfect place to hide the LACK of a huge bomb project. All the secrecy would hide a project, but it would also hide the LACK of a project. What if there was nothing out there at all but some cacti and tumbleweeds? Would we know the difference to this day? No.\nHere’s something else most people don’t know. Most of the uranium for the Manhattan Project supposedly came from the Shinkolobwe Mine in the Belgian Congo, Africa. But it was derelict, being flooded and then closed in 1936. The US allegedly reopened it in 1944, which seems a little late, doesn’t it, especially since they first had to pump out all the water. To answer this little problem, we are told this Belgian mining company had stockpiled 1,200 tonnes of uranium in a warehouse in Staten Island. That’s convenient isn’t it? Sometime after 1936, after being closed, this company decided to stockpile all that uranium in New York? And why would they do that? In 1936 there was no call for uranium since no one was building bombs back then. But they just put 1,200 tonnes of it in Staten Island for a rainy day, because, you know why not?\nAnd how is this for suspicious? After the war, ore containing 1% of U3O8 was considered fantastic, but this uranium in the warehouse in Staten Island just happened to be 65%, over 65 times higher in the needed yellowcake. What luck, right? Never before or since had uranium of that mix been found, but we happened to have it sitting in a warehouse in Staten Island.\nRight next to the Ark of the Covenant.\nOppenheimer was a Fraud, 5 August 2023\nThe more one reviews the details of 20th Century history, the more obvious it becomes that\nliterally everything\nhas been fake and gay for a lot longer than the last twenty years of open Clown World rule. There isn’t a single item of the mainstream history narrative that can be assumed to be generally true. At this point, it is more likely that space, nukes, and dinosaurs are all more or less fraudulent than they are actually as was taught to us in our schools and universities.\nBe skeptical, be very, very skeptical, that anything is as you were told it was, if you haven’t personally gone over at least a substantial percentage of the details of the sort that Miles Mathis points out in his recent paper on the Manhatten Project. Because the closer one looks at these things, the more obviously manufactured they appear to be, and the devil’s hand is revealed in the ridiculous details.\nWhat is astonishing is the ease with which these false historical events can be debunked with a level of knowledge that goes no deeper than Wikipedia. And it would certainly be nice if somewhere, someone is keeping an account of human history that is actually more or less an accurate record of real things that actually happened.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "history",
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-08-07T11:15:09+00:00"
}