{
  "url": "https://voxday.net/2023/08/19/the-opening-of-the-african-front/",
  "scraped_at": "2026-01-08T14:06:33.281279",
  "title": "The Opening of the African Front",
  "date_display": "August 19, 2023",
  "date_iso": "2023-08-19T12:04:43+00:00",
  "date_from_url": "2023-08-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not a true world war until there is fighting on at least three continents. It appears the African Front<a href=\"https://www.rt.com/africa/581482-ecowas-agree-intervention-day/\"> will be opening hostilities soon</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The military chiefs of the Economic Community of West African States (ECOWAS) have decided on a date for sending troops into Niger, the bloc’s commissioner for political affairs, peace and security, Abdel-Fatau Musah, said on Friday.</p><p>“We are ready to go anytime the order is given,” Musah told reporters after a two-day meeting of the bloc’s Committee of Chiefs of Defense Staff in Accra, Ghana. “The D-day is also decided. We’ve already agreed and fine-tuned what will be required for the intervention. Let no one be in doubt that if everything else fails, the valiant forces of West Africa, both the military and the civilian components, are ready to answer to the call of duty,” Musah said.</p><p>Niger has accused ECOWAS of acting as the proxy of France, the country’s former colonial ruler. Speaking on Friday, Musah insisted that the bloc is a “rules-based organization,” ready to intervene alone or with support of “other democracy-loving partners.”</p><p>According to the French broadcaster RFI, the bloc is mustering about 25,000 troops, mostly from Nigeria and Senegal.</p> <cite>Niger’s neighbors set ‘D-Day’ for intervention, RUSSIA TODAY, 18 August 2023</cite></blockquote><p>It’s interesting to see how the servants of Clown World all use the exact same <em>zaubersprache</em>. Everything now is “rules-based” and “democracy” despite the observable fact that Clown World never obeys any rules and is openly anti-democratic. All you need to determine who the bad guys are in any situation is to see who a) supports the Clown World Narrative or b) uses Clown World’s terminology.</p><p>Now that the US proxies are preparing for battle, the US is <a href=\"https://www.voanews.com/a/us-military-preparing-for-worst-case-scenario-evacuation-from-niger/7231099.html\">getting its own troops out of harms way</a>. It’s one thing to have one’s proxies roundly defeated by mercenary light infantry, it’s another to have one’s regulars openly humiliated by them. Regardless of whether or not the US Army and Marine Corps can successfully take on Wagner and the Chechens, much less the Russian regulars, it’s in the interest of the US to maintain the illusion of military supremacy as long as it can.</p><p>That suggests the US will not commit its own troops to battle anywhere unless and until it cannot find any European, African, <a href=\"https://www.rt.com/news/581492-us-japan-korea-military-china/https://www.rt.com/news/581492-us-japan-korea-military-china/\">or Asian proxies</a> to fight in their staid. Believe it or not, Clown World’s war plan for Asia actually involves <a href=\"https://www.rt.com/news/581439-china-vietnam-us-comrade/\">trying to recruit Vietnam</a> to fight China. Because it is already apparent that Japan, South Korea, and The Philippines alone are not going to suffice.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Planning is underway for a possible U.S. military evacuation from Niger, even though a top U.S. general says any final decision is still “weeks away.” The commander of U.S. Air Forces Europe and U.S. Air Forces Africa told reporters Friday his headquarters is preparing for a range of scenarios that could force some 1,100 U.S. troops to abandon two airbases that have been critical to U.S. counterterrorism efforts.</p></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/f2d5e383-ba28-4e0d-a9ae-6c3c1bf121cf\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s not a true world war until there is fighting on at least three continents. It appears the African Front\nwill be opening hostilities soon\n.\nThe military chiefs of the Economic Community of West African States (ECOWAS) have decided on a date for sending troops into Niger, the bloc’s commissioner for political affairs, peace and security, Abdel-Fatau Musah, said on Friday.\n“We are ready to go anytime the order is given,” Musah told reporters after a two-day meeting of the bloc’s Committee of Chiefs of Defense Staff in Accra, Ghana. “The D-day is also decided. We’ve already agreed and fine-tuned what will be required for the intervention. Let no one be in doubt that if everything else fails, the valiant forces of West Africa, both the military and the civilian components, are ready to answer to the call of duty,” Musah said.\nNiger has accused ECOWAS of acting as the proxy of France, the country’s former colonial ruler. Speaking on Friday, Musah insisted that the bloc is a “rules-based organization,” ready to intervene alone or with support of “other democracy-loving partners.”\nAccording to the French broadcaster RFI, the bloc is mustering about 25,000 troops, mostly from Nigeria and Senegal.\nNiger’s neighbors set ‘D-Day’ for intervention, RUSSIA TODAY, 18 August 2023\nIt’s interesting to see how the servants of Clown World all use the exact same\nzaubersprache\n. Everything now is “rules-based” and “democracy” despite the observable fact that Clown World never obeys any rules and is openly anti-democratic. All you need to determine who the bad guys are in any situation is to see who a) supports the Clown World Narrative or b) uses Clown World’s terminology.\nNow that the US proxies are preparing for battle, the US is\ngetting its own troops out of harms way\n. It’s one thing to have one’s proxies roundly defeated by mercenary light infantry, it’s another to have one’s regulars openly humiliated by them. Regardless of whether or not the US Army and Marine Corps can successfully take on Wagner and the Chechens, much less the Russian regulars, it’s in the interest of the US to maintain the illusion of military supremacy as long as it can.\nThat suggests the US will not commit its own troops to battle anywhere unless and until it cannot find any European, African,\nor Asian proxies\nto fight in their staid. Believe it or not, Clown World’s war plan for Asia actually involves\ntrying to recruit Vietnam\nto fight China. Because it is already apparent that Japan, South Korea, and The Philippines alone are not going to suffice.\nPlanning is underway for a possible U.S. military evacuation from Niger, even though a top U.S. general says any final decision is still “weeks away.” The commander of U.S. Air Forces Europe and U.S. Air Forces Africa told reporters Friday his headquarters is preparing for a range of scenarios that could force some 1,100 U.S. troops to abandon two airbases that have been critical to U.S. counterterrorism efforts.\nDISCUSS ON SG",
  "tags": [
    "Africa",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-08-19T12:04:45+00:00"
}