{
  "url": "https://voxday.net/2023/08/17/the-us-housing-crash-cometh/",
  "scraped_at": "2026-01-08T14:06:22.541787",
  "title": "The US Housing Crash Cometh",
  "date_display": "August 17, 2023",
  "date_iso": "2023-08-17T13:42:09+00:00",
  "date_from_url": "2023-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Karl Denninger <a href=\"https://market-ticker.org/akcs-www?post=249517\">explains why</a>, and in the process, also explains why people had so much money to spend over the last 3-4 years.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>All Real Estate is local.</em></p><p>But — it got a lot less specifically-local in the last three years, and bifurcated basically two ways: Blue and not-Blue.</p><p>The problem is that the dynamic of virus restrictions along with wildly ridiculous fiscal and monetary policy drove a dynamic that was utterly unsustainable and, fundamentally, stupid as a whole although for the people doing it the act looked smart at the time. There were several elements of this:</p><ul class=\"wp-block-list\"><li><em>Work-from-home on a near-universal basis was forced by many employers. </em>This, in high-cost areas, drove employees to think they could arbitrage their higher salary (a result of the high cost of living where they were, such as in Chicago, New York, San Francisco and similar) and keep it while moving somewhere much cheaper, such as Tennessee or Florida. For those who pulled this it was a massive windfall, provided they could sell their home in the high-cost place.</li><li><em>Forced-low interest rates meant mortgages were extraordinarily cheap. </em>The brokers of same — banks, independent shops and similar — feasted on the fees, both for purchase money (see above for the flow on that!) and refinances. Many of those refinances were strategically wise, being committed just a few years after origination and not materially-lengthening the amortization clock. All of them wildly increased available consumer funds for spending, however, by reducing the monthly payment amount.</li></ul><p>These two dynamics skyrocketed home prices. The All-US index went from ~450 to 625, a roughly 40% increase in two years. That is much greater than the explosion higher during the last couple of years of the housing bubble; that was a mere 14%. There were plenty of areas, including where I live, that prices of “real” (not AirBNB friendly) single-family homes roughly doubled and some of those “short-term rental opportunities” were even more-obscene with some of them tripling in three years time.</p><p>All of this was ridiculously stupid. The premise that employees operated on — that they’d never have to set foot in an office again — was crap. As the pandemic ended so did the curtailment of occupying office space and the cities could not survive with all that office space empty; the tax revenue plus all the retail business activity associated with those people being in the buildings during the day is utterly essential to their fiscal survivability.</p><p>Those who thought they could arbitrage their cost of living while keeping their “bonused up” salary are now getting a rude shock: Come back to the office, which we have leased and have to pay for, or be fired. Except….. those employees now live hundreds or even a couple thousand miles away! Worse, they bought houses on &lt;3% mortgages and spent the rest and, while their “price paid” is what it is nothing is moving.</p><p>Around here I looked at recent sales. Among single-family homes there are an effective zero from roughly April forward. The top of the Realtor.com page for this county comes up with sales from March, February, May, a couple the first two weeks of June and a couple of (wildly-overpriced cabins) recently. This is the second week of August and Memorial Day to Labor Day, which is a couple of weeks away, is prime closing season here because the kids are out of school and similar.</p><p>The market is basically locked up and the reason is quite-clear: Those who bought at the top can’t move; they have 3% mortgages and that $500,000 place has a $2,100 payment. The same $500,000 house at 7% carries a payment of $3,326!</p><p>The net present value of that payment on their house today is $316,000, a $184,000 loss!</p></blockquote><p><em><strong>Translation:</strong> </em>things aren’t looking so great for your new neighbors from California who arbitraged the location delta into an overpriced home in your community. Or for the banks that hold their mortages. It should be worse than 2008.</p><p>The higher interest rates were inevitable and unavoidable. However, it remains to be seen if the minor premise was false and employers are going to be able to force their employees back into the office. I remain skeptical about the “back to the office” scenario, because I think it’s more likely that the corporations will break their leases, pull out of the cities, and decentralize. They certainly have no dearth of other reasons to do so.</p><p><em><a href=\"https://social.infogalactic.com/micropost/4ee731d7-d5f6-4735-90b1-27b191f6a5eb\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Karl Denninger\nexplains why\n, and in the process, also explains why people had so much money to spend over the last 3-4 years.\nAll Real Estate is local.\nBut — it got a lot less specifically-local in the last three years, and bifurcated basically two ways: Blue and not-Blue.\nThe problem is that the dynamic of virus restrictions along with wildly ridiculous fiscal and monetary policy drove a dynamic that was utterly unsustainable and, fundamentally, stupid as a whole although for the people doing it the act looked smart at the time. There were several elements of this:\nWork-from-home on a near-universal basis was forced by many employers.\nThis, in high-cost areas, drove employees to think they could arbitrage their higher salary (a result of the high cost of living where they were, such as in Chicago, New York, San Francisco and similar) and keep it while moving somewhere much cheaper, such as Tennessee or Florida. For those who pulled this it was a massive windfall, provided they could sell their home in the high-cost place.\nForced-low interest rates meant mortgages were extraordinarily cheap.\nThe brokers of same — banks, independent shops and similar — feasted on the fees, both for purchase money (see above for the flow on that!) and refinances. Many of those refinances were strategically wise, being committed just a few years after origination and not materially-lengthening the amortization clock. All of them wildly increased available consumer funds for spending, however, by reducing the monthly payment amount.\nThese two dynamics skyrocketed home prices. The All-US index went from ~450 to 625, a roughly 40% increase in two years. That is much greater than the explosion higher during the last couple of years of the housing bubble; that was a mere 14%. There were plenty of areas, including where I live, that prices of “real” (not AirBNB friendly) single-family homes roughly doubled and some of those “short-term rental opportunities” were even more-obscene with some of them tripling in three years time.\nAll of this was ridiculously stupid. The premise that employees operated on — that they’d never have to set foot in an office again — was crap. As the pandemic ended so did the curtailment of occupying office space and the cities could not survive with all that office space empty; the tax revenue plus all the retail business activity associated with those people being in the buildings during the day is utterly essential to their fiscal survivability.\nThose who thought they could arbitrage their cost of living while keeping their “bonused up” salary are now getting a rude shock: Come back to the office, which we have leased and have to pay for, or be fired. Except….. those employees now live hundreds or even a couple thousand miles away! Worse, they bought houses on <3% mortgages and spent the rest and, while their “price paid” is what it is nothing is moving.\nAround here I looked at recent sales. Among single-family homes there are an effective zero from roughly April forward. The top of the Realtor.com page for this county comes up with sales from March, February, May, a couple the first two weeks of June and a couple of (wildly-overpriced cabins) recently. This is the second week of August and Memorial Day to Labor Day, which is a couple of weeks away, is prime closing season here because the kids are out of school and similar.\nThe market is basically locked up and the reason is quite-clear: Those who bought at the top can’t move; they have 3% mortgages and that $500,000 place has a $2,100 payment. The same $500,000 house at 7% carries a payment of $3,326!\nThe net present value of that payment on their house today is $316,000, a $184,000 loss!\nTranslation:\nthings aren’t looking so great for your new neighbors from California who arbitraged the location delta into an overpriced home in your community. Or for the banks that hold their mortages. It should be worse than 2008.\nThe higher interest rates were inevitable and unavoidable. However, it remains to be seen if the minor premise was false and employers are going to be able to force their employees back into the office. I remain skeptical about the “back to the office” scenario, because I think it’s more likely that the corporations will break their leases, pull out of the cities, and decentralize. They certainly have no dearth of other reasons to do so.\nDISCUSS ON SG",
  "tags": [
    "banks",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-08-17T13:43:09+00:00"
}