{
  "url": "https://voxday.net/2023/08/09/the-neoclowns-are-doubling-down/",
  "scraped_at": "2026-01-08T14:05:32.162528",
  "title": "The Neoclowns are Doubling Down",
  "date_display": "August 9, 2023",
  "date_iso": "2023-08-09T22:46:01+00:00",
  "date_from_url": "2023-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While the Typhoid Mary of geopolitics, US regime change specialist Victoria Nuland, <a href=\"https://www.rt.com/africa/580985-nuland-niger-wagner-warning/\">is busy down in Niger</a>, attempting to forestall the opening of WWIII’s second front in Africa, it appears that the pivot to China is off for now and the Poles have volunteered <a href=\"https://sputnikglobe.com/20230809/warsaw-plans-to-create-polish-ukrainian-union-for-subsequent-occupation-of-western-ukraine---shoigu-1112480015.html\">to become the next man up</a> for the slaughterhouse.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Warsaw is planning to establish a regular Polish-Ukrainian union for subsequent occupation of Western Ukraine and announced its intention to build “the strongest army” in Europe, Russian Defense Minister Sergei Shoigu said on Wednesday. Poland has become the main instrument of the US anti-Russian policy and declares its intention to build “the most powerful army” in Europe, for this purpose Warsaw has started large-scale arms purchases from the US, the UK and South Korea, Sergei Shoigu said at a meeting of the board of the Russian Defense Ministry…</p><p>“Taking into account the armed forces of the Eastern European countries, about 360,000 military personnel, 8,000 armored vehicles, 6,000 artillery systems and mortars, 650 aircraft and helicopters are deployed in the immediate vicinity of the borders of the Union State,” Shoigu said during a meeting of the board of the military department.</p></blockquote><p>By “Union State”, Shoigu is referring to the borders of both Russia and Belarus. So this would tend to imply that the numbers provided include Ukrainian, Polish, and assorted NATO forces. This is clearly why the Russian generals have been keeping their powder dry and their regular units in reserve, and why they have made heavy use of the Chechen light infantry and various mercenary companies, including Wagner, as well as the Donbass militia forces, in order to spare their own for the transition of the Special Military Operation into direct war with NATO.</p><p>Those border deployments may sound like a lot, but they’re not even close to enough to defend against a Russian attack, much less launch one on either Russia or Belarus. Recall that Operation Iska, launched 19 months after the German invasion of the Soviet Union, involved considerably more forces than the Germans imagined possible: 20 divisions, 15 brigades, 4,600 artillery, 500 tanks, and 900 aircraft.</p><p>While it’s almost pointless to attempt to figure out when and how the Russians are going to attack, but given their military doctrine, one can reasonably assume it is likely to be a) heavier than believed possible by the professional analysts, b) launched without any warning, and c) focused on a place that is not considered one of the most likely targets.</p><p>Consider the way in which Marshal Zhukov described the launch of Operation Iskra, which was intended to break the German siege of Leningrad.</p><p><em>All preparations for the operation were at last completed. The morning of January 12, 1943, was clear and frosty. General Romanovsky and I came to the 2nd Shock Army’s observation post. It was quite near the front lines, and we had a good view of the enemy’s defences in immediate depth. Columns of smoke rose here and there in the midst of the German positions. Soldiers who had been on guard duty at night when our scouts were usually active were now about to go to sleep and were lighting their stoves.</em></p><p><em>So far, silence reigned. But it was a special silence to me — the silence before an attack of historical dimensions.</em></p><p><em>In the battle, we managed to achieve a tactical surprise, though the enemy knew we were preparing to break the blockade. He may even have guessed where the Soviet troops would hit, for the shape of the front was suggestive of it. And day after day the Germans were building fortifications in the sector of the breakthrough, moving in their crack units, installing more and more guns in the bunkers built during the more than 16 months of the blockade. But when exactly we would strike, on what day and hour, and with what force, the German Command did not know.</em></p><p><em>As we learned later from prisoners, the Soviet assault which the Nazis had awaited for all of a year, came as a complete surprise to them that day, especially for its power and skill.</em></p><p>The Russians took 105,000 casualties in 18 days and considered it to have been a very significant strategic success.</p><p>Keep in mind that the Russians are well aware of the need to disguise the preparations and troop movements leading up to an offensive. The very successful <em>maskirovka</em> put into effect by the Serbian forces to hide their armor from NATO air strikes and render them generally ineffective was developed from Russian military doctrine. So even though satellite and other technologies provide massive quantities of information to NATO analysts and planners, it will not be surprising if the Russians have found a way to circumvent them somehow, at least long enough to achieve tactical surprise.</p><p>Pray for the Polish people. They don’t deserve this. They suffered enough in the last World War. But the neoclowns hate them nearly as much as they hate the German and Russian peoples, and will not hesitate to sacrifice them even more brutally than they have sacrificed the Ukrainian people.</p><p><em><a href=\"https://social.infogalactic.com/micropost/a1e27275-d517-4785-a0eb-caebb24bdc73\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "While the Typhoid Mary of geopolitics, US regime change specialist Victoria Nuland,\nis busy down in Niger\n, attempting to forestall the opening of WWIII’s second front in Africa, it appears that the pivot to China is off for now and the Poles have volunteered\nto become the next man up\nfor the slaughterhouse.\nWarsaw is planning to establish a regular Polish-Ukrainian union for subsequent occupation of Western Ukraine and announced its intention to build “the strongest army” in Europe, Russian Defense Minister Sergei Shoigu said on Wednesday. Poland has become the main instrument of the US anti-Russian policy and declares its intention to build “the most powerful army” in Europe, for this purpose Warsaw has started large-scale arms purchases from the US, the UK and South Korea, Sergei Shoigu said at a meeting of the board of the Russian Defense Ministry…\n“Taking into account the armed forces of the Eastern European countries, about 360,000 military personnel, 8,000 armored vehicles, 6,000 artillery systems and mortars, 650 aircraft and helicopters are deployed in the immediate vicinity of the borders of the Union State,” Shoigu said during a meeting of the board of the military department.\nBy “Union State”, Shoigu is referring to the borders of both Russia and Belarus. So this would tend to imply that the numbers provided include Ukrainian, Polish, and assorted NATO forces. This is clearly why the Russian generals have been keeping their powder dry and their regular units in reserve, and why they have made heavy use of the Chechen light infantry and various mercenary companies, including Wagner, as well as the Donbass militia forces, in order to spare their own for the transition of the Special Military Operation into direct war with NATO.\nThose border deployments may sound like a lot, but they’re not even close to enough to defend against a Russian attack, much less launch one on either Russia or Belarus. Recall that Operation Iska, launched 19 months after the German invasion of the Soviet Union, involved considerably more forces than the Germans imagined possible: 20 divisions, 15 brigades, 4,600 artillery, 500 tanks, and 900 aircraft.\nWhile it’s almost pointless to attempt to figure out when and how the Russians are going to attack, but given their military doctrine, one can reasonably assume it is likely to be a) heavier than believed possible by the professional analysts, b) launched without any warning, and c) focused on a place that is not considered one of the most likely targets.\nConsider the way in which Marshal Zhukov described the launch of Operation Iskra, which was intended to break the German siege of Leningrad.\nAll preparations for the operation were at last completed. The morning of January 12, 1943, was clear and frosty. General Romanovsky and I came to the 2nd Shock Army’s observation post. It was quite near the front lines, and we had a good view of the enemy’s defences in immediate depth. Columns of smoke rose here and there in the midst of the German positions. Soldiers who had been on guard duty at night when our scouts were usually active were now about to go to sleep and were lighting their stoves.\nSo far, silence reigned. But it was a special silence to me — the silence before an attack of historical dimensions.\nIn the battle, we managed to achieve a tactical surprise, though the enemy knew we were preparing to break the blockade. He may even have guessed where the Soviet troops would hit, for the shape of the front was suggestive of it. And day after day the Germans were building fortifications in the sector of the breakthrough, moving in their crack units, installing more and more guns in the bunkers built during the more than 16 months of the blockade. But when exactly we would strike, on what day and hour, and with what force, the German Command did not know.\nAs we learned later from prisoners, the Soviet assault which the Nazis had awaited for all of a year, came as a complete surprise to them that day, especially for its power and skill.\nThe Russians took 105,000 casualties in 18 days and considered it to have been a very significant strategic success.\nKeep in mind that the Russians are well aware of the need to disguise the preparations and troop movements leading up to an offensive. The very successful\nmaskirovka\nput into effect by the Serbian forces to hide their armor from NATO air strikes and render them generally ineffective was developed from Russian military doctrine. So even though satellite and other technologies provide massive quantities of information to NATO analysts and planners, it will not be surprising if the Russians have found a way to circumvent them somehow, at least long enough to achieve tactical surprise.\nPray for the Polish people. They don’t deserve this. They suffered enough in the last World War. But the neoclowns hate them nearly as much as they hate the German and Russian peoples, and will not hesitate to sacrifice them even more brutally than they have sacrificed the Ukrainian people.\nDISCUSS ON SG",
  "tags": [
    "history",
    "neoclowns",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-08-09T22:46:03+00:00"
}