{
  "url": "https://voxday.net/2023/08/10/the-inevitable-end-of-arbitration/",
  "scraped_at": "2026-01-08T14:05:34.007996",
  "title": "The Inevitable End of Arbitration",
  "date_display": "August 10, 2023",
  "date_iso": "2023-08-10T09:02:40+00:00",
  "date_from_url": "2023-08-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In light of the absurd and shamelessly illegal actions by JAMS and a few of its more dishonest arbitrators that we’ve witnessed in recent years, to say nothing of its shameless bias towards corporations, it’s good to see that the UK courts have declared that JAMS awards are contrary to public policy and <a href=\"https://www.jdsupra.com/legalnews/english-commercial-court-refuses-3648086/\">cannot be enforced</a> in the UK. I very much doubt it will be the last jurisdiction to do so.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A UK-domiciled consumer lost about £613,000 in his cryptocurrency trading account, which was governed by terms of service that referred disputes to JAMS arbitration, with the merits to be decided pursuant to California law and the U.S. Federal Arbitration Act. The arbitrator held the cryptocurrency trading platform was not liable. The English Commercial Court held that enforcement of the JAMS award would be contrary to UK public policy, which meant that recognition and enforcement “may be refused”. The court found no “fresh circumstances”, and enforcement was refused.</p><p>In <em>Payward Inc, Payward Ventures Inc and Payward Ltd v Chechetkin [2023] EWHC 1780 (Comm)</em>, the English Commercial Court refused to enforce a California-seated arbitration award, on the basis that enforcement would contravene UK public policy as embodied in the Consumer Rights Act 2015 (CRA 2015) and the Financial Services and Markets Act 2000 (FSMA).</p><ul class=\"wp-block-list\"><li>Mr Chechetkin was a “consumer” for the purposes of the CRA 2015. Mr Chechetkin was a lawyer acting on his own behalf with no intention to resell cryptocurrencies as a business. He did not work in crypto or fintech and had indicated that he had no experience of cryptocurrency trading when he opened his Kraken account.</li><li>The Commercial Court was not bound by the decisions of the JAMS arbitrator. The Commercial Court was not bound by the decisions of the JAMS arbitrator and should not necessarily be obliged to enforce an award that is contrary to UK public policy merely because the arbitrator’s decision had indicated otherwise.</li><li>Enforcement of the arbitral award would be contrary to public policy under the CRA 2015 and FSMA. The CRA 2015 applies where a consumer contract has a close connection with the UK and requires the court to consider whether a term is fair even if none of the parties have raised it as an issue. The Payward terms were found to have a close connection with the UK because: both Mr Chechetkin and Payward Ltd were domiciled in England, and the services were paid for in sterling using English bank accounts.</li><li>In addition, the Commercial Court held that a reasonable consumer would not have agreed to California-seated arbitration, under JAMS and subject to the U.S. Federal Arbitration Act, as this brought with it significant disadvantages regarding the application of English law (including the CRA 2015 and FSMA). Nevertheless, the arbitrator took no account of English law, meaning that enforcement would be contrary to UK public policy. The Commercial Court also found that enforcement would stifle Mr Chechetkin’s claim under FSMA in circumstances where he had at least a prima facie claim. This would be contrary to public policy since contracts concluded in contravention of the general prohibition in section 19 of FSMA should be unenforceable and the customer should be entitled to recover his money.</li></ul> <cite>English Commercial Court Refuses Recognition and Enforcement of California-Seated Arbitration Award on Grounds of Public Policy, 7 August 2023</cite></blockquote><p>The literal lawlessness of JAMS, and its abject refusal to require its own arbitrators to follow its own rules, is going to destroy both the arbitration system as well as the ridiculous unilateral dynamic contracts that permit technology companies to literally change the rules on their customers and employees alike, and to shamelessly abuse them without any legal consequences.</p><p>The legal system is bad enough as it is, but the arbitration system is even more corrupt. It’s good that at least one legal system is openly establishing the legal irrelevance of the latter.</p><p><em><a href=\"https://social.infogalactic.com/micropost/8b30b980-95ee-484d-b6bf-eef7e7a61d47\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "In light of the absurd and shamelessly illegal actions by JAMS and a few of its more dishonest arbitrators that we’ve witnessed in recent years, to say nothing of its shameless bias towards corporations, it’s good to see that the UK courts have declared that JAMS awards are contrary to public policy and\ncannot be enforced\nin the UK. I very much doubt it will be the last jurisdiction to do so.\nA UK-domiciled consumer lost about £613,000 in his cryptocurrency trading account, which was governed by terms of service that referred disputes to JAMS arbitration, with the merits to be decided pursuant to California law and the U.S. Federal Arbitration Act. The arbitrator held the cryptocurrency trading platform was not liable. The English Commercial Court held that enforcement of the JAMS award would be contrary to UK public policy, which meant that recognition and enforcement “may be refused”. The court found no “fresh circumstances”, and enforcement was refused.\nIn\nPayward Inc, Payward Ventures Inc and Payward Ltd v Chechetkin [2023] EWHC 1780 (Comm)\n, the English Commercial Court refused to enforce a California-seated arbitration award, on the basis that enforcement would contravene UK public policy as embodied in the Consumer Rights Act 2015 (CRA 2015) and the Financial Services and Markets Act 2000 (FSMA).\nMr Chechetkin was a “consumer” for the purposes of the CRA 2015. Mr Chechetkin was a lawyer acting on his own behalf with no intention to resell cryptocurrencies as a business. He did not work in crypto or fintech and had indicated that he had no experience of cryptocurrency trading when he opened his Kraken account.\nThe Commercial Court was not bound by the decisions of the JAMS arbitrator. The Commercial Court was not bound by the decisions of the JAMS arbitrator and should not necessarily be obliged to enforce an award that is contrary to UK public policy merely because the arbitrator’s decision had indicated otherwise.\nEnforcement of the arbitral award would be contrary to public policy under the CRA 2015 and FSMA. The CRA 2015 applies where a consumer contract has a close connection with the UK and requires the court to consider whether a term is fair even if none of the parties have raised it as an issue. The Payward terms were found to have a close connection with the UK because: both Mr Chechetkin and Payward Ltd were domiciled in England, and the services were paid for in sterling using English bank accounts.\nIn addition, the Commercial Court held that a reasonable consumer would not have agreed to California-seated arbitration, under JAMS and subject to the U.S. Federal Arbitration Act, as this brought with it significant disadvantages regarding the application of English law (including the CRA 2015 and FSMA). Nevertheless, the arbitrator took no account of English law, meaning that enforcement would be contrary to UK public policy. The Commercial Court also found that enforcement would stifle Mr Chechetkin’s claim under FSMA in circumstances where he had at least a prima facie claim. This would be contrary to public policy since contracts concluded in contravention of the general prohibition in section 19 of FSMA should be unenforceable and the customer should be entitled to recover his money.\nEnglish Commercial Court Refuses Recognition and Enforcement of California-Seated Arbitration Award on Grounds of Public Policy, 7 August 2023\nThe literal lawlessness of JAMS, and its abject refusal to require its own arbitrators to follow its own rules, is going to destroy both the arbitration system as well as the ridiculous unilateral dynamic contracts that permit technology companies to literally change the rules on their customers and employees alike, and to shamelessly abuse them without any legal consequences.\nThe legal system is bad enough as it is, but the arbitration system is even more corrupt. It’s good that at least one legal system is openly establishing the legal irrelevance of the latter.\nDISCUSS ON SG",
  "tags": [
    "law",
    "UK"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-08-10T09:03:31+00:00"
}