{
  "url": "https://voxday.net/2023/08/13/they-cant-hide-the-bodies/",
  "scraped_at": "2026-01-08T14:05:57.061686",
  "title": "They Can’t Hide the Bodies",
  "date_display": "August 13, 2023",
  "date_iso": "2023-08-13T10:28:29+00:00",
  "date_from_url": "2023-08-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The proof has always been, not in the pudding, but in the “inexplicable” excess deaths that began with the mass Covid-19 vaccination campaigns. And while the initial set of adverse reactions were not as widespread or as fatal as we’d feared, it appears that the insidious long-term and/or ongoing damage being caused by the mRNA technology is still being revealed by the number of deaths above baseline averages, particularly in the younger, healthier populations.</p><p>This is where the conclusive and irrefutable evidence of the injurious nature of the vaxx is going to be provided, as no amount of denial and groundless theories about global warming and gaslighting about how there have always been excess deaths – one of the most retarded and oxymoronic arguments ever articulated, by the way – will be able to handwave it away. But the facts about excess deaths across every vaxxed population <a href=\"https://pierrekory.substack.com/p/i-published-an-op-ed-in-usa-today\">are beginning to appear</a> in the mainstream news.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>In the U.S., 76 percent of Covid-19 deaths occurred among people 65 and up. But now, excess deaths are flat for seniors, while they are soaring for the able-bodied young and employed, a cohort that has traditionally been the healthiest in society.</p><p>In the last quarter of 2022, deaths among 35-to-44 year-olds were 34 percent above the 2017-to-2019 baseline normal; they were 23 percent above baseline in workers a decade younger and older.</p><p>In the dry parlance of an actuarial report, “The working-age population continues to see the highest A/E (actual-to-expected) ratios.” Tragically, deaths were 8 percent above normal among 0-to-24 year-olds.</p><p>There are other anomalies depicted in the Society of Actuaries report.</p><p>Throughout the pandemic and into 2022, white collar workers, in public administration and educational services for example, died at rates 19 percent above normal, while blue collar workers, curiously, suffered less, with 14 percent more deaths than expected. What made these highly-vaccinated workers, many by mandate, more vulnerable?</p><p>As concerning were momentous shifts in worker mortality in the third quarter of 2021. White collar deaths reached 39 percent above normal. Deaths for all employees were 34 percent higher than baseline. Mortality among 35-to-44 year-olds reached a stunning 101 percent above–or double–the three-year pre-pandemic baseline. In a seeming contradiction, U.S. Covid deaths during that period were 40 percent lower than the previous wave in 2021. This suggests other factors at play.</p><p>These deaths should cause alarms to go off. They occurred in a population—those with life insurance—whose education, income, and access to healthcare suggest that they, of all people, should have gone back to their pre-pandemic lives. Consider the fate of less entitled groups.</p><p>In England, a searchable government database tells wrenching stories of excess death, like the 42 people, from birth to 24 years old, who died in a two-week period in May—children perhaps, adolescents and young adults who might be alive but for a pandemic.</p><p>Playing a huge role in England’s excess deaths is cardiovascular disease, which claimed 1,300 more people over normal in the four weeks this spring. Is this a remnant of Covid or of something else? Officials need to study also why a consistently greater share of these excess deaths occur at home, rather than in hospitals, care homes and hospice.</p><p>The executive of a large Indiana life insurance company was clearly troubled by what he said was a 40% increase in the third quarter of 2021 in those ages 18-64.</p><p>“We are seeing, right now, the highest death rates we have seen in the history of this business – not just at OneAmerica,” CEO Scott Davison said during an online news conference in January 2022. “The data is consistent across every player in that business.”</p> <cite>WHAT IS KILLING PEOPLE?, 12 August 2023</cite></blockquote><p>None of this is news to any of the readers here, except that an excerpt of this article was published in <em>USA Today</em>. Which may indicate, as the authors suggest, that the mainstream’s wall of silence is beginning to crack. Soon, one hopes, we won’t even be able to say “we don’t know it’s the vaxx, but…” because we, and everyone else, will know it’s the vaxx.</p><p>A second article by the same doctor <a href=\"https://pierrekory.substack.com/p/the-may-2023-society-of-actuaries\">shows the latest actuarial data</a> through the end of 2022. Notice that that the rate of excess deaths are higher for everyone from 25 to 64 in the second half of 2021 (vaxx) than they are for the 65+ group in the second half of 2020 (Covid).</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-59118\" decoding=\"async\" fetchpriority=\"high\" height=\"146\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/08/image-15.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/08/image-15.png 512w, https://voxday.net/wp-content/uploads/2023/08/image-15-300x86.png 300w\" width=\"512\"/></figure></div><p>Note that previous Society of Actuaries reports show that all-cause excess deaths began to rise in March 2020 and did not reach 120 percent for any age group prior to Q3 2020, so the chart above displays the full extent of the pandemic’s effect on mortality.</p><p>The statistics prove that the cure was literally worse than the disease. This is why you and your friends and family shouldn’t take the next vaccine they attempt to push on everyone either. Because you know they’re going to sell it with the line that while they might have gotten it wrong last time with Covid-19, this time it’s <em>totally </em>safe and effective.</p><p><em><a href=\"https://social.infogalactic.com/micropost/b567fa5e-8737-485a-8a47-fe1a3980329a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The proof has always been, not in the pudding, but in the “inexplicable” excess deaths that began with the mass Covid-19 vaccination campaigns. And while the initial set of adverse reactions were not as widespread or as fatal as we’d feared, it appears that the insidious long-term and/or ongoing damage being caused by the mRNA technology is still being revealed by the number of deaths above baseline averages, particularly in the younger, healthier populations.\nThis is where the conclusive and irrefutable evidence of the injurious nature of the vaxx is going to be provided, as no amount of denial and groundless theories about global warming and gaslighting about how there have always been excess deaths – one of the most retarded and oxymoronic arguments ever articulated, by the way – will be able to handwave it away. But the facts about excess deaths across every vaxxed population\nare beginning to appear\nin the mainstream news.\nIn the U.S., 76 percent of Covid-19 deaths occurred among people 65 and up. But now, excess deaths are flat for seniors, while they are soaring for the able-bodied young and employed, a cohort that has traditionally been the healthiest in society.\nIn the last quarter of 2022, deaths among 35-to-44 year-olds were 34 percent above the 2017-to-2019 baseline normal; they were 23 percent above baseline in workers a decade younger and older.\nIn the dry parlance of an actuarial report, “The working-age population continues to see the highest A/E (actual-to-expected) ratios.” Tragically, deaths were 8 percent above normal among 0-to-24 year-olds.\nThere are other anomalies depicted in the Society of Actuaries report.\nThroughout the pandemic and into 2022, white collar workers, in public administration and educational services for example, died at rates 19 percent above normal, while blue collar workers, curiously, suffered less, with 14 percent more deaths than expected. What made these highly-vaccinated workers, many by mandate, more vulnerable?\nAs concerning were momentous shifts in worker mortality in the third quarter of 2021. White collar deaths reached 39 percent above normal. Deaths for all employees were 34 percent higher than baseline. Mortality among 35-to-44 year-olds reached a stunning 101 percent above–or double–the three-year pre-pandemic baseline. In a seeming contradiction, U.S. Covid deaths during that period were 40 percent lower than the previous wave in 2021. This suggests other factors at play.\nThese deaths should cause alarms to go off. They occurred in a population—those with life insurance—whose education, income, and access to healthcare suggest that they, of all people, should have gone back to their pre-pandemic lives. Consider the fate of less entitled groups.\nIn England, a searchable government database tells wrenching stories of excess death, like the 42 people, from birth to 24 years old, who died in a two-week period in May—children perhaps, adolescents and young adults who might be alive but for a pandemic.\nPlaying a huge role in England’s excess deaths is cardiovascular disease, which claimed 1,300 more people over normal in the four weeks this spring. Is this a remnant of Covid or of something else? Officials need to study also why a consistently greater share of these excess deaths occur at home, rather than in hospitals, care homes and hospice.\nThe executive of a large Indiana life insurance company was clearly troubled by what he said was a 40% increase in the third quarter of 2021 in those ages 18-64.\n“We are seeing, right now, the highest death rates we have seen in the history of this business – not just at OneAmerica,” CEO Scott Davison said during an online news conference in January 2022. “The data is consistent across every player in that business.”\nWHAT IS KILLING PEOPLE?, 12 August 2023\nNone of this is news to any of the readers here, except that an excerpt of this article was published in\nUSA Today\n. Which may indicate, as the authors suggest, that the mainstream’s wall of silence is beginning to crack. Soon, one hopes, we won’t even be able to say “we don’t know it’s the vaxx, but…” because we, and everyone else, will know it’s the vaxx.\nA second article by the same doctor\nshows the latest actuarial data\nthrough the end of 2022. Notice that that the rate of excess deaths are higher for everyone from 25 to 64 in the second half of 2021 (vaxx) than they are for the 65+ group in the second half of 2020 (Covid).\nNote that previous Society of Actuaries reports show that all-cause excess deaths began to rise in March 2020 and did not reach 120 percent for any age group prior to Q3 2020, so the chart above displays the full extent of the pandemic’s effect on mortality.\nThe statistics prove that the cure was literally worse than the disease. This is why you and your friends and family shouldn’t take the next vaccine they attempt to push on everyone either. Because you know they’re going to sell it with the line that while they might have gotten it wrong last time with Covid-19, this time it’s\ntotally\nsafe and effective.\nDISCUSS ON SG",
  "tags": [
    "media",
    "science",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-08-13T15:01:14+00:00"
}