{
  "url": "https://voxday.net/2023/08/23/us-historical-hypocrisy/",
  "scraped_at": "2026-01-08T14:07:00.224022",
  "title": "US Historical Hypocrisy",
  "date_display": "August 23, 2023",
  "date_iso": "2023-08-23T16:05:22+00:00",
  "date_from_url": "2023-08-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Chinese diplomats are well-educated in US history, which is a real problem for US diplomats.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>BLOOMBERG: <em>The US said on Tuesday that it will impose visa limits on some officials in China for their part in allegedly forcing Tibetan children to assimilate into mainstream Chinese society. What is the Ministry of Foreign Affairs’ response?</em></strong></p><p><strong>Wang Wenbin: </strong>The US imposed those illegal sanctions on Chinese officials under the pretext of Tibet-related issues and in disregard of the facts. This move gravely interferes in China’s internal affairs, harms China’s interests, and violates basic norms governing international relations. We firmly oppose and strongly condemn it.</p><p>The human rights conditions in Tibet are at their historical best, as witnessed by the international community. The region has long enjoyed a booming economy, harmonious and stable society, and effective protection and promotion of cultural heritage. The rights and freedoms of all ethnic groups, including the freedom of religious belief and the freedom to use and develop their ethnic groups’ spoken and written languages, are fully protected. As is commonly seen around the world, there are boarding schools across Chinese provinces and regions to meet the need of the local students. In the case of China’s Tibet, this is a region of high altitude and highly scattered population in many areas. For children from herding families in particular, they have to travel long distances to get to school. If schools were to be built in every place the students live, it would be very difficult to ensure adequate teachers and quality of teaching in each school. That is why boarding schools have been set up as a practical way to ensure all children’s equal right to education. It is entirely up to the students and their parents whether to go to boarding schools or not. Students can choose to go home on every weekend, holiday and festival (including traditional Tibetan festivals such as the Tibetan New Year and the Shoton Festival), as well as during the winter and summer breaks. Parents can visit their children at school any time and take their children home whenever needed. Courses of traditional culture, such as Tibetan language and literature and folk dance, are widely available, traditional food unique to the Tibet Plateau is provided, and students are allowed to wear traditional dresses at these schools. The boarding schools in Tibet are examples of human rights and cultural heritage protection. The so-called “forced assimilation” is pure fabrication.</p><p>In contrast, throughout the US history, more than 4.7 million Native Americans were slaughtered, and people of Asian and African descent and other ethnic communities suffer daily from the scourge of racial discrimination. In recent years, the US’s armed invasion has led to millions of casualties in Afghanistan, Iraq, Libya and Syria. The US needs to reflect on itself, instead of styling itself as a judge and wantonly meddling in other countries’ internal affairs by wielding the big stick of “human rights”.</p><p>I need to stress that Tibet-related affairs are purely China’s internal affairs that brook no foreign interference. The US needs to respect facts, fulfill its commitment on Tibet, stop using Tibet-related issues to meddle in China’s internal affairs and undermine China’s interests, and immediately withdraw its wrong decision. Otherwise, there will be a resolute response from China.</p></blockquote><p>To say that the USA is badly losing the battle for global hearts and minds would be an understatement. All the USA really had going for it once the rest of the world industrialized in the aftermath of WWII was a) its military and b) the dollar. And international confidence in both are rapidly falling.</p><p>What makes the Chinese so formidable on the global stage is the fact that unlike Europeans, they understand the influence of word magic. And unlike Clown World, they understand that power trumps influence.</p><p><em><a href=\"https://social.infogalactic.com/micropost/36bf0ab6-f7fa-42d5-828e-2c7577589be7\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Chinese diplomats are well-educated in US history, which is a real problem for US diplomats.\nBLOOMBERG:\nThe US said on Tuesday that it will impose visa limits on some officials in China for their part in allegedly forcing Tibetan children to assimilate into mainstream Chinese society. What is the Ministry of Foreign Affairs’ response?\nWang Wenbin:\nThe US imposed those illegal sanctions on Chinese officials under the pretext of Tibet-related issues and in disregard of the facts. This move gravely interferes in China’s internal affairs, harms China’s interests, and violates basic norms governing international relations. We firmly oppose and strongly condemn it.\nThe human rights conditions in Tibet are at their historical best, as witnessed by the international community. The region has long enjoyed a booming economy, harmonious and stable society, and effective protection and promotion of cultural heritage. The rights and freedoms of all ethnic groups, including the freedom of religious belief and the freedom to use and develop their ethnic groups’ spoken and written languages, are fully protected. As is commonly seen around the world, there are boarding schools across Chinese provinces and regions to meet the need of the local students. In the case of China’s Tibet, this is a region of high altitude and highly scattered population in many areas. For children from herding families in particular, they have to travel long distances to get to school. If schools were to be built in every place the students live, it would be very difficult to ensure adequate teachers and quality of teaching in each school. That is why boarding schools have been set up as a practical way to ensure all children’s equal right to education. It is entirely up to the students and their parents whether to go to boarding schools or not. Students can choose to go home on every weekend, holiday and festival (including traditional Tibetan festivals such as the Tibetan New Year and the Shoton Festival), as well as during the winter and summer breaks. Parents can visit their children at school any time and take their children home whenever needed. Courses of traditional culture, such as Tibetan language and literature and folk dance, are widely available, traditional food unique to the Tibet Plateau is provided, and students are allowed to wear traditional dresses at these schools. The boarding schools in Tibet are examples of human rights and cultural heritage protection. The so-called “forced assimilation” is pure fabrication.\nIn contrast, throughout the US history, more than 4.7 million Native Americans were slaughtered, and people of Asian and African descent and other ethnic communities suffer daily from the scourge of racial discrimination. In recent years, the US’s armed invasion has led to millions of casualties in Afghanistan, Iraq, Libya and Syria. The US needs to reflect on itself, instead of styling itself as a judge and wantonly meddling in other countries’ internal affairs by wielding the big stick of “human rights”.\nI need to stress that Tibet-related affairs are purely China’s internal affairs that brook no foreign interference. The US needs to respect facts, fulfill its commitment on Tibet, stop using Tibet-related issues to meddle in China’s internal affairs and undermine China’s interests, and immediately withdraw its wrong decision. Otherwise, there will be a resolute response from China.\nTo say that the USA is badly losing the battle for global hearts and minds would be an understatement. All the USA really had going for it once the rest of the world industrialized in the aftermath of WWII was a) its military and b) the dollar. And international confidence in both are rapidly falling.\nWhat makes the Chinese so formidable on the global stage is the fact that unlike Europeans, they understand the influence of word magic. And unlike Clown World, they understand that power trumps influence.\nDISCUSS ON SG",
  "tags": [
    "China",
    "education",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-08-23T16:05:24+00:00"
}