{
  "url": "https://voxday.net/2023/08/12/vocation-and-articulation/",
  "scraped_at": "2026-01-08T14:05:53.989309",
  "title": "Vocation and Articulation",
  "date_display": "August 12, 2023",
  "date_iso": "2023-08-12T22:29:57+00:00",
  "date_from_url": "2023-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sarah Hoyt <a href=\"https://accordingtohoyt.com/2023/08/10/when-the-heart-breaks/\">describes the challenges</a> of attempting to make a living doing what you love when the entire system is more or less stacked against you:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I want to talk about the human with a vocation/with a need to do something. The something exists in the world. They can theoretically do it.</p><p>Then human meets the broken systems. Which I don’t think are YET at peak broken, but are heading there.</p><p>As I said, I’ve seen it happen in writing, in art, in teaching, but I’m seeing it a bit everywhere.</p><p>You try, but no matter how much you try, how hard you work, or what you do, it seems like everything is against you. And because no one — no one — talks about it it openly, most people who are failing badly think they’re alone in this, and that everyone else is WILDLY successful: writers, artists, mothers (particularly of boys), teachers, etc. etc. etc.</p><p>You think “the system is broken? Or is it? Am I just making excuses for myself?” And you try harder. But since the system is actually designed NOT to work, (and you’re mostly seeing the successful people who are either flukes, a well polished facade, or people who are having transitory success and will be shredded later) you keep getting beat. Sometimes you have a little success first, but it all breaks apart later.</p><p>Another way to “fail” is to have a very strong brand, do very well with it, and then…. well, it falls apart. Either because you changed, and don’t do the thing the way you did it initially, or because — for artists, though I’m sure there’s parallels in other professions — your public changed. Or changed the way they see you.</p><p>Let’s say you’re to the right of Lenin (or these days, Stalin) and you’re a writer of science fiction and fantasy (or certain types of romance; or–), working in the indie side, you might very well build a huge audience, who run screaming when they find you’re one of those “evil right wingers” or who at least can’t withstand a loud and sustained cancel campaign. It’s happened to several of us. And then, of course, you start wondering why you feel called to do this, when you have political opinions so at variance with the “community who reads this” (Or at least the loud parts of the community. And this one is complex, because it’s hard to find readers, anyway, and if all readers think sf/f is left, a lot of people who would otherwise enjoy it don’t even try it out. Kind of like I keep running into “Science fiction is porn” which apparently is from…. guess? Oh, you’ll never guess. Clan of the Cavebear, which is neither science fiction nor porn, but some readers of a certain age associate that with both. That will change, as indie makes a dent. Takes time, though. I mean the association of SF/F and “left”.)</p><p>Okay, so…. Never mind why your heart broke. One day you wake up and you think “I just can’t do this anymore. It’s been my driving force since…. ever. But I can’t. I can’t anymore.”</p><p>What you’re experiencing, unless it’s your very first failure — and it usually isn’t — is … well, I call it a broken heart, but it’s actually ptsd and burnout.</p></blockquote><p>My solution – and I am not recommending it, merely sharing my perspective – is to simply refuse to regard my activity as economic in nature. I’m not bearing down this week in order to finish the 297,500-word final edition of <em>A SEA OF SKULLS</em> this month because some people might buy it or because it might generate some revenue or because it will make a pretty pair of leather books or because some people might be impressed with me as a writer. I literally don’t think about those things at all, and I think that if I did, it would hinder my ability to write.</p><p>I’m doing it because I want to do it. I’m continuing the story because the story continues in my head and it isn’t finished yet.</p><p>Sarah touches on this tangentially in her piece: <em>This is the secret no one else will tell you: There is no career. The career is a lie.</em></p><p>I don’t consider myself to have “a career as a writer”. I just write books. Then Castalia publishes them. Repeat as desired. As long as the ideas continue to percolate and flow, I will write them down, in part because the smartest girl I ever knew once told her friend that an idea is only a feeling until it is articulated. And I like to articulate my ideas, which necessitates writing them down because talking to other people too often leads to distraction.</p><p>Also, in case anyone is interested, I’ve recently written an introduction for an unannounced Castalia History book that I believe will prove enlightening….</p><p><em><a href=\"https://social.infogalactic.com/micropost/dad2ea2f-6ddb-47b6-8423-1a7c86baa0ed\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Sarah Hoyt\ndescribes the challenges\nof attempting to make a living doing what you love when the entire system is more or less stacked against you:\nI want to talk about the human with a vocation/with a need to do something. The something exists in the world. They can theoretically do it.\nThen human meets the broken systems. Which I don’t think are YET at peak broken, but are heading there.\nAs I said, I’ve seen it happen in writing, in art, in teaching, but I’m seeing it a bit everywhere.\nYou try, but no matter how much you try, how hard you work, or what you do, it seems like everything is against you. And because no one — no one — talks about it it openly, most people who are failing badly think they’re alone in this, and that everyone else is WILDLY successful: writers, artists, mothers (particularly of boys), teachers, etc. etc. etc.\nYou think “the system is broken? Or is it? Am I just making excuses for myself?” And you try harder. But since the system is actually designed NOT to work, (and you’re mostly seeing the successful people who are either flukes, a well polished facade, or people who are having transitory success and will be shredded later) you keep getting beat. Sometimes you have a little success first, but it all breaks apart later.\nAnother way to “fail” is to have a very strong brand, do very well with it, and then…. well, it falls apart. Either because you changed, and don’t do the thing the way you did it initially, or because — for artists, though I’m sure there’s parallels in other professions — your public changed. Or changed the way they see you.\nLet’s say you’re to the right of Lenin (or these days, Stalin) and you’re a writer of science fiction and fantasy (or certain types of romance; or–), working in the indie side, you might very well build a huge audience, who run screaming when they find you’re one of those “evil right wingers” or who at least can’t withstand a loud and sustained cancel campaign. It’s happened to several of us. And then, of course, you start wondering why you feel called to do this, when you have political opinions so at variance with the “community who reads this” (Or at least the loud parts of the community. And this one is complex, because it’s hard to find readers, anyway, and if all readers think sf/f is left, a lot of people who would otherwise enjoy it don’t even try it out. Kind of like I keep running into “Science fiction is porn” which apparently is from…. guess? Oh, you’ll never guess. Clan of the Cavebear, which is neither science fiction nor porn, but some readers of a certain age associate that with both. That will change, as indie makes a dent. Takes time, though. I mean the association of SF/F and “left”.)\nOkay, so…. Never mind why your heart broke. One day you wake up and you think “I just can’t do this anymore. It’s been my driving force since…. ever. But I can’t. I can’t anymore.”\nWhat you’re experiencing, unless it’s your very first failure — and it usually isn’t — is … well, I call it a broken heart, but it’s actually ptsd and burnout.\nMy solution – and I am not recommending it, merely sharing my perspective – is to simply refuse to regard my activity as economic in nature. I’m not bearing down this week in order to finish the 297,500-word final edition of\nA SEA OF SKULLS\nthis month because some people might buy it or because it might generate some revenue or because it will make a pretty pair of leather books or because some people might be impressed with me as a writer. I literally don’t think about those things at all, and I think that if I did, it would hinder my ability to write.\nI’m doing it because I want to do it. I’m continuing the story because the story continues in my head and it isn’t finished yet.\nSarah touches on this tangentially in her piece:\nThis is the secret no one else will tell you: There is no career. The career is a lie.\nI don’t consider myself to have “a career as a writer”. I just write books. Then Castalia publishes them. Repeat as desired. As long as the ideas continue to percolate and flow, I will write them down, in part because the smartest girl I ever knew once told her friend that an idea is only a feeling until it is articulated. And I like to articulate my ideas, which necessitates writing them down because talking to other people too often leads to distraction.\nAlso, in case anyone is interested, I’ve recently written an introduction for an unannounced Castalia History book that I believe will prove enlightening….\nDISCUSS ON SG",
  "tags": [
    "philosophy",
    "SJW",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-08-12T22:33:33+00:00"
}