{
  "url": "https://voxday.net/2023/08/21/were-number-20/",
  "scraped_at": "2026-01-08T14:06:46.939559",
  "title": "We’re Number 20",
  "date_display": "August 21, 2023",
  "date_iso": "2023-08-21T15:25:07+00:00",
  "date_from_url": "2023-08-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not sure exactly what these lists are supposed to represent, but according to Ron Unz and Similarweb, the popularity of this site has risen four spots, <a href=\"https://www.unz.com/announcement/very-encouraging-website-traffic/\">from number 24 to number 20</a>, on his comparative list of 87 alternative media sites.</p><ol class=\"wp-block-list\"><li>ZeroHedge</li><li>The Epoch Times</li><li>National Review</li><li>Daily Caller</li><li>Infowars</li><li>Daily Stormer</li><li>Jacobin Magazine</li><li>Reason Magazine</li><li>The Unz Review</li><li>LewRockwell</li><li>Unherd</li><li>Alternet</li><li>Foreign Policy</li><li>Moon of Alabama</li><li>Conservative Treehouse</li><li>Prager U</li><li>Lifesite News</li><li>The Daily Sceptic</li><li>New Republic</li><li>VoxDay</li></ol><p>While the numbers upon which these rankings are based are an estimate piled on top of a guess added to a surmise, which is to say they are nearly entirely fictional, they are probably more legitimate than any numbers you see for the mainstream media. As Cerno and others have noted, even a massive headline article in a major magazine doesn’t move the needle by any objective metric, whereas a link from one of these sites is almost certain to sell a few books.</p><p>It would have been interesting to see where this blog ranked vis-a-vis the other sites before it was ejected from Blogger. As far as I can tell, pageviews dropped to one-quarter of what they were before, but I don’t trust either the Google or the WordPress numbers; other metrics appear to indicate that not much has changed in terms of the size of the community. Certainly there are more people on SG than before, but this blog is not the only conduit, so that’s probably not relevant. Regardless, we’re better off on our own servers.</p><p>The one thing that leaped out at me is the way in which many of the straight conservative sites such as <em>American Conservative</em> appear to be losing readers. This makes sense given the worse-than-uselessness of the conservative media and the Republican establishment. I expect next year’s list will be even harder on neocon sites like <em>National Review </em>and <em>Prager U</em>.</p><p>Speaking of writing, Castalia is about to publish the print edition of <em>THE ALTAR OF HATE</em>, my collection of non-Selenoth, non-QM short stories. If any established, published authors would be interested in having a look at the stories and writing a forward to it, please shoot me an email and I’ll get a draft epub out to you. I’m not looking for anything hagiographic, much less serious literary criticism, just the general perspective of an experienced and well-read fellow author capable of intelligently discussing the works for the benefit of the casual reader.</p><p><em><a href=\"https://social.infogalactic.com/micropost/e630c6e6-e1be-42e7-a0d8-36af14c38a40\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I’m not sure exactly what these lists are supposed to represent, but according to Ron Unz and Similarweb, the popularity of this site has risen four spots,\nfrom number 24 to number 20\n, on his comparative list of 87 alternative media sites.\nZeroHedge\nThe Epoch Times\nNational Review\nDaily Caller\nInfowars\nDaily Stormer\nJacobin Magazine\nReason Magazine\nThe Unz Review\nLewRockwell\nUnherd\nAlternet\nForeign Policy\nMoon of Alabama\nConservative Treehouse\nPrager U\nLifesite News\nThe Daily Sceptic\nNew Republic\nVoxDay\nWhile the numbers upon which these rankings are based are an estimate piled on top of a guess added to a surmise, which is to say they are nearly entirely fictional, they are probably more legitimate than any numbers you see for the mainstream media. As Cerno and others have noted, even a massive headline article in a major magazine doesn’t move the needle by any objective metric, whereas a link from one of these sites is almost certain to sell a few books.\nIt would have been interesting to see where this blog ranked vis-a-vis the other sites before it was ejected from Blogger. As far as I can tell, pageviews dropped to one-quarter of what they were before, but I don’t trust either the Google or the WordPress numbers; other metrics appear to indicate that not much has changed in terms of the size of the community. Certainly there are more people on SG than before, but this blog is not the only conduit, so that’s probably not relevant. Regardless, we’re better off on our own servers.\nThe one thing that leaped out at me is the way in which many of the straight conservative sites such as\nAmerican Conservative\nappear to be losing readers. This makes sense given the worse-than-uselessness of the conservative media and the Republican establishment. I expect next year’s list will be even harder on neocon sites like\nNational Review\nand\nPrager U\n.\nSpeaking of writing, Castalia is about to publish the print edition of\nTHE ALTAR OF HATE\n, my collection of non-Selenoth, non-QM short stories. If any established, published authors would be interested in having a look at the stories and writing a forward to it, please shoot me an email and I’ll get a draft epub out to you. I’m not looking for anything hagiographic, much less serious literary criticism, just the general perspective of an experienced and well-read fellow author capable of intelligently discussing the works for the benefit of the casual reader.\nDISCUSS ON SG",
  "tags": [
    "books",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-08-21T15:25:34+00:00"
}