{
  "url": "https://voxday.net/2023/08/05/you-are-the-bad-guys/",
  "scraped_at": "2026-01-08T14:05:04.423131",
  "title": "You Are the Bad Guys",
  "date_display": "August 5, 2023",
  "date_iso": "2023-08-05T15:08:13+00:00",
  "date_from_url": "2023-08-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David Brooks attempts <a href=\"https://www.nytimes.com/2023/08/02/opinion/trump-meritocracy-educated.html\">to warn his fellow “class”</a> that a reckoning for their irresponsible and self-serving misrule is historically inevitable.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I ask you to try on a vantage point in which we anti-Trumpers are not the eternal good guys. In fact, we’re the bad guys.</p><p>This story begins in the 1960s, when high school grads had to go off to fight in Vietnam but the children of the educated class got college deferments. It continues in the 1970s, when the authorities imposed busing on working-class areas in Boston but not on the upscale communities like Wellesley where they themselves lived.</p><p>The ideal that we’re all in this together was replaced with the reality that the educated class lives in a world up here and everybody else is forced into a world down there. Members of our class are always publicly speaking out for the marginalized, but somehow we always end up building systems that serve ourselves.</p><p>The most important of those systems is the modern meritocracy. We built an entire social order that sorts and excludes people on the basis of the quality that we possess most: academic achievement. Highly educated parents go to elite schools, marry each other, work at high-paying professional jobs and pour enormous resources into our children, who get into the same elite schools, marry each other and pass their exclusive class privileges down from generation to generation.</p><p>Daniel Markovits summarized years of research in his book “The Meritocracy Trap”: “Today, middle-class children lose out to the rich children at school, and middle-class adults lose out to elite graduates at work. Meritocracy blocks the middle class from opportunity. Then it blames those who lose a competition for income and status that, even when everyone plays by the rules, only the rich can win.”</p><p>The meritocracy isn’t only a system of exclusion; it’s an ethos. During his presidency, Barack Obama used the word “smart” in the context of his policies over 900 times. The implication was that anybody who disagreed with his policies (and perhaps didn’t go to Harvard Law) must be stupid.</p><p>Over the last decades, we’ve taken over whole professions and locked everybody else out….</p><p>It’s easy to understand why people in less-educated classes would conclude that they are under economic, political, cultural and moral assault — and why they’ve rallied around Trump as their best warrior against the educated class. He understood that it’s not the entrepreneurs who seem most threatening to workers; it’s the professional class. Trump understood that there was great demand for a leader who would stick his thumb in our eyes on a daily basis and reject the whole epistemic regime that we rode in on.</p><p>If distrustful populism is your basic worldview, the Trump indictments seem like just another skirmish in the class war between the professionals and the workers, another assault by a bunch of coastal lawyers who want to take down the man who most aggressively stands up to them. Of course, the indictments don’t cause Trump supporters to abandon him. They cause them to become more fiercely loyal. That’s the polling story of the last six months…</p><p>But there’s a larger context here. As the sociologist E. Digby Baltzell wrote decades ago, “History is a graveyard of classes which have preferred caste privileges to leadership.” That is the destiny our class is now flirting with.</p> <cite>On Anti-Trumpers and the Modern Meritocracy, David Brooks, 3 August 2023</cite></blockquote><p>The “educated class” advantaged by “meritocracy”, as Brooks mendaciously describes his fellow corrupt, ethnocentric nepotists who are neither as educated nor as smart nor as accomplished as they believe themselves to be, is rightly getting worried. Not being aristocrats or empire-builders, they never understood the absolute necessity of <em>noblesse oblige</em> or serving as positive role models for their social inferiors. They were never capable of nor interested in leadership; they lacked any vision beyond pure hedonism supported by slaves. And they failed to comprehend the obvious fact that the flea which outgrows the dog upon which it lives cannot survive.</p><p>Their rapacious greed has damned and doomed them. So they had better enjoy their caste privileges while those privileges last, because the reckoning is absolutely inevitable.</p><p><em><a href=\"https://social.infogalactic.com/micropost/4ade39ff-a396-41d7-b20d-3659350b0613\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "David Brooks attempts\nto warn his fellow “class”\nthat a reckoning for their irresponsible and self-serving misrule is historically inevitable.\nI ask you to try on a vantage point in which we anti-Trumpers are not the eternal good guys. In fact, we’re the bad guys.\nThis story begins in the 1960s, when high school grads had to go off to fight in Vietnam but the children of the educated class got college deferments. It continues in the 1970s, when the authorities imposed busing on working-class areas in Boston but not on the upscale communities like Wellesley where they themselves lived.\nThe ideal that we’re all in this together was replaced with the reality that the educated class lives in a world up here and everybody else is forced into a world down there. Members of our class are always publicly speaking out for the marginalized, but somehow we always end up building systems that serve ourselves.\nThe most important of those systems is the modern meritocracy. We built an entire social order that sorts and excludes people on the basis of the quality that we possess most: academic achievement. Highly educated parents go to elite schools, marry each other, work at high-paying professional jobs and pour enormous resources into our children, who get into the same elite schools, marry each other and pass their exclusive class privileges down from generation to generation.\nDaniel Markovits summarized years of research in his book “The Meritocracy Trap”: “Today, middle-class children lose out to the rich children at school, and middle-class adults lose out to elite graduates at work. Meritocracy blocks the middle class from opportunity. Then it blames those who lose a competition for income and status that, even when everyone plays by the rules, only the rich can win.”\nThe meritocracy isn’t only a system of exclusion; it’s an ethos. During his presidency, Barack Obama used the word “smart” in the context of his policies over 900 times. The implication was that anybody who disagreed with his policies (and perhaps didn’t go to Harvard Law) must be stupid.\nOver the last decades, we’ve taken over whole professions and locked everybody else out….\nIt’s easy to understand why people in less-educated classes would conclude that they are under economic, political, cultural and moral assault — and why they’ve rallied around Trump as their best warrior against the educated class. He understood that it’s not the entrepreneurs who seem most threatening to workers; it’s the professional class. Trump understood that there was great demand for a leader who would stick his thumb in our eyes on a daily basis and reject the whole epistemic regime that we rode in on.\nIf distrustful populism is your basic worldview, the Trump indictments seem like just another skirmish in the class war between the professionals and the workers, another assault by a bunch of coastal lawyers who want to take down the man who most aggressively stands up to them. Of course, the indictments don’t cause Trump supporters to abandon him. They cause them to become more fiercely loyal. That’s the polling story of the last six months…\nBut there’s a larger context here. As the sociologist E. Digby Baltzell wrote decades ago, “History is a graveyard of classes which have preferred caste privileges to leadership.” That is the destiny our class is now flirting with.\nOn Anti-Trumpers and the Modern Meritocracy, David Brooks, 3 August 2023\nThe “educated class” advantaged by “meritocracy”, as Brooks mendaciously describes his fellow corrupt, ethnocentric nepotists who are neither as educated nor as smart nor as accomplished as they believe themselves to be, is rightly getting worried. Not being aristocrats or empire-builders, they never understood the absolute necessity of\nnoblesse oblige\nor serving as positive role models for their social inferiors. They were never capable of nor interested in leadership; they lacked any vision beyond pure hedonism supported by slaves. And they failed to comprehend the obvious fact that the flea which outgrows the dog upon which it lives cannot survive.\nTheir rapacious greed has damned and doomed them. So they had better enjoy their caste privileges while those privileges last, because the reckoning is absolutely inevitable.\nDISCUSS ON SG",
  "tags": [
    "history",
    "Judeochristianity",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-08-05T15:08:14+00:00"
}