{
  "url": "https://voxday.net/2025/10/05/all-that-fake-forgiveness/",
  "scraped_at": "2026-01-08T20:33:09.375931",
  "title": "All That Fake Forgiveness",
  "date_display": "October 5, 2025",
  "date_iso": "2025-10-05T13:51:46+00:00",
  "date_from_url": "2025-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For the last 60 years, the federal government <a href=\"https://x.com/realhumanschwab/status/1974380850746646896\">has been funding an agency</a> to “encourage” the families of white victims to refrain from expressing their anger and seeking vengeance for the death of their loved ones at the hands of black murderers. It’s called “Community Relations Service” and it is why every murder of a white person committed by minorities is reliably followed by an insipid statement by a family member about how they a) decry racism and b) preemptively forgive the unrepentant murderer:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I’m looking into the Community Relations Service and going insane. You’re telling me we had a fucking X-Files of black people crimes that was the only part of the govt besides the Smithsonian categorically exempt from FOIA requests, responsible for resettling Haitians and Cubans?</p></blockquote><p>This is why it is vital to reject Churchianity and every other perversion of Christian and European cultures, as they are conceived and implemented for the purpose of destroying both Christianity and European families.</p><p>It wouldn’t surprise me if the Community Relations Servicece combined a carrot of financial incentives to go with the stick of coercion. This service has certainly been effective in preventing whites from fighting back and defending their families and towns with the sort of collective action that Hispanics have successfully used to drive blacks out of cities like Compton. And its exemption from the Freedom of Information Act demonstrates how important its role was deemed to be from the start by those who are seeking to destroy America.</p><p>Government transparency is one area where nationalists can profitably win the rhetorical battle. This clearly demonstrates why no excuse, including “national security” can ever be accepted as a reason to hide government information and records from the public.</p><p><em><a href=\"https://socialgalactic.com/micropost/b0615aae-c497-4e1a-a4d5-3457a4d2e132\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "For the last 60 years, the federal government\nhas been funding an agency\nto “encourage” the families of white victims to refrain from expressing their anger and seeking vengeance for the death of their loved ones at the hands of black murderers. It’s called “Community Relations Service” and it is why every murder of a white person committed by minorities is reliably followed by an insipid statement by a family member about how they a) decry racism and b) preemptively forgive the unrepentant murderer:\nI’m looking into the Community Relations Service and going insane. You’re telling me we had a fucking X-Files of black people crimes that was the only part of the govt besides the Smithsonian categorically exempt from FOIA requests, responsible for resettling Haitians and Cubans?\nThis is why it is vital to reject Churchianity and every other perversion of Christian and European cultures, as they are conceived and implemented for the purpose of destroying both Christianity and European families.\nIt wouldn’t surprise me if the Community Relations Servicece combined a carrot of financial incentives to go with the stick of coercion. This service has certainly been effective in preventing whites from fighting back and defending their families and towns with the sort of collective action that Hispanics have successfully used to drive blacks out of cities like Compton. And its exemption from the Freedom of Information Act demonstrates how important its role was deemed to be from the start by those who are seeking to destroy America.\nGovernment transparency is one area where nationalists can profitably win the rhetorical battle. This clearly demonstrates why no excuse, including “national security” can ever be accepted as a reason to hide government information and records from the public.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-10-05T13:51:48+00:00"
}