{
  "url": "https://voxday.net/2025/10/25/atheism-is-autistic-midwittery/",
  "scraped_at": "2026-01-08T20:34:53.268711",
  "title": "Atheism is Autistic Midwittery",
  "date_display": "October 25, 2025",
  "date_iso": "2025-10-25T11:46:42+00:00",
  "date_from_url": "2025-10-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always amusing to see atheists make their rhetorical <em>argumentum ad mentum</em> by appealing to the fact that atheists have higher average intelligence than religious believers. This is where the coinage of the term “midwit” has been useful, because it allows people to easily through the irrelevance of this appeal to a nonexistent, and frankly ludicrious, asserted authority, such as this particular denizen of /pol/.</p><p><em>People with low IQ have PROFOUNDLY STRONG common sense because their brain can’t process complex and fancy ways of thinking. People with high IQs are smart enough to understand complex ideas but see thru the athiest psyop and recognize it as the most midwit position possible. Atheism is literally an entire mindset revolving around DESPERATELY needing people to think you are smart because you ARE smarter than the average but nothing too much above it, creating the world inferiority complex and need to pretend to be smart. Whereas the genius, loves looking stupid and thinks it’s funny when a midwit thinks they’re smarter than them for holding the mindset given to them by MSNBC.</em></p><p>He’s responding to the atheists who are confused by the report that most of the most intelligent people in the world not only believe in God, but are self-professed Christians. Which, of course, is because it is impossible for the average midwit to balance the following facts, all of which are true.</p><ul class=\"wp-block-list\"><li>Atheists have a higher average intelligence than religious believers.</li><li>Africans have a lower average intelligence than Europeans or Asians.</li><li>The 10 countries with the highest percentage of self-identified Christians are in Africa.</li><li>The man with the highest reported IQ declares himself to be a Christian.</li><li>PZ Myers was the only New Atheist with an IQ high enough to even get into Mensa.</li><li>There are 11.4x more 2D+ IQ Christians than atheists.</li></ul><p>Interestingly enough, science officially supports my hypothesis that atheism is merely one aspect of autism, as both published studies of which I am aware have failed to falsify the link between a personal profession of atheism and scoring significantly higher on various measures of “Asperger’s” and autism.</p><p>Combined with what we know about atheists having slightly higher average intelligence but being underrepresented among the high-IQ population, we can logically conclude that atheism is little more than a common characteristic of autistic midwits.</p><p>Speaking of atheists, I didn’t realize that the relative silence of PZ Myers was <a href=\"https://atheist.ie/2015/04/atheist-ireland-dissociates-from-pz-myers/\">the result of him being banished</a> by the atheist organizations around the world about ten years ago due to his extremist, violent rhetoric. I never paid much attention to him, and just assumed that he was dead or something.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Atheist Ireland promotes atheism, reason and ethical secularism. Our policies are based on a respect for human rights, upon which we can build a just society based on natural ethical values. We meet with and lobby the Irish government, Irish parliamentary meetings, the media, and international human rights regulatory bodies such as the UN Human Rights Committee, the Council of Europe, and the OSCE. We are proud to work nationally with other human rights and social justice groups, and globally with colleagues in Atheist Alliance International, and the International Campaign Against Blasphemy Laws.</p><p>Our shared work in all of these areas, at national and international level, is important for the development of an ethical secular world. This work is undermined by rhetoric that associates atheist and secular advocacy with hateful, violent and defamatory speech. Such rhetoric is also unjust to the individual people who it targets.</p><p>Atheist Ireland has previously given PZ Myers public platforms in Ireland, both at the World Atheist Convention in 2011, and at our international conference in 2013 on Empowering Women Through Secularism. We now apologise for doing this. We believe his behaviour is unjust to individuals, increases prejudice against atheists, and is harmful to the promotion of an ethical society based on empathy, fairness, justice and integrity.</p></blockquote><p>I have to admit, I find this excommunication from atheism to be both ironic and extremely amusing in light of PZ’s historical attempts, however improbable they might have been, to place himself in a superior moral and ethical position to religious believers. And remember, of all the New Atheists, <em>he was the smart one!</em></p><p>We really need to consider doing a leatherbound edition of <em>THE IRRATIONAL ATHEIST</em> with a retrospective chapter chronicling the decline and fall of the New Atheists.</p><p><em><a href=\"https://socialgalactic.com/micropost/31165be7-9703-45a7-b3c0-3aab2b94e449\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s always amusing to see atheists make their rhetorical\nargumentum ad mentum\nby appealing to the fact that atheists have higher average intelligence than religious believers. This is where the coinage of the term “midwit” has been useful, because it allows people to easily through the irrelevance of this appeal to a nonexistent, and frankly ludicrious, asserted authority, such as this particular denizen of /pol/.\nPeople with low IQ have PROFOUNDLY STRONG common sense because their brain can’t process complex and fancy ways of thinking. People with high IQs are smart enough to understand complex ideas but see thru the athiest psyop and recognize it as the most midwit position possible. Atheism is literally an entire mindset revolving around DESPERATELY needing people to think you are smart because you ARE smarter than the average but nothing too much above it, creating the world inferiority complex and need to pretend to be smart. Whereas the genius, loves looking stupid and thinks it’s funny when a midwit thinks they’re smarter than them for holding the mindset given to them by MSNBC.\nHe’s responding to the atheists who are confused by the report that most of the most intelligent people in the world not only believe in God, but are self-professed Christians. Which, of course, is because it is impossible for the average midwit to balance the following facts, all of which are true.\nAtheists have a higher average intelligence than religious believers.\nAfricans have a lower average intelligence than Europeans or Asians.\nThe 10 countries with the highest percentage of self-identified Christians are in Africa.\nThe man with the highest reported IQ declares himself to be a Christian.\nPZ Myers was the only New Atheist with an IQ high enough to even get into Mensa.\nThere are 11.4x more 2D+ IQ Christians than atheists.\nInterestingly enough, science officially supports my hypothesis that atheism is merely one aspect of autism, as both published studies of which I am aware have failed to falsify the link between a personal profession of atheism and scoring significantly higher on various measures of “Asperger’s” and autism.\nCombined with what we know about atheists having slightly higher average intelligence but being underrepresented among the high-IQ population, we can logically conclude that atheism is little more than a common characteristic of autistic midwits.\nSpeaking of atheists, I didn’t realize that the relative silence of PZ Myers was\nthe result of him being banished\nby the atheist organizations around the world about ten years ago due to his extremist, violent rhetoric. I never paid much attention to him, and just assumed that he was dead or something.\nAtheist Ireland promotes atheism, reason and ethical secularism. Our policies are based on a respect for human rights, upon which we can build a just society based on natural ethical values. We meet with and lobby the Irish government, Irish parliamentary meetings, the media, and international human rights regulatory bodies such as the UN Human Rights Committee, the Council of Europe, and the OSCE. We are proud to work nationally with other human rights and social justice groups, and globally with colleagues in Atheist Alliance International, and the International Campaign Against Blasphemy Laws.\nOur shared work in all of these areas, at national and international level, is important for the development of an ethical secular world. This work is undermined by rhetoric that associates atheist and secular advocacy with hateful, violent and defamatory speech. Such rhetoric is also unjust to the individual people who it targets.\nAtheist Ireland has previously given PZ Myers public platforms in Ireland, both at the World Atheist Convention in 2011, and at our international conference in 2013 on Empowering Women Through Secularism. We now apologise for doing this. We believe his behaviour is unjust to individuals, increases prejudice against atheists, and is harmful to the promotion of an ethical society based on empathy, fairness, justice and integrity.\nI have to admit, I find this excommunication from atheism to be both ironic and extremely amusing in light of PZ’s historical attempts, however improbable they might have been, to place himself in a superior moral and ethical position to religious believers. And remember, of all the New Atheists,\nhe was the smart one!\nWe really need to consider doing a leatherbound edition of\nTHE IRRATIONAL ATHEIST\nwith a retrospective chapter chronicling the decline and fall of the New Atheists.\nDISCUSS ON SG",
  "tags": [
    "atheism",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-10-25T11:46:50+00:00"
}