{
  "url": "https://voxday.net/2025/10/31/book-porn/",
  "scraped_at": "2026-01-08T20:35:24.188579",
  "title": "Book Porn",
  "date_display": "October 31, 2025",
  "date_iso": "2025-10-31T14:59:31+00:00",
  "date_from_url": "2025-10-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While lust is certainly one of the cardinal vices, perhaps a little of the more aesthetic and intellectual variety can be indulged to a reasonable extent. It was brought to my attention that Castalia Library was lacking an online showcase, so we’ve added <a href=\"https://stack.castalialibrary.com/p/gallery-castalia-library\">a Gallery page</a> that presently features pictures of all of the Castalia Library editions that have already been produced as well as some of the non-subscription books such as <em>THE BLACK SWAN</em> and <em>FOOLED BY RANDOMNESS</em>, as shown below.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><a href=\"https://ndmexpress.com/products/incerto-collection\"><img alt=\"\" class=\"wp-image-69095\" decoding=\"async\" fetchpriority=\"high\" height=\"657\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2025/10/image-8.png\" srcset=\"https://voxday.net/wp-content/uploads/2025/10/image-8.png 512w, https://voxday.net/wp-content/uploads/2025/10/image-8-234x300.png 234w\" width=\"512\"/></a></figure></div><p>The Gallery will be expanded with History, Junior Classics, and eventually, Cathedra editions as they are produced. But even with the backlog, it’s a little startling to see <a href=\"https://stack.castalialibrary.com/p/gallery-castalia-library\">how many books have already been produced</a> by the Library since we began building it together six years ago.</p><p>In other Castalia news, I have completed <em>DEATH AND THE DEVIL</em> and will be sending out the ebook to all of the buyers of the Signed First Edition this weekend. It should be available on Kindle next week.</p><p><em><a href=\"https://socialgalactic.com/micropost/ded85074-f6ec-40c2-b132-86cce8fd6311\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "While lust is certainly one of the cardinal vices, perhaps a little of the more aesthetic and intellectual variety can be indulged to a reasonable extent. It was brought to my attention that Castalia Library was lacking an online showcase, so we’ve added\na Gallery page\nthat presently features pictures of all of the Castalia Library editions that have already been produced as well as some of the non-subscription books such as\nTHE BLACK SWAN\nand\nFOOLED BY RANDOMNESS\n, as shown below.\nThe Gallery will be expanded with History, Junior Classics, and eventually, Cathedra editions as they are produced. But even with the backlog, it’s a little startling to see\nhow many books have already been produced\nby the Library since we began building it together six years ago.\nIn other Castalia news, I have completed\nDEATH AND THE DEVIL\nand will be sending out the ebook to all of the buyers of the Signed First Edition this weekend. It should be available on Kindle next week.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia Library"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-10-31T15:04:37+00:00"
}