{
  "url": "https://voxday.net/2025/10/22/destruction-or-diversity/",
  "scraped_at": "2026-01-08T20:34:37.044512",
  "title": "Destruction or Diversity",
  "date_display": "October 22, 2025",
  "date_iso": "2025-10-22T12:20:15+00:00",
  "date_from_url": "2025-10-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s really rather remarkable to observe how many people, even today, when faced between a clear, stark, and unavoidable choice between the collapse of society and diversity, <a href=\"https://substack.com/home/post/p-175405409\">will genuinely prefer complete societal ruin</a> to accepting the reality of their moral and material obligations to prioritize the survival of their families, their religion, their nation, their language, and their culture.</p><p>However, the younger generations increasingly reject the Boomer ideals of integration and so-called “civil rights” because, unlike the Boomers and Generation X, they have grown up in an increasingly dystopian reality that has proven to be considerably different than the rainbow utopia previously conceived by the elderly demographic idealists who preceded them.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>They are literally a rot that is killing every one of our cities. And most of the population lives in cities. Cities are the beating heart of a nation. It’s where the economy runs, where people are educated, where careers are built, where the entertainment is. If the people live in the cities, if a country is its cities, and if they are killing the cities, they are literally killing America. It is a death spiral.</p><p>It’s depressing. Paris, one of the world’s most beautiful cities, ruined—by <em>this</em>. Same with New York, same with LA. Look at what they’ve done to them. All because we’re afraid of being called racist. Well, I’m part of the new generation, and I can assure you I don’t give a single fuck about being called racist. I want our countries back. If that makes me racist, so be it. And increasingly, that’s how people feel about this.</p><p>We tried integrating. It didn’t work. This is the result. Who wants any part of it? Not even them. What’s the first thing they do when they make a lot of money? They get the fuck out of the ghetto. Why all the fuss about education? So they can send their kids to White schools. They want to live near us because they want our tax money. They want reparations because they want our money. It’s a toxic relationship. We want out.</p><p>Honest to God, what’s the benefit? What is the positive? All I see is a heavy net dragging in the water behind us, full of risks, resentment, and a constant storm of chaos and danger we can’t escape. They’re inflicting it on us, and we’re expected to tolerate it, and we’re being penalised for having an issue with it. We’ve argued, pleaded, bent over backwards, sacrificed our own to keep it together. For what? The weight on our backs is too great, and we’ve carried it long enough. The water’s up to our necks, the storm’s already here, and no one’s coming to save us. Either we find the courage to fix what’s broken, or we cut the net loose. Otherwise, we drown with it.</p><p>Because history doesn’t reward the timid. And if we don’t carve out our own future, far from the storm, we’ll be nothing but bones beneath their boots, mourned by no one, forgotten by all.</p></blockquote><p>My suspicion is that most people who prefer societal collapse to segregation do so because the former is both a) in the future and b) comprehensive while the latter is a) in the present and b) personal. It’s not so much that they prefer the former to the latter as that they don’t believe the former is inevitable because they are incapable of seeing anything beyond their current personal perspective. Although this isn’t always true, as we’ve seen far too many mealy-mouthed Churchians dutifully mouthing the diversity dogma over the dead bodies of their children.</p><p>And this Churchian response underlines both the subversion of organized churches and the way in which Churchianity is actively contributing to the decline and fall of the Western civilization formerly known as Christendom.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I am reporting this post because it spreads hate and promotes racial stereotypes that are false, harmful, and dangerous. The content dehumanizes an entire group of people based on race and encourages fear, division, and segregation. It goes beyond expressing an opinion about crime or public safety; it scapegoats an entire community and normalizes prejudice as a survival strategy. As a Christian and someone who values personal responsibility, truth, and the dignity of every individual, I cannot allow content that encourages hatred to remain unchallenged. The post conflicts with the principles of justice, love, and moral courage that are central to both faith and a strong, free society. Reporting it is an act of standing for truth, community safety, and the protection of innocent lives from the toxic influence of racism.</p></blockquote><p>Somehow, I don’t think the wagging fingers of outraged Boomers and self-righteous Churchians are going to impress the furious younger generations at all. Seldom has a society more deserved its inevitable fate than the post-WWII USA. The same is true of all the converged Churchian organizations, from the Roman Catholic Church to the Southern Baptist Conference. Neither the society nor the faiths, such as they are, will survive the 21st century. Some may not even make it to the halfway mark.</p><p><em>Germany’s chancellor Friedrich Merz has suggested ‘anyone with daughters’ would support his call for mass deportations of migrants from German cities. The conservative leader implied Germany faces a growing problem of sexual attacks linked to migration – remarks critics branded ‘dangerous’ and ‘deeply irresponsible.’</em></p><p>Those remarks may or may not be “dangerous” or “deeply irresponsible” but the only question that matters is if they are true or not. This, of course, is the question that the anti-American Nationalist Christian side now assiduously avoids.</p><p>The great irony here is that <em>regardless of what the sum total of everyone’s professed preferences turn out to be</em>, the end result will be pretty much the same. Because what follows ruin will look very similar to a nationalist authoritarianism instituted through political or military means, only it will come about after a long period of violence, economic catastrophe, and war.</p><p><em>Carthago semper cadit</em>.</p><p><em><a href=\"https://socialgalactic.com/micropost/cfcbffc5-2e4a-42d4-a838-e7abad057f13\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s really rather remarkable to observe how many people, even today, when faced between a clear, stark, and unavoidable choice between the collapse of society and diversity,\nwill genuinely prefer complete societal ruin\nto accepting the reality of their moral and material obligations to prioritize the survival of their families, their religion, their nation, their language, and their culture.\nHowever, the younger generations increasingly reject the Boomer ideals of integration and so-called “civil rights” because, unlike the Boomers and Generation X, they have grown up in an increasingly dystopian reality that has proven to be considerably different than the rainbow utopia previously conceived by the elderly demographic idealists who preceded them.\nThey are literally a rot that is killing every one of our cities. And most of the population lives in cities. Cities are the beating heart of a nation. It’s where the economy runs, where people are educated, where careers are built, where the entertainment is. If the people live in the cities, if a country is its cities, and if they are killing the cities, they are literally killing America. It is a death spiral.\nIt’s depressing. Paris, one of the world’s most beautiful cities, ruined—by\nthis\n. Same with New York, same with LA. Look at what they’ve done to them. All because we’re afraid of being called racist. Well, I’m part of the new generation, and I can assure you I don’t give a single fuck about being called racist. I want our countries back. If that makes me racist, so be it. And increasingly, that’s how people feel about this.\nWe tried integrating. It didn’t work. This is the result. Who wants any part of it? Not even them. What’s the first thing they do when they make a lot of money? They get the fuck out of the ghetto. Why all the fuss about education? So they can send their kids to White schools. They want to live near us because they want our tax money. They want reparations because they want our money. It’s a toxic relationship. We want out.\nHonest to God, what’s the benefit? What is the positive? All I see is a heavy net dragging in the water behind us, full of risks, resentment, and a constant storm of chaos and danger we can’t escape. They’re inflicting it on us, and we’re expected to tolerate it, and we’re being penalised for having an issue with it. We’ve argued, pleaded, bent over backwards, sacrificed our own to keep it together. For what? The weight on our backs is too great, and we’ve carried it long enough. The water’s up to our necks, the storm’s already here, and no one’s coming to save us. Either we find the courage to fix what’s broken, or we cut the net loose. Otherwise, we drown with it.\nBecause history doesn’t reward the timid. And if we don’t carve out our own future, far from the storm, we’ll be nothing but bones beneath their boots, mourned by no one, forgotten by all.\nMy suspicion is that most people who prefer societal collapse to segregation do so because the former is both a) in the future and b) comprehensive while the latter is a) in the present and b) personal. It’s not so much that they prefer the former to the latter as that they don’t believe the former is inevitable because they are incapable of seeing anything beyond their current personal perspective. Although this isn’t always true, as we’ve seen far too many mealy-mouthed Churchians dutifully mouthing the diversity dogma over the dead bodies of their children.\nAnd this Churchian response underlines both the subversion of organized churches and the way in which Churchianity is actively contributing to the decline and fall of the Western civilization formerly known as Christendom.\nI am reporting this post because it spreads hate and promotes racial stereotypes that are false, harmful, and dangerous. The content dehumanizes an entire group of people based on race and encourages fear, division, and segregation. It goes beyond expressing an opinion about crime or public safety; it scapegoats an entire community and normalizes prejudice as a survival strategy. As a Christian and someone who values personal responsibility, truth, and the dignity of every individual, I cannot allow content that encourages hatred to remain unchallenged. The post conflicts with the principles of justice, love, and moral courage that are central to both faith and a strong, free society. Reporting it is an act of standing for truth, community safety, and the protection of innocent lives from the toxic influence of racism.\nSomehow, I don’t think the wagging fingers of outraged Boomers and self-righteous Churchians are going to impress the furious younger generations at all. Seldom has a society more deserved its inevitable fate than the post-WWII USA. The same is true of all the converged Churchian organizations, from the Roman Catholic Church to the Southern Baptist Conference. Neither the society nor the faiths, such as they are, will survive the 21st century. Some may not even make it to the halfway mark.\nGermany’s chancellor Friedrich Merz has suggested ‘anyone with daughters’ would support his call for mass deportations of migrants from German cities. The conservative leader implied Germany faces a growing problem of sexual attacks linked to migration – remarks critics branded ‘dangerous’ and ‘deeply irresponsible.’\nThose remarks may or may not be “dangerous” or “deeply irresponsible” but the only question that matters is if they are true or not. This, of course, is the question that the anti-American Nationalist Christian side now assiduously avoids.\nThe great irony here is that\nregardless of what the sum total of everyone’s professed preferences turn out to be\n, the end result will be pretty much the same. Because what follows ruin will look very similar to a nationalist authoritarianism instituted through political or military means, only it will come about after a long period of violence, economic catastrophe, and war.\nCarthago semper cadit\n.\nDISCUSS ON SG",
  "tags": [
    "Churchianity",
    "decline and fall",
    "nationalism",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-10-22T12:22:31+00:00"
}