{
  "url": "https://voxday.net/2025/10/14/floating-on-the-sea-of-retardery/",
  "scraped_at": "2026-01-08T20:33:57.075930",
  "title": "Floating on the Sea of Retardery",
  "date_display": "October 14, 2025",
  "date_iso": "2025-10-14T13:09:15+00:00",
  "date_from_url": "2025-10-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An SG reader inadvertently discovers the <em>raison d’etre</em> of Stoic philosophy:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I have another 23 or so years left in my career. In reality I do not know if I can make it in my current positions. Being an accounting exec I see everything and it’s sickening. The vast majority of people serve Mammon from the top level employees down to the lowest level. The vast majority lie, cheat and steal with no remorse. They think nothing of doing things that hurt their coworkers to get an extra buck. When they aren’t doing that, they purposely allow people to make damaging mistakes so they can grandstand about it for 5 minutes and feel like they are scoring points.</p><p>I honestly don’t know how much longer I can take it. No one argues with me when I point these things out, but no one cares either, they do nothing and hope I shut up eventually, because they largely do the same things.</p></blockquote><p>This is the sea of retardery that is the human condition. Balzac wrote an entire ouvre dedicated to precisely this endless series of bad decisions, shenanigans, and tomfoolery. There is little point in the reader trying to seek work elsewhere, because what is troubling him is not unique to his industry, but is absolutely normal human behavior.</p><p>This is why philosophers from the Roman Stoics to the Chinese sages have stressed the importance of not being affected by the behavior of others and refusing to let their antics disturb your equanimity.</p><p>I was just speaking with Spacebunny this morning about the distress of men and women working in the Swiss banking industry, who have belatedly realized that submitting to US pressure to give up everything that made banking in Switzerland desirable has unsurprisingly had very negative effects on their employment prospects. In just 15 years, the number of Swiss banks has fallen from 400 to 250, one of its two banking giants collapsed, and the only reason the other one still survives is because it was bailed out by the Swiss government.</p><p>All of this was predictable and predicted. Before the financial crisis of 2008, I told a VP at a Swiss bank that all of those things would absolutely and inevitably happen if they were dumb enough to submit to US pressure to change the practices that made them rich and the envy of the world. But I was not even a little bit surprised when the bankers did so, <em>and did so</em> <em>in order to preserve their access to a market where they did nothing but lose tens of billions of dollars</em>, because I would estimate that 95 percent of men and 99 percent of women are simply too retarded to be capable of understanding the inevitable consequences of their own decisions and behavior.</p><p>David Foster Wallace understood this. It’s probably one of the reasons he killed himself in his despair.</p><p><em>The so-called real world of men and money and power hums merrily along in a pool of fear and anger and frustration and craving and worship of self.</em></p><p>So, too, did the Chinese of yore.</p><p>卸磨刀石殺驢</p><p><em>Unload the grindstone to kill the donkey.</em></p><p>This is the way most people and most organizations operate on a daily basis. They readily sacrifice their goals, their objectives, and their material long-term interests for what they perceive to be in their immediate interest, because they don’t realize that the latter necessitates the former.</p><p>And there is absolutely nothing that one can do about this behavioral tendency except accept it, as Confucius observed.</p><p>隨風搖曳的綠色蘆葦，比暴風雨中折斷的參天橡樹還要堅強</p><p><em>The green reed which bends in the wind is stronger than the mighty oak which breaks in a storm.</em></p><p>And if you will excuse me <a href=\"https://unauthorized.tv/video/4759cf/\">quoting myself</a>:</p><p><em>The gift of sight becomes a curse when one can’t intervene.</em></p><p><em><a href=\"https://socialgalactic.com/micropost/39a81d9b-7400-484b-8e80-51d7af54160c\">DISCUSS ON SG</a></em></p><p></p></div>",
  "content_text": "An SG reader inadvertently discovers the\nraison d’etre\nof Stoic philosophy:\nI have another 23 or so years left in my career. In reality I do not know if I can make it in my current positions. Being an accounting exec I see everything and it’s sickening. The vast majority of people serve Mammon from the top level employees down to the lowest level. The vast majority lie, cheat and steal with no remorse. They think nothing of doing things that hurt their coworkers to get an extra buck. When they aren’t doing that, they purposely allow people to make damaging mistakes so they can grandstand about it for 5 minutes and feel like they are scoring points.\nI honestly don’t know how much longer I can take it. No one argues with me when I point these things out, but no one cares either, they do nothing and hope I shut up eventually, because they largely do the same things.\nThis is the sea of retardery that is the human condition. Balzac wrote an entire ouvre dedicated to precisely this endless series of bad decisions, shenanigans, and tomfoolery. There is little point in the reader trying to seek work elsewhere, because what is troubling him is not unique to his industry, but is absolutely normal human behavior.\nThis is why philosophers from the Roman Stoics to the Chinese sages have stressed the importance of not being affected by the behavior of others and refusing to let their antics disturb your equanimity.\nI was just speaking with Spacebunny this morning about the distress of men and women working in the Swiss banking industry, who have belatedly realized that submitting to US pressure to give up everything that made banking in Switzerland desirable has unsurprisingly had very negative effects on their employment prospects. In just 15 years, the number of Swiss banks has fallen from 400 to 250, one of its two banking giants collapsed, and the only reason the other one still survives is because it was bailed out by the Swiss government.\nAll of this was predictable and predicted. Before the financial crisis of 2008, I told a VP at a Swiss bank that all of those things would absolutely and inevitably happen if they were dumb enough to submit to US pressure to change the practices that made them rich and the envy of the world. But I was not even a little bit surprised when the bankers did so,\nand did so\nin order to preserve their access to a market where they did nothing but lose tens of billions of dollars\n, because I would estimate that 95 percent of men and 99 percent of women are simply too retarded to be capable of understanding the inevitable consequences of their own decisions and behavior.\nDavid Foster Wallace understood this. It’s probably one of the reasons he killed himself in his despair.\nThe so-called real world of men and money and power hums merrily along in a pool of fear and anger and frustration and craving and worship of self.\nSo, too, did the Chinese of yore.\n卸磨刀石殺驢\nUnload the grindstone to kill the donkey.\nThis is the way most people and most organizations operate on a daily basis. They readily sacrifice their goals, their objectives, and their material long-term interests for what they perceive to be in their immediate interest, because they don’t realize that the latter necessitates the former.\nAnd there is absolutely nothing that one can do about this behavioral tendency except accept it, as Confucius observed.\n隨風搖曳的綠色蘆葦，比暴風雨中折斷的參天橡樹還要堅強\nThe green reed which bends in the wind is stronger than the mighty oak which breaks in a storm.\nAnd if you will excuse me\nquoting myself\n:\nThe gift of sight becomes a curse when one can’t intervene.\nDISCUSS ON SG",
  "tags": [
    "corpocracy",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-10-14T13:11:54+00:00"
}