{
  "url": "https://voxday.net/2025/10/28/grokipedia-is-already-better/",
  "scraped_at": "2026-01-08T20:35:09.501436",
  "title": "Grokipedia is Already Better",
  "date_display": "October 28, 2025",
  "date_iso": "2025-10-28T19:15:17+00:00",
  "date_from_url": "2025-10-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Elon Musk is correct. Even version 0.1 of Grokipedia is better than Wikipedia. It also points to the way forward for Infogalactic. Who needs editors when you’ve got AI? Here is an excerpt from <a href=\"https://grokipedia.com/page/Sad_Puppies\">its entry on Sad Puppies and Rabid Puppies</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Theodore Beale, writing under the pseudonym Vox Day and founder of Castalia House publishing, launched the Rabid Puppies campaign on February 2, 2015, as an independent but parallel effort to the Sad Puppies initiative. Beale positioned it as a response to what he viewed as an entrenched ideological clique—derisively termed “CHORFs” (cliquish Hugo-oriented right-thinking fans) and “SJWs” (social justice warriors)—that allegedly controlled Hugo nominations through low-turnout bloc voting favoring message-driven works over entertainment value. Unlike the Sad Puppies’ focus on recommending overlooked popular fiction, Beale explicitly instructed supporters to nominate his slate items “precisely as they are” to maximize disruption and demonstrate the system’s susceptibility to organized external participation, including promotion of Castalia House titles like the anthology <em>Riding the Red Horse</em>.</p><p>The 2015 Rabid Puppies slate overlapped significantly with the Sad Puppies recommendations, featuring works such as Jim Butcher’s <em>Skin Game</em> for Best Novel and Edward M. Lerner’s <em>Slow Bullets</em> for Best Novella, but also included Beale’s self-nominated editing credits. This coordination, combined with Rabid supporters’ higher discipline in nominating all slate items, resulted in Puppy-affiliated works occupying most finalist slots across categories, including five of five in Best Novella and Best Short Story—displacing approximately 80% of what would have been conventional nominees based on prior years’ patterns. Hugo nomination tallies, with around 2,000 nominators compared to historical averages under 1,500, underscored the campaigns’ amplification of voter turnout among previously unengaged readers.</p><p>In the July 2015 final voting phase, involving about 4,000 ballots, Rabid Puppies nominees frequently ranked below “No Award” in a backlash from established fandom, with Beale’s professional editor nominations receiving the lowest support (e.g., 165 first-place votes out of thousands). Beale framed this as a strategic success, arguing that the widespread “No Award” usage—unprecedented in scale, affecting five categories—exposed the awards’ politicization, as opponents prioritized ideological purity over merit, effectively “burning down” the Hugos rather than allowing non-conforming works to win. He continued the campaign in 2016 and 2017, adapting to rule changes like E Pluribus Hugo by nominating provocative entries such as Chuck Tingle’s satirical <em>Space Raptor Butt Invasion</em>, which secured a finalist spot and amplified mockery of the process, though with reduced dominance (e.g., only partial slate success in 2016). Beale’s efforts, drawing from a dedicated online following, highlighted empirical vulnerabilities in the pre-reform Hugo system, where small, cohesive groups could sway outcomes amid chronically low participation rates below 5% of World Science Fiction Society membership.</p><p>In 2016, author Kate Paulk organized Sad Puppies 4, announcing the campaign on September 3, 2015, with a focus on compiling crowd-sourced recommendation lists rather than a strict slate to promote broader participation and avoid accusations of ballot manipulation. The final list, released on March 17, 2016, included only works receiving at least two recommendations across categories, emphasizing entertainment value and fun over ideological messaging. Despite this shift, the campaign exerted limited influence on nominations, as the ballot was overwhelmingly dominated by the parallel Rabid Puppies slate led by Vox Day, which secured 64 of its 81 recommended works on the shortlist across all categories.</p></blockquote><p>It’s a much more detailed, and accurate, account of what really happened. Of course, they never seem to bother mentioning what motivated me to burn down the Hugo Awards, which was the false accusations that I’d somehow “gamed” my 2014 nomination in the Best Novelette category for “Opera Vita Aeterna”. I therefore showed them what gaming a nomination actually looks like when you’re a game designer.</p><p>The real success of Sad Puppies, of course, was the inevitable reaction to it. Seriously, SF-SJWs are just reprehensibly stupid. The rules prevented us from permanently burning the whole thing down, so I had to come up with a way to provoke them into doing it themselves.</p><p><em><a href=\"https://socialgalactic.com/micropost/7bf0ce66-f701-4841-96f9-4138dae04684\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Elon Musk is correct. Even version 0.1 of Grokipedia is better than Wikipedia. It also points to the way forward for Infogalactic. Who needs editors when you’ve got AI? Here is an excerpt from\nits entry on Sad Puppies and Rabid Puppies\n:\nTheodore Beale, writing under the pseudonym Vox Day and founder of Castalia House publishing, launched the Rabid Puppies campaign on February 2, 2015, as an independent but parallel effort to the Sad Puppies initiative. Beale positioned it as a response to what he viewed as an entrenched ideological clique—derisively termed “CHORFs” (cliquish Hugo-oriented right-thinking fans) and “SJWs” (social justice warriors)—that allegedly controlled Hugo nominations through low-turnout bloc voting favoring message-driven works over entertainment value. Unlike the Sad Puppies’ focus on recommending overlooked popular fiction, Beale explicitly instructed supporters to nominate his slate items “precisely as they are” to maximize disruption and demonstrate the system’s susceptibility to organized external participation, including promotion of Castalia House titles like the anthology\nRiding the Red Horse\n.\nThe 2015 Rabid Puppies slate overlapped significantly with the Sad Puppies recommendations, featuring works such as Jim Butcher’s\nSkin Game\nfor Best Novel and Edward M. Lerner’s\nSlow Bullets\nfor Best Novella, but also included Beale’s self-nominated editing credits. This coordination, combined with Rabid supporters’ higher discipline in nominating all slate items, resulted in Puppy-affiliated works occupying most finalist slots across categories, including five of five in Best Novella and Best Short Story—displacing approximately 80% of what would have been conventional nominees based on prior years’ patterns. Hugo nomination tallies, with around 2,000 nominators compared to historical averages under 1,500, underscored the campaigns’ amplification of voter turnout among previously unengaged readers.\nIn the July 2015 final voting phase, involving about 4,000 ballots, Rabid Puppies nominees frequently ranked below “No Award” in a backlash from established fandom, with Beale’s professional editor nominations receiving the lowest support (e.g., 165 first-place votes out of thousands). Beale framed this as a strategic success, arguing that the widespread “No Award” usage—unprecedented in scale, affecting five categories—exposed the awards’ politicization, as opponents prioritized ideological purity over merit, effectively “burning down” the Hugos rather than allowing non-conforming works to win. He continued the campaign in 2016 and 2017, adapting to rule changes like E Pluribus Hugo by nominating provocative entries such as Chuck Tingle’s satirical\nSpace Raptor Butt Invasion\n, which secured a finalist spot and amplified mockery of the process, though with reduced dominance (e.g., only partial slate success in 2016). Beale’s efforts, drawing from a dedicated online following, highlighted empirical vulnerabilities in the pre-reform Hugo system, where small, cohesive groups could sway outcomes amid chronically low participation rates below 5% of World Science Fiction Society membership.\nIn 2016, author Kate Paulk organized Sad Puppies 4, announcing the campaign on September 3, 2015, with a focus on compiling crowd-sourced recommendation lists rather than a strict slate to promote broader participation and avoid accusations of ballot manipulation. The final list, released on March 17, 2016, included only works receiving at least two recommendations across categories, emphasizing entertainment value and fun over ideological messaging. Despite this shift, the campaign exerted limited influence on nominations, as the ballot was overwhelmingly dominated by the parallel Rabid Puppies slate led by Vox Day, which secured 64 of its 81 recommended works on the shortlist across all categories.\nIt’s a much more detailed, and accurate, account of what really happened. Of course, they never seem to bother mentioning what motivated me to burn down the Hugo Awards, which was the false accusations that I’d somehow “gamed” my 2014 nomination in the Best Novelette category for “Opera Vita Aeterna”. I therefore showed them what gaming a nomination actually looks like when you’re a game designer.\nThe real success of Sad Puppies, of course, was the inevitable reaction to it. Seriously, SF-SJWs are just reprehensibly stupid. The rules prevented us from permanently burning the whole thing down, so I had to come up with a way to provoke them into doing it themselves.\nDISCUSS ON SG",
  "tags": [
    "Hugo Awards",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-10-28T19:18:07+00:00"
}