{
  "url": "https://voxday.net/2025/10/23/immigration-and-military-power/",
  "scraped_at": "2026-01-08T20:34:42.520325",
  "title": "Immigration and Military Power",
  "date_display": "October 23, 2025",
  "date_iso": "2025-10-23T10:21:52+00:00",
  "date_from_url": "2025-10-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As we know, Martin van Creveld has demonstrated that immigration is simply another form of war, and an invasion is an invasion regardless of whether it is a peaceful, unarmed, and disorganized one that is welcomed by a governing elite or an armed and organized one that is resisted by the governing elite.</p><p>But one of the lessons demonstrated by Sir Charles Oman in his <em>The Art of War in the Middle Ages</em> is the way in which immigration and the reliance upon foreign troops is intrinsically deleterious to the nation’s military organization and will inevitably weaken even the most dominant military power. And this weakness is distinct from the separate problem of foreign military commanders whose loyalties tend to be outweighed by either their ethnic interests or their self-interests.</p><p>As he demonstrates <a href=\"https://castalialibrary.substack.com/p/the-art-of-war-in-the-middle-ages-d8f\">in the first chapter of his excellent essay</a>, now being serialized at Castalia Library, the Roman Empire suffered both of these negative effects.</p><p><em>The morale of the Roman army was no longer what it had once been: the corps were no longer homogeneous, and the insufficient supply of recruits was eked out by enlisting slaves and barbarians in the legions themselves, and not only among the auxiliary cohorts. Though seldom wanting in courage, the troops of the fourth century had lost the self-reliance and cohesion of the old Roman infantry, and required far more careful handling on the part of the general. Few facts show this more forcibly than the proposal of the tactician Urbicius to furnish the legionaries with a large supply of portable beams and stakes, to be carried by pack-mules attached to each cohort. These were to be planted on the flanks and in the front of the legion, when there was a probability of its being attacked by hostile cavalry: behind them the Romans were to await the enemy’s onset, without any attempt to assume the offensive.</em></p><p><em>This proposition marks a great decay in the efficiency of the imperial foot-soldier: the troops of a previous generation would have scorned such a device, accustomed as they were to drive back with ease the assaults of the Parthian and Sarmatian cataphracti.</em></p><p>It should not be a surprise that the US military is in observable decline, having lost its global superpower status and has been surpassed in several areas by the Russian and Chinese militaries, given the fact that the percentage of foreign-born U.S. veterans rose from 2 percent in 1990 to 4.5 percent in 2022. And, of course, this doesn’t even count the much larger number of foreigners who were second- or third-generation immigrants whose interests do not necessarily align with those of the native population.</p><p>History is an absolute necessity if one wishes to understand the probable consequences of current events. Even if you have relatively little interest in leatherbound books, or in the aesthetic aspects of the most beautiful books in the world, it will behoove you to consider <a href=\"https://castalialibrary.substack.com/\">signing up for a free subscription</a> to the Castalia Library substack for the benefit of the daily serial alone. On a related note, I’m pleased to be able to announce that yesterday, Castalia Library reached 3,000 daily subscribers.</p><p>In other Castalia-related news, we have completed the interior layout for <em>THE JUNIOR CLASSICS Volume Nine, Sport &amp; Adventure.</em> We anticipate shipping both volumes Nine and Ten to the backers in November, although demi-royal backers will probably need to wait until December to receive theirs. And for those who were not original backers, we anticipate making the regular editions available as part of the annual Thanksgiving sale.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-69024\" decoding=\"async\" fetchpriority=\"high\" height=\"772\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2025/10/image-4.png\" srcset=\"https://voxday.net/wp-content/uploads/2025/10/image-4.png 512w, https://voxday.net/wp-content/uploads/2025/10/image-4-199x300.png 199w\" width=\"512\"/></figure></div><p>And yes, we will be announcing a 2nd Edition of <em>The Castalia Junior Classics</em> in leather and making them available once the complete set of the Original Backer’s Leather Editions is in production at the US bindery. The difference will be that the 2nd Edition will be bound in pigskin at the Castalia Bindery.</p><p><em><a href=\"https://socialgalactic.com/micropost/5f9f61d3-9ef5-474a-b47e-b91638b4b1ec\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "As we know, Martin van Creveld has demonstrated that immigration is simply another form of war, and an invasion is an invasion regardless of whether it is a peaceful, unarmed, and disorganized one that is welcomed by a governing elite or an armed and organized one that is resisted by the governing elite.\nBut one of the lessons demonstrated by Sir Charles Oman in his\nThe Art of War in the Middle Ages\nis the way in which immigration and the reliance upon foreign troops is intrinsically deleterious to the nation’s military organization and will inevitably weaken even the most dominant military power. And this weakness is distinct from the separate problem of foreign military commanders whose loyalties tend to be outweighed by either their ethnic interests or their self-interests.\nAs he demonstrates\nin the first chapter of his excellent essay\n, now being serialized at Castalia Library, the Roman Empire suffered both of these negative effects.\nThe morale of the Roman army was no longer what it had once been: the corps were no longer homogeneous, and the insufficient supply of recruits was eked out by enlisting slaves and barbarians in the legions themselves, and not only among the auxiliary cohorts. Though seldom wanting in courage, the troops of the fourth century had lost the self-reliance and cohesion of the old Roman infantry, and required far more careful handling on the part of the general. Few facts show this more forcibly than the proposal of the tactician Urbicius to furnish the legionaries with a large supply of portable beams and stakes, to be carried by pack-mules attached to each cohort. These were to be planted on the flanks and in the front of the legion, when there was a probability of its being attacked by hostile cavalry: behind them the Romans were to await the enemy’s onset, without any attempt to assume the offensive.\nThis proposition marks a great decay in the efficiency of the imperial foot-soldier: the troops of a previous generation would have scorned such a device, accustomed as they were to drive back with ease the assaults of the Parthian and Sarmatian cataphracti.\nIt should not be a surprise that the US military is in observable decline, having lost its global superpower status and has been surpassed in several areas by the Russian and Chinese militaries, given the fact that the percentage of foreign-born U.S. veterans rose from 2 percent in 1990 to 4.5 percent in 2022. And, of course, this doesn’t even count the much larger number of foreigners who were second- or third-generation immigrants whose interests do not necessarily align with those of the native population.\nHistory is an absolute necessity if one wishes to understand the probable consequences of current events. Even if you have relatively little interest in leatherbound books, or in the aesthetic aspects of the most beautiful books in the world, it will behoove you to consider\nsigning up for a free subscription\nto the Castalia Library substack for the benefit of the daily serial alone. On a related note, I’m pleased to be able to announce that yesterday, Castalia Library reached 3,000 daily subscribers.\nIn other Castalia-related news, we have completed the interior layout for\nTHE JUNIOR CLASSICS Volume Nine, Sport & Adventure.\nWe anticipate shipping both volumes Nine and Ten to the backers in November, although demi-royal backers will probably need to wait until December to receive theirs. And for those who were not original backers, we anticipate making the regular editions available as part of the annual Thanksgiving sale.\nAnd yes, we will be announcing a 2nd Edition of\nThe Castalia Junior Classics\nin leather and making them available once the complete set of the Original Backer’s Leather Editions is in production at the US bindery. The difference will be that the 2nd Edition will be bound in pigskin at the Castalia Bindery.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Castalia Library",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-10-23T10:21:56+00:00"
}