{
  "url": "https://voxday.net/2025/10/23/isolation-nietzsche-and-politics/",
  "scraped_at": "2026-01-08T20:34:44.395615",
  "title": "Isolation, Nietzsche, and Politics",
  "date_display": "October 23, 2025",
  "date_iso": "2025-10-23T17:30:50+00:00",
  "date_from_url": "2025-10-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Friedrich Nietzsche was a lunatic and his philosophy was little more than pompous Gamma self-inflatery. But one of his observations was not merely cogent, it explains Clown World’s tendency to enervate its allies and</p><p><em>That which does not kill me makes me stronger.</em></p><p>Japanese literature is full of the talented samurai who leaves his liege lord, either voluntarily or dismissed under a cloud of social disapproval, disappears into the mountains or the small villages of the western provinces, and spends several years teaching poetry or performing menial labor in order to survive as a masterless <em>ronin</em>. Eventually, he is summoned back into martial society by someone, where his talents, strengthened and hardened by his years of solitude, allow him to win success on the battlefield and in the courts.</p><p>In like manner, those of us who were banished by mainstream publishing houses have prospered considerably more in the era of ebooks and artificial intelligence than the hothouse flowers who are wholly dependent upon the publishing infrastructure to sell their books for them.</p><p>And the world of German politics <a href=\"https://www.eugyppius.com/p/the-firewall-is-making-afd-the-strongest\">is proving no different</a>, as the repeated attempts of all the mainstream parties to shun, slander, and even legally outlaw <em>Alternative für Deutschland</em> have only resulted in AfD becoming the obvious future of Germany.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The last ten years of German politics have been one unending nightmarish festival of failure and stupidity. All the establishment parties have taken turns implicating themselves in this amazing shitshow, while religiously sparing the AfD any association with their unprecedented failures. The firewall lends truth to the AfD’s name; it has allowed Alternative für Deutschland to become the only conceivable political alternative in Germany. As things get worse and voters grow more desperate for alternatives, the AfD just becomes stronger. The firewall is an AfD-maximising machine.</p><p>The firewall is only really bad for the people who invented it and who alone have the power to end it. I speak here of the centre-right Union parties, the CDU and the CSU. They maintain the firewall not because it helps them or because it is a good idea or even because the AfD are evil fascists, but because the firewall has been endified.</p><p>In 2018, when the CDU first set up the firewall, it had a coherent purpose. It was supposed to be a means of keeping the AfD small by dissuading CDU supporters from defecting to their upstart rival. CDU leadership had seen how the rising Green Party ate into the support of the SPD after reunification, and they thought they could prevent the same thing from happening to them. They would have been better off doing nothing at all, because after seven years of firewall the AfD are stronger than the Greens ever were. The whole thing has become a lesson in why you should avoid heavy-handed interventions in complex systems.</p></blockquote><p>Sure, it hurts and it’s scary to find yourself banished from the castle and forced to scrounge, scratch, and claw for survival. But the self-discipline that comes from the experience is absolutely invaluable in the long term.</p><p><em><a href=\"https://socialgalactic.com/micropost/367a170c-f1a6-4c30-b7cf-97f757748c36\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Friedrich Nietzsche was a lunatic and his philosophy was little more than pompous Gamma self-inflatery. But one of his observations was not merely cogent, it explains Clown World’s tendency to enervate its allies and\nThat which does not kill me makes me stronger.\nJapanese literature is full of the talented samurai who leaves his liege lord, either voluntarily or dismissed under a cloud of social disapproval, disappears into the mountains or the small villages of the western provinces, and spends several years teaching poetry or performing menial labor in order to survive as a masterless\nronin\n. Eventually, he is summoned back into martial society by someone, where his talents, strengthened and hardened by his years of solitude, allow him to win success on the battlefield and in the courts.\nIn like manner, those of us who were banished by mainstream publishing houses have prospered considerably more in the era of ebooks and artificial intelligence than the hothouse flowers who are wholly dependent upon the publishing infrastructure to sell their books for them.\nAnd the world of German politics\nis proving no different\n, as the repeated attempts of all the mainstream parties to shun, slander, and even legally outlaw\nAlternative für Deutschland\nhave only resulted in AfD becoming the obvious future of Germany.\nThe last ten years of German politics have been one unending nightmarish festival of failure and stupidity. All the establishment parties have taken turns implicating themselves in this amazing shitshow, while religiously sparing the AfD any association with their unprecedented failures. The firewall lends truth to the AfD’s name; it has allowed Alternative für Deutschland to become the only conceivable political alternative in Germany. As things get worse and voters grow more desperate for alternatives, the AfD just becomes stronger. The firewall is an AfD-maximising machine.\nThe firewall is only really bad for the people who invented it and who alone have the power to end it. I speak here of the centre-right Union parties, the CDU and the CSU. They maintain the firewall not because it helps them or because it is a good idea or even because the AfD are evil fascists, but because the firewall has been endified.\nIn 2018, when the CDU first set up the firewall, it had a coherent purpose. It was supposed to be a means of keeping the AfD small by dissuading CDU supporters from defecting to their upstart rival. CDU leadership had seen how the rising Green Party ate into the support of the SPD after reunification, and they thought they could prevent the same thing from happening to them. They would have been better off doing nothing at all, because after seven years of firewall the AfD are stronger than the Greens ever were. The whole thing has become a lesson in why you should avoid heavy-handed interventions in complex systems.\nSure, it hurts and it’s scary to find yourself banished from the castle and forced to scrounge, scratch, and claw for survival. But the self-discipline that comes from the experience is absolutely invaluable in the long term.\nDISCUSS ON SG",
  "tags": [
    "philosophy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-10-23T17:30:52+00:00"
}