{
  "url": "https://voxday.net/2025/10/16/rediscovering-van-creveld/",
  "scraped_at": "2026-01-08T20:34:10.086532",
  "title": "Rediscovering Van Creveld",
  "date_display": "October 16, 2025",
  "date_iso": "2025-10-16T17:36:57+00:00",
  "date_from_url": "2025-10-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>But there is more to social justice and social justice convergence <a href=\"https://www.compactmag.com/article/the-great-feminization/\">than simple feminization</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Everything you think of as wokeness involves prioritizing the feminine over the masculine: empathy over rationality, safety over risk, cohesion over competition. Other writers who have proposed their own versions of the Great Feminization thesis, such as Noah Carl or Bo Winegard and Cory Clark, who looked at feminization’s effects on academia, offer survey data showing sex differences in political values. One survey, for example, found that 71 percent of men said protecting free speech was more important than preserving a cohesive society, and 59 percent of women said the opposite.</p><p>The most relevant differences are not about individuals but about groups. In my experience, individuals are unique and you come across outliers who defy stereotypes every day, but groups of men and women display consistent differences. Which makes sense, if you think about it statistically. A random woman might be taller than a random man, but a group of ten random women is very unlikely to have an average height greater than that of a group of ten men. The larger the group of people, the more likely it is to conform to statistical averages.</p><p>Female group dynamics favor consensus and cooperation. Men order each other around, but women can only suggest and persuade. Any criticism or negative sentiment, if it absolutely must be expressed, needs to be buried in layers of compliments. The outcome of a discussion is less important than the fact that a discussion was held and everyone participated in it. The most important sex difference in group dynamics is attitude to conflict. In short, men wage conflict openly while women covertly undermine or ostracize their enemies…</p><p>he Great Feminization is truly unprecedented. Other civilizations have given women the vote, granted them property rights, or let them inherit the thrones of empires. No civilization in human history has ever experimented with letting women control so many vital institutions of our society, from political parties to universities to our largest businesses. Even where women do not hold the top spots, women set the tone in these organizations, such that a male CEO must operate within the limits set by his human resources VP. We assume that these institutions will continue to function under these completely novel circumstances. But what are our grounds for that assumption?</p><p>The problem is not that women are less talented than men or even that female modes of interaction are inferior in any objective sense. The problem is that female modes of interaction are not well suited to accomplishing the goals of many major institutions. You can have an academia that is majority female, but it will be (as majority-female departments in today’s universities already are) oriented toward other goals than open debate and the unfettered pursuit of truth. And if your academia doesn’t pursue truth, what good is it? If your journalists aren’t prickly individualists who don’t mind alienating people, what good are they? If a business loses its swashbuckling spirit and becomes a feminized, inward-focused bureaucracy, will it not stagnate?</p><p>If the Great Feminization poses a threat to civilization, the question becomes whether there is anything we can do about it. The answer depends on why you think it occurred in the first place.</p></blockquote><p>The author is entirely correct to be concerned about the consequences for every industry in which women become the majority, because all of those industries will cease to be able to perform their primary functions. We’ve already seen that, for example, in elementary education, where predominantly female teachers working under female principles and female-majority schoolboards cannot teach schoolchildren how to read, write, or do arithmetic.</p><p>As we are observing in real time, female-dominated politics are not compatible with civilization because women have different priorities and perspectives than those required for its construction and maintenance. A feminist society, if left unchecked to its own devices, will look very similar to the average African society before European contact. The episode of <em>Survivor </em>in which the two tribes were divided by the sexes is a very vivid example of this.</p><p>But the author is confusing the symptom for the disease. Women are more akin to the vector of the disease than the disease itself, as can be observed from the way in which men who are social justice warriors are every bit as incompetent and even more insane than the women are. The disease is ultimately spiritual and eventually ends in either societal collapse, pyramids dedicated to child sacrifice, or both.</p><p>The good news is that a) converged societies will inevitably fail, b) women’s commitment to feminism and social justice will vanish as soon as the government funding fails, and c) men stop supporting female influence over them.</p><p>This is a unique moment of history, and it is already observably coming to an end.</p><p><em>The lesson, as always, is this: women ruin everything.</em><br/>—Bill Simmons</p><p><em><a href=\"https://socialgalactic.com/micropost/d443bf05-daa6-4995-8cbb-db94dc754794\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "But there is more to social justice and social justice convergence\nthan simple feminization\n:\nEverything you think of as wokeness involves prioritizing the feminine over the masculine: empathy over rationality, safety over risk, cohesion over competition. Other writers who have proposed their own versions of the Great Feminization thesis, such as Noah Carl or Bo Winegard and Cory Clark, who looked at feminization’s effects on academia, offer survey data showing sex differences in political values. One survey, for example, found that 71 percent of men said protecting free speech was more important than preserving a cohesive society, and 59 percent of women said the opposite.\nThe most relevant differences are not about individuals but about groups. In my experience, individuals are unique and you come across outliers who defy stereotypes every day, but groups of men and women display consistent differences. Which makes sense, if you think about it statistically. A random woman might be taller than a random man, but a group of ten random women is very unlikely to have an average height greater than that of a group of ten men. The larger the group of people, the more likely it is to conform to statistical averages.\nFemale group dynamics favor consensus and cooperation. Men order each other around, but women can only suggest and persuade. Any criticism or negative sentiment, if it absolutely must be expressed, needs to be buried in layers of compliments. The outcome of a discussion is less important than the fact that a discussion was held and everyone participated in it. The most important sex difference in group dynamics is attitude to conflict. In short, men wage conflict openly while women covertly undermine or ostracize their enemies…\nhe Great Feminization is truly unprecedented. Other civilizations have given women the vote, granted them property rights, or let them inherit the thrones of empires. No civilization in human history has ever experimented with letting women control so many vital institutions of our society, from political parties to universities to our largest businesses. Even where women do not hold the top spots, women set the tone in these organizations, such that a male CEO must operate within the limits set by his human resources VP. We assume that these institutions will continue to function under these completely novel circumstances. But what are our grounds for that assumption?\nThe problem is not that women are less talented than men or even that female modes of interaction are inferior in any objective sense. The problem is that female modes of interaction are not well suited to accomplishing the goals of many major institutions. You can have an academia that is majority female, but it will be (as majority-female departments in today’s universities already are) oriented toward other goals than open debate and the unfettered pursuit of truth. And if your academia doesn’t pursue truth, what good is it? If your journalists aren’t prickly individualists who don’t mind alienating people, what good are they? If a business loses its swashbuckling spirit and becomes a feminized, inward-focused bureaucracy, will it not stagnate?\nIf the Great Feminization poses a threat to civilization, the question becomes whether there is anything we can do about it. The answer depends on why you think it occurred in the first place.\nThe author is entirely correct to be concerned about the consequences for every industry in which women become the majority, because all of those industries will cease to be able to perform their primary functions. We’ve already seen that, for example, in elementary education, where predominantly female teachers working under female principles and female-majority schoolboards cannot teach schoolchildren how to read, write, or do arithmetic.\nAs we are observing in real time, female-dominated politics are not compatible with civilization because women have different priorities and perspectives than those required for its construction and maintenance. A feminist society, if left unchecked to its own devices, will look very similar to the average African society before European contact. The episode of\nSurvivor\nin which the two tribes were divided by the sexes is a very vivid example of this.\nBut the author is confusing the symptom for the disease. Women are more akin to the vector of the disease than the disease itself, as can be observed from the way in which men who are social justice warriors are every bit as incompetent and even more insane than the women are. The disease is ultimately spiritual and eventually ends in either societal collapse, pyramids dedicated to child sacrifice, or both.\nThe good news is that a) converged societies will inevitably fail, b) women’s commitment to feminism and social justice will vanish as soon as the government funding fails, and c) men stop supporting female influence over them.\nThis is a unique moment of history, and it is already observably coming to an end.\nThe lesson, as always, is this: women ruin everything.\n—Bill Simmons\nDISCUSS ON SG",
  "tags": [
    "SJW",
    "society",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-10-16T18:49:44+00:00"
}