{
  "url": "https://voxday.net/2025/10/05/the-end-of-jordan-peterson/",
  "scraped_at": "2026-01-08T20:33:07.571696",
  "title": "The End of Jordan Peterson",
  "date_display": "October 5, 2025",
  "date_iso": "2025-10-05T11:20:04+00:00",
  "date_from_url": "2025-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Black Rider appears to no longer have any use <a href=\"https://www.youtube.com/watch?v=WUsSkif3-6w\">for the Canadian charlatan</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>This summer has been exceedingly difficult. Dad was in an ICU suffering from pneumonia and sepsis after dealing with a host of neurological issues this summer that we believe stem from SERS which is chronic inflammatory response syndrome due to decades of mold exposure. We don’t have a better explanation for his neurological symptoms at the moment other than spiritual attacks. He’s been suffering for the last number of years with unexplainable neuropathy and weakness amongst other symptoms, but they worsened this summer after he cleaned out his parents’ basement after his dad, my grandpa, passed away.</p></blockquote><p>The summary from /pol/ is apt enough:</p><p><em>His rise and decline is very interesting. You can see he starts off as a nobody retard professor, then gets attention talking about free speech, has some good points early on. Sold a book. It was all uphill, but the success wasn’t enough. He was approached and he was hungry for more, the money wasn’t enough, he wanted recognition, but then recognition wasn’t enough, he wanted to be part of “the club”. He is a story of a man who went to defeat a dragon but succumbed to the riches the dragon has collected. When his time in the spotlight was over, he couldn’t let go. He became a parody of himself, willing to say and do anything to keep even a crumb of the rise he previously experienced. A man destroyed by his own success, his own greed for relevancy and fame. A good start followed by a pathetic end.</em></p><p>If you’ve read <em>Jordanetics</em>, then you know that Jordan Peterson was directly involved with the occult and there are even hints that his family is one drenched in generational evil.</p><p>Observe that even on what would appear to be his last legs, he still refuses to humble himself and turn to Jesus Christ. And remember, this is a man whose so-called “success” I, and others like Milo, have been frequently accused of envying, which has never, ever, been the case.</p><p>We recently watched <em>Ghostbusters: Afterlife</em>, and one of the things that struck me was how the revived Gozer didn’t hesitate to destroy the one servant who had made her revival possible. I’ve just never understood how evil men like Jordan Peterson never seem to grasp that the even more wicked men and spirits they serve not only don’t love or respect them, but won’t hesitate to destroy them as soon as they cease to be useful.</p><p>To be honest, I didn’t really expect Peterson to fade away into irrelevance as he has over the past few years. I always thought his demise would be more spectacular and more obviously self-inflicted.</p><p><em><a href=\"https://socialgalactic.com/micropost/e123e41a-bff2-43c0-a78f-5ec038553c34\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Black Rider appears to no longer have any use\nfor the Canadian charlatan\n:\nThis summer has been exceedingly difficult. Dad was in an ICU suffering from pneumonia and sepsis after dealing with a host of neurological issues this summer that we believe stem from SERS which is chronic inflammatory response syndrome due to decades of mold exposure. We don’t have a better explanation for his neurological symptoms at the moment other than spiritual attacks. He’s been suffering for the last number of years with unexplainable neuropathy and weakness amongst other symptoms, but they worsened this summer after he cleaned out his parents’ basement after his dad, my grandpa, passed away.\nThe summary from /pol/ is apt enough:\nHis rise and decline is very interesting. You can see he starts off as a nobody retard professor, then gets attention talking about free speech, has some good points early on. Sold a book. It was all uphill, but the success wasn’t enough. He was approached and he was hungry for more, the money wasn’t enough, he wanted recognition, but then recognition wasn’t enough, he wanted to be part of “the club”. He is a story of a man who went to defeat a dragon but succumbed to the riches the dragon has collected. When his time in the spotlight was over, he couldn’t let go. He became a parody of himself, willing to say and do anything to keep even a crumb of the rise he previously experienced. A man destroyed by his own success, his own greed for relevancy and fame. A good start followed by a pathetic end.\nIf you’ve read\nJordanetics\n, then you know that Jordan Peterson was directly involved with the occult and there are even hints that his family is one drenched in generational evil.\nObserve that even on what would appear to be his last legs, he still refuses to humble himself and turn to Jesus Christ. And remember, this is a man whose so-called “success” I, and others like Milo, have been frequently accused of envying, which has never, ever, been the case.\nWe recently watched\nGhostbusters: Afterlife\n, and one of the things that struck me was how the revived Gozer didn’t hesitate to destroy the one servant who had made her revival possible. I’ve just never understood how evil men like Jordan Peterson never seem to grasp that the even more wicked men and spirits they serve not only don’t love or respect them, but won’t hesitate to destroy them as soon as they cease to be useful.\nTo be honest, I didn’t really expect Peterson to fade away into irrelevance as he has over the past few years. I always thought his demise would be more spectacular and more obviously self-inflicted.\nDISCUSS ON SG",
  "tags": [
    "Jordanetics",
    "judeo-christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-10-05T11:20:08+00:00"
}