{
  "url": "https://voxday.net/2025/10/29/the-death-of-wikipedia/",
  "scraped_at": "2026-01-08T20:35:11.327056",
  "title": "The Death of Wikipedia",
  "date_display": "October 29, 2025",
  "date_iso": "2025-10-29T13:34:35+00:00",
  "date_from_url": "2025-10-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s already apparent on this, the second day of Grokipedia, that Wikipedia is effectively dead. It may not have stopped moving yet, but it’s clearly and inevitably toast. Compare and contrast, for example, the competitive listings <a href=\"https://sigmagame.substack.com/p/the-gamechanger\">on the concept of the Sigma Male</a>, which as yet exists only as a subset of tangential pages on both sites.</p><p>The most fundamental difference is not actually Grokipedia’s incorporation of AI, but rather, its long-overdue rejection of the perverse Wikipedia demand for a reliable secondhand source, which not only guarantees inaccurate and outdated information, but is a contradiction in terms. Providing the media with a <em>de facto</em> veto on any and all information that can appear on Wikipedia necessarily rendered it incapable of serving as anything more than a mainstream media repository.</p><p>The idea of requiring “reliable sources” sounds superficially reasonable, but the observable facts are that the editors, the sources deemed acceptable, and most of all, the admins, are at the very least every bit as biased as any direct source. A direct source might very well put a spin on the information published on Wikipedia, <em>but at least it would provide the information in the first place!</em></p><p>For example, this is the full description of my music career and discography on Wikipedia, even though my status as an award-winning, three-time Billboard charting musician is undisputed and dozens of my songs are publicly available <a href=\"https://open.spotify.com/artist/58EoPzlBhYA4vnFHI7jCJ1\">on Spotify</a> and <a href=\"https://music.apple.com/us/artist/vibe-patrol/1783691529\">Apple Music</a>.</p><p><em>Beale was a member of the band Psykosonik between 1992 and 1994.</em></p><p>You simply wouldn’t know that I’ve written and recorded over 100 songs for six different bands. You wouldn’t know that my music was featured in a Nintendo game published by Activision. You wouldn’t know what my band beat out Prince for a Best Dance Record award. And you wouldn’t know that I founded the band a year before I was supposedly a member of it. Now, Grokipedia doesn’t do much better in that regard, but it does provide considerably more detail and context.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Psykosonik, an American techno and industrial music project, formed in 1991 in Minneapolis, Minnesota, drawing inspiration from cyberpunk themes and club scenes. The name derived from a lyric in the band’s early track “Sex Me Up,” altered to “Psykosonik” with a “k” for distinctiveness. Key contributors included Paul Skrowaczewski, who handled musical production and vocals, and Theodore Beale, who provided lyrics influenced by political nihilism and extropian ideas. The project evolved from earlier electronic experiments tied to local nightclubs like The Upper Level and The Underground, managed by impresario Gordie.[12]</p><p>Beale’s involvement stemmed from his prior experience in the cover band NoBoys, active in 1987–1988, which performed synth-pop sets including Depeche Mode and New Order tracks at Minneapolis venues. NoBoys played a notable one-hour gig at The Upper Level in summer 1988, drawing crowds before being cut short due to internal club tensions. By late 1991, Beale collaborated with Skrowaczewski on Psykosonik, writing lyrics for songs like “Silicon Jesus” and contributing conceptual vision. The lineup expanded in early 1992 with drummer Mike Reed and DJ Dan Lenzmeier, solidifying the project’s electronic sound. Beale served as lyricist until departing the music scene in 1994 to focus on technology ventures.[13][12][14]</p><p>Psykosonik’s early momentum built through club exposure rather than extensive live tours, characteristic of 1990s techno acts emphasizing studio production. The track “Sex Me Up” gained traction by late 1991 when played regularly by DJs at The Perimeter nightclub, prompting crowds to anticipate and chant along during peak hours. Subsequent demos, such as an early version of “Down to the Ground” recorded that winter, fueled local buzz but did not lead to documented full-band concerts. The project prioritized releases over stage performances, with Beale’s lyrics appearing on the 1993 self-titled debut album, though live sets remained minimal amid internal creative dynamics.[12]</p></blockquote><p>There are a few errors, of course. But it’s notable that it actually got Paul Sebastian’s surname right.</p><ul class=\"wp-block-list\"><li>The drummer was Mike Larson, not Mike Reed.</li><li>My lyrics also appear on the second album, <em>Unlearn</em>.</li></ul><p>It’s remarkable that it has only one more error than the Wikipedia entry despite providing considerably more detail… but more about that anon.</p><p>It’s clear that Grokipedia offers a clear technological path forward for Infogalactic, as well as leaveing considerable room for some of the curation and user features that we’ve always planned to provide that will allow Infogalactic to complement Grokipedia in a way that it could never co-exist with Wikipedia. If you’re an AI programmer with potential interest in the next phase of the project, watch this space.</p><p>Regardless, it’s clear that Wikipedia’s monopoly has been broken by artificial intelligence and its convergence ensures its inability to perform its core function sufficiently well enough for it to compete and survive.</p><p><strong>UPDATE:</strong> Wikipedia founder Larry Sanger <a href=\"https://larrysanger.org/2025/10/grokipedia-a-first-look/\">has some additional thoughts</a>, and even created a metric that found Grokipedia to be considerably less biased despite its reliance on supposedly unreliable direct sources.</p><p><em>According to ChatGPT 4o, which is a competent LLM that is widely perceived to lean to the left, primarily on account of its training data, the Wikipedia articles on these controversial topics, on average, had a bias somewhere between “emphasizes one side rather more heavily” and “severely biased.” By contrast, the Grokipedia articles on these topics are said to “exhibit minor imbalances” on average. On these topics, Wikipedia was never wholly neutral, while Grokipedia was entirely neutral (rating of 1) three out of ten times, and was only slightly biased (rating of 2) five other times. Meanwhile, Wikipedia’s bias was heavy, severe, or wholly one-sided (rating of 3, 4, or 5) six out of ten times.</em></p><p><em><a href=\"https://socialgalactic.com/micropost/a10a1625-1193-465e-89c4-484b171fe504\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s already apparent on this, the second day of Grokipedia, that Wikipedia is effectively dead. It may not have stopped moving yet, but it’s clearly and inevitably toast. Compare and contrast, for example, the competitive listings\non the concept of the Sigma Male\n, which as yet exists only as a subset of tangential pages on both sites.\nThe most fundamental difference is not actually Grokipedia’s incorporation of AI, but rather, its long-overdue rejection of the perverse Wikipedia demand for a reliable secondhand source, which not only guarantees inaccurate and outdated information, but is a contradiction in terms. Providing the media with a\nde facto\nveto on any and all information that can appear on Wikipedia necessarily rendered it incapable of serving as anything more than a mainstream media repository.\nThe idea of requiring “reliable sources” sounds superficially reasonable, but the observable facts are that the editors, the sources deemed acceptable, and most of all, the admins, are at the very least every bit as biased as any direct source. A direct source might very well put a spin on the information published on Wikipedia,\nbut at least it would provide the information in the first place!\nFor example, this is the full description of my music career and discography on Wikipedia, even though my status as an award-winning, three-time Billboard charting musician is undisputed and dozens of my songs are publicly available\non Spotify\nand\nApple Music\n.\nBeale was a member of the band Psykosonik between 1992 and 1994.\nYou simply wouldn’t know that I’ve written and recorded over 100 songs for six different bands. You wouldn’t know that my music was featured in a Nintendo game published by Activision. You wouldn’t know what my band beat out Prince for a Best Dance Record award. And you wouldn’t know that I founded the band a year before I was supposedly a member of it. Now, Grokipedia doesn’t do much better in that regard, but it does provide considerably more detail and context.\nPsykosonik, an American techno and industrial music project, formed in 1991 in Minneapolis, Minnesota, drawing inspiration from cyberpunk themes and club scenes. The name derived from a lyric in the band’s early track “Sex Me Up,” altered to “Psykosonik” with a “k” for distinctiveness. Key contributors included Paul Skrowaczewski, who handled musical production and vocals, and Theodore Beale, who provided lyrics influenced by political nihilism and extropian ideas. The project evolved from earlier electronic experiments tied to local nightclubs like The Upper Level and The Underground, managed by impresario Gordie.[12]\nBeale’s involvement stemmed from his prior experience in the cover band NoBoys, active in 1987–1988, which performed synth-pop sets including Depeche Mode and New Order tracks at Minneapolis venues. NoBoys played a notable one-hour gig at The Upper Level in summer 1988, drawing crowds before being cut short due to internal club tensions. By late 1991, Beale collaborated with Skrowaczewski on Psykosonik, writing lyrics for songs like “Silicon Jesus” and contributing conceptual vision. The lineup expanded in early 1992 with drummer Mike Reed and DJ Dan Lenzmeier, solidifying the project’s electronic sound. Beale served as lyricist until departing the music scene in 1994 to focus on technology ventures.[13][12][14]\nPsykosonik’s early momentum built through club exposure rather than extensive live tours, characteristic of 1990s techno acts emphasizing studio production. The track “Sex Me Up” gained traction by late 1991 when played regularly by DJs at The Perimeter nightclub, prompting crowds to anticipate and chant along during peak hours. Subsequent demos, such as an early version of “Down to the Ground” recorded that winter, fueled local buzz but did not lead to documented full-band concerts. The project prioritized releases over stage performances, with Beale’s lyrics appearing on the 1993 self-titled debut album, though live sets remained minimal amid internal creative dynamics.[12]\nThere are a few errors, of course. But it’s notable that it actually got Paul Sebastian’s surname right.\nThe drummer was Mike Larson, not Mike Reed.\nMy lyrics also appear on the second album,\nUnlearn\n.\nIt’s remarkable that it has only one more error than the Wikipedia entry despite providing considerably more detail… but more about that anon.\nIt’s clear that Grokipedia offers a clear technological path forward for Infogalactic, as well as leaveing considerable room for some of the curation and user features that we’ve always planned to provide that will allow Infogalactic to complement Grokipedia in a way that it could never co-exist with Wikipedia. If you’re an AI programmer with potential interest in the next phase of the project, watch this space.\nRegardless, it’s clear that Wikipedia’s monopoly has been broken by artificial intelligence and its convergence ensures its inability to perform its core function sufficiently well enough for it to compete and survive.\nUPDATE:\nWikipedia founder Larry Sanger\nhas some additional thoughts\n, and even created a metric that found Grokipedia to be considerably less biased despite its reliance on supposedly unreliable direct sources.\nAccording to ChatGPT 4o, which is a competent LLM that is widely perceived to lean to the left, primarily on account of its training data, the Wikipedia articles on these controversial topics, on average, had a bias somewhere between “emphasizes one side rather more heavily” and “severely biased.” By contrast, the Grokipedia articles on these topics are said to “exhibit minor imbalances” on average. On these topics, Wikipedia was never wholly neutral, while Grokipedia was entirely neutral (rating of 1) three out of ten times, and was only slightly biased (rating of 2) five other times. Meanwhile, Wikipedia’s bias was heavy, severe, or wholly one-sided (rating of 3, 4, or 5) six out of ten times.\nDISCUSS ON SG",
  "tags": [
    "Infogalactic",
    "media",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-10-29T14:09:47+00:00"
}