{
  "url": "https://voxday.net/2025/10/28/the-last-bluff/",
  "scraped_at": "2026-01-08T20:35:05.818191",
  "title": "The Last Bluff",
  "date_display": "October 28, 2025",
  "date_iso": "2025-10-28T09:03:08+00:00",
  "date_from_url": "2025-10-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Big Serge explains <a href=\"https://bigserge.substack.com/p/living-dangerously\">the real reason</a> why the USA cannot afford to provide any Tomahawk missiles to Ukraine:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The basic pattern here is well established. The United States has done what it can to backstop Ukrainian strike capabilities, but it has held them at a level where Ukraine’s damage output falls far short of decisive levels. So long as that is the case, Russia has clearly demonstrated that it will simply eat the punches and retaliate against <em>Ukraine</em>. Hence, when the United States helps Ukraine target Russian oil facilities, it is Ukraine that receives the reprisal, and it is Ukraine which has its natural gas production annihilated as the winter approaches. In a sense, neither side is really trying to deter the other at all. The United States has raised the cost of this war for Russia, but not enough to create any real pressure for Moscow to end the conflict; in response, Russia punishes Ukraine, which is something the United States does not really care about. The result is a sort of geostrategic Picture of Dorian Gray, where the United States vicariously inflicts cathartic damage on Russia, but Ukraine accrues all the soul damage.</p><p>In the case of Tomahawks, the risk-reward calculus is just not there. Tomahawks are a strategically invaluable asset that the United States cannot afford to hand out like candy. Even if the launch systems could be provided (highly doubtful), the missiles could not be made available in sufficient quantities to make a difference. The range of the missiles, however, significantly raises the probability of miscalculation or uncontrolled escalation. Ukraine shooting American missiles at energy infrastructure in Belgorod or Rostov is one thing; shooting them at the Kremlin is another thing entirely.</p><p>There is, however, another aspect of this which seems to be garnering little attention. The biggest risk of sending Tomahawks is not that the Ukrainians will blow up the Kremlin and start World War Three. The bigger risk is that the Tomahawks are used, and Russia simply moves on after eating the strikes. Tomahawks are arguably one of the last – if not <em>the</em> last – rung in the escalation ladder for the USA. We have rapidly run through the chain of systems that can be given to the AFU, and little remains except a few strike systems like the Tomahawk or the JASSM. Ukraine has generally received everything it has asked for. In the case of Tomahawks, however, the United States is running the most serious risk of all: what if the Russians simply shoot down some of the missiles and eat the rest of the strikes? It’s immaterial whether the Tomahawks damage Russian powerplants or oil refineries. If Tomahawks are delivered and consumed without seriously jarring Russian nerves, the last escalatory card will have been played. If Russia perceives that America has reached the limits of its ability to raise the costs of the war for Russia, it undercuts the entire premise of negotiations. More simply put, Tomahawks are most valuable as an asset to threaten with.</p></blockquote><p>The USA has been relentlessly bluffing, and the Russians have been relentlessly calling those bluffs, since the launch of the Special Military Operation nearly four years ago. There can be little doubt that the Russians will do the same thing if the Tomahawks are deployed against them, and then the US military will be revealed as the paper tiger it is so far outside its zone of influence.</p><p>Which, of course, is the one thing the US military cannot afford to happen in light of its global pretensions and asymmetric war with China.</p><p><em><a href=\"https://socialgalactic.com/micropost/e54a9add-71f9-46e0-9293-e46bfdc40e9d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Big Serge explains\nthe real reason\nwhy the USA cannot afford to provide any Tomahawk missiles to Ukraine:\nThe basic pattern here is well established. The United States has done what it can to backstop Ukrainian strike capabilities, but it has held them at a level where Ukraine’s damage output falls far short of decisive levels. So long as that is the case, Russia has clearly demonstrated that it will simply eat the punches and retaliate against\nUkraine\n. Hence, when the United States helps Ukraine target Russian oil facilities, it is Ukraine that receives the reprisal, and it is Ukraine which has its natural gas production annihilated as the winter approaches. In a sense, neither side is really trying to deter the other at all. The United States has raised the cost of this war for Russia, but not enough to create any real pressure for Moscow to end the conflict; in response, Russia punishes Ukraine, which is something the United States does not really care about. The result is a sort of geostrategic Picture of Dorian Gray, where the United States vicariously inflicts cathartic damage on Russia, but Ukraine accrues all the soul damage.\nIn the case of Tomahawks, the risk-reward calculus is just not there. Tomahawks are a strategically invaluable asset that the United States cannot afford to hand out like candy. Even if the launch systems could be provided (highly doubtful), the missiles could not be made available in sufficient quantities to make a difference. The range of the missiles, however, significantly raises the probability of miscalculation or uncontrolled escalation. Ukraine shooting American missiles at energy infrastructure in Belgorod or Rostov is one thing; shooting them at the Kremlin is another thing entirely.\nThere is, however, another aspect of this which seems to be garnering little attention. The biggest risk of sending Tomahawks is not that the Ukrainians will blow up the Kremlin and start World War Three. The bigger risk is that the Tomahawks are used, and Russia simply moves on after eating the strikes. Tomahawks are arguably one of the last – if not\nthe\nlast – rung in the escalation ladder for the USA. We have rapidly run through the chain of systems that can be given to the AFU, and little remains except a few strike systems like the Tomahawk or the JASSM. Ukraine has generally received everything it has asked for. In the case of Tomahawks, however, the United States is running the most serious risk of all: what if the Russians simply shoot down some of the missiles and eat the rest of the strikes? It’s immaterial whether the Tomahawks damage Russian powerplants or oil refineries. If Tomahawks are delivered and consumed without seriously jarring Russian nerves, the last escalatory card will have been played. If Russia perceives that America has reached the limits of its ability to raise the costs of the war for Russia, it undercuts the entire premise of negotiations. More simply put, Tomahawks are most valuable as an asset to threaten with.\nThe USA has been relentlessly bluffing, and the Russians have been relentlessly calling those bluffs, since the launch of the Special Military Operation nearly four years ago. There can be little doubt that the Russians will do the same thing if the Tomahawks are deployed against them, and then the US military will be revealed as the paper tiger it is so far outside its zone of influence.\nWhich, of course, is the one thing the US military cannot afford to happen in light of its global pretensions and asymmetric war with China.\nDISCUSS ON SG",
  "tags": [
    "China",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-10-28T09:03:23+00:00"
}