{
  "url": "https://voxday.net/2025/10/18/the-art-of-war-in-the-middle-ages/",
  "scraped_at": "2026-01-08T20:34:17.110115",
  "title": "The Art of War in the Middle Ages",
  "date_display": "October 18, 2025",
  "date_iso": "2025-10-18T12:00:38+00:00",
  "date_from_url": "2025-10-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>The Art of War has been very simply defined as ‘the art which enables any commander to worst the forces opposed to him.’ It is therefore conversant with an enormous variety of subjects: Strategy and Tactics are but two of the more important of its branches. Besides dealing with discipline, organization, and armament, it is bound to investigate every means which can be adapted to increase the physical or moral efficiency of an army. The author who opened his work with a dissertation on ‘the age which is preferable in a generalissimo,’ or ‘the average height which the infantry soldier should attain,’ was dealing with the Art of War, no less than he who confined himself to purely tactical speculations.</em></p><p>Today marks <a href=\"https://castalialibrary.substack.com/p/the-art-of-war-in-the-middle-ages-09b\">the launch of the new serialization</a> at the Castalia Library substack. The work being serialized is the Oxford edition of Sir Charles Oman’s original 1884 Lothian Prize-winning essay: <em>THE ART OF WAR IN THE MIDDLE AGES A.D. 378–1515</em>.</p><p>The essay is the precursor to the work being published by Castalia Library as the Sep-Dec 2025 subscription book, which is an expanded version of the essay that was published in 1898 by Methuen &amp; Co. as <em>A HISTORY OF THE ART OF WAR: The Middle Ages From the Fourth to the Fourteenth Century</em>.</p><p>In my humble opinion, this book is a must-have for anyone with an interest in either history or war. If you haven’t <a href=\"https://arkhavencomics.com/product/castalia-history-annual-subscription/\">subscribed to Castalia History</a> yet, this is a book that should make you seriously considering doing so, because it’s going to be an instant classic and will almost certainly sell out before it’s even available.</p><p><a href=\"https://socialgalactic.com/micropost/ff0a884e-a51c-4696-b114-7950856fbd2c\"><em>DISCUSS ON SG</em></a></p></div>",
  "content_text": "The Art of War has been very simply defined as ‘the art which enables any commander to worst the forces opposed to him.’ It is therefore conversant with an enormous variety of subjects: Strategy and Tactics are but two of the more important of its branches. Besides dealing with discipline, organization, and armament, it is bound to investigate every means which can be adapted to increase the physical or moral efficiency of an army. The author who opened his work with a dissertation on ‘the age which is preferable in a generalissimo,’ or ‘the average height which the infantry soldier should attain,’ was dealing with the Art of War, no less than he who confined himself to purely tactical speculations.\nToday marks\nthe launch of the new serialization\nat the Castalia Library substack. The work being serialized is the Oxford edition of Sir Charles Oman’s original 1884 Lothian Prize-winning essay:\nTHE ART OF WAR IN THE MIDDLE AGES A.D. 378–1515\n.\nThe essay is the precursor to the work being published by Castalia Library as the Sep-Dec 2025 subscription book, which is an expanded version of the essay that was published in 1898 by Methuen & Co. as\nA HISTORY OF THE ART OF WAR: The Middle Ages From the Fourth to the Fourteenth Century\n.\nIn my humble opinion, this book is a must-have for anyone with an interest in either history or war. If you haven’t\nsubscribed to Castalia History\nyet, this is a book that should make you seriously considering doing so, because it’s going to be an instant classic and will almost certainly sell out before it’s even available.\nDISCUSS ON SG",
  "tags": [
    "Castalia Library",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-10-18T12:09:01+00:00"
}