{
  "url": "https://voxday.net/2004/03/25/agglomeration-of-approximation/",
  "scraped_at": "2025-12-13T15:56:33.784610",
  "title": "An agglomeration of approximation",
  "date_display": "March 25, 2004",
  "date_iso": "2004-03-25T18:14:00+00:00",
  "date_from_url": "2004-03-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Paracelt is appalled by the generally blase reaction: <em>what the HELL does all this about men and women chasing each other have to do with the government having to LIE to us to manipulate the economy? Did anybody read that bit about policy-makers SYSTEMATICALLY fooling the public?</em></p><p>Yeah, it’s just that it isn’t news around these parts, Paracelt.  It’s not only not news, but if you understood Austrian theory, you’d know that it’s a given.  Heck, even if you only bought into Keynesian theory, you’d know that these economic statistics are an agglomeration of approximations.  Given the level of error implicit in each, it’s obvious that the end result of these errors stacked on errors is little more than fiction.  And given the vast quantities of money and power at stake every quarter, one would have to have a childlike faith in the purity of government indeed to believe that any temptation to monkey with the numbers will be resisted.</p><p>A conservative is a liberal who’s been mugged.  A libertarian is a conservative who’s realized just who it is that does the serious mugging.</p></div>",
  "content_text": "Paracelt is appalled by the generally blase reaction:\nwhat the HELL does all this about men and women chasing each other have to do with the government having to LIE to us to manipulate the economy? Did anybody read that bit about policy-makers SYSTEMATICALLY fooling the public?\nYeah, it’s just that it isn’t news around these parts, Paracelt.  It’s not only not news, but if you understood Austrian theory, you’d know that it’s a given.  Heck, even if you only bought into Keynesian theory, you’d know that these economic statistics are an agglomeration of approximations.  Given the level of error implicit in each, it’s obvious that the end result of these errors stacked on errors is little more than fiction.  And given the vast quantities of money and power at stake every quarter, one would have to have a childlike faith in the purity of government indeed to believe that any temptation to monkey with the numbers will be resisted.\nA conservative is a liberal who’s been mugged.  A libertarian is a conservative who’s realized just who it is that does the serious mugging.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-25T18:14:00+00:00"
}