{
  "url": "https://voxday.net/2004/03/17/and-they-said-he-wasnt-electable/",
  "scraped_at": "2025-12-13T15:55:06.174250",
  "title": "And they said he wasn’t electable",
  "date_display": "March 17, 2004",
  "date_iso": "2004-03-17T17:00:00+00:00",
  "date_from_url": "2004-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Drudge: <em>Former Democratic presidential candidate Howard Dean said yesterday that President Bush’s decision to send troops to Iraq appears to have contributed to the bombing deaths of 201 people in Spain. A growing international investigation is focusing on Islamic militants possibly linked to Al Qaeda as those responsible for the Madrid train bombings on Thursday. European intelligence agencies are trying to identify a purported Al Qaeda operative who claimed in a videotape that the group carried out the bombings to punish Spain for backing the US-led war in Iraq.  Dean referred to the videotape when asked whether he was linking US troops in Iraq to the deaths in Spain. “That was what they said in the tape,” Dean said. “They made that connection, I’m simply repeating it.”</em></p><p>So, maybe those Democratic party elders who sabotaged the Dean campaign aren’t complete idiots.  I’m just a little disappointed that everyone’s favorite nutcase politico didn’t try to also work in a little blame for expelling Boabdil from Granada in 1492.  I mean, the tape alluded to that too.  And then there’s the small fact that Dean and the lunatic American Left has been insisting for months that the multi-nation Coalition is unilateral, and that there is no connection between Al Qaeda and Iraq.  The sad thing about Dean not winning the nomination is that we’re not being treated to these sort of comments on a nightly basis.  He doesn’t even try to make sense.  But we’ll be forever grateful for that wonderful battle cry.  YEEEAAAAGGH!</p><p>I wasn’t even aware that the American president commanded deployment of Spanish troops.  Well, you learn something new every day.</p></div>",
  "content_text": "From Drudge:\nFormer Democratic presidential candidate Howard Dean said yesterday that President Bush’s decision to send troops to Iraq appears to have contributed to the bombing deaths of 201 people in Spain. A growing international investigation is focusing on Islamic militants possibly linked to Al Qaeda as those responsible for the Madrid train bombings on Thursday. European intelligence agencies are trying to identify a purported Al Qaeda operative who claimed in a videotape that the group carried out the bombings to punish Spain for backing the US-led war in Iraq.  Dean referred to the videotape when asked whether he was linking US troops in Iraq to the deaths in Spain. “That was what they said in the tape,” Dean said. “They made that connection, I’m simply repeating it.”\nSo, maybe those Democratic party elders who sabotaged the Dean campaign aren’t complete idiots.  I’m just a little disappointed that everyone’s favorite nutcase politico didn’t try to also work in a little blame for expelling Boabdil from Granada in 1492.  I mean, the tape alluded to that too.  And then there’s the small fact that Dean and the lunatic American Left has been insisting for months that the multi-nation Coalition is unilateral, and that there is no connection between Al Qaeda and Iraq.  The sad thing about Dean not winning the nomination is that we’re not being treated to these sort of comments on a nightly basis.  He doesn’t even try to make sense.  But we’ll be forever grateful for that wonderful battle cry.  YEEEAAAAGGH!\nI wasn’t even aware that the American president commanded deployment of Spanish troops.  Well, you learn something new every day.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-17T17:00:00+00:00"
}