{
  "url": "https://voxday.net/2004/03/16/and-here-i-thought-he-was-ripping-off/",
  "scraped_at": "2025-12-13T15:54:48.966794",
  "title": "And here I thought he was ripping off Eco",
  "date_display": "March 16, 2004",
  "date_iso": "2004-03-16T02:31:00+00:00",
  "date_from_url": "2004-03-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>DAN Brown, the author of last year’s best-selling “The Da Vinci Code,” is <a href=\"http://www.nypost.com/seven/03142004/gossip/pagesix.htm\">nothing but a plagiarist</a>, charges the author of two novels that are strikingly similar to Brown’s.  Author Lewis Perdue is preparing to sue Brown for copyright infringement, claiming “The Da Vinci Code” is in large part stolen from his 1983 novel, “The Da Vinci Legacy” and its 1985 follow-up, “Daughter of God” – which were both recently optioned by “Survivor” creator Mark Burnett. </em></p><p>I talked to Pocket Books, which also publishes Brown’s <em>Angels and Demons</em>, last week, and one of the things that came up in the conversation was the similarity of <em>The Da Vinci Code</em> to <em>The Da Vinci Legacy</em>.   I’d even considered writing a similar book three years ago, but decided that I’m not interesting in treading ground that has been previously trod – and trod better – before.</p><p>Speaking of which, I need to get back to work….</p></div>",
  "content_text": "DAN Brown, the author of last year’s best-selling “The Da Vinci Code,” is\nnothing but a plagiarist\n, charges the author of two novels that are strikingly similar to Brown’s.  Author Lewis Perdue is preparing to sue Brown for copyright infringement, claiming “The Da Vinci Code” is in large part stolen from his 1983 novel, “The Da Vinci Legacy” and its 1985 follow-up, “Daughter of God” – which were both recently optioned by “Survivor” creator Mark Burnett.\nI talked to Pocket Books, which also publishes Brown’s\nAngels and Demons\n, last week, and one of the things that came up in the conversation was the similarity of\nThe Da Vinci Code\nto\nThe Da Vinci Legacy\n.   I’d even considered writing a similar book three years ago, but decided that I’m not interesting in treading ground that has been previously trod – and trod better – before.\nSpeaking of which, I need to get back to work….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-16T02:31:00+00:00"
}