{
  "url": "https://voxday.net/2004/03/17/are-they-even-trying/",
  "scraped_at": "2025-12-13T15:55:11.694044",
  "title": "Are they even trying?",
  "date_display": "March 17, 2004",
  "date_iso": "2004-03-17T22:15:00+00:00",
  "date_from_url": "2004-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Debka: <em>Bin Laden’s “success” owes less to his superior craft than to the laxness of US and European counter-terror authorities. The names and descriptions of all the members of the Moroccan network which perpetrated the worst terrorist outrage since 9/11 were in their possession, handed over by Ramzi bin al Shaiba after he reached US custody in September 2002. All that time, none of the Moroccan terrorists named were detained, although their network is directly controlled by bin Laden himself and despite the fact that they lived mostly in Madrid or Tangiers. This intelligence failure is further magnified by the ease with which the terrorists were able to carry out their attack. They had no need of aircraft, suicide bombers, wads of cash or even box-cutters – only very simply to buy Spanish-manufactured explosives, stuff them into ten ordinary bags and leave them on the targeted trains.</em></p><p>This sort of thing doesn’t do anything but lend credence to Umberto Eco’s old notion – written in the day of the Red Brigades – that the world governments are not interested in fighting terrorists, but in maintaining a symbiotic relationship with them in order to excuse their continued infringement of individual rights and liberties.  Is it true in this case?  Did the US intentionally leave the Moroccan terrorist network operational?  I’m not in a position to know, but it cannot be denied that Israel has left Arafat and Sheik Ahmed Yassin of Hamas untouched for decades despite both men waging a violent war against them.  Given those facts, it is conceivable that the Bush administration is leaving bin Laden free to wage war against America for purposes of its own.  It’s an ugly thought, to be sure, and I certainly hope it is not the case, but it is not entirely impossible.</p><p>One thing I have come to appreciate over the years is that the more I learn, the more I find that for all my natural skepticism with regards to what everyone “knows”, I am not anywhere nearly cynical enough.</p></div>",
  "content_text": "From Debka:\nBin Laden’s “success” owes less to his superior craft than to the laxness of US and European counter-terror authorities. The names and descriptions of all the members of the Moroccan network which perpetrated the worst terrorist outrage since 9/11 were in their possession, handed over by Ramzi bin al Shaiba after he reached US custody in September 2002. All that time, none of the Moroccan terrorists named were detained, although their network is directly controlled by bin Laden himself and despite the fact that they lived mostly in Madrid or Tangiers. This intelligence failure is further magnified by the ease with which the terrorists were able to carry out their attack. They had no need of aircraft, suicide bombers, wads of cash or even box-cutters – only very simply to buy Spanish-manufactured explosives, stuff them into ten ordinary bags and leave them on the targeted trains.\nThis sort of thing doesn’t do anything but lend credence to Umberto Eco’s old notion – written in the day of the Red Brigades – that the world governments are not interested in fighting terrorists, but in maintaining a symbiotic relationship with them in order to excuse their continued infringement of individual rights and liberties.  Is it true in this case?  Did the US intentionally leave the Moroccan terrorist network operational?  I’m not in a position to know, but it cannot be denied that Israel has left Arafat and Sheik Ahmed Yassin of Hamas untouched for decades despite both men waging a violent war against them.  Given those facts, it is conceivable that the Bush administration is leaving bin Laden free to wage war against America for purposes of its own.  It’s an ugly thought, to be sure, and I certainly hope it is not the case, but it is not entirely impossible.\nOne thing I have come to appreciate over the years is that the more I learn, the more I find that for all my natural skepticism with regards to what everyone “knows”, I am not anywhere nearly cynical enough.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-17T22:15:00+00:00"
}