{
  "url": "https://voxday.net/2004/03/19/best-elected-democra/",
  "scraped_at": "2025-12-13T15:55:27.624232",
  "title": "The best elected Democrat",
  "date_display": "March 19, 2004",
  "date_iso": "2004-03-19T17:48:00+00:00",
  "date_from_url": "2004-03-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Samples <a href=\"http://www.nationalreview.com/comment/samples200403190931.asp\">writes on NRO</a>: <em>George W. Bush is the best Democratic president of my lifetime.  That might seem like an absurd proposition. It’s hard to imagine a politician that seems less like a Democrat. Bush’s quiet self-confidence, religious convictions, and common touch are a long way from the secular mandarins that Democrats seem to prefer in the White House. Besides, the Democrats hate the guy through and through. He couldn’t be one of them.  In fact, George Bush the man is conservative and Republican beyond all doubt. Unfortunately he has governed like a Democrat — as I said, the best one in my lifetime. </em></p><p>I’m not the least bit surprised by what Samples is saying here.  I very much agree with it.  The surprise is that it appears the editors at National Review is starting to become disenchanted with George Delano.  I’d thought the president would win re-election going away as long as the Fed could keep the moribund economy afloat on its sea of debt.  Now, I’m not quite so sure.  I still think he’ll win, but he may lose more of the right than he gathers of the left.</p></div>",
  "content_text": "John Samples\nwrites on NRO\n:\nGeorge W. Bush is the best Democratic president of my lifetime.  That might seem like an absurd proposition. It’s hard to imagine a politician that seems less like a Democrat. Bush’s quiet self-confidence, religious convictions, and common touch are a long way from the secular mandarins that Democrats seem to prefer in the White House. Besides, the Democrats hate the guy through and through. He couldn’t be one of them.  In fact, George Bush the man is conservative and Republican beyond all doubt. Unfortunately he has governed like a Democrat — as I said, the best one in my lifetime.\nI’m not the least bit surprised by what Samples is saying here.  I very much agree with it.  The surprise is that it appears the editors at National Review is starting to become disenchanted with George Delano.  I’d thought the president would win re-election going away as long as the Fed could keep the moribund economy afloat on its sea of debt.  Now, I’m not quite so sure.  I still think he’ll win, but he may lose more of the right than he gathers of the left.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-19T17:48:00+00:00"
}