{
  "url": "https://voxday.net/2004/03/25/bitter-truth-about-gop/",
  "scraped_at": "2025-12-13T15:56:30.470723",
  "title": "Bitter truth about the GOP",
  "date_display": "March 25, 2004",
  "date_iso": "2004-03-25T17:34:00+00:00",
  "date_from_url": "2004-03-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Mises Institute: <em>Anyone who wants cuts in the size and scope of government should be concerned and frustrated with the policies of President George Bush and the Republican-controlled Congress. Government spending has increased enormously and the federal budget has plunged ever more into deficit. Protectionism, regulation and government power are on the rise, and we are at war or in conflict with a record number of countries around the world. The Republican-controlled Federal Reserve has pushed interest rates to below 1% while it frantically tries to flood the economy with money and credit.  Even mainstream economist Jeffrey Frankel has recently noted (in the Milken Institute Review) that the “Republicans have become the party of fiscal irresponsibility, trade restriction, big government, and failing-grade microeconomics.”</em></p><p>However, there has not been a sudden sea change in party platforms and the rampant fiscal irresponsibility of the Republicans is not a mystery; <a href=\"http://www.mises.org/fullstory.asp?control=1476\">they are merely returning to their historical roots.</a> The Republican Party was established as a party of big government and economic intervention. Their reputation as a party of limited government is of more recent vintage and stands on a flimsy foundation.</p><p>Well, at least George Delano has a sound historical reason for his embrace of so-called strong government conservatism.</p></div>",
  "content_text": "From the Mises Institute:\nAnyone who wants cuts in the size and scope of government should be concerned and frustrated with the policies of President George Bush and the Republican-controlled Congress. Government spending has increased enormously and the federal budget has plunged ever more into deficit. Protectionism, regulation and government power are on the rise, and we are at war or in conflict with a record number of countries around the world. The Republican-controlled Federal Reserve has pushed interest rates to below 1% while it frantically tries to flood the economy with money and credit.  Even mainstream economist Jeffrey Frankel has recently noted (in the Milken Institute Review) that the “Republicans have become the party of fiscal irresponsibility, trade restriction, big government, and failing-grade microeconomics.”\nHowever, there has not been a sudden sea change in party platforms and the rampant fiscal irresponsibility of the Republicans is not a mystery;\nthey are merely returning to their historical roots.\nThe Republican Party was established as a party of big government and economic intervention. Their reputation as a party of limited government is of more recent vintage and stands on a flimsy foundation.\nWell, at least George Delano has a sound historical reason for his embrace of so-called strong government conservatism.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-25T17:34:00+00:00"
}