{
  "url": "https://voxday.net/2004/03/04/breaking-little-brains/",
  "scraped_at": "2025-12-13T15:52:45.877579",
  "title": "Breaking little brains",
  "date_display": "March 4, 2004",
  "date_iso": "2004-03-04T14:49:00+00:00",
  "date_from_url": "2004-03-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Miami New Times on Drudge: <em>New York’s downtown milieu left a lasting imprint on most people who passed through it, and while the experience may not have transformed them into flaming revolutionaries, it usually left them comfortably within “Bill Clinton’s America” and injected a healthy fear of the “GWB-ies.” To hear Drudge throw in his ideological lot with the latter tribe simply seems unfathomable, particularly when he glides from effusive praise of borderline reactionary Georgia Rep. Bob Barr to singing the lyrics of the house classic “Last Night a DJ Saved My Life” — a veritable gay-nightclub anthem. Drudge says there’s no inherent conflict. “I take this music seriously,” he insists. “In fact I take this music so seriously that I don’t want to see some shirtless freak tweaking. That kind of ruins it for me — club music is the classical music of our age.”</em></p><p>If they can’t wrap their little minds around the fact that Matt Drudge likes club music, I wonder how they’d manage to survive the notion that I wrote three songs that hit the Billboard top 40 dance chart.  Because, as we all know, only left-liberals are cool in the city.  It’s a degenerate Marxian notion – although in this case, it’s more likely a high school concept – that one is somehow defined by one’s music.</p><p>And, of course, the mere existence of the Queer Party Friends would probably make their heads explode.</p></div>",
  "content_text": "From the Miami New Times on Drudge:\nNew York’s downtown milieu left a lasting imprint on most people who passed through it, and while the experience may not have transformed them into flaming revolutionaries, it usually left them comfortably within “Bill Clinton’s America” and injected a healthy fear of the “GWB-ies.” To hear Drudge throw in his ideological lot with the latter tribe simply seems unfathomable, particularly when he glides from effusive praise of borderline reactionary Georgia Rep. Bob Barr to singing the lyrics of the house classic “Last Night a DJ Saved My Life” — a veritable gay-nightclub anthem. Drudge says there’s no inherent conflict. “I take this music seriously,” he insists. “In fact I take this music so seriously that I don’t want to see some shirtless freak tweaking. That kind of ruins it for me — club music is the classical music of our age.”\nIf they can’t wrap their little minds around the fact that Matt Drudge likes club music, I wonder how they’d manage to survive the notion that I wrote three songs that hit the Billboard top 40 dance chart.  Because, as we all know, only left-liberals are cool in the city.  It’s a degenerate Marxian notion – although in this case, it’s more likely a high school concept – that one is somehow defined by one’s music.\nAnd, of course, the mere existence of the Queer Party Friends would probably make their heads explode.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-04T14:49:00+00:00"
}