{
  "url": "https://voxday.net/2004/03/14/brief-austrian-primer/",
  "scraped_at": "2025-12-13T15:54:33.651444",
  "title": "A brief Austrian primer",
  "date_display": "March 14, 2004",
  "date_iso": "2004-03-14T16:17:00+00:00",
  "date_from_url": "2004-03-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sid Hartman of the Star Tribune writes approvingly: <em>The Xcel Energy Center would not have been built, and St. Paul would not have gotten an NHL expansion team, if former Gov. Arne Carlson hadn’t taken the bull by the horns and told leaders in the Legislature that if they wanted any of their pet projects to pass, they had better vote for a bill funding the construction of the arena.  There wasn’t any referendum to make that decision.  Carlson threatened to veto 1998 education and tax bills if legislators failed to include $65 million of state funding for the $130 million St. Paul arena in a bonding bill. The city of St. Paul’s $65 million contribution came via revenue bonds.</em></p><p>And the only way new stadiums will be built for the Twins, Vikings and even for the Gophers football team is if Gov. Tim Pawlenty lets members of the Legislature know that he wants to get these stadium issues solved.  And he should show some courage and not require any referendums.</p><p>Any questions about how government works, and for whom it is working?  We certainly can’t allow those dirty little taxpayers, who don’t know a good thing when they see it, have any say in how their taxes are spent, can we.</p></div>",
  "content_text": "Sid Hartman of the Star Tribune writes approvingly:\nThe Xcel Energy Center would not have been built, and St. Paul would not have gotten an NHL expansion team, if former Gov. Arne Carlson hadn’t taken the bull by the horns and told leaders in the Legislature that if they wanted any of their pet projects to pass, they had better vote for a bill funding the construction of the arena.  There wasn’t any referendum to make that decision.  Carlson threatened to veto 1998 education and tax bills if legislators failed to include $65 million of state funding for the $130 million St. Paul arena in a bonding bill. The city of St. Paul’s $65 million contribution came via revenue bonds.\nAnd the only way new stadiums will be built for the Twins, Vikings and even for the Gophers football team is if Gov. Tim Pawlenty lets members of the Legislature know that he wants to get these stadium issues solved.  And he should show some courage and not require any referendums.\nAny questions about how government works, and for whom it is working?  We certainly can’t allow those dirty little taxpayers, who don’t know a good thing when they see it, have any say in how their taxes are spent, can we.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-14T16:17:00+00:00"
}