{
  "url": "https://voxday.net/2004/03/16/charade-plays-ou/",
  "scraped_at": "2025-12-13T15:54:54.108334",
  "title": "The charade plays out",
  "date_display": "March 16, 2004",
  "date_iso": "2004-03-16T15:59:00+00:00",
  "date_from_url": "2004-03-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Star Tribune: <em>By a single vote, the South Dakota Senate today killed a bill that would have banned almost all abortions in the state.  The bill, which almost certainly would have been challenged in court as unconstitutional, had passed both the House and Senate earlier, but Gov. Mike Rounds issued a “form veto,” asking that some of the bill’s language be clarified.  The Senate, which had passed the original bill on an 18-15 vote, rejected the revised measure today by 18-17…. Earlier today, the House easily approved Rounds’ proposed changes, which were designed to keep current state abortion restrictions in place if the new law was challenged in court, as expected. That vote was 54-16.</em></p><p>Rep. Matt McCaulley, a Sioux Falls Republican who wrote the bill with help from the Thomas More Law Center in Ann Arbor, Mich., had hoped the strict law might reach the U.S. Supreme Court and be used to overturn the court’s historic 1973 Roe v. Wade decision legalizing abortion. Some legislators with long records of opposing abortion lined up against the bill, however, fearing that a court challenge could backfire and further entrench the Roe decision.</p><p>I hate this sort of fake pragmatism.  The notion that you can’t do the right thing – what you publicly state you believe to be the right thing – because someone might do the wrong thing down the road, is repugnant.  Perhaps this entire affair wasn’t just a ritualized form of political kabuki designed to placate the anti-abortion majority in the state while not actually doing anything, in which case we should see the original ban back soon.  I’m not optimistic, though.  Isn’t it interesting to see how something that everyone supposedly supports somehow can’t make its way through the legislature, while things that everyone supposedly opposes, such as tax increases, often do.</p><p>I wonder what the justices have to do before the politicians are willing to consider reining them in.  Declare George Delano dictator-for-life?  Institute Islamic law?  Personally cuckold every politician in the country?</p></div>",
  "content_text": "From the Star Tribune:\nBy a single vote, the South Dakota Senate today killed a bill that would have banned almost all abortions in the state.  The bill, which almost certainly would have been challenged in court as unconstitutional, had passed both the House and Senate earlier, but Gov. Mike Rounds issued a “form veto,” asking that some of the bill’s language be clarified.  The Senate, which had passed the original bill on an 18-15 vote, rejected the revised measure today by 18-17…. Earlier today, the House easily approved Rounds’ proposed changes, which were designed to keep current state abortion restrictions in place if the new law was challenged in court, as expected. That vote was 54-16.\nRep. Matt McCaulley, a Sioux Falls Republican who wrote the bill with help from the Thomas More Law Center in Ann Arbor, Mich., had hoped the strict law might reach the U.S. Supreme Court and be used to overturn the court’s historic 1973 Roe v. Wade decision legalizing abortion. Some legislators with long records of opposing abortion lined up against the bill, however, fearing that a court challenge could backfire and further entrench the Roe decision.\nI hate this sort of fake pragmatism.  The notion that you can’t do the right thing – what you publicly state you believe to be the right thing – because someone might do the wrong thing down the road, is repugnant.  Perhaps this entire affair wasn’t just a ritualized form of political kabuki designed to placate the anti-abortion majority in the state while not actually doing anything, in which case we should see the original ban back soon.  I’m not optimistic, though.  Isn’t it interesting to see how something that everyone supposedly supports somehow can’t make its way through the legislature, while things that everyone supposedly opposes, such as tax increases, often do.\nI wonder what the justices have to do before the politicians are willing to consider reining them in.  Declare George Delano dictator-for-life?  Institute Islamic law?  Personally cuckold every politician in the country?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-16T15:59:00+00:00"
}