{
  "url": "https://voxday.net/2004/03/17/creative-etymology/",
  "scraped_at": "2025-12-13T15:55:09.864485",
  "title": "Creative etymology",
  "date_display": "March 17, 2004",
  "date_iso": "2004-03-17T18:53:00+00:00",
  "date_from_url": "2004-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JN writes: <em>Please help me out with the definition of, omniderigence.  As best I can determine you are the only one on the web using this word, and I can’t find it in the Oxford English Dictionary. </em></p><p>I suppose it would be hard to find in the OED, considering that I simply made it up.  I am an inveterate user of words that don’t necessarily exist, although not on the Douglas Adams level.  Speaking of which, was anyone else tremendously disappointed with <em>The Meaning of Liff</em>?  I just didn’t find the words to be very amusing.</p><p>Anyhow, I was simply searching for a word which would describe the concept of an all-acting God, a puppet master, of the sort envisioned by some Christians – relax, Manatee, I’m not reopening THAT debate – who conflate being all-knowing and all-powerful with being all-controlling in the active sense.  An omniderigent deity is one who not only knows the number of hairs on your head, but actually pulls them out, one by one, or alternatively, turns each of them grey at his specific command.  An omniderigent deity is one who not only comes up with a plan for your life, but forces you to walk every step of it.  I couldn’t find such a word, although one may exist, so I invented this from the Latin root of the verb “to guide”.</p><p>Regardless of what you believe.</p></div>",
  "content_text": "JN writes:\nPlease help me out with the definition of, omniderigence.  As best I can determine you are the only one on the web using this word, and I can’t find it in the Oxford English Dictionary.\nI suppose it would be hard to find in the OED, considering that I simply made it up.  I am an inveterate user of words that don’t necessarily exist, although not on the Douglas Adams level.  Speaking of which, was anyone else tremendously disappointed with\nThe Meaning of Liff\n?  I just didn’t find the words to be very amusing.\nAnyhow, I was simply searching for a word which would describe the concept of an all-acting God, a puppet master, of the sort envisioned by some Christians – relax, Manatee, I’m not reopening THAT debate – who conflate being all-knowing and all-powerful with being all-controlling in the active sense.  An omniderigent deity is one who not only knows the number of hairs on your head, but actually pulls them out, one by one, or alternatively, turns each of them grey at his specific command.  An omniderigent deity is one who not only comes up with a plan for your life, but forces you to walk every step of it.  I couldn’t find such a word, although one may exist, so I invented this from the Latin root of the verb “to guide”.\nRegardless of what you believe.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-17T18:53:00+00:00"
}