{
  "url": "https://voxday.net/2004/03/01/cutting-down-black-robes/",
  "scraped_at": "2025-12-13T15:52:01.280639",
  "title": "Cutting down the black robes",
  "date_display": "March 1, 2004",
  "date_iso": "2004-03-01T15:06:00+00:00",
  "date_from_url": "2004-03-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>RY writes: <em>There is much angst and hand wringing over our run-away Supreme Court. All the talking heads on talk radio ask what can be done. No one seems to know that the court’s wings can be clipped without resorting to a constitutional amendment: Article III section 2: (operative section) <strong>…In all the other cases before mentioned, the Supreme Court shall have appellate jurisdiction, both as to law and fact, with such exceptions, and under such regulations as Congress shall make.</strong> Clearly, Congress can by law set the limits on the Court’s jurisdiction. This has some important implications. Constitutional amendments are not necessary for the will of Congress and the people to be asserted. Please research Article III section 2 and it’s implications for one of your up coming articles.</em></p><p>Good point.  Definitely something to look into.</p></div>",
  "content_text": "RY writes:\nThere is much angst and hand wringing over our run-away Supreme Court. All the talking heads on talk radio ask what can be done. No one seems to know that the court’s wings can be clipped without resorting to a constitutional amendment: Article III section 2: (operative section)\n…In all the other cases before mentioned, the Supreme Court shall have appellate jurisdiction, both as to law and fact, with such exceptions, and under such regulations as Congress shall make.\nClearly, Congress can by law set the limits on the Court’s jurisdiction. This has some important implications. Constitutional amendments are not necessary for the will of Congress and the people to be asserted. Please research Article III section 2 and it’s implications for one of your up coming articles.\nGood point.  Definitely something to look into.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-01T15:06:00+00:00"
}