{
  "url": "https://voxday.net/2004/03/05/death-of-wes/",
  "scraped_at": "2025-12-13T15:52:58.297832",
  "title": "Death of the West",
  "date_display": "March 5, 2004",
  "date_iso": "2004-03-05T17:17:00+00:00",
  "date_from_url": "2004-03-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Gimli on demographics:<em> “The population of Germany at the end of the century is going to be 56 percent of what it is now. The population of France will decline to about 52 percent.”  Meanwhile, Muslim immigrants are having babies at a much faster clip, so that in time, they may become the majority population throughout Europe.  “Last year, 56 percent of the babies born in Brussels were Muslim,” Rhys-Davies notes. “In a matter of 20-50 years, we are going to see two to three countries become predominately Muslim — Holland, France, and possibly Germany.”</em></p><p>I suspect one reason for the EU’s fast push for complete control over its member states is in order to have a non-democratic mechanism in place before the Muslim vote becomes the majority in those countries.  As one of my liberal friends pointed out over dinner last night, Turkey is an interesting litmus test on this theory.  There’s no reason that Turkey should not be admitted to the EU, if the EU’s <em>raison d’etre</em> is truly economic.  We’ll see.</p></div>",
  "content_text": "Gimli on demographics:\n“The population of Germany at the end of the century is going to be 56 percent of what it is now. The population of France will decline to about 52 percent.”  Meanwhile, Muslim immigrants are having babies at a much faster clip, so that in time, they may become the majority population throughout Europe.  “Last year, 56 percent of the babies born in Brussels were Muslim,” Rhys-Davies notes. “In a matter of 20-50 years, we are going to see two to three countries become predominately Muslim — Holland, France, and possibly Germany.”\nI suspect one reason for the EU’s fast push for complete control over its member states is in order to have a non-democratic mechanism in place before the Muslim vote becomes the majority in those countries.  As one of my liberal friends pointed out over dinner last night, Turkey is an interesting litmus test on this theory.  There’s no reason that Turkey should not be admitted to the EU, if the EU’s\nraison d’etre\nis truly economic.  We’ll see.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-05T17:17:00+00:00"
}