{
  "url": "https://voxday.net/2004/03/20/did-wfb-just-get-snopesed/",
  "scraped_at": "2025-12-13T15:55:35.755378",
  "title": "Did WFB just get snopesed?",
  "date_display": "March 20, 2004",
  "date_iso": "2004-03-20T03:25:00+00:00",
  "date_from_url": "2004-03-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>WFB writes: <em>Looking back on Bush vs. Gore, Professor Joseph Olson of the Hamline University School of Law in St. Paul, Minnesota, gives us a shrewd perspective. Adding up the counties in the U.S. won by the two candidates, it was Gore 677, Bush 2,434. Taking the population of those counties, it was 143 million for Bush, 127 million for Gore. In square miles of land won, Gore 580,000, Bush 2,427,000. The murder rate in Gore counties, 13.2 per 100,000 residents, contrasted with 2.1 in the Bush counties.</em></p><p>That sounds a lot like the bogus Macalester professor, (another St. Paul university, btw), who couldn’t remember that there are 48 states, not 50.  Which is too bad, since I agreed with the conclusion of the immediately previous paragraph: <em>Democracy just doesn’t work, much of the time. </em></p><p>So let me get this straight.  According to a pillar of the Republican party, we’re killing people and sacrificing our young soldiers for something that doesn’t work most of the time?  That sounds a lot like someone stumbling gradually towards my critique of our Commander-in-Chief’s martial performance.</p><p>UPDATE: The Original Cyberpunk adds: <em>Professor Joseph Olson is real, I’ve met him many times, and yes, this story is completely bogus. Still, no matter how many times he denies it, it keeps coming back; sometimes saying he teaches law at Hamline (which he does), other times putting him on the faculty at Macalester, William Mitchell, or some other college he’s never taught at. Sometimes breaking it out by counties; sometimes by either 48 or 50 states. But it all cases this story is false, the stats are wrong, and you’d be well-advised not to repeat it because it is so easily, provably bogus.</em></p><p>Oh, how are the mighty fallen!</p></div>",
  "content_text": "WFB writes:\nLooking back on Bush vs. Gore, Professor Joseph Olson of the Hamline University School of Law in St. Paul, Minnesota, gives us a shrewd perspective. Adding up the counties in the U.S. won by the two candidates, it was Gore 677, Bush 2,434. Taking the population of those counties, it was 143 million for Bush, 127 million for Gore. In square miles of land won, Gore 580,000, Bush 2,427,000. The murder rate in Gore counties, 13.2 per 100,000 residents, contrasted with 2.1 in the Bush counties.\nThat sounds a lot like the bogus Macalester professor, (another St. Paul university, btw), who couldn’t remember that there are 48 states, not 50.  Which is too bad, since I agreed with the conclusion of the immediately previous paragraph:\nDemocracy just doesn’t work, much of the time.\nSo let me get this straight.  According to a pillar of the Republican party, we’re killing people and sacrificing our young soldiers for something that doesn’t work most of the time?  That sounds a lot like someone stumbling gradually towards my critique of our Commander-in-Chief’s martial performance.\nUPDATE: The Original Cyberpunk adds:\nProfessor Joseph Olson is real, I’ve met him many times, and yes, this story is completely bogus. Still, no matter how many times he denies it, it keeps coming back; sometimes saying he teaches law at Hamline (which he does), other times putting him on the faculty at Macalester, William Mitchell, or some other college he’s never taught at. Sometimes breaking it out by counties; sometimes by either 48 or 50 states. But it all cases this story is false, the stats are wrong, and you’d be well-advised not to repeat it because it is so easily, provably bogus.\nOh, how are the mighty fallen!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-20T03:25:00+00:00"
}