{
  "url": "https://voxday.net/2004/03/11/evil-librarian-steps-over-line/",
  "scraped_at": "2025-12-13T15:53:50.779839",
  "title": "The evil librarian steps over the line",
  "date_display": "March 11, 2004",
  "date_iso": "2004-03-11T15:16:00+00:00",
  "date_from_url": "2004-03-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Los Angeles Times reports: <em>Supreme Court Justice Ruth Bader Ginsburg has lent her name and presence to a lecture series co-sponsored by the liberal NOW Legal Defense and Education Fund, an advocacy group that often argues before the court in support of women’s rights that the justice embraces.  In January, Ginsburg gave opening remarks for the fourth installment in the Justice Ruth Bader Ginsburg Distinguished Lecture Series on Women and the Law….  Federal law says a judge or justice “shall disqualify himself in any proceeding in which his impartiality might reasonably be questioned.”  Several legal experts said Ginsburg’s ongoing affiliation with the legal activist group undercuts her appearance of impartiality.</em></p><p>When the next test of Roe v Wade appears, the pro-life attorney should demand that Ginsburg recuse herself.  That will make it a little easier for poor Justice Kennedy to follow the Constitution instead of worrying about getting ostracized at Washington cocktail parties.</p></div>",
  "content_text": "The Los Angeles Times reports:\nSupreme Court Justice Ruth Bader Ginsburg has lent her name and presence to a lecture series co-sponsored by the liberal NOW Legal Defense and Education Fund, an advocacy group that often argues before the court in support of women’s rights that the justice embraces.  In January, Ginsburg gave opening remarks for the fourth installment in the Justice Ruth Bader Ginsburg Distinguished Lecture Series on Women and the Law….  Federal law says a judge or justice “shall disqualify himself in any proceeding in which his impartiality might reasonably be questioned.”  Several legal experts said Ginsburg’s ongoing affiliation with the legal activist group undercuts her appearance of impartiality.\nWhen the next test of Roe v Wade appears, the pro-life attorney should demand that Ginsburg recuse herself.  That will make it a little easier for poor Justice Kennedy to follow the Constitution instead of worrying about getting ostracized at Washington cocktail parties.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-11T15:16:00+00:00"
}