{
  "url": "https://voxday.net/2004/03/02/fred-questions-fai/",
  "scraped_at": "2025-12-13T15:52:22.581412",
  "title": "Fred questions the faith",
  "date_display": "March 2, 2004",
  "date_iso": "2004-03-02T21:07:00+00:00",
  "date_from_url": "2004-03-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fred Reed writes: <em>The religious orthodoxy that impedes discussion of biological evolution continues with its accustomed dreadful tenacity…. The answers to these questions either lapse into a convoluted search for plausibility or else boil down to the idea that since guacamayas are as they are, their coloration must have adaptive value. That is, it is the duty of the evidence to fit the theory, rather than of the theory to fit the evidence. This is science? </em></p><p><a href=\"http://www.fredoneverything.net/FOE_Frame_Column.htm\">Another excellent column</a> from the marvelous Mr. Reed.  I’m just wondering.  Do Fred’s doubts – a marvelously meaningful word here – about evolution mean that he is yet another uneducated Christian creationist fanatic?  This is an excellent example of the growing divide between science and scientism.</p></div>",
  "content_text": "Fred Reed writes:\nThe religious orthodoxy that impedes discussion of biological evolution continues with its accustomed dreadful tenacity…. The answers to these questions either lapse into a convoluted search for plausibility or else boil down to the idea that since guacamayas are as they are, their coloration must have adaptive value. That is, it is the duty of the evidence to fit the theory, rather than of the theory to fit the evidence. This is science?\nAnother excellent column\nfrom the marvelous Mr. Reed.  I’m just wondering.  Do Fred’s doubts – a marvelously meaningful word here – about evolution mean that he is yet another uneducated Christian creationist fanatic?  This is an excellent example of the growing divide between science and scientism.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-02T21:07:00+00:00"
}