{
  "url": "https://voxday.net/2004/03/05/go-ahead-and-correct-hi/",
  "scraped_at": "2025-12-13T15:52:54.656877",
  "title": "Go ahead and correct him",
  "date_display": "March 5, 2004",
  "date_iso": "2004-03-05T16:27:00+00:00",
  "date_from_url": "2004-03-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Buck writes: <em>Here is a big thank you for the tips on flash cards for teaching my son phonics. I am having what I consider great success with them which translated means great fun. The instructions said that for a child my son’s age 2.5 not to correct him. That’s just fine as his mispronunciations are hysterical. He loves this game we play. When I get home from work he will go get his cards from his room and run up to me saying “play cards daddy play cards!” What a blast.</em></p><p>That’s great, and I’m glad he’s learning so well, but don’t be afraid of correcting him.  Don’t make a big deal of it, just say the correct pronunciation, let him repeat it once, and go on to the next one.  I remember “fiveteen” being one that took a while to go away – of course, you kind of miss it once they learn how to get it right.</p><p>At this rate, your son will be reading <strong>The Lion, The Witch and The Wardrobe</strong> by the time he’s four.  Children love to learn, they really do.  It’s only after years of sitting around in a classroom that teaches them to hate it – not that a classroom should be confused with actual learning.</p></div>",
  "content_text": "Buck writes:\nHere is a big thank you for the tips on flash cards for teaching my son phonics. I am having what I consider great success with them which translated means great fun. The instructions said that for a child my son’s age 2.5 not to correct him. That’s just fine as his mispronunciations are hysterical. He loves this game we play. When I get home from work he will go get his cards from his room and run up to me saying “play cards daddy play cards!” What a blast.\nThat’s great, and I’m glad he’s learning so well, but don’t be afraid of correcting him.  Don’t make a big deal of it, just say the correct pronunciation, let him repeat it once, and go on to the next one.  I remember “fiveteen” being one that took a while to go away – of course, you kind of miss it once they learn how to get it right.\nAt this rate, your son will be reading\nThe Lion, The Witch and The Wardrobe\nby the time he’s four.  Children love to learn, they really do.  It’s only after years of sitting around in a classroom that teaches them to hate it – not that a classroom should be confused with actual learning.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-05T16:27:00+00:00"
}