{
  "url": "https://voxday.net/2004/03/01/good-luck-with-tha-3/",
  "scraped_at": "2025-12-13T15:51:59.434802",
  "title": "Good luck with that",
  "date_display": "March 1, 2004",
  "date_iso": "2004-03-01T14:01:00+00:00",
  "date_from_url": "2004-03-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Thomas Sowell writes in the Wall Street Journal: <em>Many economic issues are complex, but sometimes a single fact will tell you all you need to know. When you know that central planners in the Soviet Union had to set 24 million prices–and keep adjusting them, relative to one another, as conditions changed–you realize that central planning did not just happen to fail. It had no chance of succeeding from the outset. It is a wholly different ball game when hundreds of millions of people individually keep track of the relatively few prices they need to know for their own decision-making in a market economy.</em></p><p>And yet my idiot Economics 101 professor – who actually wrote the textbook – said: “you plan your day, you plan your week, why on Earth would you not plan your national economy?”  He wasn’t too happy when I raised my hand and explained that the reason you would not is that the number of variables and interested parties was orders of magnitude higher, hence the Austrian concept of the impossibility of socialist calculation which had only been around for something like fifty years.  Needless to say, I was not the class pet.</p></div>",
  "content_text": "Thomas Sowell writes in the Wall Street Journal:\nMany economic issues are complex, but sometimes a single fact will tell you all you need to know. When you know that central planners in the Soviet Union had to set 24 million prices–and keep adjusting them, relative to one another, as conditions changed–you realize that central planning did not just happen to fail. It had no chance of succeeding from the outset. It is a wholly different ball game when hundreds of millions of people individually keep track of the relatively few prices they need to know for their own decision-making in a market economy.\nAnd yet my idiot Economics 101 professor – who actually wrote the textbook – said: “you plan your day, you plan your week, why on Earth would you not plan your national economy?”  He wasn’t too happy when I raised my hand and explained that the reason you would not is that the number of variables and interested parties was orders of magnitude higher, hence the Austrian concept of the impossibility of socialist calculation which had only been around for something like fifty years.  Needless to say, I was not the class pet.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-01T14:01:00+00:00"
}