{
  "url": "https://voxday.net/2004/03/12/good-luck-joe/",
  "scraped_at": "2025-12-13T15:54:06.883407",
  "title": "Good luck, Joe",
  "date_display": "March 12, 2004",
  "date_iso": "2004-03-12T16:20:00+00:00",
  "date_from_url": "2004-03-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Evangelical Outpost writes: <em>Although completely unwarranted, Hugh Hewitt has included me among an illustrious list of MilBlogs (Sgt Hook, Smash, MudvilleGazette, Blackfive, and Chief Wiggles). As he points out, my blog “ends more towards the cultural, religious, and political than the military.” That, however, will soon be changing as I just recently found out that I’m scheduled to leave for Iraq this fall. Now I’ll finally get to call myself a “warblogger” (or perhaps more fittingly, a “reconstruction blogger”).</em></p><p>Give <a href=\"http://www.evangelicaloutpost.com/\">Joe a visit</a> and wish him well in his coming deployment.  He’s a solid blogger, a Marine, and a stand-up Christian.  Here’s hoping that he’ll be able to keep blogging in Iraq, and that he’ll stay safe and well while he’s there.</p></div>",
  "content_text": "Evangelical Outpost writes:\nAlthough completely unwarranted, Hugh Hewitt has included me among an illustrious list of MilBlogs (Sgt Hook, Smash, MudvilleGazette, Blackfive, and Chief Wiggles). As he points out, my blog “ends more towards the cultural, religious, and political than the military.” That, however, will soon be changing as I just recently found out that I’m scheduled to leave for Iraq this fall. Now I’ll finally get to call myself a “warblogger” (or perhaps more fittingly, a “reconstruction blogger”).\nGive\nJoe a visit\nand wish him well in his coming deployment.  He’s a solid blogger, a Marine, and a stand-up Christian.  Here’s hoping that he’ll be able to keep blogging in Iraq, and that he’ll stay safe and well while he’s there.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-12T16:20:00+00:00"
}