{
  "url": "https://voxday.net/2004/03/27/government-and-grow/",
  "scraped_at": "2025-12-13T15:56:56.987241",
  "title": "Government and growth",
  "date_display": "March 27, 2004",
  "date_iso": "2004-03-27T07:02:00+00:00",
  "date_from_url": "2004-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While even Strange himself is no longer attempting to argue that Europe is growing nearly as fast as the United States, there’s still some debate over the historical situation.  Here’s some information I put together; I did not find the site that AA was using to be comprehensive as it was lacking key information for certain countries, especially the debt-to-GDP ratio.  But it serves as a good start for some basic comparisons, especially if one keeps in mind that the US growth is currently reported at 4.1 percent, much higher than Europe’s reported 0.4 percent for 2003 and 0.9 percent for 2002.</p><p>GDP Growth 1975 – 2000</p><p>56% – USA<br> <br>55% – UK<br> <br>43% – Italy<br> <br>40% – France<br> <br>37% – Germany<br> <br>35% – Canada</br></br></br></br></br></br></br></br></br></br></p><p>Tax Revenue % of GDP</p><p>43.7 – France<br> <br>42.0 – Italy<br> <br>38.4 – Germany<br> <br>35.1 – Canada<br> <br>34.5 – UK<br> <br>28.4 – USA</br></br></br></br></br></br></br></br></br></br></p><p>Debt % of GDP</p><p>69.0% – Eurozone<br> <br>44.2% – Canada (was 68.4% in 1996, Mulrooney or something?)<br> <br>38.6% – USA</br></br></br></br></p><p>I believe the key statistic is debt percent of GDP.  This gives us a picture of the degree of government intervention in the economy over time, which is also supported by the <a href=\"http://216.239.59.104/search?q=cache:-YRbXvLz0GMJ:www.oecd.org/dataoecd/6/63/1962227.pdf+tax+revenue+percent+of+gdp+italy&amp;hl=en&amp;ie=UTF-8\">total tax revenue</a> as a percentage of GDP.  This notion is further supported even if we examine the smaller economies, as the fastest-growing European countries, such as Malta, Ireland, and Luxembourg all have very small debt-to-GDP ratios, indicating a comparatively low level of government intervention over time.</p><p>As for Europe as a whole, its increasingly poor performance should be no great mystery.  Not only are its debt-to-GDP ratios sky high – Italy is at 106.2 percent – but the EU 15’s tax revenues as a percent of GDP have risen from 33.6 to 41.6 percent in 25 years, while the US has gone from 26.9 to 29.6 percent in the same period of time.  These are strong indications that the more government intervention in the economy, the more socialism, the slower the economic growth.  In Germany, for example, the rise of Willy Brandt’s socialists in 1969 quickly put the brakes on Germany’s economic miracle , as the average 2.8 percent growth from 1971-1980 was less than half the 5.8 percent growth of the previous decade.</p><p>There are minor anomalies.  I don’t know why Greece should be doing so well, nor why the Czech Republic should be doing so poorly.  But otherwise, the pattern holds strongly, as countries with high taxes and spending do predictably worse over time than countries with lower taxes and less spending.  This is not to say that no growth is possible at all in socialist countries, as the Soviet Union managed to successfully industrialize as did the People’s Republic of China.  But while it’s not that hard to make reasonable decisions about the “correct” number of dams and airports, the sclerosis of socialism builds over time as more and more incorrect assumptions lead to increased inefficiencies and reduced quantity of goods and services.  One need only compare a US supermarket with a European supermarket to see this aspect of moderate vs less moderate socialism in operation today.  And, of course, it would be very difficult to argue that the US is a <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=34253\">socialism-free country</a>.  It is unfortunate that no such country exists for the purposes of a clean comparison; I, for one, would be very happy to live there.</p><p><em>NOTE – I suspect the explanation for the UK’s superior growth is that during the Thatcher years, debt-to-GDP dropped to 26 percent, down from 73 percent in 1970.  However, since Labor came into power, that ratio has since risen back up to 42 percent, still very low by European standards.</em></p></div>",
  "content_text": "While even Strange himself is no longer attempting to argue that Europe is growing nearly as fast as the United States, there’s still some debate over the historical situation.  Here’s some information I put together; I did not find the site that AA was using to be comprehensive as it was lacking key information for certain countries, especially the debt-to-GDP ratio.  But it serves as a good start for some basic comparisons, especially if one keeps in mind that the US growth is currently reported at 4.1 percent, much higher than Europe’s reported 0.4 percent for 2003 and 0.9 percent for 2002.\nGDP Growth 1975 – 2000\n56% – USA\n55% – UK\n43% – Italy\n40% – France\n37% – Germany\n35% – Canada\nTax Revenue % of GDP\n43.7 – France\n42.0 – Italy\n38.4 – Germany\n35.1 – Canada\n34.5 – UK\n28.4 – USA\nDebt % of GDP\n69.0% – Eurozone\n44.2% – Canada (was 68.4% in 1996, Mulrooney or something?)\n38.6% – USA\nI believe the key statistic is debt percent of GDP.  This gives us a picture of the degree of government intervention in the economy over time, which is also supported by the\ntotal tax revenue\nas a percentage of GDP.  This notion is further supported even if we examine the smaller economies, as the fastest-growing European countries, such as Malta, Ireland, and Luxembourg all have very small debt-to-GDP ratios, indicating a comparatively low level of government intervention over time.\nAs for Europe as a whole, its increasingly poor performance should be no great mystery.  Not only are its debt-to-GDP ratios sky high – Italy is at 106.2 percent – but the EU 15’s tax revenues as a percent of GDP have risen from 33.6 to 41.6 percent in 25 years, while the US has gone from 26.9 to 29.6 percent in the same period of time.  These are strong indications that the more government intervention in the economy, the more socialism, the slower the economic growth.  In Germany, for example, the rise of Willy Brandt’s socialists in 1969 quickly put the brakes on Germany’s economic miracle , as the average 2.8 percent growth from 1971-1980 was less than half the 5.8 percent growth of the previous decade.\nThere are minor anomalies.  I don’t know why Greece should be doing so well, nor why the Czech Republic should be doing so poorly.  But otherwise, the pattern holds strongly, as countries with high taxes and spending do predictably worse over time than countries with lower taxes and less spending.  This is not to say that no growth is possible at all in socialist countries, as the Soviet Union managed to successfully industrialize as did the People’s Republic of China.  But while it’s not that hard to make reasonable decisions about the “correct” number of dams and airports, the sclerosis of socialism builds over time as more and more incorrect assumptions lead to increased inefficiencies and reduced quantity of goods and services.  One need only compare a US supermarket with a European supermarket to see this aspect of moderate vs less moderate socialism in operation today.  And, of course, it would be very difficult to argue that the US is a\nsocialism-free country\n.  It is unfortunate that no such country exists for the purposes of a clean comparison; I, for one, would be very happy to live there.\nNOTE – I suspect the explanation for the UK’s superior growth is that during the Thatcher years, debt-to-GDP dropped to 26 percent, down from 73 percent in 1970.  However, since Labor came into power, that ratio has since risen back up to 42 percent, still very low by European standards.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-27T07:02:00+00:00"
}