{
  "url": "https://voxday.net/2004/03/22/homecollege-is-coming/",
  "scraped_at": "2025-12-13T15:55:54.660973",
  "title": "Homecollege is coming",
  "date_display": "March 22, 2004",
  "date_iso": "2004-03-22T13:42:00+00:00",
  "date_from_url": "2004-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>RT writes: <em>I am now in graduate school.  They give so many readings.  I am always busy.  I keep dreaming that one day they will abolish classes and compulsory attendance.  I always think, if only I did not have to go to class, I would have so much time to study and learn.  Instead, I spend 60 hours a week doing school work or things at school.  I hardly learn anything in class.  My field is Political Science.  I teach a class.  My students’ average on the first test was 58%.  So, I had to give them extra credit because I’m a new teacher and it’s assumed to be my fault.</em></p><p>I’m actually pretty optimistic about technology eventually obviating the need for most college as well.  Let’s face it, it’s mostly an expensive way to learn how to funnel a beer and pick up venereal diseases.  There is something to be said for a transition period before going off on your own, though, as the English aristocracy used to do, although it would be a lot less expensive and probably more of a learning experience to hand an 18 year-old forty thousand dollars and tell him to take a year to do whatever he wanted, with the caveat that when that year was up, he was on his own.  A self-starter would go for that deal in a minute.  The sheep, on the other hand, will still prefer five or six years of floating around a state university and a nice load of accumulated debt.</p></div>",
  "content_text": "RT writes:\nI am now in graduate school.  They give so many readings.  I am always busy.  I keep dreaming that one day they will abolish classes and compulsory attendance.  I always think, if only I did not have to go to class, I would have so much time to study and learn.  Instead, I spend 60 hours a week doing school work or things at school.  I hardly learn anything in class.  My field is Political Science.  I teach a class.  My students’ average on the first test was 58%.  So, I had to give them extra credit because I’m a new teacher and it’s assumed to be my fault.\nI’m actually pretty optimistic about technology eventually obviating the need for most college as well.  Let’s face it, it’s mostly an expensive way to learn how to funnel a beer and pick up venereal diseases.  There is something to be said for a transition period before going off on your own, though, as the English aristocracy used to do, although it would be a lot less expensive and probably more of a learning experience to hand an 18 year-old forty thousand dollars and tell him to take a year to do whatever he wanted, with the caveat that when that year was up, he was on his own.  A self-starter would go for that deal in a minute.  The sheep, on the other hand, will still prefer five or six years of floating around a state university and a nice load of accumulated debt.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-22T13:42:00+00:00"
}