{
  "url": "https://voxday.net/2004/03/10/i-am-toesucker/",
  "scraped_at": "2025-12-13T15:53:37.272622",
  "title": "I am the Toesucker",
  "date_display": "March 10, 2004",
  "date_iso": "2004-03-10T15:08:00+00:00",
  "date_from_url": "2004-03-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dick Morris agrees with my thinking: <em>Should Kerry be re-elected in 2008, his vice president likely will become the party’s nominee in 2012, like Al Gore was in 2000. If that person wins the 2012 nomination, as history suggests, Morris writes, “that means that Hillary would be out in the cold until at least 2016 and, if the Democrat won and was re-elected, until 2020. She’ll be 73 by then.”  If Kerry were to lose re-election in 2008, his vice president would be the favorite for the top spot in 2012.</em></p><p>I argued that she would likely go for VP a while ago.  Failure costs her nothing – in this case it would be Jean Francois’ fault –  and would position her nicely for the next go-round.  While America’s favorite gigolo does have a chance to win, I don’t think that he will win at the end of the day since there are enough War and Gay Marriage Bush Democrats to make up for the many libertarians and disenchanted ex-Republican conservatives who will be voting third party.</p></div>",
  "content_text": "Dick Morris agrees with my thinking:\nShould Kerry be re-elected in 2008, his vice president likely will become the party’s nominee in 2012, like Al Gore was in 2000. If that person wins the 2012 nomination, as history suggests, Morris writes, “that means that Hillary would be out in the cold until at least 2016 and, if the Democrat won and was re-elected, until 2020. She’ll be 73 by then.”  If Kerry were to lose re-election in 2008, his vice president would be the favorite for the top spot in 2012.\nI argued that she would likely go for VP a while ago.  Failure costs her nothing – in this case it would be Jean Francois’ fault –  and would position her nicely for the next go-round.  While America’s favorite gigolo does have a chance to win, I don’t think that he will win at the end of the day since there are enough War and Gay Marriage Bush Democrats to make up for the many libertarians and disenchanted ex-Republican conservatives who will be voting third party.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-10T15:08:00+00:00"
}