{
  "url": "https://voxday.net/2004/03/29/i-dont-feel-safe-how-about-you-frank/",
  "scraped_at": "2025-12-13T15:57:15.546679",
  "title": "I don’t feel safe, how about you, Frank?",
  "date_display": "March 29, 2004",
  "date_iso": "2004-03-29T16:38:00+00:00",
  "date_from_url": "2004-03-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Drudge: <em>It’s a groundbreaking court decision that legal experts say will affect everyone: Police officers in Louisiana no longer need a search or arrest warrant to conduct a brief search of your home or business.  Leaders in law enforcement say it will keep officers safe, but others argue it’s a privilege that could be abused. The decision in United States v. Kelly Gould, No. 0230629cr0, was made March 24 by the New Orleans-based 5th Circuit Court of Appeals. Two dissenting judges called it the “road to Hell.”  The ruling stems from a lawsuit filed in Denham Springs in 2000.</em></p><p>New Orleans Police Department spokesman Capt. Marlon Defillo said the new power will go into effect immediately. “We have to have a legitimate problem to be there in the first place, and if we don’t, we can’t conduct the search,” Defillo said. But former U.S. Attorney Julian Murray said the ruling is problematic.  “I think it goes way too far,” Murray said, noting that the searches can be performed if an officer fears for his safety.</p><p>Freedom is just another word for something the government took away from you.  I don’t know why the Bush administration passed the Patriot Act.  All they needed to do was wait around and have federal judges create it for them.  I imagine it won’t be long before the only person you are permitted to legally marry is a same-sex Nazi police officer, who can decide to end your suffering and allow you to die with dignity whenever it suits him.</p><p>“But Frank, it’s just a hangnail!”<br> <br>“Sorry, Ralph, I just can’t bear to see you like this.  Heil Klinton!”</br></br></p></div>",
  "content_text": "From Drudge:\nIt’s a groundbreaking court decision that legal experts say will affect everyone: Police officers in Louisiana no longer need a search or arrest warrant to conduct a brief search of your home or business.  Leaders in law enforcement say it will keep officers safe, but others argue it’s a privilege that could be abused. The decision in United States v. Kelly Gould, No. 0230629cr0, was made March 24 by the New Orleans-based 5th Circuit Court of Appeals. Two dissenting judges called it the “road to Hell.”  The ruling stems from a lawsuit filed in Denham Springs in 2000.\nNew Orleans Police Department spokesman Capt. Marlon Defillo said the new power will go into effect immediately. “We have to have a legitimate problem to be there in the first place, and if we don’t, we can’t conduct the search,” Defillo said. But former U.S. Attorney Julian Murray said the ruling is problematic.  “I think it goes way too far,” Murray said, noting that the searches can be performed if an officer fears for his safety.\nFreedom is just another word for something the government took away from you.  I don’t know why the Bush administration passed the Patriot Act.  All they needed to do was wait around and have federal judges create it for them.  I imagine it won’t be long before the only person you are permitted to legally marry is a same-sex Nazi police officer, who can decide to end your suffering and allow you to die with dignity whenever it suits him.\n“But Frank, it’s just a hangnail!”\n“Sorry, Ralph, I just can’t bear to see you like this.  Heil Klinton!”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-29T15:38:00+00:00"
}