{
  "url": "https://voxday.net/2004/03/03/i-will-bury-you-said-mouse-to-elephan/",
  "scraped_at": "2025-12-13T15:52:29.960805",
  "title": "I will bury you, said the mouse to the elephant",
  "date_display": "March 3, 2004",
  "date_iso": "2004-03-03T14:46:00+00:00",
  "date_from_url": "2004-03-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The New York Post reports on Air America: <em>The line-up will pit the new network’s talkers directly against the biggest names in radio.  Franken is expected to air at noon and go toe-to-toe with Rush Limbaugh, who has a 15 million-listener head start.  South Florida liberal Randi Rhodes will follow Franken and be up against Sean Hannity (WABC), Bill O’Reilly and Bob Grant (both on WOR) in New York.  She told her West Palm Beach listeners this week that she plans to “bury” Hannity and Grant.  Garofalo is the network’s choice for 8 to 11 p.m., Post sources say. Robert Kennedy, Jr. will host a weekend slot. </em></p><p>I am seriously anticipating the debut of Air America.  I predict it will crash and burn in a more spectacular manner than the Hindenburg.  Ozzy’s dead guitarist Randy Rhoads has a better chance to beat out Hannity than does this woman.  I can’t wait to hear the explanations of how America is too stupid to support their moral superiors.</p></div>",
  "content_text": "The New York Post reports on Air America:\nThe line-up will pit the new network’s talkers directly against the biggest names in radio.  Franken is expected to air at noon and go toe-to-toe with Rush Limbaugh, who has a 15 million-listener head start.  South Florida liberal Randi Rhodes will follow Franken and be up against Sean Hannity (WABC), Bill O’Reilly and Bob Grant (both on WOR) in New York.  She told her West Palm Beach listeners this week that she plans to “bury” Hannity and Grant.  Garofalo is the network’s choice for 8 to 11 p.m., Post sources say. Robert Kennedy, Jr. will host a weekend slot.\nI am seriously anticipating the debut of Air America.  I predict it will crash and burn in a more spectacular manner than the Hindenburg.  Ozzy’s dead guitarist Randy Rhoads has a better chance to beat out Hannity than does this woman.  I can’t wait to hear the explanations of how America is too stupid to support their moral superiors.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-03T14:46:00+00:00"
}