{
  "url": "https://voxday.net/2004/03/05/i-wouldnt-be-so-sure/",
  "scraped_at": "2025-12-13T15:52:52.834155",
  "title": "I wouldn’t be so sure",
  "date_display": "March 5, 2004",
  "date_iso": "2004-03-05T15:26:00+00:00",
  "date_from_url": "2004-03-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David Limbaugh writes: <em>The Democrats’ unity and the motivation of their base presents a problem for the GOP, which is exacerbated by the restlessness of its own base, some of which has been appreciably alienated by Bush’s gravitation to the left on education, campaign finance reform, trade, overall domestic spending and immigration, to name a few.  I don’t think too many of these disaffected conservatives are irretrievable.</em></p><p>One of these days conservatives will stop falling for the “at least we’re not the Democrats” argument.  Perhaps it will be in 2004, perhaps not, but it won’t work forever.  The Law of the Sea Treaty is only the latest abomination that George Delano has embraced – of the five most important issues that I see, there is only a slight difference between Bush and Kerry on one of them.</p><p>But at least Mr. Limbaugh recognizes the truth of George Delano’s governing philosophy, when he admits: <em>Within no time at all, the Democrats were back to hating George Bush as usual, even though he extended numerous olive branches to them and was implementing much of their domestic agenda.</em></p><p>So, we have a Republican president, Republican House and Republican Senate, and they devote themselves to implementing a Democratic domestic agenda.  Interesting.</p></div>",
  "content_text": "David Limbaugh writes:\nThe Democrats’ unity and the motivation of their base presents a problem for the GOP, which is exacerbated by the restlessness of its own base, some of which has been appreciably alienated by Bush’s gravitation to the left on education, campaign finance reform, trade, overall domestic spending and immigration, to name a few.  I don’t think too many of these disaffected conservatives are irretrievable.\nOne of these days conservatives will stop falling for the “at least we’re not the Democrats” argument.  Perhaps it will be in 2004, perhaps not, but it won’t work forever.  The Law of the Sea Treaty is only the latest abomination that George Delano has embraced – of the five most important issues that I see, there is only a slight difference between Bush and Kerry on one of them.\nBut at least Mr. Limbaugh recognizes the truth of George Delano’s governing philosophy, when he admits:\nWithin no time at all, the Democrats were back to hating George Bush as usual, even though he extended numerous olive branches to them and was implementing much of their domestic agenda.\nSo, we have a Republican president, Republican House and Republican Senate, and they devote themselves to implementing a Democratic domestic agenda.  Interesting.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-05T15:26:00+00:00"
}