{
  "url": "https://voxday.net/2004/03/15/idiot-tourist-tragedy/",
  "scraped_at": "2025-12-13T15:54:42.418310",
  "title": "Idiot tourist tragedy",
  "date_display": "March 15, 2004",
  "date_iso": "2004-03-15T21:10:00+00:00",
  "date_from_url": "2004-03-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Star Tribune: <em>John Petters, 21, of Wayzata was stabbed to death Saturday in Florence after he and the woman he was with followed another woman through a gate and into the park of her villa as she returned home from a nightclub, a Florence prosecutor said…. The 27-year-old woman whom Petters and his friend followed through the gate told them they should not be there. When they didn’t leave, she called her father, who tried to make them leave before pulling out a knife and stabbing Petters around 4:30 a.m., Caleca said.  Petters and his friend “didn’t understand Italian,” and the alleged attacker and his daughter spoke Italian during the confrontation because they didn’t realize the intruders were Americans, he said.</em></p><p>What a stupid waste.  It reminds me of when a Japanese kid was blown away trying to go to a Halloween party at the wrong house.  I’ve lived overseas enough to be well-practiced in spotting idiot tourists, or as I’ve heard them called, the white-shoes, but this was just so unnecessary.  Obviously, most idiot tourism isn’t fatal, but here’s a few basic pointers to make one’s European trip a little more pleasant for everyone – not that anyone is planning one after last Thursday’s bombings.</p><p>1.  Bring at least $50 of money for each country you’re planning on traveling through.  If your expat friends wanted to run a bank, they’d have started one.  And no, you can’t always find an ATM or a bank to exchange traveller’s checks.</p><p>2.  Don’t wear tennis shoes.  There are plenty of rubber-soled dark shoes out there.  Buy a pair.  And bag the jeans too.  Women, wear skirts; European women tend to actually dress like women, not quasi-males.  This year’s color: frosty pink.</p><p>3.  It takes about half a second to cut through a belly-pouch.  Why not just stamp “I’m a tourist, rob me” on your forehead instead?</p><p>4.  Don’t wander around a strange city at 4 in the morning.  Would you wander around Detroit then?  Do you know where Norway’s Detroit is?  Neither do I, but I’m sure they’ve got one.</p><p>5.  Learn how to say: “Hello”, “please”, “thank you” and “I’m sorry, I don’t speak X.”  It’s the least you can do.  It could even save your life.</p><p>6.  Everyone does not, in fact, speak English.</p><p>7.  Talking louder and slower does not actually help someone who doesn’t speak English understand it. <em>CAPIREBBE PIU MEGLIO SE PARLO MOLTO LENTO</em>?  I didn’t think so.</p></div>",
  "content_text": "From the Star Tribune:\nJohn Petters, 21, of Wayzata was stabbed to death Saturday in Florence after he and the woman he was with followed another woman through a gate and into the park of her villa as she returned home from a nightclub, a Florence prosecutor said…. The 27-year-old woman whom Petters and his friend followed through the gate told them they should not be there. When they didn’t leave, she called her father, who tried to make them leave before pulling out a knife and stabbing Petters around 4:30 a.m., Caleca said.  Petters and his friend “didn’t understand Italian,” and the alleged attacker and his daughter spoke Italian during the confrontation because they didn’t realize the intruders were Americans, he said.\nWhat a stupid waste.  It reminds me of when a Japanese kid was blown away trying to go to a Halloween party at the wrong house.  I’ve lived overseas enough to be well-practiced in spotting idiot tourists, or as I’ve heard them called, the white-shoes, but this was just so unnecessary.  Obviously, most idiot tourism isn’t fatal, but here’s a few basic pointers to make one’s European trip a little more pleasant for everyone – not that anyone is planning one after last Thursday’s bombings.\n1.  Bring at least $50 of money for each country you’re planning on traveling through.  If your expat friends wanted to run a bank, they’d have started one.  And no, you can’t always find an ATM or a bank to exchange traveller’s checks.\n2.  Don’t wear tennis shoes.  There are plenty of rubber-soled dark shoes out there.  Buy a pair.  And bag the jeans too.  Women, wear skirts; European women tend to actually dress like women, not quasi-males.  This year’s color: frosty pink.\n3.  It takes about half a second to cut through a belly-pouch.  Why not just stamp “I’m a tourist, rob me” on your forehead instead?\n4.  Don’t wander around a strange city at 4 in the morning.  Would you wander around Detroit then?  Do you know where Norway’s Detroit is?  Neither do I, but I’m sure they’ve got one.\n5.  Learn how to say: “Hello”, “please”, “thank you” and “I’m sorry, I don’t speak X.”  It’s the least you can do.  It could even save your life.\n6.  Everyone does not, in fact, speak English.\n7.  Talking louder and slower does not actually help someone who doesn’t speak English understand it.\nCAPIREBBE PIU MEGLIO SE PARLO MOLTO LENTO\n?  I didn’t think so.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-15T21:10:00+00:00"
}