{
  "url": "https://voxday.net/2004/03/21/ignore-acrony/",
  "scraped_at": "2025-12-13T15:55:38.734364",
  "title": "Ignore the acronym",
  "date_display": "March 21, 2004",
  "date_iso": "2004-03-21T00:09:00+00:00",
  "date_from_url": "2004-03-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A new Linux distro.  I can hear the tank drivers moaning – not another one!  But the truth of the matter is that none of the existing distros are focused on what, to many, is one of the most important aspects to computers, namely, games.  After some discussion on Linux World and Slashdot, I’ve decided to get involved with GBLD.net, which is not a gay-bisexual-lesbian-deviant forum, but rather shorthand for the Games-Based Linux Distribution.  As one of the project goals is to produce an original, Linux-based game, I’ve decided to return to the world of game design by heading up the Game Team.  I know some of you here are gamers, so below is a message I posted on the forums.  Please feel free to get involved if you’re so inclined, and keep in mind that unlike most such projects, we aren’t starting from scratch as I have access to a fair bit of game code and game art that will serve as a nice starting point.</p><p>————–</p><p>I’d like to lay out what I feel are the primary needs of the Game Team. I’m interested in hearing from those interested in joining the team; my email is vday@worldnetdaily.com, please put GAME TEAM in the subject header.</p><p>The three most important GT needs – aside from the Lead Programmer who will report to Ian, not me – are a producer, a designer and an art director. While I can and have performed the first two roles in the past, I will be focusing solely on design responsibilities.</p><p>Interested individuals wanting to join the GT but not wishing to fill one of the three aforementioned roles should send me information pertaining to the following:</p><p><strong>Group:</strong> Programming, Art, Sound &amp; Story<br> <br><strong><br> <br>Experience:</br></br></strong> none is absolutely necessary, except for the lead responsibilities. I’m hoping to assign an assistant, perhaps two, to each Group leader in order to provide experience to newcomers. But if you’ve got some related to the activity of your Group, let me know what it is.</br></br></p><p><strong>Hours per month:</strong> how many are you willing and able to contribute? This is something we’re doing for fun, but everyone joining the team will be held accountable for completing the tasks assigned. Since many people are interested in contributing to this project, I will not hesitate to replace anyone who consistently fails to perform their responsibilities. If you’re just interested in shooting the breeze and talking about your ideas, feel free to post away in the forum.</p></div>",
  "content_text": "A new Linux distro.  I can hear the tank drivers moaning – not another one!  But the truth of the matter is that none of the existing distros are focused on what, to many, is one of the most important aspects to computers, namely, games.  After some discussion on Linux World and Slashdot, I’ve decided to get involved with GBLD.net, which is not a gay-bisexual-lesbian-deviant forum, but rather shorthand for the Games-Based Linux Distribution.  As one of the project goals is to produce an original, Linux-based game, I’ve decided to return to the world of game design by heading up the Game Team.  I know some of you here are gamers, so below is a message I posted on the forums.  Please feel free to get involved if you’re so inclined, and keep in mind that unlike most such projects, we aren’t starting from scratch as I have access to a fair bit of game code and game art that will serve as a nice starting point.\n————–\nI’d like to lay out what I feel are the primary needs of the Game Team. I’m interested in hearing from those interested in joining the team; my email is vday@worldnetdaily.com, please put GAME TEAM in the subject header.\nThe three most important GT needs – aside from the Lead Programmer who will report to Ian, not me – are a producer, a designer and an art director. While I can and have performed the first two roles in the past, I will be focusing solely on design responsibilities.\nInterested individuals wanting to join the GT but not wishing to fill one of the three aforementioned roles should send me information pertaining to the following:\nGroup:\nProgramming, Art, Sound & Story\nExperience:\nnone is absolutely necessary, except for the lead responsibilities. I’m hoping to assign an assistant, perhaps two, to each Group leader in order to provide experience to newcomers. But if you’ve got some related to the activity of your Group, let me know what it is.\nHours per month:\nhow many are you willing and able to contribute? This is something we’re doing for fun, but everyone joining the team will be held accountable for completing the tasks assigned. Since many people are interested in contributing to this project, I will not hesitate to replace anyone who consistently fails to perform their responsibilities. If you’re just interested in shooting the breeze and talking about your ideas, feel free to post away in the forum.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-21T00:09:00+00:00"
}