{
  "url": "https://voxday.net/2004/03/02/industry-of-leaders/",
  "scraped_at": "2025-12-13T15:52:17.052110",
  "title": "An industry of leaders",
  "date_display": "March 2, 2004",
  "date_iso": "2004-03-02T16:26:00+00:00",
  "date_from_url": "2004-03-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Quasi in Rem writes: <em>Spurred by the success of Mel Gibson’s recent movie “The Passion of Christ” <a href=\"http://quasi-in-rem.blogspot.com/2004_03_01_quasi-in-rem_archive.html#107819671707596589\">studios have begun to target the massive audience </a>who apparently desire to see movies which are accused of being anti-semitic. Through six days in theatres Mel Gibson’s “Passion of Christ” has grossed over $125 million. MGM has jumped on the band wagon first and completely re-edited and over-dubbed “Cody Banks II: Destination London”…. MGM was in a rush to get the movie out into theatres in order to compete with other purportedly anti-semitic fare from the major studios. Disney’s Shrek II has been recently subtitled “The Truth about the so-called “Holocaust,” opens on Memorial Day weekend. Similarly Paramount plans to re-release “Schindler’s List” this summmer with an added laugh track and an entirely new “feel good” ending. </em></p><p>I just about wet my pants when I read this.  It perfectly captures and lampoons the way in which Hollywood and the secular press has misread the movie.  Of course, the only real surprise about <strong>The Passion of the Christ</strong> besides its overwhelming success is that Hollywood didn’t have a second version coming out in three months, one that revolves more around John’s perspective instead of Mary’s.</p></div>",
  "content_text": "Quasi in Rem writes:\nSpurred by the success of Mel Gibson’s recent movie “The Passion of Christ”\nstudios have begun to target the massive audience\nwho apparently desire to see movies which are accused of being anti-semitic. Through six days in theatres Mel Gibson’s “Passion of Christ” has grossed over $125 million. MGM has jumped on the band wagon first and completely re-edited and over-dubbed “Cody Banks II: Destination London”…. MGM was in a rush to get the movie out into theatres in order to compete with other purportedly anti-semitic fare from the major studios. Disney’s Shrek II has been recently subtitled “The Truth about the so-called “Holocaust,” opens on Memorial Day weekend. Similarly Paramount plans to re-release “Schindler’s List” this summmer with an added laugh track and an entirely new “feel good” ending.\nI just about wet my pants when I read this.  It perfectly captures and lampoons the way in which Hollywood and the secular press has misread the movie.  Of course, the only real surprise about\nThe Passion of the Christ\nbesides its overwhelming success is that Hollywood didn’t have a second version coming out in three months, one that revolves more around John’s perspective instead of Mary’s.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-02T16:26:00+00:00"
}