{
  "url": "https://voxday.net/2004/03/18/is-homecollege-nex/",
  "scraped_at": "2025-12-13T15:55:15.353832",
  "title": "Is homecollege next?",
  "date_display": "March 18, 2004",
  "date_iso": "2004-03-18T21:44:00+00:00",
  "date_from_url": "2004-03-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Original Cyberpunk observes: <em>I’ve run into this so often lately that I’m beginning to call it the Minneapolis Mindset.  It works like this:  talk to someone from Minneapolis about the Iraq war, and they’ll tell you the war was completely unnecessary and we should have given the economic sanctions and UN inspections more time to work.  Talk to them about terrorism, and they’ll tell you that the answer is not more violence but understanding and removing the root (social) causes of terrorism.  Talk to them about _concealed carry_, and suddenly they’re in an absolute and unreasoning state of panic and babbling on about shootouts in the streets.</em></p><p>Ergo, my question:  What kind of cognitive dissonance is required to believe that proven homicidal dictators and mass-murdering terrorists will become reasonable people if given half a chance, while simultaneously believing that your friends, relatives, and neighbors, whom you’ve known all your life, will become bloodthirsty killers if given half a chance?</p><p>The answer is simple.  Perceived personal security trumps all.  They believe – wrongly – that their personal security will be enhanced by leaving totalitarian murderers free to amuse themselves by butchering their foreign victims while fearing their government doing anything that might bring them, personally, to the attention of said murderers.  This may be true in the short term, it is definitely false in the long term.  They also believe – again wrongly – that concealed carry will likely lead to shootouts and whatnot in their immediate vicinity, and therefore must be prevented as they imagine it could put them about personal risk.  It’s all about the vicinity.  If the terrorists ever go to work in their vicinity, they will, of course, scream for precisely the very sort of thing that they’re opposing so vehemently now.  The ME generation strikes again.</p><p>You don’t have to have a graduate degree to think like this, but it helps.  It’s certainly not logic that anyone comes by honestly.  I heard a CEO say the other day that if everything else is pretty equal, he’ll always hire the guy without the degree.  His words, as I recall them: “I don’t know what they’re learning in college these days, but a lot of these guys with degrees are useless when it comes to basic sales and marketing, doing the real work.”</p></div>",
  "content_text": "The Original Cyberpunk observes:\nI’ve run into this so often lately that I’m beginning to call it the Minneapolis Mindset.  It works like this:  talk to someone from Minneapolis about the Iraq war, and they’ll tell you the war was completely unnecessary and we should have given the economic sanctions and UN inspections more time to work.  Talk to them about terrorism, and they’ll tell you that the answer is not more violence but understanding and removing the root (social) causes of terrorism.  Talk to them about _concealed carry_, and suddenly they’re in an absolute and unreasoning state of panic and babbling on about shootouts in the streets.\nErgo, my question:  What kind of cognitive dissonance is required to believe that proven homicidal dictators and mass-murdering terrorists will become reasonable people if given half a chance, while simultaneously believing that your friends, relatives, and neighbors, whom you’ve known all your life, will become bloodthirsty killers if given half a chance?\nThe answer is simple.  Perceived personal security trumps all.  They believe – wrongly – that their personal security will be enhanced by leaving totalitarian murderers free to amuse themselves by butchering their foreign victims while fearing their government doing anything that might bring them, personally, to the attention of said murderers.  This may be true in the short term, it is definitely false in the long term.  They also believe – again wrongly – that concealed carry will likely lead to shootouts and whatnot in their immediate vicinity, and therefore must be prevented as they imagine it could put them about personal risk.  It’s all about the vicinity.  If the terrorists ever go to work in their vicinity, they will, of course, scream for precisely the very sort of thing that they’re opposing so vehemently now.  The ME generation strikes again.\nYou don’t have to have a graduate degree to think like this, but it helps.  It’s certainly not logic that anyone comes by honestly.  I heard a CEO say the other day that if everything else is pretty equal, he’ll always hire the guy without the degree.  His words, as I recall them: “I don’t know what they’re learning in college these days, but a lot of these guys with degrees are useless when it comes to basic sales and marketing, doing the real work.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-18T21:44:00+00:00"
}