{
  "url": "https://voxday.net/2004/03/17/its-so-much-easier-to-point-fingers-a/",
  "scraped_at": "2025-12-13T15:55:02.520535",
  "title": "It’s so much easier to point fingers at the past",
  "date_display": "March 17, 2004",
  "date_iso": "2004-03-17T16:33:00+00:00",
  "date_from_url": "2004-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Rutherford Institute: <em>In February 2002, the Plainville, NJ, police raided a house after receiving a tip about illegal aliens operating an underground brothel. What the police found were four Mexican girls between the ages of 14 and 17 who were in this country illegally. However, the young girls were not prostitutes, performing sexual acts for money. Instead, they were, like thousands of other women in this country, sex slaves—captives to the sex traffickers and keepers who control their every move.  What the police discovered astounded them. It was “a squalid, land-based equivalent of a 19th-century slave ship”….  The New Jersey brothel is just one of many stash houses and apartments that form a slave trade operation that stretches across the United States. Many are located in major cities such as New York, Los Angeles, Atlanta and Chicago, where under-age girls and young women from dozens of countries are trafficked and held captive.</em></p><p>This is why I despise blacks who whine on and on about slavery that never happened to them, their parents or their grandparents.  Or, for that matter, Jews who whine about Jews getting killed in medieval pogroms more than 500 years ago.  Boo-freaking-hoo.  It’s over, it’s done and it didn’t happen to you or anyone you know, meanwhile, none of these career victims give a damn that Mexican, Asian and Eastern European girls are enslaved, that missionaries feeding the poor are being murdered or that black Arican Christians are being killed right now.</p><p>The Holocaust, yes, that’s a legitimate issue.  But don’t go pointing fingers at the American Christians who ended it, take it up with the European Socialists who committed it.  Or, better yet, the Arab theocrats who hope to revive it.  As usual, it’s primarily Christians who are working to stop these evils, as has been the case ever since they led the charge to abolish slavery.</p><p>But we’re the threat to civilized society.  Right.</p></div>",
  "content_text": "From the Rutherford Institute:\nIn February 2002, the Plainville, NJ, police raided a house after receiving a tip about illegal aliens operating an underground brothel. What the police found were four Mexican girls between the ages of 14 and 17 who were in this country illegally. However, the young girls were not prostitutes, performing sexual acts for money. Instead, they were, like thousands of other women in this country, sex slaves—captives to the sex traffickers and keepers who control their every move.  What the police discovered astounded them. It was “a squalid, land-based equivalent of a 19th-century slave ship”….  The New Jersey brothel is just one of many stash houses and apartments that form a slave trade operation that stretches across the United States. Many are located in major cities such as New York, Los Angeles, Atlanta and Chicago, where under-age girls and young women from dozens of countries are trafficked and held captive.\nThis is why I despise blacks who whine on and on about slavery that never happened to them, their parents or their grandparents.  Or, for that matter, Jews who whine about Jews getting killed in medieval pogroms more than 500 years ago.  Boo-freaking-hoo.  It’s over, it’s done and it didn’t happen to you or anyone you know, meanwhile, none of these career victims give a damn that Mexican, Asian and Eastern European girls are enslaved, that missionaries feeding the poor are being murdered or that black Arican Christians are being killed right now.\nThe Holocaust, yes, that’s a legitimate issue.  But don’t go pointing fingers at the American Christians who ended it, take it up with the European Socialists who committed it.  Or, better yet, the Arab theocrats who hope to revive it.  As usual, it’s primarily Christians who are working to stop these evils, as has been the case ever since they led the charge to abolish slavery.\nBut we’re the threat to civilized society.  Right.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-17T16:33:00+00:00"
}