{
  "url": "https://voxday.net/2004/03/16/its-small-but-its-starting/",
  "scraped_at": "2025-12-13T15:54:58.881219",
  "title": "It’s small but it’s starting",
  "date_display": "March 16, 2004",
  "date_iso": "2004-03-16T22:37:00+00:00",
  "date_from_url": "2004-03-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Drudge: <em>Some 150 ultra-nationalists rallied in central Moscow on Tuesday to denounce what they called “the invasion of Russia” by foreigners and ethnic minorities.  The sanctioned demonstration in front of Moscow’s historic Gorky park was ostensibly staged to mourn the victims of a February 6 Moscow subway bombing that killed 41 commuters. The attack was blamed on rebels from Chechnya.  “Moscow is a Russian city. Russia for Russians. Moscow for Muscovites,” the group, made up predominantly of teenagers, chanted.  “Say no to registration (for foreigners), says yes to deportation,” read one banner.  The ultra-nationalist protest was led by the fringe Nationalist Patriotic Party (NPP) and Movement Against Illegal Immigrants.  “It was not ethnic Russians who blew up the metro,” said NPP leader Alexander Sevastyanov.</em></p><p>The media is going to have a hard time fitting this into their usual spectrum, as Europeans of Left and Right begin to turn “ultra-nationalist” in response to the Islamic terrorists setting off bombs in their capitals.  The tide has already begun to turn in Holland, and I expect it will not be pretty in countries like Germany and France.  France, particularly, has shown that it has no qualms about treating Muslims badly, as 70,000 dead Algerians could testify.  This is precisely the sort of thing I was predicting last night on the radio show.  I don’t expect the fringe parties to remain fringe parties for long, unless their policies are co-opted by the major parties.</p></div>",
  "content_text": "From Drudge:\nSome 150 ultra-nationalists rallied in central Moscow on Tuesday to denounce what they called “the invasion of Russia” by foreigners and ethnic minorities.  The sanctioned demonstration in front of Moscow’s historic Gorky park was ostensibly staged to mourn the victims of a February 6 Moscow subway bombing that killed 41 commuters. The attack was blamed on rebels from Chechnya.  “Moscow is a Russian city. Russia for Russians. Moscow for Muscovites,” the group, made up predominantly of teenagers, chanted.  “Say no to registration (for foreigners), says yes to deportation,” read one banner.  The ultra-nationalist protest was led by the fringe Nationalist Patriotic Party (NPP) and Movement Against Illegal Immigrants.  “It was not ethnic Russians who blew up the metro,” said NPP leader Alexander Sevastyanov.\nThe media is going to have a hard time fitting this into their usual spectrum, as Europeans of Left and Right begin to turn “ultra-nationalist” in response to the Islamic terrorists setting off bombs in their capitals.  The tide has already begun to turn in Holland, and I expect it will not be pretty in countries like Germany and France.  France, particularly, has shown that it has no qualms about treating Muslims badly, as 70,000 dead Algerians could testify.  This is precisely the sort of thing I was predicting last night on the radio show.  I don’t expect the fringe parties to remain fringe parties for long, unless their policies are co-opted by the major parties.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-16T22:37:00+00:00"
}