{
  "url": "https://voxday.net/2004/03/30/joy-of-public-schoo/",
  "scraped_at": "2025-12-13T15:57:22.844355",
  "title": "The joy of public school",
  "date_display": "March 30, 2004",
  "date_iso": "2004-03-30T08:22:00+00:00",
  "date_from_url": "2004-03-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Malaysia: <em>Police have arrested 14 Fifth Formers to help investigations into the death of Mohd Farid Ibrahim (left) of Sekolah Menengah Agama Dato Klana Petra Maamor in Ampangan.  Farid, 16, of Taman Desa Anggerik, Senawang, was found sprawled in a toilet of the school about 4pm, bleeding profusely from head injuries. A school warden took him to the Seremban Hospital, where he died about 30 minutes after admission. A school clerk lodged a police report last night, stating that Farid had fallen in the toilet, but police found bruises on his head, right ear and abdomen….  Farid’s uncle, Mohd Marzuki Ishak, 52, said his nephew had complained of constant ragging and bullying at the school since enrolling there a month ago, and had wanted to be transferred to another school.</em></p><p>The evils of public school aren’t caused by bad teachers or inept principals, they are endemic and inherent to the very nature of the classroom.  They aren’t even necessarily limited to the public schools per se, although it is there that they see their fullest flowering.  The end results of same-age classroom education become disturbingly similar over time, across racial, class and linguistic boundaries.  This Malaysian beating is just another anecdote, of course, but you’d be surprised at how the debates over the dismal state of education in England and Switzerland, to give two examples, sound almost exactly like the debates in the USA.</p></div>",
  "content_text": "From Malaysia:\nPolice have arrested 14 Fifth Formers to help investigations into the death of Mohd Farid Ibrahim (left) of Sekolah Menengah Agama Dato Klana Petra Maamor in Ampangan.  Farid, 16, of Taman Desa Anggerik, Senawang, was found sprawled in a toilet of the school about 4pm, bleeding profusely from head injuries. A school warden took him to the Seremban Hospital, where he died about 30 minutes after admission. A school clerk lodged a police report last night, stating that Farid had fallen in the toilet, but police found bruises on his head, right ear and abdomen….  Farid’s uncle, Mohd Marzuki Ishak, 52, said his nephew had complained of constant ragging and bullying at the school since enrolling there a month ago, and had wanted to be transferred to another school.\nThe evils of public school aren’t caused by bad teachers or inept principals, they are endemic and inherent to the very nature of the classroom.  They aren’t even necessarily limited to the public schools per se, although it is there that they see their fullest flowering.  The end results of same-age classroom education become disturbingly similar over time, across racial, class and linguistic boundaries.  This Malaysian beating is just another anecdote, of course, but you’d be surprised at how the debates over the dismal state of education in England and Switzerland, to give two examples, sound almost exactly like the debates in the USA.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-30T07:22:00+00:00"
}