{
  "url": "https://voxday.net/2004/03/22/linux-game-distro-leader-sends/",
  "scraped_at": "2025-12-13T15:55:51.027665",
  "title": "The Linux Game Distro leader sends greetings",
  "date_display": "March 22, 2004",
  "date_iso": "2004-03-22T03:47:00+00:00",
  "date_from_url": "2004-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bon writes: Well Vox, It would be rude for me not to pop by! I’m impressed your readers here seem quite behind the project overall, and I hope we can encorage some of them to join us on <a href=\"http://www.gbld.net\">GBLD</a>.  TZ said: “I hope they do it so that it is bootable (insert disk, hit reset, wait a few seconds, play), and that it comes in multiple flavors (PPC for mac users, Sharp Zaurus?), and they come up with a standard API (so I could clone it for MacOS/Quartz).”  We are aiming a bootable CD that runs on PC, PS2 and X-Box.  Mac implementation would be great, but I think the team could use some help on that, are you avaliable to help TZ?</p><p>We are developing a Knoppix-style disc, and including some existing games. However, I am very proud that Vox is supporting the other aim of the project, which is to develop a new ‘killer’ game. Maybe, if we can come up with a must-have game, we will draw people to Linux. If we can run that same code on PC/PS2/MAC/X-Box then we can show game studios a way to reduce dev costs, and bring new users to Linux. My other reason for the project is to bring new programmers. Whilst I grew up using the Sinclair Spec48, the Commodore64 and so on, it was easy to break into a game and see how it worked. I learned to program that way, but today with licensed development platforms, young people don’t get that chance. Everything GBLD does will be published in source as well, so young people get a chance to learn as well.</p><p>The must-have game will draw people and get them talking. Maybe though, we will be able to help people learn about programming and make them really excited about whats possible on today’s hardware. Then we have started to build a new generation of programmers for tomorrow.  FOSS is the only architecture that will allow us to do that, and I hope it works. At the moment most schools run MS software. It scares me that from day 1, young people are trained in MS software. Can maybe one of you good folks can tell me something? Schools have to pay for MS software. Schools then teach on MS products. Our tax pays to train people on proprietory products. If MS want to teach people their products, shouldn’t they either give schools the software for free, or schools should teach open source programs, and people can pay for MS training as a graduation?</p><p>That’s an aside however.  GBLD wil hopefully bring new programmers and new Linux users, through a new game. I’m proud Vox shared my view and has offered his time and experience voluntarily.</p></div>",
  "content_text": "Bon writes: Well Vox, It would be rude for me not to pop by! I’m impressed your readers here seem quite behind the project overall, and I hope we can encorage some of them to join us on\nGBLD\n.  TZ said: “I hope they do it so that it is bootable (insert disk, hit reset, wait a few seconds, play), and that it comes in multiple flavors (PPC for mac users, Sharp Zaurus?), and they come up with a standard API (so I could clone it for MacOS/Quartz).”  We are aiming a bootable CD that runs on PC, PS2 and X-Box.  Mac implementation would be great, but I think the team could use some help on that, are you avaliable to help TZ?\nWe are developing a Knoppix-style disc, and including some existing games. However, I am very proud that Vox is supporting the other aim of the project, which is to develop a new ‘killer’ game. Maybe, if we can come up with a must-have game, we will draw people to Linux. If we can run that same code on PC/PS2/MAC/X-Box then we can show game studios a way to reduce dev costs, and bring new users to Linux. My other reason for the project is to bring new programmers. Whilst I grew up using the Sinclair Spec48, the Commodore64 and so on, it was easy to break into a game and see how it worked. I learned to program that way, but today with licensed development platforms, young people don’t get that chance. Everything GBLD does will be published in source as well, so young people get a chance to learn as well.\nThe must-have game will draw people and get them talking. Maybe though, we will be able to help people learn about programming and make them really excited about whats possible on today’s hardware. Then we have started to build a new generation of programmers for tomorrow.  FOSS is the only architecture that will allow us to do that, and I hope it works. At the moment most schools run MS software. It scares me that from day 1, young people are trained in MS software. Can maybe one of you good folks can tell me something? Schools have to pay for MS software. Schools then teach on MS products. Our tax pays to train people on proprietory products. If MS want to teach people their products, shouldn’t they either give schools the software for free, or schools should teach open source programs, and people can pay for MS training as a graduation?\nThat’s an aside however.  GBLD wil hopefully bring new programmers and new Linux users, through a new game. I’m proud Vox shared my view and has offered his time and experience voluntarily.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-22T03:47:00+00:00"
}