{
  "url": "https://voxday.net/2004/03/26/mailvox-sometimes-it-happens-to-be/",
  "scraped_at": "2025-12-13T15:56:48.548022",
  "title": "Mailvox: sometimes it happens to be true",
  "date_display": "March 26, 2004",
  "date_iso": "2004-03-26T19:37:00+00:00",
  "date_from_url": "2004-03-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>BLS writes: <em>My understanding of economics and therefore of political science is so Olympian, and your ignorance of both so abysmal, that meaningful communication between us is impossible. And I’m too busy to educate you or even to back up my assertions by citing specifics. You’re wrong because you’re ignorant; trust me.  Is that a fictional argument made by a liberal, or a paraphrase of some of the exchanges on this very website?</em></p><p>That sounds pretty accurate to me.  Except you left one vital thing out.  “… your ignorance of both is so abysmal, AS DEMONSTRATED BY YOUR STATEMENT X, that….”  I have probably described the flaw in the labor theory of value, which is the foundation of all Marxian philosophies of distributive justice, over 1,000 times.  If you neither know what the labor theory of value is, nor understand why it is integral to the idea that government has a right and a duty to distribute societal wealth, how can you possibly even begin the discussion.  And would you truly deny that most people know next to nothing about economics?  I even know one econ major who has no idea who John Maynard Keynes is, much less any of his theories.  Or, perhaps you prefer to deny that political science depends heavily on economics….</p><p>I do not believe that it is my job to educate every ignoramus with an attitude who happens to float by.  I am not a teacher.  It is not my concern that most Democrats don’t realize that they are espousing policies that are integral to both the Communist and National Socialist philosophies; if they are so clueless as to attempt to conflate my right-wing weak-and-spineless government libertarianism with the mythical right-wing Nazi, they don’t need to say any more for me to be certain that they know nothing about economics, politics or history.  Do you take someone seriously as a basketball critic when they ask if the tall guy made a touchdown after he dunked the ball?  I wouldn’t.</p><p>I’m not asking them to trust me, I’m just stating that they’re ignorant.  They can believe me or not, as they wish.  Frequently, I provide some level of specifics, usually places for them to go and see why I’m dismissing them so readily.  If they’re too lazy to do that, then I’m certainly not going to waste the time required to prove it to them.  I have delved into detail with more sophisticated critics too many times to make any apologies for not engaging with those who know nothing.  Ask a polite question, I’ll probably answer it if I can.  Make a stupid accusation and I’ll treat you like the idiot you expose yourself to be.</p><p>The reason that my column on Monday will upset so many left-liberals is that they will recognize the bitter truth of what I am writing.  They should, for I have invented nothing, I simply recorded my recollection of many a debate with a liberal friend.  If you want to take me on, then take me on!  Don’t blithely say that you reject all metaphor then immediately engage in using metaphor, or claim to reject all axiomatic reasoning yet base your arguments on statistics that are self-defined as nothing more than crude approximation.  Show where the metaphor falls down.  Demonstrate where the axiomatic reasoning is proved to be false.  Go for it!  But don’t whine if you get it wrong and receive a bitch-slap in return.</p><p>The problem, of course, is that it is often so easy to demonstrate the Left’s flawed thinking that many don’t even realize that it’s not simple name-calling.  For example, Alterman’s media theory is a howler, simple to disprove both logically and empirically.  I did the former, others have done the latter.  Now, if you can do that to one of my arguments, I will be pleased to salute you, as I do not expect to be right all the time.  But I do hope to make it a little more difficult than Alterman and his ilk do.</p></div>",
  "content_text": "BLS writes:\nMy understanding of economics and therefore of political science is so Olympian, and your ignorance of both so abysmal, that meaningful communication between us is impossible. And I’m too busy to educate you or even to back up my assertions by citing specifics. You’re wrong because you’re ignorant; trust me.  Is that a fictional argument made by a liberal, or a paraphrase of some of the exchanges on this very website?\nThat sounds pretty accurate to me.  Except you left one vital thing out.  “… your ignorance of both is so abysmal, AS DEMONSTRATED BY YOUR STATEMENT X, that….”  I have probably described the flaw in the labor theory of value, which is the foundation of all Marxian philosophies of distributive justice, over 1,000 times.  If you neither know what the labor theory of value is, nor understand why it is integral to the idea that government has a right and a duty to distribute societal wealth, how can you possibly even begin the discussion.  And would you truly deny that most people know next to nothing about economics?  I even know one econ major who has no idea who John Maynard Keynes is, much less any of his theories.  Or, perhaps you prefer to deny that political science depends heavily on economics….\nI do not believe that it is my job to educate every ignoramus with an attitude who happens to float by.  I am not a teacher.  It is not my concern that most Democrats don’t realize that they are espousing policies that are integral to both the Communist and National Socialist philosophies; if they are so clueless as to attempt to conflate my right-wing weak-and-spineless government libertarianism with the mythical right-wing Nazi, they don’t need to say any more for me to be certain that they know nothing about economics, politics or history.  Do you take someone seriously as a basketball critic when they ask if the tall guy made a touchdown after he dunked the ball?  I wouldn’t.\nI’m not asking them to trust me, I’m just stating that they’re ignorant.  They can believe me or not, as they wish.  Frequently, I provide some level of specifics, usually places for them to go and see why I’m dismissing them so readily.  If they’re too lazy to do that, then I’m certainly not going to waste the time required to prove it to them.  I have delved into detail with more sophisticated critics too many times to make any apologies for not engaging with those who know nothing.  Ask a polite question, I’ll probably answer it if I can.  Make a stupid accusation and I’ll treat you like the idiot you expose yourself to be.\nThe reason that my column on Monday will upset so many left-liberals is that they will recognize the bitter truth of what I am writing.  They should, for I have invented nothing, I simply recorded my recollection of many a debate with a liberal friend.  If you want to take me on, then take me on!  Don’t blithely say that you reject all metaphor then immediately engage in using metaphor, or claim to reject all axiomatic reasoning yet base your arguments on statistics that are self-defined as nothing more than crude approximation.  Show where the metaphor falls down.  Demonstrate where the axiomatic reasoning is proved to be false.  Go for it!  But don’t whine if you get it wrong and receive a bitch-slap in return.\nThe problem, of course, is that it is often so easy to demonstrate the Left’s flawed thinking that many don’t even realize that it’s not simple name-calling.  For example, Alterman’s media theory is a howler, simple to disprove both logically and empirically.  I did the former, others have done the latter.  Now, if you can do that to one of my arguments, I will be pleased to salute you, as I do not expect to be right all the time.  But I do hope to make it a little more difficult than Alterman and his ilk do.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-26T19:37:00+00:00"
}