{
  "url": "https://voxday.net/2004/03/03/mailvox-what-to-carry/",
  "scraped_at": "2025-12-13T15:52:40.137919",
  "title": "Mailvox: what to carry",
  "date_display": "March 3, 2004",
  "date_iso": "2004-03-03T19:05:00+00:00",
  "date_from_url": "2004-03-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jonnelle asks: <em>On a related tangent, I would like to ask for a recommendation from the firearm enthusiasts floating around here. An incident yesterday has prompted me to look into buying a handgun.  My knowledge and experience is.. um.. well.. non-existent. The intial searches I’ve done for information border on overwhelming.</em></p><p>Firearm enthusiasts here?  Perish the thought….  I am of the opinion that the .357 is too big for a woman to carry around easily, especially in a small purse.  I recommend the S&amp;W .38 featherweight for the utmost in portability.  It’s a revolver not much larger than your palm, holds five shots, has a catchless hammer and is designed to be fired at very close quarters – like through your coat at someone who is trying to pile you into their car.  The .38 is a weak round, but hollow point helps take care of that.  Since the vast majority of incidents don’t actually require shooting anyone, the important thing is that it’s there and that it goes bang.</p><p>The best gun in the world is useless if you don’t have it on you.  I would go with two guns, something larger, perhaps a .357 with a laser sight for things that go bump in the night at home, and the featherweight for when you’re on the go.  The only problem with the featherweight is you can seriously forget you’ve got it on you.</p><p>Space Bunny’s got a Glock 9mm with a laser.  She likes it and can hit her target with it.</p></div>",
  "content_text": "Jonnelle asks:\nOn a related tangent, I would like to ask for a recommendation from the firearm enthusiasts floating around here. An incident yesterday has prompted me to look into buying a handgun.  My knowledge and experience is.. um.. well.. non-existent. The intial searches I’ve done for information border on overwhelming.\nFirearm enthusiasts here?  Perish the thought….  I am of the opinion that the .357 is too big for a woman to carry around easily, especially in a small purse.  I recommend the S&W .38 featherweight for the utmost in portability.  It’s a revolver not much larger than your palm, holds five shots, has a catchless hammer and is designed to be fired at very close quarters – like through your coat at someone who is trying to pile you into their car.  The .38 is a weak round, but hollow point helps take care of that.  Since the vast majority of incidents don’t actually require shooting anyone, the important thing is that it’s there and that it goes bang.\nThe best gun in the world is useless if you don’t have it on you.  I would go with two guns, something larger, perhaps a .357 with a laser sight for things that go bump in the night at home, and the featherweight for when you’re on the go.  The only problem with the featherweight is you can seriously forget you’ve got it on you.\nSpace Bunny’s got a Glock 9mm with a laser.  She likes it and can hit her target with it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-03T19:05:00+00:00"
}