{
  "url": "https://voxday.net/2004/03/26/mailvox-vox-cave/",
  "scraped_at": "2025-12-13T15:56:55.521710",
  "title": "Mailvox: the Vox Cave",
  "date_display": "March 26, 2004",
  "date_iso": "2004-03-26T23:55:00+00:00",
  "date_from_url": "2004-03-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>BLS is determined to make a pest of himself: <em>Would anybody else like to see a collection of Vox’s libertarian explanations in one place, on-line?  I don’t mean WND archives, I’m thinking of a resource center to educate wandering ignorami.  For example, Vox has described the flaw in the labor theory of value over 1,000 times, so he’s not thrilled to do it again. I can’t remember his point-by-point rebuttal. But could I link to it?  Vox says it’s not his job to be a teacher. But he is. I, for one, value his conclusions; I just don’t understand how he arrived at them.</em></p><p>And Astrosmith chimes in: <em>OK, then, Vox. The first one would be your much mentioned “why the labor theory of value is a load of crap” or however you want to say it.  Go to the CAVE…I like that.</em></p><p>Boy, Astro and BLS, you guys sure have a hankering for the sexy topics, don’t you.  I’ll post my formulation of the idea tomorrow and everyone can chime in on what they’d find interesting this week.  It’s a good idea, doggone it, but I have a bad feeling that I’m actually going to have to think about some of these things now.</p><p>Two votes for Labor.  At least Tony Blair can find support somewhere in this cruel world.</p></div>",
  "content_text": "BLS is determined to make a pest of himself:\nWould anybody else like to see a collection of Vox’s libertarian explanations in one place, on-line?  I don’t mean WND archives, I’m thinking of a resource center to educate wandering ignorami.  For example, Vox has described the flaw in the labor theory of value over 1,000 times, so he’s not thrilled to do it again. I can’t remember his point-by-point rebuttal. But could I link to it?  Vox says it’s not his job to be a teacher. But he is. I, for one, value his conclusions; I just don’t understand how he arrived at them.\nAnd Astrosmith chimes in:\nOK, then, Vox. The first one would be your much mentioned “why the labor theory of value is a load of crap” or however you want to say it.  Go to the CAVE…I like that.\nBoy, Astro and BLS, you guys sure have a hankering for the sexy topics, don’t you.  I’ll post my formulation of the idea tomorrow and everyone can chime in on what they’d find interesting this week.  It’s a good idea, doggone it, but I have a bad feeling that I’m actually going to have to think about some of these things now.\nTwo votes for Labor.  At least Tony Blair can find support somewhere in this cruel world.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-26T23:55:00+00:00"
}