{
  "url": "https://voxday.net/2004/03/20/mailvox-it-always-shows-up-eventually/",
  "scraped_at": "2025-12-13T15:55:37.249812",
  "title": "Mailvox: It always shows up eventually",
  "date_display": "March 20, 2004",
  "date_iso": "2004-03-20T18:00:00+00:00",
  "date_from_url": "2004-03-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Strange Semantics wrote: <em>I think Canada and Europe are great examples, as for the most part their economies are doing as well as the U.S.’s on a relative scale, and theirs are much more socialized societies than ours</em></p><p>Stephen Roach, on the other hand, <a href=\"http://www.morganstanley.com/GEFdata/digests/20040319-fri.html\">wrote today</a>: <em>I can’t get Europe out of my mind.  Most of my international travel in early 2004 has been spent hopping back and forth across The Pond to the UK and the Continent.  In a series of four such visits in the first ten weeks of this year, I have met with a broad cross-section of European investors, corporate executives, and government officials.  I’ve never seen Europe in such bad shape….  Europe was the exception to this otherwise synchronous outbreak of resurgent global growth, with real GDP growth falling slightly short of 1.5% in the second half of 2003.  And that was before the full force of the lagged impacts of the strengthening euro kicked in.  Europe’s failure to participate in the latest global upswing only adds insult to injury.  Something is seriously wrong in Europe, and the Europeans know it.</em></p><p>I salute Strange Semantic’s willingness to take me on directly.  But, as Stephen Roach is Chief Economist and Director of Global Economic Analysis at Morgan Stanley as well as a former Fed researcher, I submit that this is more evidence that SS has almost no idea what he is talking about when it comes to economics, and consequently, political philosophy.</p><p>The axiomatic Austrian approach is the only economic school that offers a solid diagnosis for what is happening in the economies of the world today.  Even Keynes admitted that in the long run, his economic models disintegrated.  Keynes may be dead now, but we are not and the long run, she is a-coming.</p></div>",
  "content_text": "Strange Semantics wrote:\nI think Canada and Europe are great examples, as for the most part their economies are doing as well as the U.S.’s on a relative scale, and theirs are much more socialized societies than ours\nStephen Roach, on the other hand,\nwrote today\n:\nI can’t get Europe out of my mind.  Most of my international travel in early 2004 has been spent hopping back and forth across The Pond to the UK and the Continent.  In a series of four such visits in the first ten weeks of this year, I have met with a broad cross-section of European investors, corporate executives, and government officials.  I’ve never seen Europe in such bad shape….  Europe was the exception to this otherwise synchronous outbreak of resurgent global growth, with real GDP growth falling slightly short of 1.5% in the second half of 2003.  And that was before the full force of the lagged impacts of the strengthening euro kicked in.  Europe’s failure to participate in the latest global upswing only adds insult to injury.  Something is seriously wrong in Europe, and the Europeans know it.\nI salute Strange Semantic’s willingness to take me on directly.  But, as Stephen Roach is Chief Economist and Director of Global Economic Analysis at Morgan Stanley as well as a former Fed researcher, I submit that this is more evidence that SS has almost no idea what he is talking about when it comes to economics, and consequently, political philosophy.\nThe axiomatic Austrian approach is the only economic school that offers a solid diagnosis for what is happening in the economies of the world today.  Even Keynes admitted that in the long run, his economic models disintegrated.  Keynes may be dead now, but we are not and the long run, she is a-coming.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-20T18:00:00+00:00"
}