{
  "url": "https://voxday.net/2004/03/03/mailvox-these-enlightened-times/",
  "scraped_at": "2025-12-13T15:52:36.504236",
  "title": "Mailvox: These enlightened times",
  "date_display": "March 3, 2004",
  "date_iso": "2004-03-03T17:33:00+00:00",
  "date_from_url": "2004-03-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>BLS writes: <em>Read great economists? What can Dead White Males possibly have to say to a person living in these, the most enlightened times ever? Look, it’s perfectly simple: whatever policy position makes me feel good about myself is right, and since it’s comfortable to me, then anybody who disagrees with me is either too stupid to appreciate my brilliance, or just plain evil. Which are you?</em></p><p>And, of course, should you dare to either identify my brilliant thought as one that has been thought and dismissed before or follow a reasonable train of logic from my assertions to conclusions I don’t like, you will of course be guilty of mischaracterizing my positions.  Furthermore, I reserve the right to redefine any concept that has negative connotations, regardless of how easily identifiable and well-understood it might be.</p><p>“This time it will be different” is the battle cry of the latter-day socialist.  “This is different” is the battle cry of the liberal who is too stupid to realize that he is a latter-day socialist.</p></div>",
  "content_text": "BLS writes:\nRead great economists? What can Dead White Males possibly have to say to a person living in these, the most enlightened times ever? Look, it’s perfectly simple: whatever policy position makes me feel good about myself is right, and since it’s comfortable to me, then anybody who disagrees with me is either too stupid to appreciate my brilliance, or just plain evil. Which are you?\nAnd, of course, should you dare to either identify my brilliant thought as one that has been thought and dismissed before or follow a reasonable train of logic from my assertions to conclusions I don’t like, you will of course be guilty of mischaracterizing my positions.  Furthermore, I reserve the right to redefine any concept that has negative connotations, regardless of how easily identifiable and well-understood it might be.\n“This time it will be different” is the battle cry of the latter-day socialist.  “This is different” is the battle cry of the liberal who is too stupid to realize that he is a latter-day socialist.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-03T17:33:00+00:00"
}