{
  "url": "https://voxday.net/2004/03/26/mailvox-since-you-insis/",
  "scraped_at": "2025-12-13T15:56:51.840123",
  "title": "Mailvox: Since you insist",
  "date_display": "March 26, 2004",
  "date_iso": "2004-03-26T23:15:00+00:00",
  "date_from_url": "2004-03-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Strange writes: <em>Actually, my argument was more like this (but thank you for misrepresenting it)</em></p><p>As Monday’s column will show, we’re somewhere between 1) <em>Denies he said what he said</em> and 2) <em>Denies he meant what you claim he means</em> here.  But I am very familiar with the drill.  I’ll go ahead and deal with this later tonight after I finish my workout.  Notice, in the meantime, that he simply tries to skip over the points where he’s already been demonstrated to be wrong, such as the “fiscally irresponsible” point about social programs.  We’ll see just how adroit an escape artist he is.</p><p><em>1.) Socialism does not slow economic growth.<br> <br>2.) The fact that the vastly more socialized European nations have economies comporable to that of the U.S. indicates that this is in fact true. If nothing else, it indicates that the economic growth is not seriously impacted.<br> <br>3.) Roach’s comments display that Europe’s economic growth is in fact less than the U.S. He even gives the reasons why. However, the economies are still comporable (compare the U.S. and the now less-socialized Russian economy, and you’ll find a bigger difference, if not in growth of GDP – their stats for last year were 7.3%, but does anyone believe that – then in other measures of Russia’s economic health). Therefore Roach’s analysis of Europe neither contradicts what I said, as I never implied that Europe’s economy was exactly as healthy as the U.S.’s, simply that it was not significantly less-healthy, and does not provide evidence that the difference between the economies is due to more socialized economies.</br></br></br></br></em></p><p>4.) Therefore, there is no evidence that socialism is slowing economic growth, and even if we blame socialism for Europe’s somewhat slower growth than the U.S., there is nothing like the massively slower growth that the Austrians would predict for the much more socialized European economies. Note, of course, that the European growth statistic are bad in both the highly socialized and not-very-socialized economies. Further evidence that it is not socialism doing the slowing.</p><p>This isn’t my critique, as I want to verify the numbers, but it should suffice to show that Strange is once again off orbiting a planet of his own. <em>From 1965 to 1974, government spending in Western Europe averaged 37 percent of the gross domestic product (GDP), and economic growth averaged 4.3 percent yearly.  However, the European leftists gained power and increased government spending to an average of 47 percent of GDP by 1984, where it has remained, as compared to slightly more than 30 percent of GDP for the U.S. Not surprising, economic growth fell to an average annual rate of only 1.7 percent in Europe, while the U.S. enjoyed an average annual growth rate of 3.6 percent for 1984-2000. Also for the past 20 years, Europe has suffered an average unemployment rate more than 50 percent higher than the U.S.<br> <br/></br></em><br> <br>As I said, I want to verify this source but I have no reason to doubt it and it corresponds closely with what I know from a previous and unrelated perusal of total intervention in the economy as measured by spending over GDP.  Note that Europe’s growth was half of the USA’s, again completely exploding Strange’s assertions.  Half is markedly slower, especially since the US is hardly a free market capitalist economy.  For someone who rejects an axiomatic approach, Strange sure doesn’t seem to pay any attention to the empirical data.  I’m also curious to know how my previous summary was an inaccurate representation.  It seems to match his correction pretty nicely.</br></br></p><p>Not that I accept these Keynesian macroeconomic analyses.  I utilize them solely for the purpose of providing common ground for the argument.</p></div>",
  "content_text": "Strange writes:\nActually, my argument was more like this (but thank you for misrepresenting it)\nAs Monday’s column will show, we’re somewhere between 1)\nDenies he said what he said\nand 2)\nDenies he meant what you claim he means\nhere.  But I am very familiar with the drill.  I’ll go ahead and deal with this later tonight after I finish my workout.  Notice, in the meantime, that he simply tries to skip over the points where he’s already been demonstrated to be wrong, such as the “fiscally irresponsible” point about social programs.  We’ll see just how adroit an escape artist he is.\n1.) Socialism does not slow economic growth.\n2.) The fact that the vastly more socialized European nations have economies comporable to that of the U.S. indicates that this is in fact true. If nothing else, it indicates that the economic growth is not seriously impacted.\n3.) Roach’s comments display that Europe’s economic growth is in fact less than the U.S. He even gives the reasons why. However, the economies are still comporable (compare the U.S. and the now less-socialized Russian economy, and you’ll find a bigger difference, if not in growth of GDP – their stats for last year were 7.3%, but does anyone believe that – then in other measures of Russia’s economic health). Therefore Roach’s analysis of Europe neither contradicts what I said, as I never implied that Europe’s economy was exactly as healthy as the U.S.’s, simply that it was not significantly less-healthy, and does not provide evidence that the difference between the economies is due to more socialized economies.\n4.) Therefore, there is no evidence that socialism is slowing economic growth, and even if we blame socialism for Europe’s somewhat slower growth than the U.S., there is nothing like the massively slower growth that the Austrians would predict for the much more socialized European economies. Note, of course, that the European growth statistic are bad in both the highly socialized and not-very-socialized economies. Further evidence that it is not socialism doing the slowing.\nThis isn’t my critique, as I want to verify the numbers, but it should suffice to show that Strange is once again off orbiting a planet of his own.\nFrom 1965 to 1974, government spending in Western Europe averaged 37 percent of the gross domestic product (GDP), and economic growth averaged 4.3 percent yearly.  However, the European leftists gained power and increased government spending to an average of 47 percent of GDP by 1984, where it has remained, as compared to slightly more than 30 percent of GDP for the U.S. Not surprising, economic growth fell to an average annual rate of only 1.7 percent in Europe, while the U.S. enjoyed an average annual growth rate of 3.6 percent for 1984-2000. Also for the past 20 years, Europe has suffered an average unemployment rate more than 50 percent higher than the U.S.\nAs I said, I want to verify this source but I have no reason to doubt it and it corresponds closely with what I know from a previous and unrelated perusal of total intervention in the economy as measured by spending over GDP.  Note that Europe’s growth was half of the USA’s, again completely exploding Strange’s assertions.  Half is markedly slower, especially since the US is hardly a free market capitalist economy.  For someone who rejects an axiomatic approach, Strange sure doesn’t seem to pay any attention to the empirical data.  I’m also curious to know how my previous summary was an inaccurate representation.  It seems to match his correction pretty nicely.\nNot that I accept these Keynesian macroeconomic analyses.  I utilize them solely for the purpose of providing common ground for the argument.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-26T23:15:00+00:00"
}