{
  "url": "https://voxday.net/2004/03/23/mailvox-buffalo-bellows/",
  "scraped_at": "2025-12-13T15:56:08.317337",
  "title": "Mailvox: the Buffalo bellows",
  "date_display": "March 23, 2004",
  "date_iso": "2004-03-23T01:21:00+00:00",
  "date_from_url": "2004-03-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The White Buffalo comments: <em>I don’t want you to send your kids to PS, I want you all to stop telling me what to do with my kids.</em></p><p>WB, I don’t think I’ve ever told you what to do with your kids.  Nor do I doubt your affection or willingness to shoulder your paternal responsibility for them.  The way I see it, there are four kinds of parents who send their children to public school.</p><p>1.  The stupid – this covers most parents, who have no idea what public education is nor has the notion of any other educational option ever entered their minds.</p><p>2.  The stuck – those who have no choice.  I have nothing but sympathy for them.</p><p>3.  The selfish – those who value their free time more than their children’s education.  These are the people I was condemning in today’s column.  If it wasn’t appropriately and perfectly nuanced in your opinion, then, well, tough.  What do you expect from a freaking poem?</p><p>4.  The strange – those, like WB, who seriously believe they are performing some form of vicarious mission work through their children.  I disagree, of course, and I neither condemn nor understand them.  Perhaps there is a genuine calling of this sort.  It’s just not one I hear.</p><p>I quite liked Space Bunny’s point: <em>I fully support anyones right to do what they will with their own children. Too bad the government doesn’t feel the same.</em> And speaking of which, MM writes: <em>Just read your column entitled “The Yellow Bus.”  Thank you for putting into print the feelings of many parents.  I have a kindergarten-age child in public school now, and am pulling him out at the end of the school year.  Our school district and the DA’s office have threatened my wife and I with one year in county jail and removing our child from our custody, citing excused medical absences as justification.  To top it off, their aggressive actions break a contract agreement signed by the school and myself.</em></p><p>Never trust the bureacracy.  Never.  I did mention the bit about packing all the educationists off to Cuba, didn’t I?</p></div>",
  "content_text": "The White Buffalo comments:\nI don’t want you to send your kids to PS, I want you all to stop telling me what to do with my kids.\nWB, I don’t think I’ve ever told you what to do with your kids.  Nor do I doubt your affection or willingness to shoulder your paternal responsibility for them.  The way I see it, there are four kinds of parents who send their children to public school.\n1.  The stupid – this covers most parents, who have no idea what public education is nor has the notion of any other educational option ever entered their minds.\n2.  The stuck – those who have no choice.  I have nothing but sympathy for them.\n3.  The selfish – those who value their free time more than their children’s education.  These are the people I was condemning in today’s column.  If it wasn’t appropriately and perfectly nuanced in your opinion, then, well, tough.  What do you expect from a freaking poem?\n4.  The strange – those, like WB, who seriously believe they are performing some form of vicarious mission work through their children.  I disagree, of course, and I neither condemn nor understand them.  Perhaps there is a genuine calling of this sort.  It’s just not one I hear.\nI quite liked Space Bunny’s point:\nI fully support anyones right to do what they will with their own children. Too bad the government doesn’t feel the same.\nAnd speaking of which, MM writes:\nJust read your column entitled “The Yellow Bus.”  Thank you for putting into print the feelings of many parents.  I have a kindergarten-age child in public school now, and am pulling him out at the end of the school year.  Our school district and the DA’s office have threatened my wife and I with one year in county jail and removing our child from our custody, citing excused medical absences as justification.  To top it off, their aggressive actions break a contract agreement signed by the school and myself.\nNever trust the bureacracy.  Never.  I did mention the bit about packing all the educationists off to Cuba, didn’t I?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-23T01:21:00+00:00"
}