{
  "url": "https://voxday.net/2004/03/11/mailvox-call-me-pasca/",
  "scraped_at": "2025-12-13T15:53:45.658611",
  "title": "Mailvox: Call me Pascal",
  "date_display": "March 11, 2004",
  "date_iso": "2004-03-11T06:16:00+00:00",
  "date_from_url": "2004-03-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The dubious dugong writes: <em>Your commitment to Libertarianism in fact informs your theology. Shouldn’t your theology inform your political theory not the other way around? If your precommitment to a “free-will” political theory is false then what does it say about everything else you believe? Finding refuge in quantum mechanics to save your “freedom” is speculative at best. It’s just another scientific theory waiting to be overthrown by a more fashionable one. Besides even if it “works” – utility – has no bearing on whether it’s “true” – veracity.</em></p><p>It’s possible, of course, as I was a libertarian before I was a Christian.  I don’t see the two as intrinsicly related, although certainly many people do.  There’s plenty of Christian Democrats who believe Jesus mandated socialism and cheers any form of love between two men.  I am not at all concerned about the “free-will” political being overturned, as my Christianity does not depend in any way on it, furthermore, considering the level of cognitive dissonance which is accepted by Democrats and Republicans everyday, I wouldn’t see any need to worry even if it did.</p><p>All theology outside Scripture is speculation, inherently so and far more so than political economy.  My primary reason for believing in Jesus Christ is that I have seen his works in people’s lives.  My primary reason for believing in libertarian political theory is that I have seen the total failure of every other theory in society and history.  In both cases, there is logic that supports my witness as well.  But yes, truth is what it is, and utility is nothing more than a useful instrument in attempting to comprehend it.</p><p>I believe there is a Vox’s Wager, if I may be so bold, to be made with regards to Free Will vs Omniderigence.  If the choice and responsibility is mine, if God is limited for whatever reason and requires me to act, then I am compelled to act, speak and witness at every opportunity, for I will be held responsible for my failures.  If, on the other hand, an omniderigent God is micro-managing my life, then I have a ready excuse for failing to act, failing to speak and failing to witness, for all such failures can be blamed on God’s Will that I not do so as he controls my actions.  Vox’s Wager is that if I am correct, I will be proven to have acted wisely in attempting to serve God.  If I am incorrect, I am still in accordance with God’s Will as he micro-manages my life.</p><p>Conversely, the proponent of God’s omniderigence is no better off if he wins his bet, for he has done nothing more than me.  But if he is incorrect, then he run a risk of being misled into doing little of Kingdom value that will survive the fire of the believer’s judgment.</p></div>",
  "content_text": "The dubious dugong writes:\nYour commitment to Libertarianism in fact informs your theology. Shouldn’t your theology inform your political theory not the other way around? If your precommitment to a “free-will” political theory is false then what does it say about everything else you believe? Finding refuge in quantum mechanics to save your “freedom” is speculative at best. It’s just another scientific theory waiting to be overthrown by a more fashionable one. Besides even if it “works” – utility – has no bearing on whether it’s “true” – veracity.\nIt’s possible, of course, as I was a libertarian before I was a Christian.  I don’t see the two as intrinsicly related, although certainly many people do.  There’s plenty of Christian Democrats who believe Jesus mandated socialism and cheers any form of love between two men.  I am not at all concerned about the “free-will” political being overturned, as my Christianity does not depend in any way on it, furthermore, considering the level of cognitive dissonance which is accepted by Democrats and Republicans everyday, I wouldn’t see any need to worry even if it did.\nAll theology outside Scripture is speculation, inherently so and far more so than political economy.  My primary reason for believing in Jesus Christ is that I have seen his works in people’s lives.  My primary reason for believing in libertarian political theory is that I have seen the total failure of every other theory in society and history.  In both cases, there is logic that supports my witness as well.  But yes, truth is what it is, and utility is nothing more than a useful instrument in attempting to comprehend it.\nI believe there is a Vox’s Wager, if I may be so bold, to be made with regards to Free Will vs Omniderigence.  If the choice and responsibility is mine, if God is limited for whatever reason and requires me to act, then I am compelled to act, speak and witness at every opportunity, for I will be held responsible for my failures.  If, on the other hand, an omniderigent God is micro-managing my life, then I have a ready excuse for failing to act, failing to speak and failing to witness, for all such failures can be blamed on God’s Will that I not do so as he controls my actions.  Vox’s Wager is that if I am correct, I will be proven to have acted wisely in attempting to serve God.  If I am incorrect, I am still in accordance with God’s Will as he micro-manages my life.\nConversely, the proponent of God’s omniderigence is no better off if he wins his bet, for he has done nothing more than me.  But if he is incorrect, then he run a risk of being misled into doing little of Kingdom value that will survive the fire of the believer’s judgment.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-11T06:16:00+00:00"
}