{
  "url": "https://voxday.net/2004/03/02/mailvox-deconstructing-liberalis/",
  "scraped_at": "2025-12-13T15:52:14.095506",
  "title": "Mailvox: deconstructing liberalism",
  "date_display": "March 2, 2004",
  "date_iso": "2004-03-02T13:22:00+00:00",
  "date_from_url": "2004-03-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Before Anonymous showed up, the artist formerly known as Si was making a serious play for the position as resident pest, and managed to accuse me of a host of intellectual sins in an impressively short period of time.  Since he’d already happened to email me a short manifesto of what he described as liberalism, I thought an analysis of it might demonstrate the irony of his attempting to critique my reasoning.  And it also serves as a very useful opportunity to understand where the liberal mind is coming from these days.</p><p><em>I’m of the opinion that more often than not, the reason conservatives see liberal arguments as irrational, or internally inconsistent, and liberals see conservative arguments as the same, is that the two groups are often using vastly different reasoning schemes….  A perfect example is taxation, as liberals see it as a paying of dues, or providing the government the means to do its job, while conservatives see it as theft.</em></p><p>And Si leaps right off to an abysmal start, although given the rest of the manifesto it does indeed serve as a perfect example.  Liberals may see taxation as whatever they like, but both examples here are nonsensical.  In a fiat money system such as exists in every modern economy, taxation provides government with nothing but a means of obscuring the inflation inherent in such systems.  In the words of the 1984 <a href=\"http://www.uhuh.com/taxstuff/gracecom.htm\">Grace Commission</a>: “100 percent of what is collected is absorbed solely by interest on the Federal debt and by Federal Government contributions to transfer payments.”  As for the notion of dues, there is a strong implication of voluntary membership which clearly cannot apply to an involuntary system resting on the use of physical force to take private property from an individual on the basis of his birthright.  Nor does the liberal concept even begin to explain how such a forced seizure of property can be anything but theft, unless there is no such thing as private property – these aren’t vastly different reasoning schemes, they are vastly different views of reality, one of which requires ignoring it.</p><p><em>I. The basic goal of liberalism.</em></p><p>The basic goal of liberalism to facilitate the well-being of all individuals who are members of communities.  This essentially means that liberalism is designed to maximize well-being.  Well-being includes things like happiness and health.  The rights and freedoms liberalism values are the rights and freedoms that allow beings to pursue their own well-being without infringement on the well-being of others.</p><p>This is a strangely utilitarian notion which has nothing to do with classical liberalism – “an economic theory advocating free competition and a self-regulating market and the gold standard” – or the modern linguistic perversion which is described as a political orientation favoring progress and reform, (towards what is never explained).</p><p>First, note that Si’s liberalism excludes those members who are not members of communities.  An ominous note, considering what follows.  Next, note that for all its central importance, well-being is never defined and the only two components mentioned are both nebulous and wholly subjective concepts.  Therefore, an elite will be required with the power to define well-being as well as measure the competing claims of the infringements that will no doubt appear in any community larger than two individuals.  And, naturally, it will require the muscle to enforce its decisions.  Already, Si has laid the groundwork for totalitarian rule.</p><p><em>II. The basic goal of government in liberal ideology.</em></p><p>The basic goal of government is pretty straightforward, to produce an environment, including enacting and protecting rights and freedoms, that maximize the well-being of all individuals in a society. Thus, in the abstract, the government should be designed to produce and facilitate people who are productive both as individuals and members of a society/community.  People who are productive as individuals will be people who actively participate in their own self-devlelopment.  This means they will nurture their strengths, work on their weaknesses, etc.  People who are productive members of society are people who will actively participate in the development of a society that maximizes the well-being of its members.  The government cannot actively force individuals to directly participate in their own self-development, or the development of society, but it can enact laws, produce and protect rights and freedoms, and collect the means necessary to allow them the ability to do so.</p><p>Si next engages in a monstrous fallacy, which is the notion that government creates rights.  That which it gives, it can take away, of course.  (See the UN Declaration of Human Rights for a concrete example of this.)   He leaps from implied socialism to outright socialism here, with government devoting itself to enacting laws – sans force? – that will facilitate individuals to be productive.  Of course, it is the government that will decide who is and who is not productive, since productivity is defined as participation in maximizing that nebulous well-being.  Note that there is not a single mention of private property or a specific individual right yet, but plenty of emphasis on the need for government to be in control.</p><p><em>This basic goal of goverment requires the government to protect its citizens (through both the maintenance of a military and the enactment of a fair judicial system, including both the police and the courts).  It must also protect the rights and freedoms of its citizens that allow them to work toward their own well-being.  These freedoms and rights are valuable only insofar as they facilitate this, and therefore there is a hierarchy of rights and freedoms.  Obviously, health and happiness are at the top, but others will include some of the fundamental freedoms in our society, like freedom of speech, though, religion, open access to information, aesthetic freedom, economic freedom, privacy, choice, and things like the right to fair pay for work. </em></p><p>By this point, it’s quite obvious that Si is a simple emotional socialist who’s never read any of the socialist economists or their critics.  He’s describing nothing more than a typical socialist structure, minus the usual flavorful detail of the advantages of syndicates over vanguards or vice-versa.  Freedoms and rights are not unalienable here, but there is a hierarchy of them and they are valuable – permitted would be a more accurate term  – only if they are allowed by the required arbiters of well-being.  No doubt the arbiters will have rights rather high up the hierarchy.  And of course, we’ve already seen how well it plays out when health and happiness are ranked ahead of economic freedom and private property – total economic and technological stagnation.  Even if the people of this society have good health to begin with, it won’t last long.</p><p><em>This also means that the government will have to have a realistic view of the society in which it operates, and thus recognize that there are inequalities that are not the faults of the individuals who are their victims, and therefore compensate for those as effectively as it can.  This is why the government must have social programs, including things like wellfare, medicare and medicaid, affirmative action, etc.  These programs should be enacted as necessary, and they should be effective.  If they are not effective, i.e., if they don’t compensate for inequalities in peoples’ ability to achieve their own well-being, they should be replaced with new programs that will.  Thus, if it is shown that affirmative action does not increase the potential for the achievement of well-being for individuals who are at a disadvantage, of if this increase in potential is at the expense of placing other groups at a disadvantage, it should be done away with for better programs.  These sorts of things are empirical questions, however, and programs like affirmative action should not be done away with for strictly ideological reasons.</em></p><p>I was wondering when we’d get to the quest for cosmic justice, and here we are.  Thomas Sowell has written a book dismissing it and its possibilities; suffice it to say that government never has and never will address the fundamental inequities which inevitably appear and repeatedly recreate themselves throughout every society, and the law of unintended consequences coupled with the inescapable sclerosis of bureaucracy will assure that the society in search of cosmic justice will soon find itself with greater inequities than those with which it began.</p><p>Si is not troubled by the failure of every single major US government program by every metric upon which it may be judged; from the War on Poverty to the War on Drugs, from family farms to rent control, the problem is worse than before government intervention began.  But these are just empirical problems, so he waves away decades of failure with breezy assurance, and we should not be so <em>ideological</em> as to suggest that no breeding of two cats will ever result in a dog, no matter how doggedly one persists in the attempt.</p><p><em>There is another group of people who should get particular mention, as the government has particular responsibilities for these people.  They are parents.  The government should not only facilitate the ability of parents to achieve their own well-being, but it should also provide parents with what they need to achieve the well-being of their children, or to teach their children to achieve there own well-being.  This includes things like public education for parents who cannot afford to pay private school tuition, student loans for parents to send their children to colleges and universities, and social programs like WIC and Head Start.</em></p><p>Such sweet innocence.  Si is no sophisticated social engineer; he has not yet figured out that in order to produce the proper little unthinking worker bees required by his “liberal” society, public education must be mandatory and all private schooling will have to be stomped out.  I’m sure he’ll be pleased to know that his suggested program here is remniscent of point 20 in the National Socialist Party’s Munich Manifesto, and I suppose he would have added the aim of the student understanding the central importance of the State had he only thought a little deeper.  Otherwise, how will they learn what societally approved well-being is?  Not to mention the societal need to provide for the selection and training of tomorrow’s arbiters of well-being.</p><p>[<em>Long, conventional and unsophisticated bits on taxation, social programs, health care and crime.</em> The short description of his position on each is Democrat, Socialist, Socialist, Utilitarian]</p><p>But he goes on to say (actually at the end, but makes more sense here): <em>You may have objects that rely, for instance, on economic analysis.  However, there are as many different views among economists as there are among politicians, and liberals can just as easily come up with economic analyses that support their views as can conservatives.</em></p><p>Oh Sweet Moses!  I don’t think Si realizes that there’s a very good reason that what is now known as  political science was formerly known as political economy, because economics is an absolutely fundamental aspect of any political system.  This is why our major ideologies were all created by economists, albeit of varied ability.  Now his utter starry-eyed utopianism shows itself clearly; if we can revoke the iron law of supply and demand, why not revoke the law of gravity as well and declare that everyone will have magic floating cars that power themselves on sunlight and produce clean exhaust consisting solely of diamonds, $100 bills and chocolate!  This is almost as bad as Karl Marx waving the magic wand and declaring that – poof – the State will disappear and everyone will live happily forever with 70 virgins.  Seen one socialist, you’ve truly seen them all.</p><p>Yes, liberals – or socialists as he’d more accurately call himself if he had any inkling of what his dream society inherently requires – can easily come up with economic analyses that support their views.  They’re usually called Five-Year Plans, or as they’re now known to history, total fiction.</p><p><em>I think these brief explanations of liberal positions on some major issues will serve to elucidate the logic derived from liberal ideology and behind these positions and others.  Naturally, you will disagree, if you are conservative, because your view of the goal of government, or perhaps even the best ways for achieving well-being, are different.  However, these views are consistent internally, and obey a logic based on their premises.  Attacks on liberals that accuse them being illogical, basing their decisions on feelings rather than reason, etc., for holding these positions, are therefore invalid. </em></p><p>There is an internal logic here, it’s called circular, and it is based on undefined premises which necessarily remain undefined in order to prevent the unwieldy edifice from collapsing of its own absurdity.  There is a certain consistency too, though probably not of  the sort that Si had in mind.  As long as we throw out logic as well as everything that we know of human history, human nature and the immutable laws of human action that have repeatedly asserted their primacy for thousands of years, we can concoct a vision for society that hasn’t been new since Plato first revealed it in The Republic.  2,351 years and mankind still can’t come up with anything new.  Those who don’t know history truly are doomed to repeat it.  How depressing!</p><p>But we must give Si credit for clearly demonstrating exactly what modern American liberalism has devolved into today.  It is latter-day socialism, dumbed-down to the point that it is too stupid to recognize itself in the mirror.</p></div>",
  "content_text": "Before Anonymous showed up, the artist formerly known as Si was making a serious play for the position as resident pest, and managed to accuse me of a host of intellectual sins in an impressively short period of time.  Since he’d already happened to email me a short manifesto of what he described as liberalism, I thought an analysis of it might demonstrate the irony of his attempting to critique my reasoning.  And it also serves as a very useful opportunity to understand where the liberal mind is coming from these days.\nI’m of the opinion that more often than not, the reason conservatives see liberal arguments as irrational, or internally inconsistent, and liberals see conservative arguments as the same, is that the two groups are often using vastly different reasoning schemes….  A perfect example is taxation, as liberals see it as a paying of dues, or providing the government the means to do its job, while conservatives see it as theft.\nAnd Si leaps right off to an abysmal start, although given the rest of the manifesto it does indeed serve as a perfect example.  Liberals may see taxation as whatever they like, but both examples here are nonsensical.  In a fiat money system such as exists in every modern economy, taxation provides government with nothing but a means of obscuring the inflation inherent in such systems.  In the words of the 1984\nGrace Commission\n: “100 percent of what is collected is absorbed solely by interest on the Federal debt and by Federal Government contributions to transfer payments.”  As for the notion of dues, there is a strong implication of voluntary membership which clearly cannot apply to an involuntary system resting on the use of physical force to take private property from an individual on the basis of his birthright.  Nor does the liberal concept even begin to explain how such a forced seizure of property can be anything but theft, unless there is no such thing as private property – these aren’t vastly different reasoning schemes, they are vastly different views of reality, one of which requires ignoring it.\nI. The basic goal of liberalism.\nThe basic goal of liberalism to facilitate the well-being of all individuals who are members of communities.  This essentially means that liberalism is designed to maximize well-being.  Well-being includes things like happiness and health.  The rights and freedoms liberalism values are the rights and freedoms that allow beings to pursue their own well-being without infringement on the well-being of others.\nThis is a strangely utilitarian notion which has nothing to do with classical liberalism – “an economic theory advocating free competition and a self-regulating market and the gold standard” – or the modern linguistic perversion which is described as a political orientation favoring progress and reform, (towards what is never explained).\nFirst, note that Si’s liberalism excludes those members who are not members of communities.  An ominous note, considering what follows.  Next, note that for all its central importance, well-being is never defined and the only two components mentioned are both nebulous and wholly subjective concepts.  Therefore, an elite will be required with the power to define well-being as well as measure the competing claims of the infringements that will no doubt appear in any community larger than two individuals.  And, naturally, it will require the muscle to enforce its decisions.  Already, Si has laid the groundwork for totalitarian rule.\nII. The basic goal of government in liberal ideology.\nThe basic goal of government is pretty straightforward, to produce an environment, including enacting and protecting rights and freedoms, that maximize the well-being of all individuals in a society. Thus, in the abstract, the government should be designed to produce and facilitate people who are productive both as individuals and members of a society/community.  People who are productive as individuals will be people who actively participate in their own self-devlelopment.  This means they will nurture their strengths, work on their weaknesses, etc.  People who are productive members of society are people who will actively participate in the development of a society that maximizes the well-being of its members.  The government cannot actively force individuals to directly participate in their own self-development, or the development of society, but it can enact laws, produce and protect rights and freedoms, and collect the means necessary to allow them the ability to do so.\nSi next engages in a monstrous fallacy, which is the notion that government creates rights.  That which it gives, it can take away, of course.  (See the UN Declaration of Human Rights for a concrete example of this.)   He leaps from implied socialism to outright socialism here, with government devoting itself to enacting laws – sans force? – that will facilitate individuals to be productive.  Of course, it is the government that will decide who is and who is not productive, since productivity is defined as participation in maximizing that nebulous well-being.  Note that there is not a single mention of private property or a specific individual right yet, but plenty of emphasis on the need for government to be in control.\nThis basic goal of goverment requires the government to protect its citizens (through both the maintenance of a military and the enactment of a fair judicial system, including both the police and the courts).  It must also protect the rights and freedoms of its citizens that allow them to work toward their own well-being.  These freedoms and rights are valuable only insofar as they facilitate this, and therefore there is a hierarchy of rights and freedoms.  Obviously, health and happiness are at the top, but others will include some of the fundamental freedoms in our society, like freedom of speech, though, religion, open access to information, aesthetic freedom, economic freedom, privacy, choice, and things like the right to fair pay for work.\nBy this point, it’s quite obvious that Si is a simple emotional socialist who’s never read any of the socialist economists or their critics.  He’s describing nothing more than a typical socialist structure, minus the usual flavorful detail of the advantages of syndicates over vanguards or vice-versa.  Freedoms and rights are not unalienable here, but there is a hierarchy of them and they are valuable – permitted would be a more accurate term  – only if they are allowed by the required arbiters of well-being.  No doubt the arbiters will have rights rather high up the hierarchy.  And of course, we’ve already seen how well it plays out when health and happiness are ranked ahead of economic freedom and private property – total economic and technological stagnation.  Even if the people of this society have good health to begin with, it won’t last long.\nThis also means that the government will have to have a realistic view of the society in which it operates, and thus recognize that there are inequalities that are not the faults of the individuals who are their victims, and therefore compensate for those as effectively as it can.  This is why the government must have social programs, including things like wellfare, medicare and medicaid, affirmative action, etc.  These programs should be enacted as necessary, and they should be effective.  If they are not effective, i.e., if they don’t compensate for inequalities in peoples’ ability to achieve their own well-being, they should be replaced with new programs that will.  Thus, if it is shown that affirmative action does not increase the potential for the achievement of well-being for individuals who are at a disadvantage, of if this increase in potential is at the expense of placing other groups at a disadvantage, it should be done away with for better programs.  These sorts of things are empirical questions, however, and programs like affirmative action should not be done away with for strictly ideological reasons.\nI was wondering when we’d get to the quest for cosmic justice, and here we are.  Thomas Sowell has written a book dismissing it and its possibilities; suffice it to say that government never has and never will address the fundamental inequities which inevitably appear and repeatedly recreate themselves throughout every society, and the law of unintended consequences coupled with the inescapable sclerosis of bureaucracy will assure that the society in search of cosmic justice will soon find itself with greater inequities than those with which it began.\nSi is not troubled by the failure of every single major US government program by every metric upon which it may be judged; from the War on Poverty to the War on Drugs, from family farms to rent control, the problem is worse than before government intervention began.  But these are just empirical problems, so he waves away decades of failure with breezy assurance, and we should not be so\nideological\nas to suggest that no breeding of two cats will ever result in a dog, no matter how doggedly one persists in the attempt.\nThere is another group of people who should get particular mention, as the government has particular responsibilities for these people.  They are parents.  The government should not only facilitate the ability of parents to achieve their own well-being, but it should also provide parents with what they need to achieve the well-being of their children, or to teach their children to achieve there own well-being.  This includes things like public education for parents who cannot afford to pay private school tuition, student loans for parents to send their children to colleges and universities, and social programs like WIC and Head Start.\nSuch sweet innocence.  Si is no sophisticated social engineer; he has not yet figured out that in order to produce the proper little unthinking worker bees required by his “liberal” society, public education must be mandatory and all private schooling will have to be stomped out.  I’m sure he’ll be pleased to know that his suggested program here is remniscent of point 20 in the National Socialist Party’s Munich Manifesto, and I suppose he would have added the aim of the student understanding the central importance of the State had he only thought a little deeper.  Otherwise, how will they learn what societally approved well-being is?  Not to mention the societal need to provide for the selection and training of tomorrow’s arbiters of well-being.\n[\nLong, conventional and unsophisticated bits on taxation, social programs, health care and crime.\nThe short description of his position on each is Democrat, Socialist, Socialist, Utilitarian]\nBut he goes on to say (actually at the end, but makes more sense here):\nYou may have objects that rely, for instance, on economic analysis.  However, there are as many different views among economists as there are among politicians, and liberals can just as easily come up with economic analyses that support their views as can conservatives.\nOh Sweet Moses!  I don’t think Si realizes that there’s a very good reason that what is now known as  political science was formerly known as political economy, because economics is an absolutely fundamental aspect of any political system.  This is why our major ideologies were all created by economists, albeit of varied ability.  Now his utter starry-eyed utopianism shows itself clearly; if we can revoke the iron law of supply and demand, why not revoke the law of gravity as well and declare that everyone will have magic floating cars that power themselves on sunlight and produce clean exhaust consisting solely of diamonds, $100 bills and chocolate!  This is almost as bad as Karl Marx waving the magic wand and declaring that – poof – the State will disappear and everyone will live happily forever with 70 virgins.  Seen one socialist, you’ve truly seen them all.\nYes, liberals – or socialists as he’d more accurately call himself if he had any inkling of what his dream society inherently requires – can easily come up with economic analyses that support their views.  They’re usually called Five-Year Plans, or as they’re now known to history, total fiction.\nI think these brief explanations of liberal positions on some major issues will serve to elucidate the logic derived from liberal ideology and behind these positions and others.  Naturally, you will disagree, if you are conservative, because your view of the goal of government, or perhaps even the best ways for achieving well-being, are different.  However, these views are consistent internally, and obey a logic based on their premises.  Attacks on liberals that accuse them being illogical, basing their decisions on feelings rather than reason, etc., for holding these positions, are therefore invalid.\nThere is an internal logic here, it’s called circular, and it is based on undefined premises which necessarily remain undefined in order to prevent the unwieldy edifice from collapsing of its own absurdity.  There is a certain consistency too, though probably not of  the sort that Si had in mind.  As long as we throw out logic as well as everything that we know of human history, human nature and the immutable laws of human action that have repeatedly asserted their primacy for thousands of years, we can concoct a vision for society that hasn’t been new since Plato first revealed it in The Republic.  2,351 years and mankind still can’t come up with anything new.  Those who don’t know history truly are doomed to repeat it.  How depressing!\nBut we must give Si credit for clearly demonstrating exactly what modern American liberalism has devolved into today.  It is latter-day socialism, dumbed-down to the point that it is too stupid to recognize itself in the mirror.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-02T13:22:00+00:00"
}