{
  "url": "https://voxday.net/2004/03/22/mailvox-oh-i-hadnt-noticed/",
  "scraped_at": "2025-12-13T15:56:05.397832",
  "title": "Mailvox: Oh, I hadn’t noticed",
  "date_display": "March 22, 2004",
  "date_iso": "2004-03-22T19:52:00+00:00",
  "date_from_url": "2004-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JJ writes: <em>I have written you before, Vox, and for the most part, I have agreed with your ideas. This time, I do not. For what it’s worth, I strongly disagree with the idea that home-schoolers love their children more than parents who send their kids to educational institutions, and I furthermore disagree that these institutions only propagandize children. This piece disparages parents who send their children to public schools, and it disparages the work of school teachers to educate children.</em></p><p>No, really?  Let’s see.  Who loves their children more?  Those who spend the time and effort to personally educate their children and make the financial sacrifice this often entails, or those who happily park them for eight hours a day so they can drive new SUVs and live in newly refinanced homes?  I argue that the former do, although as I have always admitted that it is not possible for everyone to homeschool, my criticism is clearly not applicable to all public school parents.  Furthermore, I not only disparage the work of school teachers, I cheerfully disparage the school teachers themselves.  There are always individual exceptions, but they are, on average, the least capable college students, the least intelligent college graduates, and taken in the collective, subscribe to a union that is one of the most socially destructive institutions outside of the federal government today.  I have zero respect for public school teachers, and yes, I can make a very damning prose case for it.</p><p><em>For the record, I send my daughter to public school. I plan on sending my son there next year. The school has a solid track record for educational results, and I have met with the teachers, administration, and student’s parents to assess the situation.</em></p><p>Yeah, I pretty much assumed something like that before I got to this point.  If you’re that hands-on and concerned, I imagine that you’ll be pulling them out soon enough.</p><p><em>All around this is the fact that my wife and I are constantly working with her after school and on weekends to improve her knowledge, her skills, and her critical and creative thinking…. Home schoolers do not love their children more than we love ours, Vox. I feel insulted by the insinuation. They just have a different opinion on schools. </em></p><p>That’s great, seriously.  Although if your children do graduate from public school I expect that you’ll think she did fine in public school, though her success will largely be because you half-homeschooled her anyhow.  I don’t doubt that most parents of public school children love their kids.  However, I know that very few of them have given the matter any serious thought at all, but instead simply do whatever everyone else is doing.  Since you appear to be of the opinion that I’m not a totally clueless fool, you might consider why I have no trouble declaring outright – not insinuating – that it is cruel to sentence a child to school, an act which indicates, at best, parental ignorance.</p><p>You see, we definitely have a different opinion on schools.  Mine is informed as to the true purpose of the classroom, yours is not.  I highly recommend you have a look at John Gatto’s work, <em>The Underground History of American Education</em>.</p></div>",
  "content_text": "JJ writes:\nI have written you before, Vox, and for the most part, I have agreed with your ideas. This time, I do not. For what it’s worth, I strongly disagree with the idea that home-schoolers love their children more than parents who send their kids to educational institutions, and I furthermore disagree that these institutions only propagandize children. This piece disparages parents who send their children to public schools, and it disparages the work of school teachers to educate children.\nNo, really?  Let’s see.  Who loves their children more?  Those who spend the time and effort to personally educate their children and make the financial sacrifice this often entails, or those who happily park them for eight hours a day so they can drive new SUVs and live in newly refinanced homes?  I argue that the former do, although as I have always admitted that it is not possible for everyone to homeschool, my criticism is clearly not applicable to all public school parents.  Furthermore, I not only disparage the work of school teachers, I cheerfully disparage the school teachers themselves.  There are always individual exceptions, but they are, on average, the least capable college students, the least intelligent college graduates, and taken in the collective, subscribe to a union that is one of the most socially destructive institutions outside of the federal government today.  I have zero respect for public school teachers, and yes, I can make a very damning prose case for it.\nFor the record, I send my daughter to public school. I plan on sending my son there next year. The school has a solid track record for educational results, and I have met with the teachers, administration, and student’s parents to assess the situation.\nYeah, I pretty much assumed something like that before I got to this point.  If you’re that hands-on and concerned, I imagine that you’ll be pulling them out soon enough.\nAll around this is the fact that my wife and I are constantly working with her after school and on weekends to improve her knowledge, her skills, and her critical and creative thinking…. Home schoolers do not love their children more than we love ours, Vox. I feel insulted by the insinuation. They just have a different opinion on schools.\nThat’s great, seriously.  Although if your children do graduate from public school I expect that you’ll think she did fine in public school, though her success will largely be because you half-homeschooled her anyhow.  I don’t doubt that most parents of public school children love their kids.  However, I know that very few of them have given the matter any serious thought at all, but instead simply do whatever everyone else is doing.  Since you appear to be of the opinion that I’m not a totally clueless fool, you might consider why I have no trouble declaring outright – not insinuating – that it is cruel to sentence a child to school, an act which indicates, at best, parental ignorance.\nYou see, we definitely have a different opinion on schools.  Mine is informed as to the true purpose of the classroom, yours is not.  I highly recommend you have a look at John Gatto’s work,\nThe Underground History of American Education\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-22T19:52:00+00:00"
}