{
  "url": "https://voxday.net/2004/03/23/mailvox-yeah-thats-kind-of-poin/",
  "scraped_at": "2025-12-13T15:56:06.861432",
  "title": "Mailvox: Yeah, that’s kind of the point",
  "date_display": "March 23, 2004",
  "date_iso": "2004-03-23T00:40:00+00:00",
  "date_from_url": "2004-03-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>RC writes: <em>Your poem assails all public schools alike (denigrating them as “government schools”).  I must inform you that there many excellent public schools, to which we can attest because we managed our kids through them successfully (and no, not only marginally). In fact, our children scored much higher on their ACTs/SATs than did their local private/parochial schools friends (who paid through the nose for the questionable “bragging rights”). All we hear is lamenting, ridicule, insults, and harassment from columnists and other media personnel toward public schools.  We never hear of a plan to help–only to tear down. </em></p><p>Am I not making myself sufficiently clear?  I do not wish the public schools to be “fixed”, anymore than I wish to “fix” Sudanese slavery.  I would like to do to the public school system what Rome did to Carthage.  If these champions of public schooling understood the purpose behind public schooling, which is not to teach, but to indoctrinate and cripple, they would understand why my contempt for it is based on both experience and theory.  The purpose of education is not what you think it is, moreover, it has not been since Dewey and his sponsors.  If you do not know who William Torrey Harris was, then you will almost surely not understand my position or why he would say: “Ninety-nine out of a hundred are automata, careful to walk in the prescribed paths, careful to follow the prescribed custom.  This is not an accident but the result of substantial education, which, scientifically defined, is the subsumption of the individual.”</p><p><em>We will not help society one bit by such poems or by otherwise throwing “stones” at public schools from the comfort of our pristine homes or private prep schools.  This will only demonstrate that we are arrogant and elitists who are happy to criticize from afar as we push for measures to further diminish and divide. We have met many with this mindset.  We are not impressed.</em></p><p>“We” are obviously confusing me for someone who gives an airborne rodent’s posterior.  And yet, RC is right with regards to one thing.  We shouldn’t throw stones at public schools.  Society would be much better off if we simply burned them all to the ground.  You can’t fix what is working as designed.</p></div>",
  "content_text": "RC writes:\nYour poem assails all public schools alike (denigrating them as “government schools”).  I must inform you that there many excellent public schools, to which we can attest because we managed our kids through them successfully (and no, not only marginally). In fact, our children scored much higher on their ACTs/SATs than did their local private/parochial schools friends (who paid through the nose for the questionable “bragging rights”). All we hear is lamenting, ridicule, insults, and harassment from columnists and other media personnel toward public schools.  We never hear of a plan to help–only to tear down.\nAm I not making myself sufficiently clear?  I do not wish the public schools to be “fixed”, anymore than I wish to “fix” Sudanese slavery.  I would like to do to the public school system what Rome did to Carthage.  If these champions of public schooling understood the purpose behind public schooling, which is not to teach, but to indoctrinate and cripple, they would understand why my contempt for it is based on both experience and theory.  The purpose of education is not what you think it is, moreover, it has not been since Dewey and his sponsors.  If you do not know who William Torrey Harris was, then you will almost surely not understand my position or why he would say: “Ninety-nine out of a hundred are automata, careful to walk in the prescribed paths, careful to follow the prescribed custom.  This is not an accident but the result of substantial education, which, scientifically defined, is the subsumption of the individual.”\nWe will not help society one bit by such poems or by otherwise throwing “stones” at public schools from the comfort of our pristine homes or private prep schools.  This will only demonstrate that we are arrogant and elitists who are happy to criticize from afar as we push for measures to further diminish and divide. We have met many with this mindset.  We are not impressed.\n“We” are obviously confusing me for someone who gives an airborne rodent’s posterior.  And yet, RC is right with regards to one thing.  We shouldn’t throw stones at public schools.  Society would be much better off if we simply burned them all to the ground.  You can’t fix what is working as designed.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-23T00:40:00+00:00"
}