{
  "url": "https://voxday.net/2004/03/23/mailvox-socialism-of-schoo/",
  "scraped_at": "2025-12-13T15:56:16.758952",
  "title": "Mailvox: the socialism of school",
  "date_display": "March 23, 2004",
  "date_iso": "2004-03-23T19:31:00+00:00",
  "date_from_url": "2004-03-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jamsco replies: <em>Again, having something in common with socialists doesn’t make you a socialist. I assume that communists hold meeting to make decisions. Does that make meetings communistic?</em></p><p>That’s true, but only at the most superficial level.  We’re all human oxygen-breathers, for example.  However, having something general in common with socialists and advocating the tenth pillar of the Communist manifesto – “10. Free education for all children in public schools” – are two very substantively different matters.  So, yes, supporting free education for all children in public schools is at the very least communistic, just as supporting “abolition of property in land” would be.</p><p>And compared the ludicrous stretch of imagination involved in equating the average right-wing Republican with a member of the National Socialist German Worker’s Party, it would be most reasonable to label a supporter of public schooling a communist.  I wouldn’t and I don’t, since most people have given no more thought to the nature of public schooling than they have to the Labor Theory of value, but I have no problem labling the NEA and its activists as such.  If someone was advocating <em>lebensraum</em> and a second <em>Endlosung,</em> I doubt Jamsco would have any problem labling them a Nazi.  So, what is the difference here?  And how many of those ten pillars need one actively support before it is appropriate to label them a socialist or communist?</p><p>Keep in mind that public schooling is as necessary a component of modern totalitarian rule as gun control.  It is very difficult to engineer a society without control of the children.  They are, to paraphrase Lenin, the high ground.  That is precisely why the homeschooling movement terrifies the NEA, as it strikes at the heart of their power.</p></div>",
  "content_text": "Jamsco replies:\nAgain, having something in common with socialists doesn’t make you a socialist. I assume that communists hold meeting to make decisions. Does that make meetings communistic?\nThat’s true, but only at the most superficial level.  We’re all human oxygen-breathers, for example.  However, having something general in common with socialists and advocating the tenth pillar of the Communist manifesto – “10. Free education for all children in public schools” – are two very substantively different matters.  So, yes, supporting free education for all children in public schools is at the very least communistic, just as supporting “abolition of property in land” would be.\nAnd compared the ludicrous stretch of imagination involved in equating the average right-wing Republican with a member of the National Socialist German Worker’s Party, it would be most reasonable to label a supporter of public schooling a communist.  I wouldn’t and I don’t, since most people have given no more thought to the nature of public schooling than they have to the Labor Theory of value, but I have no problem labling the NEA and its activists as such.  If someone was advocating\nlebensraum\nand a second\nEndlosung,\nI doubt Jamsco would have any problem labling them a Nazi.  So, what is the difference here?  And how many of those ten pillars need one actively support before it is appropriate to label them a socialist or communist?\nKeep in mind that public schooling is as necessary a component of modern totalitarian rule as gun control.  It is very difficult to engineer a society without control of the children.  They are, to paraphrase Lenin, the high ground.  That is precisely why the homeschooling movement terrifies the NEA, as it strikes at the heart of their power.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-23T19:31:00+00:00"
}