{
  "url": "https://voxday.net/2004/03/31/mises-on-two-socialist-strains/",
  "scraped_at": "2025-12-13T15:57:38.506245",
  "title": "Mises on two socialist strains",
  "date_display": "March 31, 2004",
  "date_iso": "2004-03-31T15:36:00+00:00",
  "date_from_url": "2004-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Mises Institute, <a href=\"http://www.mises.org/fullstory.asp?control=1484\">published in 1944</a>:<em>The Bolshevists set the precedent. The success of the Lenin clique encouraged the Mussolini gang and the Hitler troops. Both Italian Fascism and German Nazism adopted the political methods of Soviet Russia. The only difference between Nazism and Bolshevism is that the Nazis got a much bigger minority in the elections preceding their coup d’état than the Bolsheviks got in the Russian elections in the fall of 1917.</em></p><p>The Nazis have not only imitated the Bolshevist tactics of seizing power. They have copied much more. They have imported from Russia the one-party system and the privileged role of this party and its members in public life; the paramount position of the secret police; the organization of affiliated parties abroad which are employed in fighting their domestic governments and in sabotage and espionage, assisted by public funds and the protection of the diplomatic and consular service; the administrative execution and imprisonment of political adversaries; concentration camps; the punishment inflicted on the families of exiles; the methods of propaganda. They have borrowed from the Marxians even such absurdities as the mode of address, party comrade (Parteigenosse), derived from the Marxian comrade (Genosse), and the use of a military terminology for all items of civil and economic life. <strong>The question is not in which respects both systems are alike but in which they differ</strong>.</p><p>It has already been shown wherein the socialist patterns of Russia and Germany differ. These differences are not due to any disparity in basic philosophical views; they are the necessary con­sequence of the differences in the economic conditions of the two countries. The Russian pattern was inapplicable in Germany, whose population cannot live in a state of self-sufficiency. The German pattern seems very inefficient when compared with the incompa­rably more efficient capitalist system, but it is far more efficient than the Russian method. The Russians live at a very low economic level notwithstanding the inexhaustible richness of their natural resources.There is inequality of incomes and of standards of living in both countries. It would be futile to try to determine whether the difference in the living standards of party comrade Goering and the average party comrade is greater or smaller than that in the standards of comrade Stalin and his comrades. <strong>The characteristic feature of socialism is not equality of income but the all‑round control of business activities by the government, the government’s exclusive power to use all means of production.</strong></p><p>The Nazis do not reject Marxism because it aims at socialism but because, as they say, it advocates internationalism. Marx’s internationalism was nothing but the acceptance of eighteenth-century ideas on the root causes of war: princes are eager to fight each other because they want aggrandizement through conquest, while free nations do not covet their neighbors’ land. But it never occurred to Marx that this propensity to peace depends upon the existence of an unhampered market society. Neither Marx nor his school was ever able to grasp the meaning of international conflicts within a world of etatism and socialism. They contented themselves with the assertion that in the Promised Land of socialism there would no longer be any conflicts at all.</p><p>It will never cease to amaze me how socialists attempt to deny, deny, deny that the National Socialist German Worker’s Party was a socialist institution.  Never mind the copious words and writings of every Nazi leader.  Never mind the party’s explicit platform.  Now, of course, they’re attempting to deny Marx, Lenin and the Communists.  I imagine they’d deny the Fabians too if the Fabians had ever managed to kill anybody.  Apparently all historical socialism was not, in fact, socialism.  About the kindest thing I can say for modern socialists and their dumbed-down kin is that they’re as intellectually bankrupt as their philosophy.</p></div>",
  "content_text": "From the Mises Institute,\npublished in 1944\n:\nThe Bolshevists set the precedent. The success of the Lenin clique encouraged the Mussolini gang and the Hitler troops. Both Italian Fascism and German Nazism adopted the political methods of Soviet Russia. The only difference between Nazism and Bolshevism is that the Nazis got a much bigger minority in the elections preceding their coup d’état than the Bolsheviks got in the Russian elections in the fall of 1917.\nThe Nazis have not only imitated the Bolshevist tactics of seizing power. They have copied much more. They have imported from Russia the one-party system and the privileged role of this party and its members in public life; the paramount position of the secret police; the organization of affiliated parties abroad which are employed in fighting their domestic governments and in sabotage and espionage, assisted by public funds and the protection of the diplomatic and consular service; the administrative execution and imprisonment of political adversaries; concentration camps; the punishment inflicted on the families of exiles; the methods of propaganda. They have borrowed from the Marxians even such absurdities as the mode of address, party comrade (Parteigenosse), derived from the Marxian comrade (Genosse), and the use of a military terminology for all items of civil and economic life.\nThe question is not in which respects both systems are alike but in which they differ\n.\nIt has already been shown wherein the socialist patterns of Russia and Germany differ. These differences are not due to any disparity in basic philosophical views; they are the necessary con­sequence of the differences in the economic conditions of the two countries. The Russian pattern was inapplicable in Germany, whose population cannot live in a state of self-sufficiency. The German pattern seems very inefficient when compared with the incompa­rably more efficient capitalist system, but it is far more efficient than the Russian method. The Russians live at a very low economic level notwithstanding the inexhaustible richness of their natural resources.There is inequality of incomes and of standards of living in both countries. It would be futile to try to determine whether the difference in the living standards of party comrade Goering and the average party comrade is greater or smaller than that in the standards of comrade Stalin and his comrades.\nThe characteristic feature of socialism is not equality of income but the all‑round control of business activities by the government, the government’s exclusive power to use all means of production.\nThe Nazis do not reject Marxism because it aims at socialism but because, as they say, it advocates internationalism. Marx’s internationalism was nothing but the acceptance of eighteenth-century ideas on the root causes of war: princes are eager to fight each other because they want aggrandizement through conquest, while free nations do not covet their neighbors’ land. But it never occurred to Marx that this propensity to peace depends upon the existence of an unhampered market society. Neither Marx nor his school was ever able to grasp the meaning of international conflicts within a world of etatism and socialism. They contented themselves with the assertion that in the Promised Land of socialism there would no longer be any conflicts at all.\nIt will never cease to amaze me how socialists attempt to deny, deny, deny that the National Socialist German Worker’s Party was a socialist institution.  Never mind the copious words and writings of every Nazi leader.  Never mind the party’s explicit platform.  Now, of course, they’re attempting to deny Marx, Lenin and the Communists.  I imagine they’d deny the Fabians too if the Fabians had ever managed to kill anybody.  Apparently all historical socialism was not, in fact, socialism.  About the kindest thing I can say for modern socialists and their dumbed-down kin is that they’re as intellectually bankrupt as their philosophy.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-31T14:36:00+00:00"
}