{
  "url": "https://voxday.net/2004/03/11/mogambo-2/",
  "scraped_at": "2025-12-13T15:53:58.335923",
  "title": "MOGAMBO!",
  "date_display": "March 11, 2004",
  "date_iso": "2004-03-11T19:25:00+00:00",
  "date_from_url": "2004-03-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The genius blesses us with his words: <em>And I’m not supposed to tell you this, so keep this under your hat, but you know that Mars Rover thing? You know, the one where these two armored vehicles are running around Mars, sampling things and looking at things? The truth is, and don’t tell anyone I told you, that Mars was actually the first planet in this solar system that had a central bank and a fiat currency. Yeah! Surprised, huh? And now look at it! No water, no air, no Starbucks, no nothing! In fact, Earth was originally populated by a few rich Martians who barely escaped the devastation of Mars when the inflation reduced the value of the currency to the point where the economy was destroyed, and then the people were destroyed, and then the planet was destroyed. They barely made it here with their lives!</em></p><p>And I call myself a fiction writer.  Pah!  Unworthy, unworthy!  The man can out-imagine Kim Stanley Robinson in a throwaway paragraph.</p></div>",
  "content_text": "The genius blesses us with his words:\nAnd I’m not supposed to tell you this, so keep this under your hat, but you know that Mars Rover thing? You know, the one where these two armored vehicles are running around Mars, sampling things and looking at things? The truth is, and don’t tell anyone I told you, that Mars was actually the first planet in this solar system that had a central bank and a fiat currency. Yeah! Surprised, huh? And now look at it! No water, no air, no Starbucks, no nothing! In fact, Earth was originally populated by a few rich Martians who barely escaped the devastation of Mars when the inflation reduced the value of the currency to the point where the economy was destroyed, and then the people were destroyed, and then the planet was destroyed. They barely made it here with their lives!\nAnd I call myself a fiction writer.  Pah!  Unworthy, unworthy!  The man can out-imagine Kim Stanley Robinson in a throwaway paragraph.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-11T19:25:00+00:00"
}