{
  "url": "https://voxday.net/2004/03/31/never-trust-republican-leader/",
  "scraped_at": "2025-12-13T15:57:40.338538",
  "title": "Never trust a Republican leader",
  "date_display": "March 31, 2004",
  "date_iso": "2004-03-31T17:36:00+00:00",
  "date_from_url": "2004-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That advice would have served this guy well: <em>Republican leaders have broken a promise they made to expose the shocking contents of memos exchanged among Senate Judiciary Committee Democrats, says Manuel Miranda, the former GOP aide who is the whistleblower at the center of the so-called Memogate scandal.  Miranda told Insight in an exclusive interview that both Senate Majority Leader Bill Frist, R-Tenn., and Senate Judiciary Committee Chairman Orrin Hatch, R-Utah, broke clearly stated promises to expose collusion between top Democrats and special-interest groups seeking to thwart President Bush’s nominees to federal courts.</em></p><p>“Sen. Hatch told me specifically, point blank, that if I resigned he could then talk about the substance of the memos,” Miranda tells Insight. “I was told by the Frist office that, if I resigned, the Democrats would basically calm down” and the Republicans could make the memos public.  Miranda said the same promises were made to conservative groups that assist the Republicans in gaining support for judicial nominees. </p><p>But we can trust them when they tell us that if we just re-elect George Delano, they’ll start putting that super-secret plan into action, the one in which they roll back all the damage they’ve done to the Constitution, the budget and the economy, right?  Sometimes I wonder if George Delano’s defenders are even listening to themselves – those who claim the war-on-method trumps all excluded – I mean, if you’re clinging to hopes of super-secret second-term plans, you are in for a world of disappointment.  The sad thing is, they’ll probably get suckered by the next faux conservative to come along and whisper sweet conservative nothings.</p><p>If you’re going to peddle your ass for power, don’t be surprised when no one stands up for your virtue.</p></div>",
  "content_text": "That advice would have served this guy well:\nRepublican leaders have broken a promise they made to expose the shocking contents of memos exchanged among Senate Judiciary Committee Democrats, says Manuel Miranda, the former GOP aide who is the whistleblower at the center of the so-called Memogate scandal.  Miranda told Insight in an exclusive interview that both Senate Majority Leader Bill Frist, R-Tenn., and Senate Judiciary Committee Chairman Orrin Hatch, R-Utah, broke clearly stated promises to expose collusion between top Democrats and special-interest groups seeking to thwart President Bush’s nominees to federal courts.\n“Sen. Hatch told me specifically, point blank, that if I resigned he could then talk about the substance of the memos,” Miranda tells Insight. “I was told by the Frist office that, if I resigned, the Democrats would basically calm down” and the Republicans could make the memos public.  Miranda said the same promises were made to conservative groups that assist the Republicans in gaining support for judicial nominees.\nBut we can trust them when they tell us that if we just re-elect George Delano, they’ll start putting that super-secret plan into action, the one in which they roll back all the damage they’ve done to the Constitution, the budget and the economy, right?  Sometimes I wonder if George Delano’s defenders are even listening to themselves – those who claim the war-on-method trumps all excluded – I mean, if you’re clinging to hopes of super-secret second-term plans, you are in for a world of disappointment.  The sad thing is, they’ll probably get suckered by the next faux conservative to come along and whisper sweet conservative nothings.\nIf you’re going to peddle your ass for power, don’t be surprised when no one stands up for your virtue.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-31T16:36:00+00:00"
}