{
  "url": "https://voxday.net/2004/03/19/not-exactly-shocked/",
  "scraped_at": "2025-12-13T15:55:30.618263",
  "title": "Not exactly shocked",
  "date_display": "March 19, 2004",
  "date_iso": "2004-03-19T18:00:00+00:00",
  "date_from_url": "2004-03-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Readers aren’t burning for “Burning Down My Masters’ House,” Jayson Blair’s memoir of his ill-fated New York Times career.  Nielsen Bookscan reports the book sold just 1,386 copies through last Sunday, according to yesterday’s PW Newsline, an E-mail from Publishers Weekly.  Bookscan tracks roughly 70% of the market, excluding Wal-Mart, so the total would be higher. But given Blair’s wide exposure on NBC, a variety of local affiliates and the cable news networks, the results look low indeed.</em></p><p>Well, who would want to buy this thing?  Conservatives already know the NYT is full of <em>merde</em>.  Left-leaning NYT lovers didn’t want to know anything about it in the first place.  Blair’s book deal must have been offered by the same sort of geniuses who were certain the Passion was going to be a bomb.</p><p>UPDATE: And now USA Today!  Of course, if newspaper editors understood the first thing about economics, and they don’t, they would have subjected that idiot Krugman to the same treatment long ago.  Maureen Dowd and Frank Rich are morons, but they are at least as honest as their feeble understanding of the world will allow.  Krugman, on the other hand, gets basic statistics wrong on a regular basis, uses them incorrectly to reach nonsensical conclusions, and then recommends ludicrous solutions – occasionally to imaginary problems.  Yes, I’m sure MORE government intervention in the economy is always the answer.  Obviously when someone is dying of arsenic poisoning, shooting them up with an arsenic-cyanide cocktail will sort them out in no time.  His is a virtuoso demonstration that it is possible to be both evil AND stupid.</p></div>",
  "content_text": "Readers aren’t burning for “Burning Down My Masters’ House,” Jayson Blair’s memoir of his ill-fated New York Times career.  Nielsen Bookscan reports the book sold just 1,386 copies through last Sunday, according to yesterday’s PW Newsline, an E-mail from Publishers Weekly.  Bookscan tracks roughly 70% of the market, excluding Wal-Mart, so the total would be higher. But given Blair’s wide exposure on NBC, a variety of local affiliates and the cable news networks, the results look low indeed.\nWell, who would want to buy this thing?  Conservatives already know the NYT is full of\nmerde\n.  Left-leaning NYT lovers didn’t want to know anything about it in the first place.  Blair’s book deal must have been offered by the same sort of geniuses who were certain the Passion was going to be a bomb.\nUPDATE: And now USA Today!  Of course, if newspaper editors understood the first thing about economics, and they don’t, they would have subjected that idiot Krugman to the same treatment long ago.  Maureen Dowd and Frank Rich are morons, but they are at least as honest as their feeble understanding of the world will allow.  Krugman, on the other hand, gets basic statistics wrong on a regular basis, uses them incorrectly to reach nonsensical conclusions, and then recommends ludicrous solutions – occasionally to imaginary problems.  Yes, I’m sure MORE government intervention in the economy is always the answer.  Obviously when someone is dying of arsenic poisoning, shooting them up with an arsenic-cyanide cocktail will sort them out in no time.  His is a virtuoso demonstration that it is possible to be both evil AND stupid.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-19T18:00:00+00:00"
}