{
  "url": "https://voxday.net/2004/03/29/offense-is-best-defense/",
  "scraped_at": "2025-12-13T15:57:09.851330",
  "title": "Offense is the best defense",
  "date_display": "March 29, 2004",
  "date_iso": "2004-03-29T14:03:00+00:00",
  "date_from_url": "2004-03-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mike Adams writes: <em>Well, I suppose it had to happen. After eleven years of teaching at a public university, I finally got a call from one of my superiors informing me that I had made one of my co-workers feel “uncomfortable” in the workplace.  For those who may not know, the right to feel “comfortable” at all times trumps the First Amendment at most public universities.  Naturally, when I found out that I made a co-worker feel “uncomfortable,” I wanted to know what I had said or done to produce such an unthinkable result. That was when I learned that the “discomfort” occurred because I had been discussing some of my weekly columns here in the workplace (i.e., at the public university).  The penalty for that transgression was simple: a ban on discussing my columns in the office in front of those who might be offended by my opinions. This was accompanied by the shocking revelation that “not everyone sees things the way you do, Mike.” </em></p><p>Here’s what I don’t understand about conservatives.  If I was ever presented with such an outrageous demand, I would tell the person that they could stick something very prickly in a place that would make them very uncomfortable, doing so with words carefully chosen to make them feel uncomfortable.  Prof. Adams goes on to write <a href=\"http://www.townhall.com/columnists/mikeadams/ma20040329.shtml\">an amusing column</a> about his hypothetical response, but it doesn’t obscure the apparent fact that he caved.</p><p>As I’ve previously written, the only way to handle these passive-aggressive control freaks is to up the ante.  They object to “girl” start using “bitch” in front of them.  If they complain about “queer” then use “flamer”.  They’re only trying to unsettle you by making you feel guilty; once you make it clear that you not only don’t feel guilty but are perfectly willing to unsettle them, they give the whole thing up as a bad cause.</p></div>",
  "content_text": "Mike Adams writes:\nWell, I suppose it had to happen. After eleven years of teaching at a public university, I finally got a call from one of my superiors informing me that I had made one of my co-workers feel “uncomfortable” in the workplace.  For those who may not know, the right to feel “comfortable” at all times trumps the First Amendment at most public universities.  Naturally, when I found out that I made a co-worker feel “uncomfortable,” I wanted to know what I had said or done to produce such an unthinkable result. That was when I learned that the “discomfort” occurred because I had been discussing some of my weekly columns here in the workplace (i.e., at the public university).  The penalty for that transgression was simple: a ban on discussing my columns in the office in front of those who might be offended by my opinions. This was accompanied by the shocking revelation that “not everyone sees things the way you do, Mike.”\nHere’s what I don’t understand about conservatives.  If I was ever presented with such an outrageous demand, I would tell the person that they could stick something very prickly in a place that would make them very uncomfortable, doing so with words carefully chosen to make them feel uncomfortable.  Prof. Adams goes on to write\nan amusing column\nabout his hypothetical response, but it doesn’t obscure the apparent fact that he caved.\nAs I’ve previously written, the only way to handle these passive-aggressive control freaks is to up the ante.  They object to “girl” start using “bitch” in front of them.  If they complain about “queer” then use “flamer”.  They’re only trying to unsettle you by making you feel guilty; once you make it clear that you not only don’t feel guilty but are perfectly willing to unsettle them, they give the whole thing up as a bad cause.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-29T13:03:00+00:00"
}