{
  "url": "https://voxday.net/2004/03/25/on-clarke-and-coulter/",
  "scraped_at": "2025-12-13T15:56:40.355268",
  "title": "On Clarke and Coulter",
  "date_display": "March 25, 2004",
  "date_iso": "2004-03-25T23:00:00+00:00",
  "date_from_url": "2004-03-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>TS writes: <em>I must take issue with your comments regarding Ann Coulter’s column on Richard Clarke.  I thought that it was, basically, spitballs against a battleship, to use a time-worn phrase.  You’ll note that Coulter’s column mentions only two specifics regarding Clarke, his “interpretation” of Condeleeza Rice’s facial expression (taking half the column) and “6 unanswered attacks” (not true, by the way).  This is hardly a “demolition of Richard Clarke”. </em></p><p>I think it was a demolition of Richard Clarke, the man, not necessarily his case.  I have little respect for someone who, while in power, can’t be bothered to do anything, but now that he’s out of it, is claiming that he was ringing the alarm bell.  He certainly didn’t think it was important enough to risk his career over, did he.  His points about Rice were not only inaccurate, but downright strange.</p><p><em>I watched all of Clarke’s open-session testimony yesterday on C-SPAN and found it quite believable (not to mention riveting).  Attempts by panel members to go after him, especially by Gov. Thompson, were failures. Where do you think Clarke told untruths/lies?  Yes, terrorism happened on his watch.  He acknowledges this and apologizes for it.  But there’s plenty of blame to go around here, and his is the voice of (bitter) experience. Why do you insinuate he is a “left-liberal”? </em></p><p>From what I heard on Hannity’s radio show yesterday, the entire panel is a charade.  The Clinton administration did have an opportunity, several, apparently, to get not only bin Laden but also the two financial backers of the attack on the Cole, and turned it down.  Both sides are covering this up; we’ll see if the woman who called in and claimed to have the documents – she was an non-governmental intermediary – can back up her story, which puts the lie to both sides.  I don’t think Clarke is a left-liberal, I think he’s being used as a hammer by left-liberals.  His personal views are irrelevant, as I neither question his motives nor care about them.</p><p><em>As I’m sure you must know, he also was a member of the Reagan and Bush (1) administrations. I’m not Conservative, nor Liberal, but Libertarian.  I’m only interested in the truth here.  And Ann Coulter’s column made no contribution to this…</em></p><p>It’s true, Ann is sometimes more interested in playing Republican attack dog than delving into the truth.  As much as I adore her, and today’s column was a lovely piece of slicing-and-dicing, she does not always appear to be particularly interested in discovering the truth, much less the whole truth.  I expect that far from both administrations being innocent, the truth is that both were guilty of extreme incompetence at the very least.</p></div>",
  "content_text": "TS writes:\nI must take issue with your comments regarding Ann Coulter’s column on Richard Clarke.  I thought that it was, basically, spitballs against a battleship, to use a time-worn phrase.  You’ll note that Coulter’s column mentions only two specifics regarding Clarke, his “interpretation” of Condeleeza Rice’s facial expression (taking half the column) and “6 unanswered attacks” (not true, by the way).  This is hardly a “demolition of Richard Clarke”.\nI think it was a demolition of Richard Clarke, the man, not necessarily his case.  I have little respect for someone who, while in power, can’t be bothered to do anything, but now that he’s out of it, is claiming that he was ringing the alarm bell.  He certainly didn’t think it was important enough to risk his career over, did he.  His points about Rice were not only inaccurate, but downright strange.\nI watched all of Clarke’s open-session testimony yesterday on C-SPAN and found it quite believable (not to mention riveting).  Attempts by panel members to go after him, especially by Gov. Thompson, were failures. Where do you think Clarke told untruths/lies?  Yes, terrorism happened on his watch.  He acknowledges this and apologizes for it.  But there’s plenty of blame to go around here, and his is the voice of (bitter) experience. Why do you insinuate he is a “left-liberal”?\nFrom what I heard on Hannity’s radio show yesterday, the entire panel is a charade.  The Clinton administration did have an opportunity, several, apparently, to get not only bin Laden but also the two financial backers of the attack on the Cole, and turned it down.  Both sides are covering this up; we’ll see if the woman who called in and claimed to have the documents – she was an non-governmental intermediary – can back up her story, which puts the lie to both sides.  I don’t think Clarke is a left-liberal, I think he’s being used as a hammer by left-liberals.  His personal views are irrelevant, as I neither question his motives nor care about them.\nAs I’m sure you must know, he also was a member of the Reagan and Bush (1) administrations. I’m not Conservative, nor Liberal, but Libertarian.  I’m only interested in the truth here.  And Ann Coulter’s column made no contribution to this…\nIt’s true, Ann is sometimes more interested in playing Republican attack dog than delving into the truth.  As much as I adore her, and today’s column was a lovely piece of slicing-and-dicing, she does not always appear to be particularly interested in discovering the truth, much less the whole truth.  I expect that far from both administrations being innocent, the truth is that both were guilty of extreme incompetence at the very least.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-25T23:00:00+00:00"
}