{
  "url": "https://voxday.net/2004/03/15/orbiting-my-own-plane/",
  "scraped_at": "2025-12-13T15:54:46.115233",
  "title": "Orbiting my own planet",
  "date_display": "March 15, 2004",
  "date_iso": "2004-03-15T23:47:00+00:00",
  "date_from_url": "2004-03-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>DR takes exception: <em>I don’t mean to be unkind.  But has anyone ever told you how spooky and weird you look?  What the hell is with that haircut?  I’ll bet your parents are heartbroken that you would go on a national website looking like a nincompoop.  You look like a cross between a white-supremest skin head and one of those Raelians that was in the news last year.  Then combine that with an obviously imaginary name like “Vox” –  for god’s sakes!  Really – What kind of an image is this for a supposed “Christian” news commentator?  I would have a hard time taking anything you write seriously.  You look like you would be a handsome man without that fucked up haircut.</em></p><p>It’s so hard to type through the tears.  These sort of emails always greatly amuse me.  Do I write or look as if I give an airborne rodent’s posterior about the general public’s attitude about my name or my appearance?  I’m not saying my indifference is total, but it’s really very close.  In this sphere, it is ideas that matter to me.  If someone objects to Austrian theory because I happen to shave the sides of my head, I don’t even know where or how to begin talking to them.</p><p>And then, of course, there’s the fact that I met Space Bunny precisely because of this, and I quote, “fucked up haircut”.  Lessons in style 101: the hot blonde chick is always right.</p></div>",
  "content_text": "DR takes exception:\nI don’t mean to be unkind.  But has anyone ever told you how spooky and weird you look?  What the hell is with that haircut?  I’ll bet your parents are heartbroken that you would go on a national website looking like a nincompoop.  You look like a cross between a white-supremest skin head and one of those Raelians that was in the news last year.  Then combine that with an obviously imaginary name like “Vox” –  for god’s sakes!  Really – What kind of an image is this for a supposed “Christian” news commentator?  I would have a hard time taking anything you write seriously.  You look like you would be a handsome man without that fucked up haircut.\nIt’s so hard to type through the tears.  These sort of emails always greatly amuse me.  Do I write or look as if I give an airborne rodent’s posterior about the general public’s attitude about my name or my appearance?  I’m not saying my indifference is total, but it’s really very close.  In this sphere, it is ideas that matter to me.  If someone objects to Austrian theory because I happen to shave the sides of my head, I don’t even know where or how to begin talking to them.\nAnd then, of course, there’s the fact that I met Space Bunny precisely because of this, and I quote, “fucked up haircut”.  Lessons in style 101: the hot blonde chick is always right.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-15T23:47:00+00:00"
}