{
  "url": "https://voxday.net/2004/03/22/organizational-rules-are-not-law/",
  "scraped_at": "2025-12-13T15:55:59.840786",
  "title": "Organizational rules are not  law",
  "date_display": "March 22, 2004",
  "date_iso": "2004-03-22T15:50:00+00:00",
  "date_from_url": "2004-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Peter King writes: <em>Did the NFL not read Owens’ contract? Did the NFL not understand that it could certainly be up for debate that Owens didn’t have to live with a new date to void contracts because he signed his deal with San Francisco before the new date to void was put into effect? I, and almost every other media person covering this story, should take a great lesson from this….</em></p><p>I wish the media would learn to stop listening to what purported authorities tell it and actually look at things for themselves from time to time.  Perhaps they’d stop believing not only the NFL, but the IRS as well, every time the organization insists that the law says what it does not, in fact, say.  Like the NFL, the IRS believes that it’s internally developed rules are synonymous with the law.  Such is the arrogance of power.</p></div>",
  "content_text": "Peter King writes:\nDid the NFL not read Owens’ contract? Did the NFL not understand that it could certainly be up for debate that Owens didn’t have to live with a new date to void contracts because he signed his deal with San Francisco before the new date to void was put into effect? I, and almost every other media person covering this story, should take a great lesson from this….\nI wish the media would learn to stop listening to what purported authorities tell it and actually look at things for themselves from time to time.  Perhaps they’d stop believing not only the NFL, but the IRS as well, every time the organization insists that the law says what it does not, in fact, say.  Like the NFL, the IRS believes that it’s internally developed rules are synonymous with the law.  Such is the arrogance of power.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-22T15:50:00+00:00"
}