{
  "url": "https://voxday.net/2004/03/19/random-idea/",
  "scraped_at": "2025-12-13T15:55:22.509437",
  "title": "A random idea",
  "date_display": "March 19, 2004",
  "date_iso": "2004-03-19T05:13:00+00:00",
  "date_from_url": "2004-03-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In looking up that old column on Sullivan and Kinsley, I noticed that I’d completely forgotten about a number of old columns.  And since WND Books has little interest in substantive books dealing with theory of the sort I’m interested in writing – not to blame them, as apparently America really wants to read nothing more than the random jottings of radio show hosts – I was wondering how many people might be interested in a collection of the best ones, with perhaps a chapter or two devoted to selections from this blog.</p><p>I have a friend who has a book printing and binding business, and I was thinking that if enough people were interested, I might look into doing a small 250-unit print run.  He did a book on Tuscan wines that was really nice – remembering that got me thinking about the possibility.  I’m not thinking of it as something to try to bump Sean Hannity off the bestseller lists, but more as a historical record of sorts.  It’s not a vanity project to get my name in print, I got over that thrill two books ago.</p><p>And then, there’s the inevitable question.  Paperback or hardcover? Fancy leather-bound collector’s edition or simple political style book, with the <em>de rigeur</em> head-and-shoulders shot superimposed over the American flag?  I suppose a mockery of that using the <a href=\"http://www.gadsden.info/\">classic Gadsden flag</a> would be more appropriate.  There will, of course, be a special Rebel version for Nate, complete with an autographed .357 hollow point.</p><p>I think I’d call it <em>Live Free or Else</em>.</p></div>",
  "content_text": "In looking up that old column on Sullivan and Kinsley, I noticed that I’d completely forgotten about a number of old columns.  And since WND Books has little interest in substantive books dealing with theory of the sort I’m interested in writing – not to blame them, as apparently America really wants to read nothing more than the random jottings of radio show hosts – I was wondering how many people might be interested in a collection of the best ones, with perhaps a chapter or two devoted to selections from this blog.\nI have a friend who has a book printing and binding business, and I was thinking that if enough people were interested, I might look into doing a small 250-unit print run.  He did a book on Tuscan wines that was really nice – remembering that got me thinking about the possibility.  I’m not thinking of it as something to try to bump Sean Hannity off the bestseller lists, but more as a historical record of sorts.  It’s not a vanity project to get my name in print, I got over that thrill two books ago.\nAnd then, there’s the inevitable question.  Paperback or hardcover? Fancy leather-bound collector’s edition or simple political style book, with the\nde rigeur\nhead-and-shoulders shot superimposed over the American flag?  I suppose a mockery of that using the\nclassic Gadsden flag\nwould be more appropriate.  There will, of course, be a special Rebel version for Nate, complete with an autographed .357 hollow point.\nI think I’d call it\nLive Free or Else\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-19T05:13:00+00:00"
}