{
  "url": "https://voxday.net/2004/03/14/ribbon-that-becomes-you-coffee-boy/",
  "scraped_at": "2025-12-13T15:54:28.154145",
  "title": "The ribbon that becomes you, coffee boy",
  "date_display": "March 14, 2004",
  "date_iso": "2004-03-14T07:24:00+00:00",
  "date_from_url": "2004-03-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I hope Strange Semantics takes the Austrian quiz.  His <a href=\"http://strangesemantics.blogspot.com/2004_03_01_strangesemantics_archive.html#107922158800198133\">critique of my view of the Left </a> demonstrates that the poor guy just has no clue what I’m talking about, as his theoretical knowledge of foundational matters appears to be nonexistent.  Seriously, SS, do take the quiz.  Tell me how you scored and which questions you understood.  You’re a bright guy, you’ll understand some although you surely won’t grasp them all, as I doubt you could define the difference between Chicago and Keynes, much less Austria and Chicago.</p><p>But I’ll answer your question.  The reason the Left is blind is that it doesn’t know its own basic theories.  What is value?  What is money?  What is a market?  What is the opportunity cost of regulation?  These are elementary questions, and yet would-be Leftist political philosophers not only don’t have answers to these questions, they don’t know the answers that were provided over a hundred years ago by those who fathered the theories which laid the foundation for what they are now espousing in ignorance.</p><p>The reason I don’t have to explain these concepts, and the reason so many people reading this site understand what I’m talking about without me having to explain them, is that they are nothing new.  They’ve been around for decades, if not centuries in some cases, and we are speaking a language that you do not yet know.  For example, Hayek proved the impossibility of socialist calculation more than 60 years ago.  If you are aware of that, then the silliness of such endeavors becomes immediately obvious whenever you encounter them.  This demonstrates another blindness of the Left, as we of the Right have read and know their masterworks, whereas they have literally no clue who has contributed to the foundations of our philosophy, much less what they contributed.</p><p>Start with Hayek.  Go on to Schumpeter and Mises.  Then Rothbard.  If you get that far and understand what you’re reading, go back and read Marx.  The test is to see if you can do it without laughing out loud.</p></div>",
  "content_text": "I hope Strange Semantics takes the Austrian quiz.  His\ncritique of my view of the Left\ndemonstrates that the poor guy just has no clue what I’m talking about, as his theoretical knowledge of foundational matters appears to be nonexistent.  Seriously, SS, do take the quiz.  Tell me how you scored and which questions you understood.  You’re a bright guy, you’ll understand some although you surely won’t grasp them all, as I doubt you could define the difference between Chicago and Keynes, much less Austria and Chicago.\nBut I’ll answer your question.  The reason the Left is blind is that it doesn’t know its own basic theories.  What is value?  What is money?  What is a market?  What is the opportunity cost of regulation?  These are elementary questions, and yet would-be Leftist political philosophers not only don’t have answers to these questions, they don’t know the answers that were provided over a hundred years ago by those who fathered the theories which laid the foundation for what they are now espousing in ignorance.\nThe reason I don’t have to explain these concepts, and the reason so many people reading this site understand what I’m talking about without me having to explain them, is that they are nothing new.  They’ve been around for decades, if not centuries in some cases, and we are speaking a language that you do not yet know.  For example, Hayek proved the impossibility of socialist calculation more than 60 years ago.  If you are aware of that, then the silliness of such endeavors becomes immediately obvious whenever you encounter them.  This demonstrates another blindness of the Left, as we of the Right have read and know their masterworks, whereas they have literally no clue who has contributed to the foundations of our philosophy, much less what they contributed.\nStart with Hayek.  Go on to Schumpeter and Mises.  Then Rothbard.  If you get that far and understand what you’re reading, go back and read Marx.  The test is to see if you can do it without laughing out loud.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-14T07:24:00+00:00"
}