{
  "url": "https://voxday.net/2004/03/26/since-you-ask-so-nicely/",
  "scraped_at": "2025-12-13T15:56:50.357897",
  "title": "Since you ask so nicely",
  "date_display": "March 26, 2004",
  "date_iso": "2004-03-26T20:47:00+00:00",
  "date_from_url": "2004-03-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Strange provides a critique: <em>Some conservative economists, like this one, are so desperate for evidence to confirm their failing theories, that they’ll ignore the bulk of a statement by an economist so that they can present the tiny portion of it that agrees, however minimally, with their position. Take, for instance, the insistance that Europe’s economy is worse because of it’s socialism. As evidence, the above-linked blog uses a quote from a recent statement by Stephen Roach of Morgan Stanely. But if the author of the blog had read the entire quote, he wouldn’t have been so quick to use it. Roach criticizes Europe for being slow to change, but are the changes he thinks European needs to make, or to have already made, those that the conservative economists would want? There is nothing in the article to indicate this. There is, in fact, nothing in Roach’s comments that indicates the problems in Europe are ones that only conservative economists could have predicted. They are problems that any economist, whatever his or her theoretical bent, would have predicted. He does say that European governments have been fiscally irresponsible, but doesn’t say how (there’s nothing to imply that he’s criticizing social programs). Rather, the primary problem, according to Roach, is Europe’s “cultural resistance” to fully joining the IT revolution. Without it, he claims, the European economy will not be able to adapt to the rapidly changing global economy.</em></p><p>Again, Strange exposes his inability to comprehend what he’s reading.  I did indeed peruse Roach’s entire article.  Since Strange asserted of Europe and Canada “for the most part their economies are doing as well as the U.S.’s on a relative scale, and theirs are much more socialized societies than ours” I only cited Roach to demonstrate that in the case of Europe, the economy was not doing as well, as I already knew on personal basis due to my contacts in the European banking industry.  I am not a Chicago-influenced Keynesian like Roach, and as an Austrian I neither believe nor accept the fictitious growth figures being put forth by the various government institutions, here in the USA, in Canada or in Europe.  But as I happened to be reading it not long after reading Strange’s comment, it served nicely as a non-anecdotal dismissal of Strange’s statement, since I doubted he’d take my word for it.  I could have as easily cited comparative unemployment figures or a number of other statistics.</p><p>The rest of Roach’s article was irrelevant for my needs, especially since Roach was not writing about the historical performance of the economies, as we were discussing earlier on the blog, but about a short-term quarterly perspective and the likely prospects for the future.  In any event, Roach view of the causes didn’t need to be in accordance with my own in order to to disprove Strange’s assertion.</p><p>Break down what Strange is saying.  We’ll leave Canada out to keep it simple.</p><p>1.  Socialism doesn’t slow economic growth.<br> <br>2.  Europe is more socialistic, and has comparable economic growth to the USA.<br> <br>3.  But Europe’s economic growth is not comparable to the USA, because (SR says), it hasn’t embraced the IT revolution.<br> <br>4.  Therefore socialism doesn’t slow economic growth.</br></br></br></br></br></br></p><p>Big buzzer on the logic there.  Perhaps SR is wrong about the cause.  Perhaps he isn’t.  In either case, his statement suffices to prove that Strange’s assertion was wrong.  Furthermore, it’s not hard to dismiss some of Strange’s subsequent points, as one wonders where else Roach believes that Europeans are being “fiscally irresponsible” if not on their social programs, especially considering that 43.9 percent of France’s GDP goes to social programs. <em>“obligatory charges had risen from 43.8 percent of output in 2002 to 43.9 percent in 2003….charges imposed by the state had been cut from 15.8 percent of GDP in 2002 to 15.5 percent last year. But those taken by social welfare bodies had risen from 21.5 percent of output in 2003 to 21.9 percent in 2003.”</em> I rather doubt Roach was complaining about their not-exactly-massive military spending.</p><p>It’s true, however, that it’s not only eurosocialism causing Europe’s problems.  At least part of it is due to the USA because their economies are being raped and pillaged by the imperial dollar.  We have successfully exported our debt-based inflation at the expense of foreign investors, which is why the Euro has risen from .88 to 1.30 in only two years, negating almost the entire war rally for European and Asian investors alike.  And yet, they must continue to invest in our debt, lest the entire financial structure collapse.  Roach, by the way, has even expressed some concern about this in the past, just not in that particular article.  And, of course, this financial structure is nothing more than another government-imposed endeavor that we Austrians oppose.</p><p>Conservative – at least the Austrians – have been predicting the inevitable inflationary end game for some time, ever since Bretton Woods in 1973 turned the national dollar into an international one.  Keynesian theorists, on the other hand, deny that it’s even possible for inflation and unemployment to co-exist, despite the experience of the 1970s.  The only real question for the Austrians is how long the game can last, and we’re not even close to what I would estimate to be the maximum, which would be around 2043 given what I understand to be the maximum historical lifespan of a paper currency.  This is a strange time to assert that Austrian theory is failing.   I’m not the least bit surprised that GDP numbers are showing growth.  Just look at the prices at the gas pump.  It’s exactly what the theory predicts.</p></div>",
  "content_text": "Strange provides a critique:\nSome conservative economists, like this one, are so desperate for evidence to confirm their failing theories, that they’ll ignore the bulk of a statement by an economist so that they can present the tiny portion of it that agrees, however minimally, with their position. Take, for instance, the insistance that Europe’s economy is worse because of it’s socialism. As evidence, the above-linked blog uses a quote from a recent statement by Stephen Roach of Morgan Stanely. But if the author of the blog had read the entire quote, he wouldn’t have been so quick to use it. Roach criticizes Europe for being slow to change, but are the changes he thinks European needs to make, or to have already made, those that the conservative economists would want? There is nothing in the article to indicate this. There is, in fact, nothing in Roach’s comments that indicates the problems in Europe are ones that only conservative economists could have predicted. They are problems that any economist, whatever his or her theoretical bent, would have predicted. He does say that European governments have been fiscally irresponsible, but doesn’t say how (there’s nothing to imply that he’s criticizing social programs). Rather, the primary problem, according to Roach, is Europe’s “cultural resistance” to fully joining the IT revolution. Without it, he claims, the European economy will not be able to adapt to the rapidly changing global economy.\nAgain, Strange exposes his inability to comprehend what he’s reading.  I did indeed peruse Roach’s entire article.  Since Strange asserted of Europe and Canada “for the most part their economies are doing as well as the U.S.’s on a relative scale, and theirs are much more socialized societies than ours” I only cited Roach to demonstrate that in the case of Europe, the economy was not doing as well, as I already knew on personal basis due to my contacts in the European banking industry.  I am not a Chicago-influenced Keynesian like Roach, and as an Austrian I neither believe nor accept the fictitious growth figures being put forth by the various government institutions, here in the USA, in Canada or in Europe.  But as I happened to be reading it not long after reading Strange’s comment, it served nicely as a non-anecdotal dismissal of Strange’s statement, since I doubted he’d take my word for it.  I could have as easily cited comparative unemployment figures or a number of other statistics.\nThe rest of Roach’s article was irrelevant for my needs, especially since Roach was not writing about the historical performance of the economies, as we were discussing earlier on the blog, but about a short-term quarterly perspective and the likely prospects for the future.  In any event, Roach view of the causes didn’t need to be in accordance with my own in order to to disprove Strange’s assertion.\nBreak down what Strange is saying.  We’ll leave Canada out to keep it simple.\n1.  Socialism doesn’t slow economic growth.\n2.  Europe is more socialistic, and has comparable economic growth to the USA.\n3.  But Europe’s economic growth is not comparable to the USA, because (SR says), it hasn’t embraced the IT revolution.\n4.  Therefore socialism doesn’t slow economic growth.\nBig buzzer on the logic there.  Perhaps SR is wrong about the cause.  Perhaps he isn’t.  In either case, his statement suffices to prove that Strange’s assertion was wrong.  Furthermore, it’s not hard to dismiss some of Strange’s subsequent points, as one wonders where else Roach believes that Europeans are being “fiscally irresponsible” if not on their social programs, especially considering that 43.9 percent of France’s GDP goes to social programs.\n“obligatory charges had risen from 43.8 percent of output in 2002 to 43.9 percent in 2003….charges imposed by the state had been cut from 15.8 percent of GDP in 2002 to 15.5 percent last year. But those taken by social welfare bodies had risen from 21.5 percent of output in 2003 to 21.9 percent in 2003.”\nI rather doubt Roach was complaining about their not-exactly-massive military spending.\nIt’s true, however, that it’s not only eurosocialism causing Europe’s problems.  At least part of it is due to the USA because their economies are being raped and pillaged by the imperial dollar.  We have successfully exported our debt-based inflation at the expense of foreign investors, which is why the Euro has risen from .88 to 1.30 in only two years, negating almost the entire war rally for European and Asian investors alike.  And yet, they must continue to invest in our debt, lest the entire financial structure collapse.  Roach, by the way, has even expressed some concern about this in the past, just not in that particular article.  And, of course, this financial structure is nothing more than another government-imposed endeavor that we Austrians oppose.\nConservative – at least the Austrians – have been predicting the inevitable inflationary end game for some time, ever since Bretton Woods in 1973 turned the national dollar into an international one.  Keynesian theorists, on the other hand, deny that it’s even possible for inflation and unemployment to co-exist, despite the experience of the 1970s.  The only real question for the Austrians is how long the game can last, and we’re not even close to what I would estimate to be the maximum, which would be around 2043 given what I understand to be the maximum historical lifespan of a paper currency.  This is a strange time to assert that Austrian theory is failing.   I’m not the least bit surprised that GDP numbers are showing growth.  Just look at the prices at the gas pump.  It’s exactly what the theory predicts.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-26T20:47:00+00:00"
}