{
  "url": "https://voxday.net/2004/03/31/so-much-for-gratefulness/",
  "scraped_at": "2025-12-13T15:57:36.645920",
  "title": "So much for gratefulness",
  "date_display": "March 31, 2004",
  "date_iso": "2004-03-31T14:43:00+00:00",
  "date_from_url": "2004-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>“The people of Fallujah hanged some of the bodies on the old bridge like slaughtered sheep,” Mohammed said. “I saw it myself.”</em></p><p>I still want us to bring our troops and our civilians home.  We don’t belong in Iraq, and I don’t care if it descends into another Mideast hellhole, I only care that it is not allowed to pose a serious threat to the US.  But since the Iraqis will no doubt mistake a withdrawal for some kind of weakness it will probably be necessary to turn places like Fallujah into large sheets of glass.  That should make the point clear.</p><p>This is why the decision to occupy Iraq, and to a lesser extent, Afghanistan, pissed me off.  I don’t see a good outcome for us there.  Better to take the win and quit while your enemies are dead and you’re manifestly ahead than to hold on too long and end up leaving looking like a loser.  Every gambler at Vegas and every entrepeneur interested in obtaining investment knows that you have to have an exit strategy before you go in, and I don’t believe that the Bush administration ever had one.  Remember that the jihad considered Afghanistan a win, and the Soviets were there beating the hell out of them for twenty years.  I suspect that the only way we’ll ever have peace with the Middle East is to take out the leaders every so often and allow them to keep busy fighting each other for supremacy.</p><p>Meanwhile, Iran’s nuclear reactor is literally weeks away from going online; I wonder who will hit it first?</p><p>UPDATE:  Jamie writes on his blog: <em>The general population has seen enough random terror around the world to know there is no defensive strategy in the war against islamofascism – we go on the offensive in the lands where the genesis of those ideas are and defeat them, or they will come get us. I for one, do not want to see the Neville Chamberlain strategy employed, and then be riding on the new Ghan railway in five years and have bombs go off left right and centre on the bastard.</em></p><p>This is surely true.  But we’re not on the offensive in Iraq.  We haven’t been for almost a year now.  This is the equivalent of taking Niedersachsen during the WWII and parking there.  Play offense or play defense, but either would be better than this half-assed war-on-method that piles bad tactics on top of bad strategy.  It severely annoys me to hear how George Bush is a great war leader because he has this “secret strategy” that he can’t share with the people he’s supposedly leading:</p><p>“What’s the game plan, coach?”<br> <br>“Can’t tell you, son  But trust me, it’s a great one.”<br> <br>“Well, can you at least tell me who we’re playing?”<br> <br>“I can tell you who we’re not playing.  We’re not playing against the team in the red jerseys.  No, we’re only playing against those who try to tackle us.”<br> <br>“But the guys in the red jerseys ARE trying to tackle us!”<br> <br>“Shhh!  Keep your voice down!  The ref might hear you!”</br></br></br></br></br></br></br></br></br></br></p><p>The fact that the US military successfully destroyed a third-rate military dictatorship does not make George Bush a great wartime President.  We’re supposed to be able to defeat third-rate military dictatorships.  The jury is still out on the actual war, and at this point, there are more questions than answers.  Remember, it took all of five years, 1939-1944, for Hitler to wax and wane.  We’re already halfway there.</p></div>",
  "content_text": "“The people of Fallujah hanged some of the bodies on the old bridge like slaughtered sheep,” Mohammed said. “I saw it myself.”\nI still want us to bring our troops and our civilians home.  We don’t belong in Iraq, and I don’t care if it descends into another Mideast hellhole, I only care that it is not allowed to pose a serious threat to the US.  But since the Iraqis will no doubt mistake a withdrawal for some kind of weakness it will probably be necessary to turn places like Fallujah into large sheets of glass.  That should make the point clear.\nThis is why the decision to occupy Iraq, and to a lesser extent, Afghanistan, pissed me off.  I don’t see a good outcome for us there.  Better to take the win and quit while your enemies are dead and you’re manifestly ahead than to hold on too long and end up leaving looking like a loser.  Every gambler at Vegas and every entrepeneur interested in obtaining investment knows that you have to have an exit strategy before you go in, and I don’t believe that the Bush administration ever had one.  Remember that the jihad considered Afghanistan a win, and the Soviets were there beating the hell out of them for twenty years.  I suspect that the only way we’ll ever have peace with the Middle East is to take out the leaders every so often and allow them to keep busy fighting each other for supremacy.\nMeanwhile, Iran’s nuclear reactor is literally weeks away from going online; I wonder who will hit it first?\nUPDATE:  Jamie writes on his blog:\nThe general population has seen enough random terror around the world to know there is no defensive strategy in the war against islamofascism – we go on the offensive in the lands where the genesis of those ideas are and defeat them, or they will come get us. I for one, do not want to see the Neville Chamberlain strategy employed, and then be riding on the new Ghan railway in five years and have bombs go off left right and centre on the bastard.\nThis is surely true.  But we’re not on the offensive in Iraq.  We haven’t been for almost a year now.  This is the equivalent of taking Niedersachsen during the WWII and parking there.  Play offense or play defense, but either would be better than this half-assed war-on-method that piles bad tactics on top of bad strategy.  It severely annoys me to hear how George Bush is a great war leader because he has this “secret strategy” that he can’t share with the people he’s supposedly leading:\n“What’s the game plan, coach?”\n“Can’t tell you, son  But trust me, it’s a great one.”\n“Well, can you at least tell me who we’re playing?”\n“I can tell you who we’re not playing.  We’re not playing against the team in the red jerseys.  No, we’re only playing against those who try to tackle us.”\n“But the guys in the red jerseys ARE trying to tackle us!”\n“Shhh!  Keep your voice down!  The ref might hear you!”\nThe fact that the US military successfully destroyed a third-rate military dictatorship does not make George Bush a great wartime President.  We’re supposed to be able to defeat third-rate military dictatorships.  The jury is still out on the actual war, and at this point, there are more questions than answers.  Remember, it took all of five years, 1939-1944, for Hitler to wax and wane.  We’re already halfway there.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-31T13:43:00+00:00"
}