{
  "url": "https://voxday.net/2004/03/18/socialized/",
  "scraped_at": "2025-12-13T15:55:16.817809",
  "title": "Socialized",
  "date_display": "March 18, 2004",
  "date_iso": "2004-03-18T22:01:00+00:00",
  "date_from_url": "2004-03-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Two 8-year-old boys and an 11-year-old schoolmate were arrested after they buried a loaded handgun in a playground sandbox and plotted to shoot and stab a third-grade girl during recess, authorities said Thursday.  Sheriff Tim Fulton said the boys told investigators <a href=\"http://www.billingsgazette.com/index.php?id=1&amp;tts=1&amp;display=rednews/2004/03/18/build/state/10-schoolplot.inc\">they intended to harm the young girl</a> because she had teased two of them.  The plot was uncovered Wednesday morning when another student alerted school officials, said Michael Hayworth, the Rosebud County attorney.  The gun, a .22-caliber revolver, had two bullets in it, Hayworth said. School Superintendent Dave Shreeve said a box of bullets also was found nearby. </em></p><p>If only these children had attended a public school, where they would have been properly socialized and learned how to relate to other children….</p></div>",
  "content_text": "Two 8-year-old boys and an 11-year-old schoolmate were arrested after they buried a loaded handgun in a playground sandbox and plotted to shoot and stab a third-grade girl during recess, authorities said Thursday.  Sheriff Tim Fulton said the boys told investigators\nthey intended to harm the young girl\nbecause she had teased two of them.  The plot was uncovered Wednesday morning when another student alerted school officials, said Michael Hayworth, the Rosebud County attorney.  The gun, a .22-caliber revolver, had two bullets in it, Hayworth said. School Superintendent Dave Shreeve said a box of bullets also was found nearby.\nIf only these children had attended a public school, where they would have been properly socialized and learned how to relate to other children….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-18T22:01:00+00:00"
}