{
  "url": "https://voxday.net/2004/03/04/speak-of-devi/",
  "scraped_at": "2025-12-13T15:52:51.011748",
  "title": "Speak of the devil",
  "date_display": "March 4, 2004",
  "date_iso": "2004-03-04T20:20:00+00:00",
  "date_from_url": "2004-03-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.reason.com/0403/cr.dw.talkin.shtml\">Daniel Weigel writes</a> in Reason: <em>Dispatches From the Culture Wars fundamentally misunderstands politics, pop culture, and the connections between them. By equating aesthetics with ideology, Goldberg makes a common but serious mistake: He thinks you can tell a person’s politics from the music she listens to.</em></p><p>The fact that a Christian Libertarian would write a song about a basically Japanese notion and title it <a href=\"http://www.basicpleasuremodel.com\">after a Buddhist concept</a> must confuse the smack out of Mr. Goldberg.  I like Mozart and Metallica.  I like Duran Duran and Dvorak.  It signifies nothing, except that the Baby Boomers still haven’t gotten over themselves.  Which is hardly news.</p><p>I can’t wait for the coming “Dentures are cool!” phase.  I swear, that entire generation is 55 going on 16.  No wonder the country is so messed up.</p></div>",
  "content_text": "Daniel Weigel writes\nin Reason:\nDispatches From the Culture Wars fundamentally misunderstands politics, pop culture, and the connections between them. By equating aesthetics with ideology, Goldberg makes a common but serious mistake: He thinks you can tell a person’s politics from the music she listens to.\nThe fact that a Christian Libertarian would write a song about a basically Japanese notion and title it\nafter a Buddhist concept\nmust confuse the smack out of Mr. Goldberg.  I like Mozart and Metallica.  I like Duran Duran and Dvorak.  It signifies nothing, except that the Baby Boomers still haven’t gotten over themselves.  Which is hardly news.\nI can’t wait for the coming “Dentures are cool!” phase.  I swear, that entire generation is 55 going on 16.  No wonder the country is so messed up.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-04T20:20:00+00:00"
}