{
  "url": "https://voxday.net/2004/03/28/strange-and-getting-stranger/",
  "scraped_at": "2025-12-13T15:57:04.352211",
  "title": "Strange and getting stranger",
  "date_display": "March 28, 2004",
  "date_iso": "2004-03-28T18:46:00+00:00",
  "date_from_url": "2004-03-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Strange desperately blathers: <em>The GDP grew by 1.7% in the third quarter of 2003. Still higher than Europe as a whole and most European countries, but you can actually find growth rates near 0 during some quarters in the last 3 years. If you go by the last 30 years, and particularly the last 15, you’ll find that the U.S. is behind some European countries, and almost identical to many others.</em></p><p>Meanwhile, in the real world, those of us who know that the actual annual growth rate supersedes that of the annual growth rate projected by a single quarter dismiss this apparent dichotomy thusly: While the USA was barely growing, large parts of Europe were contracting.  That’s why the Eurozone growth was barely positive for 2002 and 2003.  “Following two consecutive quarters of slight contraction,economic growth in the Eurozone turned positive again in the third quarter. Preliminary data show that GDP rose at an annualized rate of 1-1/2% in Q3 relative to Q2. That said, the year-on-year growth rate remained rather anemic, rising just 0.3% in the third quarter. In contrast, growth in theU.S. was much stronger in the third quarter. On a sequential basis the U.S. economy expanded at an annualized rate of 8.2% in Q3, which pulled the year-on-year growth rate up to 3.5%.”</p><p>I’d say more than 10x growth is substantial, wouldn’t you?  Especially when Europe probably has around 2x the socialism, not that we’ve defined a measure of it yet.  As for the last 30 years, those numbers were posted previously, courtesy of the OECD.  US growth is 28 percent greater than the average of Europe’s big four, and that doesn’t include the last three years when the US outperformance has been increasing.  The fact that Malta and Luxembourg may have grown faster is irrelevant, as they are not large, mature economies; even a bad small company has more growth potential than a Fortune 500 giant.</p></div>",
  "content_text": "Strange desperately blathers:\nThe GDP grew by 1.7% in the third quarter of 2003. Still higher than Europe as a whole and most European countries, but you can actually find growth rates near 0 during some quarters in the last 3 years. If you go by the last 30 years, and particularly the last 15, you’ll find that the U.S. is behind some European countries, and almost identical to many others.\nMeanwhile, in the real world, those of us who know that the actual annual growth rate supersedes that of the annual growth rate projected by a single quarter dismiss this apparent dichotomy thusly: While the USA was barely growing, large parts of Europe were contracting.  That’s why the Eurozone growth was barely positive for 2002 and 2003.  “Following two consecutive quarters of slight contraction,economic growth in the Eurozone turned positive again in the third quarter. Preliminary data show that GDP rose at an annualized rate of 1-1/2% in Q3 relative to Q2. That said, the year-on-year growth rate remained rather anemic, rising just 0.3% in the third quarter. In contrast, growth in theU.S. was much stronger in the third quarter. On a sequential basis the U.S. economy expanded at an annualized rate of 8.2% in Q3, which pulled the year-on-year growth rate up to 3.5%.”\nI’d say more than 10x growth is substantial, wouldn’t you?  Especially when Europe probably has around 2x the socialism, not that we’ve defined a measure of it yet.  As for the last 30 years, those numbers were posted previously, courtesy of the OECD.  US growth is 28 percent greater than the average of Europe’s big four, and that doesn’t include the last three years when the US outperformance has been increasing.  The fact that Malta and Luxembourg may have grown faster is irrelevant, as they are not large, mature economies; even a bad small company has more growth potential than a Fortune 500 giant.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-28T17:46:00+00:00"
}