{
  "url": "https://voxday.net/2004/03/05/taking-exception-with-vd/",
  "scraped_at": "2025-12-13T15:53:01.988824",
  "title": "Taking exception with VDH",
  "date_display": "March 5, 2004",
  "date_iso": "2004-03-05T19:15:00+00:00",
  "date_from_url": "2004-03-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The excellent VDH writes: <em>Be that as it may, Americans owe Harry Truman a great deal for overseeing the rebuilding of Europe, his prescient understanding of the danger of Soviet expansionism, and preservation of the Democratic party from the forces of appeasement — and worse — from its extremist Left.  Something similar to that landmark policy — a Bush Doctrine — is now emerging to face the threat of Islamic radicalism. Despite the current shrill claims that the United States is hated, hopelessly naïve, bogged down worldwide, and back in another Vietnam, since September 11 we have witnessed a historic emergence of a comprehensive foreign policy to confront Islamic fundamentalism and its parasitic relationship with Middle East autocracy — without which it cannot survive. </em></p><p>The problem with this is that while it may turn out to be true in the future, it simply isn’t true now nor has it been for the 2+ years since 9/11.  There is no Bush Doctrine opposing Islamic radicalism, quite the opposite, as the president insists that the War on Terror has nothing whatsoever to do with Islam.  Saudi Arabia and Iran are fundamentalist Islamic states, Iraq is not – so how does ignoring the former and defeating the latter comprise a confrontation of Islamic fundamentalism?  Furthermore, he has not spoken a single word on the threat posed in France, Germany, Britain, Holland and Denmark by this hypothesized foe.</p><p>VDH may prove to be a prophet, but unfortunately, he is an unreliable recorder of recent history in this specific example.  I think too many commentators and individuals are concentrating on what they would like to see instead of focusing on what is actually right in front of their eyes.</p></div>",
  "content_text": "The excellent VDH writes:\nBe that as it may, Americans owe Harry Truman a great deal for overseeing the rebuilding of Europe, his prescient understanding of the danger of Soviet expansionism, and preservation of the Democratic party from the forces of appeasement — and worse — from its extremist Left.  Something similar to that landmark policy — a Bush Doctrine — is now emerging to face the threat of Islamic radicalism. Despite the current shrill claims that the United States is hated, hopelessly naïve, bogged down worldwide, and back in another Vietnam, since September 11 we have witnessed a historic emergence of a comprehensive foreign policy to confront Islamic fundamentalism and its parasitic relationship with Middle East autocracy — without which it cannot survive.\nThe problem with this is that while it may turn out to be true in the future, it simply isn’t true now nor has it been for the 2+ years since 9/11.  There is no Bush Doctrine opposing Islamic radicalism, quite the opposite, as the president insists that the War on Terror has nothing whatsoever to do with Islam.  Saudi Arabia and Iran are fundamentalist Islamic states, Iraq is not – so how does ignoring the former and defeating the latter comprise a confrontation of Islamic fundamentalism?  Furthermore, he has not spoken a single word on the threat posed in France, Germany, Britain, Holland and Denmark by this hypothesized foe.\nVDH may prove to be a prophet, but unfortunately, he is an unreliable recorder of recent history in this specific example.  I think too many commentators and individuals are concentrating on what they would like to see instead of focusing on what is actually right in front of their eyes.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-05T19:15:00+00:00"
}