{
  "url": "https://voxday.net/2004/03/14/that-which-does-not-kill-me-makes-me/",
  "scraped_at": "2025-12-13T15:54:35.479582",
  "title": "That which does not kill me makes me slender",
  "date_display": "March 14, 2004",
  "date_iso": "2004-03-14T16:41:00+00:00",
  "date_from_url": "2004-03-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Onion: <em>New Nietschean Diet Allows You To Eat Whatever You Fear The Most.  While dieters are accustomed to exercises of will, a new English translation of Germany’s most popular diet book takes the concept to a new philosophical level. The Nietzschean diet, which commands its adherents to eat superhuman amounts of whatever they most fear, is developing a strong following in America….  Many Nietzschean dieters are reporting success, although some complain of side effects.  Kansas City’s John Mencken started the diet in January. He lost 35 pounds, eight inches from his waistline, and many of his slave moralities. He also lost the love of his life, Marissa Hapsgood, who walked out on Mencken after discovering his involvement in a romantic triangle with a poet and a sculptress. </em></p></div>",
  "content_text": "From the Onion:\nNew Nietschean Diet Allows You To Eat Whatever You Fear The Most.  While dieters are accustomed to exercises of will, a new English translation of Germany’s most popular diet book takes the concept to a new philosophical level. The Nietzschean diet, which commands its adherents to eat superhuman amounts of whatever they most fear, is developing a strong following in America….  Many Nietzschean dieters are reporting success, although some complain of side effects.  Kansas City’s John Mencken started the diet in January. He lost 35 pounds, eight inches from his waistline, and many of his slave moralities. He also lost the love of his life, Marissa Hapsgood, who walked out on Mencken after discovering his involvement in a romantic triangle with a poet and a sculptress.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-14T16:41:00+00:00"
}