{
  "url": "https://voxday.net/2004/03/03/thatll-put-breaks-on/",
  "scraped_at": "2025-12-13T15:52:28.140855",
  "title": "That’ll put the breaks on.",
  "date_display": "March 3, 2004",
  "date_iso": "2004-03-03T00:03:00+00:00",
  "date_from_url": "2004-03-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Newsday: <em>Four days after presiding over a slew of same sex marriages in his quaint Hudson Valley village, the mayor of New Paltz today was charged with 19 violations of New York’s domestic relations law, injecting the debate over gay marriages in the state with increasing drama and urgency.  Jason West, 26-year-old Green Party mayor, was ordered to appear in court Wednesday to answer charges that he broke state law by solomizing about two dozen weddings without a marriage license, according to New Paltz police and West’s lawyer.Chief Raymond Zappone said he and a lieutenant from the town police served a 19-count summons to West Tuesday afternoon and that the mayor faces up a $500 fine and a year in jail for his actions which have attracted international attention and brought the fight over gay marriages squarely into New York.</em></p><p>We may never see Gavin Newsom’s face again.  What’s he up to, 3,500 counts?</p></div>",
  "content_text": "From Newsday:\nFour days after presiding over a slew of same sex marriages in his quaint Hudson Valley village, the mayor of New Paltz today was charged with 19 violations of New York’s domestic relations law, injecting the debate over gay marriages in the state with increasing drama and urgency.  Jason West, 26-year-old Green Party mayor, was ordered to appear in court Wednesday to answer charges that he broke state law by solomizing about two dozen weddings without a marriage license, according to New Paltz police and West’s lawyer.Chief Raymond Zappone said he and a lieutenant from the town police served a 19-count summons to West Tuesday afternoon and that the mayor faces up a $500 fine and a year in jail for his actions which have attracted international attention and brought the fight over gay marriages squarely into New York.\nWe may never see Gavin Newsom’s face again.  What’s he up to, 3,500 counts?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-03T00:03:00+00:00"
}