{
  "url": "https://voxday.net/2004/03/17/think-for-two-seconds/",
  "scraped_at": "2025-12-13T15:55:08.008538",
  "title": "Think for two seconds",
  "date_display": "March 17, 2004",
  "date_iso": "2004-03-17T17:21:00+00:00",
  "date_from_url": "2004-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jonah Goldberg shuts down his brain and writes: <em>Supporters of the war say the reason al-Qaida is trying – and, alas, succeeding – to tear apart the coalition is that they cannot afford to see democracy win in Iraq. A stable and prospering Iraq will transform the Middle East, over time, into a region where the bloody fanaticism of bin Laden has no appeal.</em></p><p><a href=\"http://www.townhall.com/columnists/jonahgoldberg/jg20040317.shtml\">Jonah’s column</a> is otherwise fine, if somewhat limited to pointing out the obvious, but this is just a horrible howler of logic.  The battle is not between democracy and anti-democracy fanatics in Iraq.  The fanatics actually want democracy in Iraq, for the same reason they wanted it in Algeria.  They will win any fair and open elections.  Bremer has been very forthright about the fact that the Coalition occupation will not permit a democratic constitution – not that I support such a thing either – so to portray the battle as being one over democracy isn’t just ignorant, it’s stupid.</p><p>And, of course, neither the US nor its allies are democracies in the first place.  Sure, you can argue that it’s just semantics, in which case I can argue that you’re a fish.  Someday, I’d like to see every political pundit in America write out their definition of democracy.  I think in many cases, it means something like “country with mostly white people that doesn’t make me feel uncomfortable.”</p></div>",
  "content_text": "Jonah Goldberg shuts down his brain and writes:\nSupporters of the war say the reason al-Qaida is trying – and, alas, succeeding – to tear apart the coalition is that they cannot afford to see democracy win in Iraq. A stable and prospering Iraq will transform the Middle East, over time, into a region where the bloody fanaticism of bin Laden has no appeal.\nJonah’s column\nis otherwise fine, if somewhat limited to pointing out the obvious, but this is just a horrible howler of logic.  The battle is not between democracy and anti-democracy fanatics in Iraq.  The fanatics actually want democracy in Iraq, for the same reason they wanted it in Algeria.  They will win any fair and open elections.  Bremer has been very forthright about the fact that the Coalition occupation will not permit a democratic constitution – not that I support such a thing either – so to portray the battle as being one over democracy isn’t just ignorant, it’s stupid.\nAnd, of course, neither the US nor its allies are democracies in the first place.  Sure, you can argue that it’s just semantics, in which case I can argue that you’re a fish.  Someday, I’d like to see every political pundit in America write out their definition of democracy.  I think in many cases, it means something like “country with mostly white people that doesn’t make me feel uncomfortable.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-17T17:21:00+00:00"
}