{
  "url": "https://voxday.net/2004/03/30/third-perspective/",
  "scraped_at": "2025-12-13T15:57:24.696355",
  "title": "A third perspective",
  "date_display": "March 30, 2004",
  "date_iso": "2004-03-30T16:31:00+00:00",
  "date_from_url": "2004-03-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here’s an <a href=\"http://www.paulgraham.com/nerds.html\">interesting and insightful article</a> by a former school nerd.  He’s no homeschool advocate, although he, too, sees schools as prisons, even if he considers them to be necessary in post-industrial society in order for adults to get things done.  Here’s the section I found most interesting:</p><p><em>Adults can’t avoid seeing that teenage kids are tormented. So why don’t they do something about it? Because they blame it on puberty. The reason kids are so unhappy, adults tell themselves, is that monstrous new chemicals, hormones, are now coursing through their bloodstream and messing up everything. There’s nothing wrong with the system; it’s just inevitable that kids will be miserable at that age.  This idea is so pervasive that even the kids believe it, which probably doesn’t help. Someone who thinks his feet naturally hurt is not going to stop to consider the possibility that he is wearing the wrong size shoes.</em></p><p>I’m suspicious of this theory that thirteen year old kids are intrinsically messed up. If it’s physiological, it should be universal. Are Mongol nomads all nihilists at thirteen? I’ve read a lot of history, and I don’t think I’ve seen a single reference to this supposedly universal fact before the twentieth century. Teenage apprentices in the Renaissance seem to have been cheerful and eager. They got in fights and played tricks on one another of course (Michelangelo had his nose broken by a bully), but they weren’t crazy.</p><p>As far as I can tell, the concept of the hormone-crazed teenager is coeval with suburbia. I don’t think this is a coincidence. I think teenagers are driven crazy by the life they’re made to lead. Teenage apprentices in the Renaissance were working dogs. Teenagers now are neurotic lapdogs. Their craziness is the craziness of the idle everywhere.</p><p>This certainly appears to be true of the Middle East, particularly the Palestinian refugee camps, where most of the adults aren’t permitted to work.  I have on more than one occasion been struck by strange way that thirty-something Palestinian men often appear to behave like teenagers – I always thought they were acting up for the cameras, but now I’m not so sure.</p><p>Another interesting point he makes is the inevitability of the school culture’s cruelty, as it is a hierarchy of popularity, not skill, which he compares to court intrigue: <em>Court hierarchies are another thing entirely. This type of society debases anyone who enters it. There is neither admiration at the bottom, nor noblesse oblige at the top. It’s kill or be killed.  This is the sort of society that gets created by default in American secondary schools. And it happens because these schools have no real purpose beyond keeping the kids all in one place for a certain number of hours each day. What I didn’t realize at the time, and in fact didn’t realize till very recently, is that the twin horrors of school life, the cruelty and the boredom, both have the same cause.</em></p></div>",
  "content_text": "Here’s an\ninteresting and insightful article\nby a former school nerd.  He’s no homeschool advocate, although he, too, sees schools as prisons, even if he considers them to be necessary in post-industrial society in order for adults to get things done.  Here’s the section I found most interesting:\nAdults can’t avoid seeing that teenage kids are tormented. So why don’t they do something about it? Because they blame it on puberty. The reason kids are so unhappy, adults tell themselves, is that monstrous new chemicals, hormones, are now coursing through their bloodstream and messing up everything. There’s nothing wrong with the system; it’s just inevitable that kids will be miserable at that age.  This idea is so pervasive that even the kids believe it, which probably doesn’t help. Someone who thinks his feet naturally hurt is not going to stop to consider the possibility that he is wearing the wrong size shoes.\nI’m suspicious of this theory that thirteen year old kids are intrinsically messed up. If it’s physiological, it should be universal. Are Mongol nomads all nihilists at thirteen? I’ve read a lot of history, and I don’t think I’ve seen a single reference to this supposedly universal fact before the twentieth century. Teenage apprentices in the Renaissance seem to have been cheerful and eager. They got in fights and played tricks on one another of course (Michelangelo had his nose broken by a bully), but they weren’t crazy.\nAs far as I can tell, the concept of the hormone-crazed teenager is coeval with suburbia. I don’t think this is a coincidence. I think teenagers are driven crazy by the life they’re made to lead. Teenage apprentices in the Renaissance were working dogs. Teenagers now are neurotic lapdogs. Their craziness is the craziness of the idle everywhere.\nThis certainly appears to be true of the Middle East, particularly the Palestinian refugee camps, where most of the adults aren’t permitted to work.  I have on more than one occasion been struck by strange way that thirty-something Palestinian men often appear to behave like teenagers – I always thought they were acting up for the cameras, but now I’m not so sure.\nAnother interesting point he makes is the inevitability of the school culture’s cruelty, as it is a hierarchy of popularity, not skill, which he compares to court intrigue:\nCourt hierarchies are another thing entirely. This type of society debases anyone who enters it. There is neither admiration at the bottom, nor noblesse oblige at the top. It’s kill or be killed.  This is the sort of society that gets created by default in American secondary schools. And it happens because these schools have no real purpose beyond keeping the kids all in one place for a certain number of hours each day. What I didn’t realize at the time, and in fact didn’t realize till very recently, is that the twin horrors of school life, the cruelty and the boredom, both have the same cause.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-30T15:31:00+00:00"
}