{
  "url": "https://voxday.net/2004/03/10/toss-stale-marshmallows/",
  "scraped_at": "2025-12-13T15:53:35.797922",
  "title": "Toss the stale marshmallows",
  "date_display": "March 10, 2004",
  "date_iso": "2004-03-10T06:36:00+00:00",
  "date_from_url": "2004-03-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rod Dreher writes: <em>Brooks, who is Jewish, does not defend Gibson’s film, but he does say that the narcissism and spiritual sloth that characterizes popular religion in America today corrodes public virtue. I wanted to shout, “Hallelujah!” when I finished that column. I was raised Methodist, and have passed through the Southern Baptist church and the Episcopal Church before I finally ended up in the Roman Catholic church 11 years ago. With the possible exception of the Southern Baptist church, I don’t recall ever having heard any kind of Christianity preached that wasn’t essentially a spiritualized gloss on Dr. Phil-ism. The happy exceptions are so rare I’d sooner expect to find rashers of bacon in the Riyadh IHOP than hear something substantive and challenging.</em></p><p>For me, “The Passion of the Christ” acted as a head-clearer from all the bourgeois kultursmog one gets in church these days, where one is challenged to do little more than be nice to others and accept that God affirms us in our Okayness. When I went to mass on Ash Wednesday, I was still reeling from the searing grandeur of the film, and thinking very much about my own sins, and the role I played in Christ’s suffering. The priest began his homily by saying, “I was going to preach a fire-and-brimstone homily, but that’s not my style.” This was supposed to be a joke, as his homilies all sound as intelligent and modulated as an extended NPR commentary, minus the edge (an Ira Glass monologue is “Sinners In the Hands of an Angry God” by comparison). And you know, I wanted to scream. I’m so sick of this Jesus-is-our-Buddy stuff. Our Lord in Dockers. Who needs it, ya know? </p><p>I am not only a Southern Baptist, but one heavily influenced by Greg Boyd’s warfare theology.  Why does Jesus Christ matter?  Because the world is ruled by a sadistic supernatural serial killer, against whom only the power of the Son of Man can stand.  People like to think of Jesus as the Lamb, but they forget that he is also the Lion.</p><p>If the world doesn’t hate you, then you’re doing something wrong.  And if you’ve got a pastor who teaches Dr. Phil instead of Jesus Christ, you might as well stay home and watch football.</p></div>",
  "content_text": "Rod Dreher writes:\nBrooks, who is Jewish, does not defend Gibson’s film, but he does say that the narcissism and spiritual sloth that characterizes popular religion in America today corrodes public virtue. I wanted to shout, “Hallelujah!” when I finished that column. I was raised Methodist, and have passed through the Southern Baptist church and the Episcopal Church before I finally ended up in the Roman Catholic church 11 years ago. With the possible exception of the Southern Baptist church, I don’t recall ever having heard any kind of Christianity preached that wasn’t essentially a spiritualized gloss on Dr. Phil-ism. The happy exceptions are so rare I’d sooner expect to find rashers of bacon in the Riyadh IHOP than hear something substantive and challenging.\nFor me, “The Passion of the Christ” acted as a head-clearer from all the bourgeois kultursmog one gets in church these days, where one is challenged to do little more than be nice to others and accept that God affirms us in our Okayness. When I went to mass on Ash Wednesday, I was still reeling from the searing grandeur of the film, and thinking very much about my own sins, and the role I played in Christ’s suffering. The priest began his homily by saying, “I was going to preach a fire-and-brimstone homily, but that’s not my style.” This was supposed to be a joke, as his homilies all sound as intelligent and modulated as an extended NPR commentary, minus the edge (an Ira Glass monologue is “Sinners In the Hands of an Angry God” by comparison). And you know, I wanted to scream. I’m so sick of this Jesus-is-our-Buddy stuff. Our Lord in Dockers. Who needs it, ya know?\nI am not only a Southern Baptist, but one heavily influenced by Greg Boyd’s warfare theology.  Why does Jesus Christ matter?  Because the world is ruled by a sadistic supernatural serial killer, against whom only the power of the Son of Man can stand.  People like to think of Jesus as the Lamb, but they forget that he is also the Lion.\nIf the world doesn’t hate you, then you’re doing something wrong.  And if you’ve got a pastor who teaches Dr. Phil instead of Jesus Christ, you might as well stay home and watch football.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-10T06:36:00+00:00"
}