{
  "url": "https://voxday.net/2004/03/10/two-factions-one-party/",
  "scraped_at": "2025-12-13T15:53:43.837285",
  "title": "Two factions, one party",
  "date_display": "March 10, 2004",
  "date_iso": "2004-03-10T17:41:00+00:00",
  "date_from_url": "2004-03-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Strange Semantics <a href=\"http://strangesemantics.blogspot.com/2004_03_01_strangesemantics_archive.html#107894738089782529\">runs into cognitive dissonance</a>: <em>I began to wonder, why is it that so many conservatives and liberals think that there are biases stemming from the opposite end of the political spectrum in every aspect of society? Can they both be right? Is the United States government, including the courts, education system, and probably even the waste water folks, composed entirely of people who are both flaming commie pinkos and rightwing fascist authoritarians? And the media! Clearly they’re out to get Bush, and clearly they were out to get Clinton, but they are out to get Bush more than they were out to get Clinton, and they were out to get Clinton more than they are out to get Bush.  They can’t both be right.  Please, stop the insanity!</em></p><p>SS begins to see the light, for both sides are right.  What the idiot Left doesn’t understand, and the idiot not-Right (that thinks they are) refuses to recognize, is that commie pinkos and rightwing fascist authoritarians are very closely related.  They both worship government and the collective, and believe that an elite has a right and a responsibility to rule over the masses using any means necessary.  Both hate individual freedom – the libertinism of the Left is only a temporary waystation, see the prudishness of Nazi, Soviet and PRC culture by way of example – both require all-encompassing power on the part of the state.  What is the difference?  Define the difference… if you can.  It’s impossible; the only difference is that Nazi thinking was both more sophisticated and more bizarre than the crude Communist thinking that postulated a class consciousness that not only never existed historically but has been a major disappointment to Marxians as it has totally failed to manifest itself.</p><p>One of Hitler’s great concerns was to figure out how to enact totalitarian rule while simultaneously harnessing the individual genius required for entrepeneurialism and economic growth for the benefit of the State.  In doing so, he hoped to avoid what he correctly identified as a major flaw in Marxist thinking.  The crippled and static nature of the Soviet Union and other socialist and communist economies was predicted long in advance of the world learning just how bad it truly was.  Hitler never found the answer for which he was searching, but he was looking in the right place.  History has shown that our Keynesian leadership came up with a better and far more humane solution, but as they are learning to their dismay, the long run does eventually arrive if you rule long enough.  They may hit their own crisis of socialism yet, although I truly hope they can find a way to extricate themselves – and us – from it intact.  We do not live in freedom, but even comfortable modern serfdom is better than many alternatives.</p><p>The fact that the two Keynesian factions fight tooth-and-nail should neither be a surprise nor seen as a proof that they are polar opposites.  Nazis and communists battled in Berlin just as Mensheviks and Bolsheviks battled in Moscow.  The internecine wars are always the most bitter.</p></div>",
  "content_text": "Strange Semantics\nruns into cognitive dissonance\n:\nI began to wonder, why is it that so many conservatives and liberals think that there are biases stemming from the opposite end of the political spectrum in every aspect of society? Can they both be right? Is the United States government, including the courts, education system, and probably even the waste water folks, composed entirely of people who are both flaming commie pinkos and rightwing fascist authoritarians? And the media! Clearly they’re out to get Bush, and clearly they were out to get Clinton, but they are out to get Bush more than they were out to get Clinton, and they were out to get Clinton more than they are out to get Bush.  They can’t both be right.  Please, stop the insanity!\nSS begins to see the light, for both sides are right.  What the idiot Left doesn’t understand, and the idiot not-Right (that thinks they are) refuses to recognize, is that commie pinkos and rightwing fascist authoritarians are very closely related.  They both worship government and the collective, and believe that an elite has a right and a responsibility to rule over the masses using any means necessary.  Both hate individual freedom – the libertinism of the Left is only a temporary waystation, see the prudishness of Nazi, Soviet and PRC culture by way of example – both require all-encompassing power on the part of the state.  What is the difference?  Define the difference… if you can.  It’s impossible; the only difference is that Nazi thinking was both more sophisticated and more bizarre than the crude Communist thinking that postulated a class consciousness that not only never existed historically but has been a major disappointment to Marxians as it has totally failed to manifest itself.\nOne of Hitler’s great concerns was to figure out how to enact totalitarian rule while simultaneously harnessing the individual genius required for entrepeneurialism and economic growth for the benefit of the State.  In doing so, he hoped to avoid what he correctly identified as a major flaw in Marxist thinking.  The crippled and static nature of the Soviet Union and other socialist and communist economies was predicted long in advance of the world learning just how bad it truly was.  Hitler never found the answer for which he was searching, but he was looking in the right place.  History has shown that our Keynesian leadership came up with a better and far more humane solution, but as they are learning to their dismay, the long run does eventually arrive if you rule long enough.  They may hit their own crisis of socialism yet, although I truly hope they can find a way to extricate themselves – and us – from it intact.  We do not live in freedom, but even comfortable modern serfdom is better than many alternatives.\nThe fact that the two Keynesian factions fight tooth-and-nail should neither be a surprise nor seen as a proof that they are polar opposites.  Nazis and communists battled in Berlin just as Mensheviks and Bolsheviks battled in Moscow.  The internecine wars are always the most bitter.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-10T17:41:00+00:00"
}