{
  "url": "https://voxday.net/2004/03/24/war-of-left-and-right-wings/",
  "scraped_at": "2025-12-13T15:56:22.240463",
  "title": "The War of the Left- and Right-Wings",
  "date_display": "March 24, 2004",
  "date_iso": "2004-03-24T17:33:00+00:00",
  "date_from_url": "2004-03-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Like <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=37721\">Hugh Hewitt</a>, I share a bit of anticipation of Mr. Franken’s radio debut.  When it starts, someone will have to email me the call-in number; I’ll post it here and everyone who’s interested in seeing the War of the Wings can call in and demand an answer from him on a specific day.  The chances are slim that anyone will actually get on the air, but at least we’ll send him a message.</p><p>And who knows?  The guy is just nuts enough that he might go for it.  There’s a lot of rage inside that little man and given that he outweighs me by more than thirty pounds, he’s got a chance.  Oh, who am I kidding.  I can bench him at least 20 times; even though I’m much lighter I rather doubt he can do the same.  While he may have been a wrestler, that was a long time ago and it’s a lot harder to take someone down when they’re looking at you.</p></div>",
  "content_text": "Like\nHugh Hewitt\n, I share a bit of anticipation of Mr. Franken’s radio debut.  When it starts, someone will have to email me the call-in number; I’ll post it here and everyone who’s interested in seeing the War of the Wings can call in and demand an answer from him on a specific day.  The chances are slim that anyone will actually get on the air, but at least we’ll send him a message.\nAnd who knows?  The guy is just nuts enough that he might go for it.  There’s a lot of rage inside that little man and given that he outweighs me by more than thirty pounds, he’s got a chance.  Oh, who am I kidding.  I can bench him at least 20 times; even though I’m much lighter I rather doubt he can do the same.  While he may have been a wrestler, that was a long time ago and it’s a lot harder to take someone down when they’re looking at you.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-24T17:33:00+00:00"
}