{
  "url": "https://voxday.net/2004/03/05/what-war-lilypad/",
  "scraped_at": "2025-12-13T15:52:56.491656",
  "title": "What war, Lilypad?",
  "date_display": "March 5, 2004",
  "date_iso": "2004-03-05T16:59:00+00:00",
  "date_from_url": "2004-03-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rod Dreher sees both sides: <em>My fellow conservative Dallasite Tara B. Ross has a piece out today warning that President Bush has no idea how much he’s angered his base with all his crazy spending. But James Lileks, waxing Podhoretzian, tells right-wingers considering not voting for Bush to think about the importance of the war and get over themselves already.</em></p><p>Rod’s a good guy.  Ross is correct.  Lileks is a superficial analyst who blindly swallows the ridiculous Republican excuse.  First, we’re not still at war, and only someone with almost complete ignorance of military history would attempt to argue that we are.  When you can’t even state with assurance with whom we are at war, when Congress has declared no war, we’re not at war.  If we haven’t even bothered closing our borders to thousands of people crossing it illegally every day, then we’re not at  war.  Yes, our troops are sitting in their bases playing garrison in over 100 countries and performing police actions; yes, there’s still some low intensity combat here and there just as there always is.  Yes, some troops are being killed.  Were we at war in 1983 when we lost over 200 Marines in Lebanon?  Were we at war when we killed 20 or 30 Philippinos getting Marcos out?</p><p>Does anyone consider World War II to have continued into 1946?  After all, our troops were still in Germany and Japan and there were plenty of Nazi leaders still unfound.  To argue that we are still at war months after the complete defeat of the Afghani and Iraqi regimes is bizarre.  But even if we accept the notion that this undeclared bug hunt equates to full-blown war, how does it possibly excuse Bush governing Democrat-style?  It’s nothing but sleight of hand!</p><p>Republicans need to get over the notion that a) we are at war and b) war justifies abandoning your principles.  There’s no reason to believe Kerry is less likely to fight a necessary war than Bush – Democrats have gotten us into more wars than Republicans have anyhow.  As for me, I’m not considering not voting for George Delano, I’m absolutely not voting for him.</p></div>",
  "content_text": "Rod Dreher sees both sides:\nMy fellow conservative Dallasite Tara B. Ross has a piece out today warning that President Bush has no idea how much he’s angered his base with all his crazy spending. But James Lileks, waxing Podhoretzian, tells right-wingers considering not voting for Bush to think about the importance of the war and get over themselves already.\nRod’s a good guy.  Ross is correct.  Lileks is a superficial analyst who blindly swallows the ridiculous Republican excuse.  First, we’re not still at war, and only someone with almost complete ignorance of military history would attempt to argue that we are.  When you can’t even state with assurance with whom we are at war, when Congress has declared no war, we’re not at war.  If we haven’t even bothered closing our borders to thousands of people crossing it illegally every day, then we’re not at  war.  Yes, our troops are sitting in their bases playing garrison in over 100 countries and performing police actions; yes, there’s still some low intensity combat here and there just as there always is.  Yes, some troops are being killed.  Were we at war in 1983 when we lost over 200 Marines in Lebanon?  Were we at war when we killed 20 or 30 Philippinos getting Marcos out?\nDoes anyone consider World War II to have continued into 1946?  After all, our troops were still in Germany and Japan and there were plenty of Nazi leaders still unfound.  To argue that we are still at war months after the complete defeat of the Afghani and Iraqi regimes is bizarre.  But even if we accept the notion that this undeclared bug hunt equates to full-blown war, how does it possibly excuse Bush governing Democrat-style?  It’s nothing but sleight of hand!\nRepublicans need to get over the notion that a) we are at war and b) war justifies abandoning your principles.  There’s no reason to believe Kerry is less likely to fight a necessary war than Bush – Democrats have gotten us into more wars than Republicans have anyhow.  As for me, I’m not considering not voting for George Delano, I’m absolutely not voting for him.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-05T16:59:00+00:00"
}