{
  "url": "https://voxday.net/2004/03/14/what-do-you-know-about-economics/",
  "scraped_at": "2025-12-13T15:54:29.995137",
  "title": "What do you know about economics",
  "date_display": "March 14, 2004",
  "date_iso": "2004-03-14T07:25:00+00:00",
  "date_from_url": "2004-03-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some of the gang have been <a href=\"http://www.mises.org/quiz.asp?QuizID=4\">taking the Austrian quiz</a> over at Mises.org.  WARNING: this isn’t your typical easy little preferences test; it’s one that actually requires a good bit of thought and a background in economics didn’t hurt either.</p><p>My score will probably come as no surprise: 100 out of 100. <em>Naturlich, weil ich bin ein Austrian, ja?</em> However, I did take slight exception to question 20 on the stock market, as I didn’t think that the correct answer properly reflected Austrian theory, but as it is multiple choice I went with the closest one.</p><p>Resispa, you crypto-commie, I sentence you to re-reading the first three chapters of <em>Human Action</em> and the introduction to <em>Capitalism, Socialism and Democracy</em>.</p><p>UPDATE: Try to remember that the point isn’t to score as high as you can, but to see where your beliefs are and learn which school of economics they belong to.  The choices are not exaggerations, they are taken directly from each school of economics.  It should be easy to spot the two most extreme, for obvious reasons, but that’s not the point.</p></div>",
  "content_text": "Some of the gang have been\ntaking the Austrian quiz\nover at Mises.org.  WARNING: this isn’t your typical easy little preferences test; it’s one that actually requires a good bit of thought and a background in economics didn’t hurt either.\nMy score will probably come as no surprise: 100 out of 100.\nNaturlich, weil ich bin ein Austrian, ja?\nHowever, I did take slight exception to question 20 on the stock market, as I didn’t think that the correct answer properly reflected Austrian theory, but as it is multiple choice I went with the closest one.\nResispa, you crypto-commie, I sentence you to re-reading the first three chapters of\nHuman Action\nand the introduction to\nCapitalism, Socialism and Democracy\n.\nUPDATE: Try to remember that the point isn’t to score as high as you can, but to see where your beliefs are and learn which school of economics they belong to.  The choices are not exaggerations, they are taken directly from each school of economics.  It should be easy to spot the two most extreme, for obvious reasons, but that’s not the point.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-14T07:25:00+00:00"
}