{
  "url": "https://voxday.net/2004/03/19/who-would-win-superman-or-batman/",
  "scraped_at": "2025-12-13T15:55:26.150267",
  "title": "Who would win, Superman or Batman?",
  "date_display": "March 19, 2004",
  "date_iso": "2004-03-19T13:50:00+00:00",
  "date_from_url": "2004-03-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Baseball Savant asks: <em>We know you want a piece of Al in the worst way, but me and a buddy were debating the other night whether or not you could take Jean Claude Van Damme. I have to admit, I love ya bro, but I took Jean Claude. He whooped Tong Po in “Kickboxer” even after taking a tremendous beating because he couldn’t fight back at first.  Not only that, but he also whooped Chung Lee in “Bloodsport” even though he was blinded with powder! Good night! He also whooped Atilla in “Lionheart” although he had a broken rib!!  My buddy has Vox, the BASEBALL SAVANT has Jean Claude! So what is it!???</em></p><p>My money would be on Jean Claude, at least if we were both at our peak.  These days, who knows.  I’ve been playing soccer, not fighting competitively, for years, and my bench is down to around 285-295 from 325.  Then again, I’d get back on protein and creatine if I had a match coming up, and it only takes about six weeks to get back in fighting shape, while Jean Claude’s been hanging around Hollywood.  Oh, who am I kidding, I still wouldn’t want to trade kicks with Mr. Van Damme, still less Dolph Lundgren, who was a friendly acquaintance of mine a few years back.  I once had to lug him, very much the worse for wear, back to his hotel room when we were out partying together.  You don’t realize how big someone is until you’re propping up their dead weight.  In addition to being huge, Dolph is also a very good martial artist.</p><p>Then again, I think I could take either of them if it came down to firearms.  I shot a 96/100 at 21 feet when I went to the range with Space Bunny last week with a compact .40.  My best round ever is 90/100 at 75 feet with a .357 long-barrel.  I managed to outshoot a Marine Force Recon sniper that day, albeit with the .357.  I’m not great with a rifle, although my brother and my father are both unbelievably good shots.</p></div>",
  "content_text": "The Baseball Savant asks:\nWe know you want a piece of Al in the worst way, but me and a buddy were debating the other night whether or not you could take Jean Claude Van Damme. I have to admit, I love ya bro, but I took Jean Claude. He whooped Tong Po in “Kickboxer” even after taking a tremendous beating because he couldn’t fight back at first.  Not only that, but he also whooped Chung Lee in “Bloodsport” even though he was blinded with powder! Good night! He also whooped Atilla in “Lionheart” although he had a broken rib!!  My buddy has Vox, the BASEBALL SAVANT has Jean Claude! So what is it!???\nMy money would be on Jean Claude, at least if we were both at our peak.  These days, who knows.  I’ve been playing soccer, not fighting competitively, for years, and my bench is down to around 285-295 from 325.  Then again, I’d get back on protein and creatine if I had a match coming up, and it only takes about six weeks to get back in fighting shape, while Jean Claude’s been hanging around Hollywood.  Oh, who am I kidding, I still wouldn’t want to trade kicks with Mr. Van Damme, still less Dolph Lundgren, who was a friendly acquaintance of mine a few years back.  I once had to lug him, very much the worse for wear, back to his hotel room when we were out partying together.  You don’t realize how big someone is until you’re propping up their dead weight.  In addition to being huge, Dolph is also a very good martial artist.\nThen again, I think I could take either of them if it came down to firearms.  I shot a 96/100 at 21 feet when I went to the range with Space Bunny last week with a compact .40.  My best round ever is 90/100 at 75 feet with a .357 long-barrel.  I managed to outshoot a Marine Force Recon sniper that day, albeit with the .357.  I’m not great with a rifle, although my brother and my father are both unbelievably good shots.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-19T13:50:00+00:00"
}