{
  "url": "https://voxday.net/2004/03/23/why-women-dont-get-i/",
  "scraped_at": "2025-12-13T15:56:13.105966",
  "title": "Why women don’t get it",
  "date_display": "March 23, 2004",
  "date_iso": "2004-03-23T14:33:00+00:00",
  "date_from_url": "2004-03-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The St. Paul Pioneer Press has been chronicling <a href=\"http://www.twincities.com/mld/twincities/living/8251156.htm\">the trials and travails</a> of one Ruby, who is single and not looking very likely to find a mate any time soon.  Why not is not much of a mystery, as she is about as clueless about the opposite sex as I’m guessing she is about plate tectonics.  In this week’s episode, the poor darling tries speed-dating:<br> <br><em><br> <br>I was a little nervous and a lot curious as I walked into a large room at a sports bar that looked like a log cabin on steroids. Right away I noticed several well-dressed, average-looking men. The women, fulfilling the social standard, were generally better looking. While everyone waited for the session to start, I began chatting with two young women who, based on another friend’s recommendation, also were trying speed dating for the first time.</br></br></em></br></br></p><p>Women, for some reason, are almost completely incapable of accurately judging attractiveness as men see it.  This is why a woman can look at Marisa Miller and say “I don’t think she’s pretty at all” then turn around and tell you that their obese friend with stringy hair is gorgeous because she has a nice smile.  Note that she thinks the women were better-looking, on the whole, and keep this in mind in light of what she writes later.  The Perfect Aryan Male attended one of these events in the same city and he said that out of the 30 women that were there on the night he participated, there was only one woman who was actually pretty, although he discovered that she was built like the Great Pyramid of Giza when she stood up.  And this is a guy who is so obviously a catch that he can’t go to a strip club without getting asked out by the dancers.</p><p><em>Of the 30 guys I met, I marked yes to three. One was Hot Matt, who was still in college and obviously too young for me. (Logic played no role in that decision.) I wished I was attracted to a few more, but the sparks just weren’t flying. I wrestled with the idea that I might become attracted to more of them if I got to know them better, which is surely possible, but with me, that rarely happens. Plus, I didn’t take very good notes, and most of the guys darted for the exit afterwards instead of mingling, which the service encourages.</em></p><p>Two things.  First, if the women were actually more attractive than the men, then why did most of the men bolt?  That doesn’t describe the normal behavior of a guy who finds himself in the company of more attractive women who he knows are available in my experience.  Second, note that the failure of “sparks” to fly in three minutes is reason enough to disqualify an otherwise acceptable man and that despite her long record of dating failure, logic still plays a backseat role to mindless optimism.  Thirty-something ladies, if you want to get married, it helps to stop panting after the handsome college boys, take a good look in the mirror and give the guys who are on your level – or close to it – a chance.  Even if you’re uncommonly well-preserved, the college boy isn’t going to marry you and you’ll have blown another few months.  And as for expectations, well, the White Buffalo and I were talking last night, and concluded that no one in our extended circle, with one or two exceptions, was with the kind of person that they, or anyone else, would have imagined themselves to marry.</p><p>My dear friend Chatterbox told me recently that she had tons more dates than any other woman she knew when she was living in New York City because her attitude was that if a guy asked her out, any guy, then she was going out.  Now, she definitely has some strange-looking friends, but a lot of great stories too.  And with an attitude like that, it’s no surprise that she’s happily married despite the handicap of her MBA.  First get real with yourself, then be real with others.  A little practicality goes a surprisingly long way in the dating game.</p></div>",
  "content_text": "The St. Paul Pioneer Press has been chronicling\nthe trials and travails\nof one Ruby, who is single and not looking very likely to find a mate any time soon.  Why not is not much of a mystery, as she is about as clueless about the opposite sex as I’m guessing she is about plate tectonics.  In this week’s episode, the poor darling tries speed-dating:\nI was a little nervous and a lot curious as I walked into a large room at a sports bar that looked like a log cabin on steroids. Right away I noticed several well-dressed, average-looking men. The women, fulfilling the social standard, were generally better looking. While everyone waited for the session to start, I began chatting with two young women who, based on another friend’s recommendation, also were trying speed dating for the first time.\nWomen, for some reason, are almost completely incapable of accurately judging attractiveness as men see it.  This is why a woman can look at Marisa Miller and say “I don’t think she’s pretty at all” then turn around and tell you that their obese friend with stringy hair is gorgeous because she has a nice smile.  Note that she thinks the women were better-looking, on the whole, and keep this in mind in light of what she writes later.  The Perfect Aryan Male attended one of these events in the same city and he said that out of the 30 women that were there on the night he participated, there was only one woman who was actually pretty, although he discovered that she was built like the Great Pyramid of Giza when she stood up.  And this is a guy who is so obviously a catch that he can’t go to a strip club without getting asked out by the dancers.\nOf the 30 guys I met, I marked yes to three. One was Hot Matt, who was still in college and obviously too young for me. (Logic played no role in that decision.) I wished I was attracted to a few more, but the sparks just weren’t flying. I wrestled with the idea that I might become attracted to more of them if I got to know them better, which is surely possible, but with me, that rarely happens. Plus, I didn’t take very good notes, and most of the guys darted for the exit afterwards instead of mingling, which the service encourages.\nTwo things.  First, if the women were actually more attractive than the men, then why did most of the men bolt?  That doesn’t describe the normal behavior of a guy who finds himself in the company of more attractive women who he knows are available in my experience.  Second, note that the failure of “sparks” to fly in three minutes is reason enough to disqualify an otherwise acceptable man and that despite her long record of dating failure, logic still plays a backseat role to mindless optimism.  Thirty-something ladies, if you want to get married, it helps to stop panting after the handsome college boys, take a good look in the mirror and give the guys who are on your level – or close to it – a chance.  Even if you’re uncommonly well-preserved, the college boy isn’t going to marry you and you’ll have blown another few months.  And as for expectations, well, the White Buffalo and I were talking last night, and concluded that no one in our extended circle, with one or two exceptions, was with the kind of person that they, or anyone else, would have imagined themselves to marry.\nMy dear friend Chatterbox told me recently that she had tons more dates than any other woman she knew when she was living in New York City because her attitude was that if a guy asked her out, any guy, then she was going out.  Now, she definitely has some strange-looking friends, but a lot of great stories too.  And with an attitude like that, it’s no surprise that she’s happily married despite the handicap of her MBA.  First get real with yourself, then be real with others.  A little practicality goes a surprisingly long way in the dating game.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-03-23T14:33:00+00:00"
}