{
  "url": "https://voxday.net/2014/08/21/a-hitlerian-purpose/",
  "scraped_at": "2025-12-16T12:25:03.227345",
  "title": "A Hitlerian purpose",
  "date_display": "August 21, 2014",
  "date_iso": "2014-08-21T16:00:00+00:00",
  "date_from_url": "2014-08-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I missed this Goldman column the last time around, which is probably just as well. It is historically false, morally bankrupt, and should be <a href=\"http://pjmedia.com/spengler/2014/08/19/the-beam-in-our-eye/?singlepage=true\">deeply offensive to a broad range of people</a> across the political, racial, and religious spectrums:</p><blockquote class=\"tr_bq\"><p> The essay below appeared in Asia Times Online on April 8, 2008. Apropos of the Ferguson riots it is reprinted below. It should make no-one happy. The crippling failure in American culture, I argue, is our refusal to come to terms with our own Civil War. This failure afflicts the conservative movement. For example: Last June I had the privilege to teach a course at the annual Acton University in Grand Rapids, MI. One of the keynote speakers was Judge Andrew Napolitano, whom I admire and whose remarks in the main I applauded. But Napolitano argued in passing that Lincoln had done a terrible thing by fighting the Civil War: surely, the judge said, he could have found a better way to end slavery than by tearing the country apart. That is utter nonsense for two reasons: the first is that a large part of the South was willing to die to preserve slavery, and the second is that the European imperial powers were already conspiring with elements of the South to expand slavery through Cuba, Mexico and Central America. If Lincoln had not fought the Civil War in 1861, the French invasion of Mexico in 1862 would have established a link with the Confederacy and prevented a Northern blockade.</p><p>Perfectly intelligent and well-motivated men like Napolitano ignore the obvious about the Civil War because it is still too horrible to contemplate. More broadly, the conservative movement continues to tolerate a revolting form of nostalgia for the slave era euphemistically called “Southern Traditionalism.” ISI’s middle-brow list of “Fifty Greatest Books of the 20th Century” includes a biography of Gen. Robert E. Lee, labeled “The tragic life of a great Southern traditionalist beautifully chronicled by a great Southern traditionalist.” The ISI list is mostly mediocre, but this is offensive in the extreme.</p><p>Below I demand of Americans “a higher threshold for horror.” </p><p>An uncanny parallel links the fate of young African-Americans today and that of the young white men of the slave-holding South in 1865. Both cohorts have lost a terrifying proportion of their number to violence. One third of black Americans between the ages of 20 and 30 passed through the criminal justice system in 1995, according to the Sentencing Project, a prisoners’ advocacy group. Nearly a third of military-age Southern men military age were killed or wounded during America’s Civil War.</p><p>It is a measure of the inherent good-heartedness of Americans that they evince a low threshold of horror. Three hundred thousand Confederate dead and millions of ruined African-American lives are too awful to contemplate. Some part of Senator Barack Obama’s appeal derives from America’s revulsion over the destruction of a generation of young black men; electing an African-American president would assuage part of the guilt.</p><p>From this great suffering arise two genres of American popular culture, the Gone With the Wind ilk of Civil War epic, and the “Get Rich or Die Tryin’” brand of gangsta tale. Both try to take the edge off the revulsion and placate the dishonored dead by turning them into folk-heroes. That is understandable, but also unfortunate, for America still has a great deal of killing left to do around the world, and might as well get used to it.</p><p>“Get Rich or Die Tryin’” would have been a good epitaph for the Confederate dead, who fought for land and slaves, not for “states’ rights” or the sanctity of their soil. Slave-owners along with want-to-be slave-owners had it coming. The Union general William Tecumseh Sherman who said after he burned Atlanta, “I fear the world will jump to the wrong conclusion that because I am in Atlanta the work is done. Far from it. We must kill three hundred thousand, I have told you of so often, and the further they run the harder for us to get them.”</p><p>Given the sad history of racial oppression in the South for a century after the Civil War, the only thing to regret is that Sherman didn’t finish the job. I stopped watching the film version of Gone With the Wind after Scarlett O’Hara saved her plantation from the tax-collector. I wanted her to pick cotton until her back broke.</p></blockquote><p>I don’t think it would be a big surprise if there were more than a few blacks and Southerners who read this grotesque nonsense that did not conclude that perhaps it was not Sherman or the American justice system, but Adolf Hitler who didn’t do enough killing. Remember, this is the same individual who asserts that because the Chinese harbor such <a href=\"http://pjmedia.com/spengler/2014/01/11/common-traits-bind-jews-and-chinese/2/\">instinctive respect and admiration for his people</a>, China and the Jews “share a common purpose, to transcend tribalism through a unifying civilization”.</p><p>In other words, what Spengler is saying is that the purpose of the Jewish people is to crush all nationalism through slaughter.</p><p>But to be clear, it is obvious that not all Jews agree with him, least of all the Israeli who brought it to my attention.</p></div>",
  "content_text": "I missed this Goldman column the last time around, which is probably just as well. It is historically false, morally bankrupt, and should be\ndeeply offensive to a broad range of people\nacross the political, racial, and religious spectrums:\nThe essay below appeared in Asia Times Online on April 8, 2008. Apropos of the Ferguson riots it is reprinted below. It should make no-one happy. The crippling failure in American culture, I argue, is our refusal to come to terms with our own Civil War. This failure afflicts the conservative movement. For example: Last June I had the privilege to teach a course at the annual Acton University in Grand Rapids, MI. One of the keynote speakers was Judge Andrew Napolitano, whom I admire and whose remarks in the main I applauded. But Napolitano argued in passing that Lincoln had done a terrible thing by fighting the Civil War: surely, the judge said, he could have found a better way to end slavery than by tearing the country apart. That is utter nonsense for two reasons: the first is that a large part of the South was willing to die to preserve slavery, and the second is that the European imperial powers were already conspiring with elements of the South to expand slavery through Cuba, Mexico and Central America. If Lincoln had not fought the Civil War in 1861, the French invasion of Mexico in 1862 would have established a link with the Confederacy and prevented a Northern blockade.\nPerfectly intelligent and well-motivated men like Napolitano ignore the obvious about the Civil War because it is still too horrible to contemplate. More broadly, the conservative movement continues to tolerate a revolting form of nostalgia for the slave era euphemistically called “Southern Traditionalism.” ISI’s middle-brow list of “Fifty Greatest Books of the 20th Century” includes a biography of Gen. Robert E. Lee, labeled “The tragic life of a great Southern traditionalist beautifully chronicled by a great Southern traditionalist.” The ISI list is mostly mediocre, but this is offensive in the extreme.\nBelow I demand of Americans “a higher threshold for horror.”\nAn uncanny parallel links the fate of young African-Americans today and that of the young white men of the slave-holding South in 1865. Both cohorts have lost a terrifying proportion of their number to violence. One third of black Americans between the ages of 20 and 30 passed through the criminal justice system in 1995, according to the Sentencing Project, a prisoners’ advocacy group. Nearly a third of military-age Southern men military age were killed or wounded during America’s Civil War.\nIt is a measure of the inherent good-heartedness of Americans that they evince a low threshold of horror. Three hundred thousand Confederate dead and millions of ruined African-American lives are too awful to contemplate. Some part of Senator Barack Obama’s appeal derives from America’s revulsion over the destruction of a generation of young black men; electing an African-American president would assuage part of the guilt.\nFrom this great suffering arise two genres of American popular culture, the Gone With the Wind ilk of Civil War epic, and the “Get Rich or Die Tryin’” brand of gangsta tale. Both try to take the edge off the revulsion and placate the dishonored dead by turning them into folk-heroes. That is understandable, but also unfortunate, for America still has a great deal of killing left to do around the world, and might as well get used to it.\n“Get Rich or Die Tryin’” would have been a good epitaph for the Confederate dead, who fought for land and slaves, not for “states’ rights” or the sanctity of their soil. Slave-owners along with want-to-be slave-owners had it coming. The Union general William Tecumseh Sherman who said after he burned Atlanta, “I fear the world will jump to the wrong conclusion that because I am in Atlanta the work is done. Far from it. We must kill three hundred thousand, I have told you of so often, and the further they run the harder for us to get them.”\nGiven the sad history of racial oppression in the South for a century after the Civil War, the only thing to regret is that Sherman didn’t finish the job. I stopped watching the film version of Gone With the Wind after Scarlett O’Hara saved her plantation from the tax-collector. I wanted her to pick cotton until her back broke.\nI don’t think it would be a big surprise if there were more than a few blacks and Southerners who read this grotesque nonsense that did not conclude that perhaps it was not Sherman or the American justice system, but Adolf Hitler who didn’t do enough killing. Remember, this is the same individual who asserts that because the Chinese harbor such\ninstinctive respect and admiration for his people\n, China and the Jews “share a common purpose, to transcend tribalism through a unifying civilization”.\nIn other words, what Spengler is saying is that the purpose of the Jewish people is to crush all nationalism through slaughter.\nBut to be clear, it is obvious that not all Jews agree with him, least of all the Israeli who brought it to my attention.",
  "tags": [
    "trainwreck",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-21T15:00:00+00:00"
}