{
  "url": "https://voxday.net/2014/08/11/a-letter-to-hachettes-ceo/",
  "scraped_at": "2025-12-16T12:23:51.253323",
  "title": "A letter to Hachette’s CEO",
  "date_display": "August 11, 2014",
  "date_iso": "2014-08-11T09:00:00+00:00",
  "date_from_url": "2014-08-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Our friends at Amazon requested that those readers and writers who support them write an email to Hachette CEO Michael Pietsch. Amazon has been very good to me over the past few years, both an author and a customer, so I was happy to oblige.</p><blockquote class=\"tr_bq\"><p> Dear Mr. Pietsch,</p><p>As a Hugo-nominated author, a Pocket Books author, and an editor<br> for an independent publishing house in Finland, I would like to<br> encourage you to rethink your position regarding Amazon. I understand<br> that the rapid changes in the industry are affecting your company, often<br> in a negative manner. I also realize that your overhead and your<br> contracts tend to reflect standard industry practices that are no longer<br> in line with the new world of digital publishing.</br></br></br></br></br></br></p><p>The fact is, Mr. Pietsch, that the world is changing and Hachette has to<br> change with it. Ebook prices are coming down as per the technology curve.<br> When have you ever known a new technology to come out and gradually<br> become more expensive over time? I don’t wish to criticize you or your<br> organization for various attempts to keep the new world at bay, as the<br> important point is not that colluding with other mainstream publishers,<br> trying to protect higher book prices, or using authors as leverage is<br> wrong, or even bad PR, but that such actions are ultimately futile.</br></br></br></br></br></br></br></p><p>The ebook genie will never go back into the bottle. Therefore, the sooner you<br> restructure Hachette to reflect the new realities, which include coming<br> to a reasonable accomodation with Amazon, the more likely it is<br> that your organization will survive these changes.</br></br></br></p><p>With regards,<br> <br> Vox Day</br></br></p></blockquote><p>Hachette’s position isn’t merely economically illiterate, observably hypocritical, and morally wrong, it is untenable. At the moment, Hachette obviously needs Amazon more than Amazon needs Hachette. As for its supporters among the scribbling classes, I think Amazon would do well to teach the authors who are publicly opposed to them a Very Important Lesson by refusing to sell any of their books for six months.</p><p>After the initial screeches of outrage died down, I suspect they would all fall in line very quickly. One of the things I like about Amazon is that it is the sort of thing they might actually do; I don’t think they’d be afraid to demonstrate to those various loud-mouthed authors just how unimportant they truly are. It’s amazing how many writers not only excuse their mainstream publishers for actions that Amazon has not even committed, but fail to realize that selling books is only a small part of Amazon’s business these days.</p><p>Amazon isn’t perfect. What corporation is? But they have been the best thing for authors and the reading public since Mr. Gutenberg first assembled his printing press. And the fact that the dinosaur gatekeepers and their pet authors hate and fear it is a feature, not a bug.</p><p>One of the Mad Geniuses, Amanda, <a href=\"http://madgeniusclub.com/2014/08/10/it-isnt-nice-to-get-me-wound-up-this-early-in-the-morning/\">adds her two cents</a> on the subject:</p><blockquote class=\"tr_bq\"><p> [A]ll Amazon did was take a page out of Hatchette’s book and ask its authors to take a stand. Oh the cries of foul that suddenly rose from the interwebs. Within<br> half a hour of reading the email, I was seeing accusations of Amazon<br> acting like a stalker in sending the email to the usual AHDers (Amazon<br> Hater Disorder sufferers) about how evil Amazon was to ask its authors<br> to contact poor, innocent Hatchette. There was even one author claiming<br> that Amazon is not and never will be a friend to authors. All of those<br> had me shaking my head and wondering if these folks had ever really read<br> their contracts with their traditional publisher — several of whom are<br> signed with Hatchette — as well as if they actually knew the meaning of<br> the terms “contract”, “negotiation” and “irony”.</br></br></br></br></br></br></br></br></br></p><p>What pushed me over the edge was a post by another author who<br> admitted to not having received or read the email but, based on what<br> they were seeing form their author friends, Amazon was once again<br> resorting to dirty pool and must be stopped because, duh, Amazon is<br> evil.</br></br></br></br></p></blockquote><p>They really are proper little Manicheans, aren’t they.</p></div>",
  "content_text": "Our friends at Amazon requested that those readers and writers who support them write an email to Hachette CEO Michael Pietsch. Amazon has been very good to me over the past few years, both an author and a customer, so I was happy to oblige.\nDear Mr. Pietsch,\nAs a Hugo-nominated author, a Pocket Books author, and an editor\nfor an independent publishing house in Finland, I would like to\nencourage you to rethink your position regarding Amazon. I understand\nthat the rapid changes in the industry are affecting your company, often\nin a negative manner. I also realize that your overhead and your\ncontracts tend to reflect standard industry practices that are no longer\nin line with the new world of digital publishing.\nThe fact is, Mr. Pietsch, that the world is changing and Hachette has to\nchange with it. Ebook prices are coming down as per the technology curve.\nWhen have you ever known a new technology to come out and gradually\nbecome more expensive over time? I don’t wish to criticize you or your\norganization for various attempts to keep the new world at bay, as the\nimportant point is not that colluding with other mainstream publishers,\ntrying to protect higher book prices, or using authors as leverage is\nwrong, or even bad PR, but that such actions are ultimately futile.\nThe ebook genie will never go back into the bottle. Therefore, the sooner you\nrestructure Hachette to reflect the new realities, which include coming\nto a reasonable accomodation with Amazon, the more likely it is\nthat your organization will survive these changes.\nWith regards,\nVox Day\nHachette’s position isn’t merely economically illiterate, observably hypocritical, and morally wrong, it is untenable. At the moment, Hachette obviously needs Amazon more than Amazon needs Hachette. As for its supporters among the scribbling classes, I think Amazon would do well to teach the authors who are publicly opposed to them a Very Important Lesson by refusing to sell any of their books for six months.\nAfter the initial screeches of outrage died down, I suspect they would all fall in line very quickly. One of the things I like about Amazon is that it is the sort of thing they might actually do; I don’t think they’d be afraid to demonstrate to those various loud-mouthed authors just how unimportant they truly are. It’s amazing how many writers not only excuse their mainstream publishers for actions that Amazon has not even committed, but fail to realize that selling books is only a small part of Amazon’s business these days.\nAmazon isn’t perfect. What corporation is? But they have been the best thing for authors and the reading public since Mr. Gutenberg first assembled his printing press. And the fact that the dinosaur gatekeepers and their pet authors hate and fear it is a feature, not a bug.\nOne of the Mad Geniuses, Amanda,\nadds her two cents\non the subject:\n[A]ll Amazon did was take a page out of Hatchette’s book and ask its authors to take a stand. Oh the cries of foul that suddenly rose from the interwebs. Within\nhalf a hour of reading the email, I was seeing accusations of Amazon\nacting like a stalker in sending the email to the usual AHDers (Amazon\nHater Disorder sufferers) about how evil Amazon was to ask its authors\nto contact poor, innocent Hatchette. There was even one author claiming\nthat Amazon is not and never will be a friend to authors. All of those\nhad me shaking my head and wondering if these folks had ever really read\ntheir contracts with their traditional publisher — several of whom are\nsigned with Hatchette — as well as if they actually knew the meaning of\nthe terms “contract”, “negotiation” and “irony”.\nWhat pushed me over the edge was a post by another author who\nadmitted to not having received or read the email but, based on what\nthey were seeing form their author friends, Amazon was once again\nresorting to dirty pool and must be stopped because, duh, Amazon is\nevil.\nThey really are proper little Manicheans, aren’t they.",
  "tags": [
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-11T08:00:00+00:00"
}