{
  "url": "https://voxday.net/2014/08/28/a-new-star/",
  "scraped_at": "2025-12-16T12:25:50.286633",
  "title": "A new start",
  "date_display": "August 28, 2014",
  "date_iso": "2014-08-28T13:00:00+00:00",
  "date_from_url": "2014-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2014/08/QM-AMP_900.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/08/QM-AMP_900.jpg\" width=\"200\"/></a></div><p>JartStar and I were never particularly happy with the cover for <i>QUANTUM MORTIS The Programmed Mind</i>. Not only was the cover image a little nebulous, but it tended to sell what is an intense military spy thriller of galactic proportions more than a little short. It simply didn’t harken back to the classic SF of the Atomic Age in the way that we intended it to. Also, the title didn’t fit well within the title layout for the series that the most excellent Kirk DouPonce created for QUANTUM MORTIS; to say that Kirk “really disliked” the cover as a result would have been to put it mildly. But one of the great things about digital publishing is that it’s very easy to replace the covers. I think you will agree that the new cover, and new title, are a considerable improvement over their predecessors. Instead of an accidentally over-endowed female agent being subjected to some neurological indignities, the new cover features the Ascendancy destroyer <i>Draco</i> entering the orbit of the planet Bonoplane to investigate the fate of the stricken <i>Shiva</i>-class starcruiser <i>ATSV Rigel</i>. Please note that nothing else has changed except the title and the cover, so if you already bought QM-TPM, you already own <b><a href=\"http://www.amazon.com/gp/product/B00ILU0RC2\"><i>QUANTUM MORTIS A Mind Programmed</i></a></b>. I expect you should be able to update the file through your Kindle if you wish.</p><p>And QM-AMP isn’t the only relaunch of sorts we have to announce today. You may recall that I have made reference to a Castalia House Classics line on several occasions in the past, and today we are more than a little pleased to make an announcement in that regard <a href=\"http://www.castaliahouse.com/introducing-castalia-classics/\">on the Castalia House blog</a>. I encourage you to check it out.</p></div>",
  "content_text": "JartStar and I were never particularly happy with the cover for\nQUANTUM MORTIS The Programmed Mind\n. Not only was the cover image a little nebulous, but it tended to sell what is an intense military spy thriller of galactic proportions more than a little short. It simply didn’t harken back to the classic SF of the Atomic Age in the way that we intended it to. Also, the title didn’t fit well within the title layout for the series that the most excellent Kirk DouPonce created for QUANTUM MORTIS; to say that Kirk “really disliked” the cover as a result would have been to put it mildly. But one of the great things about digital publishing is that it’s very easy to replace the covers. I think you will agree that the new cover, and new title, are a considerable improvement over their predecessors. Instead of an accidentally over-endowed female agent being subjected to some neurological indignities, the new cover features the Ascendancy destroyer\nDraco\nentering the orbit of the planet Bonoplane to investigate the fate of the stricken\nShiva\n-class starcruiser\nATSV Rigel\n. Please note that nothing else has changed except the title and the cover, so if you already bought QM-TPM, you already own\nQUANTUM MORTIS A Mind Programmed\n. I expect you should be able to update the file through your Kindle if you wish.\nAnd QM-AMP isn’t the only relaunch of sorts we have to announce today. You may recall that I have made reference to a Castalia House Classics line on several occasions in the past, and today we are more than a little pleased to make an announcement in that regard\non the Castalia House blog\n. I encourage you to check it out.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-28T12:00:00+00:00"
}