{
  "url": "https://voxday.net/2014/08/03/and-why-might-that-be/",
  "scraped_at": "2025-12-16T12:22:58.482261",
  "title": "And why might that be?",
  "date_display": "August 3, 2014",
  "date_iso": "2014-08-03T13:00:00+00:00",
  "date_from_url": "2014-08-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Charles Krauthammer, an American Jew, laments <a href=\"http://www.breitbart.com/Breitbart-TV/2014/08/02/Krauthammer-Calls-Worlds-Anti-Semitic-Reaction-to-Gaza-Orwellian\">the resurgence of world anti-semitism</a>. And yet, neither he nor anyone else ever seems to ask the obvious question: why is it resurging now? Are we expected to believe that it is a complete coincidence that various peoples around the world suddenly appear to have developed, apropos of nothing at all, a sudden and simultaneous dislike for a relatively small group of people?</p><blockquote class=\"tr_bq\"><p> [T]he other problem for Israel has been the inability to win over public opinion around the world. “The rest of the world’s reaction to what’s happening in Gaza is Orwellian,” Krauthammer said. “It is shocking, especially in Europe. It is a resurgence of anti-Semitism not seen since the `30s, this is a recurrence, it’s all over the world, and don’t tell me its anti-Zionism. You listen to the slogan, you see the sign, Hitler was right in Germany, a sign in Germany saying that this is a veneer that is a front for anti-Semitism and it is back. It’s all over the world. And that’s what we’re now beginning to face.</p></blockquote><p>I’ve been warning of this resurgence for several years now, as I picked up the first signs of it during the 2008 financial crisis. Now that it’s being mentioned in the mainstream media, perhaps more people will begin to take the matter seriously. The first thing people have to understand is that emo-posturing and affecting shock and horror accomplishes absolutely nothing. The guilt trip simply doesn’t work anymore and it’s time to abandon the Holocaustian dodge. The Shoah wasn’t the worstey worstest event in human history; far worse genocides, both in terms of absolute numbers and percentages of the people being targeted, have occurred since. It’s not even the worst thing to have happened to the people of Israel in their history, 11/12 being considerably more than half.</p><p>One would do well to reflect upon why the Roman treatment of the Jews was so much harsher than their treatment of nearly every other people they conquered from Britain to Egypt, aside from the Carthaginians. Were the Romans mysteriously anti-semitic too or did the Jews manage to upset them in some manner? Regardless, the fact that nearly everyone with any direct experience of the Endlosung is now dead, combined with the fact that the world is considerably less Eurocentric than it was, means that virtually no one gives a damn about the Holocaust anymore. That card is played out.</p><p>Try it on the Chinese. Or the Cambodians. You’re going to expect tears, cash, and prizes for six million people killed during the biggest war on the planet seven decades ago when the Chinese more recently offed eight times that many of their own people over nothing more than resource allocation and lunatic political theory? Ask the average half-illiterate 80-IQ American public school student about the Holocaust and he’s as likely to think it has something to do with slavery or Palestine as World War II.</p><p>Another American Jew, Richard Cohen, <a href=\"http://www.nytimes.com/2014/08/03/opinion/sunday/roger-cohen-why-americans-see-israel-the-way-they-do.html\">is aware</a> of perspectives changing: <i>“A recent survey by the Pew Research Center found that among Americans age 65 or older, 53 percent blame Hamas for the violence and 15 percent Israel. For those ages 18 to 29, Israel is blamed by 29 percent of those questioned, Hamas by just 21 percent.”  </i></p><p>Second, understand that the resurgence of anti-semitism is happening for a reason. What that reason may be is up for discussion, but not that logic dictates its existence. Anti-semitism can be irrational but it is not always so, and pretending otherwise is both disingenuous and futile. The world knows what Ben Bernanke did last summer, so to speak. The world knows who is funding President Goldman Sachs and it understands why the head of a petty state in the Middle East can tell him off and expect him to fall in line. The world knows that the U.S. Congress is Israeli-occupied territory. The world knows who owns Hollywood, the U.S. media, and the bailed-out banks. The world knows who has been flooding its nations with third-world barbarians who don’t even understand the concept of indoor plumbing.</p><p>And the world doesn’t like it. Not one little bit. Actions have consequences; the problem is that the consequences are not always proportionate.</p><p>It’s absolutely useless to try to continue hiding behind claims of Jewish wonderfulness, supercapability and work ethos. First, virtually no one buys it. Too many of us know how the game is played; too many of us have seen incompetent, inept, and lazy Jews advanced in tribal fashion over far more capable, competent, and responsible Gentiles. Too many of us observe that Germany and China appear to be doing rather well these days despite lacking the benefit of Jewish guidance. Second, and much more importantly, <i>no one cares why</i>.</p><p>Does this mean that I endorse this rising tide of anti-semitism? No, of course not, otherwise I wouldn’t have warned Jews of it in the first place. If I were anti-semitic, I would smile like a helpful SS-Totenkopfverbände officer meeting a train and tell every nervous Krauthammer and Cohen on board not to worry, everything is just fine, everything is in order, isn’t it shocking that some of those terrible animals in the Holy Land can’t seem to get over their irrational hatreds of your wonderful people!</p><p>But I understand why the hatred exists and I know that it is, to a certain extent, merited. It observably is. Jews don’t have to like that fact, they don’t even have to accept it, but they will have to deal with it nevertheless. And I also suspect that the growing hatred is going to get out of hand as the global economy worsens, that the innocent will be caught up in the angry tide along with the red-handed guilty.</p><p>The idea that post-nationalism and demographic divide-and-conquer would make the Jews in America safer was intrinsically wrong, as wrong as the idea that amassing vast wealth and political influence serves as an effective form of community protection for a small minority. People like helpless refugees. People rather like grateful immigrants who settle quietly in their own communities and gradually integrate over time. People hate rich people who tell them what to do. And people really, really hate rich and powerful foreigners with supremacy complexes who tell them what to do while settling criminally-inclined aliens in their neighborhoods.</p><p>In successfully attacking the white Anglo-Saxon Protestant nature of America, Jews destroyed the American exceptionalism that offered them protection. Now that it is essentially gone, Jews have not only lost a reliable Gentile shield against global anti-semitism, but aside from Christian Zionists like Sarah Palin who fly the flag of Israel in their churches, the white Anglo-Saxons who previously defended them are no longer much inclined to do so. And, contra Spengler, I very much doubt that the Chinese are likely to serve as an adequate substitute for white American Christians. Reflect on what the Han have done to the peaceful, harmless people of Tibet and then think about how well they are likely respond to tribal gamesmanship.</p><p>You can argue if you like. You can call me names if you like. You’ll hardly be the first. But look at it logically: if anti-semitism is like the weather or cancer, then the world will just have to suffer it forever without much hope of anything changing until such time as the Jews finally go the way of the Amalekites. My perspective is actually the optimistic one, because if the rise in anti-semitism is largely a rational reaction to material Jewish actions, it should be possible to avoid its most dangerous forms, outside of those implacable sentiments genuinely inspired by the ongoing territorial conflict in the Middle East.</p><p>If you seek pro-Israeli propaganda, you’ll have to go elsewhere. If you wish to read anti-semitic rantings, this isn’t the place to find them. On this controversial subject, as with all others, I am only interested in the truth and its probable ramifications for the future. If I am incorrect, by all means, feel free to show me how and I will modify my thinking. But if you have nothing but groundless assertions and fervent personal opinions to offer, you needn’t bother.</p></div>",
  "content_text": "Charles Krauthammer, an American Jew, laments\nthe resurgence of world anti-semitism\n. And yet, neither he nor anyone else ever seems to ask the obvious question: why is it resurging now? Are we expected to believe that it is a complete coincidence that various peoples around the world suddenly appear to have developed, apropos of nothing at all, a sudden and simultaneous dislike for a relatively small group of people?\n[T]he other problem for Israel has been the inability to win over public opinion around the world. “The rest of the world’s reaction to what’s happening in Gaza is Orwellian,” Krauthammer said. “It is shocking, especially in Europe. It is a resurgence of anti-Semitism not seen since the `30s, this is a recurrence, it’s all over the world, and don’t tell me its anti-Zionism. You listen to the slogan, you see the sign, Hitler was right in Germany, a sign in Germany saying that this is a veneer that is a front for anti-Semitism and it is back. It’s all over the world. And that’s what we’re now beginning to face.\nI’ve been warning of this resurgence for several years now, as I picked up the first signs of it during the 2008 financial crisis. Now that it’s being mentioned in the mainstream media, perhaps more people will begin to take the matter seriously. The first thing people have to understand is that emo-posturing and affecting shock and horror accomplishes absolutely nothing. The guilt trip simply doesn’t work anymore and it’s time to abandon the Holocaustian dodge. The Shoah wasn’t the worstey worstest event in human history; far worse genocides, both in terms of absolute numbers and percentages of the people being targeted, have occurred since. It’s not even the worst thing to have happened to the people of Israel in their history, 11/12 being considerably more than half.\nOne would do well to reflect upon why the Roman treatment of the Jews was so much harsher than their treatment of nearly every other people they conquered from Britain to Egypt, aside from the Carthaginians. Were the Romans mysteriously anti-semitic too or did the Jews manage to upset them in some manner? Regardless, the fact that nearly everyone with any direct experience of the Endlosung is now dead, combined with the fact that the world is considerably less Eurocentric than it was, means that virtually no one gives a damn about the Holocaust anymore. That card is played out.\nTry it on the Chinese. Or the Cambodians. You’re going to expect tears, cash, and prizes for six million people killed during the biggest war on the planet seven decades ago when the Chinese more recently offed eight times that many of their own people over nothing more than resource allocation and lunatic political theory? Ask the average half-illiterate 80-IQ American public school student about the Holocaust and he’s as likely to think it has something to do with slavery or Palestine as World War II.\nAnother American Jew, Richard Cohen,\nis aware\nof perspectives changing:\n“A recent survey by the Pew Research Center found that among Americans age 65 or older, 53 percent blame Hamas for the violence and 15 percent Israel. For those ages 18 to 29, Israel is blamed by 29 percent of those questioned, Hamas by just 21 percent.”\nSecond, understand that the resurgence of anti-semitism is happening for a reason. What that reason may be is up for discussion, but not that logic dictates its existence. Anti-semitism can be irrational but it is not always so, and pretending otherwise is both disingenuous and futile. The world knows what Ben Bernanke did last summer, so to speak. The world knows who is funding President Goldman Sachs and it understands why the head of a petty state in the Middle East can tell him off and expect him to fall in line. The world knows that the U.S. Congress is Israeli-occupied territory. The world knows who owns Hollywood, the U.S. media, and the bailed-out banks. The world knows who has been flooding its nations with third-world barbarians who don’t even understand the concept of indoor plumbing.\nAnd the world doesn’t like it. Not one little bit. Actions have consequences; the problem is that the consequences are not always proportionate.\nIt’s absolutely useless to try to continue hiding behind claims of Jewish wonderfulness, supercapability and work ethos. First, virtually no one buys it. Too many of us know how the game is played; too many of us have seen incompetent, inept, and lazy Jews advanced in tribal fashion over far more capable, competent, and responsible Gentiles. Too many of us observe that Germany and China appear to be doing rather well these days despite lacking the benefit of Jewish guidance. Second, and much more importantly,\nno one cares why\n.\nDoes this mean that I endorse this rising tide of anti-semitism? No, of course not, otherwise I wouldn’t have warned Jews of it in the first place. If I were anti-semitic, I would smile like a helpful SS-Totenkopfverbände officer meeting a train and tell every nervous Krauthammer and Cohen on board not to worry, everything is just fine, everything is in order, isn’t it shocking that some of those terrible animals in the Holy Land can’t seem to get over their irrational hatreds of your wonderful people!\nBut I understand why the hatred exists and I know that it is, to a certain extent, merited. It observably is. Jews don’t have to like that fact, they don’t even have to accept it, but they will have to deal with it nevertheless. And I also suspect that the growing hatred is going to get out of hand as the global economy worsens, that the innocent will be caught up in the angry tide along with the red-handed guilty.\nThe idea that post-nationalism and demographic divide-and-conquer would make the Jews in America safer was intrinsically wrong, as wrong as the idea that amassing vast wealth and political influence serves as an effective form of community protection for a small minority. People like helpless refugees. People rather like grateful immigrants who settle quietly in their own communities and gradually integrate over time. People hate rich people who tell them what to do. And people really, really hate rich and powerful foreigners with supremacy complexes who tell them what to do while settling criminally-inclined aliens in their neighborhoods.\nIn successfully attacking the white Anglo-Saxon Protestant nature of America, Jews destroyed the American exceptionalism that offered them protection. Now that it is essentially gone, Jews have not only lost a reliable Gentile shield against global anti-semitism, but aside from Christian Zionists like Sarah Palin who fly the flag of Israel in their churches, the white Anglo-Saxons who previously defended them are no longer much inclined to do so. And, contra Spengler, I very much doubt that the Chinese are likely to serve as an adequate substitute for white American Christians. Reflect on what the Han have done to the peaceful, harmless people of Tibet and then think about how well they are likely respond to tribal gamesmanship.\nYou can argue if you like. You can call me names if you like. You’ll hardly be the first. But look at it logically: if anti-semitism is like the weather or cancer, then the world will just have to suffer it forever without much hope of anything changing until such time as the Jews finally go the way of the Amalekites. My perspective is actually the optimistic one, because if the rise in anti-semitism is largely a rational reaction to material Jewish actions, it should be possible to avoid its most dangerous forms, outside of those implacable sentiments genuinely inspired by the ongoing territorial conflict in the Middle East.\nIf you seek pro-Israeli propaganda, you’ll have to go elsewhere. If you wish to read anti-semitic rantings, this isn’t the place to find them. On this controversial subject, as with all others, I am only interested in the truth and its probable ramifications for the future. If I am incorrect, by all means, feel free to show me how and I will modify my thinking. But if you have nothing but groundless assertions and fervent personal opinions to offer, you needn’t bother.",
  "tags": [
    "history",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-03T12:00:00+00:00"
}