{
  "url": "https://voxday.net/2014/08/17/coaching-life-systems/",
  "scraped_at": "2025-12-16T12:24:33.472154",
  "title": "Coaching life systems",
  "date_display": "August 17, 2014",
  "date_iso": "2014-08-17T13:24:00+00:00",
  "date_from_url": "2014-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Over the years, I’ve had thousands of requests for advice. Some of it I’ve given publicly, some of it has remained private. Some people have taken it, more often they haven’t. Sometimes it has worked out, most of the time I have no idea what they did with it.</p><p>Now, I’m certainly not saying my life is perfect. Far from it. I’ve made sub-optimal decisions, I’ve made mind-boggling mistakes, and if I had known at 19 what I know now, I might well own part of two billion-dollar corporations. But, as a general rule, I am able to accomplish what I set my mind to doing so long as I don’t get too bored.</p><p>What most of you don’t know is that I’ve been lecturing this year at a technical institute, nominally teaching game development. But what I learned over the course of the spring semester was that while the information I was providing them was useful and valuable, the lessons they found most important had nothing directly to do with games or game development.</p><p>General concepts that I’ve learned and put into practice, such as failing faster, seeking external sources of motivation, incorporating objective metrics, demanding high performance, and leveraging personal connections to mutual benefit actually turned out to be much more valuable to them than the industry-specific ones. So much so, in fact, that several of the best students in the class asked permission to be able to attend it again in the fall.</p><p>(I said yes and even gave the institute instructions to let them do so for a nominal fee instead of the usual cost, although this didn’t quite make sense to me in rational terms; I’d already taught them what I intend to teach in the fall. But now, thanks to the Murakami novel I’ve been reading, I think I understand what they’re seeking by repeating the course.)</p><p>What hit the lightswitch was a passage in <i>Colorless Tsukuru Tazaki and His Years of Pilgrimage</i>. Tazaki-san is speaking with his old friend Aka, from whom he has been estranged for more than twenty years. Aka runs a very successful creative business seminar company called BEYOND, which is one part corporate self-improvement, one part psychology, and one part bullshit. In explaining his success, Aka says:</p><p><i>One other thing I learned from working in a company was that the majority of people in the world have no problem following orders. They’re actually happy to be told what to do. They might complain, but that’s not how they really feel. They just grumble out of habit. If you told them to think for themselves, and make their own decisions and take responsibility for them, they’d be clueless. So I decided I could turn that into a business. It’s simple….</i></p><p><i>There are quite a few people who reject the program. You can divide them into two groups. The first is antisocial. In English you’d call them ‘outcasts.’ They just can’t accept any form of constructive criticism, no matter what it is. They reject any kind of group discipline. It’s a waste of time to deal with people like that, so we ask them to withdraw. The other group is comprised of people who actually think on their own. Those it’s best to leave alone. Don’t fool with them. Every system needs elite people like them. If things go well, they’ll eventually be in leadership positions. In the middle, between those two groups, are those who take orders from above and just do what they’re told. That’s the vast majority of people. By my rough estimate, 85 percent of the total. I developed this business to target the 85 percent.</i></p><p>In combination with a new writing program I’ve been using, that gave me an idea. Now, I’ve been trying to figure out how to start a business that is actually <i>necessary </i>for ten years. The fields in which I’ve been involved for years are pretty far down the priority list; no one really needs techno music, faster graphics, video games, or science fiction novels. They’ve mostly been offshoots of my personal interests. On the other hand, I have neither the skill nor the inclination to get involved in providing food, water, sex, or waste disposal, and as for shelter, well, I’m not exactly optimistic about the credit-stretched housing market.</p><p>Aka’s fictional company teaches corporate drones how to let the corporation think for them. That sort of thing is of no interest to me; I want to encourage people to think for themselves, not rely upon me, or anyone else, to do so, insofar as they are capable of it. But then it occurred to me that the two primary things I provided to the kids I have successfully coached are clarity and discipline. I didn’t teach them how to dribble, I taught them when to dribble and when to pass. I didn’t teach them how to shoot, I taught them when to look for the shot and when to look for the pass. I didn’t teach them how to tackle the guy with the ball, I taught them when to attack the ball and when to cut off the passing lanes.</p><p>On the soccer field, there are always a plethora of available options and decisions concerning which one to take need to be made so quickly that they are best made without thinking at all. In helping Ender make the transition from keeper to defender, I had to start with the very basics, and gradually bring him along a series of decision trees until he reached the point that he had internalized them and was reacting faster than I could call out directions from the sidelines.</p><p>About six months ago, I looked at what Athol Kay has been doing with his relationship counseling and concluded that I had no desire whatsoever to get involved with that can of worms. I have no interest in providing investment advice. And while it would be easy to start some sort of European men’s conference akin to Paul Elam’s recent one in Detroit, that doesn’t interest me either. I’m a game designer. I like to create systems that are both efficient and functional, and none of those things fit the bill.</p><p>But to design a system that permits an individual to life his life more effectively and efficiently, that is a fascinating challenge, indeed, in some respects, it is one I have been addressing in some fashion my entire life. I’m not saying that I’ve figured it out, but on the sheer basis of my literary output and my moderate success in various unrelated fields, I would estimate that I’m operating at about 50 percent more efficiency than the average. Now, one could put that down to my having about 50 percent more intelligence than the norm, but I know too many people who are smarter than I am who do less with more, and too many who do more with less, to accept that explanation.</p><p>So, I’m thinking about running a development experiment for what might be described as a technology-based life-design system, or semi-mechanical life-coaching. The aim would be for the system to be successful in objective terms for most people, low-cost or effectively no net cost to the user through the performance efficiencies gained, and zero bullshit. I’m not a guru or a spiritualist or a yogi, I’m a technologist and I believe in material metrics. None of that nebulous “he found his balance” or “she rediscovered her confidence” fraud. If it is effective across the board in material terms, there might be a business there. If it isn’t, then I’ll have failed quickly, without taking advantage of anyone, and I’ll move on to the next idea.</p><p>(This doesn’t have anything to do with dissatisfaction with either Castalia or Alpenwolf. Far from it. It is, rather an opportunity to test some of the ideas I’ve developed on myself as well as others. To a certain extent, it almost feels as if I somehow managed to kick my brain into a higher gear. Or perhaps I’m merely delusional with all the excitement surrounding the Hugo Awards.)</p><p>UPDATE: I have more than enough volunteers, thank you. I’ll be sending out some questionnaires within a week and will select the five test cases after that<i>.</i></p></div>",
  "content_text": "Over the years, I’ve had thousands of requests for advice. Some of it I’ve given publicly, some of it has remained private. Some people have taken it, more often they haven’t. Sometimes it has worked out, most of the time I have no idea what they did with it.\nNow, I’m certainly not saying my life is perfect. Far from it. I’ve made sub-optimal decisions, I’ve made mind-boggling mistakes, and if I had known at 19 what I know now, I might well own part of two billion-dollar corporations. But, as a general rule, I am able to accomplish what I set my mind to doing so long as I don’t get too bored.\nWhat most of you don’t know is that I’ve been lecturing this year at a technical institute, nominally teaching game development. But what I learned over the course of the spring semester was that while the information I was providing them was useful and valuable, the lessons they found most important had nothing directly to do with games or game development.\nGeneral concepts that I’ve learned and put into practice, such as failing faster, seeking external sources of motivation, incorporating objective metrics, demanding high performance, and leveraging personal connections to mutual benefit actually turned out to be much more valuable to them than the industry-specific ones. So much so, in fact, that several of the best students in the class asked permission to be able to attend it again in the fall.\n(I said yes and even gave the institute instructions to let them do so for a nominal fee instead of the usual cost, although this didn’t quite make sense to me in rational terms; I’d already taught them what I intend to teach in the fall. But now, thanks to the Murakami novel I’ve been reading, I think I understand what they’re seeking by repeating the course.)\nWhat hit the lightswitch was a passage in\nColorless Tsukuru Tazaki and His Years of Pilgrimage\n. Tazaki-san is speaking with his old friend Aka, from whom he has been estranged for more than twenty years. Aka runs a very successful creative business seminar company called BEYOND, which is one part corporate self-improvement, one part psychology, and one part bullshit. In explaining his success, Aka says:\nOne other thing I learned from working in a company was that the majority of people in the world have no problem following orders. They’re actually happy to be told what to do. They might complain, but that’s not how they really feel. They just grumble out of habit. If you told them to think for themselves, and make their own decisions and take responsibility for them, they’d be clueless. So I decided I could turn that into a business. It’s simple….\nThere are quite a few people who reject the program. You can divide them into two groups. The first is antisocial. In English you’d call them ‘outcasts.’ They just can’t accept any form of constructive criticism, no matter what it is. They reject any kind of group discipline. It’s a waste of time to deal with people like that, so we ask them to withdraw. The other group is comprised of people who actually think on their own. Those it’s best to leave alone. Don’t fool with them. Every system needs elite people like them. If things go well, they’ll eventually be in leadership positions. In the middle, between those two groups, are those who take orders from above and just do what they’re told. That’s the vast majority of people. By my rough estimate, 85 percent of the total. I developed this business to target the 85 percent.\nIn combination with a new writing program I’ve been using, that gave me an idea. Now, I’ve been trying to figure out how to start a business that is actually\nnecessary\nfor ten years. The fields in which I’ve been involved for years are pretty far down the priority list; no one really needs techno music, faster graphics, video games, or science fiction novels. They’ve mostly been offshoots of my personal interests. On the other hand, I have neither the skill nor the inclination to get involved in providing food, water, sex, or waste disposal, and as for shelter, well, I’m not exactly optimistic about the credit-stretched housing market.\nAka’s fictional company teaches corporate drones how to let the corporation think for them. That sort of thing is of no interest to me; I want to encourage people to think for themselves, not rely upon me, or anyone else, to do so, insofar as they are capable of it. But then it occurred to me that the two primary things I provided to the kids I have successfully coached are clarity and discipline. I didn’t teach them how to dribble, I taught them when to dribble and when to pass. I didn’t teach them how to shoot, I taught them when to look for the shot and when to look for the pass. I didn’t teach them how to tackle the guy with the ball, I taught them when to attack the ball and when to cut off the passing lanes.\nOn the soccer field, there are always a plethora of available options and decisions concerning which one to take need to be made so quickly that they are best made without thinking at all. In helping Ender make the transition from keeper to defender, I had to start with the very basics, and gradually bring him along a series of decision trees until he reached the point that he had internalized them and was reacting faster than I could call out directions from the sidelines.\nAbout six months ago, I looked at what Athol Kay has been doing with his relationship counseling and concluded that I had no desire whatsoever to get involved with that can of worms. I have no interest in providing investment advice. And while it would be easy to start some sort of European men’s conference akin to Paul Elam’s recent one in Detroit, that doesn’t interest me either. I’m a game designer. I like to create systems that are both efficient and functional, and none of those things fit the bill.\nBut to design a system that permits an individual to life his life more effectively and efficiently, that is a fascinating challenge, indeed, in some respects, it is one I have been addressing in some fashion my entire life. I’m not saying that I’ve figured it out, but on the sheer basis of my literary output and my moderate success in various unrelated fields, I would estimate that I’m operating at about 50 percent more efficiency than the average. Now, one could put that down to my having about 50 percent more intelligence than the norm, but I know too many people who are smarter than I am who do less with more, and too many who do more with less, to accept that explanation.\nSo, I’m thinking about running a development experiment for what might be described as a technology-based life-design system, or semi-mechanical life-coaching. The aim would be for the system to be successful in objective terms for most people, low-cost or effectively no net cost to the user through the performance efficiencies gained, and zero bullshit. I’m not a guru or a spiritualist or a yogi, I’m a technologist and I believe in material metrics. None of that nebulous “he found his balance” or “she rediscovered her confidence” fraud. If it is effective across the board in material terms, there might be a business there. If it isn’t, then I’ll have failed quickly, without taking advantage of anyone, and I’ll move on to the next idea.\n(This doesn’t have anything to do with dissatisfaction with either Castalia or Alpenwolf. Far from it. It is, rather an opportunity to test some of the ideas I’ve developed on myself as well as others. To a certain extent, it almost feels as if I somehow managed to kick my brain into a higher gear. Or perhaps I’m merely delusional with all the excitement surrounding the Hugo Awards.)\nUPDATE: I have more than enough volunteers, thank you. I’ll be sending out some questionnaires within a week and will select the five test cases after that\n.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-17T12:24:00+00:00"
}