{
  "url": "https://voxday.net/2014/08/21/come-back-he-cried-i-didnt-mean-i/",
  "scraped_at": "2025-12-16T12:25:01.757407",
  "title": "Come back, he cried. I didn’t mean it!",
  "date_display": "August 21, 2014",
  "date_iso": "2014-08-21T12:30:00+00:00",
  "date_from_url": "2014-08-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Scalzi, the leading light of science fiction’s Social Justice Warriors, appears to have belatedly realized that he is increasingly despised by the very people who bought most of his earlier books. This “twitter rant” is, of course, appropos of nothing at all and is TOTALLY UNRELATED to the fact that he a) has a new book out and b) recently embarrassed himself with a pair of Twitter rants about Larry Correia and me. So let’s pull a page out of Larry’s pocket and examine each of Scalzi’s claims:</p><p><i>Those who’ve seen me punt assholes here who happen to be conservative may be shocked to know there are conservatives I like/love/admire.—<br>    John Scalzi (@scalzi) August 20, 2014</br></i></p><p>It is probably true that there are conservatives he loves and admires.<br> Based on his past statements, he is married into a predominantly<br> Republican family. But that doesn’t change the fact that he frequently punts people<br> merely for the crime of disagreeing with him and asking him questions that he<br> doesn’t want to answer. In fact, he undermines his own case here with<br> the implicit claim that all the people he has ban-hammered or kittened or muted or otherwise punted in the past are assholes. A number of those people are now regular readers here and will be able to dispute his claim about them.</br></br></br></br></br></p><p><i>    In fact, there are many conservatives I like/love/admire, including much of my family and community, and many friends.—<br>    John Scalzi (@scalzi) August 20, 2014</br></i></p><p>Thereby demonstrating my immediately preceding point. Although I suspect there are not actually “many” conservatives and his relationships with those “many friends” are not anywhere nearly as friendly as Scalzi likes to pretend. He’s not even as close to some of his fellow Social Justice Warriors in the SF community as he affects to pretend in public. They are usually too polite not to play along.</p><p><i>    I am not one of those people who believes that opposing someone politics means you can’t like/love/admire them in other ways and areas.—<br>    John Scalzi (@scalzi) August 20, 2014</br></i></p><p><i> </i>He’s blatantly lying. There are many, many cases of him openly describing<br> various people he has never met, and whose character he does not know, as assholes on the sole basis of their<br> political views. He has also described certain political views as being<br> intrinsically bigoted and hateful in and of themselves.</br></br></br></p><p><i>    The reason you see me punting a lot of assholes who are conservative on Twitter is because they’re assholes first, conservatives second.—<br>    John Scalzi (@scalzi) August 20, 2014</br></i></p><p>This is observably untrue. It also shows that he was lying in his previous tweet. Scalzi<br> simply can’t credit that those “asshole views” are genuinely held<br> political beliefs that have nothing to do with the individual’s<br> character. He does not permit the questioning of most politically correct dogmas on his blog, which is one reason why there are now so few comments there.</br></br></br></p><p><i>    And it’s true that some people who are assholes use their conservatism as a rationalization/justification for being terrible people.—</i><br> <i>    John Scalzi (@scalzi) August 20, 2014</i></br></p><p>Is it true? Have you ever known anyone to use his conservatism as a rationalization for being a terrible person? Does that even make sense to you? I interpret this to mean that Scalzi is again inadvertently showing that he does, in fact, equate political conservatism with being a terrible person. Don’t forget that the guy isn’t particularly bright, Bachelor’s Degree in Philosophy of Language notwithstanding, so it’s far from improbable that he would inadvertently sabotage his own argument in the process of presenting it.</p><p><i>        But the fact is, they’re just assholes. They’d be assholes if they were centrist, liberal or arnarchists. Some people just suck.—</i><br> <i>    John Scalzi (@scalzi) August 20, 2014 </i></br></p><p>I find it telling that Scalzi somehow never<br> seems to be able to identify these “centrist, liberal or arnarchist”<br> assholes, much less attack them.</br></br></p><p><i>    (And indeed there are asshole liberals, centrists, anarchists, etc. I don’t like them, either.)—<br>    John Scalzi (@scalzi) August 20, 2014</br></i></p><p>When has Scalzi ever publicly attacked a feminist asshole? Or a<br> homosexual asshole? It may be that he secretly doesn’t like them, but he<br> observably gives them a free pass. He certainly hasn’t had much to say about the various child molesters and anti-white racists in SFWA.<br>   <br> <i> If you’re a conservative, be aware I don’t hate you for your politics, even though we have many points of contention, politically.—<br>    John Scalzi (@scalzi) August 20, 2014</br></i></br></br></br></br></p><p>He’s lying again. He does hate conservatives for their politics, unless<br> he has some other reason to look past them. However, he’s concerned about<br> the fact that his blog traffic has declined by 25 percent by his own<br> account (35 percent would be more accurate) and more and more<br> conservatives have, quite reasonably, declared that they have no<br> interest in buying books from an author who doesn’t conceal his contempt<br> for them and their beliefs.<br> <i><br>    Likewise, I assume you won’t hate me, even thought you think I’m completely wrong on many things regarding politics.—<br>    John Scalzi (@scalzi) August 20, 2014</br></br></i></br></br></br></br></br></br></br></p><p>This is projection. Scalzi doesn’t understand that no one ever hated him for his politics. Conservatives actually tend to be fairly tolerant in that regard; they are accustomed to friends and acquaintances being more left-leaning, and it is the left that socially rejects those with whom they do not agree. What conservatives and libertarians actually despise him for is his cowardice, his unmanly passive-aggressiveness,<br> and his unrelenting attempts to deceitfully spin the narrative in his<br> own favor. As he is doing now. And evidence for this contention can be seen in the way that it is not only conservatives and libertarians who harbor contempt for him, but increasingly, leftists and liberals as well.<br> <i><br>    But if you’re an asshole who happens to be conservative, I’m might let you know I think you’re an asshole. Who happens to be conservative.—<br>    John Scalzi (@scalzi) August 20, 2014</br></br></i></br></br></br></p><p>The reality is that if you’re a conservative who expresses his views in a<br> straightforward manner and asks Scalzi any question he can’t or doesn’t<br> want to answer, he will insult you and attempt to silence you.</br></br></p><p><i>    And if you’re an asshole who hides behind conservatism to cover your basic lack of humanity, I will like you even less.—<br>    John Scalzi (@scalzi) August 20, 2014</br></i></p><p>Scalzi again reveals that he fundamentally equates conservatism with a basic lack of humanity. And I’m sure we all fear him liking us even less than those he already publicly declares to be assholes. Apparently there is a Scale of Evil Right-wing Evil that runs from asshole to dudebro to bigoted shitheel and all the way up to Racist Sexist Homophobic Dipshit.</p><p><i>    Conservatism, although I disagree with much of it, deserves better than to be ill-used by you.—<br>    John Scalzi (@scalzi) August 20, 2014</br></i></p><p>I’ve seen better concern-trolling of conservatives by the New York Times and the Washington Post.</p><p><i>    (Conservatives, feel free to sub in “Liberals” there for your own taste, etc.)—<br>    John Scalzi (@scalzi) August 20, 2014</br></i></p><p>Again, when has Scalzi ever publicly attacked a feminist, a socialist, or a homosexual and personally attacked her character? Other than Sarah Palin, I’m not sure I’ve ever even seen him attack a woman’s character.</p><p><i>    Bottom line: If you’re a conservative, don’t assume I dislike you. I probably don’t. Your character as a human will show no matter what…—<br>    John Scalzi (@scalzi) August 20, 2014</br></i></p><p>The truth is that if you’re a conservative, Scalzi probably does dislike<br> you, considers you evil, and bigoted, and an asshole. But he is willing<br> to hide that dislike if you may be of potential use to him. So there is that.<br> <i><br>    ..and that’s the thing I’m going to respond to, first and foremost. Even when you tell I’m completely wrong about politics.—<br>    John Scalzi (@scalzi) August 20, 2014</br></br></i></br></br></br></p><p>As this latest Twitter epic demonstrates, the one thing John Scalzi actually responds to, first and foremost, is<i> losing control of the narrative</i>. Look how he repeatedly responds, however indirectly to everything I write about him. He has to, because I have successfully punctured the false narrative of John Scalzi, massively popular blogger, leading SF writer, and all-around great guy. As a quintessential Gamma male, the one thing he cannot bear is to have his carefully spun delusions methodically punctured and exposed, especially where others can witness it.</p><p>As I have stated previously, John Scalzi is a liar and a fraud. He lies <i>relentlessly</i> in order to market himself. He lies about <i>everything</i>. This belated pitch to conservative readers is no different from the way he repeatedly tried to make nice with the Baen gang after attacking Toni Weisskopf, or the way he tried to repair relations with John Ringo after Ringo rightly derided Scalzi’s <i>Redshirts </i>winning the Hugo Award in 2013. As it happens, I have considerably more information on the man than I have revealed, and I can assure you that his “warmly charming witty little man” persona is no more real than the two million monthly pageviews he publicly claimed in the interview with Lightspeed Magazine. He’s more accurately described as a narcissistic con artist with an unusual talent for self-promotion.</p><p>What Scalzi is trying to do with this rant is to spin the narrative and reverse the customary order of events. For nearly a decade, Scalzi has publicly attacked people he does not know specifically due to their political views, and labeled them assholes, or assbags, or bigoted shitheels, and so forth. Consider the first time he publicly attacked me, in response to a syndicated political op/ed I’d written, on <a href=\"http://nielsenhayden.com/electrolite/archives/006122.html#75601\">March 2, 2005</a>. Keep in mind I had never heard of the man at that time.</p><blockquote class=\"tr_bq\"><p> From what I know of Beale’s politics, he’s a jackass, and a fairly ignorant jackass at that. I feel pleased that my own politics, to the extent that they play any role in Nebula selection, are likely to counteract his (indeed, inasmuch as I sat on the short fiction jury this year, and we nominated a story by Eileen Gunn, it’s more than likely). Were you to join SFWA, provided you meet the entrance requirements, at the very least you could take pride in knowing you are also diluting the influence of this jackass on future Nebula Awards. </p></blockquote><p>Notice that it is my politics, and nothing else, that made me a jackass in his eyes. He knew nothing about me or my character, obviously, or he would have done as many more sensible people who disagree with me have done and either a) kept the discourse on an impersonal level or b) stayed the fuck away from me. (As Bill Simmons once wrote about Steve Smith: <i>Don’t talk to him, don’t look at him, don’t even make eye contact<br> with him. If he approaches you in the warm ups, act the same way you<br> would if you were hiking in the wilderness and a grizzly bear approached<br> you — don’t move, don’t react, don’t do anything until it walks away.</br></br></br></i>)</p><p>It should be obvious to anyone with a three-digit IQ that John Scalzi is simply attempting retroactive damage control. So, to paraphrase what I wrote two days ago, perhaps he is entirely correct and he doesn’t equate conservatives with assholes, I am both “a real bigoted shithole of a<br> human being” and “an undeserving bigot shithole”, my Hugo-nominated<br> novelette is “to put it charitably, not good”, and Larry Correia is<br> “whining about how [he] totally MEANT to fail spectacularly at the<br> Hugos” while trying to “RATIONALIZE [HIS] HUMILIATING DEFEAT”.</br></br></br></br></p><p>Or perhaps he is not, and he is simply lying about these things as he has been observed to lie about other things. In closing, I found this exchange on the post immediately preceding the rant to be amusing:</p><blockquote class=\"tr_bq\"><p> Todd: “Your chief opponent (who is not be named in this space) has definitely lost sales because of his political screeds.”</p><p>Scalzi: I don’t have a chief opponent, actually. I have some people who like to yell in my direction, however.</p></blockquote><p>As I said, he lies about everything. He doesn’t have a single reader who doesn’t know precisely to whom Todd is referring. More importantly, I was under the impression that people didn’t read my books or give me awards because I am a terrible writer. Hmm, perhaps I would sell more books if I wrote an epic Twitter rant about how much I really love left-liberals….</p></div>",
  "content_text": "John Scalzi, the leading light of science fiction’s Social Justice Warriors, appears to have belatedly realized that he is increasingly despised by the very people who bought most of his earlier books. This “twitter rant” is, of course, appropos of nothing at all and is TOTALLY UNRELATED to the fact that he a) has a new book out and b) recently embarrassed himself with a pair of Twitter rants about Larry Correia and me. So let’s pull a page out of Larry’s pocket and examine each of Scalzi’s claims:\nThose who’ve seen me punt assholes here who happen to be conservative may be shocked to know there are conservatives I like/love/admire.—\nJohn Scalzi (@scalzi) August 20, 2014\nIt is probably true that there are conservatives he loves and admires.\nBased on his past statements, he is married into a predominantly\nRepublican family. But that doesn’t change the fact that he frequently punts people\nmerely for the crime of disagreeing with him and asking him questions that he\ndoesn’t want to answer. In fact, he undermines his own case here with\nthe implicit claim that all the people he has ban-hammered or kittened or muted or otherwise punted in the past are assholes. A number of those people are now regular readers here and will be able to dispute his claim about them.\nIn fact, there are many conservatives I like/love/admire, including much of my family and community, and many friends.—\nJohn Scalzi (@scalzi) August 20, 2014\nThereby demonstrating my immediately preceding point. Although I suspect there are not actually “many” conservatives and his relationships with those “many friends” are not anywhere nearly as friendly as Scalzi likes to pretend. He’s not even as close to some of his fellow Social Justice Warriors in the SF community as he affects to pretend in public. They are usually too polite not to play along.\nI am not one of those people who believes that opposing someone politics means you can’t like/love/admire them in other ways and areas.—\nJohn Scalzi (@scalzi) August 20, 2014\nHe’s blatantly lying. There are many, many cases of him openly describing\nvarious people he has never met, and whose character he does not know, as assholes on the sole basis of their\npolitical views. He has also described certain political views as being\nintrinsically bigoted and hateful in and of themselves.\nThe reason you see me punting a lot of assholes who are conservative on Twitter is because they’re assholes first, conservatives second.—\nJohn Scalzi (@scalzi) August 20, 2014\nThis is observably untrue. It also shows that he was lying in his previous tweet. Scalzi\nsimply can’t credit that those “asshole views” are genuinely held\npolitical beliefs that have nothing to do with the individual’s\ncharacter. He does not permit the questioning of most politically correct dogmas on his blog, which is one reason why there are now so few comments there.\nAnd it’s true that some people who are assholes use their conservatism as a rationalization/justification for being terrible people.—\nJohn Scalzi (@scalzi) August 20, 2014\nIs it true? Have you ever known anyone to use his conservatism as a rationalization for being a terrible person? Does that even make sense to you? I interpret this to mean that Scalzi is again inadvertently showing that he does, in fact, equate political conservatism with being a terrible person. Don’t forget that the guy isn’t particularly bright, Bachelor’s Degree in Philosophy of Language notwithstanding, so it’s far from improbable that he would inadvertently sabotage his own argument in the process of presenting it.\nBut the fact is, they’re just assholes. They’d be assholes if they were centrist, liberal or arnarchists. Some people just suck.—\nJohn Scalzi (@scalzi) August 20, 2014\nI find it telling that Scalzi somehow never\nseems to be able to identify these “centrist, liberal or arnarchist”\nassholes, much less attack them.\n(And indeed there are asshole liberals, centrists, anarchists, etc. I don’t like them, either.)—\nJohn Scalzi (@scalzi) August 20, 2014\nWhen has Scalzi ever publicly attacked a feminist asshole? Or a\nhomosexual asshole? It may be that he secretly doesn’t like them, but he\nobservably gives them a free pass. He certainly hasn’t had much to say about the various child molesters and anti-white racists in SFWA.\nIf you’re a conservative, be aware I don’t hate you for your politics, even though we have many points of contention, politically.—\nJohn Scalzi (@scalzi) August 20, 2014\nHe’s lying again. He does hate conservatives for their politics, unless\nhe has some other reason to look past them. However, he’s concerned about\nthe fact that his blog traffic has declined by 25 percent by his own\naccount (35 percent would be more accurate) and more and more\nconservatives have, quite reasonably, declared that they have no\ninterest in buying books from an author who doesn’t conceal his contempt\nfor them and their beliefs.\nLikewise, I assume you won’t hate me, even thought you think I’m completely wrong on many things regarding politics.—\nJohn Scalzi (@scalzi) August 20, 2014\nThis is projection. Scalzi doesn’t understand that no one ever hated him for his politics. Conservatives actually tend to be fairly tolerant in that regard; they are accustomed to friends and acquaintances being more left-leaning, and it is the left that socially rejects those with whom they do not agree. What conservatives and libertarians actually despise him for is his cowardice, his unmanly passive-aggressiveness,\nand his unrelenting attempts to deceitfully spin the narrative in his\nown favor. As he is doing now. And evidence for this contention can be seen in the way that it is not only conservatives and libertarians who harbor contempt for him, but increasingly, leftists and liberals as well.\nBut if you’re an asshole who happens to be conservative, I’m might let you know I think you’re an asshole. Who happens to be conservative.—\nJohn Scalzi (@scalzi) August 20, 2014\nThe reality is that if you’re a conservative who expresses his views in a\nstraightforward manner and asks Scalzi any question he can’t or doesn’t\nwant to answer, he will insult you and attempt to silence you.\nAnd if you’re an asshole who hides behind conservatism to cover your basic lack of humanity, I will like you even less.—\nJohn Scalzi (@scalzi) August 20, 2014\nScalzi again reveals that he fundamentally equates conservatism with a basic lack of humanity. And I’m sure we all fear him liking us even less than those he already publicly declares to be assholes. Apparently there is a Scale of Evil Right-wing Evil that runs from asshole to dudebro to bigoted shitheel and all the way up to Racist Sexist Homophobic Dipshit.\nConservatism, although I disagree with much of it, deserves better than to be ill-used by you.—\nJohn Scalzi (@scalzi) August 20, 2014\nI’ve seen better concern-trolling of conservatives by the New York Times and the Washington Post.\n(Conservatives, feel free to sub in “Liberals” there for your own taste, etc.)—\nJohn Scalzi (@scalzi) August 20, 2014\nAgain, when has Scalzi ever publicly attacked a feminist, a socialist, or a homosexual and personally attacked her character? Other than Sarah Palin, I’m not sure I’ve ever even seen him attack a woman’s character.\nBottom line: If you’re a conservative, don’t assume I dislike you. I probably don’t. Your character as a human will show no matter what…—\nJohn Scalzi (@scalzi) August 20, 2014\nThe truth is that if you’re a conservative, Scalzi probably does dislike\nyou, considers you evil, and bigoted, and an asshole. But he is willing\nto hide that dislike if you may be of potential use to him. So there is that.\n..and that’s the thing I’m going to respond to, first and foremost. Even when you tell I’m completely wrong about politics.—\nJohn Scalzi (@scalzi) August 20, 2014\nAs this latest Twitter epic demonstrates, the one thing John Scalzi actually responds to, first and foremost, is\nlosing control of the narrative\n. Look how he repeatedly responds, however indirectly to everything I write about him. He has to, because I have successfully punctured the false narrative of John Scalzi, massively popular blogger, leading SF writer, and all-around great guy. As a quintessential Gamma male, the one thing he cannot bear is to have his carefully spun delusions methodically punctured and exposed, especially where others can witness it.\nAs I have stated previously, John Scalzi is a liar and a fraud. He lies\nrelentlessly\nin order to market himself. He lies about\neverything\n. This belated pitch to conservative readers is no different from the way he repeatedly tried to make nice with the Baen gang after attacking Toni Weisskopf, or the way he tried to repair relations with John Ringo after Ringo rightly derided Scalzi’s\nRedshirts\nwinning the Hugo Award in 2013. As it happens, I have considerably more information on the man than I have revealed, and I can assure you that his “warmly charming witty little man” persona is no more real than the two million monthly pageviews he publicly claimed in the interview with Lightspeed Magazine. He’s more accurately described as a narcissistic con artist with an unusual talent for self-promotion.\nWhat Scalzi is trying to do with this rant is to spin the narrative and reverse the customary order of events. For nearly a decade, Scalzi has publicly attacked people he does not know specifically due to their political views, and labeled them assholes, or assbags, or bigoted shitheels, and so forth. Consider the first time he publicly attacked me, in response to a syndicated political op/ed I’d written, on\nMarch 2, 2005\n. Keep in mind I had never heard of the man at that time.\nFrom what I know of Beale’s politics, he’s a jackass, and a fairly ignorant jackass at that. I feel pleased that my own politics, to the extent that they play any role in Nebula selection, are likely to counteract his (indeed, inasmuch as I sat on the short fiction jury this year, and we nominated a story by Eileen Gunn, it’s more than likely). Were you to join SFWA, provided you meet the entrance requirements, at the very least you could take pride in knowing you are also diluting the influence of this jackass on future Nebula Awards.\nNotice that it is my politics, and nothing else, that made me a jackass in his eyes. He knew nothing about me or my character, obviously, or he would have done as many more sensible people who disagree with me have done and either a) kept the discourse on an impersonal level or b) stayed the fuck away from me. (As Bill Simmons once wrote about Steve Smith:\nDon’t talk to him, don’t look at him, don’t even make eye contact\nwith him. If he approaches you in the warm ups, act the same way you\nwould if you were hiking in the wilderness and a grizzly bear approached\nyou — don’t move, don’t react, don’t do anything until it walks away.\n)\nIt should be obvious to anyone with a three-digit IQ that John Scalzi is simply attempting retroactive damage control. So, to paraphrase what I wrote two days ago, perhaps he is entirely correct and he doesn’t equate conservatives with assholes, I am both “a real bigoted shithole of a\nhuman being” and “an undeserving bigot shithole”, my Hugo-nominated\nnovelette is “to put it charitably, not good”, and Larry Correia is\n“whining about how [he] totally MEANT to fail spectacularly at the\nHugos” while trying to “RATIONALIZE [HIS] HUMILIATING DEFEAT”.\nOr perhaps he is not, and he is simply lying about these things as he has been observed to lie about other things. In closing, I found this exchange on the post immediately preceding the rant to be amusing:\nTodd: “Your chief opponent (who is not be named in this space) has definitely lost sales because of his political screeds.”\nScalzi: I don’t have a chief opponent, actually. I have some people who like to yell in my direction, however.\nAs I said, he lies about everything. He doesn’t have a single reader who doesn’t know precisely to whom Todd is referring. More importantly, I was under the impression that people didn’t read my books or give me awards because I am a terrible writer. Hmm, perhaps I would sell more books if I wrote an epic Twitter rant about how much I really love left-liberals….",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-21T11:30:00+00:00"
}