{
  "url": "https://voxday.net/2014/08/09/community-cohesion-and-its-foes/",
  "scraped_at": "2025-12-16T12:23:39.423947",
  "title": "Community cohesion and its foes",
  "date_display": "August 9, 2014",
  "date_iso": "2014-08-09T15:22:00+00:00",
  "date_from_url": "2014-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently the new term for freedom of association is <a href=\"http://www.washingtontimes.com/news/2014/aug/9/london-nun-tears-down-isil-flag-building/\">“community cohesion”</a>:</p><blockquote class=\"tr_bq\"><p> A nun in east London climbed to the top of a local building and ripped down a flag similar to the one flown by Jihadist militants in Syria and Iraq.</p><p>IB Times reported Friday that the flag was being flown alongside Palestinian flags and slogans in support of Gaza. Community members issued complaints over the flag with local council members, claiming that it was causing tension within the community. When council members went to take the flag down, they were surprised to find, someone had beat them to it.</p><p>“The council can confirm that following reports this morning of a<br> flag erected on the Will Crooks Estate, council officials took steps to<br> remove it but found it had already been taken down by Sister Christine<br> Frost, a well-known local activist and promoter of community cohesion,” a<br> council spokesman said.</br></br></br></br></p><p>Some argued that the black flag with<br> arabic writing resembling the flags flown by ISIL, also known as ISIS,<br> was only a symbol of Muslim faith and was not flown in support of<br> militant groups.</br></br></br></p></blockquote><p>Don’t listen to the taqiyyah. The black flag is a symbol of Islamic supremacy. It is a sad testament to the spineless men of the West that a woman has to act in their stead.</p><p>Never forget what ISIS stands for: murdered men, raped women, beheaded children, and the extermination of Christianity.</p></div>",
  "content_text": "Apparently the new term for freedom of association is\n“community cohesion”\n:\nA nun in east London climbed to the top of a local building and ripped down a flag similar to the one flown by Jihadist militants in Syria and Iraq.\nIB Times reported Friday that the flag was being flown alongside Palestinian flags and slogans in support of Gaza. Community members issued complaints over the flag with local council members, claiming that it was causing tension within the community. When council members went to take the flag down, they were surprised to find, someone had beat them to it.\n“The council can confirm that following reports this morning of a\nflag erected on the Will Crooks Estate, council officials took steps to\nremove it but found it had already been taken down by Sister Christine\nFrost, a well-known local activist and promoter of community cohesion,” a\ncouncil spokesman said.\nSome argued that the black flag with\narabic writing resembling the flags flown by ISIL, also known as ISIS,\nwas only a symbol of Muslim faith and was not flown in support of\nmilitant groups.\nDon’t listen to the taqiyyah. The black flag is a symbol of Islamic supremacy. It is a sad testament to the spineless men of the West that a woman has to act in their stead.\nNever forget what ISIS stands for: murdered men, raped women, beheaded children, and the extermination of Christianity.",
  "tags": [
    "religion",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-09T14:22:00+00:00"
}