{
  "url": "https://voxday.net/2014/08/30/denying-sf-dissing-baen/",
  "scraped_at": "2025-12-16T12:26:03.391873",
  "title": "Denying SF, dissing Baen",
  "date_display": "August 30, 2014",
  "date_iso": "2014-08-30T09:29:00+00:00",
  "date_from_url": "2014-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>He also claims that <a href=\"http://www.theguardian.com/books/booksblog/2014/aug/29/space-opera-new-guardians-of-the-galaxy-ancillary-justice\">“science fiction is not a genre”</a>. Which goes to show how much confidence you should place in the opinions of a man who hasn’t published a single novel and has more than a few prose deficiencies himself:</p><blockquote class=\"tr_bq\"><p> Today space opera is a battlefield for competing fantasies of the future. As America plunged in to renewed militarism after 9/11, sci-fi books again began to mirror real-world wars. Baen books specialises in works of “military SF” that, behind their appalling prose styles and laughable retro cover designs, speak to a right-wing readership who can recognise the enemies of America even when they are disguised as cannibal lizard aliens. Baen’s chief editor Toni Weisskopf went so far as to issue a diatribe against any and all sci-fi that did not pander to this conservative agenda.</p></blockquote><p>Hugo-nominated Baen Books author Larry Correia <a href=\"https://twitter.com/monsterhunter45/status/505524529913810944\">is unimpressed</a>: <i>“Damien Walter of the Guardian is a liar. Provide a cite where Toni Weisskopf ever said that or apologize and retract.”  </i><a href=\"http://bradrtorgersen.wordpress.com/2014/08/29/when-ignorant-snobs-attack/\">Equally unimpressed</a> is the Hugo-nominated Baen Books author Brad Torgersen:</p><blockquote class=\"tr_bq\"><p> I won’t feed this particularly empty ego any more than is necessary, suffice to say that the individual who wrote this obviously does not read very many (if any?) actual Baen books by actual Baen authors, nor do I think this person has actually read any such “diatribe” by my editor at Baen. In fact, I can state with certainty that the words “Toni Weisskopf” and “diatribe” do not belong in the same ZIP code. You will seldom find a less offensive, even-tempered, non-confrontational, fair-minded editor and publisher in the field today. And it’s not just an insult to her when shit like this (above) gets written, it’s an insult to all the many talented and varied authors who ply their trade beneath the Baen label. Myself included.</p><p>Unfortunately, ignorant snobbery of this sort is nothing new in the genre. You find out very quickly (once you begin publishing) which writers, editors, publishers, and artists enjoy the favor of the “society” people, and which writers, editors, publishers, and artists do not. My from-the-hip observation is that the “society” people want to see SF/F turned into a lightly speculative and fantastical carbon copy of the “prestigious literary” world. Replete with ambiguous covers that don’t really tell you anything about the story, but follow the general pattern of all things deemed “prestigious” and “literary.” If this year’s talked-about lit work features a somewhat fuzzy, off-focus photo of a pair of muddy Converse sneakers sitting on somebody’s front stoop, then by golly SF/F needs to follow suit with similar photos of similarly mundane, slightly off-focus objects which may or may not have anything to do with actual science fiction; as practiced traditionally by the greats.</p></blockquote><p>And so the battle between anti-canon Pink SF and pro-classic Blue SF continues to heat up. There is, however, one point with which I find myself in agreement with Our Friend Damien is that this battle will be good for real science fiction and those who love to read it, because it is exposing the pretenders and the frauds who have been selling not-science fiction under a false label of science fiction for two decades now.</p><p>While he is not a Baen Books author, the inimitable Tor Books and Castalia House author John C. Wright has also <a href=\"http://www.scifiwright.com/2014/08/musteline-yet-lacking-a-male-member/\">weighed in on the matter</a> as only he can. I daresay his criticism of Walter is considerably more entertaining, and more artfully crafted, than the sum total of Walter’s ouevre:</p><blockquote class=\"tr_bq\"><p> Allow me to translate from the airy emptiness of Newspeak to the Vulgate: he is saying a novel whose only gimmick is the lack of the use of male and female pronouns in order to aid the attempt of social engineers not to entertain science fiction readers as patrons of our craft but to indoctrination and Pavlovitize them toward a false-to-facts neurosis about human sexuality is healthy on the grounds that science fiction should be used not to tell entertaining stories about the future, but as a propaganda adjust to the political program of socialist progressivism, which means pervert-loving, man-hating, white-hating, Christian-hating, liberty-hating, life-hating nihilism.</p><p>I note to any Martians reading these words that humans come only in two sexes, male and female, and that the Brahmins of political correctness have decreed that fairness to sexual perverts requires that sexual reality to be changed. Naturally, reality cannot be changed, but what people say in public can.</p><p>Therefore the gentleman writing this article rejoices in the idea that science fiction be made into a department of the Ministry of Truth, so that anyone speaking frank and plain truth about human sexuality, if he is weak minded, will come to fear that his opinion is in the minority and unpleasing to the society at large. Once the truth is unpalatable, unspeakable, outlawed as a hate crime, everyone is a liar. When everyone is a liar, everyone is a cynic, and cynics never embrace the ideals necessary to join a rebellion.</p><p>In short, the gentleman penning this piece is glorying in the prospect of perverting science fiction from its intended purpose and making it into an instrument to spread and glorify sexual perversion.</p></blockquote><p>It’s also rather amusing to see a British individual who regularly claims that he hates British class issues to take what is the literary equivalent of a middle-class posture dismissing those dreadful working class Baen writers and their awful unwashed prose.</p></div>",
  "content_text": "He also claims that\n“science fiction is not a genre”\n. Which goes to show how much confidence you should place in the opinions of a man who hasn’t published a single novel and has more than a few prose deficiencies himself:\nToday space opera is a battlefield for competing fantasies of the future. As America plunged in to renewed militarism after 9/11, sci-fi books again began to mirror real-world wars. Baen books specialises in works of “military SF” that, behind their appalling prose styles and laughable retro cover designs, speak to a right-wing readership who can recognise the enemies of America even when they are disguised as cannibal lizard aliens. Baen’s chief editor Toni Weisskopf went so far as to issue a diatribe against any and all sci-fi that did not pander to this conservative agenda.\nHugo-nominated Baen Books author Larry Correia\nis unimpressed\n:\n“Damien Walter of the Guardian is a liar. Provide a cite where Toni Weisskopf ever said that or apologize and retract.”\nEqually unimpressed\nis the Hugo-nominated Baen Books author Brad Torgersen:\nI won’t feed this particularly empty ego any more than is necessary, suffice to say that the individual who wrote this obviously does not read very many (if any?) actual Baen books by actual Baen authors, nor do I think this person has actually read any such “diatribe” by my editor at Baen. In fact, I can state with certainty that the words “Toni Weisskopf” and “diatribe” do not belong in the same ZIP code. You will seldom find a less offensive, even-tempered, non-confrontational, fair-minded editor and publisher in the field today. And it’s not just an insult to her when shit like this (above) gets written, it’s an insult to all the many talented and varied authors who ply their trade beneath the Baen label. Myself included.\nUnfortunately, ignorant snobbery of this sort is nothing new in the genre. You find out very quickly (once you begin publishing) which writers, editors, publishers, and artists enjoy the favor of the “society” people, and which writers, editors, publishers, and artists do not. My from-the-hip observation is that the “society” people want to see SF/F turned into a lightly speculative and fantastical carbon copy of the “prestigious literary” world. Replete with ambiguous covers that don’t really tell you anything about the story, but follow the general pattern of all things deemed “prestigious” and “literary.” If this year’s talked-about lit work features a somewhat fuzzy, off-focus photo of a pair of muddy Converse sneakers sitting on somebody’s front stoop, then by golly SF/F needs to follow suit with similar photos of similarly mundane, slightly off-focus objects which may or may not have anything to do with actual science fiction; as practiced traditionally by the greats.\nAnd so the battle between anti-canon Pink SF and pro-classic Blue SF continues to heat up. There is, however, one point with which I find myself in agreement with Our Friend Damien is that this battle will be good for real science fiction and those who love to read it, because it is exposing the pretenders and the frauds who have been selling not-science fiction under a false label of science fiction for two decades now.\nWhile he is not a Baen Books author, the inimitable Tor Books and Castalia House author John C. Wright has also\nweighed in on the matter\nas only he can. I daresay his criticism of Walter is considerably more entertaining, and more artfully crafted, than the sum total of Walter’s ouevre:\nAllow me to translate from the airy emptiness of Newspeak to the Vulgate: he is saying a novel whose only gimmick is the lack of the use of male and female pronouns in order to aid the attempt of social engineers not to entertain science fiction readers as patrons of our craft but to indoctrination and Pavlovitize them toward a false-to-facts neurosis about human sexuality is healthy on the grounds that science fiction should be used not to tell entertaining stories about the future, but as a propaganda adjust to the political program of socialist progressivism, which means pervert-loving, man-hating, white-hating, Christian-hating, liberty-hating, life-hating nihilism.\nI note to any Martians reading these words that humans come only in two sexes, male and female, and that the Brahmins of political correctness have decreed that fairness to sexual perverts requires that sexual reality to be changed. Naturally, reality cannot be changed, but what people say in public can.\nTherefore the gentleman writing this article rejoices in the idea that science fiction be made into a department of the Ministry of Truth, so that anyone speaking frank and plain truth about human sexuality, if he is weak minded, will come to fear that his opinion is in the minority and unpleasing to the society at large. Once the truth is unpalatable, unspeakable, outlawed as a hate crime, everyone is a liar. When everyone is a liar, everyone is a cynic, and cynics never embrace the ideals necessary to join a rebellion.\nIn short, the gentleman penning this piece is glorying in the prospect of perverting science fiction from its intended purpose and making it into an instrument to spread and glorify sexual perversion.\nIt’s also rather amusing to see a British individual who regularly claims that he hates British class issues to take what is the literary equivalent of a middle-class posture dismissing those dreadful working class Baen writers and their awful unwashed prose.",
  "tags": [
    "SFWA",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-30T08:29:00+00:00"
}