{
  "url": "https://voxday.net/2014/08/26/dont-read-citations/",
  "scraped_at": "2025-12-16T12:25:30.051582",
  "title": "Don’t read the citations",
  "date_display": "August 26, 2014",
  "date_iso": "2014-08-26T06:56:00+00:00",
  "date_from_url": "2014-08-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I always find it intriguing how science posers always assume no one is actually going to read the links they provide, so they can get away with saying whatever they want. Brett Williamson posted this comment:</p><blockquote class=\"tr_bq\"><p> “Way before this debate took place Dr, Gorski laid out why the Hooker report is wrong (twice):</p><p>http://www.sciencebasedmedicine.org/did-a-high-ranking-whistleblower-really-reveal-that-the-cdc-covered-up-proof-that-vaccines-cause-autism-in-african-american-boys/</p><p>http://scienceblogs.com/insolence/2014/08/22/brian-hooker-proves-andrew-wakefield-wrong-about-vaccines-and-autism/#comment-346695</p><p>Both blog posts make valid, well articulated points. Puts a different light on the twitter exchange I would think.”</p></blockquote><p>So, naturally, I read the first link. David Gorski begins with no less than four paragraphs of an ad hominem attack on Brian Hooker, concluding with this statement: <i>“Of course, just because Brian Hooker has demonstrated many of the<br> characteristics of an antivaccine crank doesn’t mean that he might not<br> have a legitimate criticism this time. Does he? Let’s find out.”</br></br></i></p><p>After complaining about Hooker mentioning past scandals of medical science in a video that has nothing to do with the published paper, Gorski goes on to point out that Hooker has not proved something that his paper doesn’t even address. He finally gets around to making one legitimate point when he notes that: <i>“He analyzed data collected for a case-control study as a cohort study.”</i></p><p>That’s questionable, to be sure. But does this exonerate the CDC? Well, no, according to Gorski: <i>“So is Hooker’s result valid? Was there really a 3.4-fold increased risk<br> for autism in African-American males who received MMR vaccination before<br> the age of 36 months in this dataset? Who knows? </br></br></i><i>Probably not, though.”</i></p><p>Seriously, that’s Gorski’s big takedown. “Who knows? Probably not, though.” Well, obviously, in that case, the science is settled! What this demonstrates is exactly what I told Gorski at the start: statistical review is not science.<i> </i>What people are doing on both sides of the vaccine debate is playing statistical games in order to generate rhetorical ammo; they are not doing much in the way of actual science. And they harder they work their statistics, the more they amplify their rhetoric, the less credible they look to concerned parents and moderate parties alike.</p><p>As I’ve pointed out previously, the debate is not going to end until a large-scale double-blind study on the current US vaccine schedule is done with an unvaccinated control group. Pro-vaxxers can hide behind how that would be unethical and so forth all they want, but that is what it is going to take to convince those who are, quite reasonably, skeptical about vaccines due to the behavior of those who profit from the production and administration of them.</p><p>“Follow the money” may not be sound science, but it has historically proven to be reliable logic.  <i><br/></i></p></div>",
  "content_text": "I always find it intriguing how science posers always assume no one is actually going to read the links they provide, so they can get away with saying whatever they want. Brett Williamson posted this comment:\n“Way before this debate took place Dr, Gorski laid out why the Hooker report is wrong (twice):\nhttp://www.sciencebasedmedicine.org/did-a-high-ranking-whistleblower-really-reveal-that-the-cdc-covered-up-proof-that-vaccines-cause-autism-in-african-american-boys/\nhttp://scienceblogs.com/insolence/2014/08/22/brian-hooker-proves-andrew-wakefield-wrong-about-vaccines-and-autism/#comment-346695\nBoth blog posts make valid, well articulated points. Puts a different light on the twitter exchange I would think.”\nSo, naturally, I read the first link. David Gorski begins with no less than four paragraphs of an ad hominem attack on Brian Hooker, concluding with this statement:\n“Of course, just because Brian Hooker has demonstrated many of the\ncharacteristics of an antivaccine crank doesn’t mean that he might not\nhave a legitimate criticism this time. Does he? Let’s find out.”\nAfter complaining about Hooker mentioning past scandals of medical science in a video that has nothing to do with the published paper, Gorski goes on to point out that Hooker has not proved something that his paper doesn’t even address. He finally gets around to making one legitimate point when he notes that:\n“He analyzed data collected for a case-control study as a cohort study.”\nThat’s questionable, to be sure. But does this exonerate the CDC? Well, no, according to Gorski:\n“So is Hooker’s result valid? Was there really a 3.4-fold increased risk\nfor autism in African-American males who received MMR vaccination before\nthe age of 36 months in this dataset? Who knows?\nProbably not, though.”\nSeriously, that’s Gorski’s big takedown. “Who knows? Probably not, though.” Well, obviously, in that case, the science is settled! What this demonstrates is exactly what I told Gorski at the start: statistical review is not science.\nWhat people are doing on both sides of the vaccine debate is playing statistical games in order to generate rhetorical ammo; they are not doing much in the way of actual science. And they harder they work their statistics, the more they amplify their rhetoric, the less credible they look to concerned parents and moderate parties alike.\nAs I’ve pointed out previously, the debate is not going to end until a large-scale double-blind study on the current US vaccine schedule is done with an unvaccinated control group. Pro-vaxxers can hide behind how that would be unethical and so forth all they want, but that is what it is going to take to convince those who are, quite reasonably, skeptical about vaccines due to the behavior of those who profit from the production and administration of them.\n“Follow the money” may not be sound science, but it has historically proven to be reliable logic.",
  "tags": [
    "science",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-26T05:56:00+00:00"
}