{
  "url": "https://voxday.net/2014/08/28/enoch-powell-still-rig/",
  "scraped_at": "2025-12-16T12:25:48.434636",
  "title": "Enoch Powell: still right",
  "date_display": "August 28, 2014",
  "date_iso": "2014-08-28T09:27:00+00:00",
  "date_from_url": "2014-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Slowly, but surely, <a href=\"http://www.dailymail.co.uk/news/article-2736019/Enoch-Powell-RIGHT-warn-against-immigration-claims-former-Tory-defence-minister-Gerald-Howarth.html\">the evils of mass immigration</a> are causing people to stop being afraid of being called racist, as they gradually come to realize that if they do not fight back and repatriate the invaders, their culture and their civilization will die.</p><blockquote class=\"tr_bq\"><p> A veteran Tory MP has claimed controversial ‘rivers of blood’ MP Enoch Powell was right to warn against immigration. Gerald Howarth said the notorious Conservative MP had been correct to warn that mass movement of ‘non Christian’ migrants to Britain would cause problems.</p><p>His comments were made in an email to a constituent about the Islamist ‘Trojan Horse’ plot in Birmingham to radicalise school children by taking over governing boards.</p><p>In the leaked letter the former defence minister wrote: ‘Clearly, the arrival of so many people of non-Christian faith has presented a challenge, as so many of us, including the late Enoch Powell, warned decades ago.</p><p>‘Recent events have illustrated that some of these new arrivals have a very different ethos from traditional Christian schools and we are right to intervene to prevent them from teaching divisive ideology to children born here.’</p><p>Mr Howarth tonight confirmed that the leaked letter was ‘entirely accurate’ and reflected his views about the dangers of immigration….</p><p>Enoch Powell’s notorious ‘Rivers of Blood’ speech was delivered in Birmingham in April 1968, sparking widespread condemnation. In the speech Mr Powell called for the ‘repatriation’ of non-white immigrants, claiming the racial mix in Britain would lead to city riots. Sir Gerald did not advocate repatriation in the leaked email to his constituent.</p></blockquote><p><a href=\"http://www.milobookclub.com/wp-content/uploads/2014/08/GGT_1969.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/08/GGT_1969.png\" width=\"216\"/></a>It’s been interesting to see how most of the accusations of racism made by SWPLs and SJWs have abruptly trickled to a minimum ever since I revealed that I am a Native American eligible for enrollment in my ancestral tribe. All those accusations of my being a white supremacist, which were utterly stupid from the start given my known Hispanic background, have almost entirely vanished, thus proving that they are far more intrinsically racist than they ever accused me of being. Because my ideas haven’t changed in the interim, only their awareness of what I am. In fact, the more I have learned about my tribe, the more I am convinced that there is absolutely no room for compromise on the issue of mass immigration by Europeans and European-Americans who wish to preserve Western civilization.</p><p>What has happened to my tribe since the Spanish first encountered them is horrific. Decimated doesn’t even begin to describe it. Their language is nearly extinct, their numbers are very small, and only recently has the Internet made it possible for people like my family to learn about its connections to them. And lest you think I didn’t always know perfectly well that my family wasn’t exactly like all of my Scandinavian friends and neighbors in Minnesota, that is a picture of me with my grandparents. My grandmother is the daughter of a Mexican revolutionary and the Indian woman he married after he fled Pancho Villa’s assassins. And of all my family, they were the two people to whom I was always the closest.</p><p>So, perhaps you’ll understand the unmitigated extent of my contempt when I see lily-white liberals and black race-baiters attempting to disqualify my perfectly rational views from discussion by falsely claiming that I am a racist white supremacist, and why I don’t hesitate to play the Red card in order to shut down their lying rhetoric. Because I am both Native American and Native European, and I don’t wish to see what happened to the former people happen to the latter. It has happened before, it can happen again, <i>and it will happen</i> if the natives do not heed the wisdom of Enoch Powell and repatriate their would-be conquerors.</p><p>And it is telling, is it not, that The Daily Mail will not accept comments on the Howarth article? I suspect that even the nominally conservative UK media does not wish for people to grasp the true depth of the widespread public support for Powell’s position.</p><p>UPDATE: Speaking of UK politics, <a href=\"http://blogs.telegraph.co.uk/news/peteroborne/100284247/douglas-carswells-defection-is-a-seismic-shock-to-the-british-political-system/?fb\">this is big news</a> out of Britain:</p><blockquote class=\"tr_bq\"><p> Mr Carswell cannot be dismissed as a naive or out of touch intellectual. Let us remember that it was five years ago that it was Carswell who set in motion the movement which swept Speaker Martin from office in the wake of the expenses scandal.</p><p>This is why I believe that Mr Carswell’s decision to quit the Tory party and join Nigel Farage’s Ukip is a seismic political event. He cannot be compared to the ordinary self-interested political defections, for instance Shaun Woodward or Quentin Davies’ departure from the Conservatives to New Labour, in 2001 and 2007 respectively. Mr Carswell, and this is completely terrifying for David Cameron, is acting out of conviction rather than self-interest.</p></blockquote><p>Men of principle acting out of conviction rather than self-interest changes the world. No wonder it terrifies so many people.</p><p>UPDATE 2: <a href=\"http://www.telegraph.co.uk/news/uknews/crime/11060102/Rotherham-the-council-leaders-who-presided-over-child-abuse-scandal.html\">Keep this in mind</a>:</p><blockquote class=\"tr_bq\"><p> The woman who presided over the last five years of failure as the boss of<br> children’s services at Rotherham Council is the same executive who removed<br> three children from their foster parents because they were Ukip voters…. Mrs Thacker lives with her husband in a four-bedroomed house in Shipley, West<br> Yorkshire.</br></br></br></p></blockquote></div>",
  "content_text": "Slowly, but surely,\nthe evils of mass immigration\nare causing people to stop being afraid of being called racist, as they gradually come to realize that if they do not fight back and repatriate the invaders, their culture and their civilization will die.\nA veteran Tory MP has claimed controversial ‘rivers of blood’ MP Enoch Powell was right to warn against immigration. Gerald Howarth said the notorious Conservative MP had been correct to warn that mass movement of ‘non Christian’ migrants to Britain would cause problems.\nHis comments were made in an email to a constituent about the Islamist ‘Trojan Horse’ plot in Birmingham to radicalise school children by taking over governing boards.\nIn the leaked letter the former defence minister wrote: ‘Clearly, the arrival of so many people of non-Christian faith has presented a challenge, as so many of us, including the late Enoch Powell, warned decades ago.\n‘Recent events have illustrated that some of these new arrivals have a very different ethos from traditional Christian schools and we are right to intervene to prevent them from teaching divisive ideology to children born here.’\nMr Howarth tonight confirmed that the leaked letter was ‘entirely accurate’ and reflected his views about the dangers of immigration….\nEnoch Powell’s notorious ‘Rivers of Blood’ speech was delivered in Birmingham in April 1968, sparking widespread condemnation. In the speech Mr Powell called for the ‘repatriation’ of non-white immigrants, claiming the racial mix in Britain would lead to city riots. Sir Gerald did not advocate repatriation in the leaked email to his constituent.\nIt’s been interesting to see how most of the accusations of racism made by SWPLs and SJWs have abruptly trickled to a minimum ever since I revealed that I am a Native American eligible for enrollment in my ancestral tribe. All those accusations of my being a white supremacist, which were utterly stupid from the start given my known Hispanic background, have almost entirely vanished, thus proving that they are far more intrinsically racist than they ever accused me of being. Because my ideas haven’t changed in the interim, only their awareness of what I am. In fact, the more I have learned about my tribe, the more I am convinced that there is absolutely no room for compromise on the issue of mass immigration by Europeans and European-Americans who wish to preserve Western civilization.\nWhat has happened to my tribe since the Spanish first encountered them is horrific. Decimated doesn’t even begin to describe it. Their language is nearly extinct, their numbers are very small, and only recently has the Internet made it possible for people like my family to learn about its connections to them. And lest you think I didn’t always know perfectly well that my family wasn’t exactly like all of my Scandinavian friends and neighbors in Minnesota, that is a picture of me with my grandparents. My grandmother is the daughter of a Mexican revolutionary and the Indian woman he married after he fled Pancho Villa’s assassins. And of all my family, they were the two people to whom I was always the closest.\nSo, perhaps you’ll understand the unmitigated extent of my contempt when I see lily-white liberals and black race-baiters attempting to disqualify my perfectly rational views from discussion by falsely claiming that I am a racist white supremacist, and why I don’t hesitate to play the Red card in order to shut down their lying rhetoric. Because I am both Native American and Native European, and I don’t wish to see what happened to the former people happen to the latter. It has happened before, it can happen again,\nand it will happen\nif the natives do not heed the wisdom of Enoch Powell and repatriate their would-be conquerors.\nAnd it is telling, is it not, that The Daily Mail will not accept comments on the Howarth article? I suspect that even the nominally conservative UK media does not wish for people to grasp the true depth of the widespread public support for Powell’s position.\nUPDATE: Speaking of UK politics,\nthis is big news\nout of Britain:\nMr Carswell cannot be dismissed as a naive or out of touch intellectual. Let us remember that it was five years ago that it was Carswell who set in motion the movement which swept Speaker Martin from office in the wake of the expenses scandal.\nThis is why I believe that Mr Carswell’s decision to quit the Tory party and join Nigel Farage’s Ukip is a seismic political event. He cannot be compared to the ordinary self-interested political defections, for instance Shaun Woodward or Quentin Davies’ departure from the Conservatives to New Labour, in 2001 and 2007 respectively. Mr Carswell, and this is completely terrifying for David Cameron, is acting out of conviction rather than self-interest.\nMen of principle acting out of conviction rather than self-interest changes the world. No wonder it terrifies so many people.\nUPDATE 2:\nKeep this in mind\n:\nThe woman who presided over the last five years of failure as the boss of\nchildren’s services at Rotherham Council is the same executive who removed\nthree children from their foster parents because they were Ukip voters…. Mrs Thacker lives with her husband in a four-bedroomed house in Shipley, West\nYorkshire.",
  "tags": [
    "immigration",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-28T08:27:00+00:00"
}