{
  "url": "https://voxday.net/2014/08/19/fraud-and-douchebaggery/",
  "scraped_at": "2025-12-16T12:24:49.591965",
  "title": "Fraud and douchebaggery",
  "date_display": "August 19, 2014",
  "date_iso": "2014-08-19T12:30:00+00:00",
  "date_from_url": "2014-08-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This Twitter conversation amused me greatly:</p><blockquote class=\"tr_bq\"><p> Bob ‏@bobby_5150<br> Between @voxday and @scalzi , who would have thought scalzi would be the bigger douche bag. (;:;)</br></p><p>Agree&amp;Amplify ‏@angreeandamp<br> @bobby_5150 Makes You wonder just what else Vox may be right about.</br></p></blockquote><p>For some time now, John Scalzi has been offering dubious explanations of his past traffic claims. Last year he stopped reporting his annual traffic and even resorted to posting misleading evidence of a one-day traffic spike driven by an external source in order to shore up his more fraudulent claims. However, it turns out that he was even more grossly fraudulent than we knew when talking himself up to the media. Consider <a href=\"http://www.lightspeedmagazine.com/nonfiction/interview-john-scalzi/\">his 2010 interview</a> with this Hugo-winning SF/F magazine, in which he undeniably misrepresented the amount of traffic his site receives by a factor of between 17.5 and five, respectively.</p><blockquote class=\"tr_bq\"><p> Interview: John Scalzi<br> by Erin Stocks<br> Published September 2010</br></br></p><p>Anything you ever wanted to know about science fiction writer John Scalzi you can find online at the public and rather opinionated blog that he’s kept since 1998, whatever.scalzi.com/. His bio page holds all the usual info—education, past jobs, present jobs, books published, awards won—and is wrapped up with the tongue-in-cheek coda: “For more detailed information, including a complete bibliography, visit the Wikipedia entry on me. It’s generally accurate.”</p><p>But spend a little more time browsing, and you’ll learn that beyond the dry stats and quippy bon mots, there’s more to John Scalzi and his writing than meets the eye. For one thing, his blog gets an extraordinary amount of traffic for a writer’s website–Scalzi himself quotes it at over 45,000 unique visitors daily and more than two million page views monthly.</p></blockquote><p>As it happens, there is considerably more of interest beyond “the dry stats”. For various reasons that have absolutely nothing to do with my relationship with certain hacker groups, I am in possession of a considerable amount of Mr. Scalzi’s historical traffic statistics and to say that he exaggerated his blog traffic does not really do the man justice. Consider: for the 12-month period from September 2009 to August 2010 immediately preceding the September interview with Ms Stocks, Whatever had 4,916,947 pageviews. And while 409,745 pageviews per month isn’t bad, it is considerably less than the “extraordinary amount” of “more than two million page views monthly” that he claimed at the time.</p><p><a href=\"http://scalzi.files.wordpress.com/2012/12/8m.png?w=604\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://scalzi.files.wordpress.com/2012/12/8m.png?w=604\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://scalzi.files.wordpress.com/2012/12/8m.png?w=604\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a>You don’t need to take my word for it either, as in his post entitled <a href=\"http://whatever.scalzi.com/2012/12/25/eight-million-views-for-2012/\">8 Million Views for 2012</a>, Scalzi happened to include a graphic summary of his annual pageviews from previous years, shown here on the right. The 4.49 million number is for 2009 and equates to 374,023 per month. The 5.13 million is for 2010 and amounts to 427,599 per month. Obviously, the 409,745-pageview number for the twelve-month period in between is both credible and substantiated by Scalzi’s own report.</p><p>Nor will his usual retreat to the “up to” excuse hold any water. The fact is that at no point, either before or after the Lightspeed interview, did Whatever ever have “more than two million page views monthly”. John Scalzi has only once ever had more than one million page views, barely, in May 2012. And his unique visitor claim is even less accurate. Prior to September 2010, Whatever’s peak MONTHLY unique visitors was just under 135,000, in February 2010. That means that far from being “over 45,000 unique visitors daily”, he was actually seeing “under 4,500 unique visitors daily”. Considerably under, as it happens; the actual number of daily unique visitors from September 2009 through August 2010 was 2,567. Which even the most math-illiterate pinkshirt should be able to grasp is not “over 45,000”.</p><p>Now, you may not like me at all. You may not agree with me about much. You may even believe that I am Voxemort, the Supreme Dark Lord, whose name must not be mentioned in the science fiction and fantasy world, in a non-ironic sense. But none of that changes the observable facts. And the facts are that John Scalzi is a <i>proven </i>liar, a fraudulent self-marketer who has regularly inflated his reported traffic in a self-serving manner, and an inherently untrustworthy individual. You simply cannot take anything the man says at face value, much less place any confidence in the narrative he attempts to pass off, because his primary concern is how any given fact or individual can best serve what he perceives to be his interests.</p><p>It may help to understand that my perspective has always been iconoclastic and my opinions have been widely read since I was first nationally syndicated back in 1995. As a result, I am under a certain amount of pressure to never modify, spin, or manipulate information in any deceptive or misleading way, because there are literally dozens of critics who dislike me and are waiting to exploit even the smallest slip-up. (Look what resulted from that single tweeted blog link, for example.) It has been that way for nearly twenty years now. So, if I am saying something about my traffic, or especially about someone else’s traffic, you can bet your <i>life </i>on the fact that I am telling you the absolute truth to the extent that it is available to me.</p><p>I have had a Sitemeter widget on the sidebar for the entire existence of this blog. I have a Google pageviews widget on the sidebar of the AG blog, and I would have one here if it worked with the old template that I prefer and still use. When I say that this blog had 41,075 pageviews yesterday, or that there were 62,971 pageviews between the two one week ago, or the two blogs will get over 1.5 million pageviews this month, I am not exaggerating in the slightest and I can easily prove the truth of my assertions. John Scalzi has all the same information about his traffic that I do and more. All he has to do to prove me to be a liar is to simply make public his WordPress statistics from September 2009 to August 2010.</p><p>Ask yourself why he does not do so. Ask yourself why he will not do so. Ask yourself why he has not only continued to hide his daily traffic numbers since I first called them into question last year, but is now releasing even less information than he did before. And then, like Agree&amp;Amplify, you might consider asking yourself, what else is Vox right about? <i>What else is John Scalzi lying about?</i></p><p>Now, perhaps he is entirely correct and I am “a real bigoted shithole of a human being” and “an undeserving bigot shithole”, my Hugo-nominated novelette is “to put it charitably, not good”, and Larry Correia is “whining about how [he] totally MEANT to fail spectacularly at the Hugos” and trying to “RATIONALIZE [HIS] HUMILIATING DEFEAT”.</p><p>Or perhaps he is not, and he is simply lying about these things as he has been observed to lie about other things. The incontrovertible evidence is right there in front of you. To take it into account or to blithely ignore it is up to you. And it’s mysterious, is it not, that this very well-sourced and impartial information concerning his “more than two million page views monthly” is missing from his Wikipedia page.</p></div>",
  "content_text": "This Twitter conversation amused me greatly:\nBob ‏@bobby_5150\nBetween @voxday and @scalzi , who would have thought scalzi would be the bigger douche bag. (;:;)\nAgree&Amplify ‏@angreeandamp\n@bobby_5150 Makes You wonder just what else Vox may be right about.\nFor some time now, John Scalzi has been offering dubious explanations of his past traffic claims. Last year he stopped reporting his annual traffic and even resorted to posting misleading evidence of a one-day traffic spike driven by an external source in order to shore up his more fraudulent claims. However, it turns out that he was even more grossly fraudulent than we knew when talking himself up to the media. Consider\nhis 2010 interview\nwith this Hugo-winning SF/F magazine, in which he undeniably misrepresented the amount of traffic his site receives by a factor of between 17.5 and five, respectively.\nInterview: John Scalzi\nby Erin Stocks\nPublished September 2010\nAnything you ever wanted to know about science fiction writer John Scalzi you can find online at the public and rather opinionated blog that he’s kept since 1998, whatever.scalzi.com/. His bio page holds all the usual info—education, past jobs, present jobs, books published, awards won—and is wrapped up with the tongue-in-cheek coda: “For more detailed information, including a complete bibliography, visit the Wikipedia entry on me. It’s generally accurate.”\nBut spend a little more time browsing, and you’ll learn that beyond the dry stats and quippy bon mots, there’s more to John Scalzi and his writing than meets the eye. For one thing, his blog gets an extraordinary amount of traffic for a writer’s website–Scalzi himself quotes it at over 45,000 unique visitors daily and more than two million page views monthly.\nAs it happens, there is considerably more of interest beyond “the dry stats”. For various reasons that have absolutely nothing to do with my relationship with certain hacker groups, I am in possession of a considerable amount of Mr. Scalzi’s historical traffic statistics and to say that he exaggerated his blog traffic does not really do the man justice. Consider: for the 12-month period from September 2009 to August 2010 immediately preceding the September interview with Ms Stocks, Whatever had 4,916,947 pageviews. And while 409,745 pageviews per month isn’t bad, it is considerably less than the “extraordinary amount” of “more than two million page views monthly” that he claimed at the time.\nYou don’t need to take my word for it either, as in his post entitled\n8 Million Views for 2012\n, Scalzi happened to include a graphic summary of his annual pageviews from previous years, shown here on the right. The 4.49 million number is for 2009 and equates to 374,023 per month. The 5.13 million is for 2010 and amounts to 427,599 per month. Obviously, the 409,745-pageview number for the twelve-month period in between is both credible and substantiated by Scalzi’s own report.\nNor will his usual retreat to the “up to” excuse hold any water. The fact is that at no point, either before or after the Lightspeed interview, did Whatever ever have “more than two million page views monthly”. John Scalzi has only once ever had more than one million page views, barely, in May 2012. And his unique visitor claim is even less accurate. Prior to September 2010, Whatever’s peak MONTHLY unique visitors was just under 135,000, in February 2010. That means that far from being “over 45,000 unique visitors daily”, he was actually seeing “under 4,500 unique visitors daily”. Considerably under, as it happens; the actual number of daily unique visitors from September 2009 through August 2010 was 2,567. Which even the most math-illiterate pinkshirt should be able to grasp is not “over 45,000”.\nNow, you may not like me at all. You may not agree with me about much. You may even believe that I am Voxemort, the Supreme Dark Lord, whose name must not be mentioned in the science fiction and fantasy world, in a non-ironic sense. But none of that changes the observable facts. And the facts are that John Scalzi is a\nproven\nliar, a fraudulent self-marketer who has regularly inflated his reported traffic in a self-serving manner, and an inherently untrustworthy individual. You simply cannot take anything the man says at face value, much less place any confidence in the narrative he attempts to pass off, because his primary concern is how any given fact or individual can best serve what he perceives to be his interests.\nIt may help to understand that my perspective has always been iconoclastic and my opinions have been widely read since I was first nationally syndicated back in 1995. As a result, I am under a certain amount of pressure to never modify, spin, or manipulate information in any deceptive or misleading way, because there are literally dozens of critics who dislike me and are waiting to exploit even the smallest slip-up. (Look what resulted from that single tweeted blog link, for example.) It has been that way for nearly twenty years now. So, if I am saying something about my traffic, or especially about someone else’s traffic, you can bet your\nlife\non the fact that I am telling you the absolute truth to the extent that it is available to me.\nI have had a Sitemeter widget on the sidebar for the entire existence of this blog. I have a Google pageviews widget on the sidebar of the AG blog, and I would have one here if it worked with the old template that I prefer and still use. When I say that this blog had 41,075 pageviews yesterday, or that there were 62,971 pageviews between the two one week ago, or the two blogs will get over 1.5 million pageviews this month, I am not exaggerating in the slightest and I can easily prove the truth of my assertions. John Scalzi has all the same information about his traffic that I do and more. All he has to do to prove me to be a liar is to simply make public his WordPress statistics from September 2009 to August 2010.\nAsk yourself why he does not do so. Ask yourself why he will not do so. Ask yourself why he has not only continued to hide his daily traffic numbers since I first called them into question last year, but is now releasing even less information than he did before. And then, like Agree&Amplify, you might consider asking yourself, what else is Vox right about?\nWhat else is John Scalzi lying about?\nNow, perhaps he is entirely correct and I am “a real bigoted shithole of a human being” and “an undeserving bigot shithole”, my Hugo-nominated novelette is “to put it charitably, not good”, and Larry Correia is “whining about how [he] totally MEANT to fail spectacularly at the Hugos” and trying to “RATIONALIZE [HIS] HUMILIATING DEFEAT”.\nOr perhaps he is not, and he is simply lying about these things as he has been observed to lie about other things. The incontrovertible evidence is right there in front of you. To take it into account or to blithely ignore it is up to you. And it’s mysterious, is it not, that this very well-sourced and impartial information concerning his “more than two million page views monthly” is missing from his Wikipedia page.",
  "tags": [
    "McRapey",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-19T11:30:00+00:00"
}