{
  "url": "https://voxday.net/2014/08/07/he-doth-protest-too-muc/",
  "scraped_at": "2025-12-16T12:23:25.684336",
  "title": "He doth protest too much",
  "date_display": "August 7, 2014",
  "date_iso": "2014-08-07T09:34:00+00:00",
  "date_from_url": "2014-08-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is richly ironic that Jimmy Wales, of all people, is complaining about the EU laws <a href=\"http://www.telegraph.co.uk/technology/wikipedia/11015901/EU-ruling-on-link-removal-deeply-immoral-says-Wikipedia-founder.html\">suppressing the truth on the Internet</a>:</p><blockquote class=\"tr_bq\"><p> Speaking at Wikipedia’s annual Wikimania conference in London today, Wales said: “History is a human right and one of the worst things that a person can do is attempt to use force to silence another.</p><p>“I’ve been in the public eye for quite some time; some people say good things and some people say bad things. That’s history and I would never ever use any kind of legal process like this to try to suppress the truth. I think that’s deeply immoral.”</p></blockquote><p>I can’t think of any non-state organization that suppresses the truth as much as Wikipedia.  The system that Wales has set up ruthlessly and relentlessly suppresses the truth under its false rubric of requiring a “reliable source”.</p><p>Don’t take my word for it. Look at the Wikipedia page about me. Does that describe my views at all? Are the totality of my views really limited to little more than a feud with John Scalzi and my expulsion from SFWA? Do I have no opinions on economics, politics, philosophy, literature, and religion despite having written books on the former and the latter? It’s telling, too, to observe that if the so-called feud and the expulsion are the only significant aspects of my views, there is no mention of the connection between the former and the latter.</p><p>Now, here are my views on the various schools of economics:</p><p><i>The Austrian school of economics presently provides Man’s best understanding of the field of economics, but the core mechanism for its business cycle is incorrect. In place of the shift between consumer goods and capital goods, it is the limits of demand for credit that is the causal factor of the boom-bust cycle.</i></p><p>Those are my actual views on the subject. That is the absolute truth. Post them on Wikipedia and they’ll be suppressed within 24 hours even though most of my other “views” are directly taken from the “reliable source” that is my own writing.</p><p>UPDATE: Speaking of the so-called feud, I thought this Twitter exchange between one ClarkHat and John Scalzi was illuminating. McRapey clearly doesn’t grasp (or more likely, being a gamma male, is unable to publicly admit), that he is a successful, but mediocre SF writer, not even when his book was picked up for a television series by the distinguished network famous for <i>Sharknado </i>and <i>Werewolves vs Strippers</i>:</p><blockquote class=\"tr_bq\"><p> CLARKHAT: Would you care to actually respond to my comments that 1) your writing is mediocre 2) your rewards &gt;&gt; your merit</p><p>JOHN SCALZI: <i>Sure: 1. You’re wrong, 2. You’re wrong but even if you were right so what? Hope that helps.</i></p><p>CH: suggests a theory I hadn’t considered: you really DON’T understand the delta between your work &amp; great work</p><p>JS: <i>Your problem is you have really no understanding of my psychology. Which is fine, but doesn’t make you less wrong. I don’t mind you being wrong, however, as it has no effect on what I do or how I do it. Go on being wrong!</i></p><p><i>You and I have no disagreement in you sharing your thoughts on what is great writing. Do! I think that’s a fine thing.</i></p><p>CH: But this is again Blue Model reframing: “your thoughts”. My pt is not about “my truth”; it is about objective artistic truth. I am not saying “**I** prefer Mieville over @scalzi”; I am saying “objective standards exist; try some Mieville”.</p><p>JS:<i> “Objective artistic truth.” Ooooh, I have the giggles now. DO GO ON.</i></p><p>CH: “You think Davinci’s David is better than my paper mache puppet of Donald Trump? That’s just, like, your opinion, man.</p><p>JS: <i>This objective art hypothesis of yours is ADORABLE. And explains many things, i.e., “What I like is OBJECTIVELY great, so there.” </i></p></blockquote><p>That’s the amusing thing about McRapey. For all his vaunted rhetorical skills granted by virtue of BACHELOR’S DEGREE IN PHILOSOPHY OF LANGUAGE, he doesn’t grasp that he can’t assert that ClarkHat is wrong about him being a mediocre writer while simultaneously denying the concept of objective standards in art.</p><p>If all art is subjective, then Scalzi is a mediocre writer by virtue of ClarkHat subjectively declaring him to be so. And if all art is objective, then he is a mediocre writer by virtue of the comparison of his work with that of other, better writers. There is no way that Scalzi can correctly declare ClarkHat to be wrong, as he nevertheless repeatedly does.</p></div>",
  "content_text": "It is richly ironic that Jimmy Wales, of all people, is complaining about the EU laws\nsuppressing the truth on the Internet\n:\nSpeaking at Wikipedia’s annual Wikimania conference in London today, Wales said: “History is a human right and one of the worst things that a person can do is attempt to use force to silence another.\n“I’ve been in the public eye for quite some time; some people say good things and some people say bad things. That’s history and I would never ever use any kind of legal process like this to try to suppress the truth. I think that’s deeply immoral.”\nI can’t think of any non-state organization that suppresses the truth as much as Wikipedia.  The system that Wales has set up ruthlessly and relentlessly suppresses the truth under its false rubric of requiring a “reliable source”.\nDon’t take my word for it. Look at the Wikipedia page about me. Does that describe my views at all? Are the totality of my views really limited to little more than a feud with John Scalzi and my expulsion from SFWA? Do I have no opinions on economics, politics, philosophy, literature, and religion despite having written books on the former and the latter? It’s telling, too, to observe that if the so-called feud and the expulsion are the only significant aspects of my views, there is no mention of the connection between the former and the latter.\nNow, here are my views on the various schools of economics:\nThe Austrian school of economics presently provides Man’s best understanding of the field of economics, but the core mechanism for its business cycle is incorrect. In place of the shift between consumer goods and capital goods, it is the limits of demand for credit that is the causal factor of the boom-bust cycle.\nThose are my actual views on the subject. That is the absolute truth. Post them on Wikipedia and they’ll be suppressed within 24 hours even though most of my other “views” are directly taken from the “reliable source” that is my own writing.\nUPDATE: Speaking of the so-called feud, I thought this Twitter exchange between one ClarkHat and John Scalzi was illuminating. McRapey clearly doesn’t grasp (or more likely, being a gamma male, is unable to publicly admit), that he is a successful, but mediocre SF writer, not even when his book was picked up for a television series by the distinguished network famous for\nSharknado\nand\nWerewolves vs Strippers\n:\nCLARKHAT: Would you care to actually respond to my comments that 1) your writing is mediocre 2) your rewards >> your merit\nJOHN SCALZI:\nSure: 1. You’re wrong, 2. You’re wrong but even if you were right so what? Hope that helps.\nCH: suggests a theory I hadn’t considered: you really DON’T understand the delta between your work & great work\nJS:\nYour problem is you have really no understanding of my psychology. Which is fine, but doesn’t make you less wrong. I don’t mind you being wrong, however, as it has no effect on what I do or how I do it. Go on being wrong!\nYou and I have no disagreement in you sharing your thoughts on what is great writing. Do! I think that’s a fine thing.\nCH: But this is again Blue Model reframing: “your thoughts”. My pt is not about “my truth”; it is about objective artistic truth. I am not saying “**I** prefer Mieville over @scalzi”; I am saying “objective standards exist; try some Mieville”.\nJS:\n“Objective artistic truth.” Ooooh, I have the giggles now. DO GO ON.\nCH: “You think Davinci’s David is better than my paper mache puppet of Donald Trump? That’s just, like, your opinion, man.\nJS:\nThis objective art hypothesis of yours is ADORABLE. And explains many things, i.e., “What I like is OBJECTIVELY great, so there.”\nThat’s the amusing thing about McRapey. For all his vaunted rhetorical skills granted by virtue of BACHELOR’S DEGREE IN PHILOSOPHY OF LANGUAGE, he doesn’t grasp that he can’t assert that ClarkHat is wrong about him being a mediocre writer while simultaneously denying the concept of objective standards in art.\nIf all art is subjective, then Scalzi is a mediocre writer by virtue of ClarkHat subjectively declaring him to be so. And if all art is objective, then he is a mediocre writer by virtue of the comparison of his work with that of other, better writers. There is no way that Scalzi can correctly declare ClarkHat to be wrong, as he nevertheless repeatedly does.",
  "tags": [
    "media",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-07T08:34:00+00:00"
}