{
  "url": "https://voxday.net/2014/08/30/homeschool-surpasses-private-schoo/",
  "scraped_at": "2025-12-16T12:26:04.867561",
  "title": "Homeschool surpasses private school",
  "date_display": "August 30, 2014",
  "date_iso": "2014-08-30T16:12:00+00:00",
  "date_from_url": "2014-08-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In <a href=\"http://eagnews.org/homeschooling-surges-in-north-carolina-as-public-schools-founder/\">North Carolina</a>:</p><blockquote class=\"tr_bq\"><p> North Carolina officials say there has been a huge increase over the past two years in the number of Tar Heel families who have pulled their kids out of public schools and begun educating them at home. The number of homeschools has jumped 27 percent since the 2011-12 school year, NewsObserver.com reports.</p><p>As of last year, 98,172 North Carolinian children were homeschooled; that’s 2,400 students more than the number who attended a private school.</p><p>While the sputtering economy is the reason families are choosing<br> homeschooling over private schooling, the nationalized learning<br> experiment (Common Core) is the main reason families are leaving the<br> public schools in the first place. “Common Core is a big factor that I hear people talk about,” Beth<br> Herbert, founder of Lighthouse Christian Homeschool Association, told<br> NewsObserver.com. “They’re not happy with the work their kids are coming<br> home with. They’ve decided to take their children home.”</br></br></br></br></br></br></p></blockquote><p>One number they omit to mention is 1,443,998. That’s the number of public schooled children in North Carolina. Which means that more than six percent of school-age children there are being homeschooled, considerably up from the national average of two percent a few years ago.</p><p>Sometimes it’s nice to be able to report a positive trend for a change. And it sounds as if the numbers of homeschoolers will continue to grow.</p></div>",
  "content_text": "In\nNorth Carolina\n:\nNorth Carolina officials say there has been a huge increase over the past two years in the number of Tar Heel families who have pulled their kids out of public schools and begun educating them at home. The number of homeschools has jumped 27 percent since the 2011-12 school year, NewsObserver.com reports.\nAs of last year, 98,172 North Carolinian children were homeschooled; that’s 2,400 students more than the number who attended a private school.\nWhile the sputtering economy is the reason families are choosing\nhomeschooling over private schooling, the nationalized learning\nexperiment (Common Core) is the main reason families are leaving the\npublic schools in the first place. “Common Core is a big factor that I hear people talk about,” Beth\nHerbert, founder of Lighthouse Christian Homeschool Association, told\nNewsObserver.com. “They’re not happy with the work their kids are coming\nhome with. They’ve decided to take their children home.”\nOne number they omit to mention is 1,443,998. That’s the number of public schooled children in North Carolina. Which means that more than six percent of school-age children there are being homeschooled, considerably up from the national average of two percent a few years ago.\nSometimes it’s nice to be able to report a positive trend for a change. And it sounds as if the numbers of homeschoolers will continue to grow.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-30T15:12:00+00:00"
}