{
  "url": "https://voxday.net/2014/08/17/hugo-awards-2014/",
  "scraped_at": "2025-12-16T12:24:37.141706",
  "title": "Hugo Awards 2014",
  "date_display": "August 17, 2014",
  "date_iso": "2014-08-17T17:30:00+00:00",
  "date_from_url": "2014-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is an open thread to discuss the Hugo Awards being given out this today at 2 PM EST. Go ahead and give your predictions and post the winners as they come in. I don’t know if I’ll be around or not.</p><p>UPDATE: Patrick Nielsen Hayden, Tor editor, self-admitted racist, and confirmed anuraphile, is nothing but pure class:</p><p><i>P Nielsen Hayden ‏@pnh 27m</i><br> <i>Good luck to most of the Hugo nominees tonight! Except for one particular would-be fascist, to whom bad cess and embarrassing skin diseases. </i></br></p><p>UPDATE 2: Ginjer Buchanan won the Editor Long Form award. If Toni Weisskopf didn’t win that, it’s safe to conclude things will go according to the usual form.</p><p>UPDATE 3: A true travesty! Dinopornia is denied the double! We’re expected to believe that gay Asian angst is the best that science fiction has to offer in short form these days. And they wonder why subscriptions have declined precipitously.</p><p>UPDATE 4: Lady Astronaut wins Best Novelette. Why is “Lady Editor” deemed unforgivable sexism, but “Lady Astronaut” deemed perfectly fine? Trying to be brave here and remind myself it’s really an honor just to be nominated….</p><p>UPDATE 5: The pinkshirts are celebrating. James Worrad tweets: <i>“Said it yourself, bitch: we’re the guardians of the galaxy.” #DiversityInSF #hugoawards” </i>What galaxy is that, the gay angsty one?</p><p>UPDATE 6: Yergh. Stross wins for <i>Equoid</i>. That’s genuinely nasty. These are some seriously disturbed people here. Of course, they’re the same people who gave a lifetime achievement award to Marion Zimmer Bradley.</p><p>UPDATE 7: Wow, <i>Ancillary Justice</i> beat out Wheel of Time. Well, at least it’s not as embarrassing as <i>Redshirts</i>, although I have no doubt in future years people will wonder how it managed to win so many awards. It should be interesting to see how the voting went. I’ll post the numbers here in a bit.</p><p>RESULTS: It’s official. I am more hated than Larry. Take that, International Lord of Hate. 6th in a five-man race! That’s totally going in the bio.</p><p><i>WARBOUND</i> 1161<br> NO AWARD  1052</br></p><p>NO AWARD 1232<br> <i>OPERA VITA AETERNA</i> 855</br></p><p>“The Chaplain’s Legacy” actually came in third in the initial vote, but the peculiarities of the Hugo vote dropped it back to fourth. And “The Exchange Officers” finished fourth. Toni Weisskopf actually had the most first-place votes initially, 384 to 359, but again, the voting system dropped her back and she came in second, 678-474.</p><p>Good show, everyone. I can honestly say that I have never had so much fun losing an award.</p></div>",
  "content_text": "This is an open thread to discuss the Hugo Awards being given out this today at 2 PM EST. Go ahead and give your predictions and post the winners as they come in. I don’t know if I’ll be around or not.\nUPDATE: Patrick Nielsen Hayden, Tor editor, self-admitted racist, and confirmed anuraphile, is nothing but pure class:\nP Nielsen Hayden ‏@pnh 27m\nGood luck to most of the Hugo nominees tonight! Except for one particular would-be fascist, to whom bad cess and embarrassing skin diseases.\nUPDATE 2: Ginjer Buchanan won the Editor Long Form award. If Toni Weisskopf didn’t win that, it’s safe to conclude things will go according to the usual form.\nUPDATE 3: A true travesty! Dinopornia is denied the double! We’re expected to believe that gay Asian angst is the best that science fiction has to offer in short form these days. And they wonder why subscriptions have declined precipitously.\nUPDATE 4: Lady Astronaut wins Best Novelette. Why is “Lady Editor” deemed unforgivable sexism, but “Lady Astronaut” deemed perfectly fine? Trying to be brave here and remind myself it’s really an honor just to be nominated….\nUPDATE 5: The pinkshirts are celebrating. James Worrad tweets:\n“Said it yourself, bitch: we’re the guardians of the galaxy.” #DiversityInSF #hugoawards”\nWhat galaxy is that, the gay angsty one?\nUPDATE 6: Yergh. Stross wins for\nEquoid\n. That’s genuinely nasty. These are some seriously disturbed people here. Of course, they’re the same people who gave a lifetime achievement award to Marion Zimmer Bradley.\nUPDATE 7: Wow,\nAncillary Justice\nbeat out Wheel of Time. Well, at least it’s not as embarrassing as\nRedshirts\n, although I have no doubt in future years people will wonder how it managed to win so many awards. It should be interesting to see how the voting went. I’ll post the numbers here in a bit.\nRESULTS: It’s official. I am more hated than Larry. Take that, International Lord of Hate. 6th in a five-man race! That’s totally going in the bio.\nWARBOUND\n1161\nNO AWARD  1052\nNO AWARD 1232\nOPERA VITA AETERNA\n855\n“The Chaplain’s Legacy” actually came in third in the initial vote, but the peculiarities of the Hugo vote dropped it back to fourth. And “The Exchange Officers” finished fourth. Toni Weisskopf actually had the most first-place votes initially, 384 to 359, but again, the voting system dropped her back and she came in second, 678-474.\nGood show, everyone. I can honestly say that I have never had so much fun losing an award.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2014-08-17T16:30:00+00:00"
}