{
  "url": "https://voxday.net/2014/08/28/immigration-is-rape-culture-3/",
  "scraped_at": "2025-12-16T12:25:52.098624",
  "title": "Immigration is rape culture",
  "date_display": "August 28, 2014",
  "date_iso": "2014-08-28T16:00:00+00:00",
  "date_from_url": "2014-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The silence of feminists <a href=\"http://www.breitbart.com/Breitbart-London/2014/08/27/Muslim-gang-rapists-are-springing-up-everywhere-Why-can-t-we-be-honest-about-it\">on the explosive issue of immigration and rape</a> is one more indication of their total incoherence and one more reason why their opinions should be resolutely rejected. Everywhere, from Australia to Norway, Muslim immigrants are gang-raping white girls en masse… so naturally the feminists are yammering on about the problem of college girls getting drunk and having consensual sex with young white men.</p><blockquote class=\"tr_bq\"><p> It is difficult to overstate how awful these crimes were, nor how completely victims were failed by the authorities. One girl was doused in petrol and told she would be set on fire if she didn’t comply. Others were forced to watch rapes and told they would be next if they spoke out. The police regarded these girls with as much contempt as the rapists.</p><p>And in perhaps the most horrific paragraph in a report published yesterday, we learned that in two cases fathers had tracked down their daughters and tried to rescue them from houses in which they were being held, only to find themselves arrested by police, while the rapists walked free.</p><p>How many council staff do you suppose are under investigation, or have been sacked? Yup, you guessed it: none. Rotherham council’s chief executive, Martin Kimber, has not only stayed in his post but he has said he doesn’t have evidence enough to prosecute or discipline a single member of the council’s staff….</p><p>The political Left shrieks blue murder over the slightest indication of<br> overbearing male behaviour when it’s a white man. The tone-deaf<br> “Everyday Sexism” project is a weapon wielded almost exclusively at<br> white middle-class men by white middle-class women. But it makes excuses<br> for rapists and even child abusers when the criminals are black, or,<br> especially, from a Muslim community.</br></br></br></br></br></p></blockquote><p>It is now abundantly clear that whether you are in the USA or the UK, the law won’t defend you. You will have to defend yourself and your own, and, quite possibly, against the best efforts of the law. Which isn’t actually the problem it appears to be. The law is outnumbered. And they bloody well know it.</p><p>Immigration is rape culture. That’s a devastating meme. Use it. Hammer it home every time you hear a feminist bring up “rape culture”. If they support mass immigration, they are advocating gang rape. Immigration is rape culture.</p><p>Related: <a href=\"http://pjmedia.com/instapundit/194073/\">a prediction</a> from Glenn Reynolds:</p><blockquote class=\"tr_bq\"><p> Prediction: There’ll be more citizenship-stripping in the future, as European countries come to regret their openness to immigrants who have no interest in assimilating.</p></blockquote><p>Preferably sooner rather than later. Mass immigration isn’t only rape culture, it is also culture rape.</p></div>",
  "content_text": "The silence of feminists\non the explosive issue of immigration and rape\nis one more indication of their total incoherence and one more reason why their opinions should be resolutely rejected. Everywhere, from Australia to Norway, Muslim immigrants are gang-raping white girls en masse… so naturally the feminists are yammering on about the problem of college girls getting drunk and having consensual sex with young white men.\nIt is difficult to overstate how awful these crimes were, nor how completely victims were failed by the authorities. One girl was doused in petrol and told she would be set on fire if she didn’t comply. Others were forced to watch rapes and told they would be next if they spoke out. The police regarded these girls with as much contempt as the rapists.\nAnd in perhaps the most horrific paragraph in a report published yesterday, we learned that in two cases fathers had tracked down their daughters and tried to rescue them from houses in which they were being held, only to find themselves arrested by police, while the rapists walked free.\nHow many council staff do you suppose are under investigation, or have been sacked? Yup, you guessed it: none. Rotherham council’s chief executive, Martin Kimber, has not only stayed in his post but he has said he doesn’t have evidence enough to prosecute or discipline a single member of the council’s staff….\nThe political Left shrieks blue murder over the slightest indication of\noverbearing male behaviour when it’s a white man. The tone-deaf\n“Everyday Sexism” project is a weapon wielded almost exclusively at\nwhite middle-class men by white middle-class women. But it makes excuses\nfor rapists and even child abusers when the criminals are black, or,\nespecially, from a Muslim community.\nIt is now abundantly clear that whether you are in the USA or the UK, the law won’t defend you. You will have to defend yourself and your own, and, quite possibly, against the best efforts of the law. Which isn’t actually the problem it appears to be. The law is outnumbered. And they bloody well know it.\nImmigration is rape culture. That’s a devastating meme. Use it. Hammer it home every time you hear a feminist bring up “rape culture”. If they support mass immigration, they are advocating gang rape. Immigration is rape culture.\nRelated:\na prediction\nfrom Glenn Reynolds:\nPrediction: There’ll be more citizenship-stripping in the future, as European countries come to regret their openness to immigrants who have no interest in assimilating.\nPreferably sooner rather than later. Mass immigration isn’t only rape culture, it is also culture rape.",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-28T15:00:00+00:00"
}