{
  "url": "https://voxday.net/2014/08/17/john-scalzi-is-one-strange-little-man/",
  "scraped_at": "2025-12-16T12:24:38.987055",
  "title": "John Scalzi is one strange little man",
  "date_display": "August 17, 2014",
  "date_iso": "2014-08-17T23:07:00+00:00",
  "date_from_url": "2014-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This was the reaction of last year’s Best Novel winner to the fact that someone he totally ignores and doesn’t care about <i>at all</i> didn’t happen to win a Hugo Award for a novelette.</p><blockquote class=\"tr_bq\"><p> John Scalzi @scalzi <br> I’m not going to lie. I’m going to be<br> THRILLED to snarkread the whiny “I didn’t want it anyway” nonsense that<br> will squirt forth tomorrow.</br></br></br></p><p>John Scalzi @scalzi<br> WE ARE GOING TO MAKE THE HUGO SLATE A REFERENDUM ON THE FUTURE OF SCIENCE FICTION (loses) THE HUGOS DON’T MATTER ANYWAY</br></p><p>John Scalzi @scalzi  <br> SHUT UP I AM NOT CRYING IT’S THAT LITTLE FLECKS OF GUNPOWDER FELL INTO MY EYEBALLS SOMEONE GET ME A FLAMING SWORD SO I CAN FLICK THEM OUT</br></p><p>John Scalzi @scalzi  <br> WHO IS CALLING ME PASSIVE AGGRESSIVE I AM ALL AGGRESSIVE DON’T YOU SEE THIS HUGE GUN I HAVE WITH ME AT ALL TIMES (breaks down, sobbing)</br></p><p>John Scalzi @scalzi<br> AND NOW I WILL IGNORE THE HUGOS AGAIN UNTIL NEXT YEAR WHEN MY FEELINGS OF PASSIVE AGGRESSIVE INADEQUACY ANGRILY WELL UP ONCE MORE</br></p><p>John Scalzi @scalzi<br> I’VE LEARNED MY LESSON AND MY LESSON IS THAT WE DIDN’T HAVE ENOUGH PATENT RACIST SHITBAGGERY ON OUR SLATE WHAT THAT WAS GOOD WRITING MAN</br></p><p>John Scalzi @scalzi<br> ITS PROOF THAT ALL THE FEMINISTS NEED TO DO TO WIN AWARDS IS WRITE BETTER STORIES ACCORDING TO THE JUDGEMENT OF THE FANS SHEEESH</br></p><p>John Scalzi @scalzi<br> I NEVER WANTED THE AWARD THAT’S WHY I’VE WHINED LIKE A KICKED DOG ABOUT IT FOR A COUPLE YEARS RUNNING.</br></p></blockquote><p>And then, for some unknown reason, he posted a picture of an orc. I’m not exactly sure what that had to do with anything, but there you go. Anyhow, here’s the interesting thing about the nominations for the 2014 awards. The nominating votes for the supposed “bloc voters”:</p><p>Larry Correia 184<br> Toni Weisskopf 169 <br> Brad Torgersen: 111 <br> Dan Wells 106<br> Brad Torgersen 92<br> Vox Day 69<br> Sarah Hoyt 38</br></br></br></br></br></br></p><p>Clearly we operate in perfect unthinking lockstep. Here are the nominating votes for those who vocally opposed the “bloc voters”</p><p>Charles Stross: 120<br> Charles Stross: 127<br> Mary Kowal: 118</br></br></p><p>Pure coincidence or psychological projection?</p><p>UPDATE: And McRapey keeps digging deeper:</p><blockquote class=\"tr_bq\"><p> You’ve seen me snark about it, I’m sure, but now that the voting is over, what did I really think of the “sad puppy” slate of nominees championed by Larry Correia and others? What I thought at the beginning, which was: The folks pushing the slate played within the rules, so game on, and the game is to convince people that the work deserves the Hugo. It does not appear the voters were convinced. As a multiple Hugo loser myself, I can say: That’s the breaks, and better luck another year.</p><p>With that said, Correia was foolish to put his own personal capital as a successful and best selling novelist into championing Vox Day and his novelette, because Vox Day is a real bigoted shithole of a human being, and his novelette was, to put it charitably, not good (less charitably: It was like Gene Wolfe strained through a thick and rancid cheesecloth of stupid). Doing that changed the argument from something perfectly legitimate, if debatable — that conservative writers are often ignored for or discounted on award ballots because their personal politics generally conflict with those of the award voters — into a different argument entirely, i.e., fuck you, we got an undeserving bigot shithole on the Hugo ballot, how you like them apples.</p><p>Which is a shame. It’s fine for Correia to beclown himself with Day, if such is his joy, and he deserves to reap the fruits of such an association. I suspect, however, there are others whom he championed for his “sad puppy” slate who were less thrilled to find themselves looped in with Day by involuntary association. Likewise, Correia is a good writer and his works are fun to read and easy to enjoy; others he championed are likewise fine writers, and their works deserving of award consideration. He didn’t do his work, or the work of these other writers, any favors by muddling his message with Day’s nonsense.</p><p>Now, I understand Correia will be happy to tell you that his Hugo loss doesn’t matter to him, which is fine. I do wonder if he considered how other people that were seen as part of his slate feel the same way, or whether he’d do them or their careers any damage by associating them with a bigoted shithole, or that if he really wanted to make the argument that a particular set of writers are ignored by award voters, that he went about making the argument in just about the worst way possible. Bad strategy, bad tactics, bad result.</p></blockquote><p>I find it amusing that Scalzi keeps acting as if it is junior high, and if only he can separate Larry from me, then HE can become BFFs with Larry. The Left simply never understands the Right. I like and respect Larry. We get along fine. But we don’t agree on everything and we don’t spend even five seconds each day thinking about the other guy. Scalzi is welcome to his opinion of my writing, Lord knows I don’t think much of his either. But it doesn’t even cross Scalzi’s mind that since Larry is a religious man who has real friends on the basis of friendship rather than their utility for him, Larry might have read the story very differently than he did.</p><p>Moreover, keep in mind that this is the same Scalzi who not two weeks ago was openly mocking someone on Twitter for declaring that works of literature can be judged by objective standards. He’s not so much inconsistent as incoherent.</p></div>",
  "content_text": "This was the reaction of last year’s Best Novel winner to the fact that someone he totally ignores and doesn’t care about\nat all\ndidn’t happen to win a Hugo Award for a novelette.\nJohn Scalzi @scalzi\nI’m not going to lie. I’m going to be\nTHRILLED to snarkread the whiny “I didn’t want it anyway” nonsense that\nwill squirt forth tomorrow.\nJohn Scalzi @scalzi\nWE ARE GOING TO MAKE THE HUGO SLATE A REFERENDUM ON THE FUTURE OF SCIENCE FICTION (loses) THE HUGOS DON’T MATTER ANYWAY\nJohn Scalzi @scalzi\nSHUT UP I AM NOT CRYING IT’S THAT LITTLE FLECKS OF GUNPOWDER FELL INTO MY EYEBALLS SOMEONE GET ME A FLAMING SWORD SO I CAN FLICK THEM OUT\nJohn Scalzi @scalzi\nWHO IS CALLING ME PASSIVE AGGRESSIVE I AM ALL AGGRESSIVE DON’T YOU SEE THIS HUGE GUN I HAVE WITH ME AT ALL TIMES (breaks down, sobbing)\nJohn Scalzi @scalzi\nAND NOW I WILL IGNORE THE HUGOS AGAIN UNTIL NEXT YEAR WHEN MY FEELINGS OF PASSIVE AGGRESSIVE INADEQUACY ANGRILY WELL UP ONCE MORE\nJohn Scalzi @scalzi\nI’VE LEARNED MY LESSON AND MY LESSON IS THAT WE DIDN’T HAVE ENOUGH PATENT RACIST SHITBAGGERY ON OUR SLATE WHAT THAT WAS GOOD WRITING MAN\nJohn Scalzi @scalzi\nITS PROOF THAT ALL THE FEMINISTS NEED TO DO TO WIN AWARDS IS WRITE BETTER STORIES ACCORDING TO THE JUDGEMENT OF THE FANS SHEEESH\nJohn Scalzi @scalzi\nI NEVER WANTED THE AWARD THAT’S WHY I’VE WHINED LIKE A KICKED DOG ABOUT IT FOR A COUPLE YEARS RUNNING.\nAnd then, for some unknown reason, he posted a picture of an orc. I’m not exactly sure what that had to do with anything, but there you go. Anyhow, here’s the interesting thing about the nominations for the 2014 awards. The nominating votes for the supposed “bloc voters”:\nLarry Correia 184\nToni Weisskopf 169\nBrad Torgersen: 111\nDan Wells 106\nBrad Torgersen 92\nVox Day 69\nSarah Hoyt 38\nClearly we operate in perfect unthinking lockstep. Here are the nominating votes for those who vocally opposed the “bloc voters”\nCharles Stross: 120\nCharles Stross: 127\nMary Kowal: 118\nPure coincidence or psychological projection?\nUPDATE: And McRapey keeps digging deeper:\nYou’ve seen me snark about it, I’m sure, but now that the voting is over, what did I really think of the “sad puppy” slate of nominees championed by Larry Correia and others? What I thought at the beginning, which was: The folks pushing the slate played within the rules, so game on, and the game is to convince people that the work deserves the Hugo. It does not appear the voters were convinced. As a multiple Hugo loser myself, I can say: That’s the breaks, and better luck another year.\nWith that said, Correia was foolish to put his own personal capital as a successful and best selling novelist into championing Vox Day and his novelette, because Vox Day is a real bigoted shithole of a human being, and his novelette was, to put it charitably, not good (less charitably: It was like Gene Wolfe strained through a thick and rancid cheesecloth of stupid). Doing that changed the argument from something perfectly legitimate, if debatable — that conservative writers are often ignored for or discounted on award ballots because their personal politics generally conflict with those of the award voters — into a different argument entirely, i.e., fuck you, we got an undeserving bigot shithole on the Hugo ballot, how you like them apples.\nWhich is a shame. It’s fine for Correia to beclown himself with Day, if such is his joy, and he deserves to reap the fruits of such an association. I suspect, however, there are others whom he championed for his “sad puppy” slate who were less thrilled to find themselves looped in with Day by involuntary association. Likewise, Correia is a good writer and his works are fun to read and easy to enjoy; others he championed are likewise fine writers, and their works deserving of award consideration. He didn’t do his work, or the work of these other writers, any favors by muddling his message with Day’s nonsense.\nNow, I understand Correia will be happy to tell you that his Hugo loss doesn’t matter to him, which is fine. I do wonder if he considered how other people that were seen as part of his slate feel the same way, or whether he’d do them or their careers any damage by associating them with a bigoted shithole, or that if he really wanted to make the argument that a particular set of writers are ignored by award voters, that he went about making the argument in just about the worst way possible. Bad strategy, bad tactics, bad result.\nI find it amusing that Scalzi keeps acting as if it is junior high, and if only he can separate Larry from me, then HE can become BFFs with Larry. The Left simply never understands the Right. I like and respect Larry. We get along fine. But we don’t agree on everything and we don’t spend even five seconds each day thinking about the other guy. Scalzi is welcome to his opinion of my writing, Lord knows I don’t think much of his either. But it doesn’t even cross Scalzi’s mind that since Larry is a religious man who has real friends on the basis of friendship rather than their utility for him, Larry might have read the story very differently than he did.\nMoreover, keep in mind that this is the same Scalzi who not two weeks ago was openly mocking someone on Twitter for declaring that works of literature can be judged by objective standards. He’s not so much inconsistent as incoherent.",
  "tags": [
    "Hugo Award",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-17T22:07:00+00:00"
}