{
  "url": "https://voxday.net/2014/08/18/larrys-summary-of-hugo-2014/",
  "scraped_at": "2025-12-16T12:24:46.276883",
  "title": "Larry’s summary of Hugo 2014",
  "date_display": "August 18, 2014",
  "date_iso": "2014-08-18T22:50:00+00:00",
  "date_from_url": "2014-08-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Larry Correia is manfully attempting <a href=\"http://monsterhunternation.com/2014/08/18/hugo-aftermath-post/\">to deal with his Hugo disappointment</a>:</p><blockquote class=\"tr_bq\"><p> As expected I came in last place for best novel. The surprising part was that I was originally 4th, but then Australian voting rules kicked in, the last place is removed and the votes are recalculated. It is a weird system, and basically what it does is settles on the least disliked candidate as winner. I thought for sure the outraged SJW contingent would make sure I was dead last from the start, but as I’ve seen over the last few weeks from reviewers, many honest reviewers were surprised that it was actually a really good book. </p><p>As for the rest of the Sad Puppies slate, they did about what we expected. The shocking one was Toni Weisskopf was actually 1st for best editor, but after the Australian thing lost. Too bad, because Toni is truly an amazing editor, but I’ve heard that Buchannan is really talented, so good for her. Brad had a pretty solid showing. Most of the others came in last or close. Vox came in 6th out of 5. (we actually had a side bet about which one of us would do worse because he figured he was far more hated than I was, and he won that bet)</p><p>Yeah… I think Scalzi still might be a touch bitter for that time I publically beat him like a rented mule.</p><p>I do enjoy the constantly moving goal posts of the perpetually<br> outraged, like how Sad Puppies somehow turned into a crusade for<br> racism/sexism/homophobia in their heads. I never expected to win the<br> Hugo. My stated goals this entire time was to get some political<br> untouchables onto their sainted slate, so that they would demonstrate<br> that there was serious political bias in the awards.</br></br></br></br></br></p></blockquote><p>To which Mr. Scalzi, spurned in yet another attempt to make nice with the big dog of the Baen Gang, reacted in his inimitable manner:</p><blockquote class=\"tr_bq\"><p> John Scalzi @scalzi<br>Also, I was right: Today IS filled with choice whining about how certain people totally MEANT to fail spectacularly at the Hugos, SO THERE.</br></p><p>John Scalzi @scalzi<br>RATIONALIZE YOUR HUMILIATING DEFEAT SOME MORE PLEASE IT GIVES ME THE TINGLES IN A DEEP AND PRECIOUS PLACE YES YES THAT’S IT</br></p></blockquote><p>And every Game-conversant man thought. “Tingles? Yeah, I suppose that does sound about right.”</p></div>",
  "content_text": "Larry Correia is manfully attempting\nto deal with his Hugo disappointment\n:\nAs expected I came in last place for best novel. The surprising part was that I was originally 4th, but then Australian voting rules kicked in, the last place is removed and the votes are recalculated. It is a weird system, and basically what it does is settles on the least disliked candidate as winner. I thought for sure the outraged SJW contingent would make sure I was dead last from the start, but as I’ve seen over the last few weeks from reviewers, many honest reviewers were surprised that it was actually a really good book.\nAs for the rest of the Sad Puppies slate, they did about what we expected. The shocking one was Toni Weisskopf was actually 1st for best editor, but after the Australian thing lost. Too bad, because Toni is truly an amazing editor, but I’ve heard that Buchannan is really talented, so good for her. Brad had a pretty solid showing. Most of the others came in last or close. Vox came in 6th out of 5. (we actually had a side bet about which one of us would do worse because he figured he was far more hated than I was, and he won that bet)\nYeah… I think Scalzi still might be a touch bitter for that time I publically beat him like a rented mule.\nI do enjoy the constantly moving goal posts of the perpetually\noutraged, like how Sad Puppies somehow turned into a crusade for\nracism/sexism/homophobia in their heads. I never expected to win the\nHugo. My stated goals this entire time was to get some political\nuntouchables onto their sainted slate, so that they would demonstrate\nthat there was serious political bias in the awards.\nTo which Mr. Scalzi, spurned in yet another attempt to make nice with the big dog of the Baen Gang, reacted in his inimitable manner:\nJohn Scalzi @scalzi\nAlso, I was right: Today IS filled with choice whining about how certain people totally MEANT to fail spectacularly at the Hugos, SO THERE.\nJohn Scalzi @scalzi\nRATIONALIZE YOUR HUMILIATING DEFEAT SOME MORE PLEASE IT GIVES ME THE TINGLES IN A DEEP AND PRECIOUS PLACE YES YES THAT’S IT\nAnd every Game-conversant man thought. “Tingles? Yeah, I suppose that does sound about right.”",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-18T21:50:00+00:00"
}