{
  "url": "https://voxday.net/2014/08/03/migrate-them-to-honduras/",
  "scraped_at": "2025-12-16T12:22:56.282187",
  "title": "Migrate them to Honduras",
  "date_display": "August 3, 2014",
  "date_iso": "2014-08-03T08:45:00+00:00",
  "date_from_url": "2014-08-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s a bit ironic that the technocrats are talking about <a href=\"http://www.cnbc.com/id/101884085\">migrating Californians out of California</a> due to the extreme drought conditions, even as tens of thousands of Central American immigrants continue to migrate into California:</p><blockquote class=\"tr_bq\"><p> It’s going from worse to worst each week in California.</p><p>Suffering in its third year of drought, more than 58 percent of the state is currently in “exceptional drought” stage, according to the latest U.S. Drought Monitor map. That marks a huge jump from just seven days ago, when about 36 percent of the state was categorized that way.</p><p>Exceptional drought, the most extreme category, indicates widespread crop and pasture losses and shortages of water in reservoirs, streams and wells.</p><p>If the state continues on this path, there may have to be thoughts about moving people out, said Lynn Wilson, academic chair at Kaplan University and who serves on the climate change delegation in the United Nations.</p><p>“Civilizations in the past have had to migrate out of areas of drought,” Wilson said. “We may have to migrate people out of California.”</p></blockquote><p>Now, I’m no expert on water usage, but it seems to me that before California starts forcibly migrating its residents <i>out</i>, it might want to consider not permitting any more people to migrate <i>in</i>.</p><p>That being said, no sane governor would permit the Californication of his state. Californians have trashed what used to be the Golden State; imagine what they will do wherever they descend next. It seems to me the only just thing to do is migrate them to Honduras. Then migrate all the pro-immigration people on the East Coast to the dessicated remnants of California so they can experience the benefits of the policies they’ve been advocating.</p><p>They’re dumb enough that one can simply tell them: “Drought? Oh, don’t worry about that. You’ve got plenty of water. Look, you’re right on the ocean!”</p></div>",
  "content_text": "It’s a bit ironic that the technocrats are talking about\nmigrating Californians out of California\ndue to the extreme drought conditions, even as tens of thousands of Central American immigrants continue to migrate into California:\nIt’s going from worse to worst each week in California.\nSuffering in its third year of drought, more than 58 percent of the state is currently in “exceptional drought” stage, according to the latest U.S. Drought Monitor map. That marks a huge jump from just seven days ago, when about 36 percent of the state was categorized that way.\nExceptional drought, the most extreme category, indicates widespread crop and pasture losses and shortages of water in reservoirs, streams and wells.\nIf the state continues on this path, there may have to be thoughts about moving people out, said Lynn Wilson, academic chair at Kaplan University and who serves on the climate change delegation in the United Nations.\n“Civilizations in the past have had to migrate out of areas of drought,” Wilson said. “We may have to migrate people out of California.”\nNow, I’m no expert on water usage, but it seems to me that before California starts forcibly migrating its residents\nout\n, it might want to consider not permitting any more people to migrate\nin\n.\nThat being said, no sane governor would permit the Californication of his state. Californians have trashed what used to be the Golden State; imagine what they will do wherever they descend next. It seems to me the only just thing to do is migrate them to Honduras. Then migrate all the pro-immigration people on the East Coast to the dessicated remnants of California so they can experience the benefits of the policies they’ve been advocating.\nThey’re dumb enough that one can simply tell them: “Drought? Oh, don’t worry about that. You’ve got plenty of water. Look, you’re right on the ocean!”",
  "tags": [
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-03T07:45:00+00:00"
}