{
  "url": "https://voxday.net/2014/08/05/monsterboobz/",
  "scraped_at": "2025-12-16T12:23:14.972937",
  "title": "Monsterboobz",
  "date_display": "August 5, 2014",
  "date_iso": "2014-08-05T17:20:00+00:00",
  "date_from_url": "2014-08-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David Futrelle is apparently <a href=\"http://theantifeminist.com/monsterboobz-david-futrelle-disturbing-defence-film-sexual-abuse-torture-children/\">a connoisseur of movies</a> about violent homosexual pedophilia. One commenter notes:</p><blockquote class=\"tr_bq\"><p> David Futrelle has claimed that a photo of a 17 y.o. girl in a bikini or a tight pair of jeans is ‘child porn’. But a film containing nothing but graphic scenes of naked children as young as 14 being raped, mutilated, forced to eat faeces, tortured, and murdered, isn’t. Sums up what a disturbing psychopathic freak he is.</p></blockquote><p>But let’s be fair and let the great defender of women’s suffrage speak for himself:</p><blockquote class=\"tr_bq\"><p> The movie in question is considered a classic. It’s not porn or torture porn. It’s on Netflix. I wrote about a censorship controversy involving it. I didn’t offer an assessment of the film itself.</p></blockquote><p>Considered a classic? By whom, Hannibal Lector? This is how the movie he claims is “considered a classic” is described: <i>“This grotesque sexploitation movie is officially banned in 15 different<br> countries, although, as stated above, it should undoubtedly be<br> automatically classed as the worst form of child pornography. Its<br> defenders claim that it makes an artistic statement about the<br> ‘corruption of power over innocence and youth’. The abusers in the film<br> are portrayed as Italian wartime fascists who kidnap eight teenage boys<br> and girls and subject them to 120 days of grotesque sexual torture and<br> humiliation before murdering them.”</br></br></br></br></br></br></br></i></p><p>Sounds like a real classic. It also sounds like Futrelle would fit right in with the SFWA.</p></div>",
  "content_text": "David Futrelle is apparently\na connoisseur of movies\nabout violent homosexual pedophilia. One commenter notes:\nDavid Futrelle has claimed that a photo of a 17 y.o. girl in a bikini or a tight pair of jeans is ‘child porn’. But a film containing nothing but graphic scenes of naked children as young as 14 being raped, mutilated, forced to eat faeces, tortured, and murdered, isn’t. Sums up what a disturbing psychopathic freak he is.\nBut let’s be fair and let the great defender of women’s suffrage speak for himself:\nThe movie in question is considered a classic. It’s not porn or torture porn. It’s on Netflix. I wrote about a censorship controversy involving it. I didn’t offer an assessment of the film itself.\nConsidered a classic? By whom, Hannibal Lector? This is how the movie he claims is “considered a classic” is described:\n“This grotesque sexploitation movie is officially banned in 15 different\ncountries, although, as stated above, it should undoubtedly be\nautomatically classed as the worst form of child pornography. Its\ndefenders claim that it makes an artistic statement about the\n‘corruption of power over innocence and youth’. The abusers in the film\nare portrayed as Italian wartime fascists who kidnap eight teenage boys\nand girls and subject them to 120 days of grotesque sexual torture and\nhumiliation before murdering them.”\nSounds like a real classic. It also sounds like Futrelle would fit right in with the SFWA.",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-05T16:20:00+00:00"
}