{
  "url": "https://voxday.net/2014/08/02/objectives-are-key-to-war/",
  "scraped_at": "2025-12-16T12:22:51.104522",
  "title": "Objectives are the key to war",
  "date_display": "August 2, 2014",
  "date_iso": "2014-08-02T09:50:00+00:00",
  "date_from_url": "2014-08-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And when one looks at its objectives, it is apparent that Israel is <a href=\"http://www.nytimes.com/2014/08/02/world/middleeast/an-old-playbook-leaves-israel-unready-for-hamass-tunnel-war-.html\">losing the Gaza Tunnel War</a>, both in 4GW and tactical terms:</p><blockquote class=\"tr_bq\"><p> As frustration grows in Israel over the military’s limited success so far in trying to neutralize Hamas, the militant Islamic group that governs Gaza, some military experts say it is increasingly evident that the Israel Defense Forces have been operating from an old playbook and are not fully prepared for a more sophisticated, battle-ready adversary. The issue is not specifically the tunnels — which Israel knew about — but the way Hamas fighters trained to use them to create what experts in Israel are calling a “360-degree front.”</p><p>“Hamas has changed its doctrine and is using the tunnels as a main<br> method of operation,” said Israel Ziv, a retired general who headed the<br> military’s Gaza division and its operations directorate. “This is<br> something we learned amid the fighting.”</br></br></br></p><p>In the Gaza war that began in late 2008, 10 Israeli soldiers were<br> killed, four of them from friendly fire. This time, 63 soldiers have<br> been killed, mostly in combat, and one is now a prisoner. “The military has been playing it by ear,” said Amos Harel, a military affairs analyst for the newspaper Haaretz, who added that despite the Israeli military’s knowledge of the tunnels, its planners did not draft a new doctrine for prosecuting a land invasion. “But it is pretty good at doing that, and has done it many times.”</br></br></p><p>In this latest asymmetrical war with Hamas, the third in five years, Israel thought it was prepared. It had built up an integrated communications systems able to transfer intelligence in real time to air and ground forces, an advancement that military officials called a “force multiplier.”</p><p>Precision-guided missiles have destroyed up to a third of Hamas’s rocket stocks, according to Israeli officials, as well as hundreds of houses or apartments that the military described as militant command-and-control centers and many other weapons production sites and stores. In 24 days of intense bombing, 4,300 targets have been hit….</p><p>What Israel was apparently less ready for was Hamas fighters who are<br> willing to engage and are trained to use tunnels, a tool of war whose<br> roots go back to antiquity. During Israel’s last ground incursion in the<br> winter of 2008-9, Hamas fighters largely avoided clashes, melting into<br> the crowded urban landscape. This time, they were prepared for combat.</br></br></br></br></p></blockquote><p>War is not sport. Body counts are not a relevant means of keeping score; the fact that the IDF has killed more Hamas fighters than Hamas has killed IDF soldiers is entirely expected. That is one reason why the war is referred to as “asymmetric”. As always, air power is overrated, as the fact that 24 days of intense bombing hasn’t prevented Hamas from killing more than six times as many ground troops as in 2008. It seems the lessons of Tarawa and Iwo Jima still have not been learned by the descendants of Giulio Douhet and Billy Mitchell.</p><p>War is about using military force to achieve one’s objectives. Israel’s objectives are:</p><ul><li>End the rocket attacks</li><li>Demilitarize Gaza</li><li>Deterrence</li><li>Eliminate Hamas’s senior military command and political leadership</li><li>Prevent Hamas from being able to rearm</li></ul><p>Debka <a href=\"http://debka.com/article/24141/Nine-out-of-10-Israel%E2%80%99s-war-dead-Monday-died-on-Israeli-soil-%E2%80%93-a-microcosm-of-the-IDF-operation\">notes</a>: <i>“That nine of the 10 Israeli servicemen who died in the counter-terror<br> operation against Hamas Monday, July 28, were killed on Israeli soil was<br> a wake-up call for Israel’s war leaders. It meant that Hamas had used<br> the 22 days of combat to carry the contest from its own home ground into<br> Israel by grabbing the tactical advantage of surprise.”</br></br></br></br></i></p><p>After a month of war and considerable collateral damage among the civilian population of Gaza, it does not appear that Israel will be able to meet any of its objectives in this war. This is why it is so vital for Israel to learn to adopt 4GW tactics in asymmetric conflicts like these, as another 2GW victory and 4GW loss will only encourage Hamas and Israel’s other enemies. In another post, I will address what tactics I think should be adopted in preference to this 2GW pound-and-ground.</p></div>",
  "content_text": "And when one looks at its objectives, it is apparent that Israel is\nlosing the Gaza Tunnel War\n, both in 4GW and tactical terms:\nAs frustration grows in Israel over the military’s limited success so far in trying to neutralize Hamas, the militant Islamic group that governs Gaza, some military experts say it is increasingly evident that the Israel Defense Forces have been operating from an old playbook and are not fully prepared for a more sophisticated, battle-ready adversary. The issue is not specifically the tunnels — which Israel knew about — but the way Hamas fighters trained to use them to create what experts in Israel are calling a “360-degree front.”\n“Hamas has changed its doctrine and is using the tunnels as a main\nmethod of operation,” said Israel Ziv, a retired general who headed the\nmilitary’s Gaza division and its operations directorate. “This is\nsomething we learned amid the fighting.”\nIn the Gaza war that began in late 2008, 10 Israeli soldiers were\nkilled, four of them from friendly fire. This time, 63 soldiers have\nbeen killed, mostly in combat, and one is now a prisoner. “The military has been playing it by ear,” said Amos Harel, a military affairs analyst for the newspaper Haaretz, who added that despite the Israeli military’s knowledge of the tunnels, its planners did not draft a new doctrine for prosecuting a land invasion. “But it is pretty good at doing that, and has done it many times.”\nIn this latest asymmetrical war with Hamas, the third in five years, Israel thought it was prepared. It had built up an integrated communications systems able to transfer intelligence in real time to air and ground forces, an advancement that military officials called a “force multiplier.”\nPrecision-guided missiles have destroyed up to a third of Hamas’s rocket stocks, according to Israeli officials, as well as hundreds of houses or apartments that the military described as militant command-and-control centers and many other weapons production sites and stores. In 24 days of intense bombing, 4,300 targets have been hit….\nWhat Israel was apparently less ready for was Hamas fighters who are\nwilling to engage and are trained to use tunnels, a tool of war whose\nroots go back to antiquity. During Israel’s last ground incursion in the\nwinter of 2008-9, Hamas fighters largely avoided clashes, melting into\nthe crowded urban landscape. This time, they were prepared for combat.\nWar is not sport. Body counts are not a relevant means of keeping score; the fact that the IDF has killed more Hamas fighters than Hamas has killed IDF soldiers is entirely expected. That is one reason why the war is referred to as “asymmetric”. As always, air power is overrated, as the fact that 24 days of intense bombing hasn’t prevented Hamas from killing more than six times as many ground troops as in 2008. It seems the lessons of Tarawa and Iwo Jima still have not been learned by the descendants of Giulio Douhet and Billy Mitchell.\nWar is about using military force to achieve one’s objectives. Israel’s objectives are:\nEnd the rocket attacks\nDemilitarize Gaza\nDeterrence\nEliminate Hamas’s senior military command and political leadership\nPrevent Hamas from being able to rearm\nDebka\nnotes\n:\n“That nine of the 10 Israeli servicemen who died in the counter-terror\noperation against Hamas Monday, July 28, were killed on Israeli soil was\na wake-up call for Israel’s war leaders. It meant that Hamas had used\nthe 22 days of combat to carry the contest from its own home ground into\nIsrael by grabbing the tactical advantage of surprise.”\nAfter a month of war and considerable collateral damage among the civilian population of Gaza, it does not appear that Israel will be able to meet any of its objectives in this war. This is why it is so vital for Israel to learn to adopt 4GW tactics in asymmetric conflicts like these, as another 2GW victory and 4GW loss will only encourage Hamas and Israel’s other enemies. In another post, I will address what tactics I think should be adopted in preference to this 2GW pound-and-ground.",
  "tags": [
    "war",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-02T08:50:00+00:00"
}