{
  "url": "https://voxday.net/2014/08/31/old-age-boomers-suffer-mos/",
  "scraped_at": "2025-12-16T12:26:13.878758",
  "title": "Old Age: Boomers suffer most",
  "date_display": "August 31, 2014",
  "date_iso": "2014-08-31T13:00:00+00:00",
  "date_from_url": "2014-08-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am morally opposed to euthanasia, but sometimes, the bloody Baby Boomers really make it a terribly tempting proposition. Now they have discovered that they are <a href=\"http://www.nytimes.com/2014/08/31/sunday-review/the-boomers-biggest-challenge.html\">the first generation in human history to grow old</a>:</p><blockquote class=\"tr_bq\"><p> Every generation gets old, but for those who were told we’d be forever young, it just seems more painful. “It’s a huge issue,” says Dr. Anna Fels, a psychiatrist in New York. “I see so many who are trying to adjust their lives to this new phase, which for some reason none of us really pictured ourselves going through.”</p><p>Why didn’t we? We knew that eventually more people around us would be younger rather than older. But it still rankles. The image of a room filled with younger people is the perfect symbol.</p><p>“It’s an important marker for this generation because it reminds them that they are now the ones closest to obsolescence, the ones the world can do without,” says Dr. Roger Gould, a psychiatrist and the author of “Transformations,” a book about age-related adult problems.</p></blockquote><p>Yes, the world can certainly do without them. In fact, the world would have been a good deal better off without their generational peculiarities. A fair amount of the blood that will be shed by our children and our grandchildren is going to be on their hands. They never pictured themselves going through what EVERY PREVIOUS HUMAN GENERATION HAD for the obvious reason that they are, collectively speaking, idiots.</p><p>The pathetic thing is that they are STILL trying to be cool. <i>“When I was asked in a sociology class what music I listened to, I<br> hesitantly named Sam Cooke, thinking I would be stared at with stumped<br> pity. In fact, many voices shouted out, “Love Sam Cooke!””</br></br></i></p><p>Sure they did. I’m sure vast quantities of college students in 2014 listen to an now-obscure soul singer who died 50 years ago. Why, it’s amazing, but even the younger generations think you’re the epitome of a hep cat with a bad hip, Granddaddy-O! These narcissistic buffoons can’t even grow old and die with any grace. They’ll be sitting in hospital beds drooling on themselves, hooked up to machines, and if you lean in, put your ear up to their lips, and listen closely, you’ll be able to hear them whisper important words of the life-affirming wisdom they have acquired over the course of their long lives: <i>“Eighty is the new twenty! Hospices are totally happening places these days!”</i></p></div>",
  "content_text": "I am morally opposed to euthanasia, but sometimes, the bloody Baby Boomers really make it a terribly tempting proposition. Now they have discovered that they are\nthe first generation in human history to grow old\n:\nEvery generation gets old, but for those who were told we’d be forever young, it just seems more painful. “It’s a huge issue,” says Dr. Anna Fels, a psychiatrist in New York. “I see so many who are trying to adjust their lives to this new phase, which for some reason none of us really pictured ourselves going through.”\nWhy didn’t we? We knew that eventually more people around us would be younger rather than older. But it still rankles. The image of a room filled with younger people is the perfect symbol.\n“It’s an important marker for this generation because it reminds them that they are now the ones closest to obsolescence, the ones the world can do without,” says Dr. Roger Gould, a psychiatrist and the author of “Transformations,” a book about age-related adult problems.\nYes, the world can certainly do without them. In fact, the world would have been a good deal better off without their generational peculiarities. A fair amount of the blood that will be shed by our children and our grandchildren is going to be on their hands. They never pictured themselves going through what EVERY PREVIOUS HUMAN GENERATION HAD for the obvious reason that they are, collectively speaking, idiots.\nThe pathetic thing is that they are STILL trying to be cool.\n“When I was asked in a sociology class what music I listened to, I\nhesitantly named Sam Cooke, thinking I would be stared at with stumped\npity. In fact, many voices shouted out, “Love Sam Cooke!””\nSure they did. I’m sure vast quantities of college students in 2014 listen to an now-obscure soul singer who died 50 years ago. Why, it’s amazing, but even the younger generations think you’re the epitome of a hep cat with a bad hip, Granddaddy-O! These narcissistic buffoons can’t even grow old and die with any grace. They’ll be sitting in hospital beds drooling on themselves, hooked up to machines, and if you lean in, put your ear up to their lips, and listen closely, you’ll be able to hear them whisper important words of the life-affirming wisdom they have acquired over the course of their long lives:\n“Eighty is the new twenty! Hospices are totally happening places these days!”",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-31T12:00:00+00:00"
}