{
  "url": "https://voxday.net/2014/08/27/on-sweetness-of-ankles/",
  "scraped_at": "2025-12-16T12:25:42.919048",
  "title": "On the sweetness of ankles",
  "date_display": "August 27, 2014",
  "date_iso": "2014-08-27T16:00:00+00:00",
  "date_from_url": "2014-08-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to admit, just when I think the old Fowl Atheist has bottomed out, (the last time he managed to publicly demonstrate his embarrassingly poor grasp on human genetics), he manages to dig himself in deeper. It is vastly amusing that he didn’t even hesitate to plunge right into this one. Remember when he didn’t want to debate me because it would be punching down? Now Richard Dawkins’s former fartsniffer and failed successor is so desperate to be relevant again that <a href=\"http://freethoughtblogs.com/pharyngula/2014/08/26/vox-day-scientist/\">he’s swinging wildly at shadows</a>:</p><blockquote class=\"tr_bq\"><p> Wait, what? I did a search; no, neither Vox Day nor Theodore Beale have published anything in Nature, or any other science journal, and they also haven’t been cited anywhere in the scientific literature. Weird. How can he make this claim?</p><p>As it turns out, his claim is so tenuous and absurd that you have to laugh.</p><p>Here is his ‘hypothesis’, which is his: Religion doesn’t cause wars. He said this in his blog, and he also says it in his self-published ‘I hate atheists’ book, both of which hardly anyone reads, and which aren’t exactly popular with scientists.</p><p>However, he now claims that anyone anywhere who even says something vaguely like that (for instance, Scott Atran, who has argued that religion is not the primary causative agent in terrorism), is “citing” him, even if they don’t mention his name or his source, or explicitly acknowledge other sources. It’s all him. It is entirely his idea. It’s not as if people have been making excuses to exonerate religion from all blame for centuries, it was his idea.</p></blockquote><p>As we have learned to expect from him, PZ can’t even get the simplest facts right.</p><ol><li><i>The Irrational Atheis</i>t is not self-published. It has never been self-published. I’m sure Glen Yeffeth, who is an atheist himself, and all the good people at Ben Bella books will very much appreciate the attempted insult. I say attempted insult because anyone who isn’t locked into the dying publishing model recognizes that independent publishing is not merely the future, it is the now. As for hardly anyone reading it, it’s still selling well enough that when I asked Glenn if I could have the rights back so that Castalia could sell it, he laughed and told me no.</li><li>Scott Atran and others are, in fact, citing me, whether they realize it or not. It is very easy to prove it. They are taking it from <a href=\"http://en.wikipedia.org/wiki/Religious_war\">this Wikipedia page</a>, which took it from a Christian site which took it from TIA. The reason I know this is that the numbers that everyone is citing are not the numbers that appear in the <i>Encylopedia of Wars</i>. As it happens, no such numbers appear in the encyclopedia at all. They are the numbers that I used the encyclopedia to calculate and appeared in <i>The Irrational Atheist</i>.</li><li>It is all me, as it happens. It was an entirely original idea, as evidenced by my 2004 WND column published prior to the publication of the encyclopedia, entitled <a href=\"http://www.wnd.com/2004/11/27440/\">God, George Bush, and War</a>. The metric for disproving the hitherto common atheist claim, a claim that some atheists still make today, is obvious only in retrospect. Nor, as it happens, is it the only way to disprove the mistaken idea that religion causes war, as I came up with another metric that works equally well, but is less numerically quantifiable, which is why it was not cited by Wikipedia, Atran, and others.</li><li>It’s not an excuse. The fact that religion does not cause most war is a historical fact of military history, of which PZ is obviously ignorant.</li><li>You don’t hear much about religion causing war anymore. Not even PZ is dumb enough to try to directly push the canard. You don’t hear much about the Red State argument anymore either. In both cases, TIA is why.</li></ol><p>It’s a bit ironic that PZ is so intent on claiming that I am not a scientist, when he was the original inspiration for my hypothesis, successfully tested in a study by Boston University scientists, that atheists are not neurotypical and that there is a positive correlation between atheism and autism.</p><p>This shabby attempt by PZ to deny historical reality, by the way, is one reason I make a habit of including some very minor information that is original, such as the “k”s in Psykosonik, in most things that I do. Doing so makes it very easy for me to see who is actually getting their information from me and who is not, regardless of what they pretend. I don’t usually bother to point it out, as the important thing is the propagation of the information, not the credit. But I always know.</p><p>Petty little anklebiters like PZ don’t bother me in the slightest. After 13 years of them nibbling at my ankles, I’d probably find the sensation unsettling if they ever stopped.</p></div>",
  "content_text": "I have to admit, just when I think the old Fowl Atheist has bottomed out, (the last time he managed to publicly demonstrate his embarrassingly poor grasp on human genetics), he manages to dig himself in deeper. It is vastly amusing that he didn’t even hesitate to plunge right into this one. Remember when he didn’t want to debate me because it would be punching down? Now Richard Dawkins’s former fartsniffer and failed successor is so desperate to be relevant again that\nhe’s swinging wildly at shadows\n:\nWait, what? I did a search; no, neither Vox Day nor Theodore Beale have published anything in Nature, or any other science journal, and they also haven’t been cited anywhere in the scientific literature. Weird. How can he make this claim?\nAs it turns out, his claim is so tenuous and absurd that you have to laugh.\nHere is his ‘hypothesis’, which is his: Religion doesn’t cause wars. He said this in his blog, and he also says it in his self-published ‘I hate atheists’ book, both of which hardly anyone reads, and which aren’t exactly popular with scientists.\nHowever, he now claims that anyone anywhere who even says something vaguely like that (for instance, Scott Atran, who has argued that religion is not the primary causative agent in terrorism), is “citing” him, even if they don’t mention his name or his source, or explicitly acknowledge other sources. It’s all him. It is entirely his idea. It’s not as if people have been making excuses to exonerate religion from all blame for centuries, it was his idea.\nAs we have learned to expect from him, PZ can’t even get the simplest facts right.\nThe Irrational Atheis\nt is not self-published. It has never been self-published. I’m sure Glen Yeffeth, who is an atheist himself, and all the good people at Ben Bella books will very much appreciate the attempted insult. I say attempted insult because anyone who isn’t locked into the dying publishing model recognizes that independent publishing is not merely the future, it is the now. As for hardly anyone reading it, it’s still selling well enough that when I asked Glenn if I could have the rights back so that Castalia could sell it, he laughed and told me no.\nScott Atran and others are, in fact, citing me, whether they realize it or not. It is very easy to prove it. They are taking it from\nthis Wikipedia page\n, which took it from a Christian site which took it from TIA. The reason I know this is that the numbers that everyone is citing are not the numbers that appear in the\nEncylopedia of Wars\n. As it happens, no such numbers appear in the encyclopedia at all. They are the numbers that I used the encyclopedia to calculate and appeared in\nThe Irrational Atheist\n.\nIt is all me, as it happens. It was an entirely original idea, as evidenced by my 2004 WND column published prior to the publication of the encyclopedia, entitled\nGod, George Bush, and War\n. The metric for disproving the hitherto common atheist claim, a claim that some atheists still make today, is obvious only in retrospect. Nor, as it happens, is it the only way to disprove the mistaken idea that religion causes war, as I came up with another metric that works equally well, but is less numerically quantifiable, which is why it was not cited by Wikipedia, Atran, and others.\nIt’s not an excuse. The fact that religion does not cause most war is a historical fact of military history, of which PZ is obviously ignorant.\nYou don’t hear much about religion causing war anymore. Not even PZ is dumb enough to try to directly push the canard. You don’t hear much about the Red State argument anymore either. In both cases, TIA is why.\nIt’s a bit ironic that PZ is so intent on claiming that I am not a scientist, when he was the original inspiration for my hypothesis, successfully tested in a study by Boston University scientists, that atheists are not neurotypical and that there is a positive correlation between atheism and autism.\nThis shabby attempt by PZ to deny historical reality, by the way, is one reason I make a habit of including some very minor information that is original, such as the “k”s in Psykosonik, in most things that I do. Doing so makes it very easy for me to see who is actually getting their information from me and who is not, regardless of what they pretend. I don’t usually bother to point it out, as the important thing is the propagation of the information, not the credit. But I always know.\nPetty little anklebiters like PZ don’t bother me in the slightest. After 13 years of them nibbling at my ankles, I’d probably find the sensation unsettling if they ever stopped.",
  "tags": [
    "anklebiters",
    "TIA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-27T15:00:00+00:00"
}