{
  "url": "https://voxday.net/2014/08/29/pz-admits-hes-wrong/",
  "scraped_at": "2025-12-16T12:25:55.736546",
  "title": "PZ admits he’s wrong",
  "date_display": "August 29, 2014",
  "date_iso": "2014-08-29T08:29:00+00:00",
  "date_from_url": "2014-08-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And then promptly proceeds <a href=\"http://freethoughtblogs.com/pharyngula/2014/08/27/oh-no-i-was-wrong-about-vox-day/\">to dig the hole deeper</a>. Based on his National Merit status, he’s got to have the raw cognitive capacity to do better, but it’s sometimes hard to believe because he so regularly renders himself functionally stupid. It’s as if he’s got some sort of religious derangement syndrome that handicaps his intellectual faculties.<i> </i></p><p><i>“The other day, I said that his book, The Irrational Atheist, was self-published. I was wrong. He actually bamboozled a publisher into taking it on.”</i></p><p>As one might expect, PZ is characteristically gracious about admitting his error. TIA was originally headed for publication by Crown Forum when a bigger name, David Berlinski, proposed a similar book just as Crown was on the verge of sending me a contract to write it. The editor decided, reasonably enough, that one book on the topic would be sufficient for their needs and chose Berlinski over me. I gave Glenn at BenBella a call to see if he was interested and he snapped it up right away. No bamboozling was required. It seems strange to have to explain this, but most publishers are very happy to receive book proposals on interesting subjects from popular bloggers. I’ve had standing offers from publishers who are pretty much willing to publish whatever non-fiction I want to write for years.</p><p>One of the few remaining Pharyngulans is so desperate to try to DISQUALIFY me that he suggested I paid BenBella Books to have it published. Never mind the obvious fact that I had previously contributed to several BenBella anthologies. Or the 100+ reviews and the fact that after six years, the Kindle ranking for TIA is still respectable at  “#28 in Kindle Store &gt; Kindle eBooks &gt; Religion &amp; Spirituality &gt; Atheism”<i> </i></p><p><i>The Devil’s Delusion</i>, on the other hand is at  #42 in Kindle Store &gt; Kindle eBooks &gt; Religion &amp; Spirituality &gt; Atheism. But it has 237 reviews, so one has to conclude that Jed made a reasonable call in going with Berlinski. I suspect TIA might have done even better than TDD did with the benefit of Crown’s marketing muscle behind it, but I can’t criticize the decision, even in in retrospect. Remember, the call had to be made prior to either book actually being written.</p><p><i>“I said it was ridiculous for him to claim that he was cited in scientific publications, when what he was really doing was claiming that people who didn’t cite him at all were actually citing him. It’s bizarre, but he’s doubling down. He claims that Scott Atran was using his ‘data’ about the number of religious wars, which he had to have gotten from his book. I think we can safely lay this one to rest: Vox Day/Theodore Beale is not the source of any data or hypothesis published by Scott Atran in Nature.”</i></p><p>Who said anything about Scott Atran in <i>Nature</i>? <a href=\"http://freethoughtblogs.com/pharyngula/2014/08/26/vox-day-scientist/\">PZ brought up Atran</a>, not me. Look, I don’t read <i>Nature</i>. I don’t follow Scott Atran. I don’t hunt for references to my historical proof that religion doesn’t cause war. People simply happen to send me news about things they think might be of interest to me on a regular basis. The only reference I ever noticed myself was the recent one in the New York Times. Anyhow, as was brought to my attention two years ago, I was the original<br> source of the data Atran cited in a 2012 article called “God and the<br> Ivory Tower”.</br></br></p><blockquote class=\"tr_bq\"><p> Moreover, the chief complaint against religion — that it is history’s<br> prime instigator of intergroup conflict — does not withstand scrutiny.<br> Religious issues motivate only a small minority of recorded wars. The<br> Encyclopedia of Wars surveyed 1,763 violent conflicts across history;<br> only 123 (7 percent) were religious”<br> – “God and the Ivory Tower”, August 6, 2012</br></br></br></br></br></p></blockquote><p><i>“He claims to have inspired other studies…. Strange. I am not autistic to any noticeable degree, and have never been diagnosed as such. That makes it odd to claim I am the inspiration for a “hypothesis”.”</i></p><p>It’s a little more noticeable than PZ thinks. Self-awareness is not his strong suit. From a 2007 post entitled <a href=\"http://www.milobookclub.com/2007/08/02/socially-autistic-atheis/\">The socially autistic atheist</a>: “Based on Wired Magazine’s observation that atheists tend to be<br> quarrelsome, socially challenged men, to say nothing of the unpleasant<br> personalities of leading public atheists such as Richard Dawkins,<br> Christopher Hitchens and Michel Onfray, one could reasonably hypothesize<br> that there is likely to be a strong correlation between Asperger’s and<br> atheism.  It’s by no means a scientific test, but it is interesting to<br> note the coincidence that 59 of the virulent atheists over at Dr. PZ<br> Myers place <a href=\"http://scienceblogs.com/pharyngula/2007/08/im_mostly_normal.php#comments\">report an average score</a> on the <a href=\"http://www.piepalace.ca/blog/asperger-test-aq-test/\">Asperger’s Quotient test</a> of 27.8.  And this does not include the two individuals who actually have Asperger’s but did not report any test results.”</br></br></br></br></br></br></br></p><p>As PZ himself said: “I took the test and scored a 24, an “average math contest winner.” You need a 32 to suggest Asperger’s, and a 15 is the average. So there. I don’t have Asperger’s, I’m just cruel and insensitive.”</p><p>Hence the term “socially autistic” rather than “autistic”. The adjective modifies the noun. It’s not surprising PZ’s AQ score is higher than the norm on the autism spectrum because he is observably a “quarrelsome, socially challenged” man. I scored 14, by the way. Unlike PZ, I possess empathy, athletic experience, and social skills that help temper my high intelligence. I’m not as literal and pedantic as one might conclude from reading the blog, that is just an artifact of having had scores of people like PZ scouring my every written word looking for something, anything, to attack and use to DISQUALIFY for over a decade.</p><p><i>“Most importantly, there is no citation of Theodore Beale, or Vox Day, or The Irrational Atheist, or ‘that misogynistic asshole on the internet’. You’d think this would be rather obvious: you don’t get to count it as a citation if you aren’t cited.”</i></p><p>I was curious when I saw a report of the study in the news, so I emailed one of the authors and asked her if her team had derived the hypothesis from TIA or from this blog. She emailed me back, confirmed that they had in fact gotten it from TIA, and asked if I would like to be cited. I thanked her and told her it wasn’t necessary because I was merely curious if it was sheer coincidence or not. I’m not a scientist and I’m not at all concerned about petty scientistic credential games. I’m certainly not concerned with their little rules about who get to take credit and how. The facts are what they are. I deal in reality, not scientistry.</p><p><i>“And the final damning straw: the much vaunted paper by Hooker that claims a vaccination/autism link, that was promoted by Vox Day, has been retracted. He’s basically wrong about everything.”</i></p><p>No. I have not been wrong about anything he’s addressed here. I am smarter than PZ Myers and one reason he hates me is that I demonstrate this so easily every single time he pushes his godless corpulence up from the ground long enough to get slapped down again. The reason Dr. Hooker’s paper was retracted was not because it was flawed, but because he obtained much more conclusive proof of his claim that the CDC was hiding apparent evidence of a specific vaccination/autism link.</p><p>On the very same day that PZ was erroneously claiming I was wrong about this “final damning straw”, Dr. William Thompson, a senior scientist at the CDC, <a href=\"http://www.morganverkamp.com/august-27-2014-press-release-statement-of-william-w-thompson-ph-d-regarding-the-2004-article-examining-the-possibility-of-a-relationship-between-mmr-vaccine-and-autism/\">issued a statement</a> through his lawyer proving that I was right to take Dr. Hooker’s assertion about statistical fraud at the CDC seriously.</p><blockquote class=\"tr_bq\"><p> FOR IMMEDIATE RELEASE-AUGUST 27,2014</p><p>STATEMENT OF WILLIAM W. THOMPSON, Ph.D., REGARDING THE 2004 ARTICLE EXAMINING THE POSSIBILITY OF A RELATIONSHIP  BETWEEN  MMR VACCINE AND AUTISM</p></blockquote><p>PZ Myers must be a remarkably dishonest man on the basis of his long-held, oft-expressed opinion that I am prone to dishonesty. One would think that after all these years of nipping at my ankles, he would have learned by now that while I do occasionally make mistakes, and I do occasionally take at face value reports that turn out to be false, I do not lie when I am writing on the blog. Not because I’m perfectly honest, but because I’m not perfectly stupid.</p><p>I also make a habit of doing the sort of look-before-you-leap research with which PZ never bothers. Which is why when he’s saying one thing and I’m saying another, the very safe bet is on the latter.</p></div>",
  "content_text": "And then promptly proceeds\nto dig the hole deeper\n. Based on his National Merit status, he’s got to have the raw cognitive capacity to do better, but it’s sometimes hard to believe because he so regularly renders himself functionally stupid. It’s as if he’s got some sort of religious derangement syndrome that handicaps his intellectual faculties.\n“The other day, I said that his book, The Irrational Atheist, was self-published. I was wrong. He actually bamboozled a publisher into taking it on.”\nAs one might expect, PZ is characteristically gracious about admitting his error. TIA was originally headed for publication by Crown Forum when a bigger name, David Berlinski, proposed a similar book just as Crown was on the verge of sending me a contract to write it. The editor decided, reasonably enough, that one book on the topic would be sufficient for their needs and chose Berlinski over me. I gave Glenn at BenBella a call to see if he was interested and he snapped it up right away. No bamboozling was required. It seems strange to have to explain this, but most publishers are very happy to receive book proposals on interesting subjects from popular bloggers. I’ve had standing offers from publishers who are pretty much willing to publish whatever non-fiction I want to write for years.\nOne of the few remaining Pharyngulans is so desperate to try to DISQUALIFY me that he suggested I paid BenBella Books to have it published. Never mind the obvious fact that I had previously contributed to several BenBella anthologies. Or the 100+ reviews and the fact that after six years, the Kindle ranking for TIA is still respectable at  “#28 in Kindle Store > Kindle eBooks > Religion & Spirituality > Atheism”\nThe Devil’s Delusion\n, on the other hand is at  #42 in Kindle Store > Kindle eBooks > Religion & Spirituality > Atheism. But it has 237 reviews, so one has to conclude that Jed made a reasonable call in going with Berlinski. I suspect TIA might have done even better than TDD did with the benefit of Crown’s marketing muscle behind it, but I can’t criticize the decision, even in in retrospect. Remember, the call had to be made prior to either book actually being written.\n“I said it was ridiculous for him to claim that he was cited in scientific publications, when what he was really doing was claiming that people who didn’t cite him at all were actually citing him. It’s bizarre, but he’s doubling down. He claims that Scott Atran was using his ‘data’ about the number of religious wars, which he had to have gotten from his book. I think we can safely lay this one to rest: Vox Day/Theodore Beale is not the source of any data or hypothesis published by Scott Atran in Nature.”\nWho said anything about Scott Atran in\nNature\n?\nPZ brought up Atran\n, not me. Look, I don’t read\nNature\n. I don’t follow Scott Atran. I don’t hunt for references to my historical proof that religion doesn’t cause war. People simply happen to send me news about things they think might be of interest to me on a regular basis. The only reference I ever noticed myself was the recent one in the New York Times. Anyhow, as was brought to my attention two years ago, I was the original\nsource of the data Atran cited in a 2012 article called “God and the\nIvory Tower”.\nMoreover, the chief complaint against religion — that it is history’s\nprime instigator of intergroup conflict — does not withstand scrutiny.\nReligious issues motivate only a small minority of recorded wars. The\nEncyclopedia of Wars surveyed 1,763 violent conflicts across history;\nonly 123 (7 percent) were religious”\n– “God and the Ivory Tower”, August 6, 2012\n“He claims to have inspired other studies…. Strange. I am not autistic to any noticeable degree, and have never been diagnosed as such. That makes it odd to claim I am the inspiration for a “hypothesis”.”\nIt’s a little more noticeable than PZ thinks. Self-awareness is not his strong suit. From a 2007 post entitled\nThe socially autistic atheist\n: “Based on Wired Magazine’s observation that atheists tend to be\nquarrelsome, socially challenged men, to say nothing of the unpleasant\npersonalities of leading public atheists such as Richard Dawkins,\nChristopher Hitchens and Michel Onfray, one could reasonably hypothesize\nthat there is likely to be a strong correlation between Asperger’s and\natheism.  It’s by no means a scientific test, but it is interesting to\nnote the coincidence that 59 of the virulent atheists over at Dr. PZ\nMyers place\nreport an average score\non the\nAsperger’s Quotient test\nof 27.8.  And this does not include the two individuals who actually have Asperger’s but did not report any test results.”\nAs PZ himself said: “I took the test and scored a 24, an “average math contest winner.” You need a 32 to suggest Asperger’s, and a 15 is the average. So there. I don’t have Asperger’s, I’m just cruel and insensitive.”\nHence the term “socially autistic” rather than “autistic”. The adjective modifies the noun. It’s not surprising PZ’s AQ score is higher than the norm on the autism spectrum because he is observably a “quarrelsome, socially challenged” man. I scored 14, by the way. Unlike PZ, I possess empathy, athletic experience, and social skills that help temper my high intelligence. I’m not as literal and pedantic as one might conclude from reading the blog, that is just an artifact of having had scores of people like PZ scouring my every written word looking for something, anything, to attack and use to DISQUALIFY for over a decade.\n“Most importantly, there is no citation of Theodore Beale, or Vox Day, or The Irrational Atheist, or ‘that misogynistic asshole on the internet’. You’d think this would be rather obvious: you don’t get to count it as a citation if you aren’t cited.”\nI was curious when I saw a report of the study in the news, so I emailed one of the authors and asked her if her team had derived the hypothesis from TIA or from this blog. She emailed me back, confirmed that they had in fact gotten it from TIA, and asked if I would like to be cited. I thanked her and told her it wasn’t necessary because I was merely curious if it was sheer coincidence or not. I’m not a scientist and I’m not at all concerned about petty scientistic credential games. I’m certainly not concerned with their little rules about who get to take credit and how. The facts are what they are. I deal in reality, not scientistry.\n“And the final damning straw: the much vaunted paper by Hooker that claims a vaccination/autism link, that was promoted by Vox Day, has been retracted. He’s basically wrong about everything.”\nNo. I have not been wrong about anything he’s addressed here. I am smarter than PZ Myers and one reason he hates me is that I demonstrate this so easily every single time he pushes his godless corpulence up from the ground long enough to get slapped down again. The reason Dr. Hooker’s paper was retracted was not because it was flawed, but because he obtained much more conclusive proof of his claim that the CDC was hiding apparent evidence of a specific vaccination/autism link.\nOn the very same day that PZ was erroneously claiming I was wrong about this “final damning straw”, Dr. William Thompson, a senior scientist at the CDC,\nissued a statement\nthrough his lawyer proving that I was right to take Dr. Hooker’s assertion about statistical fraud at the CDC seriously.\nFOR IMMEDIATE RELEASE-AUGUST 27,2014\nSTATEMENT OF WILLIAM W. THOMPSON, Ph.D., REGARDING THE 2004 ARTICLE EXAMINING THE POSSIBILITY OF A RELATIONSHIP  BETWEEN  MMR VACCINE AND AUTISM\nPZ Myers must be a remarkably dishonest man on the basis of his long-held, oft-expressed opinion that I am prone to dishonesty. One would think that after all these years of nipping at my ankles, he would have learned by now that while I do occasionally make mistakes, and I do occasionally take at face value reports that turn out to be false, I do not lie when I am writing on the blog. Not because I’m perfectly honest, but because I’m not perfectly stupid.\nI also make a habit of doing the sort of look-before-you-leap research with which PZ never bothers. Which is why when he’s saying one thing and I’m saying another, the very safe bet is on the latter.",
  "tags": [
    "anklebiters",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-29T07:29:00+00:00"
}