{
  "url": "https://voxday.net/2014/08/09/quarantine-continen/",
  "scraped_at": "2025-12-16T12:23:42.366720",
  "title": "Quarantine the continent",
  "date_display": "August 9, 2014",
  "date_iso": "2014-08-09T20:00:00+00:00",
  "date_from_url": "2014-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Did the USA learn nothing from the AIDS epidemic? Why is a single flight from Africa <a href=\"http://pjmedia.com/richardfernandez/2014/08/08/viral/\">being permitted to land anywhere in the USA or Europe?</a> Do people not realize that were it not for the fact that he didn’t live long enough to board his flight to MSP, the eight hospital workers that Patrick Sawyer infected in Nigeria might well have been in St. Paul, Minnesota?</p><blockquote class=\"tr_bq\"><p> Ken Isaacs of Samaritan’s Purse told a Congressional Hearing that the WHO is underreporting the Ebola epidemic. “Ken Isaacs, a vice president with Samaritan’s Purse, a North Carolina-based Christian humanitarian organization, also said the number of Ebola cases and deaths reported by the World Health Organization are probably 25 percent to 50 percent below actual levels.”</p><p><i>Isaacs told of a prominent Liberian doctor who “openly mocked the existence of Ebola” by trying to enter a hospital isolation ward with no gloves or protective clothing. He and another man who accompanied him to the hospital both died within five days, Isaacs said. At one point, Isaacs even disputed the earlier testimony of a physician from the U.S. Agency for International Development, who said his agency had provided 35,000 protective suits for health care workers in West Africa. Isaacs told lawmakers he had received an email in the last 90 minutes from a hospital in Liberia “asking us for more personal protection gear. This a problem everywhere,” he said.</i></p><p>Equipment might not be a problem for much longer. Finding people to wear them will. Ebola is rapidly killing off the medical personnel and shutting down the hospitals. The dead are being left to die in the street, where with a last effort, some of them crawl out to expire.</p></blockquote><p>How many millions are going to have to die in the name of multiculturalism and insanity before we end it as the madness that it has always been? Africa is hapless and hopeless and it is not America’s or Europe’s job to save it. And neither America nor Europe will even be able to help it if we import its cultural dysfunctionalities and turn all of our cities into Detroits.</p><p>Perhaps we’ll be fortunate this time and the Ebola epidemic will remain<br> in Africa despite the medical community’s apparent determination to<br> spread it around the world… this time. And why are these infected Western health workers being back to their home countries? Salute their efforts to save others elsewhere, by all means, but they have no right, none at all, to put their home nations at risk.</br></br></p><p>UPDATE: <i>“On Saturday, Guinea announced that it had closed its borders with Sierra Leone and Liberia in a bid to halt the virus’s spread.”</i></p><p>So, if Guinea has done it, why don’t we? What can possibly be worth taking the chance of having it spread via air travel?</p></div>",
  "content_text": "Did the USA learn nothing from the AIDS epidemic? Why is a single flight from Africa\nbeing permitted to land anywhere in the USA or Europe?\nDo people not realize that were it not for the fact that he didn’t live long enough to board his flight to MSP, the eight hospital workers that Patrick Sawyer infected in Nigeria might well have been in St. Paul, Minnesota?\nKen Isaacs of Samaritan’s Purse told a Congressional Hearing that the WHO is underreporting the Ebola epidemic. “Ken Isaacs, a vice president with Samaritan’s Purse, a North Carolina-based Christian humanitarian organization, also said the number of Ebola cases and deaths reported by the World Health Organization are probably 25 percent to 50 percent below actual levels.”\nIsaacs told of a prominent Liberian doctor who “openly mocked the existence of Ebola” by trying to enter a hospital isolation ward with no gloves or protective clothing. He and another man who accompanied him to the hospital both died within five days, Isaacs said. At one point, Isaacs even disputed the earlier testimony of a physician from the U.S. Agency for International Development, who said his agency had provided 35,000 protective suits for health care workers in West Africa. Isaacs told lawmakers he had received an email in the last 90 minutes from a hospital in Liberia “asking us for more personal protection gear. This a problem everywhere,” he said.\nEquipment might not be a problem for much longer. Finding people to wear them will. Ebola is rapidly killing off the medical personnel and shutting down the hospitals. The dead are being left to die in the street, where with a last effort, some of them crawl out to expire.\nHow many millions are going to have to die in the name of multiculturalism and insanity before we end it as the madness that it has always been? Africa is hapless and hopeless and it is not America’s or Europe’s job to save it. And neither America nor Europe will even be able to help it if we import its cultural dysfunctionalities and turn all of our cities into Detroits.\nPerhaps we’ll be fortunate this time and the Ebola epidemic will remain\nin Africa despite the medical community’s apparent determination to\nspread it around the world… this time. And why are these infected Western health workers being back to their home countries? Salute their efforts to save others elsewhere, by all means, but they have no right, none at all, to put their home nations at risk.\nUPDATE:\n“On Saturday, Guinea announced that it had closed its borders with Sierra Leone and Liberia in a bid to halt the virus’s spread.”\nSo, if Guinea has done it, why don’t we? What can possibly be worth taking the chance of having it spread via air travel?",
  "tags": [
    "science",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-09T19:00:00+00:00"
}