{
  "url": "https://voxday.net/2014/08/24/restoring-christendo/",
  "scraped_at": "2025-12-16T12:25:19.389188",
  "title": "Restoring Christendom",
  "date_display": "August 24, 2014",
  "date_iso": "2014-08-24T13:00:00+00:00",
  "date_from_url": "2014-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lest you think it is not necessary to end the ill-considered concept of religious pluralism and <a href=\"http://www.examiner.com/article/muslims-demand-breakaway-islamic-nation-norway-or-another-9-11-threatened\">repatriate the adherents</a> of the religion of peace:</p><blockquote class=\"tr_bq\"><p> “If norwegian soldiers can take planes to Afghanistan, then Osama and Mohammed can also take planes to Norway, inshaAllah. Now, the government must wake up and assume responsibility, before this war spreads to Norway. Before the counterpart reacts. Before moslems take the step necessary.</p><p>Do not confuse the moslems’ silence with weakness. Do not profit from the moslems’ patience. Do not force us to do something that can be avoided. This is not a threat, only the words of truth. The words of justice.</p><p>A warning that the consequences can be fatal. A warning about a 9/11 on norwegian ground, or larger attacks than the one carried out on 22 july. This is for your own good and in your own best interest.’</p><p>We do not want to be a part of norwegian society. And we do not consider it necessary either to move away from Norway, because we were born and grew up here. And Allah’s earth belongs to everybody.</p><p>But let Grønland become ours. Bar this city quarter and let us control it the way we wish to do it. This is the best for both parts.</p><p>We do not wish to live together with dirty beasts like you.</p></blockquote><p>Likewise. But Grønland is not theirs. Norway is not theirs. Does the West belong to them? Or does it belong to the Men of the West? Whether Norway realizes it or not, they are now actively engaged in a war of invasion and conquest. So is the rest of Europe. As is America. This is not a war that can be fought “over there”, it is a war that will have to be fought in every nation and every city across the West.</p><p>The War on Terror was a proxy and a cheap, cowardly one. The problem is that secular pluralism will not survive this challenge from Muslims. There is absolutely no point in appealing to secular pluralism, as it was always a fundamentally incoherent concept. It is only a matter of time before it is abandoned, and the sooner we return to the concept of Christian European nations, including the USA, the better off everyone will be.</p><p>Maximizing liberty does not encompass violence enforced partition and Sharia. We already know from the Israeli-Palestinian example what the results of that sort of partition will be. And we already know <a href=\"http://www.telegraph.co.uk/news/worldnews/middleeast/syria/11053657/Call-to-strip-British-citizenship-from-traitors-who-fight-for-Isil.html\">what the eventual solution will be</a>.</p><blockquote class=\"tr_bq\"><p> Call to strip British citizenship from ‘traitors’ who fight for Isil. Britons who fight for Isil in Iraq and Syria should be considered traitors and stripped of their British citizenship, the former shadow home secretary has said. </p></blockquote><p>As the Norwegian example indicates, such actions will only be the start, which will eventually culminate in an eventual ban on Islam in most Western countries. There is already widespread support for such action, and it will grow rapidly with <a href=\"http://chicago.cbslocal.com/2014/08/22/ominous-tweet-connects-isis-threat-in-chicago/\">each new atrocity</a>. Remember, the first Reconquista took 700 years. The second one won’t take as long, but it probably won’t be complete in our lifetimes either.</p></div>",
  "content_text": "Lest you think it is not necessary to end the ill-considered concept of religious pluralism and\nrepatriate the adherents\nof the religion of peace:\n“If norwegian soldiers can take planes to Afghanistan, then Osama and Mohammed can also take planes to Norway, inshaAllah. Now, the government must wake up and assume responsibility, before this war spreads to Norway. Before the counterpart reacts. Before moslems take the step necessary.\nDo not confuse the moslems’ silence with weakness. Do not profit from the moslems’ patience. Do not force us to do something that can be avoided. This is not a threat, only the words of truth. The words of justice.\nA warning that the consequences can be fatal. A warning about a 9/11 on norwegian ground, or larger attacks than the one carried out on 22 july. This is for your own good and in your own best interest.’\nWe do not want to be a part of norwegian society. And we do not consider it necessary either to move away from Norway, because we were born and grew up here. And Allah’s earth belongs to everybody.\nBut let Grønland become ours. Bar this city quarter and let us control it the way we wish to do it. This is the best for both parts.\nWe do not wish to live together with dirty beasts like you.\nLikewise. But Grønland is not theirs. Norway is not theirs. Does the West belong to them? Or does it belong to the Men of the West? Whether Norway realizes it or not, they are now actively engaged in a war of invasion and conquest. So is the rest of Europe. As is America. This is not a war that can be fought “over there”, it is a war that will have to be fought in every nation and every city across the West.\nThe War on Terror was a proxy and a cheap, cowardly one. The problem is that secular pluralism will not survive this challenge from Muslims. There is absolutely no point in appealing to secular pluralism, as it was always a fundamentally incoherent concept. It is only a matter of time before it is abandoned, and the sooner we return to the concept of Christian European nations, including the USA, the better off everyone will be.\nMaximizing liberty does not encompass violence enforced partition and Sharia. We already know from the Israeli-Palestinian example what the results of that sort of partition will be. And we already know\nwhat the eventual solution will be\n.\nCall to strip British citizenship from ‘traitors’ who fight for Isil. Britons who fight for Isil in Iraq and Syria should be considered traitors and stripped of their British citizenship, the former shadow home secretary has said.\nAs the Norwegian example indicates, such actions will only be the start, which will eventually culminate in an eventual ban on Islam in most Western countries. There is already widespread support for such action, and it will grow rapidly with\neach new atrocity\n. Remember, the first Reconquista took 700 years. The second one won’t take as long, but it probably won’t be complete in our lifetimes either.",
  "tags": [
    "Clash of Civilizations",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-24T12:00:00+00:00"
}