{
  "url": "https://voxday.net/2014/08/15/rules-of-writing-ix-good-writing-and/",
  "scraped_at": "2025-12-16T12:24:20.663798",
  "title": "Rules of Writing IX: good writing and defective style",
  "date_display": "August 15, 2014",
  "date_iso": "2014-08-15T13:00:00+00:00",
  "date_from_url": "2014-08-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While I didn’t think a great deal of magnum opus, my objections were not to the stylings of David Foster Wallace’s prose, and since he is still recognized as the creme de la creme of our generation’s New York literati, he serves as an adequate guide to literary style. He <a href=\"http://www.brainpickings.org/index.php/2014/08/11/david-foster-wallace-quack-this-way/?utm_content=buffer7bc14&amp;utm_medium=social&amp;utm_source=twitter.com&amp;utm_campaign=buffer\">described good writing</a> so:</p><blockquote class=\"tr_bq\"><p> In the broadest possible sense, writing well means to communicate<br> clearly and interestingly and in a way that feels alive to the reader.<br> Where there’s some kind of relationship between the writer and the<br> reader — even though it’s mediated by a kind of text — there’s an<br> electricity about it.</br></br></br></br></p></blockquote><p>Notice that his definition is intrinsically subjective and determined by the reader. This is why various claims that a competent writer is stylistically terrible while another one is wonderful are, <i>for the most part</i>, mere posturing. Now, that doesn’t mean that one cannot be a technically bad writer, since there are basic grammatical rules to every language, words have specific meanings and can therefore be used improperly, and sentences or paragraphs can be strung together in a variety of incoherent and otherwise incompetent ways.</p><p>But the fact that the idea communicated is distasteful or that it is communicated in a way that is uninteresting or feels leaden to a reader does not, contra the blatherings of the would-be literary crowd of the SF/F community, make it bad writing. No matter how they preen and posture, David Foster Wallace himself is telling them that they are wrong, and since they are no more than literary wannabes, they have no counterarguments to this appeal to authority.</p><p>This subjective element doesn’t mean that all functional prose is of equal beauty or equally effective. Not at all. One need only compare the difference between my pedestrian style versus John C. Wright’s sparkling literary pyrotechnics to see that. But it does mean that in order to be legitimately considered bad writing, as opposed to merely not-great writing, there has to be something technically incorrect about it. So, for example, I’ll turn to Ayn Rand, to whose prose deficiencies I have myself referred. Here is a randomly selected paragraph from <i>Atlas Shrugged</i>.</p><blockquote class=\"tr_bq\"><p> One by one, the men who had built new towns in Colorado, had departed into some silent unknown, from which no voice or person had yet returned. The towns they had left were dying. Some of the factories they built had remained ownerless and locked; others had been seized by the local authorities; the machines in both stood still.</p><p>She had felt as if a dark map of Colorado were spread before her like a traffic control panel, with a few lights scattered through its mountains. One after another, the lights had gone out. One after another, the men had vanished. There had been a pattern about it, which she felt, but could not define; she had become able to predict, almost with certainty, who would go next and when; she was unable to grasp the “why?”</p></blockquote><p>In my estimation, Ayn Rand’s chief stylistic problem was her overreliance upon the past perfect simple tense and the passive voice. While her sentences are more or less grammatically correct, and therefore not, strictly speaking, erroneous, the effect is stultifying. Count the astonishing number of “had VERB” instances in the two paragraphs. There are 11 in only seven sentences. Her prose is so passive it is lying supine, flat upon its back, drooling.</p><p>Moreover, it is not used in an entirely correct manner. The past perfect simple tense is to be used “when describing an event that occurred before something else followed”. But what follows the failure to return of a voice or person, what follows the factories remaining ownerless, when those events are still ongoing? Also, if something is unknown, how can it be silent?  It is the men who are silent, not the unknown. It would have been acceptable to say “some unknown silence”, but it is not correct to say “some silent unknown”. And how does a voice return, via the telephone?</p><p>“The men left and were never heard from again.” That would be a much simpler way to say it. She’s shooting for a flowery, more dramatic and haunting effect, of course, but she lays it on too heavily and it comes off poorly. It’s also structurally inconsistent to switch from who and when to “the why?”. This is Rand’s flair for the dramatic asserting itself at the wrong time, she should have simply said: “she was unable to grasp why”, although she could have also, less gracefully, chosen to utilize the “who?” and the “when?”. These are but a few of the many such errors that litter her writing; they do not make her a bad writer (style being only one of the four major facets of writing), but they do make her an observably flawed stylist.</p><p>I’m not cherry-picking here. I intentionally chose a passage at random knowing that I would find some such deficiencies, although I did not think to discover such an abundance of them. In fact, that is the most fair way to judge a writer’s technical competence, as intentionally focusing on one passage that one finds infelicitous is not only indicative of negative intent, but can be completely misleading. Furthermore, most assertions of bad writing, particularly when a controversial writer is concerned, are provably false. <a href=\"http://www.philosophyinaction.com/blog/?p=8481\">Consider</a>:</p><blockquote class=\"tr_bq\"><p> The first thing one picks up on when starting Atlas Shrugged is the<br> poverty of the prose. Ayn Rand, no matter her or her followers’ opinion<br> otherwise, just isn’t a very good writer. The language is plodding,<br> non-lyrical, and often often awkward. For example, in one scene she<br> writes, “He stood slouching against the bar.” To my knowledge, one<br> stands against a bar or one slouches against a bar-but one does not<br> stand slouching.</br></br></br></br></br></br></p></blockquote><p>This is amusing, not only due to the phrase “often often awkward” or because the posturing would-be critic only supplies one example, but because he doesn’t quote the text correctly or provide a legitimate example. As another observer noted: “About the “slouching,” the actual sentence is “Bertram Scudder stood<br> slouched against the bar.”  That’s perfectly sensible: a person can<br> slouch while sitting or standing, and in doing so the person might be<br> leaning against a bar.” Since “to slouch” means “to sit or stand with an awkward, drooping posture” it is perfectly reasonable to clarify whether the slouching individual is sitting or standing.</br></br></br></p><p>Now, as I’ve already pointed out, there are legitimate grounds to criticize the stylistic facet of Rand’s writing. But very few of those who claim she is a bad writer ever seem to reference them. In a similar manner, I have been vastly amused by the way in which my critics have focused, laser-like, on a single passage from “Opera Vita Aeterna” that has been repeatedly cited to support the claim that I am a terrible writer. This is the exhibit one of the execrable writing they condemn:</p><blockquote class=\"tr_bq\"><p> The cold autumn day was slowly drawing to a close. The pallid sun was descending, its ineffective rays no longer sufficient to hold it up in the sky or to penetrate the northern winds that gathered strength with the whispering promise of the incipient dark. The first of the two moons was already visible high above the mountains. Soon Arbhadis, Night’s Mistress, would unveil herself as well.</p></blockquote><p>While there are no technical errors of the sort we see in Rand’s writing, there is obviously something a little strange there. The implication that the sun’s rays are physically holding up the sun, and that night is falling because those rays are no longer strong enough to do so, will likely strike the reader as weirdly literal.</p><p>And if the story proceeded into more similarly clumsy metaphors, one might reasonably conclude that the writer has an overly literal mind and is technically deficient in that regard. But it doesn’t; even the most dismissive critics have noted that it’s only this first passage that contains anything of this sort. Moreover, instead of proceeding into a pedestrian tale of swords, sorcery, and derring-do, it’s a rather unusual story where nothing seems to happen and almost everyone dies violently, in addition to this dichotomy is a short spelunking into pseudo-Thomistic philosophy sufficiently sophisticated to lead critics into mistakenly concluding it is cribbed, and to top it all off, the ending is ambiguous. So, it should be clear that the writer does not have the overly literal mind suspected at the start.</p><p>This doesn’t matter to the superficial reader only looking for an excuse to dismiss the writer, of course. The pedestrian critic will simply moan about the supposedly awful metaphor and think no further. That’s exactly the role he is supposed to play. But the ideal reader will wonder about the seeming contradiction observed. He might know the author well enough to realize that the author’s mind is more Machiavellian than literal, and possessed of a cruel sense of humor.  And he would certainly know that the author’s observable familiarity with medieval philosophy would tend to indicate an awareness of the naturalistic literalism of that era.</p><p>Or he might not. Regardless, what is so funny to me is that the very people who think Monty Python is so clever and funny when they portray the sun walking on two legs below the horizon in a movie don’t recognize the exact same thing when it isn’t presented in a juvenile, full-color cartoon format. As it happens, the critics were correct to react to the passage in a hostile manner, they simply didn’t recognize how it defines my relationship to the type of reader they represent, which is to say, my unconcealed contempt for their dim little minds.</p><p>I’m more interested in ideas than style. I’m certainly not one of those writers, like Ayn Rand, who claims that every comma is sacred and placed with perfect intent, but as a general rule, it is safe to conclude that something seems a little strange, there is a message to someone, somewhere, being sent. Even if it is a simple one that could have been just as easily delivered with a single finger.</p><p>In the wake of Robin Williams’s suicide, David Brooks pleaded for mercy for the creators: <i>“My plea here is for people to give the needed space to artists and<br> performers to fail every now and then, and to understand how exposed<br> someone feels when trying something new. The trolls, the Twitter<br> executioners and the like should save their savagery for those who are<br> famous for being famous.”</br></br></br></br></i></p><p>I could not disagree more. Bring it on. Wax eloquent on Twitter and on your blogs about what a terrible writer I am, what a terrible person I am. Open up your hate and let it flow into me.</p></div>",
  "content_text": "While I didn’t think a great deal of magnum opus, my objections were not to the stylings of David Foster Wallace’s prose, and since he is still recognized as the creme de la creme of our generation’s New York literati, he serves as an adequate guide to literary style. He\ndescribed good writing\nso:\nIn the broadest possible sense, writing well means to communicate\nclearly and interestingly and in a way that feels alive to the reader.\nWhere there’s some kind of relationship between the writer and the\nreader — even though it’s mediated by a kind of text — there’s an\nelectricity about it.\nNotice that his definition is intrinsically subjective and determined by the reader. This is why various claims that a competent writer is stylistically terrible while another one is wonderful are,\nfor the most part\n, mere posturing. Now, that doesn’t mean that one cannot be a technically bad writer, since there are basic grammatical rules to every language, words have specific meanings and can therefore be used improperly, and sentences or paragraphs can be strung together in a variety of incoherent and otherwise incompetent ways.\nBut the fact that the idea communicated is distasteful or that it is communicated in a way that is uninteresting or feels leaden to a reader does not, contra the blatherings of the would-be literary crowd of the SF/F community, make it bad writing. No matter how they preen and posture, David Foster Wallace himself is telling them that they are wrong, and since they are no more than literary wannabes, they have no counterarguments to this appeal to authority.\nThis subjective element doesn’t mean that all functional prose is of equal beauty or equally effective. Not at all. One need only compare the difference between my pedestrian style versus John C. Wright’s sparkling literary pyrotechnics to see that. But it does mean that in order to be legitimately considered bad writing, as opposed to merely not-great writing, there has to be something technically incorrect about it. So, for example, I’ll turn to Ayn Rand, to whose prose deficiencies I have myself referred. Here is a randomly selected paragraph from\nAtlas Shrugged\n.\nOne by one, the men who had built new towns in Colorado, had departed into some silent unknown, from which no voice or person had yet returned. The towns they had left were dying. Some of the factories they built had remained ownerless and locked; others had been seized by the local authorities; the machines in both stood still.\nShe had felt as if a dark map of Colorado were spread before her like a traffic control panel, with a few lights scattered through its mountains. One after another, the lights had gone out. One after another, the men had vanished. There had been a pattern about it, which she felt, but could not define; she had become able to predict, almost with certainty, who would go next and when; she was unable to grasp the “why?”\nIn my estimation, Ayn Rand’s chief stylistic problem was her overreliance upon the past perfect simple tense and the passive voice. While her sentences are more or less grammatically correct, and therefore not, strictly speaking, erroneous, the effect is stultifying. Count the astonishing number of “had VERB” instances in the two paragraphs. There are 11 in only seven sentences. Her prose is so passive it is lying supine, flat upon its back, drooling.\nMoreover, it is not used in an entirely correct manner. The past perfect simple tense is to be used “when describing an event that occurred before something else followed”. But what follows the failure to return of a voice or person, what follows the factories remaining ownerless, when those events are still ongoing? Also, if something is unknown, how can it be silent?  It is the men who are silent, not the unknown. It would have been acceptable to say “some unknown silence”, but it is not correct to say “some silent unknown”. And how does a voice return, via the telephone?\n“The men left and were never heard from again.” That would be a much simpler way to say it. She’s shooting for a flowery, more dramatic and haunting effect, of course, but she lays it on too heavily and it comes off poorly. It’s also structurally inconsistent to switch from who and when to “the why?”. This is Rand’s flair for the dramatic asserting itself at the wrong time, she should have simply said: “she was unable to grasp why”, although she could have also, less gracefully, chosen to utilize the “who?” and the “when?”. These are but a few of the many such errors that litter her writing; they do not make her a bad writer (style being only one of the four major facets of writing), but they do make her an observably flawed stylist.\nI’m not cherry-picking here. I intentionally chose a passage at random knowing that I would find some such deficiencies, although I did not think to discover such an abundance of them. In fact, that is the most fair way to judge a writer’s technical competence, as intentionally focusing on one passage that one finds infelicitous is not only indicative of negative intent, but can be completely misleading. Furthermore, most assertions of bad writing, particularly when a controversial writer is concerned, are provably false.\nConsider\n:\nThe first thing one picks up on when starting Atlas Shrugged is the\npoverty of the prose. Ayn Rand, no matter her or her followers’ opinion\notherwise, just isn’t a very good writer. The language is plodding,\nnon-lyrical, and often often awkward. For example, in one scene she\nwrites, “He stood slouching against the bar.” To my knowledge, one\nstands against a bar or one slouches against a bar-but one does not\nstand slouching.\nThis is amusing, not only due to the phrase “often often awkward” or because the posturing would-be critic only supplies one example, but because he doesn’t quote the text correctly or provide a legitimate example. As another observer noted: “About the “slouching,” the actual sentence is “Bertram Scudder stood\nslouched against the bar.”  That’s perfectly sensible: a person can\nslouch while sitting or standing, and in doing so the person might be\nleaning against a bar.” Since “to slouch” means “to sit or stand with an awkward, drooping posture” it is perfectly reasonable to clarify whether the slouching individual is sitting or standing.\nNow, as I’ve already pointed out, there are legitimate grounds to criticize the stylistic facet of Rand’s writing. But very few of those who claim she is a bad writer ever seem to reference them. In a similar manner, I have been vastly amused by the way in which my critics have focused, laser-like, on a single passage from “Opera Vita Aeterna” that has been repeatedly cited to support the claim that I am a terrible writer. This is the exhibit one of the execrable writing they condemn:\nThe cold autumn day was slowly drawing to a close. The pallid sun was descending, its ineffective rays no longer sufficient to hold it up in the sky or to penetrate the northern winds that gathered strength with the whispering promise of the incipient dark. The first of the two moons was already visible high above the mountains. Soon Arbhadis, Night’s Mistress, would unveil herself as well.\nWhile there are no technical errors of the sort we see in Rand’s writing, there is obviously something a little strange there. The implication that the sun’s rays are physically holding up the sun, and that night is falling because those rays are no longer strong enough to do so, will likely strike the reader as weirdly literal.\nAnd if the story proceeded into more similarly clumsy metaphors, one might reasonably conclude that the writer has an overly literal mind and is technically deficient in that regard. But it doesn’t; even the most dismissive critics have noted that it’s only this first passage that contains anything of this sort. Moreover, instead of proceeding into a pedestrian tale of swords, sorcery, and derring-do, it’s a rather unusual story where nothing seems to happen and almost everyone dies violently, in addition to this dichotomy is a short spelunking into pseudo-Thomistic philosophy sufficiently sophisticated to lead critics into mistakenly concluding it is cribbed, and to top it all off, the ending is ambiguous. So, it should be clear that the writer does not have the overly literal mind suspected at the start.\nThis doesn’t matter to the superficial reader only looking for an excuse to dismiss the writer, of course. The pedestrian critic will simply moan about the supposedly awful metaphor and think no further. That’s exactly the role he is supposed to play. But the ideal reader will wonder about the seeming contradiction observed. He might know the author well enough to realize that the author’s mind is more Machiavellian than literal, and possessed of a cruel sense of humor.  And he would certainly know that the author’s observable familiarity with medieval philosophy would tend to indicate an awareness of the naturalistic literalism of that era.\nOr he might not. Regardless, what is so funny to me is that the very people who think Monty Python is so clever and funny when they portray the sun walking on two legs below the horizon in a movie don’t recognize the exact same thing when it isn’t presented in a juvenile, full-color cartoon format. As it happens, the critics were correct to react to the passage in a hostile manner, they simply didn’t recognize how it defines my relationship to the type of reader they represent, which is to say, my unconcealed contempt for their dim little minds.\nI’m more interested in ideas than style. I’m certainly not one of those writers, like Ayn Rand, who claims that every comma is sacred and placed with perfect intent, but as a general rule, it is safe to conclude that something seems a little strange, there is a message to someone, somewhere, being sent. Even if it is a simple one that could have been just as easily delivered with a single finger.\nIn the wake of Robin Williams’s suicide, David Brooks pleaded for mercy for the creators:\n“My plea here is for people to give the needed space to artists and\nperformers to fail every now and then, and to understand how exposed\nsomeone feels when trying something new. The trolls, the Twitter\nexecutioners and the like should save their savagery for those who are\nfamous for being famous.”\nI could not disagree more. Bring it on. Wax eloquent on Twitter and on your blogs about what a terrible writer I am, what a terrible person I am. Open up your hate and let it flow into me.",
  "tags": [
    "Rules of Writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-15T12:00:00+00:00"
}