{
  "url": "https://voxday.net/2014/08/04/so-that-went-over-we/",
  "scraped_at": "2025-12-16T12:23:09.448801",
  "title": "So that went over well",
  "date_display": "August 4, 2014",
  "date_iso": "2014-08-04T20:00:00+00:00",
  "date_from_url": "2014-08-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Between <a href=\"http://www.dailymail.co.uk/news/article-2715466/Israeli-official-calls-concentration-camps-Gaza-conquest-entire-Gaza-Strip-annihilation-fighting-forces-supporters.html\">statements like this</a> and the various public calls for genocide, the Israeli/American Jew PR effort that has met with mixed results in the USA is absolutely back-firing in Europe.</p><blockquote class=\"tr_bq\"><p> An Israeli official has called for concentration camps in Gaza and ‘the conquest of the entire Gaza Strip, and annihilation of all fighting forces and their supporters’.</p><p>Moshe Feiglin, Deputy Speaker of the Israeli Knesset and member of Prime Minister Benjamin Netanyahu’s ruling Likud Party, posted the inflammatory message on his Facebook page at the weekend. </p><p>He lays out a detailed plan for the destruction of Gaza –  which includes shipping its residents across the world – in a letter he addressed to the Israeli Prime Minister Benjamin Netanyahu.</p></blockquote><p>This is the gentleman of whom Shimshon spoke a few posts ago. He’s only got about 10 percent support in Israel, if I understand correctly, but as we know from NK Jemisin’s example, 10 percent support is dangerous and sufficient to inspire impassioned speeches about how all the white folk want you dead. Or something like that, anyhow.</p><p>To help clarify the difference between the European reaction and the American one in perspective, here are the top-rated comments.</p><p>From Italy with 1676 upvotes: <i>It is what we have all been thinking was the real  Israeli agenda.  How can the world just do nothing:(</i></p><p>From the UK with 1034 upvotes: <i>Israel wants the land for its natural gas, it’s as simple as that. It<br> won’t stop and is behaving in an appalling manner…. Hamas and the Israeli Government should hang their heads in<br> shame. Both are terrorist organisations in my mind.</br></br></i></p><p>From the UK with 939 upvotes:<i> </i><i>And Israel wonders why the Palestinians – plus a growing number of the rest of the world – hate them?</i></p><p>From Sweden with 818 upvotes:<i> </i><i>It is truely disgusting that the people who have been through what they<br> have are doing exactly the same to another group. They keep talking<br> about the hamas charter of wiping out israel. More often then not, it is<br> israel who wants to wipe out palestinians. </br></br></br></i></p><p>And for comparison’s sake, the worst-rated from Wales with 787 downvotes:<i> </i><i>Seems fair – Hamas have called for the extermination of the jews, so its<br> only reasonable that Israel should exterminate all palestinians. </br></i></p><p>Now, keep in mind that this is from the readership of the anti-immigration, right-leaning Daily Mail, which does not exactly have a lot of Muslims among its readership. I can assure you that the language in the more left-leaning papers is considerably more vehement and virulently anti-Israel.</p><p>Feiglin’s plan is so overtly Naziesque that it almost seems as if he’s trolling everyone. About the only thing he missed was to say that Palestinians would have ID numbers tattooed on their arms and forced to wear a yellow crescent moon on their clothing. Then again, what with the Holocaust card being played out, perhaps the Israelis are ready to throw it away and embrace their role as the world’s cartoon villains even if the Jews in America are not.</p><p>Perhaps those of you who previously doubted me will take my warnings about Europe a little more seriously now. It’s not just the Turkish and Pakistani immigrants who are increasingly hostile to Israel and Jewry.</p></div>",
  "content_text": "Between\nstatements like this\nand the various public calls for genocide, the Israeli/American Jew PR effort that has met with mixed results in the USA is absolutely back-firing in Europe.\nAn Israeli official has called for concentration camps in Gaza and ‘the conquest of the entire Gaza Strip, and annihilation of all fighting forces and their supporters’.\nMoshe Feiglin, Deputy Speaker of the Israeli Knesset and member of Prime Minister Benjamin Netanyahu’s ruling Likud Party, posted the inflammatory message on his Facebook page at the weekend.\nHe lays out a detailed plan for the destruction of Gaza –  which includes shipping its residents across the world – in a letter he addressed to the Israeli Prime Minister Benjamin Netanyahu.\nThis is the gentleman of whom Shimshon spoke a few posts ago. He’s only got about 10 percent support in Israel, if I understand correctly, but as we know from NK Jemisin’s example, 10 percent support is dangerous and sufficient to inspire impassioned speeches about how all the white folk want you dead. Or something like that, anyhow.\nTo help clarify the difference between the European reaction and the American one in perspective, here are the top-rated comments.\nFrom Italy with 1676 upvotes:\nIt is what we have all been thinking was the real  Israeli agenda.  How can the world just do nothing:(\nFrom the UK with 1034 upvotes:\nIsrael wants the land for its natural gas, it’s as simple as that. It\nwon’t stop and is behaving in an appalling manner…. Hamas and the Israeli Government should hang their heads in\nshame. Both are terrorist organisations in my mind.\nFrom the UK with 939 upvotes:\nAnd Israel wonders why the Palestinians – plus a growing number of the rest of the world – hate them?\nFrom Sweden with 818 upvotes:\nIt is truely disgusting that the people who have been through what they\nhave are doing exactly the same to another group. They keep talking\nabout the hamas charter of wiping out israel. More often then not, it is\nisrael who wants to wipe out palestinians.\nAnd for comparison’s sake, the worst-rated from Wales with 787 downvotes:\nSeems fair – Hamas have called for the extermination of the jews, so its\nonly reasonable that Israel should exterminate all palestinians.\nNow, keep in mind that this is from the readership of the anti-immigration, right-leaning Daily Mail, which does not exactly have a lot of Muslims among its readership. I can assure you that the language in the more left-leaning papers is considerably more vehement and virulently anti-Israel.\nFeiglin’s plan is so overtly Naziesque that it almost seems as if he’s trolling everyone. About the only thing he missed was to say that Palestinians would have ID numbers tattooed on their arms and forced to wear a yellow crescent moon on their clothing. Then again, what with the Holocaust card being played out, perhaps the Israelis are ready to throw it away and embrace their role as the world’s cartoon villains even if the Jews in America are not.\nPerhaps those of you who previously doubted me will take my warnings about Europe a little more seriously now. It’s not just the Turkish and Pakistani immigrants who are increasingly hostile to Israel and Jewry.",
  "tags": [
    "media",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-04T19:00:00+00:00"
}