{
  "url": "https://voxday.net/2014/08/05/the-secret-history-of-psykosonik-part-0/",
  "scraped_at": "2025-12-16T12:23:13.160252",
  "title": "The Secret History of Psykosonik, part 0",
  "date_display": "August 5, 2014",
  "date_iso": "2014-08-05T13:00:00+00:00",
  "date_from_url": "2014-08-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I got an email from an old friend I hadn’t heard from in a long time last night. It turned out that he’d saved the tapes from our old band and converted them to MP3 about ten years ago. After Big Chilly’s younger brother bought an Ensoniq keyboard, the four of us spent summer evenings in 1987 and 1988 in the basement of Big Chilly’s house learning how to use our instruments.</p><p>Mostly because they were so simple and all four of us could more or less sing, we started out by learning early Depeche Mode songs such as <i>Just Can’t Get Enough</i> and <a href=\"http://voxday.net/psyko/NoBoys-Dreaming.mp3\"><i>Dreaming of Me</i></a>. We didn’t have a four-track recorder, so everything was recorded live with the programmed drum machines; our microphones were cheap Radio Shack mike sans effects, except for the echo from the basement walls, unless we ran one through one of Big Chilly’s two guitar effects. We covered everything from Depeche Mode and New Order to Shriekback and Camouflage.</p><p>It’s all cheesy as hell, but the two times we played live, once at a graduation party and once at a nightclub in downtown Minneapolis, we went over exceedingly well, I think because at the time people didn’t expect to see live electronic music from local bands. They would look intrigued with the first two songs, then New Order would win them over and get things hopping. It’s funny, but even listening to these songs for the first time in 20 years, I can still remember my harmonies. And remember that Horn always set his bloody mike too high.</p><p>The second summer, our youngest member<i> </i>decided that we should take the leap into writing our own music. Sharp had a rather unusual perspective on life, so the first song he wrote was <i>Dance on the Waters</i>, about a grouper in love with a little girl it sees on the beach from underneath the waves. It’s far too long, it’s musically naive and incoherent, rhythmically crude, and lyrically absurd, but in retrospect, it has just enough indications of genuine talent buried underneath the nonsense that it’s unsurprising he went on to enjoy the most musical success of the four.</p><p>Most of the songs we played, and most of those we wrote, are better lost to the sands of time. But a few of them do show how we were learning how to compose proper songs. One that I’d completely forgotten about, <a href=\"http://voxday.net/psyko/NoBoys-Seasons.mp3\"><i>Seasons Pass</i></a>, is interesting for the way it shows how we’d gone from covering Depeche Mode songs to creating our own Depeche Mode-like melodies.  Sure, it’s terrible, (that line about the streets of St. Paul, ye cats!) but the four of us were between 18 and 19 at the time and everybody has to learn somehow. In<i> <a href=\"http://voxday.net/psyko/NoBoys-Graceful.mp3\">You’re So Graceful</a></i>, which was written towards the end of that second summer, the musical themes have started to become a little more complex and you can hear that we were beginning to grow out of the Depeche Mode influence.</p><p>We ended up going in musically opposite directions, as I founded <a href=\"https://www.youtube.com/watch?v=Lol5eYB1nBU&amp;list=RDLol5eYB1nBU#t=1\">Psykosonik </a>with Paul Sebastien while Big Chilly joined the Bison Chips and Sharp went on to form the great “microphone band” Face (whose interpretation of techno is <a href=\"https://www.youtube.com/watch?v=mfEvZV8gqLc\">considerably different</a>), but I thought perhaps some of you might find it interesting to go back to the very beginning and hear how it all started.</p></div>",
  "content_text": "I got an email from an old friend I hadn’t heard from in a long time last night. It turned out that he’d saved the tapes from our old band and converted them to MP3 about ten years ago. After Big Chilly’s younger brother bought an Ensoniq keyboard, the four of us spent summer evenings in 1987 and 1988 in the basement of Big Chilly’s house learning how to use our instruments.\nMostly because they were so simple and all four of us could more or less sing, we started out by learning early Depeche Mode songs such as\nJust Can’t Get Enough\nand\nDreaming of Me\n. We didn’t have a four-track recorder, so everything was recorded live with the programmed drum machines; our microphones were cheap Radio Shack mike sans effects, except for the echo from the basement walls, unless we ran one through one of Big Chilly’s two guitar effects. We covered everything from Depeche Mode and New Order to Shriekback and Camouflage.\nIt’s all cheesy as hell, but the two times we played live, once at a graduation party and once at a nightclub in downtown Minneapolis, we went over exceedingly well, I think because at the time people didn’t expect to see live electronic music from local bands. They would look intrigued with the first two songs, then New Order would win them over and get things hopping. It’s funny, but even listening to these songs for the first time in 20 years, I can still remember my harmonies. And remember that Horn always set his bloody mike too high.\nThe second summer, our youngest member\ndecided that we should take the leap into writing our own music. Sharp had a rather unusual perspective on life, so the first song he wrote was\nDance on the Waters\n, about a grouper in love with a little girl it sees on the beach from underneath the waves. It’s far too long, it’s musically naive and incoherent, rhythmically crude, and lyrically absurd, but in retrospect, it has just enough indications of genuine talent buried underneath the nonsense that it’s unsurprising he went on to enjoy the most musical success of the four.\nMost of the songs we played, and most of those we wrote, are better lost to the sands of time. But a few of them do show how we were learning how to compose proper songs. One that I’d completely forgotten about,\nSeasons Pass\n, is interesting for the way it shows how we’d gone from covering Depeche Mode songs to creating our own Depeche Mode-like melodies.  Sure, it’s terrible, (that line about the streets of St. Paul, ye cats!) but the four of us were between 18 and 19 at the time and everybody has to learn somehow. In\nYou’re So Graceful\n, which was written towards the end of that second summer, the musical themes have started to become a little more complex and you can hear that we were beginning to grow out of the Depeche Mode influence.\nWe ended up going in musically opposite directions, as I founded\nPsykosonik\nwith Paul Sebastien while Big Chilly joined the Bison Chips and Sharp went on to form the great “microphone band” Face (whose interpretation of techno is\nconsiderably different\n), but I thought perhaps some of you might find it interesting to go back to the very beginning and hear how it all started.",
  "tags": [
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-05T12:00:00+00:00"
}