{
  "url": "https://voxday.net/2014/08/13/the-death-knell-for-equality/",
  "scraped_at": "2025-12-16T12:24:05.248893",
  "title": "The death knell for equality",
  "date_display": "August 13, 2014",
  "date_iso": "2014-08-13T09:56:00+00:00",
  "date_from_url": "2014-08-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The bell tolls for the advocates of diversity, multiculturalism, and human equality, as a study has determined that <a href=\"http://www.latimes.com/science/sciencenow/la-sci-sn-math-reading-genes-20140711-story.html\">half the human capacity for learning is genetic</a>:</p><blockquote class=\"tr_bq\"><p> The genes that determine a person’s ability to tackle one subject influence their aptitude at the other, accounting for about half of a person’s overall ability. The study, published Tuesday in the journal Nature Communications, used nearly 1,500 pairs of 12-year-old twins to tease apart the effects of genetic inheritance and environmental variables on math and reading ability. Twin studies provide a clever way of assessing the balance of nature versus nurture….</p><p>The researchers administered a set of math and verbal tests to the children and then compared the performance of different sets of twins. They found that the twins’ scores  — no matter if they were high or low — were twice as similar among pairs of identical twins as among pairs of fraternal twins. The results indicated that approximately half of the children’s math and reading ability stemmed from their genetic makeup.</p><p>A complementary analysis of unrelated kids corroborated this conclusion — strangers with equivalent academic abilities shared genetic similarities. What’s more, the genes responsible for math and reading ability appear<br> to be numerous and interconnected, not specifically targeted toward one<br> set of skills. These so-called “generalist genes” act in concert to<br> determine a child’s aptitude across multiple disciplines.</br></br></br></p></blockquote><p>This should not be surprising in any way. But it is an efficient, scientific slash across the exposed jugular of ideological equalitarianism. What this means is all the attempts to bring up African children to the level of European and Asian children by educating them were wasted efforts genetically doomed to failure. While improvement is possible, equality is not.</p><p>And even attempts to breed equality through the media advocacy of interracial relations are bound to be disastrous, being intrinsically dysgenic. Sure, there always will be the occasional sports such as me, a European-Hispanic-Native American melange with astigmatism, seriously sub-optimal spatial relations, sprinter speed, and a 150+ IQ, but in general, Arthur C. Clarke’s utopian browning of the world would indicate human population that is shifted to the left on the Bell Curve, with a heavier distribution in the middle and a shorter right tail. That is the literal opposite of human progress.</p><p>(Speaking of my Native American ancestry, my brother succeeded in determining the tribe. My initial surmise was correct and it was my great-grandmother who married the Mexican revolutionary that was the full Indian. My brother doesn’t know yet if we have sufficient tribal blood to qualify for membership in the tribe, although one-eighth is enough to qualify for membership in a related one. The blood quantum requirements <a href=\"http://www.nativevillage.org/Messages%20from%20the%20People/Blood%20Quantums%20for%20Native%20Americans.htm\">vary from tribe to tribe</a>, from one-sixteenth for the Cherokee to one-half for the St. Croix Chippewa.)</p><p>While it will take years, even decades, for the populace and the political system to absorb the consequences of this scientific reality, it is another nail in the coffin of the equality myth.</p></div>",
  "content_text": "The bell tolls for the advocates of diversity, multiculturalism, and human equality, as a study has determined that\nhalf the human capacity for learning is genetic\n:\nThe genes that determine a person’s ability to tackle one subject influence their aptitude at the other, accounting for about half of a person’s overall ability. The study, published Tuesday in the journal Nature Communications, used nearly 1,500 pairs of 12-year-old twins to tease apart the effects of genetic inheritance and environmental variables on math and reading ability. Twin studies provide a clever way of assessing the balance of nature versus nurture….\nThe researchers administered a set of math and verbal tests to the children and then compared the performance of different sets of twins. They found that the twins’ scores  — no matter if they were high or low — were twice as similar among pairs of identical twins as among pairs of fraternal twins. The results indicated that approximately half of the children’s math and reading ability stemmed from their genetic makeup.\nA complementary analysis of unrelated kids corroborated this conclusion — strangers with equivalent academic abilities shared genetic similarities. What’s more, the genes responsible for math and reading ability appear\nto be numerous and interconnected, not specifically targeted toward one\nset of skills. These so-called “generalist genes” act in concert to\ndetermine a child’s aptitude across multiple disciplines.\nThis should not be surprising in any way. But it is an efficient, scientific slash across the exposed jugular of ideological equalitarianism. What this means is all the attempts to bring up African children to the level of European and Asian children by educating them were wasted efforts genetically doomed to failure. While improvement is possible, equality is not.\nAnd even attempts to breed equality through the media advocacy of interracial relations are bound to be disastrous, being intrinsically dysgenic. Sure, there always will be the occasional sports such as me, a European-Hispanic-Native American melange with astigmatism, seriously sub-optimal spatial relations, sprinter speed, and a 150+ IQ, but in general, Arthur C. Clarke’s utopian browning of the world would indicate human population that is shifted to the left on the Bell Curve, with a heavier distribution in the middle and a shorter right tail. That is the literal opposite of human progress.\n(Speaking of my Native American ancestry, my brother succeeded in determining the tribe. My initial surmise was correct and it was my great-grandmother who married the Mexican revolutionary that was the full Indian. My brother doesn’t know yet if we have sufficient tribal blood to qualify for membership in the tribe, although one-eighth is enough to qualify for membership in a related one. The blood quantum requirements\nvary from tribe to tribe\n, from one-sixteenth for the Cherokee to one-half for the St. Croix Chippewa.)\nWhile it will take years, even decades, for the populace and the political system to absorb the consequences of this scientific reality, it is another nail in the coffin of the equality myth.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-13T08:56:00+00:00"
}