{
  "url": "https://voxday.net/2014/08/12/the-return-of-lizard-queen/",
  "scraped_at": "2025-12-16T12:24:00.138739",
  "title": "The return of the Lizard Queen",
  "date_display": "August 12, 2014",
  "date_iso": "2014-08-12T13:39:00+00:00",
  "date_from_url": "2014-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Speaking of Mitt Romney, Pat Buchanan doesn’t think he <a href=\"http://www.wnd.com/2014/08/pat-buchanan-hillary-would-beat-romney-in-2016/\">has a chance against Hillary Clinton</a>. Nor, he thinks, does anyone else:</p><blockquote class=\"tr_bq\"><p> Amid rumblings of another Mitt Romney run for the White House, author<br> and former Republican presidential candidate Pat Buchanan is advising<br> the GOP to avoid nominating the first two-time loser since Democratic<br> presidential nominee Adlai Stevenson lost to Dwight D. Eisenhower in<br> 1952 and again in 1956.</br></br></br></br></p><p>Buchanan made clear that despite Hillary’s recent decline in popularity, she remains the front-runner. “It’s very hard to see if Hillary runs who will beat her,” he<br> stressed. “I don’t see Elizabeth Warren beating her. I tell people that<br> if I were a 45-year-old Democratic senator, I would run, and I would<br> challenge Hillary on issues, so if I lost I would have gained the<br> opportunity to introduce myself to the American people and hope<br> lightening strikes.”</br></br></br></br></br></p><p>Mindful of Bill Clinton’s support of Hillary’s candidacy, he added,<br> “But I doubt any Democrat wants to take the risk of running against<br> Hillary, since it means going after the king, and failing to get the job<br> done might just have disastrous consequences.”</br></br></br></p></blockquote><p>I’m out of the presidential prediction game. Since I don’t live there anymore, it has become clear over the years that my ability to read the electorate has declined. That being said, the one thing we do know is that there is usually at least one surprise challenger who pops up, especially in years where there is no incumbent candidate.</p><p>We’re still two years out, so there is plenty of time for someone to make a run. Remember, two years ago, Marco Rubio was still being mentioned as a serious candidate.</p></div>",
  "content_text": "Speaking of Mitt Romney, Pat Buchanan doesn’t think he\nhas a chance against Hillary Clinton\n. Nor, he thinks, does anyone else:\nAmid rumblings of another Mitt Romney run for the White House, author\nand former Republican presidential candidate Pat Buchanan is advising\nthe GOP to avoid nominating the first two-time loser since Democratic\npresidential nominee Adlai Stevenson lost to Dwight D. Eisenhower in\n1952 and again in 1956.\nBuchanan made clear that despite Hillary’s recent decline in popularity, she remains the front-runner. “It’s very hard to see if Hillary runs who will beat her,” he\nstressed. “I don’t see Elizabeth Warren beating her. I tell people that\nif I were a 45-year-old Democratic senator, I would run, and I would\nchallenge Hillary on issues, so if I lost I would have gained the\nopportunity to introduce myself to the American people and hope\nlightening strikes.”\nMindful of Bill Clinton’s support of Hillary’s candidacy, he added,\n“But I doubt any Democrat wants to take the risk of running against\nHillary, since it means going after the king, and failing to get the job\ndone might just have disastrous consequences.”\nI’m out of the presidential prediction game. Since I don’t live there anymore, it has become clear over the years that my ability to read the electorate has declined. That being said, the one thing we do know is that there is usually at least one surprise challenger who pops up, especially in years where there is no incumbent candidate.\nWe’re still two years out, so there is plenty of time for someone to make a run. Remember, two years ago, Marco Rubio was still being mentioned as a serious candidate.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-12T12:39:00+00:00"
}