{
  "url": "https://voxday.net/2014/08/23/the-end-of-comparative-advantage/",
  "scraped_at": "2025-12-16T12:25:10.212835",
  "title": "The end of comparative advantage",
  "date_display": "August 23, 2014",
  "date_iso": "2014-08-23T08:23:00+00:00",
  "date_from_url": "2014-08-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I have repeatedly pointed out for several years, David Ricardo’s Law of Comparative Advantage has been shown to be based upon false assumptions. Now the mainstream economists <a href=\"http://blogs.telegraph.co.uk/finance/ambroseevans-pritchard/100027963/nobel-gurus-fear-globalisation-is-going-horribly-wrong-technical/\">are beginning to recognize this</a>:</p><blockquote class=\"tr_bq\"><p> David Ricardo’s Theory of Comparative Advantage has broken down after 200 years, or so I learned at the Lindau forum of Nobel laureates in Bavaria.</p><p>The theory published in 1817 has been a guiding principle of free trade, taken as a given by every student of economics in the modern era. It has served us well, but just as Newton’s theories ran into limits and were overtaken by Einstein’s relativity, comparative advantage no longer explains the world.</p><p>Under Ricardo’s model, inequality was supposed to narrow within countries as globalisation accelerated exponentially in the Nineties. Instead it is getting wider….</p><p>Ricardo described a world where free trade in goods was opening up, but<br> labour markets remained largely closed. This is no longer the case.<br> Globalisation bids up the wages of high-skilled engineers or software<br> analysts towards international levels wherever they live.</br></br></br></p></blockquote><p>The Nobel laureates at Lindau aren’t willing to give up on globalization yet (although they should), but the cracks in the economic wall are showing as they express their fears that it is “going horribly wrong”. But it’s not going wrong. It’s going the only way it could possibly have gone.</p><p>Free trade is incompatible with national sovereignty. International<br> labor mobility is incompatible with the very existence of nations. And the heterogeneous populations are economically detrimental and a material barrier to the growth of capital and national wealth. I shall repeat my core argument against free trade, which I first articulated <a href=\"http://www.milobookclub.com/2012/08/01/gary-north-still-hates-americans/\">in 2012</a> following a quasi-debate with Gary North:</br></p><p><b>1.  Free trade, in its true, complete, and intellectually coherent<br> form, is not limited to the free movement of goods, but includes the<br> free movement of capital and labor as well.</br></br></b> (The “invisible judicial line” doesn’t magically become visible when<br> because human bodies are involved.)</br></p><p><b>2.  The difference between domestic economies and the global<br> international economy is not trivial, but is substantive, material, and<br> based on significant genetic, cultural, traditional, and legal<br> differences between various self-identified peoples.</br></br></br></b></p><p>3.  Free trade is totally incompatible with national sovereignty,<br> democracy, and self-determination, as well as the existence of<br> independent nation-states with the right and ability to set their own<br> laws according to the preferences of their residents.</br></br></br></p><p>4.  Therefore, free trade must be opposed by every sovereign,<br> democratic, or self-determined people, be they American, Chinese,<br> German, or Zambian, who wish to preserve themselves as a free and<br> distinct nation possessed of its own culture, traditions, and laws.</br></br></br></p></div>",
  "content_text": "As I have repeatedly pointed out for several years, David Ricardo’s Law of Comparative Advantage has been shown to be based upon false assumptions. Now the mainstream economists\nare beginning to recognize this\n:\nDavid Ricardo’s Theory of Comparative Advantage has broken down after 200 years, or so I learned at the Lindau forum of Nobel laureates in Bavaria.\nThe theory published in 1817 has been a guiding principle of free trade, taken as a given by every student of economics in the modern era. It has served us well, but just as Newton’s theories ran into limits and were overtaken by Einstein’s relativity, comparative advantage no longer explains the world.\nUnder Ricardo’s model, inequality was supposed to narrow within countries as globalisation accelerated exponentially in the Nineties. Instead it is getting wider….\nRicardo described a world where free trade in goods was opening up, but\nlabour markets remained largely closed. This is no longer the case.\nGlobalisation bids up the wages of high-skilled engineers or software\nanalysts towards international levels wherever they live.\nThe Nobel laureates at Lindau aren’t willing to give up on globalization yet (although they should), but the cracks in the economic wall are showing as they express their fears that it is “going horribly wrong”. But it’s not going wrong. It’s going the only way it could possibly have gone.\nFree trade is incompatible with national sovereignty. International\nlabor mobility is incompatible with the very existence of nations. And the heterogeneous populations are economically detrimental and a material barrier to the growth of capital and national wealth. I shall repeat my core argument against free trade, which I first articulated\nin 2012\nfollowing a quasi-debate with Gary North:\n1.  Free trade, in its true, complete, and intellectually coherent\nform, is not limited to the free movement of goods, but includes the\nfree movement of capital and labor as well.\n(The “invisible judicial line” doesn’t magically become visible when\nbecause human bodies are involved.)\n2.  The difference between domestic economies and the global\ninternational economy is not trivial, but is substantive, material, and\nbased on significant genetic, cultural, traditional, and legal\ndifferences between various self-identified peoples.\n3.  Free trade is totally incompatible with national sovereignty,\ndemocracy, and self-determination, as well as the existence of\nindependent nation-states with the right and ability to set their own\nlaws according to the preferences of their residents.\n4.  Therefore, free trade must be opposed by every sovereign,\ndemocratic, or self-determined people, be they American, Chinese,\nGerman, or Zambian, who wish to preserve themselves as a free and\ndistinct nation possessed of its own culture, traditions, and laws.",
  "tags": [
    "economics",
    "free trade"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-23T07:23:00+00:00"
}