{
  "url": "https://voxday.net/2014/08/02/the-non-problem-of-pain/",
  "scraped_at": "2025-12-16T12:22:52.588919",
  "title": "The non-problem of pain",
  "date_display": "August 2, 2014",
  "date_iso": "2014-08-02T13:00:00+00:00",
  "date_from_url": "2014-08-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Gene Wolfe explains why the so-called “problem of pain” is simply not a credible argument for the non-existence or non-beneficence of God:<b> </b></p><blockquote class=\"tr_bq\"><p> <b>You once said that pain tends to prove God’s reality rather than the opposite; that pain was not a theological difficulty for you.</b></p><p>No, it isn’t. If you catch a dragonfly and bend the end of its body up, it will eat itself until it dies. When people have had their mouths numbed for dentistry, they must be warned not to chew their tongues. I think if we assume that pain is simply an evil we’re oversimplifying things.<b> </b></p><p><b>[Thinks a moment.] You’re saying that pain may be a necessary design feature that the Divine Engineer—</b></p><p>Yes, absolutely.<b> </b></p><p><b>—put into his animated machines.</b><br> <b> </b>If you had living things without pain, they would have a very rough time surviving.</br></p></blockquote><p>More than ten years ago, I pointed out a similar observation concerning the existence of evil, which, far from being any sort of theological problem, is in fact <a href=\"http://www.milobookclub.com/2004/02/29/problem-of-evi/\">evidence of the factual basis of Christian theology</a>. Wolfe is observing that pain has an important purpose in life, as it is there to provide negative feedback to self-destructive actions. This does not mean that pain is good per se, only that it provides a good purpose.</p><p>For those interested in discussing the literary aspects of Mr. Wolfe’s observations, some of the more interesting parts have been posted <a href=\"http://www.castaliahouse.com/interview-gene-wolfe/\">at Castalia House</a>, as well as a link to the full interview.</p></div>",
  "content_text": "Gene Wolfe explains why the so-called “problem of pain” is simply not a credible argument for the non-existence or non-beneficence of God:\nYou once said that pain tends to prove God’s reality rather than the opposite; that pain was not a theological difficulty for you.\nNo, it isn’t. If you catch a dragonfly and bend the end of its body up, it will eat itself until it dies. When people have had their mouths numbed for dentistry, they must be warned not to chew their tongues. I think if we assume that pain is simply an evil we’re oversimplifying things.\n[Thinks a moment.] You’re saying that pain may be a necessary design feature that the Divine Engineer—\nYes, absolutely.\n—put into his animated machines.\nIf you had living things without pain, they would have a very rough time surviving.\nMore than ten years ago, I pointed out a similar observation concerning the existence of evil, which, far from being any sort of theological problem, is in fact\nevidence of the factual basis of Christian theology\n. Wolfe is observing that pain has an important purpose in life, as it is there to provide negative feedback to self-destructive actions. This does not mean that pain is good per se, only that it provides a good purpose.\nFor those interested in discussing the literary aspects of Mr. Wolfe’s observations, some of the more interesting parts have been posted\nat Castalia House\n, as well as a link to the full interview.",
  "tags": [
    "philosophy",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-02T12:00:00+00:00"
}