{
  "url": "https://voxday.net/2014/08/22/the-cost-of-equality/",
  "scraped_at": "2025-12-16T12:25:05.036915",
  "title": "The terrible cost of equality",
  "date_display": "August 22, 2014",
  "date_iso": "2014-08-22T08:24:00+00:00",
  "date_from_url": "2014-08-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is becoming abundantly clear that immigration from outside Europe is not only dyscivic, but dysgenic as well. <a href=\"http://www.dailymail.co.uk/sciencetech/article-2730791/Are-STUPID-Britons-people-IQ-decline.html\">The Men of the West are becoming literally stupider</a> as a result of opening their nations to various orcs, trolls, and goblins combined with the widespread adoption of a feminist philosophy that significantly increases the probabilities that the West’s most intelligent women – and many of its most intelligent men – will never have children:</p><blockquote class=\"tr_bq\"><p> An IQ test used to determine whether Danish men are fit to serve in the military has revealed scores have fallen by 1.5 points since 1998. And standard tests issued in the UK and Australia echo the results, according to journalist Bob Holmes, writing in New Scientist.</p><p>Tests carried out in 1980 and in 2008 showed that the average 14-year-old was two IQ points cleverer in 1980, according to a study published in 2009. Scientists found that performance dropped the most dramatically in teenagers in the upper half of the intelligence scale, The Telegraph reported. Brighter teens who took part in the study in 2008 were on average six IQ points less intelligent than their counterparts tested 28 years earlier.</p><p>The most pessimistic explanation as to why humans seem to be becoming less intelligent is that we have effectively reached our intellectual peak….</p><p>Some have even contentiously said this could be because educated people are deciding to have fewer children, so that subsequent generations are largely made up of less intelligent people. Richard Lynn, a psychologist at the University of Ulster, calculated the decline in humans’ genetic potential. He used data on average IQs around the world in 1950 and 2000 to discover that our collective intelligence has dropped by one IQ point.</p><p><i>Westerns have lost 14 IQ points on average since the Victorian age, according to a study published by the University of Amsterdam last year. Jan te Nijenhuis thinks this could be because intelligent women tend to have less children than women who are not as clever, The Huffington Post reported. The perceived link between IQ and fertility is a very contentious one. Dr Nijenhuis studied the results of 14 intelligence studies conducted between 1884 and 2004 to come to his conclusion.</i><br> <i><br/></i><br> <i>Each study measured peoples’ reaction times – how long they took to press a button after being prompted. It is claimed that reaction time mirrors mental processing speed – so it reflects intelligence.They found that visual reaction times averaged 194 milliseconds in the late 19th Century, but in 2004, they had increased to 275 milliseconds….</i></br></br></p></blockquote><p>It’s amazing what equality-indoctrinated scientists are willing to throw out as hypotheses rather than even consider the totally obvious. It hardly seems likely that the intellectual peak of Man would roughly coincide with the release of “Please Hammer, Don’t Hurt ‘Em”, among other things.  Not convinced because you’re one of those geniuses who “doesn’t see race” (or more properly, doesn’t understand the consequences of genetic science) or “doesn’t believe in IQ” (or, more properly, didn’t score very high on intelligence tests)? Then it should be interesting to hear your explanation for the simultaneous rise in deformed penises in Sweden, which also began happening recently <a href=\"http://www.independent.co.uk/news/science/swedish-doctors-cannot-explain-rise-in-hypospadias-penis-birth-defect-9684241.html\">“for reasons unknown”</a>:</p><div class=\"widget storyContent article widget-editable viziwyg-section-1024 inpage-widget-8939454 articleContent\"><blockquote class=\"tr_bq\"><p> A condition which causes baby boys to be born with deformed penises<br> is becoming more common in Sweden, for reasons unknown to scientists. Researchers in Sweden assessed data collected on Hypospadias between<br> 1973 and 2009. They found that before 1990, only 4.5 boys out of every<br> thousand had the condition known as hypospadias. But after 1990, the<br> figure had risen to 8 per 1000 boys. In an attempt to explain the<br> rise, the experts from Stockholm’s Karolinksa Institute considered<br> factors known to cause the defect, including low-birth weight, being<br> born a twin, and parents who used IVF treatment to conceive. However,<br> scientists could not link the rise to any previously known causes, and<br> instead concluded that an unknown factor was behind the trend, <i>The Local </i>reported.</br></br></br></br></br></br></br></br></br></p></blockquote></div><p>Whatever might have happened after 1990 in Sweden that could possibly explain the increasing appearance of this birth defect at the same time average intelligences are decreasing and crime rates are rising? This “unknown factor” is a great mystery indeed. So congratulate yourself that you manage to avoid seeing race in the same way that Swedish scientists manage to avoid seeing basic cause and effect. Because, in a few dysgenic generations, your descendants won’t have any need to willfully ignore the readily apparent the way you do, they’ll be too stupid and deformed to see much of anything at all.</p><p>The costs of the fictitious progressive dogma of equality are real and material. Equality does not exist, it is not a positive ideal, and it must be rejected if Man is not going to continue his degradation into Orc. I don’t know Hebrew, but it strikes me that equalitarian dogma is the exact opposite of <i>tikkun olem</i>, the uplift of the world. Anti-nationalism is the degradation of Man. Equality is a lie. Even the historical icons of equality are lies. Consider the words and actual sentiments of The Great Emancipator, Abraham Lincoln:</p><p><i>“I will say then that I am not, nor ever have been in favor of bringing about in any way the social and political equality of the white and black races, that I am not nor ever have been in favor of making voters or jurors of Negroes, nor of qualifying them to hold office, nor to intermarry with white people; and I will say in addition to this that there is a physical difference between the white and black races which I believe will for ever forbid the two races living together on terms of social and political equality. And inasmuch as they cannot so live, while they do remain together there must be the position of superior and inferior, and I as much as any other man am in favor of having the superior position assigned to the white race.”</i></p><p>Was Lincoln correct about the prospects for social and political equality? 156 years later, consider the recent events in Ferguson, Missouri, and think about the gerrymandered political districts carved out on racial lines.<i> </i>Then tell us how many more years will be required to reach that nominal ideal.<i><br/></i></p></div>",
  "content_text": "It is becoming abundantly clear that immigration from outside Europe is not only dyscivic, but dysgenic as well.\nThe Men of the West are becoming literally stupider\nas a result of opening their nations to various orcs, trolls, and goblins combined with the widespread adoption of a feminist philosophy that significantly increases the probabilities that the West’s most intelligent women – and many of its most intelligent men – will never have children:\nAn IQ test used to determine whether Danish men are fit to serve in the military has revealed scores have fallen by 1.5 points since 1998. And standard tests issued in the UK and Australia echo the results, according to journalist Bob Holmes, writing in New Scientist.\nTests carried out in 1980 and in 2008 showed that the average 14-year-old was two IQ points cleverer in 1980, according to a study published in 2009. Scientists found that performance dropped the most dramatically in teenagers in the upper half of the intelligence scale, The Telegraph reported. Brighter teens who took part in the study in 2008 were on average six IQ points less intelligent than their counterparts tested 28 years earlier.\nThe most pessimistic explanation as to why humans seem to be becoming less intelligent is that we have effectively reached our intellectual peak….\nSome have even contentiously said this could be because educated people are deciding to have fewer children, so that subsequent generations are largely made up of less intelligent people. Richard Lynn, a psychologist at the University of Ulster, calculated the decline in humans’ genetic potential. He used data on average IQs around the world in 1950 and 2000 to discover that our collective intelligence has dropped by one IQ point.\nWesterns have lost 14 IQ points on average since the Victorian age, according to a study published by the University of Amsterdam last year. Jan te Nijenhuis thinks this could be because intelligent women tend to have less children than women who are not as clever, The Huffington Post reported. The perceived link between IQ and fertility is a very contentious one. Dr Nijenhuis studied the results of 14 intelligence studies conducted between 1884 and 2004 to come to his conclusion.\nEach study measured peoples’ reaction times – how long they took to press a button after being prompted. It is claimed that reaction time mirrors mental processing speed – so it reflects intelligence.They found that visual reaction times averaged 194 milliseconds in the late 19th Century, but in 2004, they had increased to 275 milliseconds….\nIt’s amazing what equality-indoctrinated scientists are willing to throw out as hypotheses rather than even consider the totally obvious. It hardly seems likely that the intellectual peak of Man would roughly coincide with the release of “Please Hammer, Don’t Hurt ‘Em”, among other things.  Not convinced because you’re one of those geniuses who “doesn’t see race” (or more properly, doesn’t understand the consequences of genetic science) or “doesn’t believe in IQ” (or, more properly, didn’t score very high on intelligence tests)? Then it should be interesting to hear your explanation for the simultaneous rise in deformed penises in Sweden, which also began happening recently\n“for reasons unknown”\n:\nA condition which causes baby boys to be born with deformed penises\nis becoming more common in Sweden, for reasons unknown to scientists. Researchers in Sweden assessed data collected on Hypospadias between\n1973 and 2009. They found that before 1990, only 4.5 boys out of every\nthousand had the condition known as hypospadias. But after 1990, the\nfigure had risen to 8 per 1000 boys. In an attempt to explain the\nrise, the experts from Stockholm’s Karolinksa Institute considered\nfactors known to cause the defect, including low-birth weight, being\nborn a twin, and parents who used IVF treatment to conceive. However,\nscientists could not link the rise to any previously known causes, and\ninstead concluded that an unknown factor was behind the trend,\nThe Local\nreported.\nWhatever might have happened after 1990 in Sweden that could possibly explain the increasing appearance of this birth defect at the same time average intelligences are decreasing and crime rates are rising? This “unknown factor” is a great mystery indeed. So congratulate yourself that you manage to avoid seeing race in the same way that Swedish scientists manage to avoid seeing basic cause and effect. Because, in a few dysgenic generations, your descendants won’t have any need to willfully ignore the readily apparent the way you do, they’ll be too stupid and deformed to see much of anything at all.\nThe costs of the fictitious progressive dogma of equality are real and material. Equality does not exist, it is not a positive ideal, and it must be rejected if Man is not going to continue his degradation into Orc. I don’t know Hebrew, but it strikes me that equalitarian dogma is the exact opposite of\ntikkun olem\n, the uplift of the world. Anti-nationalism is the degradation of Man. Equality is a lie. Even the historical icons of equality are lies. Consider the words and actual sentiments of The Great Emancipator, Abraham Lincoln:\n“I will say then that I am not, nor ever have been in favor of bringing about in any way the social and political equality of the white and black races, that I am not nor ever have been in favor of making voters or jurors of Negroes, nor of qualifying them to hold office, nor to intermarry with white people; and I will say in addition to this that there is a physical difference between the white and black races which I believe will for ever forbid the two races living together on terms of social and political equality. And inasmuch as they cannot so live, while they do remain together there must be the position of superior and inferior, and I as much as any other man am in favor of having the superior position assigned to the white race.”\nWas Lincoln correct about the prospects for social and political equality? 156 years later, consider the recent events in Ferguson, Missouri, and think about the gerrymandered political districts carved out on racial lines.\nThen tell us how many more years will be required to reach that nominal ideal.",
  "tags": [
    "decline and fall",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-22T07:24:00+00:00"
}