{
  "url": "https://voxday.net/2014/08/31/thoughts-on-russo-eu-war/",
  "scraped_at": "2025-12-16T12:26:08.175894",
  "title": "Thoughts on a Russo-EU war",
  "date_display": "August 31, 2014",
  "date_iso": "2014-08-31T08:43:00+00:00",
  "date_from_url": "2014-08-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The EU <a href=\"http://www.telegraph.co.uk/news/worldnews/europe/ukraine/11065657/European-leaders-warn-Russian-invasion-of-east-Ukraine-is-a-point-of-no-return.html\">is sounding increasingly panicked</a> over Russia’s refusal to back down and accept the EU-backed coup in Ukraine as a fait accompli:</p><blockquote class=\"tr_bq\"><p> EU leaders warned Russia’s invasion of east Ukraine was at a “point of no return”, risking a “state of war” with Europe and instructed officials to prepare new sanctions to hit the Russian economy. A summmit in Brussels on Saturday gave the green light to toughened economic sanctions, targeting Russia’s finances, oligarchs linked to the Russian president and the country’s vast mineral wealth.</p><p>Dalia Grybauskaite, Lithuania’s president and a staunch critic of Mr Putin’s Russia, called on the EU to get serious as Russia’s war in the Ukraine menaced peace in Europe for the first time in decades.</p><p>“Russia is in a state of war against Ukraine and that is against a country which wants to be part of Europe. Russia is practically in a state of war against Europe,” she said.</p><p>Jose Manuel Barroso, the European Commission president, said that the EU was prepared for new sanctions against and pleaded with Mr Putin to step back from the brink of outright war between Russia and the Ukraine….</p><p>European leaders will tell Mr Putin that unless he withdraws troops and pulls<br> back from “direct military confrontation between Ukrainian and Russian<br> military forces” that the EU will move to introduce new economic sanctions<br> over the coming weeks. European Union leaders instructed their officials on Saturday to prepare<br> urgently possible new sanctions against Russia over its involvement in<br> Ukraine, according to a draft statement seen by Reuters.</br></br></br></br></br></p></blockquote><p>Some more or less random thoughts on the situation.</p><ol><li>The “moral high ground” argument puts no pressure on Putin at all. It might sell in the American press, but everyone in Europe knows that the EU is considerably less democratic, more corrupt, and less concerned about its own people than Putin is about his Russian people. The EU, aided by American neocons, intervened in Ukraine first, staging a coup and installing a puppet government. It’s a clear-cut case of “the EU cries out in pain as it strikes you”. Russia is reacting defensively, not acting aggressively.</li><li>Russia has usually defeated the various European powers in war, both individually and in combination, since the dawn of the Napoleonic era. With the exception of the Crimean War, which only managed to delay Russia’s Black Sea ambitions for 15 years, Russia has defeated Turkey, defeated France, fought Germany to a standstill (WWI) and defeated Germany (WW2). The Russians have absolutely no fear of the other European nations.</li><li>Vladimir Putin is very conscious of war being ultimately economic in light of the Soviet defeat in the Cold War. I expect he is extremely conscious of the weak state of the Western economies and what that signifies concerning the USA’s ability to support EU efforts against Russia.</li><li>The entire Western economic system is based on credit. The rich and “successful” are, for the most part, nothing but parasites permitted to greatly profit at the expense of the people of everyone else by siphoning off money from the great circulatory river of credit. It’s a monetary form of feudalism, only instead of land rights, credit rights are granted. The very public attempt to hit at the Russian oligarchs and their offshore finances is really an appeal to Putin to simply knock it off, play along, and collect his billions like all the other credit lords.</li><li>An appeal to personal corruption is always going to fail with a man of principle. I don’t know Putin at all, and I am aware of the circumstances that saw him rise to power, but it increasingly appears that he may be a ruthless man of principle who truly loves the Rodina and despises the very oligarchs and credit lords with whom he was previously allied. Some people learn from their experiences. Some people change their priorities. If Putin is just another corrupt oligarch, he would accept the EU/USA deal, leave the ethnic Russians in Ukraine to their fate, and live the rest of his life in fabulous wealth. Perhaps he is simply holding out for a better offer, but I tend to doubt it.</li><li>Putin is not much worried about the U.S. military. He knows it is going to be fully occupied with the expansionary challenges posed by the Islamic State and China. Obama and whoever succeeds Obama will make noises about supporting the EU, but supporting a crumbling EU’s expansionary efforts against a major military power is simply not in the cards. And if the USA tries to aid the EU, Russia can easily return the favor ten-fold by aiding ISIS.</li><li>If the EU doesn’t back down and accept the Russian claim to whatever territory it deems appropriate (which, based on Putin’s use of the term Novorossiya, appears to be fairly clear), Putin will shock the world by taking the entire Ukraine and doing so in a matter of 2-3 weeks. At this point, the “threat” of being expelled from the global credit system is more of a solution than a problem, especially for a material-rich nation.</li></ol><p>It is a sign of how widely hated the EU and the global elite have become that so many Europeans and Americans are more or less on Russia’s side in this matter.</p></div>",
  "content_text": "The EU\nis sounding increasingly panicked\nover Russia’s refusal to back down and accept the EU-backed coup in Ukraine as a fait accompli:\nEU leaders warned Russia’s invasion of east Ukraine was at a “point of no return”, risking a “state of war” with Europe and instructed officials to prepare new sanctions to hit the Russian economy. A summmit in Brussels on Saturday gave the green light to toughened economic sanctions, targeting Russia’s finances, oligarchs linked to the Russian president and the country’s vast mineral wealth.\nDalia Grybauskaite, Lithuania’s president and a staunch critic of Mr Putin’s Russia, called on the EU to get serious as Russia’s war in the Ukraine menaced peace in Europe for the first time in decades.\n“Russia is in a state of war against Ukraine and that is against a country which wants to be part of Europe. Russia is practically in a state of war against Europe,” she said.\nJose Manuel Barroso, the European Commission president, said that the EU was prepared for new sanctions against and pleaded with Mr Putin to step back from the brink of outright war between Russia and the Ukraine….\nEuropean leaders will tell Mr Putin that unless he withdraws troops and pulls\nback from “direct military confrontation between Ukrainian and Russian\nmilitary forces” that the EU will move to introduce new economic sanctions\nover the coming weeks. European Union leaders instructed their officials on Saturday to prepare\nurgently possible new sanctions against Russia over its involvement in\nUkraine, according to a draft statement seen by Reuters.\nSome more or less random thoughts on the situation.\nThe “moral high ground” argument puts no pressure on Putin at all. It might sell in the American press, but everyone in Europe knows that the EU is considerably less democratic, more corrupt, and less concerned about its own people than Putin is about his Russian people. The EU, aided by American neocons, intervened in Ukraine first, staging a coup and installing a puppet government. It’s a clear-cut case of “the EU cries out in pain as it strikes you”. Russia is reacting defensively, not acting aggressively.\nRussia has usually defeated the various European powers in war, both individually and in combination, since the dawn of the Napoleonic era. With the exception of the Crimean War, which only managed to delay Russia’s Black Sea ambitions for 15 years, Russia has defeated Turkey, defeated France, fought Germany to a standstill (WWI) and defeated Germany (WW2). The Russians have absolutely no fear of the other European nations.\nVladimir Putin is very conscious of war being ultimately economic in light of the Soviet defeat in the Cold War. I expect he is extremely conscious of the weak state of the Western economies and what that signifies concerning the USA’s ability to support EU efforts against Russia.\nThe entire Western economic system is based on credit. The rich and “successful” are, for the most part, nothing but parasites permitted to greatly profit at the expense of the people of everyone else by siphoning off money from the great circulatory river of credit. It’s a monetary form of feudalism, only instead of land rights, credit rights are granted. The very public attempt to hit at the Russian oligarchs and their offshore finances is really an appeal to Putin to simply knock it off, play along, and collect his billions like all the other credit lords.\nAn appeal to personal corruption is always going to fail with a man of principle. I don’t know Putin at all, and I am aware of the circumstances that saw him rise to power, but it increasingly appears that he may be a ruthless man of principle who truly loves the Rodina and despises the very oligarchs and credit lords with whom he was previously allied. Some people learn from their experiences. Some people change their priorities. If Putin is just another corrupt oligarch, he would accept the EU/USA deal, leave the ethnic Russians in Ukraine to their fate, and live the rest of his life in fabulous wealth. Perhaps he is simply holding out for a better offer, but I tend to doubt it.\nPutin is not much worried about the U.S. military. He knows it is going to be fully occupied with the expansionary challenges posed by the Islamic State and China. Obama and whoever succeeds Obama will make noises about supporting the EU, but supporting a crumbling EU’s expansionary efforts against a major military power is simply not in the cards. And if the USA tries to aid the EU, Russia can easily return the favor ten-fold by aiding ISIS.\nIf the EU doesn’t back down and accept the Russian claim to whatever territory it deems appropriate (which, based on Putin’s use of the term Novorossiya, appears to be fairly clear), Putin will shock the world by taking the entire Ukraine and doing so in a matter of 2-3 weeks. At this point, the “threat” of being expelled from the global credit system is more of a solution than a problem, especially for a material-rich nation.\nIt is a sign of how widely hated the EU and the global elite have become that so many Europeans and Americans are more or less on Russia’s side in this matter.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-31T07:43:00+00:00"
}