{
  "url": "https://voxday.net/2014/08/24/trolls-are-not-proble/",
  "scraped_at": "2025-12-16T12:25:17.577167",
  "title": "Trolls are not a problem",
  "date_display": "August 24, 2014",
  "date_iso": "2014-08-24T09:11:00+00:00",
  "date_from_url": "2014-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I found no little amusement in <a href=\"http://www.nytimes.com/2014/08/24/sunday-review/dealing-with-digital-cruelty.html\">this article in the New York Times</a> about dealing with online trolls. It always surprises me when I learn that other bloggers are genuinely upset by the weird little creatures who occasionally infest their blogs:</p><blockquote class=\"tr_bq\"><p> ANYONE who has ever been online has witnessed, or been virtually walloped by, a mean comment. “If you’re going to be a blogger, if you’re going to tweet stuff, you better develop a tough skin,” said John Suler, a professor of psychology at Rider University who specializes in what he refers to as cyberpsychology. Some 69 percent of adult social media users said they “have seen people being mean and cruel to others on social network sites,” according to a 2011 report from the Pew Research Center’s Internet and American Life Project.</p><p>Posts run the gamut from barbs to sadistic antics by trolls who intentionally strive to distress or provoke. Last week, Zelda Williams, the daughter of Robin Williams, said she was going off Twitter, possibly for good, after brutal tweets by trolls about her father’s death. Yet comments do not even have to be that malevolent to be hurtful. The author Anne Rice signed a petition a few months ago asking Amazon.com to ban anonymous reviews after experiencing “personal insults and harassing posts,” as she put it on the site of the petition, Change.org. Whether you’re a celebrity author or a mom with a décor blog, you’re fair game. Anyone with a Twitter account and a mean streak can try to parachute into your psyche.</p><p>In the virtual world, anonymity and invisibility help us feel uninhibited. Some people are inspired to behave with greater kindness; others unleash their dark side. Trolls, who some researchers think could be mentally unbalanced, say the kinds of things that do not warrant deep introspection; their singular goal is to elicit pain.</p></blockquote><p>The singular goal of the troll is to elicit pain? I don’t think that is entirely correct, but that is certainly one reason why we haven’t seen all that much troll activity here despite the considerable growth of traffic here. With the exceptions of the homosexual Tad and the literary critic Andrew Marston (who doesn’t have a job per se, but volunteers regularly at <a href=\"http://wildlife-education-center.com/about-2/contact/\">the New England Wildlife Center</a> if you ever feel like giving him a call and discussing literature with him), most trolls have discovered that they can’t elicit anything more mild annoyance from me and thereby give up. Tad, Marston, Pox, and Obvious are a different variety, they are various forms of what might be described as the crusader-troll.</p><p>The crusader-troll attempts to DISQUALIFY DISQUALIFY the blogger by presenting alternate narratives to the blog readers. Hence we have Tad always trying to reframe the narrative with Vox as Pure Evil, Marston going to blogs far and wide to declare that Vox, Larry Correia, and Dan Simmons(?) are Terrible Writers, Pox/Ann openly trying to pick off readers in order to limit the extent of my baleful intellectual influence, and Obvious attempting to portray the mysterious “blogger” or “host” as Hypocritical, while the Scalzi fanboy Phoenician spent over a year attempting to show Vox as Inferior to the Object of Adoration. The fact that their disqualification attempts have obviously failed, as the blog traffic grew from 612,136 pageviews in August 2012 to over 1.5 million in August 2014 doesn’t ever seem to register with them. Perhaps they’re not trolling hard enough?</p><p>Of the crusading variety, I tend to find Marston the most amusing because I am aware I cause him far more pain than he causes me. (To say nothing of <a href=\"http://www.milobookclub.com/2013/04/01/nocturne-nove/\">his fascinating attempts at fantasy fiction</a> which are much more entertaining than all the 2014 Hugo winners combined. I even offered to publish <i>Nocturne</i>; it is guaranteed Hugo-Award winning material.) Every new Twitter follower I get, every additional 100k pageviews of traffic, and every new SF award for which I am nominated causes <i>him </i>pain. In fact, if he hadn’t gone on such an insane literary-snob rampage a while back and annoyed so many people, I very much doubt that Sad Puppies 2 would have been such a big success. Science fiction can thank Luscinia/Marston for the fact that Larry and I, among others, are bona-fide Hugo-nominated authors from now until the end of time. My author’s bio has been burnished thanks to the blog troll.</p><p>That, my friends, is what you call backfire. Well done, Andrew. But he will never learn because he is too neuro-atypical to grasp normal human psychology. He will continue to poke the bears because he has deemed the bears to be Evil, never understanding the wisdom implicit in the notion of letting sleeping grizzlies lie.</p><p>(That being said, it’s also amusing to me that my shadow troll, Ann Morgan aka Pox Vay, gets more traffic and comments than many blogs, and even has her own meta-troll, Obviously. This comment by her was downright funny too: <i>“I also confess to being immature in some ways, mainly I lack confidence,<br> patience, and sometimes have poor control over my temper.”</br></i> You don’t say.)</p><p>There will always be trolls. There are too many immature, attention-seeking, emotionally unstable individuals sans audiences for there not to be. But they are no reason for concern. Quite to the contrary, they are a material testament to the fact that you matter, that you are making a difference. I wouldn’t worry about trolls if I were the average blogger. I would worry more about having such a small audience, or so little of import to say, that the trolls feel no temptation to show up.</p></div>",
  "content_text": "I found no little amusement in\nthis article in the New York Times\nabout dealing with online trolls. It always surprises me when I learn that other bloggers are genuinely upset by the weird little creatures who occasionally infest their blogs:\nANYONE who has ever been online has witnessed, or been virtually walloped by, a mean comment. “If you’re going to be a blogger, if you’re going to tweet stuff, you better develop a tough skin,” said John Suler, a professor of psychology at Rider University who specializes in what he refers to as cyberpsychology. Some 69 percent of adult social media users said they “have seen people being mean and cruel to others on social network sites,” according to a 2011 report from the Pew Research Center’s Internet and American Life Project.\nPosts run the gamut from barbs to sadistic antics by trolls who intentionally strive to distress or provoke. Last week, Zelda Williams, the daughter of Robin Williams, said she was going off Twitter, possibly for good, after brutal tweets by trolls about her father’s death. Yet comments do not even have to be that malevolent to be hurtful. The author Anne Rice signed a petition a few months ago asking Amazon.com to ban anonymous reviews after experiencing “personal insults and harassing posts,” as she put it on the site of the petition, Change.org. Whether you’re a celebrity author or a mom with a décor blog, you’re fair game. Anyone with a Twitter account and a mean streak can try to parachute into your psyche.\nIn the virtual world, anonymity and invisibility help us feel uninhibited. Some people are inspired to behave with greater kindness; others unleash their dark side. Trolls, who some researchers think could be mentally unbalanced, say the kinds of things that do not warrant deep introspection; their singular goal is to elicit pain.\nThe singular goal of the troll is to elicit pain? I don’t think that is entirely correct, but that is certainly one reason why we haven’t seen all that much troll activity here despite the considerable growth of traffic here. With the exceptions of the homosexual Tad and the literary critic Andrew Marston (who doesn’t have a job per se, but volunteers regularly at\nthe New England Wildlife Center\nif you ever feel like giving him a call and discussing literature with him), most trolls have discovered that they can’t elicit anything more mild annoyance from me and thereby give up. Tad, Marston, Pox, and Obvious are a different variety, they are various forms of what might be described as the crusader-troll.\nThe crusader-troll attempts to DISQUALIFY DISQUALIFY the blogger by presenting alternate narratives to the blog readers. Hence we have Tad always trying to reframe the narrative with Vox as Pure Evil, Marston going to blogs far and wide to declare that Vox, Larry Correia, and Dan Simmons(?) are Terrible Writers, Pox/Ann openly trying to pick off readers in order to limit the extent of my baleful intellectual influence, and Obvious attempting to portray the mysterious “blogger” or “host” as Hypocritical, while the Scalzi fanboy Phoenician spent over a year attempting to show Vox as Inferior to the Object of Adoration. The fact that their disqualification attempts have obviously failed, as the blog traffic grew from 612,136 pageviews in August 2012 to over 1.5 million in August 2014 doesn’t ever seem to register with them. Perhaps they’re not trolling hard enough?\nOf the crusading variety, I tend to find Marston the most amusing because I am aware I cause him far more pain than he causes me. (To say nothing of\nhis fascinating attempts at fantasy fiction\nwhich are much more entertaining than all the 2014 Hugo winners combined. I even offered to publish\nNocturne\n; it is guaranteed Hugo-Award winning material.) Every new Twitter follower I get, every additional 100k pageviews of traffic, and every new SF award for which I am nominated causes\nhim\npain. In fact, if he hadn’t gone on such an insane literary-snob rampage a while back and annoyed so many people, I very much doubt that Sad Puppies 2 would have been such a big success. Science fiction can thank Luscinia/Marston for the fact that Larry and I, among others, are bona-fide Hugo-nominated authors from now until the end of time. My author’s bio has been burnished thanks to the blog troll.\nThat, my friends, is what you call backfire. Well done, Andrew. But he will never learn because he is too neuro-atypical to grasp normal human psychology. He will continue to poke the bears because he has deemed the bears to be Evil, never understanding the wisdom implicit in the notion of letting sleeping grizzlies lie.\n(That being said, it’s also amusing to me that my shadow troll, Ann Morgan aka Pox Vay, gets more traffic and comments than many blogs, and even has her own meta-troll, Obviously. This comment by her was downright funny too:\n“I also confess to being immature in some ways, mainly I lack confidence,\npatience, and sometimes have poor control over my temper.”\nYou don’t say.)\nThere will always be trolls. There are too many immature, attention-seeking, emotionally unstable individuals sans audiences for there not to be. But they are no reason for concern. Quite to the contrary, they are a material testament to the fact that you matter, that you are making a difference. I wouldn’t worry about trolls if I were the average blogger. I would worry more about having such a small audience, or so little of import to say, that the trolls feel no temptation to show up.",
  "tags": [
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-24T08:11:00+00:00"
}