{
  "url": "https://voxday.net/2014/08/22/two-tia-reviews/",
  "scraped_at": "2025-12-16T12:25:06.876321",
  "title": "Two TIA reviews",
  "date_display": "August 22, 2014",
  "date_iso": "2014-08-22T13:00:00+00:00",
  "date_from_url": "2014-08-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Because it has been a long time since The Irrational Atheist was published, because my refutation of the “religion causes war” argument has been widely accepted, and because Richard Dawkins has increasingly rendered himself a parody of his former public persona, it’s easy to forget that the core arguments remain timeless. Here are a pair of recent reviews of the book, the first by a Christian, the second by an atheist. If you haven’t read it yet, you might want to consider picking up a copy sometime.<b> </b></p><blockquote class=\"tr_bq\"><p> <b>Trench Warfare. Acerbic and Funny</b></p><p>I bought this the first time I saw it on a shelf in hardcover. I rarely ever buy books on impulse, but this was one of those times. It sat on my shelf for about six years, however. Finally, I had the time to delve into it. The Irrational Atheist is a direct response to “new” atheism that is unlike most other responses (most other significant responses being quite a bit more respectful than Day’s). If you enjoy reading about theological, moral and social issues AND sarcasm, well this book is for you.</p><p>Day focuses his arguments in the very thick of the new atheist’s claims. Christian apologists and philosophers have rarely taken these guys seriously, mostly because none of them (except Dennett) deserve to be taken seriously in the realm of philosophy. And while the response of the apologists has been necessary for the churches to hear, none have really focused on some of the “lower” issues. By this I mean issues such as whether or not atheism is gaining converts in the U. S., whether or not religion ‘causes’ war, whether atheists are smarter than non-atheists, whether religion stifles science, etc.</p><p>From knowing nothing of Vox Day other than what he has written in his book it’s very obvious that he’s an intelligent man. Imagine Dennis Miller writing a book in response to the new atheists and you will kind of get a glimpse at the wit and humor that comprise this work. These issues of history and social issues seem to be his strong point and he handles them with brilliance. The heart of the book includes detailed chapters into his personal beefs with each of these writers. My guess would be he has the least respect for Sam Harris and the most for Dennett, but Hitchens would be neck and neck with Harris.</p><p>The last few chapters discuss various other related issues: the Holocaust, Spanish Inquisition, Crusades, human sacrifice, atheism’s responsibility for the destruction of millions of lives, a chapter on some of the theological arguments used by these writers and an appendix of a discussion between the author and Socrates concerning the Euthyphro dilemma.</p><p>If this topic interests you I heartily recommend this be on your shelf. As I said, most Christian apologists or philosophers answer via way of philosophy or theological correction or biblical defenses, all of which are very important. Day prefers to get down in the trenches and battle them head-on, via some literary lex talionis. Not for the faint of heart.</p><p> <b>This atheist loves the book.  Logical refutations (finally!) of atheist talking points.</b></p><p>I am an atheist, and I really like this book. Vox Day’s style is a<br> direct and a refreshing relief from wheelbarrow loads of empty<br> platitudes. To summarize the book: “God loves you, but I don’t. Here’s why blindly following the high priests of atheism is stupid.”</br></br></p><p>The author says (paraphrasing, don’t remember exact phrasing): “This<br> book isn’t to convert you or argue in favor of God. I don’t care at all<br> if you believe or not. This book is to demolish the atheist arguments.”</br></br></p><p>Although<br> there is no chance I’m going to be converting to Catholicism, or any<br> other sky deity religions, I have to applaud the hard logical reasoning<br> and fresh insights as Vox takes a hammer to the arguments of Hitchens,<br> Dawkins &amp; Harris. It’s a refreshing change from all the arguments<br> that boil down to “God exists, therefore God exists”.</br></br></br></br></br></p></blockquote><p>That’s a fair summary. And before the Churchians leap in to wag their fingers, I will readily admit that my failure to love everyone is indicative of my imperfect Christianity. I’m also not particularly good on turning the other cheek, avoiding impure thoughts, and avoiding the use of rough language. But I fail to see that blatantly lying and erecting a false veneer of superficial spiritual perfection would be an improvement upon the open and honest expression of my thoughts and feelings on various matters.</p></div>",
  "content_text": "Because it has been a long time since The Irrational Atheist was published, because my refutation of the “religion causes war” argument has been widely accepted, and because Richard Dawkins has increasingly rendered himself a parody of his former public persona, it’s easy to forget that the core arguments remain timeless. Here are a pair of recent reviews of the book, the first by a Christian, the second by an atheist. If you haven’t read it yet, you might want to consider picking up a copy sometime.\nTrench Warfare. Acerbic and Funny\nI bought this the first time I saw it on a shelf in hardcover. I rarely ever buy books on impulse, but this was one of those times. It sat on my shelf for about six years, however. Finally, I had the time to delve into it. The Irrational Atheist is a direct response to “new” atheism that is unlike most other responses (most other significant responses being quite a bit more respectful than Day’s). If you enjoy reading about theological, moral and social issues AND sarcasm, well this book is for you.\nDay focuses his arguments in the very thick of the new atheist’s claims. Christian apologists and philosophers have rarely taken these guys seriously, mostly because none of them (except Dennett) deserve to be taken seriously in the realm of philosophy. And while the response of the apologists has been necessary for the churches to hear, none have really focused on some of the “lower” issues. By this I mean issues such as whether or not atheism is gaining converts in the U. S., whether or not religion ‘causes’ war, whether atheists are smarter than non-atheists, whether religion stifles science, etc.\nFrom knowing nothing of Vox Day other than what he has written in his book it’s very obvious that he’s an intelligent man. Imagine Dennis Miller writing a book in response to the new atheists and you will kind of get a glimpse at the wit and humor that comprise this work. These issues of history and social issues seem to be his strong point and he handles them with brilliance. The heart of the book includes detailed chapters into his personal beefs with each of these writers. My guess would be he has the least respect for Sam Harris and the most for Dennett, but Hitchens would be neck and neck with Harris.\nThe last few chapters discuss various other related issues: the Holocaust, Spanish Inquisition, Crusades, human sacrifice, atheism’s responsibility for the destruction of millions of lives, a chapter on some of the theological arguments used by these writers and an appendix of a discussion between the author and Socrates concerning the Euthyphro dilemma.\nIf this topic interests you I heartily recommend this be on your shelf. As I said, most Christian apologists or philosophers answer via way of philosophy or theological correction or biblical defenses, all of which are very important. Day prefers to get down in the trenches and battle them head-on, via some literary lex talionis. Not for the faint of heart.\nThis atheist loves the book.  Logical refutations (finally!) of atheist talking points.\nI am an atheist, and I really like this book. Vox Day’s style is a\ndirect and a refreshing relief from wheelbarrow loads of empty\nplatitudes. To summarize the book: “God loves you, but I don’t. Here’s why blindly following the high priests of atheism is stupid.”\nThe author says (paraphrasing, don’t remember exact phrasing): “This\nbook isn’t to convert you or argue in favor of God. I don’t care at all\nif you believe or not. This book is to demolish the atheist arguments.”\nAlthough\nthere is no chance I’m going to be converting to Catholicism, or any\nother sky deity religions, I have to applaud the hard logical reasoning\nand fresh insights as Vox takes a hammer to the arguments of Hitchens,\nDawkins & Harris. It’s a refreshing change from all the arguments\nthat boil down to “God exists, therefore God exists”.\nThat’s a fair summary. And before the Churchians leap in to wag their fingers, I will readily admit that my failure to love everyone is indicative of my imperfect Christianity. I’m also not particularly good on turning the other cheek, avoiding impure thoughts, and avoiding the use of rough language. But I fail to see that blatantly lying and erecting a false veneer of superficial spiritual perfection would be an improvement upon the open and honest expression of my thoughts and feelings on various matters.",
  "tags": [
    "atheism",
    "Christianity",
    "TIA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-22T12:00:00+00:00"
}