{
  "url": "https://voxday.net/2014/08/14/us-women-have-more-legal-rights-than-men/",
  "scraped_at": "2025-12-16T12:24:15.536123",
  "title": "US women have more legal rights than men",
  "date_display": "August 14, 2014",
  "date_iso": "2014-08-14T17:00:00+00:00",
  "date_from_url": "2014-08-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Judgy Bitch punctures an equality myth by simply <a href=\"http://thoughtcatalog.com/janet-bloomfield/2014/08/5-legal-rights-women-have-that-men-dont/\">referring to the law</a>:</p><blockquote class=\"tr_bq\"><p> I’ve had an opportunity lately to speak to a lot of feminists about why so many young women are rejecting feminism, and one theme that has come up repeatedly is that feminism is interested in equal rights for everyone. I have yet to meet a single feminist who was not completely astonished to discover that not only do women have equal rights to men, they actually have more rights than men. Most feminists will backpedal when confronted with that reality and try to justify why they are deserving of more rights than men, but the stark fact remains that in 2014, women do indeed have more rights than men. Here are five legally enshrined rights that women have and men do not:</p><p><b>1. Women have the right to genital integrity</b></p><p>Regardless of how you personally feel about the practice of circumcision (I personally find it barbaric, cruel and completely unjustifiable), the legal fact is that infant girls are protected against any genital cutting of any kind and infant boys are not.  Many feminists will argue that female genital mutilation (FGM) is a magnitude of brutality beyond male genital mutilation and while that may be true, I do not find the “it’s only a little bit brutal” argument to be very compelling. It’s like saying cutting off a toe is okay because cutting off a foot is much worse. Ultimately, the argument is immaterial to the fact that women have the legal right to be protected from having their body parts sliced off. Men do not</p></blockquote><p>She’s taking the same approach I did to proving that religion doesn’t cause war. The rhetorically minded think that by ceaselessly yapping and conjuring up spurious logics, they can prove the unprovable. They can’t. A little dialectic bomb always suffices to blow away the obscuring fortress of words that they’ve woven, and with which they’ve confused the less insightful. </p><p>The fact, the <i>undeniable </i>fact, is that if women wish to claim they support equality, they need to remove these legal rights granted to women and not granted to men. And there are considerably more. Just to give one more example, women are have the right of due process when accused of rape. Men on college campuses do not, a right that some young men are fighting for even now.</p><p>Judgy Bitch has demonstrated the facts. To be pro-equality, you <i>must </i>be anti-feminist, because feminism is observably anti-legal equality.</p></div>",
  "content_text": "Judgy Bitch punctures an equality myth by simply\nreferring to the law\n:\nI’ve had an opportunity lately to speak to a lot of feminists about why so many young women are rejecting feminism, and one theme that has come up repeatedly is that feminism is interested in equal rights for everyone. I have yet to meet a single feminist who was not completely astonished to discover that not only do women have equal rights to men, they actually have more rights than men. Most feminists will backpedal when confronted with that reality and try to justify why they are deserving of more rights than men, but the stark fact remains that in 2014, women do indeed have more rights than men. Here are five legally enshrined rights that women have and men do not:\n1. Women have the right to genital integrity\nRegardless of how you personally feel about the practice of circumcision (I personally find it barbaric, cruel and completely unjustifiable), the legal fact is that infant girls are protected against any genital cutting of any kind and infant boys are not.  Many feminists will argue that female genital mutilation (FGM) is a magnitude of brutality beyond male genital mutilation and while that may be true, I do not find the “it’s only a little bit brutal” argument to be very compelling. It’s like saying cutting off a toe is okay because cutting off a foot is much worse. Ultimately, the argument is immaterial to the fact that women have the legal right to be protected from having their body parts sliced off. Men do not\nShe’s taking the same approach I did to proving that religion doesn’t cause war. The rhetorically minded think that by ceaselessly yapping and conjuring up spurious logics, they can prove the unprovable. They can’t. A little dialectic bomb always suffices to blow away the obscuring fortress of words that they’ve woven, and with which they’ve confused the less insightful.\nThe fact, the\nundeniable\nfact, is that if women wish to claim they support equality, they need to remove these legal rights granted to women and not granted to men. And there are considerably more. Just to give one more example, women are have the right of due process when accused of rape. Men on college campuses do not, a right that some young men are fighting for even now.\nJudgy Bitch has demonstrated the facts. To be pro-equality, you\nmust\nbe anti-feminist, because feminism is observably anti-legal equality.",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-14T16:00:00+00:00"
}