{
  "url": "https://voxday.net/2014/08/25/vaccine-fraud-at-cdc/",
  "scraped_at": "2025-12-16T12:25:22.328733",
  "title": "Vaccine fraud at the CDC?",
  "date_display": "August 25, 2014",
  "date_iso": "2014-08-25T08:48:00+00:00",
  "date_from_url": "2014-08-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Despite the vaccine makers thinking they had put the Wakefield controversy safely behind them, another researcher <a href=\"http://www.translationalneurodegeneration.com/content/3/1/16\">has uncovered an apparent link</a> between the MMR vaccine and autism, and from the CDC’s own data:</p><blockquote class=\"tr_bq\"><p> <b>Background</b><br> A significant number of children diagnosed with autism spectrum disorder suffer a loss of previously-acquired skills, suggesting neurodegeneration or a type of progressive encephalopathy with an etiological basis occurring after birth. The purpose of this study is to investigate the effectof the age at which children got their first Measles-Mumps-Rubella (MMR) vaccine on autism incidence. This is a reanalysis of the data set, obtained from the U.S. Centers for Disease Control and Protection (CDC), used for the Destefano et al. 2004 publication on the timing of the first MMR vaccine and autism diagnoses.</br></p><p><b>Methods</b><br> The author embarked on the present study to evaluate whether a relationship exists between child age when the first MMR vaccine was administered among cases diagnosed with autism and controls born between 1986 through 1993 among school children in metropolitan Atlanta. The Pearson’s chi-squared method was used to assess relative risks of receiving an autism diagnosis within the total cohort as well as among different race and gender categories.</br></p><p><b>Results</b><br> When comparing cases and controls receiving their first MMR vaccine before and after 36 months of age, there was a statistically significant increase in autism cases specifically among African American males who received the first MMR prior to 36 months of age. Relative risks for males in general and African American males were 1.69 (p=0.0138) and 3.36 (p=0.0019), respectively. Additionally, African American males showed an odds ratio of 1.73 (p=0.0200) for autism cases in children receiving their first MMR vaccine prior to 24 months of age versus 24 months of age and thereafter.</br></p></blockquote><p>The troubling thing here is that the author of the paper, “Measles-mumps-rubella vaccination timing and autism among young african american boys: a reanalysis of CDC data” reached his conclusions by examining CDC data that reached the opposite conclusion and served as the basis for a CDC doctor’s testimony before Congress. <a href=\"http://www.lewrockwell.com/2014/08/bill-sardi/blowing-the-lid-off-the-vaccine-fraud/\">Bill Sardi writes on Lew Rockwell</a>:</p><blockquote class=\"tr_bq\"><p> There is evidence of an intentional cover-up as it is alleged that data<br> from children who did not have birth certificates (not a pertinent<br> factor) was removed from the study to reduce the statistical power of<br> the study and claim there was no significant association between autism<br> and the MMR vaccine…. Dr. Hooker notes that the CDC used children under the age of 3 for a<br> comparison (control) group, which is an intentional way of skewing<br> results of its studies involving any alleged link between vaccines and<br> autism.  Symptoms of autism generally don’t emanate among children till<br> after age 3 and the control group was too young to have received a<br> diagnosis of autism, he notes.</br></br></br></br></br></br></br></br></br></p></blockquote><p>Not only does this “reanalysis of CDC data” reopen the possible MMR-autism link, but it calls into question the integrity of the entire field of vaccine research. If Hooker is correct and CDC doctors such as Dr. Colleen Boyle have engaged in vaccine fraud, it will entirely explode the basic assumption that vaccines are safe because it will render all of the CDC’s data and assurances suspect.</p></div>",
  "content_text": "Despite the vaccine makers thinking they had put the Wakefield controversy safely behind them, another researcher\nhas uncovered an apparent link\nbetween the MMR vaccine and autism, and from the CDC’s own data:\nBackground\nA significant number of children diagnosed with autism spectrum disorder suffer a loss of previously-acquired skills, suggesting neurodegeneration or a type of progressive encephalopathy with an etiological basis occurring after birth. The purpose of this study is to investigate the effectof the age at which children got their first Measles-Mumps-Rubella (MMR) vaccine on autism incidence. This is a reanalysis of the data set, obtained from the U.S. Centers for Disease Control and Protection (CDC), used for the Destefano et al. 2004 publication on the timing of the first MMR vaccine and autism diagnoses.\nMethods\nThe author embarked on the present study to evaluate whether a relationship exists between child age when the first MMR vaccine was administered among cases diagnosed with autism and controls born between 1986 through 1993 among school children in metropolitan Atlanta. The Pearson’s chi-squared method was used to assess relative risks of receiving an autism diagnosis within the total cohort as well as among different race and gender categories.\nResults\nWhen comparing cases and controls receiving their first MMR vaccine before and after 36 months of age, there was a statistically significant increase in autism cases specifically among African American males who received the first MMR prior to 36 months of age. Relative risks for males in general and African American males were 1.69 (p=0.0138) and 3.36 (p=0.0019), respectively. Additionally, African American males showed an odds ratio of 1.73 (p=0.0200) for autism cases in children receiving their first MMR vaccine prior to 24 months of age versus 24 months of age and thereafter.\nThe troubling thing here is that the author of the paper, “Measles-mumps-rubella vaccination timing and autism among young african american boys: a reanalysis of CDC data” reached his conclusions by examining CDC data that reached the opposite conclusion and served as the basis for a CDC doctor’s testimony before Congress.\nBill Sardi writes on Lew Rockwell\n:\nThere is evidence of an intentional cover-up as it is alleged that data\nfrom children who did not have birth certificates (not a pertinent\nfactor) was removed from the study to reduce the statistical power of\nthe study and claim there was no significant association between autism\nand the MMR vaccine…. Dr. Hooker notes that the CDC used children under the age of 3 for a\ncomparison (control) group, which is an intentional way of skewing\nresults of its studies involving any alleged link between vaccines and\nautism.  Symptoms of autism generally don’t emanate among children till\nafter age 3 and the control group was too young to have received a\ndiagnosis of autism, he notes.\nNot only does this “reanalysis of CDC data” reopen the possible MMR-autism link, but it calls into question the integrity of the entire field of vaccine research. If Hooker is correct and CDC doctors such as Dr. Colleen Boyle have engaged in vaccine fraud, it will entirely explode the basic assumption that vaccines are safe because it will render all of the CDC’s data and assurances suspect.",
  "tags": [
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-25T07:48:00+00:00"
}