{
  "url": "https://voxday.net/2014/08/15/weve-been-warning-you/",
  "scraped_at": "2025-12-16T12:24:24.341774",
  "title": "We’ve been warning you",
  "date_display": "August 15, 2014",
  "date_iso": "2014-08-15T19:00:00+00:00",
  "date_from_url": "2014-08-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>esr <a href=\"http://esr.ibiblio.org/?p=6160\">points out the obvious</a>. Twice.</p><blockquote class=\"tr_bq\"><p> I join my voice to those of Rand Paul and other prominent libertarians who are reacting to the violence in Ferguson, Mo. by calling for the demilitarization of the U.S.’s police. Beyond question, the local civil police in the U.S. are too heavily armed and in many places have developed an adversarial attitude towards the civilians they serve, one that makes police overreactions and civil violence almost inevitable.</p><p>But I publish this blog in part because I think it is my duty to speak taboo and unspeakable truths. And there’s another injustice being done here: the specific assumption, common among civil libertarians, that police overreactions are being driven by institutional racism. I believe this is dangerously untrue and actually impedes effective thinking about how to prevent future outrages.</p><p>In the Kivila language of the Trobriand Islands there is a lovely word,<br> “mokita”, which means “truth we all know but agree not to talk about”.  I<br> am about to speak some mokitas.</br></br></p></blockquote><p>First, it’s ridiculous that some liberals have been feigning to be ignorant of libertarians protesting the militiarization of the badge gang. Radley Balko has singlehandedly led the charge against it, and been backed up by Glenn Reynolds’s campaign to advocate the legal right of the citizenry to film the police. There are scores of posts dating back years right here on this blog under the tag <a href=\"http://voxday.blogspot.com/search/label/NWA%20was%20right\">NWA was right</a>. It’s the Left that has been silently approving of the growing police state, not the libertarian Right. I don’t need to add my voice to esr’s and Rand Paul’s because it has been there all along. Demilitarize the police and do it now!</p><p>Second, the Left simply has to deal with racial reality. In the USA, crime is a predominantly black problem. Not because they’re poor, not because the Man is keeping them down, not because of slavery, but because blacks are, on average, less intelligent, possess shorter time preferences, and are much more likely to have a genetic predisposition towards aggressive behavior than the rest of the population. Those are three facts that have been repeatedly substantiated by science and there is literally nothing to discuss about them except for the consequences. Nor are they any more in doubt or racist than the statement that young men between the ages of 15 and 30 commit more crime than old women between the ages of 65 and 80 is sexist or ageist.</p><p>Third, I endorse Instapundit’s suggestion: <i>“A simple rule would be to provide that police can have only weapons that<br> a civilian could lawfully possess, since they’re civilians themselves.”</br></i></p></div>",
  "content_text": "esr\npoints out the obvious\n. Twice.\nI join my voice to those of Rand Paul and other prominent libertarians who are reacting to the violence in Ferguson, Mo. by calling for the demilitarization of the U.S.’s police. Beyond question, the local civil police in the U.S. are too heavily armed and in many places have developed an adversarial attitude towards the civilians they serve, one that makes police overreactions and civil violence almost inevitable.\nBut I publish this blog in part because I think it is my duty to speak taboo and unspeakable truths. And there’s another injustice being done here: the specific assumption, common among civil libertarians, that police overreactions are being driven by institutional racism. I believe this is dangerously untrue and actually impedes effective thinking about how to prevent future outrages.\nIn the Kivila language of the Trobriand Islands there is a lovely word,\n“mokita”, which means “truth we all know but agree not to talk about”.  I\nam about to speak some mokitas.\nFirst, it’s ridiculous that some liberals have been feigning to be ignorant of libertarians protesting the militiarization of the badge gang. Radley Balko has singlehandedly led the charge against it, and been backed up by Glenn Reynolds’s campaign to advocate the legal right of the citizenry to film the police. There are scores of posts dating back years right here on this blog under the tag\nNWA was right\n. It’s the Left that has been silently approving of the growing police state, not the libertarian Right. I don’t need to add my voice to esr’s and Rand Paul’s because it has been there all along. Demilitarize the police and do it now!\nSecond, the Left simply has to deal with racial reality. In the USA, crime is a predominantly black problem. Not because they’re poor, not because the Man is keeping them down, not because of slavery, but because blacks are, on average, less intelligent, possess shorter time preferences, and are much more likely to have a genetic predisposition towards aggressive behavior than the rest of the population. Those are three facts that have been repeatedly substantiated by science and there is literally nothing to discuss about them except for the consequences. Nor are they any more in doubt or racist than the statement that young men between the ages of 15 and 30 commit more crime than old women between the ages of 65 and 80 is sexist or ageist.\nThird, I endorse Instapundit’s suggestion:\n“A simple rule would be to provide that police can have only weapons that\na civilian could lawfully possess, since they’re civilians themselves.”",
  "tags": [
    "NWA was right",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-08-15T18:00:00+00:00"
}