{
  "url": "https://voxday.net/2014/03/07/a-model-comparison/",
  "scraped_at": "2025-12-15T16:48:25.978449",
  "title": "A model comparison",
  "date_display": "March 7, 2014",
  "date_iso": "2014-03-07T10:49:00+00:00",
  "date_from_url": "2014-03-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.milobookclub.com/2014/02/26/rules-of-writing-viii-maintain-viability/\">A few weeks ago</a>, I pointed out how the former president of the SFWA declared that no-advance deals were “wrong”, “a Shitty Deal”, and possibly “worse than no deal at all”. Other traditionally published writers have even described them as “unethical”.  The former president also asserted: “Advances are typically all authors make from a book.” This is important to keep in mind when one considers what SFWA presently considers to be a professional payment as per its membership requirements.</p><ol><li>Word rate: $0.05 per word, increasing to $0.06 later this year</li><li>One Paid Sale of a prose fiction book for which the author has been paid $2000 or more.</li></ol><p>As it happens, Castalia House had just released two books, one by Mr. Kratman and one by me, which allows us to compare the real world results of the traditional professional model and the no-advance model which various authors have criticized so vociferously. Mr. Kratman has generously permitted us to use his book as a general example. Let’s look at the word rate model first.</p><p>1) At 20,000 words, <a href=\"http://www.amazon.com/dp/B00IKT7HQI\"><b><i>Big Boys Don’t Cry</i></b></a> would have commanded a flat-fee payment of $1,000.00.  Depending upon the publisher and<i><b> </b></i>the publication, Mr. Kratman would have received the payment between two and eight weeks from the time he delivered the manuscript. He delivered the manuscript on February 21st, so he would have received $1,000 sometime between 1 March and 12 April. He would not have received anything more than that.</p><p>2) If he received an advance of $2,500, that would have been against a royalty of 25 percent. He would have received $1,250 about a month after signing, then another $1,250 sometime between 21 March and 21 November 21. (Having been signed to Pocket Books, I am well aware that the check is seldom delivered promptly upon delivery and approval of the manuscript.) This is actually a conservative estimate, as increasingly payments are being divided into three parts, signing, delivery, and publication.</p><p>The performance of Mr. Kratman’s book is spelled out in comparison to the traditional model <a href=\"http://www.castaliahouse.com/the-no-advance-model/\">on the Castalia House blog</a>. Due to the speed with which Castalia publishes and pays royalties, Mr. Kratman can expect to receive his first payment by 18 March, 23 days after publication. And he can also reasonably expect to receive more than $2,500 in royalties several weeks BEFORE he would have been likely to receive the second part of a theoretical “advance payment”. Moreover, once the $2,500 figure has been surpassed, he will continue receiving TWICE the royalties he would have under the traditional model.</p><p>Now, publishers are not stupid. They will not continue to publish authors who regularly underperform their advances. So, logic dictates that the only advantage of advance payments is to provide a small measure of very short-term security to authors who are unsure of their ability to sell their books and are willing to give away half their future earnings in exchange for that security. Nor have book advances been the historical norm, as the New York Times <a href=\"http://www.nytimes.com/2009/04/12/books/review/Meyer-t.html\">noted in 2009</a>.</p><p><i>“In the old days,” the novelist Henry Bech, John Updike’s fictional alter ego, once said, “a respectable author never asked for an advance; that was strictly for the no-talents starving down in the Village.”</i></p><p>Both math and history make it obvious. Advances are for no-talents and the no-advance model is materially beneficial to the author. So, if you are an talented author who is confident in his ability to sell books and therefore interested in working with Castalia, have a look at our <a href=\"http://www.castaliahouse.com/ch-page/submissions/concepts/\">Concepts page</a>, as there are certain books we would like to publish that none of our current authors are writing.</p><p>UPDATE: Since we have had a few inquiries, please note the following submission requirements for Concept-based submissions: <i>“While we normally require completed drafts for submissions, in the case<br> of Castalia Concept-based submissions, we are willing to review<br> five-chapter novel submissions so long as they are accompanied by a<br> complete and detailed outline of the book or series. Novella submissions should still consist<br> of complete drafts.”</br></br></br></br></i></p></div>",
  "content_text": "A few weeks ago\n, I pointed out how the former president of the SFWA declared that no-advance deals were “wrong”, “a Shitty Deal”, and possibly “worse than no deal at all”. Other traditionally published writers have even described them as “unethical”.  The former president also asserted: “Advances are typically all authors make from a book.” This is important to keep in mind when one considers what SFWA presently considers to be a professional payment as per its membership requirements.\nWord rate: $0.05 per word, increasing to $0.06 later this year\nOne Paid Sale of a prose fiction book for which the author has been paid $2000 or more.\nAs it happens, Castalia House had just released two books, one by Mr. Kratman and one by me, which allows us to compare the real world results of the traditional professional model and the no-advance model which various authors have criticized so vociferously. Mr. Kratman has generously permitted us to use his book as a general example. Let’s look at the word rate model first.\n1) At 20,000 words,\nBig Boys Don’t Cry\nwould have commanded a flat-fee payment of $1,000.00.  Depending upon the publisher and\nthe publication, Mr. Kratman would have received the payment between two and eight weeks from the time he delivered the manuscript. He delivered the manuscript on February 21st, so he would have received $1,000 sometime between 1 March and 12 April. He would not have received anything more than that.\n2) If he received an advance of $2,500, that would have been against a royalty of 25 percent. He would have received $1,250 about a month after signing, then another $1,250 sometime between 21 March and 21 November 21. (Having been signed to Pocket Books, I am well aware that the check is seldom delivered promptly upon delivery and approval of the manuscript.) This is actually a conservative estimate, as increasingly payments are being divided into three parts, signing, delivery, and publication.\nThe performance of Mr. Kratman’s book is spelled out in comparison to the traditional model\non the Castalia House blog\n. Due to the speed with which Castalia publishes and pays royalties, Mr. Kratman can expect to receive his first payment by 18 March, 23 days after publication. And he can also reasonably expect to receive more than $2,500 in royalties several weeks BEFORE he would have been likely to receive the second part of a theoretical “advance payment”. Moreover, once the $2,500 figure has been surpassed, he will continue receiving TWICE the royalties he would have under the traditional model.\nNow, publishers are not stupid. They will not continue to publish authors who regularly underperform their advances. So, logic dictates that the only advantage of advance payments is to provide a small measure of very short-term security to authors who are unsure of their ability to sell their books and are willing to give away half their future earnings in exchange for that security. Nor have book advances been the historical norm, as the New York Times\nnoted in 2009\n.\n“In the old days,” the novelist Henry Bech, John Updike’s fictional alter ego, once said, “a respectable author never asked for an advance; that was strictly for the no-talents starving down in the Village.”\nBoth math and history make it obvious. Advances are for no-talents and the no-advance model is materially beneficial to the author. So, if you are an talented author who is confident in his ability to sell books and therefore interested in working with Castalia, have a look at our\nConcepts page\n, as there are certain books we would like to publish that none of our current authors are writing.\nUPDATE: Since we have had a few inquiries, please note the following submission requirements for Concept-based submissions:\n“While we normally require completed drafts for submissions, in the case\nof Castalia Concept-based submissions, we are willing to review\nfive-chapter novel submissions so long as they are accompanied by a\ncomplete and detailed outline of the book or series. Novella submissions should still consist\nof complete drafts.”",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-07T10:49:00+00:00"
}