{
  "url": "https://voxday.net/2014/03/03/a-prescient-parable/",
  "scraped_at": "2025-12-15T16:48:02.756586",
  "title": "A prescient parable",
  "date_display": "March 3, 2014",
  "date_iso": "2014-03-03T18:00:00+00:00",
  "date_from_url": "2014-03-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am presently reading John C. Wright’s <i>The Golden Age</i>, and all I can say is that <i>Publisher’s Weekly’s</i> praise of him was neither unmerited nor exaggerated. This part leaped out at me in particular as an unconscious, but apt parable of what we are presently seeing in the world of SF/F:</p><blockquote class=\"tr_bq\"><p> Back when there was only the White Manorial School and the Black, Hyacinth and I combined forces to create a compromise school, taking the best from both doctrines, the artistic appeal of the Black Mansions and the intellectualism and discipline of the Whites. He provided the inspiration and logic; I provided funds and determination. The mind-swap gave us each the strengths and virtues of the other. Together, we converted the skeptics and conquered a million markets. “But then when the year and a day had passed, we both claimed my property and estates. After all, both of us remembered doing the two hundred years of hard work which had gone into earning it. To settle the quarrel, we both agreed to abide by whatever the Hortators might decide.”</p><p>“You had the College of Hortators way back then when you were young?” Helion squinted with impatient humor. “Yes. It was after the invention of fire but before that newfangled wheel contraption. I should tell you about when we domesticated the dog, put a man on the moon, and solved the universal field theorem. Should I continue? I’m trying to make a point.”</p><p>“Sorry, sir. Please continue.”</p><p>“When the Hortators declared him to be the copy, he refused to accept it. He entered a dreamscape simulation that allowed him to pretend he had won the case. He rewrote his memory, and ordered his sense-filter to edit out any contrary evidence. He continued to live as Helion Prime. He did thought-for-hire and data patterning, and was able to sell his routines out in the real world. He made enough to pay for his dreamspace rental. That worked for a while. But when self-patterning overroutines became standard, his subscriptions ran out, and he was kicked out into the real world.</p><p>“But it did not end there. If the Sophotechs had only allowed someone to erase just the sections of his memory when he thought he was me, he would have been his old self, awake, oriented and sane, in a moment or two. But the Sophotechs said it could not be done without his permission. But how could he give his permission? He would not listen to anyone who tried to tell him who he was.</p><p>“Instead, he sued me again, and accused me of stealing his life. He lost again. He could not afford enough to hire a Sophotech to give him job-seeking advice, and he could not find other work. The other Hyacinthines, Quintine and Quatrine and Sistine, gave him some charity for a while, but he just spent it again to buy false memories. Eventually, to save on money, he sold his body, and downloaded entirely into a slow-process, low-rent section of the Mentality. Of course, illusions are easier for pure minds to buy, because there is no wire-to-nerve transition.”</p><p>“Wouldn’t that also have made it easier for him to find work? Pure minds can go anywhere the mentality network reaches.”<br> “But he didn’t find new work. He merely created the illusion that he was working. He wrote himself false memories telling himself that he was making enough to live on.”</br></p><p>Helion stared at the ground for a moment, brooding. He spoke softly. “Then he sold his extra lives, one after another. All seven. A Noumenal backup takes up a lot of expensive computer time.</p><p>“Then he sold his structure models. He probably figured that he did not need an imitation of a thalamus or hypothalamus any longer, since he had no glands and no dreams, probably did not need a structure to mimic the actions of pain and pleasure centers, parasympathetic reactions, sexual responses, and so on.</p><p>“Then, to save space, he began selling memory and intelligence. Every time I came on-line to speak with him, he was stupider; he had forgotten more. But he still kept altering his simulation, making himself forget that either he or anyone else had ever been smarter than the slow-witted brute he was now.”</p><p>Phaethon asked, “Father? You still went to see him … ?”</p><p>Helion wore as stern a look as Phaethon had ever seen on his face. “Of course. He was my best friend.”</p><p>“What happened.? I assume he … Did he die?”</p><p>“It dragged on and on. Toward the end, both he and the world he had made were colorless cartoons, flat, jerky, and slow. He had been so brilliant once, so high-hearted and fine. Now he was not able even to concentrate long enough to follow a simple multistructural logic-tree when I tried to reason with him. And I tried.</p><p>“But he kept telling himself that I was the one who was hallucinating, me, not him, and the reason why he could not understand me was that his thoughts were on so much higher a plane than mine. And whom else could he ask? All the black-and-white puppets he had made around him nodded and agreed with him; he had forgotten there was an outside world.</p><p>“I was there when it happened. He became more and more intermittent, and fell below threshold levels. One moment he was a living soul, closer to me than a brother. The next, he was a recording.</p><p>“Even at the end, at the very last moment, he did not know he was about to die. He still thought that he was Helion, healthy, wealthy, well-loved Helion. All the evidences of his sense, all his memories, told him how fortunate and happy his life was. He was not hungry, not in pain. How could he know or guess he was about to die? All our attempts to tell him so were blocked by his sense-filter….”</p><p>Helion’s face was gray with grief.</p></blockquote><p>Well, perhaps not so much on the grief part. But the slow and gradual degradation of their fictional worlds to “colorless cartoons, flat, jerky, and slow” could not be more on target if he’d written it for critical purposes.</p><p>The Golden Age is excellent. Not good. Not good fun. It is excellent, and perhaps even better, far from predictable.</p></div>",
  "content_text": "I am presently reading John C. Wright’s\nThe Golden Age\n, and all I can say is that\nPublisher’s Weekly’s\npraise of him was neither unmerited nor exaggerated. This part leaped out at me in particular as an unconscious, but apt parable of what we are presently seeing in the world of SF/F:\nBack when there was only the White Manorial School and the Black, Hyacinth and I combined forces to create a compromise school, taking the best from both doctrines, the artistic appeal of the Black Mansions and the intellectualism and discipline of the Whites. He provided the inspiration and logic; I provided funds and determination. The mind-swap gave us each the strengths and virtues of the other. Together, we converted the skeptics and conquered a million markets. “But then when the year and a day had passed, we both claimed my property and estates. After all, both of us remembered doing the two hundred years of hard work which had gone into earning it. To settle the quarrel, we both agreed to abide by whatever the Hortators might decide.”\n“You had the College of Hortators way back then when you were young?” Helion squinted with impatient humor. “Yes. It was after the invention of fire but before that newfangled wheel contraption. I should tell you about when we domesticated the dog, put a man on the moon, and solved the universal field theorem. Should I continue? I’m trying to make a point.”\n“Sorry, sir. Please continue.”\n“When the Hortators declared him to be the copy, he refused to accept it. He entered a dreamscape simulation that allowed him to pretend he had won the case. He rewrote his memory, and ordered his sense-filter to edit out any contrary evidence. He continued to live as Helion Prime. He did thought-for-hire and data patterning, and was able to sell his routines out in the real world. He made enough to pay for his dreamspace rental. That worked for a while. But when self-patterning overroutines became standard, his subscriptions ran out, and he was kicked out into the real world.\n“But it did not end there. If the Sophotechs had only allowed someone to erase just the sections of his memory when he thought he was me, he would have been his old self, awake, oriented and sane, in a moment or two. But the Sophotechs said it could not be done without his permission. But how could he give his permission? He would not listen to anyone who tried to tell him who he was.\n“Instead, he sued me again, and accused me of stealing his life. He lost again. He could not afford enough to hire a Sophotech to give him job-seeking advice, and he could not find other work. The other Hyacinthines, Quintine and Quatrine and Sistine, gave him some charity for a while, but he just spent it again to buy false memories. Eventually, to save on money, he sold his body, and downloaded entirely into a slow-process, low-rent section of the Mentality. Of course, illusions are easier for pure minds to buy, because there is no wire-to-nerve transition.”\n“Wouldn’t that also have made it easier for him to find work? Pure minds can go anywhere the mentality network reaches.”\n“But he didn’t find new work. He merely created the illusion that he was working. He wrote himself false memories telling himself that he was making enough to live on.”\nHelion stared at the ground for a moment, brooding. He spoke softly. “Then he sold his extra lives, one after another. All seven. A Noumenal backup takes up a lot of expensive computer time.\n“Then he sold his structure models. He probably figured that he did not need an imitation of a thalamus or hypothalamus any longer, since he had no glands and no dreams, probably did not need a structure to mimic the actions of pain and pleasure centers, parasympathetic reactions, sexual responses, and so on.\n“Then, to save space, he began selling memory and intelligence. Every time I came on-line to speak with him, he was stupider; he had forgotten more. But he still kept altering his simulation, making himself forget that either he or anyone else had ever been smarter than the slow-witted brute he was now.”\nPhaethon asked, “Father? You still went to see him … ?”\nHelion wore as stern a look as Phaethon had ever seen on his face. “Of course. He was my best friend.”\n“What happened.? I assume he … Did he die?”\n“It dragged on and on. Toward the end, both he and the world he had made were colorless cartoons, flat, jerky, and slow. He had been so brilliant once, so high-hearted and fine. Now he was not able even to concentrate long enough to follow a simple multistructural logic-tree when I tried to reason with him. And I tried.\n“But he kept telling himself that I was the one who was hallucinating, me, not him, and the reason why he could not understand me was that his thoughts were on so much higher a plane than mine. And whom else could he ask? All the black-and-white puppets he had made around him nodded and agreed with him; he had forgotten there was an outside world.\n“I was there when it happened. He became more and more intermittent, and fell below threshold levels. One moment he was a living soul, closer to me than a brother. The next, he was a recording.\n“Even at the end, at the very last moment, he did not know he was about to die. He still thought that he was Helion, healthy, wealthy, well-loved Helion. All the evidences of his sense, all his memories, told him how fortunate and happy his life was. He was not hungry, not in pain. How could he know or guess he was about to die? All our attempts to tell him so were blocked by his sense-filter….”\nHelion’s face was gray with grief.\nWell, perhaps not so much on the grief part. But the slow and gradual degradation of their fictional worlds to “colorless cartoons, flat, jerky, and slow” could not be more on target if he’d written it for critical purposes.\nThe Golden Age is excellent. Not good. Not good fun. It is excellent, and perhaps even better, far from predictable.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-03T18:00:00+00:00"
}