{
  "url": "https://voxday.net/2014/03/10/awake-in-night-lands/",
  "scraped_at": "2025-12-15T16:48:45.908233",
  "title": "AWAKE IN THE NIGHT LAND",
  "date_display": "March 10, 2014",
  "date_iso": "2014-03-10T13:00:00+00:00",
  "date_from_url": "2014-03-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Castalia had already announced that we would be publishing John C. Wright’s collection of essays, <i>TRANSHUMAN AND SUBHUMAN: Essays on Science Fiction and Awful Truth</i>, which will be published in April. Today we are absolutely delighted to be able to say that we will also be publishing <i>AWAKE IN THE NIGHT LAND</i>, a collection of four novellas set in the Night Land of William Hope Hodgson.</p><p><i>AWAKE IN THE NIGHT LAND</i> is the first of five novels and novellas written by Mr. Wright to be published by Castalia House. It clocks in at 116,500 words and will be priced at $4.99. We will release the English ebook later this month; the German translation is already underway with an anticipated July release. We also expect to publish a hardcover version this summer.</p><p>Apologies to those waiting for <i>THE ALTAR OF HATE</i>, but we are delaying it until April in favor of Mr. Wright’s book. It will be sent to the pre-release reviewers in a few weeks.</p><p>Speaking as a reader and as a fan, I can say that the Night Land novellas are spectacular. They combine the intelligence and gigantic scale of Iain M. Banks with the eldritch forboding of H.P. Lovecraft, but with a humane soul that is alien to either of the two late authors.</p></div>",
  "content_text": "Castalia had already announced that we would be publishing John C. Wright’s collection of essays,\nTRANSHUMAN AND SUBHUMAN: Essays on Science Fiction and Awful Truth\n, which will be published in April. Today we are absolutely delighted to be able to say that we will also be publishing\nAWAKE IN THE NIGHT LAND\n, a collection of four novellas set in the Night Land of William Hope Hodgson.\nAWAKE IN THE NIGHT LAND\nis the first of five novels and novellas written by Mr. Wright to be published by Castalia House. It clocks in at 116,500 words and will be priced at $4.99. We will release the English ebook later this month; the German translation is already underway with an anticipated July release. We also expect to publish a hardcover version this summer.\nApologies to those waiting for\nTHE ALTAR OF HATE\n, but we are delaying it until April in favor of Mr. Wright’s book. It will be sent to the pre-release reviewers in a few weeks.\nSpeaking as a reader and as a fan, I can say that the Night Land novellas are spectacular. They combine the intelligence and gigantic scale of Iain M. Banks with the eldritch forboding of H.P. Lovecraft, but with a humane soul that is alien to either of the two late authors.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-10T13:00:00+00:00"
}