{
  "url": "https://voxday.net/2014/03/22/britains-big-mistake/",
  "scraped_at": "2025-12-15T16:50:27.005507",
  "title": "Britain’s big mistake",
  "date_display": "March 22, 2014",
  "date_iso": "2014-03-22T17:40:00+00:00",
  "date_from_url": "2014-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> It’s hard to argue that the Maastricht Treaty wasn’t a blunder of historic proportions. The only question is whether England will have to fight its way out of  the Eurofascist empire:</p><blockquote class=\"tr_bq\"><p> What is Sir Peter, married to his second wife, Gabrielle Mahieu, for 40 years,<br> most proud of? ”<a href=\"http://www.telegraph.co.uk/news/politics/conservative/10714396/Sir-Peter-Tapsell-My-biggest-mistake-in-politics-was-to-listen-to-Mrs-Thatcher.html\">My opposition to the Maastricht Treaty</a>. Because everything<br> that has gone wrong in Britain dates from us joining the European Union. One<br> of the reasons the House of Commons has lost its prestige is because people<br> feel we are no longer in charge of a country. So much of the legislation<br> that affects them is imposed by Brussels.’’ He is in favour of leaving the<br> European Union. ”If we had a referendum and the country votes to stay in<br> then we’re finished as a country because we will just be gobbled up into the<br> German Empire.’’</br></br></br></br></br></br></br></br></p></blockquote><p>Using banks instead of tanks is arguably more civilized, but the end result is the same: conquest.</p></div>",
  "content_text": "It’s hard to argue that the Maastricht Treaty wasn’t a blunder of historic proportions. The only question is whether England will have to fight its way out of  the Eurofascist empire:\nWhat is Sir Peter, married to his second wife, Gabrielle Mahieu, for 40 years,\nmost proud of? ”\nMy opposition to the Maastricht Treaty\n. Because everything\nthat has gone wrong in Britain dates from us joining the European Union. One\nof the reasons the House of Commons has lost its prestige is because people\nfeel we are no longer in charge of a country. So much of the legislation\nthat affects them is imposed by Brussels.’’ He is in favour of leaving the\nEuropean Union. ”If we had a referendum and the country votes to stay in\nthen we’re finished as a country because we will just be gobbled up into the\nGerman Empire.’’\nUsing banks instead of tanks is arguably more civilized, but the end result is the same: conquest.",
  "tags": [
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-22T17:40:00+00:00"
}