{
  "url": "https://voxday.net/2014/03/04/ch-requests_4/",
  "scraped_at": "2025-12-15T16:48:06.109043",
  "title": "CH requests",
  "date_display": "March 4, 2014",
  "date_iso": "2014-03-04T14:00:00+00:00",
  "date_from_url": "2014-03-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Three things. First of all, <strike>I’d like to find ten volunteers</strike> who would like to review my forthcoming short story collection: <i>The Altar of Hate</i>. It’s a 40k-word collection that consists of 10 shorts, including stories from the old EW site, the two stories published in <i>Stupefying Stories</i>,<br> and a new story that is a Maupassant-flavored one set in the QM universe. The collection will be published<br> later this month. If interested, email me with ALTAR in the subject. [We have the 10 volunteers, thanks.]</br></br></p><p><strike>Second,<br> and more important, I’d like to hear from five homeschooling mothers<br> who would be willing to beta test our forthcoming Astronomy curricula.</br></br></strike> [We’re good on the beta testers too, thanks to all who volunteered. Expect the files in about a month or so.] We<br> sent it to one Very Important homeschooling figure, who informed us that<br> we had “put together a top-notch astronomy curriculum”, liked how we<br> “start out with the basics like algebra and metrics”, and recommended<br> that we “emphasize the large amount of hands-on lab work” involved.</br></br></br></br></p><p>We<br> also have other curricula in the works, including Newtonian Physics and<br> Economics. We hope to publish two of them before the start of school<br> this fall, but we will definitely get the Astronomy curriculum out this summer,<br> so keep it in mind as you are putting together your plans for the next<br> school year. We plan to price the curricula at $49.99 in ebook form. If<br> you’re interested, please email me with ASTRONOMY in the subject.</br></br></br></br></br></br></p><p>And<br> finally, there are no shortage of History curricula available, but <strike>I’d like to find someone with either a PhD in a relevant subject or<br> O5+ rank</br></strike> to help me put together a high-quality Military History<br> curriculum. [And we’re good here too, thank you.]</br></br></p></div>",
  "content_text": "Three things. First of all,\nI’d like to find ten volunteers\nwho would like to review my forthcoming short story collection:\nThe Altar of Hate\n. It’s a 40k-word collection that consists of 10 shorts, including stories from the old EW site, the two stories published in\nStupefying Stories\n,\nand a new story that is a Maupassant-flavored one set in the QM universe. The collection will be published\nlater this month. If interested, email me with ALTAR in the subject. [We have the 10 volunteers, thanks.]\nSecond,\nand more important, I’d like to hear from five homeschooling mothers\nwho would be willing to beta test our forthcoming Astronomy curricula.\n[We’re good on the beta testers too, thanks to all who volunteered. Expect the files in about a month or so.] We\nsent it to one Very Important homeschooling figure, who informed us that\nwe had “put together a top-notch astronomy curriculum”, liked how we\n“start out with the basics like algebra and metrics”, and recommended\nthat we “emphasize the large amount of hands-on lab work” involved.\nWe\nalso have other curricula in the works, including Newtonian Physics and\nEconomics. We hope to publish two of them before the start of school\nthis fall, but we will definitely get the Astronomy curriculum out this summer,\nso keep it in mind as you are putting together your plans for the next\nschool year. We plan to price the curricula at $49.99 in ebook form. If\nyou’re interested, please email me with ASTRONOMY in the subject.\nAnd\nfinally, there are no shortage of History curricula available, but\nI’d like to find someone with either a PhD in a relevant subject or\nO5+ rank\nto help me put together a high-quality Military History\ncurriculum. [And we’re good here too, thank you.]",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-04T14:00:00+00:00"
}