{
  "url": "https://voxday.net/2014/03/02/charles-stross-on-hugos-debacle/",
  "scraped_at": "2025-12-15T16:47:55.746424",
  "title": "SF Fandom is “cleaning house”",
  "date_display": "March 2, 2014",
  "date_iso": "2014-03-02T15:30:00+00:00",
  "date_from_url": "2014-03-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s a pity to see that someone who writes pretty good neo-Lovecraftian pastiches, who wrote the brilliant <i>Accelerando</i>, should nevertheless <a href=\"http://www.antipope.org/charlie/blog-static/2014/03/the-latest-hugo-awards-storm.html\">show himself to be so deeply and profoundly absurd</a> with regards to politics, public relations, and simple civility:</p><blockquote class=\"tr_bq\"><p> So today Loncon 3 announced that Jonathan Ross would be toastmaster at the Hugo awards this August in London. And lo, twitter melted down in outrage for some reason.</p><p>I agree with Farah Mendlesohn (who resigned from the committee over this choice) that he’s a very bad choice for Hugo toastmaster.</p><p>My reasons for thinking this differ slightly from hers.</p><p>Regardless of Mr. Ross’s personality and track record, it is clearly the case that he has a history of scrapping with tabloid journalists, then being quoted out of context.</p><p>The problem I see is that <b>while fandom is in the process of cleaning house</b>, inviting him — or anyone with a controversial media profile — to be Hugo toastmaster is like rolling out a welcome mat at the Worldcon front door that says “muck-rakers welcome”. There’s a lot of muck to be raked, even before we get into Daily Mail photographers stalking cosplayers: just look at the recent SFWA fracas (plural), the Jim Frenkel/harassment scandal at Tor, and so on.</p><p>Worldcon should be safe space for fans, and inviting a high profile media personality who has been targeted by the tabloids is going to cause collateral damage, even if nothing happens, simply by making many fans feel less safe.</p><p>We’re seeing a huge explosion of anxiety on twitter right now. If Ross is toastmaster, I can predict that at least one major Hugo nominee/past winner who was planning to be there won’t be present at the ceremony, because Ross has past form for using women with weight issues as the butt of his humour. She says she doesn’t feel safe, and I believe her: I wouldn’t want to be there in her shoes (and I’m an ancient has-been who hasn’t been on the shortlist for a couple of years, now, so I’m unlikely to be in the front row). I don’t like seeing my friends mocked, so I probably won’t be there either. And this is regardless of whether the mockery would come from the toastmaster, or the tabloid journalists in the back of the audience.</p><p>The sad fact is, however well-behaved Mr. Ross is on the day, inviting him into a pulpit that has been misused in the past is sending a really bad signal. (And anyway, what happened to our community’s supposed newfound commitment to diversity? Isn’t it about time we had a toastmaster who wasn’t a white privileged male? Someone like, say, Jane Goldman?)</p></blockquote><p>The amusing thing is that even AFTER the debacle was concluded and Ross declined the invitation, Stross believes it was good to have hounded him from the event:</p><blockquote class=\"tr_bq\"><p> <i>His appointment was probably a bad move, but the way he was hounded out was, in my opinion, much worse.</i></p><p>Would you rather the Hugo ceremony went ahead with a toastmaster trailed by tabloid journalists looking for scandal, with half the nominees missing (either because they were afraid of the toastmaster, or out of solidarity with those who were afraid, or out of fear of the tabloid press), under a cloud of ill-tempered back-biting about privilege and contempt for minorities?</p><p>It’s better to get it out of the way right now, the same day that the bad decision was made public, than to wait.</p></blockquote><p>Keep in mind that Johnathan Ross’s politics are much closer to theirs than to mine, but that didn’t prevent them from chasing him out too.  It’s no wonder most of these creepy little people live hand-to-mouth, afraid to leave their safe spaces. They are literally too stupid and frightened to go out and make a living among normal people. In the end, it’s Us vs Them. K-selection vs r-selection. Fit vs fat. The sane population vs fandom.</p><p>If you have to ask, then yeah, you’re probably on the list to be ideologically cleansed too.</p><p>So be it. I went to one SF convention once, back in 1996. Needless to say, once was more than enough. One fan came up after a panel and told me I didn’t look like an SF writer. After glancing looking around, I couldn’t disagree with him. I had to resist the urge to ask him: “why, because I’m healthy?”</p><p>Speaking of the Hugo Awards: <i>Warbound </i>for Best Novel!</p></div>",
  "content_text": "It’s a pity to see that someone who writes pretty good neo-Lovecraftian pastiches, who wrote the brilliant\nAccelerando\n, should nevertheless\nshow himself to be so deeply and profoundly absurd\nwith regards to politics, public relations, and simple civility:\nSo today Loncon 3 announced that Jonathan Ross would be toastmaster at the Hugo awards this August in London. And lo, twitter melted down in outrage for some reason.\nI agree with Farah Mendlesohn (who resigned from the committee over this choice) that he’s a very bad choice for Hugo toastmaster.\nMy reasons for thinking this differ slightly from hers.\nRegardless of Mr. Ross’s personality and track record, it is clearly the case that he has a history of scrapping with tabloid journalists, then being quoted out of context.\nThe problem I see is that\nwhile fandom is in the process of cleaning house\n, inviting him — or anyone with a controversial media profile — to be Hugo toastmaster is like rolling out a welcome mat at the Worldcon front door that says “muck-rakers welcome”. There’s a lot of muck to be raked, even before we get into Daily Mail photographers stalking cosplayers: just look at the recent SFWA fracas (plural), the Jim Frenkel/harassment scandal at Tor, and so on.\nWorldcon should be safe space for fans, and inviting a high profile media personality who has been targeted by the tabloids is going to cause collateral damage, even if nothing happens, simply by making many fans feel less safe.\nWe’re seeing a huge explosion of anxiety on twitter right now. If Ross is toastmaster, I can predict that at least one major Hugo nominee/past winner who was planning to be there won’t be present at the ceremony, because Ross has past form for using women with weight issues as the butt of his humour. She says she doesn’t feel safe, and I believe her: I wouldn’t want to be there in her shoes (and I’m an ancient has-been who hasn’t been on the shortlist for a couple of years, now, so I’m unlikely to be in the front row). I don’t like seeing my friends mocked, so I probably won’t be there either. And this is regardless of whether the mockery would come from the toastmaster, or the tabloid journalists in the back of the audience.\nThe sad fact is, however well-behaved Mr. Ross is on the day, inviting him into a pulpit that has been misused in the past is sending a really bad signal. (And anyway, what happened to our community’s supposed newfound commitment to diversity? Isn’t it about time we had a toastmaster who wasn’t a white privileged male? Someone like, say, Jane Goldman?)\nThe amusing thing is that even AFTER the debacle was concluded and Ross declined the invitation, Stross believes it was good to have hounded him from the event:\nHis appointment was probably a bad move, but the way he was hounded out was, in my opinion, much worse.\nWould you rather the Hugo ceremony went ahead with a toastmaster trailed by tabloid journalists looking for scandal, with half the nominees missing (either because they were afraid of the toastmaster, or out of solidarity with those who were afraid, or out of fear of the tabloid press), under a cloud of ill-tempered back-biting about privilege and contempt for minorities?\nIt’s better to get it out of the way right now, the same day that the bad decision was made public, than to wait.\nKeep in mind that Johnathan Ross’s politics are much closer to theirs than to mine, but that didn’t prevent them from chasing him out too.  It’s no wonder most of these creepy little people live hand-to-mouth, afraid to leave their safe spaces. They are literally too stupid and frightened to go out and make a living among normal people. In the end, it’s Us vs Them. K-selection vs r-selection. Fit vs fat. The sane population vs fandom.\nIf you have to ask, then yeah, you’re probably on the list to be ideologically cleansed too.\nSo be it. I went to one SF convention once, back in 1996. Needless to say, once was more than enough. One fan came up after a panel and told me I didn’t look like an SF writer. After glancing looking around, I couldn’t disagree with him. I had to resist the urge to ask him: “why, because I’m healthy?”\nSpeaking of the Hugo Awards:\nWarbound\nfor Best Novel!",
  "tags": [
    "rabbitology",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-02T15:30:00+00:00"
}