{
  "url": "https://voxday.net/2014/03/15/civilizational-collapse-may-be-in-cards/",
  "scraped_at": "2025-12-15T16:49:13.424087",
  "title": "Civilizational collapse may be in the cards",
  "date_display": "March 15, 2014",
  "date_iso": "2014-03-15T20:57:00+00:00",
  "date_from_url": "2014-03-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>According to <a href=\"http://www.theguardian.com/environment/earth-insight/2014/mar/14/nasa-civilisation-irreversible-collapse-study-scientists\">a NASA-sponsored study</a>, anyhow:</p><blockquote class=\"tr_bq\"><p> A new study sponsored by Nasa’s Goddard Space Flight Center has<br> highlighted the prospect that global industrial civilisation could<br> collapse in coming decades due to unsustainable resource exploitation<br> and increasingly unequal wealth distribution.</br></br></br></p><p>Noting that<br> warnings of ‘collapse’ are often seen to be fringe or controversial, the<br> study attempts to make sense of compelling historical data showing that<br> “the process of rise-and-collapse is actually a recurrent cycle found<br> throughout history.” Cases of severe civilisational disruption due to<br> “precipitous collapse – often lasting centuries – have been quite<br> common.”</br></br></br></br></br></br></p><p>By investigating the human-nature dynamics of these past cases of collapse, the project identifies the most salient interrelated factors which explain civilisational decline, and which may help determine the risk of collapse today: namely, Population, Climate, Water, Agriculture, and Energy.</p><p>These<br> factors can lead to collapse when they converge to generate two crucial<br> social features: “the stretching of resources due to the strain placed<br> on the ecological carrying capacity”; and “the economic stratification<br> of society into Elites [rich] and Masses (or “Commoners”) [poor]” These<br> social phenomena have played “a central role in the character or in the<br> process of the collapse,” in all such cases over “the last five thousand<br> years.”</br></br></br></br></br></br></br></p></blockquote><p>Well, people can’t say they weren’t amply warned by a broad spectrum of observers. I’ve been saying SOCIETAL collapse is inevitable for years now, but I was hoping that Western civilization might hang on with the turn of the tide against multiculturalism and mass immigration.</p><p>The problem is that a decade-long period of depression and ethnic cleansing is increasingly beginning to look like the rosy scenario rather than the worst case one.</p></div>",
  "content_text": "According to\na NASA-sponsored study\n, anyhow:\nA new study sponsored by Nasa’s Goddard Space Flight Center has\nhighlighted the prospect that global industrial civilisation could\ncollapse in coming decades due to unsustainable resource exploitation\nand increasingly unequal wealth distribution.\nNoting that\nwarnings of ‘collapse’ are often seen to be fringe or controversial, the\nstudy attempts to make sense of compelling historical data showing that\n“the process of rise-and-collapse is actually a recurrent cycle found\nthroughout history.” Cases of severe civilisational disruption due to\n“precipitous collapse – often lasting centuries – have been quite\ncommon.”\nBy investigating the human-nature dynamics of these past cases of collapse, the project identifies the most salient interrelated factors which explain civilisational decline, and which may help determine the risk of collapse today: namely, Population, Climate, Water, Agriculture, and Energy.\nThese\nfactors can lead to collapse when they converge to generate two crucial\nsocial features: “the stretching of resources due to the strain placed\non the ecological carrying capacity”; and “the economic stratification\nof society into Elites [rich] and Masses (or “Commoners”) [poor]” These\nsocial phenomena have played “a central role in the character or in the\nprocess of the collapse,” in all such cases over “the last five thousand\nyears.”\nWell, people can’t say they weren’t amply warned by a broad spectrum of observers. I’ve been saying SOCIETAL collapse is inevitable for years now, but I was hoping that Western civilization might hang on with the turn of the tide against multiculturalism and mass immigration.\nThe problem is that a decade-long period of depression and ethnic cleansing is increasingly beginning to look like the rosy scenario rather than the worst case one.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-15T20:57:00+00:00"
}