{
  "url": "https://voxday.net/2014/03/23/combative-and-confrontationa/",
  "scraped_at": "2025-12-15T16:50:30.700080",
  "title": "Combative and confrontational",
  "date_display": "March 23, 2014",
  "date_iso": "2014-03-23T13:00:00+00:00",
  "date_from_url": "2014-03-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since we are all about the evidence here at VP, be it scientific, documentary, or testimonial, here is a documented example of the sort of thing that a certain Baen author pointed out a certain Tor author is prone to overlooking on the part of the Tor editors when he is busy on pinkshirt patrol policing the behavior of other SF/F publishers.</p><p>The Baen author wrote: <i>“Scalzi’s editor Patrick Nielsen-Hayden has been a rather routine and<br> divisive voice on his Making Light blog for many years now.  Often<br> combative, often confrontational.  Both he and his wife.  How much<br> division have the Nielsen-Hayden duo sown?  How much has their invective<br> and their involvement in various controversies helped to put up walls<br> in fandom?  Has Scalzi ever once called either of them out for it?”</br></br></br></br></br></i></p><p>Then someone sent me<i> </i><a href=\"http://www.freezepage.com/1232982493SXILEBRINI\">this little rant</a>, courtesy of Teresa Neobatrachia Hayden, as she threatened those who dared to criticize her husband, the self-declared racist, <a href=\"http://seeking-avalon.blogspot.com/2009/01/timeline.html?showComment=1233270180000#c5724448489116809651\">Patrick Nielsen Hayden</a>:</p><blockquote class=\"tr_bq\"><p> There’s been a big LJ thrash recently, one of those maelstroms of online<br> stupidity that take on a life of their own. All kinds of good people<br> got trashed, starting with Elizabeth Bear. Patrick got involved when he<br> posted some consoling remarks to Lisa Spangenberg. In the course of<br> those remarks, he observed that (1) some people are stupid; and (2)<br> some people don’t argue as well as others. The mob took this personally,<br> and lit into him.</br></br></br></br></br></br></p><p>What would you expect from a group that’s<br> self-selected for agreement with the statement, “I’m stupid, and I don’t<br> argue well”? Things got extremely ugly.</br></br></p><p>I wonder whether any of<br> those draggletailed loudmouths have noticed that Patrick has now deleted<br> his entire Live Journal, all the way back to the beginning. I doubt<br> they have. They don’t strike me as the sort to go back and see the<br> damage they’ve done. Patrick has as usual taken them seriously; whereas<br> they, knowing themselves better than he does, will have known they<br> weren’t worth listening to, and assumed they’d had no effect.</br></br></br></br></br></br></p><p>I<br> tender them my congratulations. Whatever good there was in Patrick’s LJ<br> is gone now. Those members of the mob who actually wanted someone to<br> listen to them now have one less person to do it. The junior literary<br> critics and wanna-be writers have lost one of the central editors in<br> science fiction from their conversation. And if any of that lot<br> professes to care about Patrick personally — please understand I’m not<br> rating that probability very high at the moment — it should be obvious<br> to them what kind of effect they’ve had.</br></br></br></br></br></br></br></br></p><p>I know Patrick better<br> than anyone else. This is serious damage. The nithings who’ve hurt him<br> will have moved on to some other inane topic by now. There’s nothing<br> worthwhile I can do to them. It wouldn’t take away his hurt — and<br> besides, they wouldn’t understand most of what I had to say to them.</br></br></br></br></p><p>One<br> other issue: when Patrick and I first registered our Live Journal<br> accounts, it never occurred to us to use anything other than our real<br> names — or rather, our real initials, which are easily traced to us,<br> and which we’ve used as userIDs in other forums where our identities are<br> or were known. Has it not occurred to the people attacking him that<br> they can say anything, whereas what they say about him will show up<br> whenever someone Googles his name? In terms of public reputation,<br> they’re playing with Monopoly money, and he’s playing with the real<br> thing.</br></br></br></br></br></br></br></br></br></p><p>Some of the people who are using false names are known to<br> him. Some of them are known to or evident to me. In those cases, I’ve<br> told Patrick who they really are. It’s only fair. Just on the other side<br> of the boundary for people whose identities he can figure out are<br> people whom he can almost figure out: this one is a VP student. This one<br> is someone he knows at conventions. This one is a reviewer he’s had<br> dealings with. And so forth.</br></br></br></br></br></br></p><p>Do any of those safely pseudonymous assholes ever stop to reflect that if he can tell they’re a former VP student, <i>but not which one,</i><br> all former VP students become “people who may be traducing me on LJ at<br> this very moment”? The same thing goes for people he knows from<br> conventions, or wanna-be writers who might submit something to him.<br> Entire classes of people become potential attackers. That’s why I<br> identify everyone I can: it exculpates everyone else in that class.</br></br></br></br></br></p><p>Those<br> of you I can’t identify are not off the hook. I suggest that you never<br> seek to take credit under your real name for anything you’ve done or<br> written under your LJ pseudonym, because it’s unlikely that I will ever<br> forget you or what you’ve done.</br></br></br></br></p></blockquote><p>Did Toni Weisskopf ever threaten anyone in the industry or publicly question the extent of their sexual experience? Alternatively, did Mr. Scalzi ever wax outraged and hold <i>his very own editor </i>to public account? Meanwhile, the overweight amphibian croaks about hurt… what about the terrible pain her husband inflicted on us People of Color? What about the FeelBad he has caused us? What about the way our tender feelings are bruised, even years later, by Patrick Nielsen Hayden’s cold declaration of racism?</p><p>It certainly explains a lot about the rot in SF/F over the last three decades to know that this pair of half-witted lunatics were editors at the largest publisher in the genre. Between them and the Peter Jacksons, it is a tossup as to which marriage was more disastrous for modern science fiction and fantasy.</p><p>Speaking of Mr. Nielsen Hayden’s reputation, I find it more than a little amusing that one has only to type “patrick nielsen h” into Google and the fourth autocomplete suggestion is “patrick nielsen hayden racist”. Despite all the pointing and shrieking that has been directed at me over the years, the accusation doesn’t even come up that quickly for me. What a grand editorial legacy to leave behind: racism and McRapey.</p></div>",
  "content_text": "Since we are all about the evidence here at VP, be it scientific, documentary, or testimonial, here is a documented example of the sort of thing that a certain Baen author pointed out a certain Tor author is prone to overlooking on the part of the Tor editors when he is busy on pinkshirt patrol policing the behavior of other SF/F publishers.\nThe Baen author wrote:\n“Scalzi’s editor Patrick Nielsen-Hayden has been a rather routine and\ndivisive voice on his Making Light blog for many years now.  Often\ncombative, often confrontational.  Both he and his wife.  How much\ndivision have the Nielsen-Hayden duo sown?  How much has their invective\nand their involvement in various controversies helped to put up walls\nin fandom?  Has Scalzi ever once called either of them out for it?”\nThen someone sent me\nthis little rant\n, courtesy of Teresa Neobatrachia Hayden, as she threatened those who dared to criticize her husband, the self-declared racist,\nPatrick Nielsen Hayden\n:\nThere’s been a big LJ thrash recently, one of those maelstroms of online\nstupidity that take on a life of their own. All kinds of good people\ngot trashed, starting with Elizabeth Bear. Patrick got involved when he\nposted some consoling remarks to Lisa Spangenberg. In the course of\nthose remarks, he observed that (1) some people are stupid; and (2)\nsome people don’t argue as well as others. The mob took this personally,\nand lit into him.\nWhat would you expect from a group that’s\nself-selected for agreement with the statement, “I’m stupid, and I don’t\nargue well”? Things got extremely ugly.\nI wonder whether any of\nthose draggletailed loudmouths have noticed that Patrick has now deleted\nhis entire Live Journal, all the way back to the beginning. I doubt\nthey have. They don’t strike me as the sort to go back and see the\ndamage they’ve done. Patrick has as usual taken them seriously; whereas\nthey, knowing themselves better than he does, will have known they\nweren’t worth listening to, and assumed they’d had no effect.\nI\ntender them my congratulations. Whatever good there was in Patrick’s LJ\nis gone now. Those members of the mob who actually wanted someone to\nlisten to them now have one less person to do it. The junior literary\ncritics and wanna-be writers have lost one of the central editors in\nscience fiction from their conversation. And if any of that lot\nprofesses to care about Patrick personally — please understand I’m not\nrating that probability very high at the moment — it should be obvious\nto them what kind of effect they’ve had.\nI know Patrick better\nthan anyone else. This is serious damage. The nithings who’ve hurt him\nwill have moved on to some other inane topic by now. There’s nothing\nworthwhile I can do to them. It wouldn’t take away his hurt — and\nbesides, they wouldn’t understand most of what I had to say to them.\nOne\nother issue: when Patrick and I first registered our Live Journal\naccounts, it never occurred to us to use anything other than our real\nnames — or rather, our real initials, which are easily traced to us,\nand which we’ve used as userIDs in other forums where our identities are\nor were known. Has it not occurred to the people attacking him that\nthey can say anything, whereas what they say about him will show up\nwhenever someone Googles his name? In terms of public reputation,\nthey’re playing with Monopoly money, and he’s playing with the real\nthing.\nSome of the people who are using false names are known to\nhim. Some of them are known to or evident to me. In those cases, I’ve\ntold Patrick who they really are. It’s only fair. Just on the other side\nof the boundary for people whose identities he can figure out are\npeople whom he can almost figure out: this one is a VP student. This one\nis someone he knows at conventions. This one is a reviewer he’s had\ndealings with. And so forth.\nDo any of those safely pseudonymous assholes ever stop to reflect that if he can tell they’re a former VP student,\nbut not which one,\nall former VP students become “people who may be traducing me on LJ at\nthis very moment”? The same thing goes for people he knows from\nconventions, or wanna-be writers who might submit something to him.\nEntire classes of people become potential attackers. That’s why I\nidentify everyone I can: it exculpates everyone else in that class.\nThose\nof you I can’t identify are not off the hook. I suggest that you never\nseek to take credit under your real name for anything you’ve done or\nwritten under your LJ pseudonym, because it’s unlikely that I will ever\nforget you or what you’ve done.\nDid Toni Weisskopf ever threaten anyone in the industry or publicly question the extent of their sexual experience? Alternatively, did Mr. Scalzi ever wax outraged and hold\nhis very own editor\nto public account? Meanwhile, the overweight amphibian croaks about hurt… what about the terrible pain her husband inflicted on us People of Color? What about the FeelBad he has caused us? What about the way our tender feelings are bruised, even years later, by Patrick Nielsen Hayden’s cold declaration of racism?\nIt certainly explains a lot about the rot in SF/F over the last three decades to know that this pair of half-witted lunatics were editors at the largest publisher in the genre. Between them and the Peter Jacksons, it is a tossup as to which marriage was more disastrous for modern science fiction and fantasy.\nSpeaking of Mr. Nielsen Hayden’s reputation, I find it more than a little amusing that one has only to type “patrick nielsen h” into Google and the fourth autocomplete suggestion is “patrick nielsen hayden racist”. Despite all the pointing and shrieking that has been directed at me over the years, the accusation doesn’t even come up that quickly for me. What a grand editorial legacy to leave behind: racism and McRapey.",
  "tags": [
    "freakshow",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-23T13:00:00+00:00"
}