{
  "url": "https://voxday.net/2014/03/11/disarmament-is-always-dumb/",
  "scraped_at": "2025-12-15T16:48:52.843008",
  "title": "Disarmament is always dumb",
  "date_display": "March 11, 2014",
  "date_iso": "2014-03-11T13:00:00+00:00",
  "date_from_url": "2014-03-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m only surprised that it took the Ukrainians almost a quarter of a century <a href=\"http://www.ksdk.com/story/news/nation/2014/03/10/ukraine-may-have-to-go-nuclear-says-kiev-lawmaker/6257311/\">to regret their unilateral disarmament</a>. Did they learn nothing from the fate of Czechoslovakia 52 years before?</p><blockquote class=\"tr_bq\"><p> Ukraine may have to arm itself with nuclear weapons if the United States and other world powers refuse to enforce a security pact that obligates them to reverse the Moscow-backed takeover of Crimea, a member of the Ukraine parliament told USA TODAY.</p><p>The United States, Great Britain and Russia agreed in a pact “to assure Ukraine’s territorial integrity” in return for Ukraine giving up a nuclear arsenal it inherited from the Soviet Union after declaring independence in 1991, said Pavlo Rizanenko, a member of the Ukrainian parliament.</p><p>“We gave up nuclear weapons because of this agreement,” said Rizanenko, a member of the Udar Party headed by Vitali Klitschko, a candidate for president. “Now there’s a strong sentiment in Ukraine that we made a big mistake.”</p></blockquote><p>Perhaps the biggest cost of America’s strategically foolish intervention in Ukraine is the way it will put an end to any attempt to get Iran, North Korea, or any other country that doesn’t want to be invaded, occupied, or partitioned to give up their nuclear ambitions. The lesson being taught is this: <i>never give up your nukes.</i></p><p><i>Si vis pacem, para bellum.</i> If you want peace, prepare for war.</p></div>",
  "content_text": "I’m only surprised that it took the Ukrainians almost a quarter of a century\nto regret their unilateral disarmament\n. Did they learn nothing from the fate of Czechoslovakia 52 years before?\nUkraine may have to arm itself with nuclear weapons if the United States and other world powers refuse to enforce a security pact that obligates them to reverse the Moscow-backed takeover of Crimea, a member of the Ukraine parliament told USA TODAY.\nThe United States, Great Britain and Russia agreed in a pact “to assure Ukraine’s territorial integrity” in return for Ukraine giving up a nuclear arsenal it inherited from the Soviet Union after declaring independence in 1991, said Pavlo Rizanenko, a member of the Ukrainian parliament.\n“We gave up nuclear weapons because of this agreement,” said Rizanenko, a member of the Udar Party headed by Vitali Klitschko, a candidate for president. “Now there’s a strong sentiment in Ukraine that we made a big mistake.”\nPerhaps the biggest cost of America’s strategically foolish intervention in Ukraine is the way it will put an end to any attempt to get Iran, North Korea, or any other country that doesn’t want to be invaded, occupied, or partitioned to give up their nuclear ambitions. The lesson being taught is this:\nnever give up your nukes.\nSi vis pacem, para bellum.\nIf you want peace, prepare for war.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-11T13:00:00+00:00"
}