{
  "url": "https://voxday.net/2014/03/18/epic-gamma-fai/",
  "scraped_at": "2025-12-16T12:12:09.313569",
  "title": "Epic Gamma Fail",
  "date_display": "March 18, 2014",
  "date_iso": "2014-03-18T13:00:00+00:00",
  "date_from_url": "2014-03-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always amusing to be lectured on feminist dogma by white-knighting gamma males desperate for female approval. A brief background:</p><ol><li>I wrote <a href=\"http://alphagameplan.blogspot.com/2014/02/you-can-give-woman-cs-degree.html\">an Alpha Game post</a> on the widely reported fact that most women who obtain computer science degrees don’t end up sticking with programming very long. I attributed this to the same reason women don’t write much hard science fiction; they are disinclined to put in the hard work required because they don’t enjoy it and it’s not a field where the usual trick of playing the “I’m just a little girl” card doesn’t get the men to do their work for them.</li><li>A commenter added: “<i>I think too many of these girls who get drafted in under the “MOAR<br> GIRLS!” banner never see real work, then bail when they encounter it.<br> Who will be at a technical conference debating the fine points of<br> something technical, or the fine points of a pun, and who will be taking<br> selfies in a mirror with a sign like “I am doing programming!”?</br></br></br></br></i></li><li>Enter White Knight #1, who promptly took it to Twitter, encouraging male programmers to take pictures of themselves doing programming and posting them to Twitter with the hashtag #iamdoingprogramming.</li><li>The gammas, sending the possibility of attracting some rare female attention, promptly committed the aforementioned <a href=\"http://alphagameplan.blogspot.com/2014/03/iamdoingprogramming.html\">epic gamma fail</a>.</li><li>One Ted Mielczarek ‏promptly declared the need for <a href=\"https://twitter.com/TedMielczarek/status/445575968808534017\">a Pink Programming Police</a>. <i>“We need some sort of HN-terrible-comment database that we can use as a “do not hire” blacklist.”</i> He also threatened to <a href=\"https://twitter.com/TedMielczarek/status/445733734390976512\">never hire me</a>. Oh, well, maybe I can find a job at Tor….</li></ol><p>Apparently people with decades of experience in software development are simply supposed to ignore everything they have seen and heard while embracing the GIRLZ CAN 2 CODE movement. I have a better idea. Let’s take a scientific approach and simply mandate female employment on all mission-critical financial programming projects from now until the financial system collapses.</p><p>We know mass default and credit contraction is necessary to clear the system, so we may as well kill two birds with one stone.</p></div>",
  "content_text": "It’s always amusing to be lectured on feminist dogma by white-knighting gamma males desperate for female approval. A brief background:\nI wrote\nan Alpha Game post\non the widely reported fact that most women who obtain computer science degrees don’t end up sticking with programming very long. I attributed this to the same reason women don’t write much hard science fiction; they are disinclined to put in the hard work required because they don’t enjoy it and it’s not a field where the usual trick of playing the “I’m just a little girl” card doesn’t get the men to do their work for them.\nA commenter added: “\nI think too many of these girls who get drafted in under the “MOAR\nGIRLS!” banner never see real work, then bail when they encounter it.\nWho will be at a technical conference debating the fine points of\nsomething technical, or the fine points of a pun, and who will be taking\nselfies in a mirror with a sign like “I am doing programming!”?\nEnter White Knight #1, who promptly took it to Twitter, encouraging male programmers to take pictures of themselves doing programming and posting them to Twitter with the hashtag #iamdoingprogramming.\nThe gammas, sending the possibility of attracting some rare female attention, promptly committed the aforementioned\nepic gamma fail\n.\nOne Ted Mielczarek ‏promptly declared the need for\na Pink Programming Police\n.\n“We need some sort of HN-terrible-comment database that we can use as a “do not hire” blacklist.”\nHe also threatened to\nnever hire me\n. Oh, well, maybe I can find a job at Tor….\nApparently people with decades of experience in software development are simply supposed to ignore everything they have seen and heard while embracing the GIRLZ CAN 2 CODE movement. I have a better idea. Let’s take a scientific approach and simply mandate female employment on all mission-critical financial programming projects from now until the financial system collapses.\nWe know mass default and credit contraction is necessary to clear the system, so we may as well kill two birds with one stone.",
  "tags": [
    "Alpha Game",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-18T13:00:00+00:00"
}