{
  "url": "https://voxday.net/2014/03/22/i-ragazzi-non-piangono/",
  "scraped_at": "2025-12-15T16:50:25.145523",
  "title": "I RAGAZZI NON PIANGONO",
  "date_display": "March 22, 2014",
  "date_iso": "2014-03-22T12:55:00+00:00",
  "date_from_url": "2014-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.amazon.com/Ragazzi-non-Piangono-Italian-Edition-ebook/dp/B00J67XA8M\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/03/BBDC_IT_256.png\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2014/03/BBDC_IT_256.png\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>Speaking of matters Italian, this seems a good time to mention that thanks to the collaboration between Castalia House’s bestselling author and Signore Bonello, the Rathaverse has been unleashed upon an unsuspecting Italian market. <i><b><a href=\"http://www.amazon.com/Ragazzi-non-Piangono-Italian-Edition-ebook/dp/B00J67XA8M\">I RAGAZZI NON PIANGONO</a></b></i> by Tom Kratman is now available on Amazon. I can personally attest that the translation does justice to the original text even if the translation of the title is not quite literal. A more accurate translation would have been <i>I GRANDI RAGAZZI NON PIANGONO</i> or perhaps <i>QUESTI RAGAZZONI NON PIANGERANNO</i>, but in the interest of actually fitting the title on the cover, we modified that to the Italian equivalent of “The Boys Don’t Cry”.</p><p>Descrizione:<i> I RAGAZZI NON PIANGONO è un romanzo breve dell’autore di fantascienza<br> militare Tom Kratman, famoso per  Un deserto chiamato pace e per la sua<br> serie Carrera. La trama segue il ciclo di vita di un Ratha, un super<br> carro armato senziente del futuro, che combatte con senso del dovere le<br> battaglie dell’Uomo in decine di mondi alieni. La creatura saprà però<br> ancora grata ai suoi creatori una volta che scoprirà di avere una<br> coscienza? E per quanto tempo una macchina da guerra intelligente con<br> potenza di fuoco sufficiente per radere al suolo una città sarà<br> soddisfatta di rimanere uno schiavo obbediente?<br> </br></br></br></br></br></br></br></br></br></i></p><p>One mildly amusing translation note: because Italians don’t have the letters “J” or “H” in their names, I took the liberty of changing the names of the Ratha developers to Italian names like “Giovanni” and “Loredana”. The translator objected to this on the basis of Italians being familiar with English names in their science fiction, and more importantly, because he felt the behavior of the characters was much more English than properly Italian.</p><p>I resisted the urge to ask if this was because the characters concerned were actually doing their jobs rather than sitting around drinking espresso, smoking cigarettes and reading <i>La Gazzetta dello Sport</i> and <i>Chi</i>; it turned out that he felt the problem was that no Italian superior would ever refer to a female employee by her first name unless he was romantically involved with her. And while there was a mild suggestion of this in the English text, he felt that it was the wrong way to go. So, we stuck with the English names.</p><p>Anche, stiamo cercando per ancora cinque lettori italiani per rivedere questo libro nuovo, quindi, se parle italiano e vuole leggerlo, spedirmi un email, per favore.</p><p>The German translation, <i>GROßE JUNGS WEINEN NICHT</i> will follow within a week or so. And on Monday, Castalia will announce a new release.</p><p>UPDATE: Apparently Italians are massive Tom Kratman fans. He’s already number one in fantascienza: <i>#1 in Kindle Store &gt; Kindle eBooks &gt; Foreign Languages &gt; Italian &gt; Fantasy, Horror &amp; Science Fiction </i></p></div>",
  "content_text": "Speaking of matters Italian, this seems a good time to mention that thanks to the collaboration between Castalia House’s bestselling author and Signore Bonello, the Rathaverse has been unleashed upon an unsuspecting Italian market.\nI RAGAZZI NON PIANGONO\nby Tom Kratman is now available on Amazon. I can personally attest that the translation does justice to the original text even if the translation of the title is not quite literal. A more accurate translation would have been\nI GRANDI RAGAZZI NON PIANGONO\nor perhaps\nQUESTI RAGAZZONI NON PIANGERANNO\n, but in the interest of actually fitting the title on the cover, we modified that to the Italian equivalent of “The Boys Don’t Cry”.\nDescrizione:\nI RAGAZZI NON PIANGONO è un romanzo breve dell’autore di fantascienza\nmilitare Tom Kratman, famoso per  Un deserto chiamato pace e per la sua\nserie Carrera. La trama segue il ciclo di vita di un Ratha, un super\ncarro armato senziente del futuro, che combatte con senso del dovere le\nbattaglie dell’Uomo in decine di mondi alieni. La creatura saprà però\nancora grata ai suoi creatori una volta che scoprirà di avere una\ncoscienza? E per quanto tempo una macchina da guerra intelligente con\npotenza di fuoco sufficiente per radere al suolo una città sarà\nsoddisfatta di rimanere uno schiavo obbediente?\nOne mildly amusing translation note: because Italians don’t have the letters “J” or “H” in their names, I took the liberty of changing the names of the Ratha developers to Italian names like “Giovanni” and “Loredana”. The translator objected to this on the basis of Italians being familiar with English names in their science fiction, and more importantly, because he felt the behavior of the characters was much more English than properly Italian.\nI resisted the urge to ask if this was because the characters concerned were actually doing their jobs rather than sitting around drinking espresso, smoking cigarettes and reading\nLa Gazzetta dello Sport\nand\nChi\n; it turned out that he felt the problem was that no Italian superior would ever refer to a female employee by her first name unless he was romantically involved with her. And while there was a mild suggestion of this in the English text, he felt that it was the wrong way to go. So, we stuck with the English names.\nAnche, stiamo cercando per ancora cinque lettori italiani per rivedere questo libro nuovo, quindi, se parle italiano e vuole leggerlo, spedirmi un email, per favore.\nThe German translation,\nGROßE JUNGS WEINEN NICHT\nwill follow within a week or so. And on Monday, Castalia will announce a new release.\nUPDATE: Apparently Italians are massive Tom Kratman fans. He’s already number one in fantascienza:\n#1 in Kindle Store > Kindle eBooks > Foreign Languages > Italian > Fantasy, Horror & Science Fiction",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-22T12:55:00+00:00"
}