{
  "url": "https://voxday.net/2014/03/27/madness-and-unreality-principle/",
  "scraped_at": "2025-12-15T16:50:56.916487",
  "title": "Madness and the Unreality Principle",
  "date_display": "March 27, 2014",
  "date_iso": "2014-03-27T13:00:00+00:00",
  "date_from_url": "2014-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John C. Wright presents a brilliant explication of the Left and their relentless denial of observable reality with his <a href=\"http://www.scifiwright.com/2014/03/the-unified-field-theory-of-madness/\">Unified Field Theory of Madness</a>:</p><blockquote class=\"tr_bq\"><p> The Leftist has only two choices here: accept reality, in which case he is no longer a Leftist, or deny reality, in which case his loyalty to the ideals of Leftism becomes rarefied and refined, and he become of their Cathari, the Pure Ones, an arhat of enlightenment.</p><p>I spoke above of the Unreality Principle. Here is where it comes into play. The Unreality Principle is the moral imperative to ignore and deny reality at all costs, and remain loyal and faithful to the make-believe illusion-choked funhouse-mirror Wonderland of Liberal Bullshit. You must bathe in the bullshit, eat the bullshit, drink the bullshit, and stuff the bullshit up your nose as far as far can be, because from now own the offal will be feast and wine to you, and will be your baptism and your oxygen. It will feed and sustain you.</p><p>However, the Unreality Principle demands a cost. First, there is something like a daily maintenance cost: you must attend closely to whatever the social cues are telling you, and believe them and not your lying eyes….</p><p>The Leftists are people who are stupider than average, less moral and<br> upright and decent than average, who at once combine the worst features<br> of a self-deceived fool and a self-deceiving conniving con-man. The only<br> thing that saves them from the constant pain of the dentist drill of<br> their conscience, the constant clamor of their wretched self-esteem<br> telling them that they do not deserve to live, the only thing, indeed,<br> keeping them alive, is their false and inflated sense of sanctimony.<br> Each one is a Judas, who has betrayed all he hold dear. The only reason<br> why he does not hang himself from the nearest redbud tree is because he<br> adopts the numbing hypocrisy of the Pharisee.</br></br></br></br></br></br></br></br></br></p><p>There is no greater high than to fly on the drug of smug moral<br> superiority. You may look down your nose at all fashion of men greater<br> than you in every other way, but if they are evil and you are righteous,<br> the savory odor of your righteousness in your own nostrils is finer<br> than myrrh. It is more than wine which mortals drink; it is nectar of<br> the gods.</br></br></br></br></br></p></blockquote><p>In case you were wondering where our modern-day Chesterton was, well, John C. Wright is it. It is a little frustrating to be publishing his excellent book of essays, the forthcoming <i>TRANSHUMAN AND SUBHUMAN</i>, because not a week goes by that he doesn’t produce another new essay that fairly screams for inclusion in it.</p><p>Needless to say, there will be a sequel if Mr. Wright is so inclined.</p><p>And if you haven’t read his GOLDEN AGE trilogy yet, you simply must. It is more than excellent, it is inspiring. Consider this quote from <i>THE GOLDEN TRANSCENDANCE</i>, which I am currently reading:</p><p><i>“[E]very intelligent entity, human or machine, requires justification to undertake the strenuous effort of continued existence. For entities whose acts conform to the dictates of morality, this process is automatic, and their lives are joyous. Entities whose acts do not conform to moral law must adopt some degree of mental dishonesty to erect barriers to their own understanding, creating rationalization to elude self-condemnation and misery. The strategy of rationalization adopted by a dishonest mind falls into predictable patterns.”</i></p><p>Note that this isn’t exposition or preaching, but a concept that is seamlessly integrated into the plot in order to explain the potential of mere human minds to correctly anticipate the thinking of superhuman, supersmart machine intelligences.</p></div>",
  "content_text": "John C. Wright presents a brilliant explication of the Left and their relentless denial of observable reality with his\nUnified Field Theory of Madness\n:\nThe Leftist has only two choices here: accept reality, in which case he is no longer a Leftist, or deny reality, in which case his loyalty to the ideals of Leftism becomes rarefied and refined, and he become of their Cathari, the Pure Ones, an arhat of enlightenment.\nI spoke above of the Unreality Principle. Here is where it comes into play. The Unreality Principle is the moral imperative to ignore and deny reality at all costs, and remain loyal and faithful to the make-believe illusion-choked funhouse-mirror Wonderland of Liberal Bullshit. You must bathe in the bullshit, eat the bullshit, drink the bullshit, and stuff the bullshit up your nose as far as far can be, because from now own the offal will be feast and wine to you, and will be your baptism and your oxygen. It will feed and sustain you.\nHowever, the Unreality Principle demands a cost. First, there is something like a daily maintenance cost: you must attend closely to whatever the social cues are telling you, and believe them and not your lying eyes….\nThe Leftists are people who are stupider than average, less moral and\nupright and decent than average, who at once combine the worst features\nof a self-deceived fool and a self-deceiving conniving con-man. The only\nthing that saves them from the constant pain of the dentist drill of\ntheir conscience, the constant clamor of their wretched self-esteem\ntelling them that they do not deserve to live, the only thing, indeed,\nkeeping them alive, is their false and inflated sense of sanctimony.\nEach one is a Judas, who has betrayed all he hold dear. The only reason\nwhy he does not hang himself from the nearest redbud tree is because he\nadopts the numbing hypocrisy of the Pharisee.\nThere is no greater high than to fly on the drug of smug moral\nsuperiority. You may look down your nose at all fashion of men greater\nthan you in every other way, but if they are evil and you are righteous,\nthe savory odor of your righteousness in your own nostrils is finer\nthan myrrh. It is more than wine which mortals drink; it is nectar of\nthe gods.\nIn case you were wondering where our modern-day Chesterton was, well, John C. Wright is it. It is a little frustrating to be publishing his excellent book of essays, the forthcoming\nTRANSHUMAN AND SUBHUMAN\n, because not a week goes by that he doesn’t produce another new essay that fairly screams for inclusion in it.\nNeedless to say, there will be a sequel if Mr. Wright is so inclined.\nAnd if you haven’t read his GOLDEN AGE trilogy yet, you simply must. It is more than excellent, it is inspiring. Consider this quote from\nTHE GOLDEN TRANSCENDANCE\n, which I am currently reading:\n“[E]very intelligent entity, human or machine, requires justification to undertake the strenuous effort of continued existence. For entities whose acts conform to the dictates of morality, this process is automatic, and their lives are joyous. Entities whose acts do not conform to moral law must adopt some degree of mental dishonesty to erect barriers to their own understanding, creating rationalization to elude self-condemnation and misery. The strategy of rationalization adopted by a dishonest mind falls into predictable patterns.”\nNote that this isn’t exposition or preaching, but a concept that is seamlessly integrated into the plot in order to explain the potential of mere human minds to correctly anticipate the thinking of superhuman, supersmart machine intelligences.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-27T13:00:00+00:00"
}