{
  "url": "https://voxday.net/2014/03/09/mailvox-independent-vs-self-publishing/",
  "scraped_at": "2025-12-15T16:48:38.522257",
  "title": "Mailvox: independent vs self-publishing",
  "date_display": "March 9, 2014",
  "date_iso": "2014-03-09T11:25:00+00:00",
  "date_from_url": "2014-03-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An anonymous author writes with an inquiry about the two primary publishing alternatives:</p><blockquote class=\"tr_bq\"><p> I’ve been following your posts about Castalia House with interest. In the comments to ‘A model comparison’ you mention the advantages of an author publishing through CH are <i>“Awareness, editing, covers, endorsement, and not having to deal with all the business BS. Self-publishing will not suit at least 75 percent of authors.”</i> I’m looking to publish three books later this year that would be nearly impossible to sell to traditional publishers, so even if I was okay with tradpub royalty arrangements, independent and self-publishing are my only real options. Given that, I’d be interested in reading a more detailed post on what one gains and loses with the different models, if you have the time and inclination to write it.</p></blockquote><p>This is the right time to ask that question. But before we look at the advantages of publishing with us, let’s look at the three chief advantages of self-publishing, which are genuine and material.</p><ol><li>Keep all the royalty revenues. Amazon takes 30 percent plus a very small delivery fee that usually amounts to about 1.2 percent, so the self-publisher can realistically expect to make 68.5 percent of list on ebooks. That is twice what our novelists make on our standard agreement, (we offer 50 percent on all hardcovers and ebooks, which works out to 34.5 percent of list), and nearly three times what most writers will make from the independent publishers that offer 35 percent. For the sake of reference, it’s also 8.5625x what the traditional publishers pay on hardcovers. (Hardcovers are different; I will break down those numbers in a future post.)</li><li>Complete control. The author can decide on his own cover, make his own editorial decisions, price the book as he sees fit, and publish the book according to his own schedule.</li><li>Complete information. The author has direct access to the sales data.</li></ol><p>Those three things are not nothing. I have nothing but respect for those who go the self-publishing route. That being said, I am certain that it is not the best route for the majority of writers who are good enough to interest independent publishers for the following eight reasons laid out <a href=\"http://www.castaliahouse.com/advantage-castalia/\">at Castalia House</a>.</p><p>There is no question that self-publishing is the optimal financial deal for those equipped to handle it. However, most writers are not equipped to properly handle it either materially or emotionally, observably tend to compromise on the production values in order to reduce their production costs, and will end up selling fewer copies than the breakeven point with independent publishing.</p><p>I fully support self-publishing. I think it is revolutionary and an unmitigated Good Thing. But I am aware that most authors, like me, would prefer to focus on writing rather than being distracted by running a publishing business. I chose to publish with Marcher Lord rather than self-publish and I would still happily be doing so if Marcher Lord had not been purchased. So, as a consequence, Castalia House has been set up to be the most author-friendly independent publisher that this author believes it is possible for a publishing house to be.</p><p>But there is no need to take my word for it. I recommend talking to our authors and asking them about their experience working with us. I believe you will find they do not regret their decisions to do so. One agent asked me how an author could possibly know his sales numbers when we were not contractually obligated to disclose them for a period of several months. He was a little surprised when I pointed out that the contract was our minimal obligation and it happens to suit us to periodically exceed that obligation so that our authors can know exactly how well their books are doing, and to know when they exceed certain objectives.</p></div>",
  "content_text": "An anonymous author writes with an inquiry about the two primary publishing alternatives:\nI’ve been following your posts about Castalia House with interest. In the comments to ‘A model comparison’ you mention the advantages of an author publishing through CH are\n“Awareness, editing, covers, endorsement, and not having to deal with all the business BS. Self-publishing will not suit at least 75 percent of authors.”\nI’m looking to publish three books later this year that would be nearly impossible to sell to traditional publishers, so even if I was okay with tradpub royalty arrangements, independent and self-publishing are my only real options. Given that, I’d be interested in reading a more detailed post on what one gains and loses with the different models, if you have the time and inclination to write it.\nThis is the right time to ask that question. But before we look at the advantages of publishing with us, let’s look at the three chief advantages of self-publishing, which are genuine and material.\nKeep all the royalty revenues. Amazon takes 30 percent plus a very small delivery fee that usually amounts to about 1.2 percent, so the self-publisher can realistically expect to make 68.5 percent of list on ebooks. That is twice what our novelists make on our standard agreement, (we offer 50 percent on all hardcovers and ebooks, which works out to 34.5 percent of list), and nearly three times what most writers will make from the independent publishers that offer 35 percent. For the sake of reference, it’s also 8.5625x what the traditional publishers pay on hardcovers. (Hardcovers are different; I will break down those numbers in a future post.)\nComplete control. The author can decide on his own cover, make his own editorial decisions, price the book as he sees fit, and publish the book according to his own schedule.\nComplete information. The author has direct access to the sales data.\nThose three things are not nothing. I have nothing but respect for those who go the self-publishing route. That being said, I am certain that it is not the best route for the majority of writers who are good enough to interest independent publishers for the following eight reasons laid out\nat Castalia House\n.\nThere is no question that self-publishing is the optimal financial deal for those equipped to handle it. However, most writers are not equipped to properly handle it either materially or emotionally, observably tend to compromise on the production values in order to reduce their production costs, and will end up selling fewer copies than the breakeven point with independent publishing.\nI fully support self-publishing. I think it is revolutionary and an unmitigated Good Thing. But I am aware that most authors, like me, would prefer to focus on writing rather than being distracted by running a publishing business. I chose to publish with Marcher Lord rather than self-publish and I would still happily be doing so if Marcher Lord had not been purchased. So, as a consequence, Castalia House has been set up to be the most author-friendly independent publisher that this author believes it is possible for a publishing house to be.\nBut there is no need to take my word for it. I recommend talking to our authors and asking them about their experience working with us. I believe you will find they do not regret their decisions to do so. One agent asked me how an author could possibly know his sales numbers when we were not contractually obligated to disclose them for a period of several months. He was a little surprised when I pointed out that the contract was our minimal obligation and it happens to suit us to periodically exceed that obligation so that our authors can know exactly how well their books are doing, and to know when they exceed certain objectives.",
  "tags": [
    "Castalia House",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-09T11:25:00+00:00"
}