{
  "url": "https://voxday.net/2014/03/15/mailvox-of-division-and-hypocrisy/",
  "scraped_at": "2025-12-15T16:49:11.606465",
  "title": "Mailvox: of division and hypocrisy",
  "date_display": "March 15, 2014",
  "date_iso": "2014-03-15T17:00:00+00:00",
  "date_from_url": "2014-03-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of Baen’s many authors had this to say about John Scalzi’s attack on what he claimed was Baen Publisher Toni Weisskopf’s divisiveness:</p><blockquote class=\"tr_bq\"><p> John Scalzi is annoying, yes.  But his straw-manning of Toni really, really set me off.  I’ve been trying to figure out why. Tonight I think I’ve figured it out. Scalzi attacked Toni (falsely) for being a “divider” in the field for one of the very rare times when Toni politely and eloquently editorialized.  Toni does this so seldom, it’s remarkable that anyone could have an issue with it.  Especially when Toni worked hard to be non-combative, non-confrontational in tone and word choice.</p><p>Scalzi’s editor Patrick Nielsen-Hayden has been a rather routine and divisive voice on his Making Light blog for many years now.  Often combative, often confrontational.  Both he and his wife.  How much division have the Nielsen-Hayden duo sown?  How much has their invective and their involvement in various controversies helped to put up walls in fandom?  Has Scalzi ever <i>once </i>called either of them out for it?</p><p>Of course he hasn’t.  And he never will.  Because Patrick Nielsen-Hayden is Scalzi’s lifeline at TOR. I mean, I get it, it’s a smart business move, but it’s incredibly dickish on his part to ignore PNH/TNH then go after Toni like Toni is some kind of pest spreading discord.  That’s fucking hypocritical and untrue.</p><p>Of course, this also makes me think of Larry Correia’s rule for arguing with libs:</p><p>LIB: ATTACK, ATTACK, ATTACK, ATTACK!<br> CON: respond.<br> LIB: HOW RUDE!</br></br></p></blockquote><p>The demonstrable fact is that the Nielsen-Haydens have been rudely and divisively attacking people in the genre since at least 2005. The first I’d ever heard of either of them was when they were<a href=\"http://nielsenhayden.com/electrolite/archives/006122.html\"> attacking me on Making Light</a> for a<i> political op/ed column</i> I’d written for WND and Universal Press Syndicate. I wrote a serious piece which observed in passing that women who were capable of writing hard science fiction did not do so because they were observably disinclined to put in the necessary time and effort required, which led to Patrick Nielsen-Hayden declaring me to be an anti-Semite and his semiaquatic life partner asserting that I could not get laid. Naturally.</p><p>John Scalzi not only didn’t take them to task for being divisive and confrontational, he did his best to pile on in his own lightweight, bachelors-degree-in-philosophy manner. Furthermore, it should be noted that John Scalzi and Patrick Nielsen-Hayden were the two individuals most responsible for creating the precedent that SFWA could purge members at any reason at any time. They put direct pressure on the current SFWA Board by threatening to not renew their memberships if I was not expelled.</p><p>From the SFWA report: <i>Most prominently,<b> an outgoing Board Member</b> indicated that <b>he </b>intended to let his membership lapse until Beale was no longer a member: “My membership is due and I can’t in good conscience renew it until SFWA finds the means or moral backbone or whatever’s ultimately required to expel someone as hateful and wilfully destructive as Beale—not just from the organisation but from the culture present within it.”</i></p><p><a href=\"https://twitter.com/scalzi/status/367681626127355906\">From Twitter</a> less than two hours after <a href=\"http://www.milobookclub.com/2013/08/14/the-sfwa-board-decides/\">I announced the Board’s action</a>:</p><p>John Scalzi @scalzi<br> I just renewed my @sfwa membership!<br> 2:18 PM – 14 Aug 2013</br></br></p><p>P Nielsen Hayden ‏@pnh Aug 14<br> @scalzi So did I! What a coincidence! @sfwa</br></p><p>So, John Scalzi’s inept attack on Toni Weisskopf is not only hypocritical, but is indicative of the very divisiveness that he feigns to be criticizing. It is no more credible than his false claim to have 50,000 daily readers. The fact is that the SF/F Left has been divisive and confrontational ever since Damon Knight began publicly denigrating AE van Vogt for ideological reasons. The difference now is that the Left’s attacks have grown louder and more frequent while the SF/F Right no longer needs to placate and put up with their antics. They don’t want us and we most certainly don’t need them.</p></div>",
  "content_text": "One of Baen’s many authors had this to say about John Scalzi’s attack on what he claimed was Baen Publisher Toni Weisskopf’s divisiveness:\nJohn Scalzi is annoying, yes.  But his straw-manning of Toni really, really set me off.  I’ve been trying to figure out why. Tonight I think I’ve figured it out. Scalzi attacked Toni (falsely) for being a “divider” in the field for one of the very rare times when Toni politely and eloquently editorialized.  Toni does this so seldom, it’s remarkable that anyone could have an issue with it.  Especially when Toni worked hard to be non-combative, non-confrontational in tone and word choice.\nScalzi’s editor Patrick Nielsen-Hayden has been a rather routine and divisive voice on his Making Light blog for many years now.  Often combative, often confrontational.  Both he and his wife.  How much division have the Nielsen-Hayden duo sown?  How much has their invective and their involvement in various controversies helped to put up walls in fandom?  Has Scalzi ever\nonce\ncalled either of them out for it?\nOf course he hasn’t.  And he never will.  Because Patrick Nielsen-Hayden is Scalzi’s lifeline at TOR. I mean, I get it, it’s a smart business move, but it’s incredibly dickish on his part to ignore PNH/TNH then go after Toni like Toni is some kind of pest spreading discord.  That’s fucking hypocritical and untrue.\nOf course, this also makes me think of Larry Correia’s rule for arguing with libs:\nLIB: ATTACK, ATTACK, ATTACK, ATTACK!\nCON: respond.\nLIB: HOW RUDE!\nThe demonstrable fact is that the Nielsen-Haydens have been rudely and divisively attacking people in the genre since at least 2005. The first I’d ever heard of either of them was when they were\nattacking me on Making Light\nfor a\npolitical op/ed column\nI’d written for WND and Universal Press Syndicate. I wrote a serious piece which observed in passing that women who were capable of writing hard science fiction did not do so because they were observably disinclined to put in the necessary time and effort required, which led to Patrick Nielsen-Hayden declaring me to be an anti-Semite and his semiaquatic life partner asserting that I could not get laid. Naturally.\nJohn Scalzi not only didn’t take them to task for being divisive and confrontational, he did his best to pile on in his own lightweight, bachelors-degree-in-philosophy manner. Furthermore, it should be noted that John Scalzi and Patrick Nielsen-Hayden were the two individuals most responsible for creating the precedent that SFWA could purge members at any reason at any time. They put direct pressure on the current SFWA Board by threatening to not renew their memberships if I was not expelled.\nFrom the SFWA report:\nMost prominently,\nan outgoing Board Member\nindicated that\nhe\nintended to let his membership lapse until Beale was no longer a member: “My membership is due and I can’t in good conscience renew it until SFWA finds the means or moral backbone or whatever’s ultimately required to expel someone as hateful and wilfully destructive as Beale—not just from the organisation but from the culture present within it.”\nFrom Twitter\nless than two hours after\nI announced the Board’s action\n:\nJohn Scalzi @scalzi\nI just renewed my @sfwa membership!\n2:18 PM – 14 Aug 2013\nP Nielsen Hayden ‏@pnh Aug 14\n@scalzi So did I! What a coincidence! @sfwa\nSo, John Scalzi’s inept attack on Toni Weisskopf is not only hypocritical, but is indicative of the very divisiveness that he feigns to be criticizing. It is no more credible than his false claim to have 50,000 daily readers. The fact is that the SF/F Left has been divisive and confrontational ever since Damon Knight began publicly denigrating AE van Vogt for ideological reasons. The difference now is that the Left’s attacks have grown louder and more frequent while the SF/F Right no longer needs to placate and put up with their antics. They don’t want us and we most certainly don’t need them.",
  "tags": [
    "mailvox",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-15T17:00:00+00:00"
}