{
  "url": "https://voxday.net/2014/03/21/no-we-really-wouldn/",
  "scraped_at": "2025-12-15T16:50:21.491079",
  "title": "No, we really wouldn’t",
  "date_display": "March 21, 2014",
  "date_iso": "2014-03-21T22:46:00+00:00",
  "date_from_url": "2014-03-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Do they really think they’re <a href=\"http://philadelphia.cbslocal.com/2014/03/21/sharyl-attkisson-there-is-coordination-between-reporters-and-politicians/\">fooling anyone?</a></p><blockquote class=\"tr_bq\"><p> If I need something answered from the White House and they won’t tell<br> me, I’ll call our White House Correspondent. They’re friendlier with the<br> White House Correspondents in general. So the White House Correspondent<br> may ask Jay Carney or one of his folks about an issue and they will be<br> told ‘ask that at the briefing and we’ll answer it.’ They want to answer<br> it in front of everybody. They do know it’s coming and they’ll call on<br> you. There’s that kind of coordination sometimes. I wouldn’t be shocked<br> if there’s sometimes more coordination. I don’t think it’s everybody on<br> every briefing, every day. I’m pretty sure it’s not. But I think people<br> would be surprised at the level of cooperation reporters have in general<br> with politicians.”</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>It’s rather like a crack whore saying she thinks people might be surprised to learn she’s not a virgin.</p></div>",
  "content_text": "Do they really think they’re\nfooling anyone?\nIf I need something answered from the White House and they won’t tell\nme, I’ll call our White House Correspondent. They’re friendlier with the\nWhite House Correspondents in general. So the White House Correspondent\nmay ask Jay Carney or one of his folks about an issue and they will be\ntold ‘ask that at the briefing and we’ll answer it.’ They want to answer\nit in front of everybody. They do know it’s coming and they’ll call on\nyou. There’s that kind of coordination sometimes. I wouldn’t be shocked\nif there’s sometimes more coordination. I don’t think it’s everybody on\nevery briefing, every day. I’m pretty sure it’s not. But I think people\nwould be surprised at the level of cooperation reporters have in general\nwith politicians.”\nIt’s rather like a crack whore saying she thinks people might be surprised to learn she’s not a virgin.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-21T22:46:00+00:00"
}