{
  "url": "https://voxday.net/2014/03/31/not-on-your-side_31/",
  "scraped_at": "2025-12-15T16:51:15.843056",
  "title": "Not on your side",
  "date_display": "March 31, 2014",
  "date_iso": "2014-03-31T05:00:00+00:00",
  "date_from_url": "2014-03-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Kevin Williamson appears to think that <a href=\"http://www.nationalreview.com/article/374528/which-side-are-you-kevin-d-williamson\">a pragmatic appeal to the lesser evil</a> is going to work again after six years of the Obama adminstration:</p><blockquote class=\"tr_bq\"><p> Republicans<br> now have the opportunity to effectively bring the Obama<br> administration’s legislative program to an early end this November by<br> eliminating the Democrats’ majority in the Senate, which would also give<br> them a much stronger hand in keeping the worst of his appointees out of<br> office, safely quarantined in whatever dank recesses of academia<br> currently housing them. And while one should never underestimate the<br> Republicans’ ability to blunder their way into missing a political<br> opportunity or the fickleness of our bread-and-circuses electorate,<br> there is a very good chance that that will happen. (Knock wood, salt<br> over the shoulder — pick your own prophylactic.) But conservatives all<br> too often seem to have failed to learn the lesson of the heavy losses we<br> have suffered during the Obama years: The differences among us are<br> minor compared with the differences between us and them, which are<br> fundamental.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>Conservatives had an opportunity to put<br> the Obama administration not to an effective end but a literal one in<br> 2012, but we blew it. Mitt Romney improved on John McCain’s vote total<br> (barely), fared better in every battleground state save Ohio, and even<br> won independents. The election in the end was decided by 334,000 votes<br> in Florida, Ohio, Virginia, and New Hampshire. Even with Barack Obama’s<br> edge among newly registered minority voters and an unusually high<br> turnout among overwhelmingly Democratic black voters, only 57.5 percent<br> of eligible voters actually showed up. That left a lot of room for<br> conservatives to make a difference. But we did not take the opportunity.</br></br></br></br></br></br></br></br></br></p><p>The<br> three most important words in politics are: “Compared with what?” And I<br> am more than a little sympathetic to conservatives’ complaints about<br> the failures of elected Republicans in Washington, who consistently<br> disappoint us even when they are in the majority. I am also sympathetic<br> to the view that our situation may have deteriorated to the point that<br> even a unified Republican government under the leadership of principled<br> conservatives may not be enough to turn things around. And though I<br> reject the notion that Mitt Romney wasn’t good enough for true-believing<br> conservatives, let’s say, arguendo, that that was the case. Unless you<br> are ready to give up entirely on the notion of advancing conservative<br> principles through the ballot box, you might consider looking at things<br> this way: Even if you do not think that it matters much whether<br> Republicans win, it matters a great deal that Democrats lose.</br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>No,<br> no, and no again. A thousand times no.  Mitt Romney wasn’t good enough.<br> John McCain would have actually been worse than Obama. Failing a little<br> more slowly, destroying the country a little less spectacularly, is not<br> and will never be a solution. It cannot be a solution.</br></br></br></br></p><p>At<br> this point, the die is cast. There is no one in American politics, now<br> that Ron Paul is retired, who is even potentially interested in the<br> policies that need to be implemented to salvage what is observably a<br> failing empire. There is not a single candidate in either party who will<br> even attempt to fix the financial system, deport the millions of<br> invaders, and end the foreign wars.</br></br></br></br></br></br></p><p>It is better to be<br> openly attacked by confirmed enemies than repeatedly betrayed by false<br> friends. The Republicans have proven that they are no friends to<br> freedom, small government, or traditional America and it is a<br> fundamental error for anyone who values freedom or small government or<br> traditional America to support them.</br></br></br></br></br></p><p>Mr. Williamson says: “I am coming around to the view that I’d rather be disappointed by<br> Republicans who periodically fail live up to their principles than have<br> my country pillaged and hobbled by Democrats who consistently live up to<br> theirs.”</br></br></br></p><p>That’s a false choice. Mr. Williamson should<br> know better. The Republicans don’t “periodically fail to live up to<br> their principles”. They predictably, and reliably, fail to live up to<br> their pretended principles.</br></br></br></p></div>",
  "content_text": "Kevin Williamson appears to think that\na pragmatic appeal to the lesser evil\nis going to work again after six years of the Obama adminstration:\nRepublicans\nnow have the opportunity to effectively bring the Obama\nadministration’s legislative program to an early end this November by\neliminating the Democrats’ majority in the Senate, which would also give\nthem a much stronger hand in keeping the worst of his appointees out of\noffice, safely quarantined in whatever dank recesses of academia\ncurrently housing them. And while one should never underestimate the\nRepublicans’ ability to blunder their way into missing a political\nopportunity or the fickleness of our bread-and-circuses electorate,\nthere is a very good chance that that will happen. (Knock wood, salt\nover the shoulder — pick your own prophylactic.) But conservatives all\ntoo often seem to have failed to learn the lesson of the heavy losses we\nhave suffered during the Obama years: The differences among us are\nminor compared with the differences between us and them, which are\nfundamental.\nConservatives had an opportunity to put\nthe Obama administration not to an effective end but a literal one in\n2012, but we blew it. Mitt Romney improved on John McCain’s vote total\n(barely), fared better in every battleground state save Ohio, and even\nwon independents. The election in the end was decided by 334,000 votes\nin Florida, Ohio, Virginia, and New Hampshire. Even with Barack Obama’s\nedge among newly registered minority voters and an unusually high\nturnout among overwhelmingly Democratic black voters, only 57.5 percent\nof eligible voters actually showed up. That left a lot of room for\nconservatives to make a difference. But we did not take the opportunity.\nThe\nthree most important words in politics are: “Compared with what?” And I\nam more than a little sympathetic to conservatives’ complaints about\nthe failures of elected Republicans in Washington, who consistently\ndisappoint us even when they are in the majority. I am also sympathetic\nto the view that our situation may have deteriorated to the point that\neven a unified Republican government under the leadership of principled\nconservatives may not be enough to turn things around. And though I\nreject the notion that Mitt Romney wasn’t good enough for true-believing\nconservatives, let’s say, arguendo, that that was the case. Unless you\nare ready to give up entirely on the notion of advancing conservative\nprinciples through the ballot box, you might consider looking at things\nthis way: Even if you do not think that it matters much whether\nRepublicans win, it matters a great deal that Democrats lose.\nNo,\nno, and no again. A thousand times no.  Mitt Romney wasn’t good enough.\nJohn McCain would have actually been worse than Obama. Failing a little\nmore slowly, destroying the country a little less spectacularly, is not\nand will never be a solution. It cannot be a solution.\nAt\nthis point, the die is cast. There is no one in American politics, now\nthat Ron Paul is retired, who is even potentially interested in the\npolicies that need to be implemented to salvage what is observably a\nfailing empire. There is not a single candidate in either party who will\neven attempt to fix the financial system, deport the millions of\ninvaders, and end the foreign wars.\nIt is better to be\nopenly attacked by confirmed enemies than repeatedly betrayed by false\nfriends. The Republicans have proven that they are no friends to\nfreedom, small government, or traditional America and it is a\nfundamental error for anyone who values freedom or small government or\ntraditional America to support them.\nMr. Williamson says: “I am coming around to the view that I’d rather be disappointed by\nRepublicans who periodically fail live up to their principles than have\nmy country pillaged and hobbled by Democrats who consistently live up to\ntheirs.”\nThat’s a false choice. Mr. Williamson should\nknow better. The Republicans don’t “periodically fail to live up to\ntheir principles”. They predictably, and reliably, fail to live up to\ntheir pretended principles.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-31T04:00:00+00:00"
}