{
  "url": "https://voxday.net/2014/03/12/obsidian-cries-raciss/",
  "scraped_at": "2025-12-15T16:48:57.959900",
  "title": "Obsidian cries raciss",
  "date_display": "March 12, 2014",
  "date_iso": "2014-03-12T15:30:00+00:00",
  "date_from_url": "2014-03-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m only surprised it took him this long to get around to it. I’ve been waiting for him <a href=\"http://alphagameplan.blogspot.com/2014/03/magical-thinking.html\">to take a public shot at me</a> ever since I humiliated him when he was strutting around boasting about “chin-checking chumps” or however it was that the Jive talk went:</p><blockquote class=\"tr_bq\"><p> Following up on my question above, I note that you cite two very well known bloggers in the Manosphere, who would be considered to fit Kimmel’s characterization like the proverbial hand in glove: Chateau Heartiste, formerly known as Roissy, and Vox Day, of the blog Alpha Game. Both have been cited for their racist views of people of color, and neither seem particularly interested in being inclusive of Men of Color under their tents (in fact, I would go so far as to say that they are both actively hostile to such inclusiveness – I say this based on direct observation and experience of both). As noted above, their astute observations and the like, many of which I do agree with, are utterly undermined by their racism, and gives folks like Kimmel, et al a smoking gun with which to discredit the entirety of the MRM cause.</p></blockquote><p>My response is <a href=\"http://alphagameplan.blogspot.com/2014/03/magical-thinking.html\">at Alpha Game</a>. But suffice it to say that my deep and abiding concerns for the African-American community are only exceeded by my dedication to the plight of the Heian Japanese. Of course, I am hostile to “inclusiveness”. As an open and avowed elitist, it tends to come with the territory.</p><p>I actually find it vaguely surprising that people are still trying to play the race card in 2014. Hispanics quite openly hate Blacks and are actively driving them out of their most archetypical communities. Whites and Jews are “gentrifying” them out of their historic homes, which is the genteel way to say “financial ethnic cleansing”. I mean, who is still pretending that desegregation is even remotely viable? Who is still dumb enough to pretend that the Civil Rights Movement wasn’t a fundamentally wrong-headed failure?</p><p>It’s even stranger that they still attempt to play it on me. First, I can trump it with my own Man of Color card. Second, I should think I have made it abundantly clear that I am not in the least bit afraid of being labeled anything from Toddler Slayer to RSHD.</p><p>“All men are created equal” cannot possibly apply in a material sense in any world where all men are not even equally <i>homo sapiens sapiens</i>.</p></div>",
  "content_text": "I’m only surprised it took him this long to get around to it. I’ve been waiting for him\nto take a public shot at me\never since I humiliated him when he was strutting around boasting about “chin-checking chumps” or however it was that the Jive talk went:\nFollowing up on my question above, I note that you cite two very well known bloggers in the Manosphere, who would be considered to fit Kimmel’s characterization like the proverbial hand in glove: Chateau Heartiste, formerly known as Roissy, and Vox Day, of the blog Alpha Game. Both have been cited for their racist views of people of color, and neither seem particularly interested in being inclusive of Men of Color under their tents (in fact, I would go so far as to say that they are both actively hostile to such inclusiveness – I say this based on direct observation and experience of both). As noted above, their astute observations and the like, many of which I do agree with, are utterly undermined by their racism, and gives folks like Kimmel, et al a smoking gun with which to discredit the entirety of the MRM cause.\nMy response is\nat Alpha Game\n. But suffice it to say that my deep and abiding concerns for the African-American community are only exceeded by my dedication to the plight of the Heian Japanese. Of course, I am hostile to “inclusiveness”. As an open and avowed elitist, it tends to come with the territory.\nI actually find it vaguely surprising that people are still trying to play the race card in 2014. Hispanics quite openly hate Blacks and are actively driving them out of their most archetypical communities. Whites and Jews are “gentrifying” them out of their historic homes, which is the genteel way to say “financial ethnic cleansing”. I mean, who is still pretending that desegregation is even remotely viable? Who is still dumb enough to pretend that the Civil Rights Movement wasn’t a fundamentally wrong-headed failure?\nIt’s even stranger that they still attempt to play it on me. First, I can trump it with my own Man of Color card. Second, I should think I have made it abundantly clear that I am not in the least bit afraid of being labeled anything from Toddler Slayer to RSHD.\n“All men are created equal” cannot possibly apply in a material sense in any world where all men are not even equally\nhomo sapiens sapiens\n.",
  "tags": [
    "anklebiters",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-12T15:30:00+00:00"
}