{
  "url": "https://voxday.net/2014/03/21/pink-sf-comes-to-gaming/",
  "scraped_at": "2025-12-15T16:50:17.842232",
  "title": "Pink SF/F invades gaming",
  "date_display": "March 21, 2014",
  "date_iso": "2014-03-21T13:00:00+00:00",
  "date_from_url": "2014-03-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not content with having all but destroyed SF/F, the ever-restless Pink Horde is now <a href=\"http://www.eurogamer.net/articles/2014-03-21-misogyny-racism-and-homophobia-where-do-video-games-stand\">laying siege to the video game industry</a>:</p><blockquote class=\"tr_bq\"><p> BioWare Montreal’s gameplay designer Manveer Heir received a standing ovation for his rousing “Misogyny, Racism and Homophobia: Where Do Video Games Stand?” talk at GDC yesterday. He challenged the industry to demolish the many stereotypes that exist in video games and accept “a social responsibility to mankind”.</p><p>“These negative stereotypes affect the identity of individuals in these groups. They affect the way people think and treat others in the real world, and perpetuate the social injustices that occur in these different groups,” he said, according to Polygon.</p><p>“We should use the ability of our medium to show players the issues first-hand, or give them a unique understanding of the issues and complexities by crafting game mechanics along with narrative components that result in dynamics of play that create meaning for the player in ways that other media isn’t capable of.”<br> femshep</br></p><p>He says it’s “very cynical” to assume the audience isn’t capable of embracing a gay hero or heroine, or “more exclusive women protagonists in games that aren’t glorified sex objects and actually have personalities beyond supporting the men in the game”, GamesIndustry International’s report added.</p><p>Realism arguments – ie that women weren’t soldiers in medieval times, for example – are “laughable” excuses, he said. Dragons didn’t exist either.</p><p>‘But the audience doesn’t respond as well to heroes who aren’t white males!’ – ie those games sell fewer copies. Hogwash, he argued. Those untypical games simply don’t have the investment the typical blockbusters do.</p></blockquote><p>I’m not sure what is more astonishing, how the rabbits all follow the exact same script every time and pretend that it is somehow going to magically play out differently this time, or the fact that a fair number of idiots are going to buy into the insane argument. After all, what young male game aficionado doesn’t want to sign up to be lectured to when he sits down to commit mayhem on some innocent orcs or aliens?</p><p>This is only one of the many reasons I quit going to CGDC after it became GDC. Social responsibility? Fuck that. Games concern electronic entertainment, nothing more and nothing less.</p><p>And notice that all of Heir’s “arguments” are nothing but mere assertions, devoid of any evidence or even logic. It shows his complete divorce from sanity when he claims that basic historical reality is “laughable”. And speaking as one who has been involved in the financial analysis of more than 200 games, “investment” is not the sole determinant of a successful game; many a million-seller has been developed on a relative shoestring. Heir doesn’t understand that since dragons don’t exist, one can do what one wants with them. But taking a woman and making her a kickass ninja warrior <i>necessarily </i>means that she ceases to be a woman in any meaningful or recognizable manner, she becomes a man with cosmetic female attributes.</p><p>This has become clear to me after reading two David Weber novels. In his attempt to be sexually egalitarian, he has essentially removed all actual women from his books. There isn’t a single female character whose sex one could not change to male and have the change go almost completely unnoticed in terms of “her” behavior.</p></div>",
  "content_text": "Not content with having all but destroyed SF/F, the ever-restless Pink Horde is now\nlaying siege to the video game industry\n:\nBioWare Montreal’s gameplay designer Manveer Heir received a standing ovation for his rousing “Misogyny, Racism and Homophobia: Where Do Video Games Stand?” talk at GDC yesterday. He challenged the industry to demolish the many stereotypes that exist in video games and accept “a social responsibility to mankind”.\n“These negative stereotypes affect the identity of individuals in these groups. They affect the way people think and treat others in the real world, and perpetuate the social injustices that occur in these different groups,” he said, according to Polygon.\n“We should use the ability of our medium to show players the issues first-hand, or give them a unique understanding of the issues and complexities by crafting game mechanics along with narrative components that result in dynamics of play that create meaning for the player in ways that other media isn’t capable of.”\nfemshep\nHe says it’s “very cynical” to assume the audience isn’t capable of embracing a gay hero or heroine, or “more exclusive women protagonists in games that aren’t glorified sex objects and actually have personalities beyond supporting the men in the game”, GamesIndustry International’s report added.\nRealism arguments – ie that women weren’t soldiers in medieval times, for example – are “laughable” excuses, he said. Dragons didn’t exist either.\n‘But the audience doesn’t respond as well to heroes who aren’t white males!’ – ie those games sell fewer copies. Hogwash, he argued. Those untypical games simply don’t have the investment the typical blockbusters do.\nI’m not sure what is more astonishing, how the rabbits all follow the exact same script every time and pretend that it is somehow going to magically play out differently this time, or the fact that a fair number of idiots are going to buy into the insane argument. After all, what young male game aficionado doesn’t want to sign up to be lectured to when he sits down to commit mayhem on some innocent orcs or aliens?\nThis is only one of the many reasons I quit going to CGDC after it became GDC. Social responsibility? Fuck that. Games concern electronic entertainment, nothing more and nothing less.\nAnd notice that all of Heir’s “arguments” are nothing but mere assertions, devoid of any evidence or even logic. It shows his complete divorce from sanity when he claims that basic historical reality is “laughable”. And speaking as one who has been involved in the financial analysis of more than 200 games, “investment” is not the sole determinant of a successful game; many a million-seller has been developed on a relative shoestring. Heir doesn’t understand that since dragons don’t exist, one can do what one wants with them. But taking a woman and making her a kickass ninja warrior\nnecessarily\nmeans that she ceases to be a woman in any meaningful or recognizable manner, she becomes a man with cosmetic female attributes.\nThis has become clear to me after reading two David Weber novels. In his attempt to be sexually egalitarian, he has essentially removed all actual women from his books. There isn’t a single female character whose sex one could not change to male and have the change go almost completely unnoticed in terms of “her” behavior.",
  "tags": [
    "games",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-21T13:00:00+00:00"
}