{
  "url": "https://voxday.net/2014/03/26/pro-vaccine-dishonesty/",
  "scraped_at": "2025-12-15T16:50:49.571789",
  "title": "Pro-vaccine dishonesty",
  "date_display": "March 26, 2014",
  "date_iso": "2014-03-26T11:08:00+00:00",
  "date_from_url": "2014-03-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you are an advocate of mass vaccination who wonders why more and more people simply don’t trust those who are pushing vaccines on everyone, these two quotes from <a href=\"http://reason.com/archives/2014/03/25/should-vaccines-be-mandatory/1\">a vaccine debate on Reason</a> should suffice to illustrate why:</p><blockquote class=\"tr_bq\"><p> <b>PRO: </b>A 2007 article in the <em>Journal of the American Medical<br> Association</br></em> compared the annual average number of cases and<br> resulting deaths of various diseases before the advent of vaccines<br> to those occurring in 2006. Before an effective diphtheria vaccine<br> was developed in the 1930s, for example, the disease infected about<br> 21,000 people in the United States each year, killing 1,800. By<br> 2006 both numbers were zero. Polio, too, went from deadly (16,000<br> cases, 1,900 deaths) to non-existent after vaccines were rolled out<br> in the 1950s and 1960s. Chickenpox used to infect 4 million kids a<br> year, hospitalize 11,000, and kill 105; within a decade of a<br> vaccine being rolled out in the mid-1990s, infections had dropped<br> to 600,000, resulting in 1,276 hospitalizations and 19 deaths.<br> Similar dramatic results can be found with whooping cough, measles,<br> rubella, and more.</br></br></br></br></br></br></br></br></br></br></br></br></p><p><b>CON:</b> Judging from what one reads and hears in the popular media, it is easy to conclude that the science is settled, that the benefits of each vaccine clearly outweigh the risks, and that vaccinations have played the critical role in the decline of deaths due to infectious diseases such as measles, whooping cough, and diphtheria, all of which claimed many lives in the past.</p><p>However even a cursory look at the available data quickly reveals that the mortality from almost all infectious disease was in steep decline well before the introduction of vaccination or antibiotics. Diphtheria mortality had fallen 60 percent by the time vaccination was introduced in the 1920s, deaths from pertussis/whooping cough had declined by 98 percent before vaccination was introduced in the late 1940s, measles mortality had dropped 98 percent from its peak in the U.S. by the time measles inoculation was introduced in 1963-and by an impressive 99.96 percent in England when measles vaccination was introduced in 1968. In 1960 there were 380 deaths from measles among a U.S. population of 180,671,000, a rate of 0.24 deaths per 100,000.</p><p>The takeaway here is that vaccination played a very minor role in the steep decline in mortality due to infectious disease during the late 19th century and early to mid- 20th century. Improved living standards, better nutrition, sanitary sewage disposal, clean water, and less crowded living conditions all played crucial roles.</p></blockquote><p>Again and again and again, we see the pro-vaccine side playing very fast and loose with the truth. They intentionally try to claim statistical benefits for mass vaccination that cannot possibly be attributed to it, even as the pharmaceutical companies disavow any responsibility for the products that they are lobbying to have legally imposed upon children who cannot possibly consent to having foreign substances injected into their bodies.</p><p>The vaccine lobby is a corrupt big government abomination that would vaccinate for oxygen if it could get away with it and no one who describes himself as a libertarian or even a conservative should support it in any way, shape, or form, regardless of his belief in the efficacy of vaccination. There is absolutely no libertarian case for mandatory vaccination and anyone who claims there is identifies himself as an ideological fraud.</p></div>",
  "content_text": "If you are an advocate of mass vaccination who wonders why more and more people simply don’t trust those who are pushing vaccines on everyone, these two quotes from\na vaccine debate on Reason\nshould suffice to illustrate why:\nPRO:\nA 2007 article in the\nJournal of the American Medical\nAssociation\ncompared the annual average number of cases and\nresulting deaths of various diseases before the advent of vaccines\nto those occurring in 2006. Before an effective diphtheria vaccine\nwas developed in the 1930s, for example, the disease infected about\n21,000 people in the United States each year, killing 1,800. By\n2006 both numbers were zero. Polio, too, went from deadly (16,000\ncases, 1,900 deaths) to non-existent after vaccines were rolled out\nin the 1950s and 1960s. Chickenpox used to infect 4 million kids a\nyear, hospitalize 11,000, and kill 105; within a decade of a\nvaccine being rolled out in the mid-1990s, infections had dropped\nto 600,000, resulting in 1,276 hospitalizations and 19 deaths.\nSimilar dramatic results can be found with whooping cough, measles,\nrubella, and more.\nCON:\nJudging from what one reads and hears in the popular media, it is easy to conclude that the science is settled, that the benefits of each vaccine clearly outweigh the risks, and that vaccinations have played the critical role in the decline of deaths due to infectious diseases such as measles, whooping cough, and diphtheria, all of which claimed many lives in the past.\nHowever even a cursory look at the available data quickly reveals that the mortality from almost all infectious disease was in steep decline well before the introduction of vaccination or antibiotics. Diphtheria mortality had fallen 60 percent by the time vaccination was introduced in the 1920s, deaths from pertussis/whooping cough had declined by 98 percent before vaccination was introduced in the late 1940s, measles mortality had dropped 98 percent from its peak in the U.S. by the time measles inoculation was introduced in 1963-and by an impressive 99.96 percent in England when measles vaccination was introduced in 1968. In 1960 there were 380 deaths from measles among a U.S. population of 180,671,000, a rate of 0.24 deaths per 100,000.\nThe takeaway here is that vaccination played a very minor role in the steep decline in mortality due to infectious disease during the late 19th century and early to mid- 20th century. Improved living standards, better nutrition, sanitary sewage disposal, clean water, and less crowded living conditions all played crucial roles.\nAgain and again and again, we see the pro-vaccine side playing very fast and loose with the truth. They intentionally try to claim statistical benefits for mass vaccination that cannot possibly be attributed to it, even as the pharmaceutical companies disavow any responsibility for the products that they are lobbying to have legally imposed upon children who cannot possibly consent to having foreign substances injected into their bodies.\nThe vaccine lobby is a corrupt big government abomination that would vaccinate for oxygen if it could get away with it and no one who describes himself as a libertarian or even a conservative should support it in any way, shape, or form, regardless of his belief in the efficacy of vaccination. There is absolutely no libertarian case for mandatory vaccination and anyone who claims there is identifies himself as an ideological fraud.",
  "tags": [
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-26T11:08:00+00:00"
}