{
  "url": "https://voxday.net/2014/03/20/programmer-prostitutes_20/",
  "scraped_at": "2025-12-15T16:50:10.543942",
  "title": "Programmer-prostitutes  #icanprogramming",
  "date_display": "March 20, 2014",
  "date_iso": "2014-03-20T13:00:00+00:00",
  "date_from_url": "2014-03-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In the end, that’s what the result of GRLZ CAN 2 CODE and pushing more women into pseudo-programming degrees is going to be. <a href=\"http://apieconomist.com/blog/2013/5/20/what-does-a-developer-evangelist-do\">Using their sex to sell software</a> to real programmers. Consider the function of the “developer evangelist”:</p><blockquote class=\"tr_bq\"><p> Developer evangelists are definitely a different<br> breed. You have to, on the one hand, have the technical chops to be able to<br> code software, and on the other hand, have the ability to talk about it. I know<br> a lot of people that are knee deep in their technical savvy, but when it comes<br> to explaining it to someone who’s never used it before, they fall short. You<br> need someone that can not only walk the walk, but talk the talk and communicate<br> it to the community.</br></br></br></br></br></br></p><div class=\"normal\"> Developer evangelists should also<br> be forward thinking. You need visionaries who can assess the developer<br> community and see how you should be steering the ship. Otherwise, the developer<br> program might not necessarily take off. Developer evangelists need to be community<br> focused. This means elevating the developer community. It means being present<br> and going out there and working with the developer community.</br></br></br></br></br></div></blockquote><p>As<br> it happens, I was an developer evangelist back in 1990, back when Apple<br> first popularized the concept. The formal title on my card was<br> “Transdimensional Evangelist” and my job was to visit the various hardware<br> manufacturers and computer game developers and convince them that they should be focused<br> on 3D-acceleration hardware, not MPEG-decompression hardware, for their<br> next generation of video cards and games. I was initially unsuccessful, but as I had been telling them, the superior technology won out in the end. It may be almost impossible to imagine now, but at the time, the vast majority of the industry was convinced that accelerated 2D video was the future, because 3D was flat-shaded, processor-intensive, and ugly… never mind that one could do so much more with it.</br></br></br></br></br></br></p><p>Now, unlike<br> most “evangelists”, I was actively involved on the strategic development<br> side; as it happens, I was the individual solely responsible for a chip<br> designed for the CAD market also having the critical features required<br> for the game development community; namely, accelerated Gouraud-shading<br> and texture mapping. I even named the chip: the 3GA. It’s not an accident that Creative Labs didn’t hold the original trademark on “3D Blaster”. However, (and this<br> is the relevant part), I was under no illusion that being the industry’s<br> first evangelist for the inevitable move from 2D to 3D made me an engineer, much<br> less a chip designer.</br></br></br></br></br></br></br></br></p><p>You may recall that I’ve said one<br> reason women are unlikely to succeed in programming per se is because<br> they tend to have an allergy to being held responsible for their own work.<br> This is mere anecdotal evidence, not conclusive proof, but consider what<br> sort of “technical chops” are required for this “developer” to “walk<br> the walk”:</br></br></br></br></br></p><blockquote class=\"tr_bq\"><p> I’ve had issues where my code<br> didn’t necessarily compile on the first try, and it’s great, because, all<br> of a sudden, you see them trying to figure it out with you, and it becomes an<br> engaging activity, as opposed to walking through a bunch of slides.</br></br></br></p></blockquote><p>Isn’t that great? When you can’t do your job on your own but can get someone to help you figure out how to do it? And isn’t that totally unexpected and not at all anticipated by anyone who is sufficiently familiar with the female approach to technological responsibility?</p><p>This<br> is not to say there isn’t a place for women in technology. Nor is there<br> anything wrong with saleswomen actually knowing what they are talking<br> about; in fact, this is actually a highly desirable development. But what is<br> wrong is the pretense that this is not the probable outcome of a computer science degree, or that the<br> evangelist, (which is a function that combines marketing and strategic<br> sales), is even performing a production-related job at all.</br></br></br></br></br></br></p><p>And this part cracked me up:</p><blockquote class=\"tr_bq\"><p> Right now, some of the most interesting mobile app developers I know are people who started programming just two years ago. But they’re able to plug stuff together now in such a way to make something that’s cool.</p></blockquote><p>Developers who aren’t Gamma programmers and didn’t study computer science engineering at university are always the most interesting, are they not? And they must be bang-up programmers to have picked it up so quickly!</p></div>",
  "content_text": "In the end, that’s what the result of GRLZ CAN 2 CODE and pushing more women into pseudo-programming degrees is going to be.\nUsing their sex to sell software\nto real programmers. Consider the function of the “developer evangelist”:\nDeveloper evangelists are definitely a different\nbreed. You have to, on the one hand, have the technical chops to be able to\ncode software, and on the other hand, have the ability to talk about it. I know\na lot of people that are knee deep in their technical savvy, but when it comes\nto explaining it to someone who’s never used it before, they fall short. You\nneed someone that can not only walk the walk, but talk the talk and communicate\nit to the community.\nDeveloper evangelists should also\nbe forward thinking. You need visionaries who can assess the developer\ncommunity and see how you should be steering the ship. Otherwise, the developer\nprogram might not necessarily take off. Developer evangelists need to be community\nfocused. This means elevating the developer community. It means being present\nand going out there and working with the developer community.\nAs\nit happens, I was an developer evangelist back in 1990, back when Apple\nfirst popularized the concept. The formal title on my card was\n“Transdimensional Evangelist” and my job was to visit the various hardware\nmanufacturers and computer game developers and convince them that they should be focused\non 3D-acceleration hardware, not MPEG-decompression hardware, for their\nnext generation of video cards and games. I was initially unsuccessful, but as I had been telling them, the superior technology won out in the end. It may be almost impossible to imagine now, but at the time, the vast majority of the industry was convinced that accelerated 2D video was the future, because 3D was flat-shaded, processor-intensive, and ugly… never mind that one could do so much more with it.\nNow, unlike\nmost “evangelists”, I was actively involved on the strategic development\nside; as it happens, I was the individual solely responsible for a chip\ndesigned for the CAD market also having the critical features required\nfor the game development community; namely, accelerated Gouraud-shading\nand texture mapping. I even named the chip: the 3GA. It’s not an accident that Creative Labs didn’t hold the original trademark on “3D Blaster”. However, (and this\nis the relevant part), I was under no illusion that being the industry’s\nfirst evangelist for the inevitable move from 2D to 3D made me an engineer, much\nless a chip designer.\nYou may recall that I’ve said one\nreason women are unlikely to succeed in programming per se is because\nthey tend to have an allergy to being held responsible for their own work.\nThis is mere anecdotal evidence, not conclusive proof, but consider what\nsort of “technical chops” are required for this “developer” to “walk\nthe walk”:\nI’ve had issues where my code\ndidn’t necessarily compile on the first try, and it’s great, because, all\nof a sudden, you see them trying to figure it out with you, and it becomes an\nengaging activity, as opposed to walking through a bunch of slides.\nIsn’t that great? When you can’t do your job on your own but can get someone to help you figure out how to do it? And isn’t that totally unexpected and not at all anticipated by anyone who is sufficiently familiar with the female approach to technological responsibility?\nThis\nis not to say there isn’t a place for women in technology. Nor is there\nanything wrong with saleswomen actually knowing what they are talking\nabout; in fact, this is actually a highly desirable development. But what is\nwrong is the pretense that this is not the probable outcome of a computer science degree, or that the\nevangelist, (which is a function that combines marketing and strategic\nsales), is even performing a production-related job at all.\nAnd this part cracked me up:\nRight now, some of the most interesting mobile app developers I know are people who started programming just two years ago. But they’re able to plug stuff together now in such a way to make something that’s cool.\nDevelopers who aren’t Gamma programmers and didn’t study computer science engineering at university are always the most interesting, are they not? And they must be bang-up programmers to have picked it up so quickly!",
  "tags": [
    "technology",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-20T13:00:00+00:00"
}