{
  "url": "https://voxday.net/2014/03/18/same-as-he-ever-was/",
  "scraped_at": "2025-12-16T12:12:11.128353",
  "title": "Same as he ever was",
  "date_display": "March 18, 2014",
  "date_iso": "2014-03-18T17:00:00+00:00",
  "date_from_url": "2014-03-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You may recall that I <a href=\"http://www.milobookclub.com/2013/08/27/gotcha/\">previously demonstrated</a> that John Scalzi’s claim to have 50,000 daily readers was a 12x exaggeration of his actual daily blog readership in 2013, which was 20,600 daily pageviews and 4,085 daily readers. As it turns out, this significant exaggeration of his site traffic and his influence was nothing new.  Consider this post from July 2009, in which <a href=\"http://whatever.scalzi.com/2009/07/03/and-yes-in-fact-while-were-on-the-subject-of-the-big-three/#comment-153270\">he arrogantly claimed that he was more influential</a> than the three major SF publications, Analog, Asimov’s, and Fantasy &amp; Science Fiction, combined.</p><blockquote class=\"tr_bq\"><p> <b>Brad Torgersen:</b> <i>“Unless the work you’re writing is not the sort that fits any of the<br> Big Three, why would you allow the format and method of submission to<br> stop you from sending to the three markets still considered to be the<br> Top Dogs in short F and SF fiction?”</br></br></br></i></p><p><b>John Scalzi:</b> “Because it would cost me money to buy a printer, paper and ink, the<br> rate they pay is shite, and I can reach more people on my Web site in a<br> day than any two of them can in a month.”</br></br></p></blockquote><p> In July 2009, Whatever had 300,487 monthly pageviews, or 9,613 per day. That meant he had about 1,940 daily readers. In 2009, Analog’s monthly circulation was 25,418 and Asimov’s was 16,696. It will probably not escape the mathematically literate observer’s attention that 42,114 is more than 1,940. So, five years ago, he was exaggerating his site traffic by a factor of 21.7. His absurd 2013 claims are actually <i>less </i>exaggerated than his previous claims.</p><p>And, of course, he was aggressively policing his potential critics even then.</p><blockquote class=\"tr_bq\"><p> Just as a general note, as I’ve told Brad to move on from this thread, directing comments to him specifically will be frustrating for him, and will not get actual responses.</p></blockquote><p>Those who have recently lost respect for John Scalzi were simply not paying sufficient attention to his antics before. He’s precisely the same narcissistic con man that he’s always been, the only difference is that now he is less able to successfully control the narrative and spin a self-serving web of deceit because an increasing number of people in the SF/F world are aware of the facts and are able to see through his incessantly fraudulent activity.</p><p>As Bernie Madoff learned, eventually people figure out the con. Mr. Scalzi may not yet have come to terms with the fact that the jig is up yet, but sooner or later, he will have to do so.</p><p><i>“WHEN YOU SEE FRAUD, SHOUT FRAUD.”</i><br> – Nassem Talib</br></p></div>",
  "content_text": "You may recall that I\npreviously demonstrated\nthat John Scalzi’s claim to have 50,000 daily readers was a 12x exaggeration of his actual daily blog readership in 2013, which was 20,600 daily pageviews and 4,085 daily readers. As it turns out, this significant exaggeration of his site traffic and his influence was nothing new.  Consider this post from July 2009, in which\nhe arrogantly claimed that he was more influential\nthan the three major SF publications, Analog, Asimov’s, and Fantasy & Science Fiction, combined.\nBrad Torgersen:\n“Unless the work you’re writing is not the sort that fits any of the\nBig Three, why would you allow the format and method of submission to\nstop you from sending to the three markets still considered to be the\nTop Dogs in short F and SF fiction?”\nJohn Scalzi:\n“Because it would cost me money to buy a printer, paper and ink, the\nrate they pay is shite, and I can reach more people on my Web site in a\nday than any two of them can in a month.”\nIn July 2009, Whatever had 300,487 monthly pageviews, or 9,613 per day. That meant he had about 1,940 daily readers. In 2009, Analog’s monthly circulation was 25,418 and Asimov’s was 16,696. It will probably not escape the mathematically literate observer’s attention that 42,114 is more than 1,940. So, five years ago, he was exaggerating his site traffic by a factor of 21.7. His absurd 2013 claims are actually\nless\nexaggerated than his previous claims.\nAnd, of course, he was aggressively policing his potential critics even then.\nJust as a general note, as I’ve told Brad to move on from this thread, directing comments to him specifically will be frustrating for him, and will not get actual responses.\nThose who have recently lost respect for John Scalzi were simply not paying sufficient attention to his antics before. He’s precisely the same narcissistic con man that he’s always been, the only difference is that now he is less able to successfully control the narrative and spin a self-serving web of deceit because an increasing number of people in the SF/F world are aware of the facts and are able to see through his incessantly fraudulent activity.\nAs Bernie Madoff learned, eventually people figure out the con. Mr. Scalzi may not yet have come to terms with the fact that the jig is up yet, but sooner or later, he will have to do so.\n“WHEN YOU SEE FRAUD, SHOUT FRAUD.”\n– Nassem Talib",
  "tags": [
    "McRapey",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-18T17:00:00+00:00"
}