{
  "url": "https://voxday.net/2014/03/25/setting-record-straight-again/",
  "scraped_at": "2025-12-15T16:50:42.255012",
  "title": "Setting the record straight… again",
  "date_display": "March 25, 2014",
  "date_iso": "2014-03-25T10:10:00+00:00",
  "date_from_url": "2014-03-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to admit that I do not understand how lying about my easily confirmed CV is supposed to serve as a substantive form of criticism.  Do these critics imagine that denying history is a valid and convincing form of rhetoric? I recently mentioned that when critics attempt to dig through my words in search of a disqualifying quote, they tend to forget that I started as a nationally syndicated columnist. In other words, unlike the average person blithely expressing himself on the Internet, I have always been aware that my statements are public and will be carefully examined for critical purposes.</p><p>This prompted the following response:</p><blockquote class=\"tr_bq\"><p> You<br> mean “World Net Daily? LOL….. You know, they’ll give a column to<br> anyone with a heartbeat and a willingness to say nasty things about<br> black people. Not really something to brag about . Especially since your daddy got you the job, he having been on the board of directors.</br></br></br></p></blockquote><p>No, I did not mean WND. This should be obvious, given that WND is not a national syndicate. I began writing a column for the St. Paul Pioneer Press in 1994. This column was picked up for national syndication by Chronicle Features, the syndicate arm of the San Franscisco Chronicle, in 1995. I was the sixth columnist in the Pioneer Press’s 145-year history to be syndicated. The syndicated column was picked up by the Boston Globe and the Atlanta Journal/Constitution, among others. My favorite was the North Bay Nugget. During this time I also wrote several major reviews for Computer Gaming World and Electronic Entertainment, such as those on <i>Heretic</i>, <i>Dark Forces</i>, and <i>TIE Fighter</i>.</p><p>I did not begin writing for WND until 2001. It soon became the third most-popular weekly column there after Ann Coulter’s and Pat Buchanan’s and was nationally syndicated by Universal Press Syndicate two years later. My father did not get me the job there. Nor can that column even be reasonably be described as a job, as I never took money from WND for any of those columns.</p><p>Another critic asserted a non-existent double standard.</p><blockquote class=\"tr_bq\"><p> The point is that Vox’s double standards is funny. He gets a little<br> uppity about people taking him out of context, but has no problem doing<br> the same. It’s funny. Even funnier though is his touting of his “column”<br> at WND that his daddy insisted he be given. And it was so meaningful.<br> People still talk about the amazing insights he offered. We know the<br> import of his views based on the many offers he’s had to recreate this<br> column elsewhere.</br></br></br></br></br></br></p></blockquote><p>First, I don’t take people out of context. Second, my daddy didn’t insist that I be given a “column” at WND; Joseph Farah asked my father if I would be willing to write a column there. Third, I am contacted by various news sites inquiring if I might be interested in contributing to them on a fairly regular basis. And then there was this pair of individuals who questioned my veracity concerning a pair of game advances that were each worth more than 60+ times an advance that Mr. Scalzi bragged about:</p><blockquote class=\"tr_bq\"><p> “Ha, there is no way this is true. What was the advance for and when?”</p><p>“$2.4 Million in advances in one year. Not bad….RIGHT…….And yet, still no game from Vox Day. You<br> just have to wonder how far the guy will go to soothe his envy of<br> another writer who outpaces him so consistently. It’s a little vulgar.”</br></br></p></blockquote><p>As it happens, the two advances that year were rather more than $2.4 million combined; there is an article in the Star Tribune which specifically discusses a $1.8 million advance that Fenris Wolf received for one of the two contracts mentioned. I’m not envious of a writer who brags about $20,000 advances. I’m not even envious of one of my European friends who received an advance more than ten times bigger than that on his most recently published novel. I don’t want to receive advances from anyone.</p><p>Those are the facts. The publicly available and undeniable facts. It is true that many are not familiar with them as I don’t often discuss these things, and in fact, I would not be inclined to mention them at all if they were not already public information. But they are what they are, as anyone can readily determine for himself. The problem, I suspect, is that when facts get in the way of the favored narrative, these critics prefer to reject those facts instead of modifying their narrative accordingly.</p></div>",
  "content_text": "I have to admit that I do not understand how lying about my easily confirmed CV is supposed to serve as a substantive form of criticism.  Do these critics imagine that denying history is a valid and convincing form of rhetoric? I recently mentioned that when critics attempt to dig through my words in search of a disqualifying quote, they tend to forget that I started as a nationally syndicated columnist. In other words, unlike the average person blithely expressing himself on the Internet, I have always been aware that my statements are public and will be carefully examined for critical purposes.\nThis prompted the following response:\nYou\nmean “World Net Daily? LOL….. You know, they’ll give a column to\nanyone with a heartbeat and a willingness to say nasty things about\nblack people. Not really something to brag about . Especially since your daddy got you the job, he having been on the board of directors.\nNo, I did not mean WND. This should be obvious, given that WND is not a national syndicate. I began writing a column for the St. Paul Pioneer Press in 1994. This column was picked up for national syndication by Chronicle Features, the syndicate arm of the San Franscisco Chronicle, in 1995. I was the sixth columnist in the Pioneer Press’s 145-year history to be syndicated. The syndicated column was picked up by the Boston Globe and the Atlanta Journal/Constitution, among others. My favorite was the North Bay Nugget. During this time I also wrote several major reviews for Computer Gaming World and Electronic Entertainment, such as those on\nHeretic\n,\nDark Forces\n, and\nTIE Fighter\n.\nI did not begin writing for WND until 2001. It soon became the third most-popular weekly column there after Ann Coulter’s and Pat Buchanan’s and was nationally syndicated by Universal Press Syndicate two years later. My father did not get me the job there. Nor can that column even be reasonably be described as a job, as I never took money from WND for any of those columns.\nAnother critic asserted a non-existent double standard.\nThe point is that Vox’s double standards is funny. He gets a little\nuppity about people taking him out of context, but has no problem doing\nthe same. It’s funny. Even funnier though is his touting of his “column”\nat WND that his daddy insisted he be given. And it was so meaningful.\nPeople still talk about the amazing insights he offered. We know the\nimport of his views based on the many offers he’s had to recreate this\ncolumn elsewhere.\nFirst, I don’t take people out of context. Second, my daddy didn’t insist that I be given a “column” at WND; Joseph Farah asked my father if I would be willing to write a column there. Third, I am contacted by various news sites inquiring if I might be interested in contributing to them on a fairly regular basis. And then there was this pair of individuals who questioned my veracity concerning a pair of game advances that were each worth more than 60+ times an advance that Mr. Scalzi bragged about:\n“Ha, there is no way this is true. What was the advance for and when?”\n“$2.4 Million in advances in one year. Not bad….RIGHT…….And yet, still no game from Vox Day. You\njust have to wonder how far the guy will go to soothe his envy of\nanother writer who outpaces him so consistently. It’s a little vulgar.”\nAs it happens, the two advances that year were rather more than $2.4 million combined; there is an article in the Star Tribune which specifically discusses a $1.8 million advance that Fenris Wolf received for one of the two contracts mentioned. I’m not envious of a writer who brags about $20,000 advances. I’m not even envious of one of my European friends who received an advance more than ten times bigger than that on his most recently published novel. I don’t want to receive advances from anyone.\nThose are the facts. The publicly available and undeniable facts. It is true that many are not familiar with them as I don’t often discuss these things, and in fact, I would not be inclined to mention them at all if they were not already public information. But they are what they are, as anyone can readily determine for himself. The problem, I suspect, is that when facts get in the way of the favored narrative, these critics prefer to reject those facts instead of modifying their narrative accordingly.",
  "tags": [
    "anklebiters"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-25T10:10:00+00:00"
}