{
  "url": "https://voxday.net/2014/03/07/sounds-just-like-sfwa/",
  "scraped_at": "2025-12-15T16:48:31.501505",
  "title": "Sounds just like SFWA",
  "date_display": "March 7, 2014",
  "date_iso": "2014-03-07T21:00:00+00:00",
  "date_from_url": "2014-03-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What is happening <a href=\"http://www.dailymail.co.uk/news/article-2575759/Revealed-Islamist-plot-dubbed-Trojan-Horse-string-schools-Birmingham-self-styled-Jihad.html\">in Birmingham, England</a> is pretty much what happened over the last 20 years at the SF/F publishers, and what is happening right now in SFWA:</p><blockquote class=\"tr_bq\"><p> Islamic fundamentalists are allegedly plotting to convert Birmingham schools so that children are taught according to strict Islamic codes by ousting teachers through a dirty tricks campaign and replacing them with radicals. The city council and the Birmingham Mail have received documents which purport to show that jihadists – or those fighting against non-Muslims – are targeting schools and orchestrating false allegations against staff, including non-Muslims, in an operation dubbed Trojan Horse.</p></blockquote><p>The SFWA knows all about false allegations; it has <a href=\"http://www.voxday.net/mart/SFWA_response.pdf\">an entire report full of them</a>. Notice that even on Wikipedia, the SFWA action is falsely reported.</p><p><i>“In June, Beale used the SFWA Twitter feed to post several controversial links to his blog, in which he called an African-American author a “half-savage” and an editor a “fat frog.”. After complaints from members, in August, the SFWA Board announced that they were expelling Beale as a member due to violations of their by-laws. Beale posted a letter from the SFWA president to his blog.”</i></p><p>Let’s count the errors: <i><br/></i></p><ol><li>I used the @swfaauthors feed, not the official SFWA one. They are two different Twitter accounts.</li><li>I did not post several controversial links to my blog. I posted one link and it contained nothing controversial. It was the blog post that was controversial, not the Tweet.</li><li>The SFWA Board did not announce that they were expelling me. They did not name the member expelled in their announcement. As <a href=\"http://www.locusmag.com/News/2013/08/beale-expelled-from-sfwa/\">Locus Online correctly noted</a>, I was the one who announced my expulsion.</li><li>The SFWA Board did not announce I was expelled due to violations of their by-laws. The SFWA Board <a href=\"http://www.sfwa.org/2013/08/board-communication-on-member-expulsion/\">did not give any reason</a> for the expulsion of the unnamed member expelled.</li><li>To be complete, I referred to N.K. Jemisin as “an educated, but ignorant half-savage, with little more understanding of<br> what it took to build a new literature by ‘a bunch of beardy old<br> middle-class middle-American guys’ than an illiterate Igbotu tribesman<br> has of how to build a jet engine” and I stand by the assertion. I also pointed out that she is a liar.</br></br></br></li><li>In addition to her resemblance to an overweight amphibian, I also observed that Teresa Nielsen Hayden is “grotesquely malformed” and does not appear to belong to the same species or phylum as my wife.</li></ol><p>The SFWA are irreligious fundamentalists, they just happen to be softer, squishier, and more cowardly than the Islamic variety. And this is why diversity is always and everywhere doomed. Let one rabbit in, and its priority is always to get another rabbit in there with it. Once accomplished, the breeding begins. And when they feel they have sufficient numbers, they begin forcing all the not-rabbits out.</p></div>",
  "content_text": "What is happening\nin Birmingham, England\nis pretty much what happened over the last 20 years at the SF/F publishers, and what is happening right now in SFWA:\nIslamic fundamentalists are allegedly plotting to convert Birmingham schools so that children are taught according to strict Islamic codes by ousting teachers through a dirty tricks campaign and replacing them with radicals. The city council and the Birmingham Mail have received documents which purport to show that jihadists – or those fighting against non-Muslims – are targeting schools and orchestrating false allegations against staff, including non-Muslims, in an operation dubbed Trojan Horse.\nThe SFWA knows all about false allegations; it has\nan entire report full of them\n. Notice that even on Wikipedia, the SFWA action is falsely reported.\n“In June, Beale used the SFWA Twitter feed to post several controversial links to his blog, in which he called an African-American author a “half-savage” and an editor a “fat frog.”. After complaints from members, in August, the SFWA Board announced that they were expelling Beale as a member due to violations of their by-laws. Beale posted a letter from the SFWA president to his blog.”\nLet’s count the errors:\nI used the @swfaauthors feed, not the official SFWA one. They are two different Twitter accounts.\nI did not post several controversial links to my blog. I posted one link and it contained nothing controversial. It was the blog post that was controversial, not the Tweet.\nThe SFWA Board did not announce that they were expelling me. They did not name the member expelled in their announcement. As\nLocus Online correctly noted\n, I was the one who announced my expulsion.\nThe SFWA Board did not announce I was expelled due to violations of their by-laws. The SFWA Board\ndid not give any reason\nfor the expulsion of the unnamed member expelled.\nTo be complete, I referred to N.K. Jemisin as “an educated, but ignorant half-savage, with little more understanding of\nwhat it took to build a new literature by ‘a bunch of beardy old\nmiddle-class middle-American guys’ than an illiterate Igbotu tribesman\nhas of how to build a jet engine” and I stand by the assertion. I also pointed out that she is a liar.\nIn addition to her resemblance to an overweight amphibian, I also observed that Teresa Nielsen Hayden is “grotesquely malformed” and does not appear to belong to the same species or phylum as my wife.\nThe SFWA are irreligious fundamentalists, they just happen to be softer, squishier, and more cowardly than the Islamic variety. And this is why diversity is always and everywhere doomed. Let one rabbit in, and its priority is always to get another rabbit in there with it. Once accomplished, the breeding begins. And when they feel they have sufficient numbers, they begin forcing all the not-rabbits out.",
  "tags": [
    "rabbitology",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-07T21:00:00+00:00"
}