{
  "url": "https://voxday.net/2014/03/19/the-stars-came-back/",
  "scraped_at": "2025-12-16T12:12:12.987355",
  "title": "THE STARS CAME BACK",
  "date_display": "March 19, 2014",
  "date_iso": "2014-03-19T09:28:00+00:00",
  "date_from_url": "2014-03-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.amazon.com/Stars-Came-Back-Rolf-Nelson-ebook/dp/B00J3F8Q0O\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/03/TSCB_900.jpg\" style=\"cursor: move;\" width=\"200\"/></a>Castalia House has been receiving an increasing number of submissions, so I didn’t think anything of it when Rolf Nelson sent me a copy of <a href=\"http://www.amazon.com/Stars-Came-Back-Rolf-Nelson-ebook/dp/B00J3F8Q0O\"><i><b>The Stars Came Back</b></i></a>. He said that it had been self-published for several months, which wasn’t necessarily a problem, (although we tend to favor unpublished submissions), and provided a link to the Amazon site as well. I had a quick look at the book, as is my custom before deciding to which of our ten crack Readers I would send it; the First Line of Defense is fairly ruthless in their rejections of anything they believe does not fit the model. And my first thought was “what the hell is this?” This was apparently not the first time such a thought had been inspired by the book, for as it turned out, as all three Readers immediately came back to me expressing precisely the same sentiment before they’d really even started it.</p><p>One Reader threw up his hands and said he simply couldn’t deal with the script-style format. Another one read it and said that he loved the story and would recommend acceptance if it was rewritten in conventional format. The third, and I quote, said: “this story is like gold” and urged immediate acceptance as is.</p><p>Well, that’s tremendously helpful…. But it did indicate a closer look into the matter. So I went to Amazon to read through the… 55+ customer reviews? Tom Kratman’s <a href=\"http://www.amazon.com/dp/B00IKT7HQI\"><i><b>Big Boys Don’t Cry</b></i></a> has been selling very well and has only 31 reviews to date. Then I had the chance to read a bit more myself and the reason for the number of reviews began to make sense. Let’s just say that if <i>Firefly </i>still holds a warm place in your heart, you will very much enjoy Mr. Nelson’s work. Not that it is an imitation; it is not. But it hits a similar set of chords, only in a more intelligent manner.</p><p><a href=\"http://www.amazon.com/Stars-Came-Back-Rolf-Nelson-ebook/dp/B00J3F8Q0O\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/03/TSCB_old_200.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2014/03/TSCB_old_200.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a>Then it struck me: if so many people were enthusiastically reading this book despite its unusual format and a cover that tended to suggest “this book is self-published”, then we were obviously looking at a considerable story-telling talent. And at the end of the day, that is exactly what Castalia House wants in its novelists. So, I promptly called Mr. Nelson and offered him a contract, which he signed after consultation with his lawyer. As I mentioned in a previous post on Brad Torgersen’s paean to Baen, we look at Baen as an admirable model to follow and we are as interested in helping talented new authors like Mr. Nelson develop their talent as we are in publishing established authors like Mr. John C. Wright, who are already at the top of both their game and the SF genre.</p><p>Consider some of the reviews from those who have read <a href=\"http://www.amazon.com/Stars-Came-Back-Rolf-Nelson-ebook/dp/B00J3F8Q0O\"><b><i>The Stars Came Back</i></b></a>:</p><ul><li>Wow. It took about 5 pages to get used to the screenplay format.  After<br> that, the format really added to the mental images that the dialogue<br> creates.  The story is fast paced and physics used are consistent.  By<br> that I mean the physical laws the author imagines work the same way each<br> time.  That consistency definitely helps the storyline.  Several of the<br> other raters compare this to works by John Ringo,  I would agree and<br> probably add Larry Correia as well.  Not only is <b><i>The Stars Came Back<br> </br></i></b>enjoyable it is also thought provoking. </br></br></br></br></br></br></li><li> Without a doubt, the best read I have had in many a month – and I<br> average four novels per week. I was deeply engrossed in this novel and<br> was presently surprised by the content, the plot, and the editing. </br></br></li><li> The plot in this tale doesn’t just thicken, it twists through about<br> seven different dimensions, but maintains a most compelling theme. In<br> this imagined world, the attributes of humans that lead to the most<br> success are exactly as one would hope would work in OUR world – honesty,<br> independence, perseverance, reliability, morality. The protagonist<br> isn’t a perfect person, and knows it, but strives to do right by those<br> whose lives he touches, and to avoid having wrong done to him.</br></br></br></br></br></br></li><li> I can’t say enough good things about this story.  Excellent plot;<br> interesting, plausible characters; great pacing and storyline<br> development; and just fistfuls of nods to Star Wars, Star Trek,<br> Firefly/Serenity, the Bolo series (and Hammer’s Slammers), Lovecraft<br> mythos (kind of tangentially, but still there), The Forever War, and<br> probably several other fictional sci-fi universes as well.</br></br></br></br></br></li><li> The Stars Came Back is a good foray into the literary world. Lots of<br> shades of Heinlein and Weber, and a dose of Firefly mixed with<br> McCaffrey’s The Ship That Sang.</br></br></li></ul><p>So, I would encourage you to pick up a copy and see for yourself why we were so enthusiastic about Mr. Nelson’s first book. It is only $3.99 for 589 pages of pure science fiction entertainment.</p></div>",
  "content_text": "Castalia House has been receiving an increasing number of submissions, so I didn’t think anything of it when Rolf Nelson sent me a copy of\nThe Stars Came Back\n. He said that it had been self-published for several months, which wasn’t necessarily a problem, (although we tend to favor unpublished submissions), and provided a link to the Amazon site as well. I had a quick look at the book, as is my custom before deciding to which of our ten crack Readers I would send it; the First Line of Defense is fairly ruthless in their rejections of anything they believe does not fit the model. And my first thought was “what the hell is this?” This was apparently not the first time such a thought had been inspired by the book, for as it turned out, as all three Readers immediately came back to me expressing precisely the same sentiment before they’d really even started it.\nOne Reader threw up his hands and said he simply couldn’t deal with the script-style format. Another one read it and said that he loved the story and would recommend acceptance if it was rewritten in conventional format. The third, and I quote, said: “this story is like gold” and urged immediate acceptance as is.\nWell, that’s tremendously helpful…. But it did indicate a closer look into the matter. So I went to Amazon to read through the… 55+ customer reviews? Tom Kratman’s\nBig Boys Don’t Cry\nhas been selling very well and has only 31 reviews to date. Then I had the chance to read a bit more myself and the reason for the number of reviews began to make sense. Let’s just say that if\nFirefly\nstill holds a warm place in your heart, you will very much enjoy Mr. Nelson’s work. Not that it is an imitation; it is not. But it hits a similar set of chords, only in a more intelligent manner.\nThen it struck me: if so many people were enthusiastically reading this book despite its unusual format and a cover that tended to suggest “this book is self-published”, then we were obviously looking at a considerable story-telling talent. And at the end of the day, that is exactly what Castalia House wants in its novelists. So, I promptly called Mr. Nelson and offered him a contract, which he signed after consultation with his lawyer. As I mentioned in a previous post on Brad Torgersen’s paean to Baen, we look at Baen as an admirable model to follow and we are as interested in helping talented new authors like Mr. Nelson develop their talent as we are in publishing established authors like Mr. John C. Wright, who are already at the top of both their game and the SF genre.\nConsider some of the reviews from those who have read\nThe Stars Came Back\n:\nWow. It took about 5 pages to get used to the screenplay format.  After\nthat, the format really added to the mental images that the dialogue\ncreates.  The story is fast paced and physics used are consistent.  By\nthat I mean the physical laws the author imagines work the same way each\ntime.  That consistency definitely helps the storyline.  Several of the\nother raters compare this to works by John Ringo,  I would agree and\nprobably add Larry Correia as well.  Not only is\nThe Stars Came Back\nenjoyable it is also thought provoking.\nWithout a doubt, the best read I have had in many a month – and I\naverage four novels per week. I was deeply engrossed in this novel and\nwas presently surprised by the content, the plot, and the editing.\nThe plot in this tale doesn’t just thicken, it twists through about\nseven different dimensions, but maintains a most compelling theme. In\nthis imagined world, the attributes of humans that lead to the most\nsuccess are exactly as one would hope would work in OUR world – honesty,\nindependence, perseverance, reliability, morality. The protagonist\nisn’t a perfect person, and knows it, but strives to do right by those\nwhose lives he touches, and to avoid having wrong done to him.\nI can’t say enough good things about this story.  Excellent plot;\ninteresting, plausible characters; great pacing and storyline\ndevelopment; and just fistfuls of nods to Star Wars, Star Trek,\nFirefly/Serenity, the Bolo series (and Hammer’s Slammers), Lovecraft\nmythos (kind of tangentially, but still there), The Forever War, and\nprobably several other fictional sci-fi universes as well.\nThe Stars Came Back is a good foray into the literary world. Lots of\nshades of Heinlein and Weber, and a dose of Firefly mixed with\nMcCaffrey’s The Ship That Sang.\nSo, I would encourage you to pick up a copy and see for yourself why we were so enthusiastic about Mr. Nelson’s first book. It is only $3.99 for 589 pages of pure science fiction entertainment.",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-19T09:28:00+00:00"
}