{
  "url": "https://voxday.net/2014/03/10/the-ignorance-of-cosmos/",
  "scraped_at": "2025-12-15T16:48:47.365307",
  "title": "The ignorance ofCosmos",
  "date_display": "March 10, 2014",
  "date_iso": "2014-03-10T19:08:00+00:00",
  "date_from_url": "2014-03-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As expected, the science fetishists are cooing happily over <a href=\"http://blog.zap2it.com/frominsidethebox/2014/03/cosmos-review-neil-degrasse-tyson-brings-brilliant-science-questionable-history-to-the-world.html\">the latest media foray into demonstrable ignorance</a> of religious history:</p><blockquote class=\"tr_bq\"><p> Here’s the thing: Even “Cosmos” points out that Bruno had no scientific basis for his theories. “His vision of the cosmos was a lucky guess,” says Tyson. So why is the long-dead philosopher important enough to rate hero status? That would be because “Cosmos” takes his case as one of “martyrdom.”</p><p>What “Cosmos” does not point out to its audiences that the Catholic Church didn’t really care about Bruno’s views on the Earth moving around the Sun. His crimes — the ones for which he was executed — were theological. Several actual scientists in this period happily investigated the ideas of Copernicus’ theories without running into trouble. Even Galileo only got in trouble when he published books that directly mocked the Church’s adherence to the Earth being at the center.</p><p>Why does this matter?</p><p>So what if Giordano Bruno wasn’t a scientist and wasn’t executed for science? There are three big reasons why this does, in fact, matter and why it hurts “Cosmos” to get it wrong.</p><p>1. To borrow one of Tyson’s famous quotes, the good thing about science is that it’s true whether or not you believe in it. The same goes for history. Getting the history of science wrong hurts science itself. Why believe the science if other parts of the show are inaccurate?</p><p>2. Making Bruno into a martyr for science basically makes 100 years of historical research useless. The idea of Giordano Bruno as a scientific hero only originated in the 19th century, when he was championed by several historians. Since then, most have classified him as a philosopher sharing dangerous ideas in a dangerous time.</p><p>3. It’s an unstated goal of “Cosmos” to champion science and scientific reasoning over superstition and religious dogmatism. But you’re not going to win over anyone by vilifying religion in the face of science. Add in Bruno flying into space in an overtly crucifixion stance almost seems like giving religion the finger. You don’t win arguments that way, “Cosmos.”</p></blockquote><p>The strange thing is that the science fetishists are always talking about a hypothetical religious ignorance of science while openly demonstrating their own ignorance of history, in particular, the history of the very religion they denigrate on false bases. At least one atheist is aware of <a href=\"http://armariummagnus.blogspot.com/2009/10/gods-philosophers-how-medieval-world.html\">the historical illiteracy of his co-irreligionists</a>:</p><blockquote class=\"tr_bq\"><p> One of the occupational hazards of being an atheist and secular humanist who has the lack of common sense to hang around on atheist discussion boards is to encounter a staggering level of historical illiteracy. I like to console myself that many of the people on such boards have come to their atheism via the study of science and so, even if they are quite learned in things like geology and biology, usually have a grasp of history stunted at about high school level. I generally do this because the alternative is to admit that the average person’s grasp of history and how history is studied is so utterly feeble as to be totally depressing….</p><p>It’s not hard to kick this nonsense to pieces, especially since the<br> people presenting it know next to nothing about history and have simply<br> picked this [bullsh–] up from other websites and popular books and<br> collapse as soon as you hit them with some hard evidence. I love to<br> totally stump them by asking them to present me with the name of one –<br> just one – scientist burned, persecuted or oppressed for their science<br> in the Middle Ages. They always fail to come up with any. They usually<br> try to crowbar Galileo back into the Middle Ages, which is amusing<br> considering he was a contemporary of Descartes. When asked why they have<br> failed to produce any such scientists given the Church was apparently<br> so busily oppressing them, they often resort to claiming that the Evil<br> Old Church did such a good job of oppression that everyone was too<br> scared to practice science. By the time I produce a laundry list of<br> Medieval scientists – like Albertus Magnus, Robert Grosseteste, Roger<br> Bacon, John Peckham, Duns Scotus, Thomas Bradwardine, Walter Burley,<br> William Heytesbury, Richard Swineshead, John Dumbleton, Richard of<br> Wallingford, Nicholas Oresme, Jean Buridan and Nicholas of Cusa – and<br> ask why these men were happily pursuing science in the Middle Ages<br> without molestation from the Church, my opponents have usually run away<br> to hide and scratch their heads in puzzlement at what just went wrong….</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p><i>Cosmos </i>must have him groaning with despair.</p></div>",
  "content_text": "As expected, the science fetishists are cooing happily over\nthe latest media foray into demonstrable ignorance\nof religious history:\nHere’s the thing: Even “Cosmos” points out that Bruno had no scientific basis for his theories. “His vision of the cosmos was a lucky guess,” says Tyson. So why is the long-dead philosopher important enough to rate hero status? That would be because “Cosmos” takes his case as one of “martyrdom.”\nWhat “Cosmos” does not point out to its audiences that the Catholic Church didn’t really care about Bruno’s views on the Earth moving around the Sun. His crimes — the ones for which he was executed — were theological. Several actual scientists in this period happily investigated the ideas of Copernicus’ theories without running into trouble. Even Galileo only got in trouble when he published books that directly mocked the Church’s adherence to the Earth being at the center.\nWhy does this matter?\nSo what if Giordano Bruno wasn’t a scientist and wasn’t executed for science? There are three big reasons why this does, in fact, matter and why it hurts “Cosmos” to get it wrong.\n1. To borrow one of Tyson’s famous quotes, the good thing about science is that it’s true whether or not you believe in it. The same goes for history. Getting the history of science wrong hurts science itself. Why believe the science if other parts of the show are inaccurate?\n2. Making Bruno into a martyr for science basically makes 100 years of historical research useless. The idea of Giordano Bruno as a scientific hero only originated in the 19th century, when he was championed by several historians. Since then, most have classified him as a philosopher sharing dangerous ideas in a dangerous time.\n3. It’s an unstated goal of “Cosmos” to champion science and scientific reasoning over superstition and religious dogmatism. But you’re not going to win over anyone by vilifying religion in the face of science. Add in Bruno flying into space in an overtly crucifixion stance almost seems like giving religion the finger. You don’t win arguments that way, “Cosmos.”\nThe strange thing is that the science fetishists are always talking about a hypothetical religious ignorance of science while openly demonstrating their own ignorance of history, in particular, the history of the very religion they denigrate on false bases. At least one atheist is aware of\nthe historical illiteracy of his co-irreligionists\n:\nOne of the occupational hazards of being an atheist and secular humanist who has the lack of common sense to hang around on atheist discussion boards is to encounter a staggering level of historical illiteracy. I like to console myself that many of the people on such boards have come to their atheism via the study of science and so, even if they are quite learned in things like geology and biology, usually have a grasp of history stunted at about high school level. I generally do this because the alternative is to admit that the average person’s grasp of history and how history is studied is so utterly feeble as to be totally depressing….\nIt’s not hard to kick this nonsense to pieces, especially since the\npeople presenting it know next to nothing about history and have simply\npicked this [bullsh–] up from other websites and popular books and\ncollapse as soon as you hit them with some hard evidence. I love to\ntotally stump them by asking them to present me with the name of one –\njust one – scientist burned, persecuted or oppressed for their science\nin the Middle Ages. They always fail to come up with any. They usually\ntry to crowbar Galileo back into the Middle Ages, which is amusing\nconsidering he was a contemporary of Descartes. When asked why they have\nfailed to produce any such scientists given the Church was apparently\nso busily oppressing them, they often resort to claiming that the Evil\nOld Church did such a good job of oppression that everyone was too\nscared to practice science. By the time I produce a laundry list of\nMedieval scientists – like Albertus Magnus, Robert Grosseteste, Roger\nBacon, John Peckham, Duns Scotus, Thomas Bradwardine, Walter Burley,\nWilliam Heytesbury, Richard Swineshead, John Dumbleton, Richard of\nWallingford, Nicholas Oresme, Jean Buridan and Nicholas of Cusa – and\nask why these men were happily pursuing science in the Middle Ages\nwithout molestation from the Church, my opponents have usually run away\nto hide and scratch their heads in puzzlement at what just went wrong….\nCosmos\nmust have him groaning with despair.",
  "tags": [
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-10T19:08:00+00:00"
}