{
  "url": "https://voxday.net/2014/03/17/the-baen-brigade-fires-back/",
  "scraped_at": "2025-12-16T12:12:02.350934",
  "title": "The Baen Brigade fires back",
  "date_display": "March 17, 2014",
  "date_iso": "2014-03-17T13:00:00+00:00",
  "date_from_url": "2014-03-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Another <a href=\"http://rboatright.blogspot.com/2014/03/yet-another-fisking-of-john-scalzi-and.html\">Baen author responds</a> to John Scalzi’s attack on Baen publisher Toni Weisskopf:</p><blockquote class=\"tr_bq\"><p> Recently, Toni Weisskopf﻿ the publisher at Baen Books﻿ wrote a guest post at Sarah A. Hoyt﻿’s blog, a re-post of an essay she posted on Baen’s Bar, a forum that requires registration so Sarah’s repost is <a href=\"https://www.blogger.com/\">the public link</a>. </p><p>This post has had a lot of responses ranging from acclaim to hate. That means that in some sense, it’s important.  IMHO, the most interesting response was by John Scalzi﻿ <a href=\"http://bit.ly/1nt40aC\">in his blog</a>. It’s that post I want to try to comment on.  I choose to do it here rather than in the comments there because there’s a zillion comments on it already, and I’m writing to my friends, not his readers.</p><p>Scalzi summarizes Toni’s post as follows:</p><p><i> “Once upon a time all the fractious lands of science fiction fandom were joined together, and worshiped at the altar of Heinlein. But in these fallen times, lo do many refuse to worship Heinlein, preferring instead their false idols and evil ways.”</i></p><p>Let me make myself perfectly clear. Of all the styles of argument that you can engage in, this sort of straw man argument pisses me off.  It offends me. It makes me want to stand up and scream. The problem is, John’s failed both at the art of summary and at intellectual honesty.  He’s set up a target that he claims is Toni’s work, and then shoots at it, but if you’re going to try to tear apart a writer’s work, it’s important to actually tear apart what they wrote.  John didn’t do that.  He exclusively comments, at length on his summary, not on what Toni wrote, never citing her words or thoughts. This is unjust and unfair.</p></blockquote><p>This is all very well and good, but I think Mr. Boatright is forgetting something VERY important. You see, Mr. Scalzi possesses a BACHELOR’S DEGREE in PHILOSOPHY OF LANGUAGE from THE UNIVERSITY OF CHICAGO. You can’t front on that! In the meantime, another Baen author, Brad Torgersen, explains <a href=\"http://bradrtorgersen.wordpress.com/2014/03/16/why-publish-with-baen/\">why he went with Baen</a> instead of certain other publishers who have been in the news of late for <a href=\"http://girlgeniusadventures.com/2014/01/29/a-tale-of-two-tors-be-warned-im-annoyed/\">not bothering to talk to their authors</a> for periods exceeding one year and whose senior editors are chiefly known for <a href=\"http://geekfeminism.wikia.com/wiki/SFF_harassment_revelations_2013\">sexually harassing women</a> or describing themselves <a href=\"http://seeking-avalon.blogspot.com/2009/01/timeline.html?showComment=1233270180000#c5724448489116809651\">as racists</a> on LiveJournal.</p><blockquote class=\"tr_bq\"><p> One of the things I found most unsettling about the novel publishing landscape were the numerous first-person accounts I was getting, from authors not too much further down the tracks from myself, about how it was a feast or famine business. You either hit home runs immediately, or you got dumped. It didn’t seem to matter who you published with, if you couldn’t show a substantial profit for the publisher, and do it very quickly, you were done. Likewise, if you were on the midlist and you weren’t showing bottom-line numbers indicating you were trending towards bestseller status, you were done. And not always explicitly either. Often people knew they were dumped simply because responsiveness from editors dropped to little or nothing, and contracts which had been previously promised, never showed up. There was no door being slammed, rather the dumping was done quietly. Sort of like having your utilities turned off at the street.</p><p>There was one publisher, however, who was getting consistently good marks: Baen. Authors — even new authors — were reporting that this publisher didn’t expect immediate grand slams. Instead, this publisher would work with new authors over time to grow and develop an audience. Not having landslide sales your first time out of the gate was not going to ruin you. Likewise, this publisher had a very respectable and healthy midlist, while also having very good brand label loyalty among readers. The latter being rare in an era when almost all readers are either loyal to a specific author, or loyal to a specific series and/or franchise. Thus it would be easier (for me as a new guy) to develop an audience, and I wouldn’t necessarily be doomed if I wasn’t cracking the top ten on the New York Times list with each subsequent book. There was the promise of breathing room!</p></blockquote><p>I certainly hope that in the future Castalia’s authors will have similar cause to speak so well of us. I consider Baen to be a model for success in the new era of publishing. And, do you know, I’m beginning to suspect that the Baen Brigade is not fooled by Mr. Scalzi’s patented two-step where first he punches someone in the mouth, then steps back, smiles, and pretends to be best friends with them. He’s just joshing with his very good pal Miss Weisskopf, just like he and good buddy John Ringo were only kidding around with each other about his Participation Hugo.</p><p>Sorry, Johnny, but you picked your side and everyone knows it. Now everyone can see the very angry little lefty underneath the clown makeup.</p><p>UPDATE: Larry Correia piles on, which if you know anything about Larry, is saying something:</p><blockquote class=\"tr_bq\"><p> Basically, I love my publishing house. I know a lot of other writers, and I know somebody with just about<br> every publishing house out there. Hang out with a bunch of writers long<br> enough and you’ll get to hear them gripe about their publishers and<br> their editors. And if they’re not a star or a golden boy with their<br> publisher, then you’ll really get to hear them bitch and vent.  After<br> five years of this stuff I’ve heard all sorts of horror stories, yet I’m<br> unable to commiserate with them because luckily for me, my editors<br> don’t suck, and I haven’t ever felt like my publisher is trying to screw<br> me over.</br></br></br></br></br></br></br></br></p><p>Editing complaints are the best. I don’t know how many times I’ve<br> heard stories, especially from the mid listers at one of the big houses<br> about how they’ve turned in a book and waited 6 months, 9 months, or a<br> YEAR to get any editorial feedback. Hell, at that point I’ve already<br> written another novel and have forgotten the prior one. Then when the<br> feedback comes back it is “Hey, throw away this half of the book and<br> write something entirely different, oh, and I need that by Thursday.”<br> Sorry. Can’t commiserate with you, buddy…. <br> Let me give you an example of what doing business with Baen is like. When I first started out I had absolutely no idea what I was doing as far as business, and like I said, no agent to guide me (got rejected by pretty much all of them, which is funny because I’m betting they’d love to be getting 15% of this action now!) so when I signed my first contract, I gave over things like dramatic rights (movies and TV), audiobooks, and foreign rights to Baen. At that point in my career, I was just happy that anybody was reading my stuff at all, and I couldn’t imagine that people would want to listen to it or read it in other languages.</br></br></br></br></br></br></br></br></p><p>So then I got approached by my first movie producer. Wow. Didn’t see that coming. Uh oh, my contract turned all that over to my publishing house… The contract doesn’t specify percentage details for that kind of thing. Now, at this point many publishers would have just screwed me over. Nope. One phone call to Toni, she sticks Baen’s Hollywood agent onto it, we talk, and boom, no problem. I’m then getting an extremely large percent of any of that sort of thing. For the last three years I’ve been collecting option money.</p></blockquote></div>",
  "content_text": "Another\nBaen author responds\nto John Scalzi’s attack on Baen publisher Toni Weisskopf:\nRecently, Toni Weisskopf﻿ the publisher at Baen Books﻿ wrote a guest post at Sarah A. Hoyt﻿’s blog, a re-post of an essay she posted on Baen’s Bar, a forum that requires registration so Sarah’s repost is\nthe public link\n.\nThis post has had a lot of responses ranging from acclaim to hate. That means that in some sense, it’s important.  IMHO, the most interesting response was by John Scalzi﻿\nin his blog\n. It’s that post I want to try to comment on.  I choose to do it here rather than in the comments there because there’s a zillion comments on it already, and I’m writing to my friends, not his readers.\nScalzi summarizes Toni’s post as follows:\n“Once upon a time all the fractious lands of science fiction fandom were joined together, and worshiped at the altar of Heinlein. But in these fallen times, lo do many refuse to worship Heinlein, preferring instead their false idols and evil ways.”\nLet me make myself perfectly clear. Of all the styles of argument that you can engage in, this sort of straw man argument pisses me off.  It offends me. It makes me want to stand up and scream. The problem is, John’s failed both at the art of summary and at intellectual honesty.  He’s set up a target that he claims is Toni’s work, and then shoots at it, but if you’re going to try to tear apart a writer’s work, it’s important to actually tear apart what they wrote.  John didn’t do that.  He exclusively comments, at length on his summary, not on what Toni wrote, never citing her words or thoughts. This is unjust and unfair.\nThis is all very well and good, but I think Mr. Boatright is forgetting something VERY important. You see, Mr. Scalzi possesses a BACHELOR’S DEGREE in PHILOSOPHY OF LANGUAGE from THE UNIVERSITY OF CHICAGO. You can’t front on that! In the meantime, another Baen author, Brad Torgersen, explains\nwhy he went with Baen\ninstead of certain other publishers who have been in the news of late for\nnot bothering to talk to their authors\nfor periods exceeding one year and whose senior editors are chiefly known for\nsexually harassing women\nor describing themselves\nas racists\non LiveJournal.\nOne of the things I found most unsettling about the novel publishing landscape were the numerous first-person accounts I was getting, from authors not too much further down the tracks from myself, about how it was a feast or famine business. You either hit home runs immediately, or you got dumped. It didn’t seem to matter who you published with, if you couldn’t show a substantial profit for the publisher, and do it very quickly, you were done. Likewise, if you were on the midlist and you weren’t showing bottom-line numbers indicating you were trending towards bestseller status, you were done. And not always explicitly either. Often people knew they were dumped simply because responsiveness from editors dropped to little or nothing, and contracts which had been previously promised, never showed up. There was no door being slammed, rather the dumping was done quietly. Sort of like having your utilities turned off at the street.\nThere was one publisher, however, who was getting consistently good marks: Baen. Authors — even new authors — were reporting that this publisher didn’t expect immediate grand slams. Instead, this publisher would work with new authors over time to grow and develop an audience. Not having landslide sales your first time out of the gate was not going to ruin you. Likewise, this publisher had a very respectable and healthy midlist, while also having very good brand label loyalty among readers. The latter being rare in an era when almost all readers are either loyal to a specific author, or loyal to a specific series and/or franchise. Thus it would be easier (for me as a new guy) to develop an audience, and I wouldn’t necessarily be doomed if I wasn’t cracking the top ten on the New York Times list with each subsequent book. There was the promise of breathing room!\nI certainly hope that in the future Castalia’s authors will have similar cause to speak so well of us. I consider Baen to be a model for success in the new era of publishing. And, do you know, I’m beginning to suspect that the Baen Brigade is not fooled by Mr. Scalzi’s patented two-step where first he punches someone in the mouth, then steps back, smiles, and pretends to be best friends with them. He’s just joshing with his very good pal Miss Weisskopf, just like he and good buddy John Ringo were only kidding around with each other about his Participation Hugo.\nSorry, Johnny, but you picked your side and everyone knows it. Now everyone can see the very angry little lefty underneath the clown makeup.\nUPDATE: Larry Correia piles on, which if you know anything about Larry, is saying something:\nBasically, I love my publishing house. I know a lot of other writers, and I know somebody with just about\nevery publishing house out there. Hang out with a bunch of writers long\nenough and you’ll get to hear them gripe about their publishers and\ntheir editors. And if they’re not a star or a golden boy with their\npublisher, then you’ll really get to hear them bitch and vent.  After\nfive years of this stuff I’ve heard all sorts of horror stories, yet I’m\nunable to commiserate with them because luckily for me, my editors\ndon’t suck, and I haven’t ever felt like my publisher is trying to screw\nme over.\nEditing complaints are the best. I don’t know how many times I’ve\nheard stories, especially from the mid listers at one of the big houses\nabout how they’ve turned in a book and waited 6 months, 9 months, or a\nYEAR to get any editorial feedback. Hell, at that point I’ve already\nwritten another novel and have forgotten the prior one. Then when the\nfeedback comes back it is “Hey, throw away this half of the book and\nwrite something entirely different, oh, and I need that by Thursday.”\nSorry. Can’t commiserate with you, buddy….\nLet me give you an example of what doing business with Baen is like. When I first started out I had absolutely no idea what I was doing as far as business, and like I said, no agent to guide me (got rejected by pretty much all of them, which is funny because I’m betting they’d love to be getting 15% of this action now!) so when I signed my first contract, I gave over things like dramatic rights (movies and TV), audiobooks, and foreign rights to Baen. At that point in my career, I was just happy that anybody was reading my stuff at all, and I couldn’t imagine that people would want to listen to it or read it in other languages.\nSo then I got approached by my first movie producer. Wow. Didn’t see that coming. Uh oh, my contract turned all that over to my publishing house… The contract doesn’t specify percentage details for that kind of thing. Now, at this point many publishers would have just screwed me over. Nope. One phone call to Toni, she sticks Baen’s Hollywood agent onto it, we talk, and boom, no problem. I’m then getting an extremely large percent of any of that sort of thing. For the last three years I’ve been collecting option money.",
  "tags": [
    "McRapey",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-17T13:00:00+00:00"
}