{
  "url": "https://voxday.net/2014/03/23/the-icebergs-tip/",
  "scraped_at": "2025-12-15T16:50:32.524871",
  "title": "The iceberg’s tip",
  "date_display": "March 23, 2014",
  "date_iso": "2014-03-23T17:00:00+00:00",
  "date_from_url": "2014-03-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I find it both amusing and absurd to observe how certain trolls simply cannot manage to control themselves. Despite my supposedly controversial style, in my entire history of Internet use, I have only been asked twice to refrain from commenting on an Internet site. In both cases, I not only refrained from commenting there, but ceased regular reading there as well. I even declined an invitation to return to one of the sites when contacted and encouraged to do so.</p><p>Contrast with that the behavior of Ann Morgan, who is not only one of the trolls who continues to read this blog and attempts to post easily identifiable comments here, but apparently can’t even manage to keep her troll-dentities straight:</p><blockquote class=\"tr_bq\"><p> Rose colored glasses March 22, 2014 7:13 PM</p><p>**It celebrates the Egyptians, Chinese, Mayans, Indus to downplay Christian Civilization without ever once considering the barbarity of those civs.**</p><p>So… on the planet you came from, Christians never burned women alive for nonsensical reasons, held slaves, or spent 400 years trying to wipe out the Cherokee and Souix…</p><p>Ann Morgan March 22, 2014 7:16 PM<i> </i></p><p><i>This comment has been removed by the author.</i></p><p>Don March 22, 2014 8:08 PM</p><p>Ann did you forget which sock puppet you were using? What is that, three on this thread alone. I would be honestly interested in hearing why you think you cannot stay away even when you have been told. Worse you simply cannot follow the rules so we always know it’s you. You fool no one but yourself. Go do something quit hating Christians and blaming others for how you respond to your problems. It’s spring go for a walk. Throw rocks at the beach, go to Church tomorrow, I promise though it might hurt giving up sin and pride is painful at first, you’ll be happier in the end.</p></blockquote><p>While I normally delete the trolls’ comments, I leave those I consider to be educationally illustrative. This example of a troll attempting to resurrect itself should help explain to some of the relative newcomers why I occasionally nuke what superficially appear to be innocuous comments, but are actually the tip of an incipient and entirely familiar iceberg.</p><p>For some reason, the trolls never seem to grasp that virtually no one, in the entire history of the Internet, shows up for the first time on an established blog and promptly vomits forth a massive series of comments indicating familiarity with both the blog and its regular commenters. It should be obvious that changing one’s identity will never fool anyone so long as one insists on saying the exact same things that resulted in one’s identification as a troll in the first place. But then, logic does not appear to be a strong point with these creatures.</p><p>Speaking of one’s critics, I thought it was amusing to see that someone is <a href=\"http://mebeale.blogspot.com/\">attempting to imitate my cruel tactic</a> of directly <a href=\"http://iscalzi.blogspot.com/\">quoting Mr. Scalzi’s words</a>. While I have no doubt he’ll be able to dig up a few careless infelicities, people tend to forget that I started as a nationally syndicated columnist. This means that I have always been aware that my words will be mined and carefully sifted for the purpose of attacking me. That is why quotes cited for use against me are usually modified or grammatically incomplete.</p><p>Otherwise, they tend to say more about the critic’s particular ideological bent than anything else. I mean, does anyone who has read this blog for more than five minutes seriously think I am even slightly embarrassed with people seeing observations like these being publicly attributed to me? I mean, what is the implied argument here, women DO have a Magic Vagina Power with a range of 30+ yards?</p><p>On Doctor-Assisted Suicide<br> <i>I suspect euthanasia advocates would feel differently if it was legalized, but the doctor was required to use an axe. </i></br></p><p>On Male Intuition<br> <i>Men can, as it happens, tell when a woman doesn’t have any idea what<br> she’s doing. As hard as it may be to believe this, a woman’s Magic<br> Vagina Power does not actually ensorcel every male within a 30-yard<br> radius and cause them to believe that a woman is automatically<br> superlative at every form of human endeavor.<br> </br></br></br></br></br></i></br></p><p>On Public Education<br> <i>“Is sending your kids to American public schools parental malpractice?” Yes.</i></br></p></div>",
  "content_text": "I find it both amusing and absurd to observe how certain trolls simply cannot manage to control themselves. Despite my supposedly controversial style, in my entire history of Internet use, I have only been asked twice to refrain from commenting on an Internet site. In both cases, I not only refrained from commenting there, but ceased regular reading there as well. I even declined an invitation to return to one of the sites when contacted and encouraged to do so.\nContrast with that the behavior of Ann Morgan, who is not only one of the trolls who continues to read this blog and attempts to post easily identifiable comments here, but apparently can’t even manage to keep her troll-dentities straight:\nRose colored glasses March 22, 2014 7:13 PM\n**It celebrates the Egyptians, Chinese, Mayans, Indus to downplay Christian Civilization without ever once considering the barbarity of those civs.**\nSo… on the planet you came from, Christians never burned women alive for nonsensical reasons, held slaves, or spent 400 years trying to wipe out the Cherokee and Souix…\nAnn Morgan March 22, 2014 7:16 PM\nThis comment has been removed by the author.\nDon March 22, 2014 8:08 PM\nAnn did you forget which sock puppet you were using? What is that, three on this thread alone. I would be honestly interested in hearing why you think you cannot stay away even when you have been told. Worse you simply cannot follow the rules so we always know it’s you. You fool no one but yourself. Go do something quit hating Christians and blaming others for how you respond to your problems. It’s spring go for a walk. Throw rocks at the beach, go to Church tomorrow, I promise though it might hurt giving up sin and pride is painful at first, you’ll be happier in the end.\nWhile I normally delete the trolls’ comments, I leave those I consider to be educationally illustrative. This example of a troll attempting to resurrect itself should help explain to some of the relative newcomers why I occasionally nuke what superficially appear to be innocuous comments, but are actually the tip of an incipient and entirely familiar iceberg.\nFor some reason, the trolls never seem to grasp that virtually no one, in the entire history of the Internet, shows up for the first time on an established blog and promptly vomits forth a massive series of comments indicating familiarity with both the blog and its regular commenters. It should be obvious that changing one’s identity will never fool anyone so long as one insists on saying the exact same things that resulted in one’s identification as a troll in the first place. But then, logic does not appear to be a strong point with these creatures.\nSpeaking of one’s critics, I thought it was amusing to see that someone is\nattempting to imitate my cruel tactic\nof directly\nquoting Mr. Scalzi’s words\n. While I have no doubt he’ll be able to dig up a few careless infelicities, people tend to forget that I started as a nationally syndicated columnist. This means that I have always been aware that my words will be mined and carefully sifted for the purpose of attacking me. That is why quotes cited for use against me are usually modified or grammatically incomplete.\nOtherwise, they tend to say more about the critic’s particular ideological bent than anything else. I mean, does anyone who has read this blog for more than five minutes seriously think I am even slightly embarrassed with people seeing observations like these being publicly attributed to me? I mean, what is the implied argument here, women DO have a Magic Vagina Power with a range of 30+ yards?\nOn Doctor-Assisted Suicide\nI suspect euthanasia advocates would feel differently if it was legalized, but the doctor was required to use an axe.\nOn Male Intuition\nMen can, as it happens, tell when a woman doesn’t have any idea what\nshe’s doing. As hard as it may be to believe this, a woman’s Magic\nVagina Power does not actually ensorcel every male within a 30-yard\nradius and cause them to believe that a woman is automatically\nsuperlative at every form of human endeavor.\nOn Public Education\n“Is sending your kids to American public schools parental malpractice?” Yes.",
  "tags": [
    "Troll Ban"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-23T17:00:00+00:00"
}