{
  "url": "https://voxday.net/2014/03/27/the-players-union/",
  "scraped_at": "2025-12-15T16:50:58.751404",
  "title": "The players’ union",
  "date_display": "March 27, 2014",
  "date_iso": "2014-03-27T18:04:00+00:00",
  "date_from_url": "2014-03-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not a big fan of unions, but there is no question that college football players have a much better claim <a href=\"http://www.foxnews.com/sports/2014/03/26/college-football-players-can-unionize-federal-agency-says/\">to be permitted to unionize</a> than policemen and federal employees.</p><blockquote class=\"tr_bq\"><p> In a ruling that could revolutionize college athletics, a federal agency ruled Wednesday that college football players at Northwestern University can unionize. The decision by a regional director of the National Labor Relations Board means it agrees football players at the Big Ten school qualify as employees under federal law and therefore can create the nation’s first college athlete’s union….</p><p>CAPA attorneys argued that college football is, for all practical<br> purposes, a commercial enterprise that relies on players’ labor to<br> generate billions of dollars in profits. That, they contend, makes the<br> relationship of schools to players one of employers to employees.</br></br></br></p></blockquote><p>It’s hard, if not impossible, to argue with that. The fact that the employer is a university doesn’t mean that the janitors and professors are not employees, and they generate considerably less income than the football players do.</p><p>These young men are actually putting their bodies on the line, and they deserve the right to a significant slice of the income their activities are producing.</p></div>",
  "content_text": "I’m not a big fan of unions, but there is no question that college football players have a much better claim\nto be permitted to unionize\nthan policemen and federal employees.\nIn a ruling that could revolutionize college athletics, a federal agency ruled Wednesday that college football players at Northwestern University can unionize. The decision by a regional director of the National Labor Relations Board means it agrees football players at the Big Ten school qualify as employees under federal law and therefore can create the nation’s first college athlete’s union….\nCAPA attorneys argued that college football is, for all practical\npurposes, a commercial enterprise that relies on players’ labor to\ngenerate billions of dollars in profits. That, they contend, makes the\nrelationship of schools to players one of employers to employees.\nIt’s hard, if not impossible, to argue with that. The fact that the employer is a university doesn’t mean that the janitors and professors are not employees, and they generate considerably less income than the football players do.\nThese young men are actually putting their bodies on the line, and they deserve the right to a significant slice of the income their activities are producing.",
  "tags": [
    "law",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-27T18:04:00+00:00"
}