{
  "url": "https://voxday.net/2014/03/06/the-israeli-melting-po/",
  "scraped_at": "2025-12-15T16:48:24.163841",
  "title": "The Israeli melting pot",
  "date_display": "March 6, 2014",
  "date_iso": "2014-03-06T21:00:00+00:00",
  "date_from_url": "2014-03-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t see how the Israelis can expect anything but world condemnation for their insistence on <a href=\"http://www.nytimes.com/2014/03/06/opinion/israels-choice.html?hp&amp;rref=opinion&amp;_r=0\">the recognition of Israel as a Jewish state</a> in light of how an entire generation has been indoctrinated to believe that diversity is Israel’s strength:</p><blockquote class=\"tr_bq\"><p> In<br> Washington this week, Prime Minister Benjamin Netanyahu of Israel<br> sounded two different notes about peace negotiations with the<br> Palestinians, which are nearing a critical juncture. In a speech to the<br> American Israel Public Affairs Committee, the pro-Israel lobby, he<br> enthusiastically advocated a peace agreement as a means to improve<br> Israel’s ties with its Arab neighbors and “catapult the region forward”<br> on issues like health, energy and education.</br></br></br></br></br></br></br></p><p>But at<br> other moments, a more familiar skepticism was apparent. He demanded that<br> Palestinians recognize Israel as a Jewish state with “no excuses, no<br> delays.” In response, a senior Palestinian official, Nabil Shaath,<br> accused Mr. Netanyahu of putting an end to peace talks because<br> Palestinians have already rejected that designation. (Palestinians<br> recognize Israel as a state, but not as a Jewish state because they<br> believe that that would undercut the rights of Palestinian refugees.)</br></br></br></br></br></br></br></p></blockquote><p>Insistence<br> on a Jewish state is clearly the very worst form of geopolitical<br> raciss. How could a Jewish state be any less raciss than insisting<br> America be recognized as a White Anglo-Saxon state? Or that England be<br> recognized as an English state? Or Nigeria be recognized as an Igbo<br> state?</br></br></br></br></br></p><p>Israel’s choice is pretty simple. No White<br> European state, no Jewish state. If diversity is America’s strength,<br> then it is Israel’s strength too.</br></br></p></div>",
  "content_text": "I don’t see how the Israelis can expect anything but world condemnation for their insistence on\nthe recognition of Israel as a Jewish state\nin light of how an entire generation has been indoctrinated to believe that diversity is Israel’s strength:\nIn\nWashington this week, Prime Minister Benjamin Netanyahu of Israel\nsounded two different notes about peace negotiations with the\nPalestinians, which are nearing a critical juncture. In a speech to the\nAmerican Israel Public Affairs Committee, the pro-Israel lobby, he\nenthusiastically advocated a peace agreement as a means to improve\nIsrael’s ties with its Arab neighbors and “catapult the region forward”\non issues like health, energy and education.\nBut at\nother moments, a more familiar skepticism was apparent. He demanded that\nPalestinians recognize Israel as a Jewish state with “no excuses, no\ndelays.” In response, a senior Palestinian official, Nabil Shaath,\naccused Mr. Netanyahu of putting an end to peace talks because\nPalestinians have already rejected that designation. (Palestinians\nrecognize Israel as a state, but not as a Jewish state because they\nbelieve that that would undercut the rights of Palestinian refugees.)\nInsistence\non a Jewish state is clearly the very worst form of geopolitical\nraciss. How could a Jewish state be any less raciss than insisting\nAmerica be recognized as a White Anglo-Saxon state? Or that England be\nrecognized as an English state? Or Nigeria be recognized as an Igbo\nstate?\nIsrael’s choice is pretty simple. No White\nEuropean state, no Jewish state. If diversity is America’s strength,\nthen it is Israel’s strength too.",
  "tags": [
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-06T21:00:00+00:00"
}