{
  "url": "https://voxday.net/2014/03/24/the-new-evil-empire/",
  "scraped_at": "2025-12-15T16:50:36.209957",
  "title": "The new evil empire",
  "date_display": "March 24, 2014",
  "date_iso": "2014-03-24T06:00:00+00:00",
  "date_from_url": "2014-03-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The European public has finally begun to figure out that the Eurofascists of the EU are cut from <a href=\"http://news.yahoo.com/britons-rate-russia-more-positively-eu-poll-shows-003103687.html;_ylt=AwrTWfx3PS5TkwEAwQHQtDMD\">the same cloth as Napoleon and Hitler</a>:</p><blockquote class=\"tr_bq\"><div id=\"yui_3_9_1_1_1395570882418_671\"> Britons see Russia in a more positive light than the European Union,<br> despite recent tensions with Moscow over Ukraine, according to a poll<br> published on Saturday. The league table of 27 “liked”<br> countries and institutions put the European Parliament — for which<br> elections are being held in May — sixth from bottom, and the EU fourth<br> from bottom. Only Saudi Arabia,<br> Iran and North Korea ranked below the European parliament when those<br> polled were asked how positive or negative they felt towards them.<br> Israel was fifth from bottom and Russia was seventh from bottom. Canada was top.</br></br></br></br></br></br></br></br></div></blockquote><p>It shouldn’t be surprising that the British fear the EU more than the Russians. The EU is an invading and occupying force. The Russians are doing little more than securing their national interests in responds to EU and US provocations, and in doing so, proving that national interests supersede artificially-drawn political boundaries.</p></div>",
  "content_text": "The European public has finally begun to figure out that the Eurofascists of the EU are cut from\nthe same cloth as Napoleon and Hitler\n:\nBritons see Russia in a more positive light than the European Union,\ndespite recent tensions with Moscow over Ukraine, according to a poll\npublished on Saturday. The league table of 27 “liked”\ncountries and institutions put the European Parliament — for which\nelections are being held in May — sixth from bottom, and the EU fourth\nfrom bottom. Only Saudi Arabia,\nIran and North Korea ranked below the European parliament when those\npolled were asked how positive or negative they felt towards them.\nIsrael was fifth from bottom and Russia was seventh from bottom. Canada was top.\nIt shouldn’t be surprising that the British fear the EU more than the Russians. The EU is an invading and occupying force. The Russians are doing little more than securing their national interests in responds to EU and US provocations, and in doing so, proving that national interests supersede artificially-drawn political boundaries.",
  "tags": [
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-24T06:00:00+00:00"
}