{
  "url": "https://voxday.net/2014/03/22/the-return-of-la-serenissima/",
  "scraped_at": "2025-12-15T16:50:23.303198",
  "title": "The return of La Serenissima",
  "date_display": "March 22, 2014",
  "date_iso": "2014-03-22T10:22:00+00:00",
  "date_from_url": "2014-03-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I, for one, welcome the return of our old Venetian overlords and the Most Serene Republic:</p><blockquote class=\"tr_bq\"><p> TREVISO – Il referendum on<br> line per l’indipendenza del Veneto dall’Italia ha conteggiato 2 milioni<br> 360mila 235 voti, pari al 73% del corpo elettorale regionale. I sì sono<br> stati 2 milioni 102mila 969, pari all’89%, i no 257.276 (10,9%). Sono i<br> numeri della consultazione comunicati  in piazza dei Signori a Treviso<br> dai promotori del referendum, il movimento venetista ‘Plebiscito.eu’.</br></br></br></br></br></p><p>E’<br> stata una consultazione virtuale in tutti in sensi: perchè fatta<br> soprattutto attraverso la rete, oltre che con schede raccolte nei<br> gazebo, e ‘voti’ telefonici, e perchè, Costituzione alla mano, non ha<br> alcun valore formale, men che meno istituzionale.</br></br></br></br></p></blockquote><p>The vote has no legal force, but the fact that 2.4 million votes were cast in an electorate of 3.7 million indicates that there is genuinely strong support for Venetian independence. And so the Risorgimento, the bastard child of Garibaldi’s globalism and the ambitions of the Piedmontese royal house, begins to unravel at last.</p></div>",
  "content_text": "I, for one, welcome the return of our old Venetian overlords and the Most Serene Republic:\nTREVISO – Il referendum on\nline per l’indipendenza del Veneto dall’Italia ha conteggiato 2 milioni\n360mila 235 voti, pari al 73% del corpo elettorale regionale. I sì sono\nstati 2 milioni 102mila 969, pari all’89%, i no 257.276 (10,9%). Sono i\nnumeri della consultazione comunicati  in piazza dei Signori a Treviso\ndai promotori del referendum, il movimento venetista ‘Plebiscito.eu’.\nE’\nstata una consultazione virtuale in tutti in sensi: perchè fatta\nsoprattutto attraverso la rete, oltre che con schede raccolte nei\ngazebo, e ‘voti’ telefonici, e perchè, Costituzione alla mano, non ha\nalcun valore formale, men che meno istituzionale.\nThe vote has no legal force, but the fact that 2.4 million votes were cast in an electorate of 3.7 million indicates that there is genuinely strong support for Venetian independence. And so the Risorgimento, the bastard child of Garibaldi’s globalism and the ambitions of the Piedmontese royal house, begins to unravel at last.",
  "tags": [
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-22T10:22:00+00:00"
}