{
  "url": "https://voxday.net/2014/03/24/the-altar-of-hate/",
  "scraped_at": "2025-12-15T16:50:38.035743",
  "title": "THE ALTAR OF HATE",
  "date_display": "March 24, 2014",
  "date_iso": "2014-03-24T13:00:00+00:00",
  "date_from_url": "2014-03-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.amazon.com/Altar-Hate-Vox-Day-ebook/dp/B00J70Z2L6\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/03/altar_256.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2014/03/altar_256.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a>Today Castalia House published my collection of short stories entitled <a href=\"http://www.amazon.com/Altar-Hate-Vox-Day-ebook/dp/B00J70Z2L6\"><b><i>THE ALTAR OF HATE</i></b></a>. It consists of one novella, one poem, and eight short stories. Some of the stories will be familiar to longtime Dread Ilk, having been originally available on my old Eternal Warriors web site back in the day or published in Stupefying Stories. As the collection is dedicated to Bane, who would have enjoyed its dark and occasionally sinister bent, it contains the poem that is here on this site, “Bane Walks On”. And there is a new story, one with which I am particularly pleased, that involves the application of a particular Maupassant mechanism to the futuristic world of Quantum Mortis.</p><p>The cover illustration was created by our newest artist, Jeremiah, who did an excellent job working under the direction of JartStar. The title story was inspired by a visit to Venice some years ago; I very much doubt any writer can visit that eerie, decaying city without feeling the proddings of a brooding, water-logged muse. I very much like the cover art, as in addition to the Venetian theme it reminds me a little of the paperback edition of <i>Mona Lisa Overdrive</i>, an image that Psykosonik once used as the cover of our demo tape.</p><p>From the initial reviews:</p><p>“Each story has its appeal across multiple genres, although to me the<br> story from which the title is derived was particularly moving.”</br></p><p>“From an eldritch tale blended with computer insider humor, an ode to a<br> fallen friend, to science fiction with a twist, this is a good<br> collection of Vox’s shorter writings to date.”</br></br></p><p>“The stories move along, but one feels the uneasy eyes of the abyss<br> staring back as you progress, as it were, through a darkened ancient<br> forest. Only an author of the first rank could achieve this.”</br></br></p><p>In other Castalia news, fans of Tom’s Rathaverse will be pleased to note this comment to a reviewer hoping for a sequel: “Look for <i>The Court-Martial of Ratha Flower Wood</i>, maybe before Christmas.”</p></div>",
  "content_text": "Today Castalia House published my collection of short stories entitled\nTHE ALTAR OF HATE\n. It consists of one novella, one poem, and eight short stories. Some of the stories will be familiar to longtime Dread Ilk, having been originally available on my old Eternal Warriors web site back in the day or published in Stupefying Stories. As the collection is dedicated to Bane, who would have enjoyed its dark and occasionally sinister bent, it contains the poem that is here on this site, “Bane Walks On”. And there is a new story, one with which I am particularly pleased, that involves the application of a particular Maupassant mechanism to the futuristic world of Quantum Mortis.\nThe cover illustration was created by our newest artist, Jeremiah, who did an excellent job working under the direction of JartStar. The title story was inspired by a visit to Venice some years ago; I very much doubt any writer can visit that eerie, decaying city without feeling the proddings of a brooding, water-logged muse. I very much like the cover art, as in addition to the Venetian theme it reminds me a little of the paperback edition of\nMona Lisa Overdrive\n, an image that Psykosonik once used as the cover of our demo tape.\nFrom the initial reviews:\n“Each story has its appeal across multiple genres, although to me the\nstory from which the title is derived was particularly moving.”\n“From an eldritch tale blended with computer insider humor, an ode to a\nfallen friend, to science fiction with a twist, this is a good\ncollection of Vox’s shorter writings to date.”\n“The stories move along, but one feels the uneasy eyes of the abyss\nstaring back as you progress, as it were, through a darkened ancient\nforest. Only an author of the first rank could achieve this.”\nIn other Castalia news, fans of Tom’s Rathaverse will be pleased to note this comment to a reviewer hoping for a sequel: “Look for\nThe Court-Martial of Ratha Flower Wood\n, maybe before Christmas.”",
  "tags": [
    "books",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-24T13:00:00+00:00"
}