{
  "url": "https://voxday.net/2014/03/14/the-greatest-living-sf-author/",
  "scraped_at": "2025-12-15T16:49:08.265463",
  "title": "The Greatest Living SF Author",
  "date_display": "March 14, 2014",
  "date_iso": "2014-03-14T17:00:00+00:00",
  "date_from_url": "2014-03-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Philip K. Dick is dead, alas. As are Frank Herbert and Isaac Asimov. (And, apparently, Arthur C. Clarke.) So, who would you nominate for a poll on this subject? Here are my nominees, in no particular order:</p><p>Neal Stephenson<br> China Mieville<br> John C. Wright</br></br></p><p>Orson Scott Card looked like a contender early on, but he did his best work first, in my opinion. Good, to be sure, but not great. Charles Stross has declined from his breathtaking <i>Accelerando </i>days; I enjoy his <i>Laundry </i>novels but while they are fun, they are not the stuff from which greatness is made. Lois Bujold is very good, but not on the level of the three men listed above. Once the Fourth of the original Big Three, Arthur C. Clarke is overrated and hasn’t written anything worth reading in years, presumably because he is still dead. William Gibson isn’t so much in the limelight these days, but he continues to write interesting books. Tanith Lee is a fabulous stylist, but she has faded from the <i>Secret Books of Paradys</i> days and she wrote fantasy, not science fiction, anyhow.</p><p>Perhaps the New Heinlein, Mr. John Scalzi? A mere jest, in more ways than one. Anyhow, if we can narrow the list to 10, then I will post a poll tomorrow and we can sort out everyone’s opinion on the matter. If you have a potential nominee, please make the case here.</p><p>Three possible nominees from three recognizable authors who shall remain nameless unless they wish to identify themselves: Gene Wolfe, Larry Niven, and Jerry Pournelle. A fourth author seconds the nominations for Niven and Pournelle, and, (rather dubiously in my opinion), throws David Weber’s name into the hat. I say this as one who has recently revisited the Honorverse.</p></div>",
  "content_text": "Philip K. Dick is dead, alas. As are Frank Herbert and Isaac Asimov. (And, apparently, Arthur C. Clarke.) So, who would you nominate for a poll on this subject? Here are my nominees, in no particular order:\nNeal Stephenson\nChina Mieville\nJohn C. Wright\nOrson Scott Card looked like a contender early on, but he did his best work first, in my opinion. Good, to be sure, but not great. Charles Stross has declined from his breathtaking\nAccelerando\ndays; I enjoy his\nLaundry\nnovels but while they are fun, they are not the stuff from which greatness is made. Lois Bujold is very good, but not on the level of the three men listed above. Once the Fourth of the original Big Three, Arthur C. Clarke is overrated and hasn’t written anything worth reading in years, presumably because he is still dead. William Gibson isn’t so much in the limelight these days, but he continues to write interesting books. Tanith Lee is a fabulous stylist, but she has faded from the\nSecret Books of Paradys\ndays and she wrote fantasy, not science fiction, anyhow.\nPerhaps the New Heinlein, Mr. John Scalzi? A mere jest, in more ways than one. Anyhow, if we can narrow the list to 10, then I will post a poll tomorrow and we can sort out everyone’s opinion on the matter. If you have a potential nominee, please make the case here.\nThree possible nominees from three recognizable authors who shall remain nameless unless they wish to identify themselves: Gene Wolfe, Larry Niven, and Jerry Pournelle. A fourth author seconds the nominations for Niven and Pournelle, and, (rather dubiously in my opinion), throws David Weber’s name into the hat. I say this as one who has recently revisited the Honorverse.",
  "tags": [
    "books",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-14T17:00:00+00:00"
}