{
  "url": "https://voxday.net/2014/03/20/the-dry-bones-of-autumn-people/",
  "scraped_at": "2025-12-15T16:50:08.720865",
  "title": "The dry bones of the Autumn People",
  "date_display": "March 20, 2014",
  "date_iso": "2014-03-20T10:22:00+00:00",
  "date_from_url": "2014-03-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John C. Wright <a href=\"http://www.scifiwright.com/2014/03/oo-those-awful-orcs/\">excavates an astonishing review</a> of THE LORD OF THE RINGS to illustrate the malice and poverty of spirit inhibiting those who never have anything but evil to speak of that which speaks truth to the human condition.</p><blockquote class=\"tr_bq\"><p> The reason why this mocking and forgotten review should be remembered and held up to mockery in turn is because the animating spirit behind it is alive and well, if not increased in size and reach and insolence.</p><p>Ray Bradbury described this spirit, as is his wont to describe anything he describes, with the insight of a poet and the wisdom of a sage:</p><p><i>“For these beings, fall is the ever normal season, the only weather, there be no choice beyond. Where do they come from? The dust. Where do they go? The grave. Does blood stir their veins? No: the night wind. What ticks in their head? The worm. What speaks from their mouth? The toad. What sees from their eye? The snake. What hears with their ear? The abyss between the stars. They sift the human storm for souls, eat flesh of reason, fill tombs with sinners. They frenzy forth. In gusts they beetle-scurry, creep, thread, filter, motion, make all moons sullen, and surely cloud all clear-run waters. The spider-web hears them, trembles – breaks. Such are the autumn people. Beware of them.”</i><br> -Ray Bradbury, SOMETHING WICKED THIS WAY COMES</br></p><p>Elsewhere, he describes their homeland:</p><p><i>“That country where it is always turning late in the year. That country where the hills are fog and the rivers are mist; where noons go quickly, dusks and twilights linger, and midnights stay. That country composed in the main of cellars, sub-cellars, coal-bins, closets, attics, and pantries faced away from the sun. That country whose people are autumn people, thinking only autumn thoughts. Whose people passing at night on the empty walks sound like rain.”</i><br> -Ray Bradbury, THE OCTOBER COUNTRY</br></p><p>If this sound deliciously like the dreary rainscape of the microscopic yet immeasurable Hell portrayed in THE GREAT DIVORCE by C.S. Lewis, where the houses are imaginary and do not keep out the cold and wet, it is no coincidence. The two writers both had met the Autumn People from the cold lands deep in October.</p><p>They are among us today, the Autumn People, and in greater numbers, and for the most part they have dispensed with the delicacy of expression of Mr. Wilson, as with his culture and his learning. His spiritual grandchildren are among us, and turned against his learning the same scorn he turned against Tolkien’s, so they cannot express themselves as well, or, indeed, coherently.</p><p>From the point of view of an autopsy then, one wonders what is wrong with such people as Mr. Wilson? What ails the Autumn People?</p></blockquote><p>The Autumn People are now the gatekeepers of SF/F and of our larger media culture. They mock and belittle all nobility, all tradition, all religion. They are intellectual parasites who have nothing to offer but nihilism and momentary animal pleasure. They disingenuously appeal to justice, a concept in which they do not actually believe, in order to attack the very foundations of civilization. They preach uncertainty with all the rock-solid belief of a divinely-appointed prophet and place their faith in a method documented to be reliably false.</p><p>Mr. Wright asks what ails the Autumn People. There are others, even more generous of spirit, who wish to cure them. As for me and my House, we think only to vanquish their soulless Insect Army and send them scuttling back under the rocks from which they crept. For if the literary world is abandoned to them, there will never be another Middle Earth, there will never be another Narnia, there will be nothing but the black ravenous goo of the Silent Oecumene.</p><blockquote class=\"tr_bq\"><p> The Autumn People admire autumnal books. The Autumn Man is a man who has collapsed into temptation. The disease has eaten into his bones so that he can no longer stand. What he wants to hear is stories that mock the standing people, that trip them up, that bring things down to his level.  Above all, the Autumn People like sly, sarcastic books, books that mock and shock, books that sneer. Sneering is the only emotion they know, aside from dull resentment and petulant hatred. The Autumn Man therefore wants to hear a story that says he is in the right when he knows he is deeply wrong. </p></blockquote><p>It sounds familiar, does it not? Sneering, snark, science fetishization, and sex in its most degraded form is the totality of today’s Pink SF/F. And notice in particular how Wright astutely draws the connection between the behavior of the reviewer and his current heirs: <i>“the accuser does not address the evidence, which is<br> public, but attacks the subconscious motive, which is not only private,<br> it is unknown even to the person himself.”</br></br></i></p><p>This passive-aggression, this attempt to safely snipe from cover while avoiding direct confrontation that will permit others to adjudicate the objective facts of the matter, is the hallmark of the Autumn People, the rabbits, the insects, the Nothing Mentality. Beware of them. Stand against them. And always – always – shine the light of truth upon them. It is the one thing they truly fear.</p></div>",
  "content_text": "John C. Wright\nexcavates an astonishing review\nof THE LORD OF THE RINGS to illustrate the malice and poverty of spirit inhibiting those who never have anything but evil to speak of that which speaks truth to the human condition.\nThe reason why this mocking and forgotten review should be remembered and held up to mockery in turn is because the animating spirit behind it is alive and well, if not increased in size and reach and insolence.\nRay Bradbury described this spirit, as is his wont to describe anything he describes, with the insight of a poet and the wisdom of a sage:\n“For these beings, fall is the ever normal season, the only weather, there be no choice beyond. Where do they come from? The dust. Where do they go? The grave. Does blood stir their veins? No: the night wind. What ticks in their head? The worm. What speaks from their mouth? The toad. What sees from their eye? The snake. What hears with their ear? The abyss between the stars. They sift the human storm for souls, eat flesh of reason, fill tombs with sinners. They frenzy forth. In gusts they beetle-scurry, creep, thread, filter, motion, make all moons sullen, and surely cloud all clear-run waters. The spider-web hears them, trembles – breaks. Such are the autumn people. Beware of them.”\n-Ray Bradbury, SOMETHING WICKED THIS WAY COMES\nElsewhere, he describes their homeland:\n“That country where it is always turning late in the year. That country where the hills are fog and the rivers are mist; where noons go quickly, dusks and twilights linger, and midnights stay. That country composed in the main of cellars, sub-cellars, coal-bins, closets, attics, and pantries faced away from the sun. That country whose people are autumn people, thinking only autumn thoughts. Whose people passing at night on the empty walks sound like rain.”\n-Ray Bradbury, THE OCTOBER COUNTRY\nIf this sound deliciously like the dreary rainscape of the microscopic yet immeasurable Hell portrayed in THE GREAT DIVORCE by C.S. Lewis, where the houses are imaginary and do not keep out the cold and wet, it is no coincidence. The two writers both had met the Autumn People from the cold lands deep in October.\nThey are among us today, the Autumn People, and in greater numbers, and for the most part they have dispensed with the delicacy of expression of Mr. Wilson, as with his culture and his learning. His spiritual grandchildren are among us, and turned against his learning the same scorn he turned against Tolkien’s, so they cannot express themselves as well, or, indeed, coherently.\nFrom the point of view of an autopsy then, one wonders what is wrong with such people as Mr. Wilson? What ails the Autumn People?\nThe Autumn People are now the gatekeepers of SF/F and of our larger media culture. They mock and belittle all nobility, all tradition, all religion. They are intellectual parasites who have nothing to offer but nihilism and momentary animal pleasure. They disingenuously appeal to justice, a concept in which they do not actually believe, in order to attack the very foundations of civilization. They preach uncertainty with all the rock-solid belief of a divinely-appointed prophet and place their faith in a method documented to be reliably false.\nMr. Wright asks what ails the Autumn People. There are others, even more generous of spirit, who wish to cure them. As for me and my House, we think only to vanquish their soulless Insect Army and send them scuttling back under the rocks from which they crept. For if the literary world is abandoned to them, there will never be another Middle Earth, there will never be another Narnia, there will be nothing but the black ravenous goo of the Silent Oecumene.\nThe Autumn People admire autumnal books. The Autumn Man is a man who has collapsed into temptation. The disease has eaten into his bones so that he can no longer stand. What he wants to hear is stories that mock the standing people, that trip them up, that bring things down to his level.  Above all, the Autumn People like sly, sarcastic books, books that mock and shock, books that sneer. Sneering is the only emotion they know, aside from dull resentment and petulant hatred. The Autumn Man therefore wants to hear a story that says he is in the right when he knows he is deeply wrong.\nIt sounds familiar, does it not? Sneering, snark, science fetishization, and sex in its most degraded form is the totality of today’s Pink SF/F. And notice in particular how Wright astutely draws the connection between the behavior of the reviewer and his current heirs:\n“the accuser does not address the evidence, which is\npublic, but attacks the subconscious motive, which is not only private,\nit is unknown even to the person himself.”\nThis passive-aggression, this attempt to safely snipe from cover while avoiding direct confrontation that will permit others to adjudicate the objective facts of the matter, is the hallmark of the Autumn People, the rabbits, the insects, the Nothing Mentality. Beware of them. Stand against them. And always – always – shine the light of truth upon them. It is the one thing they truly fear.",
  "tags": [
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-20T10:22:00+00:00"
}