{
  "url": "https://voxday.net/2014/03/05/to-sign-or-not-to-sign/",
  "scraped_at": "2025-12-15T16:48:14.958784",
  "title": "To sign or not to sign",
  "date_display": "March 5, 2014",
  "date_iso": "2014-03-05T18:00:00+00:00",
  "date_from_url": "2014-03-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This new <a href=\"https://www.change.org/petitions/jeff-bezos-protect-amazon-com-users-and-indie-publishing-authors-from-bullying-and-harassment-by-removing-anonymity-and-requiring-identity-verification-for-reviewing-and-forum-participation\">petition of Amazon</a> is interesting and relates to some problems to which I’ve pointed before:</p><blockquote class=\"tr_bq\"><p> <i>Protect Amazon.com Users and Indie Publishing Authors from Bullying and Harassment by Removing Anonymity and Requiring Identity Verification for Reviewing and Forum Participation</i></p><p>For the consideration of Mr. Jeff Bezos and Mr. Jon P. Fine:</p><p>The purpose of this petition is to bring to the attention of Mr. Bezos, Mr. Fine, and anyone else employed by Amazon or its subsidiaries, the lack of oversight and or control in the Amazon system regarding product reviewing—in particular book reviewing—and in the participation of the many forums on Amazon.</p><p>It is known the world over that Amazon changed the face of self publishing by implementing their Kindle Direct Publishing platform as well as their CreateSpace platform. Anyone can now quickly and easily publish a book using the tools freely provided by Amazon. Whether or not everyone who publishes through KPD and CreateSpace should is not at issue here. What is at issue is the fact that there is an incredible amount of bullying and harassment of some of these self publishing authors taking place on the Amazon platform/system.</p><p>I believe, as do countless others—many who will have signed this petition—that the reason this bullying and harassment is able to take place is because of the allowance of anonymity on Amazon. People have found ways to exploit this flaw in the system and are using it to bully, harass, and generally make life miserable for certain authors on Amazon. These people are able to create multiple accounts and then use those accounts to viciously attack and go after any author or person that they feel doesn’t belong on Amazon or who shouldn’t have published a book, made a comment on a forum post, etc. With the current system, if one anonymous account gets deactivated because it was reported for these things, it is easy for the bully or harasser to simply create another anonymous account and continue on with their shenanigans.</p><p>What I—we—would like to see happen is for Amazon to revise their policies regarding anonymity when it comes to writing product/book reviews and for participation in the forums. Reviewers and forum participants should not be anonymous. By removing their anonymity and forcing them to display their real, verified identities, I believe that much of the harassment and bullying will cease. It may continue elsewhere on the web, but not on Amazon, the largest online retail marketplace in the world, where it really counts. Buyers of products on Amazon must have their identities verified, so it should be an easy transition to implement a policy whereby reviewers and forum participants must also have their identities verified.</p></blockquote><p>While I could do without the appeals to bullying and so forth, the problem of fake reviews is definitely a real one. And while I am completely opposed to the law mandating real identities, this is simply one private corporation’s policy. So, my inclination is towards signing the petition, but I’m curious to know what the other authors and readers here have to say about it.</p><p>I think I’d sign it without question if it was limited to reviews. As much as I dislike restricted forums, I dislike even more the idea that the self-published authors, who are much less accustomed to trolls and socio-sadists working out their psychological issues online than I am, are forced to put up with this sort of nonsense from the very start, especially since they can’t control the forum comments the way I can here. Here it’s no trouble to ban the likes of the usual suspects, or put the short-term kibosh on someone getting out of line, but that’s simply not possible on Amazon.</p><p>I think the author of the petition’s assumption that sunlight will deter the trolls is generally correct. I noticed that the number of fake reviews of my books on Amazon declined considerably after I tracked down the woman from Minnesota and <a href=\"http://www.milobookclub.com/2013/01/23/a-rabbit-bites-back/\">posted her address</a> on this blog. Even the Greatest Pensman in All Karatonitus significantly reduced his activities here after I called his place of volunteer work and made it evident that I was in possession of the email addresses of his friends and extended family members. There are few trolls so shameless that they are willing to have those around them know what they are doing and how they are behaving.</p><p>UPDATE: Upon reading the discussion and engaging in further reflection, I have decided not to sign the petition. There are more effective ways to deal with the problem and anonymity can be a vital and necessary state for people in certain circumstances.</p></div>",
  "content_text": "This new\npetition of Amazon\nis interesting and relates to some problems to which I’ve pointed before:\nProtect Amazon.com Users and Indie Publishing Authors from Bullying and Harassment by Removing Anonymity and Requiring Identity Verification for Reviewing and Forum Participation\nFor the consideration of Mr. Jeff Bezos and Mr. Jon P. Fine:\nThe purpose of this petition is to bring to the attention of Mr. Bezos, Mr. Fine, and anyone else employed by Amazon or its subsidiaries, the lack of oversight and or control in the Amazon system regarding product reviewing—in particular book reviewing—and in the participation of the many forums on Amazon.\nIt is known the world over that Amazon changed the face of self publishing by implementing their Kindle Direct Publishing platform as well as their CreateSpace platform. Anyone can now quickly and easily publish a book using the tools freely provided by Amazon. Whether or not everyone who publishes through KPD and CreateSpace should is not at issue here. What is at issue is the fact that there is an incredible amount of bullying and harassment of some of these self publishing authors taking place on the Amazon platform/system.\nI believe, as do countless others—many who will have signed this petition—that the reason this bullying and harassment is able to take place is because of the allowance of anonymity on Amazon. People have found ways to exploit this flaw in the system and are using it to bully, harass, and generally make life miserable for certain authors on Amazon. These people are able to create multiple accounts and then use those accounts to viciously attack and go after any author or person that they feel doesn’t belong on Amazon or who shouldn’t have published a book, made a comment on a forum post, etc. With the current system, if one anonymous account gets deactivated because it was reported for these things, it is easy for the bully or harasser to simply create another anonymous account and continue on with their shenanigans.\nWhat I—we—would like to see happen is for Amazon to revise their policies regarding anonymity when it comes to writing product/book reviews and for participation in the forums. Reviewers and forum participants should not be anonymous. By removing their anonymity and forcing them to display their real, verified identities, I believe that much of the harassment and bullying will cease. It may continue elsewhere on the web, but not on Amazon, the largest online retail marketplace in the world, where it really counts. Buyers of products on Amazon must have their identities verified, so it should be an easy transition to implement a policy whereby reviewers and forum participants must also have their identities verified.\nWhile I could do without the appeals to bullying and so forth, the problem of fake reviews is definitely a real one. And while I am completely opposed to the law mandating real identities, this is simply one private corporation’s policy. So, my inclination is towards signing the petition, but I’m curious to know what the other authors and readers here have to say about it.\nI think I’d sign it without question if it was limited to reviews. As much as I dislike restricted forums, I dislike even more the idea that the self-published authors, who are much less accustomed to trolls and socio-sadists working out their psychological issues online than I am, are forced to put up with this sort of nonsense from the very start, especially since they can’t control the forum comments the way I can here. Here it’s no trouble to ban the likes of the usual suspects, or put the short-term kibosh on someone getting out of line, but that’s simply not possible on Amazon.\nI think the author of the petition’s assumption that sunlight will deter the trolls is generally correct. I noticed that the number of fake reviews of my books on Amazon declined considerably after I tracked down the woman from Minnesota and\nposted her address\non this blog. Even the Greatest Pensman in All Karatonitus significantly reduced his activities here after I called his place of volunteer work and made it evident that I was in possession of the email addresses of his friends and extended family members. There are few trolls so shameless that they are willing to have those around them know what they are doing and how they are behaving.\nUPDATE: Upon reading the discussion and engaging in further reflection, I have decided not to sign the petition. There are more effective ways to deal with the problem and anonymity can be a vital and necessary state for people in certain circumstances.",
  "tags": [
    "books",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-05T18:00:00+00:00"
}