{
  "url": "https://voxday.net/2014/03/15/us-drone-intercepted/",
  "scraped_at": "2025-12-15T16:49:09.784039",
  "title": "US drone intercepted",
  "date_display": "March 15, 2014",
  "date_iso": "2014-03-15T11:49:00+00:00",
  "date_from_url": "2014-03-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears as if both sides of the Ukraine tinderbox are now <a href=\"http://news.yahoo.com/russia-says-intercepted-us-drone-over-crimea-arms-180430584.html;_ylt=At_B0i8Ttqvgrn8ZH8ESDpzQtDMD;_ylu=X3oDMTBsdmNodWplBGNvbG8DYmYxBHBvcwMzBHNlYwNzcg--\">assuming a war footing</a>:</p><blockquote class=\"tr_bq\"><p> A United States surveillance<br> drone has been intercepted above the Ukranian region of Crimea, a<br> Russian state arms and technology group said Friday.</br></br></p><p>“The<br> drone was flying at about 4,000 metres (12,000 feet) and was virtually<br> invisible from the ground. It was possible to break the link with US<br> operators with complex radio-electronic” technology, said Rostec in a<br> statement. The drone fell<br> “almost intact into the hands of self-defence forces” added Rostec,<br> which said it had manufactured the equipment used to down the aircraft,<br> but did not specify who was operating it.</br></br></br></br></br></br></br></p><p>“Judging<br> by its identification number, UAV MQ-5B belonged to the 66th American<br> Reconnaissance Brigade, based in Bavaria,” Rostec said on its website,<br> which also carried a picture of what it said was the captured drone.</br></br></br></p></blockquote><p>The Obama administration is flirting with an incredibly stupid war. Talk about cashing in one’s military credibility unwisely! Not only does the USA have zero support from the American people for a war against Russia over Ukraine, it’s entirely possible that more than half the American population believes Russia to be in the right.</p></div>",
  "content_text": "It appears as if both sides of the Ukraine tinderbox are now\nassuming a war footing\n:\nA United States surveillance\ndrone has been intercepted above the Ukranian region of Crimea, a\nRussian state arms and technology group said Friday.\n“The\ndrone was flying at about 4,000 metres (12,000 feet) and was virtually\ninvisible from the ground. It was possible to break the link with US\noperators with complex radio-electronic” technology, said Rostec in a\nstatement. The drone fell\n“almost intact into the hands of self-defence forces” added Rostec,\nwhich said it had manufactured the equipment used to down the aircraft,\nbut did not specify who was operating it.\n“Judging\nby its identification number, UAV MQ-5B belonged to the 66th American\nReconnaissance Brigade, based in Bavaria,” Rostec said on its website,\nwhich also carried a picture of what it said was the captured drone.\nThe Obama administration is flirting with an incredibly stupid war. Talk about cashing in one’s military credibility unwisely! Not only does the USA have zero support from the American people for a war against Russia over Ukraine, it’s entirely possible that more than half the American population believes Russia to be in the right.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-15T11:49:00+00:00"
}