{
  "url": "https://voxday.net/2014/03/21/your-daily-scalzi/",
  "scraped_at": "2025-12-15T16:50:19.661994",
  "title": "Your Daily Scalzi",
  "date_display": "March 21, 2014",
  "date_iso": "2014-03-21T17:00:00+00:00",
  "date_from_url": "2014-03-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Because we all have so much to learn from one of Science Fiction’s leading authors, I have created a site dedicated to preserving some of the more important bon mots gifted to the world by this very important literary figure.</p><p><a href=\"http://iscalzi.blogspot.com/\">John Scalzi: Wit and Wisdom</a>, is dedicated to preserving the historic words of the award-winning author and ensuring that future generations will have the benefit of them. Think of it as Plato to the man’s Socrates. If you are interested in assisting this educational endeavor, we are looking for two or three admins who can determine which of the vast plethora of quotes are worthy of preservation.</p><p>Unfortunately, despite my best efforts, there are simply too many other things that distract me from posting about the most important author in <strike>Science Fiction</strike>literature every single day. I hope this will help make up for that lapse.</p></div>",
  "content_text": "Because we all have so much to learn from one of Science Fiction’s leading authors, I have created a site dedicated to preserving some of the more important bon mots gifted to the world by this very important literary figure.\nJohn Scalzi: Wit and Wisdom\n, is dedicated to preserving the historic words of the award-winning author and ensuring that future generations will have the benefit of them. Think of it as Plato to the man’s Socrates. If you are interested in assisting this educational endeavor, we are looking for two or three admins who can determine which of the vast plethora of quotes are worthy of preservation.\nUnfortunately, despite my best efforts, there are simply too many other things that distract me from posting about the most important author in\nScience Fiction\nliterature every single day. I hope this will help make up for that lapse.",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-03-21T17:00:00+00:00"
}