{
  "url": "https://voxday.net/2009/06/20/any-buyers-remorse/",
  "scraped_at": "2026-01-08T22:59:14.806734",
  "title": "Any buyer’s remorse?",
  "date_display": "June 20, 2009",
  "date_iso": "2009-06-20T22:03:00+00:00",
  "date_from_url": "2009-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to admit, the funniest thing about most secularists is the way they are totally clueless about what their kind have done to society and what it is in the process of becoming.  I’m quite confident that the shiny, sexy, science fiction world they had in mind didn’t look anything like <a href=\"http://i.dailymail.co.uk/i/pix/2009/06/17/article-1193384-055E4FE3000005DC-456_306x481.jpg\">this</a>.  It was supposed to be Logan’s Run minus the hand expiry, not Kull the Conquerer meets Tarl Cabot.</p><p>The end game is pagan barbarian culture, with all the lunacy and violence that historically entailed.  My question for the true-believing secularists is this: Assume for the sake of argument that I am correct regarding where the West is heading.  Would you have sought the end of traditional Western Christian culture if you’d known it was going to be succeeded by pagan barbarism rather than the progressive sci-fi vision that was assumed?</p></div>",
  "content_text": "I have to admit, the funniest thing about most secularists is the way they are totally clueless about what their kind have done to society and what it is in the process of becoming.  I’m quite confident that the shiny, sexy, science fiction world they had in mind didn’t look anything like\nthis\n.  It was supposed to be Logan’s Run minus the hand expiry, not Kull the Conquerer meets Tarl Cabot.\nThe end game is pagan barbarian culture, with all the lunacy and violence that historically entailed.  My question for the true-believing secularists is this: Assume for the sake of argument that I am correct regarding where the West is heading.  Would you have sought the end of traditional Western Christian culture if you’d known it was going to be succeeded by pagan barbarism rather than the progressive sci-fi vision that was assumed?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-20T21:03:00+00:00"
}