{
  "url": "https://voxday.net/2009/06/10/apple-and-brand-identity/",
  "scraped_at": "2026-01-08T22:58:19.925541",
  "title": "Apple and brand identity",
  "date_display": "June 10, 2009",
  "date_iso": "2009-06-10T09:08:00+00:00",
  "date_from_url": "2009-06-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://i.gizmodo.com/5284638/when-pro-doesnt-mean-pro-anymore\">Gizmodo laments Apple’s surrender</a> to the class-flatteners:</p><blockquote><p>A leveling of class distinctions in Apple products is going to sting people who valued the affectation of elitism that came with using Apple’s top-of-the-line products. Even subtle differences—like the premium paid for the matte black MacBook over the otherwise identical shiny white one, were signals, beamed out to the others in the coffee shop, declaring who was “da boss.” You know, the guys who wore the white earbuds with pride five years ago.</p></blockquote><p>Since I regard the Cult of Apple with contempt and pay about as little attention to Apple’s products as it is possible to do and still remain technologically current, the angst of those <a href=\"http://whatever.scalzi.com/2009/06/09/gizmodo-agrees-apple-fans-are-status-seeking-beta-monkeys/#comments\">Scalzi describes</a> as “status-seeking beta monkeys” strikes me with a certain sense of schadenfreude.  I don’t have any thing against Apple itself, you understand, and I have a tremendous regard for Steve Jobs.  I have fond memories of my Apple IIe as well as my original Macintosh, it’s just that Apple now builds its business on certain target markets, none of which apply to me.</p><p>It’s not that I’m unaware of the way in which brand identity serves as a method of social communication.  I quite enjoy taking my massive Dell XPS M1710 and its glowing cobalt-blue lights that make it look as if it is powered by a nuclear reactor to conferences and sitting down in the midst of a gaggle of weak-wristed executives and their ultra-thin, ultra-light Macintosh notebooks that won’t strain their spaghetti-thin arms.  They always look at me with a mixture of fear, alarm, and awe; yes, I am your Notebook Alpha, bitches!</p><p>A freaky liquid-cooled Alienware machine would be even better, but Alienware is owned by Dell anyhow, and besides, when I’m asked about my monster – as I always am – I like to pretend that I went with Dell because it’s such a great corporate computer.  I can usually get them to buy into it right up until I start playing MAME or Call of Duty….  Anyhow, it’s important to maintain your perspective and keep in mind that using Apple products doesn’t make you a better person.  That’s what Linux is for.</p></div>",
  "content_text": "Gizmodo laments Apple’s surrender\nto the class-flatteners:\nA leveling of class distinctions in Apple products is going to sting people who valued the affectation of elitism that came with using Apple’s top-of-the-line products. Even subtle differences—like the premium paid for the matte black MacBook over the otherwise identical shiny white one, were signals, beamed out to the others in the coffee shop, declaring who was “da boss.” You know, the guys who wore the white earbuds with pride five years ago.\nSince I regard the Cult of Apple with contempt and pay about as little attention to Apple’s products as it is possible to do and still remain technologically current, the angst of those\nScalzi describes\nas “status-seeking beta monkeys” strikes me with a certain sense of schadenfreude.  I don’t have any thing against Apple itself, you understand, and I have a tremendous regard for Steve Jobs.  I have fond memories of my Apple IIe as well as my original Macintosh, it’s just that Apple now builds its business on certain target markets, none of which apply to me.\nIt’s not that I’m unaware of the way in which brand identity serves as a method of social communication.  I quite enjoy taking my massive Dell XPS M1710 and its glowing cobalt-blue lights that make it look as if it is powered by a nuclear reactor to conferences and sitting down in the midst of a gaggle of weak-wristed executives and their ultra-thin, ultra-light Macintosh notebooks that won’t strain their spaghetti-thin arms.  They always look at me with a mixture of fear, alarm, and awe; yes, I am your Notebook Alpha, bitches!\nA freaky liquid-cooled Alienware machine would be even better, but Alienware is owned by Dell anyhow, and besides, when I’m asked about my monster – as I always am – I like to pretend that I went with Dell because it’s such a great corporate computer.  I can usually get them to buy into it right up until I start playing MAME or Call of Duty….  Anyhow, it’s important to maintain your perspective and keep in mind that using Apple products doesn’t make you a better person.  That’s what Linux is for.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-10T08:08:00+00:00"
}