{
  "url": "https://voxday.net/2009/06/11/charge-transparent-fraud/",
  "scraped_at": "2026-01-08T22:58:29.105494",
  "title": "The charge: Transparent Fraud",
  "date_display": "June 11, 2009",
  "date_iso": "2009-06-11T19:15:00+00:00",
  "date_from_url": "2009-06-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I always find it amusing how Darwinists screech and point “CREATIONIST” like pod people encountering a real human whenever anyone expresses any doubts whatsoever about ND-TENS.  And yet, the pro-Darwinian propagandists like Richard Dawkins are so astoundingly incompetent and their arguments are so obviously full of logical holes that it won’t be terribly long before it becomes obvious to most people that few genuinely intelligent individuals subscribe to a theory primarily held by maleducated dimwits who are either too indoctrinated or too dense to be capable of critically examining it.</p><p>I felt <a href=\"http://anglocath.blogspot.com/2009/06/darwinism-transparent-fraud.html\">this guy’s critique</a> was fairly pedestrian, but I did find it interesting to see how the process of coming to doubt Darwinian theory tends to be completely different than the way that evolutionary enthusiasts claim it happens.  It’s seldom a question of attempting to avoid religious doubts – indeed, the very charge tends to imply a guilty plea to the metaphysical angle mentioned – it’s simply a question of shedding the mindless indoctrination that most of us acquired in school.  It seems as if most of these pro-evolutionary bozos who are not professional biologists fail to realize that those of us who doubt ND-TENS had very much the same textbooks and schooling that they did.</p><blockquote><p>I have passed over in silence some other sophistical arguments proposed by Darwinists, namely Darwin’s own discussion of variations within domesticated species, Haeckel’s embryoes, and Dawkins’ computer-generated insects, as too obviously irrelevant to need any comment beyond dismissal. Perhaps worthy of refutation, however, is the Darwinist “Just-So” story of “sexual selection.” This is an attempt to account for obviously unadaptive biological structures like the beautiful but cumbersome tail of the peacock. According to this theory, peahens like big beautiful tails, so the disadvantages of the tail in terms of the competition for survival is outweighed by its advantages for reproductive success. The whole notion is an exercise in begging the question. It assumes that peahens have already evolved unadaptive tastes. These unadaptive tastes cannot be explained by Darwinist mechanisms. I have not included these various bad Darwinist arguments in my accusations of fraud because they seem to me to be illogical rather than dishonest.</p><p>In a real science, if there is inadequate data, we say that we don’t know. For example, in the science in which I was trained, historical linguistics, there is very strong, solid evidence that Sanskrit is related to Greek and German, while there is a tiny amount of very weak evidence that Basque might possibly be related to Georgian. Therefore we assert that Sanskrit, Greek, and German are descendants of a hypothetical proto-Indo-European, while we say we don’t know the origins of Basque.</p><p>Darwinism does not have this respect for the evidence. Why not? I believe it does not because it is not a scientific theory. Its proponents frequently claim that their account must be accepted — regardless of any weaknesses in evidence or argument — because it is the only existing account which abides by materialist naturalism. This is the key to understanding the motivation for their bad faith and fraud. Darwinists are attempting to use the prestige of science to advance a metaphysical position, their commitment to materialist naturalism. Darwinism is the creation myth of naturalist materialists. That is why, I believe, they consistently call their critics “creationists,” regardless of their critics’ actual positions, and accuse them of being motivated out of a secret belief in the literal truth of Genesis. They are so concerned with Genesis because they are aggressively attempting to replace it with a rival myth, not because of some supposed threat to “Science” from “Religion.” In reality Darwinism’s proponents are the unreasoning dogmatists blinded by their faith in their own unexamined metaphysical assumptions, and its skeptics are the ones using reason and respecting the methods of science.</p></blockquote><p>I don’t think evolution is a proper field of scientific study either, but then, I think that’s true of a lot of semi-sciences, including economics, history, psychology, and other soft sciences.  As an aside, the deeper I delve into the history of economic theory, the more obvious it becomes that political economy is far more philosophy and ideology than science; ironically, the theoretical basis of “scientific” macroeconomics is little more than half-baked Freudian theory.  To me, the more significant aspect of the issue is that evolution is largely scientifically irrelevant.  Unless you’re messing around with bacteria or something else with extremely short generations, there’s little practical utility to the theory and even then you’re not dealing with anything that can reasonably described as natural selection given the inherently unnatural conditions imposed by the scientist.</p><p>Like Keynesianism, evolution was successful due to factors far outside its scientific credibility.  And like Keynesianism, evolution will eventually fade away as growing scientific knowledge renders that credibility increasingly implausible.  Even if you’re a die-hard believer in the theory of evolution by natural selection, consider this:  What other scientific theory has studies continuously performed in order to <i>support</i> it rather than <i>making use</i> of it.</p></div>",
  "content_text": "I always find it amusing how Darwinists screech and point “CREATIONIST” like pod people encountering a real human whenever anyone expresses any doubts whatsoever about ND-TENS.  And yet, the pro-Darwinian propagandists like Richard Dawkins are so astoundingly incompetent and their arguments are so obviously full of logical holes that it won’t be terribly long before it becomes obvious to most people that few genuinely intelligent individuals subscribe to a theory primarily held by maleducated dimwits who are either too indoctrinated or too dense to be capable of critically examining it.\nI felt\nthis guy’s critique\nwas fairly pedestrian, but I did find it interesting to see how the process of coming to doubt Darwinian theory tends to be completely different than the way that evolutionary enthusiasts claim it happens.  It’s seldom a question of attempting to avoid religious doubts – indeed, the very charge tends to imply a guilty plea to the metaphysical angle mentioned – it’s simply a question of shedding the mindless indoctrination that most of us acquired in school.  It seems as if most of these pro-evolutionary bozos who are not professional biologists fail to realize that those of us who doubt ND-TENS had very much the same textbooks and schooling that they did.\nI have passed over in silence some other sophistical arguments proposed by Darwinists, namely Darwin’s own discussion of variations within domesticated species, Haeckel’s embryoes, and Dawkins’ computer-generated insects, as too obviously irrelevant to need any comment beyond dismissal. Perhaps worthy of refutation, however, is the Darwinist “Just-So” story of “sexual selection.” This is an attempt to account for obviously unadaptive biological structures like the beautiful but cumbersome tail of the peacock. According to this theory, peahens like big beautiful tails, so the disadvantages of the tail in terms of the competition for survival is outweighed by its advantages for reproductive success. The whole notion is an exercise in begging the question. It assumes that peahens have already evolved unadaptive tastes. These unadaptive tastes cannot be explained by Darwinist mechanisms. I have not included these various bad Darwinist arguments in my accusations of fraud because they seem to me to be illogical rather than dishonest.\nIn a real science, if there is inadequate data, we say that we don’t know. For example, in the science in which I was trained, historical linguistics, there is very strong, solid evidence that Sanskrit is related to Greek and German, while there is a tiny amount of very weak evidence that Basque might possibly be related to Georgian. Therefore we assert that Sanskrit, Greek, and German are descendants of a hypothetical proto-Indo-European, while we say we don’t know the origins of Basque.\nDarwinism does not have this respect for the evidence. Why not? I believe it does not because it is not a scientific theory. Its proponents frequently claim that their account must be accepted — regardless of any weaknesses in evidence or argument — because it is the only existing account which abides by materialist naturalism. This is the key to understanding the motivation for their bad faith and fraud. Darwinists are attempting to use the prestige of science to advance a metaphysical position, their commitment to materialist naturalism. Darwinism is the creation myth of naturalist materialists. That is why, I believe, they consistently call their critics “creationists,” regardless of their critics’ actual positions, and accuse them of being motivated out of a secret belief in the literal truth of Genesis. They are so concerned with Genesis because they are aggressively attempting to replace it with a rival myth, not because of some supposed threat to “Science” from “Religion.” In reality Darwinism’s proponents are the unreasoning dogmatists blinded by their faith in their own unexamined metaphysical assumptions, and its skeptics are the ones using reason and respecting the methods of science.\nI don’t think evolution is a proper field of scientific study either, but then, I think that’s true of a lot of semi-sciences, including economics, history, psychology, and other soft sciences.  As an aside, the deeper I delve into the history of economic theory, the more obvious it becomes that political economy is far more philosophy and ideology than science; ironically, the theoretical basis of “scientific” macroeconomics is little more than half-baked Freudian theory.  To me, the more significant aspect of the issue is that evolution is largely scientifically irrelevant.  Unless you’re messing around with bacteria or something else with extremely short generations, there’s little practical utility to the theory and even then you’re not dealing with anything that can reasonably described as natural selection given the inherently unnatural conditions imposed by the scientist.\nLike Keynesianism, evolution was successful due to factors far outside its scientific credibility.  And like Keynesianism, evolution will eventually fade away as growing scientific knowledge renders that credibility increasingly implausible.  Even if you’re a die-hard believer in the theory of evolution by natural selection, consider this:  What other scientific theory has studies continuously performed in order to\nsupport\nit rather than\nmaking use\nof it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-11T18:15:00+00:00"
}