{
  "url": "https://voxday.net/2009/06/17/curious-incuriosity-of-greens/",
  "scraped_at": "2026-01-08T22:58:58.248496",
  "title": "The curious incuriosity of the Greens",
  "date_display": "June 17, 2009",
  "date_iso": "2009-06-17T13:45:00+00:00",
  "date_from_url": "2009-06-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I find it strange that Fox News and so many right-leaning blogs are so interested in the legitimacy of the Iranian elections, so much so that <a href=\"http://angryforareason.blogspot.com/2009/06/this-blog-has-gone-green-for-iran.html\">some blogs have</a>, like the BBC, even <a href=\"http://www.instapundit.com\">gone green</a> in support of what is being optimistically called the Green Revolution.  There’s nothing wrong with that; I certainly have no affection for the present Iranian mullahcracy.</p><p>But it is remarkable that many of these same bloggers have shown no similar interest in the serious questions about the legitimacy of the last American election despite <a href=\"http://www.worldnetdaily.com/index.php?fa=PAGE.view&amp;pageId=101368\">the huge percentage of Americans</a> who believe Obama should make all of the records being questioned open to the public.  Since these pro-Green blogs are unwilling to accept assurances from the Khamenei administration regarding the election results, one wonders why they blindly accept the Obama administration’s insistence that there is no important information in the various records they have kept sealed with unprecedented legal efforts.</p><p>Do they seriously believe that American politicians are less likely to lie than Iranian politicians?  Or is the prospect of electoral illegitimacy at home simply too frightening to contemplate?  I have no problem admitting that there may well be absolutely nothing to bar Obama from holding office in the various sealed records; the point is that until his records are unsealed, no one can possibly be certain that his election was legitimate.</p><p>Steve Sailer reaches <a href=\"http://isteve.blogspot.com/2009/06/iranian-election.html\">a similar conclusion</a>: <i>After all, Mexico is only our neighbor while Iran is obviously much more important, what with it being on the other side of the world and all….  I did mention several times back in 2006 that I was suspicious that the party of the left got ripped off in the Mexican election. But very few other people in the American press acted at all concerned about the validity of the Mexican election</i></p></div>",
  "content_text": "I find it strange that Fox News and so many right-leaning blogs are so interested in the legitimacy of the Iranian elections, so much so that\nsome blogs have\n, like the BBC, even\ngone green\nin support of what is being optimistically called the Green Revolution.  There’s nothing wrong with that; I certainly have no affection for the present Iranian mullahcracy.\nBut it is remarkable that many of these same bloggers have shown no similar interest in the serious questions about the legitimacy of the last American election despite\nthe huge percentage of Americans\nwho believe Obama should make all of the records being questioned open to the public.  Since these pro-Green blogs are unwilling to accept assurances from the Khamenei administration regarding the election results, one wonders why they blindly accept the Obama administration’s insistence that there is no important information in the various records they have kept sealed with unprecedented legal efforts.\nDo they seriously believe that American politicians are less likely to lie than Iranian politicians?  Or is the prospect of electoral illegitimacy at home simply too frightening to contemplate?  I have no problem admitting that there may well be absolutely nothing to bar Obama from holding office in the various sealed records; the point is that until his records are unsealed, no one can possibly be certain that his election was legitimate.\nSteve Sailer reaches\na similar conclusion\n:\nAfter all, Mexico is only our neighbor while Iran is obviously much more important, what with it being on the other side of the world and all….  I did mention several times back in 2006 that I was suspicious that the party of the left got ripped off in the Mexican election. But very few other people in the American press acted at all concerned about the validity of the Mexican election",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-17T12:45:00+00:00"
}