{
  "url": "https://voxday.net/2009/06/02/doubleplus-doomed/",
  "scraped_at": "2026-01-08T22:57:43.787323",
  "title": "Doubleplus Doomed",
  "date_display": "June 2, 2009",
  "date_iso": "2009-06-02T21:11:00+00:00",
  "date_from_url": "2009-06-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And you thought it was bad enough when you thought Obama, or at least one of his pet Keynesian economists, <a href=\"http://www.nytimes.com/2009/06/01/business/01deese.html?_r=3&amp;ref=politics\">was running GM</a>:</p><blockquote><p>“There was a time between Nov. 4 and mid-February when I was the only full-time member of the auto task force,” Mr. Deese, a special assistant to the president for economic policy, acknowledged recently as he hurried between his desk at the White House and the Treasury building next door. “It was a little scary.”</p><p>But now, according to those who joined him in the middle of his crash course about the automakers’ downward spiral, he has emerged as one of the most influential voices in what may become President Obama’s biggest experiment yet in federal economic intervention.  While far more prominent members of the administration are making the big decisions about Detroit, it is Mr. Deese who is often narrowing their options.</p><p>A month ago, when the administration was divided over whether to support Fiat’s bid to take over much of Chrysler, it was Mr. Deese who spoke out strongly against simply letting the company go into liquidation, according to several people who were present for the debate.</p></blockquote><p>Now this is fabulous!  We actually have a wannabe lawyer with a poli-sci degree from Middlebury and no absolutely experience in the real world handed directly responsibility for making important economic policy decisions.  I’m going to go out on a real limb here and predict that this automotive experiment isn’t going to end well.</p><p>Better yet, he was <i>the top economic staffer</i> for Hillary Clinton’s campaign.  Remember, that was the campaign that didn’t know how the nomination rules worked.  What are the odds he knows the first thing about malinvestment or realizes that he’s following the Japanese zombie model?  One in one quintillion against or one in one megabazillion?  I’d have more confidence in Paul Krugman.  Actually, come to think of it, I’d have more confidence in the decomposed corpse of John Maynard Keynes.</p></div>",
  "content_text": "And you thought it was bad enough when you thought Obama, or at least one of his pet Keynesian economists,\nwas running GM\n:\n“There was a time between Nov. 4 and mid-February when I was the only full-time member of the auto task force,” Mr. Deese, a special assistant to the president for economic policy, acknowledged recently as he hurried between his desk at the White House and the Treasury building next door. “It was a little scary.”\nBut now, according to those who joined him in the middle of his crash course about the automakers’ downward spiral, he has emerged as one of the most influential voices in what may become President Obama’s biggest experiment yet in federal economic intervention.  While far more prominent members of the administration are making the big decisions about Detroit, it is Mr. Deese who is often narrowing their options.\nA month ago, when the administration was divided over whether to support Fiat’s bid to take over much of Chrysler, it was Mr. Deese who spoke out strongly against simply letting the company go into liquidation, according to several people who were present for the debate.\nNow this is fabulous!  We actually have a wannabe lawyer with a poli-sci degree from Middlebury and no absolutely experience in the real world handed directly responsibility for making important economic policy decisions.  I’m going to go out on a real limb here and predict that this automotive experiment isn’t going to end well.\nBetter yet, he was\nthe top economic staffer\nfor Hillary Clinton’s campaign.  Remember, that was the campaign that didn’t know how the nomination rules worked.  What are the odds he knows the first thing about malinvestment or realizes that he’s following the Japanese zombie model?  One in one quintillion against or one in one megabazillion?  I’d have more confidence in Paul Krugman.  Actually, come to think of it, I’d have more confidence in the decomposed corpse of John Maynard Keynes.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-02T20:11:00+00:00"
}