{
  "url": "https://voxday.net/2009/06/26/econ-projec/",
  "scraped_at": "2026-01-08T22:59:48.624174",
  "title": "Econ project",
  "date_display": "June 26, 2009",
  "date_iso": "2009-06-26T18:54:00+00:00",
  "date_from_url": "2009-06-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have something I intend to do once I finish the book – which is rapidly approaching the end – and I’m interested in knowing if anyone else might be interested in helping with it.  I’ve made use of the figures from Angus Maddison’s <i>The World Economy: historical statistics</i>, but they end in 2003.  It seems to me it would be useful to update them through 2008.  I’ll handle the 21 nations in the Western Offshoots and Western Europe categories, but I’d like to know if anyone else wants to do any the other regions once I’ve worked out the conversion process required.  If you’re up for it, please let me know how many countries for which you’d be willing to calculate Populatio, GDP, and GDP per capita.</p><p>Also, Don Reynolds, please email me.  There’s a chapter which concerns Friedman that I’d like to run by you.</p></div>",
  "content_text": "I have something I intend to do once I finish the book – which is rapidly approaching the end – and I’m interested in knowing if anyone else might be interested in helping with it.  I’ve made use of the figures from Angus Maddison’s\nThe World Economy: historical statistics\n, but they end in 2003.  It seems to me it would be useful to update them through 2008.  I’ll handle the 21 nations in the Western Offshoots and Western Europe categories, but I’d like to know if anyone else wants to do any the other regions once I’ve worked out the conversion process required.  If you’re up for it, please let me know how many countries for which you’d be willing to calculate Populatio, GDP, and GDP per capita.\nAlso, Don Reynolds, please email me.  There’s a chapter which concerns Friedman that I’d like to run by you.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-26T17:54:00+00:00"
}