{
  "url": "https://voxday.net/2009/06/15/econ-101-is-hard/",
  "scraped_at": "2026-01-08T22:58:43.583687",
  "title": "Inflation and the NFL",
  "date_display": "June 15, 2009",
  "date_iso": "2009-06-15T13:30:00+00:00",
  "date_from_url": "2009-06-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Peter King fails to <a href=\"http://sportsillustrated.cnn.com/2009/writers/peter_king/06/14/books/2.html\">account for inflation</a>:</p><blockquote><p>1964: Namath $142,333 per year<br>2009: Sanchez $10 million per year</br></p></blockquote><p>Of course, if you substitute real dollars for nominal ones, Namath was receiving the 2009 equivalent of a $979,067 annual salary.  If one considers how much the NFL has grown in terms of audience and revenue production over the last 45 years, a 10x increase in player salaries really doesn’t sound all that outrageous.  And, that’s using the official CPI statistics, which the BLS was kind enough to inform us is around <a href=\"http://www.milobookclub.com/2009/05/29/reliability-of-government-statistics/\">half the actual rate</a> of price inflation.</p><p>What is outrageous is the way in which veteran players are consistently shortchanged in favor of rookies who have never played a single down in the NFL and have a 50 percent chance of being worthless to their teams.  But, I suppose we probably shouldn’t be surprised that an SI sportswriter doesn’t know the first thing about money. <i>“How on God’s green earth can Washington cut Americorps? It’s one of the best federal motivators for kids out of college to give a year of their lives to volunteer with some of the neediest agencies and people in our country. Wake up, Washington.”</i></p><p>Have a look at that FY2010 Federal budget, Mr. King.  There’s your answer.  You know, in the big red lines that go WAAAAYYY south of the horizontal axis marked zero.</p></div>",
  "content_text": "Peter King fails to\naccount for inflation\n:\n1964: Namath $142,333 per year\n2009: Sanchez $10 million per year\nOf course, if you substitute real dollars for nominal ones, Namath was receiving the 2009 equivalent of a $979,067 annual salary.  If one considers how much the NFL has grown in terms of audience and revenue production over the last 45 years, a 10x increase in player salaries really doesn’t sound all that outrageous.  And, that’s using the official CPI statistics, which the BLS was kind enough to inform us is around\nhalf the actual rate\nof price inflation.\nWhat is outrageous is the way in which veteran players are consistently shortchanged in favor of rookies who have never played a single down in the NFL and have a 50 percent chance of being worthless to their teams.  But, I suppose we probably shouldn’t be surprised that an SI sportswriter doesn’t know the first thing about money.\n“How on God’s green earth can Washington cut Americorps? It’s one of the best federal motivators for kids out of college to give a year of their lives to volunteer with some of the neediest agencies and people in our country. Wake up, Washington.”\nHave a look at that FY2010 Federal budget, Mr. King.  There’s your answer.  You know, in the big red lines that go WAAAAYYY south of the horizontal axis marked zero.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-15T12:30:00+00:00"
}