{
  "url": "https://voxday.net/2009/06/14/few-thoughts-on-lf-section-one/",
  "scraped_at": "2026-01-08T22:58:38.336827",
  "title": "A few thoughts on LF section one",
  "date_display": "June 14, 2009",
  "date_iso": "2009-06-14T08:32:00+00:00",
  "date_from_url": "2009-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>1. It’s always surprising how much harder even the simplest fill-in-the-blanks are than what would otherwise appear to be difficult multiple choice questions.  If questions three and six were reversed, I wonder if even one in ten of those who got it right on the multiple choice would have still done so.  On a tangential note, a surprising number of people who scored 80 or more answered “Roosevelt” on question six.  I didn’t expect to see that.</p><p>2.  I was pleased to see how many people understood that Goldberg is making a connection between religion and fascism.  I was somewhat less pleased to see how many people misunderstood the nature of that relationship.  Just to be clear, fascism!=theocracy.  An important element of fascism is the sacralization of secular politics, which is not at all the same thing as the politicization of a religion.</p><p>3.  I found it very amusing that one quiz-taker who called himself JonahGoldbergIsALying$*%! or something to that effect only scored 30, which is one correct answer above the monkey score.  As a rule, if you want to set yourself up as a critic – and especially if you’re going to assume a position of intellectual superiority – it tends to help to be able to demonstrate you possess at least some evidence of a clue regarding the subject.  Of course, as we saw in the Blumenthal video, no one is so certain that he “knows his shit” as a complete ignoramus with a college degree.</p><p>NB: the correct answer to Question Six was not, in fact, “Benjamin Yahoo”.</p><p>4.  A note to the superficially pedantic.  Given that literally everyone who has read <i>Liberal Fascism</i> is perfectly aware that Fascism began with Benito Mussolini – the fact that this week’s reading is entitled “Mussolini: the Father of Fascism” would be your first clue – it is really not necessary to repeatedly point this out as if you are saying something meaningful when people are discussing pre-20th century governments and ideologies.  In such context, “fascism” is understood to mean “proto-fascism”.  Ideas seldom appear <i>ex nihilo</i>, so discussing the potential intellectual roots of an ideology is a perfectly reasonable thing to do for those who are interested in the matter.</p><p>5.  I was impressed at how well people retained most of the more important facts in the introduction.  It’s fallen back to 64 percent since Jonah posted the link at The Corner, but at one point, after several hundred people had taken the quiz, the AVERAGE score was 72 percent.  That’s quite good, especially compared to the average 59 percent on the introduction to the last book.  Give yourselves a self-congratulatory pat on your collective back, if that’s not too fascistic.  You know, given the alliteration and supreme flexibility of the word, I’m a little surprised no budding young sci-fi author has adopted it as a euphemism.  Doesn’t “motherfascist” sound less contrived and more expressive than the lame Battlestar Galactic “frack”?</p><p>Anyhow, I hope you enjoyed the quiz and invite you to take a crack at the one that will be posted next weekend.  A ten-question quiz will be posted each Saturday, followed by a 25-question final covering the entire text at the end.  But, the quizzes will stay up, so if you happen to be busy or fall behind in your reading, you can always take them later.</p></div>",
  "content_text": "1. It’s always surprising how much harder even the simplest fill-in-the-blanks are than what would otherwise appear to be difficult multiple choice questions.  If questions three and six were reversed, I wonder if even one in ten of those who got it right on the multiple choice would have still done so.  On a tangential note, a surprising number of people who scored 80 or more answered “Roosevelt” on question six.  I didn’t expect to see that.\n2.  I was pleased to see how many people understood that Goldberg is making a connection between religion and fascism.  I was somewhat less pleased to see how many people misunderstood the nature of that relationship.  Just to be clear, fascism!=theocracy.  An important element of fascism is the sacralization of secular politics, which is not at all the same thing as the politicization of a religion.\n3.  I found it very amusing that one quiz-taker who called himself JonahGoldbergIsALying$*%! or something to that effect only scored 30, which is one correct answer above the monkey score.  As a rule, if you want to set yourself up as a critic – and especially if you’re going to assume a position of intellectual superiority – it tends to help to be able to demonstrate you possess at least some evidence of a clue regarding the subject.  Of course, as we saw in the Blumenthal video, no one is so certain that he “knows his shit” as a complete ignoramus with a college degree.\nNB: the correct answer to Question Six was not, in fact, “Benjamin Yahoo”.\n4.  A note to the superficially pedantic.  Given that literally everyone who has read\nLiberal Fascism\nis perfectly aware that Fascism began with Benito Mussolini – the fact that this week’s reading is entitled “Mussolini: the Father of Fascism” would be your first clue – it is really not necessary to repeatedly point this out as if you are saying something meaningful when people are discussing pre-20th century governments and ideologies.  In such context, “fascism” is understood to mean “proto-fascism”.  Ideas seldom appear\nex nihilo\n, so discussing the potential intellectual roots of an ideology is a perfectly reasonable thing to do for those who are interested in the matter.\n5.  I was impressed at how well people retained most of the more important facts in the introduction.  It’s fallen back to 64 percent since Jonah posted the link at The Corner, but at one point, after several hundred people had taken the quiz, the AVERAGE score was 72 percent.  That’s quite good, especially compared to the average 59 percent on the introduction to the last book.  Give yourselves a self-congratulatory pat on your collective back, if that’s not too fascistic.  You know, given the alliteration and supreme flexibility of the word, I’m a little surprised no budding young sci-fi author has adopted it as a euphemism.  Doesn’t “motherfascist” sound less contrived and more expressive than the lame Battlestar Galactic “frack”?\nAnyhow, I hope you enjoyed the quiz and invite you to take a crack at the one that will be posted next weekend.  A ten-question quiz will be posted each Saturday, followed by a 25-question final covering the entire text at the end.  But, the quizzes will stay up, so if you happen to be busy or fall behind in your reading, you can always take them later.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-14T07:32:00+00:00"
}