{
  "url": "https://voxday.net/2009/06/04/frauds-of-science-ii/",
  "scraped_at": "2026-01-08T22:57:55.672201",
  "title": "The frauds of science II",
  "date_display": "June 4, 2009",
  "date_iso": "2009-06-04T15:15:00+00:00",
  "date_from_url": "2009-06-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Martin Blume <a href=\"http://www.nature.com/nature/journal/v459/n7247/full/459645a.html#a1\">protests too much</a> in his review of <i>Plastic Fantastic: How the Biggest Fraud in Physics Shook the Scientific World</i>by Eugenie Samuel Reich:</p><blockquote><p>Reich does an excellent job of dealing with the facts of the Schön case, but less well with their interpretation. She tends to describe issues in black-and-white terms and uses strident language unnecessarily. An acerbic tone creeps into judgements of the individuals involved, such as one editor being “opinionated”, and this distracts from her central points.  More important is Reich’s conclusion that the self-correction process of science failed in this case and should not be trusted: “It seems like little more than blind faith to insist that all activity carried out in the name of science will always be self-correcting.” Yet Reich doesn’t say where this assumption comes from. No scientist who has thought about how science works would “insist” on this; nor can it “always” be true.</p></blockquote><p>Blume’s criticism of Reich’s failure to defend her assertion is downright humorous, considering that no scientist ever offers any actual <i>scientific</i> evidence for this supposedly self-correcting nature.  In fact, the only evidence I’ve ever seen on the matter indicates that 14 percent of scientists admit their colleagues falsify data and 72 percent admit that their colleagues engage in other questionable practices.  And it’s hilarious to see how Blume damns pretty much every science blogger and science fetishist who has ever addressed the issue of science’s self-correcting nature; most of them exhibit a belief in it far blinder than any religious faith.  The pedantic quibble over an obvious rhetorical flourish is almost embarrassing as the point Reich has made, and which Blume is trying desperately to evade, is that there is little, if any, evidence that science is any more self-correcting than any other human endeavor; I daresay it’s far less self-correcting than computer programming or race car driving, just to give two examples.</p><p>Blume would have done better to put Schön’s fraud into proper statistical perspective rather than attempting to claim it as a case of the system working.  No number of arrests can prove the city is crime-free.  After attempting to minimize the force of Reich’s criticism through declaring that no scientist believes science is always self-correcting, he then does a 180 and attempts to defend the current self-correction process.  He’s surely correct that the probability of detecting data fabrication can be increased, but I am deeply skeptical that an exhortation to remain vigilant and encourage alertness will have any effect at all.  And his iconoclastic suggestion that important results should be replicated will surely confuse the innocent who genuinely believes that repetition is an integral part of the scientific process.</p><p>Blume’s defense of scientific integrity is little more than fluff, and leads me to conclude that Reich will likely be provided the opportunity to write more books of this sort.</p></div>",
  "content_text": "Martin Blume\nprotests too much\nin his review of\nPlastic Fantastic: How the Biggest Fraud in Physics Shook the Scientific World\nby Eugenie Samuel Reich:\nReich does an excellent job of dealing with the facts of the Schön case, but less well with their interpretation. She tends to describe issues in black-and-white terms and uses strident language unnecessarily. An acerbic tone creeps into judgements of the individuals involved, such as one editor being “opinionated”, and this distracts from her central points.  More important is Reich’s conclusion that the self-correction process of science failed in this case and should not be trusted: “It seems like little more than blind faith to insist that all activity carried out in the name of science will always be self-correcting.” Yet Reich doesn’t say where this assumption comes from. No scientist who has thought about how science works would “insist” on this; nor can it “always” be true.\nBlume’s criticism of Reich’s failure to defend her assertion is downright humorous, considering that no scientist ever offers any actual\nscientific\nevidence for this supposedly self-correcting nature.  In fact, the only evidence I’ve ever seen on the matter indicates that 14 percent of scientists admit their colleagues falsify data and 72 percent admit that their colleagues engage in other questionable practices.  And it’s hilarious to see how Blume damns pretty much every science blogger and science fetishist who has ever addressed the issue of science’s self-correcting nature; most of them exhibit a belief in it far blinder than any religious faith.  The pedantic quibble over an obvious rhetorical flourish is almost embarrassing as the point Reich has made, and which Blume is trying desperately to evade, is that there is little, if any, evidence that science is any more self-correcting than any other human endeavor; I daresay it’s far less self-correcting than computer programming or race car driving, just to give two examples.\nBlume would have done better to put Schön’s fraud into proper statistical perspective rather than attempting to claim it as a case of the system working.  No number of arrests can prove the city is crime-free.  After attempting to minimize the force of Reich’s criticism through declaring that no scientist believes science is always self-correcting, he then does a 180 and attempts to defend the current self-correction process.  He’s surely correct that the probability of detecting data fabrication can be increased, but I am deeply skeptical that an exhortation to remain vigilant and encourage alertness will have any effect at all.  And his iconoclastic suggestion that important results should be replicated will surely confuse the innocent who genuinely believes that repetition is an integral part of the scientific process.\nBlume’s defense of scientific integrity is little more than fluff, and leads me to conclude that Reich will likely be provided the opportunity to write more books of this sort.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-04T14:15:00+00:00"
}