{
  "url": "https://voxday.net/2009/06/14/go-thou-and-edi/",
  "scraped_at": "2026-01-08T22:58:40.250093",
  "title": "Go, thou, and edit",
  "date_display": "June 14, 2009",
  "date_iso": "2009-06-14T14:30:00+00:00",
  "date_from_url": "2009-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was looking up the entry on the <i>Methodenstreit</i>,  started poking around as you do, and discovered that the Wikipedia article about <i>The Irrational Atheist</i> <a href=\"http://en.wikipedia.org/wiki/The_Irrational_Atheist\">describes a book</a> that is barely recognizable to me.  Among other things, neither Dinesh D’Souza nor his book had anything whatsoever to do with TIA; I purposefully refrained from reading <i>What’s So Great About Christianity?</i> or any similar books until after completing my own book.  According to the Wikipedia rules, I’m not allowed to edit the entry myself, but perhaps some of you – either critics or fans, I don’t really care which so long as you’re capable of writing reasonably accurate summaries – might be willing to do so.  I suppose it would be fitting to use either <a href=\"http://en.wikipedia.org/wiki/The_end_of_faith\">The End of Faith</a> page or the one for <a href=\"http://en.wikipedia.org/wiki/The_god_delusion\">The God Delusion</a> as an acceptable model.</p><p>Among other things, I think <a href=\"http://en.wikipedia.org/wiki/Euthyphro_dilemma\">the wikipage on the Euthyphro Dilemma</a> would benefit from my critique of it, since it’s a more fundamental reduction of Socrates’s construction than the obvious arbitrary angle.  I suggest that it serves as a good example in why it’s beneficial to read the argument you are looking to criticize in its entirety rather than simply accepting the common summation of it.  (In case you haven’t read the appendices, the salient point is that Socrates had to cheat in order to construct the logic required to support the dilemma, and he even admits that he is doing so in the text.  So, the so-called Euthyphro Dilemma is a non-starter in its original polytheistic terms, as well as being inapplicable to a monotheistic scenario.)</p><p>And don’t forget, according to those examples, any criticisms should be directed to me for responses to be added to the wikipage later.  I think that’s an incredibly stupid Wikipedia policy, but we don’t make the rules, we just play by them.  I think one mistake that conservatives and libertarians have made is to simply concede the online encyclopedic ground rather than fighting for it by utilizing the techniques that are explictly deemed permissible by the Wikipedia editors.  For example, if Richard Dawkins is permitted to deny the public charge that he is an atheist fundamentalist, then every other target of public criticism has to be permitted similar denials… it’s interesting to note how the “criticism” sections of several wikipages contain more text that can be best described as “response to criticism” than they do actual criticism.</p><p>So, my response to the charge of Nazihood in the section entitled “Feminism, multiculturalism and equality” is as follows: I reject the label on what should be the embarrassingly obvious grounds that libertarians are damn near the cardinal opposite of Nazis.</p></div>",
  "content_text": "I was looking up the entry on the\nMethodenstreit\n,  started poking around as you do, and discovered that the Wikipedia article about\nThe Irrational Atheist\ndescribes a book\nthat is barely recognizable to me.  Among other things, neither Dinesh D’Souza nor his book had anything whatsoever to do with TIA; I purposefully refrained from reading\nWhat’s So Great About Christianity?\nor any similar books until after completing my own book.  According to the Wikipedia rules, I’m not allowed to edit the entry myself, but perhaps some of you – either critics or fans, I don’t really care which so long as you’re capable of writing reasonably accurate summaries – might be willing to do so.  I suppose it would be fitting to use either\nThe End of Faith\npage or the one for\nThe God Delusion\nas an acceptable model.\nAmong other things, I think\nthe wikipage on the Euthyphro Dilemma\nwould benefit from my critique of it, since it’s a more fundamental reduction of Socrates’s construction than the obvious arbitrary angle.  I suggest that it serves as a good example in why it’s beneficial to read the argument you are looking to criticize in its entirety rather than simply accepting the common summation of it.  (In case you haven’t read the appendices, the salient point is that Socrates had to cheat in order to construct the logic required to support the dilemma, and he even admits that he is doing so in the text.  So, the so-called Euthyphro Dilemma is a non-starter in its original polytheistic terms, as well as being inapplicable to a monotheistic scenario.)\nAnd don’t forget, according to those examples, any criticisms should be directed to me for responses to be added to the wikipage later.  I think that’s an incredibly stupid Wikipedia policy, but we don’t make the rules, we just play by them.  I think one mistake that conservatives and libertarians have made is to simply concede the online encyclopedic ground rather than fighting for it by utilizing the techniques that are explictly deemed permissible by the Wikipedia editors.  For example, if Richard Dawkins is permitted to deny the public charge that he is an atheist fundamentalist, then every other target of public criticism has to be permitted similar denials… it’s interesting to note how the “criticism” sections of several wikipages contain more text that can be best described as “response to criticism” than they do actual criticism.\nSo, my response to the charge of Nazihood in the section entitled “Feminism, multiculturalism and equality” is as follows: I reject the label on what should be the embarrassingly obvious grounds that libertarians are damn near the cardinal opposite of Nazis.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-14T13:30:00+00:00"
}