{
  "url": "https://voxday.net/2009/06/02/he-still-believes/",
  "scraped_at": "2026-01-08T22:57:39.764261",
  "title": "He still believes",
  "date_display": "June 2, 2009",
  "date_iso": "2009-06-02T11:47:00+00:00",
  "date_from_url": "2009-06-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>My new publisher was kind enough to supply me with a number of books I needed for reference while working on the current project, so I now possess more Paul Krugman books in multiple editions than I would have imagined one year ago.  Having read the 1999 edition of <i>The Return of Depression Economics</i> as well as a few of his self-serving attempts to pretend that he saw the housing and financial crises coming – sorry, Paul, but spotting the housing boom in 2005, one year before it ended, is not exactly impressive – I was curious to see how he would deal with two rather glaring statements that had appeared in that original edition in the 2008 re-release, titled <i>The Return of Depression Economics and the Crisis of 2008</i>.</p><p><i>“On the whole, I have an easy conscience about the problems of the advanced countries.  What I mean by that statement is that the solution for these problems do not seem to involve any especially painful tradeoffs…. the things advanced countries need to do to counter depression economics any compromise of the commitment to free markets.”</i> (1999, p. 162)</p><p><i>“The world economy is not in depression; it probably will not be in depression anytime soon.”</i> (1999, p. 154)</p><p>I haven’t found any reference to the former quote yet, in fact, the section of the title essay to which it belongs, “Protecting the Rich”, appears to have been excised entirely.  Apparently Krugman isn’t eager to remind everyone how he declared that keeping interest rates low and maintaining inflation around two percent would be sufficient for the USA to avoid a Japanese-style liquidity trap.  Surprisingly, however, he repeats the second quote twice in the space of two pages in the new edition.</p><p><i>“We’re not in a depression now, and despite everything, I don’t think we’re headed into one (although I’m not as sure of that as I’d like to be).”</i> (2009, p. 180)</p><p><i>“The world economy is not in depression; it probably won’t fall into depression, despite the magnitude of the current crisis (although I wish I was completely sure about that).”</i> (2009, p. 181)</p><p>It should be interesting to see how those statements continue to evolve in future books and/or revised editions.  Unsurprisingly, his proposed solution involves increasing the size of the next fiscal stimulus equivalent to 4 percent of US GDP.  But since this is only $560 billion, his published proposal is smaller than the $787 billion stimulus package that Obama has proposed as part of the 2010 budget.</p></div>",
  "content_text": "My new publisher was kind enough to supply me with a number of books I needed for reference while working on the current project, so I now possess more Paul Krugman books in multiple editions than I would have imagined one year ago.  Having read the 1999 edition of\nThe Return of Depression Economics\nas well as a few of his self-serving attempts to pretend that he saw the housing and financial crises coming – sorry, Paul, but spotting the housing boom in 2005, one year before it ended, is not exactly impressive – I was curious to see how he would deal with two rather glaring statements that had appeared in that original edition in the 2008 re-release, titled\nThe Return of Depression Economics and the Crisis of 2008\n.\n“On the whole, I have an easy conscience about the problems of the advanced countries.  What I mean by that statement is that the solution for these problems do not seem to involve any especially painful tradeoffs…. the things advanced countries need to do to counter depression economics any compromise of the commitment to free markets.”\n(1999, p. 162)\n“The world economy is not in depression; it probably will not be in depression anytime soon.”\n(1999, p. 154)\nI haven’t found any reference to the former quote yet, in fact, the section of the title essay to which it belongs, “Protecting the Rich”, appears to have been excised entirely.  Apparently Krugman isn’t eager to remind everyone how he declared that keeping interest rates low and maintaining inflation around two percent would be sufficient for the USA to avoid a Japanese-style liquidity trap.  Surprisingly, however, he repeats the second quote twice in the space of two pages in the new edition.\n“We’re not in a depression now, and despite everything, I don’t think we’re headed into one (although I’m not as sure of that as I’d like to be).”\n(2009, p. 180)\n“The world economy is not in depression; it probably won’t fall into depression, despite the magnitude of the current crisis (although I wish I was completely sure about that).”\n(2009, p. 181)\nIt should be interesting to see how those statements continue to evolve in future books and/or revised editions.  Unsurprisingly, his proposed solution involves increasing the size of the next fiscal stimulus equivalent to 4 percent of US GDP.  But since this is only $560 billion, his published proposal is smaller than the $787 billion stimulus package that Obama has proposed as part of the 2010 budget.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-02T10:47:00+00:00"
}