{
  "url": "https://voxday.net/2009/06/17/its-logic-of-sorts-i-suppose/",
  "scraped_at": "2026-01-08T22:59:00.098404",
  "title": "It’s a logic of sorts, I suppose",
  "date_display": "June 17, 2009",
  "date_iso": "2009-06-17T17:15:00+00:00",
  "date_from_url": "2009-06-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Middle-aged woman cheats, divorces, and therefore concludes <a href=\"http://www.theatlantic.com/doc/200907/divorce\">the institution of marriage must be outmoded</a>.  The personal is no longer political, it is now the social science.</p><blockquote><p>Heart-shattering as this moment was—a gravestone sunk down on two decades of history—I would not be able to replace the romantic memory of my fellow transgressor with the more suitable image of my husband, which is what it would take in modern-therapy terms to knit our family’s domestic construct back together. In women’s-magazine parlance, I did not have the strength to “work on” falling in love again in my marriage.</p></blockquote><p>I rather look forward to the moment when all the short-sighted, self-seeking pseudo-intellectuals suddenly realize with horror that if marriage is outmoded in a society, the long-term consequences are neither positive nor liberating.  All it means is that your society has demographically doomed itself and is well on the way to being replaced by a more vigorous, ideologically fit culture.  But my favorite part of the article is this:</p><blockquote><p>As far as the children are concerned, how about the tribal approach (a natural, according to both primate and human evolution)? Let children between the ages of 1 and 5 be raised in a household of mothers and their female kin. Let the men/husbands/boyfriends come in once or twice a week to build shelves, prepare that bouillabaisse, or provide sex.</p></blockquote><p>Yes, I’m sure the matriarchal tribal model will suit the average white suburban woman wonderfully well.  Just look at how well it’s working in Africa and the American inner cities.  It may be time to begin looking into investing in companies that manufacture grass huts.</p><p>UPDATE – It gets better.  Oh, it gets <a href=\"http://www.theatlantic.com/doc/200703/loh-libido\">very much better indeed</a>, especially when she admires the bedtime ritual of one lesbian couple: <i>For the past twelve years, Teri and Pat have had a special Monday-night ritual. They order an extra-large cheese pizza (sixteen slices). While waiting—and I am not making this up—they settle in on the couch with large twin bags of Doritos. Each chip is dipped first in Philadelphia cream cheese and then in salsa. Cream cheese, salsa. Cream cheese, salsa. Cream cheese, salsa. The Doritos are finished to the last crumb, and then, upon arrival, the pizza as well. For Teri and Pat, this night of a million carbs is, by special agreement, guilt-free. Both feel that it is better than sex.</i></p></div>",
  "content_text": "Middle-aged woman cheats, divorces, and therefore concludes\nthe institution of marriage must be outmoded\n.  The personal is no longer political, it is now the social science.\nHeart-shattering as this moment was—a gravestone sunk down on two decades of history—I would not be able to replace the romantic memory of my fellow transgressor with the more suitable image of my husband, which is what it would take in modern-therapy terms to knit our family’s domestic construct back together. In women’s-magazine parlance, I did not have the strength to “work on” falling in love again in my marriage.\nI rather look forward to the moment when all the short-sighted, self-seeking pseudo-intellectuals suddenly realize with horror that if marriage is outmoded in a society, the long-term consequences are neither positive nor liberating.  All it means is that your society has demographically doomed itself and is well on the way to being replaced by a more vigorous, ideologically fit culture.  But my favorite part of the article is this:\nAs far as the children are concerned, how about the tribal approach (a natural, according to both primate and human evolution)? Let children between the ages of 1 and 5 be raised in a household of mothers and their female kin. Let the men/husbands/boyfriends come in once or twice a week to build shelves, prepare that bouillabaisse, or provide sex.\nYes, I’m sure the matriarchal tribal model will suit the average white suburban woman wonderfully well.  Just look at how well it’s working in Africa and the American inner cities.  It may be time to begin looking into investing in companies that manufacture grass huts.\nUPDATE – It gets better.  Oh, it gets\nvery much better indeed\n, especially when she admires the bedtime ritual of one lesbian couple:\nFor the past twelve years, Teri and Pat have had a special Monday-night ritual. They order an extra-large cheese pizza (sixteen slices). While waiting—and I am not making this up—they settle in on the couch with large twin bags of Doritos. Each chip is dipped first in Philadelphia cream cheese and then in salsa. Cream cheese, salsa. Cream cheese, salsa. Cream cheese, salsa. The Doritos are finished to the last crumb, and then, upon arrival, the pizza as well. For Teri and Pat, this night of a million carbs is, by special agreement, guilt-free. Both feel that it is better than sex.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-17T16:15:00+00:00"
}