{
  "url": "https://voxday.net/2009/06/18/keynesian-weaseling/",
  "scraped_at": "2026-01-08T22:59:05.605873",
  "title": "Keynesian weaseling",
  "date_display": "June 18, 2009",
  "date_iso": "2009-06-18T11:30:00+00:00",
  "date_from_url": "2009-06-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Paul Krugman <a href=\"http://www.nytimes.com/2002/08/02/opinion/dubya-s-double-dip.html\">attempts to weasel out</a> of his past statement about the desirability of a housing bubble in his August 2002 column when he wrote: “To fight this recession the Fed needs more than a snapback; it needs soaring household spending to offset moribund business investment. And to do that, as Paul McCulley of Pimco put it, Alan Greenspan needs to create a housing bubble to replace the Nasdaq bubble.”</p><p>Yesterday, Krugman <a href=\"http://krugman.blogs.nytimes.com/2009/06/17/and-i-was-on-the-grassy-knoll-too/\">claimed the following</a>:</p><blockquote><p>It wasn’t a piece of policy advocacy, it was just economic analysis. What I said was that the only way the Fed could get traction would be if it could inflate a housing bubble. And that’s just what happened.</p></blockquote><p>However, Mark Thornton of the Mises Institute <a href=\"http://blog.mises.org/archives/010153.asp\">easily explodes that claim</a>, as Krugman made multiple statements about the desirability of the Fed’s rate-cutting at almost precisely the same time that I was warning of <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=15297\">the eventual consequences</a> of doing so.</p><p>There’s no question that Krugman believed the Fed should cut rates to stimulate the housing market, that he advised the Fed to cut rates to stimulate the housing market, and that his only concern was the possibility that the rate cuts would not be sufficient to launch ahousing bubble to replace the broken tech equity bubble.</p></div>",
  "content_text": "Paul Krugman\nattempts to weasel out\nof his past statement about the desirability of a housing bubble in his August 2002 column when he wrote: “To fight this recession the Fed needs more than a snapback; it needs soaring household spending to offset moribund business investment. And to do that, as Paul McCulley of Pimco put it, Alan Greenspan needs to create a housing bubble to replace the Nasdaq bubble.”\nYesterday, Krugman\nclaimed the following\n:\nIt wasn’t a piece of policy advocacy, it was just economic analysis. What I said was that the only way the Fed could get traction would be if it could inflate a housing bubble. And that’s just what happened.\nHowever, Mark Thornton of the Mises Institute\neasily explodes that claim\n, as Krugman made multiple statements about the desirability of the Fed’s rate-cutting at almost precisely the same time that I was warning of\nthe eventual consequences\nof doing so.\nThere’s no question that Krugman believed the Fed should cut rates to stimulate the housing market, that he advised the Fed to cut rates to stimulate the housing market, and that his only concern was the possibility that the rate cuts would not be sufficient to launch ahousing bubble to replace the broken tech equity bubble.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-18T10:30:00+00:00"
}