{
  "url": "https://voxday.net/2009/06/11/lady-you-have-wrong-pseudoscience/",
  "scraped_at": "2026-01-08T22:58:27.246368",
  "title": "Gay is the new cat",
  "date_display": "June 11, 2009",
  "date_iso": "2009-06-11T14:45:00+00:00",
  "date_from_url": "2009-06-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While the woman who wrote this article doesn’t appear to understand either biology or the meaning of the term “cougar”, she does offer a perfectly reasonable explanation why busy, middle-aged professional women find it so difficult to develop relationships with men.  Because, as a general rule, it really helps a whole bunch if you’re <a href=\"http://blog.newsweek.com/blogs/popvox/archive/2009/06/10/why-cougars-crave-idol-runner-up-adam-lambert.aspx\"><i>not attracted to flamingly gay young ones</i></a>:</p><blockquote><p>I can’t stop thinking about him. And neither can any of my cougar-aged friends. We love Adam, truly, madly, deeply, in a kind of weirdly Mrs. Robinson sexual way. And the reason doesn’t just have to do with our past lives as professional groupies. It also has something to do with biology.</p></blockquote><p>I should be very interested to read an evolutionary <s>fairy tale</s>stable strategy explaining the biological rationale for older women to be attracted to young men with no desire to mate with them… for all my doubts about psychology, I suspect it is may be the more relevant pseudoscience here. The only thing biological about it is that these women are fantasizing about substituting platonic relationships for erotic ones, so it’s not weirdly Mrs. Robinson sexual, it’s not sexual at all.  They’re just frigid biddies who don’t realize it yet.</p><p>On a side note, it also highlights why no sane straight man should harbor any interest in pursuing any sort of relationship, no matter how brief, with these <s>cougars</s>catladies-in-waiting.</p></div>",
  "content_text": "While the woman who wrote this article doesn’t appear to understand either biology or the meaning of the term “cougar”, she does offer a perfectly reasonable explanation why busy, middle-aged professional women find it so difficult to develop relationships with men.  Because, as a general rule, it really helps a whole bunch if you’re\nnot attracted to flamingly gay young ones\n:\nI can’t stop thinking about him. And neither can any of my cougar-aged friends. We love Adam, truly, madly, deeply, in a kind of weirdly Mrs. Robinson sexual way. And the reason doesn’t just have to do with our past lives as professional groupies. It also has something to do with biology.\nI should be very interested to read an evolutionary\nfairy tale\nstable strategy explaining the biological rationale for older women to be attracted to young men with no desire to mate with them… for all my doubts about psychology, I suspect it is may be the more relevant pseudoscience here. The only thing biological about it is that these women are fantasizing about substituting platonic relationships for erotic ones, so it’s not weirdly Mrs. Robinson sexual, it’s not sexual at all.  They’re just frigid biddies who don’t realize it yet.\nOn a side note, it also highlights why no sane straight man should harbor any interest in pursuing any sort of relationship, no matter how brief, with these\ncougars\ncatladies-in-waiting.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-11T13:45:00+00:00"
}