{
  "url": "https://voxday.net/2009/06/23/laughing-at-tech-naive/",
  "scraped_at": "2026-01-08T22:59:23.972231",
  "title": "Laughing at the tech-naive",
  "date_display": "June 23, 2009",
  "date_iso": "2009-06-23T06:13:00+00:00",
  "date_from_url": "2009-06-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://meganmcardle.theatlantic.com/archives/2009/06/rethinking_the_kindle.php\">Megan McCardle</a> and <a href=\"http://www.geardiary.com/2009/06/19/kindles-drm-rears-its-ugly-head-and-it-is-ugly/\">other suckers</a> are shocked and awed that Amazon and Apple may flex the muscle that their idiot customers handed them:</p><blockquote><p>In the meantime, Amazon wants us to upgrade our Kindles every year or two. Apple wants us to upgrade our iPhone or iPod touch every year or two. This means that although the books remain in your Kindle library online you may not be able to download them once you upgrade your hardware. And there is no way to know — at least according to what the customer service rep told me.</p></blockquote><p>Now everyone is relieved because <a href=\"http://www.geardiary.com/2009/06/21/kindlegate-confusion-abounds-regarding-kindle-download-policy/\">the limits are on simultaneous devices</a>, not downloads.  But that’s not the point.  The point is that if you accept DRM devices, then you had better accept you are going to be completely at the mercy of the device manufacturer.  That’s why I refuse to buy either a Kindle or an iPhone; anything that requires passing your own data through the manufacturer’s official distribution channel is of zero interest to me.  Yes, I’m aware that there are always ways to get around it, but I prefer to give my business to manufacturers who aren’t attempting to keep their customers, and their customer’s data, in virtual lockdown.</p><p>DRM is nothing more than theft… from the consumer.  It’s the transformation of a purchase transaction into a rental one.  Piracy is an <a href=\"http://imgs.xkcd.com/comics/steal_this_comic.png\">abstract, invented, and artificial “crime”</a>.</p></div>",
  "content_text": "Megan McCardle\nand\nother suckers\nare shocked and awed that Amazon and Apple may flex the muscle that their idiot customers handed them:\nIn the meantime, Amazon wants us to upgrade our Kindles every year or two. Apple wants us to upgrade our iPhone or iPod touch every year or two. This means that although the books remain in your Kindle library online you may not be able to download them once you upgrade your hardware. And there is no way to know — at least according to what the customer service rep told me.\nNow everyone is relieved because\nthe limits are on simultaneous devices\n, not downloads.  But that’s not the point.  The point is that if you accept DRM devices, then you had better accept you are going to be completely at the mercy of the device manufacturer.  That’s why I refuse to buy either a Kindle or an iPhone; anything that requires passing your own data through the manufacturer’s official distribution channel is of zero interest to me.  Yes, I’m aware that there are always ways to get around it, but I prefer to give my business to manufacturers who aren’t attempting to keep their customers, and their customer’s data, in virtual lockdown.\nDRM is nothing more than theft… from the consumer.  It’s the transformation of a purchase transaction into a rental one.  Piracy is an\nabstract, invented, and artificial “crime”\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-23T05:13:00+00:00"
}