{
  "url": "https://voxday.net/2009/06/20/liberal-fascism-chapter-1/",
  "scraped_at": "2026-01-08T22:59:12.940118",
  "title": "Liberal Fascism – Chapter 1",
  "date_display": "June 20, 2009",
  "date_iso": "2009-06-20T05:30:00+00:00",
  "date_from_url": "2009-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><iframe frameborder=\"0\" height=\"500\" id=\"proprofs\" marginheight=\"0\" marginwidth=\"0\" name=\"proprofs\" src=\"http://www.proprofs.com/quiz-school/widget/v2/?id=44191&amp;bgcolor=&amp;fcolor=&amp;tcolor=\" style=\"overflow-x: hidden;\" width=\"420\"></iframe><br>This week’s discussion concerns the first chapter and Benito Mussolini, although questions concerning matters from the Introduction may be posted as well.  This should not be interpreted to mean that long-winded comments concerning tangential matters derailing the topic will be permitted.  And remember, the purpose of these quizzes is to strengthen your memory about the basics of the book; it’s a (mostly) multiple choice quiz so it’s not going to get into any deeper, philosophical tangents.  There are no trick questions, so if you know the material well, it should strike you as fairly easy.  You have only to look at the score reports to see that it’s not quite as easy for those who haven’t read the book or don’t recall it well.  Please note that if you missed the first quiz on the Introduction, you can still <a href=\"http://www.milobookclub.com/2009/06/13/liberal-fascism-introduction/\">take it here</a>.</br></p><p>The reading for next week will be Chapter 2 – “Adolf Hitler: Man of the Left”.  The quiz for that chapter will be posted on Saturday, June 27th.</p></div>",
  "content_text": "This week’s discussion concerns the first chapter and Benito Mussolini, although questions concerning matters from the Introduction may be posted as well.  This should not be interpreted to mean that long-winded comments concerning tangential matters derailing the topic will be permitted.  And remember, the purpose of these quizzes is to strengthen your memory about the basics of the book; it’s a (mostly) multiple choice quiz so it’s not going to get into any deeper, philosophical tangents.  There are no trick questions, so if you know the material well, it should strike you as fairly easy.  You have only to look at the score reports to see that it’s not quite as easy for those who haven’t read the book or don’t recall it well.  Please note that if you missed the first quiz on the Introduction, you can still\ntake it here\n.\nThe reading for next week will be Chapter 2 – “Adolf Hitler: Man of the Left”.  The quiz for that chapter will be posted on Saturday, June 27th.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-20T04:30:00+00:00"
}