{
  "url": "https://voxday.net/2009/06/08/mailvox-anti-semitis/",
  "scraped_at": "2026-01-08T22:58:14.268811",
  "title": "Mailvox: anti-semitism",
  "date_display": "June 8, 2009",
  "date_iso": "2009-06-08T17:30:00+00:00",
  "date_from_url": "2009-06-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JpH takes the correct approach and asks a question rather than assume he knows the answer:</p><blockquote><p>Do you support anti-Semitism? I don’t mind if the readers voice their opinions, no matter how silly they seem to be at times, but I just want to know if you agree with some of this very blatant anti-Semitism.  I don’t assume that you do, but I am curious nonetheless.</p></blockquote><p>In answer to the first question, no, I don’t support anti-Semitism, or Judenhassen, or whatever else you might want to call it.  Being a libertarian, I tend to cast a very jaundiced eye on collectivist and group identity notions of every kind.  To me, it makes no more sense to condemn today’s American Jews on the basis of the behavior of Jewish Bolshevists in Russia and Jewish Fascists in Italy than it does to hold today’s Romans responsible for the destruction of Carthage.  One has to be a collectivist to think in such terms.  Of course, because I am a libertarian, I also refuse to play thought police so long as people remain reasonably civil and I am an strong advocate of the Constitutional right of free association.</p><p>It’s not possible for me to answer the second question without more information, since I can’t know what JhP means by “this very blatant anti-Semitism” unless he details it.  Is he suggesting that it is anti-Semitic to mention that some of today’s liberal fascists happen to be Jewish?  Is it really anti-Semitic to provide <a href=\"http://www.philipweiss.org/mondoweiss/2009/06/max-blumenthal-feeling-the-hate-in-jerusalem-on-eve-of-obamas-cairo-address.html\">a link to a video</a> shot in Jerusalem which shows American Jews exhibiting a political perspective that most Americans would consider to be outside the mainstream?  The world is what it is, regardless of how we might prefer it to be, and attempting to sweep the uncomfortable facts under the carpet accomplishes nothing.</p><p>One need not harbor any ill-will towards anyone to question, as Napoleon did, whether these young Jews are more loyal to their Israeli identity than they are to their American citizenship.  Nor should one be surprised if the vast majority of the American people should fail to be anymore concerned about these obnoxious little idiots and their nation than they are about Bangladesh, Latvia, or Mali.  Although I don’t support it any more than I support banking bailouts or $787 billion stimulus plans, I have little doubt that anti-Semitism in the United States will continue to rise.  History clearly demonstrates that it is unwise and short-sighted for a small minority to attempt to exert significant political and financial power, because no matter how much they manage to accumulate, they will only hold it so long as they avoid sufficiently irritating the majority.</p><p>If the arrogance, entitlement and complete lack of awareness displayed by the young American Jews in the Blumenthal video is representative of the American Jewish elite, they would appear to be very unlikely to succeed in doing so.  Now, if you happen to believe that someone who warns you of danger ahead and advises you to avoid it is an enemy, not an friend, well, I can’t say I’m terribly concerned about your opinion.</p></div>",
  "content_text": "JpH takes the correct approach and asks a question rather than assume he knows the answer:\nDo you support anti-Semitism? I don’t mind if the readers voice their opinions, no matter how silly they seem to be at times, but I just want to know if you agree with some of this very blatant anti-Semitism.  I don’t assume that you do, but I am curious nonetheless.\nIn answer to the first question, no, I don’t support anti-Semitism, or Judenhassen, or whatever else you might want to call it.  Being a libertarian, I tend to cast a very jaundiced eye on collectivist and group identity notions of every kind.  To me, it makes no more sense to condemn today’s American Jews on the basis of the behavior of Jewish Bolshevists in Russia and Jewish Fascists in Italy than it does to hold today’s Romans responsible for the destruction of Carthage.  One has to be a collectivist to think in such terms.  Of course, because I am a libertarian, I also refuse to play thought police so long as people remain reasonably civil and I am an strong advocate of the Constitutional right of free association.\nIt’s not possible for me to answer the second question without more information, since I can’t know what JhP means by “this very blatant anti-Semitism” unless he details it.  Is he suggesting that it is anti-Semitic to mention that some of today’s liberal fascists happen to be Jewish?  Is it really anti-Semitic to provide\na link to a video\nshot in Jerusalem which shows American Jews exhibiting a political perspective that most Americans would consider to be outside the mainstream?  The world is what it is, regardless of how we might prefer it to be, and attempting to sweep the uncomfortable facts under the carpet accomplishes nothing.\nOne need not harbor any ill-will towards anyone to question, as Napoleon did, whether these young Jews are more loyal to their Israeli identity than they are to their American citizenship.  Nor should one be surprised if the vast majority of the American people should fail to be anymore concerned about these obnoxious little idiots and their nation than they are about Bangladesh, Latvia, or Mali.  Although I don’t support it any more than I support banking bailouts or $787 billion stimulus plans, I have little doubt that anti-Semitism in the United States will continue to rise.  History clearly demonstrates that it is unwise and short-sighted for a small minority to attempt to exert significant political and financial power, because no matter how much they manage to accumulate, they will only hold it so long as they avoid sufficiently irritating the majority.\nIf the arrogance, entitlement and complete lack of awareness displayed by the young American Jews in the Blumenthal video is representative of the American Jewish elite, they would appear to be very unlikely to succeed in doing so.  Now, if you happen to believe that someone who warns you of danger ahead and advises you to avoid it is an enemy, not an friend, well, I can’t say I’m terribly concerned about your opinion.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-08T16:30:00+00:00"
}