{
  "url": "https://voxday.net/2009/06/25/rethinking-natural-selection/",
  "scraped_at": "2026-01-08T22:59:35.144540",
  "title": "Rethinking natural selection",
  "date_display": "June 25, 2009",
  "date_iso": "2009-06-25T10:50:00+00:00",
  "date_from_url": "2009-06-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Once more, the evolutionary model <a href=\"http://www.washingtonpost.com/wp-dyn/content/article/2009/06/21/AR2009062101726.html?wprss=rss_nation\">is shown to be an inaccurate one</a>.  And, as I have predicted, it is genetic science that is increasingly punching holes in the theory of evolution by natural selection:</p><blockquote><p>Recent research has produced a surprise, however. Population geneticists expected to find dramatic differences as they got a look at the full genomes — about 25,000 genes — of people of widely varying ethnic and geographic backgrounds. Specifically, they expected to find that many ethnic groups would have derived alleles that their members shared but that were uncommon or nonexistent in other groups. Each regional, ethnic group or latitude was thought to have a genomic “signature” — the record of its recent evolution through natural selection.  But as analyses of genomes from dozens of distinct populations have rolled in — French, Bantu, Palestinian, Yakut, Japanese — that’s not what scientists have found. Dramatic genome variation among populations turns out to be extremely rare….</p><p>“Adaptations to the environment absolutely do occur,” said Joseph K. Pickrell, a graduate student at the University of Chicago who, with Graham Coop of the University of California at Davis, co-authored the recent study. “But they don’t occur according to this simple model that we and others have been looking for.”</p></blockquote><p>Given the lack of required change, it will be interesting to see how the true believers deal with this latest blow to their conceptual model.  No doubt they’ll quickly draw some cycles and epicycles to attempt accounting for the vast holes in the temporal schedule this creates.  Regardless of whether natural selection is, as biological philosopher Richard Dawkins declares, the <i>exact opposite of random</i>, it’s interesting to see that the real scientists are beginning to conclude that it is the random element that is the more important one.</p></div>",
  "content_text": "Once more, the evolutionary model\nis shown to be an inaccurate one\n.  And, as I have predicted, it is genetic science that is increasingly punching holes in the theory of evolution by natural selection:\nRecent research has produced a surprise, however. Population geneticists expected to find dramatic differences as they got a look at the full genomes — about 25,000 genes — of people of widely varying ethnic and geographic backgrounds. Specifically, they expected to find that many ethnic groups would have derived alleles that their members shared but that were uncommon or nonexistent in other groups. Each regional, ethnic group or latitude was thought to have a genomic “signature” — the record of its recent evolution through natural selection.  But as analyses of genomes from dozens of distinct populations have rolled in — French, Bantu, Palestinian, Yakut, Japanese — that’s not what scientists have found. Dramatic genome variation among populations turns out to be extremely rare….\n“Adaptations to the environment absolutely do occur,” said Joseph K. Pickrell, a graduate student at the University of Chicago who, with Graham Coop of the University of California at Davis, co-authored the recent study. “But they don’t occur according to this simple model that we and others have been looking for.”\nGiven the lack of required change, it will be interesting to see how the true believers deal with this latest blow to their conceptual model.  No doubt they’ll quickly draw some cycles and epicycles to attempt accounting for the vast holes in the temporal schedule this creates.  Regardless of whether natural selection is, as biological philosopher Richard Dawkins declares, the\nexact opposite of random\n, it’s interesting to see that the real scientists are beginning to conclude that it is the random element that is the more important one.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-25T09:50:00+00:00"
}