{
  "url": "https://voxday.net/2009/06/24/voxonomics-peter-schiff-transcrip/",
  "scraped_at": "2026-01-08T22:59:31.497005",
  "title": "Voxonomics – Peter Schiff transcript",
  "date_display": "June 24, 2009",
  "date_iso": "2009-06-24T11:55:00+00:00",
  "date_from_url": "2009-06-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This interview was recorded in March 2008.  Thanks very much to Justin, Ian, and Taylor for transcribing the interview:</p><p>Vox: You recently wrote about an <i>Alice in Wonderland</i> economy and you mentioned that it was bizarre to see the dollar gaining strength after a 75 basis point rate cut by the fed.  What’s going on?</p><p>Peter: Well, you know, it’s the expectations game. The fed had allowed the market to build in an expectation for a larger cut of a hundred basis points.  But when they didn’t come through with a hundred basis points, Wall Street was able to spin it into “The Fed is now hawkish on inflation”, “The Fed is going to be a little bit tougher on inflation”.  Which, of course, is not true, but it was able to result in a bit of a rally in the dollar.  And I think that really has helped lay the foundation for this bounce in the stock market, because people were afraid the dollar decline was going to get out of hand.  And they’re right.  The dollar is going to get clobbered. This is just a short term bounce.  What the fed did is completely irresponsible.  They shouldn’t have cut rates at all.  They should have raised rates.  They are going to cut them even more.  Inflation is just going to decimate the U.S. economy and the value of U.S. dollars.  People around the world who hold dollars I think understand this and they are going to be getting rid of them as quickly as they can.</p><p>Vox: That makes a lot of sense of course from a conventional perspective.  But, if you look at it from the “pushing on a string theory”, which says that it’s not possible to inflate your way out of a deflationary credit crunch.  How do you balance the one against the other then?</p><p>Peter: The Fed is going to do all that they can.  You can’t inflate your way out of any problems, you just inflate your way into greater problems, and that’s what’s happening.  If you look at what it’s doing, the Federal Reserve is basically taking on all the mortgage debt that nobody wants.  Increasingly, all mortgage securities are going to pass from private hands to public hands as the Fed ultimately ends up being the only mortgage lender in the United States and all mortgages will be originated by the Fed.  The Fed’s balance sheet will increasingly consist of mortgages.  This is pure inflation, as the Fed creates money to subsidize the housing market, to artificially prop up home prices.  The dollar is going to cave in.  That’s the Fed’s hope, that they can just create enough inflation to lift nominal home prices to the point where Americans can afford them.  And, of course, they need to engineer an increase in average income.  They need to see wages starting to rise along with prices so that Americans can have the income to afford the mortgage payment.  But, of course, it’s all going to be phony money.  The dollar, as I said, will collapse.  There is going to be no private demand for U.S. dollar denominated debt.  All the demand is going to be created by the Fed.  We are going to be completely a printing press economy, where instead of being able to borrow money from the Chinese and the Japanese like we’ve done in the past.  All the money that we need to borrow is going to be borrowed from the Fed, which means there’s not going to be any real savings behind it.  It’s going to be a printing press, and prices are going to run out of control.</p><p>Vox: When you talk about the Fed being the sole provider of mortgages, are you referring to Steve Forbes’ idea.</p><p>Peter: No, I’m just referring to what’s actually happening, where the Fed is taking mortgage collateral from Wall Street with no questions asked and the fact that Fannie Mae and Freddie Mac are going to be increasingly buying mortgages that nobody else would touch with a ten foot pole.  As the private sector is increasingly tightening their lending standards, the government sector is loosening theirs.  The private sector has learned a lesson and they want to start to require bigger down payments while Fannie Mae and Freddie Mac are now being told to secure mortgages with smaller down payments than they had in the past.  So, this is ultimately going to create a bigger problem for these securities because nobody is going to want to buy Fannie and Freddie debt because it is going to be increasingly risky.  So, again, all of that debt is going to find its way to the Federal Reserve.  The Fed is going to end up buying all this Fannie and Freddie insured paper because private individuals won’t want to own it because its not government insured, so that they’ll be able to take their Fannie and Freddie May debt and give it to the Federal Reserve in exchange for Treausuries.  So, the whole mortgage industry is going to be socialized and financed by the Fed, which means it’s financed by a printing press.  A lot of people are criticizing this as a taxpayer bailout, you know “why should taxpayers have to pay for this?”  It’s not the taxpayers per se who are paying for it.  It’s anybody who has U.S. dollars: people on social security, people on welfare, people who aren’t paying taxes but are receiving government checks.  They are going to pay for it because their checks are going to buy less.  And Americans who have money saved in pensions and retirement accounts and government bonds and municipal bonds.  They are going to suffer.  The prices are rising.  Oil prices are $100 a barrel.  People are going to the supermarket and they are seeing big increases in the price of food.  This is all a result of what the Fed is doing.  It’s got nothing to do with the scapegoats that the government is creating.  It’s not because of the Arab sheiks jacking up oil prices.  It’s not because some peasant in China is eating more meat.  None of this is true.  Prices are rising strictly as a function of the Federal Reserve debasing our money to bail everybody out.  This is the price that we pay.  Higher prices for all consumer goods and less value for our savings.</p><p>Vox: That would explain, obviously, the big leap up in the gold market that happened before the recent correction.  One thing that I discussed with Robert Prechter a little while ago was that the jump in metals and commodities was partially the result of a bubble.  We had the equity bubble then the real estate bubble and now we’re seeing some money move from real estate into commodities.  But are you saying that it’s simply the result of inflation from these moves by the Fed?</p><p>Peter:  Sure, and I don’t think there’s a bubble in gold or commodities.  These prices are simply rising to reflect the loss of value of U.S. currency.  Now, maybe the rise has gotten ahead of itself a bit, and is due for a pullback.  Maybe you have had a lot of speculators that have come along for the ride, but the underlying trend is for these markets to move higher because the dollar and other currencies are going to be moving lower because the central banks are going to continue to debase them.</p><p>Vox:  The chief economist for the national association of realtors is forecasting that home prices will remain flat in 2008.</p><p>Peter: Well, what do you expect?  You remember what David Lehrer used to do.  They denied that there was a problem, there was no bubble.  Then they said it is going to be a soft landing.  I mean these guys are shills.  All these guys are cheerleaders for the realtors.  They are trying to encourage people to buy homes.  And if they came out and said that your real estate prices are going to drop by ten or fifteen percent nobody would want to buy, so they constantly come out with rosy forecasts.  Just like Wall Street.  Wall Street is in the business of selling stocks, so they want to tell everybody things are great.  The national realtors are in the business of encouraging people to buy homes.  They are not going to come out with a forecast that says home prices are going to drop, because that is going to discourage people from doing exactly what they want them to do.</p><p>Vox: No, of course, what I thought was funny was that they were forecasting a flat 2008 from a price of $<br> 218,000 with the medium existing homes.  Today the report came out for February and the price is already $28,000 lower.</br></p><p>Peter: Yeah, as I said, they are never going to forecast the truth.  They are constantly going to be wrong.  I don’t know why anybody even pays any attention to what their economists say because it’s really advertising or propaganda whatever you want to call it.  It has nothing to do with some kind of objective economic analysis of the housing market.  If that were the case, they would be predicting a substantial decline.  How can home prices stay where they are?  It’s impossible.  The government is doing all they can to maintain inflated home prices, but it’s not going to work.  It could only work in the sense that they create so much inflation that real home prices plunge but nominal home prices hold up.  But that’s not going to make anybody happy.  They are going to live in a home that is still worth what they paid but they are not going to be able to afford to heat it or air condition or put food in the refrigerator.</p><p>Vox: Much less take out money based on their growing equity.</p><p>Peter:  All that’s going to grind to a halt unless of course the government finances it.  The private market for these home equity loans and second mortgages is drying up.  The market realizes that there is no collateral there.  And, of course, Americans are desperate.  They already owe more money on their homes than they are worth.  They are loaded up with credit card debt they can’t repay and auto loans and student loans.  Nobody wants to lend Americans more money and Americans figure, “we already owe so much money we can’t possibly pay it back; we might as well borrow even more because we might as well go out with a bang.”  Nobody is willing to lend them money of their own, so it is only the government that is willing to do it.  Of course, they have no money to lend.  All they can do is print it, which means they deprive society of purchasing power through a printing press that individuals never would have willingly given up on their own.</p><p>Vox:  Sure.  Now what are some of the best tips from your new book, which is called <i>Crash Proof</i>, which recommends ways to profit from the coming economic collapse?</p><p>Peter:  The best thing to understand is that it’s not the taxpayers.  It’s holders of dollars, people who have dollar savings and dollar-denominated investments.  So, if you want to avoid the biggest tax increase in U.S. history the only way to do it is to divest yourself of your dollars.  The advice that I gave in <i>Crash Proof</i> is really a giant tax shelter.  That’s what I am helping people do at my company, EuroPacific Capital.  We help American savers and investors to get out of U.S. based assets, reorganize their stock portfolios, get into foreign stocks in Europe and Asia.  Earn dividends in other currencies.  Have bonds in other currencies.  Get into commodities and precious metals.  Anything other than the U.S. dollar so you can avoid having to pay the price of what Bernanke is doing.  I describe the average American investor or saver with a giant bullseye on their back and they’re in Ben Bernanke’s cross hairs.  He’s going to shoot you unless you get rid of your dollars.  We can help you do that, but people need to do that as quickly as possible.</p><p>Vox: Okay.  Last question.  As an economic advisor to the Ron Paul presidential campaign, do you find a certain irony in the fact that most Republicans failed to support him when he is the only candidate who has a solid grasp of the structural challenges facing the financial markets and the economy.</p><p>Peter: I don’t find it ironic.  Unfortunately the Republicans are not the limited government party that they claim to be.  That’s how they try to get votes, but if you look at the way Republicans govern, they are politicians just like the Democrats.  They want big government.  They want high taxes.  They want high government regulation as the best way to secure their own re-election.  So, they try to appeal to the wing of the Republican party that is libertarian-oriented, limited government, traditional conservative values.  They figure that they are going to get those votes because they figure “they’ve got not choice because the Democrats are even for bigger government than we are.  We’ll pay lip service to their limited government views so that we can at least keep their votes away from the Democrats.  But the reality is that the mainstream rank and file of the Republican party is a big government party just like the Democrats.  When Ron Paul comes up and actually tries to run on Republican principles that a lot of people think represent the Republican party they shoot him down.  Because the Republican party of today, the modern Rebublican party, has nothing to do with small government and low taxes.  They are a big government party.</p><p>Vox: You’re preaching to the choir here: *laugh*.</p><p>Peter: I know. And it’s unfortunate, because that’s the choices we have in America, is, y’know, which, uh, big-government candidate do you want to support? And unfortunately, the only, y’know, [only] avenue that we have left is to get rid of U.S. assets. I mean, they’re going to tax us to death, and they’re going to inflate, uh, us to death [and] so Americans need to read the writing on the wall. And, y’know, if you read my book – “Crash-Proof: How to Profit From the Coming Economic Collapse” – I, y’know, I’ve got a few chapters in the back of the book that really detail the blueprint for how to build a crash-proofed portfolio and [and] get out of U.S. assets – before it’s too late.</p><p>Vox: Or, better yet, y’know, buy a beach place in the Bahamas and watch it all from the beach: *laugh*.</p><p>Peter: Well, I mean, y’know, if you want to physically leave the country – I don’t know how bad it’s going to get, but I think the first thing you need to do is get your money out of the country, or at least out of U. S. dollar investment. You can do that within a, uh, U. S. brokerage account, like, that’s what we do in EuroPacific Capital. I hope it doesn’t to the point where it’s so bad that we actually literally have to flee the country. And [and] get our bodies out of the country as well. I mean, it might come to that. Uh, but, for now, I’m hoping it doesn’t, but I know for sure, uh, that Americans are going to suffer a dramatic diminution in their standard of living, in their quality of life, as a result of what we’ve done in the past – the huge consumption binge, the borrowing and consumption binge we went on in the past. And now, as a result of what the government is doing to try to delay the day of reckoning. They are making the situation much, much worse. And so people have to be very, very careful about where their money is invested, and, more importantly, what currency those investments are in. Eh, they should go to my website and, y’know, there’s a lot of information on my website, uh, to help you, [to help you] understand this problem. And [a-, eh] the address is W- W- W- dot Europac, E- U- R- O- P- A- C- dot net, Europac dot net. Or people can talk to one of my brokers at [at] the company, call eight hundred, seven two seven, seven nine two two – eight hundred, seven two seven, seven nine two two – I’ve got a whole staff of brokers that can help, uh, y’know, walk you through these strategies.</p><p>vox: What kind of timeframe are you looking for? I mean, typically, I tend to have a contrarian edge myself. The housing crash didn’t surprise me, and it came along as I expected, but it came along about two years later than I expected. What’s your timeframe on this?</p><p>Peter: It’s always hard to talk about the timing, but I think this is going on right now. The dollar is losing value as we speak. I mean, it’s bounced a little bit today against the Yen and the Swiss franc, but it’s down, y’know, almost as much against the Canadian and Australian dollars, but, in general, the dollar is going down; these problems are huge. And, y’know, it was amazing once the problems became evident in th<br> e housing market how quickly it all unraveled. And so, y’know, things can happen very quickly. And [and, and] the key to this is to be early. Y’know, dont try to finesse it, don’t think “hey, maybe we got six more months, maybe we got a couple [ye-] more years” – I don’t know, maybe we do, maybe we don’t. But, nobody knows for certain. The best thing to do is understand what’s going to ultimately happen to the value of the dollar and the cost of living in the United States, our standard of living. And, people need to be protected. Y’know, if you’re a day late, uh, y’know, that’s, y’know, you’re [you’re] a day late. You’re done. Y’know, so it’s better to be early than late, because, y’know you can’t survive if you’re late, even if it’s by a day. So if you’re a year early or if you’re two years early…uh, but meantime, y’know, our strategies are throwing off some rather substantialdividend yields, uh, while people are waiting, so there’s no real opportunity cost, uh, to, uh, being early.</br></p><p>Vox: No, I can recall when the Euro was at point-eighty-eight rather than one-fifty-four, so…</p><p>Peter: Yeah, look, and it’s going a lot higher. There’s nothing that can happen to the dollar based on what they’re doing but decline in value. I mean, it’s obvious, it’s clear what’s going on, so, y’know, rather than just remaining ignorant or closing your eyes, uh, people need to understand what’s happening and take action before it’s too late.</p><p>Vox: Well, Peter, I really appreciate your time. Thanks very much.</p><p>Peter: Okay, thanks for talking to me.</p></div>",
  "content_text": "This interview was recorded in March 2008.  Thanks very much to Justin, Ian, and Taylor for transcribing the interview:\nVox: You recently wrote about an\nAlice in Wonderland\neconomy and you mentioned that it was bizarre to see the dollar gaining strength after a 75 basis point rate cut by the fed.  What’s going on?\nPeter: Well, you know, it’s the expectations game. The fed had allowed the market to build in an expectation for a larger cut of a hundred basis points.  But when they didn’t come through with a hundred basis points, Wall Street was able to spin it into “The Fed is now hawkish on inflation”, “The Fed is going to be a little bit tougher on inflation”.  Which, of course, is not true, but it was able to result in a bit of a rally in the dollar.  And I think that really has helped lay the foundation for this bounce in the stock market, because people were afraid the dollar decline was going to get out of hand.  And they’re right.  The dollar is going to get clobbered. This is just a short term bounce.  What the fed did is completely irresponsible.  They shouldn’t have cut rates at all.  They should have raised rates.  They are going to cut them even more.  Inflation is just going to decimate the U.S. economy and the value of U.S. dollars.  People around the world who hold dollars I think understand this and they are going to be getting rid of them as quickly as they can.\nVox: That makes a lot of sense of course from a conventional perspective.  But, if you look at it from the “pushing on a string theory”, which says that it’s not possible to inflate your way out of a deflationary credit crunch.  How do you balance the one against the other then?\nPeter: The Fed is going to do all that they can.  You can’t inflate your way out of any problems, you just inflate your way into greater problems, and that’s what’s happening.  If you look at what it’s doing, the Federal Reserve is basically taking on all the mortgage debt that nobody wants.  Increasingly, all mortgage securities are going to pass from private hands to public hands as the Fed ultimately ends up being the only mortgage lender in the United States and all mortgages will be originated by the Fed.  The Fed’s balance sheet will increasingly consist of mortgages.  This is pure inflation, as the Fed creates money to subsidize the housing market, to artificially prop up home prices.  The dollar is going to cave in.  That’s the Fed’s hope, that they can just create enough inflation to lift nominal home prices to the point where Americans can afford them.  And, of course, they need to engineer an increase in average income.  They need to see wages starting to rise along with prices so that Americans can have the income to afford the mortgage payment.  But, of course, it’s all going to be phony money.  The dollar, as I said, will collapse.  There is going to be no private demand for U.S. dollar denominated debt.  All the demand is going to be created by the Fed.  We are going to be completely a printing press economy, where instead of being able to borrow money from the Chinese and the Japanese like we’ve done in the past.  All the money that we need to borrow is going to be borrowed from the Fed, which means there’s not going to be any real savings behind it.  It’s going to be a printing press, and prices are going to run out of control.\nVox: When you talk about the Fed being the sole provider of mortgages, are you referring to Steve Forbes’ idea.\nPeter: No, I’m just referring to what’s actually happening, where the Fed is taking mortgage collateral from Wall Street with no questions asked and the fact that Fannie Mae and Freddie Mac are going to be increasingly buying mortgages that nobody else would touch with a ten foot pole.  As the private sector is increasingly tightening their lending standards, the government sector is loosening theirs.  The private sector has learned a lesson and they want to start to require bigger down payments while Fannie Mae and Freddie Mac are now being told to secure mortgages with smaller down payments than they had in the past.  So, this is ultimately going to create a bigger problem for these securities because nobody is going to want to buy Fannie and Freddie debt because it is going to be increasingly risky.  So, again, all of that debt is going to find its way to the Federal Reserve.  The Fed is going to end up buying all this Fannie and Freddie insured paper because private individuals won’t want to own it because its not government insured, so that they’ll be able to take their Fannie and Freddie May debt and give it to the Federal Reserve in exchange for Treausuries.  So, the whole mortgage industry is going to be socialized and financed by the Fed, which means it’s financed by a printing press.  A lot of people are criticizing this as a taxpayer bailout, you know “why should taxpayers have to pay for this?”  It’s not the taxpayers per se who are paying for it.  It’s anybody who has U.S. dollars: people on social security, people on welfare, people who aren’t paying taxes but are receiving government checks.  They are going to pay for it because their checks are going to buy less.  And Americans who have money saved in pensions and retirement accounts and government bonds and municipal bonds.  They are going to suffer.  The prices are rising.  Oil prices are $100 a barrel.  People are going to the supermarket and they are seeing big increases in the price of food.  This is all a result of what the Fed is doing.  It’s got nothing to do with the scapegoats that the government is creating.  It’s not because of the Arab sheiks jacking up oil prices.  It’s not because some peasant in China is eating more meat.  None of this is true.  Prices are rising strictly as a function of the Federal Reserve debasing our money to bail everybody out.  This is the price that we pay.  Higher prices for all consumer goods and less value for our savings.\nVox: That would explain, obviously, the big leap up in the gold market that happened before the recent correction.  One thing that I discussed with Robert Prechter a little while ago was that the jump in metals and commodities was partially the result of a bubble.  We had the equity bubble then the real estate bubble and now we’re seeing some money move from real estate into commodities.  But are you saying that it’s simply the result of inflation from these moves by the Fed?\nPeter:  Sure, and I don’t think there’s a bubble in gold or commodities.  These prices are simply rising to reflect the loss of value of U.S. currency.  Now, maybe the rise has gotten ahead of itself a bit, and is due for a pullback.  Maybe you have had a lot of speculators that have come along for the ride, but the underlying trend is for these markets to move higher because the dollar and other currencies are going to be moving lower because the central banks are going to continue to debase them.\nVox:  The chief economist for the national association of realtors is forecasting that home prices will remain flat in 2008.\nPeter: Well, what do you expect?  You remember what David Lehrer used to do.  They denied that there was a problem, there was no bubble.  Then they said it is going to be a soft landing.  I mean these guys are shills.  All these guys are cheerleaders for the realtors.  They are trying to encourage people to buy homes.  And if they came out and said that your real estate prices are going to drop by ten or fifteen percent nobody would want to buy, so they constantly come out with rosy forecasts.  Just like Wall Street.  Wall Street is in the business of selling stocks, so they want to tell everybody things are great.  The national realtors are in the business of encouraging people to buy homes.  They are not going to come out with a forecast that says home prices are going to drop, because that is going to discourage people from doing exactly what they want them to do.\nVox: No, of course, what I thought was funny was that they were forecasting a flat 2008 from a price of $\n218,000 with the medium existing homes.  Today the report came out for February and the price is already $28,000 lower.\nPeter: Yeah, as I said, they are never going to forecast the truth.  They are constantly going to be wrong.  I don’t know why anybody even pays any attention to what their economists say because it’s really advertising or propaganda whatever you want to call it.  It has nothing to do with some kind of objective economic analysis of the housing market.  If that were the case, they would be predicting a substantial decline.  How can home prices stay where they are?  It’s impossible.  The government is doing all they can to maintain inflated home prices, but it’s not going to work.  It could only work in the sense that they create so much inflation that real home prices plunge but nominal home prices hold up.  But that’s not going to make anybody happy.  They are going to live in a home that is still worth what they paid but they are not going to be able to afford to heat it or air condition or put food in the refrigerator.\nVox: Much less take out money based on their growing equity.\nPeter:  All that’s going to grind to a halt unless of course the government finances it.  The private market for these home equity loans and second mortgages is drying up.  The market realizes that there is no collateral there.  And, of course, Americans are desperate.  They already owe more money on their homes than they are worth.  They are loaded up with credit card debt they can’t repay and auto loans and student loans.  Nobody wants to lend Americans more money and Americans figure, “we already owe so much money we can’t possibly pay it back; we might as well borrow even more because we might as well go out with a bang.”  Nobody is willing to lend them money of their own, so it is only the government that is willing to do it.  Of course, they have no money to lend.  All they can do is print it, which means they deprive society of purchasing power through a printing press that individuals never would have willingly given up on their own.\nVox:  Sure.  Now what are some of the best tips from your new book, which is called\nCrash Proof\n, which recommends ways to profit from the coming economic collapse?\nPeter:  The best thing to understand is that it’s not the taxpayers.  It’s holders of dollars, people who have dollar savings and dollar-denominated investments.  So, if you want to avoid the biggest tax increase in U.S. history the only way to do it is to divest yourself of your dollars.  The advice that I gave in\nCrash Proof\nis really a giant tax shelter.  That’s what I am helping people do at my company, EuroPacific Capital.  We help American savers and investors to get out of U.S. based assets, reorganize their stock portfolios, get into foreign stocks in Europe and Asia.  Earn dividends in other currencies.  Have bonds in other currencies.  Get into commodities and precious metals.  Anything other than the U.S. dollar so you can avoid having to pay the price of what Bernanke is doing.  I describe the average American investor or saver with a giant bullseye on their back and they’re in Ben Bernanke’s cross hairs.  He’s going to shoot you unless you get rid of your dollars.  We can help you do that, but people need to do that as quickly as possible.\nVox: Okay.  Last question.  As an economic advisor to the Ron Paul presidential campaign, do you find a certain irony in the fact that most Republicans failed to support him when he is the only candidate who has a solid grasp of the structural challenges facing the financial markets and the economy.\nPeter: I don’t find it ironic.  Unfortunately the Republicans are not the limited government party that they claim to be.  That’s how they try to get votes, but if you look at the way Republicans govern, they are politicians just like the Democrats.  They want big government.  They want high taxes.  They want high government regulation as the best way to secure their own re-election.  So, they try to appeal to the wing of the Republican party that is libertarian-oriented, limited government, traditional conservative values.  They figure that they are going to get those votes because they figure “they’ve got not choice because the Democrats are even for bigger government than we are.  We’ll pay lip service to their limited government views so that we can at least keep their votes away from the Democrats.  But the reality is that the mainstream rank and file of the Republican party is a big government party just like the Democrats.  When Ron Paul comes up and actually tries to run on Republican principles that a lot of people think represent the Republican party they shoot him down.  Because the Republican party of today, the modern Rebublican party, has nothing to do with small government and low taxes.  They are a big government party.\nVox: You’re preaching to the choir here: *laugh*.\nPeter: I know. And it’s unfortunate, because that’s the choices we have in America, is, y’know, which, uh, big-government candidate do you want to support? And unfortunately, the only, y’know, [only] avenue that we have left is to get rid of U.S. assets. I mean, they’re going to tax us to death, and they’re going to inflate, uh, us to death [and] so Americans need to read the writing on the wall. And, y’know, if you read my book – “Crash-Proof: How to Profit From the Coming Economic Collapse” – I, y’know, I’ve got a few chapters in the back of the book that really detail the blueprint for how to build a crash-proofed portfolio and [and] get out of U.S. assets – before it’s too late.\nVox: Or, better yet, y’know, buy a beach place in the Bahamas and watch it all from the beach: *laugh*.\nPeter: Well, I mean, y’know, if you want to physically leave the country – I don’t know how bad it’s going to get, but I think the first thing you need to do is get your money out of the country, or at least out of U. S. dollar investment. You can do that within a, uh, U. S. brokerage account, like, that’s what we do in EuroPacific Capital. I hope it doesn’t to the point where it’s so bad that we actually literally have to flee the country. And [and] get our bodies out of the country as well. I mean, it might come to that. Uh, but, for now, I’m hoping it doesn’t, but I know for sure, uh, that Americans are going to suffer a dramatic diminution in their standard of living, in their quality of life, as a result of what we’ve done in the past – the huge consumption binge, the borrowing and consumption binge we went on in the past. And now, as a result of what the government is doing to try to delay the day of reckoning. They are making the situation much, much worse. And so people have to be very, very careful about where their money is invested, and, more importantly, what currency those investments are in. Eh, they should go to my website and, y’know, there’s a lot of information on my website, uh, to help you, [to help you] understand this problem. And [a-, eh] the address is W- W- W- dot Europac, E- U- R- O- P- A- C- dot net, Europac dot net. Or people can talk to one of my brokers at [at] the company, call eight hundred, seven two seven, seven nine two two – eight hundred, seven two seven, seven nine two two – I’ve got a whole staff of brokers that can help, uh, y’know, walk you through these strategies.\nvox: What kind of timeframe are you looking for? I mean, typically, I tend to have a contrarian edge myself. The housing crash didn’t surprise me, and it came along as I expected, but it came along about two years later than I expected. What’s your timeframe on this?\nPeter: It’s always hard to talk about the timing, but I think this is going on right now. The dollar is losing value as we speak. I mean, it’s bounced a little bit today against the Yen and the Swiss franc, but it’s down, y’know, almost as much against the Canadian and Australian dollars, but, in general, the dollar is going down; these problems are huge. And, y’know, it was amazing once the problems became evident in th\ne housing market how quickly it all unraveled. And so, y’know, things can happen very quickly. And [and, and] the key to this is to be early. Y’know, dont try to finesse it, don’t think “hey, maybe we got six more months, maybe we got a couple [ye-] more years” – I don’t know, maybe we do, maybe we don’t. But, nobody knows for certain. The best thing to do is understand what’s going to ultimately happen to the value of the dollar and the cost of living in the United States, our standard of living. And, people need to be protected. Y’know, if you’re a day late, uh, y’know, that’s, y’know, you’re [you’re] a day late. You’re done. Y’know, so it’s better to be early than late, because, y’know you can’t survive if you’re late, even if it’s by a day. So if you’re a year early or if you’re two years early…uh, but meantime, y’know, our strategies are throwing off some rather substantialdividend yields, uh, while people are waiting, so there’s no real opportunity cost, uh, to, uh, being early.\nVox: No, I can recall when the Euro was at point-eighty-eight rather than one-fifty-four, so…\nPeter: Yeah, look, and it’s going a lot higher. There’s nothing that can happen to the dollar based on what they’re doing but decline in value. I mean, it’s obvious, it’s clear what’s going on, so, y’know, rather than just remaining ignorant or closing your eyes, uh, people need to understand what’s happening and take action before it’s too late.\nVox: Well, Peter, I really appreciate your time. Thanks very much.\nPeter: Okay, thanks for talking to me.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-24T10:55:00+00:00"
}