{
  "url": "https://voxday.net/2009/06/04/womenomics/",
  "scraped_at": "2026-01-08T22:57:53.165546",
  "title": "Womenomics",
  "date_display": "June 4, 2009",
  "date_iso": "2009-06-04T14:15:00+00:00",
  "date_from_url": "2009-06-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Spacebunny sends a link to an article about <a href=\"http://www.thefrisky.com/post/246-working-mothers-should-just-say-no-to-more-work/\">a new book on women and the workplace</a>.  She notes: “And women wonder why they get paid less…..”</p><blockquote><p>The authors] call for women to say no to 60-plus-hour work weeks and overly demanding jobs that yank them away from their families. Instead, they urge working women to use their clout in the workplace to demand fewer hours at the office, turn down non-family-friendly assignments, and take control of their time by working from home more, checking e-mail less and avoiding meetings whenever possible.</p></blockquote><p>It may surprise you to know that I’m generally in favor of both men and women doing as the <i>Womenomics</i> authors recommend, so long as they do so in the full knowledge that they will receive lower pay and fewer promotions than those who are willing to put in more time and work harder.  Women should by all means avoid jobs that tear them away from their families; the smart employer will actively look to find a way to accommodate such women, who tend to be smart, efficient, dependable, and very hard-working within the time limits that their family responsibilities permit.  And everyone would be better off with fewer meetings; one of our business partners has a meeting-heavy culture and it’s astonishing how long it takes them to do anything.</p><p>The problem with this book, I suspect, is that the usual female fascism will likely rear its incoherent but lushly-maned head and demand that everyone do less work so as not to make working women look bad by comparison, thereby transforming what could be a reasonable call for workers to examine their individual priorities into yet another justification for government intervention into the workplace.</p></div>",
  "content_text": "Spacebunny sends a link to an article about\na new book on women and the workplace\n.  She notes: “And women wonder why they get paid less…..”\nThe authors] call for women to say no to 60-plus-hour work weeks and overly demanding jobs that yank them away from their families. Instead, they urge working women to use their clout in the workplace to demand fewer hours at the office, turn down non-family-friendly assignments, and take control of their time by working from home more, checking e-mail less and avoiding meetings whenever possible.\nIt may surprise you to know that I’m generally in favor of both men and women doing as the\nWomenomics\nauthors recommend, so long as they do so in the full knowledge that they will receive lower pay and fewer promotions than those who are willing to put in more time and work harder.  Women should by all means avoid jobs that tear them away from their families; the smart employer will actively look to find a way to accommodate such women, who tend to be smart, efficient, dependable, and very hard-working within the time limits that their family responsibilities permit.  And everyone would be better off with fewer meetings; one of our business partners has a meeting-heavy culture and it’s astonishing how long it takes them to do anything.\nThe problem with this book, I suspect, is that the usual female fascism will likely rear its incoherent but lushly-maned head and demand that everyone do less work so as not to make working women look bad by comparison, thereby transforming what could be a reasonable call for workers to examine their individual priorities into yet another justification for government intervention into the workplace.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-06-04T13:15:00+00:00"
}