{
  "url": "https://voxday.net/2008/09/02/abstaining-from-logic/",
  "scraped_at": "2026-01-08T22:34:26.656562",
  "title": "Abstaining from logic",
  "date_display": "September 2, 2008",
  "date_iso": "2008-09-02T12:48:00+00:00",
  "date_from_url": "2008-09-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s hard to decide which is the more ridiculous idea: (a) That the governor of Alaska successfully faked a pregnancy and is passing off her grandson as her son, or (b) that Bristol Palin’s pregnancy somehow demonstrates the inefficacy of abstinence-based education.</p><p>Both notions require brain damage, an IQ at least 35 points below the norm, or willful ideological blinders for anyone who spends more than five seconds thinking about the matter to adhere to them.  Palin’s pregnancy has been sufficiently attested to that it needs no further explication here.  As for the abstinence argument, consider the following facts:</p><p>1.  In 2001, the federal and state governments together spent $4,403,000 in Alaska on contraceptive services and supplies for 141,000 women of childbearing age.</p><p>2.  Almost all U.S. schoolchildren receive sex education by eighth grade, most begin receiving sex education in fifth grade.  This sex education may include abstinence programs, but it is almost never limited to them.</p><p>3.  Bristol Palin was not homeschooled for most of her education and her fiance is a hockey player at a public school.</p><p>Therefore, Bristol Palin’s pregnancy is much more reasonably viewed as a failure of comprehensive sex education because that is the form of sex education she and her fiance almost certainly received, rather than a failure of the abstinence-only program that her mother favors and which she did not receive.  One would have to be extraordinarily logically handicapped to indict a program that cannot possibly be held responsible for a situation while trying to claim that the program actually involved would have somehow magically prevented the situation even though it manifestly did not.</p><p>Furthermore, abstinence programs are superior to other forms of sex education, at least when measured in terms of reduced STD contraction.  This is what I noted in analyzing Sam Harris’s statistically tortured attempt to attack abstinence programs: <i>“What he neglected to mention was that while the study showed that 4.6 percent of the abstinence-pledged teens contracted an STD, this was 35 percent less than the 7 percent of non-pledged teens who also acquired one.”</i> – TIA p. 127</p></div>",
  "content_text": "It’s hard to decide which is the more ridiculous idea: (a) That the governor of Alaska successfully faked a pregnancy and is passing off her grandson as her son, or (b) that Bristol Palin’s pregnancy somehow demonstrates the inefficacy of abstinence-based education.\nBoth notions require brain damage, an IQ at least 35 points below the norm, or willful ideological blinders for anyone who spends more than five seconds thinking about the matter to adhere to them.  Palin’s pregnancy has been sufficiently attested to that it needs no further explication here.  As for the abstinence argument, consider the following facts:\n1.  In 2001, the federal and state governments together spent $4,403,000 in Alaska on contraceptive services and supplies for 141,000 women of childbearing age.\n2.  Almost all U.S. schoolchildren receive sex education by eighth grade, most begin receiving sex education in fifth grade.  This sex education may include abstinence programs, but it is almost never limited to them.\n3.  Bristol Palin was not homeschooled for most of her education and her fiance is a hockey player at a public school.\nTherefore, Bristol Palin’s pregnancy is much more reasonably viewed as a failure of comprehensive sex education because that is the form of sex education she and her fiance almost certainly received, rather than a failure of the abstinence-only program that her mother favors and which she did not receive.  One would have to be extraordinarily logically handicapped to indict a program that cannot possibly be held responsible for a situation while trying to claim that the program actually involved would have somehow magically prevented the situation even though it manifestly did not.\nFurthermore, abstinence programs are superior to other forms of sex education, at least when measured in terms of reduced STD contraction.  This is what I noted in analyzing Sam Harris’s statistically tortured attempt to attack abstinence programs:\n“What he neglected to mention was that while the study showed that 4.6 percent of the abstinence-pledged teens contracted an STD, this was 35 percent less than the 7 percent of non-pledged teens who also acquired one.”\n– TIA p. 127",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-02T11:48:00+00:00"
}