{
  "url": "https://voxday.net/2008/09/04/amateurs-in-media/",
  "scraped_at": "2026-01-08T22:34:33.955322",
  "title": "Amateurs in the media",
  "date_display": "September 4, 2008",
  "date_iso": "2008-09-04T10:37:00+00:00",
  "date_from_url": "2008-09-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is <a href=\"http://blogs.tnr.com/tnr/blogs/the_stump/archive/2008/09/03/focus-group-palin-was-alarmingly-strong.aspx\">a typical example of their cluelessness</a>:</p><blockquote><p>Several moderate-Democrat friends of mine have been emailing–few if any would ever vote for McCain–but all agree that Palin was very strong. The more liberal among them are a little panicked.  I completely misjudged how negative she would be. Her lines about Obama were brutally cutting and possibly over the top in places.</p></blockquote><p>First, they were all taken completely by surprise when McCain made the most obvious and effective choice for vice-president.  Second, they actually thought conservatives and the religious right would somehow be turned off <i>by a pregnant girl marrying the father of her child and having the baby!</i> Here’s a little secret for the irreligious Left: religious people not only believe that sin exists, they believe that everyone engages in it.  True, it’s best to avoid sin, but the far more important thing is how you attempt to amend for your errant actions when you, like everyone else, fall short of perfection.</p><p>Now they’re all surprised that a woman whose nickname is “Barracuda”, who compares her kind of woman to a pitbull, who took on and beat the corrupt old boys of Republican politics in Alaska, should turn out to be an effective attack dog.  Whoever could have imagined it?</p><p>This is why I don’t read much political commentary except as a guide to what the clueless parrots will be repeating.  With a few exceptions, it’s almost completely useless.</p><p>This was a particularly good line of attack: <i>““Before I became governor of the great state of Alaska, I was mayor of my hometown. And since our opponents in this presidential election seem to look down on that experience, let me explain to them what the job involves. I guess a small-town mayor is sort of like a ‘community organizer,’ except that you have actual responsibilities.”</i></p><p>One shot, two hits.  The rabid Democrats in the media, lacking in both intelligence and perspective, have failed to account for the obvious.  Wasilla may have only 9,780 residents, but there are more voting Americans living in similarly small towns than are living in the big cities that journalists apparently believe are the only places that matter.  I won’t vote for McCain-Palin, but I suspect that a lot of people who would never have voted for McCain alone will.</p></div>",
  "content_text": "This is\na typical example of their cluelessness\n:\nSeveral moderate-Democrat friends of mine have been emailing–few if any would ever vote for McCain–but all agree that Palin was very strong. The more liberal among them are a little panicked.  I completely misjudged how negative she would be. Her lines about Obama were brutally cutting and possibly over the top in places.\nFirst, they were all taken completely by surprise when McCain made the most obvious and effective choice for vice-president.  Second, they actually thought conservatives and the religious right would somehow be turned off\nby a pregnant girl marrying the father of her child and having the baby!\nHere’s a little secret for the irreligious Left: religious people not only believe that sin exists, they believe that everyone engages in it.  True, it’s best to avoid sin, but the far more important thing is how you attempt to amend for your errant actions when you, like everyone else, fall short of perfection.\nNow they’re all surprised that a woman whose nickname is “Barracuda”, who compares her kind of woman to a pitbull, who took on and beat the corrupt old boys of Republican politics in Alaska, should turn out to be an effective attack dog.  Whoever could have imagined it?\nThis is why I don’t read much political commentary except as a guide to what the clueless parrots will be repeating.  With a few exceptions, it’s almost completely useless.\nThis was a particularly good line of attack:\n““Before I became governor of the great state of Alaska, I was mayor of my hometown. And since our opponents in this presidential election seem to look down on that experience, let me explain to them what the job involves. I guess a small-town mayor is sort of like a ‘community organizer,’ except that you have actual responsibilities.”\nOne shot, two hits.  The rabid Democrats in the media, lacking in both intelligence and perspective, have failed to account for the obvious.  Wasilla may have only 9,780 residents, but there are more voting Americans living in similarly small towns than are living in the big cities that journalists apparently believe are the only places that matter.  I won’t vote for McCain-Palin, but I suspect that a lot of people who would never have voted for McCain alone will.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-04T09:37:00+00:00"
}