{
  "url": "https://voxday.net/2008/09/18/barack-obamas-iq-is-116_18/",
  "scraped_at": "2026-01-08T22:35:45.783413",
  "title": "Barack Obama’s IQ is ~116",
  "date_display": "September 18, 2008",
  "date_iso": "2008-09-18T06:56:00+00:00",
  "date_from_url": "2008-09-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An IQ guy <a href=\"http://www.kids-iq-tests.com/d-prez.html\">attempts to work it out</a>:</p><blockquote><p>[T]hese are the facts concerning Obama’s LSAT score while attending Law School at Harvard University. We do not know his actual LSAT score; however, after much research, we found that the average LSAT score for all Harvard students is 171.  The percentile rank for an LSAT score of 171 at Harvard is 98.8%.</p><p>MENSA will accept LSAT scores as a means of qualifying for MENSA membership. (MENSA also accepts up to 200 various IQ tests and other tests of cognitive function as well.) The LSAT score required for MENSA membership is equal to a percentile of 95% or higher. Thus, basing Obama’s estimated LSAT score of 171 ranks him in the top 98.8% (percent/percentile) range which is clearly above the lowest acceptable LSAT percentage rank of 95%, which clearly affirms that Obama has a qualifying intelligence quotient that would allow him acceptance into MENSA.</p><p>Since MENSA accepts various IQ Tests as well as other cognitive tests to qualify for MENSA membership it is safe to estimate that Obama’s IQ Score could range anywhere from a low IQ score of 130 based on the Stanford Binet IQ Test, Revision 5, to a high IQ score of 148 based on the Cattell IQ Test.</p></blockquote><p>What the IQ guy failed to account for is the fact that Harvard University practices affirmative action. <a href=\"http://www.pbs.org/wgbh/pages/frontline/shows/sats/etc/gap.html\">PBS Frontline reports</a>: <i>“The gap in SAT scores persists even at the highest levels of achievement. A study of the 1989 applicants to five highly-selective universities found that white candidates’ average combined SAT score was 186 points higher than the corresponding SAT average for African American applicants.”</i></p><p>Furthermore, <a href=\"http://query.nytimes.com/gst/fullpage.html?res=9D00EED61E3AF936A15753C1A96E958260\">the New York Times reports</a> that <i>“At the best schools, by contrast, efforts to diversify the student body translate into a 400-point bonus for minority students on the SAT tests.”</i></p><p>That 98.8 ranking, according to the average Harvard LSAT, <a href=\"http://www.lawschooldiscussion.org/prelaw/index.php/topic,12022.0.html\">translates to an estimated 138 IQ</a>, which is equivalent to a combined pre-1996 SAT score of 1310.  That’s pretty good, if not spectacular.  However, note that this very same 98.8th percentile is only 1290 when <a href=\"http://www.iqcomparisonsite.com/oldSATIQ.aspx\">taken directly from the pre-1996 SAT</a>.  [<i>There is a dichotomy between the reported 98.8 percentile IQ equivalence on the LSAT and the 98.8 percentile on the pre-1996 SAT.  Since Mensa accepts the <b>95th</b> percentile on the LSAT as evidence that one is in <b>98th</b> percentile in intelligence, it’s clear that the SAT-IQ conversion, based as it is on a broader population sample, is the more accurate and 1290 is the correct figure</i>]  Due to affirmative action, however, one must reduce that score by at least 186 points.  (400 seems extreme; I suspect the NYT article is talking about the new SAT, which isn’t valid for the purposes of this comparison.)  Thus, giving Obama the benefit of the doubt drops his score to 1104, which is equivalent to an IQ of 116.  That’s not bad, but it is significantly less intelligent than Hillary’s 140 IQ, as well as being lower than George W. Bush’s 125 IQ (1206 SAT).</p><p>Before one points to the fact that Obama ranked highly in his class, it’s important to keep in mind that Bill Bradley was a Princeton Rhodes Scholar despite his 485 Verbal SAT and mediocre 103 IQ.  Academic success, like every other kind of success, is just as much about hard work and determination as it is about intellectual firepower, but Barack Obama’s supporters obviously shouldn’t be attempting to make their case for him on the basis of what is, based on the available information, probably an IQ of between 115 and 120, only one standard deviation above the norm.  Of course, this estimate is based on averages which don’t necessarily apply to a single individual; Obama could lay the matter to rest by simply permitting his scores to be released to the public.</p><p>If his intelligence is so incredibly important, <a href=\"http://www.huffingtonpost.com/michael-seitzman/sarah-palin-naked_b_125861.html\">as some of his more visibly insane supporters insist</a>, then surely the senator should inform us precisely how intelligent he is.  Because <a href=\"http://campaignspot.nationalreview.com/post/?q=NzQ4OTBmYjJhMGMwZTMyNTZkYWY1Y2M4ZDU4YjRkMmU\">he demonstrates his ignorance</a> and a less-than-impressive intelligence nearly every time <a href=\"http://hotair.com/archives/2008/09/17/mccains-attempt-to-fix-fannie-mae-freddie-mac-in-2005/\">he opens his mouth</a> despite his handlers’ attempts to retroactively fix his statements: <i>“The fact that we have reached a point where the Federal Reserve felt it had to take this unprecedented step with the American Insurance Group is the final verdict on the failed economic philosophy of the last eight years.”</i></p><p>First, AIG didn’t fail because of the economic philosophy of the last eight years.  Alan Greenspan goosed the markets by expanding the money supply while Clinton was president and Ben Bernanke has further loosened monetary policy since. Second, that “unprecedented step” was taken with the American <i>International</i> Group.</p><p>UPDATE – Upset Obama admirers should note two things.  First, a 116 IQ still indicates an intelligence that is well above average.  It’s hardly an insult.  Second, I am not a Republican, much less a McCain supporter, and have never even voted for a Republican for president.</p><p>UPDATE II – Obama graduated from my mother’s alma mater, where everyone takes the various college prep tests.  He was not a National Merit Scholar, a National Merit Semifinalist or an Outstanding Participant.  This indicates a ceiling on his SAT percentile at 96.9, which indicates a maximum possible SAT score of 1230 and maximum IQ of 129.</p></div>",
  "content_text": "An IQ guy\nattempts to work it out\n:\n[T]hese are the facts concerning Obama’s LSAT score while attending Law School at Harvard University. We do not know his actual LSAT score; however, after much research, we found that the average LSAT score for all Harvard students is 171.  The percentile rank for an LSAT score of 171 at Harvard is 98.8%.\nMENSA will accept LSAT scores as a means of qualifying for MENSA membership. (MENSA also accepts up to 200 various IQ tests and other tests of cognitive function as well.) The LSAT score required for MENSA membership is equal to a percentile of 95% or higher. Thus, basing Obama’s estimated LSAT score of 171 ranks him in the top 98.8% (percent/percentile) range which is clearly above the lowest acceptable LSAT percentage rank of 95%, which clearly affirms that Obama has a qualifying intelligence quotient that would allow him acceptance into MENSA.\nSince MENSA accepts various IQ Tests as well as other cognitive tests to qualify for MENSA membership it is safe to estimate that Obama’s IQ Score could range anywhere from a low IQ score of 130 based on the Stanford Binet IQ Test, Revision 5, to a high IQ score of 148 based on the Cattell IQ Test.\nWhat the IQ guy failed to account for is the fact that Harvard University practices affirmative action.\nPBS Frontline reports\n:\n“The gap in SAT scores persists even at the highest levels of achievement. A study of the 1989 applicants to five highly-selective universities found that white candidates’ average combined SAT score was 186 points higher than the corresponding SAT average for African American applicants.”\nFurthermore,\nthe New York Times reports\nthat\n“At the best schools, by contrast, efforts to diversify the student body translate into a 400-point bonus for minority students on the SAT tests.”\nThat 98.8 ranking, according to the average Harvard LSAT,\ntranslates to an estimated 138 IQ\n, which is equivalent to a combined pre-1996 SAT score of 1310.  That’s pretty good, if not spectacular.  However, note that this very same 98.8th percentile is only 1290 when\ntaken directly from the pre-1996 SAT\n.  [\nThere is a dichotomy between the reported 98.8 percentile IQ equivalence on the LSAT and the 98.8 percentile on the pre-1996 SAT.  Since Mensa accepts the\n95th\npercentile on the LSAT as evidence that one is in\n98th\npercentile in intelligence, it’s clear that the SAT-IQ conversion, based as it is on a broader population sample, is the more accurate and 1290 is the correct figure\n]  Due to affirmative action, however, one must reduce that score by at least 186 points.  (400 seems extreme; I suspect the NYT article is talking about the new SAT, which isn’t valid for the purposes of this comparison.)  Thus, giving Obama the benefit of the doubt drops his score to 1104, which is equivalent to an IQ of 116.  That’s not bad, but it is significantly less intelligent than Hillary’s 140 IQ, as well as being lower than George W. Bush’s 125 IQ (1206 SAT).\nBefore one points to the fact that Obama ranked highly in his class, it’s important to keep in mind that Bill Bradley was a Princeton Rhodes Scholar despite his 485 Verbal SAT and mediocre 103 IQ.  Academic success, like every other kind of success, is just as much about hard work and determination as it is about intellectual firepower, but Barack Obama’s supporters obviously shouldn’t be attempting to make their case for him on the basis of what is, based on the available information, probably an IQ of between 115 and 120, only one standard deviation above the norm.  Of course, this estimate is based on averages which don’t necessarily apply to a single individual; Obama could lay the matter to rest by simply permitting his scores to be released to the public.\nIf his intelligence is so incredibly important,\nas some of his more visibly insane supporters insist\n, then surely the senator should inform us precisely how intelligent he is.  Because\nhe demonstrates his ignorance\nand a less-than-impressive intelligence nearly every time\nhe opens his mouth\ndespite his handlers’ attempts to retroactively fix his statements:\n“The fact that we have reached a point where the Federal Reserve felt it had to take this unprecedented step with the American Insurance Group is the final verdict on the failed economic philosophy of the last eight years.”\nFirst, AIG didn’t fail because of the economic philosophy of the last eight years.  Alan Greenspan goosed the markets by expanding the money supply while Clinton was president and Ben Bernanke has further loosened monetary policy since. Second, that “unprecedented step” was taken with the American\nInternational\nGroup.\nUPDATE – Upset Obama admirers should note two things.  First, a 116 IQ still indicates an intelligence that is well above average.  It’s hardly an insult.  Second, I am not a Republican, much less a McCain supporter, and have never even voted for a Republican for president.\nUPDATE II – Obama graduated from my mother’s alma mater, where everyone takes the various college prep tests.  He was not a National Merit Scholar, a National Merit Semifinalist or an Outstanding Participant.  This indicates a ceiling on his SAT percentile at 96.9, which indicates a maximum possible SAT score of 1230 and maximum IQ of 129.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-18T05:56:00+00:00"
}