{
  "url": "https://voxday.net/2008/09/23/channeling-ones-inner-bane/",
  "scraped_at": "2026-01-08T22:36:07.853653",
  "title": "Channeling their inner Bane",
  "date_display": "September 23, 2008",
  "date_iso": "2008-09-23T16:33:00+00:00",
  "date_from_url": "2008-09-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This <a href=\"http://www.timesonline.co.uk/tol/news/world/asia/article4810644.ece\">Indian response to financial crisis</a> would not only be more emotionally satisfactory for American taxpayers, it would almost surely work better than the administration-proposed “give hundreds of billions of dollars to the guys who created the problem in the first place and pretend there’s a snowball’s chance in Hell that they’ll get it right this time” bailout:</p><blockquote><p>Corporate India is in shock after a mob of sacked workers bludgeoned to death the chief executive who had dismissed them from a factory in a suburb of Delhi.  Lalit Kishore Choudhary, 47, the head of the Indian operations of Graziano Transmissioni, an Italian-headquartered manufacturer of car parts, died of severe head wounds on Monday afternoon after being attacked by scores of laid-off employees, police said.</p></blockquote><p>If Americans are going to have socialism crammed down their throats by so-called “conservative” and “liberal” politicians anyhow, they may as well have the satisfaction of sending to the guillotine all the Wall Street crooks who robbed them blind and are attempting to pull off their largest heist yet.</p></div>",
  "content_text": "This\nIndian response to financial crisis\nwould not only be more emotionally satisfactory for American taxpayers, it would almost surely work better than the administration-proposed “give hundreds of billions of dollars to the guys who created the problem in the first place and pretend there’s a snowball’s chance in Hell that they’ll get it right this time” bailout:\nCorporate India is in shock after a mob of sacked workers bludgeoned to death the chief executive who had dismissed them from a factory in a suburb of Delhi.  Lalit Kishore Choudhary, 47, the head of the Indian operations of Graziano Transmissioni, an Italian-headquartered manufacturer of car parts, died of severe head wounds on Monday afternoon after being attacked by scores of laid-off employees, police said.\nIf Americans are going to have socialism crammed down their throats by so-called “conservative” and “liberal” politicians anyhow, they may as well have the satisfaction of sending to the guillotine all the Wall Street crooks who robbed them blind and are attempting to pull off their largest heist yet.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-23T15:33:00+00:00"
}