{
  "url": "https://voxday.net/2008/09/22/femina-economica/",
  "scraped_at": "2026-01-08T22:36:02.315435",
  "title": "Femina economica",
  "date_display": "September 22, 2008",
  "date_iso": "2008-09-22T08:29:00+00:00",
  "date_from_url": "2008-09-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There are two types of women, <i>feminina collega</i> and <i>femina economica</i>.  The former is a man’s companion and her driving instinct is to put the interests of her family before her own, to make a priority of her twin roles as a wife and mother.  The latter, on the other hand, makes a priority of her economic situation; if she happens to marry then she is a man’s parasite.  The Virgin Queen brings to our attention <a href=\"http://www.salon.com/mwt/feature/2008/09/22/williams_pinched/\">a stellar example of the latter</a>, one which illustrates the previously blogged link observed between falling house prices and declining divorce rates:</p><blockquote><p> We saved and scrimped and searched for three years before sinking everything we had and more into a home for ourselves and our two children, a tiny co-op in a fringy New York City neighborhood. The process left us emotionally and financially tapped. Then, three days before we closed on the apartment, my husband lost his job….</p><p>It may well be that if this financial and subsequent emotional crisis hadn’t driven a wedge between us, something else would have eventually done the job. It’s certainly fair to say that we’re not the same people we were when we married a decade and a half ago, in our mid-20s. But even if our financial disasters weren’t the cause of our breakup, they sure were the catalyst.</p><p>Yet they’ve likewise made us think long and hard about the consequences of ending it. I have spent hours at my desk, ruefully contemplating my Quicken spreadsheet, calculating my monthly income and expenses, trying to make the numbers turn out better. Emotionally, I couldn’t afford to stay in this marriage any longer. Financially, I don’t know how I’ll be able to afford to leave it.</p></blockquote><p>It is the bizarre logic of <i>femina economica</i> that I find particularly fascinating.  She has the desire- the need -to leave her marriage because her husband is unable to maintain her in the style she believes is necessary to her emotional well-being, so she is destroying their marriage and sacrificing their children’s emotional stability in order to embrace the probability of penury in economically difficult times on the remote chance that she might be able to either a) discover a hitherto unknown capacity for earning income that she would somehow not be able to utilize as a married woman, or, b) meet a wealthier man and convince him to financially support her and her children despite the fact that she is fifteen years older than she was when she settled for attracting a less economically fit specimen.</p><p>In the real world, the grass is seldom greener.  Try watering the lawn instead.</p></div>",
  "content_text": "There are two types of women,\nfeminina collega\nand\nfemina economica\n.  The former is a man’s companion and her driving instinct is to put the interests of her family before her own, to make a priority of her twin roles as a wife and mother.  The latter, on the other hand, makes a priority of her economic situation; if she happens to marry then she is a man’s parasite.  The Virgin Queen brings to our attention\na stellar example of the latter\n, one which illustrates the previously blogged link observed between falling house prices and declining divorce rates:\nWe saved and scrimped and searched for three years before sinking everything we had and more into a home for ourselves and our two children, a tiny co-op in a fringy New York City neighborhood. The process left us emotionally and financially tapped. Then, three days before we closed on the apartment, my husband lost his job….\nIt may well be that if this financial and subsequent emotional crisis hadn’t driven a wedge between us, something else would have eventually done the job. It’s certainly fair to say that we’re not the same people we were when we married a decade and a half ago, in our mid-20s. But even if our financial disasters weren’t the cause of our breakup, they sure were the catalyst.\nYet they’ve likewise made us think long and hard about the consequences of ending it. I have spent hours at my desk, ruefully contemplating my Quicken spreadsheet, calculating my monthly income and expenses, trying to make the numbers turn out better. Emotionally, I couldn’t afford to stay in this marriage any longer. Financially, I don’t know how I’ll be able to afford to leave it.\nIt is the bizarre logic of\nfemina economica\nthat I find particularly fascinating.  She has the desire- the need -to leave her marriage because her husband is unable to maintain her in the style she believes is necessary to her emotional well-being, so she is destroying their marriage and sacrificing their children’s emotional stability in order to embrace the probability of penury in economically difficult times on the remote chance that she might be able to either a) discover a hitherto unknown capacity for earning income that she would somehow not be able to utilize as a married woman, or, b) meet a wealthier man and convince him to financially support her and her children despite the fact that she is fifteen years older than she was when she settled for attracting a less economically fit specimen.\nIn the real world, the grass is seldom greener.  Try watering the lawn instead.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-22T07:29:00+00:00"
}