{
  "url": "https://voxday.net/2008/09/19/fraudulence-runs-deep/",
  "scraped_at": "2026-01-08T22:35:49.571267",
  "title": "The fraudulence runs deep",
  "date_display": "September 19, 2008",
  "date_iso": "2008-09-19T06:09:00+00:00",
  "date_from_url": "2008-09-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have no doubts that Obama is a fraud.  He’s pretty obviously the sort of presentable black individual that every white liberal wants to fall all over themselves helping, who happens to be a con man that expects and is always prepared to take full advantage of that help.  There’s one at every private school.  I’d never questioned <a href=\"http://worldnetdaily.com/index.php?fa=PAGE.view&amp;pageId=75528\">if Obama had written his own books or not</a>, but it seems I probably should have:</p><blockquote><p>Prior to 1990, when Barack Obama contracted to write “Dreams From My Father,” he had written very close to nothing.  As an undergraduate, Obama had written what he justifiably calls some “very bad poetry.” He published nothing under his own name in The Harvard Law Review, where he served as an editor and as president. And after leaving Harvard, he published nothing in its review or in any law journal.</p><p>Then, in 1995, this untested 33 year-old produced what Time magazine has called – with a straight face – “the best-written memoir ever produced by an American politician.”</p><p>The public is asked to believe Obama wrote this on his own. I do not buy this canard for a minute, not at all. In writing a book on intellectual fraud, “Hoodwinked,” I developed an eye for literary humbug, and “Dreams” serves up an eyeful….</p><p>I have attempted to contact Dystel without success, but it is highly unlikely she re-wrote the book. Whoever did almost assuredly shared many of Obama’s sentiments, spoke his language and spent considerable time reworking the text.  I had never even thought of Bill Ayers as a likely ghostwriter until I ordered his memoir, “Fugitive Days,” and began to read it. He writes very well and very much like “Obama.”  Unlike “Dreams,” however, where the high style is intermittent, “Fugitive Days” is infused with the authorial voice in every sentence. That voice is surely Ayers’</p></blockquote><p>It would simply be too hilarious if it turns out that Ayers rewrote Obama’s book in order to complete the contract that Obama couldn’t.  No doubt some professional textual analysis is in order here.</p></div>",
  "content_text": "I have no doubts that Obama is a fraud.  He’s pretty obviously the sort of presentable black individual that every white liberal wants to fall all over themselves helping, who happens to be a con man that expects and is always prepared to take full advantage of that help.  There’s one at every private school.  I’d never questioned\nif Obama had written his own books or not\n, but it seems I probably should have:\nPrior to 1990, when Barack Obama contracted to write “Dreams From My Father,” he had written very close to nothing.  As an undergraduate, Obama had written what he justifiably calls some “very bad poetry.” He published nothing under his own name in The Harvard Law Review, where he served as an editor and as president. And after leaving Harvard, he published nothing in its review or in any law journal.\nThen, in 1995, this untested 33 year-old produced what Time magazine has called – with a straight face – “the best-written memoir ever produced by an American politician.”\nThe public is asked to believe Obama wrote this on his own. I do not buy this canard for a minute, not at all. In writing a book on intellectual fraud, “Hoodwinked,” I developed an eye for literary humbug, and “Dreams” serves up an eyeful….\nI have attempted to contact Dystel without success, but it is highly unlikely she re-wrote the book. Whoever did almost assuredly shared many of Obama’s sentiments, spoke his language and spent considerable time reworking the text.  I had never even thought of Bill Ayers as a likely ghostwriter until I ordered his memoir, “Fugitive Days,” and began to read it. He writes very well and very much like “Obama.”  Unlike “Dreams,” however, where the high style is intermittent, “Fugitive Days” is infused with the authorial voice in every sentence. That voice is surely Ayers’\nIt would simply be too hilarious if it turns out that Ayers rewrote Obama’s book in order to complete the contract that Obama couldn’t.  No doubt some professional textual analysis is in order here.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-19T05:09:00+00:00"
}