{
  "url": "https://voxday.net/2008/09/01/good-instincts/",
  "scraped_at": "2026-01-08T22:34:23.038900",
  "title": "Good instincts",
  "date_display": "September 1, 2008",
  "date_iso": "2008-09-01T23:20:00+00:00",
  "date_from_url": "2008-09-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Although I’d be most amused to see him sworn in as president, I’ve been almost completely underwhelmed by Obama’s increasingly bizarre performance since the early part of the Democratic primary when he was driving Team Clinton nuts.  That being said, <a href=\"http://thecaucus.blogs.nytimes.com/2008/09/01/palins-17-year-old-daughter-is-pregnant/?em\">Obama handled the dangerous curve ball</a> of the pregnancy in the Palin family much, much better than many of his supporters:</p><blockquote><p>Senator Barack Obama, the Democratic nominee, was asked at a brief press conference in Monroe, Mich., about the suggestion by some Republicans that Democrats – particularly liberal bloggers – were trying to advance rumors about the Palin family.</p><p>“Our people were not involved in any way in this and they will not be,” Mr. Obama snapped, his voice raised. “And if I ever thought there was somebody in my campaign that was involved in something like that, they’d be fired, O.K.?”</p></blockquote><p>And that ends that.  Well done.  All may be fair in love, war, and politics, but there are some attacks that are more dangerous for the attacker than the target.  When one considers the fact that the Palin family quite obviously love children, attacking the VP candidate’s daughter for having a baby would be crazy.  Throw in Obama’s position on abortion and it would be a recipe for self-inflicted disaster.  The Christian family values crowd has no inherent problem with 17-year old mothers; remember, they’re not the ones who believe all women should go to college, obtain graduate degrees, and work in an office for at least ten years before contacting their doctors about their IVF regime before giving up and settling down with six cats and/or an overweight lesbian partner.</p></div>",
  "content_text": "Although I’d be most amused to see him sworn in as president, I’ve been almost completely underwhelmed by Obama’s increasingly bizarre performance since the early part of the Democratic primary when he was driving Team Clinton nuts.  That being said,\nObama handled the dangerous curve ball\nof the pregnancy in the Palin family much, much better than many of his supporters:\nSenator Barack Obama, the Democratic nominee, was asked at a brief press conference in Monroe, Mich., about the suggestion by some Republicans that Democrats – particularly liberal bloggers – were trying to advance rumors about the Palin family.\n“Our people were not involved in any way in this and they will not be,” Mr. Obama snapped, his voice raised. “And if I ever thought there was somebody in my campaign that was involved in something like that, they’d be fired, O.K.?”\nAnd that ends that.  Well done.  All may be fair in love, war, and politics, but there are some attacks that are more dangerous for the attacker than the target.  When one considers the fact that the Palin family quite obviously love children, attacking the VP candidate’s daughter for having a baby would be crazy.  Throw in Obama’s position on abortion and it would be a recipe for self-inflicted disaster.  The Christian family values crowd has no inherent problem with 17-year old mothers; remember, they’re not the ones who believe all women should go to college, obtain graduate degrees, and work in an office for at least ten years before contacting their doctors about their IVF regime before giving up and settling down with six cats and/or an overweight lesbian partner.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-01T22:20:00+00:00"
}