{
  "url": "https://voxday.net/2008/09/16/help-sister-ou-2/",
  "scraped_at": "2026-01-08T22:35:31.163160",
  "title": "Help a sister out",
  "date_display": "September 16, 2008",
  "date_iso": "2008-09-16T00:06:00+00:00",
  "date_from_url": "2008-09-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Brooke from Rachel’s blog <a href=\"http://rachellucas.com/index.php/2008/09/15/marriages-were-saved-and-couples-given-a-second-chance/#comment-53131\">requires assistance of the sort that the Ilk are generally well-qualified to give</a>.  Anyone live near her and willing?  Cookies are promised!</p><blockquote><p>RW Donn said:  For those of you who DON’T own guns . . . WHY?!!?!?!?!!!?????</p><p>Brooke Says: <i>Because I have never had anyone to take me out shooting, as I consider having a gun to be much like a car – you should have someone show you what to do. So if anyone in Phoenix who is a gun owner would like to take me to the range and show me some basics, dinner is most definitely on me, and I’ll assuredly throw in some cookies or something.</i></p></blockquote><p>You know, I’ll be just a little disappointed if someone lives near her and Nate and Jac don’t have to ride out there and do it themselves.</p></div>",
  "content_text": "Brooke from Rachel’s blog\nrequires assistance of the sort that the Ilk are generally well-qualified to give\n.  Anyone live near her and willing?  Cookies are promised!\nRW Donn said:  For those of you who DON’T own guns . . . WHY?!!?!?!?!!!?????\nBrooke Says:\nBecause I have never had anyone to take me out shooting, as I consider having a gun to be much like a car – you should have someone show you what to do. So if anyone in Phoenix who is a gun owner would like to take me to the range and show me some basics, dinner is most definitely on me, and I’ll assuredly throw in some cookies or something.\nYou know, I’ll be just a little disappointed if someone lives near her and Nate and Jac don’t have to ride out there and do it themselves.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-15T23:06:00+00:00"
}