{
  "url": "https://voxday.net/2008/09/06/hopeless/",
  "scraped_at": "2026-01-08T22:34:48.571053",
  "title": "Hopeless",
  "date_display": "September 6, 2008",
  "date_iso": "2008-09-06T14:26:00+00:00",
  "date_from_url": "2008-09-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mr. “57 States” is at it again. <a href=\"http://www.youtube.com/watch?v=FQLTekcur-E\">Nittaly Lions</a>, WTF?  You know, Barack Obama is such a regular guy that after going out with the boys and bowling a 37, he likes nothing better than to kick back and drink a nice cold Budweezer while watching the Nittaly Lions play the Michigan Wolf Marines.  Just like all you bitter folks clinging to your guns and Bibles in flyover country.</p><p>I truly hope he wins.  His malaprops will provide more comedic material than Bush the Younger ever did, to say nothing of the good humor inherent in the inevitable invasions of Kenya, Zimbabwe, and the Democratic Republic of Congo or whatever they’re calling it today.  I’m starting to enjoy the off-teleprompter Obama so much that I may actually watch the presidential debates for once.</p></div>",
  "content_text": "Mr. “57 States” is at it again.\nNittaly Lions\n, WTF?  You know, Barack Obama is such a regular guy that after going out with the boys and bowling a 37, he likes nothing better than to kick back and drink a nice cold Budweezer while watching the Nittaly Lions play the Michigan Wolf Marines.  Just like all you bitter folks clinging to your guns and Bibles in flyover country.\nI truly hope he wins.  His malaprops will provide more comedic material than Bush the Younger ever did, to say nothing of the good humor inherent in the inevitable invasions of Kenya, Zimbabwe, and the Democratic Republic of Congo or whatever they’re calling it today.  I’m starting to enjoy the off-teleprompter Obama so much that I may actually watch the presidential debates for once.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-06T13:26:00+00:00"
}