{
  "url": "https://voxday.net/2008/09/26/how-should-america-respond/",
  "scraped_at": "2026-01-08T22:36:22.531385",
  "title": "How should America respond?",
  "date_display": "September 26, 2008",
  "date_iso": "2008-09-26T08:55:00+00:00",
  "date_from_url": "2008-09-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>“To preserve their [the people’s] independence, we must not let our rulers load us with perpetual debt. We must make our selection between economy and liberty, or profusion and servitude” – Thomas Jefferson</p></blockquote><p>I completely agree with Thomas Jefferson; in my view, the attempted bailout must be shouted down.  The reckless air of entitlement demonstrated by veteran Wall Street champions like Larry Kudlow – who seriously states that <a href=\"http://kudlow.nationalreview.com/post/?q=NzVhZTYyNDdjMzJkZTQ0MDg2OTgyYWMxYjFiOWQ0NDg=\">he cannot support a bailout if limits are placed on executive compensation</a> <i>because that would “represent a huge first step into government interference”</i> – is unbelievable.  How would THAT be the FIRST step considering that this is the fifth federal intervention this year alone?  Keep in mind that the very men demanding that Congress pillage the taxpayers on their behalf are precisely the same men who paid themselves <a href=\"http://www.telegraph.co.uk/opinion/main.jhtml?xml=/opinion/2008/09/26/do2606.xml\">38 billion in bonuses</a> just last year – let them bail their corporations out of their own pockets, not ours.  If they’re so desperate for a bailout, then why doesn’t the government simply take that 38 billion and use it for the initial funding?  Taking ten years of bonus money from the Wall Street crew would provide more than half the funds supposedly required.</p><p>UPDATE – <i>“<a href=\"http://business.timesonline.co.uk/tol/business/industry_sectors/banking_and_finance/article4828413.ece\">Britain’s five leading high street banks</a> have as much as £95.3 billion ($175 billion) of distressed assets on their books that may qualify for the American bailout scheme.”</i> I don’t know about you, but I suspect the average American doesn’t truly give the smallest damn that can be detected on a helium ion microscope if a British or Indonesian bank happens to lose money on its investments.</p></div>",
  "content_text": "“To preserve their [the people’s] independence, we must not let our rulers load us with perpetual debt. We must make our selection between economy and liberty, or profusion and servitude” – Thomas Jefferson\nI completely agree with Thomas Jefferson; in my view, the attempted bailout must be shouted down.  The reckless air of entitlement demonstrated by veteran Wall Street champions like Larry Kudlow – who seriously states that\nhe cannot support a bailout if limits are placed on executive compensation\nbecause that would “represent a huge first step into government interference”\n– is unbelievable.  How would THAT be the FIRST step considering that this is the fifth federal intervention this year alone?  Keep in mind that the very men demanding that Congress pillage the taxpayers on their behalf are precisely the same men who paid themselves\n38 billion in bonuses\njust last year – let them bail their corporations out of their own pockets, not ours.  If they’re so desperate for a bailout, then why doesn’t the government simply take that 38 billion and use it for the initial funding?  Taking ten years of bonus money from the Wall Street crew would provide more than half the funds supposedly required.\nUPDATE –\n“\nBritain’s five leading high street banks\nhave as much as £95.3 billion ($175 billion) of distressed assets on their books that may qualify for the American bailout scheme.”\nI don’t know about you, but I suspect the average American doesn’t truly give the smallest damn that can be detected on a helium ion microscope if a British or Indonesian bank happens to lose money on its investments.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-26T07:55:00+00:00"
}