{
  "url": "https://voxday.net/2008/09/05/i-am-too-sf-writer/",
  "scraped_at": "2026-01-08T22:34:43.087374",
  "title": "I am TOO an SF writer",
  "date_display": "September 5, 2008",
  "date_iso": "2008-09-05T19:40:00+00:00",
  "date_from_url": "2008-09-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The OC joins the legion of SFWAns <a href=\"http://rantingroom.blogspot.com/2008/09/why-its-so-hard-to-write-sci-fi-part.html\">trying to pretend I don’t belong</a> to the organization:</p><blockquote><p>Case in point: can you point me to one professional SF writer who predicted even as recently as two weeks ago that Sarah Palin would be the Republican nominee for Vice-President, or that her nomination would ignite such a firestorm? (Vox Day doesn’t count. He’s a political economist, not an SF writer.)</p></blockquote><p>Et tu, Bruce?  First, everyone tells me that I’m completely crazy for saying that Hillary will be president in 2009 back in 2003 when it’s so obvious that she’s finished, then goes on about how I clearly have no idea what I’m talking about when she falls just short of the nomination thanks to an astoundingly incompetent campaign manager who literally doesn’t know the rules of the nomination process.  Then, I correctly predict the Palin nomination as the only thing that McCain can do to kickstart his presidency <i>and I’m informed it doesn’t count?</i> Tough, tough crowd.</p><p>But the OC has a point.  The average SF writer these days is far too economically ignorant, technologically clueless and politically left to have any clue about what’s going to happen in the future anyhow.</p><p>Seriously, what sort of idiot still thinks religion is going to disappear because of science anyhow?  The irreligious Left has been clinging to one form or another of that idea for more than 200 years now, despite the fact that the only thing science has actually accomplished in that regard is to enable more and more irreligious leftists to reach evolutionary dead ends.  A science fiction writer who writes about futures without religion can’t be considered a competent science fiction writer, he’s really nothing more than a poly-sci fantasist.</p></div>",
  "content_text": "The OC joins the legion of SFWAns\ntrying to pretend I don’t belong\nto the organization:\nCase in point: can you point me to one professional SF writer who predicted even as recently as two weeks ago that Sarah Palin would be the Republican nominee for Vice-President, or that her nomination would ignite such a firestorm? (Vox Day doesn’t count. He’s a political economist, not an SF writer.)\nEt tu, Bruce?  First, everyone tells me that I’m completely crazy for saying that Hillary will be president in 2009 back in 2003 when it’s so obvious that she’s finished, then goes on about how I clearly have no idea what I’m talking about when she falls just short of the nomination thanks to an astoundingly incompetent campaign manager who literally doesn’t know the rules of the nomination process.  Then, I correctly predict the Palin nomination as the only thing that McCain can do to kickstart his presidency\nand I’m informed it doesn’t count?\nTough, tough crowd.\nBut the OC has a point.  The average SF writer these days is far too economically ignorant, technologically clueless and politically left to have any clue about what’s going to happen in the future anyhow.\nSeriously, what sort of idiot still thinks religion is going to disappear because of science anyhow?  The irreligious Left has been clinging to one form or another of that idea for more than 200 years now, despite the fact that the only thing science has actually accomplished in that regard is to enable more and more irreligious leftists to reach evolutionary dead ends.  A science fiction writer who writes about futures without religion can’t be considered a competent science fiction writer, he’s really nothing more than a poly-sci fantasist.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-05T18:40:00+00:00"
}