{
  "url": "https://voxday.net/2008/09/30/in-defense-of-driving-bans/",
  "scraped_at": "2026-01-08T22:36:46.285230",
  "title": "In defense of driving bans",
  "date_display": "September 30, 2008",
  "date_iso": "2008-09-30T19:30:00+00:00",
  "date_from_url": "2008-09-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If this is not <a href=\"http://www.breitbart.com/article.php?id=080930110903.vsdt9lry&amp;show_article=1\">the perfect metaphor for feminism</a>, then I don’t know what is:</p><blockquote><p>A young woman in Saudi Arabia who defied the ultra-conservative kingdom’s ban on women driving was injured when the car span out of control and plunged into a stream, a newspaper reported on Tuesday.</p><p>The unnamed woman in her 20s “stole” her brother’s car on Sunday, picked up a female friend and drove at high speed through a town in the Eastern Province before losing control of the vehicle, Al-Riyadh said.  The car hit an electricity pole and plunged into an irrigation channel. Both the driver and her friend were taken to hospital in serious condition, the paper said.</p></blockquote><p>Sometimes I look at an attractive young woman who is determined to change the world and prove that women are truly equal to men in <s>every possible way</s> the eyes of the law, in social access, and in opportunity, and it makes me feel as if I’m standing on the edge of a very high precipice with a beautiful kitten in my hands.  She’s a brave little kitty, a courageous bundle of strength and independence, and her claws are sharp indeed.  I cannot help but admire her as she bares her cute little fangs and meows her bold defiance of the uncaring world and all its unfairness and inequality.</p><p>Then I extend my arms out over the chasm, and I open my hands, and I cry: “Fly, little kitten, fly like the wind!”</p></div>",
  "content_text": "If this is not\nthe perfect metaphor for feminism\n, then I don’t know what is:\nA young woman in Saudi Arabia who defied the ultra-conservative kingdom’s ban on women driving was injured when the car span out of control and plunged into a stream, a newspaper reported on Tuesday.\nThe unnamed woman in her 20s “stole” her brother’s car on Sunday, picked up a female friend and drove at high speed through a town in the Eastern Province before losing control of the vehicle, Al-Riyadh said.  The car hit an electricity pole and plunged into an irrigation channel. Both the driver and her friend were taken to hospital in serious condition, the paper said.\nSometimes I look at an attractive young woman who is determined to change the world and prove that women are truly equal to men in\nevery possible way\nthe eyes of the law, in social access, and in opportunity, and it makes me feel as if I’m standing on the edge of a very high precipice with a beautiful kitten in my hands.  She’s a brave little kitty, a courageous bundle of strength and independence, and her claws are sharp indeed.  I cannot help but admire her as she bares her cute little fangs and meows her bold defiance of the uncaring world and all its unfairness and inequality.\nThen I extend my arms out over the chasm, and I open my hands, and I cry: “Fly, little kitten, fly like the wind!”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-30T18:30:00+00:00"
}