{
  "url": "https://voxday.net/2008/09/16/in-which-we-are-delighted-to-be-done/",
  "scraped_at": "2026-01-08T22:35:34.834477",
  "title": "In which we are delighted to be done",
  "date_display": "September 16, 2008",
  "date_iso": "2008-09-16T10:23:00+00:00",
  "date_from_url": "2008-09-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://1.bp.blogspot.com/_-HUwU0OBbRY/SM-ZvvMlVaI/AAAAAAAAAEI/DQJ4bAwalzc/s1600-h/MarcherLordBooks.jpg\" onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\"><noscript><img alt=\"\" border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2008/09/MarcherLordBooks.jpg\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;width: 320px;\"/></noscript><img alt=\"\" border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2008/09/MarcherLordBooks.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;width: 320px;\"/></a>Finally, at long last, I can announce that <i>Summa Elvetica</i> is complete.  It will be available for order soon as one of the three launch titles from <a href=\"http://www.marcherlordpress.com/Home.htm\">Marcher Lord Press</a>.  To tide over those who happen to be interested, here’s a bit from the author’s note that was requested by the publisher:</p><p><i>This novel did not proceed according to plan.  It was originally conceived as an epic philosophical trilogy, in which the reader would be immersed in medieval scholastic thought and explore various facets of some of the great philosophical debates that took place both within and without the Catholic Church.  Misunderstood by most modern intellectuals and ignored by the irreligious authors of modern fantasy fiction, the great scholars of the church were no close-minded ideologues, but rather brilliant men who conceived and refined many of the rational mechanisms that we today take for granted.  It is not a coincidence that William of Ockham, author of the Summa Logicae and known for the logical principle that bears his name, was a Franciscan monk.</i></p><p>While the logic of churchmen such as William of Ockham, Aurelius Augustinus Hipponensis, and Thomas Aquinas most certainly has its flaws, the fair-minded reader must admit that their philosophical methods, however alien they may appear to modern eyes, are rather more reasonable and straighforward than the shamelessly manipulative Socratic method made famous by Plato.  Unfortunately, my initial goal of assigning roles for the diverse schools of philosophical thought to each of the conventional fantasy races foundered on my inability to meaningfully connect it to the story of the prospective young priest travelling to the elflands.</p><p>I note in passing that two books in one year tends to somewhat belie the <a href=\"http://rantingroom.blogspot.com/2008/09/flushing-buffer.html\">Original Cyberpunk’s contention</a> that blogging is bad for your writing.  In the OC’s defense, he only referred to fiction writing, and furthermore, my career as a novelist is about as close to nonexistent as a writer whose books are regularly published can be.  I’m not complaining.  I primarily write for my own entertainment and there is almost no way that a novel like <i>Summa Elvetica</i> would ever get published by any large publisher, be they mainstream, genre, or CBA, even if I was a much more talented writer.</p><p>I’ve renounced any thought of embarking on a new fiction project anytime soon, but that doesn’t mean I can’t revel in my favorite part of the process, namely, thinking about what I might write next.  I’m interested to know what people here might favor, with the usual caveat that I won’t hesitate to ignore even a unanimous consensus.  I have a few ideas.  I could complete <i>David the Hero</i>, the first book in the Chronicles of King David.  I have an idea for an Internet fiction project similar to the OC’s Weres Anonymous, sort of an outrageously violent, darkly humorous take on the Harry Potter thing.  That, however, would require about five reliable co-writers able to contribute on a weekly basis, which my experience with open source projects informs me is improbable.  It would also greatly benefit from the OC’s involvement, which is even less likely given his commitments.  The thought of writing a parody of Lord of the Rings has occurred to me, not a silly and flatulent Bored of the Rings-style one, but rather a politically correct one which shows Sauron to be the equalitarian, trans-gendered champion of the racially oppressed and differently abled peoples of Middle Earth.  But that’s probably been done to death already.  One SF/F publisher was also interested in a serious military take on dragons, probably due to the success of the Novik novels, which I like but have very little in common with my particular concept.  And then, there’s this great idea for a strong, independent woman torn between her love for a vampire prince and a werewolf chieftan….</p><p>Anyhow, there’s no need to decide anything now, so I shall merely take my time luxuriating in the writer’s favorite occupation of kicking around ideas, pretending to do research, and not doing any actual writing.  In the meantime, we can also start thinking about the topic of the next Voxiversity.  Whilst I have the Landmark Herodotus, it is right out for number two.  Feel free to throw in your suggestions.</p></div>",
  "content_text": "Finally, at long last, I can announce that\nSumma Elvetica\nis complete.  It will be available for order soon as one of the three launch titles from\nMarcher Lord Press\n.  To tide over those who happen to be interested, here’s a bit from the author’s note that was requested by the publisher:\nThis novel did not proceed according to plan.  It was originally conceived as an epic philosophical trilogy, in which the reader would be immersed in medieval scholastic thought and explore various facets of some of the great philosophical debates that took place both within and without the Catholic Church.  Misunderstood by most modern intellectuals and ignored by the irreligious authors of modern fantasy fiction, the great scholars of the church were no close-minded ideologues, but rather brilliant men who conceived and refined many of the rational mechanisms that we today take for granted.  It is not a coincidence that William of Ockham, author of the Summa Logicae and known for the logical principle that bears his name, was a Franciscan monk.\nWhile the logic of churchmen such as William of Ockham, Aurelius Augustinus Hipponensis, and Thomas Aquinas most certainly has its flaws, the fair-minded reader must admit that their philosophical methods, however alien they may appear to modern eyes, are rather more reasonable and straighforward than the shamelessly manipulative Socratic method made famous by Plato.  Unfortunately, my initial goal of assigning roles for the diverse schools of philosophical thought to each of the conventional fantasy races foundered on my inability to meaningfully connect it to the story of the prospective young priest travelling to the elflands.\nI note in passing that two books in one year tends to somewhat belie the\nOriginal Cyberpunk’s contention\nthat blogging is bad for your writing.  In the OC’s defense, he only referred to fiction writing, and furthermore, my career as a novelist is about as close to nonexistent as a writer whose books are regularly published can be.  I’m not complaining.  I primarily write for my own entertainment and there is almost no way that a novel like\nSumma Elvetica\nwould ever get published by any large publisher, be they mainstream, genre, or CBA, even if I was a much more talented writer.\nI’ve renounced any thought of embarking on a new fiction project anytime soon, but that doesn’t mean I can’t revel in my favorite part of the process, namely, thinking about what I might write next.  I’m interested to know what people here might favor, with the usual caveat that I won’t hesitate to ignore even a unanimous consensus.  I have a few ideas.  I could complete\nDavid the Hero\n, the first book in the Chronicles of King David.  I have an idea for an Internet fiction project similar to the OC’s Weres Anonymous, sort of an outrageously violent, darkly humorous take on the Harry Potter thing.  That, however, would require about five reliable co-writers able to contribute on a weekly basis, which my experience with open source projects informs me is improbable.  It would also greatly benefit from the OC’s involvement, which is even less likely given his commitments.  The thought of writing a parody of Lord of the Rings has occurred to me, not a silly and flatulent Bored of the Rings-style one, but rather a politically correct one which shows Sauron to be the equalitarian, trans-gendered champion of the racially oppressed and differently abled peoples of Middle Earth.  But that’s probably been done to death already.  One SF/F publisher was also interested in a serious military take on dragons, probably due to the success of the Novik novels, which I like but have very little in common with my particular concept.  And then, there’s this great idea for a strong, independent woman torn between her love for a vampire prince and a werewolf chieftan….\nAnyhow, there’s no need to decide anything now, so I shall merely take my time luxuriating in the writer’s favorite occupation of kicking around ideas, pretending to do research, and not doing any actual writing.  In the meantime, we can also start thinking about the topic of the next Voxiversity.  Whilst I have the Landmark Herodotus, it is right out for number two.  Feel free to throw in your suggestions.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-16T09:23:00+00:00"
}