{
  "url": "https://voxday.net/2008/09/30/interview-with-congressman-mccotter_30/",
  "scraped_at": "2026-01-08T22:36:42.608947",
  "title": "Interview with Congressman McCotter",
  "date_display": "September 30, 2008",
  "date_iso": "2008-09-30T04:15:00+00:00",
  "date_from_url": "2008-09-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i><a href=\"http://mccotter.house.gov/HoR/MI11/\">Congressman Thaddeus McCotter</a> is a Michigan Republican who was the first member of the House of Representatives to publicly oppose Treasury Secretary Henry Paulson’s plan to spend $700 billion bailing out bankrupt Wall Street institutions.  After the House of Representatives voted against the legislative proposal, the congressman called on President Bush to fire Paulson.</i></p><p><b>Congratulations on successfully shooting down the bill.</b></p><p>Well, we don’t view it as a victory here, it’s just the responsibility to get the job done for the American people.</p><p><b>What were your main reasons for opposing the Paulson plan, even in the revised form that you voted on today?</b></p><p>It’s not about me.  I suppose this is a representative government.  From the MINUTE the Paulson plan was introduced, the American people said no.  And then as this administration foisted that proposal upon this Congress, the American people said no.  And then as Congress, despite warnings from people like me, set an artificial deadline of midnight Sunday, the American people said no.  And when the artificial deadline was met with a bad proposal, which was the Paulson proposal, the American people still said no.  The only thing we can take out of this is that fortunately the Paulson proposal did not pass.</p><p>Now, Congress is going to act.  It is going to act in a responsible and timely fashion on a piece of legislation that the American people know is fair to their interests and will help with this economic situation.  In the final analysis, the Paulson plan fundamentally failed in that it wanted the American taxpayer to buy noxious, toxic assets out of the marketplace.  You have to remove both the plan and Mr. Paulson from the process.  I’ve asked the President to demand Mr. Paulson’s resignation and deputize someone else so that the Congress and the White House can get on with a plan the American people will accept.</p><p><b>Speaking of what the American people will accept, I took a poll of my readers and the Right Wing News took a poll of its readers.  Only 15 percent of the Right Wing News readers supported the bailout, and only about one percent of my readers did.  Are the administration and the other members of Congress who supported the bill unaware of the strength of public opposition to the plan or do they just not care?</b></p><p>I’ll let them speak for themselves, but I think that what you’re finding is the same thing other members of Congress are finding.  First, there’s an argument that the American people don’t seem to understand what is happening if this bill failed.  I think the opposite is true.  The American people, from the MINUTE this Paulson bailout was announced, understood what it meant and they decided they did not like it.  What happened was an arrogant administration forced it upon Congress and finally, finally, thanks to the U.S. House, the people’s voice was heard and obeyed.  Now we can finally get down to the serious business of doing what is in the best interests of the American people.</p><p><b>What basic economic theory is operative in Congress right now?</b></p><p>Right now, the only thing that was operative, that was put in front of us, was Paulson’s plan, which was to buy those toxic assets at public expense.  There are several other models out there that other nations have used far more often and far more successfully than the flawed model Paulson put in there for the Wall Street bailout.  What we want is something that will spur private recapitalization so the money comes in off the sidelines where it’s parked, and also provides an appropriate government backstop that is necessary and just for the American people’s economic prosperity.  Those are the two fundamental principles.  As you can see, private recapitalization and appropriate government backstop that is just and fair to Americans, is an entirely different path than the one taken by Paulson with his first, only, last resort of a public bailout of Wall Street.</p><p><b>Conventional Keynesian theory, to which I do not subscribe–</b></p><p>Nor do I!</p><p><b>One of my readers went to high school with you.  He told me that you’re Austrian-aware.</b></p><p>Roepke, I’m more of a Roepke guy.  I don’t go as far as Von Mises.  A humane economy, not an insane economy.</p><p><b>Fair enough.  But the basic Keynesian model states that savings equals investment and there hasn’t been much savings in the American economy because interest rates have been so low for so long.  Where is this private capitalization supposed to come from with artificially suppressed interest rates that in real terms may actually be negative?</b></p><p>I would actually go one step further because I think you’re getting very close to the same position I’m at.  Savings are deferred consumption channeled into investment.  What happens under the despicable Keynesian model, the disastrous Keynesian model, is this – savings start to reduce.  And what the government does then is to pump expanded credit into the system.  It creates investment inflation.  This is exactly where we are and it’s called a bubble.  And the market has endeavored, as it always does, to correct that investment inflation, so Mr. Paulson and Mr. Bernanke wanted the taxpayers to inject $700 billion to keep the bubble inflated!  And it’s not going to work!</p><p>What you have to do is get the private money to come in and look at the assets, start to clear that out through proper legislation to incentivize it, and then get an appropriate government backstop.  Now, in the long term picture, it is all about reincentivizing American savings to increase that pool of capital here.  It is also about attracting American capital that is parked offshore back for repatriation; the last time we did it there was over $300 billion that came back into the American economy.  Benedict Arnold, as the Democrats have put it, Benedict Arnold cleaning up Wall Street.  And then what you can also do is incentivize PRIVATE foreign investment to come back into the United States through appropriate legislation.</p><p><b>As opposed to the sovereign funds they’re currently relying on.</b></p><p>Right, the sovereign wealth funds I oppose.  They’re government-run, and when the government of any nation, especially nations that are antithetical to the interests of the United States such as Communist China, when they come in and buy a private asset, it’s been nationalized.  It’s been socialized!  And when socialism is imported into the United States economy, the free market gets smaller and everyone’s liberty and prosperity is imperiled.</p><p><b>The dollar has lost 95.2 percent of its value to inflation since 1913, even by the official figures.  From 1813 to 1907, its value actually increased 52 percent.  Given the demonstrable failure of the Federal Reserve to either control inflation or maintain a stable financial system, why is there still such support for it in Congress?</b></p><p>I think that the argument that is made is probably because, as Roepke pointed out, people seem to think that inflationary periods are quite pleasurable until they realize that there’s a deflationary period to match it when the market corrects itself.  Plus, the more government under the Keynes model has a role within people’s economic lives, the more important government is, the more powerful it is.  In short, you’re asking people to refrain from using their publicly entrusted subservient positions, as members of Congress or members of the government, from interfering in a marketplace to make themselves popular for a short period of time.</p><p>Now, I’ve got time for one more.  Give me your best shot.</p><p><b>There’s a lot of suspicion that Congress is going to go to the Brussels model and make you vote until you get it right.  How are the House Republicans going to deal with that?</b></p><p>It is up to the American people.  The American people have spoken clearly, and it is inc<br> umbent first and foremost upon this administration to admit that the American people have rejected the Paulson bailout model for our economic rescue.  It is that simple!  If the administration continues to push this forward, even if that bill passes against the wishes of the American People, nothing is going to be accomplished.  Even by its proponents it is being sold as a short-term STABILIZATION measure that doesn’t address the root problems that we have.</br></p><p>The American people will not stand to be dictated to by an administration or by a Congress that is deaf to its expressed wishes.  That’s why we are a free people and will remain so.</p></div>",
  "content_text": "Congressman Thaddeus McCotter\nis a Michigan Republican who was the first member of the House of Representatives to publicly oppose Treasury Secretary Henry Paulson’s plan to spend $700 billion bailing out bankrupt Wall Street institutions.  After the House of Representatives voted against the legislative proposal, the congressman called on President Bush to fire Paulson.\nCongratulations on successfully shooting down the bill.\nWell, we don’t view it as a victory here, it’s just the responsibility to get the job done for the American people.\nWhat were your main reasons for opposing the Paulson plan, even in the revised form that you voted on today?\nIt’s not about me.  I suppose this is a representative government.  From the MINUTE the Paulson plan was introduced, the American people said no.  And then as this administration foisted that proposal upon this Congress, the American people said no.  And then as Congress, despite warnings from people like me, set an artificial deadline of midnight Sunday, the American people said no.  And when the artificial deadline was met with a bad proposal, which was the Paulson proposal, the American people still said no.  The only thing we can take out of this is that fortunately the Paulson proposal did not pass.\nNow, Congress is going to act.  It is going to act in a responsible and timely fashion on a piece of legislation that the American people know is fair to their interests and will help with this economic situation.  In the final analysis, the Paulson plan fundamentally failed in that it wanted the American taxpayer to buy noxious, toxic assets out of the marketplace.  You have to remove both the plan and Mr. Paulson from the process.  I’ve asked the President to demand Mr. Paulson’s resignation and deputize someone else so that the Congress and the White House can get on with a plan the American people will accept.\nSpeaking of what the American people will accept, I took a poll of my readers and the Right Wing News took a poll of its readers.  Only 15 percent of the Right Wing News readers supported the bailout, and only about one percent of my readers did.  Are the administration and the other members of Congress who supported the bill unaware of the strength of public opposition to the plan or do they just not care?\nI’ll let them speak for themselves, but I think that what you’re finding is the same thing other members of Congress are finding.  First, there’s an argument that the American people don’t seem to understand what is happening if this bill failed.  I think the opposite is true.  The American people, from the MINUTE this Paulson bailout was announced, understood what it meant and they decided they did not like it.  What happened was an arrogant administration forced it upon Congress and finally, finally, thanks to the U.S. House, the people’s voice was heard and obeyed.  Now we can finally get down to the serious business of doing what is in the best interests of the American people.\nWhat basic economic theory is operative in Congress right now?\nRight now, the only thing that was operative, that was put in front of us, was Paulson’s plan, which was to buy those toxic assets at public expense.  There are several other models out there that other nations have used far more often and far more successfully than the flawed model Paulson put in there for the Wall Street bailout.  What we want is something that will spur private recapitalization so the money comes in off the sidelines where it’s parked, and also provides an appropriate government backstop that is necessary and just for the American people’s economic prosperity.  Those are the two fundamental principles.  As you can see, private recapitalization and appropriate government backstop that is just and fair to Americans, is an entirely different path than the one taken by Paulson with his first, only, last resort of a public bailout of Wall Street.\nConventional Keynesian theory, to which I do not subscribe–\nNor do I!\nOne of my readers went to high school with you.  He told me that you’re Austrian-aware.\nRoepke, I’m more of a Roepke guy.  I don’t go as far as Von Mises.  A humane economy, not an insane economy.\nFair enough.  But the basic Keynesian model states that savings equals investment and there hasn’t been much savings in the American economy because interest rates have been so low for so long.  Where is this private capitalization supposed to come from with artificially suppressed interest rates that in real terms may actually be negative?\nI would actually go one step further because I think you’re getting very close to the same position I’m at.  Savings are deferred consumption channeled into investment.  What happens under the despicable Keynesian model, the disastrous Keynesian model, is this – savings start to reduce.  And what the government does then is to pump expanded credit into the system.  It creates investment inflation.  This is exactly where we are and it’s called a bubble.  And the market has endeavored, as it always does, to correct that investment inflation, so Mr. Paulson and Mr. Bernanke wanted the taxpayers to inject $700 billion to keep the bubble inflated!  And it’s not going to work!\nWhat you have to do is get the private money to come in and look at the assets, start to clear that out through proper legislation to incentivize it, and then get an appropriate government backstop.  Now, in the long term picture, it is all about reincentivizing American savings to increase that pool of capital here.  It is also about attracting American capital that is parked offshore back for repatriation; the last time we did it there was over $300 billion that came back into the American economy.  Benedict Arnold, as the Democrats have put it, Benedict Arnold cleaning up Wall Street.  And then what you can also do is incentivize PRIVATE foreign investment to come back into the United States through appropriate legislation.\nAs opposed to the sovereign funds they’re currently relying on.\nRight, the sovereign wealth funds I oppose.  They’re government-run, and when the government of any nation, especially nations that are antithetical to the interests of the United States such as Communist China, when they come in and buy a private asset, it’s been nationalized.  It’s been socialized!  And when socialism is imported into the United States economy, the free market gets smaller and everyone’s liberty and prosperity is imperiled.\nThe dollar has lost 95.2 percent of its value to inflation since 1913, even by the official figures.  From 1813 to 1907, its value actually increased 52 percent.  Given the demonstrable failure of the Federal Reserve to either control inflation or maintain a stable financial system, why is there still such support for it in Congress?\nI think that the argument that is made is probably because, as Roepke pointed out, people seem to think that inflationary periods are quite pleasurable until they realize that there’s a deflationary period to match it when the market corrects itself.  Plus, the more government under the Keynes model has a role within people’s economic lives, the more important government is, the more powerful it is.  In short, you’re asking people to refrain from using their publicly entrusted subservient positions, as members of Congress or members of the government, from interfering in a marketplace to make themselves popular for a short period of time.\nNow, I’ve got time for one more.  Give me your best shot.\nThere’s a lot of suspicion that Congress is going to go to the Brussels model and make you vote until you get it right.  How are the House Republicans going to deal with that?\nIt is up to the American people.  The American people have spoken clearly, and it is inc\numbent first and foremost upon this administration to admit that the American people have rejected the Paulson bailout model for our economic rescue.  It is that simple!  If the administration continues to push this forward, even if that bill passes against the wishes of the American People, nothing is going to be accomplished.  Even by its proponents it is being sold as a short-term STABILIZATION measure that doesn’t address the root problems that we have.\nThe American people will not stand to be dictated to by an administration or by a Congress that is deaf to its expressed wishes.  That’s why we are a free people and will remain so.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-30T03:15:00+00:00"
}