{
  "url": "https://voxday.net/2008/09/18/lest-you-think-markets-are-free/",
  "scraped_at": "2026-01-08T22:35:47.689533",
  "title": "Lest you think the markets are free",
  "date_display": "September 18, 2008",
  "date_iso": "2008-09-18T20:14:00+00:00",
  "date_from_url": "2008-09-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In related news, archeologists today discovered a stone tablet containing the <i>Lex Concido Rex</i>, which apparently codified the imperial laws banning species extinction proclaimed by one Dens Ingens, a dinosaur emperor from the Gwaag Dynasty:</p><blockquote><p>Stock market speculators <a href=\"http://www.telegraph.co.uk/money/main.jhtml?xml=/money/2008/09/18/bcnstocks218.xml\">will not be allowed to profit</a> from the falling share prices of banks and insurance companies, financial regulators have announced….  The City regulator introduced a ban on the “short-selling” of banking and other financial shares on the London stock market. Short-selling is essentially a form of betting; a technique used by hedge funds and speculators to profit from falling share prices.</p></blockquote><p>And once more history repeats itself.  If prices are going down, why, it must be the speculators!  Why not just have done with it and pass a law forbidding stock prices to decline that also gives everyone ten billion dollars?  It would be nearly as effective.</p></div>",
  "content_text": "In related news, archeologists today discovered a stone tablet containing the\nLex Concido Rex\n, which apparently codified the imperial laws banning species extinction proclaimed by one Dens Ingens, a dinosaur emperor from the Gwaag Dynasty:\nStock market speculators\nwill not be allowed to profit\nfrom the falling share prices of banks and insurance companies, financial regulators have announced….  The City regulator introduced a ban on the “short-selling” of banking and other financial shares on the London stock market. Short-selling is essentially a form of betting; a technique used by hedge funds and speculators to profit from falling share prices.\nAnd once more history repeats itself.  If prices are going down, why, it must be the speculators!  Why not just have done with it and pass a law forbidding stock prices to decline that also gives everyone ten billion dollars?  It would be nearly as effective.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-18T19:14:00+00:00"
}