{
  "url": "https://voxday.net/2008/09/09/little-fish-bite/",
  "scraped_at": "2026-01-08T22:35:03.236744",
  "title": "The little fish bite",
  "date_display": "September 9, 2008",
  "date_iso": "2008-09-09T15:16:00+00:00",
  "date_from_url": "2008-09-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We are amused to be informed that John Hawkins <a href=\"http://rightwingnews.com/#post12584\">just can’t resist the Palin-bait</a>:</p><blockquote><p>As RWN’s regular readers already know, I have been a harsh critic of John McCain for a long time and back in May, I wrote a post called, “Why I Will No Longer Support John McCain For President.” That post was widely linked and was probably why I was blackballed from the Republican National Convention.  However, I’ve been wavering on my “non-vote” in the 2008 election for a while. That’s not because I’ve warmed up to McCain; it’s because of my concerns about Barack Obama.</p><p>Of course, it goes without saying that Obama is incredibly liberal, too inexperienced to be President, has terrible judgment (See Jeremiah Wright and Bill Ayers), and isn’t particularly bright for a senator (See his 57 states gaffe, among others).  However, the real problem with Obama isn’t just that he’s incompetent, it’s that he’s an incompetent who seems to think he’s a genius. Never has a man so unaccomplished been so overly proud of his non-achievements…. it may have been Barack’s inability to do the job that had me rethinking my non-vote for McCain, but it has been the Left’s treatment of Sarah Palin that put me over the top.</p></blockquote><p>And, of course, it is the MOSTEST IMPORTANTEST ELECTION EVAR!  I only wonder if having a book entitled <i>None of the Above</i> will be enough to prevent Mr. Farah from repeating his dramatic quadrennial return to the fold.  For those who might wonder if it’s possible that I would follow suit… the short answer is no, that’s not going to happen.  I’ve never voted for a Republican presidential candidate before and I’m not about to start now.</p></div>",
  "content_text": "We are amused to be informed that John Hawkins\njust can’t resist the Palin-bait\n:\nAs RWN’s regular readers already know, I have been a harsh critic of John McCain for a long time and back in May, I wrote a post called, “Why I Will No Longer Support John McCain For President.” That post was widely linked and was probably why I was blackballed from the Republican National Convention.  However, I’ve been wavering on my “non-vote” in the 2008 election for a while. That’s not because I’ve warmed up to McCain; it’s because of my concerns about Barack Obama.\nOf course, it goes without saying that Obama is incredibly liberal, too inexperienced to be President, has terrible judgment (See Jeremiah Wright and Bill Ayers), and isn’t particularly bright for a senator (See his 57 states gaffe, among others).  However, the real problem with Obama isn’t just that he’s incompetent, it’s that he’s an incompetent who seems to think he’s a genius. Never has a man so unaccomplished been so overly proud of his non-achievements…. it may have been Barack’s inability to do the job that had me rethinking my non-vote for McCain, but it has been the Left’s treatment of Sarah Palin that put me over the top.\nAnd, of course, it is the MOSTEST IMPORTANTEST ELECTION EVAR!  I only wonder if having a book entitled\nNone of the Above\nwill be enough to prevent Mr. Farah from repeating his dramatic quadrennial return to the fold.  For those who might wonder if it’s possible that I would follow suit… the short answer is no, that’s not going to happen.  I’ve never voted for a Republican presidential candidate before and I’m not about to start now.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-09T14:16:00+00:00"
}