{
  "url": "https://voxday.net/2008/09/07/mailvox-real-sarah-palin/",
  "scraped_at": "2026-01-08T22:34:55.874496",
  "title": "Mailvox: the real Sarah Palin",
  "date_display": "September 7, 2008",
  "date_iso": "2008-09-07T23:55:00+00:00",
  "date_from_url": "2008-09-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A reader writes to tell of his personal experience of the VP candidate:</p><blockquote><p>I have been following your writing on and off for the last couple of years. I am a committed and politically well-educated Christian “libertarian.”  I am from Wasilla, Alaska. I personally know Sarah Palin. [They are near neighbors.]  I worked on her first campaign for Mayor of Wasilla. I also have a good libertarian friend whose wife is [a good friend of] Sarah.</p><p>Sarah is a smart and savvy individual. In person, she actually does not come across as a barracuda or a strictly annoyingly aggressive person when you talk to her. She is beyond that. She is more reserved and skilled socially, almost shy-seeming. The reason she is known as a barracuda is because she is surprisingly more of a strategist/winner than people ever give her credit for. She is very skilled politically, but not in the slick willy sort of way. In the 80% approval rating as Alaskan Governor sort of way because she is very real and honest.</p><p>She has a pretty good social conservative record. But, she has become a bit of a fiscal socialist once she got to state office.  I have had several women bosses and I typically can’t stand women as my leaders. They are way too emotion-based and petty. Palin is a bit different, she seems like a good leader, that said, I don’t think that I can in good conscience vote for McCain.</p></blockquote><p>This corresponds pretty closely to what I’ve gleaned of Gov. Palin in casual observation from afar.  I think she’s smarter, more dispassionate, and much more strategic in her thinking than most observers realize.  However, I also detect an extreme ambition and an ego that she probably tends to keep somewhat concealed from those around her; I don’t trust anyone, male or female, who pursues a career in television in their youth, as it tends to be indicative of both a severe character flaw and intellectual superficiality.</p><p>The fact that Palin was both a beauty queen contestant and sportscaster indicates an unusually high degree of narcissism.  Those possessed of such a character are very unlikely to resist the temptations of power, to which I suspect her acquaintance is obliquely referring when he describes her fiscal socialism in office.  In general, it’s fairly safe to conclude that the sort of individual who builds <a href=\"http://dwb.adn.com/news/alaska/matsu/story/9055227p-8971221c.html\">expensive sports complexes</a> as a local politician will tend to engage in expensive nation-building and showy domestic spending programs when elected to national office.  Unfortunately, conservative instincts and Christian faith seldom trump core character flaws in Washington.</p><p>Sarah Palin is still a marvelous choice by John McCain and may well be the factor that allows him to upset Barack Obama and claim the Cherry Blossom Throne.  Palin is an admirable woman of political and evolutionary accomplishment, and it is certainly possible that she possesses the internal steel to resist the tests and temptations that will be placed before her.  It wouldn’t shock me, however, if many of those who enthusiastically vote for McCain-Palin in 2008 eventually come to regret doing so once the fruits of victory are harvested.</p></div>",
  "content_text": "A reader writes to tell of his personal experience of the VP candidate:\nI have been following your writing on and off for the last couple of years. I am a committed and politically well-educated Christian “libertarian.”  I am from Wasilla, Alaska. I personally know Sarah Palin. [They are near neighbors.]  I worked on her first campaign for Mayor of Wasilla. I also have a good libertarian friend whose wife is [a good friend of] Sarah.\nSarah is a smart and savvy individual. In person, she actually does not come across as a barracuda or a strictly annoyingly aggressive person when you talk to her. She is beyond that. She is more reserved and skilled socially, almost shy-seeming. The reason she is known as a barracuda is because she is surprisingly more of a strategist/winner than people ever give her credit for. She is very skilled politically, but not in the slick willy sort of way. In the 80% approval rating as Alaskan Governor sort of way because she is very real and honest.\nShe has a pretty good social conservative record. But, she has become a bit of a fiscal socialist once she got to state office.  I have had several women bosses and I typically can’t stand women as my leaders. They are way too emotion-based and petty. Palin is a bit different, she seems like a good leader, that said, I don’t think that I can in good conscience vote for McCain.\nThis corresponds pretty closely to what I’ve gleaned of Gov. Palin in casual observation from afar.  I think she’s smarter, more dispassionate, and much more strategic in her thinking than most observers realize.  However, I also detect an extreme ambition and an ego that she probably tends to keep somewhat concealed from those around her; I don’t trust anyone, male or female, who pursues a career in television in their youth, as it tends to be indicative of both a severe character flaw and intellectual superficiality.\nThe fact that Palin was both a beauty queen contestant and sportscaster indicates an unusually high degree of narcissism.  Those possessed of such a character are very unlikely to resist the temptations of power, to which I suspect her acquaintance is obliquely referring when he describes her fiscal socialism in office.  In general, it’s fairly safe to conclude that the sort of individual who builds\nexpensive sports complexes\nas a local politician will tend to engage in expensive nation-building and showy domestic spending programs when elected to national office.  Unfortunately, conservative instincts and Christian faith seldom trump core character flaws in Washington.\nSarah Palin is still a marvelous choice by John McCain and may well be the factor that allows him to upset Barack Obama and claim the Cherry Blossom Throne.  Palin is an admirable woman of political and evolutionary accomplishment, and it is certainly possible that she possesses the internal steel to resist the tests and temptations that will be placed before her.  It wouldn’t shock me, however, if many of those who enthusiastically vote for McCain-Palin in 2008 eventually come to regret doing so once the fruits of victory are harvested.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-07T22:55:00+00:00"
}