{
  "url": "https://voxday.net/2008/09/24/mccain-suspends-campaign/",
  "scraped_at": "2026-01-08T22:36:16.985142",
  "title": "McCain suspends presidential campaign",
  "date_display": "September 24, 2008",
  "date_iso": "2008-09-24T19:10:00+00:00",
  "date_from_url": "2008-09-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://elections.foxnews.com/2008/09/24/mccain-suspends-campaign-to-help-with-bailout/\">In order to concentrate</a> on helping <s>La Cosa Nostra</s>Wall Street bankers rob American citizens:</p><blockquote><p>John McCain announced that he will suspend his presidential campaign on Thursday to return to Washington to help with bailout negotiations. He urged his opponent Barack Obama to do the same.  The Arizona senator also asked the Presidential Debate Commission to postpone Friday’s scheduled debate with Obama so that he can work on the financial crisis bailout plan now on Capitol Hill.</p></blockquote><p>If either McCain or Obama knew what they were doing, they’d be thundering against the <s>extortion</s>bailout and calling for fines and jailtime to be handed out to every executive at every financial institution responsible.  And that would be every bit as Constitutional as what George Bush and his boy Paulson are trying to pull.  Whoever champions the people against the bankers would win in a landslide… Ron Paul could have actually won this year if he’d only been able to claim the nomination.</p><p>Thanks ever so much, pragmatists.</p></div>",
  "content_text": "In order to concentrate\non helping\nLa Cosa Nostra\nWall Street bankers rob American citizens:\nJohn McCain announced that he will suspend his presidential campaign on Thursday to return to Washington to help with bailout negotiations. He urged his opponent Barack Obama to do the same.  The Arizona senator also asked the Presidential Debate Commission to postpone Friday’s scheduled debate with Obama so that he can work on the financial crisis bailout plan now on Capitol Hill.\nIf either McCain or Obama knew what they were doing, they’d be thundering against the\nextortion\nbailout and calling for fines and jailtime to be handed out to every executive at every financial institution responsible.  And that would be every bit as Constitutional as what George Bush and his boy Paulson are trying to pull.  Whoever champions the people against the bankers would win in a landslide… Ron Paul could have actually won this year if he’d only been able to claim the nomination.\nThanks ever so much, pragmatists.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-24T18:10:00+00:00"
}