{
  "url": "https://voxday.net/2008/09/16/obamanation-loses-i/",
  "scraped_at": "2026-01-08T22:35:33.013643",
  "title": "Obamanation loses it",
  "date_display": "September 16, 2008",
  "date_iso": "2008-09-16T10:15:00+00:00",
  "date_from_url": "2008-09-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The usually deliberate John Scalzi is <a href=\"http://scalzi.com/whatever/?p=1734\">beginning to show some signs of electoral stress</a> himself:</p><blockquote><p>It’s entirely possible that McCain campaign will benefit from a critical mass of people — and not just dyed-in-the-wool, will-vote-Satan-into-office-if-he-wears-a-flag-pin Republicans — who have been primed by years of intentional and structural undermining of the legitimacy of fact, to accept bald-faced lying as just another tactic; people, in other words, who know that they are being lied to, know the lies are being repeated in the face of factual evidence, and know the campaign knows it is lying and plans to continue to do so all the way to the White House… and see that sort of stance as admirable. Can you blame McCain for taking advantage of this dynamic? Well, quite obviously, you can, and should. It’s one thing to imagine one’s self a “maverick” for speaking truth to power; it’s quite another thing to be a “maverick” by deciding to lie one’s way into power. However, it’s also amply clear that many who should blame him, or would be outraged by Obama lying in such a transparent and recurrent fashion, won’t.</p></blockquote><p>Setting aside the amusing notion that any Democrat other than Walter Mondale has ever told anything even remotely approaching the truth about their governing intentions, in my opinion Mr. Scalzi is too close to his favored candidate and it’s shredding his ability to analyze the election properly. McCain’s campaign is lying, as politicians do, but the lies are minor and they mostly involve exaggerations of the facts. If McCain were to tell whoppers – such as posing as a champion of ending illegal immigration or free speech – he’d suffer badly. He’s keeping it within the rules of the game.</p><p>Barack Obama, on the other hand, is lying about who he is and he has been lying about who he is from the very beginning, <a href=\"http://sweetness-light.com/archive/did-obama-turn-down-a-wall-street-career\">even in his own autobiography</a>. The man is obnoxious, a near-complete fraud, and many people sense that and dislike him; he can tell the absolute truth for the rest of the campaign and it will make no difference at all. The fact that his campaign is run by strategists who think they’re still running in a Democratic primary hasn’t helped him.</p><p>Does this mean the electorate is stupid? Of course it does, most people are idiots. Most people at <a href=\"http://www.scalzi.com/whatever/\">Whatever </a>are idiots too, functionally if not literally. I mean, those who are still in denial about Liberal Media Bias may as well sign up for the Flat Earth Society and the Holocaust Deniers League while they’re at it.</p><p>I understand why Democrats are furious to the point of hysteria. They absolutely should win this election in a landslide and if they had nominated Hillary, they would have. But they didn’t. Instead they unwisely nominated a smooth self-promoter who is so hopelessly amateurish that he can’t even attack a Republican president presiding over the worst financial meltdown in the country’s history. Obama fans had better get used to the notion that he’s going to lose, since he’s probably going to lose worse than people thought McCain would a month ago. Remember, those who say he’s still a winner are the same folks who said Palin was a terrible choice by McCain that would blow up in Republican faces.</p><p>But Democrats should be consoled by the fact that it doesn’t matter who wins since Bernanke is going to be calling the shots anyhow. The economic meltdown will continue, Republicans will bear the blame, and Hillary can ascend the Cherry Blossom Throne four years later than scheduled, just in time to reap the rewards of a economic bounce-back.</p></div>",
  "content_text": "The usually deliberate John Scalzi is\nbeginning to show some signs of electoral stress\nhimself:\nIt’s entirely possible that McCain campaign will benefit from a critical mass of people — and not just dyed-in-the-wool, will-vote-Satan-into-office-if-he-wears-a-flag-pin Republicans — who have been primed by years of intentional and structural undermining of the legitimacy of fact, to accept bald-faced lying as just another tactic; people, in other words, who know that they are being lied to, know the lies are being repeated in the face of factual evidence, and know the campaign knows it is lying and plans to continue to do so all the way to the White House… and see that sort of stance as admirable. Can you blame McCain for taking advantage of this dynamic? Well, quite obviously, you can, and should. It’s one thing to imagine one’s self a “maverick” for speaking truth to power; it’s quite another thing to be a “maverick” by deciding to lie one’s way into power. However, it’s also amply clear that many who should blame him, or would be outraged by Obama lying in such a transparent and recurrent fashion, won’t.\nSetting aside the amusing notion that any Democrat other than Walter Mondale has ever told anything even remotely approaching the truth about their governing intentions, in my opinion Mr. Scalzi is too close to his favored candidate and it’s shredding his ability to analyze the election properly. McCain’s campaign is lying, as politicians do, but the lies are minor and they mostly involve exaggerations of the facts. If McCain were to tell whoppers – such as posing as a champion of ending illegal immigration or free speech – he’d suffer badly. He’s keeping it within the rules of the game.\nBarack Obama, on the other hand, is lying about who he is and he has been lying about who he is from the very beginning,\neven in his own autobiography\n. The man is obnoxious, a near-complete fraud, and many people sense that and dislike him; he can tell the absolute truth for the rest of the campaign and it will make no difference at all. The fact that his campaign is run by strategists who think they’re still running in a Democratic primary hasn’t helped him.\nDoes this mean the electorate is stupid? Of course it does, most people are idiots. Most people at\nWhatever\nare idiots too, functionally if not literally. I mean, those who are still in denial about Liberal Media Bias may as well sign up for the Flat Earth Society and the Holocaust Deniers League while they’re at it.\nI understand why Democrats are furious to the point of hysteria. They absolutely should win this election in a landslide and if they had nominated Hillary, they would have. But they didn’t. Instead they unwisely nominated a smooth self-promoter who is so hopelessly amateurish that he can’t even attack a Republican president presiding over the worst financial meltdown in the country’s history. Obama fans had better get used to the notion that he’s going to lose, since he’s probably going to lose worse than people thought McCain would a month ago. Remember, those who say he’s still a winner are the same folks who said Palin was a terrible choice by McCain that would blow up in Republican faces.\nBut Democrats should be consoled by the fact that it doesn’t matter who wins since Bernanke is going to be calling the shots anyhow. The economic meltdown will continue, Republicans will bear the blame, and Hillary can ascend the Cherry Blossom Throne four years later than scheduled, just in time to reap the rewards of a economic bounce-back.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-16T09:15:00+00:00"
}