{
  "url": "https://voxday.net/2008/09/13/palin-wont-pull-hillary-supporters/",
  "scraped_at": "2026-01-08T22:35:16.800206",
  "title": "Palin won’t pull Hillary supporters",
  "date_display": "September 13, 2008",
  "date_iso": "2008-09-13T11:56:00+00:00",
  "date_from_url": "2008-09-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Of this <a href=\"http://ace.mu.nu/archives/273306.php#273306\">we can be sure</a>, because the media repeatedly told us so:</p><blockquote><p> The McCain-Palin campaign today announced that New Hampshire State Representative Doreen Howard, a Democratic legislator from Newmarket, has endorsed John McCain for president. Representative Howard previously supported Senator Hillary Rodham Clinton’s candidacy.</p><p>“As a lifelong Democrat who enthusiastically backed Hillary Clinton in the primaries, I am now supporting John McCain.”</p></blockquote><p>I have repeatedly written contemptuously of the general intelligence level of the media, so much so that I occasionally get emails from professional journalists that boil down to little more than whines consisting of “we is too smart, we gots journalist degrees from real gud skools!”  The thing that’s so tremendously amusing about this is that they are not only refusing to stop their muddle-headed, counterproductive, pro-Obama activism that has caused so many normal Americans to reject their BS, they’re actually <a href=\"http://www.upi.com/news/issueoftheday/2008/09/12/ABCs_Gibson_grilled_Palin_hard_but_it_may_backfire/UPI-81241221234472/\">redoubling their efforts</a> to spin, sneer, smear, and <a href=\"http://newsbusters.org/blogs/p-j-gladnick/2008/09/13/abc-news-edited-out-key-parts-sarah-palin-interview\">surreptitiously cover up</a> their <a href=\"http://www.washingtonpost.com/wp-dyn/content/article/2008/09/12/AR2008091202457.html?hpid=opinionsbox1\">blatant mistakes</a> as they make them.</p></div>",
  "content_text": "Of this\nwe can be sure\n, because the media repeatedly told us so:\nThe McCain-Palin campaign today announced that New Hampshire State Representative Doreen Howard, a Democratic legislator from Newmarket, has endorsed John McCain for president. Representative Howard previously supported Senator Hillary Rodham Clinton’s candidacy.\n“As a lifelong Democrat who enthusiastically backed Hillary Clinton in the primaries, I am now supporting John McCain.”\nI have repeatedly written contemptuously of the general intelligence level of the media, so much so that I occasionally get emails from professional journalists that boil down to little more than whines consisting of “we is too smart, we gots journalist degrees from real gud skools!”  The thing that’s so tremendously amusing about this is that they are not only refusing to stop their muddle-headed, counterproductive, pro-Obama activism that has caused so many normal Americans to reject their BS, they’re actually\nredoubling their efforts\nto spin, sneer, smear, and\nsurreptitiously cover up\ntheir\nblatant mistakes\nas they make them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-13T10:56:00+00:00"
}