{
  "url": "https://voxday.net/2008/09/26/senator-speaks/",
  "scraped_at": "2026-01-08T22:36:24.348054",
  "title": "A senator speaks",
  "date_display": "September 26, 2008",
  "date_iso": "2008-09-26T18:24:00+00:00",
  "date_from_url": "2008-09-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Hawkins <a href=\"http://rightwingnews.com/#post12827\">interviews Sen. Jim Demint</a> about the bailout:</p><blockquote><p>JH: <b>I can tell you that people are furious about this. I know at my blog, I did a poll and 85% of the people opposed this. People think they’re being asked to throw their money away on a massive scale to pay the bills for people who behaved irresponsibly. Are they right?</b></p><p>JD: They’re exactly right. People are mad. I am getting hundreds of calls a day and it’s 100 to 1 against this. …Even banks like BB&amp;T say that they don’t want this because they know what it means: the government is going to get involved in their business whether they take their money or not….</p><p>So, people have every right to be angry and that anger needs to continue…. We’ve seen that Americans getting angry and involved helped us defeat this whole amnesty proposal and it helped us spotlight wasteful earmarks, which we’re making some progress on. It has brought the energy issue to the point where we have backed the Democrats down from this drilling moratorium. We’re making progress on this bailout.</p><p>…The problem we have politically is that the President wants this so that he’s not the President who presides over a catastrophe. He’s willing to give the Democrats all the regulations and intrusions in the market that they want if they will help him pass it.</p></blockquote><p>Basically, everyone with even a shred of common sense is against the Bailouts for Bankers plan, except, of course, <a href=\"http://article.nationalreview.com/?q=MjUyNDQ0YTMxMjg5YTIxODc4MmY2ZjNhNjFiZWRlOTA=\">the larger part of the conservative commentariat</a>, which demonstrates once more that it is far too comfortably in bed with Washington to be taken seriously by any actual conservatives.  Between the political leadership of George Bush and the media leadership of National Review, is it any wonder that the Republican brand looks about as good as Union Carbide’s post-Bhopal?</p></div>",
  "content_text": "John Hawkins\ninterviews Sen. Jim Demint\nabout the bailout:\nJH:\nI can tell you that people are furious about this. I know at my blog, I did a poll and 85% of the people opposed this. People think they’re being asked to throw their money away on a massive scale to pay the bills for people who behaved irresponsibly. Are they right?\nJD: They’re exactly right. People are mad. I am getting hundreds of calls a day and it’s 100 to 1 against this. …Even banks like BB&T say that they don’t want this because they know what it means: the government is going to get involved in their business whether they take their money or not….\nSo, people have every right to be angry and that anger needs to continue…. We’ve seen that Americans getting angry and involved helped us defeat this whole amnesty proposal and it helped us spotlight wasteful earmarks, which we’re making some progress on. It has brought the energy issue to the point where we have backed the Democrats down from this drilling moratorium. We’re making progress on this bailout.\n…The problem we have politically is that the President wants this so that he’s not the President who presides over a catastrophe. He’s willing to give the Democrats all the regulations and intrusions in the market that they want if they will help him pass it.\nBasically, everyone with even a shred of common sense is against the Bailouts for Bankers plan, except, of course,\nthe larger part of the conservative commentariat\n, which demonstrates once more that it is far too comfortably in bed with Washington to be taken seriously by any actual conservatives.  Between the political leadership of George Bush and the media leadership of National Review, is it any wonder that the Republican brand looks about as good as Union Carbide’s post-Bhopal?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-26T17:24:00+00:00"
}