{
  "url": "https://voxday.net/2008/09/25/some-begin-to-wake/",
  "scraped_at": "2026-01-08T22:36:20.658371",
  "title": "Some begin to wake",
  "date_display": "September 25, 2008",
  "date_iso": "2008-09-25T14:47:00+00:00",
  "date_from_url": "2008-09-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A commenter at Megan McArdle’s suddenly <a href=\"http://meganmcardle.theatlantic.com/archives/2008/09/thought_for_the_day_2.php#comments\">begins to grok</a>:</p><blockquote><p>No, the credit crisis has significantly changed my political views. Before, I thought that Ron Paul was a crackpot, that mainstream economists were generally on top of things, and inflation and fractional reserves were healthy and normal aspects of the economy. Now I believe that Ron Paul was mostly right, mainstream economists have systematic blind spots, and consistent inflation is corrosive. I have essentially turned from a Megan McArdle libertarian to a Murray Rothbard/Mencius Moldbug libtertarian.</p></blockquote><p>What I find interesting is that despite the fact that pretty much all of my economic contrarianism has been more than justified by recent events and the more mainstream economists have been shown to have been completely and utterly wrong, just as I have been writing for more than seven years, the large majority of readers are still turning to those who were completely wrong about the situation to explain it to them now.  This is as stupid and as unlikely to be effective as, well, turning to expert Wall Street financiers to fix the failure of the Wall Street financial system.</p><p>I have to disagree, however, with McArdle’s thought for the day: <i>“Isn’t it marvelous how the financial crisis has been caused entirely by things that you were opposed to before the crisis happened?”</i></p><p>Now, I’m opposed to the Green Bay Packers.  I’m opposed to Manchester United.  I’m totally and utterly opposed to Juventus and Bayern Munich.  I’m also opposed to the Federal Reserve, fiat currency, and politically-driven financial incentives to commit economic insanity.  But one would have to be truly and deeply stupid to fail to recognize that the latter three were primary contributors to the credit meltdown regardless of whether one approved of those things or not.  That being said, she’s largely correct here: “<i>The Paulson plan is not a plan.  It’s a plan to maybe have a plan at some unspecified point in the future.  The basic idea seems to be that we give the Fed a big pot of money, which it hands over to banks in exchange for illiquid securities.  Essentially, we’re recapitalizing the banks with federal money.”</i></p><p>No, it’s not federal money.  It’s money that belongs to American individuals.  But it’s true, it’s not a plan, it’s an attempted robbery under the color of crisis.</p></div>",
  "content_text": "A commenter at Megan McArdle’s suddenly\nbegins to grok\n:\nNo, the credit crisis has significantly changed my political views. Before, I thought that Ron Paul was a crackpot, that mainstream economists were generally on top of things, and inflation and fractional reserves were healthy and normal aspects of the economy. Now I believe that Ron Paul was mostly right, mainstream economists have systematic blind spots, and consistent inflation is corrosive. I have essentially turned from a Megan McArdle libertarian to a Murray Rothbard/Mencius Moldbug libtertarian.\nWhat I find interesting is that despite the fact that pretty much all of my economic contrarianism has been more than justified by recent events and the more mainstream economists have been shown to have been completely and utterly wrong, just as I have been writing for more than seven years, the large majority of readers are still turning to those who were completely wrong about the situation to explain it to them now.  This is as stupid and as unlikely to be effective as, well, turning to expert Wall Street financiers to fix the failure of the Wall Street financial system.\nI have to disagree, however, with McArdle’s thought for the day:\n“Isn’t it marvelous how the financial crisis has been caused entirely by things that you were opposed to before the crisis happened?”\nNow, I’m opposed to the Green Bay Packers.  I’m opposed to Manchester United.  I’m totally and utterly opposed to Juventus and Bayern Munich.  I’m also opposed to the Federal Reserve, fiat currency, and politically-driven financial incentives to commit economic insanity.  But one would have to be truly and deeply stupid to fail to recognize that the latter three were primary contributors to the credit meltdown regardless of whether one approved of those things or not.  That being said, she’s largely correct here: “\nThe Paulson plan is not a plan.  It’s a plan to maybe have a plan at some unspecified point in the future.  The basic idea seems to be that we give the Fed a big pot of money, which it hands over to banks in exchange for illiquid securities.  Essentially, we’re recapitalizing the banks with federal money.”\nNo, it’s not federal money.  It’s money that belongs to American individuals.  But it’s true, it’s not a plan, it’s an attempted robbery under the color of crisis.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-25T13:47:00+00:00"
}