{
  "url": "https://voxday.net/2008/09/29/speaking-on-our-behalf/",
  "scraped_at": "2026-01-08T22:36:38.899208",
  "title": "Speaking on our behalf",
  "date_display": "September 29, 2008",
  "date_iso": "2008-09-29T19:06:00+00:00",
  "date_from_url": "2008-09-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A press release from Congressman Thaddeus McCotter’s office <i>prior to the vote</i>:</p><blockquote><p>WASHINGTON, D.C. – Republican House Policy Chairman, Representative Thaddeus McCotter (R-MI), the first Republican member of Congress to publicly oppose Wall Street’s trillion dollar bailout, remains adamantly opposed to the legislation despite the Paulson bailout’s cosmetic changes:</p><p>“We are faced with the first financial panic of the global economy. Thus, the Congressional action taken today will set a precedent  affecting the prosperity of Americans for decades to come.  The proposed $700 billion dollar Wall Street bailout bill is not a Republican solution; it is not a Democratic solution; it is not an <br>American solution. The proposed $700 billion dollar Wall Street Bailout is a socialist solution – one that, by threatening hardworking Americans’ prosperity, unconscionably ransoms hardworking Americans’  money and reduces their liberty. As such, it is a generational threat to Americans’ liberty and prosperity.</br></p><p>Congress cannot re-inflate the bubble to save the American economy.”</p></blockquote><p>I just thought the dude deserved a victory lap, since he certainly kicked some ass on behalf of America’s economic liberty today.  And based on that last bit about what Congress <i>can’t</i> do, (as opposed to what it <i>shouldn’t</i> do), I’m guessing he’s more Austrian than Keynesian.</p><p>UPDATE – The congressman sends another email:</p><blockquote><p>It is time for the President of the United States to:</p><p>Calm the Congressional and global investor panic his administration has exacerbated.</p><p>Demand the resignation of Treasury Secretary Paulson, who no longer serves a constructive role in the enactment of the legislation necessary to end this period financial difficulty and uncertainty.</p><p>Deputize and dispatch a new representative to the Congressional negotiations, such as former Treasury Secretary James A. Baker, III, who has credibility with both markets, Congress, markets and, most importantly the American public.</p><p>Rule out pushing a financial recapitalization model based upon taxpayers purchasing ‘toxic assets’ from financial institutions, which the American public rightful believes unjust.</p></blockquote><p>I’m not keen on that Baker notion, but the rest of it is eminently reasonable, even if I would have preferred to see him call for something rather more TV-friendly than mere resignation for Mr. Paulson.  The key thing is to understand that Congress should not do ANYTHING, because anything it does will make the situation worse.  Well, anything it’s remotely likely to do, anyway.  The reason Wall Street’s demise won’t harm the economy anywhere nearly as much as everyone seems to think is quite simple. <i>Wall Street doesn’t fund any actual productive investment anyhow!</i></p><p>Entrepeneurship and freedom create wealth.  Borrowing money doesn’t, they’re like steroids, enabling unnaturally fast development that will kill the user more often than not.</p></div>",
  "content_text": "A press release from Congressman Thaddeus McCotter’s office\nprior to the vote\n:\nWASHINGTON, D.C. – Republican House Policy Chairman, Representative Thaddeus McCotter (R-MI), the first Republican member of Congress to publicly oppose Wall Street’s trillion dollar bailout, remains adamantly opposed to the legislation despite the Paulson bailout’s cosmetic changes:\n“We are faced with the first financial panic of the global economy. Thus, the Congressional action taken today will set a precedent  affecting the prosperity of Americans for decades to come.  The proposed $700 billion dollar Wall Street bailout bill is not a Republican solution; it is not a Democratic solution; it is not an\nAmerican solution. The proposed $700 billion dollar Wall Street Bailout is a socialist solution – one that, by threatening hardworking Americans’ prosperity, unconscionably ransoms hardworking Americans’  money and reduces their liberty. As such, it is a generational threat to Americans’ liberty and prosperity.\nCongress cannot re-inflate the bubble to save the American economy.”\nI just thought the dude deserved a victory lap, since he certainly kicked some ass on behalf of America’s economic liberty today.  And based on that last bit about what Congress\ncan’t\ndo, (as opposed to what it\nshouldn’t\ndo), I’m guessing he’s more Austrian than Keynesian.\nUPDATE – The congressman sends another email:\nIt is time for the President of the United States to:\nCalm the Congressional and global investor panic his administration has exacerbated.\nDemand the resignation of Treasury Secretary Paulson, who no longer serves a constructive role in the enactment of the legislation necessary to end this period financial difficulty and uncertainty.\nDeputize and dispatch a new representative to the Congressional negotiations, such as former Treasury Secretary James A. Baker, III, who has credibility with both markets, Congress, markets and, most importantly the American public.\nRule out pushing a financial recapitalization model based upon taxpayers purchasing ‘toxic assets’ from financial institutions, which the American public rightful believes unjust.\nI’m not keen on that Baker notion, but the rest of it is eminently reasonable, even if I would have preferred to see him call for something rather more TV-friendly than mere resignation for Mr. Paulson.  The key thing is to understand that Congress should not do ANYTHING, because anything it does will make the situation worse.  Well, anything it’s remotely likely to do, anyway.  The reason Wall Street’s demise won’t harm the economy anywhere nearly as much as everyone seems to think is quite simple.\nWall Street doesn’t fund any actual productive investment anyhow!\nEntrepeneurship and freedom create wealth.  Borrowing money doesn’t, they’re like steroids, enabling unnaturally fast development that will kill the user more often than not.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-29T18:06:00+00:00"
}