{
  "url": "https://voxday.net/2008/09/09/split-personality-of-american-libera/",
  "scraped_at": "2026-01-08T22:35:01.427022",
  "title": "The two breeds of the American Liberal",
  "date_display": "September 9, 2008",
  "date_iso": "2008-09-09T08:52:00+00:00",
  "date_from_url": "2008-09-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ace of Spades nails why normal people, even those who aren’t conservative and don’t have much use for conservatives, <a href=\"http://ace.mu.nu/archives/272407.php\">hate liberals</a>:</p><blockquote><p>Ultimately the liberals’ sin is their smugness. Not even so much because most people recoil from the assumption of superiority, both intellectual and moral, by those who have accomplished nothing exceptional in life except for reliably voting and “thinking” liberal, as if casting a vote the “correct” way slaps 30 points on to your IQs and counts for 100 hours of community service and child mentoring.  No, the main problem with that smugness, that belief that you’re sooo very fucking clever, is that you’re actually not particularly clever at all, and the great gap between your personal estimation of your intelligence and the actual real-world measure of it is wide enough to stumble into and take a painful fall.</p></blockquote><p>This is insightful and points to an idiosyncracy of American society that I touched upon tangentially in <i>The Irrational Atheist</i>.  John Edwards talked of Two Americas, but there are actually Two American Liberalisms.  One is highly educated, wealthier, and more intelligent than the norm, the other is distinctly uneducated, poor, and less intelligent.  The latter group is also significantly larger than the former, by a factor that ranges somewhere between 4x to 20x depending upon where you place the limits on either side.</p><p>Here’s the relevant passage: <i>“While Democrats are heavily favored by highly educated individuals… the party’s support from society’s least-educated individuals is not only every bit as strong, but is more electorally important. Voters with postgraduate schooling were only 25 percent more likely to vote for the Democratic Party presidential candidate in 2004 while those who did not complete high school were 90 percent more likely to identify themselves as Democrats.  Since there are 75 percent more Americans who have never completed high school (16.4 percent of adults over twenty-five) than who possess an advanced degree (9.4 percent) this means that despite their reputation for being the party of the most highly educated, Democrats are nevertheless more than twice as likely to be someone who has dropped out of high school than to be an individual with a master’s degree.</i></p><p>There’s actually more Republicans with college degrees than Democrats; college grads voted for Bush 52-46 in 2004.  Also, as a reader pointed out recently, it’s important to keep in mind that the most-educated group is only an approximation for the most-intelligent group.  Since as been previously shown, those majoring in education are the very least intelligent of the college-educated – with an estimated average IQ of 91 – the large numbers of M.Ed.- and D. Ed.-holders who disproportionately lean Democrat further reduces the number of genuinely intelligent individuals in that most-educated 9.4 percent of the population.  That factor probably isn’t enough to entirely make up for the 25-percent Democrat advantage, but does reduce it significantly.</p><p>So, the upshot is that there is a relatively small number of intelligent people and a much larger number of unintelligent people holding the same political views.  This latter group has a very strong tendency to believe they are themselves intelligent because they share those views, when the truth is that they merely happen to be rooting for the same team.  I don’t think even the average member of the more numerous group would assume that because a child with surplus chromosomes living in St. Paul supports the Vikings, he is as intelligent as a member of Mensa who also happens to be a lifelong Purple devotee.  And yet, most Democrats seriously believe they are more intelligent than Republicans solely because they support the same political team as their intellectual superiors of the same stripe, even though it’s obvious that they are, as a matter of empirically established fact, markedly LESS intelligent than the supporters of the other side.</p><p>That’s the reality.  Now, for the implications that Ace mentions. Think about how many people react poorly to my arrogant flaunting of my intelligence.  Even some of those who are in ideological accord with me and find my reasoning to be remarkably astute loathe it.  Those who tend to disagree with me hate it so much that they often find it outrageously provocative that I mention my Mensa membership in my WND bio, which I always find highly amusing since that ever-so-lofty threshhold is more than an SD below my tested IQ.  It’s a gauntlet of contempt hurled in the face of the reader, so it’s no surprise that many should find it off-putting even though I reliably back it up.</p><p>Consider, then, the probable reaction of the normal individual to a similar attitude copped by someone with sub-standard intelligence, and then think about how unconvincing he would find any arguments presented by such an irritatingly clueless idiot.  This is why the smugness and conceit of both Democratic politicians and grass-roots Democrats alike is so off-putting, not only to Republicans but also to independents and third-party people like me; it’s like being lectured about mathematics by someone who has never heard of algebra or geometry, but is inordinately proud of his ability to multiply two numbers and assumes that you’re still getting by with addition.</p><p>By way of example, I give you John Scalzi – a High Democrat of the First American Liberalism – <a href=\"http://scalzi.com/whatever/?p=1649\">attempting to lecture the hysterical Low Democrats of the Second American Liberalism about the basic realities of American politics</a> at the most public level.  While his analysis isn’t quite correct – Obama can’t and won’t argue on the real issues since he and McCain are practically identical on everything from nationalizing housing to immigration and adventures abroad – he’s entirely right to tell them to grow up and realize that Obama was never going to be wafted into the White House on the strength of his pure heart, his magical negritude and the adoration of the masses.</p><p>For another example, consider how the more scorn the Democrats pour on Sarah Palin, <a href=\"http://www.gallup.com/poll/110137/McCain-Now-Winning-Majority-Independents.aspx\">the more independents move towards McCain</a>.  If McCain can maintain a strong advantage among independents, the election is over.</p></div>",
  "content_text": "Ace of Spades nails why normal people, even those who aren’t conservative and don’t have much use for conservatives,\nhate liberals\n:\nUltimately the liberals’ sin is their smugness. Not even so much because most people recoil from the assumption of superiority, both intellectual and moral, by those who have accomplished nothing exceptional in life except for reliably voting and “thinking” liberal, as if casting a vote the “correct” way slaps 30 points on to your IQs and counts for 100 hours of community service and child mentoring.  No, the main problem with that smugness, that belief that you’re sooo very fucking clever, is that you’re actually not particularly clever at all, and the great gap between your personal estimation of your intelligence and the actual real-world measure of it is wide enough to stumble into and take a painful fall.\nThis is insightful and points to an idiosyncracy of American society that I touched upon tangentially in\nThe Irrational Atheist\n.  John Edwards talked of Two Americas, but there are actually Two American Liberalisms.  One is highly educated, wealthier, and more intelligent than the norm, the other is distinctly uneducated, poor, and less intelligent.  The latter group is also significantly larger than the former, by a factor that ranges somewhere between 4x to 20x depending upon where you place the limits on either side.\nHere’s the relevant passage:\n“While Democrats are heavily favored by highly educated individuals… the party’s support from society’s least-educated individuals is not only every bit as strong, but is more electorally important. Voters with postgraduate schooling were only 25 percent more likely to vote for the Democratic Party presidential candidate in 2004 while those who did not complete high school were 90 percent more likely to identify themselves as Democrats.  Since there are 75 percent more Americans who have never completed high school (16.4 percent of adults over twenty-five) than who possess an advanced degree (9.4 percent) this means that despite their reputation for being the party of the most highly educated, Democrats are nevertheless more than twice as likely to be someone who has dropped out of high school than to be an individual with a master’s degree.\nThere’s actually more Republicans with college degrees than Democrats; college grads voted for Bush 52-46 in 2004.  Also, as a reader pointed out recently, it’s important to keep in mind that the most-educated group is only an approximation for the most-intelligent group.  Since as been previously shown, those majoring in education are the very least intelligent of the college-educated – with an estimated average IQ of 91 – the large numbers of M.Ed.- and D. Ed.-holders who disproportionately lean Democrat further reduces the number of genuinely intelligent individuals in that most-educated 9.4 percent of the population.  That factor probably isn’t enough to entirely make up for the 25-percent Democrat advantage, but does reduce it significantly.\nSo, the upshot is that there is a relatively small number of intelligent people and a much larger number of unintelligent people holding the same political views.  This latter group has a very strong tendency to believe they are themselves intelligent because they share those views, when the truth is that they merely happen to be rooting for the same team.  I don’t think even the average member of the more numerous group would assume that because a child with surplus chromosomes living in St. Paul supports the Vikings, he is as intelligent as a member of Mensa who also happens to be a lifelong Purple devotee.  And yet, most Democrats seriously believe they are more intelligent than Republicans solely because they support the same political team as their intellectual superiors of the same stripe, even though it’s obvious that they are, as a matter of empirically established fact, markedly LESS intelligent than the supporters of the other side.\nThat’s the reality.  Now, for the implications that Ace mentions. Think about how many people react poorly to my arrogant flaunting of my intelligence.  Even some of those who are in ideological accord with me and find my reasoning to be remarkably astute loathe it.  Those who tend to disagree with me hate it so much that they often find it outrageously provocative that I mention my Mensa membership in my WND bio, which I always find highly amusing since that ever-so-lofty threshhold is more than an SD below my tested IQ.  It’s a gauntlet of contempt hurled in the face of the reader, so it’s no surprise that many should find it off-putting even though I reliably back it up.\nConsider, then, the probable reaction of the normal individual to a similar attitude copped by someone with sub-standard intelligence, and then think about how unconvincing he would find any arguments presented by such an irritatingly clueless idiot.  This is why the smugness and conceit of both Democratic politicians and grass-roots Democrats alike is so off-putting, not only to Republicans but also to independents and third-party people like me; it’s like being lectured about mathematics by someone who has never heard of algebra or geometry, but is inordinately proud of his ability to multiply two numbers and assumes that you’re still getting by with addition.\nBy way of example, I give you John Scalzi – a High Democrat of the First American Liberalism –\nattempting to lecture the hysterical Low Democrats of the Second American Liberalism about the basic realities of American politics\nat the most public level.  While his analysis isn’t quite correct – Obama can’t and won’t argue on the real issues since he and McCain are practically identical on everything from nationalizing housing to immigration and adventures abroad – he’s entirely right to tell them to grow up and realize that Obama was never going to be wafted into the White House on the strength of his pure heart, his magical negritude and the adoration of the masses.\nFor another example, consider how the more scorn the Democrats pour on Sarah Palin,\nthe more independents move towards McCain\n.  If McCain can maintain a strong advantage among independents, the election is over.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-09T07:52:00+00:00"
}