{
  "url": "https://voxday.net/2008/09/13/tweedledum-and-tweedledummer/",
  "scraped_at": "2026-01-08T22:35:14.920595",
  "title": "Tweedledum and Tweedledummer",
  "date_display": "September 13, 2008",
  "date_iso": "2008-09-13T08:23:00+00:00",
  "date_from_url": "2008-09-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Few have ever been under any illusion that John McCain was a particularly brilliant individual.  He graduated towards the bottom of his Naval Academy class, 894th out of 899, but then, one has to be quite intelligent to get into the Naval Academy in the first place, even as a legacy with heavy hitters behind you.  And once one is in, one has to have the intellectual firepower to survive there; the heavy hitters don’t do a plebe any good once he’s at Annapolis.</p><p>This isn’t a theoretical statement either.  I have a friend who didn’t make it there despite having more heavy hitters behind him than John McCain.  And that friend has more than enough brainpower to burn; like most things, success usually requires as much determination as capacity.</p><p>Ivy League institutions, on the other hand, have been practicing aggressive affirmative action for decades.  If Yale and Harvard degrees aren’t enough to protect George Bush, with his 1206 SAT, from accusations of stupidity, Columbia and Harvard degrees can’t be sufficient to protect Obama from the same, especially in light of the suspicious way in which his test scores are mysteriously unavailable to the public.  In short, the logical conclusion is that while Obama doesn’t actually have a two-digit IQ, he’s far less intelligent than most people who have made it to his level, and far less bright than most people assume on the basis of his sheepskins.</p><p>While an accomplished speaker from texts, Obama isn’t articulate, in fact, he’s actually worse than George w. Bush, who has impressive elocution issues.  It’s becomingly increasingly obvious that Obama is thin-skinned and petty; his response to the poorly-targeted attacks on Palin and McCain has not been to stop and rethink his failed strategy, but rather to amp up the volume.  His campaign is committing weekly self-disembowelments, the most recent being <a href=\"http://corner.nationalreview.com/post/?q=OTliMTNiZjg5ZDEwZWNiZDYwZWFjN2JlNjNjNjkxZmM=\">an attempt to completely turn off all the elderly voters</a> – the most reliable voters in the electorate – by accusing John McCain of not knowing how to email.  Setting aside the total tactical pointlessness of an attack that is at best meaningless to anyone who isn’t a 15-year old girl, it also reveals a total failure to do even the most elementary research considering that McCain has a pretty good excuse for not using email – he can’t type due to the torture he received in Vietnam.</p><p>It is remotely possible that Obama isn’t an affirmative action beneficiary.  We don’t know – we can’t know – until he proves otherwise by releasing his test scores to the media.  However, there is an increasing and near-conclusive body of evidence that indicates Obama not only isn’t experienced enough to be president, he probably isn’t even smart enough to be president.</p><p>Which, of course, is precisely why I’m hoping the American electorate is dumb enough to choose the magical negritude of Tweedledummer.  Since Americans collectively have negligible interest in anything that might help them avoid their societal plunge off the cliff, I’m primarily looking to see them maximize my entertainment experience.</p><p>UPDATE – Ace of Spades discovers <a href=\"http://corner.nationalreview.com/post/?q=MzQ1NTU5MTYyNTk0ODVkZGMzODY0MTVkZTNhZTRjMjQ=\">a Forbes article</a> that shows the “doesn’t know how to use a computer” ad called “Still” is even dumber than it appeared at second glance: <i>“In certain ways, McCain was a natural Web candidate. <b>Chairman of the Senate Telecommunications Subcommittee and regarded as the U.S. Senate’s savviest technologist</b>, McCain is an inveterate devotee of email. His nightly ritual is to read his email together with his wife, Cindy. The injuries he incurred as a Vietnam POW make it painful for McCain to type. Instead, he dictates responses that his wife types on a laptop.”</i></p><p>Attacking the opponent’s strength works for Bill Belicheat because he’s a football genius.  It’s clearly not going to work for an affirmative action presidential candidate too dumb to even realize he’s doing it.</p></div>",
  "content_text": "Few have ever been under any illusion that John McCain was a particularly brilliant individual.  He graduated towards the bottom of his Naval Academy class, 894th out of 899, but then, one has to be quite intelligent to get into the Naval Academy in the first place, even as a legacy with heavy hitters behind you.  And once one is in, one has to have the intellectual firepower to survive there; the heavy hitters don’t do a plebe any good once he’s at Annapolis.\nThis isn’t a theoretical statement either.  I have a friend who didn’t make it there despite having more heavy hitters behind him than John McCain.  And that friend has more than enough brainpower to burn; like most things, success usually requires as much determination as capacity.\nIvy League institutions, on the other hand, have been practicing aggressive affirmative action for decades.  If Yale and Harvard degrees aren’t enough to protect George Bush, with his 1206 SAT, from accusations of stupidity, Columbia and Harvard degrees can’t be sufficient to protect Obama from the same, especially in light of the suspicious way in which his test scores are mysteriously unavailable to the public.  In short, the logical conclusion is that while Obama doesn’t actually have a two-digit IQ, he’s far less intelligent than most people who have made it to his level, and far less bright than most people assume on the basis of his sheepskins.\nWhile an accomplished speaker from texts, Obama isn’t articulate, in fact, he’s actually worse than George w. Bush, who has impressive elocution issues.  It’s becomingly increasingly obvious that Obama is thin-skinned and petty; his response to the poorly-targeted attacks on Palin and McCain has not been to stop and rethink his failed strategy, but rather to amp up the volume.  His campaign is committing weekly self-disembowelments, the most recent being\nan attempt to completely turn off all the elderly voters\n– the most reliable voters in the electorate – by accusing John McCain of not knowing how to email.  Setting aside the total tactical pointlessness of an attack that is at best meaningless to anyone who isn’t a 15-year old girl, it also reveals a total failure to do even the most elementary research considering that McCain has a pretty good excuse for not using email – he can’t type due to the torture he received in Vietnam.\nIt is remotely possible that Obama isn’t an affirmative action beneficiary.  We don’t know – we can’t know – until he proves otherwise by releasing his test scores to the media.  However, there is an increasing and near-conclusive body of evidence that indicates Obama not only isn’t experienced enough to be president, he probably isn’t even smart enough to be president.\nWhich, of course, is precisely why I’m hoping the American electorate is dumb enough to choose the magical negritude of Tweedledummer.  Since Americans collectively have negligible interest in anything that might help them avoid their societal plunge off the cliff, I’m primarily looking to see them maximize my entertainment experience.\nUPDATE – Ace of Spades discovers\na Forbes article\nthat shows the “doesn’t know how to use a computer” ad called “Still” is even dumber than it appeared at second glance:\n“In certain ways, McCain was a natural Web candidate.\nChairman of the Senate Telecommunications Subcommittee and regarded as the U.S. Senate’s savviest technologist\n, McCain is an inveterate devotee of email. His nightly ritual is to read his email together with his wife, Cindy. The injuries he incurred as a Vietnam POW make it painful for McCain to type. Instead, he dictates responses that his wife types on a laptop.”\nAttacking the opponent’s strength works for Bill Belicheat because he’s a football genius.  It’s clearly not going to work for an affirmative action presidential candidate too dumb to even realize he’s doing it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-13T07:23:00+00:00"
}