{
  "url": "https://voxday.net/2008/09/02/two-birds-one-stone-2/",
  "scraped_at": "2026-01-08T22:34:24.845376",
  "title": "Two birds, one stone",
  "date_display": "September 2, 2008",
  "date_iso": "2008-09-02T09:41:00+00:00",
  "date_from_url": "2008-09-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which both the inherently unreliable nature of science and the declining probability of anthropogenic global warming <a href=\"http://www.dailytech.com/Sun+Makes+History+First+Spotless+Month+in+a+Century/article12823.htm\">are demonstrated</a>:</p><blockquote><p>The sun has reached a milestone not seen for nearly 100 years: an entire month has passed without a single visible sunspot being noted.  The event is significant as many climatologists now believe solar magnetic activity – which determines the number of sunspots — is an influencing factor for climate on earth….</p><p>In 2005, a pair of astronomers from the National Solar Observatory (NSO) in Tucson attempted to publish a paper in the journal Science. The pair looked at minute spectroscopic and magnetic changes in the sun. By extrapolating forward, they reached the startling result that, within 10 years, sunspots would vanish entirely. At the time, the sun was very active. Most of their peers laughed at what they considered an unsubstantiated conclusion.</p><p>The journal ultimately rejected the paper as being too controversial.</p></blockquote><p>Scientists like to consider themselves more educated and more intelligent than the great unwashed who know nothing about science.  This is, for the most part, true.  But they save their real dislike for those non-scientists who are not only more intelligent than most scientists, but are sufficiently educated about science to point out the inconvenient fact that the inherently unstable – or “dynamic”, if you prefer – nature of science renders it frequently unreliable and therefore useless as a tool in matters outside science.</p><p>For example, there are still many scientists who say that the Earth is warming despite the fact that it has been getting colder over the last decade and there is a valid theory based on empirical observation which suggests it will continue to do so for some time.  All decisions made on the unsound basis of the former consensus would have probably been incorrect, and the absence of a current consensus renders all of the related science of zero value at this particular point in time.</p><p>As with many things, the human variable renders science far less useful than it might otherwise be, and it’s profoundly dishonest for scientists to pretend that the human variable is not there.  Scientists like to brag that science is self-correcting, which is largely true over time but is also a confession that it can be completely unreliable at any single point in time.  This doesn’t make the entire endeavor worthless, but it does mean that science always has to be examined with a much more skeptical eye than most scientists are usually willing to endure.</p><p>UPDATE – A Slashdot commenter sums it up reasonably well: <i>“The reality is that scientific “proof” consists of general agreement among communities of people about the interpretation of observed phenomena, and that agreement can be driven by MANY factors, not just how well the data fits. One CANNOT get to the level of mathematical proof. So there will always be a role for skeptics, and those that just won’t accept that, if you have a square peg and a round hole, you just pretend the peg’s squareness doesn’t exist, because it MUST fit into the round hole.</i>“</p></div>",
  "content_text": "In which both the inherently unreliable nature of science and the declining probability of anthropogenic global warming\nare demonstrated\n:\nThe sun has reached a milestone not seen for nearly 100 years: an entire month has passed without a single visible sunspot being noted.  The event is significant as many climatologists now believe solar magnetic activity – which determines the number of sunspots — is an influencing factor for climate on earth….\nIn 2005, a pair of astronomers from the National Solar Observatory (NSO) in Tucson attempted to publish a paper in the journal Science. The pair looked at minute spectroscopic and magnetic changes in the sun. By extrapolating forward, they reached the startling result that, within 10 years, sunspots would vanish entirely. At the time, the sun was very active. Most of their peers laughed at what they considered an unsubstantiated conclusion.\nThe journal ultimately rejected the paper as being too controversial.\nScientists like to consider themselves more educated and more intelligent than the great unwashed who know nothing about science.  This is, for the most part, true.  But they save their real dislike for those non-scientists who are not only more intelligent than most scientists, but are sufficiently educated about science to point out the inconvenient fact that the inherently unstable – or “dynamic”, if you prefer – nature of science renders it frequently unreliable and therefore useless as a tool in matters outside science.\nFor example, there are still many scientists who say that the Earth is warming despite the fact that it has been getting colder over the last decade and there is a valid theory based on empirical observation which suggests it will continue to do so for some time.  All decisions made on the unsound basis of the former consensus would have probably been incorrect, and the absence of a current consensus renders all of the related science of zero value at this particular point in time.\nAs with many things, the human variable renders science far less useful than it might otherwise be, and it’s profoundly dishonest for scientists to pretend that the human variable is not there.  Scientists like to brag that science is self-correcting, which is largely true over time but is also a confession that it can be completely unreliable at any single point in time.  This doesn’t make the entire endeavor worthless, but it does mean that science always has to be examined with a much more skeptical eye than most scientists are usually willing to endure.\nUPDATE – A Slashdot commenter sums it up reasonably well:\n“The reality is that scientific “proof” consists of general agreement among communities of people about the interpretation of observed phenomena, and that agreement can be driven by MANY factors, not just how well the data fits. One CANNOT get to the level of mathematical proof. So there will always be a role for skeptics, and those that just won’t accept that, if you have a square peg and a round hole, you just pretend the peg’s squareness doesn’t exist, because it MUST fit into the round hole.\n“",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-02T08:41:00+00:00"
}