{
  "url": "https://voxday.net/2008/09/09/where-are-game-critics/",
  "scraped_at": "2026-01-08T22:35:05.078519",
  "title": "Wherefore art the critics?",
  "date_display": "September 9, 2008",
  "date_iso": "2008-09-09T19:48:00+00:00",
  "date_from_url": "2008-09-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Scalzi offers <a href=\"http://scalzi.com/whatever/?p=1651\">six reasons there are no serious critics of electronic games</a>:</p><blockquote><p><b>You actually have to be able to play the video games.</b> Useful and valid criticism requires some academic knowledge of the field you want to criticize. But once you’ve got that, the input portion of criticism is generally pretty easy: With film, you (primarily) watch with your eyes. With music, you (primarily) listen with your ears. You’re done. Video games, however, require an additional skill, and that is to be able to play the game. Therein lies a problem: The hermeneutics of video games require a whole lot of button-mashing. How many critics are both able to get through a boss level and tell you what it means as a social construct? In the future, probably a lot. At the moment: Not so many.</p></blockquote><p>I’d add seventh and eighth reasons: the reason you’ll never see any great game reviewers or critics is because once one establishes enough of a reputation, some developer or publisher is going to want to get you on their team. Perhaps that hypothetical critic will prefer to criticize, but few guys who love games would turn down the opportunity to make them even if the money weren’t considerably better.  And few gamers – or even game developers these days – have the encyclopedic knowledge of games that most film critics possess of movies.</p></div>",
  "content_text": "John Scalzi offers\nsix reasons there are no serious critics of electronic games\n:\nYou actually have to be able to play the video games.\nUseful and valid criticism requires some academic knowledge of the field you want to criticize. But once you’ve got that, the input portion of criticism is generally pretty easy: With film, you (primarily) watch with your eyes. With music, you (primarily) listen with your ears. You’re done. Video games, however, require an additional skill, and that is to be able to play the game. Therein lies a problem: The hermeneutics of video games require a whole lot of button-mashing. How many critics are both able to get through a boss level and tell you what it means as a social construct? In the future, probably a lot. At the moment: Not so many.\nI’d add seventh and eighth reasons: the reason you’ll never see any great game reviewers or critics is because once one establishes enough of a reputation, some developer or publisher is going to want to get you on their team. Perhaps that hypothetical critic will prefer to criticize, but few guys who love games would turn down the opportunity to make them even if the money weren’t considerably better.  And few gamers – or even game developers these days – have the encyclopedic knowledge of games that most film critics possess of movies.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-09-09T18:48:00+00:00"
}