{
  "url": "https://voxday.net/2018/06/23/a-glorious-cultural-heritage/",
  "scraped_at": "2025-12-19T21:08:08.013839",
  "title": "A glorious cultural heritage",
  "date_display": "June 23, 2018",
  "date_iso": "2018-06-23T13:15:46+00:00",
  "date_from_url": "2018-06-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That’s what I tell SJWs before they make their architectural contributions to my abode. I like to think that it helps them feel <a href=\"https://www.sciencemag.org/news/2018/06/feeding-gods-hundreds-skulls-reveal-massive-scale-human-sacrifice-aztec-capital\">a part of something bigger</a> than themselves:</p><blockquote><p>Some conquistadors wrote about the <i>tzompantli </i>and its towers, estimating that the rack alone contained 130,000 skulls. But historians and archaeologists knew the conquistadors were prone to exaggerating the horrors of human sacrifice to demonize the Mexica culture. As the centuries passed, scholars began to wonder whether the tzompantli had ever existed.</p><p>Archaeologists at the National Institute of Anthropology and History (INAH) here can now say with certainty that it did. Beginning in 2015, they discovered and excavated the remains of the skull rack and one of the towers underneath a colonial period house on the street that runs behind Mexico City’s cathedral. (The other tower, they suspect, lies under the cathedral’s back courtyard.) The scale of the rack and tower suggests they held thousands of skulls, testimony to an industry of human sacrifice unlike any other in the world. Now, archaeologists are beginning to study the skulls in detail, hoping to learn more about Mexica rituals and the postmortem treatment of the bodies of the sacrificed. The researchers also wonder who the victims were, where they lived, and what their lives were like before they ended up marked for a brutal death at the Templo Mayor.</p><p>“This is a world of information,” says archaeologist Raùl Barrera Rodríguez, director of INAH’s Urban Archaeology Program and leader of the team that found the tzompantli. “It’s an amazing thing, and just the kind of discovery many of us had hoped for,” agrees John Verano, a bioarchaeologist at Tulane University in New Orleans, Louisiana, who studies human sacrifice. He and other researchers hope the skulls will clarify the role of large-scale human sacrifice in Mexica religion and culture—and whether, as scholars suspect, it played a key part in building their empire.</p></blockquote><p>It’s always good to know that one is maintaining a long-standing historical tradition. It also tends to put a new spin on the Mexican reverence for La Señora de la Santa Muerte.</p></div>",
  "content_text": "That’s what I tell SJWs before they make their architectural contributions to my abode. I like to think that it helps them feel\na part of something bigger\nthan themselves:\nSome conquistadors wrote about the\ntzompantli\nand its towers, estimating that the rack alone contained 130,000 skulls. But historians and archaeologists knew the conquistadors were prone to exaggerating the horrors of human sacrifice to demonize the Mexica culture. As the centuries passed, scholars began to wonder whether the tzompantli had ever existed.\nArchaeologists at the National Institute of Anthropology and History (INAH) here can now say with certainty that it did. Beginning in 2015, they discovered and excavated the remains of the skull rack and one of the towers underneath a colonial period house on the street that runs behind Mexico City’s cathedral. (The other tower, they suspect, lies under the cathedral’s back courtyard.) The scale of the rack and tower suggests they held thousands of skulls, testimony to an industry of human sacrifice unlike any other in the world. Now, archaeologists are beginning to study the skulls in detail, hoping to learn more about Mexica rituals and the postmortem treatment of the bodies of the sacrificed. The researchers also wonder who the victims were, where they lived, and what their lives were like before they ended up marked for a brutal death at the Templo Mayor.\n“This is a world of information,” says archaeologist Raùl Barrera Rodríguez, director of INAH’s Urban Archaeology Program and leader of the team that found the tzompantli. “It’s an amazing thing, and just the kind of discovery many of us had hoped for,” agrees John Verano, a bioarchaeologist at Tulane University in New Orleans, Louisiana, who studies human sacrifice. He and other researchers hope the skulls will clarify the role of large-scale human sacrifice in Mexica religion and culture—and whether, as scholars suspect, it played a key part in building their empire.\nIt’s always good to know that one is maintaining a long-standing historical tradition. It also tends to put a new spin on the Mexican reverence for La Señora de la Santa Muerte.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-23T12:15:46+00:00"
}