{
  "url": "https://voxday.net/2018/06/08/audiobook-the-missionaries/",
  "scraped_at": "2025-12-19T21:05:48.381853",
  "title": "AUDIOBOOK: The Missionaries",
  "date_display": "June 8, 2018",
  "date_iso": "2018-06-08T11:43:20+00:00",
  "date_from_url": "2018-06-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/oMuDnn8lBNA\" width=\"512\"></iframe></div><div style=\"text-align: center;\"></div><p>This may very well be the greatest audiobook ever produced. I’m not kidding. It’s right up there with Douglas Adams reading his own <i>The Long Dark Tea-Time of the Soul</i>. Owen Stanley’s satirical novel is brilliant, of course, alternating between darkly and ridiculously funny, but Gabrielle Miller’s narration, in her unique Australian accent, takes it to a new level of hilarity. I guarantee <a href=\"https://www.amazon.com/The-Missionaries/dp/B07DHTLSM5\">the way she does Roger Fletcher’s sneering laugh</a> will crack you up, and her effortless switching between the roughneck and posh accents is spot-on.</p><p>And if you think you recognize the voice, let’s just say that you do and leave it at that.</p><p><i><a href=\"https://www.amazon.com/The-Missionaries/dp/B07DHTLSM5\"><b>THE MISSIONARIES</b></a></i> is six hours and 41 minutes. You will not want to miss it. It’s that good.</p></div>",
  "content_text": "This may very well be the greatest audiobook ever produced. I’m not kidding. It’s right up there with Douglas Adams reading his own\nThe Long Dark Tea-Time of the Soul\n. Owen Stanley’s satirical novel is brilliant, of course, alternating between darkly and ridiculously funny, but Gabrielle Miller’s narration, in her unique Australian accent, takes it to a new level of hilarity. I guarantee\nthe way she does Roger Fletcher’s sneering laugh\nwill crack you up, and her effortless switching between the roughneck and posh accents is spot-on.\nAnd if you think you recognize the voice, let’s just say that you do and leave it at that.\nTHE MISSIONARIES\nis six hours and 41 minutes. You will not want to miss it. It’s that good.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-08T10:43:20+00:00"
}