{
  "url": "https://voxday.net/2018/06/01/chinese-lasers-already-have-impact/",
  "scraped_at": "2025-12-19T21:04:55.278279",
  "title": "Chinese lasers already have impact",
  "date_display": "June 1, 2018",
  "date_iso": "2018-06-01T22:31:56+00:00",
  "date_from_url": "2018-06-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>They can’t actually take down a fast-moving fighter yet, but Chinese lasers are already <a href=\"https://www.dailystar.co.uk/news/world-news/706636/china-lasers-kazakhstan-asia-silent-killer-united-states-news\">inhibiting US aeriel movement</a>:</p><blockquote><p>Chinese company Poly Technologies showed off its new bit of next-age tech at a military exhibition in Kazakhstan this week. The “Silent Killer” laser is able to obliterate unmanned drones from about 328 yards away. It is, however, only able to target slow-moving, low-flying, and small-sized targets.</p><p>Silent killer’s lasers are also able to jam incoming electronic attacks, effectively making an hack attempt impossible. The weapon is capable of being mounted onto mobile vehicles as well as warships, according to its developers.</p><p>The advancement in laser technology comes just weeks after US military chiefs warned fighter jet pilots to “use extreme caution” near a Chinese base.  It later emerged high-powered lasers were in operation at the facility.</p></blockquote><p>As I have repeatedly pointed out since we published <i>Riding the Red Horse</i>, US air supremacy probably has less than a decade left. This will have considerable implications for US foreign policy, and likely explains the push for obtaining military superiority in space on the part of both the US and the Chinese militaries.</p></div>",
  "content_text": "They can’t actually take down a fast-moving fighter yet, but Chinese lasers are already\ninhibiting US aeriel movement\n:\nChinese company Poly Technologies showed off its new bit of next-age tech at a military exhibition in Kazakhstan this week. The “Silent Killer” laser is able to obliterate unmanned drones from about 328 yards away. It is, however, only able to target slow-moving, low-flying, and small-sized targets.\nSilent killer’s lasers are also able to jam incoming electronic attacks, effectively making an hack attempt impossible. The weapon is capable of being mounted onto mobile vehicles as well as warships, according to its developers.\nThe advancement in laser technology comes just weeks after US military chiefs warned fighter jet pilots to “use extreme caution” near a Chinese base.  It later emerged high-powered lasers were in operation at the facility.\nAs I have repeatedly pointed out since we published\nRiding the Red Horse\n, US air supremacy probably has less than a decade left. This will have considerable implications for US foreign policy, and likely explains the push for obtaining military superiority in space on the part of both the US and the Chinese militaries.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-01T21:31:56+00:00"
}