{
  "url": "https://voxday.net/2018/06/23/convicted-by-his-own-words/",
  "scraped_at": "2025-12-19T21:08:11.685869",
  "title": "Convicted by his own words",
  "date_display": "June 23, 2018",
  "date_iso": "2018-06-23T18:58:17+00:00",
  "date_from_url": "2018-06-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Before he kicks off and joins his father the Devil in Hell, George Soros appears to be desperately funding what is certain to be a futile media campaign to clear his name of the Nazi collaboration that he publicly admitted himself on multiple occasions. Even the likes of Joe Rogan have been trying to defend the elderly Luciferian, to no avail, as <a href=\"https://youtu.be/kXQHx4hA6YI?t=744\">Alex Jones bitchslaps Rogan</a> for adopting the globalist’s false narrative.</p><p>The historical fact is that there is <u>no question whatsoever</u> that George Soros genuinely was a Nazi collaborator as a young man. He is a self-admitted Nazi collaborator, who freely volunteered that he found the experience to have been a positive and exhilarating one. Any claim or assertion that he was not a Nazi collaborator is a deliberate falsehood and should be called out immediately. The absurd thing about this historical revisionism is that in addition to all of the existing video evidence, the Hungarian government, which is obviously no friend to Soros, possesses all the relevant records.</p><p>Consider the evidence:</p><p><b>Soros: </b>It was actually probably the happiest year of my life, that year of German occupation for me, it’s a very positive experience. It’s a strange thing because you see incredible suffering around you, and, and in fact you are in considerable danger yourself, but if you’re 14 years old and you don’t<br>believe that it can actually touch you, you have a belief in yourself, your belief in your father. It’s a very happy-making, exhilarating experience.</br></p><p><b>Reporter:</b> <i>While hundreds of thousands of Hungarian Jews were being shipped off to the death camps George Soros accompanied this phony godfather on his appointed rounds, confiscating property from the Jews.</i></p><p><b>Voiceover: </b><i>these are pictures from 1944 of what happened to George Soros his friends and neighbors</i></p><p><b>Reporter:</b> <i>You’re a Hungarian Jew </i></p><p><b>Soros:</b> Mm hmm</p><p><b>Reporter:</b> <i>who escaped the Holocaust</i></p><p><b>Soros:</b> Mm hmm</p><p><b>Reporter:</b> <i>by posing as a Christian.</i></p><p><b>Soros:</b> Right.</p><p><b>Reporter:</b> <i>and you watched lots of people get shipped off to the death camp.</i></p><p><b>Soros:</b> Right. I was 14 years old and I would say that that’s when my character was made.</p><p><b>Reporter:</b> <i>In what way?</i></p><p><b>Soros: </b>That one should think ahead one should to understand, and, and anticipate events, and one, one is threatened, it was a tremendous threat of evil, I mean, it was a very personal experience of evil.</p><p><b>Reporter:</b> <i>My understanding is is that you went out with this protector of yours who swore that you were his adopted guy, so- </i></p><p><b>Soros: </b>Yes, yes.</p><p><b>Reporter: </b><i>And helped in the confiscation of property from the Jews.</i></p><p><b>Soros:</b> That’s right, yes.</p><p><b>Reporter:</b> <i>I mean that’s that sounds like an experience that would send lots of people to the psychiatric couch for many many years. Was it difficult?</i></p><p><b>Soros: </b>Not at all, not at all. It may be as a child you don’t, you don’t see the connection, but it was, it created no, no problem at all.</p><p><b>Reporter:</b> <i>No feeling of guilt? I know, for example, that I’m Jewish, and here I am watching these people go… I could just as easily be there… I should be there… none of that?</i><br><i><br/></i>I note that by the standards of Soros’s own tribe, 14 is <u>not</u> a child. According to Jewish law, when Jewish boys become 13 years old, they become accountable for their actions. It is entirely correct to hold Soros accountable for his, particularly when he is actively attempting to subvert entire nations and systems of government.</br></p><p>UPDATE: Apparently Soros has changed his mind about being indifferent to his reputation now that he is on the verge of facing the judgment of history without any ability to bribe or manipulate anyone. From a reader:</p><blockquote><p>Soros made his first fortune with the Quantum Fund, an operation he grew from a six million back in 1973 to the fortune he has now.  His partner in this operation was Jim Rogers, a bright workaholic from Alabama via Yale and Oxford.  Soros was the trader, Rogers was the analyst.  Rogers left the firm in 1980 after business differences.  The specifics were always a matter of some interest but never publicly clarified.</p><p>Until 2013, when Rogers wrote <i>Street Smarts: Adventures on the Road and in the Markets</i>.</p><p><i>He recalls how it came about:</i><br><i><br/></i><i>“That year the Securities and Exchange Commission investigated us over our investment in a company called Computer Sciences Corporation. The SEC claimed that my partner, George Soros, was engaged in stock manipulation.  He was charged with selling the stock short, only to cover his short sales by buying shares back at a lower price on the upcoming public offering. He was given the opportunity to sign a consent decree, in which he and the firm admitted to no wrong doing but promised not to do it again. Why would we agree to sign it? I asked him.  Why sign it if we did nothing wrong?  Why let it be construed that we were manipulating the stock?  I was taken aback by his answer- “Because that is what I was doing,” he said.</i><br><i><br/></i><i>‘George,’ I remember telling him, ‘my reputation  is worth more to me than a million dollars.’</i><br><i><br/></i><i>And I remember just as clearly his answer</i><br><i><br/></i><i>‘Not to me it’s not,’ he said.</i><br><i><br/></i><i>He said it jokingly, but he meant it;  that making the money was more important than anything else at stake in the transaction.”</i></br></br></br></br></br></p></blockquote></div>",
  "content_text": "Before he kicks off and joins his father the Devil in Hell, George Soros appears to be desperately funding what is certain to be a futile media campaign to clear his name of the Nazi collaboration that he publicly admitted himself on multiple occasions. Even the likes of Joe Rogan have been trying to defend the elderly Luciferian, to no avail, as\nAlex Jones bitchslaps Rogan\nfor adopting the globalist’s false narrative.\nThe historical fact is that there is\nno question whatsoever\nthat George Soros genuinely was a Nazi collaborator as a young man. He is a self-admitted Nazi collaborator, who freely volunteered that he found the experience to have been a positive and exhilarating one. Any claim or assertion that he was not a Nazi collaborator is a deliberate falsehood and should be called out immediately. The absurd thing about this historical revisionism is that in addition to all of the existing video evidence, the Hungarian government, which is obviously no friend to Soros, possesses all the relevant records.\nConsider the evidence:\nSoros:\nIt was actually probably the happiest year of my life, that year of German occupation for me, it’s a very positive experience. It’s a strange thing because you see incredible suffering around you, and, and in fact you are in considerable danger yourself, but if you’re 14 years old and you don’t\nbelieve that it can actually touch you, you have a belief in yourself, your belief in your father. It’s a very happy-making, exhilarating experience.\nReporter:\nWhile hundreds of thousands of Hungarian Jews were being shipped off to the death camps George Soros accompanied this phony godfather on his appointed rounds, confiscating property from the Jews.\nVoiceover:\nthese are pictures from 1944 of what happened to George Soros his friends and neighbors\nReporter:\nYou’re a Hungarian Jew\nSoros:\nMm hmm\nReporter:\nwho escaped the Holocaust\nSoros:\nMm hmm\nReporter:\nby posing as a Christian.\nSoros:\nRight.\nReporter:\nand you watched lots of people get shipped off to the death camp.\nSoros:\nRight. I was 14 years old and I would say that that’s when my character was made.\nReporter:\nIn what way?\nSoros:\nThat one should think ahead one should to understand, and, and anticipate events, and one, one is threatened, it was a tremendous threat of evil, I mean, it was a very personal experience of evil.\nReporter:\nMy understanding is is that you went out with this protector of yours who swore that you were his adopted guy, so-\nSoros:\nYes, yes.\nReporter:\nAnd helped in the confiscation of property from the Jews.\nSoros:\nThat’s right, yes.\nReporter:\nI mean that’s that sounds like an experience that would send lots of people to the psychiatric couch for many many years. Was it difficult?\nSoros:\nNot at all, not at all. It may be as a child you don’t, you don’t see the connection, but it was, it created no, no problem at all.\nReporter:\nNo feeling of guilt? I know, for example, that I’m Jewish, and here I am watching these people go… I could just as easily be there… I should be there… none of that?\nI note that by the standards of Soros’s own tribe, 14 is\nnot\na child. According to Jewish law, when Jewish boys become 13 years old, they become accountable for their actions. It is entirely correct to hold Soros accountable for his, particularly when he is actively attempting to subvert entire nations and systems of government.\nUPDATE: Apparently Soros has changed his mind about being indifferent to his reputation now that he is on the verge of facing the judgment of history without any ability to bribe or manipulate anyone. From a reader:\nSoros made his first fortune with the Quantum Fund, an operation he grew from a six million back in 1973 to the fortune he has now.  His partner in this operation was Jim Rogers, a bright workaholic from Alabama via Yale and Oxford.  Soros was the trader, Rogers was the analyst.  Rogers left the firm in 1980 after business differences.  The specifics were always a matter of some interest but never publicly clarified.\nUntil 2013, when Rogers wrote\nStreet Smarts: Adventures on the Road and in the Markets\n.\nHe recalls how it came about:\n“That year the Securities and Exchange Commission investigated us over our investment in a company called Computer Sciences Corporation. The SEC claimed that my partner, George Soros, was engaged in stock manipulation.  He was charged with selling the stock short, only to cover his short sales by buying shares back at a lower price on the upcoming public offering. He was given the opportunity to sign a consent decree, in which he and the firm admitted to no wrong doing but promised not to do it again. Why would we agree to sign it? I asked him.  Why sign it if we did nothing wrong?  Why let it be construed that we were manipulating the stock?  I was taken aback by his answer- “Because that is what I was doing,” he said.\n‘George,’ I remember telling him, ‘my reputation  is worth more to me than a million dollars.’\nAnd I remember just as clearly his answer\n‘Not to me it’s not,’ he said.\nHe said it jokingly, but he meant it;  that making the money was more important than anything else at stake in the transaction.”",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-23T17:58:17+00:00"
}