{
  "url": "https://voxday.net/2018/06/19/cucks-complain-about-media-sjws/",
  "scraped_at": "2025-12-19T21:07:20.343965",
  "title": "Cucks complain about media SJWs",
  "date_display": "June 19, 2018",
  "date_iso": "2018-06-19T08:45:52+00:00",
  "date_from_url": "2018-06-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Specifically, they complain about the media SJWs treating them and <a href=\"http://www.neoneocon.com/2018/06/18/open-season-on-jordan-peterson/\">the moderate leftists they admire</a> the way that they treat everyone to their Right.</p><blockquote><p>Jordan Peterson has become so effective a messenger—and not just in Canada—that it was inevitable that the MSM, the left, and academics (but I repeat myself) would put forth effort to discredit and discount him. So if you’ve been paying attention you’ll have noticed a recent spate of articles and statements saying just where he went so grievously wrong, how he draws his support from bigots and alt-righters (and/or is one himself), and fails to understand this or that or the other thing on which the critic/writer is an expert. Here’s a recent example of the latter (hat tip commenter Artfldgr), and there are plenty more of the former as well such as this one from NBC.</p><p>Watch that last video; it’s less than two minutes long, and it’s instructive—not about Peterson, but about the way the MSM approaches the topic of “explaining” him. Most of these hit pieces are relatively subtle, as is this one (“Who is Jordan Peterson, favorite figure of the alt-right”), which hardly talks about what Peterson actually says, gets some of that wrong when it does (beginning with saying he refuses to be pigeonholed and then offering as an example of that him speaking about an entirely different subject, his refusal to automatically use left-dictated pronouns for transgendered people), but quickly delivers its main message of “bigots love him, therefore he’s tainted.”</p><p>The goal is quite clearly to make him persona non grata to people who’ve never watched a video of his or read anything he’s written, making him so toxic that they will pigeonhole him (“alt-right bigot”) and never indulge whatever curiosity they might have by going to the source, Peterson. These pieces are not meant to actually inform; they’re meant to block any desire the listener might have to inform him/herself. After all, life is short, we have a finite amount of time here, and why waste it listening to a bigot or a figure beloved by bigots?</p></blockquote><p>It’s particularly funny to see how the readers of this “neo-neocon” promptly make use of the very same tactics to try to make me persona non grata when someone points out that I have shown Jordan Peterson to be an evil left-wing globalist charlatan.</p><blockquote><p>Johnny Ray:<br>Vox Day a true altrighty debunks JP on his blog as a fraud</br></p><p>om:<br>Oh noes, not Vox Day! As if Jordon Peterson has ever claimed to be of the alt-right. The left says it over and over, but saying a thing doesn’t make it so.</br></p><p>vanderleun:<br>Vox Day’s extreme jealousy of Peterson is transparent, vile and disgusting. He shows his true colors as an envious mental midget who is in love with only his own vapors. Basically, like the rotted pulp stuff he cranks out, he’s a comic book.</br></p></blockquote><p>First, the point isn’t that Jordan Peterson isn’t of the alt-right. He’s not. The point is that <i>he’s not of the Right at all</i>, his philosophy is evil, his logic is incoherent, and his advice is bad. As for the constant accusations of envy, I am no more jealous of the haunted, suicidal, godless, mentally unbalanced Peterson than I was of Richard Dawkins, Sam Harris, PZ Myers, or that little doughball Scalzi. Those who believe all criticism is rooted in jealousy always reveal more than they realize about themselves.</p><blockquote class=\"tr_bq\"><p>penngineer<br>I was lucky enough to see JBP in Nashville at the Ryman last week, and luckier still to meet him (I couldn’t afford a VIP ticket, but waiting outside the theater for a long time afterwards paid off!). He really IS everything that you would hope and expect him to be. His gaze is so intense when he makes eye contact with you, and you can really see the genuine warmth and compassion in his eyes. Truly a great man.</br></p></blockquote><p>These idiots genuinely deserve everything they are going to eventually experience. Sweet St. Darwin, but they are dumber than the dodos were. Because greatness truly depends upon the perception of compassion in one’s eyes.</p></div>",
  "content_text": "Specifically, they complain about the media SJWs treating them and\nthe moderate leftists they admire\nthe way that they treat everyone to their Right.\nJordan Peterson has become so effective a messenger—and not just in Canada—that it was inevitable that the MSM, the left, and academics (but I repeat myself) would put forth effort to discredit and discount him. So if you’ve been paying attention you’ll have noticed a recent spate of articles and statements saying just where he went so grievously wrong, how he draws his support from bigots and alt-righters (and/or is one himself), and fails to understand this or that or the other thing on which the critic/writer is an expert. Here’s a recent example of the latter (hat tip commenter Artfldgr), and there are plenty more of the former as well such as this one from NBC.\nWatch that last video; it’s less than two minutes long, and it’s instructive—not about Peterson, but about the way the MSM approaches the topic of “explaining” him. Most of these hit pieces are relatively subtle, as is this one (“Who is Jordan Peterson, favorite figure of the alt-right”), which hardly talks about what Peterson actually says, gets some of that wrong when it does (beginning with saying he refuses to be pigeonholed and then offering as an example of that him speaking about an entirely different subject, his refusal to automatically use left-dictated pronouns for transgendered people), but quickly delivers its main message of “bigots love him, therefore he’s tainted.”\nThe goal is quite clearly to make him persona non grata to people who’ve never watched a video of his or read anything he’s written, making him so toxic that they will pigeonhole him (“alt-right bigot”) and never indulge whatever curiosity they might have by going to the source, Peterson. These pieces are not meant to actually inform; they’re meant to block any desire the listener might have to inform him/herself. After all, life is short, we have a finite amount of time here, and why waste it listening to a bigot or a figure beloved by bigots?\nIt’s particularly funny to see how the readers of this “neo-neocon” promptly make use of the very same tactics to try to make me persona non grata when someone points out that I have shown Jordan Peterson to be an evil left-wing globalist charlatan.\nJohnny Ray:\nVox Day a true altrighty debunks JP on his blog as a fraud\nom:\nOh noes, not Vox Day! As if Jordon Peterson has ever claimed to be of the alt-right. The left says it over and over, but saying a thing doesn’t make it so.\nvanderleun:\nVox Day’s extreme jealousy of Peterson is transparent, vile and disgusting. He shows his true colors as an envious mental midget who is in love with only his own vapors. Basically, like the rotted pulp stuff he cranks out, he’s a comic book.\nFirst, the point isn’t that Jordan Peterson isn’t of the alt-right. He’s not. The point is that\nhe’s not of the Right at all\n, his philosophy is evil, his logic is incoherent, and his advice is bad. As for the constant accusations of envy, I am no more jealous of the haunted, suicidal, godless, mentally unbalanced Peterson than I was of Richard Dawkins, Sam Harris, PZ Myers, or that little doughball Scalzi. Those who believe all criticism is rooted in jealousy always reveal more than they realize about themselves.\npenngineer\nI was lucky enough to see JBP in Nashville at the Ryman last week, and luckier still to meet him (I couldn’t afford a VIP ticket, but waiting outside the theater for a long time afterwards paid off!). He really IS everything that you would hope and expect him to be. His gaze is so intense when he makes eye contact with you, and you can really see the genuine warmth and compassion in his eyes. Truly a great man.\nThese idiots genuinely deserve everything they are going to eventually experience. Sweet St. Darwin, but they are dumber than the dodos were. Because greatness truly depends upon the perception of compassion in one’s eyes.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-19T07:45:52+00:00"
}