{
  "url": "https://voxday.net/2018/06/18/darkstream-stripe-and-operation-chokepoint/",
  "scraped_at": "2025-12-19T21:07:11.154701",
  "title": "Darkstream: Stripe and Operation Chokepoint",
  "date_display": "June 18, 2018",
  "date_iso": "2018-06-18T11:03:21+00:00",
  "date_from_url": "2018-06-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/BZ1FFP2iVlQ\" width=\"512\"></iframe></div><p>From the transcript of <a href=\"https://youtu.be/BZ1FFP2iVlQ\">the Darkstream</a>.</p><p>There’s a lot of folks, especially on the Right, who would have a tendency to say, “well you know, what’s the problem with that? I mean everybody has a right to sell to whoever they want to etc etc etc.” Right, and that’s true if you’re looking at it from a theoretical point of view, but the reality is we don’t live in a free economy, we don’t live in a society where you are simply allowed to go and set up a bank with 200 dollars and begin payment processing and issuing credit and all that sort of thing anymore.</p><p>I don’t think it was even a hundred years ago – somebody mentioned this on the blog – barely a hundred years ago it was possible to set up a bank for 200 bucks, start making loans, and that was how Regions Bank was founded originally. But you can’t do that now because the banks – just like the hairdressers and just like every other self-interested group of people – have arranged to set up tremendous regulatory barriers, huge barriers to entry. For example, in, I believe it was Georgia, you needed to have 1,500 hours of training in order to be allowed to braid hair professionally!</p><p>Now this is ridiculous, as anyone who has been around junior high school girls for more than about 20 minutes will know. They sit around braiding each other’s hair all the time, they don’t need to spend fifteen hundred hours to be able to do it, and so what we are seeing is a private version of what was described as Operation Chokepoint by the Obama administration. <a href=\"https://infogalactic.com/info/Operation_Choke_Point\">Operation Chokepoint</a> was a plan to deny banking and financial services to companies that were selling guns. If you’re in the gun industry in any way, they were planning to target those companies, and in fact they are actually still doing so, but again on a private level because Hillary Clinton is not President, and so that’s why you’re seeing companies like Intuit, which owns <i>Quicken</i>, <a href=\"http://www.thetruthaboutguns.com/2018/05/kat-ainsworth/intuit-quickbooks-severs-ties-with-gunsite-academy-reverses-tens-of-thousands-in-credit-card-charges/\">Intuit targeted I believe it was a gun retailer</a> and possibly some gun manufacturers as well, and they’re simply not working with them now.</p><p>You know, this is absolutely ridiculous considering that we have been indoctrinated for the past however many years, it’s been 58 years or so, that you have no right to deny service to anyone for any reason. Suddenly now that the Left has completed its long march through the institutions, suddenly they are going to deny all that, they’re going to attempt to deny the financial oxygen to all the  companies and all the people they don’t like now. I’m not shocked by this. I’m not alarmed by this, you know, I’m a Christian and  we’ve been we’ve been told about the Mark of the Beast and and being<br>denied the ability to buy things, that that sort of persecution would happen since I was a kid at Sunday school. Now I have to admit I didn’t expect to see it taking this kind of form, but it is.</br></p></div>",
  "content_text": "From the transcript of\nthe Darkstream\n.\nThere’s a lot of folks, especially on the Right, who would have a tendency to say, “well you know, what’s the problem with that? I mean everybody has a right to sell to whoever they want to etc etc etc.” Right, and that’s true if you’re looking at it from a theoretical point of view, but the reality is we don’t live in a free economy, we don’t live in a society where you are simply allowed to go and set up a bank with 200 dollars and begin payment processing and issuing credit and all that sort of thing anymore.\nI don’t think it was even a hundred years ago – somebody mentioned this on the blog – barely a hundred years ago it was possible to set up a bank for 200 bucks, start making loans, and that was how Regions Bank was founded originally. But you can’t do that now because the banks – just like the hairdressers and just like every other self-interested group of people – have arranged to set up tremendous regulatory barriers, huge barriers to entry. For example, in, I believe it was Georgia, you needed to have 1,500 hours of training in order to be allowed to braid hair professionally!\nNow this is ridiculous, as anyone who has been around junior high school girls for more than about 20 minutes will know. They sit around braiding each other’s hair all the time, they don’t need to spend fifteen hundred hours to be able to do it, and so what we are seeing is a private version of what was described as Operation Chokepoint by the Obama administration.\nOperation Chokepoint\nwas a plan to deny banking and financial services to companies that were selling guns. If you’re in the gun industry in any way, they were planning to target those companies, and in fact they are actually still doing so, but again on a private level because Hillary Clinton is not President, and so that’s why you’re seeing companies like Intuit, which owns\nQuicken\n,\nIntuit targeted I believe it was a gun retailer\nand possibly some gun manufacturers as well, and they’re simply not working with them now.\nYou know, this is absolutely ridiculous considering that we have been indoctrinated for the past however many years, it’s been 58 years or so, that you have no right to deny service to anyone for any reason. Suddenly now that the Left has completed its long march through the institutions, suddenly they are going to deny all that, they’re going to attempt to deny the financial oxygen to all the  companies and all the people they don’t like now. I’m not shocked by this. I’m not alarmed by this, you know, I’m a Christian and  we’ve been we’ve been told about the Mark of the Beast and and being\ndenied the ability to buy things, that that sort of persecution would happen since I was a kid at Sunday school. Now I have to admit I didn’t expect to see it taking this kind of form, but it is.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-18T10:03:21+00:00"
}