{
  "url": "https://voxday.net/2018/06/12/darkstream-wrong-about-hitler/",
  "scraped_at": "2025-12-19T21:06:23.241454",
  "title": "Darkstream: wrong about Hitler",
  "date_display": "June 12, 2018",
  "date_iso": "2018-06-12T12:05:53+00:00",
  "date_from_url": "2018-06-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/IU3kyF6rQtY\" width=\"512\"></iframe></div><p>My opinion had always been pretty orthodox in thinking that Hitler turned to the east and engaged in the <i>Drang nach Osten</i> because he couldn’t get across the English Channel. You know, here he had this war machine and they didn’t have the navy to get across to Great Britain; he’d already taken the entire continent of Europe, Western Europe, and it made sense with the whole <i>Lebensraum </i>and all that sort of thing so I’d never really questioned it. I’d never really thought much about it other than the fact that I always felt the idea that Hitler might have won, that Nazi Germany might have won if they had managed to take Moscow, was a really historically ignorant perspective.</p><p>When you consider that Napoleon did take Moscow, sat around waiting for the Russians to surrender, and then finally was forced to to retreat and left quite a bit of his army behind dead in the snow, you know, somebody made a comment “Hitler did nothing wrong.” Well, I always thought that was a remarkably dumb thing to say. I mean I understand the rhetoric, but invading Russia was an insanely dumb thing to do, <i>insanely </i>dumb….</p><p>It’s very clear when you look at what Suvorov was talking about, and what’s interesting is he got interested in this when he was the equivalent of a high school senior, when he was at the special high school for for future intelligence officers and he actually did the equivalent of his senior thesis on it and he got access to some materials that had not been shown before, that people hadn’t had access to before. And what’s really remarkable is the reaction that people have had to his thesis and the way in which the critics have attempted to attack the evidence that that he’s presented, but in my opinion it’s almost irrefutable that not only was Stalin intending to attack, but I think that it is pretty persuasive that Stalin played Hitler badly, that all of World War II was a set up by Stalin in order to conquer Western Europe.</p><p>And you know, the evidence for this, like I said, is pretty overwhelming. Almost everything that you have heard about the situation with Operation Barbarossa and the situation leading up to it is completely false. I’ve heard all the stories about the outdated tanks, and the the officer purges, and all these other excuses for the poor performance of the Russian troops, and so the thing that was really interesting when you look at it was how <i>significantly </i>the Russian forces outnumbered the attacking German forces. The only reason that the Germans were able to be successful was because the Russians had their air bases set up right on the borders, they had all of these light tanks – they had about 6,000 light tanks which were either able to drive on highways which did not exist across the plains of the Ukraine and Russia, and not only that but they also had about 2,000 amphibious tanks -now you know, these tanks are obviously designed for a fast-moving offensive.</p><p>Not only that but they also had a tremendous amount, an incredible, incredible amount of ammunition that was stored going forward and also the aircraft that they had were predominantly air-to-ground light bombers. Now this is all stuff that you need for an attack, and this is all stuff that is relatively useless in defense, and so I thought that was really striking but the thing that convinced me more than anything else was something that I had known about, but I never really thought about before, and what that was was that only two years before, in 1939, Field Marshal Zhukov, who at the time was only a general, had used precisely these tactics and precisely the same sort of approach to destroy the Japanese Sixth Army on the other side of Russia at <a href=\"https://infogalactic.com/info/Battles_of_Khalkhin_Gol\">the Battle of Khalkin-Gol</a>.</p><p>What’s fascinating about it, and what a lot of people don’t realize is that at the time of the German invasion in 1941, Russia had 5.3 million soldiers deployed, so they had been undergoing a full mobilization for two years.  Now, you may not realize but mobilizations are predominantly offensive, you don’t mobilize just in case somebody might attack you, Now, I’m not saying that Hitler didn’t want any war but he absolutely did not want war with Russia, with the Soviet Union, and the reason that he didn’t want it is because he didn’t think he could win. So the question is, why did he attack?</p><p>Because, absolutely, he did attack, and what I realized, and what is it is pretty clear – I haven’t finished the book yet and Suvorov doesn’t come right out and say it – but it’s very clear that it was an act of desperation by Hitler and the Germans when they realized how badly that they’d been played. They realized that, and here’s the important thing to understand, Stalin was not playing for Germany, Stalin was playing <i>for all of Western Europe!</i></p><p>You see, Stalin was a master of playing “lets you and him fight” and what he did what he did was set up a situation where the Brits and the French thought that in 1939 that the Soviets were going to sign some sort of alliance with them -a lot of people forget, but France and Russia were historically allies  – but what Stalin did was he suckered Hitler and got him to agree to attack Poland, he basically bribed Hitler to attack Poland and the whole point of getting Hitler to attack Poland was to force Britain and France to declare war on Hitler, which they did. Now what was very clever was that Stalin was supposed to attack Poland at the same time that’s what he committed to do in the Molotov-Ribbentrop pact that was signed in Moscow and the fascinating thing was that the Russians <i>didn’t do it.</i></p><p>The Russians did not attack when they were supposed to, when the Germans did, but what a lot of people don’t realize is that German invasion of Poland was going to fail after two weeks. They had actually run out of artillery because Hitler didn’t mobilize Germany properly until well into 1942 and so again the Soviets had to prop up the Germans by invading Poland at that point. They didn’t want to even invade Poland at all because all they really wanted to do with Poland was to trigger war between France and Britain; they were successful in doing so and they were very pleased when Hitler managed to overrun all of France and Belgium and so forth. The original plan which was really  interesting was that Stalin had originally attempted to trigger a war between Germany on the one hand and France and Britain on the other in Spain but they couldn’t do it so they managed to use Poland to do so.</p><p>Stalin managed to use Poland to trigger that war and the whole reason he wanted that war dates all the way back to Lenin, and Lenin realizing that the Treaty of Versailles was so unfair and so crushing to Germany that it was likely to spawn a seriously negative reaction. So that’s why the Soviets were basically waiting from 1918 on for the opportunity to take over all of Western Europe and they finally got that chance 23 years later. One thing that you really come away with is a tremendous respect for the evil intelligence of Stalin, he was much, much brighter than Hitler.</p><p><i>You can buy the book to which I’m referring in the Darkstream, <b><a href=\"http://aerbook.com/maker/productcard-175342-1875.html\">THE CHIEF CULPRIT</a></b> by Viktor Suvorov, from Castalia Books Direct. If you have any interest in WWII or military history, I strongly recommend it. I’ll also post a response to Suvorov’s thesis from the expert on Operation Barbarossa whose books I referenced in the video later today.</i></p></div>",
  "content_text": "My opinion had always been pretty orthodox in thinking that Hitler turned to the east and engaged in the\nDrang nach Osten\nbecause he couldn’t get across the English Channel. You know, here he had this war machine and they didn’t have the navy to get across to Great Britain; he’d already taken the entire continent of Europe, Western Europe, and it made sense with the whole\nLebensraum\nand all that sort of thing so I’d never really questioned it. I’d never really thought much about it other than the fact that I always felt the idea that Hitler might have won, that Nazi Germany might have won if they had managed to take Moscow, was a really historically ignorant perspective.\nWhen you consider that Napoleon did take Moscow, sat around waiting for the Russians to surrender, and then finally was forced to to retreat and left quite a bit of his army behind dead in the snow, you know, somebody made a comment “Hitler did nothing wrong.” Well, I always thought that was a remarkably dumb thing to say. I mean I understand the rhetoric, but invading Russia was an insanely dumb thing to do,\ninsanely\ndumb….\nIt’s very clear when you look at what Suvorov was talking about, and what’s interesting is he got interested in this when he was the equivalent of a high school senior, when he was at the special high school for for future intelligence officers and he actually did the equivalent of his senior thesis on it and he got access to some materials that had not been shown before, that people hadn’t had access to before. And what’s really remarkable is the reaction that people have had to his thesis and the way in which the critics have attempted to attack the evidence that that he’s presented, but in my opinion it’s almost irrefutable that not only was Stalin intending to attack, but I think that it is pretty persuasive that Stalin played Hitler badly, that all of World War II was a set up by Stalin in order to conquer Western Europe.\nAnd you know, the evidence for this, like I said, is pretty overwhelming. Almost everything that you have heard about the situation with Operation Barbarossa and the situation leading up to it is completely false. I’ve heard all the stories about the outdated tanks, and the the officer purges, and all these other excuses for the poor performance of the Russian troops, and so the thing that was really interesting when you look at it was how\nsignificantly\nthe Russian forces outnumbered the attacking German forces. The only reason that the Germans were able to be successful was because the Russians had their air bases set up right on the borders, they had all of these light tanks – they had about 6,000 light tanks which were either able to drive on highways which did not exist across the plains of the Ukraine and Russia, and not only that but they also had about 2,000 amphibious tanks -now you know, these tanks are obviously designed for a fast-moving offensive.\nNot only that but they also had a tremendous amount, an incredible, incredible amount of ammunition that was stored going forward and also the aircraft that they had were predominantly air-to-ground light bombers. Now this is all stuff that you need for an attack, and this is all stuff that is relatively useless in defense, and so I thought that was really striking but the thing that convinced me more than anything else was something that I had known about, but I never really thought about before, and what that was was that only two years before, in 1939, Field Marshal Zhukov, who at the time was only a general, had used precisely these tactics and precisely the same sort of approach to destroy the Japanese Sixth Army on the other side of Russia at\nthe Battle of Khalkin-Gol\n.\nWhat’s fascinating about it, and what a lot of people don’t realize is that at the time of the German invasion in 1941, Russia had 5.3 million soldiers deployed, so they had been undergoing a full mobilization for two years.  Now, you may not realize but mobilizations are predominantly offensive, you don’t mobilize just in case somebody might attack you, Now, I’m not saying that Hitler didn’t want any war but he absolutely did not want war with Russia, with the Soviet Union, and the reason that he didn’t want it is because he didn’t think he could win. So the question is, why did he attack?\nBecause, absolutely, he did attack, and what I realized, and what is it is pretty clear – I haven’t finished the book yet and Suvorov doesn’t come right out and say it – but it’s very clear that it was an act of desperation by Hitler and the Germans when they realized how badly that they’d been played. They realized that, and here’s the important thing to understand, Stalin was not playing for Germany, Stalin was playing\nfor all of Western Europe!\nYou see, Stalin was a master of playing “lets you and him fight” and what he did what he did was set up a situation where the Brits and the French thought that in 1939 that the Soviets were going to sign some sort of alliance with them -a lot of people forget, but France and Russia were historically allies  – but what Stalin did was he suckered Hitler and got him to agree to attack Poland, he basically bribed Hitler to attack Poland and the whole point of getting Hitler to attack Poland was to force Britain and France to declare war on Hitler, which they did. Now what was very clever was that Stalin was supposed to attack Poland at the same time that’s what he committed to do in the Molotov-Ribbentrop pact that was signed in Moscow and the fascinating thing was that the Russians\ndidn’t do it.\nThe Russians did not attack when they were supposed to, when the Germans did, but what a lot of people don’t realize is that German invasion of Poland was going to fail after two weeks. They had actually run out of artillery because Hitler didn’t mobilize Germany properly until well into 1942 and so again the Soviets had to prop up the Germans by invading Poland at that point. They didn’t want to even invade Poland at all because all they really wanted to do with Poland was to trigger war between France and Britain; they were successful in doing so and they were very pleased when Hitler managed to overrun all of France and Belgium and so forth. The original plan which was really  interesting was that Stalin had originally attempted to trigger a war between Germany on the one hand and France and Britain on the other in Spain but they couldn’t do it so they managed to use Poland to do so.\nStalin managed to use Poland to trigger that war and the whole reason he wanted that war dates all the way back to Lenin, and Lenin realizing that the Treaty of Versailles was so unfair and so crushing to Germany that it was likely to spawn a seriously negative reaction. So that’s why the Soviets were basically waiting from 1918 on for the opportunity to take over all of Western Europe and they finally got that chance 23 years later. One thing that you really come away with is a tremendous respect for the evil intelligence of Stalin, he was much, much brighter than Hitler.\nYou can buy the book to which I’m referring in the Darkstream,\nTHE CHIEF CULPRIT\nby Viktor Suvorov, from Castalia Books Direct. If you have any interest in WWII or military history, I strongly recommend it. I’ll also post a response to Suvorov’s thesis from the expert on Operation Barbarossa whose books I referenced in the video later today.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-12T11:05:53+00:00"
}