{
  "url": "https://voxday.net/2018/06/13/darkstream-you-cant-escape-the-stupid/",
  "scraped_at": "2025-12-19T21:06:30.855372",
  "title": "Darkstream: you can’t escape the stupid",
  "date_display": "June 13, 2018",
  "date_iso": "2018-06-13T12:09:10+00:00",
  "date_from_url": "2018-06-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/grlIqThqPos\" width=\"512\"></iframe></div><p><i>From <a href=\"https://youtu.be/grlIqThqPos\">the transcript</a>:</i></p><p>There’s a comment talking about Steven Pinker. Steven Pinker is pretty much wrong about everything, so if he is asserting that intelligence has not declined, you can pretty much count on the fact that it has. I would not trust Steven Pinker to be able to correctly identify the color of the sky.</p><p>So what’s important is the average intelligence, right, that’s what dictates how well society functions and let me show you something before I get to the article that I mentioned. A couple years ago I wrote a book called <b><i><a href=\"http://aerbook.com/maker/productcard-3039487-1875.html\">Cuckservative: How ‘Conservatives’ Betrayed America</a></i></b>. I wrote it with John Red Eagle, Cerno wrote the foreword, and let me read you a little selection here of what we wrote:</p><p><i>By multiplying the average measured IQs for the four major ethnic groups in the United States with their changing demographic ratios, we can calculate how the demographic changes have affected the national intelligence over time. In 1960, we calculate the national IQ average to have been 100.3. By 2010, the average national IQ had fallen four points, to 96. By 2030, if the current population estimates are correct, it will fall another point, to 95. Lest you think that average national intelligence is irrelevant, note that just that four-point difference is essentially equal to the difference between countries such as Austria, the Netherlands, and the United Kingdom, and countries such as Uruguay and Portugal. There is a strong correlation between societal wealth and average national intelligence as measured in IQ.</i></p><p>So you know, we were saying that since the modification in the US immigration policy the average IQ has dropped over five points.  Now I always strongly suspected that we were being conservative there because there are possibly other factors involved. When you look at the fact that highly-educated women, who tend to be the most intelligent women, are far and away the least likely to have children, and there are other factors that are involved as well… so now keep in mind that was something that we wrote two-and-a-half years ago.</p><p>Now that was interesting because there’s an article in The Daily Mail today where the headline is “young people really are getting more stupid. IQs have started to fall by seven points per generation in worrying trend.” IQs have in risen in every decade since World War II, but have now begun to fall again. I have to say the trends started by those born after 1975 is worrying, and of course, they come up with all kinds of reasons and yet the word <i>immigration </i>is never mentioned, but here’s what is kind of shocking. The level, the extent to which they calculate is this fall in IQ equates to about seven points per generation!</p><p>Okay this is bordering on the catastrophic. If US IQs have fallen seven points per generation since 1975, we’ve got nearly two generations there so instead of a five-point decline we are talking about a decline of as much as fourteen points! And you know, this is a <i>catastrophe! </i>This is why you’re seeing a decline in the basic functionality of United States society and of a number of the European societies,  because people simply are not fundamentally as able to to function in a modern society. They simply can’t do the basic tasks that their fathers and their great-grandfathers did, and so you know, this is what you are going to experience and you can’t get away from it. You cannot escape it.</p></div>",
  "content_text": "From\nthe transcript\n:\nThere’s a comment talking about Steven Pinker. Steven Pinker is pretty much wrong about everything, so if he is asserting that intelligence has not declined, you can pretty much count on the fact that it has. I would not trust Steven Pinker to be able to correctly identify the color of the sky.\nSo what’s important is the average intelligence, right, that’s what dictates how well society functions and let me show you something before I get to the article that I mentioned. A couple years ago I wrote a book called\nCuckservative: How ‘Conservatives’ Betrayed America\n. I wrote it with John Red Eagle, Cerno wrote the foreword, and let me read you a little selection here of what we wrote:\nBy multiplying the average measured IQs for the four major ethnic groups in the United States with their changing demographic ratios, we can calculate how the demographic changes have affected the national intelligence over time. In 1960, we calculate the national IQ average to have been 100.3. By 2010, the average national IQ had fallen four points, to 96. By 2030, if the current population estimates are correct, it will fall another point, to 95. Lest you think that average national intelligence is irrelevant, note that just that four-point difference is essentially equal to the difference between countries such as Austria, the Netherlands, and the United Kingdom, and countries such as Uruguay and Portugal. There is a strong correlation between societal wealth and average national intelligence as measured in IQ.\nSo you know, we were saying that since the modification in the US immigration policy the average IQ has dropped over five points.  Now I always strongly suspected that we were being conservative there because there are possibly other factors involved. When you look at the fact that highly-educated women, who tend to be the most intelligent women, are far and away the least likely to have children, and there are other factors that are involved as well… so now keep in mind that was something that we wrote two-and-a-half years ago.\nNow that was interesting because there’s an article in The Daily Mail today where the headline is “young people really are getting more stupid. IQs have started to fall by seven points per generation in worrying trend.” IQs have in risen in every decade since World War II, but have now begun to fall again. I have to say the trends started by those born after 1975 is worrying, and of course, they come up with all kinds of reasons and yet the word\nimmigration\nis never mentioned, but here’s what is kind of shocking. The level, the extent to which they calculate is this fall in IQ equates to about seven points per generation!\nOkay this is bordering on the catastrophic. If US IQs have fallen seven points per generation since 1975, we’ve got nearly two generations there so instead of a five-point decline we are talking about a decline of as much as fourteen points! And you know, this is a\ncatastrophe!\nThis is why you’re seeing a decline in the basic functionality of United States society and of a number of the European societies,  because people simply are not fundamentally as able to to function in a modern society. They simply can’t do the basic tasks that their fathers and their great-grandfathers did, and so you know, this is what you are going to experience and you can’t get away from it. You cannot escape it.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-13T11:09:10+00:00"
}