{
  "url": "https://voxday.net/2018/06/15/darkstream-success-comes-through-force-multiplication/",
  "scraped_at": "2025-12-19T21:06:51.013134",
  "title": "Darkstream: success comes through force-multiplication",
  "date_display": "June 15, 2018",
  "date_iso": "2018-06-15T12:51:03+00:00",
  "date_from_url": "2018-06-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/HmHC7GQGQSI\" width=\"512\"></iframe></div><p>From <a href=\"https://youtu.be/HmHC7GQGQSI\">the transcript</a>:</p><p>These are ways that we can support each other, that we can work together, and you know that’s how we not only survive but we thrive in this increasingly heated cultural war environment. And so you know, what I would encourage you to do is, in your own way, whether you’re talking about work, whether you’re talking about play, whether you’re talking about politics, is start thinking about the objective and stop worrying about your status or whether you’re getting as much credit as you feel you deserve. I’m not saying that those things are not important, I’m just saying that they are ultimately<br>less important then learning how to force-multiply your own efforts by working with other people.</br></p><p>Other people are always a force-multiplier, and that’s something it took me a long, long time to learn. You know we have a lot of volunteers now, with Castalia, with Infogalactic, with Arkhaven, and you know all of their efforts are very much appreciated, but it took me until, I think it was until three years ago, that I allowed anybody to volunteer for anything because I was always trying to do it myself. I was always trying to do it alone, and when you’re alone you are more easily isolated, obviously, you’re more easily ignored. There’s a reason why the first thing the SJWs do is to cut people out, to separate them from others, you know, freeze and isolate them as Alinsky wrote. They do that because it weakens you, they do that because it makes it easier to prevent you from having success, and so that’s why you need to be willing to give up the idea that you’re going be in charge, that you should be in charge, that you know best, etc.</p><p>If you want to be in charge of something, then you start something and people come to you, and they join you, and they force-multiply your efforts. What you cannot do, and you must not do, is to try to join somebody else’s group, and then share your wisdom with them and try to tell them what to do. You know that is <i>always</i> a mistake, that is always intrinsically offensive, and you should not be surprised when people don’t appreciate your efforts to help them. All right, if they ask for the help, great, but if you’re just doing it out of the goodness of your heart or something, I mean, come on, let’s be realistic with yourself, what you really want is you want the influence without the responsibility.</p><p>Don’t do that. You can only really have influence if you’re willing to take responsibility for yourself, and the person who is responsible is the person who has the skin in the game and as Talib correctly tells us – no this is not leading from the bottom it’s not about leading at all, that’s the whole point, to get over the drive to lead – if you want to lead, you have to have people who voluntarily follow you of their own free will. You need to start walking in a direction and if people follow you, <i>then</i> you’re the leader, but what you cannot do is try to jump in and try to hijack the microphone, hijack the group, hijack the planning, hijack the strategy, that is all wrong! You’re not <i>helping </i>people by doing that, you’re actually creating problems. So, before you can be a good leader, you have to learn how to be a good and reliable follower.</p></div>",
  "content_text": "From\nthe transcript\n:\nThese are ways that we can support each other, that we can work together, and you know that’s how we not only survive but we thrive in this increasingly heated cultural war environment. And so you know, what I would encourage you to do is, in your own way, whether you’re talking about work, whether you’re talking about play, whether you’re talking about politics, is start thinking about the objective and stop worrying about your status or whether you’re getting as much credit as you feel you deserve. I’m not saying that those things are not important, I’m just saying that they are ultimately\nless important then learning how to force-multiply your own efforts by working with other people.\nOther people are always a force-multiplier, and that’s something it took me a long, long time to learn. You know we have a lot of volunteers now, with Castalia, with Infogalactic, with Arkhaven, and you know all of their efforts are very much appreciated, but it took me until, I think it was until three years ago, that I allowed anybody to volunteer for anything because I was always trying to do it myself. I was always trying to do it alone, and when you’re alone you are more easily isolated, obviously, you’re more easily ignored. There’s a reason why the first thing the SJWs do is to cut people out, to separate them from others, you know, freeze and isolate them as Alinsky wrote. They do that because it weakens you, they do that because it makes it easier to prevent you from having success, and so that’s why you need to be willing to give up the idea that you’re going be in charge, that you should be in charge, that you know best, etc.\nIf you want to be in charge of something, then you start something and people come to you, and they join you, and they force-multiply your efforts. What you cannot do, and you must not do, is to try to join somebody else’s group, and then share your wisdom with them and try to tell them what to do. You know that is\nalways\na mistake, that is always intrinsically offensive, and you should not be surprised when people don’t appreciate your efforts to help them. All right, if they ask for the help, great, but if you’re just doing it out of the goodness of your heart or something, I mean, come on, let’s be realistic with yourself, what you really want is you want the influence without the responsibility.\nDon’t do that. You can only really have influence if you’re willing to take responsibility for yourself, and the person who is responsible is the person who has the skin in the game and as Talib correctly tells us – no this is not leading from the bottom it’s not about leading at all, that’s the whole point, to get over the drive to lead – if you want to lead, you have to have people who voluntarily follow you of their own free will. You need to start walking in a direction and if people follow you,\nthen\nyou’re the leader, but what you cannot do is try to jump in and try to hijack the microphone, hijack the group, hijack the planning, hijack the strategy, that is all wrong! You’re not\nhelping\npeople by doing that, you’re actually creating problems. So, before you can be a good leader, you have to learn how to be a good and reliable follower.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-15T11:51:03+00:00"
}