{
  "url": "https://voxday.net/2018/06/26/darkstream-alt-hero-2/",
  "scraped_at": "2025-12-19T21:08:39.354689",
  "title": "Darkstream: Alt-Hero #2",
  "date_display": "June 26, 2018",
  "date_iso": "2018-06-26T15:55:16+00:00",
  "date_from_url": "2018-06-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/5b-SUaO91NY\" width=\"512\"></iframe></div><p>From <a href=\"https://youtu.be/5b-SUaO91NY\">the transcript</a>:</p><p>I like to keep things believable even if we’re dealing with superpowers, even if we’re dealing with things that are beyond the ordinary. I think that stories are much more interesting when they have some connection to the real world as we experience it. You know, the world of Alt-Hero is not our world but there are similarities because people are people and comics are a really good way of exploring some of those issues in an interesting and innovative fashion. So for those who were expecting political preaching, you’re not going to find it. For those who are expecting the right-wing equivalent of SJW lecturing, you’re not going to find it.</p><p>It was interesting because some people are commenting that they found it difficult to tell exactly who are supposed to be the good guys and who are supposed to be the bad guys. Well, if you know my perspective, then you know who I think the good guys are, but what I always try to do in my novels, and what I’m trying to do in the comics, is I want both the heroes and the villains to be true to <i>their</i> perspectives. You know, I’m not interested in writing bad guys who are just cardboard characters.</p><p>Now you might think that those those antifa thugs are just cardboard characters, and maybe they’ll turn out to be that way, maybe they won’t, but the point is is that within the context of that particular scene, their behavior is consistent with the way that real people in those situations tend to behave.</p></div>",
  "content_text": "From\nthe transcript\n:\nI like to keep things believable even if we’re dealing with superpowers, even if we’re dealing with things that are beyond the ordinary. I think that stories are much more interesting when they have some connection to the real world as we experience it. You know, the world of Alt-Hero is not our world but there are similarities because people are people and comics are a really good way of exploring some of those issues in an interesting and innovative fashion. So for those who were expecting political preaching, you’re not going to find it. For those who are expecting the right-wing equivalent of SJW lecturing, you’re not going to find it.\nIt was interesting because some people are commenting that they found it difficult to tell exactly who are supposed to be the good guys and who are supposed to be the bad guys. Well, if you know my perspective, then you know who I think the good guys are, but what I always try to do in my novels, and what I’m trying to do in the comics, is I want both the heroes and the villains to be true to\ntheir\nperspectives. You know, I’m not interested in writing bad guys who are just cardboard characters.\nNow you might think that those those antifa thugs are just cardboard characters, and maybe they’ll turn out to be that way, maybe they won’t, but the point is is that within the context of that particular scene, their behavior is consistent with the way that real people in those situations tend to behave.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-26T14:55:16+00:00"
}