{
  "url": "https://voxday.net/2018/06/22/darkstream-q-and-conspiracy/",
  "scraped_at": "2025-12-19T21:07:58.902961",
  "title": "Darkstream: Q and conspiracy",
  "date_display": "June 22, 2018",
  "date_iso": "2018-06-22T12:36:52+00:00",
  "date_from_url": "2018-06-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/tkHYvYR8Opo\" width=\"512\"></iframe></div><p>From <a href=\"https://youtu.be/tkHYvYR8Opo\">the transcript</a>:</p><p>I don’t know if some of the stuff that Q is telling us is going to come to pass, but what I do know is that the world condition that he describes, this conspiracy theory of reality, is actually considerably more accurate, more realistic, and more in correspondence with genuine objective reality than the version that we are taught in school, or the version that we are presented every day by the mainstream media. I wrote a column back in 2002 and I’m going to read just a little bit of it here to you.</p><p><i>History speaks eloquently on the subject. In the 1,129 years of the great Byzantine empire, the average reign of an emperor was 12 years. This is a bit longer than the eight years we now allow our president, but is rather short considering that the Byzantine position ostensibly offered supreme power and lifetime tenure. But if it wasn’t unheard of for a ruler of Constantinople to die peacefully in his bed, it was also not the norm. </i><br><i><br/></i><i>For example, in the 135 years following Maurice’s peaceful succession of Tiberius Constantine, seven of the empire’s 12 rulers saw their reigns end in assassination or execution. Of the five who were not slain outright, two were deposed, and one, Constantine IV, was only able to keep his throne by mutilating his two fraternal rivals.</i><br><i><br/></i><i>Has anything changed today? On the surface, the answer is certainly yes. But is it truly reasonable to think that human nature has changed much over the 549 years that separate us from the last days of Byzantium? I submit not, especially considering that we are closer to the 11th Constantine, Dragatses, than was the first Justinian to Julius Caesar.</i><br><i><br/></i><i>The Marxian theory of history has been thoroughly discredited. The Great Man theory cannot explain the dichotomy between the proven conspiracies of yore and their seeming absence today. The Accident theory is a vapid ontological argument. Only the much-belittled conspiracy theory of history, which stubbornly insists that events are not always as they appear on the surface, holds together in this light when examined in a historical and logical manner. </i></br></br></br></p><p>So the point that we have to keep in mind is that there are conspiracies of the powerful Those who seek power over others always conspire in an attempt to achieve it, and it is very foolish of those of us who do not take part in those games to assume that that they are not happening simply because we don’t have the ability to perceive them or to chronicle the specific actions that lead up to the consequences that we actually see. So that’s why I pay attention to what Q is saying, because whether he is actually correct about the details is not really relevant; even the aspects that he is covering are<br>at least causing people to look in the right direction.</br></p><p>It’s not an accident that globalism has come to pass in very much the same way that the crazy, end-of-the-world Christians were saying was going to take place back in the 70s and 80s. You know, it’s a lot harder to laugh at people who talked about the Mark of the Beast and people not being permitted to buy or sell now, when you’re seeing PayPal and Stripe and Visa and MasterCard refusing service, when you’re seeing people talk about implanted chips that will allow people to engage in cashless transactions and that sort of thing. Whether you like it or not, whether you understand exactly what conspiracy connects to what public action or not, the fact of the matter is that is the way the world works. That is what all these various organizations are formed to do.</p><p>You know when George Soros goes and gives five million dollars to a group of black radicals, that’s a conspiracy. The fact that we know it’s called Black Lives Matter and we know the people who are involved – at least some of them – doesn’t mean that it’s not a conspiracy. It is a conspiracy, it is a<br>conspiracy to accomplish specific political change. You know, we might understand it better if Soros was teamed up with Donald Trump’s younger brother and they were scheming to try to make the younger brother the Emperor of the United States, but that’s a very crude and obvious form of conspiracy, it’s just it’s not the only form of it.  So, I would encourage you to pay attention to what Q is saying, and the people who are paying attention to what he’s doing and who are discussing these things.</br></p></div>",
  "content_text": "From\nthe transcript\n:\nI don’t know if some of the stuff that Q is telling us is going to come to pass, but what I do know is that the world condition that he describes, this conspiracy theory of reality, is actually considerably more accurate, more realistic, and more in correspondence with genuine objective reality than the version that we are taught in school, or the version that we are presented every day by the mainstream media. I wrote a column back in 2002 and I’m going to read just a little bit of it here to you.\nHistory speaks eloquently on the subject. In the 1,129 years of the great Byzantine empire, the average reign of an emperor was 12 years. This is a bit longer than the eight years we now allow our president, but is rather short considering that the Byzantine position ostensibly offered supreme power and lifetime tenure. But if it wasn’t unheard of for a ruler of Constantinople to die peacefully in his bed, it was also not the norm.\nFor example, in the 135 years following Maurice’s peaceful succession of Tiberius Constantine, seven of the empire’s 12 rulers saw their reigns end in assassination or execution. Of the five who were not slain outright, two were deposed, and one, Constantine IV, was only able to keep his throne by mutilating his two fraternal rivals.\nHas anything changed today? On the surface, the answer is certainly yes. But is it truly reasonable to think that human nature has changed much over the 549 years that separate us from the last days of Byzantium? I submit not, especially considering that we are closer to the 11th Constantine, Dragatses, than was the first Justinian to Julius Caesar.\nThe Marxian theory of history has been thoroughly discredited. The Great Man theory cannot explain the dichotomy between the proven conspiracies of yore and their seeming absence today. The Accident theory is a vapid ontological argument. Only the much-belittled conspiracy theory of history, which stubbornly insists that events are not always as they appear on the surface, holds together in this light when examined in a historical and logical manner.\nSo the point that we have to keep in mind is that there are conspiracies of the powerful Those who seek power over others always conspire in an attempt to achieve it, and it is very foolish of those of us who do not take part in those games to assume that that they are not happening simply because we don’t have the ability to perceive them or to chronicle the specific actions that lead up to the consequences that we actually see. So that’s why I pay attention to what Q is saying, because whether he is actually correct about the details is not really relevant; even the aspects that he is covering are\nat least causing people to look in the right direction.\nIt’s not an accident that globalism has come to pass in very much the same way that the crazy, end-of-the-world Christians were saying was going to take place back in the 70s and 80s. You know, it’s a lot harder to laugh at people who talked about the Mark of the Beast and people not being permitted to buy or sell now, when you’re seeing PayPal and Stripe and Visa and MasterCard refusing service, when you’re seeing people talk about implanted chips that will allow people to engage in cashless transactions and that sort of thing. Whether you like it or not, whether you understand exactly what conspiracy connects to what public action or not, the fact of the matter is that is the way the world works. That is what all these various organizations are formed to do.\nYou know when George Soros goes and gives five million dollars to a group of black radicals, that’s a conspiracy. The fact that we know it’s called Black Lives Matter and we know the people who are involved – at least some of them – doesn’t mean that it’s not a conspiracy. It is a conspiracy, it is a\nconspiracy to accomplish specific political change. You know, we might understand it better if Soros was teamed up with Donald Trump’s younger brother and they were scheming to try to make the younger brother the Emperor of the United States, but that’s a very crude and obvious form of conspiracy, it’s just it’s not the only form of it.  So, I would encourage you to pay attention to what Q is saying, and the people who are paying attention to what he’s doing and who are discussing these things.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-22T11:36:52+00:00"
}