{
  "url": "https://voxday.net/2018/06/02/darkstream-hierarchy-and-human-behavior/",
  "scraped_at": "2025-12-19T21:05:00.749793",
  "title": "Darkstream: Hierarchy and Human Behavior",
  "date_display": "June 2, 2018",
  "date_iso": "2018-06-02T15:00:06+00:00",
  "date_from_url": "2018-06-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/G0dJlD61tUc\" width=\"512\"></iframe></div><p>From <i><a href=\"https://youtu.be/G0dJlD61tUc\">Hierarchy and Human Behavior</a></i>.</p><p>The important thing to understand is that the names don’t matter. This is something that for some<br>reason a lot of people struggle with; the fact is that we’re not creating anything here, we’re not inventing anything here. Now I like to use the example of the okapi. The okapi is an animal that looks kind of like a combination of a zebra and a giraffe, and it’s only found in some of the deep jungles in Africa. People told scientists and zoologists for decades that this animal existed, but it wasn’t “discovered” until you know sometime, in I think it was, in the mid-20th century. And then they named it “the okapi”, but the thing that you need to understand is that the animal existed before it was named. The animal was always there.</br></p><p>These behavioral patterns exist and are exhibited on a daily basis by people around you every single day. It doesn’t matter what you call them, it doesn’t matter whether you think they’re good or you think they’re bad, you know, all we’re doing is recognizing that similar people in similar social positions, they are all playing out the same role.</p><p>Chronicle your behavioral patterns with regards to how you interact with others and it’s very, very easy to categorize your behavioral form through the eyes of someone else. Most people have no ability, they have no ability whatsoever, to honestly judge themselves. And that’s one reason why I  stopped blogging at Alpha Game, because I got so tired of all these people who wanted to talk about<br>what they were, you know, what other people thought they were, and then argue about what they were. You know, to do that, to focus on that, is to completely miss the point.</br></p><p>It’s not about <i>you</i>, it’s about how you can anticipate and predict the behavior of <i>others, </i>and anyone can do it. It doesn’t matter what you are, you know, doesn’t it matter more if you’re hiring someone, if you’re bringing someone in as a volunteer, isn’t it more important to understand whether that person is going to try to take over your company, if they’re going to be incapable of taking responsibility and  making decisions on their own, or if they’re going to lash out in a fit of rage and attempt to destroy you and the organization if they don’t get their way, or if they’re going to pay no attention to whatever you tell them to do and they’re just going to go off and do their own thing without really paying much attention to what your objectives are?  Wouldn’t you agree that being able to distinguish between  those things is much much more important?</p></div>",
  "content_text": "From\nHierarchy and Human Behavior\n.\nThe important thing to understand is that the names don’t matter. This is something that for some\nreason a lot of people struggle with; the fact is that we’re not creating anything here, we’re not inventing anything here. Now I like to use the example of the okapi. The okapi is an animal that looks kind of like a combination of a zebra and a giraffe, and it’s only found in some of the deep jungles in Africa. People told scientists and zoologists for decades that this animal existed, but it wasn’t “discovered” until you know sometime, in I think it was, in the mid-20th century. And then they named it “the okapi”, but the thing that you need to understand is that the animal existed before it was named. The animal was always there.\nThese behavioral patterns exist and are exhibited on a daily basis by people around you every single day. It doesn’t matter what you call them, it doesn’t matter whether you think they’re good or you think they’re bad, you know, all we’re doing is recognizing that similar people in similar social positions, they are all playing out the same role.\nChronicle your behavioral patterns with regards to how you interact with others and it’s very, very easy to categorize your behavioral form through the eyes of someone else. Most people have no ability, they have no ability whatsoever, to honestly judge themselves. And that’s one reason why I  stopped blogging at Alpha Game, because I got so tired of all these people who wanted to talk about\nwhat they were, you know, what other people thought they were, and then argue about what they were. You know, to do that, to focus on that, is to completely miss the point.\nIt’s not about\nyou\n, it’s about how you can anticipate and predict the behavior of\nothers,\nand anyone can do it. It doesn’t matter what you are, you know, doesn’t it matter more if you’re hiring someone, if you’re bringing someone in as a volunteer, isn’t it more important to understand whether that person is going to try to take over your company, if they’re going to be incapable of taking responsibility and  making decisions on their own, or if they’re going to lash out in a fit of rage and attempt to destroy you and the organization if they don’t get their way, or if they’re going to pay no attention to whatever you tell them to do and they’re just going to go off and do their own thing without really paying much attention to what your objectives are?  Wouldn’t you agree that being able to distinguish between  those things is much much more important?",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-02T14:00:06+00:00"
}