{
  "url": "https://voxday.net/2018/06/15/gammas-are-not-welcome-here/",
  "scraped_at": "2025-12-19T21:06:49.174467",
  "title": "Gammas are not welcome here",
  "date_display": "June 15, 2018",
  "date_iso": "2018-06-15T11:54:05+00:00",
  "date_from_url": "2018-06-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I think it is now time to openly institute an anti-gamma policy. It’s no secret that I detest them and their behavioral patterns, but I simply don’t have the time or the patience to tolerate their antics any longer. The now-banned Pale Male’s nonsense is a good example of why they simply aren’t worth the effort required to put up with them.</p><blockquote class=\"tr_bq\"><p>You forgot the modifier:  Social science is not scientific. That’s because “social” is a modifier meaning “not”:  social science, social justice, social work…. Tell us, Vox:  have you ever taken a course in physics?  Did you pass?</p></blockquote><p>This is classic gamma bullshit utilizing the four As of the gamma.</p><ol><li>Assume a superior, lecturing pose.</li><li>Assert that the other party has made a mistake, and in doing so, demonstrate a complete failure to have understood what the other party said.</li><li>Attack the other party instead of addressing the subject at hand.</li><li>Attempt to disqualify and discredit the other party in lieu of demonstrating the errors of their position.</li></ol><div>The whole point of <a href=\"http://voxday.blogspot.com/2018/06/science-is-not-scientific.html\">the post</a>, which was explicitly stated, was that scientistry (the scientific profession) is increasingly not utilizing scientody (the scientific method). That is what “science is not scientific” means and the observation applies to both the hard and the soft sciences, as has been chronicled here on several occasions. My having taken, or not taken, courses in physics at the high school and college levels has absolutely nothing to do with the accuracy of my observations concerning corruption in science. All aspects of science. After all, I haven’t taken a single course in psychology, which would theoretically be even more relevant to the subject, and yet the gamma doesn’t ask about that… because he knows perfectly well such questions aren’t relevant.</div><blockquote class=\"tr_bq\"><p>You forgot that using the Stanford prison experiment to conclude anything whatsoever about physics is a non sequitur. Completely different people, methods, standards of evidence, reproducibility (institutional review boards would no doubt prohibit it today), everything.</p></blockquote><p>I didn’t forget anything. I’m literally the individual who coined the sarcastic expression <i>“You can trust biologists. Because physicists get amazingly accurate results.”</i> As I pointed out in my response, that is like saying that because Charles Ponzi was a completely different person living at a completely different time and using completely different methods than Bernie Madoff, and operating under very different regulatory standards, it is a non sequitur to use his actions to conclude anything about Madoff’s.</p><p>Physicists are people, subject to the same incentives and motives and character flaws as psychologists. They are corrupted in the same way and for the same reasons. And we already possess considerable evidence that some of them are behaving in exactly the same way, despite their various differences. Just ask Stickwick about how intellectually and scientifically pure academic physicists are these days.</p><blockquote><p>Tell us, Vox: have you ever taken a course in physics? Did you pass? Your own rule: <i>2… If you are asked a direct question relevant to the topic, then you will be expected to answer it in a straightforward and non-evasive manner… </i>I’d bet 10:1 I know the answer but I want it straight from you.</p></blockquote><p>Notice that he is posturing as if he is confident, and yet he doesn’t commit himself publicly to a position, for fear that he will be proven wrong. This is textbook gamma posturing. And he is <i>still </i>trying to make the subject about me, rather than about the big news concerning the scientific fraud underlying one of the most famous studies in social science, while trying to use my own rules against me.</p><p>Of course, being careless and obsessive like all gammas, he stopped reading once he found what he was looking for and failed to read the whole thing.</p><p><i>29. These Rules may in no case be interpreted contrary to the purposes and principles of Vox Day, as solely determined by Vox Day.</i></p><blockquote class=\"tr_bq\"><p>I’m still waiting for him to tell us if he’s actually gone there in physics, and how far.</p></blockquote><p>Notice how he’s “still waiting” for an answer to a question he never even asked. That’s because this is not a relevant question, it is an attempt to “win” the discussion through discrediting and disqualification; he’s begun to fear that I have taken a course in physics and is preemptively laying the groundwork for moving the goalposts. Which, of course, is why I ignored the question in the first place. Whenever you successfully answer a gamma’s initial attempt to discredit and disqualify you, he will simply respond with another question intended to do the same. This process never ends until a) you kick him out, b) he finally manages to come up with a question that allows him to say HA!, c) you have such impeccable credentials that he falls silent in embarrassment, or d) you ignore him so long that he finally gives up and goes away.</p><p>I wasn’t the only one who noticed the flashing neon signs saying “warning: gamma at work ahead”.</p><blockquote class=\"tr_bq\"><p>In what way is Vox’s educational history relevant to the question? Are you always this dishonest, or only when challenged? This is a sneering, gamma-ish, and obviously false assertion of the appeal to authority, and you should know this.</p></blockquote><p>And notice how the gamma always eventually brings the discussion back around to himself. Every single time. Note that literally no one asked about his credentials, his degrees, or what subjects he studied, but that didn’t prevent him from telling everyone anyhow.</p><blockquote class=\"tr_bq\"><p>I stopped my formal study of chemistry in my freshman year of college, but I’m still working on it.  Autodidact, check.  I’m sketching hardware to do practical applications. </p></blockquote><p><a href=\"http://1.bp.blogspot.com/_3UXl0oMYPLs/SXZHIRt_oKI/AAAAAAAAAFw/j6kmhIdEQTI/s400/ATHEIST+LOGIC.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" data-original-height=\"400\" data-original-width=\"320\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"https://1.bp.blogspot.com/_3UXl0oMYPLs/SXZHIRt_oKI/AAAAAAAAAFw/j6kmhIdEQTI/s400/ATHEIST+LOGIC.jpg\" width=\"256\"/></a>After initially trying to ignore his antics to no avail, I opted for Option A and kicked Pale Male out. He’s now banned from commenting on the blog, and I plan to similarly ban every single gamma who acts up and subjects us to similar antics. From now on, if anyone even <i>addresses </i>me in a personally challenging or passive-aggressive manner, I’m just going to delete their comments. I have learned over 15 years of daily blogging that it is <i>always </i>a waste of time to even answer such commenters; they add nothing to the discourse, they inevitably attempt to derail the discussion, they try to snarkily disqualify everyone who disagrees with them, and they inevitably start to talk about themselves instead of the subject at hand.</p><p>This is not a place for gammas to show the whole world what smart boys they are. This is not a place for anyone to attempt to work out their psychological issues. And above all, <i>this is not a place to waste my time</i>. Everyone is welcome to express THEIR OWN opinion about THE SUBJECT BEING DISCUSSED, they are not permitted to attempt to hijack the microphone or try to elevate their perceived status at my, or anyone else’s, expense. If I tell you that you are wrong, you are welcome to try to prove that you were actually correct, but any attempt to attack, disqualify, or discredit me in lieu of an actual defense of your assertions will be nuked on sight.</p><p>And while you’re welcome to try to correct me if you think I am wrong, you had damn well better cross your t’s, dot your i’s, and get all of your ducks in a row while you make your case for it, because there are few things I despise more than one of my intellectual inferiors wasting my time by erroneously attempting to “correct” me, especially by citing orthodox information with which I am obviously already familiar. If all you’ve got is a snarky passive-aggressive statement of opinion that is a prelude to the usual routine, just go away and don’t come back. Or at the very least, keep it to yourself. I’m not even remotely interested in playing stupid gamma games.</p></div>",
  "content_text": "I think it is now time to openly institute an anti-gamma policy. It’s no secret that I detest them and their behavioral patterns, but I simply don’t have the time or the patience to tolerate their antics any longer. The now-banned Pale Male’s nonsense is a good example of why they simply aren’t worth the effort required to put up with them.\nYou forgot the modifier:  Social science is not scientific. That’s because “social” is a modifier meaning “not”:  social science, social justice, social work…. Tell us, Vox:  have you ever taken a course in physics?  Did you pass?\nThis is classic gamma bullshit utilizing the four As of the gamma.\nAssume a superior, lecturing pose.\nAssert that the other party has made a mistake, and in doing so, demonstrate a complete failure to have understood what the other party said.\nAttack the other party instead of addressing the subject at hand.\nAttempt to disqualify and discredit the other party in lieu of demonstrating the errors of their position.\nThe whole point of\nthe post\n, which was explicitly stated, was that scientistry (the scientific profession) is increasingly not utilizing scientody (the scientific method). That is what “science is not scientific” means and the observation applies to both the hard and the soft sciences, as has been chronicled here on several occasions. My having taken, or not taken, courses in physics at the high school and college levels has absolutely nothing to do with the accuracy of my observations concerning corruption in science. All aspects of science. After all, I haven’t taken a single course in psychology, which would theoretically be even more relevant to the subject, and yet the gamma doesn’t ask about that… because he knows perfectly well such questions aren’t relevant.\nYou forgot that using the Stanford prison experiment to conclude anything whatsoever about physics is a non sequitur. Completely different people, methods, standards of evidence, reproducibility (institutional review boards would no doubt prohibit it today), everything.\nI didn’t forget anything. I’m literally the individual who coined the sarcastic expression\n“You can trust biologists. Because physicists get amazingly accurate results.”\nAs I pointed out in my response, that is like saying that because Charles Ponzi was a completely different person living at a completely different time and using completely different methods than Bernie Madoff, and operating under very different regulatory standards, it is a non sequitur to use his actions to conclude anything about Madoff’s.\nPhysicists are people, subject to the same incentives and motives and character flaws as psychologists. They are corrupted in the same way and for the same reasons. And we already possess considerable evidence that some of them are behaving in exactly the same way, despite their various differences. Just ask Stickwick about how intellectually and scientifically pure academic physicists are these days.\nTell us, Vox: have you ever taken a course in physics? Did you pass? Your own rule:\n2… If you are asked a direct question relevant to the topic, then you will be expected to answer it in a straightforward and non-evasive manner…\nI’d bet 10:1 I know the answer but I want it straight from you.\nNotice that he is posturing as if he is confident, and yet he doesn’t commit himself publicly to a position, for fear that he will be proven wrong. This is textbook gamma posturing. And he is\nstill\ntrying to make the subject about me, rather than about the big news concerning the scientific fraud underlying one of the most famous studies in social science, while trying to use my own rules against me.\nOf course, being careless and obsessive like all gammas, he stopped reading once he found what he was looking for and failed to read the whole thing.\n29. These Rules may in no case be interpreted contrary to the purposes and principles of Vox Day, as solely determined by Vox Day.\nI’m still waiting for him to tell us if he’s actually gone there in physics, and how far.\nNotice how he’s “still waiting” for an answer to a question he never even asked. That’s because this is not a relevant question, it is an attempt to “win” the discussion through discrediting and disqualification; he’s begun to fear that I have taken a course in physics and is preemptively laying the groundwork for moving the goalposts. Which, of course, is why I ignored the question in the first place. Whenever you successfully answer a gamma’s initial attempt to discredit and disqualify you, he will simply respond with another question intended to do the same. This process never ends until a) you kick him out, b) he finally manages to come up with a question that allows him to say HA!, c) you have such impeccable credentials that he falls silent in embarrassment, or d) you ignore him so long that he finally gives up and goes away.\nI wasn’t the only one who noticed the flashing neon signs saying “warning: gamma at work ahead”.\nIn what way is Vox’s educational history relevant to the question? Are you always this dishonest, or only when challenged? This is a sneering, gamma-ish, and obviously false assertion of the appeal to authority, and you should know this.\nAnd notice how the gamma always eventually brings the discussion back around to himself. Every single time. Note that literally no one asked about his credentials, his degrees, or what subjects he studied, but that didn’t prevent him from telling everyone anyhow.\nI stopped my formal study of chemistry in my freshman year of college, but I’m still working on it.  Autodidact, check.  I’m sketching hardware to do practical applications.\nAfter initially trying to ignore his antics to no avail, I opted for Option A and kicked Pale Male out. He’s now banned from commenting on the blog, and I plan to similarly ban every single gamma who acts up and subjects us to similar antics. From now on, if anyone even\naddresses\nme in a personally challenging or passive-aggressive manner, I’m just going to delete their comments. I have learned over 15 years of daily blogging that it is\nalways\na waste of time to even answer such commenters; they add nothing to the discourse, they inevitably attempt to derail the discussion, they try to snarkily disqualify everyone who disagrees with them, and they inevitably start to talk about themselves instead of the subject at hand.\nThis is not a place for gammas to show the whole world what smart boys they are. This is not a place for anyone to attempt to work out their psychological issues. And above all,\nthis is not a place to waste my time\n. Everyone is welcome to express THEIR OWN opinion about THE SUBJECT BEING DISCUSSED, they are not permitted to attempt to hijack the microphone or try to elevate their perceived status at my, or anyone else’s, expense. If I tell you that you are wrong, you are welcome to try to prove that you were actually correct, but any attempt to attack, disqualify, or discredit me in lieu of an actual defense of your assertions will be nuked on sight.\nAnd while you’re welcome to try to correct me if you think I am wrong, you had damn well better cross your t’s, dot your i’s, and get all of your ducks in a row while you make your case for it, because there are few things I despise more than one of my intellectual inferiors wasting my time by erroneously attempting to “correct” me, especially by citing orthodox information with which I am obviously already familiar. If all you’ve got is a snarky passive-aggressive statement of opinion that is a prelude to the usual routine, just go away and don’t come back. Or at the very least, keep it to yourself. I’m not even remotely interested in playing stupid gamma games.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-15T10:54:05+00:00"
}