{
  "url": "https://voxday.net/2018/06/24/i-am-not-a-right-winger/",
  "scraped_at": "2025-12-19T21:08:19.037342",
  "title": "“I am not a right-winger”",
  "date_display": "June 24, 2018",
  "date_iso": "2018-06-24T15:00:02+00:00",
  "date_from_url": "2018-06-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is simply astonishing how many people simply refuse to accept that a card-carrying socialist academic is, in fact, a man of the Left, even when the guy repeatedly insists that he is. From the comments of the most recent Darkstream.</p><p><b>Praxis71:</b> I agree with your assessment of Peterson, but he’s not a “leftist”… that’s absurd.  The guy is simply a classical liberal although yes, he does sometimes contradict himself.</p><p><b>The Sydney Morning Herald: </b>What do you think of the things that people, and I’m especially thinking of your opponents, get wrong about you?</p><p><b>Jordan Peterson: </b>Their basic proposition is that, you know, first of all, that I’m a right winger of some sort and that’s just not the case.</p><p>How can it be absurd to simply state the observable, provable truth? I repeat: Jordan Peterson is not a man of the Right. By his own admission, he is not a right winger of ANY sort. Jordan Peterson is not on the side of civilization and the West. Jordan Peterson is not a positive influence on anyone. Jordan Peterson is actively seeking the destruction of your family, your nation, and your civilization, because he believes that is necessary in order to prevent World War III.</p><p>And yes, he is quite crazy. That’s why he is prescribed the relevant medication, because he is mentally ill.</p><p>Seriously, what is <i>wrong</i> with you people? The fact that one leftist occasionally disagrees with another leftist does not place either of them on the ideological Right! I feel like I’m talking to particularly obtuse Germans in the early 1930s.</p><p>“Look, Hitler is NOT a good German! He does NOT have Germany’s best interests in mind. He’s not even <i>German</i>, for crying out loud!”</p><p>“Ja, but he fights Communists! So he must be a good Christian man who luffs Germany, ja?”</p><p>And people wonder why I despise binary thinkers. The Abelardian approach applies to truth, not to qualitative analysis. This isn’t that hard. FFS, if you know a gradient exists, <i>then there are by definition more than two possibilities!</i></p></div>",
  "content_text": "It is simply astonishing how many people simply refuse to accept that a card-carrying socialist academic is, in fact, a man of the Left, even when the guy repeatedly insists that he is. From the comments of the most recent Darkstream.\nPraxis71:\nI agree with your assessment of Peterson, but he’s not a “leftist”… that’s absurd.  The guy is simply a classical liberal although yes, he does sometimes contradict himself.\nThe Sydney Morning Herald:\nWhat do you think of the things that people, and I’m especially thinking of your opponents, get wrong about you?\nJordan Peterson:\nTheir basic proposition is that, you know, first of all, that I’m a right winger of some sort and that’s just not the case.\nHow can it be absurd to simply state the observable, provable truth? I repeat: Jordan Peterson is not a man of the Right. By his own admission, he is not a right winger of ANY sort. Jordan Peterson is not on the side of civilization and the West. Jordan Peterson is not a positive influence on anyone. Jordan Peterson is actively seeking the destruction of your family, your nation, and your civilization, because he believes that is necessary in order to prevent World War III.\nAnd yes, he is quite crazy. That’s why he is prescribed the relevant medication, because he is mentally ill.\nSeriously, what is\nwrong\nwith you people? The fact that one leftist occasionally disagrees with another leftist does not place either of them on the ideological Right! I feel like I’m talking to particularly obtuse Germans in the early 1930s.\n“Look, Hitler is NOT a good German! He does NOT have Germany’s best interests in mind. He’s not even\nGerman\n, for crying out loud!”\n“Ja, but he fights Communists! So he must be a good Christian man who luffs Germany, ja?”\nAnd people wonder why I despise binary thinkers. The Abelardian approach applies to truth, not to qualitative analysis. This isn’t that hard. FFS, if you know a gradient exists,\nthen there are by definition more than two possibilities!",
  "tags": [
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-24T14:00:02+00:00"
}