{
  "url": "https://voxday.net/2018/06/25/mailvox-leave-jordy-alone/",
  "scraped_at": "2025-12-19T21:08:26.413699",
  "title": "Mailvox: LEAVE JORDY ALONE",
  "date_display": "June 25, 2018",
  "date_iso": "2018-06-25T16:46:03+00:00",
  "date_from_url": "2018-06-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am fully aware that my position on Jordan Peterson has cost me more than a few readers, and apparently, even a few backers. So be it.</p><blockquote><p>Time to lay of Jordan Peterson. I do not understand why you continue to bitch on and on and on about Jordan Peterson. I really didn’t understand why you started in the first place, but it has gotten very stale and very old. This is not a good look for you or the businesses you are working on.</p><p>You may think you have unleashed devastating rhetorical attacks on him. But you have not made your case with people who look past the rhetoric for the facts. I’m not the only one who knows this. People who have been supportive of you in the past are disgusted by this sniping. One told me it’s jealousy. My response was, well, Vox claims it isn’t. But he also claims that about Scalzi and Shapiro.</p><p>The thing is, I know that you know you have not made the case against Peterson. “Jordan Peterson is a physical coward.” Really? Well, I know a guy who was given a corporate position of high responsibility, and his response was to sabotage the IT department to promote his own ambitions. SJW? Well, he says he isn’t, but you know what they say about SJWs….</p><p>This is a bad look for you and the projects you’re working on. Sure, the blog is personal, and CH, Arkhaven and IG are separate. But your blog is the gateway for this stuff. I’ve supported two of your FreeStarter projects, and I’ve bought pretty much everything CH has published. Some of those books I’ll never get to. I already have a backlog of Voxiversity videos.</p><p>But this continued trashing of Jordan Peterson is causing me to rethink my support of these things. I can support John Wright and Peter Grant directly. If there’s a book–to be honest, I don’t read any comics other than the Arkhaven ones–I can always buy it if I want it. But there’s no point in supporting a brand that is determined to marginalize itself.</p><p>I urge you to let this go. I don’t care how you feel about him personally. But you have published far, far more than the topic ever deserved.</p></blockquote><p>This was my response:</p><p><i>The fact that you think I have not made my case is precisely why I am going to continue making it until you and everyone else who continues to defend him admits the truth about him. You don’t seem to understand that my attacks on him are not rhetorical, they are substantive, they are factual, and they are correct.</i><br><i><br/></i><i>I appreciate your previous support, but the fact is that you have a choice to make. And if you’re going to stand by Jordan Peterson, then you really should stop supporting me, Castalia House, and Arkhaven. Because you are not really on the side of the Americans, the Christians, and the nationalists, you are on the side of the atheists, the globalists, and the socialists.</i><br><i><br/></i><i>I am not going to abandon the truth because someone won’t give me money. And you can tell all of those people who are disgusted by this sniping, who believe that I am jealous, that they can fuck off. They may have thought they supported me, but they never knew me at all. I don’t want anything to do with them, not now, and not in the future when they come crawling around to admit that I was correct all along. Again.</i><br><i><br/></i><i>I didn’t mind it when most of my readers initially thought I was wrong about Peterson. But with the information that is out there about him now, there is absolutely no excuse for defending or standing by the man.</i><br><i><br/></i><i>Regards,</i><br><i>Vox</i></br></br></br></br></br></p><p>If I didn’t sell out when GT Interactive offered me millions of dollars, if I didn’t take any of the multiple offers that have been made for Castalia House, if I refused to remove the chapters on Republican media whores at the demand of Fox News and Thomas Nelson in the full knowledge that they would cancel the book contract (the latter even tried unsuccessfully to get out of paying what they contractually owed me), what makes anyone think I won’t hesitate to let <i>every single one</i> of our backers and buyers walk away rather than alter my well-informed position on Jordan Peterson one iota?</p><p>If I was the sort of man who would pay any attention to these demands, if I was the sort of individual inclined to demonstrate that kind of intellectual flexibility, then absolutely none of you should donate so much as penny to help us make movies, because there is going to be <i>all kinds</i> of intense pressure to compromise, to sell out, to back down, to adulterate, and to shade the truth during the funding and film-making process, to say nothing of when we have some initial success and Disney or Netflix swoops in and offers to simply buy the whole thing out for enough cash to let me live like a king for the rest of my life.</p><p>Is that truly what you want from me? Do you really think so little of me, or at least, of my self-respect?</p><p>And yes, Jordan Peterson is a physical coward. Anyone who is a physical coward at the age of 12 is almost always still a physical coward as an adult, barring subsequent military service. If you still haven’t grasped that Peterson is a nasty little gamma by nature, consider this excerpt from <i>12 Rules of Life</i>.</p><blockquote class=\"tr_bq\"><p>I had a rocky friendship with a Métis kid, Rene Heck, when I was in elementary school. It was rocky because the situation was complex. There was a large cultural divide between Rene and me. His clothes were dirtier. He was rougher in speech and attitude. I had skipped a grade in school, and was, in addition, small for my age. Rene was a big, smart, good-looking kid, and he was tough. We were in grade six together, in a class taught by my father. Rene was caught chewing gum. “Rene,” said my father, “spit that gum out. You look like a cow.” “Ha, ha,” I laughed, under my breath. “Rene the cow.” Rene might have been a cow, but there was nothing wrong with his hearing. “Peterson,” he said, “after school—you’re dead.”</p><p>Earlier in the morning, Rene and I had arranged to see a movie that night at the local movie theatre, the Gem. It looked like that was off. In any case, the rest of the day passed, quickly and unpleasantly, as it does when threat and pain lurk. Rene was more than capable of giving me a good pounding. After school, I took off for the bike stands outside the school as fast as I could, but Rene beat me there. We circled around the bikes, him on one side, me on the other. We were characters in a “Keystone Cops” short. As long as I kept circling, he couldn’t catch me, but my strategy couldn’t work forever. I yelled out that I was sorry, but he wasn’t mollified. His pride was hurt, and he wanted me to pay.</p><p>I crouched down and hid behind some bikes, keeping an eye on Rene. “Rene,” I yelled, “I’m sorry I called you a cow. Let’s quit fighting.” He started to approach me again. I said, “Rene, I am sorry I said that. Really. And I still want to go to the movie with you.” This wasn’t just a tactic. I meant it. Otherwise what happened next would not have happened. Rene stopped circling. Then he stared at me. Then he broke into tears. Then he ran off. That was Native-white relationships in a nutshell, in our hard little town. We never did go to a movie together.</p></blockquote><p>Peterson is also an intellectual coward. You could see this when he hastily backed down rather than assert the right of free association when called out for his inconsistency on civil rights. Besides, leaving Jordy alone would interfere with Jordanetics Week at the Daily Meme Wars.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://cdn.idka.com/70ebaea1-e922-47e7-86b5-66c3441035fc\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"308\" data-original-width=\"510\" decoding=\"async\" src=\"https://cdn.idka.com/70ebaea1-e922-47e7-86b5-66c3441035fc\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"308\" data-original-width=\"510\" data-src=\"https://cdn.idka.com/70ebaea1-e922-47e7-86b5-66c3441035fc\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20510%20308%22%3E%3C/svg%3E\"/></a></div></div>",
  "content_text": "I am fully aware that my position on Jordan Peterson has cost me more than a few readers, and apparently, even a few backers. So be it.\nTime to lay of Jordan Peterson. I do not understand why you continue to bitch on and on and on about Jordan Peterson. I really didn’t understand why you started in the first place, but it has gotten very stale and very old. This is not a good look for you or the businesses you are working on.\nYou may think you have unleashed devastating rhetorical attacks on him. But you have not made your case with people who look past the rhetoric for the facts. I’m not the only one who knows this. People who have been supportive of you in the past are disgusted by this sniping. One told me it’s jealousy. My response was, well, Vox claims it isn’t. But he also claims that about Scalzi and Shapiro.\nThe thing is, I know that you know you have not made the case against Peterson. “Jordan Peterson is a physical coward.” Really? Well, I know a guy who was given a corporate position of high responsibility, and his response was to sabotage the IT department to promote his own ambitions. SJW? Well, he says he isn’t, but you know what they say about SJWs….\nThis is a bad look for you and the projects you’re working on. Sure, the blog is personal, and CH, Arkhaven and IG are separate. But your blog is the gateway for this stuff. I’ve supported two of your FreeStarter projects, and I’ve bought pretty much everything CH has published. Some of those books I’ll never get to. I already have a backlog of Voxiversity videos.\nBut this continued trashing of Jordan Peterson is causing me to rethink my support of these things. I can support John Wright and Peter Grant directly. If there’s a book–to be honest, I don’t read any comics other than the Arkhaven ones–I can always buy it if I want it. But there’s no point in supporting a brand that is determined to marginalize itself.\nI urge you to let this go. I don’t care how you feel about him personally. But you have published far, far more than the topic ever deserved.\nThis was my response:\nThe fact that you think I have not made my case is precisely why I am going to continue making it until you and everyone else who continues to defend him admits the truth about him. You don’t seem to understand that my attacks on him are not rhetorical, they are substantive, they are factual, and they are correct.\nI appreciate your previous support, but the fact is that you have a choice to make. And if you’re going to stand by Jordan Peterson, then you really should stop supporting me, Castalia House, and Arkhaven. Because you are not really on the side of the Americans, the Christians, and the nationalists, you are on the side of the atheists, the globalists, and the socialists.\nI am not going to abandon the truth because someone won’t give me money. And you can tell all of those people who are disgusted by this sniping, who believe that I am jealous, that they can fuck off. They may have thought they supported me, but they never knew me at all. I don’t want anything to do with them, not now, and not in the future when they come crawling around to admit that I was correct all along. Again.\nI didn’t mind it when most of my readers initially thought I was wrong about Peterson. But with the information that is out there about him now, there is absolutely no excuse for defending or standing by the man.\nRegards,\nVox\nIf I didn’t sell out when GT Interactive offered me millions of dollars, if I didn’t take any of the multiple offers that have been made for Castalia House, if I refused to remove the chapters on Republican media whores at the demand of Fox News and Thomas Nelson in the full knowledge that they would cancel the book contract (the latter even tried unsuccessfully to get out of paying what they contractually owed me), what makes anyone think I won’t hesitate to let\nevery single one\nof our backers and buyers walk away rather than alter my well-informed position on Jordan Peterson one iota?\nIf I was the sort of man who would pay any attention to these demands, if I was the sort of individual inclined to demonstrate that kind of intellectual flexibility, then absolutely none of you should donate so much as penny to help us make movies, because there is going to be\nall kinds\nof intense pressure to compromise, to sell out, to back down, to adulterate, and to shade the truth during the funding and film-making process, to say nothing of when we have some initial success and Disney or Netflix swoops in and offers to simply buy the whole thing out for enough cash to let me live like a king for the rest of my life.\nIs that truly what you want from me? Do you really think so little of me, or at least, of my self-respect?\nAnd yes, Jordan Peterson is a physical coward. Anyone who is a physical coward at the age of 12 is almost always still a physical coward as an adult, barring subsequent military service. If you still haven’t grasped that Peterson is a nasty little gamma by nature, consider this excerpt from\n12 Rules of Life\n.\nI had a rocky friendship with a Métis kid, Rene Heck, when I was in elementary school. It was rocky because the situation was complex. There was a large cultural divide between Rene and me. His clothes were dirtier. He was rougher in speech and attitude. I had skipped a grade in school, and was, in addition, small for my age. Rene was a big, smart, good-looking kid, and he was tough. We were in grade six together, in a class taught by my father. Rene was caught chewing gum. “Rene,” said my father, “spit that gum out. You look like a cow.” “Ha, ha,” I laughed, under my breath. “Rene the cow.” Rene might have been a cow, but there was nothing wrong with his hearing. “Peterson,” he said, “after school—you’re dead.”\nEarlier in the morning, Rene and I had arranged to see a movie that night at the local movie theatre, the Gem. It looked like that was off. In any case, the rest of the day passed, quickly and unpleasantly, as it does when threat and pain lurk. Rene was more than capable of giving me a good pounding. After school, I took off for the bike stands outside the school as fast as I could, but Rene beat me there. We circled around the bikes, him on one side, me on the other. We were characters in a “Keystone Cops” short. As long as I kept circling, he couldn’t catch me, but my strategy couldn’t work forever. I yelled out that I was sorry, but he wasn’t mollified. His pride was hurt, and he wanted me to pay.\nI crouched down and hid behind some bikes, keeping an eye on Rene. “Rene,” I yelled, “I’m sorry I called you a cow. Let’s quit fighting.” He started to approach me again. I said, “Rene, I am sorry I said that. Really. And I still want to go to the movie with you.” This wasn’t just a tactic. I meant it. Otherwise what happened next would not have happened. Rene stopped circling. Then he stared at me. Then he broke into tears. Then he ran off. That was Native-white relationships in a nutshell, in our hard little town. We never did go to a movie together.\nPeterson is also an intellectual coward. You could see this when he hastily backed down rather than assert the right of free association when called out for his inconsistency on civil rights. Besides, leaving Jordy alone would interfere with Jordanetics Week at the Daily Meme Wars.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-25T15:46:03+00:00"
}