{
  "url": "https://voxday.net/2018/06/05/mailvox-unorthodox-or-enemy/",
  "scraped_at": "2025-12-19T21:05:22.445007",
  "title": "Mailvox: unorthodox or enemy?",
  "date_display": "June 5, 2018",
  "date_iso": "2018-06-05T12:25:16+00:00",
  "date_from_url": "2018-06-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JD doesn’t understand why I identify Jordan Peterson and Ben Shapiro as enemies rather than unorthodox allies:</p><blockquote><p>I’ve read your blog and watched your videos related to Jordan Peterson with a great deal of interest. One of the members of a book club I’m in picked 12 Rules and we have been reading it and discussing it. (Everybody in the club seems to be able to separate the wheat from the chaff.)  My adult sons have enthusiastically sent me several videos featuring JP debating various people and my kids see JP as a valuable Culture Warrior and I tend to agree.</p><p>My question is, how do we draw the boundaries between who is orthodox and who is heterodox when it comes to the Culture Wars? When does heterodoxy become heresy and the person is now an enemy?</p><p>For example, within Christianity, historically the non-negotiable is the Word of God- the Living and the Written. To be a Christian, one must believe and follow Jesus Christ as God in the flesh, co-equal and co-eternal with God the Father. The Bible must be viewed as authored by God and authoritative. We have Scripture and creeds that have more or less defined the boundaries of what can be legitimately defined as “Christian.”</p><p>This, of course, doesn’t mean that Christians don’t disagree about a variety of things doctrinally, in church polity, and personal practice. This reality, however, doesn’t mean it is a free for all and we cannot employ terms like “orthodox,” “heterodox,” and even “heretic.”</p><p>Is there similar boundary defining principles and nomenclature in the Culture War? When does someone’s beliefs or practices move them from the Ally list to the Enemy list?</p><p>Back to Jordan Peterson. I don’t believe he is a Christian. I disagree with all of the Jungian psychobabble. I agree that he seems to be unstable in his own mental health and has some delusions of grandeur. (I know for a fact that he is a terrible writer.)</p><p>I won’t be a bit surprised if “something” comes out about him in the future and the wheels come off the wagon, but for now, I see him as being on “our side” of the Culture War- he is anti-political correctness, anti-identity politics, he believes in biological gender and traditional gender roles, he believes in meritocracy and personal freedom and responsibility, also, he generally makes the right people angry. Is this guy not an ally?</p><p>I remain unconvinced that he is an enemy based upon his not knowing the nuances of Jewish IQ studies or the conspiracy theory type arguments put forth about globalism or supporting pedophilia or any of the “controlled opposition” theorizing. Much of that seems tenuous at best- especially when compared to the black and white areas of agreement I do have with Jordan Peterson.</p><p>Why isn’t it enough to say, “I agree with JP here and here and here, but I disagree with him here and here and here, but hey, he is on our side”? What crosses the line into heresy? (I feel similarly about Ben Shapiro- I get the “chickenhawk” stuff and I wish he supported Trump, but the guy isn’t he doing great work in the Culture Wars?)</p><p>What makes your Enemy Status for people like JP and Shapiro even more confusing is the people that you don’t distance yourself from- I’ll take Shapiro over Milo any day in the Culture Wars, and if JP is a nut-job snake oil salesman, Alex Jones is every bit a nut-job who sells literal snake oil on his website. I don’t get it.</p><p>How do you determine who is orthodox and heterodox, who is an ally and who is a heretic? How much uniformity of belief is necessary for unity in the Culture War?</p></blockquote><p><i>To which I responded:</i></p><p>You and your kids are totally wrong. Jordan Peterson is a paid up, committed professional globalist. His objectives are directly opposed to the survival of America and the West.</p><p>If someone was trying to fix Nazism, you wouldn’t say that he’s a Jewish ally. If someone was trying to fix Communism, you wouldn’t say that he is a capitalist ally. Jordan Peterson is trying to fix globalism. He is trying to destroy nationalism, your nation, and your people.</p><p>He is not an ally of any kind.</p><p>The fact that you would take Ben Shapiro over Milo just indicates how utterly clueless you are about these things. I’m sorry to be so direct, but it’s absolutely true. Shapiro, Peterson, et al are 100 percent enemies. There is literally nothing good about them or their objectives.</p><p><i>And further to which:</i></p><p>A civic nationalist is a heterodox ally. They are, for the most part, merely mistaken, deluded, naive, or ignorant rather than evil. A globalist, an imperialist, or a tribalist who seeks the destruction of the West or any Western nation is an enemy, <i>especially </i>if they wear the false cloak of a civic nationalist to conceal their true objectives. Donald Trump, Alex Jones, Milo, and Mike Cernovich are all pro-American civic nationalists and therefore allies of the nationalist Right even though their nationalism is not orthodox nationalism. Jordan Peterson and George Soros are both globalists who are self-avowed enemies of nationalism. Richard Spencer and Andrew Anglin are left-wing racial imperialists and therefore enemies of the Right and of nationalism. Ben Shapiro, Jonah Goldberg, Ta-Nehisi Coates, and a whole host of commentators both “liberal” and “conservative” are tribalists who are seeking to, at best, take advantage of, and at worst, destroy America and the West for the benefit of their particular tribes.</p><p>Just as there are Christian non-negotiables, there are nationalist non-negotiables. Anyone who subscribes to any variant of Mahmoud Ahmadinejad’s claim that “the contemporary U.S. belongs to all nations” is an enemy of America and the West, no matter how much they claim to love either of them. Our side is not against identity politics. Our side is against having to play identity politics in the first place, but once multiple and competing identities have been permitted to establish themselves in a polity, identity politics are the new reality and playing according to their well-established rules is an absolute necessity. Those who claim to be against identity politics at this point are nothing more than outdated and irrelevant posers.</p><p>Binary thinkers tend to have a serious problem recognizing that just because X criticizes the way Y is going about achieving his objectives, that does not mean that X is opposed to either Y or Y’s objectives. For example, Lenin tried to fix the economic failures of communism with his New Economic Policy of 1922, which instituted “a free market and capitalism, both subject to state control while socialized state enterprises were to operate on a profit basis”, but that did not make him either an enemy of communism or a capitalist ally.</p></div>",
  "content_text": "JD doesn’t understand why I identify Jordan Peterson and Ben Shapiro as enemies rather than unorthodox allies:\nI’ve read your blog and watched your videos related to Jordan Peterson with a great deal of interest. One of the members of a book club I’m in picked 12 Rules and we have been reading it and discussing it. (Everybody in the club seems to be able to separate the wheat from the chaff.)  My adult sons have enthusiastically sent me several videos featuring JP debating various people and my kids see JP as a valuable Culture Warrior and I tend to agree.\nMy question is, how do we draw the boundaries between who is orthodox and who is heterodox when it comes to the Culture Wars? When does heterodoxy become heresy and the person is now an enemy?\nFor example, within Christianity, historically the non-negotiable is the Word of God- the Living and the Written. To be a Christian, one must believe and follow Jesus Christ as God in the flesh, co-equal and co-eternal with God the Father. The Bible must be viewed as authored by God and authoritative. We have Scripture and creeds that have more or less defined the boundaries of what can be legitimately defined as “Christian.”\nThis, of course, doesn’t mean that Christians don’t disagree about a variety of things doctrinally, in church polity, and personal practice. This reality, however, doesn’t mean it is a free for all and we cannot employ terms like “orthodox,” “heterodox,” and even “heretic.”\nIs there similar boundary defining principles and nomenclature in the Culture War? When does someone’s beliefs or practices move them from the Ally list to the Enemy list?\nBack to Jordan Peterson. I don’t believe he is a Christian. I disagree with all of the Jungian psychobabble. I agree that he seems to be unstable in his own mental health and has some delusions of grandeur. (I know for a fact that he is a terrible writer.)\nI won’t be a bit surprised if “something” comes out about him in the future and the wheels come off the wagon, but for now, I see him as being on “our side” of the Culture War- he is anti-political correctness, anti-identity politics, he believes in biological gender and traditional gender roles, he believes in meritocracy and personal freedom and responsibility, also, he generally makes the right people angry. Is this guy not an ally?\nI remain unconvinced that he is an enemy based upon his not knowing the nuances of Jewish IQ studies or the conspiracy theory type arguments put forth about globalism or supporting pedophilia or any of the “controlled opposition” theorizing. Much of that seems tenuous at best- especially when compared to the black and white areas of agreement I do have with Jordan Peterson.\nWhy isn’t it enough to say, “I agree with JP here and here and here, but I disagree with him here and here and here, but hey, he is on our side”? What crosses the line into heresy? (I feel similarly about Ben Shapiro- I get the “chickenhawk” stuff and I wish he supported Trump, but the guy isn’t he doing great work in the Culture Wars?)\nWhat makes your Enemy Status for people like JP and Shapiro even more confusing is the people that you don’t distance yourself from- I’ll take Shapiro over Milo any day in the Culture Wars, and if JP is a nut-job snake oil salesman, Alex Jones is every bit a nut-job who sells literal snake oil on his website. I don’t get it.\nHow do you determine who is orthodox and heterodox, who is an ally and who is a heretic? How much uniformity of belief is necessary for unity in the Culture War?\nTo which I responded:\nYou and your kids are totally wrong. Jordan Peterson is a paid up, committed professional globalist. His objectives are directly opposed to the survival of America and the West.\nIf someone was trying to fix Nazism, you wouldn’t say that he’s a Jewish ally. If someone was trying to fix Communism, you wouldn’t say that he is a capitalist ally. Jordan Peterson is trying to fix globalism. He is trying to destroy nationalism, your nation, and your people.\nHe is not an ally of any kind.\nThe fact that you would take Ben Shapiro over Milo just indicates how utterly clueless you are about these things. I’m sorry to be so direct, but it’s absolutely true. Shapiro, Peterson, et al are 100 percent enemies. There is literally nothing good about them or their objectives.\nAnd further to which:\nA civic nationalist is a heterodox ally. They are, for the most part, merely mistaken, deluded, naive, or ignorant rather than evil. A globalist, an imperialist, or a tribalist who seeks the destruction of the West or any Western nation is an enemy,\nespecially\nif they wear the false cloak of a civic nationalist to conceal their true objectives. Donald Trump, Alex Jones, Milo, and Mike Cernovich are all pro-American civic nationalists and therefore allies of the nationalist Right even though their nationalism is not orthodox nationalism. Jordan Peterson and George Soros are both globalists who are self-avowed enemies of nationalism. Richard Spencer and Andrew Anglin are left-wing racial imperialists and therefore enemies of the Right and of nationalism. Ben Shapiro, Jonah Goldberg, Ta-Nehisi Coates, and a whole host of commentators both “liberal” and “conservative” are tribalists who are seeking to, at best, take advantage of, and at worst, destroy America and the West for the benefit of their particular tribes.\nJust as there are Christian non-negotiables, there are nationalist non-negotiables. Anyone who subscribes to any variant of Mahmoud Ahmadinejad’s claim that “the contemporary U.S. belongs to all nations” is an enemy of America and the West, no matter how much they claim to love either of them. Our side is not against identity politics. Our side is against having to play identity politics in the first place, but once multiple and competing identities have been permitted to establish themselves in a polity, identity politics are the new reality and playing according to their well-established rules is an absolute necessity. Those who claim to be against identity politics at this point are nothing more than outdated and irrelevant posers.\nBinary thinkers tend to have a serious problem recognizing that just because X criticizes the way Y is going about achieving his objectives, that does not mean that X is opposed to either Y or Y’s objectives. For example, Lenin tried to fix the economic failures of communism with his New Economic Policy of 1922, which instituted “a free market and capitalism, both subject to state control while socialized state enterprises were to operate on a profit basis”, but that did not make him either an enemy of communism or a capitalist ally.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-05T11:25:16+00:00"
}