{
  "url": "https://voxday.net/2018/06/02/mailvox-opinions-solicited-and-otherwise/",
  "scraped_at": "2025-12-19T21:04:58.916314",
  "title": "Mailvox: opinions solicited and otherwise",
  "date_display": "June 2, 2018",
  "date_iso": "2018-06-02T13:32:27+00:00",
  "date_from_url": "2018-06-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Darkstream viewer comments on <a href=\"https://www.youtube.com/watch?v=NeDq_253_zI\">a recent video</a>:</p><blockquote><p>Spot on. One additional tendency worth noting: Gammas feel an almost irresistible urge to contribute their unsolicited opinions. Most folks do this from time-to-time, of course, and it is usually relatively harmless. But with the Gamma, it is pathological and constant. The need for attention, for adulation, means he must do this all the time.</p><p>For the Gamma seeking to rid himself of Gamma behavior patterns, as you said in the video, it is often preferable to just shut the fuck up. Fact of the matter is, smart or not, Gammas are insufferable toolbags and nobody wants to hear their opinions, even if the Gamma is right. No, especially if the Gamma is right. The only thing worse than a loser is a loser who, by some quirk of fate, chance, whatever… is actually right about something. He’ll lord it over everyone and talk himself up incessantly. He’ll milk it far past the point of good sense.</p><p>I know, I did enough of this in my time as a Gamma.</p><p>If a Gamma (or a former one, I suppose) feels the desire to contribute his opinion, it is often best to do so in private, one-on-one, and not speak of it further, not use it for social gain, posturing, etc… This increases the chance that the opinion will be appreciated, rather than dismissed as coming from a passive-aggressive ass.</p><p>Put another way: let others take the credit for a while. Serve and follow – for those worthy of those things, anyway – don’t try to command. It never works for the Gamma.</p></blockquote><p>This is one of the most readily identifiable aspects of the Gamma, which is his insistence on offering unsolicited advice, opinion, and correction. Not only is it unsolicited, it is <i>absolutely unwanted</i>, particularly when it can do absolutely no good at all.</p><p>There are few things more infuriating than presenting something that is clearly finished, only to have the immediate response be, <i>“do you know what you should have done instead?”</i> No, I really don’t, and I especially do not want to know <i>right now</i>, even in the unlikely event that you happen to be right.</p><p>The petty delight with which Gammas appear to take in attempting to crush the joy in the accomplishments of others is possibly their most despicable trait. I don’t know if they are genuinely seeking to be helpful, if they are seeking to demoralize, if they are being passive-aggressively mean, if they are constitutionally giving a compliment without providing a complaint to balance it, if it is an expression of envy, or if it is some combination of these motivations that depends upon the circumstances.</p><p>But unless you are the other individual’s coach, mentor, or boss, do NOT offer criticism unless it is specifically requested when something is first announced or shown to you. It not only doesn’t make the other person appreciate your helpful contribution to their future success, it makes them want to punch you in the face… and determined to leave you out of the loop next time. The correct thing to do is say, “congratulations!” The polite thing to do is throw in a compliment or two, if you can honestly do so. And then <i>leave it at that</i>.</p><p>What positive purpose is served when telling someone that something that is obviously finished could have, or should have, been different?</p><p>I’m not saying that you should lie if someone asks you if you like something. If you don’t like it, then don’t say you do. But if you do, then say so, find something nice to say about it, and leave it at that. There is a time and place for criticism; the moment of the initial unveiling is absolutely not one of them. Relentless negativity is not attractive to anyone, and creative men and women are particularly averse to it by necessity.</p><p>That being said, I have learned over the years that most people’s opinions of incomplete art are totally useless. I call it “the drums are too loud” phenomenon. It used to drive me crazy, when playing an early rough cut of a Psykosonik song for someone, that they would almost inevitably fail to have any useful opinion on the melody, the rhythm, the structure, the lyrics, or the vocal stylings, but would reliably concentrate on something entirely trivial like the mix. I finally stopped letting anyone hear anything that wasn’t at least a prospective final mix.</p><p>UPDATE: NH attempts to answer my implied question:</p><blockquote><p>You said you weren’t sure if gammas offer unsolicited advice because “they are seeking to demoralize, if they are being passive-aggressively mean, if they are constitutionally giving a compliment without providing a complaint to balance it, if it is an expression of envy, or if it is some combination of these motivations that depends upon the circumstances.”</p><p>It <i>starts </i>because they have no experience and little to offer, so in a sense, it’s meant to be harmless, maybe helpful in its own way. Criticizing feels smart when you’re young, and it’s easy. They honestly don’t know at first how much pain and sacrifice lead up to presenting that finished product.</p><p>Over time, however, they learn how they get a strong emotional reaction when they do it… and that’s power. If there’s one thing that a gamma is dying of thirst for, it’s power over others. So, they keep doing it until their bitterness eats them alive.</p></blockquote></div>",
  "content_text": "A Darkstream viewer comments on\na recent video\n:\nSpot on. One additional tendency worth noting: Gammas feel an almost irresistible urge to contribute their unsolicited opinions. Most folks do this from time-to-time, of course, and it is usually relatively harmless. But with the Gamma, it is pathological and constant. The need for attention, for adulation, means he must do this all the time.\nFor the Gamma seeking to rid himself of Gamma behavior patterns, as you said in the video, it is often preferable to just shut the fuck up. Fact of the matter is, smart or not, Gammas are insufferable toolbags and nobody wants to hear their opinions, even if the Gamma is right. No, especially if the Gamma is right. The only thing worse than a loser is a loser who, by some quirk of fate, chance, whatever… is actually right about something. He’ll lord it over everyone and talk himself up incessantly. He’ll milk it far past the point of good sense.\nI know, I did enough of this in my time as a Gamma.\nIf a Gamma (or a former one, I suppose) feels the desire to contribute his opinion, it is often best to do so in private, one-on-one, and not speak of it further, not use it for social gain, posturing, etc… This increases the chance that the opinion will be appreciated, rather than dismissed as coming from a passive-aggressive ass.\nPut another way: let others take the credit for a while. Serve and follow – for those worthy of those things, anyway – don’t try to command. It never works for the Gamma.\nThis is one of the most readily identifiable aspects of the Gamma, which is his insistence on offering unsolicited advice, opinion, and correction. Not only is it unsolicited, it is\nabsolutely unwanted\n, particularly when it can do absolutely no good at all.\nThere are few things more infuriating than presenting something that is clearly finished, only to have the immediate response be,\n“do you know what you should have done instead?”\nNo, I really don’t, and I especially do not want to know\nright now\n, even in the unlikely event that you happen to be right.\nThe petty delight with which Gammas appear to take in attempting to crush the joy in the accomplishments of others is possibly their most despicable trait. I don’t know if they are genuinely seeking to be helpful, if they are seeking to demoralize, if they are being passive-aggressively mean, if they are constitutionally giving a compliment without providing a complaint to balance it, if it is an expression of envy, or if it is some combination of these motivations that depends upon the circumstances.\nBut unless you are the other individual’s coach, mentor, or boss, do NOT offer criticism unless it is specifically requested when something is first announced or shown to you. It not only doesn’t make the other person appreciate your helpful contribution to their future success, it makes them want to punch you in the face… and determined to leave you out of the loop next time. The correct thing to do is say, “congratulations!” The polite thing to do is throw in a compliment or two, if you can honestly do so. And then\nleave it at that\n.\nWhat positive purpose is served when telling someone that something that is obviously finished could have, or should have, been different?\nI’m not saying that you should lie if someone asks you if you like something. If you don’t like it, then don’t say you do. But if you do, then say so, find something nice to say about it, and leave it at that. There is a time and place for criticism; the moment of the initial unveiling is absolutely not one of them. Relentless negativity is not attractive to anyone, and creative men and women are particularly averse to it by necessity.\nThat being said, I have learned over the years that most people’s opinions of incomplete art are totally useless. I call it “the drums are too loud” phenomenon. It used to drive me crazy, when playing an early rough cut of a Psykosonik song for someone, that they would almost inevitably fail to have any useful opinion on the melody, the rhythm, the structure, the lyrics, or the vocal stylings, but would reliably concentrate on something entirely trivial like the mix. I finally stopped letting anyone hear anything that wasn’t at least a prospective final mix.\nUPDATE: NH attempts to answer my implied question:\nYou said you weren’t sure if gammas offer unsolicited advice because “they are seeking to demoralize, if they are being passive-aggressively mean, if they are constitutionally giving a compliment without providing a complaint to balance it, if it is an expression of envy, or if it is some combination of these motivations that depends upon the circumstances.”\nIt\nstarts\nbecause they have no experience and little to offer, so in a sense, it’s meant to be harmless, maybe helpful in its own way. Criticizing feels smart when you’re young, and it’s easy. They honestly don’t know at first how much pain and sacrifice lead up to presenting that finished product.\nOver time, however, they learn how they get a strong emotional reaction when they do it… and that’s power. If there’s one thing that a gamma is dying of thirst for, it’s power over others. So, they keep doing it until their bitterness eats them alive.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-02T12:32:27+00:00"
}