{
  "url": "https://voxday.net/2018/06/14/mailvox-righteousness-and-virtue/",
  "scraped_at": "2025-12-19T21:06:41.870527",
  "title": "Mailvox: righteousness and virtue",
  "date_display": "June 14, 2018",
  "date_iso": "2018-06-14T13:15:06+00:00",
  "date_from_url": "2018-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A reader asks about a distinction:</p><blockquote class=\"tr_bq\"><p>I have recently been reading Aristotle to get my head around many of the arguments you make against Jordan Peterson. As such, I am curious about what you see being the difference between acting righteously and virtuously, or are they one and the same to you.</p></blockquote><p><b>Acting righteously: </b>acting in accordance with God’s Will. Only God can determine this, Man can only make the attempt without full knowledge of whether he is doing so successfully or not.</p><p><b>Acting virtuously:</b> acting in accordance with a specified virtue. These are mostly defined and determined by Man, so one can behave virtuously and know that one is doing so, except in the cases where virtue and righteousness happen to overlap. But one can act in a virtuous manner that is unrighteous; not all Satanists are cowardly and even a murderous thief can be charitable with his ill-gotten gains.</p><p>Aristotelian moral virtue falls somewhere in between virtue and righteousness. It is more akin to what I would describe as eucivicism, or civic virtue. Due to his philosophy being pre-Christian, I tend to be more influenced by Aristotle’s thinking on intellectual virtue than on moral virtue, although eucivicism is definitely desirable from both worldly and philosophical perspectives.</p></div>",
  "content_text": "A reader asks about a distinction:\nI have recently been reading Aristotle to get my head around many of the arguments you make against Jordan Peterson. As such, I am curious about what you see being the difference between acting righteously and virtuously, or are they one and the same to you.\nActing righteously:\nacting in accordance with God’s Will. Only God can determine this, Man can only make the attempt without full knowledge of whether he is doing so successfully or not.\nActing virtuously:\nacting in accordance with a specified virtue. These are mostly defined and determined by Man, so one can behave virtuously and know that one is doing so, except in the cases where virtue and righteousness happen to overlap. But one can act in a virtuous manner that is unrighteous; not all Satanists are cowardly and even a murderous thief can be charitable with his ill-gotten gains.\nAristotelian moral virtue falls somewhere in between virtue and righteousness. It is more akin to what I would describe as eucivicism, or civic virtue. Due to his philosophy being pre-Christian, I tend to be more influenced by Aristotle’s thinking on intellectual virtue than on moral virtue, although eucivicism is definitely desirable from both worldly and philosophical perspectives.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-14T12:15:06+00:00"
}