{
  "url": "https://voxday.net/2018/06/29/quelle-surprise-2/",
  "scraped_at": "2025-12-19T21:09:07.055695",
  "title": "Quelle surprise",
  "date_display": "June 29, 2018",
  "date_iso": "2018-06-29T14:25:10+00:00",
  "date_from_url": "2018-06-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The shooting at the Capital Gazette had nothing to do with politics, the God-Emperor, or Milo Yiannopoulos. It was the culmination of <a href=\"http://www.dailymail.co.uk/news/article-5898141/At-four-shot-gunman-Marylands-Capital-Gazette-newspaper-building.html\">a nutjob’s seven-year vendetta</a> against the people at the paper who had publicly humiliated him in 2011.</p><blockquote><p>Gunman, 38, who shot five dead in the Capital Gazette newsroom, after he sued the paper and harassed staff over 2011 article that exposed him for Facebook stalking a woman… Ramos was the subject of a 2011 article – titled ‘Jarrod wants to be your friend’ – after he pleaded guilty to criminal harassment. The article described him as having threatened and harassed a former high school classmate on Facebook. He sent the woman numerous emails spanning several months calling her vulgar names and telling her to kill herself.</p><p>In the years that followed, Ramos sued the newspaper, the reporter who initially wrote about the case, a judge and the woman who testified against him. His defamation suit was thrown out on appeal in 2015 because Ramos failed to prove that what the newspaper had printed was untrue.</p><p>Ramos routinely harassed journalists from the newspaper on Twitter in scores of profanity laced tweets. One of those tweets targeted one of the journalists killed on Thursday, Rob Hiaasen. In another tweet, he discussed how he’d enjoy seeing the paper stop publishing, but ‘it would be nicer’ to see two journalists ‘cease breathing’.</p><p>Other tweets from his account referenced previous journalist shootings, including the 2015 terror attack on the Charlie Hebdo offices in Paris</p><p>The woman who was harassed by Ramos told WBAL TV that she warned an ex-police officer years ago that he would ‘be young next mass shooter’. Adding that he’s a ‘f***ing nut job’, the woman said Ramos because fixated with her for no apparent reason.</p></blockquote><p>That didn’t stop Paypal and Venmo from <a href=\"https://www.zerohedge.com/news/2018-06-28/milo-banned-paypal-after-shooting-says-he-made-private-joke-about-murdering\">shutting down Milo’s accounts with them</a>, thereby proving that you shouldn’t EVER talk to the media at all. What has been widely reported as his “call to murder journalists” was nothing more than his standard email response to media requests, sent to two different media outlets that had been harassing him for a comment on an unrelated matter. It wasn’t a public “call” for anything at all. That is a flat-out lie.</p><blockquote class=\"tr_bq\"><p>Yiannapolous was asked by the <i>Observer </i>and <i>Daily Beast</i> to comment on two unrelated articles published Tuesday, Yiannopoulos – who is known as a provocateur – texted the <i>Observer</i>‘s Davis Richardson “I can’t wait for the vigilante squads to start gunning journalists down on sight,” while emailing the <i>Beast</i>‘s Will Sommer the same response. When asked to elaborate, Milo told the <i>Observer </i>that his statement was his “standard response to a request for comment,” which he also sent to the <i>Daily Beast</i>‘s Will Sommer, who published it as well.</p></blockquote><p>Notice how the media managed to twist even the refusal of a request for comment into something they could use to damage him. <i><b>THIS IS WHY YOU DO NOT TALK TO THEM <u>AT ALL</u>!</b></i> I had already stopped even emailing them back to decline their requests anymore before this happened. Stefan Molyneux had the right policy all along. Never talk to the mainstream news media <u>at all</u>. They are desperate for content and they are desperate for comments. Don’t give them <u>anything</u>.</p><p>And no, I don’t want to hear from any of the usual morons who have a fiendishly clever plan that no one has ever thought of before on how the media can totally be trolled and recorded and humiliated, thus proving what smart boys they are.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://cdn.idka.com/b1c788f8-b016-473f-b8cb-386dd31e0e93\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" data-original-height=\"283\" data-original-width=\"508\" decoding=\"async\" src=\"https://cdn.idka.com/b1c788f8-b016-473f-b8cb-386dd31e0e93\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"283\" data-original-width=\"508\" data-src=\"https://cdn.idka.com/b1c788f8-b016-473f-b8cb-386dd31e0e93\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20508%20283%22%3E%3C/svg%3E\"/></a></div></div>",
  "content_text": "The shooting at the Capital Gazette had nothing to do with politics, the God-Emperor, or Milo Yiannopoulos. It was the culmination of\na nutjob’s seven-year vendetta\nagainst the people at the paper who had publicly humiliated him in 2011.\nGunman, 38, who shot five dead in the Capital Gazette newsroom, after he sued the paper and harassed staff over 2011 article that exposed him for Facebook stalking a woman… Ramos was the subject of a 2011 article – titled ‘Jarrod wants to be your friend’ – after he pleaded guilty to criminal harassment. The article described him as having threatened and harassed a former high school classmate on Facebook. He sent the woman numerous emails spanning several months calling her vulgar names and telling her to kill herself.\nIn the years that followed, Ramos sued the newspaper, the reporter who initially wrote about the case, a judge and the woman who testified against him. His defamation suit was thrown out on appeal in 2015 because Ramos failed to prove that what the newspaper had printed was untrue.\nRamos routinely harassed journalists from the newspaper on Twitter in scores of profanity laced tweets. One of those tweets targeted one of the journalists killed on Thursday, Rob Hiaasen. In another tweet, he discussed how he’d enjoy seeing the paper stop publishing, but ‘it would be nicer’ to see two journalists ‘cease breathing’.\nOther tweets from his account referenced previous journalist shootings, including the 2015 terror attack on the Charlie Hebdo offices in Paris\nThe woman who was harassed by Ramos told WBAL TV that she warned an ex-police officer years ago that he would ‘be young next mass shooter’. Adding that he’s a ‘f***ing nut job’, the woman said Ramos because fixated with her for no apparent reason.\nThat didn’t stop Paypal and Venmo from\nshutting down Milo’s accounts with them\n, thereby proving that you shouldn’t EVER talk to the media at all. What has been widely reported as his “call to murder journalists” was nothing more than his standard email response to media requests, sent to two different media outlets that had been harassing him for a comment on an unrelated matter. It wasn’t a public “call” for anything at all. That is a flat-out lie.\nYiannapolous was asked by the\nObserver\nand\nDaily Beast\nto comment on two unrelated articles published Tuesday, Yiannopoulos – who is known as a provocateur – texted the\nObserver\n‘s Davis Richardson “I can’t wait for the vigilante squads to start gunning journalists down on sight,” while emailing the\nBeast\n‘s Will Sommer the same response. When asked to elaborate, Milo told the\nObserver\nthat his statement was his “standard response to a request for comment,” which he also sent to the\nDaily Beast\n‘s Will Sommer, who published it as well.\nNotice how the media managed to twist even the refusal of a request for comment into something they could use to damage him.\nTHIS IS WHY YOU DO NOT TALK TO THEM\nAT ALL\n!\nI had already stopped even emailing them back to decline their requests anymore before this happened. Stefan Molyneux had the right policy all along. Never talk to the mainstream news media\nat all\n. They are desperate for content and they are desperate for comments. Don’t give them\nanything\n.\nAnd no, I don’t want to hear from any of the usual morons who have a fiendishly clever plan that no one has ever thought of before on how the media can totally be trolled and recorded and humiliated, thus proving what smart boys they are.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-29T13:25:10+00:00"
}