{
  "url": "https://voxday.net/2018/06/10/see-how-they-run/",
  "scraped_at": "2025-12-19T21:05:59.477733",
  "title": "See how they run",
  "date_display": "June 10, 2018",
  "date_iso": "2018-06-10T09:31:37+00:00",
  "date_from_url": "2018-06-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The UK police have demonstrated that they can’t control criminals as Londonistan spirals out of control, so the native population has been shown exactly <a href=\"http://www.dailymail.co.uk/news/article-5824805/Supporters-Tommy-Robinson-clash-police-London.html\">how to protest with impunity</a>: with numbers, mopeds, machetes, and hammers.</p><blockquote><p>Supporters of Tommy Robinson have clashed with police at a Whitehall demonstration after hearing Dutch far-right MP Geert Wilders call for the English Defence League founder to be freed.</p><p>Rows of riot police blocked the gate down the Mall leading to Buckingham Palace where the Royal Family gathered on the balcony after celebrating Trooping the Colour just hours before. Five arrests have been made and five officers were reportedly injured during the demonstration which saw some of Robinson’s supporters appear to throw bottles, metal barriers and traffic cones at police.</p><p>Wilders, 54, who was banned from Britain in 2009 only to get it overturned, has attended today’s protest after the EDL founder was jailed for 13 months.</p><p>Robinson pleaded guilty to contempt of court and breaching the terms of a suspended sentence he was handed last May for a similar offence. His supporters have gathered in huge numbers at a series of protests outside Downing Street, Leeds Crown Court and even at British embassies in Europe.</p></blockquote><p>This video of <a href=\"https://youtu.be/v9q-0wj31-E?t=60\">the UK police running away</a> from the British protesters is very similar to one from 2009 when they ran <a href=\"https://www.youtube.com/watch?v=PBtct-z9JS8\">from marching Muslims</a>. The police are no longer capable of maintaining order and the current UK government no longer answers to the British people nor defends their interests, their children, or their borders, which is why one that will defend the British people from their enemies, foreign and domestic, has become necessary.</p><p>Especially as Londonistan increasingly begins to resemble Bogota, with its highly mobile violent criminals. There are 423 moped-related crimes being reported per week, up from 282 the previous year. At the same time, the House of Lords <a href=\"http://www.dailymail.co.uk/debate/article-5825737/ANDREW-BRIDGEN-time-Theresa-control-stakes-never-higher.html\">is full of anti-British traitors</a>:</p><blockquote class=\"tr_bq\"><p>A group of unaccountable pro-Remain members of the Lords, aided and abetted by a few Tory rebels in the Lords and Commons, want to reverse or sabotage what more than 17 million Britons voted for in the 2016 referendum: to take back control of our laws, our money and our borders.</p></blockquote></div>",
  "content_text": "The UK police have demonstrated that they can’t control criminals as Londonistan spirals out of control, so the native population has been shown exactly\nhow to protest with impunity\n: with numbers, mopeds, machetes, and hammers.\nSupporters of Tommy Robinson have clashed with police at a Whitehall demonstration after hearing Dutch far-right MP Geert Wilders call for the English Defence League founder to be freed.\nRows of riot police blocked the gate down the Mall leading to Buckingham Palace where the Royal Family gathered on the balcony after celebrating Trooping the Colour just hours before. Five arrests have been made and five officers were reportedly injured during the demonstration which saw some of Robinson’s supporters appear to throw bottles, metal barriers and traffic cones at police.\nWilders, 54, who was banned from Britain in 2009 only to get it overturned, has attended today’s protest after the EDL founder was jailed for 13 months.\nRobinson pleaded guilty to contempt of court and breaching the terms of a suspended sentence he was handed last May for a similar offence. His supporters have gathered in huge numbers at a series of protests outside Downing Street, Leeds Crown Court and even at British embassies in Europe.\nThis video of\nthe UK police running away\nfrom the British protesters is very similar to one from 2009 when they ran\nfrom marching Muslims\n. The police are no longer capable of maintaining order and the current UK government no longer answers to the British people nor defends their interests, their children, or their borders, which is why one that will defend the British people from their enemies, foreign and domestic, has become necessary.\nEspecially as Londonistan increasingly begins to resemble Bogota, with its highly mobile violent criminals. There are 423 moped-related crimes being reported per week, up from 282 the previous year. At the same time, the House of Lords\nis full of anti-British traitors\n:\nA group of unaccountable pro-Remain members of the Lords, aided and abetted by a few Tory rebels in the Lords and Commons, want to reverse or sabotage what more than 17 million Britons voted for in the 2016 referendum: to take back control of our laws, our money and our borders.",
  "tags": [
    "UK"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-10T08:31:37+00:00"
}