{
  "url": "https://voxday.net/2018/06/25/shutting-down-the-seaborne-invasion/",
  "scraped_at": "2025-12-19T21:08:22.726577",
  "title": "Shutting down the seaborne invasion",
  "date_display": "June 25, 2018",
  "date_iso": "2018-06-25T08:27:28+00:00",
  "date_from_url": "2018-06-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Angela Merkel’s African flotilla <a href=\"http://www.dailymail.co.uk/news/article-5880003/Italy-order.html\">is finally being stopped</a> by Italy’s new government.</p><blockquote><p>Italy is seeking to have seven boats carrying roughly 1,000 migrants needing rescue off Libya taken back to North Africa, according to a Spanish aid group. Proactiva Open Arms, which has rescued thousands of migrants in the Mediterranean, said the Italians want the Libyan coast guard to conduct the rescues and return the migrants.</p><p>Proactiva said in a tweet that Italian coast guard authorities who coordinate rescues sent out advisories to all ships in the area but told the aid group: ‘We don’t need your help.’</p><p>In a tweet on Sunday, hard-line interior minister Matteo Salvini said: ‘It’s right that the Libyan authorities intervene, as they’ve been doing for days, without having the NGOs interrupt them and disturb them.’ It comes days after Salvini refused to let a rescue boat with 224 migrants on board dock in Italy, saying those on board ‘will only see Italy on a postcard’.</p></blockquote><p>My guess is that Italy is going to start seizing the NGO ships first, then forcing the boats to return to Libya. That would probably be the most politically palatable place to start, since no one has any sympathy for them anymore. It would be more effective to simply sink everything that enters Italian waters <i>pour encourager les autres</i>, but that will probably not be necessary once Salvini starts the street-by-street repatriations he has stated are necessary. After all, there isn’t much point in paying traffickers to bring you to Italy if you’re just going to be sent back to a camp in Libya right away.</p><p>It’s going to be interesting to see the next political polls in Italy. I expect the fast-growing popularity of Salvini and La Lega is going to astonish the world. It’s very interesting to see how the 5 Stelle leaders are speaking in much more aggressively nationalist terms as well; 5 Stelle may be the senior partners in the alliance, but it’s clear that La Lega is the driving force.</p><p>The BBC is whining that Salvini’s “ferocious anti-immigrant rhetoric is proving very popular.”<br><i><br/></i><i>Also in Italy, we need a mass cleaning, street by street, quarter by quarter, piazza by piazza. A strong manner is needed, because there are entire areas of cities, entire parts of Italy that are out of control. </i><br><i><br/></i>Compare that strong and forthright language with Trump’s indecisive civic nationalism that is too much for even the average US conservative to stomach, despite the fact that the genuinely American portion of the US population is already a relatively small minority. That is why Italy will ultimately survive and the USA will not. It appears that even when faced with an clear, present, and existential danger, Americans, like the white South Africans, will not even contemplate defending themselves or their nation until it is far too late. Apparently they prefer to instead redefine their nation out of existence.</br></br></p><p>It is highly unlikely that whatever calls itself “America” in the year 2100 will have any meaningful connection to the Christian English nation that declared itself independent of the British crown in 1776. The dirt that once belonged to the Iroquois and the Americans will belong to someone else.</p></div>",
  "content_text": "Angela Merkel’s African flotilla\nis finally being stopped\nby Italy’s new government.\nItaly is seeking to have seven boats carrying roughly 1,000 migrants needing rescue off Libya taken back to North Africa, according to a Spanish aid group. Proactiva Open Arms, which has rescued thousands of migrants in the Mediterranean, said the Italians want the Libyan coast guard to conduct the rescues and return the migrants.\nProactiva said in a tweet that Italian coast guard authorities who coordinate rescues sent out advisories to all ships in the area but told the aid group: ‘We don’t need your help.’\nIn a tweet on Sunday, hard-line interior minister Matteo Salvini said: ‘It’s right that the Libyan authorities intervene, as they’ve been doing for days, without having the NGOs interrupt them and disturb them.’ It comes days after Salvini refused to let a rescue boat with 224 migrants on board dock in Italy, saying those on board ‘will only see Italy on a postcard’.\nMy guess is that Italy is going to start seizing the NGO ships first, then forcing the boats to return to Libya. That would probably be the most politically palatable place to start, since no one has any sympathy for them anymore. It would be more effective to simply sink everything that enters Italian waters\npour encourager les autres\n, but that will probably not be necessary once Salvini starts the street-by-street repatriations he has stated are necessary. After all, there isn’t much point in paying traffickers to bring you to Italy if you’re just going to be sent back to a camp in Libya right away.\nIt’s going to be interesting to see the next political polls in Italy. I expect the fast-growing popularity of Salvini and La Lega is going to astonish the world. It’s very interesting to see how the 5 Stelle leaders are speaking in much more aggressively nationalist terms as well; 5 Stelle may be the senior partners in the alliance, but it’s clear that La Lega is the driving force.\nThe BBC is whining that Salvini’s “ferocious anti-immigrant rhetoric is proving very popular.”\nAlso in Italy, we need a mass cleaning, street by street, quarter by quarter, piazza by piazza. A strong manner is needed, because there are entire areas of cities, entire parts of Italy that are out of control.\nCompare that strong and forthright language with Trump’s indecisive civic nationalism that is too much for even the average US conservative to stomach, despite the fact that the genuinely American portion of the US population is already a relatively small minority. That is why Italy will ultimately survive and the USA will not. It appears that even when faced with an clear, present, and existential danger, Americans, like the white South Africans, will not even contemplate defending themselves or their nation until it is far too late. Apparently they prefer to instead redefine their nation out of existence.\nIt is highly unlikely that whatever calls itself “America” in the year 2100 will have any meaningful connection to the Christian English nation that declared itself independent of the British crown in 1776. The dirt that once belonged to the Iroquois and the Americans will belong to someone else.",
  "tags": [
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-25T07:27:28+00:00"
}