{
  "url": "https://voxday.net/2018/06/13/stalins-strike-the-historians-view/",
  "scraped_at": "2025-12-19T21:06:32.674289",
  "title": "Stalin’s strike: the historian’s view",
  "date_display": "June 13, 2018",
  "date_iso": "2018-06-13T15:00:08+00:00",
  "date_from_url": "2018-06-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>I asked Nigel Askey, the author of the massive </i>Operation Barbarossa: The Complete Organisational and Statistical Analysis, and Military Simulation<i>, about his opinion of Viktor Suvorov’s thesis we’ve been discussing this week. He graciously gave permission for me to quote his reply on the blog.</i></p><p>Your email has prompted me, and I have now ordered a copy of Suvorov’s <i>Chief Culprit</i>. I haven’t read this one by Suvorov; I probably should. However it looks very similar to, and an extension of, his original <i>Icebreaker: Who Started the Second World War?</i> This one was also an entertaining read. I might as well express my opinion about the overall Suvorov hypothesis as it has gained such a lot of attention.</p><p>I agree with Suvorov on some points, but definitely not on others.  I believe Stalin did have plans to invade Western Europe at some point, and it completely fits with the overall Soviet – and Stalin – policy of communist expansion as well as Stalin’s character. He definitely gambled on the fact that Germany would be embroiled in  prolonged war with France and Britain, which would buy him time to prepare. He gambled on it lasting at least until 1942, which was backed up by his own Stavka assessments. In addition, it was around this time he attenuated, and mostly stopped, the massively damaging officer purging that were going on. He realised that any Red Army that was going to conquer Western Europe would need decent officers, and that Germany was now a bigger external threat to him than any ‘internal’ threat from his officer corps. I believe Stalin was hoping his Army, especially the mass of newly formed Mechanised Corps with its new tank types; all belatedly formed after the Germans had demonstrated their panzer corps in France, would be ready by the summer of 1942, one year after Barbarossa started. Similarly, his air force was desperately reequipping with more modern fighters and bombers (Yak-1, LaGG-3, Mig-3, Pe-2, etc), and a massive air crew training program was underway.</p><p>France and Britain, of course,  had handed all this to him on a plate, so to speak, by declaring war on Germany when Germany invaded Poland, but then only a few days later did not declare war on the USSR when it did exactly the same thing from the East! From a moral perspective, this has always left a ‘bad taste in my mouth’: especially when Britain and France historically claim the moral high ground about why they declared war on Germany in 1939. It turns out that so called treaty with Poland by France and Britain was worded so that it only applied to German aggression; apparently anyone else could do what they liked to any of the three countries. How’s that for selective moralising  and post-war hypocrisy? Anyway I digress.</p><p>Where I really disagree completely with Suvorov is timing. 1941, definitely not. The summer of 1942 was very likely Stalin’s plan, and even then, there was a struggle to be ready. I can guarantee that there was absolutely no way the Soviet armed forces were in any shape to conduct a major offensive into Poland and then into Western Europe in June or July 1941. They were just so totally unready at so many levels, they would have been very easily stopped. Their logistical and C&amp;C set up was so bad they would have almost stopped themselves, as they almost did in Poland in 1939. One just has to look at their absolutely dismal performance when they did invade Poland from the East – it degenerated onto a ludicrous fiasco against a  very token Polish force – and the almost equally poor performance against Finland in the Winter War to see just a few of the problems.</p><p>I have examined in extreme  detail the Soviet forces right across the USSR on 22nd June 1941, and not just apparent raw number in the Western Military Districts  as Suvorov does. This analysis has been done for the Red Army (the RKKA) and the air force (the VMF). Special attention has been reserved for the forces deployed in the Western Military Districts and the Mechanised Forces. These include a massive and complete Soviet Tank Deployment Matrix and Aircraft Deployment Matrix, which in a great many cases go down to individual tanks and aircraft. In addition, readiness, training, and HQ assignments are included, as well as positions ‘on the map’. In addition, the Soviet truck park is analysed, and it was in a terrible state, along with the Red Army supply and logistics state. All this will be fully published in Volume IIIB. The published Volume IIIA has the Western Military District land forces already.</p><p>In comparison to this and some research done by others, I find Suvorov’s figures to be high-level, superficial, token, and worst of all, very selective. I am sorry to say he takes the statistics that suit his agenda, and then simply throws them at the reader with a convincing argument. For the reader, presented with these ‘facts’, the conclusions are  convincing. However, no amount of convincing rhetoric can, in the end, replace weak argument foundations. For example, deeper analysis shows that the Soviets were employing what is termed an echelon defence strategy as laid out by various (now dead from the purges) Red Army theorists in the ‘Deep Battle’ and Deep Operations’ manner. These are not just offensive methodologies, they also lay out the mechanism to defend against  these types of attack as well. The fact that the Wehrmacht had surpassed this in real practical terms and totally ripped through both the 1st and 2nd level of these defences and then encircled them all was surprising, especially  to the Soviets. This, of course, has led to the “why were so many Soviet forces forwards and vulnerable?” questions. The Germans then had to work a bit to penetrate the 3rd echelon defences which were also being deployed and still formed on 22nd June 1941, largely the Stavka Reserves.</p><p>Well, its only with post-war hindsight, and the realisation of just how fast the Wehrmacht could operate and had perfected mobile warfare, that we realise how vulnerable the Soviet echelon defence was. To the Soviets at the time, and to the Western observers, it looked like a very reasonable set up. We are talking hundreds of kilometres of depth here, with multiple lines of defence, and not just a single concentration  of forward deployed troops apparently massing for an attack as proposed by Suvorov. Unfortunately, the Wehrmacht, as it was in 1941, could penetrate even hundreds of kilometres of such a defence in days, making all this look extremely vulnerable. Thus, with post-war hindsight, this looks like an extremely incompetent deployment, even for a defensive posture. Note, the Deep Battle and Deep Operations theories stressed the ability to go from a defensive posture to an offensive posture relatively quickly. Thus, when ready, the Red Army could transit from one to the other in a matter of weeks. Eg, in this case the  1st defensive line, mostly rifle divisions, would perform the breakthrough assault, while the 2nd echelon defensive lime, usually mobile mechanised forces, would exploit the breach. I am only stressing this because I do not want to portray the Red Army, or Stalin’s regime, as inherently a defensive force backed by a defensive ideology: the echelon defence used suited both. But it does not mean the Soviets were about to attack in June 1941, and it does explain why they were deployed as they were historically.</p><p>Another example is the relatively forward deployment of many VVS units, another fact used by Suvorov. Yes it was stupid to deploy so many VVS air units within a few hundred km of the border and these were hit by the initial surprise airfield attacks. However, the VVS was a huge force, the biggest air force in the world at that time, and was deployed in a great many locations across the USSR. The very large majority of these units were undergoing replacement and training operations and exercises, including those in the Western military Districts, the vast majority of the VVS including most of their new fighter and bomber units were actually deployed well inside the USSR in the Internal Military districts, and the vital Long Range DBA forces, the largest strategic bomber force in the World at that time, was deployed very deep in the USSR and completely unreachable by the Luftwaffe. Suvorov only talks about the VVS forces in the Western Military Districts and how they were therefore obviously “deployed for an attack?”. He doesn’t mention that over 70{329aa4aef5613a80085c3dd6bd84f5d0e8f5581fdc29e0868f0c3a40e8b25a32} of the VVS and VMF (naval air-forces), and especially the bomber forces, were in no position to attack anything in the West, and that the DBA, a very large and totally offensive force was so far back it could barely reach Western Europe.</p><p>He also doesn’t focus on the overall readiness of the VVS forces in the Western Military Districts just as he doesn’t focus on the readiness or state of the mechanised force (see below). Only raw numbers are used, which are close to useless if there is no context and other factors are not included.  No doubt these VVS forces in the depths of the USSR would have been redeployed forward by the summer of 1942. As it was they survived the initial Luftwaffe onslaught. The fact that the Luftwaffe the systematically destroyed these forces from July to October 1941, is a separate discourse. It does, however, again, highlight how unready the VVS was overall (again, supposed to be fully ready by 1942, if lucky), and how most of the VVS units were entrenched in the depths of USSR that it took that length of time for the Luftwaffe to reach them. None of this suits with Suvorov’s hypothesis.</p><p>A final example is the state of the Soviet Mechanised Corps. This is arguably the biggest single massive hole in Suvorov’s whole hypothesis. Over two-thirds of this entire Red Army force had only started forming in February-March  1941, only months earlier. This was the most critical force for any invasion of Europe. The divisions in this force had plenty of tanks, especially those in the Western Military Districts. But this was simply because the USSR had the biggest tank park in the world due to its pre-war production going back to the early 1930s. I have no doubt that Suvorov sticks to these raw tank numbers, most of these were T-26s and BT types only because this is what was mostly produced. However, over 80 percent of these divisions were barely mobile in June 1941! Most were still actually forming and, incredibly, only one mechanised corps in the entire Red Army had actually done any pre-war divisional sized manoeuvres by June 1941! All this is detailed in extreme detail in Volume IIIA for each division for anyone who really wants to know the facts. These divisions had barely mobile artillery, most had no trucks for their infantry, most had almost no mobile  workshop and repair facilities for their tanks, many had almost none at all yet, etc. The list goes on and on.</p><p>Many of these so called tank and mechanised divisions were far less mobile than the standard German infantry divisions they faced in June 1941. In fact we find that the average German infantry division that invaded the USSR in June 1941 had considerably more trucks and other types of vehicles than the average Soviet tank and mechanised division. Yet the German infantry divisions were apparently horse-drawn according to most western literature.  What people don’t realise is that the vast majority of Soviet tanks and mechanised  forces in 1941 were destroyed by German <i>infantry </i>divisions. In many cases the German infantry divisions, which almost all had a  motorised anti-tank and reconnaissance battalion, moved faster than the floundering and barely formed tank and mechanised divisions (in the 2nd defensive echelon),  and encircled them! These Soviet divisions never even got to see a German tank, as the German panzer divisions had already moved far eastwards. The biggest actual killer of Soviet tanks in 1941 was the much misaligned little 36mm PaK 36, called the ‘door knocker’ in post-war literature in the West, in German infantry divisions, and the result of breakdowns and abandonment by  the Red Army tankers because there was never any infrastructure(in the barely formed divisions to keep them going.</p><p>And yet, despite all this, Suvorov maintains that this force was going to attack and run over Western Europe in June 1941. It is really a joke!  I believe Suvorov is banking on people’s general ignorance and sensational revisionism to sell books! In reality, the Red Army in June 1941 would barely have reached the others side of Poland against the Wehrmacht in 1941 before it ran out of steam at the operational level. It would have then been promptly encircled by the many-times-more combat ready Wehrmacht and annihilated. The Soviets and Stalin were many things in the summer of 1941, but they were not that stupid.</p><p>I am all for revisionist history, but only if it is carefully researched and thought out. For example, despite the apparent crazy numbers that apparently make Hitler look nuts to attack the USSR, you have to take into account all the factors. Hitler always planned to “destroy the Bolshevik menace to Western Civilisation” from the very earliest days: he made this very clear. The German OKH new the Soviets were preparing to attack at some point, but would not be anywhere near ready by June 1941. This was also why Stalin was so diplomatically passive at this time: he did not want to prematurely trigger a military conflict until at least 1942. Even the Germans were surprised how fast France had fallen. They also knew the state of the Red Army as they had studied their recent operation.</p><p>Thus, despite their underestimating the Soviet raw numbers of tanks and aircraft, they actually accurately estimated the Red Army’s readiness, training, logistics and C&amp;C. With these factors and many others I have not included, they laid their plans, and ultimately came much closer to defeating the USSR than most people realise. With a few different strategic-level and operational-level decisions, I believe the Axis forces might very well have defeated the USSR by mid-1942, or at least enforced some type of Vichy French type treaty. Stalin, of course, would have likely met his end.  In that sense, Hitler waiting until 1942 to attack a much stronger Red Army and VVS was definitely not a good idea.</p><p>Also, yes, I believe in the longer term that Stalin was definitely planning to conquer Western Europe. As I said, I do not have a problem with revisionist history as such, as long as it stands up to some close scrutiny.</p></div>",
  "content_text": "I asked Nigel Askey, the author of the massive\nOperation Barbarossa: The Complete Organisational and Statistical Analysis, and Military Simulation\n, about his opinion of Viktor Suvorov’s thesis we’ve been discussing this week. He graciously gave permission for me to quote his reply on the blog.\nYour email has prompted me, and I have now ordered a copy of Suvorov’s\nChief Culprit\n. I haven’t read this one by Suvorov; I probably should. However it looks very similar to, and an extension of, his original\nIcebreaker: Who Started the Second World War?\nThis one was also an entertaining read. I might as well express my opinion about the overall Suvorov hypothesis as it has gained such a lot of attention.\nI agree with Suvorov on some points, but definitely not on others.  I believe Stalin did have plans to invade Western Europe at some point, and it completely fits with the overall Soviet – and Stalin – policy of communist expansion as well as Stalin’s character. He definitely gambled on the fact that Germany would be embroiled in  prolonged war with France and Britain, which would buy him time to prepare. He gambled on it lasting at least until 1942, which was backed up by his own Stavka assessments. In addition, it was around this time he attenuated, and mostly stopped, the massively damaging officer purging that were going on. He realised that any Red Army that was going to conquer Western Europe would need decent officers, and that Germany was now a bigger external threat to him than any ‘internal’ threat from his officer corps. I believe Stalin was hoping his Army, especially the mass of newly formed Mechanised Corps with its new tank types; all belatedly formed after the Germans had demonstrated their panzer corps in France, would be ready by the summer of 1942, one year after Barbarossa started. Similarly, his air force was desperately reequipping with more modern fighters and bombers (Yak-1, LaGG-3, Mig-3, Pe-2, etc), and a massive air crew training program was underway.\nFrance and Britain, of course,  had handed all this to him on a plate, so to speak, by declaring war on Germany when Germany invaded Poland, but then only a few days later did not declare war on the USSR when it did exactly the same thing from the East! From a moral perspective, this has always left a ‘bad taste in my mouth’: especially when Britain and France historically claim the moral high ground about why they declared war on Germany in 1939. It turns out that so called treaty with Poland by France and Britain was worded so that it only applied to German aggression; apparently anyone else could do what they liked to any of the three countries. How’s that for selective moralising  and post-war hypocrisy? Anyway I digress.\nWhere I really disagree completely with Suvorov is timing. 1941, definitely not. The summer of 1942 was very likely Stalin’s plan, and even then, there was a struggle to be ready. I can guarantee that there was absolutely no way the Soviet armed forces were in any shape to conduct a major offensive into Poland and then into Western Europe in June or July 1941. They were just so totally unready at so many levels, they would have been very easily stopped. Their logistical and C&C set up was so bad they would have almost stopped themselves, as they almost did in Poland in 1939. One just has to look at their absolutely dismal performance when they did invade Poland from the East – it degenerated onto a ludicrous fiasco against a  very token Polish force – and the almost equally poor performance against Finland in the Winter War to see just a few of the problems.\nI have examined in extreme  detail the Soviet forces right across the USSR on 22nd June 1941, and not just apparent raw number in the Western Military Districts  as Suvorov does. This analysis has been done for the Red Army (the RKKA) and the air force (the VMF). Special attention has been reserved for the forces deployed in the Western Military Districts and the Mechanised Forces. These include a massive and complete Soviet Tank Deployment Matrix and Aircraft Deployment Matrix, which in a great many cases go down to individual tanks and aircraft. In addition, readiness, training, and HQ assignments are included, as well as positions ‘on the map’. In addition, the Soviet truck park is analysed, and it was in a terrible state, along with the Red Army supply and logistics state. All this will be fully published in Volume IIIB. The published Volume IIIA has the Western Military District land forces already.\nIn comparison to this and some research done by others, I find Suvorov’s figures to be high-level, superficial, token, and worst of all, very selective. I am sorry to say he takes the statistics that suit his agenda, and then simply throws them at the reader with a convincing argument. For the reader, presented with these ‘facts’, the conclusions are  convincing. However, no amount of convincing rhetoric can, in the end, replace weak argument foundations. For example, deeper analysis shows that the Soviets were employing what is termed an echelon defence strategy as laid out by various (now dead from the purges) Red Army theorists in the ‘Deep Battle’ and Deep Operations’ manner. These are not just offensive methodologies, they also lay out the mechanism to defend against  these types of attack as well. The fact that the Wehrmacht had surpassed this in real practical terms and totally ripped through both the 1st and 2nd level of these defences and then encircled them all was surprising, especially  to the Soviets. This, of course, has led to the “why were so many Soviet forces forwards and vulnerable?” questions. The Germans then had to work a bit to penetrate the 3rd echelon defences which were also being deployed and still formed on 22nd June 1941, largely the Stavka Reserves.\nWell, its only with post-war hindsight, and the realisation of just how fast the Wehrmacht could operate and had perfected mobile warfare, that we realise how vulnerable the Soviet echelon defence was. To the Soviets at the time, and to the Western observers, it looked like a very reasonable set up. We are talking hundreds of kilometres of depth here, with multiple lines of defence, and not just a single concentration  of forward deployed troops apparently massing for an attack as proposed by Suvorov. Unfortunately, the Wehrmacht, as it was in 1941, could penetrate even hundreds of kilometres of such a defence in days, making all this look extremely vulnerable. Thus, with post-war hindsight, this looks like an extremely incompetent deployment, even for a defensive posture. Note, the Deep Battle and Deep Operations theories stressed the ability to go from a defensive posture to an offensive posture relatively quickly. Thus, when ready, the Red Army could transit from one to the other in a matter of weeks. Eg, in this case the  1st defensive line, mostly rifle divisions, would perform the breakthrough assault, while the 2nd echelon defensive lime, usually mobile mechanised forces, would exploit the breach. I am only stressing this because I do not want to portray the Red Army, or Stalin’s regime, as inherently a defensive force backed by a defensive ideology: the echelon defence used suited both. But it does not mean the Soviets were about to attack in June 1941, and it does explain why they were deployed as they were historically.\nAnother example is the relatively forward deployment of many VVS units, another fact used by Suvorov. Yes it was stupid to deploy so many VVS air units within a few hundred km of the border and these were hit by the initial surprise airfield attacks. However, the VVS was a huge force, the biggest air force in the world at that time, and was deployed in a great many locations across the USSR. The very large majority of these units were undergoing replacement and training operations and exercises, including those in the Western military Districts, the vast majority of the VVS including most of their new fighter and bomber units were actually deployed well inside the USSR in the Internal Military districts, and the vital Long Range DBA forces, the largest strategic bomber force in the World at that time, was deployed very deep in the USSR and completely unreachable by the Luftwaffe. Suvorov only talks about the VVS forces in the Western Military Districts and how they were therefore obviously “deployed for an attack?”. He doesn’t mention that over 70{329aa4aef5613a80085c3dd6bd84f5d0e8f5581fdc29e0868f0c3a40e8b25a32} of the VVS and VMF (naval air-forces), and especially the bomber forces, were in no position to attack anything in the West, and that the DBA, a very large and totally offensive force was so far back it could barely reach Western Europe.\nHe also doesn’t focus on the overall readiness of the VVS forces in the Western Military Districts just as he doesn’t focus on the readiness or state of the mechanised force (see below). Only raw numbers are used, which are close to useless if there is no context and other factors are not included.  No doubt these VVS forces in the depths of the USSR would have been redeployed forward by the summer of 1942. As it was they survived the initial Luftwaffe onslaught. The fact that the Luftwaffe the systematically destroyed these forces from July to October 1941, is a separate discourse. It does, however, again, highlight how unready the VVS was overall (again, supposed to be fully ready by 1942, if lucky), and how most of the VVS units were entrenched in the depths of USSR that it took that length of time for the Luftwaffe to reach them. None of this suits with Suvorov’s hypothesis.\nA final example is the state of the Soviet Mechanised Corps. This is arguably the biggest single massive hole in Suvorov’s whole hypothesis. Over two-thirds of this entire Red Army force had only started forming in February-March  1941, only months earlier. This was the most critical force for any invasion of Europe. The divisions in this force had plenty of tanks, especially those in the Western Military Districts. But this was simply because the USSR had the biggest tank park in the world due to its pre-war production going back to the early 1930s. I have no doubt that Suvorov sticks to these raw tank numbers, most of these were T-26s and BT types only because this is what was mostly produced. However, over 80 percent of these divisions were barely mobile in June 1941! Most were still actually forming and, incredibly, only one mechanised corps in the entire Red Army had actually done any pre-war divisional sized manoeuvres by June 1941! All this is detailed in extreme detail in Volume IIIA for each division for anyone who really wants to know the facts. These divisions had barely mobile artillery, most had no trucks for their infantry, most had almost no mobile  workshop and repair facilities for their tanks, many had almost none at all yet, etc. The list goes on and on.\nMany of these so called tank and mechanised divisions were far less mobile than the standard German infantry divisions they faced in June 1941. In fact we find that the average German infantry division that invaded the USSR in June 1941 had considerably more trucks and other types of vehicles than the average Soviet tank and mechanised division. Yet the German infantry divisions were apparently horse-drawn according to most western literature.  What people don’t realise is that the vast majority of Soviet tanks and mechanised  forces in 1941 were destroyed by German\ninfantry\ndivisions. In many cases the German infantry divisions, which almost all had a  motorised anti-tank and reconnaissance battalion, moved faster than the floundering and barely formed tank and mechanised divisions (in the 2nd defensive echelon),  and encircled them! These Soviet divisions never even got to see a German tank, as the German panzer divisions had already moved far eastwards. The biggest actual killer of Soviet tanks in 1941 was the much misaligned little 36mm PaK 36, called the ‘door knocker’ in post-war literature in the West, in German infantry divisions, and the result of breakdowns and abandonment by  the Red Army tankers because there was never any infrastructure(in the barely formed divisions to keep them going.\nAnd yet, despite all this, Suvorov maintains that this force was going to attack and run over Western Europe in June 1941. It is really a joke!  I believe Suvorov is banking on people’s general ignorance and sensational revisionism to sell books! In reality, the Red Army in June 1941 would barely have reached the others side of Poland against the Wehrmacht in 1941 before it ran out of steam at the operational level. It would have then been promptly encircled by the many-times-more combat ready Wehrmacht and annihilated. The Soviets and Stalin were many things in the summer of 1941, but they were not that stupid.\nI am all for revisionist history, but only if it is carefully researched and thought out. For example, despite the apparent crazy numbers that apparently make Hitler look nuts to attack the USSR, you have to take into account all the factors. Hitler always planned to “destroy the Bolshevik menace to Western Civilisation” from the very earliest days: he made this very clear. The German OKH new the Soviets were preparing to attack at some point, but would not be anywhere near ready by June 1941. This was also why Stalin was so diplomatically passive at this time: he did not want to prematurely trigger a military conflict until at least 1942. Even the Germans were surprised how fast France had fallen. They also knew the state of the Red Army as they had studied their recent operation.\nThus, despite their underestimating the Soviet raw numbers of tanks and aircraft, they actually accurately estimated the Red Army’s readiness, training, logistics and C&C. With these factors and many others I have not included, they laid their plans, and ultimately came much closer to defeating the USSR than most people realise. With a few different strategic-level and operational-level decisions, I believe the Axis forces might very well have defeated the USSR by mid-1942, or at least enforced some type of Vichy French type treaty. Stalin, of course, would have likely met his end.  In that sense, Hitler waiting until 1942 to attack a much stronger Red Army and VVS was definitely not a good idea.\nAlso, yes, I believe in the longer term that Stalin was definitely planning to conquer Western Europe. As I said, I do not have a problem with revisionist history as such, as long as it stands up to some close scrutiny.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-13T14:00:08+00:00"
}