{
  "url": "https://voxday.net/2018/06/20/tedpedo-talks/",
  "scraped_at": "2025-12-19T21:07:38.249444",
  "title": "TEDpedo Talks",
  "date_display": "June 20, 2018",
  "date_iso": "2018-06-20T12:58:03+00:00",
  "date_from_url": "2018-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Pity the poor pedos… TEDx is trying to bury its pro-pedophilia advocacy by removing this video from its site and trying to get it pulled from YouTube. But this is what the globalist elite is actively and aggressively pushing for, this is the end game of all the LBGT-whatever nonsense.</p><div style=\"text-align: center;\"><iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/ocCAHbx1Fwo\" width=\"512\"></iframe></div><p>Let me tell you about Jonas Jonas is 19 years old, he studies law in Munich, in his spare time he likes to play soccer. Jonas has a secret which he thinks he cannot share with anyone, not even with<br>his best friend or with his parents, he’s just too afraid of anger, rejection, and repulsion. Jonas knows that he has to suppress his sexual drive for his entire life and he also knows that there will never be a loving and fulfilling partnership that he can enter because Jonas is a pedophile. He’s only attracted to female children between the ages of 6 and 12 years, but since he’s aware of the consequences for the children he has never given in to his sexual drive….</br></p><p>We can make a difference for Jonas, we as a society can be there for him. At the moment we live in a world that already excludes pedophiles because of their preference alone. Someone who is lonely<br>and excluded from society has little to lose and is at much higher risk to commit a crime like for example child<br>sexual abuse we can make Jonas feel that<br>he stays a valuable member of our<br>society although he’s a pedophile right<br>now most of us feel discomfort when we<br>think about this scenario and most of us<br>feel discomfort when we think about<br>pedophiles but just like pedophiles we<br>are not responsible for our feelings we<br>do not choose them but we are<br>responsible for our actions and we must<br>make a decision it is an our<br>responsibility to reflect and to<br>overcome our negative feelings about<br>pedophiles and to treat them with us<br>same respect we treat other people with<br>we should accept that pedophiles are<br>people who have not chosen their<br>sexuality and who unlike most of us will<br>never be able to live it out freely if<br>they want to lead an upright life we<br>should accept that pedophilia is a<br>sexual preference a thought a feeling<br>and not an act<br>we should differentiate between child<br>sexual abuse and pedophilia we shouldn’t<br>increase the suffering of pedophiles by<br>excluding them by blaming and mocking<br>them</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></div>",
  "content_text": "Pity the poor pedos… TEDx is trying to bury its pro-pedophilia advocacy by removing this video from its site and trying to get it pulled from YouTube. But this is what the globalist elite is actively and aggressively pushing for, this is the end game of all the LBGT-whatever nonsense.\nLet me tell you about Jonas Jonas is 19 years old, he studies law in Munich, in his spare time he likes to play soccer. Jonas has a secret which he thinks he cannot share with anyone, not even with\nhis best friend or with his parents, he’s just too afraid of anger, rejection, and repulsion. Jonas knows that he has to suppress his sexual drive for his entire life and he also knows that there will never be a loving and fulfilling partnership that he can enter because Jonas is a pedophile. He’s only attracted to female children between the ages of 6 and 12 years, but since he’s aware of the consequences for the children he has never given in to his sexual drive….\nWe can make a difference for Jonas, we as a society can be there for him. At the moment we live in a world that already excludes pedophiles because of their preference alone. Someone who is lonely\nand excluded from society has little to lose and is at much higher risk to commit a crime like for example child\nsexual abuse we can make Jonas feel that\nhe stays a valuable member of our\nsociety although he’s a pedophile right\nnow most of us feel discomfort when we\nthink about this scenario and most of us\nfeel discomfort when we think about\npedophiles but just like pedophiles we\nare not responsible for our feelings we\ndo not choose them but we are\nresponsible for our actions and we must\nmake a decision it is an our\nresponsibility to reflect and to\novercome our negative feelings about\npedophiles and to treat them with us\nsame respect we treat other people with\nwe should accept that pedophiles are\npeople who have not chosen their\nsexuality and who unlike most of us will\nnever be able to live it out freely if\nthey want to lead an upright life we\nshould accept that pedophilia is a\nsexual preference a thought a feeling\nand not an act\nwe should differentiate between child\nsexual abuse and pedophilia we shouldn’t\nincrease the suffering of pedophiles by\nexcluding them by blaming and mocking\nthem",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2018-06-20T11:58:03+00:00"
}