{
  "url": "https://voxday.net/2018/06/17/the-ostrich-strategy-2/",
  "scraped_at": "2025-12-19T21:07:05.650736",
  "title": "The ostrich strategy",
  "date_display": "June 17, 2018",
  "date_iso": "2018-06-17T13:03:56+00:00",
  "date_from_url": "2018-06-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t think simply <a href=\"http://boundingintocomics.com/2018/06/15/battlefield-sub-reddit-censors-critics-of-battlefield-v/\">putting your hands over your ears and refusing to listen</a> to your customers, users, and players is an effective customer service strategy. Or marketing strategy, for that matter.</p><blockquote><p>The folks who are running the Battlefield V subreddit are done listening to your complaints about historical accuracy. This week, a new rule was put in place by the group running it where the discussions about the game not being accurate to what happened in World War II are over. Originally, the post said <i>“No more bitching about historical accuracy, it’s a game, not a history book. Violations will have consequences.”</i> But that text was then edited to a somewhat friendlier version below.<br><i><br/></i><i>Edit: we get that y’all have valid criticism about battlefield V and the customisation options within the game. Sadly, this subreddit has proven to be unable to have a civil discussion about these things without devolving into name calling and slapfights. …</i><br><i><br/></i><i>Reddit admins have confirmed brigading and the modteams of the subs in question are fully cooperating to make sure it doesn’t happen again.</i><br><i><br/></i><i>Hate us all you want but we’re done with this bullshit.</i></br></br></br></p></blockquote><p>Of course, you know that Dice, EA, and the subredditors will proceed to claim that no one has any problem with their idiotic SJW historical revisionism because they haven’t seen or heard any complaints about it.</p><p>They may be done with this bullshit, but I’m done with <i>Battlefield</i>. And I’m very far from the only high-level player to turn my back on the game.</p></div>",
  "content_text": "I don’t think simply\nputting your hands over your ears and refusing to listen\nto your customers, users, and players is an effective customer service strategy. Or marketing strategy, for that matter.\nThe folks who are running the Battlefield V subreddit are done listening to your complaints about historical accuracy. This week, a new rule was put in place by the group running it where the discussions about the game not being accurate to what happened in World War II are over. Originally, the post said\n“No more bitching about historical accuracy, it’s a game, not a history book. Violations will have consequences.”\nBut that text was then edited to a somewhat friendlier version below.\nEdit: we get that y’all have valid criticism about battlefield V and the customisation options within the game. Sadly, this subreddit has proven to be unable to have a civil discussion about these things without devolving into name calling and slapfights. …\nReddit admins have confirmed brigading and the modteams of the subs in question are fully cooperating to make sure it doesn’t happen again.\nHate us all you want but we’re done with this bullshit.\nOf course, you know that Dice, EA, and the subredditors will proceed to claim that no one has any problem with their idiotic SJW historical revisionism because they haven’t seen or heard any complaints about it.\nThey may be done with this bullshit, but I’m done with\nBattlefield\n. And I’m very far from the only high-level player to turn my back on the game.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-17T12:03:56+00:00"
}