{
  "url": "https://voxday.net/2018/06/04/they-fought-the-germans/",
  "scraped_at": "2025-12-19T21:05:11.772830",
  "title": "They fought the Germans",
  "date_display": "June 4, 2018",
  "date_iso": "2018-06-04T13:44:14+00:00",
  "date_from_url": "2018-06-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And their grandsons promptly surrendered to the Pakistanis and the Windrush Generation. Winston’s Churchill’s brave words sound increasingly hollow three score and 18 years later.</p><blockquote><p>I have, myself, full confidence that if all do their duty, if nothing is neglected, and if the best arrangements are made, as they are being made, we shall prove ourselves once more able to defend our island home, to ride out the storm of war, and to outlive the menace of tyranny, if necessary for years, if necessary alone. At any rate, that is what we are going to try to do. That is the resolve of His Majesty’s Government – every man of them. That is the will of Parliament and the nation. The British Empire and the French Republic, linked together in their cause and in their need, will defend to the death their native soil, aiding each other like good comrades to the utmost of their strength.</p><p>Even though large tracts of Europe and many old and famous States have fallen or may fall into the grip of the Gestapo and all the odious apparatus of Nazi rule, we shall not flag or fail. We shall go on to the end. We shall fight in France, we shall fight on the seas and oceans, we shall fight with growing confidence and growing strength in the air, we shall defend our island, whatever the cost may be. We shall fight on the beaches, we shall fight on the landing grounds, we shall fight in the fields and in the streets, we shall fight in the hills; we shall never surrender, and if, which I do not for a moment believe, this island or a large part of it were subjugated and starving, then our Empire beyond the seas, armed and guarded by the British Fleet, would carry on the struggle, until, in God’s good time, the New World, with all its power and might, steps forth to the rescue and the liberation of the old.</p></blockquote><p>Not only have the British failed to fight in the fields and streets against a much bigger invasion than they faced from the Wehrmacht, they didn’t even fight at all! I am increasingly convinced that if the US soldiers who went overseas to fight against the Germans and Japanese had <i>any </i>idea what their sacrifices would eventually entail, both at home and abroad, they wouldn’t have been willing to go.</p><p>Of course, the post-1965 American performance has been even worse than their erstwhile “British brethren” in this regard. To this very day, most of you <i>still </i>don’t see any problem at all with tens of millions of fellow citizens born American in China, India, Iran, Mexico, Nigeria, and Portugal. Many of you, I have witnessed, even claim to prefer them to actual Americans, so long as they mouth platitudes of which you approve. I, on the other hand, am firmly convinced that the planet-wide Migration War is going to make the death toll of WWII look like a mild pre-game stretch. Never will have large-scale human suffering been more avoidable or more well-deserved. Almost everyone, from the highest government Minister to the lowest mudshark, is culpable to some degree.</p><p>No one reading here will ever be able to claim they were not warned. Repeatedly.</p><p>Anyhow, I tend to doubt clinging to the specious ideological doctrine of equality is going to provide anyone with much solace when three-quarters of the world’s population reenacts the post-imperial partition of India on a grander, more vicious scale. Those who claim “it can’t happen here” forget that <i>it already has</i>… most of it AFTER the writing of the Declaration of Independence.</p><p>UPDATE: Apparently I was right. The British who actually fought in WWII do not believe their sacrifices were worth it.</p><blockquote><p>Hers was a small part in a huge, history-making enterprise, and her contribution epitomises her generation’s sense of service and sacrifice. Nearly 400,000 Britons died. Millions more were scarred by the experience, physically and mentally.</p><p>But was it worth it?</p><p>Her answer – and the answer of many of her contemporaries, now in their 80s and 90s – is a resounding No. They despise what has become of the Britain they once fought to save. It’s not our country any more, they say, in sorrow and anger. Immigration tops the list of complaints.</p></blockquote><p>They are right to despise what passes for modern Britain. It is a despicable and half-conquered nation. So is modern America. Which is why both nations are rapidly disappearing from history. The Magna Carta and the U.S. Constitution will soon be no more relevant to the 8 billion people on the planet than the Laws of Hammurabi or the Codex Justinianus. That will be the ultimate legacy of three generations of cowards, who were too afraid of being called names to defend their land, their traditions, and their people.</p><p>History doesn’t give a flying fuck about your foreign wives, your alien friends, your nice immigrant neighbors, or your exotic co-workers. ALL OF THEM are collectively the problem. ALL OF THEM have collectively adulterated and degraded the nation, which is why almost ALL OF THEM will either be excluded or the destruction of the Western nations that is already well underway will be completed. There will be no exceptions made for “being a nice person” or “loving baseball and apple pie” or “being a Christian”, only for being useful to the winners. Those nations with the will to survive will do so, those without it will vanish into the history books.</p><p>Thus has it always been, thus will it always be. The pendulum always swings back, sooner or later.</p><p>Think about how much mercy was shown to the Hindus of Bangladesh, the Cherokee forced to walk The Trail of Tears, the Germans ethnically cleansed from Eastern Europe, the Canaanites, and the whites of Zimbabwe. Those people had lived in those places for generations, in some cases, for <i>centuries</i>. How much mercy do you seriously believe will be shown to those who observably don’t even belong there in the first place?</p><p>Those who are still in denial about the inevitable consequences of mass immigration have the same mindset as the historical fools who denied that Adolf Hitler had any territorial ambitions outside the borders of Germany and asserted that Stalin was a man of peace. They should not be accorded even a modicum of intellectual respect, because they do not merit any.</p></div>",
  "content_text": "And their grandsons promptly surrendered to the Pakistanis and the Windrush Generation. Winston’s Churchill’s brave words sound increasingly hollow three score and 18 years later.\nI have, myself, full confidence that if all do their duty, if nothing is neglected, and if the best arrangements are made, as they are being made, we shall prove ourselves once more able to defend our island home, to ride out the storm of war, and to outlive the menace of tyranny, if necessary for years, if necessary alone. At any rate, that is what we are going to try to do. That is the resolve of His Majesty’s Government – every man of them. That is the will of Parliament and the nation. The British Empire and the French Republic, linked together in their cause and in their need, will defend to the death their native soil, aiding each other like good comrades to the utmost of their strength.\nEven though large tracts of Europe and many old and famous States have fallen or may fall into the grip of the Gestapo and all the odious apparatus of Nazi rule, we shall not flag or fail. We shall go on to the end. We shall fight in France, we shall fight on the seas and oceans, we shall fight with growing confidence and growing strength in the air, we shall defend our island, whatever the cost may be. We shall fight on the beaches, we shall fight on the landing grounds, we shall fight in the fields and in the streets, we shall fight in the hills; we shall never surrender, and if, which I do not for a moment believe, this island or a large part of it were subjugated and starving, then our Empire beyond the seas, armed and guarded by the British Fleet, would carry on the struggle, until, in God’s good time, the New World, with all its power and might, steps forth to the rescue and the liberation of the old.\nNot only have the British failed to fight in the fields and streets against a much bigger invasion than they faced from the Wehrmacht, they didn’t even fight at all! I am increasingly convinced that if the US soldiers who went overseas to fight against the Germans and Japanese had\nany\nidea what their sacrifices would eventually entail, both at home and abroad, they wouldn’t have been willing to go.\nOf course, the post-1965 American performance has been even worse than their erstwhile “British brethren” in this regard. To this very day, most of you\nstill\ndon’t see any problem at all with tens of millions of fellow citizens born American in China, India, Iran, Mexico, Nigeria, and Portugal. Many of you, I have witnessed, even claim to prefer them to actual Americans, so long as they mouth platitudes of which you approve. I, on the other hand, am firmly convinced that the planet-wide Migration War is going to make the death toll of WWII look like a mild pre-game stretch. Never will have large-scale human suffering been more avoidable or more well-deserved. Almost everyone, from the highest government Minister to the lowest mudshark, is culpable to some degree.\nNo one reading here will ever be able to claim they were not warned. Repeatedly.\nAnyhow, I tend to doubt clinging to the specious ideological doctrine of equality is going to provide anyone with much solace when three-quarters of the world’s population reenacts the post-imperial partition of India on a grander, more vicious scale. Those who claim “it can’t happen here” forget that\nit already has\n… most of it AFTER the writing of the Declaration of Independence.\nUPDATE: Apparently I was right. The British who actually fought in WWII do not believe their sacrifices were worth it.\nHers was a small part in a huge, history-making enterprise, and her contribution epitomises her generation’s sense of service and sacrifice. Nearly 400,000 Britons died. Millions more were scarred by the experience, physically and mentally.\nBut was it worth it?\nHer answer – and the answer of many of her contemporaries, now in their 80s and 90s – is a resounding No. They despise what has become of the Britain they once fought to save. It’s not our country any more, they say, in sorrow and anger. Immigration tops the list of complaints.\nThey are right to despise what passes for modern Britain. It is a despicable and half-conquered nation. So is modern America. Which is why both nations are rapidly disappearing from history. The Magna Carta and the U.S. Constitution will soon be no more relevant to the 8 billion people on the planet than the Laws of Hammurabi or the Codex Justinianus. That will be the ultimate legacy of three generations of cowards, who were too afraid of being called names to defend their land, their traditions, and their people.\nHistory doesn’t give a flying fuck about your foreign wives, your alien friends, your nice immigrant neighbors, or your exotic co-workers. ALL OF THEM are collectively the problem. ALL OF THEM have collectively adulterated and degraded the nation, which is why almost ALL OF THEM will either be excluded or the destruction of the Western nations that is already well underway will be completed. There will be no exceptions made for “being a nice person” or “loving baseball and apple pie” or “being a Christian”, only for being useful to the winners. Those nations with the will to survive will do so, those without it will vanish into the history books.\nThus has it always been, thus will it always be. The pendulum always swings back, sooner or later.\nThink about how much mercy was shown to the Hindus of Bangladesh, the Cherokee forced to walk The Trail of Tears, the Germans ethnically cleansed from Eastern Europe, the Canaanites, and the whites of Zimbabwe. Those people had lived in those places for generations, in some cases, for\ncenturies\n. How much mercy do you seriously believe will be shown to those who observably don’t even belong there in the first place?\nThose who are still in denial about the inevitable consequences of mass immigration have the same mindset as the historical fools who denied that Adolf Hitler had any territorial ambitions outside the borders of Germany and asserted that Stalin was a man of peace. They should not be accorded even a modicum of intellectual respect, because they do not merit any.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-04T12:44:14+00:00"
}