{
  "url": "https://voxday.net/2018/06/10/what-was-your-first-clue-sherlock/",
  "scraped_at": "2025-12-19T21:06:01.298625",
  "title": "What was your first clue, Sherlock?",
  "date_display": "June 10, 2018",
  "date_iso": "2018-06-10T11:08:29+00:00",
  "date_from_url": "2018-06-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or should one say, <a href=\"http://dailycaller.com/2018/06/09/george-soros-go-wrong/\">Shylock</a>:</p><blockquote><p>George Soros recently lamented the rise of President Trump and anti-establishment parties across the globe, saying “everything that could go wrong, has gone wrong.”</p><p>Soros made the comment in an interview with The Washington Post published Saturday. He also said that he did not expect Trump’s election, saying, “Apparently, I was living in my own bubble.”</p></blockquote><p>And yet, things haven’t even <i>begun </i>to go seriously wrong for George Soros and company yet. George Soros is the poster child for the historical Jew who blindly devotes himself to amassing wealth and influence in order to tikkun the olam without ever stopping to think for two seconds about the obvious consequences of his actions or how the majority population that surrounds him on every side feels about them. They didn’t keep hold of Babylon. They didn’t keep hold of Judea. They didn’t keep hold of Greece. They didn’t keep hold of Andalusia. They didn’t keep hold of Russia. They didn’t keep hold of Germany. They didn’t keep hold of Poland. They won’t keep hold of Britain or the USA much longer either, and for much the same reasons they previously lost control.</p><p>Sooner or later, a Tiberius, a Stalin, a Hitler, a Ferdinand, or a Cyrus will emerge. That is why Soros fears and hates the God-Emperor Trump. He sees in Trump a similar historic figure.</p><p>Soros is living in his own evil bubble. What he has accomplished is to lay the groundwork for a second Holocaust that will be broader in scope, more intentional, and more thorough than the first one. That’s why Soros opponents like Prime Minister Netanyahu are openly telling Jews to return to Jerusalem this year rather than a next year that never seems to come. Netanyahu is smart and he is looking out for his people. He knows what is likely to happen once the global economic meltdown begins.</p><p>Now, obviously all Jews are not culpable for the horrific damage that their co-ethno-religionists have wrought throughout the modern West. That’s not even <i>possible</i>. But that is also irrelevant. Just as no army has ever concerned itself with the question of whether the individual enemy soldier has fired so much as a single bullet their way before opening fire on him, no one anywhere in the world is going to concern themselves whether a particular Jew ran the Federal Reserve or agitated for the 1965 Immigration Act or tried to overturn Brexit before concluding that they simply don’t want Jews interfering with their God-given right to self-government, trying to take their First Amendment rights away, controlling their money supply, opening their borders, or healing their societies anymore.</p><p>Whether you think this is a good thing or a bad thing doesn’t matter, <i>this is what is going to happen</i>, sooner or later. The Bible predicts it. History chronicles and anticipates it. Hell, freaking Game Theory dictates it. So, deal with the reality of the situation, don’t bother appealing to specious “it can’t happen here because magic dirt” theories.</p><p>I am not at all impressed by so-called “Jewish intelligence”. I am reliably informed that Jews have an average IQ of 115. (It’s not true, it’s actually more like 103, but let’s play along anyhow.) Congratu-fucking-lations. That’s more than two standard deviations below mine. To put this delta in perspective, recall that moderate mental retardation is defined as being three standard deviations below normal.</p></div>",
  "content_text": "Or should one say,\nShylock\n:\nGeorge Soros recently lamented the rise of President Trump and anti-establishment parties across the globe, saying “everything that could go wrong, has gone wrong.”\nSoros made the comment in an interview with The Washington Post published Saturday. He also said that he did not expect Trump’s election, saying, “Apparently, I was living in my own bubble.”\nAnd yet, things haven’t even\nbegun\nto go seriously wrong for George Soros and company yet. George Soros is the poster child for the historical Jew who blindly devotes himself to amassing wealth and influence in order to tikkun the olam without ever stopping to think for two seconds about the obvious consequences of his actions or how the majority population that surrounds him on every side feels about them. They didn’t keep hold of Babylon. They didn’t keep hold of Judea. They didn’t keep hold of Greece. They didn’t keep hold of Andalusia. They didn’t keep hold of Russia. They didn’t keep hold of Germany. They didn’t keep hold of Poland. They won’t keep hold of Britain or the USA much longer either, and for much the same reasons they previously lost control.\nSooner or later, a Tiberius, a Stalin, a Hitler, a Ferdinand, or a Cyrus will emerge. That is why Soros fears and hates the God-Emperor Trump. He sees in Trump a similar historic figure.\nSoros is living in his own evil bubble. What he has accomplished is to lay the groundwork for a second Holocaust that will be broader in scope, more intentional, and more thorough than the first one. That’s why Soros opponents like Prime Minister Netanyahu are openly telling Jews to return to Jerusalem this year rather than a next year that never seems to come. Netanyahu is smart and he is looking out for his people. He knows what is likely to happen once the global economic meltdown begins.\nNow, obviously all Jews are not culpable for the horrific damage that their co-ethno-religionists have wrought throughout the modern West. That’s not even\npossible\n. But that is also irrelevant. Just as no army has ever concerned itself with the question of whether the individual enemy soldier has fired so much as a single bullet their way before opening fire on him, no one anywhere in the world is going to concern themselves whether a particular Jew ran the Federal Reserve or agitated for the 1965 Immigration Act or tried to overturn Brexit before concluding that they simply don’t want Jews interfering with their God-given right to self-government, trying to take their First Amendment rights away, controlling their money supply, opening their borders, or healing their societies anymore.\nWhether you think this is a good thing or a bad thing doesn’t matter,\nthis is what is going to happen\n, sooner or later. The Bible predicts it. History chronicles and anticipates it. Hell, freaking Game Theory dictates it. So, deal with the reality of the situation, don’t bother appealing to specious “it can’t happen here because magic dirt” theories.\nI am not at all impressed by so-called “Jewish intelligence”. I am reliably informed that Jews have an average IQ of 115. (It’s not true, it’s actually more like 103, but let’s play along anyhow.) Congratu-fucking-lations. That’s more than two standard deviations below mine. To put this delta in perspective, recall that moderate mental retardation is defined as being three standard deviations below normal.",
  "tags": [
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2018-06-10T10:08:29+00:00"
}