{
  "url": "https://voxday.net/2009/08/23/as-expected/",
  "scraped_at": "2026-01-08T23:04:51.344683",
  "title": "As expected",
  "date_display": "August 23, 2009",
  "date_iso": "2009-08-23T16:00:00+00:00",
  "date_from_url": "2009-08-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m sure every student of military history is shocked that the Afghans have been playing <a href=\"http://www.google.com/hostednews/ap/article/ALeqM5iqyaFh_efr-brDq0rMLF1hkop0tgD9A8KMEO0\">the same sort of waiting game</a> they used to defeat the Soviet Union over the period of a decade.  They’re going to win because they’re willing to wait out the USA, so the sooner the American political class accepts this and withdraws US troops, the better.  This is a war of absolutely zero benefit to the national interest and Americans of both Left and Right are rapidly accepting that fact.</p><blockquote><p>The U.S. military’s top uniformed officer expressed concern Sunday about eroding public support for the war in Afghanistan and said the country remains vulnerable to being taken over again by extremist forces….  Three years ago, the U.S. had about 20,000 forces in the country. Today, it has triple that, on the way to 68,000 by year’s end when all the extra 17,000 troops that Obama announced in March are to be in place. An additional 4,000 troops are arriving to help train Afghan forces.</p></blockquote><p>It should be interesting to hear all the excuse-making when the serious shooting starts in Iraq again.  Failing to withdraw from Afghanistan and Iraq after the initial victories were accomplished was a huge mistake and more than a little damaging to the US military.</p></div>",
  "content_text": "I’m sure every student of military history is shocked that the Afghans have been playing\nthe same sort of waiting game\nthey used to defeat the Soviet Union over the period of a decade.  They’re going to win because they’re willing to wait out the USA, so the sooner the American political class accepts this and withdraws US troops, the better.  This is a war of absolutely zero benefit to the national interest and Americans of both Left and Right are rapidly accepting that fact.\nThe U.S. military’s top uniformed officer expressed concern Sunday about eroding public support for the war in Afghanistan and said the country remains vulnerable to being taken over again by extremist forces….  Three years ago, the U.S. had about 20,000 forces in the country. Today, it has triple that, on the way to 68,000 by year’s end when all the extra 17,000 troops that Obama announced in March are to be in place. An additional 4,000 troops are arriving to help train Afghan forces.\nIt should be interesting to hear all the excuse-making when the serious shooting starts in Iraq again.  Failing to withdraw from Afghanistan and Iraq after the initial victories were accomplished was a huge mistake and more than a little damaging to the US military.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-23T15:00:00+00:00"
}