{
  "url": "https://voxday.net/2009/08/13/at-least-hes-good-for-laug/",
  "scraped_at": "2026-01-08T23:03:52.509907",
  "title": "At least he’s good for a laugh",
  "date_display": "August 13, 2009",
  "date_iso": "2009-08-13T17:15:00+00:00",
  "date_from_url": "2009-08-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Debate-phobic PZ Myers had barely finished boldly running away when he attempted <a href=\"http://scienceblogs.com/pharyngula/2009/08/ken_ham_on_the_air_lying_again.php\">to publicly confront a creationist</a> on the radio:</p><blockquote><p>I tried to call in….  Unfortunately, the phone lines are locked up solid — you guys are all calling in, aren’t you? I got through! What a waste — he simply denied the evidence that salt levels are in a roughly steady state, and then to my vast amusement, tossed in his strongest argument: PZ Myers is an atheist. Can you say ad hominem, boys and girls?</p></blockquote><p>Now, let’s consider the recent history:</p><p>1. PZ asserted that a self-determination that another individual is an Unworthy Opponent or a crank is a legitimate reason to avoid defending one’s beliefs from them in a public venue.</p><p>2. PZ also asserted that the radio is not a legitimate venue for rational debate.</p><p>3. PZ repeatedly ran away rather than defend his own beliefs about the nonexistence of gods and the scientific evidence for evolution in public against my verbal or written counterarguments.</p><p>4. PZ then attempted to confront a creationist by the name of Ken Ham <i>on the radio</i>.</p><p>Needless to say, this behavior has undermined every excuse that Pharyngulans produced last week to cover PZ’s very brave retreat.  After all, why is PZ calling radio stations in an attempt to confront Ken Ham on the air when he should instead be publishing peer-reviewed scientific papers on those matters?  Isn’t PZ attempting to polish his resume on the basis of Ken Ham’s fame?  And isn’t Ken Ham’s <i>ad hominem</i> argument that PZ Myers is an “atheist” every bit as valid a reason to avoid addressing PZ’s criticism as PZ Myer’s <i>ad hominem</i> argument that I am a “crackpot” is to avoid mine?</p><p>The amusing thing is that on the basis of his previous assertions, we can safely conclude that PZ has finally discovered a Worthy Opponent in Ken Ham.</p><p>UPDATE – Almost as amusing as PZ wetting himself and running away again is <a href=\"http://preliatorcausa.blogspot.com/2009/08/whining-that-pz-tried-to-debate-someone.html\">the contorted illogic to which Pharyngulans resort</a> in order to defend the coward:</p><blockquote><p>Once again, Vox fails pathetically at the grasping of simple concepts and notions. The reason(s) why calling PZ an “atheist” is an ad hominem whereas calling Vox a “crackpot” isn’t, is that Ham deliberately used “atheist” as a pejorative, not to mention as a way to “discredit” PZ (if such a thing were possible), whereas Vox … actually is a crackpot, which inherently signifies he’s not worth debating and any attempt at doing so would only amount to a waste of time and energy.</p></blockquote><p>So, according to this teenage boy’s quixotic concept of “ad hominem”, PZ is actually not an “atheist” and did not use the term “crackpot” as a pejorative.  It’s a rather grim statement about the average intelligence of the Pharyngula readers when they not only make use of an ad hominem argument while simultaneously decrying the technique, but demonstrate that their understanding of the argument doesn’t even rise <a href=\"http://en.wikipedia.org/wiki/Ad_hominem\">to the level of Wikipedia</a>.  It’s astonishing how the sort of half-educated cretin who insists that someone of proven high intelligence can’t grasp “simple concepts and notions” almost invariably doesn’t even know the relevant dictionary definitions.</p><p>I suppose it’s true, though.  I really don’t grasp such “simple concepts”.  Of course, this is only because the simpleton has an incorrect idea of what those concepts actually are.</p></div>",
  "content_text": "Debate-phobic PZ Myers had barely finished boldly running away when he attempted\nto publicly confront a creationist\non the radio:\nI tried to call in….  Unfortunately, the phone lines are locked up solid — you guys are all calling in, aren’t you? I got through! What a waste — he simply denied the evidence that salt levels are in a roughly steady state, and then to my vast amusement, tossed in his strongest argument: PZ Myers is an atheist. Can you say ad hominem, boys and girls?\nNow, let’s consider the recent history:\n1. PZ asserted that a self-determination that another individual is an Unworthy Opponent or a crank is a legitimate reason to avoid defending one’s beliefs from them in a public venue.\n2. PZ also asserted that the radio is not a legitimate venue for rational debate.\n3. PZ repeatedly ran away rather than defend his own beliefs about the nonexistence of gods and the scientific evidence for evolution in public against my verbal or written counterarguments.\n4. PZ then attempted to confront a creationist by the name of Ken Ham\non the radio\n.\nNeedless to say, this behavior has undermined every excuse that Pharyngulans produced last week to cover PZ’s very brave retreat.  After all, why is PZ calling radio stations in an attempt to confront Ken Ham on the air when he should instead be publishing peer-reviewed scientific papers on those matters?  Isn’t PZ attempting to polish his resume on the basis of Ken Ham’s fame?  And isn’t Ken Ham’s\nad hominem\nargument that PZ Myers is an “atheist” every bit as valid a reason to avoid addressing PZ’s criticism as PZ Myer’s\nad hominem\nargument that I am a “crackpot” is to avoid mine?\nThe amusing thing is that on the basis of his previous assertions, we can safely conclude that PZ has finally discovered a Worthy Opponent in Ken Ham.\nUPDATE – Almost as amusing as PZ wetting himself and running away again is\nthe contorted illogic to which Pharyngulans resort\nin order to defend the coward:\nOnce again, Vox fails pathetically at the grasping of simple concepts and notions. The reason(s) why calling PZ an “atheist” is an ad hominem whereas calling Vox a “crackpot” isn’t, is that Ham deliberately used “atheist” as a pejorative, not to mention as a way to “discredit” PZ (if such a thing were possible), whereas Vox … actually is a crackpot, which inherently signifies he’s not worth debating and any attempt at doing so would only amount to a waste of time and energy.\nSo, according to this teenage boy’s quixotic concept of “ad hominem”, PZ is actually not an “atheist” and did not use the term “crackpot” as a pejorative.  It’s a rather grim statement about the average intelligence of the Pharyngula readers when they not only make use of an ad hominem argument while simultaneously decrying the technique, but demonstrate that their understanding of the argument doesn’t even rise\nto the level of Wikipedia\n.  It’s astonishing how the sort of half-educated cretin who insists that someone of proven high intelligence can’t grasp “simple concepts and notions” almost invariably doesn’t even know the relevant dictionary definitions.\nI suppose it’s true, though.  I really don’t grasp such “simple concepts”.  Of course, this is only because the simpleton has an incorrect idea of what those concepts actually are.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-13T16:15:00+00:00"
}