{
  "url": "https://voxday.net/2009/08/21/bravery-long-after-fac/",
  "scraped_at": "2026-01-08T23:04:42.239850",
  "title": "Bravery long after the fact",
  "date_display": "August 21, 2009",
  "date_iso": "2009-08-21T17:35:00+00:00",
  "date_from_url": "2009-08-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I would have respected Tarantino more had he made a film about real Jews who desperately fought to defend themselves against the Nazis, such as the Polish Jews in the Warsaw ghetto who were memorialized in Leon Uris’s <i>Mila 18</i>, rather than <a href=\"http://www.breitbart.com/article.php?id=CNG.fdc24718ee84a912c2aa2914ba6c8c60.5c1&amp;show_article=1\">a film about murderous imaginary ones</a>:</p><blockquote><p> In the genre-blurring tale, Pitt plays Lieutenant Aldo Raine who heads the squad of Jewish-American soldiers behind enemy lines in German-occupied wartime France.  Aldo tells his men to bring him the scalps of 100 Nazis each, and vows to terrorise the German army with the “disembowelled, dismembered and disfigured bodies we leave behind us.”</p></blockquote><p>His new movie is nothing more than revenge porn for Hollywood Jews and it’s only going to underline whatever feelings of psychological inadequacy they have for the general failure of European Jewry to defend itself during the 1940s.  It also serves to underline the idea that a Jewish-American is not a true American, for what American soldier behaved like the bestial Jews of the movie even in the less-civilized battles of the Pacific theatre?  There has been no shortage of actual Jewish heroism during the Arab-Israeli Wars, so pretending that nonexistent Jews murdered nonexistent Nazis 65 years ago isn’t going to make up for the fact that with a few noble exceptions, they died like sheep, not wolves.  As it stands, this “Jewish revenge fantasy” is only going to feed into global anti-semitism, particularly in the Middle East.  I have no doubt that we’ll soon be hearing Gaza and the West Bank being portrayed as similar “Jewish revenge”.</p><p>Worst of all, the movie is a horrific insult to the American military, which did not behave like the Red Army or the Japanese Imperial Army in victory.  Incidentally, it’s also a historically illiterate insult to the German army, which banned membership in the Nazi party and was not one of the organizations tasked with killing Jews.  (The German armed forces’ ban on party membership was one reason why Hitler set up the 38-division Nazi Party army known as the Waffen SS.)  I despise Hollywood’s predilection for historical revisionism in general, but this movie is an unusually outrageous insult to the Americans who fought in Europe.  Even on the very rare occasions when they lost military discipline, such as <a href=\"http://www.humanitas-international.org/archive/dachau-liberation/\">when the 3rd Battalion of the 157th Infantry Regiment entered Dachau</a> and murdered 480 captured Waffen SS troops, most of them wounded combat soldiers, under the erroneous assumption that they were Totenkopfverbände-SS concentration camp guards, they merely lined them up and shot them.  They did not commit brutal atrocities, much less indiscriminately murder and mutilate German women and children like Tarantino’s Jewish “heroes”.</p></div>",
  "content_text": "I would have respected Tarantino more had he made a film about real Jews who desperately fought to defend themselves against the Nazis, such as the Polish Jews in the Warsaw ghetto who were memorialized in Leon Uris’s\nMila 18\n, rather than\na film about murderous imaginary ones\n:\nIn the genre-blurring tale, Pitt plays Lieutenant Aldo Raine who heads the squad of Jewish-American soldiers behind enemy lines in German-occupied wartime France.  Aldo tells his men to bring him the scalps of 100 Nazis each, and vows to terrorise the German army with the “disembowelled, dismembered and disfigured bodies we leave behind us.”\nHis new movie is nothing more than revenge porn for Hollywood Jews and it’s only going to underline whatever feelings of psychological inadequacy they have for the general failure of European Jewry to defend itself during the 1940s.  It also serves to underline the idea that a Jewish-American is not a true American, for what American soldier behaved like the bestial Jews of the movie even in the less-civilized battles of the Pacific theatre?  There has been no shortage of actual Jewish heroism during the Arab-Israeli Wars, so pretending that nonexistent Jews murdered nonexistent Nazis 65 years ago isn’t going to make up for the fact that with a few noble exceptions, they died like sheep, not wolves.  As it stands, this “Jewish revenge fantasy” is only going to feed into global anti-semitism, particularly in the Middle East.  I have no doubt that we’ll soon be hearing Gaza and the West Bank being portrayed as similar “Jewish revenge”.\nWorst of all, the movie is a horrific insult to the American military, which did not behave like the Red Army or the Japanese Imperial Army in victory.  Incidentally, it’s also a historically illiterate insult to the German army, which banned membership in the Nazi party and was not one of the organizations tasked with killing Jews.  (The German armed forces’ ban on party membership was one reason why Hitler set up the 38-division Nazi Party army known as the Waffen SS.)  I despise Hollywood’s predilection for historical revisionism in general, but this movie is an unusually outrageous insult to the Americans who fought in Europe.  Even on the very rare occasions when they lost military discipline, such as\nwhen the 3rd Battalion of the 157th Infantry Regiment entered Dachau\nand murdered 480 captured Waffen SS troops, most of them wounded combat soldiers, under the erroneous assumption that they were Totenkopfverbände-SS concentration camp guards, they merely lined them up and shot them.  They did not commit brutal atrocities, much less indiscriminately murder and mutilate German women and children like Tarantino’s Jewish “heroes”.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-21T16:35:00+00:00"
}