{
  "url": "https://voxday.net/2009/08/23/cunning-trap/",
  "scraped_at": "2026-01-08T23:04:53.167753",
  "title": "The cunning trap",
  "date_display": "August 23, 2009",
  "date_iso": "2009-08-23T22:56:00+00:00",
  "date_from_url": "2009-08-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>The Rasmussen Reports <a href=\"http://www.rasmussenreports.com/public_content/politics/obama_administration/daily_presidential_tracking_poll\">daily Presidential Tracking Poll</a> for Sunday shows that 27% of the nation’s voters Strongly Approve of the way that Barack Obama is performing his role as President. Forty-one percent (41%) Strongly Disapprove giving Obama a Presidential Approval Index rating of -14. These figures mark the lowest Approval Index rating yet recorded for this President.</p></blockquote><p>Clearly those wingnutty birthers don’t realize how their foolish obsession with Obama’s birth certificate is just playing into his hands and making him <i>even more popular</i> with moderates and independents.  I haven’t seen strategic thinking this masterful since the Maestro ignored Edward Gramlich’s recommendation to audit consumer finance companies because he was afraid it might reduce the availability of subprime credit.</p></div>",
  "content_text": "The Rasmussen Reports\ndaily Presidential Tracking Poll\nfor Sunday shows that 27% of the nation’s voters Strongly Approve of the way that Barack Obama is performing his role as President. Forty-one percent (41%) Strongly Disapprove giving Obama a Presidential Approval Index rating of -14. These figures mark the lowest Approval Index rating yet recorded for this President.\nClearly those wingnutty birthers don’t realize how their foolish obsession with Obama’s birth certificate is just playing into his hands and making him\neven more popular\nwith moderates and independents.  I haven’t seen strategic thinking this masterful since the Maestro ignored Edward Gramlich’s recommendation to audit consumer finance companies because he was afraid it might reduce the availability of subprime credit.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-23T21:56:00+00:00"
}