{
  "url": "https://voxday.net/2009/08/09/defender-of-darwinian-fai/",
  "scraped_at": "2026-01-08T23:03:30.239384",
  "title": "The defender of the Darwinian Faith",
  "date_display": "August 9, 2009",
  "date_iso": "2009-08-09T11:14:00+00:00",
  "date_from_url": "2009-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I wonder what excuse PZ will produce for ducking this challenge?  Or is it possible that he might surprise us all and actually put his reputation <a href=\"http://scienceblogs.com/pharyngula/2009/08/the_dilemma_of_the_anti-creati.php\">where his mouth is</a>?</p><blockquote><p>Non-crackpot arguments are more challenging and require more thought, and are ultimately more satisfying. However, there is a problem when the focus is on an issue rather than an individual. Some issues, and I would put evolution in this category, don’t match this model well. While the issue is real and red-hot in the culture, the Green Zone of Worthy Opponents is unfortunately rather underpopulated. There is no one in the green box. So what should we do? Simply ignore the mobs of people populating the red box?</p></blockquote><p>I posted the following at his blog: <i>“Well, my dear Dr. Myers, since you were <a href=\"http://www.milobookclub.com/2008/06/09/challenge-to-pz-myers/\">previously afraid of a radio debate with me</a> on the evidence for the existence of gods, perhaps you’ll be more willing to engage in a written debate on the scientific evidence for evolution.  After all, if the issue is so comprehensively settled in evolution’s favor, it should be no trouble whatsoever to make your case to everyone’s satisfaction, however initially dubious they may have been.  And since you have now asserted that there are no Worthy Opponents, you no longer have any need to hide behind your stated belief in my supposed crackpottery.”</i></p><p>So, will PZ dare to enter the Red Box?  Given that this is the area of his scientific and academic expertise and I am, according to him, “a pathetic little twerp with delusions of grandeur”, there’s absolutely no reason he should not… unless, of course, he’s afraid he can’t present a sufficiently convincing case for Darwin’s dangerous idea.</p><p>UPDATE: Wow, the Pharyngulans are already hurling metaphorical feces, providing excuses for PZ to run away, and trying to change the subject to religion.  I find their lack of faith… amusing.</p></div>",
  "content_text": "I wonder what excuse PZ will produce for ducking this challenge?  Or is it possible that he might surprise us all and actually put his reputation\nwhere his mouth is\n?\nNon-crackpot arguments are more challenging and require more thought, and are ultimately more satisfying. However, there is a problem when the focus is on an issue rather than an individual. Some issues, and I would put evolution in this category, don’t match this model well. While the issue is real and red-hot in the culture, the Green Zone of Worthy Opponents is unfortunately rather underpopulated. There is no one in the green box. So what should we do? Simply ignore the mobs of people populating the red box?\nI posted the following at his blog:\n“Well, my dear Dr. Myers, since you were\npreviously afraid of a radio debate with me\non the evidence for the existence of gods, perhaps you’ll be more willing to engage in a written debate on the scientific evidence for evolution.  After all, if the issue is so comprehensively settled in evolution’s favor, it should be no trouble whatsoever to make your case to everyone’s satisfaction, however initially dubious they may have been.  And since you have now asserted that there are no Worthy Opponents, you no longer have any need to hide behind your stated belief in my supposed crackpottery.”\nSo, will PZ dare to enter the Red Box?  Given that this is the area of his scientific and academic expertise and I am, according to him, “a pathetic little twerp with delusions of grandeur”, there’s absolutely no reason he should not… unless, of course, he’s afraid he can’t present a sufficiently convincing case for Darwin’s dangerous idea.\nUPDATE: Wow, the Pharyngulans are already hurling metaphorical feces, providing excuses for PZ to run away, and trying to change the subject to religion.  I find their lack of faith… amusing.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-09T10:14:00+00:00"
}