{
  "url": "https://voxday.net/2009/08/15/fdic-is-insolven/",
  "scraped_at": "2026-01-08T23:04:03.469180",
  "title": "The FDIC is running out of cash",
  "date_display": "August 15, 2009",
  "date_iso": "2009-08-15T09:07:00+00:00",
  "date_from_url": "2009-08-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After noticing that the estimated cost of the five banks that failed yesterday accounted for a little more than 28 percent of the FDIC’s Deposit Insurance Fund, I wondered how much the FDIC could possibly have left in the DIF considering that 51 other bank failures have occurred since the last FDIC Quarterly was published.  According to <a href=\"http://www.fdic.gov/bank/analytical/quarterly/2009_vol3_2/FDIC%20Quarterly_v3n2_Entire.pdf\">Table I-B. Insurance Fund Balances and Selected Indicators</a>, the FDIC began Q1 2009 with $17,276 million in the DIF and finished it with $13,007 million after shutting down 21 banks during that time.</p><p>Since then, Calculated Risk has recorded 52 more bank failures in its ongoing <a href=\"http://www.calculatedriskblog.com/search/label/Bank%20Failure\">Bank Failure Friday series</a>.  This morning, I went through and added up the estimated losses that the FDIC reports each time it seizes a bank.  As of yesterday, the cumulative estimated cost to the Deposit Insurance Fund since the beginning of the second quarter reached $15,992 million.  This suggests that the FDIC is now $2.98 billion in the red after yesterday’s bank failures and will soon be requesting a bailout by the federal government.  However, it may be even worse, since the $2,232 million in estimated losses during the first quarter translated into a $4,629 million reduction in the DIF balance.</p><p><a href=\"http://4.bp.blogspot.com/_3UXl0oMYPLs/SoZ-rkhNqrI/AAAAAAAAAJ8/iLjSgIQPq6M/s1600-h/DIF_balance.jpg\" onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\"><noscript><img alt=\"\" border=\"0\" decoding=\"async\" id=\"BLOGGER_PHOTO_ID_5370118892688353970\" src=\"http://www.milobookclub.com/wp-content/uploads/2009/08/DIF_balance.jpg\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;width: 320px; height: 187px;\"/></noscript><img alt=\"\" border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2009/08/DIF_balance.jpg\" decoding=\"async\" id=\"BLOGGER_PHOTO_ID_5370118892688353970\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;width: 320px; height: 187px;\"/></a><br>Because two bailouts totaling $25.75 billion were attempted in 1986 and 1987 before the FSLIC was shut down in 1989, I suspect at least one major bailout will be attempted before the deposit insurance system either snaps back to its 1.5 reserve ratio or collapses altogether.  (Update: Calculated Risk emailed to point out that the FDIC has a $30 billion credit line with the Treasury, which will likely be quietly increased rather than risk a negative public reaction to yet another government bailout.)  However, given the 150 insured depository institutions which are presently reported as having <a href=\"http://www.bloomberg.com/apps/news?pid=20601087&amp;sid=aTTT9jivRIWE\">$193 billion in deposits at risk</a>, I can only conclude that the odds tend to favor the latter.  The <a href=\"http://www.fdic.gov/bank/statistical/stats/2009mar/FDIC.pdf\">all-time low</a> in the reserve ratio was -0.25% in 1991, as the FDIC digested the failed FSLIC’s obligations.  The reserve ratio is only -0.06% based on estimated losses so far this year, but can be expected to continue falling as more banks fail.</br></p><p><i>NB: the gap between bank numbers 59 and 65 in the graph is not a mistake.  That reflects the 6 banks owned by Security Bank Corporation in Macon, Georgia, which the FDIC reported as a single cost.</i></p></div>",
  "content_text": "After noticing that the estimated cost of the five banks that failed yesterday accounted for a little more than 28 percent of the FDIC’s Deposit Insurance Fund, I wondered how much the FDIC could possibly have left in the DIF considering that 51 other bank failures have occurred since the last FDIC Quarterly was published.  According to\nTable I-B. Insurance Fund Balances and Selected Indicators\n, the FDIC began Q1 2009 with $17,276 million in the DIF and finished it with $13,007 million after shutting down 21 banks during that time.\nSince then, Calculated Risk has recorded 52 more bank failures in its ongoing\nBank Failure Friday series\n.  This morning, I went through and added up the estimated losses that the FDIC reports each time it seizes a bank.  As of yesterday, the cumulative estimated cost to the Deposit Insurance Fund since the beginning of the second quarter reached $15,992 million.  This suggests that the FDIC is now $2.98 billion in the red after yesterday’s bank failures and will soon be requesting a bailout by the federal government.  However, it may be even worse, since the $2,232 million in estimated losses during the first quarter translated into a $4,629 million reduction in the DIF balance.\nBecause two bailouts totaling $25.75 billion were attempted in 1986 and 1987 before the FSLIC was shut down in 1989, I suspect at least one major bailout will be attempted before the deposit insurance system either snaps back to its 1.5 reserve ratio or collapses altogether.  (Update: Calculated Risk emailed to point out that the FDIC has a $30 billion credit line with the Treasury, which will likely be quietly increased rather than risk a negative public reaction to yet another government bailout.)  However, given the 150 insured depository institutions which are presently reported as having\n$193 billion in deposits at risk\n, I can only conclude that the odds tend to favor the latter.  The\nall-time low\nin the reserve ratio was -0.25% in 1991, as the FDIC digested the failed FSLIC’s obligations.  The reserve ratio is only -0.06% based on estimated losses so far this year, but can be expected to continue falling as more banks fail.\nNB: the gap between bank numbers 59 and 65 in the graph is not a mistake.  That reflects the 6 banks owned by Security Bank Corporation in Macon, Georgia, which the FDIC reported as a single cost.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-15T08:07:00+00:00"
}