{
  "url": "https://voxday.net/2009/08/09/fear-at-fed/",
  "scraped_at": "2026-01-08T23:03:32.091157",
  "title": "Fear at the Fed",
  "date_display": "August 9, 2009",
  "date_iso": "2009-08-09T16:15:00+00:00",
  "date_from_url": "2009-08-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From a May paper entitled “U.S. Household Deleveraging and Future Consumption Growth” by the Federal Reserve Bank of San Francisco:</p><blockquote><p>Since the start of the U.S. recession in December 2007, household leverage has declined. It currently stands at about 130% of disposable income…. The Japanese stock market bubble burst in late 1989, followed soon after by the bursting of the real estate bubble in early 1991. Nearly 20 years later, stock and commercial real estate prices remain more than 70% below their peaks, while residential land prices<br>are more than 40% below their peak. In both countries, leverage ratios rose rapidly in the years before the peak. After Japan’s bubbles burst, private nonfinancial firms undertook a massive deleveraging, reducing their collective debt-to-GDP ratio from 125% in 1991 to 95% in 2001. By reducing spending on investment, the firms changed from being net borrowers to net savers. If U.S. households were to undertake a similar deleveraging, their collective debt-to-income ratio would need to drop to around 100% by year-end<br>2018, returning to the level that prevailed in 2002.</br></br></p></blockquote><p>This has very, very bad implications for the most important component of GDP, Personal Consumption Expenditures, which hit a historic high of 71.2 percent in the first quarter of 2009.  Translation: the stock market is no better an indicator of future economic growth now than it was when it was hitting historic nominal highs in 2008.</p><p>On the basis of their deleveraging calculations, the FRBSF calculates a US savings rate of 10% by the end of 2018.  One has to presume Paul Krugman hasn’t read this paper or he would have stroked out already.</p></div>",
  "content_text": "From a May paper entitled “U.S. Household Deleveraging and Future Consumption Growth” by the Federal Reserve Bank of San Francisco:\nSince the start of the U.S. recession in December 2007, household leverage has declined. It currently stands at about 130% of disposable income…. The Japanese stock market bubble burst in late 1989, followed soon after by the bursting of the real estate bubble in early 1991. Nearly 20 years later, stock and commercial real estate prices remain more than 70% below their peaks, while residential land prices\nare more than 40% below their peak. In both countries, leverage ratios rose rapidly in the years before the peak. After Japan’s bubbles burst, private nonfinancial firms undertook a massive deleveraging, reducing their collective debt-to-GDP ratio from 125% in 1991 to 95% in 2001. By reducing spending on investment, the firms changed from being net borrowers to net savers. If U.S. households were to undertake a similar deleveraging, their collective debt-to-income ratio would need to drop to around 100% by year-end\n2018, returning to the level that prevailed in 2002.\nThis has very, very bad implications for the most important component of GDP, Personal Consumption Expenditures, which hit a historic high of 71.2 percent in the first quarter of 2009.  Translation: the stock market is no better an indicator of future economic growth now than it was when it was hitting historic nominal highs in 2008.\nOn the basis of their deleveraging calculations, the FRBSF calculates a US savings rate of 10% by the end of 2018.  One has to presume Paul Krugman hasn’t read this paper or he would have stroked out already.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-09T15:15:00+00:00"
}