{
  "url": "https://voxday.net/2009/08/20/for-boldness-in-central-banking/",
  "scraped_at": "2026-01-08T23:04:33.062265",
  "title": "For boldness in central banking",
  "date_display": "August 20, 2009",
  "date_iso": "2009-08-20T08:48:00+00:00",
  "date_from_url": "2009-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The New York Times <a href=\"http://www.nytimes.com/2009/08/20/business/20bernanke.html?hp\">lobbies for Ben Bernanke’s second term</a> as Chairman of the Federal Reserve Board of Governors:</p><blockquote><p>Fellow economists, however, are heaping praise on Mr. Bernanke for his bold actions and steady hand in pulling the economy out of its worst crisis since the 1930s. Tossing out the Fed’s standard playbook, Mr. Bernanke orchestrated a long list of colossal rescue programs: Wall Street bailouts, shotgun weddings, emergency loan programs, vast amounts of newly printed money and the lowest interest rates in American history….</p><p>Amid the chaos, Fed and Treasury officials made numerous mistakes. Their original idea for the $700 billion to buy up bad mortgage assets held by banks has yet to get off the ground.  But economists say Mr. Bernanke’s most important accomplishment was to create staggering amounts of money out of thin air.</p></blockquote><p>That’s certainly new.  And bold!  I mean, who would have <i>ever</i> come up with the idea of using a central bank to create vast sums of money out of nothing?  And who can doubt that this will permanently solve the problems originally caused by creating large sums of money out of nothing?  Bernanke’s helicopter money approach isn’t going to work; extend and pretend is only a delaying measure that makes the major statistics look better for a little while until reality again intrudes.</p><p>The map is not the territory.</p></div>",
  "content_text": "The New York Times\nlobbies for Ben Bernanke’s second term\nas Chairman of the Federal Reserve Board of Governors:\nFellow economists, however, are heaping praise on Mr. Bernanke for his bold actions and steady hand in pulling the economy out of its worst crisis since the 1930s. Tossing out the Fed’s standard playbook, Mr. Bernanke orchestrated a long list of colossal rescue programs: Wall Street bailouts, shotgun weddings, emergency loan programs, vast amounts of newly printed money and the lowest interest rates in American history….\nAmid the chaos, Fed and Treasury officials made numerous mistakes. Their original idea for the $700 billion to buy up bad mortgage assets held by banks has yet to get off the ground.  But economists say Mr. Bernanke’s most important accomplishment was to create staggering amounts of money out of thin air.\nThat’s certainly new.  And bold!  I mean, who would have\never\ncome up with the idea of using a central bank to create vast sums of money out of nothing?  And who can doubt that this will permanently solve the problems originally caused by creating large sums of money out of nothing?  Bernanke’s helicopter money approach isn’t going to work; extend and pretend is only a delaying measure that makes the major statistics look better for a little while until reality again intrudes.\nThe map is not the territory.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-20T07:48:00+00:00"
}