{
  "url": "https://voxday.net/2009/08/25/full-faith-and-credi/",
  "scraped_at": "2026-01-08T23:05:03.414936",
  "title": "Full faith and credit",
  "date_display": "August 25, 2009",
  "date_iso": "2009-08-25T18:33:00+00:00",
  "date_from_url": "2009-08-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This woman’s letter to WND made me laugh:</p><blockquote><p>I am an avid reader of WorldNetDaily and a staunch conservative, and I can’t believe that you would run Vox Day’s article saying that there is no deposit insurance on people’s bank accounts. This scare tactic has the potential to do great harm to this nation. What are you trying to do, start a run on the banks?</p><p>If people lose faith in the FDIC and begin withdrawing their money from the banks, it will be the proverbial straw that will send us into a deep depression.</p><p>The loss of people’s money in banks and credit unions was one of principles causing the length of the Great Depression of the 1930s. How could you in good faith sponsor a distrust of the safety of people’s deposits in banks? Faith in our financial system is necessary to help our country survive these trying times. Shame on you for publishing such material.</p></blockquote><p>The funny thing about this complaint is that everything I said in that column was taken directly from the FDIC.  It’s not a “scare tactic”, its the facts taken directly from the FDIC Quarterly and the press releases they issue every time they seize a bank.  She shouldn’t fret about the negative balance in the Deposit Insurance Fund, though, she should worry that Bloomberg News will actually get its hands <a href=\"http://blogs.cqpolitics.com/balance_of_power/2009/08/bernankes-fed-forced-to-disclo.html\">on the emergency loan records</a> that the Fed is trying to keep hidden.</p></div>",
  "content_text": "This woman’s letter to WND made me laugh:\nI am an avid reader of WorldNetDaily and a staunch conservative, and I can’t believe that you would run Vox Day’s article saying that there is no deposit insurance on people’s bank accounts. This scare tactic has the potential to do great harm to this nation. What are you trying to do, start a run on the banks?\nIf people lose faith in the FDIC and begin withdrawing their money from the banks, it will be the proverbial straw that will send us into a deep depression.\nThe loss of people’s money in banks and credit unions was one of principles causing the length of the Great Depression of the 1930s. How could you in good faith sponsor a distrust of the safety of people’s deposits in banks? Faith in our financial system is necessary to help our country survive these trying times. Shame on you for publishing such material.\nThe funny thing about this complaint is that everything I said in that column was taken directly from the FDIC.  It’s not a “scare tactic”, its the facts taken directly from the FDIC Quarterly and the press releases they issue every time they seize a bank.  She shouldn’t fret about the negative balance in the Deposit Insurance Fund, though, she should worry that Bloomberg News will actually get its hands\non the emergency loan records\nthat the Fed is trying to keep hidden.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-25T17:33:00+00:00"
}