{
  "url": "https://voxday.net/2009/08/02/good-news-they-found-hospita/",
  "scraped_at": "2026-01-08T23:02:57.106890",
  "title": "Good news: they found Obama’s hospital",
  "date_display": "August 2, 2009",
  "date_iso": "2009-08-02T18:56:00+00:00",
  "date_from_url": "2009-08-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The bad news: <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=105764\">it isn’t in Hawaii</a> after all:</p><blockquote><p>California attorney Orly Taitz, who has filed a number of lawsuits demanding proof of Barack Obama’s eligibility to serve as president, has released a copy of what purports to be a Kenyan certification of birth and has filed a new motion in U.S. District Court for its authentication.  The document lists Obama’s parents as Barack Hussein Obama and Stanley Ann Obama, formerly Stanley Ann Dunham, the birth date as Aug. 4, 1961, and the hospital of birth as Coast General Hospital in Mombasa, Kenya.  No doctor is listed. But the alleged certificate bears the signature of the deputy registrar of Coast Province, Joshua Simon Couya. It was allegedly issued as a certified copy of the original in February 1964.</p><p>WND was able to obtain other birth certificates from Kenya for purposes of comparison, and the form of the documents appear to be identical.</p></blockquote><p>Well, you have to admit.  The Obama administration, however short-lived it turns out to be, has certainly more than lived up to its comedic potential.  If this alleged certified document from 1964 – the year Obama’s parents divorced –  turns out to be a genuine certified copy of Obama’s actual birth certificate, it would certainly explain why Kenyan authorities were hassling Jerome Corsi the last time he was snooping around Mombasa.</p><p>It will be interesting to see how this is explained away.  After all, it’s even harder to explain how and why Obama’s enemies planted a document with a Kenyan registrar back in 1961 than it is to explain why Obama’s mother would have played a little fast-and-loose with the truth in order to ensure that her son got American citizenship.</p><p>UPDATE – The important question is: <i><a href=\"http://www.latimes.com/news/opinion/commentary/la-oe-maher31-2009jul31,0,622151.story\">how did Bill Maher know</a> this document was on the verge of being found?</i> 1) “‘Birthers’ must be stopped [before they find the real birth certificate].”  2) “No matter how dumb, the people who are questioning whether Obama was born in the U.S. could eventually cause real problems [by finding the real birth certificate].”  3) “Never underestimate the ability of a tiny fringe group of losers to ruin everything [by finding the real birth certificate].”</p><p>UPDATE II – If the alleged certified copy of a Kenyan birth certificate is another fake – and <a href=\"http://nativeborncitizen.wordpress.com/2009/08/02/third-obama-birth-certificate-appears-in-court/\">there appears to be some evidence that it is</a> – I fail to see how this is going to help the Obama administration in its cause to prevent the release of a Hawaiian long-form certificate of live birth.  Its goal is to get people to STOP talking about birth certificates, not to draw even more attention to the fact that he is desperately trying to avoid being forced to produce one.  And aside from the irrelevant juvenile glee it affords the more devout Obama devotees, the primary impact of the appearance of this document, even if forged, is to increase the pressure on the Obama administration to show its cards.  What seems to have escaped everyone’s attention is that if it is a forgery, its release was probably a tactical legal move because now that it has been entered into the court record, it will be up to the other side to show that it is a forgery in court.  I found Taitz’s wording to be quite suggestive in this regard: “”I’m forcing the issue, where Obama will have to respond.  Before, they said, ‘You don’t have anything backing your claims.’ Now I have something.”  Notice how she didn’t say she had something <i>conclusive</i> as would normally have been the case if she was certain that the document was real.</p><p>It’s not hard to imagine that Taitz suspects the document is fake, but that she can’t be proven to know one way or the other.  Now that it’s been entered into evidence, it will serve its purpose by putting pressure on the other side to conclusively disprove it by showing the real document… if they can.  I also suspect that she can show how the CERTIFICATION does not necessarily serve as proof of the existence of a Hawaiian-issued certificate, otherwise the tactical maneuver of entering the alleged Kenyan document into evidence would make little sense.</p><p>In any case, no amount of forgeries and frauds will make this go away.  The determined lack of curiosity among Obama supporters is telling; if they had genuine confidence in the truth of the Obama story, they would not only be mocking the so-called “birthers”, they’d be calling for the release of the birth certificate themselves.  They’re not, because they’re rightly afraid that there is something very politically damaging being hidden in his past.  And for all the desperate whistling past the graveyard, this hasn’t helped Obama in the least as his approval numbers have been trending steeply down, not up.</p></div>",
  "content_text": "The bad news:\nit isn’t in Hawaii\nafter all:\nCalifornia attorney Orly Taitz, who has filed a number of lawsuits demanding proof of Barack Obama’s eligibility to serve as president, has released a copy of what purports to be a Kenyan certification of birth and has filed a new motion in U.S. District Court for its authentication.  The document lists Obama’s parents as Barack Hussein Obama and Stanley Ann Obama, formerly Stanley Ann Dunham, the birth date as Aug. 4, 1961, and the hospital of birth as Coast General Hospital in Mombasa, Kenya.  No doctor is listed. But the alleged certificate bears the signature of the deputy registrar of Coast Province, Joshua Simon Couya. It was allegedly issued as a certified copy of the original in February 1964.\nWND was able to obtain other birth certificates from Kenya for purposes of comparison, and the form of the documents appear to be identical.\nWell, you have to admit.  The Obama administration, however short-lived it turns out to be, has certainly more than lived up to its comedic potential.  If this alleged certified document from 1964 – the year Obama’s parents divorced –  turns out to be a genuine certified copy of Obama’s actual birth certificate, it would certainly explain why Kenyan authorities were hassling Jerome Corsi the last time he was snooping around Mombasa.\nIt will be interesting to see how this is explained away.  After all, it’s even harder to explain how and why Obama’s enemies planted a document with a Kenyan registrar back in 1961 than it is to explain why Obama’s mother would have played a little fast-and-loose with the truth in order to ensure that her son got American citizenship.\nUPDATE – The important question is:\nhow did Bill Maher know\nthis document was on the verge of being found?\n1) “‘Birthers’ must be stopped [before they find the real birth certificate].”  2) “No matter how dumb, the people who are questioning whether Obama was born in the U.S. could eventually cause real problems [by finding the real birth certificate].”  3) “Never underestimate the ability of a tiny fringe group of losers to ruin everything [by finding the real birth certificate].”\nUPDATE II – If the alleged certified copy of a Kenyan birth certificate is another fake – and\nthere appears to be some evidence that it is\n– I fail to see how this is going to help the Obama administration in its cause to prevent the release of a Hawaiian long-form certificate of live birth.  Its goal is to get people to STOP talking about birth certificates, not to draw even more attention to the fact that he is desperately trying to avoid being forced to produce one.  And aside from the irrelevant juvenile glee it affords the more devout Obama devotees, the primary impact of the appearance of this document, even if forged, is to increase the pressure on the Obama administration to show its cards.  What seems to have escaped everyone’s attention is that if it is a forgery, its release was probably a tactical legal move because now that it has been entered into the court record, it will be up to the other side to show that it is a forgery in court.  I found Taitz’s wording to be quite suggestive in this regard: “”I’m forcing the issue, where Obama will have to respond.  Before, they said, ‘You don’t have anything backing your claims.’ Now I have something.”  Notice how she didn’t say she had something\nconclusive\nas would normally have been the case if she was certain that the document was real.\nIt’s not hard to imagine that Taitz suspects the document is fake, but that she can’t be proven to know one way or the other.  Now that it’s been entered into evidence, it will serve its purpose by putting pressure on the other side to conclusively disprove it by showing the real document… if they can.  I also suspect that she can show how the CERTIFICATION does not necessarily serve as proof of the existence of a Hawaiian-issued certificate, otherwise the tactical maneuver of entering the alleged Kenyan document into evidence would make little sense.\nIn any case, no amount of forgeries and frauds will make this go away.  The determined lack of curiosity among Obama supporters is telling; if they had genuine confidence in the truth of the Obama story, they would not only be mocking the so-called “birthers”, they’d be calling for the release of the birth certificate themselves.  They’re not, because they’re rightly afraid that there is something very politically damaging being hidden in his past.  And for all the desperate whistling past the graveyard, this hasn’t helped Obama in the least as his approval numbers have been trending steeply down, not up.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-02T17:56:00+00:00"
}