{
  "url": "https://voxday.net/2009/08/17/interview-with-ian-wishar/",
  "scraped_at": "2026-01-08T23:04:12.810472",
  "title": "Interview with Ian Wishart",
  "date_display": "August 17, 2009",
  "date_iso": "2009-08-17T04:01:00+00:00",
  "date_from_url": "2009-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Vox Day interviewed Ian Wishart, author of <a href=\"http://www.amazon.com/Air-Con-Seriously-Inconvenient-Warming/dp/0958240140/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1250433380&amp;sr=8-1\">Air Con: The Seriously Inconvenient Truth About Global Warming</a>, on August 9th, 2009.</i></p><p><b>VD: How did you end up deciding to write a book about the science of global warming? You’re in New Zealand, after all, which few would consider to be at the forefront of the debate.</b> </p><p>IW: New Zealand is a perfect example for Americans of where this global warming issue is headed. The UN lobbyists pushing for a comprehensive emissions cap and trade scheme desperately want agriculture included in the mix, which is why the IPCC announced last year that greenhouse gas emissions from agriculture outweighed all of the industrial CO2 emissions caused by humans. However, the lobby groups know that they’ll never get American farmers herded into that particular pen unless the rest of the world is lined up first, and unless America first surrenders its national sovereignty to an overarching international governance organization like the UN.  That’s the blunt description. The more ‘nuanced’ and diplomatic description is that first there has to be an agreement under international law that all participants bind themselves to – which is Copenhagen 09 – and the fine print of which allows recognized international agencies such as the World Trade Organization or others to impose sanctions, tariffs or other enforcement provisions against non-compliers with the full weight of the UN behind them.</p><p>Now, in New Zealand’s case we’ve been a UN guinea pig for the past two decades, in the sense that we have strongly globalist political parties and a strongly globalist bureaucracy. We’re often the first to stick our hands up to endorse various UN initiatives or ratify daft treaties, and in fact our last Prime Minister, Helen Clark, is now the number three leader at the UN tasked with overhauling the agency for a bold new global mission. Helen Clark was a key figure in the leftist global organization Socialist International, alongside one or two people who are now President Obama’s advisors. The fact that she’s now running the UN Development Program and is tipped as a future UN Secretary-General should be sounding alarm bells. If the UN says jump, our government’s usual response is how high?.  New Zealand scientists occupy key positions as UN IPCC scientific advisors, so don’t be fooled by our soft, woolly image.  Our bureaucrats have told our government that agriculture must eventually be included in our cap and trade system, or Emissions Trading Scheme as it is formally known here, because emissions from cattle and sheep comprise 49 percent of New Zealand’s total GHG account.  Leave aside the dodgy science behind these claims and focus on the practical consideration for a moment. New Zealand’s GHG emissions are currently running about 22 percent ahead of the 1990 Kyoto baseline. The NZ government is expected to announce it will aim for a 15 percent emissions cut relevant to that 1990 baseline by 2020. In real terms, that means we would have to cut overall emissions by 37 percent from where they are now.</p><p>An official government report last month puts the cost of that at $1,400 for each man, woman and child, per year. So a family of five will be hit with a new bill of around $7,000 a year. The eventual target is fifty percent of the 1990 level by 2050, and the same government report suggests a forty percent target will cost $3,000 per person per year, or $15,000 for a family of five, on top of existing taxes and living costs. To achieve emissions cuts at that sort of level will require the equivalent of financially carpet-bombing the industrialized first world back to the Stone Age. And once the UN gets enough countries to agree that agriculture should be included in cap and trade, American farmers will be hit too, because the US administration will already have put the mechanisms in place to recognize the obligations of these international agreements.</p><p>If you look at the economic prize at stake, consider this. We currently have gold markets, but you are not forced to buy and sell gold and only a tiny percentage of the community are active in the gold markets. The financial markets are larger, but even then most of us are not forced to buy and sell shares or trade forex, and only a minority of us actually do so. But if carbon trading becomes compulsory worldwide, effectively every single one of us will be forced to buy and sell through this scheme. No one will be able to go through their daily lives without being represented directly or indirectly in the carbon markets.  Those who control the carbon markets will effectively control the world.</p><p>If we are going to cede that kind of control, and money, for a claimed crisis of planetary proportions, shouldn’t we first be absolutely certain that the crisis is real?</p><p><b>When you began your research for writing <i>Air Con</i>, were you convinced that global warming was taking place? Or were you always skeptical about it?</b></p><p>I’ve had an almost 28-year career in the mainstream media, from network television and talk radio to magazine and newspaper, but unlike many journalists I also served a stint as a political media advisor for a Labour administration briefly in the 1980s, – like the American Democrats, only more left wing – so I’ve seen the news from the perspective of both the spinner and the spun.  When the global warming issue first hit mainstream media in the late 80s, I accepted at face value, as I think most people did, that it seemed possible human pollution was overheating the planet.  After all, we’d had the acid rain scare, the ozone hole and CFCs, we’d seen smog in Tokyo, LA and London, and we’d all watched the anti-nuclear move <i>The Day After</i> which suggested pollution from atomic war would cause a mini ice-age.  So we’d been well and truly primed to accept that humans could, and probably were, damaging the climate.</p><p>However, in the past six years or so I’ve grown far more skeptical about many of the claims surrounding global warming, particularly as they’ve taken on more of a propaganda tone mixed in with lashings of New Age religious messages. I was seeing the debate move well and truly beyond science and into a classic “consciousness-raising” exercise where fear of climate change was being used to fundamentally restructure both society and politics.  Al Gore has admitted as much, telling an audience after the G8 meeting last month, and I quote, “It is the awareness itself that will drive the change, and one of the ways it will drive the change is through global governance and global agreements.”</p><p>If that’s not consciousness-raising in drag, I don’t know what is. Or take Nicholas Stern’s new book published at the same time as <i>Air Con</i>, <i>The Global Deal</i>. That title is a deliberately chosen buzzphrase with a pedigree several years older.  A Socialist International briefing paper for the UN Development Program used the term in 2005. Then, in early 2009, British Prime Minister Gordon Brown was telling anyone who would listen that “we need a Global New Deal”.</p><p>So along comes Nicholas Stern’s blueprint for a new global deal, subtitled, “Climate change and the creation of a new era of progress and prosperity”. They are marketing and selling climate change as a warm fuzzy moment to create the impression that fighting climate change will make us prosperous and lead to what that Socialist International briefing paper called, in their own words, “a new world order”.  That’s the context around where the global warming debate is heading.</p><p>I would say my journey can correctly be labeled “believer to neutral to skeptic”. It wasn’t until I began researching <i>Air Con</i> last year, however, that I gained the full appreciation of what has really happened and the agenda behind it.<br> &lt;\nbr /&gt;<br><b>You’re a journalist.  So, given that polls repeatedly find global warming to be of very little concern to the public – in Air Con you note that it finished 20th out of 20 concerns in a Pew Research poll of Americans – why does it always seem to be in the news?</b></br></br></p><p>It’s in the news for a number of reasons. First, it’s pictorially sexy: crashing glaciers, chuffing smokestacks, cute polar bears and penguins, charismatic politicians and earnest, eloquent and gamine environmental lobbyists warning of apocalypse now – these things make the essential ingredients of dramatic news coverage.  Where once my bosses said “if it bleeds, it leads”, news directors seem to have a new slogan, “if it melts, it sells”. Global warming may be a non-issue to most voters in the great scheme of things, but enough of them think it is [an important issue] to influence news ratings and they’re very passionate about it.</p><p>I gave a speech to nearly 400 people in one provincial New Zealand city last month on global warming and <i>Air Con</i>, and Green supporters had flown nearly 500 kilometres just to heckle me. I hate to think what their carbon footprint was from that stunt!  So another reason, then, is that although a minority of people list global warming as a concern, they are a very passionate and vocal minority. And in any conflict, passion beats apathy any day of the week. Mark Steyn made the point a few years back that the West is effectively sleepwalking to national suicide by ignoring the dangers of Islamofascism. In a similar way, if we in the usually silent majority don’t get off our backsides, start reading about global warming and the political agendas behind it, and start making our voices heard very loudly, we’re going to wake up one morning to find there’s been a revolution and we’re the losers, because we didn’t take the warning signs seriously.</p><p>There’s a further reason you get a lot of pro-AGW coverage in the mainstream media: bias. Most of us in journalism are not just reporters, we are idealists. We think we have a responsibility to change the planet for the greater good, and with the power of television and movies we think we can actually achieve those changes by manipulating public opinion. So at a newsroom level, you’ve had a subconscious buy-in on a whole lot of liberal agendas, including saving polar bears. Journalists are going to keep preaching human-caused global warming as a crisis because they genuinely believe it is, and they think they have a duty to educate you to believe as well. The proposed solution, a global governance regime to save the planet and re-allocate resources, fits the academic, left-wing world view of many in the media like a hand in glove.</p><p><b>Activists seeking action on anthropogenic global warming/climate change repeatedly assert that the science is settled. Is this in fact the case? If the science isn’t actually settled, then why is there an apparent scientific consensus declaring that it is?</b></p><p>At the risk of invoking Godwin’s Law, if you tell a lie often enough the public will come to believe it. The pro-AGW activists have done a lot of focus-group research on their buzzphrases, and consensus implies collective wisdom. By definition, those outside a consensus are implicitly outliers, loners or deniers, or not wise. The word appeals to basic herd instinct. Of course, the media don’t remind us of great consensus moments of the past, such as that African-Americans were only fit to be slaves, or that women should not have the vote, or that the Jews should be eradicated from the face of the Earth.</p><p>Consensus, in science, means nothing. The history of science is littered with examples of shattered consensus once the real evidence has come to light. The truth has never been determined by a vote. Human-caused global warming isn’t real just because a group of scientists hold a vote on it. It can only be real if the hard data proves it to be so according to rigorous scientific testing. One scientist doing an honest objective study is worth more than a thousand picking up their global warming study paychecks each month and holding meetings to reach a committee decision on the dangers of global warming.  So, you are correct in suggesting the consensus is only apparent.</p><p>Scientists are broadly agreed that Earth has been warming, but they are nowhere near broadly agreed on how significant that warming is or how much of it is caused by human influences. There are scientific papers flying back and forth like bullets on various aspects of alleged climate change; just last week there were stories about a scientific paper in the <i>Journal of Climate</i> which admitted that Greenland’s supposed “extreme melt” of the past decade wasn’t even a record for the past 100 years, let alone all time – the study found a warm period in the 1920s and 30s in Greenland was 33% higher than it is now, and for entirely natural reasons that have nothing to do with CO2.  If there really was a scientific “consensus” on human-caused global warming, then activists on both sides of the debate wouldn’t be able to accuse each other, as they currently do, of “cherrypicking” scientific data to support their respective cases. If all scientific studies led to one conclusion, there would be nothing to cherrypick.  The fact that we are having this debate, and that <i>Air Con</i> can be published with references to hundreds of scientific studies that cast doubt on aspects of AGW, is proof that the consensus is a fictional concept used by climate change fearmongers to scare the public and politicians into submission.</p><p><b>It’s been rather cool in both the United States and Europe over the last two summers. What’s the weather been like in the Southern Hemisphere?</b></p><p>We are shivering too. Temperatures in New Zealand are well down on average. May was the coldest May on record, even though modern temperatures are biased by the urban heat island effect, and June temperatures were down point seven degrees centigrade below the long term average. What’s been interesting is that the northern hemisphere summer has been pretty cool this year, and the corresponding southern hemisphere winter has been equally crisp. I wouldn’t read too much into it though. As I point out in <i>Air Con,</i>, Earth’s temperature has always cycled between warm and cool, with short term fluctuations sometimes overlaid across much longer climate cycles. We’ve been pulling out of the Little Ice Age since the 1800s, so I fully expect the past century to have been warmer and barring strong evidence to the contrary would expect the natural warming cycle to continue for a while longer yet.</p><p><b>You criticize the computer models cited to warn of the dangers of global warming. What is your basis for finding the models lacking, or less than credible?</b></p><p>The essential arguments about the credibility of the computer climate models are based on the garbage in/garbage out principle. They are only as good as the data programmed into them, and the sophistication of their analysis. We’ve only had satellite weather coverage of the planet for thirty years, and the land-based surface temperature records are notoriously unreliable. We can’t forecast weather accurately, and forecasting climate is even more difficult because our knowledge of planetary climate cycles is rudimentary at best. Unlike the laws of physics and chemistry, which were figured out decades ago or more, we are still getting major new scientific papers on climate issues every couple of weeks, which indicates there is an awful lot still to discover.</p><p>The models singularly failed to predict the current situation of rapidly rising CO2 over the past decade but flatlining temperatures. This goes against the very grain of human-caused global warming theory, which demands that human CO2 emissions outweigh any other climate factor on the planet. Obviously it’s not true, because temperatures are not rising in line with CO2 levels.</p><p><b>Why was there so much attention focused on the failure of the USA to ratify the Kyoto Protocol, since the European nations that have ratified it never lived up to their treaty obligations anyhow? And what do you believe accounted for Barack Obama’s change of position on the issue since he voted against Kyoto in 1998 as an Illinois state senator.</b></p><p>The growing globalist movement, that I referred to earlier, doesn’t like the idea of a powerful United States capable of acting unilaterally on issues. The US rejection of Kyoto was seen by Europe and the Left as a repudiation of globalism in favor of US national interests. It didn’t actually matter that the US rejected Kyoto for sound scientific reasons, the real reason for the manure being dumped on the US is that it had not yet been brought to heel by the UN and the quote, international community, unquote.</p><p>You are absolutely right in that the European nations failed to live up to Kyoto. An even better example is good old New Zealand. Despite taking the moral high ground, signing Kyoto and telling the world how clever we were, New Zealand’s emissions have grown faster than even America’s, which didn’t ratify Kyoto.  But like I say, substance in regard to Kyoto and Copenhagen is irrelevant. What’s really at stake is locking sovereign countries into the hegemony of international treaties that bind subsequent governments and their citizens to a new global political infrastructure. It’s a wedge in the door. It doesn’t matter whether it actually works, because the climate debate isn’t really about climate, it’s about control. Once the infrastructure of a binding global treaty is in place, the details can be left to the fine print, the same way the Waxman-Markey Bill was approved carte blanche by Congress despite the fact few representatives had a chance to read the detail.</p><p>You ask what made Obama change his mind? A political education, and funding from globalist, world-government players like George Soros. Eleven years down the track, the President is now well aware of the potential benefits to the Left from using climate change to increase state control under the apparent authority of “the international community” and “consensus”.</p><p><b>In the chapter entitled “What Cars did the Dinosaurs Drive”, you cite evidence that CO2 levels were much higher during the Paleozoic Era than they are today. But, doesn’t that prove that the Earth was considerably warmer then and that the Greenhouse Effect is a potential problem?</b></p><p>What the data shows is that despite the Greenhouse Effect the planet’s temperature has remained largely stable for most of the past 600 million years, and life of all kinds thrived in that warmer environment. It shows that after a certain atmospheric saturation percentage is reached, CO2 has no further impact on temperature. It also shows that CO2 levels have historically gone up and down without big impacts on temperature. In fact, the best data suggests the sun warms the planet first, and rising CO2 then follows around 800 years later, not the other way around.   Perhaps most telling about the evidence in that chapter, however, is that the fossil record shows CO2 levels could shoot up, while at the same time temperatures plunged, and vice versa. So there’s no obvious correlation between CO2 in the atmosphere and temperature, which is key to the current debate.</p><p><b>You provide several examples of questionable behavior by the IPCC. What would be their motivation to mislead politicians and other influential people in their Summary for Policymakers? Aren’t they just scientists doing science?</b></p><p>They’re scientists whose careers, and certainly their next funding applications, rely heavily on toeing the party line on global warming. If you’re a climate scientist, and human-caused global warming is the only game in town, and there’s a guy in the corner handing out $79 billion worth of checks for scientists who provide studies backing up the basic premise of AGW, are you going to be the one who stands up, points at a naked Al Gore and shrieks, ‘the Emperor has no clothes’?</p><p>Of course you’re not. You’ll take your funding check, do the work that’s asked, probably presenting data that actually casts doubt on AGW, but your Abstract and executive summary will clearly and openly blame humans for whatever problem you studied. In this fashion, you are deemed to be “inside the tent”, or “one of us”, and as long as you keep playing the game you’ll keep getting paid.</p><p>Rajendra Pachauri is the head of the UN IPCC. He’s also now been appointed to head up Yale University’s climate research unit, in charge of a funding budget for young scientists. What Yale post-grad student is going to waltz up to Rajendra and ask for funding for a study that clearly shows humans are not to blame? And if someone tried, do we really believe they would get that funding? The words “snowball” and “hell” come to mind.</p><p>If you actually read some of the IPCC material however, it’s actually quite cautious in many places where it has been written by real scientists. However, the political writers who helped shape the summaries have hyped up their material, and the lobby groups and vested interests have leapt on board so that a projected thirty centimeter to sixty centimeter sea level rise this century by the IPCC is now possibly ten meters within 100 years. It’s like the green lobbyists have played Chinese Whispers so that the data passed on to the news media bears little resemblance to the facts.</p><p><b><i>Cui bono?</i> Who benefits from exaggerating the danger of global warming? Do you think the global warming faithful genuinely believe that the world is in great danger? Or is this some sort of massive scam on a worldwide scale?</b></p><p>I think the grassroots believer certainly has a genuine belief that the world is in great danger. They’ve all seen High Priest Gore’s movie. I think that many of the climate scientists who specialize in computer models have spent far too much time locked in dark rooms with their machines – a kind of electronic Stockholm Syndrome – and they no longer have a balanced perspective on the issue.  Most rational people would say that if a computer model and hard evidence disagreed with each other, then the computer must be wrong. The climate scientists instead have a hissy fit and insist the real data must be wrong because their computers are infallible.</p><p>So we’ve got this weird situation where a very incestuous and tight-knit climate science community are socializing together and peer reviewing their mates’ studies, while ensuring that anyone who disagrees with them doesn’t get a favorable peer-review. Then they stand up and boast about the lack of any peer-reviewed science challenging the AGW theory. Talk about loaded dice.</p><p>Add to this that left-wing politicians and environmental lobby conglomerates like Greenpeace are milking public fear for all it’s worth, and you have the makings of a tale worthy of Lewis Carroll. If you follow the money, as I outlined at the start of the interview, you see this overarching agenda to significantly boost the power, status and resource of the United Nations. I split <i>Air Con</i> into two portions. The first three quarters of the book deals with the science about global warming, but the second part deals with the agenda, asking as you have, who benefits?  When the book came out a few weeks back, <i>Investigate</i> magazine published a fascinating story on the UN’s agenda, which you <a href=\"http://www.thebriefingroom.com/archives/2009/07/global_governan.html\">can find online</a>. Read in conjunction with <i>Air Con</i>, the scam is laid bare in black and white for the world to see.</p><p><b>You’re an investigative journalist, not a scientist. What is your response to critics who point out that you’re not a scientist, let alone a climatologist, and therefore are not qualified to opine on a com<br> plicated scientific matter such as global climate change.</br></b></p><p>Yes, I’m a journalist. So is Al Gore by trade, although I have much more journalistic experience than he does. Rajendra Pachauri, who heads the IPCC and now also the climate change centre at Yale University, is a train engineer by trade. Nicholas Stern in the UK is an economist, not a climate scientist. Bill McKibben, who’s pushing the 350.org agenda and whose work helped inspire Al Gore, is a journalist and Sunday School teacher. NASA’s Jim Hansen is a politician masquerading as a climate scientist. New Zealand’s self-appointed leading climate alarmist is actually a truffle hunter in his day job, and Leonardo di Caprio is a Hollywood actor.  So my credentials are no better nor worse than many of the leading voices in the climate debate. What do I bring that’s different? Probably a healthy skepticism and an inbuilt nose for detecting “spin” based on my experience in that field.</p><p>The global warming advocates are allowed to show pictures of stranded bears or breaking ice shelves to children in the assumption that the general public are qualified to make informed decisions on the basis of such propaganda, but somehow as a professional investigative journalist with the actual scientific data at my fingertips, suddenly the subject is too complex?  If, as a seasoned journalist and author, I can’t cover off climate change in a 120,000 word book packed with peer-reviewed references, then how on earth can my colleagues in the daily news media do it justice in a 400-word news story or 90-second TV broadcast based on what some oik from Greenpeace told them?</p><p>But you are right, there is this inherent academic bias against a journalist writing the book. When I sent out early copies of <i>Air Con</i> for review, I received a comment back from climate scientist Dr Vincent Gray, an expert reviewer for the IPCC, who charmingly began: “I started reading this book with an intensely critical eye, expecting that a mere journalist could not possibly cope with the complexities of climate science”.   Here we go, I thought, but then Gray added, “the book is brilliant, the best I have seen.”  So, obviously I haven’t committed any glaringly grievous errors.  The Australian climatologist Warwick Hughes has endorsed <i>Air Con</i>, as has British naturalist Professor David Bellamy.  Climate expert Professor Bob Carter, when asked in a radio interview to name the definitive book on climate change for ordinary readers, chose <i>Air Con</i>.</p><p>I’m not saying this to blow my own trumpet, but by way of getting past this “He’s just a journalist” issue. I’ve actually studied the literature on climate change, comprehensively. In contrast, I’d wager a small fortune that most of the politicians actually voting on climate change laws have not read as widely because they’re too busy, and they’re relying instead on short briefing papers from their advisors. In other words, as a journalist I’m better briefed than most of those who’ll decide the fate of the American public.  To date, none of the critical reviewers of <i>Air Con</i> on Amazon have actually read the book. The New Zealand government’s Climate Change minister, Nick Smith, held meetings up and down the country telling people not to read <i>Air Con</i> and referring them instead to a political handout sheet written by some tame scientists in 2005. When you actually examined the handout sheet in detail, it was based on science from the 2001 IPCC report, so it is more than eight years out of date. Yet the government thought it could get away trying to debunk a 2009 book containing studies published up to April 2009, using 2001 data. Unbelievable.</p><p>It must be a very dangerous book for so many people to attack it without reading it or directly answering the evidence inside it. My response has been to hit back with <a href=\"http://www.youtube.com/watch?v=90otAJORkK8\">a documentary on global warming</a>.  I’m a strong believer in not rolling over in the face of a challenge, and the scam surrounding global warming is perhaps the biggest threat our political system has ever faced.</p><p><b>In conclusion, allow me to congratulate you. <i>Air Con</i> has been a #1 bestseller in both New Zealand and on Amazon in the Science &gt; Earth Sciences &gt; Climatology &gt; Climate Changes category. I noticed that last week, the top three books in that category, including <i>Air Con</i>, are all openly skeptical of global warming. Do you believe that we’re approaching a tipping point in terms of the public’s acceptance or rejection of the AGW/CC theory?</b></p><p>Yeah, I think we are, although I wouldn’t underestimate the effect of the deluge of climate change scare stories that are going to hit us as we get closer to Copenhagen by the end of this year.  If Copenhagen sets in motion what we think it will and what its organizers hope it will, then we are well on the path to the ultimate nanny state, where the UN or some successor international agency is given approval to essentially control world development and, if it deems it necessary, take money from the citizens of first world countries and give it to those of third world countries in the name of equity and social justice.</p><p>Climate change is the stalking horse being used for this project because, as we have all been told ad nauseum that global problems require global solutions. The UN has correctly identified that it stands to make a fortune if cap and trade schemes and carbon taxes go ahead based on a worldwide framework, and we have politicians, including the Obama administration, falling over themselves to help usher in this ultimate global solution.</p><p>I take some comfort from the fact that a number of grassroots Green supporters are waking up to the scam that is cap and trade, recognizing it will make the UN and a number of huge multinational companies and money traders very rich, but have no impact on the climate…. I think it’s really important to remember that ordinary people on the left or right of the political spectrum have integrity and are not stupid. They can see the growing disconnect between the hype and reality, and they can see that emissions trading that allows third world countries to burn coal like it’s going out of fashion won’t improve our climate one iota. They can see that an elite group of bureaucrats, lobbyists, corporates and politicians will get enormous money and power, and they can smell a rat.</p><p>As I pointed out earlier, there are people who are a few heartbeats away from implementing the most radical power and wealth shift in human history, and they’ll do it without a single shot being fired. We stand on the brink of unelected global governance from the United Nations, but via the infrastructure of member governments so as to give the illusion of democratic representation. Countries that resist will be bullied into submission, and eventually control of the planet will indeed pass to what Obama’s science advisor John Holdren approvingly called “a Planetary Regime” with power to enforce the agreed limits.</p><p>Hitler couldn’t do it with guns. Marx couldn’t do it with force, but his acolytes are on the verge of doing it by stealth and deception.  Bjorn Lomborg recently coined a wonderful term for this new power bloc: “the climate-industrial complex”.</p><p>Will the public wake up? We’ve got just a few weeks to pressure the Senate, and four months to put some serious public pressure on the politicians over Copenhagen ahead of the December meeting. You mentioned the Pew poll reprinted in <i>Air Con</i> that shows global warming ranking bottom of the list in public concerns. This is a double-edged sword because it breeds complacency. The public assume that just because they don’t think it’s an issue, the politicians will take notice of this. Hello! You’ve just had an election. Right now, the politicians don’t care what you think unless you really make them feel the heat.</p><p>I’m heartened by the response to <i>Air C<br> on</br></i>, which has been as high as #1 on Amazon’s climate category on both sides of the Atlantic, because it shows people have found the book useful as a weapon to restore some sanity to the climate debate.  It’s just been picked up by The Conservative Book Club, so more people will become aware of it. The point I’ve made in speeches when people ask me what they can do is simply this: Get informed. Make your voice heard. We live in an era of instant communication. There are some very good climate books out there, so whether it’s <i>Air Con</i> or another that takes your fancy, the main thing is to finally, seriously engage in this debate. An investment of $19 for a book is tiny in comparison to the $7,000 per year you could be paying in homage to the Emperor’s invisible clothes.</p><p>When news media run bogus climate-scare stories, quote them some of the peer-reviewed data in the books and hold them accountable. If the public begin to fight back against the media and their political representatives, the tide may yet turn on this madness.</p></div>",
  "content_text": "Vox Day interviewed Ian Wishart, author of\nAir Con: The Seriously Inconvenient Truth About Global Warming\n, on August 9th, 2009.\nVD: How did you end up deciding to write a book about the science of global warming? You’re in New Zealand, after all, which few would consider to be at the forefront of the debate.\nIW: New Zealand is a perfect example for Americans of where this global warming issue is headed. The UN lobbyists pushing for a comprehensive emissions cap and trade scheme desperately want agriculture included in the mix, which is why the IPCC announced last year that greenhouse gas emissions from agriculture outweighed all of the industrial CO2 emissions caused by humans. However, the lobby groups know that they’ll never get American farmers herded into that particular pen unless the rest of the world is lined up first, and unless America first surrenders its national sovereignty to an overarching international governance organization like the UN.  That’s the blunt description. The more ‘nuanced’ and diplomatic description is that first there has to be an agreement under international law that all participants bind themselves to – which is Copenhagen 09 – and the fine print of which allows recognized international agencies such as the World Trade Organization or others to impose sanctions, tariffs or other enforcement provisions against non-compliers with the full weight of the UN behind them.\nNow, in New Zealand’s case we’ve been a UN guinea pig for the past two decades, in the sense that we have strongly globalist political parties and a strongly globalist bureaucracy. We’re often the first to stick our hands up to endorse various UN initiatives or ratify daft treaties, and in fact our last Prime Minister, Helen Clark, is now the number three leader at the UN tasked with overhauling the agency for a bold new global mission. Helen Clark was a key figure in the leftist global organization Socialist International, alongside one or two people who are now President Obama’s advisors. The fact that she’s now running the UN Development Program and is tipped as a future UN Secretary-General should be sounding alarm bells. If the UN says jump, our government’s usual response is how high?.  New Zealand scientists occupy key positions as UN IPCC scientific advisors, so don’t be fooled by our soft, woolly image.  Our bureaucrats have told our government that agriculture must eventually be included in our cap and trade system, or Emissions Trading Scheme as it is formally known here, because emissions from cattle and sheep comprise 49 percent of New Zealand’s total GHG account.  Leave aside the dodgy science behind these claims and focus on the practical consideration for a moment. New Zealand’s GHG emissions are currently running about 22 percent ahead of the 1990 Kyoto baseline. The NZ government is expected to announce it will aim for a 15 percent emissions cut relevant to that 1990 baseline by 2020. In real terms, that means we would have to cut overall emissions by 37 percent from where they are now.\nAn official government report last month puts the cost of that at $1,400 for each man, woman and child, per year. So a family of five will be hit with a new bill of around $7,000 a year. The eventual target is fifty percent of the 1990 level by 2050, and the same government report suggests a forty percent target will cost $3,000 per person per year, or $15,000 for a family of five, on top of existing taxes and living costs. To achieve emissions cuts at that sort of level will require the equivalent of financially carpet-bombing the industrialized first world back to the Stone Age. And once the UN gets enough countries to agree that agriculture should be included in cap and trade, American farmers will be hit too, because the US administration will already have put the mechanisms in place to recognize the obligations of these international agreements.\nIf you look at the economic prize at stake, consider this. We currently have gold markets, but you are not forced to buy and sell gold and only a tiny percentage of the community are active in the gold markets. The financial markets are larger, but even then most of us are not forced to buy and sell shares or trade forex, and only a minority of us actually do so. But if carbon trading becomes compulsory worldwide, effectively every single one of us will be forced to buy and sell through this scheme. No one will be able to go through their daily lives without being represented directly or indirectly in the carbon markets.  Those who control the carbon markets will effectively control the world.\nIf we are going to cede that kind of control, and money, for a claimed crisis of planetary proportions, shouldn’t we first be absolutely certain that the crisis is real?\nWhen you began your research for writing\nAir Con\n, were you convinced that global warming was taking place? Or were you always skeptical about it?\nI’ve had an almost 28-year career in the mainstream media, from network television and talk radio to magazine and newspaper, but unlike many journalists I also served a stint as a political media advisor for a Labour administration briefly in the 1980s, – like the American Democrats, only more left wing – so I’ve seen the news from the perspective of both the spinner and the spun.  When the global warming issue first hit mainstream media in the late 80s, I accepted at face value, as I think most people did, that it seemed possible human pollution was overheating the planet.  After all, we’d had the acid rain scare, the ozone hole and CFCs, we’d seen smog in Tokyo, LA and London, and we’d all watched the anti-nuclear move\nThe Day After\nwhich suggested pollution from atomic war would cause a mini ice-age.  So we’d been well and truly primed to accept that humans could, and probably were, damaging the climate.\nHowever, in the past six years or so I’ve grown far more skeptical about many of the claims surrounding global warming, particularly as they’ve taken on more of a propaganda tone mixed in with lashings of New Age religious messages. I was seeing the debate move well and truly beyond science and into a classic “consciousness-raising” exercise where fear of climate change was being used to fundamentally restructure both society and politics.  Al Gore has admitted as much, telling an audience after the G8 meeting last month, and I quote, “It is the awareness itself that will drive the change, and one of the ways it will drive the change is through global governance and global agreements.”\nIf that’s not consciousness-raising in drag, I don’t know what is. Or take Nicholas Stern’s new book published at the same time as\nAir Con\n,\nThe Global Deal\n. That title is a deliberately chosen buzzphrase with a pedigree several years older.  A Socialist International briefing paper for the UN Development Program used the term in 2005. Then, in early 2009, British Prime Minister Gordon Brown was telling anyone who would listen that “we need a Global New Deal”.\nSo along comes Nicholas Stern’s blueprint for a new global deal, subtitled, “Climate change and the creation of a new era of progress and prosperity”. They are marketing and selling climate change as a warm fuzzy moment to create the impression that fighting climate change will make us prosperous and lead to what that Socialist International briefing paper called, in their own words, “a new world order”.  That’s the context around where the global warming debate is heading.\nI would say my journey can correctly be labeled “believer to neutral to skeptic”. It wasn’t until I began researching\nAir Con\nlast year, however, that I gained the full appreciation of what has really happened and the agenda behind it.\n<\nbr />\nYou’re a journalist.  So, given that polls repeatedly find global warming to be of very little concern to the public – in Air Con you note that it finished 20th out of 20 concerns in a Pew Research poll of Americans – why does it always seem to be in the news?\nIt’s in the news for a number of reasons. First, it’s pictorially sexy: crashing glaciers, chuffing smokestacks, cute polar bears and penguins, charismatic politicians and earnest, eloquent and gamine environmental lobbyists warning of apocalypse now – these things make the essential ingredients of dramatic news coverage.  Where once my bosses said “if it bleeds, it leads”, news directors seem to have a new slogan, “if it melts, it sells”. Global warming may be a non-issue to most voters in the great scheme of things, but enough of them think it is [an important issue] to influence news ratings and they’re very passionate about it.\nI gave a speech to nearly 400 people in one provincial New Zealand city last month on global warming and\nAir Con\n, and Green supporters had flown nearly 500 kilometres just to heckle me. I hate to think what their carbon footprint was from that stunt!  So another reason, then, is that although a minority of people list global warming as a concern, they are a very passionate and vocal minority. And in any conflict, passion beats apathy any day of the week. Mark Steyn made the point a few years back that the West is effectively sleepwalking to national suicide by ignoring the dangers of Islamofascism. In a similar way, if we in the usually silent majority don’t get off our backsides, start reading about global warming and the political agendas behind it, and start making our voices heard very loudly, we’re going to wake up one morning to find there’s been a revolution and we’re the losers, because we didn’t take the warning signs seriously.\nThere’s a further reason you get a lot of pro-AGW coverage in the mainstream media: bias. Most of us in journalism are not just reporters, we are idealists. We think we have a responsibility to change the planet for the greater good, and with the power of television and movies we think we can actually achieve those changes by manipulating public opinion. So at a newsroom level, you’ve had a subconscious buy-in on a whole lot of liberal agendas, including saving polar bears. Journalists are going to keep preaching human-caused global warming as a crisis because they genuinely believe it is, and they think they have a duty to educate you to believe as well. The proposed solution, a global governance regime to save the planet and re-allocate resources, fits the academic, left-wing world view of many in the media like a hand in glove.\nActivists seeking action on anthropogenic global warming/climate change repeatedly assert that the science is settled. Is this in fact the case? If the science isn’t actually settled, then why is there an apparent scientific consensus declaring that it is?\nAt the risk of invoking Godwin’s Law, if you tell a lie often enough the public will come to believe it. The pro-AGW activists have done a lot of focus-group research on their buzzphrases, and consensus implies collective wisdom. By definition, those outside a consensus are implicitly outliers, loners or deniers, or not wise. The word appeals to basic herd instinct. Of course, the media don’t remind us of great consensus moments of the past, such as that African-Americans were only fit to be slaves, or that women should not have the vote, or that the Jews should be eradicated from the face of the Earth.\nConsensus, in science, means nothing. The history of science is littered with examples of shattered consensus once the real evidence has come to light. The truth has never been determined by a vote. Human-caused global warming isn’t real just because a group of scientists hold a vote on it. It can only be real if the hard data proves it to be so according to rigorous scientific testing. One scientist doing an honest objective study is worth more than a thousand picking up their global warming study paychecks each month and holding meetings to reach a committee decision on the dangers of global warming.  So, you are correct in suggesting the consensus is only apparent.\nScientists are broadly agreed that Earth has been warming, but they are nowhere near broadly agreed on how significant that warming is or how much of it is caused by human influences. There are scientific papers flying back and forth like bullets on various aspects of alleged climate change; just last week there were stories about a scientific paper in the\nJournal of Climate\nwhich admitted that Greenland’s supposed “extreme melt” of the past decade wasn’t even a record for the past 100 years, let alone all time – the study found a warm period in the 1920s and 30s in Greenland was 33% higher than it is now, and for entirely natural reasons that have nothing to do with CO2.  If there really was a scientific “consensus” on human-caused global warming, then activists on both sides of the debate wouldn’t be able to accuse each other, as they currently do, of “cherrypicking” scientific data to support their respective cases. If all scientific studies led to one conclusion, there would be nothing to cherrypick.  The fact that we are having this debate, and that\nAir Con\ncan be published with references to hundreds of scientific studies that cast doubt on aspects of AGW, is proof that the consensus is a fictional concept used by climate change fearmongers to scare the public and politicians into submission.\nIt’s been rather cool in both the United States and Europe over the last two summers. What’s the weather been like in the Southern Hemisphere?\nWe are shivering too. Temperatures in New Zealand are well down on average. May was the coldest May on record, even though modern temperatures are biased by the urban heat island effect, and June temperatures were down point seven degrees centigrade below the long term average. What’s been interesting is that the northern hemisphere summer has been pretty cool this year, and the corresponding southern hemisphere winter has been equally crisp. I wouldn’t read too much into it though. As I point out in\nAir Con,\n, Earth’s temperature has always cycled between warm and cool, with short term fluctuations sometimes overlaid across much longer climate cycles. We’ve been pulling out of the Little Ice Age since the 1800s, so I fully expect the past century to have been warmer and barring strong evidence to the contrary would expect the natural warming cycle to continue for a while longer yet.\nYou criticize the computer models cited to warn of the dangers of global warming. What is your basis for finding the models lacking, or less than credible?\nThe essential arguments about the credibility of the computer climate models are based on the garbage in/garbage out principle. They are only as good as the data programmed into them, and the sophistication of their analysis. We’ve only had satellite weather coverage of the planet for thirty years, and the land-based surface temperature records are notoriously unreliable. We can’t forecast weather accurately, and forecasting climate is even more difficult because our knowledge of planetary climate cycles is rudimentary at best. Unlike the laws of physics and chemistry, which were figured out decades ago or more, we are still getting major new scientific papers on climate issues every couple of weeks, which indicates there is an awful lot still to discover.\nThe models singularly failed to predict the current situation of rapidly rising CO2 over the past decade but flatlining temperatures. This goes against the very grain of human-caused global warming theory, which demands that human CO2 emissions outweigh any other climate factor on the planet. Obviously it’s not true, because temperatures are not rising in line with CO2 levels.\nWhy was there so much attention focused on the failure of the USA to ratify the Kyoto Protocol, since the European nations that have ratified it never lived up to their treaty obligations anyhow? And what do you believe accounted for Barack Obama’s change of position on the issue since he voted against Kyoto in 1998 as an Illinois state senator.\nThe growing globalist movement, that I referred to earlier, doesn’t like the idea of a powerful United States capable of acting unilaterally on issues. The US rejection of Kyoto was seen by Europe and the Left as a repudiation of globalism in favor of US national interests. It didn’t actually matter that the US rejected Kyoto for sound scientific reasons, the real reason for the manure being dumped on the US is that it had not yet been brought to heel by the UN and the quote, international community, unquote.\nYou are absolutely right in that the European nations failed to live up to Kyoto. An even better example is good old New Zealand. Despite taking the moral high ground, signing Kyoto and telling the world how clever we were, New Zealand’s emissions have grown faster than even America’s, which didn’t ratify Kyoto.  But like I say, substance in regard to Kyoto and Copenhagen is irrelevant. What’s really at stake is locking sovereign countries into the hegemony of international treaties that bind subsequent governments and their citizens to a new global political infrastructure. It’s a wedge in the door. It doesn’t matter whether it actually works, because the climate debate isn’t really about climate, it’s about control. Once the infrastructure of a binding global treaty is in place, the details can be left to the fine print, the same way the Waxman-Markey Bill was approved carte blanche by Congress despite the fact few representatives had a chance to read the detail.\nYou ask what made Obama change his mind? A political education, and funding from globalist, world-government players like George Soros. Eleven years down the track, the President is now well aware of the potential benefits to the Left from using climate change to increase state control under the apparent authority of “the international community” and “consensus”.\nIn the chapter entitled “What Cars did the Dinosaurs Drive”, you cite evidence that CO2 levels were much higher during the Paleozoic Era than they are today. But, doesn’t that prove that the Earth was considerably warmer then and that the Greenhouse Effect is a potential problem?\nWhat the data shows is that despite the Greenhouse Effect the planet’s temperature has remained largely stable for most of the past 600 million years, and life of all kinds thrived in that warmer environment. It shows that after a certain atmospheric saturation percentage is reached, CO2 has no further impact on temperature. It also shows that CO2 levels have historically gone up and down without big impacts on temperature. In fact, the best data suggests the sun warms the planet first, and rising CO2 then follows around 800 years later, not the other way around.   Perhaps most telling about the evidence in that chapter, however, is that the fossil record shows CO2 levels could shoot up, while at the same time temperatures plunged, and vice versa. So there’s no obvious correlation between CO2 in the atmosphere and temperature, which is key to the current debate.\nYou provide several examples of questionable behavior by the IPCC. What would be their motivation to mislead politicians and other influential people in their Summary for Policymakers? Aren’t they just scientists doing science?\nThey’re scientists whose careers, and certainly their next funding applications, rely heavily on toeing the party line on global warming. If you’re a climate scientist, and human-caused global warming is the only game in town, and there’s a guy in the corner handing out $79 billion worth of checks for scientists who provide studies backing up the basic premise of AGW, are you going to be the one who stands up, points at a naked Al Gore and shrieks, ‘the Emperor has no clothes’?\nOf course you’re not. You’ll take your funding check, do the work that’s asked, probably presenting data that actually casts doubt on AGW, but your Abstract and executive summary will clearly and openly blame humans for whatever problem you studied. In this fashion, you are deemed to be “inside the tent”, or “one of us”, and as long as you keep playing the game you’ll keep getting paid.\nRajendra Pachauri is the head of the UN IPCC. He’s also now been appointed to head up Yale University’s climate research unit, in charge of a funding budget for young scientists. What Yale post-grad student is going to waltz up to Rajendra and ask for funding for a study that clearly shows humans are not to blame? And if someone tried, do we really believe they would get that funding? The words “snowball” and “hell” come to mind.\nIf you actually read some of the IPCC material however, it’s actually quite cautious in many places where it has been written by real scientists. However, the political writers who helped shape the summaries have hyped up their material, and the lobby groups and vested interests have leapt on board so that a projected thirty centimeter to sixty centimeter sea level rise this century by the IPCC is now possibly ten meters within 100 years. It’s like the green lobbyists have played Chinese Whispers so that the data passed on to the news media bears little resemblance to the facts.\nCui bono?\nWho benefits from exaggerating the danger of global warming? Do you think the global warming faithful genuinely believe that the world is in great danger? Or is this some sort of massive scam on a worldwide scale?\nI think the grassroots believer certainly has a genuine belief that the world is in great danger. They’ve all seen High Priest Gore’s movie. I think that many of the climate scientists who specialize in computer models have spent far too much time locked in dark rooms with their machines – a kind of electronic Stockholm Syndrome – and they no longer have a balanced perspective on the issue.  Most rational people would say that if a computer model and hard evidence disagreed with each other, then the computer must be wrong. The climate scientists instead have a hissy fit and insist the real data must be wrong because their computers are infallible.\nSo we’ve got this weird situation where a very incestuous and tight-knit climate science community are socializing together and peer reviewing their mates’ studies, while ensuring that anyone who disagrees with them doesn’t get a favorable peer-review. Then they stand up and boast about the lack of any peer-reviewed science challenging the AGW theory. Talk about loaded dice.\nAdd to this that left-wing politicians and environmental lobby conglomerates like Greenpeace are milking public fear for all it’s worth, and you have the makings of a tale worthy of Lewis Carroll. If you follow the money, as I outlined at the start of the interview, you see this overarching agenda to significantly boost the power, status and resource of the United Nations. I split\nAir Con\ninto two portions. The first three quarters of the book deals with the science about global warming, but the second part deals with the agenda, asking as you have, who benefits?  When the book came out a few weeks back,\nInvestigate\nmagazine published a fascinating story on the UN’s agenda, which you\ncan find online\n. Read in conjunction with\nAir Con\n, the scam is laid bare in black and white for the world to see.\nYou’re an investigative journalist, not a scientist. What is your response to critics who point out that you’re not a scientist, let alone a climatologist, and therefore are not qualified to opine on a com\nplicated scientific matter such as global climate change.\nYes, I’m a journalist. So is Al Gore by trade, although I have much more journalistic experience than he does. Rajendra Pachauri, who heads the IPCC and now also the climate change centre at Yale University, is a train engineer by trade. Nicholas Stern in the UK is an economist, not a climate scientist. Bill McKibben, who’s pushing the 350.org agenda and whose work helped inspire Al Gore, is a journalist and Sunday School teacher. NASA’s Jim Hansen is a politician masquerading as a climate scientist. New Zealand’s self-appointed leading climate alarmist is actually a truffle hunter in his day job, and Leonardo di Caprio is a Hollywood actor.  So my credentials are no better nor worse than many of the leading voices in the climate debate. What do I bring that’s different? Probably a healthy skepticism and an inbuilt nose for detecting “spin” based on my experience in that field.\nThe global warming advocates are allowed to show pictures of stranded bears or breaking ice shelves to children in the assumption that the general public are qualified to make informed decisions on the basis of such propaganda, but somehow as a professional investigative journalist with the actual scientific data at my fingertips, suddenly the subject is too complex?  If, as a seasoned journalist and author, I can’t cover off climate change in a 120,000 word book packed with peer-reviewed references, then how on earth can my colleagues in the daily news media do it justice in a 400-word news story or 90-second TV broadcast based on what some oik from Greenpeace told them?\nBut you are right, there is this inherent academic bias against a journalist writing the book. When I sent out early copies of\nAir Con\nfor review, I received a comment back from climate scientist Dr Vincent Gray, an expert reviewer for the IPCC, who charmingly began: “I started reading this book with an intensely critical eye, expecting that a mere journalist could not possibly cope with the complexities of climate science”.   Here we go, I thought, but then Gray added, “the book is brilliant, the best I have seen.”  So, obviously I haven’t committed any glaringly grievous errors.  The Australian climatologist Warwick Hughes has endorsed\nAir Con\n, as has British naturalist Professor David Bellamy.  Climate expert Professor Bob Carter, when asked in a radio interview to name the definitive book on climate change for ordinary readers, chose\nAir Con\n.\nI’m not saying this to blow my own trumpet, but by way of getting past this “He’s just a journalist” issue. I’ve actually studied the literature on climate change, comprehensively. In contrast, I’d wager a small fortune that most of the politicians actually voting on climate change laws have not read as widely because they’re too busy, and they’re relying instead on short briefing papers from their advisors. In other words, as a journalist I’m better briefed than most of those who’ll decide the fate of the American public.  To date, none of the critical reviewers of\nAir Con\non Amazon have actually read the book. The New Zealand government’s Climate Change minister, Nick Smith, held meetings up and down the country telling people not to read\nAir Con\nand referring them instead to a political handout sheet written by some tame scientists in 2005. When you actually examined the handout sheet in detail, it was based on science from the 2001 IPCC report, so it is more than eight years out of date. Yet the government thought it could get away trying to debunk a 2009 book containing studies published up to April 2009, using 2001 data. Unbelievable.\nIt must be a very dangerous book for so many people to attack it without reading it or directly answering the evidence inside it. My response has been to hit back with\na documentary on global warming\n.  I’m a strong believer in not rolling over in the face of a challenge, and the scam surrounding global warming is perhaps the biggest threat our political system has ever faced.\nIn conclusion, allow me to congratulate you.\nAir Con\nhas been a #1 bestseller in both New Zealand and on Amazon in the Science > Earth Sciences > Climatology > Climate Changes category. I noticed that last week, the top three books in that category, including\nAir Con\n, are all openly skeptical of global warming. Do you believe that we’re approaching a tipping point in terms of the public’s acceptance or rejection of the AGW/CC theory?\nYeah, I think we are, although I wouldn’t underestimate the effect of the deluge of climate change scare stories that are going to hit us as we get closer to Copenhagen by the end of this year.  If Copenhagen sets in motion what we think it will and what its organizers hope it will, then we are well on the path to the ultimate nanny state, where the UN or some successor international agency is given approval to essentially control world development and, if it deems it necessary, take money from the citizens of first world countries and give it to those of third world countries in the name of equity and social justice.\nClimate change is the stalking horse being used for this project because, as we have all been told ad nauseum that global problems require global solutions. The UN has correctly identified that it stands to make a fortune if cap and trade schemes and carbon taxes go ahead based on a worldwide framework, and we have politicians, including the Obama administration, falling over themselves to help usher in this ultimate global solution.\nI take some comfort from the fact that a number of grassroots Green supporters are waking up to the scam that is cap and trade, recognizing it will make the UN and a number of huge multinational companies and money traders very rich, but have no impact on the climate…. I think it’s really important to remember that ordinary people on the left or right of the political spectrum have integrity and are not stupid. They can see the growing disconnect between the hype and reality, and they can see that emissions trading that allows third world countries to burn coal like it’s going out of fashion won’t improve our climate one iota. They can see that an elite group of bureaucrats, lobbyists, corporates and politicians will get enormous money and power, and they can smell a rat.\nAs I pointed out earlier, there are people who are a few heartbeats away from implementing the most radical power and wealth shift in human history, and they’ll do it without a single shot being fired. We stand on the brink of unelected global governance from the United Nations, but via the infrastructure of member governments so as to give the illusion of democratic representation. Countries that resist will be bullied into submission, and eventually control of the planet will indeed pass to what Obama’s science advisor John Holdren approvingly called “a Planetary Regime” with power to enforce the agreed limits.\nHitler couldn’t do it with guns. Marx couldn’t do it with force, but his acolytes are on the verge of doing it by stealth and deception.  Bjorn Lomborg recently coined a wonderful term for this new power bloc: “the climate-industrial complex”.\nWill the public wake up? We’ve got just a few weeks to pressure the Senate, and four months to put some serious public pressure on the politicians over Copenhagen ahead of the December meeting. You mentioned the Pew poll reprinted in\nAir Con\nthat shows global warming ranking bottom of the list in public concerns. This is a double-edged sword because it breeds complacency. The public assume that just because they don’t think it’s an issue, the politicians will take notice of this. Hello! You’ve just had an election. Right now, the politicians don’t care what you think unless you really make them feel the heat.\nI’m heartened by the response to\nAir C\non\n, which has been as high as #1 on Amazon’s climate category on both sides of the Atlantic, because it shows people have found the book useful as a weapon to restore some sanity to the climate debate.  It’s just been picked up by The Conservative Book Club, so more people will become aware of it. The point I’ve made in speeches when people ask me what they can do is simply this: Get informed. Make your voice heard. We live in an era of instant communication. There are some very good climate books out there, so whether it’s\nAir Con\nor another that takes your fancy, the main thing is to finally, seriously engage in this debate. An investment of $19 for a book is tiny in comparison to the $7,000 per year you could be paying in homage to the Emperor’s invisible clothes.\nWhen news media run bogus climate-scare stories, quote them some of the peer-reviewed data in the books and hold them accountable. If the public begin to fight back against the media and their political representatives, the tide may yet turn on this madness.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-17T03:01:00+00:00"
}