{
  "url": "https://voxday.net/2009/08/07/legalizing-academic-fraud/",
  "scraped_at": "2026-01-08T23:03:22.876540",
  "title": "Legalizing academic fraud",
  "date_display": "August 7, 2009",
  "date_iso": "2009-08-07T17:15:00+00:00",
  "date_from_url": "2009-08-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Salt sends an email informing us that North Carolina <a href=\"http://www.ncleg.net/enactedlegislation/statutes/pdf/bysection/chapter_14/gs_14-454.pdf\">has raised the bar</a>:</p><blockquote><p>§ 14-454. Accessing computers.<br>(a) It is unlawful to willfully, directly or indirectly, access or cause to be accessed any computer, computer program, computer system, computer network, or any part<br>thereof, for the purpose of:</br></br></p><p>(1) Devising or executing any scheme or artifice to defraud, <b>unless the object of the scheme or artifice is to obtain educational testing material, a false educational testing score, or a false academic or vocational grade</b>, or<br>(2) Obtaining property or services <b>other than educational testing material, a false educational testing score, or a false academic or vocational grade for a person</b>, by means of false or fraudulent pretenses, representations or promises.</br></p><p>A violation of this subsection is a Class G felony if the fraudulent scheme or artifice results in damage of more than one thousand dollars ($1,000), or if the property or services obtained are worth more than one thousand dollars ($1,000). Any other violation of this subsection is a Class 1 misdemeanor.</p></blockquote><p>Rumor has it that the White House is putting pressure on Hawaii to consider similar legislation regarding birth records….</p></div>",
  "content_text": "Salt sends an email informing us that North Carolina\nhas raised the bar\n:\n§ 14-454. Accessing computers.\n(a) It is unlawful to willfully, directly or indirectly, access or cause to be accessed any computer, computer program, computer system, computer network, or any part\nthereof, for the purpose of:\n(1) Devising or executing any scheme or artifice to defraud,\nunless the object of the scheme or artifice is to obtain educational testing material, a false educational testing score, or a false academic or vocational grade\n, or\n(2) Obtaining property or services\nother than educational testing material, a false educational testing score, or a false academic or vocational grade for a person\n, by means of false or fraudulent pretenses, representations or promises.\nA violation of this subsection is a Class G felony if the fraudulent scheme or artifice results in damage of more than one thousand dollars ($1,000), or if the property or services obtained are worth more than one thousand dollars ($1,000). Any other violation of this subsection is a Class 1 misdemeanor.\nRumor has it that the White House is putting pressure on Hawaii to consider similar legislation regarding birth records….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-07T16:15:00+00:00"
}