{
  "url": "https://voxday.net/2009/08/18/mailvox-of-specks-and-spears/",
  "scraped_at": "2026-01-08T23:04:23.825153",
  "title": "Mailvox: of specks and spears",
  "date_display": "August 18, 2009",
  "date_iso": "2009-08-18T18:30:00+00:00",
  "date_from_url": "2009-08-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>OtS emails us a reminder that whatever it was that threatened Amynda’s ex-stepfather in her youth – explains a lot right there, doesn’t it – we can safely assume <a href=\"http://pandagon.net/index.php/site/comments/i_always_wanted_reporters_to_ask_me_about_that_but_the_only_other_option_wa/\">it was not, in fact, her intelligence</a>.  Man fears the unknown, not the nonexistent:</p><blockquote><p>In my long of being a Texan—and one who grew up in a rural area, though I live in a blue city now—I can safely say that I’ve never met a gun nut who wasn’t reacting to deep masculine insecurities with a heavy dose of racism to make it worse.</p></blockquote><p><a href=\"http://farm4.static.flickr.com/3258/2400542847_2eebeb0eeb_m.jpg\" onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\"><noscript><img alt=\"\" border=\"0\" decoding=\"async\" src=\"http://farm4.static.flickr.com/3258/2400542847_2eebeb0eeb_m.jpg\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;width: 188px; height: 240px;\"/></noscript><img alt=\"\" border=\"0\" class=\"lazyload\" data-src=\"http://farm4.static.flickr.com/3258/2400542847_2eebeb0eeb_m.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;width: 188px; height: 240px;\"/></a>I think one really has to seriously question the legitimacy of an opinion on racism expressed by anyone who not only contemplated publishing a book with this cover, but was downright enthusiastic about it.  Especially considering that <i>even after the outcry forced a cover change</i> Ms Marcotte’s book still featured illustrations full of <a href=\"http://ahyicodae.powweb.com//Marcotte_1.jpg\">spearchucking jungle Negroes</a> literally <a href=\"http://ahyicodae.powweb.com//Marcotte_3.jpg\">getting their backsides kicked</a> by an Apple Amazon woman.  Throw in the mention of deep-seated sexual insecurities and you’ve got what looks rather like a textbook case of psychological projection… especially since she’s attempting group psychoanalysis.</p></div>",
  "content_text": "OtS emails us a reminder that whatever it was that threatened Amynda’s ex-stepfather in her youth – explains a lot right there, doesn’t it – we can safely assume\nit was not, in fact, her intelligence\n.  Man fears the unknown, not the nonexistent:\nIn my long of being a Texan—and one who grew up in a rural area, though I live in a blue city now—I can safely say that I’ve never met a gun nut who wasn’t reacting to deep masculine insecurities with a heavy dose of racism to make it worse.\nI think one really has to seriously question the legitimacy of an opinion on racism expressed by anyone who not only contemplated publishing a book with this cover, but was downright enthusiastic about it.  Especially considering that\neven after the outcry forced a cover change\nMs Marcotte’s book still featured illustrations full of\nspearchucking jungle Negroes\nliterally\ngetting their backsides kicked\nby an Apple Amazon woman.  Throw in the mention of deep-seated sexual insecurities and you’ve got what looks rather like a textbook case of psychological projection… especially since she’s attempting group psychoanalysis.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-18T17:30:00+00:00"
}