{
  "url": "https://voxday.net/2009/08/08/mailvox-one-last-post-on-dnsp/",
  "scraped_at": "2026-01-08T23:03:28.371484",
  "title": "Mailvox: one last post on DNSP",
  "date_display": "August 8, 2009",
  "date_iso": "2009-08-08T18:48:00+00:00",
  "date_from_url": "2009-08-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JB plunges once more into the breach:</p><blockquote><p>In his 2nd response to me, Vox gives two criticisms. First, Vox states “one need only find a few extant remaining DNSP ecosystems” to falsify. From his original links I understand what he means: places where the guppies are getting bigger, or are pressured to. I expect we will find many such ecosystems. That is not what I meant by DNSP.</p><p>Perhaps I was not clear when I defined it as “gentle pressure to develop a trait.” My DNSP is really Potentially Speciating DNSP, or PS-DNSP. I don’t care about the kind of DNSP that sterilely bounces species between hereditarily predefined poles. Obviously, demonstrating an ecosystem is PS-DNSP is MUCH harder than simply observing DNSP. But I suspect DNSP is common, and PS-DNSP may be too. There are other reasons besides rarity why abundant PS-DNSP may fail to speciate.</p><p>This brings us to Vox’s second criticism. I contend PS-DNSP could conceivably stop or slow to a crawl for long periods of global stasis, as often and frustratingly happened in Sim Earth. Meanwhile DNSP would still be constantly arbitrating inter and intra species wars.  This is especially possible during competitive late stage ossification, where advanced adaptable species mop up all available ecological space. Vox scoffs at this possibility; I suggest he play Sim Earth. The ecological space and environment needed to foster the next wave of transitional forms can’t be taken for granted, even when you have a planetful of pondscum bubbling for revolution.</p><p>Tangentially, VD finds it very hard to believe all species, “including the ancient ones,” have reached stasis. But ancient species are hopelessly bypassed on the tech tree. One should expect nothing from them, and everything from the latest, still freshly malleable models, e.g. humans.</p><p>Going back to Vox’s first reply, I find I would respond differently. Vox says there’s no evidence EVERY extant ecosystem has the capacity to exert DNSP. No evidence is good for my unfalsifiability. But perhaps some ecosystems have always lacked the capacity to exert DNSP, and don’t living fossils support this?  To answer: In general, I suspect HS-DNSP is ubiquitous while PS-DNSP is a special confluence of factors that can touch one species in an ecosystem and leave unaltered the one beside it. The idea of a major ecosystem without HS-DNSP is absurdly unlikely, and it follows that PS-DNSP should also be evenly distributed among them, yet could leave some fossils untouched.</p><p>FODOR TANGENT<br>As for Fodor’s attack on evolution, I evade the dilemma by failing to adhere to either adaptationism or the opposite. His point is a contentless Zeno’s paradox, which I will demonstrate by exploding the example given.</br></p><p>In the first example of the field experiment controlled test, the conclusion is wrong. TENS predicts brownness wins on brown snow. If brown loses, well, TENS doesn’t GUARANTEE the fittest will arrive, survive, or thrive, much less outbreed. It simply claims to be the only force promoting speciation. More accurately, natural selection eliminates the vast majority of potential speciation.</p><p>The non-vacuous formulation of natural selection is that the phenotype best adapted to the ecology is also the most sexually successful. But if a better design comes along and the bear girls refuse to sleep with it, no kids for Mr. Fittest. Darwin can predict phenotypic improvements well but much of the rest is up to “chance,” i.e. everything we don’t know about evolutionary ways and means. A weak force is not the same as “no predictive ability.” Dilemma solved.</p></blockquote><p>I’ll restrict myself to addressing JB’s reply to Fodor as I’m content leaving him with his retreat to Sim Earth and speciation-related natural selection to preserve his concept’s unfalsifiability.  It boils down to rarity and great quantities of time, as evolution defenses so often do.  If the non-science needs to hide in that corner, then let it hide, I say.</p><p>But I must point out that the Fodor dilemma is not so easily ducked, because JB has misunderstood the definition of fitness.  TENS not only guarantees that the most fit will outbreed the less fit, it declares the most fit MUST outbreed the less fit for what should be the obvious reason that fitness is defined as the most successful production of progeny.  However, JB has pointed to the weakest point in the logic – not science – that presently serves as the foundation of TENS.  To slightly adapt his terminology: <i>is the phenotype best adapted to the ecology also the most sexually successful?</i></p><p>Darwinians answer yes, on balance.  They have little choice, since this is the foundation of their entire theory.  But they don’t actually have much, if any science on their side to date, as the Penn State scientists performing natural selection studies have readily admitted.  It seems strange to have to point out to scientists and science fetishists that logic is not science, especially considering that many of them consider the Enlightenment triumph of science over logic to be one of the seminal points of human history.  And if any Darwinians are unwilling to accept the implications of a hypothetical failure of science to demonstrate natural selection, then the only rational conclusion is that their faith is in Darwin, not science.</p></div>",
  "content_text": "JB plunges once more into the breach:\nIn his 2nd response to me, Vox gives two criticisms. First, Vox states “one need only find a few extant remaining DNSP ecosystems” to falsify. From his original links I understand what he means: places where the guppies are getting bigger, or are pressured to. I expect we will find many such ecosystems. That is not what I meant by DNSP.\nPerhaps I was not clear when I defined it as “gentle pressure to develop a trait.” My DNSP is really Potentially Speciating DNSP, or PS-DNSP. I don’t care about the kind of DNSP that sterilely bounces species between hereditarily predefined poles. Obviously, demonstrating an ecosystem is PS-DNSP is MUCH harder than simply observing DNSP. But I suspect DNSP is common, and PS-DNSP may be too. There are other reasons besides rarity why abundant PS-DNSP may fail to speciate.\nThis brings us to Vox’s second criticism. I contend PS-DNSP could conceivably stop or slow to a crawl for long periods of global stasis, as often and frustratingly happened in Sim Earth. Meanwhile DNSP would still be constantly arbitrating inter and intra species wars.  This is especially possible during competitive late stage ossification, where advanced adaptable species mop up all available ecological space. Vox scoffs at this possibility; I suggest he play Sim Earth. The ecological space and environment needed to foster the next wave of transitional forms can’t be taken for granted, even when you have a planetful of pondscum bubbling for revolution.\nTangentially, VD finds it very hard to believe all species, “including the ancient ones,” have reached stasis. But ancient species are hopelessly bypassed on the tech tree. One should expect nothing from them, and everything from the latest, still freshly malleable models, e.g. humans.\nGoing back to Vox’s first reply, I find I would respond differently. Vox says there’s no evidence EVERY extant ecosystem has the capacity to exert DNSP. No evidence is good for my unfalsifiability. But perhaps some ecosystems have always lacked the capacity to exert DNSP, and don’t living fossils support this?  To answer: In general, I suspect HS-DNSP is ubiquitous while PS-DNSP is a special confluence of factors that can touch one species in an ecosystem and leave unaltered the one beside it. The idea of a major ecosystem without HS-DNSP is absurdly unlikely, and it follows that PS-DNSP should also be evenly distributed among them, yet could leave some fossils untouched.\nFODOR TANGENT\nAs for Fodor’s attack on evolution, I evade the dilemma by failing to adhere to either adaptationism or the opposite. His point is a contentless Zeno’s paradox, which I will demonstrate by exploding the example given.\nIn the first example of the field experiment controlled test, the conclusion is wrong. TENS predicts brownness wins on brown snow. If brown loses, well, TENS doesn’t GUARANTEE the fittest will arrive, survive, or thrive, much less outbreed. It simply claims to be the only force promoting speciation. More accurately, natural selection eliminates the vast majority of potential speciation.\nThe non-vacuous formulation of natural selection is that the phenotype best adapted to the ecology is also the most sexually successful. But if a better design comes along and the bear girls refuse to sleep with it, no kids for Mr. Fittest. Darwin can predict phenotypic improvements well but much of the rest is up to “chance,” i.e. everything we don’t know about evolutionary ways and means. A weak force is not the same as “no predictive ability.” Dilemma solved.\nI’ll restrict myself to addressing JB’s reply to Fodor as I’m content leaving him with his retreat to Sim Earth and speciation-related natural selection to preserve his concept’s unfalsifiability.  It boils down to rarity and great quantities of time, as evolution defenses so often do.  If the non-science needs to hide in that corner, then let it hide, I say.\nBut I must point out that the Fodor dilemma is not so easily ducked, because JB has misunderstood the definition of fitness.  TENS not only guarantees that the most fit will outbreed the less fit, it declares the most fit MUST outbreed the less fit for what should be the obvious reason that fitness is defined as the most successful production of progeny.  However, JB has pointed to the weakest point in the logic – not science – that presently serves as the foundation of TENS.  To slightly adapt his terminology:\nis the phenotype best adapted to the ecology also the most sexually successful?\nDarwinians answer yes, on balance.  They have little choice, since this is the foundation of their entire theory.  But they don’t actually have much, if any science on their side to date, as the Penn State scientists performing natural selection studies have readily admitted.  It seems strange to have to point out to scientists and science fetishists that logic is not science, especially considering that many of them consider the Enlightenment triumph of science over logic to be one of the seminal points of human history.  And if any Darwinians are unwilling to accept the implications of a hypothetical failure of science to demonstrate natural selection, then the only rational conclusion is that their faith is in Darwin, not science.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-08T17:48:00+00:00"
}