{
  "url": "https://voxday.net/2009/08/25/mailvox-five-questions/",
  "scraped_at": "2026-01-08T23:04:59.707970",
  "title": "Mailvox: five questions",
  "date_display": "August 25, 2009",
  "date_iso": "2009-08-25T08:05:00+00:00",
  "date_from_url": "2009-08-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Travis requests responses to what he considers to be five of the New Atheists’ most effective arguments:</p><blockquote><p>#6 (Occam’s Razor) Sam Harris says, “Any intellectually honest person will admit that he does not know why the universe exists. Scientists, of course, readily admit their ignorance on this point. There is, in fact, no worldview more reprehensible in its arrogance than that of a religious believer.”  While I think this can be turned on the atheist it certainly cannot be turned on the agnostic. Being a Christian means one has to presuppose to know things that he/she does not know. Shouldn’t one accept the least amount of beliefs that cannot be provided with sufficient evidence? Holding to unneeded presuppositions leads to bad conclusions to the things we do know or should know.</p></blockquote><p>That is a very stupid statement on Harris’s part and serves to demonstrate his ignorance of the Christian religion, among others. First, on what basis does Sam Harris claim that arrogance is reprehensible?  Second, what evidence does Sam Harris actually offer of any religious claims explaining why the universe exists?  In contradiction, I note that in both the Old and the New Testament, the Bible is very clear that Man CANNOT understand God’s reasoning or His purposes in Creation.</p><p>Job 36:26: “How great is God—beyond our understanding!” <br>Corinthians 13:12: “For now we see through a glass, darkly.”</br></p><p>On the other hand, many atheists, including Sam Harris, deny nihilism even as they claim there is no basis for any belief in purpose in life.  This is both philosophically incoherent and, to the extent that one knows it is philosophically incoherent but pretends otherwise, inherently dishonest.  I furthere note that one should always be suspicious that Sam Harris doesn’t know what he’s talking about and is simply making something up when he writes “in fact”.</p><p>Now, as for the remark about arrogance, this appears to be psychological projection as well as a good example of the deceitful atheist predilection for redefining words.  Arrogance means “offensive display of superiority or self-importance; overbearing pride.”  Synonyms: haughtiness, insolence, disdain.  Antonyms: humility, modesty, diffidence.  How, one wonders, is the Christian worldview an offensive display of superiority or self-importance?  Indeed, there is no religion that places more explicit importance on humbling oneself before God or more completely stresses that all are fallen, including the believer.  And are very few things more haughty, insolent, and disdainful, very few more ostentatious and overt displays of claimed superiority, than the New Atheist insistence that every religious, agnostic, or atheistic criticism of their reliably incorrect assertions is based on stupidit, evil, or ignorance.  This is why I am forced to distinguish between atheists and New Atheists, as any neutral observer must admit that the New Douchebags would have been an equally fitting title for the latter.</p><p>Should one accept the least amount of beliefs that cannot be provided with sufficient evidence?  Why?  Parsimony is for scientific logic, not belief.  No one, including the New Atheists believes anything this way; as one who is well-read in both economics and military history, I can easily demonstrate that each of the New Atheists and virtually every single atheist is badly guilty of harboring beliefs <i>in direct contrast to all of the available evidence</i>.  To single out Christians and Creationists while letting millions of Labourites and Democrats off the hook for refusing to accept the Law of Supply and Demand, the logical impossibility of central planning, or the failure of public education is a reprehensible double-standard.  #6 isn’t just a spurious and baseless argument, it is one that is damning to the New Atheist, not the religious believer.</p><blockquote><p>#7 Non-reductive physicalism) There is no empirical evidence and/or reason to accept the concept of a non-material soul. Christopher Hitchens brought this up in a recent debate with a Jewish Rabbi at New York City. Non-reductive physicalism makes the most sense when analyzing human behavior. Why do we see our grandparents lose all sense of awareness? Or a particular disease makes someone change their entire demeanor. What about Phineas Gage? It appears to be obvious that all our behavior stems from physical components and that there is nothing outside of the material world in creating cognitive thoughts as well as our temperament.</p></blockquote><p>All the New Atheists have to do now is solve the problem of life and consciousness and then they’ll actually have an argument to present.  This is medievalesque logic, not science.  You cannot talk about empirical evidence out of one side of your mouth and then make appeals to appearances out of the other.  Moreover, there absolutely is empirical evidence that something goes missing when a being transitions from life into death, which is why the early physicians tried weighing bodies after death to try determining the weight of  a soul.  Now, you can certainly elect to call it electrical impulses or bio-software if you prefer, but there is certainly empirical evidence of what can quite reasonably be called a soul, which is neither personality nor behavior.</p><blockquote><p>#8 (New Testament contradictions). My below quote is taken from “Jesus Interrupted”. While Ehrman is an agnostic the new atheists certainly can utilize his findings. On the side you mentioned that the new atheists “have come and gone”. Ehrman’s book, “Jesus Interrupted” is #116 in Amazon book sales. Judging by Amazon rankings anti-apologetic books are certainly selling at a large quantity.  “It would be impossible…to argue that the Bible is a unified whole, inerrant in all its parts, inspired by God in every way. It can’t be that. There are too many divergences, discrepancies, contradictions; too many alternative ways of looking at the same issue, alternatives that often are at odds with one another. The Bible is not a unity, it is a massive plurality. God did not write the Bible, people did.” (p. 279).”</p><p>While this is an assertion and not an argument in itself I can provide one small concrete example. Jesus is said to be born while Herod the Great was alive (Mat 2:1-2), and while Quirinius was governor of Syria (Luk 2:1-7). Unfortunately Qurinius became governor ten years after Herod died.</p></blockquote><p>Ehrman was around long before the New Atheists and he isn’t even an atheist, so I don’t see what that has to do anything.  The main problem with Ehrman is that he purposefully ignores the giant elephant in the room, which is that there are more and earlier copies of the various books of the New Testament than there are of any historical document from the ancient world.  The Bible is extremely reliable by every secular standard for historical documents; it is arguably the most reliable ancient text in human history by those standards.  If you’re going to reject the historical veracity of the Bible – which has repeatedly proven to be more accurate than the contrary assertions of archeologists and historians – then you must likewise reject the entire written history of Man.</p><p>This argument represents a failure to understand the significance of the Bible being written by men inspired by God.  The occasional contradiction may well trouble the hardcore Biblical literalist, but since I am multilingual and have read at least parts of the Bible in three languages, I know that there are a number of trivial differences from text to text.  Ergo, they are not all flawless; they cannot be.  Since the filter is imperfect, the message we receive is necessarily imperfect… which is exactly what we are told in the Bible!</p><p>As for Quirinus, it could be an inconsistency or it could simply be that our historical knowledge is incomplete.  The fact that historical scholars, who know that there was a previous citizen census three years before, find it difficult<br> to believe that the Romans would have taken a non-citizen census in Judea while Herod was alive does not mean that the Romans did not.  Given the long list of historians who were certain they had proved the Bible to be incorrect, only to eventually discover that they were wrong, I would avoid placing too much import on apparent inconsistencies regarding the dates surrounding an undated event.  Are you willing to accept the historical truth of the Bible should documentation eventually be discovered which demonstrates there is no Biblical inconsistency surrounding Quirinus?  If not, you cannot reasonably reject it on that sole basis either.</br></p><p>I’ve read far too many minor inconsistencies in otherwise reliable historical works to be bothered about the possibility of something like this; it would be much more problematic if Luke had identified someone who did not exist at all as the governor… or the king.  But this is one reason why I regard total infallibility doctrines, be it of the Bible or the Pope, to be pernicious.  My belief is that because we cannot be certain of what is perfectly expressive of God’s Will and what is clouded by Man’s inability to perfectly transmit that Will, the wise Christian will not overly fuss about the details but instead focus on following what are for the most part perfectly clear instructions on how to live.</p><blockquote><p>#9 (History of Man) Christopher Hitchens has used the history of early man often to show that the Christian viewpoint doesn’t make much sense. I’m sure you heard it already…humans have been around for 100,000 years. Throughout 90,000 of the years humans have experienced droughts, disease, famine, and all the nastiness that Mother Nature can provide. However what wasn’t provided for them was any inkling of who God is and what Jesus did for their sins. It is only 2,000 years ago when God reveals the concept of what “good news” is. Why would God wait so long in order to present such good news? I’m assuming you heard this point by Hitchens, therefore I won’t say much more about this argument.</p></blockquote><p>The Book of Job presaged and answered this argument long before Hitchens was born.  I would merely add that arguing about God’s motivations or character is not a rational means of disputing His existence.  My personal belief is that God is far less concerned with every individual human being than most people, atheists and Christians alike, would like to believe.</p><blockquote><p>#10 (Everlasting Hell) Pertaining to the concept of hell Sam Harris states, “People actually believe is that, one, they’re rewarded after death in certain circumstances; there’s a difference between an eternity of happiness and an eternity of suffering, and it really matters what name you call God, and what you believe, and the precise kind of [religious] practices you engage.”  Considering very few people have heard and accepted the gospel why wouldn’t God do more in helping change the hearts of man? If God is all loving and all powerful how can he take delight in knowing the majority of his creation will be gnashing at their teeth for all of eternity?  From a pragmatic sense eternal hell makes no sense. From a loving sense eternal hell makes no sense. From a justice sense eternal hell makes no sense. Considering this topic is so important why wait so long to educated people about it? The concept isn’t clearly drawn up until the N.T. is written.</p></blockquote><p>First, God isn’t “all-loving”.  He doesn’t love everyone equally and this is pointed out numerous times in the Bible.  These sorts of arguments put the lie to claim of the atheist making them to have read the Bible.  He has His favorites.  He hates “the wicked and those who love violence”.  He “opposes the proud”.  (Yes, yes, I know… please keep in mind that my public thoughts are not the totality of my self.)  Second, where is the indication that God takes any delight in the irreparable imperfection of the greater part of Mankind?  He will destroy those who fail His test, the chaff will burn, but my interpretation is that this is little more than throwing out the useless garbage.</p><p>I don’t think any game designer or serious gamer has any problem with conceiving of a God who designs a Creation for a purpose beyond the capacity of the creatures who inhabit it to understand.  I’m certain that the ice troll who gets killed by adventurers in the caves of Dun Morogh only to respawn and get killed again, over and over, must have some very serious questions about the character and existence of Rob Pardo.</p></div>",
  "content_text": "Travis requests responses to what he considers to be five of the New Atheists’ most effective arguments:\n#6 (Occam’s Razor) Sam Harris says, “Any intellectually honest person will admit that he does not know why the universe exists. Scientists, of course, readily admit their ignorance on this point. There is, in fact, no worldview more reprehensible in its arrogance than that of a religious believer.”  While I think this can be turned on the atheist it certainly cannot be turned on the agnostic. Being a Christian means one has to presuppose to know things that he/she does not know. Shouldn’t one accept the least amount of beliefs that cannot be provided with sufficient evidence? Holding to unneeded presuppositions leads to bad conclusions to the things we do know or should know.\nThat is a very stupid statement on Harris’s part and serves to demonstrate his ignorance of the Christian religion, among others. First, on what basis does Sam Harris claim that arrogance is reprehensible?  Second, what evidence does Sam Harris actually offer of any religious claims explaining why the universe exists?  In contradiction, I note that in both the Old and the New Testament, the Bible is very clear that Man CANNOT understand God’s reasoning or His purposes in Creation.\nJob 36:26: “How great is God—beyond our understanding!”\nCorinthians 13:12: “For now we see through a glass, darkly.”\nOn the other hand, many atheists, including Sam Harris, deny nihilism even as they claim there is no basis for any belief in purpose in life.  This is both philosophically incoherent and, to the extent that one knows it is philosophically incoherent but pretends otherwise, inherently dishonest.  I furthere note that one should always be suspicious that Sam Harris doesn’t know what he’s talking about and is simply making something up when he writes “in fact”.\nNow, as for the remark about arrogance, this appears to be psychological projection as well as a good example of the deceitful atheist predilection for redefining words.  Arrogance means “offensive display of superiority or self-importance; overbearing pride.”  Synonyms: haughtiness, insolence, disdain.  Antonyms: humility, modesty, diffidence.  How, one wonders, is the Christian worldview an offensive display of superiority or self-importance?  Indeed, there is no religion that places more explicit importance on humbling oneself before God or more completely stresses that all are fallen, including the believer.  And are very few things more haughty, insolent, and disdainful, very few more ostentatious and overt displays of claimed superiority, than the New Atheist insistence that every religious, agnostic, or atheistic criticism of their reliably incorrect assertions is based on stupidit, evil, or ignorance.  This is why I am forced to distinguish between atheists and New Atheists, as any neutral observer must admit that the New Douchebags would have been an equally fitting title for the latter.\nShould one accept the least amount of beliefs that cannot be provided with sufficient evidence?  Why?  Parsimony is for scientific logic, not belief.  No one, including the New Atheists believes anything this way; as one who is well-read in both economics and military history, I can easily demonstrate that each of the New Atheists and virtually every single atheist is badly guilty of harboring beliefs\nin direct contrast to all of the available evidence\n.  To single out Christians and Creationists while letting millions of Labourites and Democrats off the hook for refusing to accept the Law of Supply and Demand, the logical impossibility of central planning, or the failure of public education is a reprehensible double-standard.  #6 isn’t just a spurious and baseless argument, it is one that is damning to the New Atheist, not the religious believer.\n#7 Non-reductive physicalism) There is no empirical evidence and/or reason to accept the concept of a non-material soul. Christopher Hitchens brought this up in a recent debate with a Jewish Rabbi at New York City. Non-reductive physicalism makes the most sense when analyzing human behavior. Why do we see our grandparents lose all sense of awareness? Or a particular disease makes someone change their entire demeanor. What about Phineas Gage? It appears to be obvious that all our behavior stems from physical components and that there is nothing outside of the material world in creating cognitive thoughts as well as our temperament.\nAll the New Atheists have to do now is solve the problem of life and consciousness and then they’ll actually have an argument to present.  This is medievalesque logic, not science.  You cannot talk about empirical evidence out of one side of your mouth and then make appeals to appearances out of the other.  Moreover, there absolutely is empirical evidence that something goes missing when a being transitions from life into death, which is why the early physicians tried weighing bodies after death to try determining the weight of  a soul.  Now, you can certainly elect to call it electrical impulses or bio-software if you prefer, but there is certainly empirical evidence of what can quite reasonably be called a soul, which is neither personality nor behavior.\n#8 (New Testament contradictions). My below quote is taken from “Jesus Interrupted”. While Ehrman is an agnostic the new atheists certainly can utilize his findings. On the side you mentioned that the new atheists “have come and gone”. Ehrman’s book, “Jesus Interrupted” is #116 in Amazon book sales. Judging by Amazon rankings anti-apologetic books are certainly selling at a large quantity.  “It would be impossible…to argue that the Bible is a unified whole, inerrant in all its parts, inspired by God in every way. It can’t be that. There are too many divergences, discrepancies, contradictions; too many alternative ways of looking at the same issue, alternatives that often are at odds with one another. The Bible is not a unity, it is a massive plurality. God did not write the Bible, people did.” (p. 279).”\nWhile this is an assertion and not an argument in itself I can provide one small concrete example. Jesus is said to be born while Herod the Great was alive (Mat 2:1-2), and while Quirinius was governor of Syria (Luk 2:1-7). Unfortunately Qurinius became governor ten years after Herod died.\nEhrman was around long before the New Atheists and he isn’t even an atheist, so I don’t see what that has to do anything.  The main problem with Ehrman is that he purposefully ignores the giant elephant in the room, which is that there are more and earlier copies of the various books of the New Testament than there are of any historical document from the ancient world.  The Bible is extremely reliable by every secular standard for historical documents; it is arguably the most reliable ancient text in human history by those standards.  If you’re going to reject the historical veracity of the Bible – which has repeatedly proven to be more accurate than the contrary assertions of archeologists and historians – then you must likewise reject the entire written history of Man.\nThis argument represents a failure to understand the significance of the Bible being written by men inspired by God.  The occasional contradiction may well trouble the hardcore Biblical literalist, but since I am multilingual and have read at least parts of the Bible in three languages, I know that there are a number of trivial differences from text to text.  Ergo, they are not all flawless; they cannot be.  Since the filter is imperfect, the message we receive is necessarily imperfect… which is exactly what we are told in the Bible!\nAs for Quirinus, it could be an inconsistency or it could simply be that our historical knowledge is incomplete.  The fact that historical scholars, who know that there was a previous citizen census three years before, find it difficult\nto believe that the Romans would have taken a non-citizen census in Judea while Herod was alive does not mean that the Romans did not.  Given the long list of historians who were certain they had proved the Bible to be incorrect, only to eventually discover that they were wrong, I would avoid placing too much import on apparent inconsistencies regarding the dates surrounding an undated event.  Are you willing to accept the historical truth of the Bible should documentation eventually be discovered which demonstrates there is no Biblical inconsistency surrounding Quirinus?  If not, you cannot reasonably reject it on that sole basis either.\nI’ve read far too many minor inconsistencies in otherwise reliable historical works to be bothered about the possibility of something like this; it would be much more problematic if Luke had identified someone who did not exist at all as the governor… or the king.  But this is one reason why I regard total infallibility doctrines, be it of the Bible or the Pope, to be pernicious.  My belief is that because we cannot be certain of what is perfectly expressive of God’s Will and what is clouded by Man’s inability to perfectly transmit that Will, the wise Christian will not overly fuss about the details but instead focus on following what are for the most part perfectly clear instructions on how to live.\n#9 (History of Man) Christopher Hitchens has used the history of early man often to show that the Christian viewpoint doesn’t make much sense. I’m sure you heard it already…humans have been around for 100,000 years. Throughout 90,000 of the years humans have experienced droughts, disease, famine, and all the nastiness that Mother Nature can provide. However what wasn’t provided for them was any inkling of who God is and what Jesus did for their sins. It is only 2,000 years ago when God reveals the concept of what “good news” is. Why would God wait so long in order to present such good news? I’m assuming you heard this point by Hitchens, therefore I won’t say much more about this argument.\nThe Book of Job presaged and answered this argument long before Hitchens was born.  I would merely add that arguing about God’s motivations or character is not a rational means of disputing His existence.  My personal belief is that God is far less concerned with every individual human being than most people, atheists and Christians alike, would like to believe.\n#10 (Everlasting Hell) Pertaining to the concept of hell Sam Harris states, “People actually believe is that, one, they’re rewarded after death in certain circumstances; there’s a difference between an eternity of happiness and an eternity of suffering, and it really matters what name you call God, and what you believe, and the precise kind of [religious] practices you engage.”  Considering very few people have heard and accepted the gospel why wouldn’t God do more in helping change the hearts of man? If God is all loving and all powerful how can he take delight in knowing the majority of his creation will be gnashing at their teeth for all of eternity?  From a pragmatic sense eternal hell makes no sense. From a loving sense eternal hell makes no sense. From a justice sense eternal hell makes no sense. Considering this topic is so important why wait so long to educated people about it? The concept isn’t clearly drawn up until the N.T. is written.\nFirst, God isn’t “all-loving”.  He doesn’t love everyone equally and this is pointed out numerous times in the Bible.  These sorts of arguments put the lie to claim of the atheist making them to have read the Bible.  He has His favorites.  He hates “the wicked and those who love violence”.  He “opposes the proud”.  (Yes, yes, I know… please keep in mind that my public thoughts are not the totality of my self.)  Second, where is the indication that God takes any delight in the irreparable imperfection of the greater part of Mankind?  He will destroy those who fail His test, the chaff will burn, but my interpretation is that this is little more than throwing out the useless garbage.\nI don’t think any game designer or serious gamer has any problem with conceiving of a God who designs a Creation for a purpose beyond the capacity of the creatures who inhabit it to understand.  I’m certain that the ice troll who gets killed by adventurers in the caves of Dun Morogh only to respawn and get killed again, over and over, must have some very serious questions about the character and existence of Rob Pardo.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-25T07:05:00+00:00"
}