{
  "url": "https://voxday.net/2009/08/21/mailvox-learning-austrian-economics/",
  "scraped_at": "2026-01-08T23:04:38.530608",
  "title": "Mailvox: learning Austrian economics",
  "date_display": "August 21, 2009",
  "date_iso": "2009-08-21T07:54:00+00:00",
  "date_from_url": "2009-08-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SS writes of his newfound interest in it:</p><blockquote><p>I started reading your blog about 6 months ago and found your comments on religion, evolution, feminism, literature, and economics to be interesting and thought-provoking. While I disagree with your views on religion- I am an atheist, although I fully agree with your argument that the so-called “New Atheists” are actually just as unreasonable and ideologically driven as those they seek to criticise- I believe that your arguments are worthwhile and useful as a “reality check” for we non-believers.</p><p>My reason for writing today is related to your views on economics. I have been sceptical of Keynesian economics ever since I went to university (at the LSE, no less- one of the chief incubators of both Keynesian and Austrian thinking), and my move to America for graduate school, along with recent events, have only contributed to my growing distrust and dislike of an over-mighty and overly large public sector. After doing some reading, it appears to me that only Austrian economics seems capable of predicting, understanding, and- crucially- solving financial crises, panics, manias, and bubbles. As such, I would like to explore a more rigourous and thorough analysis of Austrian economic theory. Therefore, would you be able to recommend a list of 5-10 books that you believe all prospective Austrian economists should read? The universe of Austrian economic literature is vast; a starting point would be useful.</p></blockquote><p>I have given this matter some thought in the past, which is some of the books I recommend can already be found on the right sidebar.  Begin with <a href=\"http://mises.org/books/introtoaustrian.pdf\">An Introduction to Austrian Economic</a>s by Thomas Taylor.  It’s short, simple, and covers the basics.  I would next read <a href=\"http://mises.org/rothbard/agd.pdf\">America’s Great Depression</a> by Murray Rothbard, because Rothbard not only provides another brief explanation of many of the important concepts, but goes on to show how those concepts apply in a practical manner to a historical situation.  I would then turn to <a href=\"http://www.mises.org/books/failureofneweconomics.pdf\">The Failure of the New Economics</a> by Henry Hazlitt, as this will then allow a comparison of the Neo-Keynesian doctrine one has been taught at university with actual Keynesian theory and a detailed critique of that theory.  For fun, you may then wish to turn to <a href=\"http://www.slate.com/id/9593\">Paul Krugman’s “critique” of Austrian theory</a> and <a href=\"http://www.milobookclub.com/2009/02/18/irrational-economis/\">my response to it</a>.  Only at that point would I consider attempting Mises’s <a href=\"http://mises.org/humanaction/pdf/HumanActionScholars.pdf\">Human Action</a>.  If you wish to get hard core and go back to the origins, the <i>The Positive Theory of Capital</i> by Eugen von Böhm-Bawerk and <a href=\"http://mises.org/Books/Mengerprinciples.pdf\">The Principles of Economics</a> by Carl Menger are more accessible than you would assume, particularly Menger.  And finally, since you’re an atheist, Michael Shermer’s <i>The Mind of the Market</i> would probably make for an interesting opportunity to apply what you learn from the previous books as it’s based on Shermer’s attempt to connect Austrian economics and evolutionary theory.  I’m reading it right now, and while it’s on the relatively lightweight side, full of the sort of anecdotal tangents now considered <i>de rigueur</i> for pop social science, it’s both entertaining and thought-provoking.</p><p>While it’s a bit premature to go into the details, I don’t believe it will surprise too many regulars to learn that, in October, there will be one more book of possible interest for those wishing to learn more about Austrian School theory and its application to the global economy.</p></div>",
  "content_text": "SS writes of his newfound interest in it:\nI started reading your blog about 6 months ago and found your comments on religion, evolution, feminism, literature, and economics to be interesting and thought-provoking. While I disagree with your views on religion- I am an atheist, although I fully agree with your argument that the so-called “New Atheists” are actually just as unreasonable and ideologically driven as those they seek to criticise- I believe that your arguments are worthwhile and useful as a “reality check” for we non-believers.\nMy reason for writing today is related to your views on economics. I have been sceptical of Keynesian economics ever since I went to university (at the LSE, no less- one of the chief incubators of both Keynesian and Austrian thinking), and my move to America for graduate school, along with recent events, have only contributed to my growing distrust and dislike of an over-mighty and overly large public sector. After doing some reading, it appears to me that only Austrian economics seems capable of predicting, understanding, and- crucially- solving financial crises, panics, manias, and bubbles. As such, I would like to explore a more rigourous and thorough analysis of Austrian economic theory. Therefore, would you be able to recommend a list of 5-10 books that you believe all prospective Austrian economists should read? The universe of Austrian economic literature is vast; a starting point would be useful.\nI have given this matter some thought in the past, which is some of the books I recommend can already be found on the right sidebar.  Begin with\nAn Introduction to Austrian Economic\ns by Thomas Taylor.  It’s short, simple, and covers the basics.  I would next read\nAmerica’s Great Depression\nby Murray Rothbard, because Rothbard not only provides another brief explanation of many of the important concepts, but goes on to show how those concepts apply in a practical manner to a historical situation.  I would then turn to\nThe Failure of the New Economics\nby Henry Hazlitt, as this will then allow a comparison of the Neo-Keynesian doctrine one has been taught at university with actual Keynesian theory and a detailed critique of that theory.  For fun, you may then wish to turn to\nPaul Krugman’s “critique” of Austrian theory\nand\nmy response to it\n.  Only at that point would I consider attempting Mises’s\nHuman Action\n.  If you wish to get hard core and go back to the origins, the\nThe Positive Theory of Capital\nby Eugen von Böhm-Bawerk and\nThe Principles of Economics\nby Carl Menger are more accessible than you would assume, particularly Menger.  And finally, since you’re an atheist, Michael Shermer’s\nThe Mind of the Market\nwould probably make for an interesting opportunity to apply what you learn from the previous books as it’s based on Shermer’s attempt to connect Austrian economics and evolutionary theory.  I’m reading it right now, and while it’s on the relatively lightweight side, full of the sort of anecdotal tangents now considered\nde rigueur\nfor pop social science, it’s both entertaining and thought-provoking.\nWhile it’s a bit premature to go into the details, I don’t believe it will surprise too many regulars to learn that, in October, there will be one more book of possible interest for those wishing to learn more about Austrian School theory and its application to the global economy.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-21T06:54:00+00:00"
}