{
  "url": "https://voxday.net/2009/08/13/p1-defense-of-yec/",
  "scraped_at": "2026-01-08T23:03:50.568942",
  "title": "P1: A defense of YEC",
  "date_display": "August 13, 2009",
  "date_iso": "2009-08-13T14:15:00+00:00",
  "date_from_url": "2009-08-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This defense of Young Earth Creationism was written by Bethyada, with suggestions from Paladin and AM.  Note that PUOSU positions should not be mistaken with my own beliefs and I neither suggest nor contribute to them.  Critiques should be substantive; any insubstantial perjoratives will be either ignored or deleted.</p><blockquote><p>Young Earth Creationism (YEC) is multifaceted. It is a metaphysical framework; a scripturally informed philosophy of nature which includes a scientific model that seeks to evaluate and explain the world. Thus it touches a variety of topics. There are limits in what can be accomplished with a short blog post, but I think that some clarity can be brought to the debate, specifically identifying the source of the conflict and the domain in which the debate needs to occur.</p><p>Antagonism to YEC is predominantly philosophical, rooted in naturalism. Opposition to the YEC position is frequently made using suppositions antagonistic to YEC; the proof of error is therefore in the axioms not the conclusions.</p><p>YEC has a long history. It has been the predominant position throughout most of the history of the West, until the introduction of uniformitarian interpretations in the 18th and 19th century by the non-catastrophic geologists. These geologists influenced Darwin and although Darwin didn’t publish his theory till the 19th century, evolutionary-like philosophies have a much older history, somewhat similar ideas proposed by some Greek philosophers. And YECists have good company with the likes of scientists such as Kepler, Newton, Pasteur, and Maxwell. But the issue is not a tradition game or a numbers game, it is: Does YEC accurately describe reality?</p><p>The underlying reasons for specific YECist concepts are: the rules of logic as applied to the Bible and science, and the grammatical historical hermeneutic applied to the Bible. YECists take most of Genesis to be historical narrative including the creation, fall, and flood. They think that most occurrences of the word “day” in Genesis 1 mean a usual day because of contextual considerations.</p><p>YEC touches several fields including theology: hermeneutics, theodicy; philosophy: philosophy of science, logic; science: biology, genetics, palaeontology, astronomy, geology, climate, thermodynamics; information theory; archaeology; history. (Hermeneutics and logic would be better classified as fields that form YEC belief rather than result from it, as mentioned above).</p><p>I wish to cover the following about YEC</p><p> * What young earth creationists (YECists) do and do not believe;<br> * The nature of evidence and science; and<br> * A discussion focusing on a single aspect of YEC: the age of the earth.</br></br></p><p>YEC can be summarised as follows:</p><p> * The universe is not eternal, it was created by God who is external to the world, self existent, and eternal<br> * God created the world in 6 usual days<br> * Nature was corrupted by the Fall of Man<br> * The earth is about 6000 years old<br> * The earth was deluged by a global flood about 4500 years ago<br> * The Bible is inerrant and should be interpreted in a straightforward manner (according to genre)</br></br></br></br></br></p><p>There are several corollaries from this, though the specifics may vary. The creation model includes:</p><p> * Most of the sedimentary layers of rock and enclosed fossils that occur worldwide were formed during the Noachic Flood.<br> * The earth likely contained a single continent that broke up during or after the Flood<br> * There was a single ice-age caused by the post-Flood climate<br> * All land and air animals (of significant size) are descendants of the animals that were on the Ark<br> * Man has coexisted with all animals that have ever existed<br> * Natural selection (an analogue of artificial selection) occurs<br> * Speciation is rapid. It occurs through allelic separation, genetically induced variation, or detrimental mutation (loss of genetic information).<br> * There are genetic limits to the amount of speciation, diversification, adaption, or breeding that can occur<br> * Information content of the biosphere cannot increase. Matter cannot create information.<br> * Information is always the result of an intelligence<br> * Loss of information can mean improved fitness within a specific environment; that is, loss of function can result in improved likelihood of survival.<br> * Lost information cannot be recovered without reintroduction of the same information (save trivial examples) by breeding or design<br> * Archaeological artefacts post-date the Flood, which limits their age to a maximum of 4500 years</br></br></br></br></br></br></br></br></br></br></br></br></p><p>There are several accusations that are charged against YEC which proponents of YEC do not support or promote; such as</p><p> *God (or Satan) created the fossils in situ as a test of our faith<br> * God created things with false appearance of age (this needs qualification)<br> * Animals were created how they look now and no new species of animals have developed<br> * Entropy was a result of and did not exist before the Fall of Man<br> * The earth is flat</br></br></br></br></p><p>On evidence and science</p><p>While much could be written in defence of the specific YEC beliefs, discussion can be difficult if foundational issues are not identified.  Modern science was originally a systematised process of categorising our observations to make further inferences and reduce our observations to consistent laws. While hypothesis testing is a usual method, data gathering to create a hypothesis was seen as legitimate. Thus, multiple measurements of the planets led to Kepler proposing elliptical orbits, which could then be further tested. Francis Bacon is frequently credited with formulating the scientific method.</p><p>Written as: observation → induction → hypothesis → test hypothesis by experiment → proof/disproof → knowledge</p><p>Popper’s falsifiability criterion has had a clarifying influence on the understanding of scientific theories. Therefore negative evidence was seen as disproving a theory whilst positive evidence is merely consistent with a theory, not proof of such.</p><p>Notice that Bacon’s definition is necessarily limited to observable phenomena. This is classic operational science (also called empirical science), which helps us infer laws about things that are demonstrable and repeatable. This is an enormously important distinction that frequently goes unrecognised. In contrast, inferences about previous events are not repeatable. This does not mean that the scientific method cannot be employed, rather that it is limited in what it can say.</p><p>Consider the science of identifying a criminal via a DNA sample. This science is not being done to discover how DNA binds to itself (i.e. hydrogen bonding), it is attempting to establish an event such as a murder.  So a fragment of the DNA is identified and then matched to a specific person. The samples can be run several times and in several different ways; both the forensic sample and the suspects’ samples. And we can establish that the forensic sample and a suspect sample match. This part of the process is operational science.</p><p>However establishing a particular suspect as the murderer is not observable. We cannot do an experiment several times to show that he did indeed murder the victim. Intrinsically it is impossible; the event happened in the past. And even if we establish he is capable of murder, it doesn’t prove he committed this particular murder. This kind of science is called historical science.</p><p>It has been claimed that scientists do not discriminate this way when practising science. This may be the case. When one does historical science there is usually an element of operational science as seen in this example (though the converse is not necessarily true). But whether actual scientists discriminate like this is irrelevant to the philosophy of science, what matters<br> is whether this distinction exists. And it clearly exists because a methodology that relies on repeatability cannot be applied to singular past events.</br></p><p>The reason for this discussion is to show that historical science competes with other evidences in a way that operational science does not. If I claim my house is so high, I can invite you to measure it. Testimonial evidence doesn’t play a part. We don’t ask a range of people their opinion as to what they think my house height is. Three measurements by several engineers using differing methods that all agree trump the opinion of a dozen opinions and guesses. This is not the case with historical science.</p><p>Returning to our murder investigation with DNA sampling, all we have established is that a suspect shares a DNA fingerprint with a crime scene sample. This may be because it is a limited test, say a portion of DNA with a limited number of polymorphisms. Even if we can be certain the DNA matches by performing adequate sequencing, there may be a identical twin brother we do not know about. Or the DNA may have come from the suspect, but at another time; a meeting earlier in the day. Now I am not trying to imply that DNA testing is inaccurate or inappropriate for criminal investigation, I am illustrating how its use in proving crime is intrinsically different from operational science.</p><p>Testimony of others meant little in the height of my house, but it means a great deal in identifying a murderer. Not because murder is more important that house height, but because it is not testable in the way that heights and widths of objects are. A claim that the suspect has a twin brother is a competing claim against the DNA test. A claim that the suspect was seen elsewhere at the time of the murder is a competing claim. A claim that the blood type does not match despite the DNA matching is a competing claim.</p><p>Note that competing claims against historical science can be both scientific and non-scientific (eg. testimonial).</p><p>Also note that scientific claims do not automatically trump non-scientific claims. The testimony of a thousand witnesses is not overturned by a DNA match just because the latter is scientific. We weigh several competing claims and people will be variously convinced depending on how reliable they regard each piece of evidence.</p><p>YEC is a competing claim about the history of the world. It is predominantly a competing claim to the historical sciences of biological macro-evolution, abiogenesis, stellar evolution, and uniformitarian geology.</p><p>Some of the YEC disagreement with evolutionary theory is due to consideration of non-scientific fields such as documentary evidence. However much of the disagreement is from a competing but different historical science. For example, consider the age of the earth.</p><p>How old is the earth?</p><p>YECists claim that the earth is about 6000 years old (though anything below 10000 years would fall into the same range). This is phenomenally different to the uniformitarian geological claim of 4.5 billion years. But note that any usual clock cannot calculate the time since the formation of the earth. We cannot go back, set our stop-watch, and mark off the aeons until now. We are considering a past event (or several past events). Compare this to measuring the time it takes a horse to run 1 km. We can do this measuring the starting and finishing time, and we can do this repeatedly, thus giving us the time (on average) the horse takes. For this we observe established clocks.</p><p>For past events we need to establish a historical clock, say radiometric-dating. Experiments can determine the amount of various isotopes of uranium and lead in a particular sample. One can do this part of the experiment over and over. We can satisfy ourselves to the limits of experimental accuracy that the sample contains a certain amount of uranium. This part of the investigation is operational science. All parties generally agree on the number of atoms identified in the sample and their ratio.</p><p>This ratio is then keyed into a formula based on a specific theory with a variety of assumptions to get a date for the formation of the mineral it was derived from. Now the theory is radioactive decay, which is reasonably well established, and an assumption is, say, no daughter isotope was present when the mineral formed.</p><p>The problem is that these calculations do not always give the answers that are thought to be correct (as established by other historical clocks or underlying evolutionary theory); so sub-theories are added, such as leaching of isotopes, addition of isotopes, incomplete melting at time of formation of mineral in rock. Creationists have also suggested a modification to the theory: the variation of decay half-life, though this modification is often disparaged.</p><p>Rather than discuss the merits of these sub-theories or, if you prefer, alteration of assumptions (all of which are reasonable); I would simply like to note that since radiometric dating is a historical science, there are competing claims.</p><p>There is the competing documentary claim, that the world was created 6000 years ago according to the Bible. This is a claim that YECists take seriously, much like the testimony of someone who witnessed an event. But documentary evidence is not restricted to the Bible. A variety of cultures have given an age of the earth much less than 4.5 billion years and more in keeping with the biblical figure, such as the Mayans and the Greeks. This particular competing claim is less convincing to agnostics and some theists, including some Christians. There are, however, other documentary claims and historical scientific claims that are worth mentioning.</p><p>Staying with radiometric dating, we have reliable documentary evidence for the age of some volcanic episodes. It so happens that rocks from lava flows within recent history that we know the real age of (via operational science) are consistently dated much older by radiometric dating, frequently hundreds of thousands of years or older. Explanations are offered up as to why this is the case, but the greater point is the model is reliably incorrect; it doesn’t matter how good this theory is or should be, the fact is the model doesn’t work.</p><p>If radiometric dating cannot get dates correct when we do know the true age, why should we trust it when we don’t know the true age?</p><p>We also have competing scientific claims. Radiometric dating is not the only historical clock. There are a large number of clocks. And even radiometric clocks vary depending on the isotope used.  Historical clocks often give maximum ages. This does not mean that the calculated age is the actual age, rather given the most favourable assumptions this is the longest a particular process has been going on. In constructing a clock based on sodium in the ocean, a maximum age would be established by assuming no sodium in the ocean when it formed, the lowest reasonable estimate for sodium influx, the highest reasonable estimate for sodium outflux, with the current concentration identified by measurements of salinity. The maximum age identified may not equal the true age, as the ocean may have started somewhat salty for example.</p><p>Within radiometric dating we have carbon dating competing with metal dating. Pretty much all carbon containing materials that have been tested contain carbon-14. This places an upper bound on their age. This includes diamonds embedded in rock supposedly millions of years old.</p><p>Other historical clocks include: diffusion rates of helium; decay of the magnetic field; decay of DNA and protein from dead organisms; elements in the ocean; recession of the moon, starlight travel from distant stars.</p><p>Objections can be raised against these other clocks (though the carbon-14 data is hard to surmount), but this is hardly the point. The point is that there are competing claims here. Radiometric dating of metals is favoured by the evolutionists because it gives a time frame needed for<br> evolution. But it is one piece of historical scientific evidence. One person may find it convincing, but with so much riding against it, it is not unreasonable to weigh the other evidences heavier.</br></p><p>Summary</p><p>YEC is a worldview. It recognises a variety of evidences. It clearly understands the difference between operational and historical science. YECists do not dispute any significant operational scientific finding. Investigating past events is philosophically distinct from investigating repeatable events and YEC views past events differently, and in a way that I think makes more sense of the data.</p><p>YEC theory on the age of the earth is more parsimonious. It is consistent with much of the documentary evidence. It is also consistent with many of the historical scientific clocks. Modifications to the starting conditions and rates give ages consistent with a young earth, including radio-carbon. Radio-dates of metals less so, but these are known to be inaccurate, and YEC proposals concerning rates of decay may resolve other well recognised difficulties of radiometric dating. Ancient earth theory is unable to easily reconcile non-radiometric clocks or even radio-carbon clocks.</p></blockquote></div>",
  "content_text": "This defense of Young Earth Creationism was written by Bethyada, with suggestions from Paladin and AM.  Note that PUOSU positions should not be mistaken with my own beliefs and I neither suggest nor contribute to them.  Critiques should be substantive; any insubstantial perjoratives will be either ignored or deleted.\nYoung Earth Creationism (YEC) is multifaceted. It is a metaphysical framework; a scripturally informed philosophy of nature which includes a scientific model that seeks to evaluate and explain the world. Thus it touches a variety of topics. There are limits in what can be accomplished with a short blog post, but I think that some clarity can be brought to the debate, specifically identifying the source of the conflict and the domain in which the debate needs to occur.\nAntagonism to YEC is predominantly philosophical, rooted in naturalism. Opposition to the YEC position is frequently made using suppositions antagonistic to YEC; the proof of error is therefore in the axioms not the conclusions.\nYEC has a long history. It has been the predominant position throughout most of the history of the West, until the introduction of uniformitarian interpretations in the 18th and 19th century by the non-catastrophic geologists. These geologists influenced Darwin and although Darwin didn’t publish his theory till the 19th century, evolutionary-like philosophies have a much older history, somewhat similar ideas proposed by some Greek philosophers. And YECists have good company with the likes of scientists such as Kepler, Newton, Pasteur, and Maxwell. But the issue is not a tradition game or a numbers game, it is: Does YEC accurately describe reality?\nThe underlying reasons for specific YECist concepts are: the rules of logic as applied to the Bible and science, and the grammatical historical hermeneutic applied to the Bible. YECists take most of Genesis to be historical narrative including the creation, fall, and flood. They think that most occurrences of the word “day” in Genesis 1 mean a usual day because of contextual considerations.\nYEC touches several fields including theology: hermeneutics, theodicy; philosophy: philosophy of science, logic; science: biology, genetics, palaeontology, astronomy, geology, climate, thermodynamics; information theory; archaeology; history. (Hermeneutics and logic would be better classified as fields that form YEC belief rather than result from it, as mentioned above).\nI wish to cover the following about YEC\n* What young earth creationists (YECists) do and do not believe;\n* The nature of evidence and science; and\n* A discussion focusing on a single aspect of YEC: the age of the earth.\nYEC can be summarised as follows:\n* The universe is not eternal, it was created by God who is external to the world, self existent, and eternal\n* God created the world in 6 usual days\n* Nature was corrupted by the Fall of Man\n* The earth is about 6000 years old\n* The earth was deluged by a global flood about 4500 years ago\n* The Bible is inerrant and should be interpreted in a straightforward manner (according to genre)\nThere are several corollaries from this, though the specifics may vary. The creation model includes:\n* Most of the sedimentary layers of rock and enclosed fossils that occur worldwide were formed during the Noachic Flood.\n* The earth likely contained a single continent that broke up during or after the Flood\n* There was a single ice-age caused by the post-Flood climate\n* All land and air animals (of significant size) are descendants of the animals that were on the Ark\n* Man has coexisted with all animals that have ever existed\n* Natural selection (an analogue of artificial selection) occurs\n* Speciation is rapid. It occurs through allelic separation, genetically induced variation, or detrimental mutation (loss of genetic information).\n* There are genetic limits to the amount of speciation, diversification, adaption, or breeding that can occur\n* Information content of the biosphere cannot increase. Matter cannot create information.\n* Information is always the result of an intelligence\n* Loss of information can mean improved fitness within a specific environment; that is, loss of function can result in improved likelihood of survival.\n* Lost information cannot be recovered without reintroduction of the same information (save trivial examples) by breeding or design\n* Archaeological artefacts post-date the Flood, which limits their age to a maximum of 4500 years\nThere are several accusations that are charged against YEC which proponents of YEC do not support or promote; such as\n*God (or Satan) created the fossils in situ as a test of our faith\n* God created things with false appearance of age (this needs qualification)\n* Animals were created how they look now and no new species of animals have developed\n* Entropy was a result of and did not exist before the Fall of Man\n* The earth is flat\nOn evidence and science\nWhile much could be written in defence of the specific YEC beliefs, discussion can be difficult if foundational issues are not identified.  Modern science was originally a systematised process of categorising our observations to make further inferences and reduce our observations to consistent laws. While hypothesis testing is a usual method, data gathering to create a hypothesis was seen as legitimate. Thus, multiple measurements of the planets led to Kepler proposing elliptical orbits, which could then be further tested. Francis Bacon is frequently credited with formulating the scientific method.\nWritten as: observation → induction → hypothesis → test hypothesis by experiment → proof/disproof → knowledge\nPopper’s falsifiability criterion has had a clarifying influence on the understanding of scientific theories. Therefore negative evidence was seen as disproving a theory whilst positive evidence is merely consistent with a theory, not proof of such.\nNotice that Bacon’s definition is necessarily limited to observable phenomena. This is classic operational science (also called empirical science), which helps us infer laws about things that are demonstrable and repeatable. This is an enormously important distinction that frequently goes unrecognised. In contrast, inferences about previous events are not repeatable. This does not mean that the scientific method cannot be employed, rather that it is limited in what it can say.\nConsider the science of identifying a criminal via a DNA sample. This science is not being done to discover how DNA binds to itself (i.e. hydrogen bonding), it is attempting to establish an event such as a murder.  So a fragment of the DNA is identified and then matched to a specific person. The samples can be run several times and in several different ways; both the forensic sample and the suspects’ samples. And we can establish that the forensic sample and a suspect sample match. This part of the process is operational science.\nHowever establishing a particular suspect as the murderer is not observable. We cannot do an experiment several times to show that he did indeed murder the victim. Intrinsically it is impossible; the event happened in the past. And even if we establish he is capable of murder, it doesn’t prove he committed this particular murder. This kind of science is called historical science.\nIt has been claimed that scientists do not discriminate this way when practising science. This may be the case. When one does historical science there is usually an element of operational science as seen in this example (though the converse is not necessarily true). But whether actual scientists discriminate like this is irrelevant to the philosophy of science, what matters\nis whether this distinction exists. And it clearly exists because a methodology that relies on repeatability cannot be applied to singular past events.\nThe reason for this discussion is to show that historical science competes with other evidences in a way that operational science does not. If I claim my house is so high, I can invite you to measure it. Testimonial evidence doesn’t play a part. We don’t ask a range of people their opinion as to what they think my house height is. Three measurements by several engineers using differing methods that all agree trump the opinion of a dozen opinions and guesses. This is not the case with historical science.\nReturning to our murder investigation with DNA sampling, all we have established is that a suspect shares a DNA fingerprint with a crime scene sample. This may be because it is a limited test, say a portion of DNA with a limited number of polymorphisms. Even if we can be certain the DNA matches by performing adequate sequencing, there may be a identical twin brother we do not know about. Or the DNA may have come from the suspect, but at another time; a meeting earlier in the day. Now I am not trying to imply that DNA testing is inaccurate or inappropriate for criminal investigation, I am illustrating how its use in proving crime is intrinsically different from operational science.\nTestimony of others meant little in the height of my house, but it means a great deal in identifying a murderer. Not because murder is more important that house height, but because it is not testable in the way that heights and widths of objects are. A claim that the suspect has a twin brother is a competing claim against the DNA test. A claim that the suspect was seen elsewhere at the time of the murder is a competing claim. A claim that the blood type does not match despite the DNA matching is a competing claim.\nNote that competing claims against historical science can be both scientific and non-scientific (eg. testimonial).\nAlso note that scientific claims do not automatically trump non-scientific claims. The testimony of a thousand witnesses is not overturned by a DNA match just because the latter is scientific. We weigh several competing claims and people will be variously convinced depending on how reliable they regard each piece of evidence.\nYEC is a competing claim about the history of the world. It is predominantly a competing claim to the historical sciences of biological macro-evolution, abiogenesis, stellar evolution, and uniformitarian geology.\nSome of the YEC disagreement with evolutionary theory is due to consideration of non-scientific fields such as documentary evidence. However much of the disagreement is from a competing but different historical science. For example, consider the age of the earth.\nHow old is the earth?\nYECists claim that the earth is about 6000 years old (though anything below 10000 years would fall into the same range). This is phenomenally different to the uniformitarian geological claim of 4.5 billion years. But note that any usual clock cannot calculate the time since the formation of the earth. We cannot go back, set our stop-watch, and mark off the aeons until now. We are considering a past event (or several past events). Compare this to measuring the time it takes a horse to run 1 km. We can do this measuring the starting and finishing time, and we can do this repeatedly, thus giving us the time (on average) the horse takes. For this we observe established clocks.\nFor past events we need to establish a historical clock, say radiometric-dating. Experiments can determine the amount of various isotopes of uranium and lead in a particular sample. One can do this part of the experiment over and over. We can satisfy ourselves to the limits of experimental accuracy that the sample contains a certain amount of uranium. This part of the investigation is operational science. All parties generally agree on the number of atoms identified in the sample and their ratio.\nThis ratio is then keyed into a formula based on a specific theory with a variety of assumptions to get a date for the formation of the mineral it was derived from. Now the theory is radioactive decay, which is reasonably well established, and an assumption is, say, no daughter isotope was present when the mineral formed.\nThe problem is that these calculations do not always give the answers that are thought to be correct (as established by other historical clocks or underlying evolutionary theory); so sub-theories are added, such as leaching of isotopes, addition of isotopes, incomplete melting at time of formation of mineral in rock. Creationists have also suggested a modification to the theory: the variation of decay half-life, though this modification is often disparaged.\nRather than discuss the merits of these sub-theories or, if you prefer, alteration of assumptions (all of which are reasonable); I would simply like to note that since radiometric dating is a historical science, there are competing claims.\nThere is the competing documentary claim, that the world was created 6000 years ago according to the Bible. This is a claim that YECists take seriously, much like the testimony of someone who witnessed an event. But documentary evidence is not restricted to the Bible. A variety of cultures have given an age of the earth much less than 4.5 billion years and more in keeping with the biblical figure, such as the Mayans and the Greeks. This particular competing claim is less convincing to agnostics and some theists, including some Christians. There are, however, other documentary claims and historical scientific claims that are worth mentioning.\nStaying with radiometric dating, we have reliable documentary evidence for the age of some volcanic episodes. It so happens that rocks from lava flows within recent history that we know the real age of (via operational science) are consistently dated much older by radiometric dating, frequently hundreds of thousands of years or older. Explanations are offered up as to why this is the case, but the greater point is the model is reliably incorrect; it doesn’t matter how good this theory is or should be, the fact is the model doesn’t work.\nIf radiometric dating cannot get dates correct when we do know the true age, why should we trust it when we don’t know the true age?\nWe also have competing scientific claims. Radiometric dating is not the only historical clock. There are a large number of clocks. And even radiometric clocks vary depending on the isotope used.  Historical clocks often give maximum ages. This does not mean that the calculated age is the actual age, rather given the most favourable assumptions this is the longest a particular process has been going on. In constructing a clock based on sodium in the ocean, a maximum age would be established by assuming no sodium in the ocean when it formed, the lowest reasonable estimate for sodium influx, the highest reasonable estimate for sodium outflux, with the current concentration identified by measurements of salinity. The maximum age identified may not equal the true age, as the ocean may have started somewhat salty for example.\nWithin radiometric dating we have carbon dating competing with metal dating. Pretty much all carbon containing materials that have been tested contain carbon-14. This places an upper bound on their age. This includes diamonds embedded in rock supposedly millions of years old.\nOther historical clocks include: diffusion rates of helium; decay of the magnetic field; decay of DNA and protein from dead organisms; elements in the ocean; recession of the moon, starlight travel from distant stars.\nObjections can be raised against these other clocks (though the carbon-14 data is hard to surmount), but this is hardly the point. The point is that there are competing claims here. Radiometric dating of metals is favoured by the evolutionists because it gives a time frame needed for\nevolution. But it is one piece of historical scientific evidence. One person may find it convincing, but with so much riding against it, it is not unreasonable to weigh the other evidences heavier.\nSummary\nYEC is a worldview. It recognises a variety of evidences. It clearly understands the difference between operational and historical science. YECists do not dispute any significant operational scientific finding. Investigating past events is philosophically distinct from investigating repeatable events and YEC views past events differently, and in a way that I think makes more sense of the data.\nYEC theory on the age of the earth is more parsimonious. It is consistent with much of the documentary evidence. It is also consistent with many of the historical scientific clocks. Modifications to the starting conditions and rates give ages consistent with a young earth, including radio-carbon. Radio-dates of metals less so, but these are known to be inaccurate, and YEC proposals concerning rates of decay may resolve other well recognised difficulties of radiometric dating. Ancient earth theory is unable to easily reconcile non-radiometric clocks or even radio-carbon clocks.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-13T13:15:00+00:00"
}