{
  "url": "https://voxday.net/2009/08/21/puosu-2-calvinis/",
  "scraped_at": "2026-01-08T23:04:40.379466",
  "title": "PUOSU #2: Calvinism",
  "date_display": "August 21, 2009",
  "date_iso": "2009-08-21T14:15:00+00:00",
  "date_from_url": "2009-08-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Markku and wrf present the detailed and nicely formatted “<a href=\"http://img40.imageshack.us/img40/392/puosucalvinism.pdf\">Christian’s Guide to the Absolute Truth of Calvinism</a>“.  As before, this presentation reflects the authors’ beliefs, not mine.  Below is merely a sample; for the entire 15-page PDF, click on the link above.</p><blockquote><p>I do not ascribe any particular authority to Jean Calvin, and I would be quite comfortable in rejecting any other doctrines apart from these five that he might hold. Especially the ones about the utility of the state in persecuting those who disagree with you. It is purely incidental that he was the first person to identify these five dogmas as a particular doctrine. Calvin certainly was not the first one in history to state some of the dogmas. Ignatius, in the first century, wrote:</p><p><i>Ignatius, who is also called Theophorus, to the Church which is at Ephesus, in Asia, deservedly most happy, being blessed in the greatness and fulness of God the Father, <b>and predestined before the beginning of time</b>, that it should be always for an enduring and unchangeable glory, being united and elected through the true passion by the will of the Father, and Jesus Christ, our God: Abundant happiness through Jesus Christ, and His undefiled grace.</i></p><p>Likewise, Ireaneus wrote in the second century:</p><p><i>But He Himself in Himself, after a fashion which we can neither describe nor conceive, <b>predestinating all things</b>, formed them as He pleased, bestowing harmony on all things, and assigning them their own place, and the beginning of their creation.</i></p><p>Emphasis is mine in both quotes. The latter quote goes further than I would, but I mean it to demonstrate that even full predestination is a very old doctrine. I will argue based on the assumption that all statements in the Bible, interpreted the way the author intended, are true. If this is not your view, then this essay is not intended to be applicable for you. Except possibly as a response to the question, if what the Bible says were true, then how should it be interpreted with regards to salvation. If the plain reading of a passage, taken in its context (including other relevant passages elsewhere in the Bible), feels uncomfortable, then that is not adequate grounds to reject the plain reading. It must be rejected on Biblical grounds. Merely the fact that God is loving, is not good enough. It would beg the question, what love should look like in those circumstances. The disciples had hard time accepting some of the things Jesus said, so why shouldn’t we?</p></blockquote><p>This should make for a nice prelude to the upcoming Omniderigent vs Aprevistan debate between The Responsible Puppet and me, although the final conclusion leaves no doubt whose side the authors are supporting:</p><p><i>“I simply cannot see Arminianism as anything but an effort to deny the plain meaning of Scriptures because one does not like it.”</i></p></div>",
  "content_text": "Markku and wrf present the detailed and nicely formatted “\nChristian’s Guide to the Absolute Truth of Calvinism\n“.  As before, this presentation reflects the authors’ beliefs, not mine.  Below is merely a sample; for the entire 15-page PDF, click on the link above.\nI do not ascribe any particular authority to Jean Calvin, and I would be quite comfortable in rejecting any other doctrines apart from these five that he might hold. Especially the ones about the utility of the state in persecuting those who disagree with you. It is purely incidental that he was the first person to identify these five dogmas as a particular doctrine. Calvin certainly was not the first one in history to state some of the dogmas. Ignatius, in the first century, wrote:\nIgnatius, who is also called Theophorus, to the Church which is at Ephesus, in Asia, deservedly most happy, being blessed in the greatness and fulness of God the Father,\nand predestined before the beginning of time\n, that it should be always for an enduring and unchangeable glory, being united and elected through the true passion by the will of the Father, and Jesus Christ, our God: Abundant happiness through Jesus Christ, and His undefiled grace.\nLikewise, Ireaneus wrote in the second century:\nBut He Himself in Himself, after a fashion which we can neither describe nor conceive,\npredestinating all things\n, formed them as He pleased, bestowing harmony on all things, and assigning them their own place, and the beginning of their creation.\nEmphasis is mine in both quotes. The latter quote goes further than I would, but I mean it to demonstrate that even full predestination is a very old doctrine. I will argue based on the assumption that all statements in the Bible, interpreted the way the author intended, are true. If this is not your view, then this essay is not intended to be applicable for you. Except possibly as a response to the question, if what the Bible says were true, then how should it be interpreted with regards to salvation. If the plain reading of a passage, taken in its context (including other relevant passages elsewhere in the Bible), feels uncomfortable, then that is not adequate grounds to reject the plain reading. It must be rejected on Biblical grounds. Merely the fact that God is loving, is not good enough. It would beg the question, what love should look like in those circumstances. The disciples had hard time accepting some of the things Jesus said, so why shouldn’t we?\nThis should make for a nice prelude to the upcoming Omniderigent vs Aprevistan debate between The Responsible Puppet and me, although the final conclusion leaves no doubt whose side the authors are supporting:\n“I simply cannot see Arminianism as anything but an effort to deny the plain meaning of Scriptures because one does not like it.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-21T13:15:00+00:00"
}