{
  "url": "https://voxday.net/2009/08/16/random-thoughts/",
  "scraped_at": "2026-01-08T23:04:07.175758",
  "title": "Random thoughts",
  "date_display": "August 16, 2009",
  "date_iso": "2009-08-16T10:14:00+00:00",
  "date_from_url": "2009-08-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The generation of idiots aka Baby Boomers have to be <a href=\"http://www.nytimes.com/2009/08/15/opinion/15collins.html?em\">the most trivial, most foolish, most contemptible generation</a> in the history of the planet.  Gail Collins explains one of the many reasons why:</p><blockquote><p>The Woodstock-mania must drive young people crazy since it is yet another reminder that the baby-boom generation is never going to stop talking about the stuff it did, and that when they are old themselves there will probably still be some 108-year-old telling them how everybody slept in the mud but that it was worth it because Janis Joplin sounded so awesome and the people were all mellow.</p></blockquote><p>It was a concert to which a bunch of young adults went 40 years ago.  BFD.  And yet, the Idiot Generation is still rambling on and on about it as if it was ever actually significant to anyone or anything, let alone history.  Gibbon wept. Can you imagine <i>The Decline and Fall of the Roman Empire</i> with a long chapter entirely devoted to the seminal importance of a well-attended concert?  Actually, I suppose I can, but where was the Belisarius of Woodstock when the world needed him?</p><p>The Idiot Generation is the first and only generation to fail to grow out of their teenage years.  They don’t drive the rest of us crazy, they have simply caused us to conclude that they are, and have always been, collectively nuts.  This goes well beyond the usual parent-child divide; every generation of teenagers believes it invented sex, <i>but the Baby Boomers are the only ones who still believe it as obese, grey-haired, rock-n-rolling AARP members.</i> Instead of going to a concert, my grandfather’s generation went off to war in their teens, kicked the asses of the Nazis and Imperial Japanese, came home to build the richest economy in the world, and never once appeared to worry about being cool, much less what anyone happened to think of them.  Meanwhile, we have the inevitable avalanche of “60 is the New 35!” articles to anticipate next year.  What a bunch of historical losers.</p><p>On to more important matters.  I think the acquisition of Michael Vick by the Eagles is a great move.  Donovan McNabb is basically the plus version of Vick, a little less athletic and a little more accurate, and he seldom plays 16 games in a season.  Andy Reid may be a fat bastard, but he’s a tough, non-nonsense, fat bastard and he won’t permit any media circuses.  I’ve always hated the massive and ludicrous overrating of Vick by the sportswriters – he was never, ever going to “reinvent” the quarterback position – but he’s got great utility in a Slash/Wildcat role and as a backup to McNabb.  Nice move by the Eagles as it makes a strong team even stronger.</p><p>The Vikes look very good, especially if the Williams Wall ends up avoiding their four-game Starcaps suspension.  Sage Rosenfels isn’t going to be an all-pro, but everyone keeps forgetting that he doesn’t have to be for the Vikings to be significantly improved.  A B- quarterback is a massive improvement over the collection of D+ players that have been taking the snaps over the last four years.  And yes, I’m still irked that they didn’t go after Drew Brees when he was available.</p><p>Speaking of the NFL, DJ Gallo’s theory about <a href=\"http://sports.espn.go.com/espn/page2/story?page=gallo/090814&amp;sportCat=nfl\">the evil genius’s master plan</a> holds together just a little too well to be entirely dismissed….</p><p>What’s the feeling on the VPFL this year?  I’m very much looking forward to the season, but I’m not feeling the burning fantasy fever this year.  I don’t know why.</p><p>And finally, while there are funnier things than <a href=\"http://whatever.scalzi.com/2009/08/14/controversies-and-etc/\">handicapable lesbian sciff-dorks freaking out</a> about a casting call for a Stargate Universe episode that involves <i>temporary body switching</i>, there aren’t very many.  And the endless crying about stereotypes… I recommend doing what straight white men do when they get tired of “entertainment” that portrays them as clueless, bumbling fools in endless need of salvation by smart, independent women, wisecracking children, noble negroes, saintly homosexuals in loving, monogamous relationships who would never DREAM of visiting a bathhouse, and now, apparently, quadriplegic body-swappers of unreliable Sapphic inclination:  ignore it and create stories that appeal to you.</p></div>",
  "content_text": "The generation of idiots aka Baby Boomers have to be\nthe most trivial, most foolish, most contemptible generation\nin the history of the planet.  Gail Collins explains one of the many reasons why:\nThe Woodstock-mania must drive young people crazy since it is yet another reminder that the baby-boom generation is never going to stop talking about the stuff it did, and that when they are old themselves there will probably still be some 108-year-old telling them how everybody slept in the mud but that it was worth it because Janis Joplin sounded so awesome and the people were all mellow.\nIt was a concert to which a bunch of young adults went 40 years ago.  BFD.  And yet, the Idiot Generation is still rambling on and on about it as if it was ever actually significant to anyone or anything, let alone history.  Gibbon wept. Can you imagine\nThe Decline and Fall of the Roman Empire\nwith a long chapter entirely devoted to the seminal importance of a well-attended concert?  Actually, I suppose I can, but where was the Belisarius of Woodstock when the world needed him?\nThe Idiot Generation is the first and only generation to fail to grow out of their teenage years.  They don’t drive the rest of us crazy, they have simply caused us to conclude that they are, and have always been, collectively nuts.  This goes well beyond the usual parent-child divide; every generation of teenagers believes it invented sex,\nbut the Baby Boomers are the only ones who still believe it as obese, grey-haired, rock-n-rolling AARP members.\nInstead of going to a concert, my grandfather’s generation went off to war in their teens, kicked the asses of the Nazis and Imperial Japanese, came home to build the richest economy in the world, and never once appeared to worry about being cool, much less what anyone happened to think of them.  Meanwhile, we have the inevitable avalanche of “60 is the New 35!” articles to anticipate next year.  What a bunch of historical losers.\nOn to more important matters.  I think the acquisition of Michael Vick by the Eagles is a great move.  Donovan McNabb is basically the plus version of Vick, a little less athletic and a little more accurate, and he seldom plays 16 games in a season.  Andy Reid may be a fat bastard, but he’s a tough, non-nonsense, fat bastard and he won’t permit any media circuses.  I’ve always hated the massive and ludicrous overrating of Vick by the sportswriters – he was never, ever going to “reinvent” the quarterback position – but he’s got great utility in a Slash/Wildcat role and as a backup to McNabb.  Nice move by the Eagles as it makes a strong team even stronger.\nThe Vikes look very good, especially if the Williams Wall ends up avoiding their four-game Starcaps suspension.  Sage Rosenfels isn’t going to be an all-pro, but everyone keeps forgetting that he doesn’t have to be for the Vikings to be significantly improved.  A B- quarterback is a massive improvement over the collection of D+ players that have been taking the snaps over the last four years.  And yes, I’m still irked that they didn’t go after Drew Brees when he was available.\nSpeaking of the NFL, DJ Gallo’s theory about\nthe evil genius’s master plan\nholds together just a little too well to be entirely dismissed….\nWhat’s the feeling on the VPFL this year?  I’m very much looking forward to the season, but I’m not feeling the burning fantasy fever this year.  I don’t know why.\nAnd finally, while there are funnier things than\nhandicapable lesbian sciff-dorks freaking out\nabout a casting call for a Stargate Universe episode that involves\ntemporary body switching\n, there aren’t very many.  And the endless crying about stereotypes… I recommend doing what straight white men do when they get tired of “entertainment” that portrays them as clueless, bumbling fools in endless need of salvation by smart, independent women, wisecracking children, noble negroes, saintly homosexuals in loving, monogamous relationships who would never DREAM of visiting a bathhouse, and now, apparently, quadriplegic body-swappers of unreliable Sapphic inclination:  ignore it and create stories that appeal to you.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-16T09:14:00+00:00"
}