{
  "url": "https://voxday.net/2009/08/24/reliably-wrong/",
  "scraped_at": "2026-01-08T23:04:56.794222",
  "title": "Reliably wrong",
  "date_display": "August 24, 2009",
  "date_iso": "2009-08-24T14:15:00+00:00",
  "date_from_url": "2009-08-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sam Harris had barely published his <i>Letter to a Christian Nation</i> when he was bitchslapped by science on stem cells.  Now one of Christopher Hitchens’s favorite, if totally irrelevant, <a href=\"http://www.nytimes.com/2009/08/24/health/policy/24circumcision.html\">anti-God arguments</a> goes down in flames.  You’d think the self-anointed defenders of science would bother to learn a little more about that which they’re supposedly defending:</p><blockquote><p>Public health officials are considering promoting routine circumcision for all baby boys born in the United States to reduce the spread of H.I.V., the virus that causes AIDS…. Recently, studies showed that in African countries hit hard by AIDS, men who were circumcised reduced their infection risk by half. But the clinical trials in Africa focused on heterosexual men who are at risk of getting H.I.V. from infected female partners.</p></blockquote><p>A few people have asked me if I plan to write a follow-up to <i>The Irrational Atheist</i>.  I see no reason to, however, since the New Atheists have been sufficiently discredited to the point that by the end of this year, there should be more anti-New Atheism books written by atheists than there are atheism-related books written by the four so-called New Atheists.  The thought of writing a critique of Richard Dawkins’s forthcoming book on evolution has crossed my mind, but if the text is as bad as the title, there won’t be much point.  Dawkins has pretty clearly lost his fastball, so I’d be surprised if it was more <i>Selfish Gene</i> than <i>God Delusion</i> in terms of quality.</p></div>",
  "content_text": "Sam Harris had barely published his\nLetter to a Christian Nation\nwhen he was bitchslapped by science on stem cells.  Now one of Christopher Hitchens’s favorite, if totally irrelevant,\nanti-God arguments\ngoes down in flames.  You’d think the self-anointed defenders of science would bother to learn a little more about that which they’re supposedly defending:\nPublic health officials are considering promoting routine circumcision for all baby boys born in the United States to reduce the spread of H.I.V., the virus that causes AIDS…. Recently, studies showed that in African countries hit hard by AIDS, men who were circumcised reduced their infection risk by half. But the clinical trials in Africa focused on heterosexual men who are at risk of getting H.I.V. from infected female partners.\nA few people have asked me if I plan to write a follow-up to\nThe Irrational Atheist\n.  I see no reason to, however, since the New Atheists have been sufficiently discredited to the point that by the end of this year, there should be more anti-New Atheism books written by atheists than there are atheism-related books written by the four so-called New Atheists.  The thought of writing a critique of Richard Dawkins’s forthcoming book on evolution has crossed my mind, but if the text is as bad as the title, there won’t be much point.  Dawkins has pretty clearly lost his fastball, so I’d be surprised if it was more\nSelfish Gene\nthan\nGod Delusion\nin terms of quality.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-24T13:15:00+00:00"
}