{
  "url": "https://voxday.net/2009/08/06/underwater/",
  "scraped_at": "2026-01-08T23:03:13.620859",
  "title": "Underwater",
  "date_display": "August 6, 2009",
  "date_iso": "2009-08-06T07:31:00+00:00",
  "date_from_url": "2009-08-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Deutsche Bank has <a href=\"http://news.yahoo.com/s/nm/20090805/bs_nm/us_usa_housing_deutschebank\">a grim forecast</a>:</p><blockquote><p>The percentage of U.S. homeowners who owe more than their house is worth will nearly double to 48 percent in 2011 from 26 percent at the end of March, portending another blow to the housing market, Deutsche Bank said on Wednesday.</p><p>Home price declines will have their biggest impact on prime “conforming” loans that meet underwriting and size guidelines of Fannie Mae and Freddie Mac, the bank said in a report. Prime conforming loans make up two-thirds of mortgages, and are typically less risky because of stringent requirements.</p><p>“We project the next phase of the housing decline will have a far greater impact on prime borrowers,” Deutsche analysts Karen Weaver and Ying Shen said in the report….  Covering 100 U.S. metropolitan areas, Deutsche Bank in June forecast home prices would fall 14 percent through the first quarter of 2011, for a total drop of 41.7 percent.</p></blockquote><p>This can be expected to significantly increase the rate of foreclosures, which will take down an increasing number of banks.  And the FDIC already has some sizeable problems on its hands, as <a href=\"http://www.calculatedriskblog.com/2009/07/wsj-fdic-to-split-failed-banks-hoping.html\">its inability to find takers</a> for the assets and deposits of several large banks that are in the process of failing has it scrambling to split the banks’ assets among acquirers, which it has to do before it can seize them and shut them down.</p><p>Don’t put too much faith in the short term happy talk on housing.  That’s just a blip from the foreclosure hiatus and people snapping up the initial wave of foreclosure “bargains”.  The fragility of the housing market is why the Fed won’t even think of doing what needs to be done and raising interest rates, which would appear to doom the US to a Japan scenario at best.</p></div>",
  "content_text": "Deutsche Bank has\na grim forecast\n:\nThe percentage of U.S. homeowners who owe more than their house is worth will nearly double to 48 percent in 2011 from 26 percent at the end of March, portending another blow to the housing market, Deutsche Bank said on Wednesday.\nHome price declines will have their biggest impact on prime “conforming” loans that meet underwriting and size guidelines of Fannie Mae and Freddie Mac, the bank said in a report. Prime conforming loans make up two-thirds of mortgages, and are typically less risky because of stringent requirements.\n“We project the next phase of the housing decline will have a far greater impact on prime borrowers,” Deutsche analysts Karen Weaver and Ying Shen said in the report….  Covering 100 U.S. metropolitan areas, Deutsche Bank in June forecast home prices would fall 14 percent through the first quarter of 2011, for a total drop of 41.7 percent.\nThis can be expected to significantly increase the rate of foreclosures, which will take down an increasing number of banks.  And the FDIC already has some sizeable problems on its hands, as\nits inability to find takers\nfor the assets and deposits of several large banks that are in the process of failing has it scrambling to split the banks’ assets among acquirers, which it has to do before it can seize them and shut them down.\nDon’t put too much faith in the short term happy talk on housing.  That’s just a blip from the foreclosure hiatus and people snapping up the initial wave of foreclosure “bargains”.  The fragility of the housing market is why the Fed won’t even think of doing what needs to be done and raising interest rates, which would appear to doom the US to a Japan scenario at best.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-06T06:31:00+00:00"
}