{
  "url": "https://voxday.net/2009/08/19/well-consider-source/",
  "scraped_at": "2026-01-08T23:04:31.247096",
  "title": "Well, consider the source",
  "date_display": "August 19, 2009",
  "date_iso": "2009-08-19T19:30:00+00:00",
  "date_from_url": "2009-08-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>EP sends a link informing us of <a href=\"http://www.vanguardparty.com/articles/starcraft.html\">Starcraft and negative sexual stereotypes</a>:</p><blockquote><p>I fear that Starcraft, along with nearly all modern computer games, alongside it’s addictively entertaining gameplay, and beautiful plotline, reinforces negative gender stereotypes by quantifying the women as sexual objects, and simultaneously as unknowable beasts.</p></blockquote><p>First, if you’re looking to the game developers of the world for political correctness, you’re looking in the wrong place.  I never much liked <i>Tomb Raider</i> as a game, but perhaps you’ll appreciate it more if you understand that the developers genuinely believed they were engaging in revolutionary gender outreach by making the protagonist a woman with large breasts, short shorts, and a gun.  Second, I think it’s safe to say that women are nothing but unknown sexual objects to a sizable majority of the men employed in the games industry.</p><p>And right about now I’m bitterly regretting my decision to turn down the first Starcraft novelization.  We will never know how much potential humor we have lost.  When I think of all the misinterpretations of what I had intended for the Zerg….</p></div>",
  "content_text": "EP sends a link informing us of\nStarcraft and negative sexual stereotypes\n:\nI fear that Starcraft, along with nearly all modern computer games, alongside it’s addictively entertaining gameplay, and beautiful plotline, reinforces negative gender stereotypes by quantifying the women as sexual objects, and simultaneously as unknowable beasts.\nFirst, if you’re looking to the game developers of the world for political correctness, you’re looking in the wrong place.  I never much liked\nTomb Raider\nas a game, but perhaps you’ll appreciate it more if you understand that the developers genuinely believed they were engaging in revolutionary gender outreach by making the protagonist a woman with large breasts, short shorts, and a gun.  Second, I think it’s safe to say that women are nothing but unknown sexual objects to a sizable majority of the men employed in the games industry.\nAnd right about now I’m bitterly regretting my decision to turn down the first Starcraft novelization.  We will never know how much potential humor we have lost.  When I think of all the misinterpretations of what I had intended for the Zerg….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-19T18:30:00+00:00"
}