{
  "url": "https://voxday.net/2009/08/14/why-smart-people-cant-take-criticis/",
  "scraped_at": "2026-01-08T23:03:59.826822",
  "title": "Why smart people can’t take criticism",
  "date_display": "August 14, 2009",
  "date_iso": "2009-08-14T17:15:00+00:00",
  "date_from_url": "2009-08-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A PhD <a href=\"http://www.psychologytoday.com/blog/scalliwag/200908/kiss-my-apa\">concocts a theory</a>:</p><blockquote><p>My theory—call it the “Oakley effect”—is that really smart people often don’t know how to accept and react constructively to criticism.  (A neuroscientist might say they “have underdeveloped neurocircuitry for integrating negatively valenced stimuli.”)  This is because smart people are whizzes at problems that only need one person to figure out.  Indeed, people are evaluated from kindergarten through college prep SATs on the basis of such “single solver” problems.  If you are often or nearly always right with these kinds of problems, your increased confidence in your own abilities would be accompanied by an inadvertent decrease in your capacity to deal with criticism.  After all, your experience would have shown that your critics were usually wrong.</p></blockquote><p>I think this is largely true, especially for those educated in a scholastic environment where self-esteem was given precedence over actually being correct.  It also explains the rapid retreat to “consensus” on the part of those who subscribe to mainstream ideas since they have no capacity for accepting or even understanding criticism of that which they have never bothered to question themselves.  Of course, the “Oakley effect” doesn’t apply to me and other contrarians in various fields because we not only expect criticism, we know that it is an inherent part of taking a position that is outside or contrary to the current groupthink.</p><p>Personally, I very much like substantial criticism, even though it really annoys me when I get something wrong because I failed to take an obvious variable into account.  I only get annoyed with critics when they bring up ludicrously obvious objections that were either taken into account or have nothing to do with what I’m saying.  One of the great pleasures of my discourse on TENS with Scott Hatfield was the fact that even if he didn’t always understand the specifics of certain criticisms of the theory, <a href=\"http://monkeytrials.blogspot.com/2009/08/grid-of-dei-sputation.html\">he fully grasped</a> that they were not only of a different nature than the norm, but the difference between a skeptic and an opponent as well.</p><p>“So, your argument basically amounts to something like this: “Evolution, meh. It’s the best thing we’ve got, right now. I hope something better comes along, someday.  I just can’t imagine partisans on either side of this debate getting that worked up over that argument.”</p><p>I would have used the word “expect” rather than hope, and said it’s “all” we’ve got rather than “the best thing” but that summary is essentially correct.  After all, there’s no question that the predictive uselessness of TENS is less materially harmful to me and everyone who reads this blog than the predictive uselessness of the General Theory and its practical Neo-Keynesian offshoots.</p><p>On a tangential note, I suspect it’s probably easier for anyone who has ever had any success trading in the financial markets to be comfortable with contrarian positions for the obvious reason that taking a contrarian position at the right time is very definition of “buy low, sell high”, which is one of the most effective ways to make money short of convincing the government to give you billions of tax dollars in order to prevent the <s>sky from falling</s>economy from collapsing.  In the equity and commodity markets, uniform consensus is usually a reliable indicator that everyone is about to get seriously scalped.  So, not only is “scientific consensus” not science, it tends to be inherently dubious from the perspective of those see the regular shortcomings of consensus.</p><p>The amusing thing about those who tell me that I should harbor more respect for Darwin and TENS due to its long decades of mass acceptance by the scientific community is that I am presently at work in helping overturn an errant theory or two that are older, more materially significant, and more broadly accepted than anything Darwin ever wrote about natural selection or common descent.  So, I’m probably among the very last individuals to whom an Appeal to Ancient and Accepted Authority should be made.  And yes, I expect truckloads of criticism, both substantive and shallow.</p></div>",
  "content_text": "A PhD\nconcocts a theory\n:\nMy theory—call it the “Oakley effect”—is that really smart people often don’t know how to accept and react constructively to criticism.  (A neuroscientist might say they “have underdeveloped neurocircuitry for integrating negatively valenced stimuli.”)  This is because smart people are whizzes at problems that only need one person to figure out.  Indeed, people are evaluated from kindergarten through college prep SATs on the basis of such “single solver” problems.  If you are often or nearly always right with these kinds of problems, your increased confidence in your own abilities would be accompanied by an inadvertent decrease in your capacity to deal with criticism.  After all, your experience would have shown that your critics were usually wrong.\nI think this is largely true, especially for those educated in a scholastic environment where self-esteem was given precedence over actually being correct.  It also explains the rapid retreat to “consensus” on the part of those who subscribe to mainstream ideas since they have no capacity for accepting or even understanding criticism of that which they have never bothered to question themselves.  Of course, the “Oakley effect” doesn’t apply to me and other contrarians in various fields because we not only expect criticism, we know that it is an inherent part of taking a position that is outside or contrary to the current groupthink.\nPersonally, I very much like substantial criticism, even though it really annoys me when I get something wrong because I failed to take an obvious variable into account.  I only get annoyed with critics when they bring up ludicrously obvious objections that were either taken into account or have nothing to do with what I’m saying.  One of the great pleasures of my discourse on TENS with Scott Hatfield was the fact that even if he didn’t always understand the specifics of certain criticisms of the theory,\nhe fully grasped\nthat they were not only of a different nature than the norm, but the difference between a skeptic and an opponent as well.\n“So, your argument basically amounts to something like this: “Evolution, meh. It’s the best thing we’ve got, right now. I hope something better comes along, someday.  I just can’t imagine partisans on either side of this debate getting that worked up over that argument.”\nI would have used the word “expect” rather than hope, and said it’s “all” we’ve got rather than “the best thing” but that summary is essentially correct.  After all, there’s no question that the predictive uselessness of TENS is less materially harmful to me and everyone who reads this blog than the predictive uselessness of the General Theory and its practical Neo-Keynesian offshoots.\nOn a tangential note, I suspect it’s probably easier for anyone who has ever had any success trading in the financial markets to be comfortable with contrarian positions for the obvious reason that taking a contrarian position at the right time is very definition of “buy low, sell high”, which is one of the most effective ways to make money short of convincing the government to give you billions of tax dollars in order to prevent the\nsky from falling\neconomy from collapsing.  In the equity and commodity markets, uniform consensus is usually a reliable indicator that everyone is about to get seriously scalped.  So, not only is “scientific consensus” not science, it tends to be inherently dubious from the perspective of those see the regular shortcomings of consensus.\nThe amusing thing about those who tell me that I should harbor more respect for Darwin and TENS due to its long decades of mass acceptance by the scientific community is that I am presently at work in helping overturn an errant theory or two that are older, more materially significant, and more broadly accepted than anything Darwin ever wrote about natural selection or common descent.  So, I’m probably among the very last individuals to whom an Appeal to Ancient and Accepted Authority should be made.  And yes, I expect truckloads of criticism, both substantive and shallow.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-08-14T16:15:00+00:00"
}