{
  "url": "https://voxday.net/2008/12/26/atheism-nadir/",
  "scraped_at": "2026-01-08T22:43:55.977403",
  "title": "Atheism: the nadir",
  "date_display": "December 26, 2008",
  "date_iso": "2008-12-26T18:22:00+00:00",
  "date_from_url": "2008-12-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Lest you wonder why I have such complete contempt for the intellectual pretensions of atheists, here’s an attempted criticism of <i>The Irrational Atheist</i> from an atheist who, quite naturally, thinks that there’s no need to read a book in order to decry it because it is, and I quote: “a book that sprouts such lies….”</p><blockquote><p>Given the scale of the inquisitions and the Christian crusades and the centuries of conflict incurred by these religious conflicts, it is quite difficult to put an exact figure, not to mention the fact that these conflicts inflicted caused wholesale destruction of other cultures, such as the Atzecs (Victims of the Spanish inquisitors), the French Cathars (a French minority Christian sect) and countless others.</p></blockquote><p>I have no doubts at all that it’s very difficult for someone who believes the Aztecs were victims of the Spanish inquisitors – and even cites Wikipedia to “prove” it – to count anything over four.  As is so often the case, the tremendously amusing thing about atheists isn’t that they’re stupid, but that they genuinely believe themselves to be tremendously intelligent and well-informed while publicly demonstrating the precise opposite.</p><p>Now, there are certainly many very intelligent and reasonable individuals who happen to lack religious faith. However, such individuals almost invariably describe themselves as “agnostic”.</p></div>",
  "content_text": "Lest you wonder why I have such complete contempt for the intellectual pretensions of atheists, here’s an attempted criticism of\nThe Irrational Atheist\nfrom an atheist who, quite naturally, thinks that there’s no need to read a book in order to decry it because it is, and I quote: “a book that sprouts such lies….”\nGiven the scale of the inquisitions and the Christian crusades and the centuries of conflict incurred by these religious conflicts, it is quite difficult to put an exact figure, not to mention the fact that these conflicts inflicted caused wholesale destruction of other cultures, such as the Atzecs (Victims of the Spanish inquisitors), the French Cathars (a French minority Christian sect) and countless others.\nI have no doubts at all that it’s very difficult for someone who believes the Aztecs were victims of the Spanish inquisitors – and even cites Wikipedia to “prove” it – to count anything over four.  As is so often the case, the tremendously amusing thing about atheists isn’t that they’re stupid, but that they genuinely believe themselves to be tremendously intelligent and well-informed while publicly demonstrating the precise opposite.\nNow, there are certainly many very intelligent and reasonable individuals who happen to lack religious faith. However, such individuals almost invariably describe themselves as “agnostic”.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-12-26T18:22:00+00:00"
}