{
  "url": "https://voxday.net/2008/12/29/atheists-for-christianity/",
  "scraped_at": "2026-01-08T22:44:08.849474",
  "title": "Atheists for Christianity",
  "date_display": "December 29, 2008",
  "date_iso": "2008-12-29T12:24:00+00:00",
  "date_from_url": "2008-12-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since we’re on <a href=\"http://www.worldnetdaily.com/index.php?pageId=84742\">the subject of atheism</a> today, it’s worth noting that not all atheists are as obtusely blind to the objective and even scientific <a href=\"http://www.timesonline.co.uk/tol/comment/columnists/matthew_parris/article5400568.ece\">benefits of religion in general and Christianity in particular</a> as the New Atheists and their mindless acolytes.</p><blockquote><p>Now a confirmed atheist, I’ve become convinced of the enormous contribution that Christian evangelism makes in Africa: sharply distinct from the work of secular NGOs, government projects and international aid efforts. These alone will not do. Education and training alone will not do. In Africa Christianity changes people’s hearts. It brings a spiritual transformation. The rebirth is real. The change is good….  Faith does more than support the missionary; it is also transferred to his flock. This is the effect that matters so immensely, and which I cannot help observing.</p></blockquote><p>Now, the fact that Christianity is of real and tangible material benefit to people does not, of course, prove that its tenets are true.  It merely proves they are beneficial.  This is not irrelevant, indeed, it is important in proving that the core message of the New Atheism, that society would be better off if its members possessed less religious faith, is demonstrably false.  But it is irrelevant regarding the fact or non-fact of God’s existence, much less the truth of Jesus Christ’s death and resurrection.</p><p>On a related subject, it is interesting to note the reaction of many atheists to <a href=\"http://ravingatheist.com/2008/12/christ-is-the-lord/\">the conversion to Catholic Christianity</a> of a man who was once one of the more notorious atheists active on the Internet.  I don’t know the Raving Atheist nor do I have an opinion if his conversion is genuine or some sort of practical joke, but there is certainly a powerful Biblical precedent for this sort of dramatic turn from prosecutor to proselytiser.  What escapes those now accusing the Raving Atheist of being mentally unstable is the observation that many of them regularly exhibit the same sort of instability and logical incoherence that was long exhibited by the Raving Atheist.  In most cases, it’s very easy to observe that an individual’s atheism is more a symptom of an underlying psychological problem than the result of a long and objective rational inquiry.</p><p>It will be interesting if Matthew Paris eventually follows his observations to their rational conclusion.  If Christianity is good for Africa, then presumably Europe’s turn away from Christianity is bad for Europe.  In which case, Europeans would do well to reject their embrace of irreligion and paganism in favor of a return to their Christian roots.</p></div>",
  "content_text": "Since we’re on\nthe subject of atheism\ntoday, it’s worth noting that not all atheists are as obtusely blind to the objective and even scientific\nbenefits of religion in general and Christianity in particular\nas the New Atheists and their mindless acolytes.\nNow a confirmed atheist, I’ve become convinced of the enormous contribution that Christian evangelism makes in Africa: sharply distinct from the work of secular NGOs, government projects and international aid efforts. These alone will not do. Education and training alone will not do. In Africa Christianity changes people’s hearts. It brings a spiritual transformation. The rebirth is real. The change is good….  Faith does more than support the missionary; it is also transferred to his flock. This is the effect that matters so immensely, and which I cannot help observing.\nNow, the fact that Christianity is of real and tangible material benefit to people does not, of course, prove that its tenets are true.  It merely proves they are beneficial.  This is not irrelevant, indeed, it is important in proving that the core message of the New Atheism, that society would be better off if its members possessed less religious faith, is demonstrably false.  But it is irrelevant regarding the fact or non-fact of God’s existence, much less the truth of Jesus Christ’s death and resurrection.\nOn a related subject, it is interesting to note the reaction of many atheists to\nthe conversion to Catholic Christianity\nof a man who was once one of the more notorious atheists active on the Internet.  I don’t know the Raving Atheist nor do I have an opinion if his conversion is genuine or some sort of practical joke, but there is certainly a powerful Biblical precedent for this sort of dramatic turn from prosecutor to proselytiser.  What escapes those now accusing the Raving Atheist of being mentally unstable is the observation that many of them regularly exhibit the same sort of instability and logical incoherence that was long exhibited by the Raving Atheist.  In most cases, it’s very easy to observe that an individual’s atheism is more a symptom of an underlying psychological problem than the result of a long and objective rational inquiry.\nIt will be interesting if Matthew Paris eventually follows his observations to their rational conclusion.  If Christianity is good for Africa, then presumably Europe’s turn away from Christianity is bad for Europe.  In which case, Europeans would do well to reject their embrace of irreligion and paganism in favor of a return to their Christian roots.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-12-29T12:24:00+00:00"
}