{
  "url": "https://voxday.net/2008/12/19/blame-churc/",
  "scraped_at": "2026-01-08T22:43:23.932224",
  "title": "Blame the Church",
  "date_display": "December 19, 2008",
  "date_iso": "2008-12-19T13:15:00+00:00",
  "date_from_url": "2008-12-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This guy does for <a href=\"http://recrudescentreligion.wordpress.com/2008/12/05/the-infantilisation-of-our-culture/\">the infantilisation of Western culture</a>.  And he’s basically correct:</p><blockquote><p>Seriously though, there is an increasing dearth of actual intellectual or moral seriousness in much of American Christianity, even in professing Evangelicalism. The churches are following the same trend of infantilisation as is society at large. No longer is this religion God-centred, dedicated to His glory, and seeking to serve Him acceptably. Now it is man-centred, feebly mewling because somebody offended it by disagreeing with it on doctrine. And that right there is another symptom of this childishness in society – this notion that we shouldn’t talk about things that might “offend” or “create a stir”.</p></blockquote><p>A certain man once said this: <i>“Suppose ye that I am come to give peace on earth? I tell you, Nay; but rather division:  For from henceforth there shall be five in one house divided, three against two, and two against three.  The father shall be divided against the son, and the son against the father; the mother against the daughter, and the daughter against the mother; the mother in law against her daughter in law, and the daughter in law against her mother in law.”</i></p><p>If you ever hear a pastor babbling on about peace and unity through religion, or worrying about offending the precious sensitivities of others, you can be quite confident that there’s little point in listening to him.  Whatever he’s teaching, it isn’t the Bible, which is filled with metaphor after metaphor referring to division, separation, and even winnowing.</p></div>",
  "content_text": "This guy does for\nthe infantilisation of Western culture\n.  And he’s basically correct:\nSeriously though, there is an increasing dearth of actual intellectual or moral seriousness in much of American Christianity, even in professing Evangelicalism. The churches are following the same trend of infantilisation as is society at large. No longer is this religion God-centred, dedicated to His glory, and seeking to serve Him acceptably. Now it is man-centred, feebly mewling because somebody offended it by disagreeing with it on doctrine. And that right there is another symptom of this childishness in society – this notion that we shouldn’t talk about things that might “offend” or “create a stir”.\nA certain man once said this:\n“Suppose ye that I am come to give peace on earth? I tell you, Nay; but rather division:  For from henceforth there shall be five in one house divided, three against two, and two against three.  The father shall be divided against the son, and the son against the father; the mother against the daughter, and the daughter against the mother; the mother in law against her daughter in law, and the daughter in law against her mother in law.”\nIf you ever hear a pastor babbling on about peace and unity through religion, or worrying about offending the precious sensitivities of others, you can be quite confident that there’s little point in listening to him.  Whatever he’s teaching, it isn’t the Bible, which is filled with metaphor after metaphor referring to division, separation, and even winnowing.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-12-19T13:15:00+00:00"
}