{
  "url": "https://voxday.net/2008/12/01/celebrating-broken-mode/",
  "scraped_at": "2026-01-08T22:42:12.164865",
  "title": "Celebrating the broken model",
  "date_display": "December 1, 2008",
  "date_iso": "2008-12-01T12:05:00+00:00",
  "date_from_url": "2008-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m very enthusiastic about the Google Books project and <a href=\"http://www.nytimes.com/2008/11/30/opinion/30gleick.html?em\">some of the changes</a> that technology is bringing about.  Having witnessed the downside of the publishing industry from the non-bestselling author’s perspective, I’m delighted to see anything that reduces the power of the conventional publisher.  Especially if it means that there will be more than the same 12 books from the same 12 authors for sale at every bookstore.</p><blockquote><p>This means a new beginning — a vast trove of books restored to the marketplace. It also means that much of the book world is being upended before our eyes: the business of publishing, selling and distributing books; the role of libraries and bookstores; all uses of books for research, consultation, information storage; everything, in fact, but the plain act of reading a book from start to finish.</p><p>In bookstores, the trend for a decade or more has been toward shorter shelf life. Books have had to sell fast or move aside. Now even modest titles have been granted a gift of unlimited longevity.</p></blockquote><p>The worst thing about the current book industry is the shelf life issue.  There will always be the problem of letting people know that a book exists, but it will be good to see the stigma of self-publishing and on-demand publishing begin to fade away.  I’ve always thought it was incredibly stupid to assume a book is inherently better because someone else was willing to publish it; the existence of Harlequin romances should be enough to explode that notion.</p></div>",
  "content_text": "I’m very enthusiastic about the Google Books project and\nsome of the changes\nthat technology is bringing about.  Having witnessed the downside of the publishing industry from the non-bestselling author’s perspective, I’m delighted to see anything that reduces the power of the conventional publisher.  Especially if it means that there will be more than the same 12 books from the same 12 authors for sale at every bookstore.\nThis means a new beginning — a vast trove of books restored to the marketplace. It also means that much of the book world is being upended before our eyes: the business of publishing, selling and distributing books; the role of libraries and bookstores; all uses of books for research, consultation, information storage; everything, in fact, but the plain act of reading a book from start to finish.\nIn bookstores, the trend for a decade or more has been toward shorter shelf life. Books have had to sell fast or move aside. Now even modest titles have been granted a gift of unlimited longevity.\nThe worst thing about the current book industry is the shelf life issue.  There will always be the problem of letting people know that a book exists, but it will be good to see the stigma of self-publishing and on-demand publishing begin to fade away.  I’ve always thought it was incredibly stupid to assume a book is inherently better because someone else was willing to publish it; the existence of Harlequin romances should be enough to explode that notion.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-12-01T12:05:00+00:00"
}