{
  "url": "https://voxday.net/2008/12/31/college-sca/",
  "scraped_at": "2026-01-08T22:44:17.616922",
  "title": "The college scam",
  "date_display": "December 31, 2008",
  "date_iso": "2008-12-31T14:00:00+00:00",
  "date_from_url": "2008-12-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s <a href=\"http://www.latimes.com/business/la-fi-collegedebt27-2008dec27,0,4636992.column?track=rss\">actually worse</a> than you probably think:</p><blockquote><p>Hickey got caught in an increasingly common trap in the nation’s $85-billion student loan market. She borrowed heavily, presuming that all her debt was part of the federal student loan program.  But most of the money she borrowed was actually in private loans, the fastest-growing segment of the student loan market. Private loans have no relation to the federal loan program, with one exception: In many cases, they are offered by the same for-profit companies that provide federally funded student loans….  Whereas federally guaranteed loans have fixed interest rates, currently either 6% or 6.8%, private loans are more like credit card debt. Interest rates aren’t fixed and often run 15% or more, not counting fees.</p></blockquote><p>It might make sense to go $140,000 into debt if you’re getting a law degree from an Ivy League school  or a medical degree.  It probably isn’t worth it for a postgraduate science degree or an MBA, at least not in the present economic environment.  But how could any advisor possibly recommend that kind of debt for an <i>undergraduate photography</i> degree.  If one assumes that the degree is worth an additional $15k per year to the young woman, then it’s going to take about 14 years for her just to break even, assuming that she doesn’t get married, have kids, or spend any time unemployed.</p><p>The bizarre idea that the value of a college degree is incalculable is downright cretinous.  It’s important to recognize that such values are not only calculable, they are calculated in detail by the many institutions that sell college degrees and the various parasitical organizations that live off the proceeds of encouraging those transactions.  Unless your degree is going to lead directly to a six-digit salary, it’s almost definitely not worth going into debt to buy it.</p></div>",
  "content_text": "It’s\nactually worse\nthan you probably think:\nHickey got caught in an increasingly common trap in the nation’s $85-billion student loan market. She borrowed heavily, presuming that all her debt was part of the federal student loan program.  But most of the money she borrowed was actually in private loans, the fastest-growing segment of the student loan market. Private loans have no relation to the federal loan program, with one exception: In many cases, they are offered by the same for-profit companies that provide federally funded student loans….  Whereas federally guaranteed loans have fixed interest rates, currently either 6% or 6.8%, private loans are more like credit card debt. Interest rates aren’t fixed and often run 15% or more, not counting fees.\nIt might make sense to go $140,000 into debt if you’re getting a law degree from an Ivy League school  or a medical degree.  It probably isn’t worth it for a postgraduate science degree or an MBA, at least not in the present economic environment.  But how could any advisor possibly recommend that kind of debt for an\nundergraduate photography\ndegree.  If one assumes that the degree is worth an additional $15k per year to the young woman, then it’s going to take about 14 years for her just to break even, assuming that she doesn’t get married, have kids, or spend any time unemployed.\nThe bizarre idea that the value of a college degree is incalculable is downright cretinous.  It’s important to recognize that such values are not only calculable, they are calculated in detail by the many institutions that sell college degrees and the various parasitical organizations that live off the proceeds of encouraging those transactions.  Unless your degree is going to lead directly to a six-digit salary, it’s almost definitely not worth going into debt to buy it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-12-31T14:00:00+00:00"
}