{
  "url": "https://voxday.net/2008/12/17/destroying-village/",
  "scraped_at": "2026-01-08T22:43:14.699951",
  "title": "Destroying the village",
  "date_display": "December 17, 2008",
  "date_iso": "2008-12-17T10:01:00+00:00",
  "date_from_url": "2008-12-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In order <a href=\"http://www.breitbart.com/article.php?id=081216215816.8g97981o&amp;show_article=1\">to “save” it</a>:</p><blockquote><p>“I’ve abandoned free-market principles to save the free-market system,” Bush told CNN television, saying he had made the decision “to make sure the economy doesn’t collapse.”</p></blockquote><p>That’s almost as logically coherent as the insistence that temperatures dropping on a global scope <a href=\"http://apnews.myway.com/article/20081214/D952LKP00.html\">is evidence of global warming</a>.  I find myself beginning to be astonished, when suddenly I recall that most people truly are idiots.  Not one in a hundred individuals, be they godless or religious, collectivist or free market capitalist, ever stops to think about the obvious contradictions they demonstrate every day in their assumptions, beliefs, actions, and statements.</p></div>",
  "content_text": "In order\nto “save” it\n:\n“I’ve abandoned free-market principles to save the free-market system,” Bush told CNN television, saying he had made the decision “to make sure the economy doesn’t collapse.”\nThat’s almost as logically coherent as the insistence that temperatures dropping on a global scope\nis evidence of global warming\n.  I find myself beginning to be astonished, when suddenly I recall that most people truly are idiots.  Not one in a hundred individuals, be they godless or religious, collectivist or free market capitalist, ever stops to think about the obvious contradictions they demonstrate every day in their assumptions, beliefs, actions, and statements.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-12-17T10:01:00+00:00"
}