{
  "url": "https://voxday.net/2008/12/18/does-obama-own-his-own-house/",
  "scraped_at": "2026-01-08T22:43:20.257028",
  "title": "Does Obama own his own house?",
  "date_display": "December 18, 2008",
  "date_iso": "2008-12-18T11:00:00+00:00",
  "date_from_url": "2008-12-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I suppose <a href=\"http://ginacobb.typepad.com/gina_cobb/2008/12/obamas-house-is-owned-by-rezkos-lawyer.html\">this bizarre document</a> might explain why he was in such a hurry to move into Blair House:</p><blockquote><p>This is another scandal that just keeps growing.  When it first became known that Rezko helped Obama buy his house, Obama himself called the deal “boneheaded”.  Now things look much worse, because Rezko‘s lawyer owns the house.  His name is William Miceli, and Obama formerly worked for him.</p></blockquote><p>I have no idea if the Assessment Record for Cook County is, in fact, conclusive proof that William Miceli owns the property at 5046 Greenwood.  I don’t even know that 5046 Greenwood is Obama’s current address.  And I don’t understand how the Obamas could – or would – claim a mortgage deduction on a house they didn’t own.</p><p>So, perhaps there’s a perfectly reasonable explanation for all this.  But there certainly appears to be no shortage of corruption and scandal surrounding the president-elect.  Between the birth certificate, the Blago scandal, Rahm “<a href=\"http://www.suntimes.com/news/sneed/1333057,CST-NWS-SNEED16.article\">21 calls</a>” Emmanuel, the Rezko ties and now this house thing, one begins to wonder if the guy will even make it to Inaugural Day without getting arrested.</p></div>",
  "content_text": "I suppose\nthis bizarre document\nmight explain why he was in such a hurry to move into Blair House:\nThis is another scandal that just keeps growing.  When it first became known that Rezko helped Obama buy his house, Obama himself called the deal “boneheaded”.  Now things look much worse, because Rezko‘s lawyer owns the house.  His name is William Miceli, and Obama formerly worked for him.\nI have no idea if the Assessment Record for Cook County is, in fact, conclusive proof that William Miceli owns the property at 5046 Greenwood.  I don’t even know that 5046 Greenwood is Obama’s current address.  And I don’t understand how the Obamas could – or would – claim a mortgage deduction on a house they didn’t own.\nSo, perhaps there’s a perfectly reasonable explanation for all this.  But there certainly appears to be no shortage of corruption and scandal surrounding the president-elect.  Between the birth certificate, the Blago scandal, Rahm “\n21 calls\n” Emmanuel, the Rezko ties and now this house thing, one begins to wonder if the guy will even make it to Inaugural Day without getting arrested.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-12-18T11:00:00+00:00"
}