{
  "url": "https://voxday.net/2008/12/15/economics-and-failed-state/",
  "scraped_at": "2026-01-08T22:43:07.381070",
  "title": "Economics and the failed state",
  "date_display": "December 15, 2008",
  "date_iso": "2008-12-15T11:41:00+00:00",
  "date_from_url": "2008-12-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In <a href=\"http://www.worldnetdaily.com/index.php?pageId=83622\">my WND column today</a>, I addressed the observation that religious belief is to some extent inversely correlated with societal wealth.  The correlation isn’t perfect; the evangelical churches in very wealthy Naples, Florida were surprisingly large and well-attended and it is, after all, a religion-defined group that is the most wealthy in the world.  But across broad populations, it’s clear that people turn to religion in times of strife and contraction and away from it in times of peace and wealth.</p><p>The intellectually unsophisticated and logically incompetent, will naturally assume that this proves some sort of causal relationship between religion and these unpleasantries.  But this is backwards.  In much the same way that credit expansion in the boom causes the bust, religious revival in the bust helps bring about renewed growth.  And as the receding tide exposes financial frauds like Fannie Mae and Ponzi Madoff, it also exposes intellectual frauds like the secular progressive narrative and the neoconnery of global democracy.  Spengler, as usual, <a href=\"http://www.atimes.com/atimes/Middle_East/JL16Ak02.html\">does an excellent job</a> of showing how the global depression gives the lie to the democratic myth:</p><blockquote><p>The diplomatic strategy of the industrial nations now resembles a James Clavell potboiler, in which an earthquake interrupts a hopelessly immured plot. Moderate Islam was the El Dorado of the diplomatic consensus. It might have been the case that Pakistan could be tethered to Western interests, or that Iran could be engaged peacefully, or that Turkey would incubate a moderate form of Islam. I considered all of this delusional, but the truth is that we shall never know. The financial crisis will sort them out first.</p></blockquote><p>One key principle to keep in mind when considering these matters is that it is as foolish to apply the generic concept of religion to specific societal applications as it is to substitute the generic concept of science for specific applications of physics, economics, or biology.</p></div>",
  "content_text": "In\nmy WND column today\n, I addressed the observation that religious belief is to some extent inversely correlated with societal wealth.  The correlation isn’t perfect; the evangelical churches in very wealthy Naples, Florida were surprisingly large and well-attended and it is, after all, a religion-defined group that is the most wealthy in the world.  But across broad populations, it’s clear that people turn to religion in times of strife and contraction and away from it in times of peace and wealth.\nThe intellectually unsophisticated and logically incompetent, will naturally assume that this proves some sort of causal relationship between religion and these unpleasantries.  But this is backwards.  In much the same way that credit expansion in the boom causes the bust, religious revival in the bust helps bring about renewed growth.  And as the receding tide exposes financial frauds like Fannie Mae and Ponzi Madoff, it also exposes intellectual frauds like the secular progressive narrative and the neoconnery of global democracy.  Spengler, as usual,\ndoes an excellent job\nof showing how the global depression gives the lie to the democratic myth:\nThe diplomatic strategy of the industrial nations now resembles a James Clavell potboiler, in which an earthquake interrupts a hopelessly immured plot. Moderate Islam was the El Dorado of the diplomatic consensus. It might have been the case that Pakistan could be tethered to Western interests, or that Iran could be engaged peacefully, or that Turkey would incubate a moderate form of Islam. I considered all of this delusional, but the truth is that we shall never know. The financial crisis will sort them out first.\nOne key principle to keep in mind when considering these matters is that it is as foolish to apply the generic concept of religion to specific societal applications as it is to substitute the generic concept of science for specific applications of physics, economics, or biology.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-12-15T11:41:00+00:00"
}