{
  "url": "https://voxday.net/2008/12/16/ideal-reader/",
  "scraped_at": "2026-01-08T22:43:11.032285",
  "title": "An ideal reader",
  "date_display": "December 16, 2008",
  "date_iso": "2008-12-16T14:19:00+00:00",
  "date_from_url": "2008-12-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was delighted by <a href=\"http://www.amazon.com/review/R1C0TLN50UDY19/ref=cm_cr_rdp_perm\">this review of <i>Summa Elvetica</i></a> at Amazon.  It’s not often that an author is provided with proof that his book has found a reader who truly groks it to an extent very nearly approaching fullness:</p><blockquote><p>Comtemporary fantasy is so indebted to Lewis and Tolkien that its explicitly Christian origins should be openly, albeit perhaps grudgingly, accepted by all–the acolytes of Eddison and Peake are obviously on the wane. Looking over the comments I am pleased for they seem sincere and I concur with the essence of most all of them. Honestly, this Casuistry is hardly a pot-boiler. But with such a title did you really expect it to be?</p><p>I would like to humbly bring just one point to light: Expressed in the author’s note is the following: “This novel did not proceed according to plan.” We are told that the philosophical stances of the various and sundry medieval scholastics would be embodied within the tropes of conventional high fantasy “races” and that this dream-ship floundered for lack of a viable narrative structure! Can an author win kudos for mere ambition? How many of you out there can honestly claim: “Aw man, he stole MY idea!” The fact that the creative team at Marcher Lord felt confident they could in turn sell it, failed concept or not, to the masses shows an equal amount of chutzpah…</p><p>Complaints about a boring story-line, though true to a point, after all a tale made up of different character’s stories are the essence of medieval literature, are ultimately I think irrelevant as strange as that sounds for what this novel presents is a novel ambient feel: A hot and sour soup for your mind. And just like the eventual Borderlands series, the real point is the continual feeling–this is so cool–that you get from mixing the Catholic church with High Fantasy and all that each entails….  I would argue that this Casuistry is a mandatory read. For cracking minds wide open if nothing else.</p></blockquote><p>The reviewer quite clearly understands that SE is a failure, but is generous enough to view it as a noble failure and doesn’t think less of the book for that.  He recognizes how the book has no intention of abiding by the conventional fantasy tropes, or even the conventional genre structure.  Most importantly, he grasps that SE is fundamentally a book of ideas and impressions, not action.</p><p><i>Summa Elvetica</i> could have been a better book.  It really should have been a better book and I wish it had been a brilliant book.  That it isn’t is testimony to my deficiencies, more of focus and execution than capability and conception.  And yet, I’m happier with it than I am with any of my other books.  From a creative perspective, I find it more personally satisfying to aim high and fail than to aim low and succeed.</p></div>",
  "content_text": "I was delighted by\nthis review of\nSumma Elvetica\nat Amazon.  It’s not often that an author is provided with proof that his book has found a reader who truly groks it to an extent very nearly approaching fullness:\nComtemporary fantasy is so indebted to Lewis and Tolkien that its explicitly Christian origins should be openly, albeit perhaps grudgingly, accepted by all–the acolytes of Eddison and Peake are obviously on the wane. Looking over the comments I am pleased for they seem sincere and I concur with the essence of most all of them. Honestly, this Casuistry is hardly a pot-boiler. But with such a title did you really expect it to be?\nI would like to humbly bring just one point to light: Expressed in the author’s note is the following: “This novel did not proceed according to plan.” We are told that the philosophical stances of the various and sundry medieval scholastics would be embodied within the tropes of conventional high fantasy “races” and that this dream-ship floundered for lack of a viable narrative structure! Can an author win kudos for mere ambition? How many of you out there can honestly claim: “Aw man, he stole MY idea!” The fact that the creative team at Marcher Lord felt confident they could in turn sell it, failed concept or not, to the masses shows an equal amount of chutzpah…\nComplaints about a boring story-line, though true to a point, after all a tale made up of different character’s stories are the essence of medieval literature, are ultimately I think irrelevant as strange as that sounds for what this novel presents is a novel ambient feel: A hot and sour soup for your mind. And just like the eventual Borderlands series, the real point is the continual feeling–this is so cool–that you get from mixing the Catholic church with High Fantasy and all that each entails….  I would argue that this Casuistry is a mandatory read. For cracking minds wide open if nothing else.\nThe reviewer quite clearly understands that SE is a failure, but is generous enough to view it as a noble failure and doesn’t think less of the book for that.  He recognizes how the book has no intention of abiding by the conventional fantasy tropes, or even the conventional genre structure.  Most importantly, he grasps that SE is fundamentally a book of ideas and impressions, not action.\nSumma Elvetica\ncould have been a better book.  It really should have been a better book and I wish it had been a brilliant book.  That it isn’t is testimony to my deficiencies, more of focus and execution than capability and conception.  And yet, I’m happier with it than I am with any of my other books.  From a creative perspective, I find it more personally satisfying to aim high and fail than to aim low and succeed.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-12-16T14:19:00+00:00"
}