{
  "url": "https://voxday.net/2008/12/23/mailvox-dealing-with-atheis/",
  "scraped_at": "2026-01-08T22:43:43.732548",
  "title": "Mailvox: dealing with an atheist",
  "date_display": "December 23, 2008",
  "date_iso": "2008-12-23T16:30:00+00:00",
  "date_from_url": "2008-12-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AL asks for advice:</p><blockquote><p>Could you write an article on how to reach a friend who is an arrogant and dogmatic atheist? This guy’s thinking is seriously messed up, and he is living in a strange self-contradictory worldview that I don’t know how to chip away at. Part of me wants to walk away because he seems a lost cause, but I hope that God can do something radical.</p></blockquote><p>My recommendation would be to give him <a href=\"http://www.amazon.com/Irrational-Atheist-Dissecting-Trinity-Hitchens/dp/1933771364/ref=pd_sim_b_1\">a Christmas present</a>.  According to Amazon, there is still time to get it with the one-day shipping option.  Then, when you give it to him, tell him while you’re perfectly aware that he’ll disagree with it and think it’s all stupid and so forth, you’d like him, as a super-smart master of scientific and rational thought, to explain all of the numerous errors that must be contained within it to you.</p><p>It’s pretty unlikely that he’ll abandon either his arrogance or his atheist dogma, but he will almost certainly be a lot more circumspect about broadcasting that dogma in public once he’s been forced to privately acknowledge to himself – it usually seems to happen somewhere in the middle of Chapter IV – that he’s standing on an intellectual foundation of broken glass.  Perhaps you’ve noted that despite the way in which very few atheists will admit to even having heard of TIA, one simply doesn’t hear the “religion causes war” theme being spouted anywhere nearly as often as prior to the book’s release.</p></div>",
  "content_text": "AL asks for advice:\nCould you write an article on how to reach a friend who is an arrogant and dogmatic atheist? This guy’s thinking is seriously messed up, and he is living in a strange self-contradictory worldview that I don’t know how to chip away at. Part of me wants to walk away because he seems a lost cause, but I hope that God can do something radical.\nMy recommendation would be to give him\na Christmas present\n.  According to Amazon, there is still time to get it with the one-day shipping option.  Then, when you give it to him, tell him while you’re perfectly aware that he’ll disagree with it and think it’s all stupid and so forth, you’d like him, as a super-smart master of scientific and rational thought, to explain all of the numerous errors that must be contained within it to you.\nIt’s pretty unlikely that he’ll abandon either his arrogance or his atheist dogma, but he will almost certainly be a lot more circumspect about broadcasting that dogma in public once he’s been forced to privately acknowledge to himself – it usually seems to happen somewhere in the middle of Chapter IV – that he’s standing on an intellectual foundation of broken glass.  Perhaps you’ve noted that despite the way in which very few atheists will admit to even having heard of TIA, one simply doesn’t hear the “religion causes war” theme being spouted anywhere nearly as often as prior to the book’s release.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-12-23T16:30:00+00:00"
}