{
  "url": "https://voxday.net/2008/12/02/mailvox-idiotic-atheis/",
  "scraped_at": "2026-01-08T22:42:19.628811",
  "title": "Mailvox: the idiotic atheist",
  "date_display": "December 2, 2008",
  "date_iso": "2008-12-02T15:36:00+00:00",
  "date_from_url": "2008-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Today marks a remarkable new intellectual low for atheist argumentation.  An atheist doctor not only attempts to criticize TIA without, you know, actually bothering to read it, but he does so after reading no more than <i>the WND advertisement</i> for the book.  Imagine what a devastating rebuttal he could have constructed had he gone so far as to read the 2003 column of the same name!  No doubt he’ll be mystified as to why I roll my eyes at his claim about how he and other atheists have “carefully considered the evidence” for God’s existence… which is an intriguing claim anyhow considering that most atheists insist that <i>there is no evidence</i> for God’s existence:</p><blockquote><p>I noticed the attached summary of your book “The Irrational Atheist” on the website shop.wnd.com.  Have you considered that not a single one of these points provides any evidence either for or against the likelihood of god existing?  For example, let’s imagine that atheists are indeed 3.84 times more likely to be imprisoned.  Does this in any way heighten the likelihood that god exists?  You’re arguing for the morality of religion, not for the likelihood of its existence.  Remember, just because something is comforting and consoling doesn’t make it true.  Atheists have carefully analyzed the evidence, and have come to the only logical conclusion.  I assume you’ve read Dawkins’ “The God Delusion”?  It spoke to me more directly than my years and years spent in the Christian church, and years reading the historically inaccurate, inconsistency-ridden, nonsensical doctrines of the Bible.</p><p>Your point seems to be that religious people are more moral.  Dawkins tears this claim apart, and I can certainly vouch from personal experience that religious people are NOT more moral.  Do I really need the Bible to tell me not to kill and steal?  Of course not.</p><p>Oh- and by the way- this claim about imprisonment is, like most of your claims, pure propaganda.  Academic studies, again and again, find nearly every inmate to be religious!  Please research more extensively.  If you need help, I’ll be happy to point you to the appropriate academic literature.</p><p>Mr. Day, the Spanish Inquisition was established to maintain Catholic Orthodoxy!  Does the fact that it executed fewer people than the state of Texas (a very religious, red state, by the way) somehow make it better?  That claim takes the cake!  Can you please explain to me (or at least to yourself) how your statement regarding the inquisition in any way supports Christianity?</p><p>One final thought- If it is true that 93 percent of wars in human history had no relation to religion (also verifiably false) the remaining 7 percent did some serious damage, didn’t they?  Would you like a list?</p></blockquote><p>The godless doctor obviously hasn’t read the book.  After all, I not only know that none of those bullet points provides any such evidence, but I pointed out at the very start of TIA that the purpose of the book is not to prove that God exists, it is merely to point out the copious factual and logical errors made by the New Atheists, of which there are more than enough to fill a book.</p><p>Now, I readily agree that the failure of these numerous atheist arguments do not alter the probability of God’s existence, which is either so or not so regardless of the current species consensus or the rhetorical skill of either the believers or the doubters.  I don’t need to argue for the likelihood of religion’s existence – there is no shortage of historical evidence that religion does, in fact, exist despite the dearth of scientific evidence indicating this – and I am certainly not arguing for the morality of religion, only its relative social beneficence, even vis-a-vis science.  It is absolutely untrue that “atheists have carefully analyzed the evidence”; Dawkins has not, Hitchens has not, and their books demonstrate this very clearly.  In fact, I specifically point out the absurdity of this claim in TIA, given how they both assert that their atheism dates from their respective childhoods.  If the doctor is seriously impressed by TGD, then he’s probably a lot less intelligent than he thinks he is.</p><p>The godless doctor really needs to read TIA if he wishes to take part in the discourse unless he wishes to continue to humiliate himself.  Dawkins does not tear apart any claim to relative moralities, in fact, he even admits that he’s probably naive regarding the matter.  His argument for superiority of atheist behavior by Christian standards is based entirely upon the fallacious assumption that the degree of morality depends upon motivation.  As I noted in TIA, one cannot apply a gradient to a binary process; it is like attempting to ascertain which of two corpses is the less dead.  The doctor’s personal experience is anecdotal and irrelevant; it is probably based upon his incorrectly limited definition of an atheist to a self-identified atheist rather than an individual who does not believe in God.</p><p>The doctor is, unsurprisingly, completely incorrect about the prison populations.  It is not propaganda, it is based on the complete and detailed Welsh and English prison statistics.  Again, his argument is implicitly based on excluding the irreligious from atheism.</p><p>The question of whether the relative non-lethality of the Spanish Inquisition makes it “better” is irrelevant, the point is that the facts completely falsify the claims of the New Atheists, particularly Sam Harris, that it was one of the most tragic and lethal crimes in human history.  It was not.  As to the “religion causes war” argument, by all means, I should be very amused to see the doctor attempt to prove that more than 7 percent of all the wars in human history were caused by religion.  Sam Harris and numerous other atheists have already conceded this point to me, while Dawkins never even dared to state it outright, so he’s certainly welcome to make his best effort.</p><p>We shall all, I am sure, await it with interest.  And I’m curious… atheists, how seriously would you take a theist who attempted to criticize <i>The God Delusion</i> after reading nothing more than an advertisement for it?</p><p>UPDATE – the doctor writes back:</p><blockquote><p>I especially love your response to my question about the likelihood of god existing: “It does not alter the probability of God’s existence. I don’t need to argue for the likelihood of religion’s existence – it clearly exists.”  Religion and God, Mr. Day, are two different things.  Of course religion exists!</p><p>Also- how convenient that you use Welsh and English prison statistics, as the American ones obviously don’t work.  Also, I this ridiculous claim about 93 percent of wars not being caused by religion is so crazy I don’t know where to start.  An even higher percentage, you must admit, were not caused by atheism!  And: “[The Spanish Inquisiton] was one of the most reasonable institutions of its historical era.”  And I suppose the purification philosophy behind the Holocaust was reasonable too, eh?  And all the Salem witch trials?</p><p>Yes, I am impressed by TGD.  Perhaps I’m not as smart as I think I am. But what I do know is that I’m am one of the youngest ever Ph.D. graduates of an ivy league college, with an I.Q. that has been tested several times in the genius range.  Dawkins is an Oxford professor. We’re certainly capable of distinguishing between good logic and bad, and I wouldn’t be too quick to dismiss either of our intellects.</p></blockquote><p>Of course religion exists.  The reason I brought that up was to highlight the doctor’s sloppiness of phrasing, which just happens to coincide with his incredible attempt to offer criticism despite lacking any direct knowledge of the subject.</p><p>The American prison statistics are neither detailed nor comprehensive. The English and Welsh statistics not only cover the entire population, they go into unbelievable detail. If the doctor had read TIA, you wouldn’t even try to argue this point. Morever, he is clearly fai<br> ling to note the point that the irreligious are also atheists by any definition that does not depend upon self-description.</br></p><p>The reason he thinks the 93 percent statistic is “crazy” is because he clearly knows nothing about military history. I freely admit that a higher percentage of wars were not caused by atheism. That’s irrelevant because the issue at hand is if religion is or is not a primary causal factor of war. And it is not, as anyone who knows the first thing about either military history or military strategy is aware. TIA has an entire chapter devoted to pointing out that no military strategist has ever concerned himself with religion, with the very partial exception of the clueless would-be general Machiavelli.</p><p>The doctor shows himself to be a typical atheist when he attempts to dodge the subject of the Spanish Inquisition, which he himself brought up. He gets his ass kicked on the facts, so he naturally tries to change the subject rather than learn anything. The Holocaust and the Salem Witch Trials have no connection to the Spanish Inquisition.</p><p>If the doctor is genuinely impressed by TGD, than he is either ignorant on a wide range of subjects or the capacity for critical thinking has been educated out of him. Unsurprisingly, it didn’t take him long to hide behind his education, since academic degrees are the first refuge of the intellectually unaccomplished. It should embarrass him to have to defend Dawkins’s logical capacity by citing the man’s previous job title when there is such a large body of work that should suffice to do so.  Of course, his problem is that it proves precisely the opposite. Ironically, the doctor does precisely what Dawkins and the other New Atheists often do, in resorting to logic in defiance of the available empirical evidence.</p><p>The doctor doesn’t seem to understand the difference between lack of intelligence and lack of information. And his attempt to argue about a book he has not read indicates that he possesses the all-too-common foolishness of the intelligent academic, who illogically believes that intellectual capacity alway serves as an adequate substitute for information.  Now, let’s test his logic.  TIA has been through three printings and has been downloaded thousands of times. I have responded in detail to all of my substantive critics, most of whom have either conceded the argument to me or fallen silent.  Does it make sense, therefore, for him to believe he is saying anything I have not seen and successfully dealt with before?</p></div>",
  "content_text": "Today marks a remarkable new intellectual low for atheist argumentation.  An atheist doctor not only attempts to criticize TIA without, you know, actually bothering to read it, but he does so after reading no more than\nthe WND advertisement\nfor the book.  Imagine what a devastating rebuttal he could have constructed had he gone so far as to read the 2003 column of the same name!  No doubt he’ll be mystified as to why I roll my eyes at his claim about how he and other atheists have “carefully considered the evidence” for God’s existence… which is an intriguing claim anyhow considering that most atheists insist that\nthere is no evidence\nfor God’s existence:\nI noticed the attached summary of your book “The Irrational Atheist” on the website shop.wnd.com.  Have you considered that not a single one of these points provides any evidence either for or against the likelihood of god existing?  For example, let’s imagine that atheists are indeed 3.84 times more likely to be imprisoned.  Does this in any way heighten the likelihood that god exists?  You’re arguing for the morality of religion, not for the likelihood of its existence.  Remember, just because something is comforting and consoling doesn’t make it true.  Atheists have carefully analyzed the evidence, and have come to the only logical conclusion.  I assume you’ve read Dawkins’ “The God Delusion”?  It spoke to me more directly than my years and years spent in the Christian church, and years reading the historically inaccurate, inconsistency-ridden, nonsensical doctrines of the Bible.\nYour point seems to be that religious people are more moral.  Dawkins tears this claim apart, and I can certainly vouch from personal experience that religious people are NOT more moral.  Do I really need the Bible to tell me not to kill and steal?  Of course not.\nOh- and by the way- this claim about imprisonment is, like most of your claims, pure propaganda.  Academic studies, again and again, find nearly every inmate to be religious!  Please research more extensively.  If you need help, I’ll be happy to point you to the appropriate academic literature.\nMr. Day, the Spanish Inquisition was established to maintain Catholic Orthodoxy!  Does the fact that it executed fewer people than the state of Texas (a very religious, red state, by the way) somehow make it better?  That claim takes the cake!  Can you please explain to me (or at least to yourself) how your statement regarding the inquisition in any way supports Christianity?\nOne final thought- If it is true that 93 percent of wars in human history had no relation to religion (also verifiably false) the remaining 7 percent did some serious damage, didn’t they?  Would you like a list?\nThe godless doctor obviously hasn’t read the book.  After all, I not only know that none of those bullet points provides any such evidence, but I pointed out at the very start of TIA that the purpose of the book is not to prove that God exists, it is merely to point out the copious factual and logical errors made by the New Atheists, of which there are more than enough to fill a book.\nNow, I readily agree that the failure of these numerous atheist arguments do not alter the probability of God’s existence, which is either so or not so regardless of the current species consensus or the rhetorical skill of either the believers or the doubters.  I don’t need to argue for the likelihood of religion’s existence – there is no shortage of historical evidence that religion does, in fact, exist despite the dearth of scientific evidence indicating this – and I am certainly not arguing for the morality of religion, only its relative social beneficence, even vis-a-vis science.  It is absolutely untrue that “atheists have carefully analyzed the evidence”; Dawkins has not, Hitchens has not, and their books demonstrate this very clearly.  In fact, I specifically point out the absurdity of this claim in TIA, given how they both assert that their atheism dates from their respective childhoods.  If the doctor is seriously impressed by TGD, then he’s probably a lot less intelligent than he thinks he is.\nThe godless doctor really needs to read TIA if he wishes to take part in the discourse unless he wishes to continue to humiliate himself.  Dawkins does not tear apart any claim to relative moralities, in fact, he even admits that he’s probably naive regarding the matter.  His argument for superiority of atheist behavior by Christian standards is based entirely upon the fallacious assumption that the degree of morality depends upon motivation.  As I noted in TIA, one cannot apply a gradient to a binary process; it is like attempting to ascertain which of two corpses is the less dead.  The doctor’s personal experience is anecdotal and irrelevant; it is probably based upon his incorrectly limited definition of an atheist to a self-identified atheist rather than an individual who does not believe in God.\nThe doctor is, unsurprisingly, completely incorrect about the prison populations.  It is not propaganda, it is based on the complete and detailed Welsh and English prison statistics.  Again, his argument is implicitly based on excluding the irreligious from atheism.\nThe question of whether the relative non-lethality of the Spanish Inquisition makes it “better” is irrelevant, the point is that the facts completely falsify the claims of the New Atheists, particularly Sam Harris, that it was one of the most tragic and lethal crimes in human history.  It was not.  As to the “religion causes war” argument, by all means, I should be very amused to see the doctor attempt to prove that more than 7 percent of all the wars in human history were caused by religion.  Sam Harris and numerous other atheists have already conceded this point to me, while Dawkins never even dared to state it outright, so he’s certainly welcome to make his best effort.\nWe shall all, I am sure, await it with interest.  And I’m curious… atheists, how seriously would you take a theist who attempted to criticize\nThe God Delusion\nafter reading nothing more than an advertisement for it?\nUPDATE – the doctor writes back:\nI especially love your response to my question about the likelihood of god existing: “It does not alter the probability of God’s existence. I don’t need to argue for the likelihood of religion’s existence – it clearly exists.”  Religion and God, Mr. Day, are two different things.  Of course religion exists!\nAlso- how convenient that you use Welsh and English prison statistics, as the American ones obviously don’t work.  Also, I this ridiculous claim about 93 percent of wars not being caused by religion is so crazy I don’t know where to start.  An even higher percentage, you must admit, were not caused by atheism!  And: “[The Spanish Inquisiton] was one of the most reasonable institutions of its historical era.”  And I suppose the purification philosophy behind the Holocaust was reasonable too, eh?  And all the Salem witch trials?\nYes, I am impressed by TGD.  Perhaps I’m not as smart as I think I am. But what I do know is that I’m am one of the youngest ever Ph.D. graduates of an ivy league college, with an I.Q. that has been tested several times in the genius range.  Dawkins is an Oxford professor. We’re certainly capable of distinguishing between good logic and bad, and I wouldn’t be too quick to dismiss either of our intellects.\nOf course religion exists.  The reason I brought that up was to highlight the doctor’s sloppiness of phrasing, which just happens to coincide with his incredible attempt to offer criticism despite lacking any direct knowledge of the subject.\nThe American prison statistics are neither detailed nor comprehensive. The English and Welsh statistics not only cover the entire population, they go into unbelievable detail. If the doctor had read TIA, you wouldn’t even try to argue this point. Morever, he is clearly fai\nling to note the point that the irreligious are also atheists by any definition that does not depend upon self-description.\nThe reason he thinks the 93 percent statistic is “crazy” is because he clearly knows nothing about military history. I freely admit that a higher percentage of wars were not caused by atheism. That’s irrelevant because the issue at hand is if religion is or is not a primary causal factor of war. And it is not, as anyone who knows the first thing about either military history or military strategy is aware. TIA has an entire chapter devoted to pointing out that no military strategist has ever concerned himself with religion, with the very partial exception of the clueless would-be general Machiavelli.\nThe doctor shows himself to be a typical atheist when he attempts to dodge the subject of the Spanish Inquisition, which he himself brought up. He gets his ass kicked on the facts, so he naturally tries to change the subject rather than learn anything. The Holocaust and the Salem Witch Trials have no connection to the Spanish Inquisition.\nIf the doctor is genuinely impressed by TGD, than he is either ignorant on a wide range of subjects or the capacity for critical thinking has been educated out of him. Unsurprisingly, it didn’t take him long to hide behind his education, since academic degrees are the first refuge of the intellectually unaccomplished. It should embarrass him to have to defend Dawkins’s logical capacity by citing the man’s previous job title when there is such a large body of work that should suffice to do so.  Of course, his problem is that it proves precisely the opposite. Ironically, the doctor does precisely what Dawkins and the other New Atheists often do, in resorting to logic in defiance of the available empirical evidence.\nThe doctor doesn’t seem to understand the difference between lack of intelligence and lack of information. And his attempt to argue about a book he has not read indicates that he possesses the all-too-common foolishness of the intelligent academic, who illogically believes that intellectual capacity alway serves as an adequate substitute for information.  Now, let’s test his logic.  TIA has been through three printings and has been downloaded thousands of times. I have responded in detail to all of my substantive critics, most of whom have either conceded the argument to me or fallen silent.  Does it make sense, therefore, for him to believe he is saying anything I have not seen and successfully dealt with before?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-12-02T15:36:00+00:00"
}