{
  "url": "https://voxday.net/2008/12/25/merry-christmas-8/",
  "scraped_at": "2026-01-08T22:43:52.269143",
  "title": "Merry Christmas",
  "date_display": "December 25, 2008",
  "date_iso": "2008-12-25T10:09:00+00:00",
  "date_from_url": "2008-12-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Late last night, I achieved something I had hitherto believed unthinkable.  I actually managed to wrap a present in such a manner that the seasonal pattern on the wrapping paper aligned perfectly.  The Christmas tree remained a flawless Christmas tree, the teddy bear remained a perfect teddy bear, and the candy cane remained an unbroken candy cane.  I was surprised to experience a brief moment of melancholy, as this uncharacteristically perfect present reminded me of my father, who has always been a wrapper of presents <i style=\"color: rgb(0, 102, 0);\">par extraordinaire</i>.</p><p>But it quickly passed.  For Christmas is not a time for regrets, it is instead a day filled with all the joy inherent in celebrating the birth of Man’s Redeemer.  The story of Christmas told in the Gospels is a dark one filled with oppression, cruelty, jealousy, and murder, and yet it is a strangely uplifting one.  For the birth of the child is the birth of a new hope, and the light on the distant horizon is the Light of all the World.</p><p><i style=\"color: rgb(204, 0, 0);\">Et Verbum caro factum est et habitavit in nobis; et vidimus gloriam eius, gloriam quasi Unigeniti a Patre, penum gratiae et veritas.</i></p><p>What I wish for all of you this Christmas is that no matter what you may happen to believe about life, the universe, and everything, today you would know at least one moment of that perfect and incredulous joy that one sees on a young child’s face upon catching sight of the Christmas tree and realizing that Santa Claus really did pay a visit the night before.</p><p>Merry Christmas, everyone!</p></div>",
  "content_text": "Late last night, I achieved something I had hitherto believed unthinkable.  I actually managed to wrap a present in such a manner that the seasonal pattern on the wrapping paper aligned perfectly.  The Christmas tree remained a flawless Christmas tree, the teddy bear remained a perfect teddy bear, and the candy cane remained an unbroken candy cane.  I was surprised to experience a brief moment of melancholy, as this uncharacteristically perfect present reminded me of my father, who has always been a wrapper of presents\npar extraordinaire\n.\nBut it quickly passed.  For Christmas is not a time for regrets, it is instead a day filled with all the joy inherent in celebrating the birth of Man’s Redeemer.  The story of Christmas told in the Gospels is a dark one filled with oppression, cruelty, jealousy, and murder, and yet it is a strangely uplifting one.  For the birth of the child is the birth of a new hope, and the light on the distant horizon is the Light of all the World.\nEt Verbum caro factum est et habitavit in nobis; et vidimus gloriam eius, gloriam quasi Unigeniti a Patre, penum gratiae et veritas.\nWhat I wish for all of you this Christmas is that no matter what you may happen to believe about life, the universe, and everything, today you would know at least one moment of that perfect and incredulous joy that one sees on a young child’s face upon catching sight of the Christmas tree and realizing that Santa Claus really did pay a visit the night before.\nMerry Christmas, everyone!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-12-25T10:09:00+00:00"
}