{
  "url": "https://voxday.net/2008/12/26/next-marriage-cause/",
  "scraped_at": "2026-01-08T22:43:54.092975",
  "title": "The next marriage cause",
  "date_display": "December 26, 2008",
  "date_iso": "2008-12-26T15:13:00+00:00",
  "date_from_url": "2008-12-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Actually, it occurs to me that <a href=\"http://blog.wired.com/wiredscience/2008/12/cousinmarriage.html\">this news </a>may be of most interest to young women who blithely assume that the extension of the child-bearing years courtesy of modern medical technology comes without problematic consequences:</p><blockquote><p>In an age of sexual liberation, marriage between cousins remains taboo, at least in the United States — and from a scientific perspective, laws against the unions are a socially legitimized form of genetic and sexual discrimination. That argument, raised Monday in an editorial in <em>Public Library of Science Biology</em>, may turn the stomachs of people raised to disapprove of any form of incest. But dispassioned analysis suggests that cousin marriage is no more troubling than childbearing by middle-aged women.</p></blockquote><p>I have the impression that many twenty-something women might feel just a little differently about planning to put off marriage and children if they knew that their plans involved the birth-defect equivalent of MARRYING THEIR COUSIN, however low the risks might be.  Anyhow, it should be amusing to learn how the homogamy advocates will defend their lack of support for cousin marriage… and even more amusing when they advocate both.</p></div>",
  "content_text": "Actually, it occurs to me that\nthis news\nmay be of most interest to young women who blithely assume that the extension of the child-bearing years courtesy of modern medical technology comes without problematic consequences:\nIn an age of sexual liberation, marriage between cousins remains taboo, at least in the United States — and from a scientific perspective, laws against the unions are a socially legitimized form of genetic and sexual discrimination. That argument, raised Monday in an editorial in\nPublic Library of Science Biology\n, may turn the stomachs of people raised to disapprove of any form of incest. But dispassioned analysis suggests that cousin marriage is no more troubling than childbearing by middle-aged women.\nI have the impression that many twenty-something women might feel just a little differently about planning to put off marriage and children if they knew that their plans involved the birth-defect equivalent of MARRYING THEIR COUSIN, however low the risks might be.  Anyhow, it should be amusing to learn how the homogamy advocates will defend their lack of support for cousin marriage… and even more amusing when they advocate both.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-12-26T15:13:00+00:00"
}