{
  "url": "https://voxday.net/2008/12/12/no-bite-no-bark/",
  "scraped_at": "2026-01-08T22:43:00.414445",
  "title": "No bite, no bark",
  "date_display": "December 12, 2008",
  "date_iso": "2008-12-12T19:45:00+00:00",
  "date_from_url": "2008-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rahm Emanuel <a href=\"http://www.timesonline.co.uk/tol/news/world/us_and_americas/article5332897.ece\">doesn’t bark so loudly</a> these days.  He’s just a average guy, doing average guy things.  Why can’t they leave him alone, the poor fellow is just busy trying to be a father:</p><blockquote><p>Rahm Emanuel, Mr Obama’s new chief of staff, and Jesse Jackson Jr, the co-chairman of his presidential campaign, both faced new revelations about their possible involvement in the scandal….  The TV station said Mr Emanuel had “multiple conversations” with Mr Blagojevich, who is accused of trying to “sell” the open Senate seat for a cabinet post or lucrative top foundation job, and his chief of staff.</p></blockquote><p>As I expected, the Obama administration is going to be extremely entertaining, a veritable parody of a presidency.  Which, coming after the joint disasters of Clinton and Bush, is somewhat impressive.  I mean, the guy <i>hasn’t even taken office yet</i> and he’s already enmeshed in scandal.</p><p>I wonder how many Obama enthusiasts in the media are beginning to regret their “cover for the candidate” campaign already?</p></div>",
  "content_text": "Rahm Emanuel\ndoesn’t bark so loudly\nthese days.  He’s just a average guy, doing average guy things.  Why can’t they leave him alone, the poor fellow is just busy trying to be a father:\nRahm Emanuel, Mr Obama’s new chief of staff, and Jesse Jackson Jr, the co-chairman of his presidential campaign, both faced new revelations about their possible involvement in the scandal….  The TV station said Mr Emanuel had “multiple conversations” with Mr Blagojevich, who is accused of trying to “sell” the open Senate seat for a cabinet post or lucrative top foundation job, and his chief of staff.\nAs I expected, the Obama administration is going to be extremely entertaining, a veritable parody of a presidency.  Which, coming after the joint disasters of Clinton and Bush, is somewhat impressive.  I mean, the guy\nhasn’t even taken office yet\nand he’s already enmeshed in scandal.\nI wonder how many Obama enthusiasts in the media are beginning to regret their “cover for the candidate” campaign already?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-12-12T19:45:00+00:00"
}