{
  "url": "https://voxday.net/2008/12/09/of-silk-and-sows-ears/",
  "scraped_at": "2026-01-08T22:42:49.420574",
  "title": "Of silk and sow’s ears",
  "date_display": "December 9, 2008",
  "date_iso": "2008-12-09T11:24:00+00:00",
  "date_from_url": "2008-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Austrian economics lessons <a href=\"http://www.breitbart.com/article.php?id=D94UMA800&amp;show_article=1\">taught in real time</a>:</p><blockquote><p>More than half of all homeowners who had their loans modified to make the payments more affordable in the first half of the year are already in default again, banking regulators said Monday.</p></blockquote><p>This nicely illustrates the insanity of trying to prop up the credit expansion-caused malinvestments when they go bad.  Because they are not fundamentally sound, injecting more liquidity into them will only delay the inevitable default.  The important thing to understand is this: <i>the default is not the problem!</i> It is merely the obvious consequence and the actual problem was the boom-time decision to make the bad investments.  Corrections and defaults must be permitted to take place since the alternative is not no correction or default, but larger corrections and more costly defaults occurring later.</p><p>One can very seldom make a bad investment sound by simply pouring more money into it.</p></div>",
  "content_text": "Austrian economics lessons\ntaught in real time\n:\nMore than half of all homeowners who had their loans modified to make the payments more affordable in the first half of the year are already in default again, banking regulators said Monday.\nThis nicely illustrates the insanity of trying to prop up the credit expansion-caused malinvestments when they go bad.  Because they are not fundamentally sound, injecting more liquidity into them will only delay the inevitable default.  The important thing to understand is this:\nthe default is not the problem!\nIt is merely the obvious consequence and the actual problem was the boom-time decision to make the bad investments.  Corrections and defaults must be permitted to take place since the alternative is not no correction or default, but larger corrections and more costly defaults occurring later.\nOne can very seldom make a bad investment sound by simply pouring more money into it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-12-09T11:24:00+00:00"
}