{
  "url": "https://voxday.net/2008/12/18/supposedly_18/",
  "scraped_at": "2026-01-08T22:43:22.071331",
  "title": "Supposedly?",
  "date_display": "December 18, 2008",
  "date_iso": "2008-12-18T16:42:00+00:00",
  "date_from_url": "2008-12-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While I understand <a href=\"http://www.worldnetdaily.com/index.php?fa=PAGE.view&amp;pageId=83640\">Joseph Farah’s annoyance with Wikipedia</a>, I’m not that concerned about it.  Anyone who actually uses the online encyclopedia knows that it’s not reliable when it comes to the discussion of any controversial figure, especially anyone whose views aren’t in accordance with the idiot college lefties who defensively squat on every entry of interest to them.</p><p>There’s no shortage of errors in the entry about me, but I think the most egregious may be the recent modification which states I am “<a href=\"http://en.wikipedia.org/wiki/Vox_Day\">supposedly a libertarian</a>“.</p><p>Now, consider the facts.  I oppose the drug war, support the legalization of all drugs, support legal prostitution, assert the right to absolute self-title, and repeatedly write about the evils of central government and advocate stringent limitations on its power.  The only two formal positions of the Libertarian Party with which I take issue are abortion and open immigration, both of which can be very well justified on pure libertarian grounds, (the former), and practical libertarian grounds, (the latter).  In my pragmatic preference for universal democracy over limited representative democracy, I’m more genuinely democratic than most despite my skepticism about the societal viability of women’s, children’s and foreigner’s suffrage.  I am demonstrably more of a pure libertarian than most of the quasi-Republicans and libertine Democrats who attempt to appropriate the name.</p><p>In short, if I’m not actually a libertarian, then who is?</p></div>",
  "content_text": "While I understand\nJoseph Farah’s annoyance with Wikipedia\n, I’m not that concerned about it.  Anyone who actually uses the online encyclopedia knows that it’s not reliable when it comes to the discussion of any controversial figure, especially anyone whose views aren’t in accordance with the idiot college lefties who defensively squat on every entry of interest to them.\nThere’s no shortage of errors in the entry about me, but I think the most egregious may be the recent modification which states I am “\nsupposedly a libertarian\n“.\nNow, consider the facts.  I oppose the drug war, support the legalization of all drugs, support legal prostitution, assert the right to absolute self-title, and repeatedly write about the evils of central government and advocate stringent limitations on its power.  The only two formal positions of the Libertarian Party with which I take issue are abortion and open immigration, both of which can be very well justified on pure libertarian grounds, (the former), and practical libertarian grounds, (the latter).  In my pragmatic preference for universal democracy over limited representative democracy, I’m more genuinely democratic than most despite my skepticism about the societal viability of women’s, children’s and foreigner’s suffrage.  I am demonstrably more of a pure libertarian than most of the quasi-Republicans and libertine Democrats who attempt to appropriate the name.\nIn short, if I’m not actually a libertarian, then who is?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-12-18T16:42:00+00:00"
}