{
  "url": "https://voxday.net/2008/12/13/technical-difficulties/",
  "scraped_at": "2026-01-08T22:43:02.236754",
  "title": "Technical difficulties",
  "date_display": "December 13, 2008",
  "date_iso": "2008-12-13T19:02:00+00:00",
  "date_from_url": "2008-12-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently there won’t be a quiz today either, although this time it’s not my fault.  ProProfs is down, presumably for maintenance, so it’s not possible to take the test on chapter six.  If it’s not up tomorrow, we’ll double up on chapters 6 and 7 next Saturday.</p><p>In the meantime, think about the differences, if any, between the giant Ponzi scheme <a href=\"http://finance.yahoo.com/news/Madoff-alleged-50-billion-rb-13819411.html\">run by Bernard Madoff</a> and the everyday business of fractional reserve banking.  Was Madoff actually doing anything but acting as a virtual bank?  He may not have been able to satisfy his full obligations to all of his investors at any given time, but then, what bank can do the same for its depositors?</p><p>Interesting, too, to observe that the Elliott Wave people predicted there would be bigger frauds being revealed in Wave Three than in Wave One.  What’s next, one wonders?</p></div>",
  "content_text": "Apparently there won’t be a quiz today either, although this time it’s not my fault.  ProProfs is down, presumably for maintenance, so it’s not possible to take the test on chapter six.  If it’s not up tomorrow, we’ll double up on chapters 6 and 7 next Saturday.\nIn the meantime, think about the differences, if any, between the giant Ponzi scheme\nrun by Bernard Madoff\nand the everyday business of fractional reserve banking.  Was Madoff actually doing anything but acting as a virtual bank?  He may not have been able to satisfy his full obligations to all of his investors at any given time, but then, what bank can do the same for its depositors?\nInteresting, too, to observe that the Elliott Wave people predicted there would be bigger frauds being revealed in Wave Three than in Wave One.  What’s next, one wonders?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2008-12-13T19:02:00+00:00"
}