{
  "url": "https://voxday.net/2014/07/18/18000-and-h1b/",
  "scraped_at": "2025-12-16T12:21:06.257547",
  "title": "18,000 and H1B",
  "date_display": "July 18, 2014",
  "date_iso": "2014-07-18T10:12:00+00:00",
  "date_from_url": "2014-07-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.reuters.com/article/2014/07/17/us-microsoft-employment-idUSKBN0FM1EH20140717\"><b>Item 1</b></a>: <i>Microsoft Chief<br> Executive Officer Satya Nadella kicked off one of the largest layoffs in<br> tech history on Thursday, hoping to reshape the aging PC industry titan<br> into a nimbler rival to Apple and Google, and jolt a culture at the<br> company that is used to protecting its existing Windows and Office<br> franchises.<br> Microsoft Corp said on Thursday<br> it will slash up to 18,000 jobs, or 14 percent of its workforce, over<br> the next 12 months as it almost halves the size of its newly acquired<br> Nokia phone business and tries to become a cloud-computing and<br> mobile-friendly software company. The<br> larger-than-expected cuts are the deepest in the software giant’s<br> 39-year history and come five months into Nadella’s tenure.</br></br></br></br></br></br></br></br></br></br></br></br></i></p><p><a href=\"http://www.npr.org/templates/story/story.php?storyId=88154016\"><b>Item 2</b></a>: <i>Bill Gates says the United States’ position as the global leader in innovation is at risk. The Microsoft chairman says there is a deficit of Americans with computer-science degrees, and he wants the government to make it easier for Microsoft to hire foreign-born workers. Gates testified before the House Committee on Science Technology on Wednesday about what he sees as a need to liberalize rules for H1-B visas for skilled foreign workers. Currently, Congress has set an annual limit on H1-Bs at 65,000, with an additional 20,000 earmarked for foreign students with advanced degrees from U.S. universities.</i></p><p><a href=\"http://www.cnet.com/news/zuckerberg-backs-u-s-immigration-reforms/\"><b>Item 3</b></a>: <i>Immigration and visa reform are necessary to boost the U.S. economy and job market, Facebook CEO Mark Zuckerberg said Monday. Disputing the idea that Silicon Valley execs are simply trying to secure a higher number of H1B visas for their own companies, Zuckerberg told attendees at the event: “This is something that we believe is really important for the future of our country — and for us to do what’s right.” </i></p><p>It’s not terribly difficult to understand why nations experiencing economic stress are so often inclined to resort to nationalizing corporations, not when the corporate executives are so blatantly acting against the interests of the citizenry.</p></div>",
  "content_text": "Item 1\n:\nMicrosoft Chief\nExecutive Officer Satya Nadella kicked off one of the largest layoffs in\ntech history on Thursday, hoping to reshape the aging PC industry titan\ninto a nimbler rival to Apple and Google, and jolt a culture at the\ncompany that is used to protecting its existing Windows and Office\nfranchises.\nMicrosoft Corp said on Thursday\nit will slash up to 18,000 jobs, or 14 percent of its workforce, over\nthe next 12 months as it almost halves the size of its newly acquired\nNokia phone business and tries to become a cloud-computing and\nmobile-friendly software company. The\nlarger-than-expected cuts are the deepest in the software giant’s\n39-year history and come five months into Nadella’s tenure.\nItem 2\n:\nBill Gates says the United States’ position as the global leader in innovation is at risk. The Microsoft chairman says there is a deficit of Americans with computer-science degrees, and he wants the government to make it easier for Microsoft to hire foreign-born workers. Gates testified before the House Committee on Science Technology on Wednesday about what he sees as a need to liberalize rules for H1-B visas for skilled foreign workers. Currently, Congress has set an annual limit on H1-Bs at 65,000, with an additional 20,000 earmarked for foreign students with advanced degrees from U.S. universities.\nItem 3\n:\nImmigration and visa reform are necessary to boost the U.S. economy and job market, Facebook CEO Mark Zuckerberg said Monday. Disputing the idea that Silicon Valley execs are simply trying to secure a higher number of H1B visas for their own companies, Zuckerberg told attendees at the event: “This is something that we believe is really important for the future of our country — and for us to do what’s right.”\nIt’s not terribly difficult to understand why nations experiencing economic stress are so often inclined to resort to nationalizing corporations, not when the corporate executives are so blatantly acting against the interests of the citizenry.",
  "tags": [
    "corpocracy",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-18T09:12:00+00:00"
}