{
  "url": "https://voxday.net/2014/07/13/a-classic-left-wing-refutation/",
  "scraped_at": "2025-12-16T12:20:32.878462",
  "title": "A classic left-wing “refutation”",
  "date_display": "July 13, 2014",
  "date_iso": "2014-07-13T09:20:00+00:00",
  "date_from_url": "2014-07-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>How do you know that Nicholas Wade’s A TROUBLESOME INHERITANCE is worth reading? Because the New York Times has published <a href=\"http://www.nytimes.com/2014/07/13/books/review/a-troublesome-inheritance-and-inheritance.html?_r=0\">a second <strike>hit-piece</strike>review</a>. And it is a classic of its type, utilizing techniques that you see repeatedly here and elsewhere when left-wingers are attempting to cast doubt on something they cannot reasonably rebut.</p><p>First, David Dobbs resorts to the popular “Disproof by Citation” tactic. One often sees this used in reference to scientific studies (in particular John Lott’s landmark study on gun crime), in which the left-wing critic will claim, almost always falsely, that some hitherto unknown figure has “demolished” or “destroyed” or “refuted” or “totally disproven” the “debunked” piece being cited.</p><blockquote class=\"tr_bq\"><p> In his 2007 book “A Farewell to Alms,” the economic historian Gregory Clark argued that the English came to rule the world largely because their rich outbred their poor, and thus embedded their superior genes and values throughout the nation. In her comprehensive takedown, the historian Deirdre N. McCloskey noted that Clark’s idea was a “bold hypothesis, and was bold when first articulated by social Darwinists such as Charles Davenport and Francis Galton in the century before last.” Indeed, over the past 150 years, various white Western scientists and writers have repeatedly offered biological explanations for Caucasian superiority. They have repeatedly failed because, as Mc­Closkey noted, none ever mounted a credible quantitative argument.</p></blockquote><p>Note the phrase “comprehensive takedown”. That is the first red flag. And yet, even without reading McCloskey, without even reading Clark, we can safely assume that both she, and Dobbs, are not being honest because we know that a) Clark’s argument is not the same as those made by the social Darwinists, b) Clark’s argument only refers to the English and not other white nations, c) the only part of the “comprehensive takedown” actually cited simply called Clark’s idea a “bold hypothesis” before going off onto a tangent attacking other, unrelated parties. Furthermore, Clark does present a credible quantitative argument, one involving “the real day wages of English farm laborers from 1200 to 1800”, “homicide rates”, and other obviously quantitative factors. As Wade describes it:</p><p><i>“Clark has documented four behaviors that steadily changed in the English population between 1200 and 1800, as well as a plausible mechanism of change. The four behaviors are those of interpersonal violence, literacy, the propensity to save and the propensity to work.”</i></p><p>Now, how can you reconcile McCloskey’s claim that Clark did not mount a credible quantitative argument with the observable fact that this is exactly what Clark has done, complete with graphs and explanations of exactly how he is quantifying the four behaviors? By reading more carefully and realizing that McCloskey isn’t actually addressing Clark, but rather Davenport, Galton, and others from the pre-quantification era of social science. Dobbs knows that most people don’t read carefully, they only skim to see what they want to see. He’s not actually lying about anything except for the assertion – which is a subjective matter – of the “comprehensive takedown”, but he deceives the common reader into thinking that his assertion is supported.  <i></i></p><p>Second, Dobbs erects a strawman and burns it. Third, he resorts to outright lying.</p><blockquote class=\"tr_bq\"><p> And despite his protests to the contrary, Wade often sounds as if he sees the rise of the West as a sort of stable endpoint of human history and evolution — as if, having considered 5,000 years in which history has successively blessed the Middle East, the Far East and the Ottoman Empire, he observes the West’s current run of glory and thinks the pendulum has stilled.</p><p>If Wade could point to genes that give races distinctive social behaviors, we might overlook such shortcomings. But he cannot.</p></blockquote><p>So, Wade specifically and repeatedly states he is not doing what Dobbs thinks he is doing, which Dobbs then uses as justification to reach a conclusion that manifestly and absurdly contradicts everything Wade is saying. Wade never claims that “the pendulum has stilled”, quite to the contrary, his ENTIRE ARGUMENT depends upon the idea that the pendulum never stops swinging. And Wade does point to genes, specific genes, including the MAO-A gene, the SLC24A5 gene, the ABCC11 gene, and the EDAR gene that give races distinctive features as well as, in the case of the MAO-A gene, observably affecting their social behaviors.</p><p>Fourth and finally, Dobbs resorts to Vox’s Second Law of Critical Dynamics. <i>If I can imagine it, it must be assumed true. If you can’t conclusively prove it, it must be assumed false.</i></p><p>Learn to recognize these deplorable rhetorical tactics. And never, ever, take a left-winger’s word for anything. You’ll be surprised how often they blatantly lie in the hopes that you won’t bother doing the research necessary to call them out on it.<i> </i></p></div>",
  "content_text": "How do you know that Nicholas Wade’s A TROUBLESOME INHERITANCE is worth reading? Because the New York Times has published\na second\nhit-piece\nreview\n. And it is a classic of its type, utilizing techniques that you see repeatedly here and elsewhere when left-wingers are attempting to cast doubt on something they cannot reasonably rebut.\nFirst, David Dobbs resorts to the popular “Disproof by Citation” tactic. One often sees this used in reference to scientific studies (in particular John Lott’s landmark study on gun crime), in which the left-wing critic will claim, almost always falsely, that some hitherto unknown figure has “demolished” or “destroyed” or “refuted” or “totally disproven” the “debunked” piece being cited.\nIn his 2007 book “A Farewell to Alms,” the economic historian Gregory Clark argued that the English came to rule the world largely because their rich outbred their poor, and thus embedded their superior genes and values throughout the nation. In her comprehensive takedown, the historian Deirdre N. McCloskey noted that Clark’s idea was a “bold hypothesis, and was bold when first articulated by social Darwinists such as Charles Davenport and Francis Galton in the century before last.” Indeed, over the past 150 years, various white Western scientists and writers have repeatedly offered biological explanations for Caucasian superiority. They have repeatedly failed because, as Mc­Closkey noted, none ever mounted a credible quantitative argument.\nNote the phrase “comprehensive takedown”. That is the first red flag. And yet, even without reading McCloskey, without even reading Clark, we can safely assume that both she, and Dobbs, are not being honest because we know that a) Clark’s argument is not the same as those made by the social Darwinists, b) Clark’s argument only refers to the English and not other white nations, c) the only part of the “comprehensive takedown” actually cited simply called Clark’s idea a “bold hypothesis” before going off onto a tangent attacking other, unrelated parties. Furthermore, Clark does present a credible quantitative argument, one involving “the real day wages of English farm laborers from 1200 to 1800”, “homicide rates”, and other obviously quantitative factors. As Wade describes it:\n“Clark has documented four behaviors that steadily changed in the English population between 1200 and 1800, as well as a plausible mechanism of change. The four behaviors are those of interpersonal violence, literacy, the propensity to save and the propensity to work.”\nNow, how can you reconcile McCloskey’s claim that Clark did not mount a credible quantitative argument with the observable fact that this is exactly what Clark has done, complete with graphs and explanations of exactly how he is quantifying the four behaviors? By reading more carefully and realizing that McCloskey isn’t actually addressing Clark, but rather Davenport, Galton, and others from the pre-quantification era of social science. Dobbs knows that most people don’t read carefully, they only skim to see what they want to see. He’s not actually lying about anything except for the assertion – which is a subjective matter – of the “comprehensive takedown”, but he deceives the common reader into thinking that his assertion is supported.\nSecond, Dobbs erects a strawman and burns it. Third, he resorts to outright lying.\nAnd despite his protests to the contrary, Wade often sounds as if he sees the rise of the West as a sort of stable endpoint of human history and evolution — as if, having considered 5,000 years in which history has successively blessed the Middle East, the Far East and the Ottoman Empire, he observes the West’s current run of glory and thinks the pendulum has stilled.\nIf Wade could point to genes that give races distinctive social behaviors, we might overlook such shortcomings. But he cannot.\nSo, Wade specifically and repeatedly states he is not doing what Dobbs thinks he is doing, which Dobbs then uses as justification to reach a conclusion that manifestly and absurdly contradicts everything Wade is saying. Wade never claims that “the pendulum has stilled”, quite to the contrary, his ENTIRE ARGUMENT depends upon the idea that the pendulum never stops swinging. And Wade does point to genes, specific genes, including the MAO-A gene, the SLC24A5 gene, the ABCC11 gene, and the EDAR gene that give races distinctive features as well as, in the case of the MAO-A gene, observably affecting their social behaviors.\nFourth and finally, Dobbs resorts to Vox’s Second Law of Critical Dynamics.\nIf I can imagine it, it must be assumed true. If you can’t conclusively prove it, it must be assumed false.\nLearn to recognize these deplorable rhetorical tactics. And never, ever, take a left-winger’s word for anything. You’ll be surprised how often they blatantly lie in the hopes that you won’t bother doing the research necessary to call them out on it.",
  "tags": [
    "media",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-13T08:20:00+00:00"
}