{
  "url": "https://voxday.net/2014/07/20/a-hand-overplayed/",
  "scraped_at": "2025-12-16T12:21:22.982067",
  "title": "A hand overplayed",
  "date_display": "July 20, 2014",
  "date_iso": "2014-07-20T17:00:00+00:00",
  "date_from_url": "2014-07-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I think we can safely say that the world is now officially holocausted out, as more and more people across the West are unwilling to give Jews the benefit of the doubt <a href=\"http://www.dailymail.co.uk/news/article-2698788/Jewish-doctor-thrown-JetBlue-flight-accusing-Palestinian-woman-having-bomb-luggage-heated-argument-Israeli-military-action-Gaza.html\">when they cry anti-semite</a>:</p><blockquote class=\"tr_bq\"><p> A new, unofficial report indicates that a Jewish doctor who claimed she was the victim of an antisemitic when she was thrown off of a JetBlue flight earlier this month was actually the aggressor in the mid-air dispute with a Palestinian woman who she said was a ‘murderer’ and that she probably had explosives in her bag.</p><p>The new report, which WPBF says it did not receive from the airline, Queens Doctor Lisa Rosenberg ‘accused customer 9C of being a Palestinian murderer, and that her people were all murderers and that they murder children,’ the station reported on Wednesday.</p><p>At the time of her getting escorted off the flight, on July 7, at an airport in Florida, Rosenberg told a local news outlet that she was called a ‘Zionist pig’ by the woman seated next to her.</p><p>In a phone interview with WPBF, the airline said that Rosenberg’s version of events ‘in no way reflects the report that we have.’ In the unofficial report, a flight attendant described how Rosenberg ‘went even further to suggest 9C had explosives in her bag and it would bring the aircraft down.’</p></blockquote><p>In similar fashion, I noticed that both the French and British press have exposed Jews as the aggressors in the recent “street battles” in Paris, although you won’t see this reported in any of the American newspapers, which inaccurately described the demonstrations as attacks and the subsequent attack of the demonstrators as <a href=\"http://guardianlv.com/2014/07/anti-semitic-rioters-attack-paris-synagogues/\">a defense of the synagogue</a>. But no synagogues were attacked that day; the various claims that two and three of them were attacked were confirmed to be false and <a href=\"http://www.dailymail.co.uk/news/article-2693423/Jewish-vigilantes-rampage-Paris-attack-pro-Palestinian-demonstrators.html\">there is video to prove it</a>.</p><blockquote class=\"tr_bq\"><p> A group of 150 Jewish men were seen brandishing iron bars and cans of pepper spray as they clashed with Pro-Palestinian demonstrators in Paris. Video footage of the clashes show the group chanting racist slogans as they roamed the streets. It came as President Francois Hollande warned that he did not want to see ‘the Israeli-Palestinian conflict imported into France’.</p><p>A still taken from the video shows dozens of men in Paris walking down the streets armed with chairs and other weapons, before clashing with pro-Palestinian demonstrators. Around 150 mainly young men were seen carrying weapons, like chairs, and chanting racist slogans as they went on the rampage. French Jewish groups have complained about an increase in anti-Semitism in recent months, with many accusing Muslim youths of targeting them.</p><p>But a video shot close to the Place de la Bastille on Sunday, and verified by police before being posted on YouTube, appears to show pro-Israel groups are also actively involved in clashes. In Paris, CRS riot police did not arrest any of the group, thought to be linked to the Jewish Defence League, despite them openly fighting in broad daylight. In the video, those amongst the group can be heard chanting ‘**** you Palestine’ as they smash up chairs and metal tables to be used as missiles….</p><p>Alexis Bachelay, a Paris MP for the ruling Socialist party, said: ‘There has evidently been a media manipulation about who really got assaulted. These are extremely serious facts that need to be investigated thoroughly by the police. It is not the first time that young French people of Muslim origin are stigmatised by the media. French people of Muslim origin should be protected by the law when demonstrating. They should not be attacked by radical groups like the LDJ’.</p></blockquote><p>Having been falsely accused many times of anti-semitism myself for nothing more than refusing to assume that all Jews are innocent angels at all times and devoid of all human failings (and I’m probably one of the very few individuals who has been personally cleared of the charge by the Jewish Defense League itself), I have learned to be extremely skeptical of all assertions of anti-semitism presented without evidence. As with women with sexism and blacks with racism, crying anti-semitism has become the first resort of any Jew caught with his hand in a cookie jar.</p><p>That doesn’t mean anti-semitism doesn’t exist. That doesn’t mean there aren’t people who wish to kill Jews for any number of reasons. That doesn’t mean that every last synagogue in France isn’t going to be burned to the ground. But it does mean that one should no more accept the word of a Jew on the matter than one should accept the word of a woman that she has been raped.</p><p>I am a Zionist because I am a nationalist. The Jews have a right to their homeland, Israel. They also have a right to invade Gaza because they were being attacked; hundreds of rocket launches is a legitimate <i>casus belli</i>. But they have no more right to Paris than the Arabs do, and the French would be wise to repatriate all of these bold defenders of their various homelands to let them fight it out there rather than in the heart of their capital city. Because it is patently obvious that neither side gives a damn about France.</p></div>",
  "content_text": "I think we can safely say that the world is now officially holocausted out, as more and more people across the West are unwilling to give Jews the benefit of the doubt\nwhen they cry anti-semite\n:\nA new, unofficial report indicates that a Jewish doctor who claimed she was the victim of an antisemitic when she was thrown off of a JetBlue flight earlier this month was actually the aggressor in the mid-air dispute with a Palestinian woman who she said was a ‘murderer’ and that she probably had explosives in her bag.\nThe new report, which WPBF says it did not receive from the airline, Queens Doctor Lisa Rosenberg ‘accused customer 9C of being a Palestinian murderer, and that her people were all murderers and that they murder children,’ the station reported on Wednesday.\nAt the time of her getting escorted off the flight, on July 7, at an airport in Florida, Rosenberg told a local news outlet that she was called a ‘Zionist pig’ by the woman seated next to her.\nIn a phone interview with WPBF, the airline said that Rosenberg’s version of events ‘in no way reflects the report that we have.’ In the unofficial report, a flight attendant described how Rosenberg ‘went even further to suggest 9C had explosives in her bag and it would bring the aircraft down.’\nIn similar fashion, I noticed that both the French and British press have exposed Jews as the aggressors in the recent “street battles” in Paris, although you won’t see this reported in any of the American newspapers, which inaccurately described the demonstrations as attacks and the subsequent attack of the demonstrators as\na defense of the synagogue\n. But no synagogues were attacked that day; the various claims that two and three of them were attacked were confirmed to be false and\nthere is video to prove it\n.\nA group of 150 Jewish men were seen brandishing iron bars and cans of pepper spray as they clashed with Pro-Palestinian demonstrators in Paris. Video footage of the clashes show the group chanting racist slogans as they roamed the streets. It came as President Francois Hollande warned that he did not want to see ‘the Israeli-Palestinian conflict imported into France’.\nA still taken from the video shows dozens of men in Paris walking down the streets armed with chairs and other weapons, before clashing with pro-Palestinian demonstrators. Around 150 mainly young men were seen carrying weapons, like chairs, and chanting racist slogans as they went on the rampage. French Jewish groups have complained about an increase in anti-Semitism in recent months, with many accusing Muslim youths of targeting them.\nBut a video shot close to the Place de la Bastille on Sunday, and verified by police before being posted on YouTube, appears to show pro-Israel groups are also actively involved in clashes. In Paris, CRS riot police did not arrest any of the group, thought to be linked to the Jewish Defence League, despite them openly fighting in broad daylight. In the video, those amongst the group can be heard chanting ‘**** you Palestine’ as they smash up chairs and metal tables to be used as missiles….\nAlexis Bachelay, a Paris MP for the ruling Socialist party, said: ‘There has evidently been a media manipulation about who really got assaulted. These are extremely serious facts that need to be investigated thoroughly by the police. It is not the first time that young French people of Muslim origin are stigmatised by the media. French people of Muslim origin should be protected by the law when demonstrating. They should not be attacked by radical groups like the LDJ’.\nHaving been falsely accused many times of anti-semitism myself for nothing more than refusing to assume that all Jews are innocent angels at all times and devoid of all human failings (and I’m probably one of the very few individuals who has been personally cleared of the charge by the Jewish Defense League itself), I have learned to be extremely skeptical of all assertions of anti-semitism presented without evidence. As with women with sexism and blacks with racism, crying anti-semitism has become the first resort of any Jew caught with his hand in a cookie jar.\nThat doesn’t mean anti-semitism doesn’t exist. That doesn’t mean there aren’t people who wish to kill Jews for any number of reasons. That doesn’t mean that every last synagogue in France isn’t going to be burned to the ground. But it does mean that one should no more accept the word of a Jew on the matter than one should accept the word of a woman that she has been raped.\nI am a Zionist because I am a nationalist. The Jews have a right to their homeland, Israel. They also have a right to invade Gaza because they were being attacked; hundreds of rocket launches is a legitimate\ncasus belli\n. But they have no more right to Paris than the Arabs do, and the French would be wise to repatriate all of these bold defenders of their various homelands to let them fight it out there rather than in the heart of their capital city. Because it is patently obvious that neither side gives a damn about France.",
  "tags": [
    "immigration",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-20T16:00:00+00:00"
}