{
  "url": "https://voxday.net/2014/07/22/a-negative-indicator/",
  "scraped_at": "2025-12-16T12:21:35.435144",
  "title": "A negative indicator",
  "date_display": "July 22, 2014",
  "date_iso": "2014-07-22T13:00:00+00:00",
  "date_from_url": "2014-07-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://i.dailymail.co.uk/i/pix/2014/07/17/article-0-1FB3DBC500000578-807_634x392.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"246\" src=\"http://i.dailymail.co.uk/i/pix/2014/07/17/article-0-1FB3DBC500000578-807_634x392.jpg\" width=\"400\"/></a></div><p>Some of you may recall my observations concerning the worsening Spanish economy after seeing attractive girls who looked like normal college students working the streets in Spain. That indicator is why <a href=\"http://www.nydailynews.com/news/crime/redhead-n-twins-busted-soliciting-sex-online-cops-article-1.1871927\">this story about a petty prostitution arrest</a> made me even more suspicious about the state of the US economy than the recent GDP surprise to the downside. While this pair of North Carolina twins do have more than a hint of the methhead about them, they are also rather more attractive than one would normally expect to see in the employ of a black hustler. Fortunately, they are enough of a news item that it would appear they are not yet the norm, although it could be the twin aspect that caused them to make the national media.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.zerohedge.com/sites/default/files/images/user3303/imageroot/2014/07/20140721_oops1_0.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"196\" src=\"http://www.zerohedge.com/sites/default/files/images/user3303/imageroot/2014/07/20140721_oops1_0.jpg\" width=\"320\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.zerohedge.com/sites/default/files/images/user3303/imageroot/2014/07/20140721_oops1_0.jpg\" decoding=\"async\" height=\"196\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20320%20196%22%3E%3C/svg%3E\" width=\"320\"/></a></div><p>Regardless, if we see more prostitution arrests being made of younger, whiter, more slender, and more attractive women, this will be a reliable indicator that a new level of economic depression has been reached. Just in case any was needed, in light of this unemployment chart <a href=\"http://www.zerohedge.com/news/2014-07-21/new-scariest-chart-america\">from Zerohedge</a>.</p></div>",
  "content_text": "Some of you may recall my observations concerning the worsening Spanish economy after seeing attractive girls who looked like normal college students working the streets in Spain. That indicator is why\nthis story about a petty prostitution arrest\nmade me even more suspicious about the state of the US economy than the recent GDP surprise to the downside. While this pair of North Carolina twins do have more than a hint of the methhead about them, they are also rather more attractive than one would normally expect to see in the employ of a black hustler. Fortunately, they are enough of a news item that it would appear they are not yet the norm, although it could be the twin aspect that caused them to make the national media.\nRegardless, if we see more prostitution arrests being made of younger, whiter, more slender, and more attractive women, this will be a reliable indicator that a new level of economic depression has been reached. Just in case any was needed, in light of this unemployment chart\nfrom Zerohedge\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2014-07-22T12:00:00+00:00"
}