{
  "url": "https://voxday.net/2014/07/06/anti-religious-discrimination-in/",
  "scraped_at": "2025-12-16T12:19:49.609650",
  "title": "Anti-religious discrimination in the workplace",
  "date_display": "July 6, 2014",
  "date_iso": "2014-07-06T08:52:00+00:00",
  "date_from_url": "2014-07-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Corporate anti-religious discrimination in America <a href=\"http://www.washingtontimes.com/news/2014/jun/17/admitting-faith-on-resume-cuts-callback-chances-st/?page=all#pagebreak\">is nearly as severe</a> as racial discrimination against blacks:</p><blockquote class=\"tr_bq\"><p> Most of the country might consider itself religious, but according to two recently released studies, admitting one’s faith on a resume can cut the chances for a callback by more than 25 percent.</p><p>Scholars with the “Religious Affiliation and Hiring Discrimination” field experiments, conducted in the South and New England, found that “applicants who expressed a religious identity were 26 percent less likely to receive a response from employers.”</p><p>“These studies do tend to show there will be factors in resumes that will lead to bias,” said David Lewin, head of Berkeley Research Group’s Labor and Employment practice and a professor of organizational behavior at the UCLA Anderson School of Management. “Religion could well be one of them.”</p></blockquote><p>Similar studies utilizing identifiably black names showed that similarly qualified blacks are <a href=\"http://www.nber.org/papers/w9873\">33 percent less likely</a> to receive a callback. (NB: before you embarrass yourself by trying to correct me, do the freaking math.) Keep this in mind the next time you see an atheist try to claim there is no anti-religious discrimination in America; the studies show that at least when it comes to corporate employment, it is four-fifths as severe as racial discrimination.</p></div>",
  "content_text": "Corporate anti-religious discrimination in America\nis nearly as severe\nas racial discrimination against blacks:\nMost of the country might consider itself religious, but according to two recently released studies, admitting one’s faith on a resume can cut the chances for a callback by more than 25 percent.\nScholars with the “Religious Affiliation and Hiring Discrimination” field experiments, conducted in the South and New England, found that “applicants who expressed a religious identity were 26 percent less likely to receive a response from employers.”\n“These studies do tend to show there will be factors in resumes that will lead to bias,” said David Lewin, head of Berkeley Research Group’s Labor and Employment practice and a professor of organizational behavior at the UCLA Anderson School of Management. “Religion could well be one of them.”\nSimilar studies utilizing identifiably black names showed that similarly qualified blacks are\n33 percent less likely\nto receive a callback. (NB: before you embarrass yourself by trying to correct me, do the freaking math.) Keep this in mind the next time you see an atheist try to claim there is no anti-religious discrimination in America; the studies show that at least when it comes to corporate employment, it is four-fifths as severe as racial discrimination.",
  "tags": [
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-06T07:52:00+00:00"
}