{
  "url": "https://voxday.net/2014/07/09/argentina-v-holland/",
  "scraped_at": "2025-12-16T12:20:14.875193",
  "title": "Argentina v Holland",
  "date_display": "July 9, 2014",
  "date_iso": "2014-07-09T19:30:00+00:00",
  "date_from_url": "2014-07-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>After last night’s Brazilian meltdown, I can’t imagine either of these teams are feeling great about their chances against the Teutonic steamroller. But someone has to play the role of the sacrificial lamb, and after all, it is an honor to simply be nominated as a World Cup finalist.</p><p>Holland is the glaringly obvious choice, in light of the fact that Argentina will be missing Di Maria, its second most-effective player of this World Cup. But Argentina has the second coming of the little magician on its side in the grand tradition of Diego Maradona, so it is simply not possible to count out <i>la Albiceleste</i>.</p><p>The Oranje have no Dennis Bergkamp to save them now from the magic of Messi. Look for Argentina to uphold the tattered honor of CONMEBOL!</p><p>EXTRA TIME: Neither team can manage to get past the back four and everyone is afraid to shoot in the box.</p></div>",
  "content_text": "After last night’s Brazilian meltdown, I can’t imagine either of these teams are feeling great about their chances against the Teutonic steamroller. But someone has to play the role of the sacrificial lamb, and after all, it is an honor to simply be nominated as a World Cup finalist.\nHolland is the glaringly obvious choice, in light of the fact that Argentina will be missing Di Maria, its second most-effective player of this World Cup. But Argentina has the second coming of the little magician on its side in the grand tradition of Diego Maradona, so it is simply not possible to count out\nla Albiceleste\n.\nThe Oranje have no Dennis Bergkamp to save them now from the magic of Messi. Look for Argentina to uphold the tattered honor of CONMEBOL!\nEXTRA TIME: Neither team can manage to get past the back four and everyone is afraid to shoot in the box.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-09T18:30:00+00:00"
}