{
  "url": "https://voxday.net/2014/07/09/darwin-title-ix-idiocracy/",
  "scraped_at": "2025-12-16T12:20:11.221164",
  "title": "Darwin + Title IX = IDIOCRACY",
  "date_display": "July 9, 2014",
  "date_iso": "2014-07-09T13:00:00+00:00",
  "date_from_url": "2014-07-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I long suspected that there would be seriously negative ramifications to encouraging our best and brightest women to remain barren and pursue degrees instead of preparing them for motherhood, but I didn’t expect the effect to be quantified so soon. There is <a href=\"http://alphagameplan.blogspot.ch/2014/07/female-education-is-dysgenic.html\">more detail at Alpha Game</a>, but suffice it to say that it has been confirmed that education, and the education of women in particular, is literally dysgenic.</p><p>We already knew that female suffrage and higher education for women was dyscivic. But this is the first confirmation of the logical conclusion that they are dysgenic as well. The silver lining is that it is a societal problem that will eventually solve itself over time… assuming the society somehow manages to survive.</p><p>I see this as yet another indication that there is no such thing as linear progress, much less inevitable progress, and that human societies follow a cyclical pattern of eucivic structures arising from savagery that are gradually supplanted by dyscivic ones that cause the civilized society to collapse again into barbarism.</p></div>",
  "content_text": "I long suspected that there would be seriously negative ramifications to encouraging our best and brightest women to remain barren and pursue degrees instead of preparing them for motherhood, but I didn’t expect the effect to be quantified so soon. There is\nmore detail at Alpha Game\n, but suffice it to say that it has been confirmed that education, and the education of women in particular, is literally dysgenic.\nWe already knew that female suffrage and higher education for women was dyscivic. But this is the first confirmation of the logical conclusion that they are dysgenic as well. The silver lining is that it is a societal problem that will eventually solve itself over time… assuming the society somehow manages to survive.\nI see this as yet another indication that there is no such thing as linear progress, much less inevitable progress, and that human societies follow a cyclical pattern of eucivic structures arising from savagery that are gradually supplanted by dyscivic ones that cause the civilized society to collapse again into barbarism.",
  "tags": [
    "decline and fall",
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-09T12:00:00+00:00"
}