{
  "url": "https://voxday.net/2014/07/04/defending-kiddy-fiddlers/",
  "scraped_at": "2025-12-16T12:19:37.181174",
  "title": "Defending the kiddy fiddlers",
  "date_display": "July 4, 2014",
  "date_iso": "2014-07-04T13:00:00+00:00",
  "date_from_url": "2014-07-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As an explosion of historical child abuse cases are being revealed in Britain, from popular entertainers to Members of Parliament, it can be readily observed that <a href=\"http://www.telegraph.co.uk/news/uknews/crime/10945282/Child-abuse-files-were-dismissed-as-fantasies-of-a-deluded-man.html\">the British elite’s reaction</a> to the exposure of the pedophiles in their midst was not dissimilar to the current non-reaction of the SFWA concerning the revelations concerning Marion Zimmer Bradley, Ed Kramer, and Samuel Delany.</p><blockquote class=\"tr_bq\"><p> His paedophile campaign ran into the buffers of derision from the press and hostility from fellow parliamentarians, some of whom denounced his use of parliamentary privilege to name Hayman and accused him of grandstanding.</p><p>It is hard to imagine today, as celebrities from that era are brought before the courts for historic sex offences, that this matter was treated so lightly by Parliament. Dickens believed this was because influential people were involved in the abuse and were determined to shut him up.</p><p>In reality, it stemmed more from a startling indifference to what was then called “kiddy fiddling”. It was as though because it had always gone on, it was not something to get too worked up about.</p><p>For his part, Dickens simply could not understand how an organisation such as PIE was allowed to exist…. Frustrated, Dickens brought a Bill before Parliament “to make it an offence to be a member of any organisation, association, society, religious sect, club or the like that holds meetings at which support is given to encourage, condone, corrupt or entice adults to have sexual relationships with children.”</p></blockquote><p>Is it really that hard to imagine today? The British Attorney General’s dismissal of Sir Peter Hayman’s subscription to the Paedophile Information Exchange network is more than a little remniscent of the defenses various SFWA members have offered of SFWA Grand Master Samuel Delany’s being a regular reader of the NAMBLA bulletin.</p><p><i>“Sir Peter Hayman had subscribed to PIE, that is not an offence and there is no evidence that he was ever involved in the management.”</i></p><p><i>“</i><i>I’ve seen no evidence (doesn’t mean it’s not out there; I’m not<br> trying to be willfully ignorant here) that Delany’s position was<br> anything other than intellectual.He was responding to the contents of their newsletter, which may<br> have been interesting and/or thought-provoking intellectual discussion<br> for all I know.”</br></br></br></br></i></p><p>Despite reports that the SFF community is reeling, neither SFWA nor its president, Steven Gould, have publicly said anything despite being directly asked about the scandals. But attempting to sweep the whole problem of child abuse in SFWA under the carpet as nothing more than the accusations of a bitter ex-member is not going to work any better in the long term than the British attempt to dismiss child abuse by its entertainers, diplomats, and politicians as “the fantasies of a deluded man”.</p><p>I suspect Jo Walton will eventually come to regret <a href=\"http://www.tor.com/blogs/2014/04/on-this-day-samuel-r-delany\">her repeated praise</a> of <a href=\"http://www.tor.com/blogs/2012/05/a-good-life-samuel-r-delanys-through-the-valley-of-the-nest-of-spiders\">Delany on Tor.com</a>, just as Ann McCaffrey and Robert Sawyer likely came to regret their defenses of Ed Kramer in the official SFWA publications and Jim C. Hines and Tor.com itself have come to regret their past celebrations of Marion Zimmer Bradley.</p><p>“We didn’t know,” they cry, some honestly, some not. But it seems readily apparent that the only reason many of them did not know was because they were determined not to look for fire amidst all the smoke. For example, notice that the Toad of Tor is STILL trying to defend Marion Zimmer Bradley.</p><blockquote class=\"tr_bq\"><p> Just F-ing Keftastic @Keffy Jun 13<br> THERE ARE FUCKING COURT FUCKING DOCUMENTS. And you still got people waffling about WELL WE DON’T KNOOOW and making excuses based on “vibes.”</br></p><p>tnielsenhayden @tnielsenhayden Jun 14<br> Pointing out that there remain areas of considerable uncertainty is not necessarily a defense of pedophilia.</br></p></blockquote><p>Not necessarily, no. But remember, Teresa Nielsen Hayden is one of the very members who demanded an 80-page investigative report of my supposed racism on the basis of a single tweet. But when it comes to Marion Zimmer Bradley, there “remain areas of considerable uncertainty” and when it comes to SFWA Grand Master Samuel Delany, it would appear his constant dwelling on things such as “racist porn”, “racial ephithets”, “father/son homosexual incest starting very young” and “bestiality” <b><i>“on almost every page”</i></b> don’t merit an investigation or anything except repeated public celebrations of the man.</p><p>Consistently looking the other way for decades, ignoring all the obvious signs, and then belatedly trying to hide behind “areas of considerable uncertainty” is, taken in sum, a de facto defense of the pedophiles in science fiction.</p></div>",
  "content_text": "As an explosion of historical child abuse cases are being revealed in Britain, from popular entertainers to Members of Parliament, it can be readily observed that\nthe British elite’s reaction\nto the exposure of the pedophiles in their midst was not dissimilar to the current non-reaction of the SFWA concerning the revelations concerning Marion Zimmer Bradley, Ed Kramer, and Samuel Delany.\nHis paedophile campaign ran into the buffers of derision from the press and hostility from fellow parliamentarians, some of whom denounced his use of parliamentary privilege to name Hayman and accused him of grandstanding.\nIt is hard to imagine today, as celebrities from that era are brought before the courts for historic sex offences, that this matter was treated so lightly by Parliament. Dickens believed this was because influential people were involved in the abuse and were determined to shut him up.\nIn reality, it stemmed more from a startling indifference to what was then called “kiddy fiddling”. It was as though because it had always gone on, it was not something to get too worked up about.\nFor his part, Dickens simply could not understand how an organisation such as PIE was allowed to exist…. Frustrated, Dickens brought a Bill before Parliament “to make it an offence to be a member of any organisation, association, society, religious sect, club or the like that holds meetings at which support is given to encourage, condone, corrupt or entice adults to have sexual relationships with children.”\nIs it really that hard to imagine today? The British Attorney General’s dismissal of Sir Peter Hayman’s subscription to the Paedophile Information Exchange network is more than a little remniscent of the defenses various SFWA members have offered of SFWA Grand Master Samuel Delany’s being a regular reader of the NAMBLA bulletin.\n“Sir Peter Hayman had subscribed to PIE, that is not an offence and there is no evidence that he was ever involved in the management.”\n“\nI’ve seen no evidence (doesn’t mean it’s not out there; I’m not\ntrying to be willfully ignorant here) that Delany’s position was\nanything other than intellectual.He was responding to the contents of their newsletter, which may\nhave been interesting and/or thought-provoking intellectual discussion\nfor all I know.”\nDespite reports that the SFF community is reeling, neither SFWA nor its president, Steven Gould, have publicly said anything despite being directly asked about the scandals. But attempting to sweep the whole problem of child abuse in SFWA under the carpet as nothing more than the accusations of a bitter ex-member is not going to work any better in the long term than the British attempt to dismiss child abuse by its entertainers, diplomats, and politicians as “the fantasies of a deluded man”.\nI suspect Jo Walton will eventually come to regret\nher repeated praise\nof\nDelany on Tor.com\n, just as Ann McCaffrey and Robert Sawyer likely came to regret their defenses of Ed Kramer in the official SFWA publications and Jim C. Hines and Tor.com itself have come to regret their past celebrations of Marion Zimmer Bradley.\n“We didn’t know,” they cry, some honestly, some not. But it seems readily apparent that the only reason many of them did not know was because they were determined not to look for fire amidst all the smoke. For example, notice that the Toad of Tor is STILL trying to defend Marion Zimmer Bradley.\nJust F-ing Keftastic @Keffy Jun 13\nTHERE ARE FUCKING COURT FUCKING DOCUMENTS. And you still got people waffling about WELL WE DON’T KNOOOW and making excuses based on “vibes.”\ntnielsenhayden @tnielsenhayden Jun 14\nPointing out that there remain areas of considerable uncertainty is not necessarily a defense of pedophilia.\nNot necessarily, no. But remember, Teresa Nielsen Hayden is one of the very members who demanded an 80-page investigative report of my supposed racism on the basis of a single tweet. But when it comes to Marion Zimmer Bradley, there “remain areas of considerable uncertainty” and when it comes to SFWA Grand Master Samuel Delany, it would appear his constant dwelling on things such as “racist porn”, “racial ephithets”, “father/son homosexual incest starting very young” and “bestiality”\n“on almost every page”\ndon’t merit an investigation or anything except repeated public celebrations of the man.\nConsistently looking the other way for decades, ignoring all the obvious signs, and then belatedly trying to hide behind “areas of considerable uncertainty” is, taken in sum, a de facto defense of the pedophiles in science fiction.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-04T12:00:00+00:00"
}