{
  "url": "https://voxday.net/2014/07/14/esr-and-terrible-sinking-feeling/",
  "scraped_at": "2025-12-16T12:20:39.817949",
  "title": "ESR and the terrible sinking feeling",
  "date_display": "July 14, 2014",
  "date_iso": "2014-07-14T13:00:00+00:00",
  "date_from_url": "2014-07-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It should be interesting to see the pinkshirts attempt to dismiss <a href=\"http://esr.ibiblio.org/?p=6039\">ESR’s criticism of their best mediocrities</a> as the conventional white Christian conservative’s bigoted distaste for the saintly Other:</p><blockquote class=\"tr_bq\"><p> The introduction to The Year’s Best Science Fiction and Fantasy 2014<br> (Rich Horton, ed.; Prime Books) gave me a terrible sinking feeling. It<br> was the anthologist’s self-congratulatory talk about “diversity” that<br> did it.</br></br></br></p><p>In the real world, when an employer trumpets its “diversity” you are<br> usually being told that hiring on the basis of actual qualifications has<br> been subordinated to good PR about the organization’s tenderness<br> towards whatever designated-victim groups are in fashion this week, and<br> can safely predict that you’ll be able to spot the diversity hires by<br> their incompetence. Real fairness doesn’t preen itself; real fairness<br> considers discrimination for as odious as discrimination against; real<br> fairness is a high-minded indifference to anything except actual merit….</br></br></br></br></br></br></br></p><p>If I believed the title of this anthology, I’d have to think the SF<br> field was in desperate shape and fantasy barely better off. There are<br> maybe five of the SF stories that will be worth remembering in a decade,<br> and at best a few more of the fantasies. The rest is like wallpaper –<br> busy, clever, and flat – except for the few pieces that are actively<br> bad.</br></br></br></br></br></p><p>I’d ask what the anthologist was thinking, but since I’ve seen the<br> author list on one of his other anthologies I don’t have to guess. For<br> truth in advertising, this should probably have been titled “Rich Horton<br> Recruits Mainly From His Usual Pool of Writers There Are Good Reasons<br> I’ve Never Heard Of”. And far too many of <i>them</i> are<br> second-raters who, if they ever knew how to write a decent F/SF story,<br> have given that up to perform bad imitations of literary fiction.</br></br></br></br></br></br></p><p>In SF all the writing skill in the world avails you naught unless you have an <i>idea</i><br> to wrap your plot and characters around. In fantasy you need to be able<br> to reach in and back to the roots of folklore and myth. Without these<br> qualities at the center an F/SF story is just a brittle, glossy surface<br> over nothing.  Way too many of these stories were superficial cleverness<br> over vacuum.</br></br></br></br></br></p></blockquote><p>This got me thinking about why I find Patrick Rothfuss’s very popular THE NAME OF THE WIND to be virtually unreadable. I like to keep my eye on what is genuinely popular in the genre and to learn from it what I can. But I’ve tried to read it three times now, in circumstances where I was travelling and had literally nothing else to do but read, and each time I found myself turning to anything else I had on hand rather than subject myself to any more of it. But, at the same time, I recognize that an awful lot of people genuinely love it and think very highly of it. How is this possible? Why are my perceptions so out of harmony with so many other readers? This pair of conflicting Amazon reviews, in combination with ESR’s post, may explain the apparent contradiction. The first review is by well-known fantasy author Robin Hobb:</p><blockquote class=\"tr_bq\"><p> <i>Well worth your precious reading hours</i></p><p>It seems to me that every year there are more books I want to read and less time for me to read them. Because my time is limited, I’m guilty of picking up the books by my favorite authors first, and fitting in new authors only when it’s convenient.</p><p>Due to a stroke of luck, I’ve had an advance copy of The Name of the Wind by my bedside for over six months, just waiting for me to open it. Unfortunately, deadlines of my own kept getting in the way. But in a way, it’s lucky that I didn’t crack this book until just a few days ago. If I’d had this tale to distract me, I’d have been even later getting my work done.</p><p>I loathe spoilers, so I’m not going to discuss the plot of this book. I will say it has all the things that I demand of a book. The characters are real, the action is convincing and it has a compelling story to tell.</p><p>One of the things I like best about this book is that the magic is absolutely rooted in the book’s world. Nothing seems contrived; the consistency is excellent.</p><p>The characters are very well realized. That means that when the protagonist does something clever, it’s believable. And when he does something youthfully dumb, it rings just as authentically true. Because the characters are real and the magic is true to its own world, I closed this book feeling as if I’d been on a journey with an entertaining new friend, rather than sitting alone looking at words on a page.</p><p>This one is well worth some of your precious reading time. I’ll wager that the books to follow it will also be.</p></blockquote><p>It’s strange, because I found Hobb’s books perfectly readable, if not particularly interesting or coherent. The second is a hilarious critical parody-review of THE NAME OF THE WIND that I found to be considerably more accurate than Hobb’s review:</p><blockquote class=\"tr_bq\"><p> My name is Kvothe. My awesome heroic account narrated by me is pure truth, I assure you. Do not worry folks. You’re looking for a review. I’m giving you one. We’ll get to that in a minute. But first, find some time to listen to me.</p><p>You don’t have time? What makes you think you can leave here, knowing what you know? (I said this exact sentence in my book.)</p><p>Now you want to listen to me after I gave you a death threat? Good. When you take note, do not presume to change a word I say. (I also said this in the book!)</p><p>I’m gifted. Not just gifted in one way, I’m gifted in every freaking way. I’m skilled with music, acting, medicine, chemistry, alchemy, things you might call magic. In fact, anything cool, you name it.</p><p>When I was only about twelve, I devoured in months lessons grown-ups would take years to learn. I had flash-fast, word for word, page for page memory. They ended up paying me instead of charging me for tuition. I was the youngest in quite a while. In barely a week, I owned a teacher so hard, embarrassed him in front of the class, making him hate me for life. In return, I was punished unfairly but also rewarded with a rank students took years to earn – I only took a few days. I saved women. One of the most beautiful girls in the school even invited me into her room, which I refused, of course. I was too pure to do that. I bested my rivals every time we confronted each other, in this book, at least. They accepted me as one of the musical genius, and I was the youngest to gain that recognition, even after my rival played dirty and tried to ruin my performance. By hurting him, I earned another rank. And the best part is, it didn’t stop there.</p><p>You see, I was brilliant. Not just your run-of-the-mill brilliance either. I was extraordinarily brilliant. (I said exactly this in my book too. Word for word!)</p><p>Not yet apparent in this book, but printed on the back cover, I have stolen princesses back from sleeping barrow kings. I burned down the town of Trebon. I have spent the night with Felurian and left with both my sanity and my life. I was expelled from the University at a younger age than most people are allowed in. I tread paths by moonlight that others fear to speak of during day. I have talked to Gods, loved women, and written songs that make the minstrels weep. My name is Kvothe, not Mary Sue. You may have heard of me.</p><p>You see, I said I would give you a review, but I don’t even have to. Because by the time you reach here, I’m pretty sure you get the point.</p></blockquote><p>So, on the one hand we have people who read for style in a solipsistic manner. They adore idealized Mary Sues such as Kvothe, because the way they read a book is to insert themselves in the protagonist’s position and experience the book through him. It is reading as an emotional experience. It may even be described, in some cases, as retroactive teenage wish fulfillment. (Those tidbits about owning the teacher, the unfair punishment, and turning down the pretty girl speak psychological volumes.) Call it Thalamic Reading, to borrow ESR’s term. On the other had, we have people who read books from a more detached and intellectual perspective. They engage in Cerebral Reading. The style of the prose is less important to them, except as an aesthetic frosting, because they don’t feel any need to bond seamlessly with the protagonist and they are more concerned with the story, the concepts, and the underlying meaning of the story.</p><p>In my experience, Rothfuss and Rowling and Weber are three exemplaries of the former. Lewis and Tolkien and Wright are three exemplaries of the latter. In the case of the former, the reader knows exactly with whom he is supposed to identify, whose emotions he is expected to share: Kvothe, Harry, and Honor. With whom is one expected to identify in the case of the Narnia novels? Or Middle Earth? Or the Night Lands? The question cannot even reasonably be answered in any straightforward manner. And while there is some crossover between the two forms of reading, the emotional and the intellectual, the more one is oriented to one reading form, the less one will be able to enjoy the other. And while Pink SF/F is not necessarily Thalamic and Blue SF/F is not necessarily Cerebral, the subgenres do tend to fit more comfortably with one form than the other.</p></div>",
  "content_text": "It should be interesting to see the pinkshirts attempt to dismiss\nESR’s criticism of their best mediocrities\nas the conventional white Christian conservative’s bigoted distaste for the saintly Other:\nThe introduction to The Year’s Best Science Fiction and Fantasy 2014\n(Rich Horton, ed.; Prime Books) gave me a terrible sinking feeling. It\nwas the anthologist’s self-congratulatory talk about “diversity” that\ndid it.\nIn the real world, when an employer trumpets its “diversity” you are\nusually being told that hiring on the basis of actual qualifications has\nbeen subordinated to good PR about the organization’s tenderness\ntowards whatever designated-victim groups are in fashion this week, and\ncan safely predict that you’ll be able to spot the diversity hires by\ntheir incompetence. Real fairness doesn’t preen itself; real fairness\nconsiders discrimination for as odious as discrimination against; real\nfairness is a high-minded indifference to anything except actual merit….\nIf I believed the title of this anthology, I’d have to think the SF\nfield was in desperate shape and fantasy barely better off. There are\nmaybe five of the SF stories that will be worth remembering in a decade,\nand at best a few more of the fantasies. The rest is like wallpaper –\nbusy, clever, and flat – except for the few pieces that are actively\nbad.\nI’d ask what the anthologist was thinking, but since I’ve seen the\nauthor list on one of his other anthologies I don’t have to guess. For\ntruth in advertising, this should probably have been titled “Rich Horton\nRecruits Mainly From His Usual Pool of Writers There Are Good Reasons\nI’ve Never Heard Of”. And far too many of\nthem\nare\nsecond-raters who, if they ever knew how to write a decent F/SF story,\nhave given that up to perform bad imitations of literary fiction.\nIn SF all the writing skill in the world avails you naught unless you have an\nidea\nto wrap your plot and characters around. In fantasy you need to be able\nto reach in and back to the roots of folklore and myth. Without these\nqualities at the center an F/SF story is just a brittle, glossy surface\nover nothing.  Way too many of these stories were superficial cleverness\nover vacuum.\nThis got me thinking about why I find Patrick Rothfuss’s very popular THE NAME OF THE WIND to be virtually unreadable. I like to keep my eye on what is genuinely popular in the genre and to learn from it what I can. But I’ve tried to read it three times now, in circumstances where I was travelling and had literally nothing else to do but read, and each time I found myself turning to anything else I had on hand rather than subject myself to any more of it. But, at the same time, I recognize that an awful lot of people genuinely love it and think very highly of it. How is this possible? Why are my perceptions so out of harmony with so many other readers? This pair of conflicting Amazon reviews, in combination with ESR’s post, may explain the apparent contradiction. The first review is by well-known fantasy author Robin Hobb:\nWell worth your precious reading hours\nIt seems to me that every year there are more books I want to read and less time for me to read them. Because my time is limited, I’m guilty of picking up the books by my favorite authors first, and fitting in new authors only when it’s convenient.\nDue to a stroke of luck, I’ve had an advance copy of The Name of the Wind by my bedside for over six months, just waiting for me to open it. Unfortunately, deadlines of my own kept getting in the way. But in a way, it’s lucky that I didn’t crack this book until just a few days ago. If I’d had this tale to distract me, I’d have been even later getting my work done.\nI loathe spoilers, so I’m not going to discuss the plot of this book. I will say it has all the things that I demand of a book. The characters are real, the action is convincing and it has a compelling story to tell.\nOne of the things I like best about this book is that the magic is absolutely rooted in the book’s world. Nothing seems contrived; the consistency is excellent.\nThe characters are very well realized. That means that when the protagonist does something clever, it’s believable. And when he does something youthfully dumb, it rings just as authentically true. Because the characters are real and the magic is true to its own world, I closed this book feeling as if I’d been on a journey with an entertaining new friend, rather than sitting alone looking at words on a page.\nThis one is well worth some of your precious reading time. I’ll wager that the books to follow it will also be.\nIt’s strange, because I found Hobb’s books perfectly readable, if not particularly interesting or coherent. The second is a hilarious critical parody-review of THE NAME OF THE WIND that I found to be considerably more accurate than Hobb’s review:\nMy name is Kvothe. My awesome heroic account narrated by me is pure truth, I assure you. Do not worry folks. You’re looking for a review. I’m giving you one. We’ll get to that in a minute. But first, find some time to listen to me.\nYou don’t have time? What makes you think you can leave here, knowing what you know? (I said this exact sentence in my book.)\nNow you want to listen to me after I gave you a death threat? Good. When you take note, do not presume to change a word I say. (I also said this in the book!)\nI’m gifted. Not just gifted in one way, I’m gifted in every freaking way. I’m skilled with music, acting, medicine, chemistry, alchemy, things you might call magic. In fact, anything cool, you name it.\nWhen I was only about twelve, I devoured in months lessons grown-ups would take years to learn. I had flash-fast, word for word, page for page memory. They ended up paying me instead of charging me for tuition. I was the youngest in quite a while. In barely a week, I owned a teacher so hard, embarrassed him in front of the class, making him hate me for life. In return, I was punished unfairly but also rewarded with a rank students took years to earn – I only took a few days. I saved women. One of the most beautiful girls in the school even invited me into her room, which I refused, of course. I was too pure to do that. I bested my rivals every time we confronted each other, in this book, at least. They accepted me as one of the musical genius, and I was the youngest to gain that recognition, even after my rival played dirty and tried to ruin my performance. By hurting him, I earned another rank. And the best part is, it didn’t stop there.\nYou see, I was brilliant. Not just your run-of-the-mill brilliance either. I was extraordinarily brilliant. (I said exactly this in my book too. Word for word!)\nNot yet apparent in this book, but printed on the back cover, I have stolen princesses back from sleeping barrow kings. I burned down the town of Trebon. I have spent the night with Felurian and left with both my sanity and my life. I was expelled from the University at a younger age than most people are allowed in. I tread paths by moonlight that others fear to speak of during day. I have talked to Gods, loved women, and written songs that make the minstrels weep. My name is Kvothe, not Mary Sue. You may have heard of me.\nYou see, I said I would give you a review, but I don’t even have to. Because by the time you reach here, I’m pretty sure you get the point.\nSo, on the one hand we have people who read for style in a solipsistic manner. They adore idealized Mary Sues such as Kvothe, because the way they read a book is to insert themselves in the protagonist’s position and experience the book through him. It is reading as an emotional experience. It may even be described, in some cases, as retroactive teenage wish fulfillment. (Those tidbits about owning the teacher, the unfair punishment, and turning down the pretty girl speak psychological volumes.) Call it Thalamic Reading, to borrow ESR’s term. On the other had, we have people who read books from a more detached and intellectual perspective. They engage in Cerebral Reading. The style of the prose is less important to them, except as an aesthetic frosting, because they don’t feel any need to bond seamlessly with the protagonist and they are more concerned with the story, the concepts, and the underlying meaning of the story.\nIn my experience, Rothfuss and Rowling and Weber are three exemplaries of the former. Lewis and Tolkien and Wright are three exemplaries of the latter. In the case of the former, the reader knows exactly with whom he is supposed to identify, whose emotions he is expected to share: Kvothe, Harry, and Honor. With whom is one expected to identify in the case of the Narnia novels? Or Middle Earth? Or the Night Lands? The question cannot even reasonably be answered in any straightforward manner. And while there is some crossover between the two forms of reading, the emotional and the intellectual, the more one is oriented to one reading form, the less one will be able to enjoy the other. And while Pink SF/F is not necessarily Thalamic and Blue SF/F is not necessarily Cerebral, the subgenres do tend to fit more comfortably with one form than the other.",
  "tags": [
    "Book Review",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-14T12:00:00+00:00"
}