{
  "url": "https://voxday.net/2014/07/31/esr-on-sf-and-literary-penis-envy/",
  "scraped_at": "2025-12-16T12:22:38.334661",
  "title": "ESR on SF and literary penis envy",
  "date_display": "July 31, 2014",
  "date_iso": "2014-07-31T12:00:00+00:00",
  "date_from_url": "2014-07-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Er, sorry, I guess that was <a href=\"http://esr.ibiblio.org/?p=6085\">literary STATUS envy</a>. Although considering the predominantly female and low-testosterone gamma male makeup of the other side, either description would serve equally well. In any event, ESR addresses the Blue SF/Pink SF divide:</p><blockquote class=\"tr_bq\"><p> I’ve been aware for some time of a culture war simmering in the SF world. And trying to ignore it, as I believed it was largely irrelevant to any of my concerns and I have friends on both sides of the divide. Recently, for a number of reasons I may go into in a later post, I’ve been forced to take a closer look at it. And now I’m going to have to weigh in, because it seems to me that the side I might otherwise be most sympathetic to has made a rather basic error in its analysis. That error bears on something I do very much care about, which is the health of the SF genre as a whole.</p><p>Both sides in this war believe they’re fighting about politics. I consider this evaluation a serious mistake by at least one of the sides.</p><p>On the one hand, you have a faction that is broadly left-wing in its politics and believes it has a mission to purge SF of authors who are reactionary, racist, sexist et weary cetera…. On the other hand, you have a faction that is broadly conservative or libertarian in its politics. Its members deny, mostly truthfully, being the bad things the Rabbits accuse them of.</p></blockquote><p>It’s interesting to see ESR weigh in on this, not only because he is an unusually intelligent individual, but as he says, he has sympathies on both sides of the divide. And, I would suspect, competing natural inclinations as well. But it was a little surprising to see him conclude that he tended to be more sympathetic to the side of evilly Evil. As the title of his post suggests, his observation is that the root cause of the divide is not political, but rather literary:</p><blockquote class=\"tr_bq\"><p> Alas, I cannot join the Evil League of Evil, for I believe they have<br> made the same mistake as the Rabbits; they have mistaken accident for<br> essence.  The problem with the Rabbits is <i>not</i> that left-wing politics is dessicating and poisoning their fiction. While I have made the case elsewhere that SF is <a href=\"http://www.catb.org/esr/writings/sf-history.html\">libertarian at its core</a>,<br> it nevertheless remains possible to write left-wing message SF that is<br> readable, enjoyable, and of high quality – Iain Banks’s Culture novels<br> leap to mind as recent examples, and we can refer back to vintage<br> classics such as Pohl &amp; Kornbluth’s The Space Merchants<br> for confirmation.  Nor, I think, is the failure of Rabbit fiction to<br> engage most SF fans and potential fans mainly down to its politics; I<br> think the Evil League is prone to overestimate the popular appeal of<br> their particular positions here.</br></br></br></br></br></br></br></br></br></br></p><p>No, I judge that what is dessicating and poisoning the Rabbit version<br> of SF is something distinct from left-wing political slant but<br> co-morbid with it: colonization by English majors and the rise of<br> literary status envy as a significant shaping force in the field.</br></br></br></p><p>This is a development that’s easy to mistake for a political one<br> because of the accidental fact that most university humanities<br> departments have, over the last sixty years or so, become extreme-left<br> political monocultures. But, in the language of epidemiology, I believe<br> the politics is a marker for the actual disease rather than the pathogen<br> itself.  And it’s no use to fight the marker organism rather than the<br> actual pathogen….</br></br></br></br></br></br></p><p>The Evil League of Evil is fighting the wrong war in the wrong way.<br> To truly crush the Rabbits, they should be talking less about politics<br> and more about what has been best and most noble in the traditions of<br> the SF genre itself. I think a lot of fans know there is something<br> fatally gone missing in the Rabbit version of science fiction; what they<br> lack is the language to describe and demand it. That being said, in the long run, I don’t think the Evil League of Evil can lose.</br></br></br></br></br></p></blockquote><p>Of course the Evil League of Evil cannot lose. Not with me as its Supreme Dark Lord! I have studied the lessons of my many failed predecessors well and have subsequently implemented the following protocols:</p><ol><li>Installed a magical ground-to-air defense system called IRON CLAW that will grab, pull down, and dismember any airborne creature large enough to carry a hobbit.</li><li>Scheduled rotating squads of crack guards, each including at least one experienced battlemage, to be positioned outside the side door to Mount Doom. Also hired new Head of Security after ordering the previous one thrown into the lava flowing inside the aforementioned mountain.</li><li>Established an operation called HERODSIX that tracks global birth data and passes it on to a team of nutritionists who will arrange to feed abortifacients to any pregnant woman who has previously given birth to six sons.</li><li>Constructed a well-guarded underground facility in which my undead, unkillable warriors are created. Instead of carting a heavy, rune-inscribed iron cauldron around to every prospective battlefield, the Evil League of Evil is paying top silver for freshly killed corpses in good condition, with a bonus for each one over 6’4″.</li><li>Dismantled and reassembled the four thrones at Cair Laugharne. I’m looking forward to seeing the little bastards park their bony little arses on them as foretold now that they’ve been made into gold-plated wooden stakes.</li><li>Armored the air intakes to my mighty mountain fortress, Gheddorodim, with plasma shields capable of deflecting the most powerful energy-torpedo.</li><li>Implemented DOUBLE-TAP, a protocol which includes bans on monologuing, evil cackling, unauthorized torture, and extended prisoner-taunting by all lieutenants and minions of rank E6 or higher. It also lays out specific policies concerning proper confirmations of death (or True Death in the case of the undead), and corpse disposal. All employees of the Evil League of Evil who fail to abide by the protocol will themselves be subject to DOUBLE-TAP.</li><li>Also, at the request of Generalissimo Xcrucifix, we now have cookies. Chocolate Chip and Oatmeal Butterscotch. I’m not convinced this actually enhances our security, but I don’t see how it harms it either.</li></ol><p>Now, in my opinion, ESR is partially correct in his interpretation of the divide as being intrinsically literary. But while the literary aspect is absolutely another facet of the SF/F divide, and one which I have written about in some detail in the past, it’s only the second of five facets that separate the Evil League of Evil from the rabbits.</p><ol><li>Political. This is obvious. We tend to be center-to-right, they tend to be left-to-extreme left.</li><li>Literary. They tend to be focused on style, followed by ideological concerns regarding diversity and social justice. While our best stylists, Gene Wolfe and John C. Wright, are better than theirs, it’s true that they tend to be more skilled when it comes to pure prose. As the International Lord of Hate has frequently pointed out, we are focused on story, story, story, followed by characters, followed by worldbuilding and/or ideas.</li><li>Religious. We tend to be either religious or religion-friendly seculars. They tend to range from goddess-worshipping Unitarians to rabid anti-theists. Even the atheists in our midst are more comfortable with religion in their SF/F  than their most religious members.</li><li>Socio-sexual. We tend to be men of Delta rank or higher. They tend to be women, feminized Gamma males, or Omega males. Our female members possess more of the masculine virtues of courage and honor than most of their men.</li><li>Experiential. We tend to come from worlds outside of academia and education. We write and we work real jobs that are totally unrelated to writing. They mostly write, and write about writing, and teach, quite often about writing. I expect their academic majors were mostly English, with the occasional STEM degree, while ours are from a much broader spectrum. For example, by training, John is a lawyer, Larry is an accountant, and I am an economist. And ironically, for all their politically correct enthusiasm for diversity, we are probably more ethnically and linguistically diverse.</li></ol><p>The differences between the two sides are often visibly identifiable, and not just because we’re the ones carrying guns. One of the two book signings I ever did was a big one featuring 20 different authors at a big Barnes &amp; Noble, including Gordon R. Dickson, Joel Rosenberg, Lois Bujold, David Feintuch, David Arneson, and various other SF/F luminaries. One kid asking me to sign his book said: “You don’t look like an SF writer.” And, I had to admit, after looking to either side of me, it wasn’t at all clear that we belonged to the same phylum, let alone species.</p><p>In response to a few of the various statements and questions raised:</p><ol><li>I would never deny that it remains possible to write left-wing message SF that is readable, enjoyable, and of high quality. That is true. But I would argue that the Culture novels are an excellent example of how the left-wing messages tend to harm, rather than enhance, the fiction. It’s not an accident that nothing interesting ever happens in the Culture (or in the Federation), or that in order to simply tell a story, it is necessary to leave the left-wing utopia and go in search of adventure elsewhere. Just as the Left has only one joke (you know that guy there, he’s stupid, isn’t he?) it has only one story, that of the struggle of the transition of an entity, individual or collective, from Badthink to Goodthink. They don’t tell stories, they tell Very Important Lessons.</li><li> How do you separate real writers from wannabes with deep pockets? Who cares? Let everyone write. Publish them all and let Amazon sort them out. SFWA was already irrelevant because its reason for existence was subverted. It was captured by the mainstream publishers long ago, as illustrated by its lining up against Amazon on Hatchette’s behalf.</li><li>The term “rabbit” actually comes from E.O. Wilson’s ecological r/K selection theory. I explained it in a post called <a href=\"http://www.milobookclub.com/2013/01/22/digging-out-rabbit-people/\">Digging Out the Rabbit People</a>. It is derogatory; it is also very apt. More importantly, it’s always fun to be able to throw in the occasional Lapine phrase from <i>Watership Down</i>.</li><li>Contra Mr. Andrew Marston of Marshfield, MA’s claims, I do sell books. I’m no bestseller, to be sure but my books usually sell around 5,000 copies apiece. Not enough to live on, especially when it takes me two years to write one, but not bad for a hobby. My bestselling book sold between 35,000 and 40,000 copies. My bestselling game sold over six million copies. And I have never had a trust fund.</li><li>The idea that the existence of the “Gamma Rabbit” t-shirt is evidence that the rabbits have a sense of humor about themselves indicates an insufficient understanding of the gamma mentality and the gamma male’s need to spin the narrative in his favor. It’s little more credible than Scalzi’s claims that he found my mocking his inept satire and exposure of his self-inflating traffic claims to be “adorable”.</li></ol><p>UPDATE: The Official Spokesvillain of the Evil League of Evil, The King in Yellow, <a href=\"http://www.scifiwright.com/2014/07/literary-envy-and-the-last-redoubt/\">explains the identifiable attributes</a> of the rabbits/morlocks/trog-progs:</p><blockquote class=\"tr_bq\"><p> There are thirteen identifiable markers of the membership of the tribe of Troglodytes:</p><p>1. Theologically, they are atheist and agnostic, or at least laiacist.<br>2. In Metaphysics, they are nihilist. They hold the universe to have no innate meaning.<br>3. In Epistemology, they are subjectivists and (ironically) empiricists.<br>4. In Ontology, they are materialists. They believe minds are epiphenomena of matter.<br>5. In Logic, they are polylogists. They believe each race and both genders possesses unique and exclusive rules of logic.<br>6. In Aesthetics, they glorify the ugly and destroy beauty.<br>7. In Ethics, they are Gnostics. Whatever we call good, they call evil, and whatever we call evil, they call good.<br>8. In Politics, they are statists, and tacitly totalitarian. They want arbitrary power rather than law and order.<br>9. In Economics, they are socialist. They want the law of supply and demand to vanish softly away.<br>10. In Semantics, they are nominalists. They hold words to have no innate meaning.<br>11. In their psychological stance, they are sadists.<br>12. In their psychopathology, they are suicidal. They don’t want to live, they want you to die.<br>13. Emotionally, they are infantile. The emotion that governs them is envy.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>Now, these are rough generalizations only, and no one member of the movement believes all these points, and, being a strongly anti-intellectual and pro-irrational bent, few of them even know what these big words mean. Some of these points contradict each other. That matters nothing to them. Logic is not their strong suit.</p></blockquote><ol></ol></div>",
  "content_text": "Er, sorry, I guess that was\nliterary STATUS envy\n. Although considering the predominantly female and low-testosterone gamma male makeup of the other side, either description would serve equally well. In any event, ESR addresses the Blue SF/Pink SF divide:\nI’ve been aware for some time of a culture war simmering in the SF world. And trying to ignore it, as I believed it was largely irrelevant to any of my concerns and I have friends on both sides of the divide. Recently, for a number of reasons I may go into in a later post, I’ve been forced to take a closer look at it. And now I’m going to have to weigh in, because it seems to me that the side I might otherwise be most sympathetic to has made a rather basic error in its analysis. That error bears on something I do very much care about, which is the health of the SF genre as a whole.\nBoth sides in this war believe they’re fighting about politics. I consider this evaluation a serious mistake by at least one of the sides.\nOn the one hand, you have a faction that is broadly left-wing in its politics and believes it has a mission to purge SF of authors who are reactionary, racist, sexist et weary cetera…. On the other hand, you have a faction that is broadly conservative or libertarian in its politics. Its members deny, mostly truthfully, being the bad things the Rabbits accuse them of.\nIt’s interesting to see ESR weigh in on this, not only because he is an unusually intelligent individual, but as he says, he has sympathies on both sides of the divide. And, I would suspect, competing natural inclinations as well. But it was a little surprising to see him conclude that he tended to be more sympathetic to the side of evilly Evil. As the title of his post suggests, his observation is that the root cause of the divide is not political, but rather literary:\nAlas, I cannot join the Evil League of Evil, for I believe they have\nmade the same mistake as the Rabbits; they have mistaken accident for\nessence.  The problem with the Rabbits is\nnot\nthat left-wing politics is dessicating and poisoning their fiction. While I have made the case elsewhere that SF is\nlibertarian at its core\n,\nit nevertheless remains possible to write left-wing message SF that is\nreadable, enjoyable, and of high quality – Iain Banks’s Culture novels\nleap to mind as recent examples, and we can refer back to vintage\nclassics such as Pohl & Kornbluth’s The Space Merchants\nfor confirmation.  Nor, I think, is the failure of Rabbit fiction to\nengage most SF fans and potential fans mainly down to its politics; I\nthink the Evil League is prone to overestimate the popular appeal of\ntheir particular positions here.\nNo, I judge that what is dessicating and poisoning the Rabbit version\nof SF is something distinct from left-wing political slant but\nco-morbid with it: colonization by English majors and the rise of\nliterary status envy as a significant shaping force in the field.\nThis is a development that’s easy to mistake for a political one\nbecause of the accidental fact that most university humanities\ndepartments have, over the last sixty years or so, become extreme-left\npolitical monocultures. But, in the language of epidemiology, I believe\nthe politics is a marker for the actual disease rather than the pathogen\nitself.  And it’s no use to fight the marker organism rather than the\nactual pathogen….\nThe Evil League of Evil is fighting the wrong war in the wrong way.\nTo truly crush the Rabbits, they should be talking less about politics\nand more about what has been best and most noble in the traditions of\nthe SF genre itself. I think a lot of fans know there is something\nfatally gone missing in the Rabbit version of science fiction; what they\nlack is the language to describe and demand it. That being said, in the long run, I don’t think the Evil League of Evil can lose.\nOf course the Evil League of Evil cannot lose. Not with me as its Supreme Dark Lord! I have studied the lessons of my many failed predecessors well and have subsequently implemented the following protocols:\nInstalled a magical ground-to-air defense system called IRON CLAW that will grab, pull down, and dismember any airborne creature large enough to carry a hobbit.\nScheduled rotating squads of crack guards, each including at least one experienced battlemage, to be positioned outside the side door to Mount Doom. Also hired new Head of Security after ordering the previous one thrown into the lava flowing inside the aforementioned mountain.\nEstablished an operation called HERODSIX that tracks global birth data and passes it on to a team of nutritionists who will arrange to feed abortifacients to any pregnant woman who has previously given birth to six sons.\nConstructed a well-guarded underground facility in which my undead, unkillable warriors are created. Instead of carting a heavy, rune-inscribed iron cauldron around to every prospective battlefield, the Evil League of Evil is paying top silver for freshly killed corpses in good condition, with a bonus for each one over 6’4″.\nDismantled and reassembled the four thrones at Cair Laugharne. I’m looking forward to seeing the little bastards park their bony little arses on them as foretold now that they’ve been made into gold-plated wooden stakes.\nArmored the air intakes to my mighty mountain fortress, Gheddorodim, with plasma shields capable of deflecting the most powerful energy-torpedo.\nImplemented DOUBLE-TAP, a protocol which includes bans on monologuing, evil cackling, unauthorized torture, and extended prisoner-taunting by all lieutenants and minions of rank E6 or higher. It also lays out specific policies concerning proper confirmations of death (or True Death in the case of the undead), and corpse disposal. All employees of the Evil League of Evil who fail to abide by the protocol will themselves be subject to DOUBLE-TAP.\nAlso, at the request of Generalissimo Xcrucifix, we now have cookies. Chocolate Chip and Oatmeal Butterscotch. I’m not convinced this actually enhances our security, but I don’t see how it harms it either.\nNow, in my opinion, ESR is partially correct in his interpretation of the divide as being intrinsically literary. But while the literary aspect is absolutely another facet of the SF/F divide, and one which I have written about in some detail in the past, it’s only the second of five facets that separate the Evil League of Evil from the rabbits.\nPolitical. This is obvious. We tend to be center-to-right, they tend to be left-to-extreme left.\nLiterary. They tend to be focused on style, followed by ideological concerns regarding diversity and social justice. While our best stylists, Gene Wolfe and John C. Wright, are better than theirs, it’s true that they tend to be more skilled when it comes to pure prose. As the International Lord of Hate has frequently pointed out, we are focused on story, story, story, followed by characters, followed by worldbuilding and/or ideas.\nReligious. We tend to be either religious or religion-friendly seculars. They tend to range from goddess-worshipping Unitarians to rabid anti-theists. Even the atheists in our midst are more comfortable with religion in their SF/F  than their most religious members.\nSocio-sexual. We tend to be men of Delta rank or higher. They tend to be women, feminized Gamma males, or Omega males. Our female members possess more of the masculine virtues of courage and honor than most of their men.\nExperiential. We tend to come from worlds outside of academia and education. We write and we work real jobs that are totally unrelated to writing. They mostly write, and write about writing, and teach, quite often about writing. I expect their academic majors were mostly English, with the occasional STEM degree, while ours are from a much broader spectrum. For example, by training, John is a lawyer, Larry is an accountant, and I am an economist. And ironically, for all their politically correct enthusiasm for diversity, we are probably more ethnically and linguistically diverse.\nThe differences between the two sides are often visibly identifiable, and not just because we’re the ones carrying guns. One of the two book signings I ever did was a big one featuring 20 different authors at a big Barnes & Noble, including Gordon R. Dickson, Joel Rosenberg, Lois Bujold, David Feintuch, David Arneson, and various other SF/F luminaries. One kid asking me to sign his book said: “You don’t look like an SF writer.” And, I had to admit, after looking to either side of me, it wasn’t at all clear that we belonged to the same phylum, let alone species.\nIn response to a few of the various statements and questions raised:\nI would never deny that it remains possible to write left-wing message SF that is readable, enjoyable, and of high quality. That is true. But I would argue that the Culture novels are an excellent example of how the left-wing messages tend to harm, rather than enhance, the fiction. It’s not an accident that nothing interesting ever happens in the Culture (or in the Federation), or that in order to simply tell a story, it is necessary to leave the left-wing utopia and go in search of adventure elsewhere. Just as the Left has only one joke (you know that guy there, he’s stupid, isn’t he?) it has only one story, that of the struggle of the transition of an entity, individual or collective, from Badthink to Goodthink. They don’t tell stories, they tell Very Important Lessons.\nHow do you separate real writers from wannabes with deep pockets? Who cares? Let everyone write. Publish them all and let Amazon sort them out. SFWA was already irrelevant because its reason for existence was subverted. It was captured by the mainstream publishers long ago, as illustrated by its lining up against Amazon on Hatchette’s behalf.\nThe term “rabbit” actually comes from E.O. Wilson’s ecological r/K selection theory. I explained it in a post called\nDigging Out the Rabbit People\n. It is derogatory; it is also very apt. More importantly, it’s always fun to be able to throw in the occasional Lapine phrase from\nWatership Down\n.\nContra Mr. Andrew Marston of Marshfield, MA’s claims, I do sell books. I’m no bestseller, to be sure but my books usually sell around 5,000 copies apiece. Not enough to live on, especially when it takes me two years to write one, but not bad for a hobby. My bestselling book sold between 35,000 and 40,000 copies. My bestselling game sold over six million copies. And I have never had a trust fund.\nThe idea that the existence of the “Gamma Rabbit” t-shirt is evidence that the rabbits have a sense of humor about themselves indicates an insufficient understanding of the gamma mentality and the gamma male’s need to spin the narrative in his favor. It’s little more credible than Scalzi’s claims that he found my mocking his inept satire and exposure of his self-inflating traffic claims to be “adorable”.\nUPDATE: The Official Spokesvillain of the Evil League of Evil, The King in Yellow,\nexplains the identifiable attributes\nof the rabbits/morlocks/trog-progs:\nThere are thirteen identifiable markers of the membership of the tribe of Troglodytes:\n1. Theologically, they are atheist and agnostic, or at least laiacist.\n2. In Metaphysics, they are nihilist. They hold the universe to have no innate meaning.\n3. In Epistemology, they are subjectivists and (ironically) empiricists.\n4. In Ontology, they are materialists. They believe minds are epiphenomena of matter.\n5. In Logic, they are polylogists. They believe each race and both genders possesses unique and exclusive rules of logic.\n6. In Aesthetics, they glorify the ugly and destroy beauty.\n7. In Ethics, they are Gnostics. Whatever we call good, they call evil, and whatever we call evil, they call good.\n8. In Politics, they are statists, and tacitly totalitarian. They want arbitrary power rather than law and order.\n9. In Economics, they are socialist. They want the law of supply and demand to vanish softly away.\n10. In Semantics, they are nominalists. They hold words to have no innate meaning.\n11. In their psychological stance, they are sadists.\n12. In their psychopathology, they are suicidal. They don’t want to live, they want you to die.\n13. Emotionally, they are infantile. The emotion that governs them is envy.\nNow, these are rough generalizations only, and no one member of the movement believes all these points, and, being a strongly anti-intellectual and pro-irrational bent, few of them even know what these big words mean. Some of these points contradict each other. That matters nothing to them. Logic is not their strong suit.",
  "tags": [
    "ELoE",
    "rabbitology",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-31T11:00:00+00:00"
}