{
  "url": "https://voxday.net/2014/07/22/facets-of-false-rhetoric/",
  "scraped_at": "2025-12-16T12:21:33.613925",
  "title": "The Facets of False Rhetoric",
  "date_display": "July 22, 2014",
  "date_iso": "2014-07-22T06:10:00+00:00",
  "date_from_url": "2014-07-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Something I’ve noticed over nearly 15 years of being involved in polemics on various subjects is that a certain rhetorical pattern reliably emerges on the side that has the weaker case, especially when it has the benefit of mainstream endorsement. I’ve named the elements of this pattern the Facets of False Rhetoric.</p><ol><li>It tends to refrain from specifically mentioning the advocates, adherents, and works of the other side.</li><li>When it does mention them, it is primarily in an effort to disqualify them in some way rather than substantively addressing them.</li><li>It fails to directly address the relevant points raised, and instead tends to mischaracterize them.</li><li>It regularly sets up straw men and attacks them in lieu of the actual arguments presented. It often resorts to bait-and-switches and hides behind ambiguity.</li><li>It falsely claims the other side is ignorant or misguided on the basis of petty irrelevancies and ignores the fact that the other side is discussing substantive matters in sufficient detail to belie any such charges.</li><li>The other side is declared to be “dangerous” for reasons that are seldom specified or substantiated.</li></ol><p>I’ve seen this pattern at work in the American political discourse. I’ve seen it in the atheism discourse. I’ve seen it in the Theorum of Evolution by Natural Selection and Various Other Means discourse. I’ve seen it in the global warming discourse. I’ve seen it in the economic discourse. I’ve seen it in the EU discourse. I’ve even seen it in what passes for the science fiction and fantasy discourse.</p><p>And every single time, it has been the behavior exhibited by the side that I consider to have the observably inferior case. In fact, it has reached the point that when I witness such behavior on the part of an advocate, I now consider it a reliable indicator of being fundamentally wrong even when I don’t know the subject.</p><p>For reasons that will eventually become clear, I have been reading up on what is known among military theorists as 4th Generation War. This is a highly relevant topic these days, as both the undeclared wars in Ukraine and Gaza are direct examples of 4th Generation asymmetric wars between a state actor and a non-state actor. Even the media headlines appear to be ripped out of articles on 4th Gen theory, such as the New York Times piece today: “Israel Is Facing Difficult Choice in Gaza Conflict”.</p><p>So, it was with some initial puzzlement, followed by a growing sense of recognition, that I read Antulio Echevarria’s <i>Fourth-Generation Warfare and Other Myths</i>, published by the Strategic Studies Institute at the U.S. Army War College.  Consider the boxes checked.</p><p>1. There are eleven references in 17 pages to mysterious “proponents”. Not until we get to the footnotes at the end is there a mention of William S. Lind, the most well-known proponent of 4GW, or of Keith Nightengale, John F. Schmitt, Joseph W. Sutton, and Gary I. Wilson, his co-authors of the seminal 1989 article in the Marine Corps Gazette. Col Thomas Hammes merits a pair of mentions in a single paragraph, only to set up checkbox number two.</p><p>2. From the Foreword: “He argues that the proponents of 4GW undermine their own credibility by subscribing to this bankrupt theory.”</p><p>“However, the tool that [Hammes] employs undermines his credibility. In fact, the theory of 4GW only undermines the credibility of anyone who employs it….”</p><p>“The proponents of 4GW failed to perceive this particular flaw in their reasoning because they did not review their theory critically….”</p><p>“this new incarnation repeats many of the theory’s old errors, some of which we have not yet discussed.”</p><p>“it is rather curious that the history and analyses that 4GW theorists hang on current insurgencies should be so deeply flawed.”</p><p>3. The author goes on at length about the nonexistence of nontrinitarian warfare and what he calls “the myth of Westphalia”, neither of which have anything substantive to do with 4GW theory. Westphalia merely serves as a useful starting point from which the state began <i>claiming </i>a monopoly on warfare, it’s completely irrelevant otherwise. I was astonished to observe that the author never even mentions what the four generations of 4GW are, let alone attempts to explain why they are a myth.</p><p>4. The fact that the Germans never formally incorporated the blitzkrieg<br> concept into their military doctrine doesn’t change the observable fact<br> that the Germans did, in fact, adopt a maneuver-and-initiative based<br> model to replace the centralized steel-on-target, command-and-control<br> French model to which the U.S. Army, Navy, and Air Force still<br> subscribe.</br></br></br></br></br></p><p>5.  “The fact that 4GW theorists are not aware of this work, or at least do not acknowledge it, should give us pause indeed. They have not kept up with the scholarship on unconventional wars, nor with changes in the historical interpretations of conventional wars. Their logic is too narrowly focused and irredeemably flawed. In any case, the wheel they have been reinventing will never turn.”</p><p>6.  “the theory has several fundamental flaws that need to be exposed before they<br> can cause harm to U.S. operational and strategic thinking.”</br></p><p>“despite a number of profound and incurable flaws, the theory’s proponents continue to push it, an activity that only saps intellectual energy badly needed<br> elsewhere.”</br></p><p>I am not a military expert, but one doesn’t have to be one to recognize the way in which this critic is setting off a smokescreen rather than engaging in a substantive critique, let alone presenting a conclusive rebuttal.</p><p>(NB: for future reference, the first cretin to say “Link?” is going in the spam file. If you can’t figure out how to use bloody Google, then immediately stop reading this blog and never, ever attempt to comment here again. Google or don’t Google for confirmation as you see fit, believe that I am accurately quoting the subject matter or not as you like, but do not EVER ask me for a “Link?” It’s obnoxious and the answer is always “No”.)</p><p>That being said, William S. Lind wrote a response to Echevarria’s article, which I did not read until after writing this post above. Compare the checkboxes ticked in the article compared to <a href=\"http://www.dnipogo.org/lind/lind_1_25_06.htm\">Lind’s response</a>. From literally the first paragraph, the differences are observable.</p><blockquote class=\"tr_bq\"><p> Dr. Antulio J. Echevarria, II is a Director at the<br> Strategic Studies Institute, the U.S. Army War College’s think tank,<br> and the author of an excellent book, <i>After Clausewitz: German Military<br> Thinkers before the Great War</br></i>. It was therefore both a surprise<br> and a disappointment to find that his recent paper, <i>Fourth-Generation<br> War and Other Myths</br></i>, is really, really ugly. Far from being a sober,<br> scholarly appraisal, it is a rant, a screed, a red herring seemingly<br> written to convince people not to think about 4GW at all. It is built<br> from a series of straw men, so many that in the end it amounts to a<br> straw giant.</br></br></br></br></br></br></br></p></blockquote><p>I suspect it would be useful to further develop this pattern of critical observation, add additional checkboxes, and see how reliable it is across disciplines and subject matters. If anyone has any insights into this, I’d be interested in hearing them. I feel this may be Vox’s Third Law of Critical Dynamics taking shape, but I have not yet articulated it in a form I find both succinct and satisfying.</p><p>First Law: Any sufficiently advanced intelligence is indistinguishable from insanity.<br> Second Law: If I can imagine it, it must be assumed<br> true. If you can’t conclusively prove it, it must be assumed false.<br> Third Law (first draft): The probability of a position’s falsehood increases with the number of applicable facets of false rhetoric.</br></br></br></p></div>",
  "content_text": "Something I’ve noticed over nearly 15 years of being involved in polemics on various subjects is that a certain rhetorical pattern reliably emerges on the side that has the weaker case, especially when it has the benefit of mainstream endorsement. I’ve named the elements of this pattern the Facets of False Rhetoric.\nIt tends to refrain from specifically mentioning the advocates, adherents, and works of the other side.\nWhen it does mention them, it is primarily in an effort to disqualify them in some way rather than substantively addressing them.\nIt fails to directly address the relevant points raised, and instead tends to mischaracterize them.\nIt regularly sets up straw men and attacks them in lieu of the actual arguments presented. It often resorts to bait-and-switches and hides behind ambiguity.\nIt falsely claims the other side is ignorant or misguided on the basis of petty irrelevancies and ignores the fact that the other side is discussing substantive matters in sufficient detail to belie any such charges.\nThe other side is declared to be “dangerous” for reasons that are seldom specified or substantiated.\nI’ve seen this pattern at work in the American political discourse. I’ve seen it in the atheism discourse. I’ve seen it in the Theorum of Evolution by Natural Selection and Various Other Means discourse. I’ve seen it in the global warming discourse. I’ve seen it in the economic discourse. I’ve seen it in the EU discourse. I’ve even seen it in what passes for the science fiction and fantasy discourse.\nAnd every single time, it has been the behavior exhibited by the side that I consider to have the observably inferior case. In fact, it has reached the point that when I witness such behavior on the part of an advocate, I now consider it a reliable indicator of being fundamentally wrong even when I don’t know the subject.\nFor reasons that will eventually become clear, I have been reading up on what is known among military theorists as 4th Generation War. This is a highly relevant topic these days, as both the undeclared wars in Ukraine and Gaza are direct examples of 4th Generation asymmetric wars between a state actor and a non-state actor. Even the media headlines appear to be ripped out of articles on 4th Gen theory, such as the New York Times piece today: “Israel Is Facing Difficult Choice in Gaza Conflict”.\nSo, it was with some initial puzzlement, followed by a growing sense of recognition, that I read Antulio Echevarria’s\nFourth-Generation Warfare and Other Myths\n, published by the Strategic Studies Institute at the U.S. Army War College.  Consider the boxes checked.\n1. There are eleven references in 17 pages to mysterious “proponents”. Not until we get to the footnotes at the end is there a mention of William S. Lind, the most well-known proponent of 4GW, or of Keith Nightengale, John F. Schmitt, Joseph W. Sutton, and Gary I. Wilson, his co-authors of the seminal 1989 article in the Marine Corps Gazette. Col Thomas Hammes merits a pair of mentions in a single paragraph, only to set up checkbox number two.\n2. From the Foreword: “He argues that the proponents of 4GW undermine their own credibility by subscribing to this bankrupt theory.”\n“However, the tool that [Hammes] employs undermines his credibility. In fact, the theory of 4GW only undermines the credibility of anyone who employs it….”\n“The proponents of 4GW failed to perceive this particular flaw in their reasoning because they did not review their theory critically….”\n“this new incarnation repeats many of the theory’s old errors, some of which we have not yet discussed.”\n“it is rather curious that the history and analyses that 4GW theorists hang on current insurgencies should be so deeply flawed.”\n3. The author goes on at length about the nonexistence of nontrinitarian warfare and what he calls “the myth of Westphalia”, neither of which have anything substantive to do with 4GW theory. Westphalia merely serves as a useful starting point from which the state began\nclaiming\na monopoly on warfare, it’s completely irrelevant otherwise. I was astonished to observe that the author never even mentions what the four generations of 4GW are, let alone attempts to explain why they are a myth.\n4. The fact that the Germans never formally incorporated the blitzkrieg\nconcept into their military doctrine doesn’t change the observable fact\nthat the Germans did, in fact, adopt a maneuver-and-initiative based\nmodel to replace the centralized steel-on-target, command-and-control\nFrench model to which the U.S. Army, Navy, and Air Force still\nsubscribe.\n5.  “The fact that 4GW theorists are not aware of this work, or at least do not acknowledge it, should give us pause indeed. They have not kept up with the scholarship on unconventional wars, nor with changes in the historical interpretations of conventional wars. Their logic is too narrowly focused and irredeemably flawed. In any case, the wheel they have been reinventing will never turn.”\n6.  “the theory has several fundamental flaws that need to be exposed before they\ncan cause harm to U.S. operational and strategic thinking.”\n“despite a number of profound and incurable flaws, the theory’s proponents continue to push it, an activity that only saps intellectual energy badly needed\nelsewhere.”\nI am not a military expert, but one doesn’t have to be one to recognize the way in which this critic is setting off a smokescreen rather than engaging in a substantive critique, let alone presenting a conclusive rebuttal.\n(NB: for future reference, the first cretin to say “Link?” is going in the spam file. If you can’t figure out how to use bloody Google, then immediately stop reading this blog and never, ever attempt to comment here again. Google or don’t Google for confirmation as you see fit, believe that I am accurately quoting the subject matter or not as you like, but do not EVER ask me for a “Link?” It’s obnoxious and the answer is always “No”.)\nThat being said, William S. Lind wrote a response to Echevarria’s article, which I did not read until after writing this post above. Compare the checkboxes ticked in the article compared to\nLind’s response\n. From literally the first paragraph, the differences are observable.\nDr. Antulio J. Echevarria, II is a Director at the\nStrategic Studies Institute, the U.S. Army War College’s think tank,\nand the author of an excellent book,\nAfter Clausewitz: German Military\nThinkers before the Great War\n. It was therefore both a surprise\nand a disappointment to find that his recent paper,\nFourth-Generation\nWar and Other Myths\n, is really, really ugly. Far from being a sober,\nscholarly appraisal, it is a rant, a screed, a red herring seemingly\nwritten to convince people not to think about 4GW at all. It is built\nfrom a series of straw men, so many that in the end it amounts to a\nstraw giant.\nI suspect it would be useful to further develop this pattern of critical observation, add additional checkboxes, and see how reliable it is across disciplines and subject matters. If anyone has any insights into this, I’d be interested in hearing them. I feel this may be Vox’s Third Law of Critical Dynamics taking shape, but I have not yet articulated it in a form I find both succinct and satisfying.\nFirst Law: Any sufficiently advanced intelligence is indistinguishable from insanity.\nSecond Law: If I can imagine it, it must be assumed\ntrue. If you can’t conclusively prove it, it must be assumed false.\nThird Law (first draft): The probability of a position’s falsehood increases with the number of applicable facets of false rhetoric.",
  "tags": [
    "philosophy",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-22T05:10:00+00:00"
}