{
  "url": "https://voxday.net/2014/07/26/flirting-with-hultgreen-curie/",
  "scraped_at": "2025-12-16T12:22:01.524570",
  "title": "Flirting with Hultgreen-Curie",
  "date_display": "July 26, 2014",
  "date_iso": "2014-07-26T09:25:00+00:00",
  "date_from_url": "2014-07-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>On the plus side, at least she didn’t manage to get herself killed while sinking the ship. Compared to the average female pioneer, the soon-to-be ex-commander is <a href=\"http://www.dailymail.co.uk/news/article-2706260/First-woman-commander-Navy-warship-sent-home-affair-male-officer-board.html\">practically a success story</a>:</p><blockquote class=\"tr_bq\"><p> The first female commander of a Royal Navy warship has been sent home after allegedly having an affair with another officer. Commander Sarah West, 42, took charge of the frigate HMS Portland in May 2012, but has been sent home from duty after claims she was having a relationship with a male officer on the same ship.</p><p>This would breach the Armed Forces’ Code of Social Conduct, which prohibits personnel from having relationships with subordinates if they compromise ‘operational effectiveness’. While the Royal Navy is investigating the affair, Cdr West, from Grimsby, Lincolnshire, retains her position as commander of HMS Portland. It is not known whether the male officer is married.</p></blockquote><p>It’s certainly an interesting idea to have warships commanded by women. It poses a fascinating question: does the entire ship stay in port when the captain pulls <a href=\"http://rhrealitycheck.org/article/2013/01/29/baby-on-board-us-navy-reacts-to-high-rates-unplanned-pregnancies-among-sailors/\">the common Navy trick</a> of getting herself pregnant right before a scheduled deployment? Since Commander West was “sent home from duty” but “retains her position as commander of HMS Portland”, I suppose we have our answer. This may prove a whole new front of 4GW.</p><p>“Mr. Lee, this is your mission. You are ordered to seduce and impregnate Captain Mary Wettlaufer, commanding officer of the USS Stennis. Our informants report that her carrier group is being sent to the South China Sea. Under no circumstances can the Stennis be permitted to leave Bremerton!”</p><p>“Yes, sir. This agent will do his duty, sir. But what is in this bottle, suicide pills?”</p><p>“Viagra, Mr. Lee. I fear you will need it, as Captain Wettlaufer is said to put the “dog” into “running dogs of capitalism”… your sacrifice in this regard will be noted by the Party and the Central Committee.”</p></div>",
  "content_text": "On the plus side, at least she didn’t manage to get herself killed while sinking the ship. Compared to the average female pioneer, the soon-to-be ex-commander is\npractically a success story\n:\nThe first female commander of a Royal Navy warship has been sent home after allegedly having an affair with another officer. Commander Sarah West, 42, took charge of the frigate HMS Portland in May 2012, but has been sent home from duty after claims she was having a relationship with a male officer on the same ship.\nThis would breach the Armed Forces’ Code of Social Conduct, which prohibits personnel from having relationships with subordinates if they compromise ‘operational effectiveness’. While the Royal Navy is investigating the affair, Cdr West, from Grimsby, Lincolnshire, retains her position as commander of HMS Portland. It is not known whether the male officer is married.\nIt’s certainly an interesting idea to have warships commanded by women. It poses a fascinating question: does the entire ship stay in port when the captain pulls\nthe common Navy trick\nof getting herself pregnant right before a scheduled deployment? Since Commander West was “sent home from duty” but “retains her position as commander of HMS Portland”, I suppose we have our answer. This may prove a whole new front of 4GW.\n“Mr. Lee, this is your mission. You are ordered to seduce and impregnate Captain Mary Wettlaufer, commanding officer of the USS Stennis. Our informants report that her carrier group is being sent to the South China Sea. Under no circumstances can the Stennis be permitted to leave Bremerton!”\n“Yes, sir. This agent will do his duty, sir. But what is in this bottle, suicide pills?”\n“Viagra, Mr. Lee. I fear you will need it, as Captain Wettlaufer is said to put the “dog” into “running dogs of capitalism”… your sacrifice in this regard will be noted by the Party and the Central Committee.”",
  "tags": [
    "Hultgreen-Curie Syndrome"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-26T08:25:00+00:00"
}