{
  "url": "https://voxday.net/2014/07/12/foreign-policy-as-humane-society/",
  "scraped_at": "2025-12-16T12:20:29.571432",
  "title": "Foreign policy as Humane Society",
  "date_display": "July 12, 2014",
  "date_iso": "2014-07-12T10:43:00+00:00",
  "date_from_url": "2014-07-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>William S. Lind observes that the Obama administration’s foreign policy is not so much ill-advised as <a href=\"https://www.traditionalright.com/the-view-from-olympus-an-animal-shelter-foreign-policy/\">precisely backward</a>:</p><blockquote class=\"tr_bq\"><p> After meeting with Ukraine’s newly elected president, Petro O.<br> Poroshenko, President Obama added, “The United States is absolutely<br> committed to standing behind the Ukrainian people and their aspirations,<br> not just in the coming days and weeks but in the coming years.”<br> Unaccountably, Ruritania and Graustark were forgotten.</br></br></br></br></p><p>This is an animal shelter foreign policy. Based entirely on<br> sentiment, we are taking in any and every little country that somehow<br> feels threatened by a state that actually counts. We equally “stand<br> with” Vietnam and the Philippines against China, in an area long known<br> as the South China Sea. Just what “standing with” means is left vague.<br> Does it mean that if they get knocked down, we’re in a fight with<br> whomever threw the punch? If so, the Obama administration is making one<br> of the worst foreign policy errors a country can make, casually and<br> thoughtlessly offering commitments that can lead to war.</br></br></br></br></br></br></br></br></p><p>Even apart from that risk, we are making a fundamental mistake. These<br> little countries can do nothing for us. A commitment to them benefits<br> them, but does absolutely nothing for us. It is to such a “giveaway”<br> foreign policy that sentiment invariably leads.</br></br></br></p></blockquote><p>This tripwires have historically proven to be one of the primary causes of war for centuries; the fact that various administrations have so eagerly committed US military forces on behalf of small countries of no possible national interest to the American people tends to indicate that war is the ultimate purpose of making these commitments.</p><p>As Lind notes: “History shows over and over again that foreign policies based on<br> sentiment lead to disaster….<br> Whether or not we “like” the current governments of Russia and China,<br> our relations with them involve very important interests. We have no<br> important interests at stake in Ukraine, or Poland, or the Baltics, or<br> Vietnam, or the Philippines.”</br></br></br></br></br></p><p>It’s understandable why the governments of these little countries would instinctively seek out the “protection” of military commitments from larger countries, but they before electing to do so they would do well to keep in mind the usual fate of a dog sent to a shelter. It is dangerous to be the USA’s enemy. But as governments from Vietnam to Iraq have learned, it can be fatal to be the USA’s ally.</p></div>",
  "content_text": "William S. Lind observes that the Obama administration’s foreign policy is not so much ill-advised as\nprecisely backward\n:\nAfter meeting with Ukraine’s newly elected president, Petro O.\nPoroshenko, President Obama added, “The United States is absolutely\ncommitted to standing behind the Ukrainian people and their aspirations,\nnot just in the coming days and weeks but in the coming years.”\nUnaccountably, Ruritania and Graustark were forgotten.\nThis is an animal shelter foreign policy. Based entirely on\nsentiment, we are taking in any and every little country that somehow\nfeels threatened by a state that actually counts. We equally “stand\nwith” Vietnam and the Philippines against China, in an area long known\nas the South China Sea. Just what “standing with” means is left vague.\nDoes it mean that if they get knocked down, we’re in a fight with\nwhomever threw the punch? If so, the Obama administration is making one\nof the worst foreign policy errors a country can make, casually and\nthoughtlessly offering commitments that can lead to war.\nEven apart from that risk, we are making a fundamental mistake. These\nlittle countries can do nothing for us. A commitment to them benefits\nthem, but does absolutely nothing for us. It is to such a “giveaway”\nforeign policy that sentiment invariably leads.\nThis tripwires have historically proven to be one of the primary causes of war for centuries; the fact that various administrations have so eagerly committed US military forces on behalf of small countries of no possible national interest to the American people tends to indicate that war is the ultimate purpose of making these commitments.\nAs Lind notes: “History shows over and over again that foreign policies based on\nsentiment lead to disaster….\nWhether or not we “like” the current governments of Russia and China,\nour relations with them involve very important interests. We have no\nimportant interests at stake in Ukraine, or Poland, or the Baltics, or\nVietnam, or the Philippines.”\nIt’s understandable why the governments of these little countries would instinctively seek out the “protection” of military commitments from larger countries, but they before electing to do so they would do well to keep in mind the usual fate of a dog sent to a shelter. It is dangerous to be the USA’s enemy. But as governments from Vietnam to Iraq have learned, it can be fatal to be the USA’s ally.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-12T09:43:00+00:00"
}