{
  "url": "https://voxday.net/2014/07/29/gamma-spin-in-action/",
  "scraped_at": "2025-12-16T12:22:25.559009",
  "title": "Gamma spin in action",
  "date_display": "July 29, 2014",
  "date_iso": "2014-07-29T17:00:00+00:00",
  "date_from_url": "2014-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here is how Dave Futrelle <a href=\"http://wehuntedthemammoth.com/2014/07/27/vox-day-defeats-me-in-debate-with-brilliant-youre-a-loser-who-cant-get-laid-and-also-women-shouldnt-vote-argument/\">attempted to characterize the abortive debate </a>on women’s suffrage <a href=\"http://alphagameplan.blogspot.com/2014/07/exposing-critic-of-game.html\">I posted at Alpha Game</a>, which he fled once it became apparent that he couldn’t get away with simply declaring himself the winner and would have to actually make a coherent case in support of female suffrage instead:</p><blockquote class=\"tr_bq\"><p> The very notion of two dudes earnestly debating female suffrage – in 2014, no less – struck me as beyond absurd, so I sent back what I thought was an appropriately dismissive Tweet.</p><p><i>    @voxday @RedPillPhil @heartiste Yes, women should have voting rights, because they, like men, are human. I win the debate! The end.Thanks!—<br>    David Futrelle (@DavidFutrelle) July 25, 2014</br></i></p><p>Apparently Mr. Day saw this tweet as my opening gambit in a debate that was now on, and replied with an attempted gotcha. Against my better judgment, I replied:</p><p><i>    @voxday @RedPillPhil @heartiste No. I vote where I live, in the US.. So are you contending that no women live in the countries they vote in?—<br>    David Futrelle (@DavidFutrelle) July 25, 2014</br></i></p><p>He replied, and I sunk deeper into the quicksand of this ridiculous “debate.”</p><p><i>    @voxday @RedPillPhil @heartiste There are a few basic requirements for having the right to vote besides being human but being male isn’t one—<br>    David Futrelle (@DavidFutrelle) July 26, 2014</br></i></p><p>At this point I realized I needed to shut this thing down as quickly as possible. So I posted a couple of quick tweets:</p><p><i>David Futrelle<br>There are a few basic requirements for having the right to vote besides being human but being male isn’t one</br></i></p><p>David Futrelle<br>There is no reasonable reason to deny anyone the vote because of gender.</br></p><p>David Futrelle<br>… and that’s preetty much the end of the argument, despite whatever spurious reason you come up with to deny women the vote. Debate over. </br></p></blockquote><p>This is classic Gamma behavior. Their fear of failure is so great that in the rare instance they don’t completely avoid conflict, they engage only insofar as they can later claim that they weren’t really trying. They want their audience to believe that, of course, they COULD have roundly defeated their opponent, but they couldn’t bother for [insert excuse here]. Of course, they somehow always find the time to explain their various justifications for not really trying, which often takes longer than simply engaging in the first place would have.</p><p>Notice how Futrelle falsely claims I said I defeated him in the debate. That’s absolutely untrue. All I did was expose his inability to hold his own or to make his case on the subject. My only claim was this: “I was able to show Futrelle’s reasoning to be incorrect twice.”  Which was undeniably true. There was no winner of the debate since it never reached a conclusion. Futrelle simply ran away and now he is trying to provide a narrative to justify that abject retreat.</p><p>Futrelle’s fellow Gamma male, PZ, who has run away from a few debates himself, was quick to <a href=\"http://freethoughtblogs.com/pharyngula/2014/07/28/i-must-be-a-gamma-too\">embrace Futrelle’s narrative</a>:</p><blockquote class=\"tr_bq\"><p> Actually, Day proposed a debate on a subject that was settled in the USA about 95 years ago, and Futrelle laughed dismissively, and Vox Day declared himself the winner.</p><p><i>“Critics such as Futrelle and Scalzi are of low socio-sexual rank, which means that they have the usual gamma male’s distaste for conflict that has a clear winner. The reason is that as long as they can avoid losing, they can still claim victory in their delusional gamma style.”</i></p><p>Wait. But it was Vox Day who threw out a few non sequiturs and declared himself winner…this is confusing.</p></blockquote><p>Again, note that I did absolutely nothing of the sort. It may be helpful to be reminded of the Gamma male’s core mindset, as provided by a self-admitted former Gamma male: <i>“It’s not about being stupid, or even a chubby nerd, it’s about lying to yourself relentlessly about what’s right in front of your eyes.”</i></p><p>That’s how Gammas like Futrelle and Myers can lie so blatantly about me declaring myself the winner when in fact Futrelle was the only one who did so. They relentlessly lie, to others and themselves, because the truth is too painful for them to accept. Notice, too, that only one commenter on PZ’s site points out the obvious; other than him, no one calls them on their observable lies.</p><p>Can you even imagine that happening here? On a complete tangent, this pair of comments made me laugh:</p><blockquote class=\"tr_bq\"><p> daintydougal<br> rhetoric is no substitute for dialectic rhetoric is no substitute for dialectic… *head kasplodes*</br></p><p>fibinachi <br> Yeah! I second daintydougal. Out of all that, that’s the one that threw me off the most too. Just wow.</br></p></blockquote><p>Keep in mind that these are the people who claim to be the intelligent and educated side. Then again, we were warned:</p><p><i>“[B]efore some audiences not even the possession<br> of the exactest knowledge will make it easy for what we say to produce conviction. For argument based on knowledge<br> implies instruction, and there are people whom one cannot instruct.”</br></br></i></p></div>",
  "content_text": "Here is how Dave Futrelle\nattempted to characterize the abortive debate\non women’s suffrage\nI posted at Alpha Game\n, which he fled once it became apparent that he couldn’t get away with simply declaring himself the winner and would have to actually make a coherent case in support of female suffrage instead:\nThe very notion of two dudes earnestly debating female suffrage – in 2014, no less – struck me as beyond absurd, so I sent back what I thought was an appropriately dismissive Tweet.\n@voxday @RedPillPhil @heartiste Yes, women should have voting rights, because they, like men, are human. I win the debate! The end.Thanks!—\nDavid Futrelle (@DavidFutrelle) July 25, 2014\nApparently Mr. Day saw this tweet as my opening gambit in a debate that was now on, and replied with an attempted gotcha. Against my better judgment, I replied:\n@voxday @RedPillPhil @heartiste No. I vote where I live, in the US.. So are you contending that no women live in the countries they vote in?—\nDavid Futrelle (@DavidFutrelle) July 25, 2014\nHe replied, and I sunk deeper into the quicksand of this ridiculous “debate.”\n@voxday @RedPillPhil @heartiste There are a few basic requirements for having the right to vote besides being human but being male isn’t one—\nDavid Futrelle (@DavidFutrelle) July 26, 2014\nAt this point I realized I needed to shut this thing down as quickly as possible. So I posted a couple of quick tweets:\nDavid Futrelle\nThere are a few basic requirements for having the right to vote besides being human but being male isn’t one\nDavid Futrelle\nThere is no reasonable reason to deny anyone the vote because of gender.\nDavid Futrelle\n… and that’s preetty much the end of the argument, despite whatever spurious reason you come up with to deny women the vote. Debate over.\nThis is classic Gamma behavior. Their fear of failure is so great that in the rare instance they don’t completely avoid conflict, they engage only insofar as they can later claim that they weren’t really trying. They want their audience to believe that, of course, they COULD have roundly defeated their opponent, but they couldn’t bother for [insert excuse here]. Of course, they somehow always find the time to explain their various justifications for not really trying, which often takes longer than simply engaging in the first place would have.\nNotice how Futrelle falsely claims I said I defeated him in the debate. That’s absolutely untrue. All I did was expose his inability to hold his own or to make his case on the subject. My only claim was this: “I was able to show Futrelle’s reasoning to be incorrect twice.”  Which was undeniably true. There was no winner of the debate since it never reached a conclusion. Futrelle simply ran away and now he is trying to provide a narrative to justify that abject retreat.\nFutrelle’s fellow Gamma male, PZ, who has run away from a few debates himself, was quick to\nembrace Futrelle’s narrative\n:\nActually, Day proposed a debate on a subject that was settled in the USA about 95 years ago, and Futrelle laughed dismissively, and Vox Day declared himself the winner.\n“Critics such as Futrelle and Scalzi are of low socio-sexual rank, which means that they have the usual gamma male’s distaste for conflict that has a clear winner. The reason is that as long as they can avoid losing, they can still claim victory in their delusional gamma style.”\nWait. But it was Vox Day who threw out a few non sequiturs and declared himself winner…this is confusing.\nAgain, note that I did absolutely nothing of the sort. It may be helpful to be reminded of the Gamma male’s core mindset, as provided by a self-admitted former Gamma male:\n“It’s not about being stupid, or even a chubby nerd, it’s about lying to yourself relentlessly about what’s right in front of your eyes.”\nThat’s how Gammas like Futrelle and Myers can lie so blatantly about me declaring myself the winner when in fact Futrelle was the only one who did so. They relentlessly lie, to others and themselves, because the truth is too painful for them to accept. Notice, too, that only one commenter on PZ’s site points out the obvious; other than him, no one calls them on their observable lies.\nCan you even imagine that happening here? On a complete tangent, this pair of comments made me laugh:\ndaintydougal\nrhetoric is no substitute for dialectic rhetoric is no substitute for dialectic… *head kasplodes*\nfibinachi\nYeah! I second daintydougal. Out of all that, that’s the one that threw me off the most too. Just wow.\nKeep in mind that these are the people who claim to be the intelligent and educated side. Then again, we were warned:\n“[B]efore some audiences not even the possession\nof the exactest knowledge will make it easy for what we say to produce conviction. For argument based on knowledge\nimplies instruction, and there are people whom one cannot instruct.”",
  "tags": [
    "Alpha Game",
    "debate"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-29T16:00:00+00:00"
}