{
  "url": "https://voxday.net/2014/07/14/high-iqs-and-theis/",
  "scraped_at": "2025-12-16T12:20:44.592707",
  "title": "High IQs and theism",
  "date_display": "July 14, 2014",
  "date_iso": "2014-07-14T21:52:00+00:00",
  "date_from_url": "2014-07-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is no surprise. As I’ve <a href=\"http://www.milobookclub.com/2014/01/15/mailvox-distribution-of-atheis/\">shown in the past</a>, “there are 11.4x more +2SD theists who either know God exists or believe<br> God exists despite having the occasional doubt than there are +2SD<br> atheists who don’t believe God exists.”</br></br></p><blockquote class=\"tr_bq\"><p> Have you ever heard the claim “all smart people are atheists”, or maybe<br> its inverse: “people who believe in God are dumb”? It’s quite a<br> pervasive urban legend, and one which I’ve known is false for a long<br> time, but I didn’t realize just how false until the other day. I<br> recently decided to do a quick cataloging of the ten highest IQ’s on<br> earth, and discovered that <a href=\"http://www.examiner.com/article/of-10-highest-iq-s-on-earth-at-least-8-are-theists-at-least-6-are-christians\">it’s nearly the exact opposite of the truth</a>!</br></br></br></br></br></p></blockquote><p>The appeal to intelligence is a fallacy. But, any atheist who makes it is not only violating logic, he’s also demonstrating his own ignorance.</p></div>",
  "content_text": "This is no surprise. As I’ve\nshown in the past\n, “there are 11.4x more +2SD theists who either know God exists or believe\nGod exists despite having the occasional doubt than there are +2SD\natheists who don’t believe God exists.”\nHave you ever heard the claim “all smart people are atheists”, or maybe\nits inverse: “people who believe in God are dumb”? It’s quite a\npervasive urban legend, and one which I’ve known is false for a long\ntime, but I didn’t realize just how false until the other day. I\nrecently decided to do a quick cataloging of the ten highest IQ’s on\nearth, and discovered that\nit’s nearly the exact opposite of the truth\n!\nThe appeal to intelligence is a fallacy. But, any atheist who makes it is not only violating logic, he’s also demonstrating his own ignorance.",
  "tags": [
    "atheism",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-14T20:52:00+00:00"
}