{
  "url": "https://voxday.net/2014/07/27/how-to-win-debate-every-time/",
  "scraped_at": "2025-12-16T12:22:10.701584",
  "title": "How to win a debate every time",
  "date_display": "July 27, 2014",
  "date_iso": "2014-07-27T17:16:00+00:00",
  "date_from_url": "2014-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>David Futrelle demonstrates his mastery of dialectic in a remarkably brief debate with me concerning women’s suffrage on Twitter:</p><blockquote class=\"tr_bq\"><p> David Futrelle<br>I’ll take on any “dark enlightenment” bloggers (that’s hard to say w/ a straight face) in a cat pic duel.</br></p><p>Vox Day<br>Why not take me on in an actual debate. An easy topic like: should women have voting rights?</br></p><p>David Futrelle<br>Yes, women should have voting rights, because they, like men, are human. I win the debate! The end. Thanks!</br></p><p>Vox Day<br>Sorry, David, you haven’t won yet. Yes, you are human. Did you vote in the recent EU elections?</br></p><p>David Futrelle<br>No. I vote where I live, in the US.. So are you contending that no women live in the countries they vote in?</br></p><p>Vox Day<br>I’m demonstrating to you that merely being human grants no voting rights. Do you concur?</br></p><p>David Futrelle<br>There are a few basic requirements for having the right to vote besides being human but being male isn’t one</br></p><p>David Futrelle<br>There is no reasonable reason to deny anyone the vote because of gender.</br></p><p>David Futrelle<br>… and that’s preetty much the end of the argument, despite whatever spurious reason you come up with to deny women the vote. Debate over.</br></p></blockquote><p>A performance for the ages! Socrates had nothing on this guy. I had no idea that simply begging the question was sufficient to declare a debate over and announce yourself the winner. But I can see where this tactic would be extremely useful and plan to incorporate it into all my online discourse in the future. I shall be unstoppable! There is <a href=\"http://alphagameplan.blogspot.com/2014/07/exposing-critic-of-game.html\">more at Alpha Game</a>.</p></div>",
  "content_text": "David Futrelle demonstrates his mastery of dialectic in a remarkably brief debate with me concerning women’s suffrage on Twitter:\nDavid Futrelle\nI’ll take on any “dark enlightenment” bloggers (that’s hard to say w/ a straight face) in a cat pic duel.\nVox Day\nWhy not take me on in an actual debate. An easy topic like: should women have voting rights?\nDavid Futrelle\nYes, women should have voting rights, because they, like men, are human. I win the debate! The end. Thanks!\nVox Day\nSorry, David, you haven’t won yet. Yes, you are human. Did you vote in the recent EU elections?\nDavid Futrelle\nNo. I vote where I live, in the US.. So are you contending that no women live in the countries they vote in?\nVox Day\nI’m demonstrating to you that merely being human grants no voting rights. Do you concur?\nDavid Futrelle\nThere are a few basic requirements for having the right to vote besides being human but being male isn’t one\nDavid Futrelle\nThere is no reasonable reason to deny anyone the vote because of gender.\nDavid Futrelle\n… and that’s preetty much the end of the argument, despite whatever spurious reason you come up with to deny women the vote. Debate over.\nA performance for the ages! Socrates had nothing on this guy. I had no idea that simply begging the question was sufficient to declare a debate over and announce yourself the winner. But I can see where this tactic would be extremely useful and plan to incorporate it into all my online discourse in the future. I shall be unstoppable! There is\nmore at Alpha Game\n.",
  "tags": [
    "debate"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-27T16:16:00+00:00"
}