{
  "url": "https://voxday.net/2014/07/25/how-do-you-say-taqqiya-in-hebrew/",
  "scraped_at": "2025-12-16T12:21:54.220249",
  "title": "How do you say “taqiyya” in Hebrew?",
  "date_display": "July 25, 2014",
  "date_iso": "2014-07-25T09:35:00+00:00",
  "date_from_url": "2014-07-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In the comments, Steve offered the excuse of superior motivation and “training” to explain the inordinate amount of Jewish success, first in Germany, now in the USA:</p><blockquote class=\"tr_bq\"><p> Whenever I read complaints about Jewish success, I wonder if people really want the totalitarian control which would be necessary to stop a high IQ, highly motivated, creative, hard working people from achieving it, because that is what is necessary to stop it. You have to give up your freedom to repress the successful and promote the mediocre and that is quite a price to pay, just because you don’t like Jewish billionaires or bankers or whatever. But as America has already travelled a way down that road (promotion of mediocre anyway), it probably won’t be too much of a stretch. In any event, a little secret for your readers. When Jews succeed they do not look around and say to themselves: “so many Jews have succeeded before me, I had better stop now, because the Gentiles around here are going to get mad.” There is no “group strategy” like that, – isn’t that what McDonald calls it? No they are trained to think: “if that Jew made it, I can make it – only faster and better.” Yes, that is the “secret” of the Jews. I myself don’t think lazy and stupid and resentful would be better, but from the looks of things, I may be in the distinct minority…  I just<br> think [ethnic nepotism] is complete BS.  Wanting to believe someone else succeeded<br> because someone else got the break.</br></br></p></blockquote><p>I pointed out that the real “secret” of Jewish success is that Jews “relentlessly and<br> ruthlessly promote other Jews at the expense of non-Jews while furiously<br> fighting to prevent any efforts of the majority to do the same.” Steve offers zero evidence in support of his assertions, raising numerous questions such as this one: do Jews actually work more hours in six days per week than every other group does in seven?</br></br></p><p>Now, there isn’t anything intrinsically wrong with favoring one’s own. It is normal human behavior. You see it in the NFL all the time; when Denny Green was hired as the Vikings head coach, the coaching staff suddenly went from being all-white to nearly half-black. Was that wrong? One could hardly criticize Green for bringing in the likes of Tony Dungy (later Super Bowl-winning head coach), Tyrone Willingham (later head coach at Stanford and Notre Dame), and Willie Shaw (Hall of Fame cornerback, father of current Stanford head coach David Shaw). And small groups will tend to stick together more successfully than large groups. But to simultaneously attempt to deny other groups the ability to do the same, and moreover, to deny doing what is observably being done, is both wrong and mendacious.</p><p>I’ve personally witnessed this in-group promotion in several different industries. To give one example, I have seen how the Littlest Chickenhawk was handed multiple opportunities to fail upward; he was nationally syndicated by Creators Syndicate as a teenager despite the fact that his WND column was banal and one of the least-read; my weekly readership there was <a href=\"http://www.milobookclub.com/2005/08/26/mailvox-weak-and-lame/\">4.1 times larger than his</a>. Now, at 30, he is editor-at-large of Breitbart News, guest hosts regularly for major talk show hosts, and appears regularly on news channels including CNN, Fox News, and Sun News Network in Canada. Is Ben Shapiro THAT much more talented or intelligent or insightful than I am? Than every other contributor at WND is? I doubt Shapiro himself would make such a claim?</p><p>And there is considerable evidence of that relentless in-group promotion described, both anecdotal and statistical. Ron Unz exposed the corruption in Ivy League admissions offices in an article entitled <a href=\"http://www.theamericanconservative.com/articles/the-myth-of-american-meritocracy/\">“The Myth of American Meritocracy”</a>:</p><blockquote class=\"tr_bq\"><p> Consider the case of Tiffany Wang, a Chinese immigrant student raised in the Silicon Valley area, where her father worked as an engineer. Although English was not her first language, her SAT scores were over 100 points above the Wesleyan average, and she ranked as a National Merit Scholarship semifinalist, putting her in the top 0.5 percent of high school students (not the top 2 percent as Steinberg mistakenly claims). Nevertheless, the admissions officer rated her just so-so in academics, and seemed far more positively impressed by her ethnic activism in the local school’s Asian-American club. Ultimately, he stamped her with a “Reject,” but later admitted to Steinberg that she might have been admitted if he had been aware of the enormous time and effort she had spent campaigning against the death penalty, a political cause near and dear to his own heart. Somehow I suspect that a student who boasted of leadership in pro-death penalty activism among his extracurriculars might have fared rather worse in this process. And presumably for similar reasons, Tiffany was also rejected by all her other prestigious college choices, including Yale, Penn, Duke, and Wellesley, an outcome which greatly surprised and disappointed her immigrant father….</p><p>Finally, there was the case of Becca Jannol, a girl from a very affluent Jewish family near Beverly Hills, who attended the same elite prep school as Julianna, but with her parents paying the full annual tuition. Despite her every possible advantage, including test-prep courses and retaking the exam, her SAT scores were some 240 points lower on the 1600 point scale, placing her toward the bottom of the Wesleyan range, while her application essay focused on the philosophical challenges she encountered when she was suspended for illegal drug use. But she was a great favorite of her prep school counselor, who was an old college friend of the Wesleyan admissions officer, and using his discretion, he stamped her “Admit.” Her dismal academic record then caused this initial decision to be overturned by a unanimous vote of the other members of the full admissions committee, but he refused to give up, and moved heaven and earth to gain her a spot, even offering to rescind the admissions of one or more already selected applicants to create a place for her. Eventually he got her shifted from the Reject category to wait-list status, after which he secretly moved her folder to the very top of the large waiting list pile.</p><p>In the end “connections” triumphed, and she received admission to Wesleyan, although she turned it down in favor of an offer from more prestigious Cornell, which she had obtained through similar means. But at Cornell, she found herself “miserable,” hating the classes and saying she “didn’t see the usefulness of [her] being there.” However, her poor academic ability proved no hindrance, since the same administrator who had arranged her admission also wrangled her a quick entrance into a special “honors program” he personally ran, containing just 40 of the 3500 students in her year. This exempted her from all academic graduation requirements, apparently including classes or tests, thereby allowing her to spend her four college years mostly traveling around the world while working on a so-called “special project.” After graduation, she eventually took a job at her father’s successful law firm, thereby realizing her obvious potential as a member of America’s ruling Ivy League elite, or in her own words, as being one of “the best of the best.”</p><p>Steinberg’s description of the remaining handful of Wesleyan applicants seems to fall into a very similar pattern, indicating that our elite admissions process operates under the principle of “Ideology and Diversity tempered by Corruption.” </p></blockquote><p>One wonders how many of the “honors” students shared her background. Steve and Miss Jannol may believe her “success” is the result of her innate Jewish superiority, but the facts demonstrate otherwise. And even the familiar appeals to intelligence are increasingly outdated; as the demographic math would indicate was bound to happen, Jews have been completely surpassed <a href=\"http://isteve.blogspot.ch/2010/09/national-merit-semifinalists-by-school.html\">by elite Asians</a> in the National Merit Scholarship program and have therefore resorted <a href=\"http://www.nytimes.com/roomfordebate/2012/12/19/fears-of-an-asian-quota-in-the-ivy-league/statistics-indicate-an-ivy-league-asian-quota\">to using the very sort of quotas</a> they once complained WASPs used to keep them out of the Ivy League.</p><p>As Unz observed:<i> “The last 20 years have brought a huge rise in the number of Asians<br> winning top academic awards in our high schools or being named National<br> Merit Scholarship semifinalists.  It seems quite suspicious that none of<br> trends have been reflected in their increased enrollment at Harvard and<br> other top Ivy League universities.”</br></br></br></br></i></p><p>These are the facts. Facts are not anti-semitic, they are merely the truth of the world as it is. And the truth, however uncomfortable, will be sought after and observed here: the more any commenter attempts to obscure the truth, the more I will take the time and effort required to expose whatever it is he is trying to hide. I had actually moved on from the subject until commenters like Steve started showing up and attempting to pass off transparent deceit as truth. And before Steve attempts to dig himself in any deeper, it may be helpful to keep in mind that I am one of those National Merit semifinalists and I am not easily baffled with bullshit. Every assertion made will require evidential support. Every statement made will be dissected, and every retreat into rhetoric will be noted as such.</p><p>For whatever reason, Steve is attempting to hide the observable fact that the inordinate success presently enjoyed by Jews in America is not the inevitable result of working harder, being more intelligent, or innate ethnic superiority, but is primarily due to a laudable dedication to in-group promotion being expressed in a variety of means, some legitimate, and some not. I assume he is doing so in an attempt to prevent an anti-semitic reaction, but whatever his motivation may be, I will point out that deception and misinformation do not work for long on those with open eyes and functional memories.</p><p>People are certainly free to ignore my warnings. Most have in the past and I assume most will in the future. But if Steve thinks Americans are going to meekly accept the financial pillaging of their nation any more tamely than the European nations historically have, especially when they have also suffered the demographic demolition of their country, I think he is woefully mistaken. And, I note, there are more than a few Jewish leaders who more or less <a href=\"http://www.milobookclub.com/2014/01/07/protocols-of-learned-elders-of-wye/\">agree with my concerns</a>.</p><p>It’s not a real problem yet. The difference between Israel’s disapproval rating in the USA and in France, (which is a reasonable proxy) is nearly 50 percent; 27 percent vs 65 percent. If that percentage begins to rise in the next five years, it will be an initial indication that my read of the situation is correct.</p></div>",
  "content_text": "In the comments, Steve offered the excuse of superior motivation and “training” to explain the inordinate amount of Jewish success, first in Germany, now in the USA:\nWhenever I read complaints about Jewish success, I wonder if people really want the totalitarian control which would be necessary to stop a high IQ, highly motivated, creative, hard working people from achieving it, because that is what is necessary to stop it. You have to give up your freedom to repress the successful and promote the mediocre and that is quite a price to pay, just because you don’t like Jewish billionaires or bankers or whatever. But as America has already travelled a way down that road (promotion of mediocre anyway), it probably won’t be too much of a stretch. In any event, a little secret for your readers. When Jews succeed they do not look around and say to themselves: “so many Jews have succeeded before me, I had better stop now, because the Gentiles around here are going to get mad.” There is no “group strategy” like that, – isn’t that what McDonald calls it? No they are trained to think: “if that Jew made it, I can make it – only faster and better.” Yes, that is the “secret” of the Jews. I myself don’t think lazy and stupid and resentful would be better, but from the looks of things, I may be in the distinct minority…  I just\nthink [ethnic nepotism] is complete BS.  Wanting to believe someone else succeeded\nbecause someone else got the break.\nI pointed out that the real “secret” of Jewish success is that Jews “relentlessly and\nruthlessly promote other Jews at the expense of non-Jews while furiously\nfighting to prevent any efforts of the majority to do the same.” Steve offers zero evidence in support of his assertions, raising numerous questions such as this one: do Jews actually work more hours in six days per week than every other group does in seven?\nNow, there isn’t anything intrinsically wrong with favoring one’s own. It is normal human behavior. You see it in the NFL all the time; when Denny Green was hired as the Vikings head coach, the coaching staff suddenly went from being all-white to nearly half-black. Was that wrong? One could hardly criticize Green for bringing in the likes of Tony Dungy (later Super Bowl-winning head coach), Tyrone Willingham (later head coach at Stanford and Notre Dame), and Willie Shaw (Hall of Fame cornerback, father of current Stanford head coach David Shaw). And small groups will tend to stick together more successfully than large groups. But to simultaneously attempt to deny other groups the ability to do the same, and moreover, to deny doing what is observably being done, is both wrong and mendacious.\nI’ve personally witnessed this in-group promotion in several different industries. To give one example, I have seen how the Littlest Chickenhawk was handed multiple opportunities to fail upward; he was nationally syndicated by Creators Syndicate as a teenager despite the fact that his WND column was banal and one of the least-read; my weekly readership there was\n4.1 times larger than his\n. Now, at 30, he is editor-at-large of Breitbart News, guest hosts regularly for major talk show hosts, and appears regularly on news channels including CNN, Fox News, and Sun News Network in Canada. Is Ben Shapiro THAT much more talented or intelligent or insightful than I am? Than every other contributor at WND is? I doubt Shapiro himself would make such a claim?\nAnd there is considerable evidence of that relentless in-group promotion described, both anecdotal and statistical. Ron Unz exposed the corruption in Ivy League admissions offices in an article entitled\n“The Myth of American Meritocracy”\n:\nConsider the case of Tiffany Wang, a Chinese immigrant student raised in the Silicon Valley area, where her father worked as an engineer. Although English was not her first language, her SAT scores were over 100 points above the Wesleyan average, and she ranked as a National Merit Scholarship semifinalist, putting her in the top 0.5 percent of high school students (not the top 2 percent as Steinberg mistakenly claims). Nevertheless, the admissions officer rated her just so-so in academics, and seemed far more positively impressed by her ethnic activism in the local school’s Asian-American club. Ultimately, he stamped her with a “Reject,” but later admitted to Steinberg that she might have been admitted if he had been aware of the enormous time and effort she had spent campaigning against the death penalty, a political cause near and dear to his own heart. Somehow I suspect that a student who boasted of leadership in pro-death penalty activism among his extracurriculars might have fared rather worse in this process. And presumably for similar reasons, Tiffany was also rejected by all her other prestigious college choices, including Yale, Penn, Duke, and Wellesley, an outcome which greatly surprised and disappointed her immigrant father….\nFinally, there was the case of Becca Jannol, a girl from a very affluent Jewish family near Beverly Hills, who attended the same elite prep school as Julianna, but with her parents paying the full annual tuition. Despite her every possible advantage, including test-prep courses and retaking the exam, her SAT scores were some 240 points lower on the 1600 point scale, placing her toward the bottom of the Wesleyan range, while her application essay focused on the philosophical challenges she encountered when she was suspended for illegal drug use. But she was a great favorite of her prep school counselor, who was an old college friend of the Wesleyan admissions officer, and using his discretion, he stamped her “Admit.” Her dismal academic record then caused this initial decision to be overturned by a unanimous vote of the other members of the full admissions committee, but he refused to give up, and moved heaven and earth to gain her a spot, even offering to rescind the admissions of one or more already selected applicants to create a place for her. Eventually he got her shifted from the Reject category to wait-list status, after which he secretly moved her folder to the very top of the large waiting list pile.\nIn the end “connections” triumphed, and she received admission to Wesleyan, although she turned it down in favor of an offer from more prestigious Cornell, which she had obtained through similar means. But at Cornell, she found herself “miserable,” hating the classes and saying she “didn’t see the usefulness of [her] being there.” However, her poor academic ability proved no hindrance, since the same administrator who had arranged her admission also wrangled her a quick entrance into a special “honors program” he personally ran, containing just 40 of the 3500 students in her year. This exempted her from all academic graduation requirements, apparently including classes or tests, thereby allowing her to spend her four college years mostly traveling around the world while working on a so-called “special project.” After graduation, she eventually took a job at her father’s successful law firm, thereby realizing her obvious potential as a member of America’s ruling Ivy League elite, or in her own words, as being one of “the best of the best.”\nSteinberg’s description of the remaining handful of Wesleyan applicants seems to fall into a very similar pattern, indicating that our elite admissions process operates under the principle of “Ideology and Diversity tempered by Corruption.”\nOne wonders how many of the “honors” students shared her background. Steve and Miss Jannol may believe her “success” is the result of her innate Jewish superiority, but the facts demonstrate otherwise. And even the familiar appeals to intelligence are increasingly outdated; as the demographic math would indicate was bound to happen, Jews have been completely surpassed\nby elite Asians\nin the National Merit Scholarship program and have therefore resorted\nto using the very sort of quotas\nthey once complained WASPs used to keep them out of the Ivy League.\nAs Unz observed:\n“The last 20 years have brought a huge rise in the number of Asians\nwinning top academic awards in our high schools or being named National\nMerit Scholarship semifinalists.  It seems quite suspicious that none of\ntrends have been reflected in their increased enrollment at Harvard and\nother top Ivy League universities.”\nThese are the facts. Facts are not anti-semitic, they are merely the truth of the world as it is. And the truth, however uncomfortable, will be sought after and observed here: the more any commenter attempts to obscure the truth, the more I will take the time and effort required to expose whatever it is he is trying to hide. I had actually moved on from the subject until commenters like Steve started showing up and attempting to pass off transparent deceit as truth. And before Steve attempts to dig himself in any deeper, it may be helpful to keep in mind that I am one of those National Merit semifinalists and I am not easily baffled with bullshit. Every assertion made will require evidential support. Every statement made will be dissected, and every retreat into rhetoric will be noted as such.\nFor whatever reason, Steve is attempting to hide the observable fact that the inordinate success presently enjoyed by Jews in America is not the inevitable result of working harder, being more intelligent, or innate ethnic superiority, but is primarily due to a laudable dedication to in-group promotion being expressed in a variety of means, some legitimate, and some not. I assume he is doing so in an attempt to prevent an anti-semitic reaction, but whatever his motivation may be, I will point out that deception and misinformation do not work for long on those with open eyes and functional memories.\nPeople are certainly free to ignore my warnings. Most have in the past and I assume most will in the future. But if Steve thinks Americans are going to meekly accept the financial pillaging of their nation any more tamely than the European nations historically have, especially when they have also suffered the demographic demolition of their country, I think he is woefully mistaken. And, I note, there are more than a few Jewish leaders who more or less\nagree with my concerns\n.\nIt’s not a real problem yet. The difference between Israel’s disapproval rating in the USA and in France, (which is a reasonable proxy) is nearly 50 percent; 27 percent vs 65 percent. If that percentage begins to rise in the next five years, it will be an initial indication that my read of the situation is correct.",
  "tags": [
    "education",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-25T08:35:00+00:00"
}