{
  "url": "https://voxday.net/2014/07/28/hugo-recommendations-best-novella_28/",
  "scraped_at": "2025-12-16T12:22:16.725705",
  "title": "Hugo recommendations: Best Novella",
  "date_display": "July 28, 2014",
  "date_iso": "2014-07-28T13:00:00+00:00",
  "date_from_url": "2014-07-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i><b>Equoid </b></i><b>by Charles Stross</b>. I am a fan of the Laundry novels. After <i>Accelerando</i>, they are Stross’s best work. <i>Equoid </i>is a Laundry novella, so I went into it with high expectations, having recently read and enjoyed <i>The Rhesus Chart</i>. Unfortunately, <i>Equoid </i>is absolutely void of the humor and light-hearted feel of the novels in the series, its attempt to subvert the “virgin tames unicorn” trope reads more like tentacle rape slash child abuse porn (talk about sending the very wrong message in light of the recent MZB/Kramer revelations), and Stross’s attempt to recreate HP Lovecraft’s style in a series of letters falls more than a little flat. As the reviewer at Tor.com noted: “it’s the sort of confounded feeling I get when I’m sure that a writer<br> was trying to gross me out on purpose with some problematic imagery and<br> succeeded, yet I’m not sure that the depths gone to were necessary in<br> the story.” As if monsters raping young girls isn’t enough, there is also a government project entitled EMOCUM. Get it? Stross has written fiction that merited awards in the past. He may well do so in the future. This isn’t it. This is something he’ll want to disown someday.</br></br></br></p><p><b><i>The Chaplain’s Legacy</i> by Brad Torgersen. </b>I read this when it was published as part of Torgersen’s collection <i>Lights in the Deep</i>, and while it wasn’t my favorite of the stories in that collection, it’s not at all difficult to see why Torgersen keeps getting nominated for awards; more than any SF/F writer today, he sits astride the fence that separates Blue SF/F from Pink SF/F. The novella is a tale of alien enemies forced to join together in cooperation by circumstance; somehow Torgersen manages to seamlessly blend Pink tropes such as female military commanders with Blue tropes such as devout religious characters, combining them with a dash of Golden Age optimism. Stylistically, he writes well, and if the we-can-all-get-along theme seems a bit vanilla, it can also be taken as rather brilliant metacommentary on the current SF/F divide. I mean, religious people on one side, insect army on the other? Anyway, it’s the best of the bunch.</p><p><b><i>The Butcher of Khardov</i> by Dan Wells. </b>A surprisingly sensitive take on an epically brutal monster from a game-tie in series. This was, in some ways, my favorite of the five nominees; Wells portrays a man unhinged by loss in an adroit manner, so much so that the reader is momentarily confused at times as to what is story-reality versus story-delusion. Stylistically, Wells is competent, but he’s not at the same level as the other four writers (if one counts Andy Duncan and Ellen Klages as one writer) and worse, his take on human sexuality is the same “I’m not worthy” gammatude of Joe Abercrombie. His nominally badass slaughtering machine, who doesn’t shirk at butchering large quantities of men, women, and children, would faint at the very thought of ever raping a woman. The psychological inconsistency is jarring. It’s a good story and a worthy nominee, but I’d put it at number two.</p><p><b><i>Six-Gun Snow White</i> by Catherynne M. Valente. </b>The title is good. The story isn’t. It’s a haphazard, incoherent attempt to force-fit the Snow White story into the Wild West, complete with a weird attempt to also bring in Indian folklore. Continent-spanning cultural appropriation doesn’t even begin to describe this admittedly creative attempt to find a new way to portray more kick-ass women. Yawn. That being said, it is identifiable as fantasy. Credit where credit is due.<br> <b><br/></b><br> <b><i>Wakulla Springs</i> by Andy Duncan and Ellen Klages. </b>This pair are easily the best writers of the lot from a stylistic perspective. Unfortunately, as with several works in other categories, this novella isn’t science fiction or fantasy. It’s much more concerned with historical racism in the American South, (with repeated reminders that black folk weren’t permitted to swim in certain places or stay in certain hotels, and this made the black individual feelbad) than with any science fictional or speculative elements. There are the occasional nods to magical realism, such as Cheeta the chimp who may or may not be talking, but this novella simply isn’t of the genre. <b></b><br> <b><br/></b><br> My vote for Best Novella, and my suggestion to others, is <i><b>The Chaplain’s Legacy</b> </i>by Brad Torgersen. My vote will go as follows:</br></br></br></br></p><ol><li><i>The Chaplain’s Legacy</i></li><li><i>The Butcher of Khardov</i></li><li>No Award</li><li><i>Six-Gun Snow White </i></li></ol><p>I recommend leaving the other two novellas off the ballot.</p><p>OTHER HUGO AWARD RECOMMENDATIONS</p><p><a href=\"http://www.milobookclub.com/2014/07/02/hugo-recommendations-best-nove/\">Best Novel </a><br> <a href=\"http://www.milobookclub.com/2014/07/16/hugo-recommendations-best-novelette/\">Best Novelette </a><br> <a href=\"http://www.milobookclub.com/2014/07/17/hugo-recommendations-best-short-story-2/\">Best Short Story</a><br> <a href=\"http://www.milobookclub.com/2014/07/03/hugo-recommendations-best-editor-2/\">Best Editor </a><br> <a href=\"http://www.milobookclub.com/2014/07/18/hugo-recommendations-1939-retro-awards/\">Retro 1939 </a></br></br></br></br></p></div>",
  "content_text": "Equoid\nby Charles Stross\n. I am a fan of the Laundry novels. After\nAccelerando\n, they are Stross’s best work.\nEquoid\nis a Laundry novella, so I went into it with high expectations, having recently read and enjoyed\nThe Rhesus Chart\n. Unfortunately,\nEquoid\nis absolutely void of the humor and light-hearted feel of the novels in the series, its attempt to subvert the “virgin tames unicorn” trope reads more like tentacle rape slash child abuse porn (talk about sending the very wrong message in light of the recent MZB/Kramer revelations), and Stross’s attempt to recreate HP Lovecraft’s style in a series of letters falls more than a little flat. As the reviewer at Tor.com noted: “it’s the sort of confounded feeling I get when I’m sure that a writer\nwas trying to gross me out on purpose with some problematic imagery and\nsucceeded, yet I’m not sure that the depths gone to were necessary in\nthe story.” As if monsters raping young girls isn’t enough, there is also a government project entitled EMOCUM. Get it? Stross has written fiction that merited awards in the past. He may well do so in the future. This isn’t it. This is something he’ll want to disown someday.\nThe Chaplain’s Legacy\nby Brad Torgersen.\nI read this when it was published as part of Torgersen’s collection\nLights in the Deep\n, and while it wasn’t my favorite of the stories in that collection, it’s not at all difficult to see why Torgersen keeps getting nominated for awards; more than any SF/F writer today, he sits astride the fence that separates Blue SF/F from Pink SF/F. The novella is a tale of alien enemies forced to join together in cooperation by circumstance; somehow Torgersen manages to seamlessly blend Pink tropes such as female military commanders with Blue tropes such as devout religious characters, combining them with a dash of Golden Age optimism. Stylistically, he writes well, and if the we-can-all-get-along theme seems a bit vanilla, it can also be taken as rather brilliant metacommentary on the current SF/F divide. I mean, religious people on one side, insect army on the other? Anyway, it’s the best of the bunch.\nThe Butcher of Khardov\nby Dan Wells.\nA surprisingly sensitive take on an epically brutal monster from a game-tie in series. This was, in some ways, my favorite of the five nominees; Wells portrays a man unhinged by loss in an adroit manner, so much so that the reader is momentarily confused at times as to what is story-reality versus story-delusion. Stylistically, Wells is competent, but he’s not at the same level as the other four writers (if one counts Andy Duncan and Ellen Klages as one writer) and worse, his take on human sexuality is the same “I’m not worthy” gammatude of Joe Abercrombie. His nominally badass slaughtering machine, who doesn’t shirk at butchering large quantities of men, women, and children, would faint at the very thought of ever raping a woman. The psychological inconsistency is jarring. It’s a good story and a worthy nominee, but I’d put it at number two.\nSix-Gun Snow White\nby Catherynne M. Valente.\nThe title is good. The story isn’t. It’s a haphazard, incoherent attempt to force-fit the Snow White story into the Wild West, complete with a weird attempt to also bring in Indian folklore. Continent-spanning cultural appropriation doesn’t even begin to describe this admittedly creative attempt to find a new way to portray more kick-ass women. Yawn. That being said, it is identifiable as fantasy. Credit where credit is due.\nWakulla Springs\nby Andy Duncan and Ellen Klages.\nThis pair are easily the best writers of the lot from a stylistic perspective. Unfortunately, as with several works in other categories, this novella isn’t science fiction or fantasy. It’s much more concerned with historical racism in the American South, (with repeated reminders that black folk weren’t permitted to swim in certain places or stay in certain hotels, and this made the black individual feelbad) than with any science fictional or speculative elements. There are the occasional nods to magical realism, such as Cheeta the chimp who may or may not be talking, but this novella simply isn’t of the genre.\nMy vote for Best Novella, and my suggestion to others, is\nThe Chaplain’s Legacy\nby Brad Torgersen. My vote will go as follows:\nThe Chaplain’s Legacy\nThe Butcher of Khardov\nNo Award\nSix-Gun Snow White\nI recommend leaving the other two novellas off the ballot.\nOTHER HUGO AWARD RECOMMENDATIONS\nBest Novel\nBest Novelette\nBest Short Story\nBest Editor\nRetro 1939",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-28T12:00:00+00:00"
}