{
  "url": "https://voxday.net/2014/07/16/hugo-recommendations-best-novelette/",
  "scraped_at": "2025-12-16T12:20:55.628684",
  "title": "Hugo recommendations: Best Novelette",
  "date_display": "July 16, 2014",
  "date_iso": "2014-07-16T17:17:00+00:00",
  "date_from_url": "2014-07-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><b>“The Lady Astronaut of Mars”</b> by Mary Robinette Kowal. A Lady Astronaut (-5 demerits for sexism) has to choose between her dream of space and her husband. One guess which one she chooses. Not merely the worst of the five, but <i>easily </i>the worst of them. Don’t believe me? Just read it.</p><p><b>“The Truth of Fact, the Truth of Feeling”</b> by Ted Chiang. Ted Chiang is the best writer of the five and the favorite in this category. Before I read it, I assumed he would be the obvious winner by a mile. However, this is very far from his best or his most interesting work.</p><p><b>“The Waiting Stars”</b> by Aliette de Bodard. If there is one thing you will take away from this novelette, it is that Aliette de Bodard wants you to know that she is Asian. A psychoanalyst could probably write a thesis on the primary theme of her work – described by one commenter at Tor thusly: “Asians gotta be<br> Asians, let Asians be Asians, don’t be trying to colonialize the<br> Asians!” – combined with the fact that Ms Bodard is not, in fact, Asian, but merely half-Asian.</br></br></p><p><b>“Opera Vita Aeterna”</b> by Vox Day. Rather than describe my own work, I will quote a commenter at Tor. <i>“The two main characters here were vividly (and economically) drawn. I thought the evolution of their relationship was nicely portrayed. Hey, it was a more interesting relationship than the one between Elma and her husband Nathaniel in “Lady Astronaut of Mars.” It had more passion in it, too. Though somewhat foreshadowed, the ending sort of came out of nowhere for me. Still, it had impact.”</i></p><p><b>“The Exchange Officers”</b> by Brad Torgersen.  Old school mil-SF involving a small-unit battle against the Chinese. In space. Good, competent Gold Age-style SF. There is a reason Torgersen is an Analog favorite.</p><p>My vote for Best Novelette, and my suggestion to others, is “Opera Vita Aeterna” by yours truly. My indubitably self-serving vote will go as follows:</p><ol><li>“Opera Vita Aeterna”</li><li>“The Exchange Officers”</li><li>“The Truth of Fact, the Truth of Feeling”</li><li>No Award</li></ol><p>I recommend leaving both “The Waiting Stars” and “The Lady Astronaut of Mars” off the ballot.</p><p>OTHER HUGO AWARD RECOMMENDATIONS</p><p><a href=\"http://www.milobookclub.com/2014/07/02/hugo-recommendations-best-nove/\">Best Novel </a><br> <a href=\"http://www.milobookclub.com/2014/07/03/hugo-recommendations-best-editor-2/\">Best Editor </a></br></p></div>",
  "content_text": "“The Lady Astronaut of Mars”\nby Mary Robinette Kowal. A Lady Astronaut (-5 demerits for sexism) has to choose between her dream of space and her husband. One guess which one she chooses. Not merely the worst of the five, but\neasily\nthe worst of them. Don’t believe me? Just read it.\n“The Truth of Fact, the Truth of Feeling”\nby Ted Chiang. Ted Chiang is the best writer of the five and the favorite in this category. Before I read it, I assumed he would be the obvious winner by a mile. However, this is very far from his best or his most interesting work.\n“The Waiting Stars”\nby Aliette de Bodard. If there is one thing you will take away from this novelette, it is that Aliette de Bodard wants you to know that she is Asian. A psychoanalyst could probably write a thesis on the primary theme of her work – described by one commenter at Tor thusly: “Asians gotta be\nAsians, let Asians be Asians, don’t be trying to colonialize the\nAsians!” – combined with the fact that Ms Bodard is not, in fact, Asian, but merely half-Asian.\n“Opera Vita Aeterna”\nby Vox Day. Rather than describe my own work, I will quote a commenter at Tor.\n“The two main characters here were vividly (and economically) drawn. I thought the evolution of their relationship was nicely portrayed. Hey, it was a more interesting relationship than the one between Elma and her husband Nathaniel in “Lady Astronaut of Mars.” It had more passion in it, too. Though somewhat foreshadowed, the ending sort of came out of nowhere for me. Still, it had impact.”\n“The Exchange Officers”\nby Brad Torgersen.  Old school mil-SF involving a small-unit battle against the Chinese. In space. Good, competent Gold Age-style SF. There is a reason Torgersen is an Analog favorite.\nMy vote for Best Novelette, and my suggestion to others, is “Opera Vita Aeterna” by yours truly. My indubitably self-serving vote will go as follows:\n“Opera Vita Aeterna”\n“The Exchange Officers”\n“The Truth of Fact, the Truth of Feeling”\nNo Award\nI recommend leaving both “The Waiting Stars” and “The Lady Astronaut of Mars” off the ballot.\nOTHER HUGO AWARD RECOMMENDATIONS\nBest Novel\nBest Editor",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-16T16:17:00+00:00"
}