{
  "url": "https://voxday.net/2014/07/02/hugo-recommendations-best-nove/",
  "scraped_at": "2025-12-16T12:19:24.596319",
  "title": "Hugo recommendations: Best Novel",
  "date_display": "July 2, 2014",
  "date_iso": "2014-07-02T17:44:00+00:00",
  "date_from_url": "2014-07-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I see people are starting to make <a href=\"http://www.jasonsanford.com/blog/2014/6/ancillary-justice-by-ann-leckie-for-the-hugo-award-for-best-novel\">their Hugo Award voting recommendations</a>, so I shall begin mine. I’ll do individual posts on the major categories, then provide a summary of all of them when I am done. Let’s start with the award for best Novel, where I intentionally chose from among the worst Amazon reviews for each book in order to highlight the weaknesses of the various nominees:</p><p><i><b>Ancillary Justice</b></i> <b>by Ann Leckie</b>. 286 reviews. 4.3 average rating. The Nebula and Arthur C. Clarke winner, and the prospective first three-award winner in SF history. It must be something truly incredible, right? No, it’s just the usual pinkshirts talking up the usual Pink SF/F sewage, albeit with the innovative concept of playing games with pronouns, which was a new and exciting idea back in 1971 when Robert Silverberg did it in his Nebula-winning <i>A Time of Changes</i>. A recent puff piece on Leckie asked the question: <a href=\"http://blogs.riverfronttimes.com/dailyrft/2014/06/is_ann_leckie_the_next_big_thing_in_science_fiction.php\">Is Ann Leckie the Next Big Thing in Science Fiction?</a> On the evidence of this first novel, the answer is a resounding “no”.</p><p><a href=\"http://www.amazon.com/review/RBI8K3GKRH8GL/ref=cm_cr_pr_perm?ie=UTF8&amp;ASIN=031624662X\">Amazon review</a>: <i>Characterization is non-existent: the main character never changes or<br> learns, and the author only pays lip service to the AI going from<br> hundreds of individuals under its control to one.  That could be enough<br> for its own story right there, but it’s wasted.  Instead, we have the<br> main character taking on two different big goals or quests.  Her reasons<br> for the first are totally unexplained, and she even asks herself every<br> so often why she’s doing it.  But there’s never an answer or even any<br> exploration of this.  She just asks herself a few times and that’s it.<br> It has no effect on the story whatsoever.</br></br></br></br></br></br></br></br></i></p><p>The second is literally<br> pointless.  We know this because she tells us that completion will make<br> zero difference.  So why do we care?  I suppose it’s just as well since<br> there’s no real universe to speak of.  The culture of her society is<br> vague and bland, and doesn’t really do anything new.  Oh, their language<br> doesn’t have gender-specific pronouns, meaning the main character uses<br> “he” and “she” interchangeably.  It’s not done as a way to demonstrate<br> how her own language works, either, as she admits that she can’t tell<br> people’s genders a lot of the time.  We’re supposed to believe that an<br> AI that is thousands of years old and capable of carrying on hundreds of<br> conversations simultaneously can’t figure out whether a person is male<br> or female?  Meanwhile a space station’s AI at one point is so sensitive<br> she’s afraid it will figure out her motivations just from observing her.</br></br></br></br></br></br></br></br></br></br></br></br></p><p><b><i>The Wheel of Time</i> by Robert Jordan.</b> 2,358 reviews, 4.2 average rating. I’ve only read the first five or so books in the series. I’m not reading any more. Other than the length, the one notable thing about the books is that it introduces the most irritating protagonist in the history of epic fantasy, Rand al’Thor. The one way I <i>might </i>be able to force myself to read SFWA Grand Master’s epic torture-rape extravaganza, <i>Hogg</i>, is if I did a word replacement in Sigil that substituted “Rand al’Thor” for all the little kiddies that Delany fantasizes about raping, torturing, and killing in various excruciating ways. That’s how much I hate the whiny little bastard.</p><p><a href=\"http://www.amazon.com/review/R37NE5HPTVW2OY/ref=cm_cr_pr_perm?ie=UTF8&amp;ASIN=0812511816\">Amazon review</a>:  <i>The best word to describe his writing is “trite”. Everything about the book, aside from the world-building, is trite beyond words; this is juvenile, unimaginative, amateurish writing. In over 30 years of pretty much continuous reading, this is unquestionably the worst-written novel I’ve ever seen published.</i></p><p>The characters are shallow beyond words; the ridiculous and incredibly irritating Nynaeve (don’t ask me how that’s supposed to be pronounced), for example, has a permanent scowl on her face, and never varies her tone at all; every sentence that comes out of her is negative, angry, and sour, and she almost never says anything without an exclamation mark at the end. She’s as one-dimensional as a character can be, and she ends up being nothing more than a caricature. The rest are almost as bad.</p><p><b><i>Warbound </i>by Larry Correia</b>. 120 reviews. 4.7 average rating. I very much like <i>The Grimnoir Chronicles</i> and <i>Warbound </i>is a satisfying conclusion to the trilogy. It’s more intelligently developed than X-Men, its use of history is more sophisticated than the casual observer will realize, and it incorporates Japanese warrior culture in a manner that is both interesting and respectful. Those who focus obsessively on the functional style of the writing are completely missing both the point as well as a smart action story.</p><p><a href=\"http://www.amazon.com/review/R36AV3YRTQRS4K/ref=cm_cr_pr_perm?ie=UTF8&amp;ASIN=B00DYXC3W8\">Amazon review</a>: <i>Enjobale read – great end to series. Like the end – surprise for me  Wonder what he will do next</i></p><p>Don’t look at me. THAT is the only one-star review of the 120 reviews on Amazon.<i> </i>And the two 2-star ratings are similarly complimentary.</p><p><b><i>Neptune’s Brood</i></b> <b>by Charles Stross</b>. 119 reviews. 4.2 average rating. Orbit didn’t bother to include the novel in the packet. If the publisher doesn’t give a damn, why should anyone else? Charlie lost his fastball a few years ago anyhow. That being said, I would have considered one of his Bob Howard novels, those are still pretty good. Not this one.</p><p><a href=\"http://www.amazon.com/review/R2CTFYB8IYJEQC/ref=cm_cr_pr_perm?ie=UTF8&amp;ASIN=B00AR2RZ4K\">Amazon review</a>:<i> I am a longtime and ardent fan of Charles Stross books. I’ve read nearly every one and I look forward to new ones. I am not, however, a fan of Neptune’s Brood. The premise was sound – great potential for some funny bits, a good launching pad for sniping at convention. And all that’s in there. But what one has to slog through to get there simply isn’t worth it. Mr. Stross, I imagine you have a pretty intelligent audience overall – you don’t need to explain, then explain again, then needlessly overexplain yet again throughout the book. We get it. I was determined to finish the book in spite of the feeling that I was wasting my time after just having gotten through a third of it. And I did – to no avail.<br> </br></i><br> <i>Bottom line: I recommend each and every one of his books… except this one. </i></br></p><p><b>Parasite</b> <b>by Mira Grant</b>. 179 reviews. 3.7 average rating. Orbit didn’t bother to include the novel in the packet. If the publisher doesn’t give a damn, why should anyone else?</p><p><a href=\"http://www.amazon.com/review/RHB7V1G7ZP7WP/ref=cm_cr_pr_perm?ie=UTF8&amp;ASIN=B00AFGKSDS\">Amazon review</a>: <i>The concept for the story seemed appealing and I was excited to read it.<br> Unfortunately the writer couldn’t manage to move past how the main<br> character felt about the prolific minutiae of her daily life, to<br> actually tell the story. Another thing I found disappointing about this<br> unquestionably boring attempt is, the writer spent the entire length of<br> the story building up to what I’m sure she thought was a profound<br> revelation. Only this revelation was glaringly obvious within the first<br> few paragraphs. This book was not completely devoid of interest and had<br> several fleeting moments of watered down intrigue that kept me<br> soldiering on to the end. The ending “shocker” that was sadly<br> predictable was followed by “to be continued” which to me is a let down<br> squared. Overall this book is like an expensive meal served cold with<br> poor and clumsy service. I will not be reading the next installment in<br> this series as well as anything else written by Mira Grant.</br></br></br></br></br></br></br></br></br></br></br></br></br></i></p><p>My vote for Best Novel, and my suggestion to others, is <b><i>Warbound </i></b>by Larry Correia. My vote will go as follows:</p><ol><li><i>Warbound</i></li><li>No Award</li><li><i>The Wheel of Time</i></li></ol><p>I recommend leaving the three Orbit books off the ballot.</p></div>",
  "content_text": "I see people are starting to make\ntheir Hugo Award voting recommendations\n, so I shall begin mine. I’ll do individual posts on the major categories, then provide a summary of all of them when I am done. Let’s start with the award for best Novel, where I intentionally chose from among the worst Amazon reviews for each book in order to highlight the weaknesses of the various nominees:\nAncillary Justice\nby Ann Leckie\n. 286 reviews. 4.3 average rating. The Nebula and Arthur C. Clarke winner, and the prospective first three-award winner in SF history. It must be something truly incredible, right? No, it’s just the usual pinkshirts talking up the usual Pink SF/F sewage, albeit with the innovative concept of playing games with pronouns, which was a new and exciting idea back in 1971 when Robert Silverberg did it in his Nebula-winning\nA Time of Changes\n. A recent puff piece on Leckie asked the question:\nIs Ann Leckie the Next Big Thing in Science Fiction?\nOn the evidence of this first novel, the answer is a resounding “no”.\nAmazon review\n:\nCharacterization is non-existent: the main character never changes or\nlearns, and the author only pays lip service to the AI going from\nhundreds of individuals under its control to one.  That could be enough\nfor its own story right there, but it’s wasted.  Instead, we have the\nmain character taking on two different big goals or quests.  Her reasons\nfor the first are totally unexplained, and she even asks herself every\nso often why she’s doing it.  But there’s never an answer or even any\nexploration of this.  She just asks herself a few times and that’s it.\nIt has no effect on the story whatsoever.\nThe second is literally\npointless.  We know this because she tells us that completion will make\nzero difference.  So why do we care?  I suppose it’s just as well since\nthere’s no real universe to speak of.  The culture of her society is\nvague and bland, and doesn’t really do anything new.  Oh, their language\ndoesn’t have gender-specific pronouns, meaning the main character uses\n“he” and “she” interchangeably.  It’s not done as a way to demonstrate\nhow her own language works, either, as she admits that she can’t tell\npeople’s genders a lot of the time.  We’re supposed to believe that an\nAI that is thousands of years old and capable of carrying on hundreds of\nconversations simultaneously can’t figure out whether a person is male\nor female?  Meanwhile a space station’s AI at one point is so sensitive\nshe’s afraid it will figure out her motivations just from observing her.\nThe Wheel of Time\nby Robert Jordan.\n2,358 reviews, 4.2 average rating. I’ve only read the first five or so books in the series. I’m not reading any more. Other than the length, the one notable thing about the books is that it introduces the most irritating protagonist in the history of epic fantasy, Rand al’Thor. The one way I\nmight\nbe able to force myself to read SFWA Grand Master’s epic torture-rape extravaganza,\nHogg\n, is if I did a word replacement in Sigil that substituted “Rand al’Thor” for all the little kiddies that Delany fantasizes about raping, torturing, and killing in various excruciating ways. That’s how much I hate the whiny little bastard.\nAmazon review\n:\nThe best word to describe his writing is “trite”. Everything about the book, aside from the world-building, is trite beyond words; this is juvenile, unimaginative, amateurish writing. In over 30 years of pretty much continuous reading, this is unquestionably the worst-written novel I’ve ever seen published.\nThe characters are shallow beyond words; the ridiculous and incredibly irritating Nynaeve (don’t ask me how that’s supposed to be pronounced), for example, has a permanent scowl on her face, and never varies her tone at all; every sentence that comes out of her is negative, angry, and sour, and she almost never says anything without an exclamation mark at the end. She’s as one-dimensional as a character can be, and she ends up being nothing more than a caricature. The rest are almost as bad.\nWarbound\nby Larry Correia\n. 120 reviews. 4.7 average rating. I very much like\nThe Grimnoir Chronicles\nand\nWarbound\nis a satisfying conclusion to the trilogy. It’s more intelligently developed than X-Men, its use of history is more sophisticated than the casual observer will realize, and it incorporates Japanese warrior culture in a manner that is both interesting and respectful. Those who focus obsessively on the functional style of the writing are completely missing both the point as well as a smart action story.\nAmazon review\n:\nEnjobale read – great end to series. Like the end – surprise for me  Wonder what he will do next\nDon’t look at me. THAT is the only one-star review of the 120 reviews on Amazon.\nAnd the two 2-star ratings are similarly complimentary.\nNeptune’s Brood\nby Charles Stross\n. 119 reviews. 4.2 average rating. Orbit didn’t bother to include the novel in the packet. If the publisher doesn’t give a damn, why should anyone else? Charlie lost his fastball a few years ago anyhow. That being said, I would have considered one of his Bob Howard novels, those are still pretty good. Not this one.\nAmazon review\n:\nI am a longtime and ardent fan of Charles Stross books. I’ve read nearly every one and I look forward to new ones. I am not, however, a fan of Neptune’s Brood. The premise was sound – great potential for some funny bits, a good launching pad for sniping at convention. And all that’s in there. But what one has to slog through to get there simply isn’t worth it. Mr. Stross, I imagine you have a pretty intelligent audience overall – you don’t need to explain, then explain again, then needlessly overexplain yet again throughout the book. We get it. I was determined to finish the book in spite of the feeling that I was wasting my time after just having gotten through a third of it. And I did – to no avail.\nBottom line: I recommend each and every one of his books… except this one.\nParasite\nby Mira Grant\n. 179 reviews. 3.7 average rating. Orbit didn’t bother to include the novel in the packet. If the publisher doesn’t give a damn, why should anyone else?\nAmazon review\n:\nThe concept for the story seemed appealing and I was excited to read it.\nUnfortunately the writer couldn’t manage to move past how the main\ncharacter felt about the prolific minutiae of her daily life, to\nactually tell the story. Another thing I found disappointing about this\nunquestionably boring attempt is, the writer spent the entire length of\nthe story building up to what I’m sure she thought was a profound\nrevelation. Only this revelation was glaringly obvious within the first\nfew paragraphs. This book was not completely devoid of interest and had\nseveral fleeting moments of watered down intrigue that kept me\nsoldiering on to the end. The ending “shocker” that was sadly\npredictable was followed by “to be continued” which to me is a let down\nsquared. Overall this book is like an expensive meal served cold with\npoor and clumsy service. I will not be reading the next installment in\nthis series as well as anything else written by Mira Grant.\nMy vote for Best Novel, and my suggestion to others, is\nWarbound\nby Larry Correia. My vote will go as follows:\nWarbound\nNo Award\nThe Wheel of Time\nI recommend leaving the three Orbit books off the ballot.",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-02T16:44:00+00:00"
}