{
  "url": "https://voxday.net/2014/07/03/hugo-recommendations-best-editor-2/",
  "scraped_at": "2025-12-16T12:19:31.617152",
  "title": "Hugo recommendations: Best Editor",
  "date_display": "July 3, 2014",
  "date_iso": "2014-07-03T17:00:00+00:00",
  "date_from_url": "2014-07-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>BEST EDITOR, LONG FORM</p><p><b>Liz Gorinsky, Tor Books</b>: Jason Sanford says it’s hard to imagine Tor without Gorinsky. If she’s in any way responsible for the abominable Pink sewage they’ve been putting out for the last 20 years, she goes right to the bottom of the list. It’s remarkable that for all the Pink SF/F authors they’ve been relentlessly pushing over this time, their bestselling authors are still Orson Scott Card, Orson Scott Card and someone else, Robert Jordan, Robert Jordan and Brandon Sanderson, and Brandon Sanderson.</p><p><b>Lee Harris, Angry Robot</b>:  I looked over their entire list of 2013 publications. Nice covers. Haven’t read a single book. Haven’t HEARD of a single book. I have heard of Wesley Chu; <i>The Lives of Tao</i> appears to be one of their best-regarded books. Tons of editorial reviews. 145 Amazon reviews averaging 4.2 rating. And #166,807 on Kindle. Translation: Hivemind hype.</p><p><b>Ginjer Buchanan, Ace</b>: Retired after 30 years at Ace and Roc Books. Translation: a longtime gatekeeper and a nomination in lieu of a gold watch.</p><p><b>Sheila Gilbert, DAW Books</b>: Sanford calls her “one of those people who helped shape the direction of our genre”. Translation: a longtime gatekeeper and likely responsible in part for the decline of the genre.</p><p><b>Toni Weiskopf: Baen Books</b>: Published Larry Correia. Published our own Tom Kratman. Signed Brad Torgersen. The one mainstream editor willing to go against the grain and stand against the rising tide of Pink effluvience. She’s got my vote.</p><p>My vote for Best Editor, Long Form, and my suggestion to others, is <b>Toni Weiskopf </b>of Baen Books. My vote will go as follows:</p><ol><li>Toni Weiskopf</li><li>Sheila Gilbert</li><li>Ginjer Buchanan</li><li>No Award</li></ol><p> I recommend leaving the other two editors off the ballot.</p><p> BEST EDITOR, SHORT FORM</p><p>I don’t know anything about the various editors nominated. I will vote <b>No Award </b>and leave the category otherwise blank.</p><p> OTHER HUGO AWARD RECOMMENDATIONS</p><p><a href=\"http://www.milobookclub.com/2014/07/02/hugo-recommendations-best-nove/\">Best Novel </a></p></div>",
  "content_text": "BEST EDITOR, LONG FORM\nLiz Gorinsky, Tor Books\n: Jason Sanford says it’s hard to imagine Tor without Gorinsky. If she’s in any way responsible for the abominable Pink sewage they’ve been putting out for the last 20 years, she goes right to the bottom of the list. It’s remarkable that for all the Pink SF/F authors they’ve been relentlessly pushing over this time, their bestselling authors are still Orson Scott Card, Orson Scott Card and someone else, Robert Jordan, Robert Jordan and Brandon Sanderson, and Brandon Sanderson.\nLee Harris, Angry Robot\n:  I looked over their entire list of 2013 publications. Nice covers. Haven’t read a single book. Haven’t HEARD of a single book. I have heard of Wesley Chu;\nThe Lives of Tao\nappears to be one of their best-regarded books. Tons of editorial reviews. 145 Amazon reviews averaging 4.2 rating. And #166,807 on Kindle. Translation: Hivemind hype.\nGinjer Buchanan, Ace\n: Retired after 30 years at Ace and Roc Books. Translation: a longtime gatekeeper and a nomination in lieu of a gold watch.\nSheila Gilbert, DAW Books\n: Sanford calls her “one of those people who helped shape the direction of our genre”. Translation: a longtime gatekeeper and likely responsible in part for the decline of the genre.\nToni Weiskopf: Baen Books\n: Published Larry Correia. Published our own Tom Kratman. Signed Brad Torgersen. The one mainstream editor willing to go against the grain and stand against the rising tide of Pink effluvience. She’s got my vote.\nMy vote for Best Editor, Long Form, and my suggestion to others, is\nToni Weiskopf\nof Baen Books. My vote will go as follows:\nToni Weiskopf\nSheila Gilbert\nGinjer Buchanan\nNo Award\nI recommend leaving the other two editors off the ballot.\nBEST EDITOR, SHORT FORM\nI don’t know anything about the various editors nominated. I will vote\nNo Award\nand leave the category otherwise blank.\nOTHER HUGO AWARD RECOMMENDATIONS\nBest Novel",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-03T16:00:00+00:00"
}