{
  "url": "https://voxday.net/2014/07/30/journolist-2/",
  "scraped_at": "2025-12-16T12:22:34.673009",
  "title": "Journolist 2",
  "date_display": "July 30, 2014",
  "date_iso": "2014-07-30T20:00:00+00:00",
  "date_from_url": "2014-07-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Left-wing activists <a href=\"http://mediatrackers.org/wisconsin/2014/07/29/secretive-leftwing-network-discovered-through-wi-records-law\">plotting together</a>. Again:</p><blockquote class=\"tr_bq\"><p> A low-profile Google Group used by over 1,000 state and national leftwing leaders and activists has been discovered thanks to Wisconsin’s open records law. A Media Trackers inquiry into the actions of a University of Wisconsin professor turned up records and communications from “Gamechanger Salon,” an online community that provides a forum for leftwing activists and leaders to share tactics, strategies and opinions….</p><p>The group has the self-described goal of creating a “more coordinated” movement for liberals across the country. Among those included on the membership list are:</p><p>Damon Silver, Policy Director for the AFL-CIO<br> Benjamin Joffe-Walk, Chief of Staff at Change.org<br> Medea Benjamin, co-founder of CODEPINK<br> Elizabeth Rose, Director of Communications at the Economic Policy Institute<br> Philip Radford, Executive Director of Greenpeace until earlier this year<br> Ilyse Hogue, President of NARAL<br> Raven Brooks, Executive Director of Netroots Nation<br> Adam Green, co-founder of the Progressive Change Campaign Committee<br> Deirdre Schifeling, National Director Organizing &amp; Electoral Campaigns for Planned Parenthood</br></br></br></br></br></br></br></br></p><p>The group’s policy manual directs members to abstain from forwarding emails to recipients outside the group. It does warn, however, that with 1,000-plus members, anyone emailing the group should not say anything “you wouldn’t want to be subpoenaed by a Grand Jury or broadcast on Fox News.”</p></blockquote><p>Here is the complete membership list <a href=\"http://mediatrackers.org/assets/uploads/2014/07/Gamechanger-Salon.pdf\">in PDF format</a>. I didn’t recognize any names. There are also more groups than you have ever heard of. It is appalling to think about the massive amount of totally unproductive capital that is being misdirected toward these societally destructive wastes of space so they can further interfere with Western civilization.</p></div>",
  "content_text": "Left-wing activists\nplotting together\n. Again:\nA low-profile Google Group used by over 1,000 state and national leftwing leaders and activists has been discovered thanks to Wisconsin’s open records law. A Media Trackers inquiry into the actions of a University of Wisconsin professor turned up records and communications from “Gamechanger Salon,” an online community that provides a forum for leftwing activists and leaders to share tactics, strategies and opinions….\nThe group has the self-described goal of creating a “more coordinated” movement for liberals across the country. Among those included on the membership list are:\nDamon Silver, Policy Director for the AFL-CIO\nBenjamin Joffe-Walk, Chief of Staff at Change.org\nMedea Benjamin, co-founder of CODEPINK\nElizabeth Rose, Director of Communications at the Economic Policy Institute\nPhilip Radford, Executive Director of Greenpeace until earlier this year\nIlyse Hogue, President of NARAL\nRaven Brooks, Executive Director of Netroots Nation\nAdam Green, co-founder of the Progressive Change Campaign Committee\nDeirdre Schifeling, National Director Organizing & Electoral Campaigns for Planned Parenthood\nThe group’s policy manual directs members to abstain from forwarding emails to recipients outside the group. It does warn, however, that with 1,000-plus members, anyone emailing the group should not say anything “you wouldn’t want to be subpoenaed by a Grand Jury or broadcast on Fox News.”\nHere is the complete membership list\nin PDF format\n. I didn’t recognize any names. There are also more groups than you have ever heard of. It is appalling to think about the massive amount of totally unproductive capital that is being misdirected toward these societally destructive wastes of space so they can further interfere with Western civilization.",
  "tags": [
    "conspiracy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-30T19:00:00+00:00"
}