{
  "url": "https://voxday.net/2014/07/28/mailvox-contra-suffrage/",
  "scraped_at": "2025-12-16T12:22:14.907824",
  "title": "Mailvox: contra suffrage",
  "date_display": "July 28, 2014",
  "date_iso": "2014-07-28T08:22:00+00:00",
  "date_from_url": "2014-07-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Chris Gerrib asks</p><blockquote class=\"tr_bq\"><p> VD, why shouldn’t every free adult human be able to vote in the country they are a citizen of?</p></blockquote><p>For the same reason unfree children who are not citizens are not permitted to vote: it is expected that their votes will not be in the long-term interests of the country or its citizenry.</p><p>Another commenter, Shelles, appears to be of the David Futrelle school of debate, in which her inability to imagine an effective argument is confused with the nonexistence of such arguments. Which I found a little amusing here, since she somehow manages to touch on two effective arguments while missing the aspects that make them effective.</p><blockquote class=\"tr_bq\"><p> The only way to win the argument that women should not have the vote is to be able to successfully equate them with others that do not have the vote: minors, felons. The condition of being a woman is in no way like either of these.</p><p>The other possibility is to argue that the country will be better off if women don’t vote because women have a tendency to for for X, Y and Z, all of which will harm, if not destroy the country. The obvious problem with this argument is that it depends on one’s personal on view of exactly how the country ought to operate. This is countered by offering another personal view of how the country ought to be that is best advanced by women having the vote.</p><p>Done.</p><p>In essence the argument is: Women should not have the vote because it’s in the interests of a certain group.</p></blockquote><p>It is certainly not the only way, but it is true that one will win the argument that women should not have the vote when one is able to<br> successfully equate them with others that do not have the vote: minors,<br> felons, and so forth. However, the fact that “the condition of being a woman is in no way like either of<br> these” is irrelevant and does not suffice as a counterpoint. The way women are successfully equated with others who do not have the vote is to demonstrate that their votes are equally incompatible with the long-term national interest as the other classes of current non-voters.</br></br></br></p><p>This can be done using a variety of metrics, including what Shelles describes as another possibility to the only way. Just to give one example, if the reason children are not permitted to vote is due to their limited time preferences, a comparison could be made between children’s time preferences, women’s time preferences, and men’s time preferences. If women’s time preferences were determined to be more akin to those of children than those of men, that would be a clear justification for denying the vote to them.</p><p>But to return to the option to the only way, Shelles says “the obvious problem with this argument is that it depends on one’s personal on view of exactly how the country ought to operate”. But since the argument rests on the country’s freedom, well-being, and future existence, her counter relies upon arguing that the country should be unfree, worse-off, and nonexistent. This is not a successful or convincing counter, even if it truly represents the personal view of the interlocutor rather than a hypothetical position of Shelle’s imagination.</p><p>One should always be careful when attempting to summarize an opponent’s position. Words like “in essence” or “basically” tend to be red flags alerting a critic to holes in one’s arguments.  They aren’t necessarily so, but in this case, they are. Because the statement is true: Women should not have the vote because it’s in the interests of a certain group, so long as that “certain group” is defined as “all the citizens of the country, including the women”.</p><p>There are very solid rational, Constitutional, and historical reasons for denying female suffrage. John Adams summarized them best in his famous written exchange with his wife:</p><p><i>“I long to hear that you have declared an independency. And, by the way, in the new code of laws which I suppose it will be necessary for you to make, I desire you would remember the ladies and be more generous and favorable to them than your ancestors.</i></p><p><i>“Do not put such unlimited power into the hands of the husbands.<br> </br></i><br> <i>“Remember, all men would be tyrants if they could. If particular care and attention is not paid to the ladies, we are determined to foment a rebellion, and will not hold ourselves bound by any laws in which we have no voice or representation.”</i><br> – Abigail Adams, 31 March 1776</br></br></p><p><i>“Depend upon it, we know better than to repeal our masculine systems. Although they are in full force, you know they are little more than theory. We dare not exert our power in its full latitude. We are obliged to go fair and softly, and, in practice, you know we are the subjects.</i></p><p><i>“We have only the name of masters, and rather than give up this, which would completely subject us to the despotism of the petticoat, I hope General Washington and all our brave heroes would fight.”</i><br> – John Adams, 14 April 1776</br></p><p>Events have proven John Adams correct. Free men are accustomed to voluntarily limiting the use of their power and not pushing it to the full extent of its capabilities. Women, to say the least, are not. Just as an angry woman does not pull her punches, women in politics do not restrain their instincts to attempt to control the uncontrollable. Abigail Adams is projecting: she wrongly assumes all men would be tyrants if they could because she knows that is true of herself and other women. And women do not hold themselves bound by laws in any case, regardless of whether they have had voice or representation or not. They are bound by fear.</p><p>This is why a nation that wishes to remain wealthy and free does not permit female involvement in its governance, and why totalitarians from the Italian Fascists to the Soviet Bolsheviks have historically made a priority of female involvement in the political process.</p></div>",
  "content_text": "Chris Gerrib asks\nVD, why shouldn’t every free adult human be able to vote in the country they are a citizen of?\nFor the same reason unfree children who are not citizens are not permitted to vote: it is expected that their votes will not be in the long-term interests of the country or its citizenry.\nAnother commenter, Shelles, appears to be of the David Futrelle school of debate, in which her inability to imagine an effective argument is confused with the nonexistence of such arguments. Which I found a little amusing here, since she somehow manages to touch on two effective arguments while missing the aspects that make them effective.\nThe only way to win the argument that women should not have the vote is to be able to successfully equate them with others that do not have the vote: minors, felons. The condition of being a woman is in no way like either of these.\nThe other possibility is to argue that the country will be better off if women don’t vote because women have a tendency to for for X, Y and Z, all of which will harm, if not destroy the country. The obvious problem with this argument is that it depends on one’s personal on view of exactly how the country ought to operate. This is countered by offering another personal view of how the country ought to be that is best advanced by women having the vote.\nDone.\nIn essence the argument is: Women should not have the vote because it’s in the interests of a certain group.\nIt is certainly not the only way, but it is true that one will win the argument that women should not have the vote when one is able to\nsuccessfully equate them with others that do not have the vote: minors,\nfelons, and so forth. However, the fact that “the condition of being a woman is in no way like either of\nthese” is irrelevant and does not suffice as a counterpoint. The way women are successfully equated with others who do not have the vote is to demonstrate that their votes are equally incompatible with the long-term national interest as the other classes of current non-voters.\nThis can be done using a variety of metrics, including what Shelles describes as another possibility to the only way. Just to give one example, if the reason children are not permitted to vote is due to their limited time preferences, a comparison could be made between children’s time preferences, women’s time preferences, and men’s time preferences. If women’s time preferences were determined to be more akin to those of children than those of men, that would be a clear justification for denying the vote to them.\nBut to return to the option to the only way, Shelles says “the obvious problem with this argument is that it depends on one’s personal on view of exactly how the country ought to operate”. But since the argument rests on the country’s freedom, well-being, and future existence, her counter relies upon arguing that the country should be unfree, worse-off, and nonexistent. This is not a successful or convincing counter, even if it truly represents the personal view of the interlocutor rather than a hypothetical position of Shelle’s imagination.\nOne should always be careful when attempting to summarize an opponent’s position. Words like “in essence” or “basically” tend to be red flags alerting a critic to holes in one’s arguments.  They aren’t necessarily so, but in this case, they are. Because the statement is true: Women should not have the vote because it’s in the interests of a certain group, so long as that “certain group” is defined as “all the citizens of the country, including the women”.\nThere are very solid rational, Constitutional, and historical reasons for denying female suffrage. John Adams summarized them best in his famous written exchange with his wife:\n“I long to hear that you have declared an independency. And, by the way, in the new code of laws which I suppose it will be necessary for you to make, I desire you would remember the ladies and be more generous and favorable to them than your ancestors.\n“Do not put such unlimited power into the hands of the husbands.\n“Remember, all men would be tyrants if they could. If particular care and attention is not paid to the ladies, we are determined to foment a rebellion, and will not hold ourselves bound by any laws in which we have no voice or representation.”\n– Abigail Adams, 31 March 1776\n“Depend upon it, we know better than to repeal our masculine systems. Although they are in full force, you know they are little more than theory. We dare not exert our power in its full latitude. We are obliged to go fair and softly, and, in practice, you know we are the subjects.\n“We have only the name of masters, and rather than give up this, which would completely subject us to the despotism of the petticoat, I hope General Washington and all our brave heroes would fight.”\n– John Adams, 14 April 1776\nEvents have proven John Adams correct. Free men are accustomed to voluntarily limiting the use of their power and not pushing it to the full extent of its capabilities. Women, to say the least, are not. Just as an angry woman does not pull her punches, women in politics do not restrain their instincts to attempt to control the uncontrollable. Abigail Adams is projecting: she wrongly assumes all men would be tyrants if they could because she knows that is true of herself and other women. And women do not hold themselves bound by laws in any case, regardless of whether they have had voice or representation or not. They are bound by fear.\nThis is why a nation that wishes to remain wealthy and free does not permit female involvement in its governance, and why totalitarians from the Italian Fascists to the Soviet Bolsheviks have historically made a priority of female involvement in the political process.",
  "tags": [
    "mailvox",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-28T07:22:00+00:00"
}