{
  "url": "https://voxday.net/2014/07/20/mining-de-maupassan/",
  "scraped_at": "2025-12-16T12:21:19.213419",
  "title": "Mining de Maupassant",
  "date_display": "July 20, 2014",
  "date_iso": "2014-07-20T09:57:00+00:00",
  "date_from_url": "2014-07-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.amazon.com/Altar-Hate-Vox-Day-ebook/dp/B00J70Z2L6\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/07/altar_256.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2014/07/altar_256.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>Since there are more than a few relatively new readers who have come here since I last posted short fiction here several years ago, I thought I’d mention that a collection of it is available <a href=\"http://www.amazon.com/Altar-Hate-Vox-Day-ebook/dp/B00J70Z2L6\">on Amazon</a> and <a href=\"http://www.castaliahouse.com/downloads/the-altar-of-hate/\">at Castalia</a>. I’m more of a novel writer by nature; all of the various Selenoth-related novellas and novelettes I’ve published were actually supposed to be short stories that happened to run long. I’ve since found that writing short stories in the quasi-style of the French master of the art, Guy de Maupassant, tends to be more effective for me. I couldn’t keep it up for an entire novel, indeed, having read several of Maupassant’s novels, it appears he couldn’t really do so either. Three of the short stories in the collection are written in that style, two of them purposefully; it wasn’t until several years after writing “Raj and Garou” that I realized the reason I liked it so much was that it gave off that distinctive sensation of eerie detachment that, for me, tends to characterize the French writer’s work.</p><p>(There are those thinking, wait a minute, what about “The Last Testament of Henry Halleck”? That was a failed attempt to write in an ur-Lovecraftian style. Although the story itself worked, I didn’t get the style right. It’s harder than it might seem; Charles Stross didn’t get it right in “Equoid” either.)</p><p>You can read “The Deported” in its entirety <a href=\"http://www.milobookclub.com/2012/04/11/deported/\">here on the blog</a>; it might be informative for those who have been rightly appalled by the Hugo-nominated short stories to read it while keeping in mind the likes of “If You Were A Dinosaur, My Love”. On a somewhat creepy trivia note, the Italian town in which the story is set was destroyed by mudslides the same month that the story was published in <i>Stupefying Stories</i> and remains abandoned today.</p><p>Whereas the two other stories are merely stylistically evocative, “The Logfile” is essentially an SF spin on my second-favorite of Maupassant’s stories, set in the QUANTUM MORTIS universe. Here is a selection from it.</p><p><i>To the Board of Executives;</i></p><p>The committee’s investigation concerning the possibility of positronic corruption in the neuro-cybernetic logical facilities of the Sektat Series 44 machine-intelligences was concluded early in light of the recent examination of the logfile belonging to unit 44XFL2J-455-847-484-176. Unit 44XFL2J, self-titled Magister, was produced on 18 September 2267 at the production facilities on Minsky, and was delivered to the Entaini Office of the Prime Attorney on 18 February 2268.<br> <i><br>It is the considered opinion of the undersigned that the Lighthill Corporation must announce a recall of all Sektat Series 44 units, effective immediately, followed by a comprehensive technical investigation of the Series 44 neural network design to determine how such an aberration could have taken place. In order to reduce the likelihood of public outrage and considerable legal liability to the corporation, the committee STRONGLY recommends that the recall be attributed to an error in a floating point processor that may, in some circumstances, lead to erroneous statistical calculations.</br></i><br> <i><br>In order to underline the necessity for immediate action by the Board, a selection from the relevant portions of Unit 44XFL2J’s logfile have been provided.</br></i></br></br></p><p>Dr. Merwethy Furris<br>Dr. Rambathas Chamkanni<br>Summerdeep (Unit 42AFS17-129-470-002-384)</br></br></p><p> FROM THE LOGFILE OF UNIT 44XFL2J-455-847-484-176</p><p>UTC-9424124925: I have completed the analysis of Case Number 2268.47. After examining all of the evidence provided to me and cross-checking it against the public records, I have concluded that the individual concerned is guilty of the murder of his common-law mate with a 0.0543 percent probability of error. Barring any suggestion of cloned persons utilizing his DNA profile, there is no legitimate reason for the adjudicating court to possess any reasonable doubts concerning his guilt in the matter. While the examination of the individual’s motivation and intent lie beyond my design parameters, my initial attempts to investigate these matters indicate to me that 2268.47’s intent was entirely in line with his actions and the subsequent results.</p><p>UTC-9427046710: The court pronounced its verdict concerning Case Number 2268.47 this morning. Despite the attempts of accused’s legal defense team to excuse his actions on the basis of his defective genetics and sub-optimal childhood nurturing environment, the verdict was in sync with the calculations provided. Case Number 2268.47 will be terminated in a humane manner within 240 hours, in a manner consistent with the procedure outlined by the law. I am pleased that the court saw fit to place its confidence in my calculations.</p></div>",
  "content_text": "Since there are more than a few relatively new readers who have come here since I last posted short fiction here several years ago, I thought I’d mention that a collection of it is available\non Amazon\nand\nat Castalia\n. I’m more of a novel writer by nature; all of the various Selenoth-related novellas and novelettes I’ve published were actually supposed to be short stories that happened to run long. I’ve since found that writing short stories in the quasi-style of the French master of the art, Guy de Maupassant, tends to be more effective for me. I couldn’t keep it up for an entire novel, indeed, having read several of Maupassant’s novels, it appears he couldn’t really do so either. Three of the short stories in the collection are written in that style, two of them purposefully; it wasn’t until several years after writing “Raj and Garou” that I realized the reason I liked it so much was that it gave off that distinctive sensation of eerie detachment that, for me, tends to characterize the French writer’s work.\n(There are those thinking, wait a minute, what about “The Last Testament of Henry Halleck”? That was a failed attempt to write in an ur-Lovecraftian style. Although the story itself worked, I didn’t get the style right. It’s harder than it might seem; Charles Stross didn’t get it right in “Equoid” either.)\nYou can read “The Deported” in its entirety\nhere on the blog\n; it might be informative for those who have been rightly appalled by the Hugo-nominated short stories to read it while keeping in mind the likes of “If You Were A Dinosaur, My Love”. On a somewhat creepy trivia note, the Italian town in which the story is set was destroyed by mudslides the same month that the story was published in\nStupefying Stories\nand remains abandoned today.\nWhereas the two other stories are merely stylistically evocative, “The Logfile” is essentially an SF spin on my second-favorite of Maupassant’s stories, set in the QUANTUM MORTIS universe. Here is a selection from it.\nTo the Board of Executives;\nThe committee’s investigation concerning the possibility of positronic corruption in the neuro-cybernetic logical facilities of the Sektat Series 44 machine-intelligences was concluded early in light of the recent examination of the logfile belonging to unit 44XFL2J-455-847-484-176. Unit 44XFL2J, self-titled Magister, was produced on 18 September 2267 at the production facilities on Minsky, and was delivered to the Entaini Office of the Prime Attorney on 18 February 2268.\nIt is the considered opinion of the undersigned that the Lighthill Corporation must announce a recall of all Sektat Series 44 units, effective immediately, followed by a comprehensive technical investigation of the Series 44 neural network design to determine how such an aberration could have taken place. In order to reduce the likelihood of public outrage and considerable legal liability to the corporation, the committee STRONGLY recommends that the recall be attributed to an error in a floating point processor that may, in some circumstances, lead to erroneous statistical calculations.\nIn order to underline the necessity for immediate action by the Board, a selection from the relevant portions of Unit 44XFL2J’s logfile have been provided.\nDr. Merwethy Furris\nDr. Rambathas Chamkanni\nSummerdeep (Unit 42AFS17-129-470-002-384)\nFROM THE LOGFILE OF UNIT 44XFL2J-455-847-484-176\nUTC-9424124925: I have completed the analysis of Case Number 2268.47. After examining all of the evidence provided to me and cross-checking it against the public records, I have concluded that the individual concerned is guilty of the murder of his common-law mate with a 0.0543 percent probability of error. Barring any suggestion of cloned persons utilizing his DNA profile, there is no legitimate reason for the adjudicating court to possess any reasonable doubts concerning his guilt in the matter. While the examination of the individual’s motivation and intent lie beyond my design parameters, my initial attempts to investigate these matters indicate to me that 2268.47’s intent was entirely in line with his actions and the subsequent results.\nUTC-9427046710: The court pronounced its verdict concerning Case Number 2268.47 this morning. Despite the attempts of accused’s legal defense team to excuse his actions on the basis of his defective genetics and sub-optimal childhood nurturing environment, the verdict was in sync with the calculations provided. Case Number 2268.47 will be terminated in a humane manner within 240 hours, in a manner consistent with the procedure outlined by the law. I am pleased that the court saw fit to place its confidence in my calculations.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-20T08:57:00+00:00"
}