{
  "url": "https://voxday.net/2014/07/23/next-year-in-jerusale/",
  "scraped_at": "2025-12-16T12:21:40.992855",
  "title": "Next year in Jerusalem",
  "date_display": "July 23, 2014",
  "date_iso": "2014-07-23T09:22:00+00:00",
  "date_from_url": "2014-07-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s interesting to observe how this Jew living in England <a href=\"http://www.telegraph.co.uk/news/religion/10983417/Gaza-conflict-As-a-British-Jew-I-am-now-scared-to-talk-about-Israel-and-Gaza.html\">is so terrified to be living amongst the Gentiles</a>, and yet she refuses to go to Zion:</p><blockquote class=\"tr_bq\"><p> The truth is that up and down this island, Jews are arguing, debating, crying and worrying about what’s going on in an even smaller country across the ocean. Some British Jews are fasting for peace; some are angry at one or both sides; but many are just scared – scared not just about events in Gaza, but events in Europe. These include reports about gangs of Muslims chanting “death to Jews” on the streets of France, and attacking synagogues and setting fire to Jewish-owned stores. Eighteen people were subsequently arrested in the suburb of Sarcelles, just outside Paris, where this particular outpouring of violence happened. The stunned local mayor says the Jewish community is now living in fear.</p><p>Anti-Semitism is on the rise in Germany, too. In Essen, 14 people have just been arrested, accused of plotting an attack on a synagogue. Protesters at a rally in Berlin turned on two Israeli tourists (identifiable by the man’s skull-cap) so viciously that they had to be protected by the police. The city’s authorities have also had to ban pro-Gaza protesters from chanting anti-Semitic slogans and are investigating a sermon last week by Abu Bilal Ismail calling on worshippers at Berlin’s Al-Nur mosque to murder Jews. Jews, not Israelis.</p><p>The situation is so bad that the foreign ministers of Germany, France and Italy have issued a joint statement condemning the rise in anti-Semitic protests and violence in response to the Gaza conflict – and saying they will do everything possible to combat it. “Anti-Semitic rhetoric and hostility against Jews, attacks on people of Jewish belief and synagogues have no place in our societies,” they felt compelled publicly to state.</p><p>Yet since the start of the latest conflict between Hamas and Israel, protesters marching in anti-Israel demonstrations have regularly held up anti-Semitic slogans, shouting for Jews to be gassed, invoking the Holocaust’s chambers of doom. The situation in Britain hasn’t been much better. Last week’s major pro-Palestine rally, which stopped London’s traffic, was littered with placards comparing Israel’s – and Jews’ – actions to the Nazis (“Well done Israel – Hitler would be proud”, read one such sign, accompanied by a swastika). This casual interchange of “Israel” for “Jews” is not just ignorant but often terrifying, especially when linked to references to past atrocities. Indeed, what other group of people get the worst experience in their – or anyone’s – history launched at them like a hand grenade? </p></blockquote><p>So stop living in fear. England is not the Jewish homeland. It is the English homeland. France is not the Jewish homeland. It is the French homeland. Germany is not the Jewish homeland. It is the German homeland. Israel is the Jewish homeland and it is where the Jewish people belong. The Jewish people have a right to their homeland… and so does everyone else. Dispute the latter and lose your claim on the former.</p><p>I staunchly support Israel, both in terms of its existence and its right to wipe out Hamas and colonize Gaza under the legitimate <i>casus belli</i> of having been repeatedly attacked by rockets after generously permitting a thrice-conquered people the opportunity to be left in peace in their reservations. And I have zero sympathy for Jews living in Europe who are afraid of the hatred of Europeans and other immigrants to Europe; everyone has an absolute right to hate whomever they please. <i>Die Gedanken sind frei.</i></p><p>There are no shortage of people who hate me, and yet if I tearfully insisted that laws should be passed banning anti-Vox rhetoric by science fiction writers, and pointed to the thousands of tweets and blog posts aimed at me over the years, people would rightly consider me to be mad.<i> </i>The futile Jewish insistence on trying to outlaw anti-Semitic rhetoric is every bit as insane.<i><br/></i></p><p>People have a free speech right to anti-Semitic rhetoric, they have a right to be hostile if that is how they feel, and if any Jew seriously wants to try to play thought and speech police in someone else’s country, then he fully merits all the hatred his people have subsequently engendered. When you are a guest in someone else’s home, you don’t make the rules. Either you abide by their rules – such as the ban on circumcision in some European countries, for example – or you leave. You don’t cry Holocaust and then claim that the homeowner doesn’t have the right to make his own rules in his own house.</p><p>It’s rather funny to see a Jew complaining about having the worst experience in Jewish history (and their history alone, not everyone’s history, as the Amalekites and the Canaanites, both wiped out by the Israelites, would point out if they were still around to do so) thrown in her face when Jews have been crying Holocaust as long as I can remember. As any child being teased knows, expose a vulnerability to your enemies and that’s precisely the point they will pick at. And the interchange of “Jew” for “Israeli” is hardly ignorant: why are British Jews “arguing, debating, crying and worrying about what’s going on in an even smaller country across the ocean”? The British Scots aren’t. The British Swiss aren’t. The British Russians aren’t. The British Nigerians aren’t. Whatever could the mysterious reason to explain this difference be?</p><p>The IDF doesn’t cry Holocaust. It has moved on and become the proud and militarily effective defenders of the Jewish homeland. The remaining Jews of Europe should move on too, because the politicians proclaiming that there is “no place in their societies” for anti-Semitism are soon going to find out that there is “no elected office in their societies” for them. And I don’t know how much longer it is going to be better in the USA; I don’t blame American Jews for the actions of Emanuel Cellar and Arthur Sulzberger and Paul Samuelson and Alan Greenspan and Ben Bernanke and Jane Yellen and Eric Cantor that have decimated American demographics and the American economy alike. But historically, an angry public has tended to prove unable to make such fine distinctions between the culpable and the innocent.</p><p>More and more Americans are becoming aware of the destruction of their national demographics, and when they learn that this destruction was the direct and intentional result of a small group of immigrants who openly sought to weaken the American people’s sense of being a European nation, they are not going to be happy about it. If you read the history of how the Holocaust came to be, it is not at all difficult to understand why the German people so loathed the Jews. That doesn’t justify the Endlosung, but it’s impossible for any sufficiently intelligent and informed individual to fail to recognize that a very similar pattern has developed over the last sixty years in the USA.</p><p>History is a harsh and unforgiving bitch and one ignores her lessons at one’s peril. The economy is not going to improve. The demographic time-bomb is not going to self-defuse. Gen X and the Millennials are impervious, at best, to crying Holocaust. There are now more Muslims than Jews in Europe and the USA. Nationalism is growing rapidly in reaction to the abuses and injustices of globalization and transnationalism. The debt limits are being stretched perilously thin everywhere from the USA to China.</p><p>I strongly suspect Israel’s chief strategists already know what Israel will eventually be forced to do with regards to Gaza, the West Bank, and the remaining Jews of Europe. They really don’t want to bite the bullet, understandably enough, considering the gargantuan hailstorm of outrage it will provoke. The current invasion of Gaza is nothing more than a delaying measure. And yet, the sooner they address the Gordian Knot, the sooner they will be in a position to deal with the potentially bigger US problem.</p><p>There are several Jews who are regular readers here who have moved to Israel, and others who have not. It might be informative to get their perspective on events in Gaza and Europe as well as their reasons for moving or not moving.</p></div>",
  "content_text": "It’s interesting to observe how this Jew living in England\nis so terrified to be living amongst the Gentiles\n, and yet she refuses to go to Zion:\nThe truth is that up and down this island, Jews are arguing, debating, crying and worrying about what’s going on in an even smaller country across the ocean. Some British Jews are fasting for peace; some are angry at one or both sides; but many are just scared – scared not just about events in Gaza, but events in Europe. These include reports about gangs of Muslims chanting “death to Jews” on the streets of France, and attacking synagogues and setting fire to Jewish-owned stores. Eighteen people were subsequently arrested in the suburb of Sarcelles, just outside Paris, where this particular outpouring of violence happened. The stunned local mayor says the Jewish community is now living in fear.\nAnti-Semitism is on the rise in Germany, too. In Essen, 14 people have just been arrested, accused of plotting an attack on a synagogue. Protesters at a rally in Berlin turned on two Israeli tourists (identifiable by the man’s skull-cap) so viciously that they had to be protected by the police. The city’s authorities have also had to ban pro-Gaza protesters from chanting anti-Semitic slogans and are investigating a sermon last week by Abu Bilal Ismail calling on worshippers at Berlin’s Al-Nur mosque to murder Jews. Jews, not Israelis.\nThe situation is so bad that the foreign ministers of Germany, France and Italy have issued a joint statement condemning the rise in anti-Semitic protests and violence in response to the Gaza conflict – and saying they will do everything possible to combat it. “Anti-Semitic rhetoric and hostility against Jews, attacks on people of Jewish belief and synagogues have no place in our societies,” they felt compelled publicly to state.\nYet since the start of the latest conflict between Hamas and Israel, protesters marching in anti-Israel demonstrations have regularly held up anti-Semitic slogans, shouting for Jews to be gassed, invoking the Holocaust’s chambers of doom. The situation in Britain hasn’t been much better. Last week’s major pro-Palestine rally, which stopped London’s traffic, was littered with placards comparing Israel’s – and Jews’ – actions to the Nazis (“Well done Israel – Hitler would be proud”, read one such sign, accompanied by a swastika). This casual interchange of “Israel” for “Jews” is not just ignorant but often terrifying, especially when linked to references to past atrocities. Indeed, what other group of people get the worst experience in their – or anyone’s – history launched at them like a hand grenade?\nSo stop living in fear. England is not the Jewish homeland. It is the English homeland. France is not the Jewish homeland. It is the French homeland. Germany is not the Jewish homeland. It is the German homeland. Israel is the Jewish homeland and it is where the Jewish people belong. The Jewish people have a right to their homeland… and so does everyone else. Dispute the latter and lose your claim on the former.\nI staunchly support Israel, both in terms of its existence and its right to wipe out Hamas and colonize Gaza under the legitimate\ncasus belli\nof having been repeatedly attacked by rockets after generously permitting a thrice-conquered people the opportunity to be left in peace in their reservations. And I have zero sympathy for Jews living in Europe who are afraid of the hatred of Europeans and other immigrants to Europe; everyone has an absolute right to hate whomever they please.\nDie Gedanken sind frei.\nThere are no shortage of people who hate me, and yet if I tearfully insisted that laws should be passed banning anti-Vox rhetoric by science fiction writers, and pointed to the thousands of tweets and blog posts aimed at me over the years, people would rightly consider me to be mad.\nThe futile Jewish insistence on trying to outlaw anti-Semitic rhetoric is every bit as insane.\nPeople have a free speech right to anti-Semitic rhetoric, they have a right to be hostile if that is how they feel, and if any Jew seriously wants to try to play thought and speech police in someone else’s country, then he fully merits all the hatred his people have subsequently engendered. When you are a guest in someone else’s home, you don’t make the rules. Either you abide by their rules – such as the ban on circumcision in some European countries, for example – or you leave. You don’t cry Holocaust and then claim that the homeowner doesn’t have the right to make his own rules in his own house.\nIt’s rather funny to see a Jew complaining about having the worst experience in Jewish history (and their history alone, not everyone’s history, as the Amalekites and the Canaanites, both wiped out by the Israelites, would point out if they were still around to do so) thrown in her face when Jews have been crying Holocaust as long as I can remember. As any child being teased knows, expose a vulnerability to your enemies and that’s precisely the point they will pick at. And the interchange of “Jew” for “Israeli” is hardly ignorant: why are British Jews “arguing, debating, crying and worrying about what’s going on in an even smaller country across the ocean”? The British Scots aren’t. The British Swiss aren’t. The British Russians aren’t. The British Nigerians aren’t. Whatever could the mysterious reason to explain this difference be?\nThe IDF doesn’t cry Holocaust. It has moved on and become the proud and militarily effective defenders of the Jewish homeland. The remaining Jews of Europe should move on too, because the politicians proclaiming that there is “no place in their societies” for anti-Semitism are soon going to find out that there is “no elected office in their societies” for them. And I don’t know how much longer it is going to be better in the USA; I don’t blame American Jews for the actions of Emanuel Cellar and Arthur Sulzberger and Paul Samuelson and Alan Greenspan and Ben Bernanke and Jane Yellen and Eric Cantor that have decimated American demographics and the American economy alike. But historically, an angry public has tended to prove unable to make such fine distinctions between the culpable and the innocent.\nMore and more Americans are becoming aware of the destruction of their national demographics, and when they learn that this destruction was the direct and intentional result of a small group of immigrants who openly sought to weaken the American people’s sense of being a European nation, they are not going to be happy about it. If you read the history of how the Holocaust came to be, it is not at all difficult to understand why the German people so loathed the Jews. That doesn’t justify the Endlosung, but it’s impossible for any sufficiently intelligent and informed individual to fail to recognize that a very similar pattern has developed over the last sixty years in the USA.\nHistory is a harsh and unforgiving bitch and one ignores her lessons at one’s peril. The economy is not going to improve. The demographic time-bomb is not going to self-defuse. Gen X and the Millennials are impervious, at best, to crying Holocaust. There are now more Muslims than Jews in Europe and the USA. Nationalism is growing rapidly in reaction to the abuses and injustices of globalization and transnationalism. The debt limits are being stretched perilously thin everywhere from the USA to China.\nI strongly suspect Israel’s chief strategists already know what Israel will eventually be forced to do with regards to Gaza, the West Bank, and the remaining Jews of Europe. They really don’t want to bite the bullet, understandably enough, considering the gargantuan hailstorm of outrage it will provoke. The current invasion of Gaza is nothing more than a delaying measure. And yet, the sooner they address the Gordian Knot, the sooner they will be in a position to deal with the potentially bigger US problem.\nThere are several Jews who are regular readers here who have moved to Israel, and others who have not. It might be informative to get their perspective on events in Gaza and Europe as well as their reasons for moving or not moving.",
  "tags": [
    "EU",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-23T08:22:00+00:00"
}