{
  "url": "https://voxday.net/2014/07/07/of-parentheses-and-protagonists/",
  "scraped_at": "2025-12-16T12:19:55.114517",
  "title": "Of parentheses and protagonists",
  "date_display": "July 7, 2014",
  "date_iso": "2014-07-07T07:00:00+00:00",
  "date_from_url": "2014-07-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One thing I have learned over time is that the literary pinkshirts’ notion that they are superior wordsmiths and all right wing SF authors are inept third-rate hacks is about as legitimate and founded in reality as the Left’s self-serving insistence that they are highly intelligent and all right wing people are stupid:</p><blockquote class=\"tr_bq\"><p> Damien Walter ‏@damiengwalter<br> A future in which right wing SF authors actually influence the future. Horrific.</br></p><p>Charlie Stross ‏@cstross <br> @damiengwalter Like the Gernsback Continuum, only in degenerate mongrel second-hander form, right?</br></p><p>Damien Walter ‏@damiengwalter <br> @cstross A future entirely composed of poorly composed sentences.<br> Expand</br></br></p><p>Vox Day ‏@voxday <br> @damiengwalter @cstross As opposed to a future broken up by parentheses? (3.2 per page on average.) Why yes, I did read THE RHESUS CHART!</br></p></blockquote><p>As it happens, I recently read two entertaining SF novels: MONSTER HUNTER NEMESIS by Larry Correia and THE RHESUS CHART by Charles Stross. Both were good books, entertaining, and worth the read. However, if you read them both in quick succession, you will have no choice but to conclude that Larry Correia is not merely the better writer overall (taking into account plot, characters, depth, and original ideas as well as style), he is actually the better prose stylist of the two.</p><p>Now, keep in mind that I am a genuine fan of Stross’s Laundry books, of which THE RHESUS CHART is the latest. But Stross cannot manage to maintain a consistent narrative voice, he even violates the “show, don’t tell” rule in a <i>literal</i> manner. I mean, forget the usual “as you know, Bob” for which neophytes are so often criticized, I’m talking about an actual multi-page aside from the narrator addressed directly to the reader in order to explain what was happening elsewhere during the events previously described. Stross doesn’t so much tell a story as <i>explain </i>it; it is only because his stories are so interesting and his ideas are so clever that most people fail to recognize that his literary ability is mediocre <i>at best</i>.</p><p>And then there are the parentheses. Oh, sweet Mark Twain on methamphetamine, the <i>parentheses!</i> I don’t know if Stross’s editor was killed in some sort of terrible accident involving brackets and this is some sort of bizarre grammatical tribute to her or what, but regardless, he frequently insists on delivering what apparently is supposed to be additional comic detail via parentheses SEVERAL TIMES PER PAGE. (Seriously, on one page I counted FIVE SETS of them and there are no less than 371 sets in a 368-page book!) Lest you think I exaggerate, here is one of the examples I bookmarked in incredulity. Just to highlight this unusual case of Tourette’s Grammar, I have put the parenthesized text in bold:</p><blockquote class=\"tr_bq\"><p> Mhari was one of my learning experiences.</p><p><b>(I’m not sure what I was, from her side of the looking glass: roadkill, perhaps. Or a useful idiot. Something like that. But let’s not go there . . .)</b></p><p>Rewind to the late nineties/early noughties. There’s me, Bob Howard, working on a postgrad CS degree. This means I’m putting in roughly eighty hours a week on the books and in front of the computer screen, in a field where the proportion of women is roughly what you’d expect of a sixteenth-century Benedictine monastery. I was, not to put too fine a point on it, single. I then managed to bring myself to the attention of the Laundry by means too embarrassing to relate. <b>(Well, okay: I nearly landscaped Wolverhampton by accident, because that’s what happens when your funky new realtime rendering algorithm that uses a really neat logical shortcut you can’t believe nobody invented before turns out to be an open and ungrounded summoning grid. Which is the extradimensional equivalent of a fast food joint with a buzzing neon sign that says: GOOD EATS HERE. Can we move on, please?)</b></p><p>So, the organization made me a job offer I couldn’t—wasn’t allowed to—refuse. And then they stuck me behind a desk to rot for a few years, or at least until I’d been thoroughly studied and quantified and got sufficiently bored to ask for something more interesting to do instead. During which period I found myself working elbow-to-elbow with a whole raft of people I wouldn’t otherwise have met, mostly in similar straits <b>(they saw something uncanny, heard something go bump in the night, and got swept up in the dragnet when they were found to be useful)</b>, some of whom had no Y chromosomes and were also single.</p><p>Like I said, Mhari was a learning experience for me. Do you really want to hear about our doomed on-again/off-again car-crash relationship? The immediate nature of the teachable moment for little old twenty-something me was, as a drunken friend of mine questionably phrased it sometime later, “Do not stick your dick in the bad crazy.” It took a lot longer, and a whole lot more perspective <b>(not to mention being married for several years to someone who most certainly was not the “bad crazy”)</b> for me to work out what was actually going on in our dysfunctional relationship, which alternated between bouts of hot primal monkey sex and screaming pan-throwing arguments. What I think was happening was that the “me” that Mhari was alternately fucking and throwing things at was not me, but some sort of demented, revenge-rebound placeholder for a previous boyfriend of many years and some commitment. She’d split up with him acrimoniously less than six months before we first so much as snogged, and he’d done a beautiful gaslight number on her in the process. <b>(Either that or she was bipolar with a topping of psycho special sauce: but resentful rebound relationships are a hell of a lot commoner, and I’ll go with Occam’s razor this time.) </b>The net result was that she was a walking bomb, primed to take out all her existential resentment on whatever man she next took up with, because Bill <b>(I think he was a Bill)</b> had convinced her that all men were fundamentally untrustworthy bastards who would lie to her at the drop of a hat. And I, having recently emerged blinking into the light from a quasi-monastic existence, was simply a convenient cuddly punchbag.</p></blockquote><p>Now, I don’t know about you, but I don’t think any writer (or, to be more specific, novelist), who insists on inserting no less than THREE (3!) parentheses in a single paragraph has any business criticizing the prose of other authors, particularly on the sole basis of their political affiliations. (Unless, of course, his primary metric for literary quality is an exotic, but objective one based on the ratio of grouping symbols to words.)</p><p>What’s interesting, however, is that Larry and Charlie are essentially flip sides of the same coin. They both write what might be termed bureaucratic urban fantasy, they both rely heavily on combining Lovecraft with original takes on traditional monsters, (vampires in the most recent Stross, Frankenstein’s monster in the most recent Correia), they both utilize Mary Sues as protagonists in their trademark series, and they both have strong, easily recognizable voices that are casual to the point of occasionally sounding like college students. They are also both masters of detail concerning their areas of expertise. But the chief literary difference between them doesn’t stem from their political differences, their different nationalities, or even their religious differences, but from their different socio-sexual ranks.</p><p>Correia’s Owen Pitt is an accountant. Stross’s Bob Howard is an IT guy. Neither one is a conventional handsome hero naturally beloved by women. But whereas Pitt is brave, confident in his abilities, aggressive, loves weaponry, and pursues the hot girl even if she seems to be out of his league, Howard is cowardly, insecure, passive, fears weaponry, and considers himself lucky that an older, more experienced woman deigns to take an interest in him. Pitt is a lesser Alpha, Howard is a high Gamma. And in these two specific cases, the protagonists directly reflect the socio-sexuality of their creators, which consequently shapes the paths that their stories take as well as the literary style they use to tell them.</p><p>Contrast with the Stross sample the following one from Correia’s. Notice that while Stross is too insecure to make a straightforward statement without modifying it and is afraid to cite a common saying (which <a href=\"http://www.urbandictionary.com/define.php?term=don%27t%20stick%20your%20dick%20in%20crazy\">he quotes incorrectly</a> anyhow) without signifying his awareness of potential feminist disapproval, Correia cheerfully embraces his honest masculine enthusiasm without feeling any need to apologize for it. Stross frequently talks about what is happening whereas Correia prefers to simply show it. Two different approaches, both valid, but bound to primarily appeal to very different audiences.</p><blockquote class=\"tr_bq\"><p> “Check this thing out. We can still hit the range while there is a little bit of light left.” He led me to a workbench where a strange-looking gun was mounted in a vise.</p><p>“Saiga?” I asked. That was a Russian shotgun that was based upon the action of an AK.</p><p>“At first. On this one I mounted an adjustable ACE stock, with recoil pad of course, FAL pistol grip, holographic sight system, EOTech in particular, night vision compatible. Full rail system, so you can mount lights or IR illuminators, or as you can see here, a Tula 6G15 40mm grenade launcher, front-loading, single-shot. The barrel has been cut down to twelve inches, modified choke, gave it the Vang comp treatment also so the patterns are good and tight and recoil is softer. I modified the trigger group, so top position is safe, middle is full, bottom is semi. I’ve got the gas adjusted so you are looking at about 700 RPM on full.”</p><p>He was speaking my language. “Don’t these only come with five-shot magazines?”</p><p>“I’ve got a bunch of nine-round box mags, and two twenty-round drums. I’ve tested them all, all are reliable, but on full you can run through the nine rounder in a second, so use it sparingly. Go ahead, check it out.”</p><p>I gently picked up the massive weapon. It was short, but it was thick and heavy, and that was while it was empty. Add almost a box of shells and a grenade and it would be even more so. I worked the action. The bolt was slick and the spring was powerful. Milo had thoughtfully added a shelf to the safety so that it could be operated with the trigger finger. It pointed better than it looked when I snapped it into position.</p><p>“What about specialty munitions?”</p><p>“There is a gas regulator at the end of the hand guard. I machined a new one so that it now has three positions. If you have the regulator in the right spot for the right ammo, it isn’t going to malfunction.”</p><p>I ran my finger along the regulator, and found detents for the different power levels. There was also a mystery button. When I pushed it a hinge unlocked, and an eight-inch, heavy-duty bayonet was released. The blade was absurdly sharp and thick. With a flick of the muzzle it locked into place with a snap. It was not the world’s best-balanced spear, but I wouldn’t want to be on the receiving end of it.</p><p>“No freaking way. That is awesome.”</p><p>“I got the idea off the Czech CZ52, but I improved it. It folds to the side, out of the way of the grenade launcher. You don’t hardly even know it’s there until you need it. Bottom edge is good cutting steel, on the top edge is a silver inlay. You stick this in a lycanthrope and it’s going to know it.”</p><p>“Why did you paint it brown?” I asked as I slowly turned the monstrous weapon over in my hands. It felt good. I realized I was grinning like an idiot.</p><p>He shrugged. “I’m tired of black guns. Everybody has black guns. I wanted this to be a little different. Plus black gets hot in the sun. I tried to give it kind of a desert-tiger-stripe thing. So do you like it?”</p><p>“Milo… This is the coolest gun I have ever seen in my life. And I’ve seen a lot of guns. How does it shoot?”</p><p>“Let’s go find out. From what I’ve seen from you in practice, and from what Julie told me about your shooting on the freighter, I have been waiting for somebody worthy of Abomination.”</p><p>Abomination? That was just too cool. Milo handed me a sack of loaded magazines. “Okay, just one more question. Exactly how many gun laws does this break?”</p><p>Milo’s red eyebrows scrunched together in thought. He started to count on his fingers, and then thought better of it.</p><p>“All of them.”</p></blockquote><p>Flawless style? No. But effective? Indubitably. Better than Stross’s interminable internal monologuing? Without question. Whereas a good editor might wish to tweak a word or two in the Correia text, he’d want a chainsaw for the Stross sample. It is true that one cannot always judge the writer by the book. But, by the same token, in some cases it is not difficult for the observant reader to discern when a writer is not only writing what he knows, but who he is.</p></div>",
  "content_text": "One thing I have learned over time is that the literary pinkshirts’ notion that they are superior wordsmiths and all right wing SF authors are inept third-rate hacks is about as legitimate and founded in reality as the Left’s self-serving insistence that they are highly intelligent and all right wing people are stupid:\nDamien Walter ‏@damiengwalter\nA future in which right wing SF authors actually influence the future. Horrific.\nCharlie Stross ‏@cstross\n@damiengwalter Like the Gernsback Continuum, only in degenerate mongrel second-hander form, right?\nDamien Walter ‏@damiengwalter\n@cstross A future entirely composed of poorly composed sentences.\nExpand\nVox Day ‏@voxday\n@damiengwalter @cstross As opposed to a future broken up by parentheses? (3.2 per page on average.) Why yes, I did read THE RHESUS CHART!\nAs it happens, I recently read two entertaining SF novels: MONSTER HUNTER NEMESIS by Larry Correia and THE RHESUS CHART by Charles Stross. Both were good books, entertaining, and worth the read. However, if you read them both in quick succession, you will have no choice but to conclude that Larry Correia is not merely the better writer overall (taking into account plot, characters, depth, and original ideas as well as style), he is actually the better prose stylist of the two.\nNow, keep in mind that I am a genuine fan of Stross’s Laundry books, of which THE RHESUS CHART is the latest. But Stross cannot manage to maintain a consistent narrative voice, he even violates the “show, don’t tell” rule in a\nliteral\nmanner. I mean, forget the usual “as you know, Bob” for which neophytes are so often criticized, I’m talking about an actual multi-page aside from the narrator addressed directly to the reader in order to explain what was happening elsewhere during the events previously described. Stross doesn’t so much tell a story as\nexplain\nit; it is only because his stories are so interesting and his ideas are so clever that most people fail to recognize that his literary ability is mediocre\nat best\n.\nAnd then there are the parentheses. Oh, sweet Mark Twain on methamphetamine, the\nparentheses!\nI don’t know if Stross’s editor was killed in some sort of terrible accident involving brackets and this is some sort of bizarre grammatical tribute to her or what, but regardless, he frequently insists on delivering what apparently is supposed to be additional comic detail via parentheses SEVERAL TIMES PER PAGE. (Seriously, on one page I counted FIVE SETS of them and there are no less than 371 sets in a 368-page book!) Lest you think I exaggerate, here is one of the examples I bookmarked in incredulity. Just to highlight this unusual case of Tourette’s Grammar, I have put the parenthesized text in bold:\nMhari was one of my learning experiences.\n(I’m not sure what I was, from her side of the looking glass: roadkill, perhaps. Or a useful idiot. Something like that. But let’s not go there . . .)\nRewind to the late nineties/early noughties. There’s me, Bob Howard, working on a postgrad CS degree. This means I’m putting in roughly eighty hours a week on the books and in front of the computer screen, in a field where the proportion of women is roughly what you’d expect of a sixteenth-century Benedictine monastery. I was, not to put too fine a point on it, single. I then managed to bring myself to the attention of the Laundry by means too embarrassing to relate.\n(Well, okay: I nearly landscaped Wolverhampton by accident, because that’s what happens when your funky new realtime rendering algorithm that uses a really neat logical shortcut you can’t believe nobody invented before turns out to be an open and ungrounded summoning grid. Which is the extradimensional equivalent of a fast food joint with a buzzing neon sign that says: GOOD EATS HERE. Can we move on, please?)\nSo, the organization made me a job offer I couldn’t—wasn’t allowed to—refuse. And then they stuck me behind a desk to rot for a few years, or at least until I’d been thoroughly studied and quantified and got sufficiently bored to ask for something more interesting to do instead. During which period I found myself working elbow-to-elbow with a whole raft of people I wouldn’t otherwise have met, mostly in similar straits\n(they saw something uncanny, heard something go bump in the night, and got swept up in the dragnet when they were found to be useful)\n, some of whom had no Y chromosomes and were also single.\nLike I said, Mhari was a learning experience for me. Do you really want to hear about our doomed on-again/off-again car-crash relationship? The immediate nature of the teachable moment for little old twenty-something me was, as a drunken friend of mine questionably phrased it sometime later, “Do not stick your dick in the bad crazy.” It took a lot longer, and a whole lot more perspective\n(not to mention being married for several years to someone who most certainly was not the “bad crazy”)\nfor me to work out what was actually going on in our dysfunctional relationship, which alternated between bouts of hot primal monkey sex and screaming pan-throwing arguments. What I think was happening was that the “me” that Mhari was alternately fucking and throwing things at was not me, but some sort of demented, revenge-rebound placeholder for a previous boyfriend of many years and some commitment. She’d split up with him acrimoniously less than six months before we first so much as snogged, and he’d done a beautiful gaslight number on her in the process.\n(Either that or she was bipolar with a topping of psycho special sauce: but resentful rebound relationships are a hell of a lot commoner, and I’ll go with Occam’s razor this time.)\nThe net result was that she was a walking bomb, primed to take out all her existential resentment on whatever man she next took up with, because Bill\n(I think he was a Bill)\nhad convinced her that all men were fundamentally untrustworthy bastards who would lie to her at the drop of a hat. And I, having recently emerged blinking into the light from a quasi-monastic existence, was simply a convenient cuddly punchbag.\nNow, I don’t know about you, but I don’t think any writer (or, to be more specific, novelist), who insists on inserting no less than THREE (3!) parentheses in a single paragraph has any business criticizing the prose of other authors, particularly on the sole basis of their political affiliations. (Unless, of course, his primary metric for literary quality is an exotic, but objective one based on the ratio of grouping symbols to words.)\nWhat’s interesting, however, is that Larry and Charlie are essentially flip sides of the same coin. They both write what might be termed bureaucratic urban fantasy, they both rely heavily on combining Lovecraft with original takes on traditional monsters, (vampires in the most recent Stross, Frankenstein’s monster in the most recent Correia), they both utilize Mary Sues as protagonists in their trademark series, and they both have strong, easily recognizable voices that are casual to the point of occasionally sounding like college students. They are also both masters of detail concerning their areas of expertise. But the chief literary difference between them doesn’t stem from their political differences, their different nationalities, or even their religious differences, but from their different socio-sexual ranks.\nCorreia’s Owen Pitt is an accountant. Stross’s Bob Howard is an IT guy. Neither one is a conventional handsome hero naturally beloved by women. But whereas Pitt is brave, confident in his abilities, aggressive, loves weaponry, and pursues the hot girl even if she seems to be out of his league, Howard is cowardly, insecure, passive, fears weaponry, and considers himself lucky that an older, more experienced woman deigns to take an interest in him. Pitt is a lesser Alpha, Howard is a high Gamma. And in these two specific cases, the protagonists directly reflect the socio-sexuality of their creators, which consequently shapes the paths that their stories take as well as the literary style they use to tell them.\nContrast with the Stross sample the following one from Correia’s. Notice that while Stross is too insecure to make a straightforward statement without modifying it and is afraid to cite a common saying (which\nhe quotes incorrectly\nanyhow) without signifying his awareness of potential feminist disapproval, Correia cheerfully embraces his honest masculine enthusiasm without feeling any need to apologize for it. Stross frequently talks about what is happening whereas Correia prefers to simply show it. Two different approaches, both valid, but bound to primarily appeal to very different audiences.\n“Check this thing out. We can still hit the range while there is a little bit of light left.” He led me to a workbench where a strange-looking gun was mounted in a vise.\n“Saiga?” I asked. That was a Russian shotgun that was based upon the action of an AK.\n“At first. On this one I mounted an adjustable ACE stock, with recoil pad of course, FAL pistol grip, holographic sight system, EOTech in particular, night vision compatible. Full rail system, so you can mount lights or IR illuminators, or as you can see here, a Tula 6G15 40mm grenade launcher, front-loading, single-shot. The barrel has been cut down to twelve inches, modified choke, gave it the Vang comp treatment also so the patterns are good and tight and recoil is softer. I modified the trigger group, so top position is safe, middle is full, bottom is semi. I’ve got the gas adjusted so you are looking at about 700 RPM on full.”\nHe was speaking my language. “Don’t these only come with five-shot magazines?”\n“I’ve got a bunch of nine-round box mags, and two twenty-round drums. I’ve tested them all, all are reliable, but on full you can run through the nine rounder in a second, so use it sparingly. Go ahead, check it out.”\nI gently picked up the massive weapon. It was short, but it was thick and heavy, and that was while it was empty. Add almost a box of shells and a grenade and it would be even more so. I worked the action. The bolt was slick and the spring was powerful. Milo had thoughtfully added a shelf to the safety so that it could be operated with the trigger finger. It pointed better than it looked when I snapped it into position.\n“What about specialty munitions?”\n“There is a gas regulator at the end of the hand guard. I machined a new one so that it now has three positions. If you have the regulator in the right spot for the right ammo, it isn’t going to malfunction.”\nI ran my finger along the regulator, and found detents for the different power levels. There was also a mystery button. When I pushed it a hinge unlocked, and an eight-inch, heavy-duty bayonet was released. The blade was absurdly sharp and thick. With a flick of the muzzle it locked into place with a snap. It was not the world’s best-balanced spear, but I wouldn’t want to be on the receiving end of it.\n“No freaking way. That is awesome.”\n“I got the idea off the Czech CZ52, but I improved it. It folds to the side, out of the way of the grenade launcher. You don’t hardly even know it’s there until you need it. Bottom edge is good cutting steel, on the top edge is a silver inlay. You stick this in a lycanthrope and it’s going to know it.”\n“Why did you paint it brown?” I asked as I slowly turned the monstrous weapon over in my hands. It felt good. I realized I was grinning like an idiot.\nHe shrugged. “I’m tired of black guns. Everybody has black guns. I wanted this to be a little different. Plus black gets hot in the sun. I tried to give it kind of a desert-tiger-stripe thing. So do you like it?”\n“Milo… This is the coolest gun I have ever seen in my life. And I’ve seen a lot of guns. How does it shoot?”\n“Let’s go find out. From what I’ve seen from you in practice, and from what Julie told me about your shooting on the freighter, I have been waiting for somebody worthy of Abomination.”\nAbomination? That was just too cool. Milo handed me a sack of loaded magazines. “Okay, just one more question. Exactly how many gun laws does this break?”\nMilo’s red eyebrows scrunched together in thought. He started to count on his fingers, and then thought better of it.\n“All of them.”\nFlawless style? No. But effective? Indubitably. Better than Stross’s interminable internal monologuing? Without question. Whereas a good editor might wish to tweak a word or two in the Correia text, he’d want a chainsaw for the Stross sample. It is true that one cannot always judge the writer by the book. But, by the same token, in some cases it is not difficult for the observant reader to discern when a writer is not only writing what he knows, but who he is.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-07T06:00:00+00:00"
}