{
  "url": "https://voxday.net/2014/07/12/on-libertarianis/",
  "scraped_at": "2025-12-16T12:20:31.406017",
  "title": "On libertarianism",
  "date_display": "July 12, 2014",
  "date_iso": "2014-07-12T13:00:00+00:00",
  "date_from_url": "2014-07-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Increasingly of late, people have been attempting to claim I am not a libertarian on the basis of my failure to adhere to one or another common libertarian shibboleths. Consider my purported heresies:</p><ol><li>I oppose open borders.</li><li>I oppose free trade.</li><li>I oppose female suffrage.</li><li>I oppose “equal rights”.</li><li>I oppose desegregation.</li><li>I oppose the incoherently named “gay marriage”.</li><li>I have observed, and stated, that sexual anarchy is incompatible with traditional Western civilization.</li><li>I have observed, and stated, that female education is both dyscivic and dysgenic.</li><li>I support the right of free association.</li></ol><p>These positions are obviously anti-libertine, but are they truly anti-libertarian? I don’t see that the case can be made if one considers the actual definition of libertarianism rather than various dogmatic policies that have somehow come to pass for the philosophy itself. From Wikipedia:</p><p><i><b>Libertarianism</b> (Latin: liber, free) is a classification of political philosophies that uphold liberty as their principal objective. Libertarians seek to maximize autonomy and freedom of choice, emphasizing political freedom, voluntary association and the primacy of individual judgment. While libertarians share a skepticism of authority, they diverge on the scope of their opposition to existing political and economic systems. Various schools of libertarian thought offer a range of views regarding the legitimate functions of state and private power, often calling to restrict or even to wholly dissolve pervasive social institutions. Rather than embodying a singular, rigid systematic theory or ideology, libertarianism has been applied as an umbrella term to a wide range of sometimes discordant political ideas through modern history. </i></p><p>All of my supposedly anti-libertarian positions are based on the idea of maximizing liberty in a society based on Western civilization. So, far from being anti-libertarian, I would argue that my National Libertarianism is more in keeping with the true concept of libertarianism than all the various dogmas that are libertarian in theory, but in practice have material consequences that are observably anti-human liberty.</p><p>The end may not justify the means, but the end is the only correct means of judging any social policy. Intentions and hypotheses and flights of fancy are all equally irrelevant. In the end, one can only look at the policy and decide: does this advance or detract from human liberty in this particular polity.</p></div>",
  "content_text": "Increasingly of late, people have been attempting to claim I am not a libertarian on the basis of my failure to adhere to one or another common libertarian shibboleths. Consider my purported heresies:\nI oppose open borders.\nI oppose free trade.\nI oppose female suffrage.\nI oppose “equal rights”.\nI oppose desegregation.\nI oppose the incoherently named “gay marriage”.\nI have observed, and stated, that sexual anarchy is incompatible with traditional Western civilization.\nI have observed, and stated, that female education is both dyscivic and dysgenic.\nI support the right of free association.\nThese positions are obviously anti-libertine, but are they truly anti-libertarian? I don’t see that the case can be made if one considers the actual definition of libertarianism rather than various dogmatic policies that have somehow come to pass for the philosophy itself. From Wikipedia:\nLibertarianism\n(Latin: liber, free) is a classification of political philosophies that uphold liberty as their principal objective. Libertarians seek to maximize autonomy and freedom of choice, emphasizing political freedom, voluntary association and the primacy of individual judgment. While libertarians share a skepticism of authority, they diverge on the scope of their opposition to existing political and economic systems. Various schools of libertarian thought offer a range of views regarding the legitimate functions of state and private power, often calling to restrict or even to wholly dissolve pervasive social institutions. Rather than embodying a singular, rigid systematic theory or ideology, libertarianism has been applied as an umbrella term to a wide range of sometimes discordant political ideas through modern history.\nAll of my supposedly anti-libertarian positions are based on the idea of maximizing liberty in a society based on Western civilization. So, far from being anti-libertarian, I would argue that my National Libertarianism is more in keeping with the true concept of libertarianism than all the various dogmas that are libertarian in theory, but in practice have material consequences that are observably anti-human liberty.\nThe end may not justify the means, but the end is the only correct means of judging any social policy. Intentions and hypotheses and flights of fancy are all equally irrelevant. In the end, one can only look at the policy and decide: does this advance or detract from human liberty in this particular polity.",
  "tags": [
    "philosophy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-12T12:00:00+00:00"
}