{
  "url": "https://voxday.net/2014/07/22/one-last-call-for-charity/",
  "scraped_at": "2025-12-16T12:21:37.345090",
  "title": "Last call for charity",
  "date_display": "July 22, 2014",
  "date_iso": "2014-07-22T17:17:00+00:00",
  "date_from_url": "2014-07-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.castaliahouse.com/downloads/city-beyond-time/\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/07/city_900.jpg\" width=\"200\"/></a></div><p>As I mentioned when we announced the book, a substantial portion of the first month’s sales revenues (approximately half), will be donated to <a href=\"http://www.stillbrave.org/\">Stillbrave, the children’s cancer charity</a>. An estimated $1,350+ has been raised for Stillbrave to date. Today is the final day of the release month, so if you are interested in supporting either Mr. Wright or Stillbrave, I encourage you to buy it now, either from <a href=\"http://www.castaliahouse.com/downloads/city-beyond-time/\">the Castalia House store</a> (EPUB format) or from <a href=\"http://www.amazon.com/gp/product/B00L6WI3PU\">Amazon </a>(Kindle format).</p><p>If you have not read the reviews, of which there are now 22 averaging a 4.7 rating, I hope you will not mind if I happen to share a few of the newer ones with you. And to those of you who have already purchased the book, thank you very much for all your support.</p><p><b>Review 1: </b><i>I, or my other timeline self, really enjoyed this. I have to admit, I like this better than Awake in the Night Land. I mean, it has a time travelling gumshoe, who can’t like that? The twists and turns of chrono-based events was fun. If I ever ran into anything that was even remotely difficult to understand, I just went with it, knowing that my other self on a different timeline would understand it. Or maybe I didn’t. Well, never mind…. Good book.  Go with it.  You or your other timeline self will enjoy it.</i></p><p><b>Review 2:</b><i><b> </b></i><i><i>Time travel has been a staple of science fiction for decades, as has the<br> usual paradoxes.  But Wright has tried a new twist – the morality of<br> time travel.  What is right and wrong when you can go back in time,<br> rerun the past, and create the future?  And what horrors can you<br> conceal?  Wright tells these stories with an elegant phrasing rarely<br> seen today.  Highly recommended.</br></br></br></br></br></i></i></p><p><b>Review 3:</b><i><b> </b></i><i><i>This is the third book of John C. Wright I have read this year. I was introduced to Wright’s writing with his book “Awake in the Nightland,” published by Castalia House. The second was “Count to a Trillion,” published by Tor. This third book, “City Beyond Time,” is published by Castalia House. “City Beyond Time” is alongs the same vein as “Awake in the Nightland.” Both are a collection of short stories within the same setting…. I would recommend this book to anyone who loves time travel science fiction. It is better then most time travel books that are linear in style and movement. It is by no means predictable and keeps you reading for more. I hope Wright writes more stories about Mr. Fontino in the future, perhaps even give him his own novel series.</i> </i></p></div>",
  "content_text": "As I mentioned when we announced the book, a substantial portion of the first month’s sales revenues (approximately half), will be donated to\nStillbrave, the children’s cancer charity\n. An estimated $1,350+ has been raised for Stillbrave to date. Today is the final day of the release month, so if you are interested in supporting either Mr. Wright or Stillbrave, I encourage you to buy it now, either from\nthe Castalia House store\n(EPUB format) or from\nAmazon\n(Kindle format).\nIf you have not read the reviews, of which there are now 22 averaging a 4.7 rating, I hope you will not mind if I happen to share a few of the newer ones with you. And to those of you who have already purchased the book, thank you very much for all your support.\nReview 1:\nI, or my other timeline self, really enjoyed this. I have to admit, I like this better than Awake in the Night Land. I mean, it has a time travelling gumshoe, who can’t like that? The twists and turns of chrono-based events was fun. If I ever ran into anything that was even remotely difficult to understand, I just went with it, knowing that my other self on a different timeline would understand it. Or maybe I didn’t. Well, never mind…. Good book.  Go with it.  You or your other timeline self will enjoy it.\nReview 2:\nTime travel has been a staple of science fiction for decades, as has the\nusual paradoxes.  But Wright has tried a new twist – the morality of\ntime travel.  What is right and wrong when you can go back in time,\nrerun the past, and create the future?  And what horrors can you\nconceal?  Wright tells these stories with an elegant phrasing rarely\nseen today.  Highly recommended.\nReview 3:\nThis is the third book of John C. Wright I have read this year. I was introduced to Wright’s writing with his book “Awake in the Nightland,” published by Castalia House. The second was “Count to a Trillion,” published by Tor. This third book, “City Beyond Time,” is published by Castalia House. “City Beyond Time” is alongs the same vein as “Awake in the Nightland.” Both are a collection of short stories within the same setting…. I would recommend this book to anyone who loves time travel science fiction. It is better then most time travel books that are linear in style and movement. It is by no means predictable and keeps you reading for more. I hope Wright writes more stories about Mr. Fontino in the future, perhaps even give him his own novel series.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-22T16:17:00+00:00"
}