{
  "url": "https://voxday.net/2014/07/24/out-of-frying-pan/",
  "scraped_at": "2025-12-16T12:21:48.673597",
  "title": "Out of the frying pan",
  "date_display": "July 24, 2014",
  "date_iso": "2014-07-24T13:00:00+00:00",
  "date_from_url": "2014-07-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Learned Elders of Wye <a href=\"http://www.milobookclub.com/2014/01/07/protocols-of-learned-elders-of-wye/\">have suggested China</a> as a possible destination for the Jews once a sufficient number of Americans realize what has been done to their country by Emanuel Celler and a number of his elite co-religionists. Contra to <a href=\"http://www.atimes.com/atimes/China/CHIN-01-100114.html\">Spengler’s insistence</a> that common traits bind the Chinese and Jewish people and his claims that the Chinese deeply admire and respect the Jews, it would appear that China is not a particularly viable option:</p><blockquote class=\"tr_bq\"><p> A 2013 Pew poll found vastly more unfavorable feelings toward Israel outside than within the United States, which registered a 27 percent unfavorable view of Israel and a 57 percent favorable view. In contrast, 44 percent of people in Britain had an unfavorable view of Israel. Unfavorable views of Israel were held by 62 percent in Germany, 65 percent in France, 66 percent in China and in the 80 percent to 90 percent range in Arab and Muslim countries.</p></blockquote><p>If one considers the anti-Israel demonstrations in Paris and the fact that the Israeli Ambassador to Germany said last week: “They pursue the Jews in the streets of Berlin… as if we were in 1938”, it is remarkable to see that the Chinese view of Israel is even less favorable.</p><p>Lest one conclude that my view of vastly growing anti-semitism on the US horizon is some form of wishful thinking rather than a warning from a friendly acquaintance, it may be helpful to note that I am hardly the first to make the observation.</p><blockquote class=\"tr_bq\"><p> The fear expressed that “a real decline of the West, particularly the United States, would have dramatic consequences for the Jewish people,” also led to controversy. Brandeis University president Jehuda Reinharz agreed that this type of decline can be expected “in the coming two decades”.</p></blockquote><p>As I have been predicting a catastrophic decline of the USA by 2033 for ten years, it should hardly be surprising that I don’t believe it will be a neutral event where American Jews are concerned. The Jews at the central bank, the Jews at the heart of the financial system, and the Jews whose literally usurious economic theories were used as a justification for constructing the $60 trillion credit ponzi will rightly be blamed when it collapses. The Jews who battled to change the USA’s demographics by opening its borders will rightly be blamed for the ethnic strife dividing the country.</p><p>And it is their blameless coreligionists who will likely bear the brunt of the public’s fury at the all-too-predictable consequences of those actions, as has repeatedly been the case in the past.</p><p>The British Foreign Minister said yesterday: <i>“As this campaign goes on and the civilian casualties in Gaza mount, western opinion is becoming more and more concerned and less and less sympathetic to Israel. That’s simply a fact and I have to tell that to my Israeli counterparts.” </i></p><p>To put another simple fact in terms they should be able to understand, destroying a country’s demographics and denigrating its dominant religion while securing highly visible statistical overepresentations in various areas of wealth and power is not good for the Jews. And no amount of appeals to genetic or cultural superiority, or to the Holocaust, will obviate that fact.</p></div>",
  "content_text": "The Learned Elders of Wye\nhave suggested China\nas a possible destination for the Jews once a sufficient number of Americans realize what has been done to their country by Emanuel Celler and a number of his elite co-religionists. Contra to\nSpengler’s insistence\nthat common traits bind the Chinese and Jewish people and his claims that the Chinese deeply admire and respect the Jews, it would appear that China is not a particularly viable option:\nA 2013 Pew poll found vastly more unfavorable feelings toward Israel outside than within the United States, which registered a 27 percent unfavorable view of Israel and a 57 percent favorable view. In contrast, 44 percent of people in Britain had an unfavorable view of Israel. Unfavorable views of Israel were held by 62 percent in Germany, 65 percent in France, 66 percent in China and in the 80 percent to 90 percent range in Arab and Muslim countries.\nIf one considers the anti-Israel demonstrations in Paris and the fact that the Israeli Ambassador to Germany said last week: “They pursue the Jews in the streets of Berlin… as if we were in 1938”, it is remarkable to see that the Chinese view of Israel is even less favorable.\nLest one conclude that my view of vastly growing anti-semitism on the US horizon is some form of wishful thinking rather than a warning from a friendly acquaintance, it may be helpful to note that I am hardly the first to make the observation.\nThe fear expressed that “a real decline of the West, particularly the United States, would have dramatic consequences for the Jewish people,” also led to controversy. Brandeis University president Jehuda Reinharz agreed that this type of decline can be expected “in the coming two decades”.\nAs I have been predicting a catastrophic decline of the USA by 2033 for ten years, it should hardly be surprising that I don’t believe it will be a neutral event where American Jews are concerned. The Jews at the central bank, the Jews at the heart of the financial system, and the Jews whose literally usurious economic theories were used as a justification for constructing the $60 trillion credit ponzi will rightly be blamed when it collapses. The Jews who battled to change the USA’s demographics by opening its borders will rightly be blamed for the ethnic strife dividing the country.\nAnd it is their blameless coreligionists who will likely bear the brunt of the public’s fury at the all-too-predictable consequences of those actions, as has repeatedly been the case in the past.\nThe British Foreign Minister said yesterday:\n“As this campaign goes on and the civilian casualties in Gaza mount, western opinion is becoming more and more concerned and less and less sympathetic to Israel. That’s simply a fact and I have to tell that to my Israeli counterparts.”\nTo put another simple fact in terms they should be able to understand, destroying a country’s demographics and denigrating its dominant religion while securing highly visible statistical overepresentations in various areas of wealth and power is not good for the Jews. And no amount of appeals to genetic or cultural superiority, or to the Holocaust, will obviate that fact.",
  "tags": [
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-24T12:00:00+00:00"
}