{
  "url": "https://voxday.net/2014/07/06/pink-sff-in-one-picture/",
  "scraped_at": "2025-12-16T12:19:51.440175",
  "title": "Pink SF/F in one picture",
  "date_display": "July 6, 2014",
  "date_iso": "2014-07-06T14:00:00+00:00",
  "date_from_url": "2014-07-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.clarkesworldmagazine.com/images/big3subnews70.gif\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.clarkesworldmagazine.com/images/big3subnews70.gif\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.clarkesworldmagazine.com/images/big3subnews70.gif\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p>For all the triumphalism, award-giving, and mutual queef-sniffing of its politically-correct champions, the observable fact is that Pink SF/F has been an unmitigated disaster when viewed from an objective perspective. While the conventional argument is that it was the Internet that has devastated the short fiction magazines, this chart showing the rapidly declining market for Analog, Asimov’s, Fantasy &amp; Science Fiction, and the now-defunct Realms of Fantasy show that it could not have been the Internet that had such a deleterious effect as, depending upon the magazine, the declines began between 1984 and 1992.</p><p>Naturally, those who think it is definitely wonderful that things are opening up in the genre have absolutely no idea what could possibly have caused <a href=\"http://heron61.livejournal.com/764331.html\">this puzzling decline</a>.</p><blockquote class=\"tr_bq\"><p> So, it seems that somewhere in the 1980s and the very beginning of the 90s, something, happened to both newspapers and SF magazines. Some of it is likely due to a gradual decline in reading for pleasure, but this decline is a lot less significant than the decline in newspaper or SF magazine sales. I can’t find 20+ year data for magazines, but what I could find doesn’t look as significant. I don’t have any answers, merely a question.</p></blockquote><p>Whatever could that be? Speaking as a former subscriber to Asimov’s and F&amp;SF, who finally stopped subscribing to both magazines after realizing that neither contained anything of interest any longer, I think I can shed some light on the situation. First, it was not a decline in reading for pleasure, as increasing overall book sales will suffice to demonstrate. Second, there were certainly some industry distribution issues involved, the more important factor was the way in which the gatekeepers opened up the genre to every form of subversion and perversion and left-liberal orthodoxy. This was was more than offensive to many readers’ sensibilities, even worse, it was tedious, monotonous, and uninteresting.</p><p>Consider what one SFWA member mentioned on Twitter the other day: “At Barnes &amp; Noble. The SFF section is filled w friends. Yet the book<br> blurbs suggest we’re all writing the same 5 books over and over again.”</br></p><p>They are. They were. And due to this, as the statistics show, in only 20 years, the new SF/F gatekeepers managed to drive off as much as 80 percent of their audience! Notice that the chart above only runs through 2007; the decline of the traditional publishers has observably picked up speed since then with the rise of Amazon and independent publishing. (I have heard that e-subscriptions have helped the SF/F mags stop their decline; at this point there are probably no non-Pink readers left to lose.) Remember, in 2012, Publisher’s Weekly reported science fiction sales were down 21 percent from the year before.</p><p>Look at <a href=\"http://us.macmillan.com/tor/categories/General/Tor/TopSellers\">Tor’s bestsellers</a>. It’s all Orson Scott Card, Robert Jordan, and Brandon Sanderson, followed by HALO tie-in novels. Many of these are books published 30 years ago. Some of these authors are dead. Tor’s current favorite, the ever-ubiquitous John Scalzi, doesn’t even show up until #25, and the long list of Tor-published no-name award-winners and SFWA activists are far down the list. Or look at this week’s Sci-Fi bestsellers on Publisher’s Weekly. <i>Dune</i>, by Frank Herbert, published in 1965, is number 9.</p><p>You may recall the pinkshirts celebrating the fact that women swept the Nebula Awards this year. And yet, there is not a single female author in the Publisher’s Weekly <a href=\"http://www.publishersweekly.com/pw/nielsen/xscifi.html\">top ten Sci-Fi bestsellers</a>.</p><p>Does a similar decline in newspapers invalidate this interpretation? I don’t think so. Conservatives used to read the newspaper and occasionally grit their teeth, but they religiously subscribed to one or more papers. But as the left-liberal influence over the editorial page steadily grew, until, by the early 1990s, the conservative voice was reduced to a single token moderate, conservatives quit subscribing to newspapers for much the same reason many genre readers quit reading science fiction and fantasy: they didn’t see any reason to pay money to have their views attacked on a regular basis.</p><p>I expect CNN’s ratings have seen a similar decline, the difference in the cable news market is that Fox News provided a direct alternative. In areas where there were no alternatives, such as genre publishing and single-newspaper cities, people simply turned away.</p><p>It’s not an accident that Brad Torgersen has been repeatedly voted the favorite author of Analog’s dwindled readership. He may be the only author published there who is still writing in a reasonable facsimile of classic science fiction.</p></div>",
  "content_text": "For all the triumphalism, award-giving, and mutual queef-sniffing of its politically-correct champions, the observable fact is that Pink SF/F has been an unmitigated disaster when viewed from an objective perspective. While the conventional argument is that it was the Internet that has devastated the short fiction magazines, this chart showing the rapidly declining market for Analog, Asimov’s, Fantasy & Science Fiction, and the now-defunct Realms of Fantasy show that it could not have been the Internet that had such a deleterious effect as, depending upon the magazine, the declines began between 1984 and 1992.\nNaturally, those who think it is definitely wonderful that things are opening up in the genre have absolutely no idea what could possibly have caused\nthis puzzling decline\n.\nSo, it seems that somewhere in the 1980s and the very beginning of the 90s, something, happened to both newspapers and SF magazines. Some of it is likely due to a gradual decline in reading for pleasure, but this decline is a lot less significant than the decline in newspaper or SF magazine sales. I can’t find 20+ year data for magazines, but what I could find doesn’t look as significant. I don’t have any answers, merely a question.\nWhatever could that be? Speaking as a former subscriber to Asimov’s and F&SF, who finally stopped subscribing to both magazines after realizing that neither contained anything of interest any longer, I think I can shed some light on the situation. First, it was not a decline in reading for pleasure, as increasing overall book sales will suffice to demonstrate. Second, there were certainly some industry distribution issues involved, the more important factor was the way in which the gatekeepers opened up the genre to every form of subversion and perversion and left-liberal orthodoxy. This was was more than offensive to many readers’ sensibilities, even worse, it was tedious, monotonous, and uninteresting.\nConsider what one SFWA member mentioned on Twitter the other day: “At Barnes & Noble. The SFF section is filled w friends. Yet the book\nblurbs suggest we’re all writing the same 5 books over and over again.”\nThey are. They were. And due to this, as the statistics show, in only 20 years, the new SF/F gatekeepers managed to drive off as much as 80 percent of their audience! Notice that the chart above only runs through 2007; the decline of the traditional publishers has observably picked up speed since then with the rise of Amazon and independent publishing. (I have heard that e-subscriptions have helped the SF/F mags stop their decline; at this point there are probably no non-Pink readers left to lose.) Remember, in 2012, Publisher’s Weekly reported science fiction sales were down 21 percent from the year before.\nLook at\nTor’s bestsellers\n. It’s all Orson Scott Card, Robert Jordan, and Brandon Sanderson, followed by HALO tie-in novels. Many of these are books published 30 years ago. Some of these authors are dead. Tor’s current favorite, the ever-ubiquitous John Scalzi, doesn’t even show up until #25, and the long list of Tor-published no-name award-winners and SFWA activists are far down the list. Or look at this week’s Sci-Fi bestsellers on Publisher’s Weekly.\nDune\n, by Frank Herbert, published in 1965, is number 9.\nYou may recall the pinkshirts celebrating the fact that women swept the Nebula Awards this year. And yet, there is not a single female author in the Publisher’s Weekly\ntop ten Sci-Fi bestsellers\n.\nDoes a similar decline in newspapers invalidate this interpretation? I don’t think so. Conservatives used to read the newspaper and occasionally grit their teeth, but they religiously subscribed to one or more papers. But as the left-liberal influence over the editorial page steadily grew, until, by the early 1990s, the conservative voice was reduced to a single token moderate, conservatives quit subscribing to newspapers for much the same reason many genre readers quit reading science fiction and fantasy: they didn’t see any reason to pay money to have their views attacked on a regular basis.\nI expect CNN’s ratings have seen a similar decline, the difference in the cable news market is that Fox News provided a direct alternative. In areas where there were no alternatives, such as genre publishing and single-newspaper cities, people simply turned away.\nIt’s not an accident that Brad Torgersen has been repeatedly voted the favorite author of Analog’s dwindled readership. He may be the only author published there who is still writing in a reasonable facsimile of classic science fiction.",
  "tags": [
    "decline and fall",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-06T13:00:00+00:00"
}