{
  "url": "https://voxday.net/2014/07/16/pinkshirts-running-amok/",
  "scraped_at": "2025-12-16T12:20:53.800816",
  "title": "Pinkshirts running amok",
  "date_display": "July 16, 2014",
  "date_iso": "2014-07-16T13:00:00+00:00",
  "date_from_url": "2014-07-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>No doubt they’ll be completely astonished when their sales collapse by 80 percent:</p><blockquote class=\"tr_bq\"><p> Marvel is excited to announce an all-new era for the God of Thunder in brand new series, THOR<i>, </i>written by Jason Aaron complimented with art from Russell Dauterman<i>.</i> This October, Marvel Comics evolves once<br> again in one of the most shocking and exciting changes ever to shake one<br> of the “big three” of Captain America, Iron Man and Thor. No longer is<br> the classic Thunder God able to hold the mighty hammer, Mjölnir, and a<br> brand new female hero will emerge worthy of the name THOR.</br></br></br></br></p><p>Series writer Jason Aaron emphasizes, “This is not She-Thor. This is not Lady Thor. This is not Thorita. This is THOR. This is <i>the</i> THOR of the Marvel Universe. But it’s unlike any Thor we’ve ever seen before.”<br> THOR is the latest in the ever-growing and<br> long list of female-centric titles that continues to invite new readers<br> into the Marvel Universe.</br></br></br></p></blockquote><p>The astonishing thing is that these people actually believe they are the creative ones. Why not turn <i>the </i>WONDER WOMAN into a cross-dressing man? Why not transform <i>the </i>SUPERMAN into a monkey? Why not change <i>the </i>CAPTAIN AMERICA into a buck private in the Armed Forces of the United Nations?</p><p>Intentionally or unconsciously, they confuse self-parody with creativity. They tear down and think they are engaged in creative destruction, only what they rebuild is nothing but a cheap and ugly mockery of what stood there before.</p></div>",
  "content_text": "No doubt they’ll be completely astonished when their sales collapse by 80 percent:\nMarvel is excited to announce an all-new era for the God of Thunder in brand new series, THOR\n,\nwritten by Jason Aaron complimented with art from Russell Dauterman\n.\nThis October, Marvel Comics evolves once\nagain in one of the most shocking and exciting changes ever to shake one\nof the “big three” of Captain America, Iron Man and Thor. No longer is\nthe classic Thunder God able to hold the mighty hammer, Mjölnir, and a\nbrand new female hero will emerge worthy of the name THOR.\nSeries writer Jason Aaron emphasizes, “This is not She-Thor. This is not Lady Thor. This is not Thorita. This is THOR. This is\nthe\nTHOR of the Marvel Universe. But it’s unlike any Thor we’ve ever seen before.”\nTHOR is the latest in the ever-growing and\nlong list of female-centric titles that continues to invite new readers\ninto the Marvel Universe.\nThe astonishing thing is that these people actually believe they are the creative ones. Why not turn\nthe\nWONDER WOMAN into a cross-dressing man? Why not transform\nthe\nSUPERMAN into a monkey? Why not change\nthe\nCAPTAIN AMERICA into a buck private in the Armed Forces of the United Nations?\nIntentionally or unconsciously, they confuse self-parody with creativity. They tear down and think they are engaged in creative destruction, only what they rebuild is nothing but a cheap and ugly mockery of what stood there before.",
  "tags": [
    "Castalia House",
    "media",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-16T12:00:00+00:00"
}