{
  "url": "https://voxday.net/2014/07/05/pro-pedophile-anti-amazon/",
  "scraped_at": "2025-12-16T12:19:47.761175",
  "title": "Pro-pedophile, anti-Amazon",
  "date_display": "July 5, 2014",
  "date_iso": "2014-07-05T21:00:00+00:00",
  "date_from_url": "2014-07-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s certainly an unusual public position for a writers organization to take. I found <a href=\"http://donsakers.com/drupal6/node/3643\">this letter by an SFWA member</a> to be vastly amusing, particularly in light of how the astonishingly inept Steven Gould was recently re-elected SFWA President:</p><blockquote class=\"tr_bq\"><p> Douglas Preston is circulating a letter regarding the Amazon-Hachette dispute. In this letter, Preston finds Amazon alone guilty of multiple sins against Hachette authors. He encourages readers to email Jeff Bezos about the matter. The dispute has exposed a big faultline in publishing, between those authors traditionally published by the Big Five (who have spared no words defending Hachette) and independent and self-published authors (who have been equally vociferous in defense of Amazon).</p><p>Myself, I’ve kept quiet about this kerfluffle because I didn’t have a dog in this fight. I’m an independent author (without connection to any of the Big Five publishers.) I do make the lion’s share of my sales through Amazon, so there’s that.</p><p>Today, though, my professional society — The Science Fiction and Fantasy Writers of America (SFWA) — threw my dog into the fight. The President and Board of SFWA officially endorsed Preston’s letter. They did so without discussion among the membership or, as near as I can tell, any attempt to determine the wishes of the members….</p><p>So what does SFWA do? It publicly and officially takes the side of traditional publishing, thereby signaling to independent and self-published writers that SFWA doesn’t understand or care to understand their concerns. it’s about as clear a message of “You don’t belong and aren’t welcome” as I’ve ever seen.<br> I know many hardworking members of SFWA who stood ready to resign if the vote goes against allowing self-published writers to join — several of them have already said that this endorsement is the last straw.</br></p></blockquote><p>One thing you have to understand about SFWA is that most of their members a) despise self-publishers and b) are absolutely terrified of Amazon. They speak very differently in public these days, but I was privy to their two private forums for years and many of them are on the record practically spitting contempt for people who are not, in their view, “real writers”.</p><p>One of the many things they didn’t like about me when I ran for office was that I intended to expand eligibility to self-publishers as well as game writers, which naturally horrified those who were quite happy with permitting the gatekeepers at the major publishers and genre magazines to decide who was, and who was not, eligible for membership.</p><p>The other thing that is more than a little funny is that numerous people expressed the fear that I would act unilaterally if I was elected president. And now Steven Gould has gone and publicly taken sides against Amazon without bothering to see if the membership would be on board with that.</p><p>But still nothing on former SFWA members Marion Zimmer Bradley or Ed Kramer. Or Grand Master Sam Delany.</p><p>Cedar Sanderson opines at Mad Genius Club:</p><blockquote class=\"tr_bq\"><p> So here we have an organization that still claims it supports authors and helps them get the best deal, but now they are in bed with one of the biggest publishing businesses. Their cover story is getting thinner than a streetwalker’s top…. For sure, they aren’t fighting for authors to get the best deal. They<br> just came out in support of the guys who pays 12.5% on a book sale, over<br> the guy who pays 70% on a book sale. Even the least mathematically able<br> among us can see where the “bend over and spread, dear’ side is.</br></br></br></p></blockquote><p>I’m not surprised they are on Hatchette’s side. That was always obvious. I’m just shocked they were dumb enough to actually take Hatchette’s side in public. I, for one, would find it hilarious if Amazon responded by refusing to sell any books by an SFWA member. How many nanoseconds do you think it would take these highly principled writers to do a 180 and back down.</p><p>As for me, as a writer with multiple book contracts with a Big Five publisher and an editor at an independent press, I am firmly on Amazon’s side here. As every writer and reader should be. Perhaps one day Amazon will begin behaving as badly as the Big Five have behaved. Perhaps one day Amazon will try to increase its revenue share from 30 percent. But there is no rational case for taking Hatchette’s side that does not primarily involve being the recipient of payments by a Big Five publisher.</p></div>",
  "content_text": "It’s certainly an unusual public position for a writers organization to take. I found\nthis letter by an SFWA member\nto be vastly amusing, particularly in light of how the astonishingly inept Steven Gould was recently re-elected SFWA President:\nDouglas Preston is circulating a letter regarding the Amazon-Hachette dispute. In this letter, Preston finds Amazon alone guilty of multiple sins against Hachette authors. He encourages readers to email Jeff Bezos about the matter. The dispute has exposed a big faultline in publishing, between those authors traditionally published by the Big Five (who have spared no words defending Hachette) and independent and self-published authors (who have been equally vociferous in defense of Amazon).\nMyself, I’ve kept quiet about this kerfluffle because I didn’t have a dog in this fight. I’m an independent author (without connection to any of the Big Five publishers.) I do make the lion’s share of my sales through Amazon, so there’s that.\nToday, though, my professional society — The Science Fiction and Fantasy Writers of America (SFWA) — threw my dog into the fight. The President and Board of SFWA officially endorsed Preston’s letter. They did so without discussion among the membership or, as near as I can tell, any attempt to determine the wishes of the members….\nSo what does SFWA do? It publicly and officially takes the side of traditional publishing, thereby signaling to independent and self-published writers that SFWA doesn’t understand or care to understand their concerns. it’s about as clear a message of “You don’t belong and aren’t welcome” as I’ve ever seen.\nI know many hardworking members of SFWA who stood ready to resign if the vote goes against allowing self-published writers to join — several of them have already said that this endorsement is the last straw.\nOne thing you have to understand about SFWA is that most of their members a) despise self-publishers and b) are absolutely terrified of Amazon. They speak very differently in public these days, but I was privy to their two private forums for years and many of them are on the record practically spitting contempt for people who are not, in their view, “real writers”.\nOne of the many things they didn’t like about me when I ran for office was that I intended to expand eligibility to self-publishers as well as game writers, which naturally horrified those who were quite happy with permitting the gatekeepers at the major publishers and genre magazines to decide who was, and who was not, eligible for membership.\nThe other thing that is more than a little funny is that numerous people expressed the fear that I would act unilaterally if I was elected president. And now Steven Gould has gone and publicly taken sides against Amazon without bothering to see if the membership would be on board with that.\nBut still nothing on former SFWA members Marion Zimmer Bradley or Ed Kramer. Or Grand Master Sam Delany.\nCedar Sanderson opines at Mad Genius Club:\nSo here we have an organization that still claims it supports authors and helps them get the best deal, but now they are in bed with one of the biggest publishing businesses. Their cover story is getting thinner than a streetwalker’s top…. For sure, they aren’t fighting for authors to get the best deal. They\njust came out in support of the guys who pays 12.5% on a book sale, over\nthe guy who pays 70% on a book sale. Even the least mathematically able\namong us can see where the “bend over and spread, dear’ side is.\nI’m not surprised they are on Hatchette’s side. That was always obvious. I’m just shocked they were dumb enough to actually take Hatchette’s side in public. I, for one, would find it hilarious if Amazon responded by refusing to sell any books by an SFWA member. How many nanoseconds do you think it would take these highly principled writers to do a 180 and back down.\nAs for me, as a writer with multiple book contracts with a Big Five publisher and an editor at an independent press, I am firmly on Amazon’s side here. As every writer and reader should be. Perhaps one day Amazon will begin behaving as badly as the Big Five have behaved. Perhaps one day Amazon will try to increase its revenue share from 30 percent. But there is no rational case for taking Hatchette’s side that does not primarily involve being the recipient of payments by a Big Five publisher.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-05T20:00:00+00:00"
}