{
  "url": "https://voxday.net/2014/07/23/sabotaging-marriage/",
  "scraped_at": "2025-12-16T12:21:42.888378",
  "title": "Sabotaging marriage",
  "date_display": "July 23, 2014",
  "date_iso": "2014-07-23T13:00:00+00:00",
  "date_from_url": "2014-07-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Male white knights and feminists should think twice before defending Spreadsheet Wife, as Troy Francis observes at The Return of Kings that her actions are nothing less than <a href=\"http://www.returnofkings.com/40352/the-woman-who-posted-her-husbands-sex-spreadsheet-online-did-men-everywhere-a-favour?utm_source=dlvr.it&amp;utm_medium=twitter&amp;ModPagespeed=noscript\">a public advertisement for anti-marriage</a>:</p><blockquote class=\"tr_bq\"><p> The best creative agency in the world would have been hard-pressed to come up with a more effective advertisement against marriage. Rollo points out that getting hitched is no insulation from the sexual marketplace, and it is a common trope that men need to game their wives. But that’s a hell of a lot of work, and with the sexual rewards potentially so low, and with women being a depreciating asset over time, many guys could be forgiven for choosing not to bother and to remain single, learn game and spin plates instead.</p></blockquote><p>You can read my take on it <a href=\"http://alphagameplan.blogspot.com/2014/07/mortification-game.html\">at Alpha Game</a>:</p><blockquote class=\"tr_bq\"><p> The first thing is that this spreadsheet didn’t come out of the blue. It is almost surely a quintessential male response to a very typical female tactic: the demand for proof. Women often try to put men in a false “heads I win, tails you lose” position, in which they demand proof of the assertion, but if called on this demand, then try to argue that the anticipation of the need for proof somehow disqualifies its relevance. That is exactly what the wife is attempting to do here. She’s trying to use that the fact he made the spreadsheet and sent it to her on the road to retroactively justify her previous actions.</p></blockquote><p>The worst response is arguably that of self-admitted white knight Dave Swindle, who is adroitly taken apart <a href=\"http://pjmedia.com/drhelen/2014/07/22/white-knighting-much-dave/\">by Dr. Helen</a>:</p><blockquote class=\"tr_bq\"><p> This response is classic white knighting where the spreadsheet guy is a<br> failure and this is why he can’t get sex. Note the word loser that is<br> used in Dave’s first paragraph. Of course it’s important to white knight<br> and call the guy a loser because that means that a man that doesn’t get<br> upset if his wife won’t have sex with him is a winner! A convenient<br> excuse to tell oneself on yet another sexless night. And of course, as<br> Dave notes, it is always up to the man to take responsibility for any<br> problems in the couple’s sex life. Wife doesn’t put out? It’s your<br> fault, man. You lack self-control.</br></br></br></br></br></br></br></br></p></blockquote><p>The similarity between the normal female response and the gamma male’s does border on the creepy at times, doesn’t it? Anyhow, this should demonstrate how the instinctive and/or solipsistic reflex to defend Team Woman at all costs is observably detrimental to female interests in the long-term.</p></div>",
  "content_text": "Male white knights and feminists should think twice before defending Spreadsheet Wife, as Troy Francis observes at The Return of Kings that her actions are nothing less than\na public advertisement for anti-marriage\n:\nThe best creative agency in the world would have been hard-pressed to come up with a more effective advertisement against marriage. Rollo points out that getting hitched is no insulation from the sexual marketplace, and it is a common trope that men need to game their wives. But that’s a hell of a lot of work, and with the sexual rewards potentially so low, and with women being a depreciating asset over time, many guys could be forgiven for choosing not to bother and to remain single, learn game and spin plates instead.\nYou can read my take on it\nat Alpha Game\n:\nThe first thing is that this spreadsheet didn’t come out of the blue. It is almost surely a quintessential male response to a very typical female tactic: the demand for proof. Women often try to put men in a false “heads I win, tails you lose” position, in which they demand proof of the assertion, but if called on this demand, then try to argue that the anticipation of the need for proof somehow disqualifies its relevance. That is exactly what the wife is attempting to do here. She’s trying to use that the fact he made the spreadsheet and sent it to her on the road to retroactively justify her previous actions.\nThe worst response is arguably that of self-admitted white knight Dave Swindle, who is adroitly taken apart\nby Dr. Helen\n:\nThis response is classic white knighting where the spreadsheet guy is a\nfailure and this is why he can’t get sex. Note the word loser that is\nused in Dave’s first paragraph. Of course it’s important to white knight\nand call the guy a loser because that means that a man that doesn’t get\nupset if his wife won’t have sex with him is a winner! A convenient\nexcuse to tell oneself on yet another sexless night. And of course, as\nDave notes, it is always up to the man to take responsibility for any\nproblems in the couple’s sex life. Wife doesn’t put out? It’s your\nfault, man. You lack self-control.\nThe similarity between the normal female response and the gamma male’s does border on the creepy at times, doesn’t it? Anyhow, this should demonstrate how the instinctive and/or solipsistic reflex to defend Team Woman at all costs is observably detrimental to female interests in the long-term.",
  "tags": [
    "Alpha Game"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-23T12:00:00+00:00"
}