{
  "url": "https://voxday.net/2014/07/07/sfwa-contra-amazon/",
  "scraped_at": "2025-12-16T12:20:00.216818",
  "title": "SFWA contra Amazon",
  "date_display": "July 7, 2014",
  "date_iso": "2014-07-07T20:00:00+00:00",
  "date_from_url": "2014-07-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.milobookclub.com/wp-content/uploads/2014/07/SFWA_Amazon.gif\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" height=\"131\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/07/SFWA_Amazon.gif\" width=\"320\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2014/07/SFWA_Amazon.gif\" decoding=\"async\" height=\"131\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20320%20131%22%3E%3C/svg%3E\" width=\"320\"/></a>There has been a fair amount of talk concerning SFWA aligning itself against Amazon on behalf of the Big Five publishers. Here is the confirming evidence, straight from the horse’s mouth. And to think these geniuses actually re-elected Steven Gould. I was wondering what he could possibly do for an encore after last year’s performance; now we know.  As for the Preston letter that Gould mentions SFWA signing onto, here is the text:</p><blockquote class=\"tr_bq\"><p> A letter to our readers:</p><p>Amazon is involved in a commercial dispute with the book publisher Hachette, which owns Little Brown, Grand Central Publishing, and other familiar imprints. These sorts of disputes happen all the time between companies and they are usually resolved in a corporate back room.<br> But in this case, Amazon has done something unusual. It has directly targeted Hachette’s authors in an effort to force their publisher to agree to its terms.</br></p><p>For the past month, Amazon has been:<br> –Boycotting Hachette authors, refusing to accept pre-orders on Hachette’s authors’ books, claiming they are “unavailable.”<br> –Refusing to discount the prices of many of Hachette’s authors’ books.<br> –Slowing the delivery of thousands of Hachette’s authors’ books to Amazon customers, indicating that delivery will take as long as several weeks on most titles.</br></br></br></p><p>As writers—some but not all published by Hachette—we feel strongly that no bookseller should block the sale of books or otherwise prevent or discourage customers from ordering or receiving the books they want. It is not right for Amazon to single out a group of authors, who are not involved in the dispute, for selective retaliation. Moreover, by inconveniencing and misleading its own customers with unfair pricing and delayed delivery, Amazon is contradicting its own written promise to be “Earth’s most customercentric company.”</p><p>Many of us supported Amazon from when it was a struggling start-up. Our books started Amazon on the road to selling everything and becoming one of the world’s largest corporations. We have made Amazon many millions of dollars and over the years have contributed so much, free of charge, to the company by way of cooperation, joint promotions, reviews and blogs. This is no way to treat a business partner. Nor is it the right way to treat your friends. Without taking sides on the contractual dispute between Hachette and Amazon, we encourage Amazon in the strongest possible terms to stop harming the livelihood of the authors on whom it has built its business. None of us, neither readers nor authors, benefit when books are taken hostage. (We’re not alone in our plea: the opinion pages of both the New York Times and the Wall Street Journal, which rarely agree on anything, have roundly condemned Amazon’s corporate behavior.)</p><p>We call on Amazon to resolve its dispute with Hachette without hurting authors and without blocking or otherwise delaying the sale of books to its customers.</p><p>We respectfully ask you, our loyal readers, to email Jeff Bezos, CEO and founder of Amazon, at jeff@amazon.com, and tell him what you think. He says he genuinely welcomes hearing from his customers and claims to read all emails from this account. We hope that, writers and readers together, we will be able to change his mind.</p><p>Sincerely,<br> [Alphabetical list of authors]</br></p></blockquote><p>Brilliant. Just brilliant. Between this and the pedophile-defending, one wonders what they would do if they decided to intentionally HARM their members. Techdirt <a href=\"https://www.techdirt.com/articles/20140703/13251627775/one-percent-authors-want-to-end-destructive-conflict-bring-order-to-galaxy.shtml\">explains the problems</a> with the letter.</p></div>",
  "content_text": "There has been a fair amount of talk concerning SFWA aligning itself against Amazon on behalf of the Big Five publishers. Here is the confirming evidence, straight from the horse’s mouth. And to think these geniuses actually re-elected Steven Gould. I was wondering what he could possibly do for an encore after last year’s performance; now we know.  As for the Preston letter that Gould mentions SFWA signing onto, here is the text:\nA letter to our readers:\nAmazon is involved in a commercial dispute with the book publisher Hachette, which owns Little Brown, Grand Central Publishing, and other familiar imprints. These sorts of disputes happen all the time between companies and they are usually resolved in a corporate back room.\nBut in this case, Amazon has done something unusual. It has directly targeted Hachette’s authors in an effort to force their publisher to agree to its terms.\nFor the past month, Amazon has been:\n–Boycotting Hachette authors, refusing to accept pre-orders on Hachette’s authors’ books, claiming they are “unavailable.”\n–Refusing to discount the prices of many of Hachette’s authors’ books.\n–Slowing the delivery of thousands of Hachette’s authors’ books to Amazon customers, indicating that delivery will take as long as several weeks on most titles.\nAs writers—some but not all published by Hachette—we feel strongly that no bookseller should block the sale of books or otherwise prevent or discourage customers from ordering or receiving the books they want. It is not right for Amazon to single out a group of authors, who are not involved in the dispute, for selective retaliation. Moreover, by inconveniencing and misleading its own customers with unfair pricing and delayed delivery, Amazon is contradicting its own written promise to be “Earth’s most customercentric company.”\nMany of us supported Amazon from when it was a struggling start-up. Our books started Amazon on the road to selling everything and becoming one of the world’s largest corporations. We have made Amazon many millions of dollars and over the years have contributed so much, free of charge, to the company by way of cooperation, joint promotions, reviews and blogs. This is no way to treat a business partner. Nor is it the right way to treat your friends. Without taking sides on the contractual dispute between Hachette and Amazon, we encourage Amazon in the strongest possible terms to stop harming the livelihood of the authors on whom it has built its business. None of us, neither readers nor authors, benefit when books are taken hostage. (We’re not alone in our plea: the opinion pages of both the New York Times and the Wall Street Journal, which rarely agree on anything, have roundly condemned Amazon’s corporate behavior.)\nWe call on Amazon to resolve its dispute with Hachette without hurting authors and without blocking or otherwise delaying the sale of books to its customers.\nWe respectfully ask you, our loyal readers, to email Jeff Bezos, CEO and founder of Amazon, at jeff@amazon.com, and tell him what you think. He says he genuinely welcomes hearing from his customers and claims to read all emails from this account. We hope that, writers and readers together, we will be able to change his mind.\nSincerely,\n[Alphabetical list of authors]\nBrilliant. Just brilliant. Between this and the pedophile-defending, one wonders what they would do if they decided to intentionally HARM their members. Techdirt\nexplains the problems\nwith the letter.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-07T19:00:00+00:00"
}