{
  "url": "https://voxday.net/2014/07/07/siding-with-invaders/",
  "scraped_at": "2025-12-16T12:19:56.926987",
  "title": "Siding with the invaders",
  "date_display": "July 7, 2014",
  "date_iso": "2014-07-07T13:00:00+00:00",
  "date_from_url": "2014-07-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The federal government <a href=\"http://www.breitbart.com/Breitbart-Texas/2014/07/06/SOURCE-FEDS-To-Bring-in-Riot-Squad-Against-Illegal-Immigration-Protesters\">has chosen its side</a>, and it is clearly not the side of the law-abiding American people:</p><blockquote class=\"tr_bq\"><p> As illegal immigrants continue to spill across the U.S.-Mexico border, federal authorities are attempting to relocate the migrants from South Texas to housing facilities in states across the nation. One such facility is located in Murrieta, California, where a large group of protesters recently blocked a bus full of migrants from arriving. The protesters remain there, adamant that illegal immigrants don’t get dumped in their town.</p><p>But soon the concerned citizens may be forced to step down–Breitbart Texas has learned that federal agents plan to arrive in Murrieta on Monday with riot gear to ensure that another busload makes it to the housing facility.</p><p>Jeremy Oliver, a resident of Temecula, California–a town that neighbors Murrieta–told Breitbart Texas that local police officers warned the protesters that “it’s going to get ugly.”</p><p>Oliver said, “The feds are pissed that they haven’t been able to use this facility. Officers out there warned people that federal agents will be in Murrieta on Monday–they are going to get the next bus through no matter what. Riot gear and shields will be used to push the crowd back.”</p><p>John Henry, a Murrieta resident since 1991, was told the same thing by local officers.</p><p>“We’re being told that federal Marshals or ICE will be here in the next few days and that they are bringing riot gear,” Henry said. “They’re apparently going to be blocking off the street with concrete blockades so that no vehicles can get through. The River County Sheriff’s Department showed up last night and brought a huge watch tower that shoots up into the air 35 feet.”</p></blockquote><p>It will be interesting how determined the Feds will be to protect the continued invasion of the southern border if the protesters show up armed and in similar numbers as they did at the Bundy Ranch earlier this year.</p><p>Seriously, if the Germans simply hadn’t armed its soldiers, how many of those defending the current invasion of the USA would have defended Operation Barbarossa? And it would appear that a big apology is owed to those Germans who peacefully immigrated into the Sudentenland, as that migration was considerably less violent than the ongoing annexation of the American southwest.</p><p>UPDATE: And it looks to get interesting: <i>A group that identifies itself as a coalition of “Patriots” has put out a call for people to go to the Texas-Mexico border and help with a citizen militia operation called “Secure our Border – Laredo.” A spokeswoman for the group, Denice Freeman, said the operation is a call for civilian militia members — both armed and unarmed — to voluntarily guard private property in the Laredo area and other Texas locations where owners feel threatened by “drug cartels and from gangs, particularly the MS-13 gangs,” a Salvadoran-based gang that is considered among the most dangerous in this country by law enforcement.</i></p></div>",
  "content_text": "The federal government\nhas chosen its side\n, and it is clearly not the side of the law-abiding American people:\nAs illegal immigrants continue to spill across the U.S.-Mexico border, federal authorities are attempting to relocate the migrants from South Texas to housing facilities in states across the nation. One such facility is located in Murrieta, California, where a large group of protesters recently blocked a bus full of migrants from arriving. The protesters remain there, adamant that illegal immigrants don’t get dumped in their town.\nBut soon the concerned citizens may be forced to step down–Breitbart Texas has learned that federal agents plan to arrive in Murrieta on Monday with riot gear to ensure that another busload makes it to the housing facility.\nJeremy Oliver, a resident of Temecula, California–a town that neighbors Murrieta–told Breitbart Texas that local police officers warned the protesters that “it’s going to get ugly.”\nOliver said, “The feds are pissed that they haven’t been able to use this facility. Officers out there warned people that federal agents will be in Murrieta on Monday–they are going to get the next bus through no matter what. Riot gear and shields will be used to push the crowd back.”\nJohn Henry, a Murrieta resident since 1991, was told the same thing by local officers.\n“We’re being told that federal Marshals or ICE will be here in the next few days and that they are bringing riot gear,” Henry said. “They’re apparently going to be blocking off the street with concrete blockades so that no vehicles can get through. The River County Sheriff’s Department showed up last night and brought a huge watch tower that shoots up into the air 35 feet.”\nIt will be interesting how determined the Feds will be to protect the continued invasion of the southern border if the protesters show up armed and in similar numbers as they did at the Bundy Ranch earlier this year.\nSeriously, if the Germans simply hadn’t armed its soldiers, how many of those defending the current invasion of the USA would have defended Operation Barbarossa? And it would appear that a big apology is owed to those Germans who peacefully immigrated into the Sudentenland, as that migration was considerably less violent than the ongoing annexation of the American southwest.\nUPDATE: And it looks to get interesting:\nA group that identifies itself as a coalition of “Patriots” has put out a call for people to go to the Texas-Mexico border and help with a citizen militia operation called “Secure our Border – Laredo.” A spokeswoman for the group, Denice Freeman, said the operation is a call for civilian militia members — both armed and unarmed — to voluntarily guard private property in the Laredo area and other Texas locations where owners feel threatened by “drug cartels and from gangs, particularly the MS-13 gangs,” a Salvadoran-based gang that is considered among the most dangerous in this country by law enforcement.",
  "tags": [
    "immigration",
    "Invasion"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-07T12:00:00+00:00"
}