{
  "url": "https://voxday.net/2014/07/24/smells-like-lusitanian-spiri/",
  "scraped_at": "2025-12-16T12:21:50.533766",
  "title": "Smells like Lusitanian spirit",
  "date_display": "July 24, 2014",
  "date_iso": "2014-07-24T17:00:00+00:00",
  "date_from_url": "2014-07-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The more hysterical the charges we see directed at Putin, and the more strident the demands, the more I suspect that the Russian leader ha<a href=\"http://globaleconomicanalysis.blogspot.com/2014/07/reuters-debunked-khodakovsky-denies.html\">d nothing to do with the downed Malaysian airliner. Mish has been increasingly dubious about the proposed scenario</a> as well:</p><blockquote class=\"tr_bq\"><p> As I suspected would happen, the exclusive Reuters interview in which “Commander Alexander Khodakovsky acknowledges rebel fighters had BUK missiles” has been challenged.</p><p>In my analysis of the Reuters article (see Ukraine Rebel Commander Admits Having BUK Missiles; Damning Contradictions?),  I point out considerable discrepancies in what Reuters author Anton Zverev wrote and actual quotes Reuters presented.</p><p>The discrepancies were so big I stated “It appears to me Reuters may have stretched this interview quite a bit.”</p><p>Thus I am not surprised to discover Khodakovsky challenged huge aspects of that interview, in terms of things he stated, did not state, and even timing of events….</p><p>Khodakovsky neither admitted nor denied the rebels had Buks. Once again, here is the damning contradiction as I presented earlier.</p><p>  <i>  “Khodakovsky said his unit had never possessed BUKs, but they may have been used by rebels from other units.”</i></p><p>    Now look back at the opening Reuters lead-in: “Alexander Khodakovsky, commander of the Vostok Battalion, acknowledged … the rebels did possess the BUK missile system and said it could have been sent back subsequently to remove proof of its presence.”</p><p>    Here is the major contradiction: “What resources our partners have, we cannot be entirely certain. Was there (a BUK)? Wasn’t there? If there was proof that there was, then there can be no question.”</p></blockquote><p>Zerohedge is reporting that the US State Department has not been able to find <a href=\"http://www.zerohedge.com/news/2014-07-22/us-state-department-confident-mh17-mistakenly-downed-separatists-finds-no-direct-lin\">any signs of Russian involvement</a>. And the Russians themselves are <a href=\"http://www.zerohedge.com/news/2014-07-21/russia-says-has-photos-ukraine-deploying-buk-missiles-east-rader-proof-warplanes-mh1\">pointing out some awkward facts</a> that may be indicative of Ukrainian responsibility for shooting down the passenger plane.</p><p>Remember, many, if not most, wars involve some level of deception, false flags, and deceitful finger-pointing. So it’s always wise to reserve judgment in such matters as long as possible. And it’s also worth pointing out that <a href=\"http://www.cbc.ca/news/world/ukraine-crisis-pm-arseniy-yatsenyuk-resigns-amid-government-collapse-1.2716885\">the Ukrainian puppet government just collapsed</a> and the US-installed prime minister has resigned:</p><blockquote class=\"tr_bq\"><p> Ukrainian Prime Minister Arseniy Yatsenyuk has announced his resignation following turmoil in government. Yatsenyuk made the announcement from the dais of the parliament after two parties said they would pull out of the governing coalition. “I am announcing my resignation [in connection] with the collapse of the coalition,” Yatsenyuk said.</p></blockquote><p>This is not the action of a nation prepared to fight a war with Russia.</p></div>",
  "content_text": "The more hysterical the charges we see directed at Putin, and the more strident the demands, the more I suspect that the Russian leader ha\nd nothing to do with the downed Malaysian airliner. Mish has been increasingly dubious about the proposed scenario\nas well:\nAs I suspected would happen, the exclusive Reuters interview in which “Commander Alexander Khodakovsky acknowledges rebel fighters had BUK missiles” has been challenged.\nIn my analysis of the Reuters article (see Ukraine Rebel Commander Admits Having BUK Missiles; Damning Contradictions?),  I point out considerable discrepancies in what Reuters author Anton Zverev wrote and actual quotes Reuters presented.\nThe discrepancies were so big I stated “It appears to me Reuters may have stretched this interview quite a bit.”\nThus I am not surprised to discover Khodakovsky challenged huge aspects of that interview, in terms of things he stated, did not state, and even timing of events….\nKhodakovsky neither admitted nor denied the rebels had Buks. Once again, here is the damning contradiction as I presented earlier.\n“Khodakovsky said his unit had never possessed BUKs, but they may have been used by rebels from other units.”\nNow look back at the opening Reuters lead-in: “Alexander Khodakovsky, commander of the Vostok Battalion, acknowledged … the rebels did possess the BUK missile system and said it could have been sent back subsequently to remove proof of its presence.”\nHere is the major contradiction: “What resources our partners have, we cannot be entirely certain. Was there (a BUK)? Wasn’t there? If there was proof that there was, then there can be no question.”\nZerohedge is reporting that the US State Department has not been able to find\nany signs of Russian involvement\n. And the Russians themselves are\npointing out some awkward facts\nthat may be indicative of Ukrainian responsibility for shooting down the passenger plane.\nRemember, many, if not most, wars involve some level of deception, false flags, and deceitful finger-pointing. So it’s always wise to reserve judgment in such matters as long as possible. And it’s also worth pointing out that\nthe Ukrainian puppet government just collapsed\nand the US-installed prime minister has resigned:\nUkrainian Prime Minister Arseniy Yatsenyuk has announced his resignation following turmoil in government. Yatsenyuk made the announcement from the dais of the parliament after two parties said they would pull out of the governing coalition. “I am announcing my resignation [in connection] with the collapse of the coalition,” Yatsenyuk said.\nThis is not the action of a nation prepared to fight a war with Russia.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-24T16:00:00+00:00"
}