{
  "url": "https://voxday.net/2014/07/05/the-exposures-continue/",
  "scraped_at": "2025-12-16T12:19:42.313408",
  "title": "The exposures continue",
  "date_display": "July 5, 2014",
  "date_iso": "2014-07-05T09:28:00+00:00",
  "date_from_url": "2014-07-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears <a href=\"http://www.telegraph.co.uk/news/uknews/crime/10947561/More-than-10-politicians-on-list-held-by-police-investigating-Westminster-paedophile-ring.html\">the British Parliament</a> may contain almost as many pedophiles and pedophile defenders as SFWA:</p><blockquote class=\"tr_bq\"><p> More than 10 current and former politicians are on a list of alleged child abusers held by police investigating claims of a Westminster paedophile ring. MPs or peers from all three main political parties are on the list, which includes former ministers and household names. Several, including Cyril Smith and Sir Peter Morrison, are no longer alive, but others are still active in Parliament.</p><p>The existence of the list was disclosed by Peter McKelvie, the whistleblower whose claims prompted Operation Fernbridge, the Scotland Yard investigation into allegations of a paedophile network with links to Downing Street. Mr McKelvie, a retired child protection team manager who has spent more than 20 years compiling evidence of alleged abuse by authority figures, said he believed there was enough evidence to arrest at least one senior politician….</p><p>Mr McKelvie, who helped bring the notorious paedophile Peter Righton to<br> justice in 1992 when he worked in Hereford and Worcester child protection<br> team, said: “I believe there are sufficient grounds to carry out a formal<br> investigation into allegations of up to 20 MPs and Lords over the last three<br> to four decades, some still alive and some dead. The list is there.”</br></br></br></br></p><p>In a letter to his local MP Sir Tony Baldry last month, Mr McKelvie suggested<br> that a further 20 MPs and Lords were implicated in the “cover-up” of abuse<br> of children.</br></br></p></blockquote><p>The Guardian has already done one story on Marion Zimmer Bradley. One hopes the newspaper will continue investigating her defenders and enablers, and then look into Ed Kramer, Samuel Delany, and the connections between Walter Breen, L. Ron Hubbard and <a href=\"http://www.rigorousintuition.ca/board2/viewtopic.php?t=24105&amp;p=307836\">a science-related gifted kids program</a>.</p><blockquote class=\"tr_bq\"><p> The strange link between physics and ESP came to the forefront in the<br> character of Jack Sarfatti, whom we already introduced. Sarfatti was, in<br> 1952, part of an after-school group of gifted children, being tutored<br> by Walter Breen of the Sandia Corporation, an organisation famous for<br> atomic weapons research and development. Breen was helped by others from<br> Sandia to lecture to these children. In 1952, Sarfatti received a<br> phone-call from outer space – quite literally, he felt. It seemed to<br> predestine him to become a leading physicist, interested in time and<br> space, other dimensions, etc.</br></br></br></br></br></br></br></br></p><p>Sarfatti reiterated that the enigmatic phone calls he received occurred in the summer of 1953. “I met Walter Breen soon after that via Robert Bashlow who recruited me and Johnny Glogower. Also Robert Solovay (briefly). Breen was working for Professor William Sheldon at Columbia Psychiatry Department funded by Eugene McDermott, a World War II Intelligence leader, co-founder of Texas Instruments and University of Texas at Dallas – and part of the Charles Lindburgh, Arthur Young ‘Round Table’ group. Saul-Paul Sirag says that L. Ron Hubbard was part of that scene along with Puharich. </p></blockquote><p>What this suggests is that the science fiction freakshow of sexual deviants may not necessarily be just three or four bad actors, each operating more or less on their own. It is well known that pedophiles tend to run in loosely affiliated packs, and the fact that there have been at least three confirmed pedophiles, Breen, Bradley, and Kramer, and one serious red flag, Delany, active in the relatively small science fiction community, indicates that there could be as many as ten times that number involved, as is apparently the case in Westminster.</p><p>And keep this description in mind when you read plaudits about the wonderfully warm “Chip” Delany, who has provided considerably more cause for suspicion than the recently convicted Rolf Harris <a href=\"http://www.dailymail.co.uk/debate/article-2681286/PLATELLS-PEOPLE-My-old-friend-Rolf-groomed-too.html\">ever did</a>.</p><blockquote class=\"tr_bq\"><p> To people throughout the world, myself included, he was the beloved uncle: warm, colourful, comforting. Lovely touchy-feely Rolf had this ability to make you feel as though you were the most important person in the world…. Experts in pathological sex offenders say the really clever ones spend only one per cent of their time grooming their actual victims — but 99 per cent of their time grooming the people around them. Often working as teachers or priests or entertainers, they are expert at persuading people they are trustworthy — tirelessly giving to charities, visiting the sick, cheering up the masses — to the extent that no one would believe a bad word against them.</p></blockquote><p>Everyone knows that I am not a fan of SFWA. I think it is an outdated organization that has outlived its purpose and thereby enmeshed itself in left-wing ideology in a misguided attempt to remain relevant to writers. But my feelings and motivations have absolutely nothing to do with what other people have done over the last 50 years. Pattern recognition has always been a strength of mine (see: Financial crisis of 2008), and SFWA’s increasingly bizarre non-reaction to revelations of FIVE DECADES of child abuse and the public defense of child abusers by its members is tripping my radar. It may be simple incompetence, or it may suggests that there is more to the situation than the isolated acts of a few bad apples.</p></div>",
  "content_text": "It appears\nthe British Parliament\nmay contain almost as many pedophiles and pedophile defenders as SFWA:\nMore than 10 current and former politicians are on a list of alleged child abusers held by police investigating claims of a Westminster paedophile ring. MPs or peers from all three main political parties are on the list, which includes former ministers and household names. Several, including Cyril Smith and Sir Peter Morrison, are no longer alive, but others are still active in Parliament.\nThe existence of the list was disclosed by Peter McKelvie, the whistleblower whose claims prompted Operation Fernbridge, the Scotland Yard investigation into allegations of a paedophile network with links to Downing Street. Mr McKelvie, a retired child protection team manager who has spent more than 20 years compiling evidence of alleged abuse by authority figures, said he believed there was enough evidence to arrest at least one senior politician….\nMr McKelvie, who helped bring the notorious paedophile Peter Righton to\njustice in 1992 when he worked in Hereford and Worcester child protection\nteam, said: “I believe there are sufficient grounds to carry out a formal\ninvestigation into allegations of up to 20 MPs and Lords over the last three\nto four decades, some still alive and some dead. The list is there.”\nIn a letter to his local MP Sir Tony Baldry last month, Mr McKelvie suggested\nthat a further 20 MPs and Lords were implicated in the “cover-up” of abuse\nof children.\nThe Guardian has already done one story on Marion Zimmer Bradley. One hopes the newspaper will continue investigating her defenders and enablers, and then look into Ed Kramer, Samuel Delany, and the connections between Walter Breen, L. Ron Hubbard and\na science-related gifted kids program\n.\nThe strange link between physics and ESP came to the forefront in the\ncharacter of Jack Sarfatti, whom we already introduced. Sarfatti was, in\n1952, part of an after-school group of gifted children, being tutored\nby Walter Breen of the Sandia Corporation, an organisation famous for\natomic weapons research and development. Breen was helped by others from\nSandia to lecture to these children. In 1952, Sarfatti received a\nphone-call from outer space – quite literally, he felt. It seemed to\npredestine him to become a leading physicist, interested in time and\nspace, other dimensions, etc.\nSarfatti reiterated that the enigmatic phone calls he received occurred in the summer of 1953. “I met Walter Breen soon after that via Robert Bashlow who recruited me and Johnny Glogower. Also Robert Solovay (briefly). Breen was working for Professor William Sheldon at Columbia Psychiatry Department funded by Eugene McDermott, a World War II Intelligence leader, co-founder of Texas Instruments and University of Texas at Dallas – and part of the Charles Lindburgh, Arthur Young ‘Round Table’ group. Saul-Paul Sirag says that L. Ron Hubbard was part of that scene along with Puharich.\nWhat this suggests is that the science fiction freakshow of sexual deviants may not necessarily be just three or four bad actors, each operating more or less on their own. It is well known that pedophiles tend to run in loosely affiliated packs, and the fact that there have been at least three confirmed pedophiles, Breen, Bradley, and Kramer, and one serious red flag, Delany, active in the relatively small science fiction community, indicates that there could be as many as ten times that number involved, as is apparently the case in Westminster.\nAnd keep this description in mind when you read plaudits about the wonderfully warm “Chip” Delany, who has provided considerably more cause for suspicion than the recently convicted Rolf Harris\never did\n.\nTo people throughout the world, myself included, he was the beloved uncle: warm, colourful, comforting. Lovely touchy-feely Rolf had this ability to make you feel as though you were the most important person in the world…. Experts in pathological sex offenders say the really clever ones spend only one per cent of their time grooming their actual victims — but 99 per cent of their time grooming the people around them. Often working as teachers or priests or entertainers, they are expert at persuading people they are trustworthy — tirelessly giving to charities, visiting the sick, cheering up the masses — to the extent that no one would believe a bad word against them.\nEveryone knows that I am not a fan of SFWA. I think it is an outdated organization that has outlived its purpose and thereby enmeshed itself in left-wing ideology in a misguided attempt to remain relevant to writers. But my feelings and motivations have absolutely nothing to do with what other people have done over the last 50 years. Pattern recognition has always been a strength of mine (see: Financial crisis of 2008), and SFWA’s increasingly bizarre non-reaction to revelations of FIVE DECADES of child abuse and the public defense of child abusers by its members is tripping my radar. It may be simple incompetence, or it may suggests that there is more to the situation than the isolated acts of a few bad apples.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-05T08:28:00+00:00"
}