{
  "url": "https://voxday.net/2014/07/04/the-rape-of-beauty/",
  "scraped_at": "2025-12-16T12:19:39.027173",
  "title": "The rape of beauty",
  "date_display": "July 4, 2014",
  "date_iso": "2014-07-04T15:00:00+00:00",
  "date_from_url": "2014-07-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John C. Wright explains the reason behind <a href=\"http://www.everyjoe.com/2014/07/03/politics/robbed-of-beauty-by-the-left/\">the Left’s determined destruction of beauty</a> of every kind:</p><blockquote class=\"tr_bq\"><p> The most precious, profound and important of the great ideas which the Left has raped from us is beauty. I need spend no time on the proposition that life without beauty is a nightmare: those who have seen true beauty – sublime beauty, if even for a moment – have nothing to which they can liken it except the ecstasies of mystics and the transports of saints. Beauty consoles the sorrowing; beauty brings joy and deepens understanding; beauty is like food and wine, and men who live surrounded by ugliness become shriveled and starved in their souls.</p><p>Why, if beauty is so important, is there no discussion of it? The victory of the Left in this area has been so sudden, so remarkable, and so complete, that the discussion of beauty has lapsed into an utter and a desolate silence. Have you, dear reader, read anything discussing beauty, putting forth a coherent theory of beauty, or even extolling beauty’s central importance of the human soul in a year? In 10 years? Ever? This may be the only essay you will read on the topic this decade, and yet the topic is one of paramount importance. It is a matter of life and death not for the body but for the spirit.</p><p>There is no discussion of it because by convincing the public that beauty is in the eye of the beholder, the Left has placed it beyond the realm of discussion. According to the Left, beauty is a matter of taste, and arbitrary taste at that. There is no discussion of taste because to give reasons to prefer tasteful to tasteless things is elitist, nasty, uncouth and inappropriate. To have taste implies that some cultures produce more works of art and better than others, and this raises the uncomfortable possibility that love of beauty is Eurocentric, or even racist. To admire beauty has become a hate crime.</p><p>If beauty is in the eye of the beholder, then there is no difference between fine art as opposed to mere decoration, no difference between Leonardo da Vinci’s Mona Lisa and wallpaper. Obviously there is a difference: we decorate an otherwise useful tool to make it more pleasing to look at or handle, like painting details on a car or putting embroidered images on fabric. Popular art is meant for entertainment; it is meant to please the eye and wile away the time. But an episode of I Love Lucy is not made for the same purpose as Tchaikovsky’s Swan Lake. Art is not meant to be useful. When you hold a baby in your arms and look at him, merely look at the wonder and miracle of new life, you don’t do that because the baby is useful.</p><p>If beauty is in the eye of the beholder, then there is no such thing as training the taste. One can sit down and watch well done popular entertainment – for example, a Mickey Mouse cartoon – with pleasure and enjoyment, and no study is needed to prepare you to appreciate and understand it. But to sit down and read Milton’s Paradise Lost for pleasure, one needs a passing familiarity with classical and Biblical figures to which he alludes, and one’s pleasure is increased if one is familiar with the epic models, the Virgil and Homer, on whose themes Milton plays out so creative and striking a variation.</p><p>If beauty is in the eye of the beholder, then anything, anything at all, can be declared to be beautiful merely by the artist. Like God creating light from nothing by the power of His word, the artist creates beauty not by any genius nor craftsmanship, but by his naked fiat. It is beautiful not because he actually created anything, but only because he says so….</p><p>The strongest argument against the atheism so beloved of the Left is<br> not an argument that can be put in words, for it is the argument of<br> beauty. If you see a sunset clothed in scarlet like a king descending to<br> his empurpled pyre, or wonder at the gleaming thunder of a waterfall,<br> if you find yourself fascinated by the soft intricacy of a crimson rose<br> or behold the cold virgin majesty of the morning star, much less see and<br> enter a cathedral or a walled garden, or you hear Schiller’s “Ode to<br> Joy” by Beethoven or see the David of Michelangelo, or become immersed<br> into the song and splendor and Northern sorrow of Wagner’s “Ring” or<br> Tolkien’s <em>Lord of the Rings</em>, if indeed you see real beauty and for a moment you forget yourself, then you are drawn out of yourself into something larger.</br></br></br></br></br></br></br></br></br></p><p>In that timeless moment of sublime rapture, the heart knows even if<br> the head cannot put it into words that the dull and quotidian world of<br> betrayal, pain, disappointment and sorrow is not the only world there<br> is. Beauty points to a world beyond this world, a higher realm, a<br> country of joy where there is no death. Beauty points to the divine.</br></br></br></br></p></blockquote><p>The creative instinct is the urge to celebrate the divine. Which is why most forms of modern art, from performance narcissism to Pink SF/F is a perversion of the creative instinct, because they exist to celebrate ugliness and evil while attempting to degrade the very concepts of the Good, the Beautiful, and the True.</p></div>",
  "content_text": "John C. Wright explains the reason behind\nthe Left’s determined destruction of beauty\nof every kind:\nThe most precious, profound and important of the great ideas which the Left has raped from us is beauty. I need spend no time on the proposition that life without beauty is a nightmare: those who have seen true beauty – sublime beauty, if even for a moment – have nothing to which they can liken it except the ecstasies of mystics and the transports of saints. Beauty consoles the sorrowing; beauty brings joy and deepens understanding; beauty is like food and wine, and men who live surrounded by ugliness become shriveled and starved in their souls.\nWhy, if beauty is so important, is there no discussion of it? The victory of the Left in this area has been so sudden, so remarkable, and so complete, that the discussion of beauty has lapsed into an utter and a desolate silence. Have you, dear reader, read anything discussing beauty, putting forth a coherent theory of beauty, or even extolling beauty’s central importance of the human soul in a year? In 10 years? Ever? This may be the only essay you will read on the topic this decade, and yet the topic is one of paramount importance. It is a matter of life and death not for the body but for the spirit.\nThere is no discussion of it because by convincing the public that beauty is in the eye of the beholder, the Left has placed it beyond the realm of discussion. According to the Left, beauty is a matter of taste, and arbitrary taste at that. There is no discussion of taste because to give reasons to prefer tasteful to tasteless things is elitist, nasty, uncouth and inappropriate. To have taste implies that some cultures produce more works of art and better than others, and this raises the uncomfortable possibility that love of beauty is Eurocentric, or even racist. To admire beauty has become a hate crime.\nIf beauty is in the eye of the beholder, then there is no difference between fine art as opposed to mere decoration, no difference between Leonardo da Vinci’s Mona Lisa and wallpaper. Obviously there is a difference: we decorate an otherwise useful tool to make it more pleasing to look at or handle, like painting details on a car or putting embroidered images on fabric. Popular art is meant for entertainment; it is meant to please the eye and wile away the time. But an episode of I Love Lucy is not made for the same purpose as Tchaikovsky’s Swan Lake. Art is not meant to be useful. When you hold a baby in your arms and look at him, merely look at the wonder and miracle of new life, you don’t do that because the baby is useful.\nIf beauty is in the eye of the beholder, then there is no such thing as training the taste. One can sit down and watch well done popular entertainment – for example, a Mickey Mouse cartoon – with pleasure and enjoyment, and no study is needed to prepare you to appreciate and understand it. But to sit down and read Milton’s Paradise Lost for pleasure, one needs a passing familiarity with classical and Biblical figures to which he alludes, and one’s pleasure is increased if one is familiar with the epic models, the Virgil and Homer, on whose themes Milton plays out so creative and striking a variation.\nIf beauty is in the eye of the beholder, then anything, anything at all, can be declared to be beautiful merely by the artist. Like God creating light from nothing by the power of His word, the artist creates beauty not by any genius nor craftsmanship, but by his naked fiat. It is beautiful not because he actually created anything, but only because he says so….\nThe strongest argument against the atheism so beloved of the Left is\nnot an argument that can be put in words, for it is the argument of\nbeauty. If you see a sunset clothed in scarlet like a king descending to\nhis empurpled pyre, or wonder at the gleaming thunder of a waterfall,\nif you find yourself fascinated by the soft intricacy of a crimson rose\nor behold the cold virgin majesty of the morning star, much less see and\nenter a cathedral or a walled garden, or you hear Schiller’s “Ode to\nJoy” by Beethoven or see the David of Michelangelo, or become immersed\ninto the song and splendor and Northern sorrow of Wagner’s “Ring” or\nTolkien’s\nLord of the Rings\n, if indeed you see real beauty and for a moment you forget yourself, then you are drawn out of yourself into something larger.\nIn that timeless moment of sublime rapture, the heart knows even if\nthe head cannot put it into words that the dull and quotidian world of\nbetrayal, pain, disappointment and sorrow is not the only world there\nis. Beauty points to a world beyond this world, a higher realm, a\ncountry of joy where there is no death. Beauty points to the divine.\nThe creative instinct is the urge to celebrate the divine. Which is why most forms of modern art, from performance narcissism to Pink SF/F is a perversion of the creative instinct, because they exist to celebrate ugliness and evil while attempting to degrade the very concepts of the Good, the Beautiful, and the True.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-04T14:00:00+00:00"
}