{
  "url": "https://voxday.net/2014/07/11/the-slippery-slope-is-not-logica/",
  "scraped_at": "2025-12-16T12:20:22.191852",
  "title": "The slippery slope is not a logical fallacy",
  "date_display": "July 11, 2014",
  "date_iso": "2014-07-11T10:19:00+00:00",
  "date_from_url": "2014-07-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>To the contrary, the slippery slope is observably <a href=\"http://www.telegraph.co.uk/news/worldnews/australiaandthepacific/australia/10958728/Australian-judge-says-incest-may-no-longer-be-a-taboo.html\">a predictive model with occasional success</a>, particularly with regards to sexual matters:</p><blockquote class=\"tr_bq\"><p> Judge Garry Neilson, from the district court in the state of New South Wales, likened incest to homosexuality, which was once regarded as criminal and “unnatural” but is now widely accepted.</p><p>He said incest was now only a crime because it may lead to abnormalities in offspring but this rationale was increasingly irrelevant because of the availability of contraception and abortion.</p><p>“A jury might find nothing untoward in the advance of a brother towards his sister once she had sexually matured, had sexual relationships with other men and was now ‘available’, not having [a] sexual partner,” the judge said.</p><p>“If this was the 1950s and you had a jury of 12 men there, which is what you’d invariably have, they would say it’s unnatural for a man to be interested in another man or a man being interested in a boy. Those things have gone….</p><p>“The complainant has been sexually awoken, shall we say, by having two relationships with men and she had become ‘free’ when the second relationship broke down. The only thing that might change that is the fact that they were a brother and sister but we’ve come a long way from the 1950s – when the position of the English Common Law was that sex outside marriage was not lawful.”</p></blockquote><p>This should make it clear to everyone who is not a sexual deviant that the position of the English Common Law was correct, and that all of the various deviancies that have been legalized and normalized and declared no longer indicative of psychological sickness since the 1950s should promptly be returned to their former status.</p><p>There is no middle ground. What devotees of one particular immorality or another believe is a reasonable stopping point – here, and no further –  is nothing more than a waystation on the road to total depravity of the worst imaginable sort.</p><p>We libertarians were wrong. Societal liberty simply cannot be maximized through sexual anarchy any more than it can be maximized though unrestricted immigration, unrestricted government, or unrestricted voting. In retrospect, this should always have been obvious: if everything goes, then literally <i>everything will go</i>. This is no longer a hypothetical objection on the part of traditional conservatives, it is an undeniable reality. It is human nature to push at the boundaries; there will always be those who cross the line. Therefore, the line needs to be set firmly along boundaries that are undeniably eucivic and proven by centuries of tradition to be sustainable in the long term.</p><p>There will be those who disingenuously insist that the clock cannot be turned back, that humanity is doomed to an endless future of sodomy, incest, rape, necrophilia, and bestiality. This is provably false; the current period of sexual anarchy in the West is hardly the first in human history and it is very short by historical standards. And this particular clock most certainly will be turned back, one way or another, because everything from birth rates to the transmission rates of sexually transmitted diseases indicate that the current state of near-sexual anarchy has already reached the point of unsustainability.</p><p>Technology can never trump Creator-imposed morality any more than science can surmount the physical laws of Nature. It may appear to do so, for a short time, but that is nothing more than an illusion based on incomplete understanding.</p></div>",
  "content_text": "To the contrary, the slippery slope is observably\na predictive model with occasional success\n, particularly with regards to sexual matters:\nJudge Garry Neilson, from the district court in the state of New South Wales, likened incest to homosexuality, which was once regarded as criminal and “unnatural” but is now widely accepted.\nHe said incest was now only a crime because it may lead to abnormalities in offspring but this rationale was increasingly irrelevant because of the availability of contraception and abortion.\n“A jury might find nothing untoward in the advance of a brother towards his sister once she had sexually matured, had sexual relationships with other men and was now ‘available’, not having [a] sexual partner,” the judge said.\n“If this was the 1950s and you had a jury of 12 men there, which is what you’d invariably have, they would say it’s unnatural for a man to be interested in another man or a man being interested in a boy. Those things have gone….\n“The complainant has been sexually awoken, shall we say, by having two relationships with men and she had become ‘free’ when the second relationship broke down. The only thing that might change that is the fact that they were a brother and sister but we’ve come a long way from the 1950s – when the position of the English Common Law was that sex outside marriage was not lawful.”\nThis should make it clear to everyone who is not a sexual deviant that the position of the English Common Law was correct, and that all of the various deviancies that have been legalized and normalized and declared no longer indicative of psychological sickness since the 1950s should promptly be returned to their former status.\nThere is no middle ground. What devotees of one particular immorality or another believe is a reasonable stopping point – here, and no further –  is nothing more than a waystation on the road to total depravity of the worst imaginable sort.\nWe libertarians were wrong. Societal liberty simply cannot be maximized through sexual anarchy any more than it can be maximized though unrestricted immigration, unrestricted government, or unrestricted voting. In retrospect, this should always have been obvious: if everything goes, then literally\neverything will go\n. This is no longer a hypothetical objection on the part of traditional conservatives, it is an undeniable reality. It is human nature to push at the boundaries; there will always be those who cross the line. Therefore, the line needs to be set firmly along boundaries that are undeniably eucivic and proven by centuries of tradition to be sustainable in the long term.\nThere will be those who disingenuously insist that the clock cannot be turned back, that humanity is doomed to an endless future of sodomy, incest, rape, necrophilia, and bestiality. This is provably false; the current period of sexual anarchy in the West is hardly the first in human history and it is very short by historical standards. And this particular clock most certainly will be turned back, one way or another, because everything from birth rates to the transmission rates of sexually transmitted diseases indicate that the current state of near-sexual anarchy has already reached the point of unsustainability.\nTechnology can never trump Creator-imposed morality any more than science can surmount the physical laws of Nature. It may appear to do so, for a short time, but that is nothing more than an illusion based on incomplete understanding.",
  "tags": [
    "religion",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-11T09:19:00+00:00"
}