{
  "url": "https://voxday.net/2014/07/20/the-fall-of-richard-feynman/",
  "scraped_at": "2025-12-16T12:21:21.037011",
  "title": "The fall of Richard Feynman",
  "date_display": "July 20, 2014",
  "date_iso": "2014-07-20T13:00:00+00:00",
  "date_from_url": "2014-07-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s predictable, and yet fascinating, to watch the Left methodically devour itself over time. Richard Feynman was a genuine hero of scientistry, the Joker of the Manhattan Project, revered by scientists and and rationalists and science fetishists for decades, a witty man whom atheists too bright to be impressed with the likes of Dawkins were often prone to quote. And now, with the latest purge, in this case by <i>Scientific American</i>, it is apparent that the winner of the 1965 Nobel Prize in Physics has now <a href=\"http://www.washingtonpost.com/lifestyle/style/whats-going-on-at-scientific-american-deleted-posts-sexism-claims-a-fired-writer/2014/07/16/46526b52-0d20-11e4-8c9a-923ecc0c7d23_story.html?tid=hpModule_1f58c93a-8a7a-11e2-98d9-3012c1cd8d1e\">been read out of the Left’s pantheon</a> for his historical crimes against feminism.</p><blockquote class=\"tr_bq\"><p> Throughout its 169-year history, Scientific American has been an august and sober chronicler of the advance of human knowledge, from chemistry to physics to anthropology.</p><p>Lately, however, things have become kind of a mess.</p><p>A series of blog posts on the magazine’s Web site over the past few months has unleashed waves of criticism and claims that the publication was promoting racism, sexism and “genetic determinism.”</p><p>Late last week, the publication took down the latest alleged outrage, a post about the late physicist Richard Feynman and his notorious womanizing. Then it republished the post with an editor’s note explaining that it was restoring the article “in the interest of openness and transparency.”</p><p>And it fired the blogger who wrote it.</p><p>The trouble started in April when a guest blogger, a doctoral student named Chris Martin, wrote about Lawrence H. Summers’ assertions when he was president of Harvard University about the paucity of women in some scientific fields. While acknowledging that discrimination played a role in holding back women, Martin also concluded, “the latest research suggests that discrimination has a weaker impact than people might think, and that innate sex differences explain quite a lot.”</p><p>The post drew a sharp pushback, particularly on social media, from readers who questioned Martin’s scientific and cultural bona fides. “This slovenly article above is so full of outdated information it is painful,” wrote one commenter.</p><p>The second land mine was a post in May by Ashutosh Jogalekar, which favorably reviewed a controversial book by Nicholas Wade, “A Troublesome Inheritance: Genes, Race and Human History.” Jogalekar praised the book, saying it confirms the need to “recognize a strong genetic component to [social and cognitive] differences” among racial groups.</p><p>This time, some social-media commenters accused Scientific American of promoting questionable racial theories. In early July, the reaction led the publication’s blog editor, Curtis Brainard, to post a note that read in part, “While we believe that [the racism and sexism] charges are excessive, we share readers’ concerns. Although we expect our bloggers to cover controversial topics from time to time, we also recognize that sensitive issues require extra care, and that did not happen here.”</p><p>The last straw was Jogalekar’s post on Friday about Feynman, the Nobel-winning father of quantum electrodynamics. Commenting on recent biographies of Feynman, Jogalekar noted the physicist’s “casual sexism,” including his affairs with two married women, his humiliation of a female student and his delight in documenting his strategies for picking up women in bars. But while expressing disappointment in Feynman’s behavior, Jogalekar essentially dismissed it as a byproduct of the “male-dominated American society in the giddy postwar years.”</p><p>Within a day of the column’s appearance, Scientific American pulled it from its site, with another note from Brainard: “The text of this post has been removed because it did not meet Scientific American’s quality standards.”</p><p>One other thing: Jogalekar was fired.</p></blockquote><p>It would appear there is NO PLACE for Nobel-winning physicists in science anymore. There is certainly NO PLACE in the increasingly inappropriately named <i>Scientific American</i> for anyone who takes science more seriously than left-wing feminist dogma.</p></div>",
  "content_text": "It’s predictable, and yet fascinating, to watch the Left methodically devour itself over time. Richard Feynman was a genuine hero of scientistry, the Joker of the Manhattan Project, revered by scientists and and rationalists and science fetishists for decades, a witty man whom atheists too bright to be impressed with the likes of Dawkins were often prone to quote. And now, with the latest purge, in this case by\nScientific American\n, it is apparent that the winner of the 1965 Nobel Prize in Physics has now\nbeen read out of the Left’s pantheon\nfor his historical crimes against feminism.\nThroughout its 169-year history, Scientific American has been an august and sober chronicler of the advance of human knowledge, from chemistry to physics to anthropology.\nLately, however, things have become kind of a mess.\nA series of blog posts on the magazine’s Web site over the past few months has unleashed waves of criticism and claims that the publication was promoting racism, sexism and “genetic determinism.”\nLate last week, the publication took down the latest alleged outrage, a post about the late physicist Richard Feynman and his notorious womanizing. Then it republished the post with an editor’s note explaining that it was restoring the article “in the interest of openness and transparency.”\nAnd it fired the blogger who wrote it.\nThe trouble started in April when a guest blogger, a doctoral student named Chris Martin, wrote about Lawrence H. Summers’ assertions when he was president of Harvard University about the paucity of women in some scientific fields. While acknowledging that discrimination played a role in holding back women, Martin also concluded, “the latest research suggests that discrimination has a weaker impact than people might think, and that innate sex differences explain quite a lot.”\nThe post drew a sharp pushback, particularly on social media, from readers who questioned Martin’s scientific and cultural bona fides. “This slovenly article above is so full of outdated information it is painful,” wrote one commenter.\nThe second land mine was a post in May by Ashutosh Jogalekar, which favorably reviewed a controversial book by Nicholas Wade, “A Troublesome Inheritance: Genes, Race and Human History.” Jogalekar praised the book, saying it confirms the need to “recognize a strong genetic component to [social and cognitive] differences” among racial groups.\nThis time, some social-media commenters accused Scientific American of promoting questionable racial theories. In early July, the reaction led the publication’s blog editor, Curtis Brainard, to post a note that read in part, “While we believe that [the racism and sexism] charges are excessive, we share readers’ concerns. Although we expect our bloggers to cover controversial topics from time to time, we also recognize that sensitive issues require extra care, and that did not happen here.”\nThe last straw was Jogalekar’s post on Friday about Feynman, the Nobel-winning father of quantum electrodynamics. Commenting on recent biographies of Feynman, Jogalekar noted the physicist’s “casual sexism,” including his affairs with two married women, his humiliation of a female student and his delight in documenting his strategies for picking up women in bars. But while expressing disappointment in Feynman’s behavior, Jogalekar essentially dismissed it as a byproduct of the “male-dominated American society in the giddy postwar years.”\nWithin a day of the column’s appearance, Scientific American pulled it from its site, with another note from Brainard: “The text of this post has been removed because it did not meet Scientific American’s quality standards.”\nOne other thing: Jogalekar was fired.\nIt would appear there is NO PLACE for Nobel-winning physicists in science anymore. There is certainly NO PLACE in the increasingly inappropriately named\nScientific American\nfor anyone who takes science more seriously than left-wing feminist dogma.",
  "tags": [
    "rabbitology",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-20T12:00:00+00:00"
}