{
  "url": "https://voxday.net/2014/07/28/there-is-no-place-for-anti/",
  "scraped_at": "2025-12-16T12:22:20.038248",
  "title": "There is NO PLACE for anti-palestinianism….",
  "date_display": "July 28, 2014",
  "date_iso": "2014-07-28T20:48:00+00:00",
  "date_from_url": "2014-07-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s been interesting to read up on 4th Gen War theory while watching the events take place surrounding the war in Gaza. And I have to say, it appears to be an almost textbook example of Israel winning the conventional Clausewitzian levels while Hamas is winning at the more important moral level. For those unfamiliar with this military theory, this doesn’t say anything about which side has the right of it, only the moral perception of the two sides on the part of the neutral observers. For example, <a href=\"http://www.dailymail.co.uk/news/article-2708410/One-Direction-star-Zayn-Malik-bombarded-death-threats-outraged-Israelis-posting-FreePalestine-message-Twitter.html\">this sort of thing</a> works directly against the Israeli interest:</p><blockquote class=\"tr_bq\"><p> One Direction star Zayn Malik has been bombarded with death threats by outraged Israelis after posting a #FreePalestine message on Twitter. The 21-year-old, who was brought up a Muslim in Bradford, Yorkshire, shared the #FreePalestine hashtag earlier today to his 13million followers, who retweeted it 140,000 times. However, moments after the post appeared, Zayn began receiving messages telling him to ‘kill himself’ and one even read: ‘Let me kill you’.</p></blockquote><p>The young man has 13 million followers, about .00001 percent of whom actually know or care anything about Gaza. How are death threats against him going to fly in their barely sapient eyes when all he did, as far as they can see, was share a message of freedom? Meanwhile, some Jewish leaders are making the dreadful mistake of demanding that European governments censor their citizens and <a href=\"http://www.jpost.com/Jewish-World/Jewish-News/We-are-looking-at-the-beginnings-of-a-Holocaust-369165\">impose regulations upon them</a>, which would be an excellent way to ensure that those governments, already very unpopular due to the Euro crisis and the corruption of the EU, will be thrown out at the first opportunity:</p><blockquote class=\"tr_bq\"><p> “We are potentially looking at the beginning of another Holocaust now. These events [violent demonstrations and expressions of anti-Semitism] will only grow in scale across Europe,” he asserted. Addressing the legislators and representatives of a number of European governments, including those of Denmark, Holland and France, the oligarch and former head of the Russian Jewish Congress called for Jewish communities across the continent to “unite and consolidate.”</p><p>Sloutsker also called on all European governments to impose what he called “strict regulations” on the format and content of demonstrations in order to prevent further violence against Jews. Citing a recent proposal by Belgian Jewry to establish a position of Special European Commissioner to monitor and combat anti-Semitism and racism, Sloutsker said such measures would “help send a strong message that European leadership is united and committed to combating anti-Semitism, racism and xenophobia.”</p></blockquote><p>The Israelis have yet to learn that in a global media battle, they simply cannot expect to have it both ways. Everything eventually makes its way out. If you want to claim popular anti-semitism is beyond the pale, then you simply cannot engage in anti-palestinianism. And it is truly bizarre to see complaints about the European conflation of diaspora Jew and Israeli, even as other Jews openly conflate them.</p><blockquote class=\"tr_bq\"><p> The state will not allow one Jew to remain undefended, MK Yisrael Hasson chimed in, asserting that the fates of European and Israeli Jews are intertwined.</p><p>Jews is Belgium are being asked “why are you killing children in Gaza?” Rafael Werner, a representative of Belgium’s Jewish community recounted, asserting that there is little distinction being made between Jews and Israelis.</p></blockquote><p>So, are they intertwined or not? Considering that Martin van Creveld, one of the leading theoreticians of state vs non-state war, is an Israeli, I think both the Israelis and the diaspora Jews would do well to familiarize themselves with his books. From what I see from my very limited vantage point, based on basic 4GW principles, Netanyahu has made a common, but critical mistake in attempting to compromise between the De-Escalation model and the Hama model.</p><p>And to bring it full circle, I fully support the legality of both anti-semitism and anti-palestinianism. Die Gedanken sind frei. And keep in mind that once one embrace thought and speech policing, one reduces the question to a simple game of will to power.</p></div>",
  "content_text": "It’s been interesting to read up on 4th Gen War theory while watching the events take place surrounding the war in Gaza. And I have to say, it appears to be an almost textbook example of Israel winning the conventional Clausewitzian levels while Hamas is winning at the more important moral level. For those unfamiliar with this military theory, this doesn’t say anything about which side has the right of it, only the moral perception of the two sides on the part of the neutral observers. For example,\nthis sort of thing\nworks directly against the Israeli interest:\nOne Direction star Zayn Malik has been bombarded with death threats by outraged Israelis after posting a #FreePalestine message on Twitter. The 21-year-old, who was brought up a Muslim in Bradford, Yorkshire, shared the #FreePalestine hashtag earlier today to his 13million followers, who retweeted it 140,000 times. However, moments after the post appeared, Zayn began receiving messages telling him to ‘kill himself’ and one even read: ‘Let me kill you’.\nThe young man has 13 million followers, about .00001 percent of whom actually know or care anything about Gaza. How are death threats against him going to fly in their barely sapient eyes when all he did, as far as they can see, was share a message of freedom? Meanwhile, some Jewish leaders are making the dreadful mistake of demanding that European governments censor their citizens and\nimpose regulations upon them\n, which would be an excellent way to ensure that those governments, already very unpopular due to the Euro crisis and the corruption of the EU, will be thrown out at the first opportunity:\n“We are potentially looking at the beginning of another Holocaust now. These events [violent demonstrations and expressions of anti-Semitism] will only grow in scale across Europe,” he asserted. Addressing the legislators and representatives of a number of European governments, including those of Denmark, Holland and France, the oligarch and former head of the Russian Jewish Congress called for Jewish communities across the continent to “unite and consolidate.”\nSloutsker also called on all European governments to impose what he called “strict regulations” on the format and content of demonstrations in order to prevent further violence against Jews. Citing a recent proposal by Belgian Jewry to establish a position of Special European Commissioner to monitor and combat anti-Semitism and racism, Sloutsker said such measures would “help send a strong message that European leadership is united and committed to combating anti-Semitism, racism and xenophobia.”\nThe Israelis have yet to learn that in a global media battle, they simply cannot expect to have it both ways. Everything eventually makes its way out. If you want to claim popular anti-semitism is beyond the pale, then you simply cannot engage in anti-palestinianism. And it is truly bizarre to see complaints about the European conflation of diaspora Jew and Israeli, even as other Jews openly conflate them.\nThe state will not allow one Jew to remain undefended, MK Yisrael Hasson chimed in, asserting that the fates of European and Israeli Jews are intertwined.\nJews is Belgium are being asked “why are you killing children in Gaza?” Rafael Werner, a representative of Belgium’s Jewish community recounted, asserting that there is little distinction being made between Jews and Israelis.\nSo, are they intertwined or not? Considering that Martin van Creveld, one of the leading theoreticians of state vs non-state war, is an Israeli, I think both the Israelis and the diaspora Jews would do well to familiarize themselves with his books. From what I see from my very limited vantage point, based on basic 4GW principles, Netanyahu has made a common, but critical mistake in attempting to compromise between the De-Escalation model and the Hama model.\nAnd to bring it full circle, I fully support the legality of both anti-semitism and anti-palestinianism. Die Gedanken sind frei. And keep in mind that once one embrace thought and speech policing, one reduces the question to a simple game of will to power.",
  "tags": [
    "war",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-28T19:48:00+00:00"
}