{
  "url": "https://voxday.net/2014/07/09/thought-policing-isnt-good-business/",
  "scraped_at": "2025-12-16T12:20:13.043315",
  "title": "Thought policing isn’t good business",
  "date_display": "July 9, 2014",
  "date_iso": "2014-07-09T17:00:00+00:00",
  "date_from_url": "2014-07-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Anthony Cumia correctly identifies a violent savage as a savage and gets fired, because it is supposed to be bad for business to permit its employees any freedom of speech, even on their off-hours. Except the corporate cure appears to be <a href=\"http://www.thedailybeast.com/articles/2014/07/08/fans-rage-over-opie-minus-anthony.html\">considerably worse than the disease</a>:</p><blockquote class=\"tr_bq\"><p> Opie is devastated, Anthony is unrepentant, and their fans are livid and seeking revenge.</p><p>“Stop firing people for being themselves,” demanded one loyal listener of SiriusXM radio’s transgressive, occasionally tasteless Opie &amp; Anthony Show, after shock jock Anthony Cumia was summarily terminated for a series of tweets—first reported last Wednesday by Gawker—that SiriusXM described as “racially-charged,” “hate-filled,” and “abhorrent.”</p><p>“Fascist bloggers don’t get to tell me what I can listen to,” wrote another diehard O&amp;A fan, posting his comment on the web site for a petition to “Reinstate Anthony Cumia.”</p><p>“FUCK Sirius XM!” was a typical posting on “Boycott Sirius for Anthony Cumia’s Firing,” a Facebook page claiming 65,000 supporters, adding that “the army is growing.”</p><p>Even A-list comedian and frequent O&amp;A guest Colin Quinn weighed in, tweeting sympathetically at Cumia: “I disagree with what you say but I will defend to the death my right to stop u saying it (Voltaire if he worked for gawker).” Show regulars Jay Mohr and Penn Gillette also cheered for Cumia. </p><p>So goes Day Six of this strange radio morality play, combining elements of racial resentment and freedom of expression, that began the night of July 2, when Cumia claims he was snapping pictures in Times Square and a young African American woman objected to being photographed by punching him repeatedly in the face. An enraged Cumia vented obscenely on Twitter—the digital equivalent of white-on-black crime in retribution for an alleged physical assault.</p><p>Since then, rage and confusion have dominated the discussion, though not to the exclusion of some surprisingly thoughtful analysis from O&amp;A fans who say they are drawn to the show because it is unfiltered, honest, funny and devoid of political correctness.</p><p> “I follow him for his comedy, not for his opinions,” said Scott VanDusen, 30, who plans to cancel his SiriusXM subscription if Cumia is not reinstated by week’s end, and described himself as a Libertarian and the owner of software company in Wisconsin….</p><p>An additional planned boycott of the satellite and online radio<br> company’s advertising sponsors—which include such brands as McDonalds,<br> Geico, General Motors, ExxonMobil and American Express—is hardly good<br> news for SiriusXM’s stockholders, who have watched the share price on<br> NASDAQ drop nearly 2 percent since Cumia’s firing was announced on<br> Friday.</br></br></br></br></br></p></blockquote><p>Imagine that…. It would certainly be informative to see a comprehensive list of the various people that Opie and Anthony have insulted and disrespected over the years without Sirius taking any exception. Apparently protection must be provided at all times to shield the poor tender feelings of an innocent, childlike people who cannot be held responsible for their actions or be expected to survive the sort of direct criticism that is regularly meted out to adults.</p><p>The obvious and inherent racism of the self-appointed anti-racist thought police never ceases to amaze me. And they will never win, because people have eyes and because <i>die Gedanken sind immer frei.</i></p></div>",
  "content_text": "Anthony Cumia correctly identifies a violent savage as a savage and gets fired, because it is supposed to be bad for business to permit its employees any freedom of speech, even on their off-hours. Except the corporate cure appears to be\nconsiderably worse than the disease\n:\nOpie is devastated, Anthony is unrepentant, and their fans are livid and seeking revenge.\n“Stop firing people for being themselves,” demanded one loyal listener of SiriusXM radio’s transgressive, occasionally tasteless Opie & Anthony Show, after shock jock Anthony Cumia was summarily terminated for a series of tweets—first reported last Wednesday by Gawker—that SiriusXM described as “racially-charged,” “hate-filled,” and “abhorrent.”\n“Fascist bloggers don’t get to tell me what I can listen to,” wrote another diehard O&A fan, posting his comment on the web site for a petition to “Reinstate Anthony Cumia.”\n“FUCK Sirius XM!” was a typical posting on “Boycott Sirius for Anthony Cumia’s Firing,” a Facebook page claiming 65,000 supporters, adding that “the army is growing.”\nEven A-list comedian and frequent O&A guest Colin Quinn weighed in, tweeting sympathetically at Cumia: “I disagree with what you say but I will defend to the death my right to stop u saying it (Voltaire if he worked for gawker).” Show regulars Jay Mohr and Penn Gillette also cheered for Cumia.\nSo goes Day Six of this strange radio morality play, combining elements of racial resentment and freedom of expression, that began the night of July 2, when Cumia claims he was snapping pictures in Times Square and a young African American woman objected to being photographed by punching him repeatedly in the face. An enraged Cumia vented obscenely on Twitter—the digital equivalent of white-on-black crime in retribution for an alleged physical assault.\nSince then, rage and confusion have dominated the discussion, though not to the exclusion of some surprisingly thoughtful analysis from O&A fans who say they are drawn to the show because it is unfiltered, honest, funny and devoid of political correctness.\n“I follow him for his comedy, not for his opinions,” said Scott VanDusen, 30, who plans to cancel his SiriusXM subscription if Cumia is not reinstated by week’s end, and described himself as a Libertarian and the owner of software company in Wisconsin….\nAn additional planned boycott of the satellite and online radio\ncompany’s advertising sponsors—which include such brands as McDonalds,\nGeico, General Motors, ExxonMobil and American Express—is hardly good\nnews for SiriusXM’s stockholders, who have watched the share price on\nNASDAQ drop nearly 2 percent since Cumia’s firing was announced on\nFriday.\nImagine that…. It would certainly be informative to see a comprehensive list of the various people that Opie and Anthony have insulted and disrespected over the years without Sirius taking any exception. Apparently protection must be provided at all times to shield the poor tender feelings of an innocent, childlike people who cannot be held responsible for their actions or be expected to survive the sort of direct criticism that is regularly meted out to adults.\nThe obvious and inherent racism of the self-appointed anti-racist thought police never ceases to amaze me. And they will never win, because people have eyes and because\ndie Gedanken sind immer frei.",
  "tags": [
    "media",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-09T16:00:00+00:00"
}