{
  "url": "https://voxday.net/2014/07/08/two-more-weeks/",
  "scraped_at": "2025-12-16T12:20:05.718957",
  "title": "Two more weeks",
  "date_display": "July 8, 2014",
  "date_iso": "2014-07-08T17:00:00+00:00",
  "date_from_url": "2014-07-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.castaliahouse.com/downloads/city-beyond-time/\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/07/city_900-1.jpg\" width=\"200\"/></a></div><p>As I mentioned when we announced the book, a substantial portion of the first month’s sales revenues will be donated to <a href=\"http://www.stillbrave.org/\">Stillbrave, the children’s cancer charity</a>. According to my calculations, after the first two weeks $658.84 has been raised for Stillbrave to date. There are still more than two weeks to go, so if you have any interest at all in Mr. Wright’s superlative excursion into the philosophy and morality of time travel, I would encourage you to buy it now, either from <a href=\"http://www.castaliahouse.com/downloads/city-beyond-time/\">the Castalia House store</a> (EPUB format) or from <a href=\"http://www.amazon.com/gp/product/B00L6WI3PU\">Amazon </a>(Kindle format).</p><p>If you have not read the reviews, of which there are 12 averaging a 4.8 rating, perhaps a selection of quotes from a two or three of them will encourage you to give the book a shot.</p><p><b>Review 1: </b><i>I urgently and without hesitation, recommend <b>City Beyond Time</b>. Atlantis, Hi-Brazil, Tartessos. Or if you don’t read the classics; Krypton, Gallifrey and Valyria.</i></p><p>The forever doomed, forever lost and forever beautiful true city and true home. The seat of all grace, all wisdom and all power, destined from it’s creation for destruction by it’s own hubris.</p><p>Welcome to Metachonoplis.</p><p>Writers don’t dream this big anymore. They don’t dare, they would be laughed out of the business. Much easier to take the path most commonly taken. Much easier to drop the F-bomb eighteen times before the end of page six and call it art. Just describe every vulgar experience you’ve ever had and call it refined. Just pretend your words can become a muse for the readers mind and call it good…enough.</p><p>John C. Wright is clearly and obviously a rather drastic anachronism. If H. Rider Haggard, Ernest Hemingway, Raymond Chandler and Roger Zelazny had got together in a bar and decided just for kicks to have a genetic recombinant uterine replication vanity project together the result would be John C. Wright.</p><p><b>Review 2:</b> <i>I’ve noted a theme in my so far sadly limited (but soon to be<br> comprehensive!) readings of John C. Wright that he speaks in a voice sui<br> generis among modern literary pretenders — that is, all those who are<br> not in fact John C. Wright — portraying what for lack of better<br> nomenclature we could term “inspirational dystopias”, shining the light<br> of human fulfillment from amidst what in lesser hands would be<br> overwhelming nihilism and/or despair.</br></br></br></br></br></br></i></p><p>This collection of stories<br> raises that artistry to masterly finesse; it reads like Moorcock’s<br> Dancers At The End of Time as plotted by a collaboration of Neal<br> Stephenson and C.S. Lewis, with a subtle sprinkling of the absurdist wit<br> Messr. Wright displays abundantly in his online presence.</br></br></br></br></p><p><i>Unconditionally recommended! </i></p><p><b>Review 3:  </b><i>John Wright does it again. This is the second book of collected stories I’ve read from him, the other being <b>Awake in the Night Lands</b>, and cannot recommend him highly enough.</i></p><p>I’ve read, and watched, my fair share of time travel stories and Wright leaves them all in the dust, even Mull’s Grip of the Shadow Plague subplot which I had just read to my kids. His vision is far more expansive, far more human and far more frightening than what I’ve encountered elsewhere. Not only does he pursue the logical and moral ramifications of what unfettered time travel would entail and what that would do to those that master it, he also presents two sides, a heaven and a hell, the costs of each, and lets the reader decide which one he would seek.</p><p>For what, one wonders, can you possibly be waiting? Especially if you consider yourself even a casual reader of science fiction.</p></div>",
  "content_text": "As I mentioned when we announced the book, a substantial portion of the first month’s sales revenues will be donated to\nStillbrave, the children’s cancer charity\n. According to my calculations, after the first two weeks $658.84 has been raised for Stillbrave to date. There are still more than two weeks to go, so if you have any interest at all in Mr. Wright’s superlative excursion into the philosophy and morality of time travel, I would encourage you to buy it now, either from\nthe Castalia House store\n(EPUB format) or from\nAmazon\n(Kindle format).\nIf you have not read the reviews, of which there are 12 averaging a 4.8 rating, perhaps a selection of quotes from a two or three of them will encourage you to give the book a shot.\nReview 1:\nI urgently and without hesitation, recommend\nCity Beyond Time\n. Atlantis, Hi-Brazil, Tartessos. Or if you don’t read the classics; Krypton, Gallifrey and Valyria.\nThe forever doomed, forever lost and forever beautiful true city and true home. The seat of all grace, all wisdom and all power, destined from it’s creation for destruction by it’s own hubris.\nWelcome to Metachonoplis.\nWriters don’t dream this big anymore. They don’t dare, they would be laughed out of the business. Much easier to take the path most commonly taken. Much easier to drop the F-bomb eighteen times before the end of page six and call it art. Just describe every vulgar experience you’ve ever had and call it refined. Just pretend your words can become a muse for the readers mind and call it good…enough.\nJohn C. Wright is clearly and obviously a rather drastic anachronism. If H. Rider Haggard, Ernest Hemingway, Raymond Chandler and Roger Zelazny had got together in a bar and decided just for kicks to have a genetic recombinant uterine replication vanity project together the result would be John C. Wright.\nReview 2:\nI’ve noted a theme in my so far sadly limited (but soon to be\ncomprehensive!) readings of John C. Wright that he speaks in a voice sui\ngeneris among modern literary pretenders — that is, all those who are\nnot in fact John C. Wright — portraying what for lack of better\nnomenclature we could term “inspirational dystopias”, shining the light\nof human fulfillment from amidst what in lesser hands would be\noverwhelming nihilism and/or despair.\nThis collection of stories\nraises that artistry to masterly finesse; it reads like Moorcock’s\nDancers At The End of Time as plotted by a collaboration of Neal\nStephenson and C.S. Lewis, with a subtle sprinkling of the absurdist wit\nMessr. Wright displays abundantly in his online presence.\nUnconditionally recommended!\nReview 3:\nJohn Wright does it again. This is the second book of collected stories I’ve read from him, the other being\nAwake in the Night Lands\n, and cannot recommend him highly enough.\nI’ve read, and watched, my fair share of time travel stories and Wright leaves them all in the dust, even Mull’s Grip of the Shadow Plague subplot which I had just read to my kids. His vision is far more expansive, far more human and far more frightening than what I’ve encountered elsewhere. Not only does he pursue the logical and moral ramifications of what unfettered time travel would entail and what that would do to those that master it, he also presents two sides, a heaven and a hell, the costs of each, and lets the reader decide which one he would seek.\nFor what, one wonders, can you possibly be waiting? Especially if you consider yourself even a casual reader of science fiction.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-08T16:00:00+00:00"
}