{
  "url": "https://voxday.net/2014/07/14/when-beauty-isnt-enoug/",
  "scraped_at": "2025-12-16T12:20:38.356630",
  "title": "When beauty isn’t enough",
  "date_display": "July 14, 2014",
  "date_iso": "2014-07-14T08:45:00+00:00",
  "date_from_url": "2014-07-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://i.telegraph.co.uk/multimedia/archive/02971/Axelle-Despiegelae_2971898b.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"199\" src=\"http://i.telegraph.co.uk/multimedia/archive/02971/Axelle-Despiegelae_2971898b.jpg\" width=\"320\"/></a></div><p><i>When 17-year-old Axelle Despiegelaere went to support her native Belgium at<br> the World Cup she wasn’t expecting it to lead to a job offer. But a<br> long-distance photo of her went viral on Twitter, where she was labelled the “most<br> beautiful” fan in Brazil, and L’Oreal came knocking with a modelling<br> contract. The competition is not even over and the company has already shot a video<br> where Axelle is doused in its products, uploaded it to YouTube and received<br> over two million hits. Such is the speed at which marketing now works.</br></br></br></br></br></br></i><i> But the flame that burns twice as bright burns half as long: <a href=\"http://www.telegraph.co.uk/technology/facebook/10961406/Beware-Facebook-can-hurt-your-reputation-and-wallet.html\">Axelle’s   fledgling modelling career is already finished</a>, after images of her posing<br> next to dead animals on the African savannah with a rifle and a smile as big<br> as she wore at the football. </br></br></i></p><div class=\"thirdPar\"> <br> Apparently it’s not enough to be young and beautiful. To be employed as a professional model, a girl must also possess politically correct opinions concerning big-game hunting. We’ve seen this in the publishing world. We’ve seen this in technology. Now we’re seeing it in modeling, of all places.<p>Remember this the next time you’re congratulating yourself on your open-mindedness, and patting yourself on the back for the way you hired that [insert repulsive left-wing opinion or identity here] individual despite the fact that you completely disagree with him. Because not only will you not be the beneficiary of the same treatment if your positions are reversed, you are helping to ensure that your side is going to lose.</p><p>Wars do not require two sides. You can lose a war even more easily by refusing to fight in the first place. One hopes that some rifle manufacturer or hunting magazine will be smart enough to see the opportunity in hiring a very pretty young spokesmodel who knows how to put lead on target.</p><p><i>A <a href=\"http://www.telegraph.co.uk/technology/facebook/7103900/Facebook-profile-could-damage-job-prospects.html\"><b>2010<br> report from Microsoft</br></b></a> said that social media checks were already as<br> important in the job selection process as a CV or interview. Some 70 per<br> cent of HR managers at the top 100 companies in the UK, US, Germany and<br> France said that they had rejected candidates because of their online<br> behaviour.  </br></br></br></br></i></p><p>Most people, when reading this, think that this means pictures of guys doing keg stands or girls posting naked selfies. Such things are included, of course, but so are one’s political identifications, such as expressing support for a political candidate during the electoral season. Don’t think that they aren’t.</p></br></div></div>",
  "content_text": "When 17-year-old Axelle Despiegelaere went to support her native Belgium at\nthe World Cup she wasn’t expecting it to lead to a job offer. But a\nlong-distance photo of her went viral on Twitter, where she was labelled the “most\nbeautiful” fan in Brazil, and L’Oreal came knocking with a modelling\ncontract. The competition is not even over and the company has already shot a video\nwhere Axelle is doused in its products, uploaded it to YouTube and received\nover two million hits. Such is the speed at which marketing now works.\nBut the flame that burns twice as bright burns half as long:\nAxelle’s   fledgling modelling career is already finished\n, after images of her posing\nnext to dead animals on the African savannah with a rifle and a smile as big\nas she wore at the football.\nApparently it’s not enough to be young and beautiful. To be employed as a professional model, a girl must also possess politically correct opinions concerning big-game hunting. We’ve seen this in the publishing world. We’ve seen this in technology. Now we’re seeing it in modeling, of all places.\nRemember this the next time you’re congratulating yourself on your open-mindedness, and patting yourself on the back for the way you hired that [insert repulsive left-wing opinion or identity here] individual despite the fact that you completely disagree with him. Because not only will you not be the beneficiary of the same treatment if your positions are reversed, you are helping to ensure that your side is going to lose.\nWars do not require two sides. You can lose a war even more easily by refusing to fight in the first place. One hopes that some rifle manufacturer or hunting magazine will be smart enough to see the opportunity in hiring a very pretty young spokesmodel who knows how to put lead on target.\nA\n2010\nreport from Microsoft\nsaid that social media checks were already as\nimportant in the job selection process as a CV or interview. Some 70 per\ncent of HR managers at the top 100 companies in the UK, US, Germany and\nFrance said that they had rejected candidates because of their online\nbehaviour.\nMost people, when reading this, think that this means pictures of guys doing keg stands or girls posting naked selfies. Such things are included, of course, but so are one’s political identifications, such as expressing support for a political candidate during the electoral season. Don’t think that they aren’t.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-14T07:45:00+00:00"
}