{
  "url": "https://voxday.net/2014/07/29/why-home-buyers-arent-buying/",
  "scraped_at": "2025-12-16T12:22:23.736731",
  "title": "Why home buyers aren’t buying",
  "date_display": "July 29, 2014",
  "date_iso": "2014-07-29T13:00:00+00:00",
  "date_from_url": "2014-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Back in June 2009, I introduced a concept I called <a href=\"http://www.milobookclub.com/2009/06/18/limits-of-demand/\">the Limits of Demand</a>, which pointed out that the Austrian Business Cycle did not revolve around a shift in capital vs consumer goods, but rather the “finite limit to the maximum consumable quantity of every consumer good available”. I stated: “Once the artificially enhanced demand limits are reached, or even worse,<br> consumers cannot afford to service their debt on the goods they<br> previously purchased, the boom will come to a hard and fast end.” As Neil Cavuto’s <a href=\"http://www.foxbusiness.com/2014/07/25/cavuto-mortgage-rates-tumbling-so-why-arent-buying/\">lamentation for the housing market</a> suggests, we appear to have finally reached those demand limits, as the six-year stagnation in L1 also indicates:</br></br></p><blockquote class=\"tr_bq\"><p> You can now nab a 30-year fixed mortgage for under 4%. That’s the second week in a row, by the way, that rates have been so low. As of this writing, the numbers tick slightly, but the range remains remarkably low – 3.96% to 4.08%. In either extreme, extremely weird, and stunning when you consider we are supposedly in the latter stage of a recovery.</p><p>Usually at this point in an economic turnaround, things are rocking, and interest rates are jumping. But we all know the economy isn’t rocking. And as a result, interest rates are not jumping. What’s weird is those rates are dropping, which usually presages something bad happening.</p><p>Then again, this hasn’t been your father’s recovery, has it? Even with absurdly-low interest rates for what’s been years now, it’s hard to make the case they’ve triggered any kind of housing boom. Sales of new single-family homes fell 4.9% through the first six months of the year. They were down 8.1% in June. So let’s just say the trend is not the housing industry’s friend.</p><p>Economists and real estate experts offer a variety of reasons for this mortgage malaise. Some argue it’s still pretty tough to qualify for a loan, and bankers aren’t making it any easier, demanding more upfront money from borrowers to avoid any of the problems they encountered post-meltdown.</p><p>But it’s been more than six years now, and some very sharp numbers crunchers are getting worried. Even bankers who are lending tell me they aren’t seeing a lot of customers lining up. “Caution is the word,” said one. “They just seem very tentative, even skeptical.”</p></blockquote><p>Cavuto says that history “suggests one of two things eventually happens during such periods: either the prices come down or the demand picks up.” This chart I made to explain the Limits of Demand shows that prices will not only come down, but come down further than the experts are presently anticipating.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2014/07/DemandLimits.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"288\" src=\"http://www.milobookclub.com/wp-content/uploads/2014/07/DemandLimits.jpg\" width=\"320\"/></a></div><p>The credit-driven demand for housing has pushed up prices along the S curve, far beyond where the homebuyers’ natural demand (based upon what they could afford without the credit expansion) intersected it. When the credit contraction begins, unless the supply somehow contracts, the demand for housing can be expected to fall from the point where the Dcredit curve intersects the S curve to the point on the original D curve. Where that is in practical terms, I do not know, but a rough guess would be a two-thirds collapse in home prices. And it is this collapse that will spur the economy-wide deflation that I have been predicting for the last six years.</p><p>Remember, while we haven’t seen deflation, we also haven’t seen the predicted inflation, let alone hyperinflation, either. That is because the Fed’s desperate attempts to hold up the housing market to protect the banks has led to a six-year period of credit disinflation and the subsequent six-year “mortgage malaise”.</p><p>That is the core problem with credit money. Central banks can print more paper, but they cannot print more credit-worthy borrowers. And with the median net wealth of Americans down by one-third in the last decade, few Americans can afford to borrow the money required to pay the credit-inflated housing prices even at these historically low interest rates. This should be patently obvious, especially in light of how “35.1 percent of people with credit records <a href=\"http://hosted.ap.org/dynamic/stories/U/US_DEBT_STUDY?SITE=AP&amp;SECTION=HOME&amp;TEMPLATE=DEFAULT&amp;CTIME=2014-07-29-00-12-33\">had been reported to collections for debt</a> that averaged $5,178.”</p><p>When even cheery, optimistic cheerleaders such as Cavuto start using phrases like “we are supposedly in the latter stage of a recovery”, it should be readily apparent that there has been no recovery at all. As I have been pointing out for more than five years now, this is an economic contraction at least one order of magnitude bigger than the Great Depression. Focusing on GDP and CPI and U3 statistics is rather like trying to measure the precise size of the waves on the beach as a tsunami looms offshore.</p></div>",
  "content_text": "Back in June 2009, I introduced a concept I called\nthe Limits of Demand\n, which pointed out that the Austrian Business Cycle did not revolve around a shift in capital vs consumer goods, but rather the “finite limit to the maximum consumable quantity of every consumer good available”. I stated: “Once the artificially enhanced demand limits are reached, or even worse,\nconsumers cannot afford to service their debt on the goods they\npreviously purchased, the boom will come to a hard and fast end.” As Neil Cavuto’s\nlamentation for the housing market\nsuggests, we appear to have finally reached those demand limits, as the six-year stagnation in L1 also indicates:\nYou can now nab a 30-year fixed mortgage for under 4%. That’s the second week in a row, by the way, that rates have been so low. As of this writing, the numbers tick slightly, but the range remains remarkably low – 3.96% to 4.08%. In either extreme, extremely weird, and stunning when you consider we are supposedly in the latter stage of a recovery.\nUsually at this point in an economic turnaround, things are rocking, and interest rates are jumping. But we all know the economy isn’t rocking. And as a result, interest rates are not jumping. What’s weird is those rates are dropping, which usually presages something bad happening.\nThen again, this hasn’t been your father’s recovery, has it? Even with absurdly-low interest rates for what’s been years now, it’s hard to make the case they’ve triggered any kind of housing boom. Sales of new single-family homes fell 4.9% through the first six months of the year. They were down 8.1% in June. So let’s just say the trend is not the housing industry’s friend.\nEconomists and real estate experts offer a variety of reasons for this mortgage malaise. Some argue it’s still pretty tough to qualify for a loan, and bankers aren’t making it any easier, demanding more upfront money from borrowers to avoid any of the problems they encountered post-meltdown.\nBut it’s been more than six years now, and some very sharp numbers crunchers are getting worried. Even bankers who are lending tell me they aren’t seeing a lot of customers lining up. “Caution is the word,” said one. “They just seem very tentative, even skeptical.”\nCavuto says that history “suggests one of two things eventually happens during such periods: either the prices come down or the demand picks up.” This chart I made to explain the Limits of Demand shows that prices will not only come down, but come down further than the experts are presently anticipating.\nThe credit-driven demand for housing has pushed up prices along the S curve, far beyond where the homebuyers’ natural demand (based upon what they could afford without the credit expansion) intersected it. When the credit contraction begins, unless the supply somehow contracts, the demand for housing can be expected to fall from the point where the Dcredit curve intersects the S curve to the point on the original D curve. Where that is in practical terms, I do not know, but a rough guess would be a two-thirds collapse in home prices. And it is this collapse that will spur the economy-wide deflation that I have been predicting for the last six years.\nRemember, while we haven’t seen deflation, we also haven’t seen the predicted inflation, let alone hyperinflation, either. That is because the Fed’s desperate attempts to hold up the housing market to protect the banks has led to a six-year period of credit disinflation and the subsequent six-year “mortgage malaise”.\nThat is the core problem with credit money. Central banks can print more paper, but they cannot print more credit-worthy borrowers. And with the median net wealth of Americans down by one-third in the last decade, few Americans can afford to borrow the money required to pay the credit-inflated housing prices even at these historically low interest rates. This should be patently obvious, especially in light of how “35.1 percent of people with credit records\nhad been reported to collections for debt\nthat averaged $5,178.”\nWhen even cheery, optimistic cheerleaders such as Cavuto start using phrases like “we are supposedly in the latter stage of a recovery”, it should be readily apparent that there has been no recovery at all. As I have been pointing out for more than five years now, this is an economic contraction at least one order of magnitude bigger than the Great Depression. Focusing on GDP and CPI and U3 statistics is rather like trying to measure the precise size of the waves on the beach as a tsunami looms offshore.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-29T12:00:00+00:00"
}