{
  "url": "https://voxday.net/2014/07/15/will-shetterly-interviews-sfwa/",
  "scraped_at": "2025-12-16T12:20:50.094620",
  "title": "Will Shetterly interviews an SFWA Grandmaster",
  "date_display": "July 15, 2014",
  "date_iso": "2014-07-15T16:54:00+00:00",
  "date_from_url": "2014-07-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In light of the recent revelations concerning science fiction figures Marion Zimmer Bradley, Walter Breen, and Ed Kramer, Will Shetterly thought it advisable <a href=\"http://shetterly.blogspot.ch/2014/07/a-conversation-with-samuel-r-delany.html\">to interview Sam Delany</a>, who in addition to being SFWA’s most recently named Grandmaster, is also known to have publicly endorsed the North American Man-Boy Love Association. Be aware before you read it that it deals in fairly graphic detail with sexual deviancy and child abuse:</p><blockquote class=\"tr_bq\"><p> After Marion Zimmer Bradley’s daughter spoke out about child abuse by Bradley and her husband, Walter Breen, a member of NAMBLA, writers as different as Vox Day and Liz Williams brought up Samuel R. Delany’s comment about NAMBLA twenty years ago:</p><p>“I read the NAMBLA [Bulletin] fairly regularly and I think it is one of the most intelligent discussions of sexuality I’ve ever found. I think before you start judging what NAMBLA is about, expose yourself to it and see what it is really about. What the issues they are really talking about, and deal with what’s really there rather than this demonized notion of guys running about trying to screw little boys. I would have been so much happier as an adolescent if NAMBLA had been around when I was 9, 10, 11, 12, 13.” — Samuel R. Delany, Queer Desires Forum, New York City, June 25, 1994. </p><p>Then I began to<br> feel bad for not asking Chip Delany about this. In the 1960s, he was one<br> of a small number of writers who made me believe fantasy and science<br> fiction could be both great fun and great art. When he was the guest of<br> honor at the Fourth Street Fantasy Convention, he was charming and<br> learned and pretty much everything anyone could want in a guest of<br> honor. I can’t say I know him, but I can say I like him. I believe we should be able to talk about things which are taboo—what<br> reveals our nature is not what we say, but what we do. This is<br> especially true of storytellers, who regularly write about things they<br> would never do. </br></br></br></br></br></br></br></br></br></p><p>So I wrote Chip, which<br> began a discussion that moved between Facebook messages and email. He<br> has agreed to share it. What follows is a version that I lightly edited<br> for clarity.</br></br></br></p></blockquote><p> As some readers may recall, I have observed that in addition to Delany’s homosexuality, his endorsement of NAMBLA, his fiction is literally overflowing with deviancy, sex crimes, and the abuse of children. I view all three of those factors as red flags of varying degrees of seriousness indicating a <i>potential </i>predilection for pedophilia. I would encourage you to consider some of Delany’s following statements that I have highlighted in that light:</p><ul><li>I never met or knew Walter Breen (and only two or three times met Marion Zimmer Bradley, in the last two or three years of her life)…. I got the impression from others who knew him that the gossip about Breen, especially in the first years I knew Paul (well before Stonewall), whether Breen was gay or straight, was a tempest in teapot. Currently it sounds like it’s not. But, again, I never knew Breen or saw him in my life.</li><li>I have no idea what NAMBLA has been doing for the last twenty years.</li><li>I had my first sexual experience with an adult when I was six, with a local Harlem building superintendent. And nothing hurtful happened at all. It would have been cruel and unusual punishment to incarcerate him for it…. The building superintendent, however, abused me not at all. To say that he did, is just incorrect.</li><li>I said and still maintain that 20 years ago [NAMBLA] was an intelligent and highly thoughtful institution.</li><li>Since I spent eighteen years of my life as a child, and nine years of that life as a pretty sexually active gay child, my complaint against the current attitudes is that they work mightily to silence the voices of children first and secondarily ignore what adults have to say who have been through these situations. One size fits all is never the way to handle any situation with a human dimension.</li><li>The current attitude toward pedophilia is a tragic attempt to drive nature out with a pitchfork, and at this point it is a self-reinforcing tragedy, encouraging the worst and punishing the best by making no distinctions at all</li><li>The consent of a seven-, eight-, or nine-year old is not the same thing as the consent of a seventeen- or eighteen-year old. And the “consent” of a three, four, and five year old means much less—especially if it’s negative. But it must count for something, otherwise you are just saying the child is not human and has no feelings or agency whatsoever—which, in itself, is abusive and counter-intuitive. And, I would maintain, immoral when another possibility presents itself.</li><li>I have heard fifty or sixty such tales from gay men of this nature. It had none of the affect of abuse. If anything, it had more the feel of an impromptu educational session.</li></ul><p>On the basis of Mr. Delany’s remarkably frank answers, I would maintain that he was physically, emotionally, and sexually abused as a child to the point that he is intrinsically unable to tell black from white or right from wrong with regards to sexual matters. However, it is to be regretted that Mr. Shetterly did not ask Mr. Delany anything about the elephant in the room, namely, what he, himself, did. We know Mr. Delany was sexually abused by an older man at the age of six. We know he is familiar with fifty or sixty similarly abused homosexual men. What we still do not know, and what Mr. Shetterly rather delicately avoided asking, is if Mr. Delany ever put his principles into action, and, as an adult, engaged in sexual relations with children under the age of legal consent.</p><p>Since most sexual abusers were abused themselves as children, (a fourth red flag, if you’re still counting), at this point I doubt it would very much surprise anyone if he had. And lest you doubt that SFWA’s support for Mr. Delany, let me remind you what SFWA President Steven Gould and former SFWA President John Scalzi had to say about Samuel R. Delany last December.</p><ol><li>“One of the perks of being SFWA president is the option of<br> selecting the Science Fiction and Fantasy Writers of America’s next<br> Damon Knight Memorial Grand Master. One of the tragedies is we only get<br> to select one a year. That said, from the grains of sand in my pocket, I<br> am delighted to pull this star. Samuel R. Delany is one of science fiction’s most influential<br> authors, critics, and teachers and it is my great honor to announce his<br> selection. When discussing him as this year’s choice with the board,<br> past-presidents, and members, the most frequent response I received was,<br> “He’s not already?” Well he is now.” (S. Gould)</br></br></br></br></br></br></br></br></li><li>“The Science Fiction and Fantasy Writers of America has named Samuel R.<br> Delany its newest Grand Master…. I will say this: This is an award<br> both well chosen and well deserved.” (J. Scalzi) </br></br></li></ol><p>It would certainly be interesting to know if Mr. Gould and Mr. Scalzi still unreservedly support Mr. Delany.</p><ol></ol><ol></ol></div>",
  "content_text": "In light of the recent revelations concerning science fiction figures Marion Zimmer Bradley, Walter Breen, and Ed Kramer, Will Shetterly thought it advisable\nto interview Sam Delany\n, who in addition to being SFWA’s most recently named Grandmaster, is also known to have publicly endorsed the North American Man-Boy Love Association. Be aware before you read it that it deals in fairly graphic detail with sexual deviancy and child abuse:\nAfter Marion Zimmer Bradley’s daughter spoke out about child abuse by Bradley and her husband, Walter Breen, a member of NAMBLA, writers as different as Vox Day and Liz Williams brought up Samuel R. Delany’s comment about NAMBLA twenty years ago:\n“I read the NAMBLA [Bulletin] fairly regularly and I think it is one of the most intelligent discussions of sexuality I’ve ever found. I think before you start judging what NAMBLA is about, expose yourself to it and see what it is really about. What the issues they are really talking about, and deal with what’s really there rather than this demonized notion of guys running about trying to screw little boys. I would have been so much happier as an adolescent if NAMBLA had been around when I was 9, 10, 11, 12, 13.” — Samuel R. Delany, Queer Desires Forum, New York City, June 25, 1994.\nThen I began to\nfeel bad for not asking Chip Delany about this. In the 1960s, he was one\nof a small number of writers who made me believe fantasy and science\nfiction could be both great fun and great art. When he was the guest of\nhonor at the Fourth Street Fantasy Convention, he was charming and\nlearned and pretty much everything anyone could want in a guest of\nhonor. I can’t say I know him, but I can say I like him. I believe we should be able to talk about things which are taboo—what\nreveals our nature is not what we say, but what we do. This is\nespecially true of storytellers, who regularly write about things they\nwould never do.\nSo I wrote Chip, which\nbegan a discussion that moved between Facebook messages and email. He\nhas agreed to share it. What follows is a version that I lightly edited\nfor clarity.\nAs some readers may recall, I have observed that in addition to Delany’s homosexuality, his endorsement of NAMBLA, his fiction is literally overflowing with deviancy, sex crimes, and the abuse of children. I view all three of those factors as red flags of varying degrees of seriousness indicating a\npotential\npredilection for pedophilia. I would encourage you to consider some of Delany’s following statements that I have highlighted in that light:\nI never met or knew Walter Breen (and only two or three times met Marion Zimmer Bradley, in the last two or three years of her life)…. I got the impression from others who knew him that the gossip about Breen, especially in the first years I knew Paul (well before Stonewall), whether Breen was gay or straight, was a tempest in teapot. Currently it sounds like it’s not. But, again, I never knew Breen or saw him in my life.\nI have no idea what NAMBLA has been doing for the last twenty years.\nI had my first sexual experience with an adult when I was six, with a local Harlem building superintendent. And nothing hurtful happened at all. It would have been cruel and unusual punishment to incarcerate him for it…. The building superintendent, however, abused me not at all. To say that he did, is just incorrect.\nI said and still maintain that 20 years ago [NAMBLA] was an intelligent and highly thoughtful institution.\nSince I spent eighteen years of my life as a child, and nine years of that life as a pretty sexually active gay child, my complaint against the current attitudes is that they work mightily to silence the voices of children first and secondarily ignore what adults have to say who have been through these situations. One size fits all is never the way to handle any situation with a human dimension.\nThe current attitude toward pedophilia is a tragic attempt to drive nature out with a pitchfork, and at this point it is a self-reinforcing tragedy, encouraging the worst and punishing the best by making no distinctions at all\nThe consent of a seven-, eight-, or nine-year old is not the same thing as the consent of a seventeen- or eighteen-year old. And the “consent” of a three, four, and five year old means much less—especially if it’s negative. But it must count for something, otherwise you are just saying the child is not human and has no feelings or agency whatsoever—which, in itself, is abusive and counter-intuitive. And, I would maintain, immoral when another possibility presents itself.\nI have heard fifty or sixty such tales from gay men of this nature. It had none of the affect of abuse. If anything, it had more the feel of an impromptu educational session.\nOn the basis of Mr. Delany’s remarkably frank answers, I would maintain that he was physically, emotionally, and sexually abused as a child to the point that he is intrinsically unable to tell black from white or right from wrong with regards to sexual matters. However, it is to be regretted that Mr. Shetterly did not ask Mr. Delany anything about the elephant in the room, namely, what he, himself, did. We know Mr. Delany was sexually abused by an older man at the age of six. We know he is familiar with fifty or sixty similarly abused homosexual men. What we still do not know, and what Mr. Shetterly rather delicately avoided asking, is if Mr. Delany ever put his principles into action, and, as an adult, engaged in sexual relations with children under the age of legal consent.\nSince most sexual abusers were abused themselves as children, (a fourth red flag, if you’re still counting), at this point I doubt it would very much surprise anyone if he had. And lest you doubt that SFWA’s support for Mr. Delany, let me remind you what SFWA President Steven Gould and former SFWA President John Scalzi had to say about Samuel R. Delany last December.\n“One of the perks of being SFWA president is the option of\nselecting the Science Fiction and Fantasy Writers of America’s next\nDamon Knight Memorial Grand Master. One of the tragedies is we only get\nto select one a year. That said, from the grains of sand in my pocket, I\nam delighted to pull this star. Samuel R. Delany is one of science fiction’s most influential\nauthors, critics, and teachers and it is my great honor to announce his\nselection. When discussing him as this year’s choice with the board,\npast-presidents, and members, the most frequent response I received was,\n“He’s not already?” Well he is now.” (S. Gould)\n“The Science Fiction and Fantasy Writers of America has named Samuel R.\nDelany its newest Grand Master…. I will say this: This is an award\nboth well chosen and well deserved.” (J. Scalzi)\nIt would certainly be interesting to know if Mr. Gould and Mr. Scalzi still unreservedly support Mr. Delany.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-15T15:54:00+00:00"
}