{
  "url": "https://voxday.net/2014/07/24/wishful-thinking/",
  "scraped_at": "2025-12-16T12:21:46.832537",
  "title": "Wishful thinking",
  "date_display": "July 24, 2014",
  "date_iso": "2014-07-24T09:29:00+00:00",
  "date_from_url": "2014-07-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>To say nothing of projection. It’s always interesting to see how people who write about me, of whom I’ve only heard because they are writing about me, almost invariably claim that if I respond to them in any way, this indicates I am obsessed with them. It’s less interesting how they frequently <a href=\"https://twitter.com/damiengwalter/status/492177887919751168\">imagine that I must be sock-puppeting</a> in order to pretend that fewer people visit here than, in fact, do read the blog.</p><blockquote class=\"tr_bq\"><p> Damien Walter ‏@damiengwalter<br> Gorblimey guv’, the sad old men who read Vox Day’s blog are literally obsessed with me. It’s like every day is Damofest over there.</br></p><p>Michael Grey ‏@Mikes005 <br> @damiengwalter Not to rain on your parade, but I’m pretty certain it’s just Beale posting under aliases. Too much syntax repetition.</br></p><p>Damien Walter ‏@damiengwalter<br> @Mikes005 That’s a waaaay less creepy thought! I think about 50% of the comments are Beale, and they’re obvious, yes.</br></p></blockquote><p>As it happens, I post under two, and only two names. VD in black text most of the time, Vox in blue text when I am logged in and forget to use Name/URL. But most critics like this don’t genuinely believe what they’re saying; they’re not so stupid that they can’t click on Sitemeter and see the panoply of different IP addresses from all over the world appearing seconds apart. For example, in the same minute there were visitors from: New York (USA), Bourgogne (France), Trabzon (Turkey), Reading (UK), Oregon (USA), Washington (USA), and Israel, in addition to the majority of IP addresses that were not location marked.</p><p>This is just the usual left-wing performance art, where one person publicly strikes a pose and the others pretend to believe what he’s saying. The purpose seems to be an attempt to render small a prospective threat to the warren. However, it appears some of them are either stupid or self-absorbed to such an extent that they truly  have no idea about the reality of the situation. Being able to <a href=\"https://twitter.com/voxday/status/491916814264586240\">tweet this</a> in response to one clueless wonder’s tweet rather amused me:</p><blockquote class=\"tr_bq\"><p> <i>“Who listens to Vox Day? I mean – is there any real following?” </i> That same day: 52,447 Google pageviews.</p></blockquote><p>Keep in mind that is someone from the very community that believed John Scalzi was one of the most significant figures in SF because he was claiming UP TO 45,000 daily readers per day at a time when he was actually averaging 13,604 Google pageviews per day. Set aside VP. Alpha Game alone is now averaging more daily pageviews than that: 15,179 every day this week.</p><p>I realize I am extremely fortunate to have such an enthusiastic and high-quality readership. Just this morning, I received a Chinese translation of <i>QUANTUM MORTIS A Man Disrupted</i> from Tiger. Last week, Emilio sent me Spanish translations of that and of <i>QUANTUM MORTIS Gravity Kills</i>, which will be forthcoming as soon as I finish the corrections to two other books. Two brave souls are even taking on the translation of the 850-page <i>A Throne of Bones</i>. Very few authors are so fortunate to have readers who are willing to do so much, and I am deeply appreciative of the community here for its ongoing support and active involvement.</p><p>And do you know, it occurs to me that my writing has now been translated into nine languages. Do they also feign to think I’m doing all of that myself when I’m not busy sock-puppeting my own blog? Anyhow, it’s nothing new. People have been trying the same thing since my WND column first began attracting attention back in 2001. It didn’t matter then. It doesn’t matter now. As for the “sad old men” comment, I don’t think they have any idea how many younger readers there are. For example, I received this email from a college student yesterday:</p><blockquote class=\"tr_bq\"><p> My philosophy professor wrote your blog down as one of the four blogs we<br> need to pay attention to, and I’ve been reading regularly for a couple<br> of years now.</br></br></p></blockquote><p>I emailed him back to learn the names of the other blogs, and was rather pleased that my surmise concerning one of them was correct: <a href=\"http://edwardfeser.blogspot.com/\">Edward Feser</a>.</p></div>",
  "content_text": "To say nothing of projection. It’s always interesting to see how people who write about me, of whom I’ve only heard because they are writing about me, almost invariably claim that if I respond to them in any way, this indicates I am obsessed with them. It’s less interesting how they frequently\nimagine that I must be sock-puppeting\nin order to pretend that fewer people visit here than, in fact, do read the blog.\nDamien Walter ‏@damiengwalter\nGorblimey guv’, the sad old men who read Vox Day’s blog are literally obsessed with me. It’s like every day is Damofest over there.\nMichael Grey ‏@Mikes005\n@damiengwalter Not to rain on your parade, but I’m pretty certain it’s just Beale posting under aliases. Too much syntax repetition.\nDamien Walter ‏@damiengwalter\n@Mikes005 That’s a waaaay less creepy thought! I think about 50% of the comments are Beale, and they’re obvious, yes.\nAs it happens, I post under two, and only two names. VD in black text most of the time, Vox in blue text when I am logged in and forget to use Name/URL. But most critics like this don’t genuinely believe what they’re saying; they’re not so stupid that they can’t click on Sitemeter and see the panoply of different IP addresses from all over the world appearing seconds apart. For example, in the same minute there were visitors from: New York (USA), Bourgogne (France), Trabzon (Turkey), Reading (UK), Oregon (USA), Washington (USA), and Israel, in addition to the majority of IP addresses that were not location marked.\nThis is just the usual left-wing performance art, where one person publicly strikes a pose and the others pretend to believe what he’s saying. The purpose seems to be an attempt to render small a prospective threat to the warren. However, it appears some of them are either stupid or self-absorbed to such an extent that they truly  have no idea about the reality of the situation. Being able to\ntweet this\nin response to one clueless wonder’s tweet rather amused me:\n“Who listens to Vox Day? I mean – is there any real following?”\nThat same day: 52,447 Google pageviews.\nKeep in mind that is someone from the very community that believed John Scalzi was one of the most significant figures in SF because he was claiming UP TO 45,000 daily readers per day at a time when he was actually averaging 13,604 Google pageviews per day. Set aside VP. Alpha Game alone is now averaging more daily pageviews than that: 15,179 every day this week.\nI realize I am extremely fortunate to have such an enthusiastic and high-quality readership. Just this morning, I received a Chinese translation of\nQUANTUM MORTIS A Man Disrupted\nfrom Tiger. Last week, Emilio sent me Spanish translations of that and of\nQUANTUM MORTIS Gravity Kills\n, which will be forthcoming as soon as I finish the corrections to two other books. Two brave souls are even taking on the translation of the 850-page\nA Throne of Bones\n. Very few authors are so fortunate to have readers who are willing to do so much, and I am deeply appreciative of the community here for its ongoing support and active involvement.\nAnd do you know, it occurs to me that my writing has now been translated into nine languages. Do they also feign to think I’m doing all of that myself when I’m not busy sock-puppeting my own blog? Anyhow, it’s nothing new. People have been trying the same thing since my WND column first began attracting attention back in 2001. It didn’t matter then. It doesn’t matter now. As for the “sad old men” comment, I don’t think they have any idea how many younger readers there are. For example, I received this email from a college student yesterday:\nMy philosophy professor wrote your blog down as one of the four blogs we\nneed to pay attention to, and I’ve been reading regularly for a couple\nof years now.\nI emailed him back to learn the names of the other blogs, and was rather pleased that my surmise concerning one of them was correct:\nEdward Feser\n.",
  "tags": [
    "anklebiters",
    "rabbitology"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-24T08:29:00+00:00"
}