{
  "url": "https://voxday.net/2014/07/26/women-and-civilizational-cycle/",
  "scraped_at": "2025-12-16T12:22:03.345911",
  "title": "Women and the civilizational cycle",
  "date_display": "July 26, 2014",
  "date_iso": "2014-07-26T13:00:00+00:00",
  "date_from_url": "2014-07-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The materially deleterious effect of women working on a society is illustrated in a paper entitled “Women Prefer Larger Governments: Growth, Structural Transformation and Government Size”</p><blockquote class=\"tr_bq\"><p> The increase in income per capita is accompanied, in virtually all<br> countries, by two changes in the structure of the economy, namely an<br> increase in the share of government spending in GDP and an increase in<br> female labour force participation. This paper suggests that these two<br> changes are causally related. We develop a growth model where the<br> structure of the economy is endogenous so that participation in market<br> activities and government size are causally related.</br></br></br></br></br></br></p><p>Economic growth and<br> rising incomes are accompanied by a greater incentive for women to<br> engage in labour market activities as the opportunity cost of staying at<br> home increases. We hypothesize that government spending decreases the<br> cost of performing household chores such as, but not limited to, child<br> rearing and child care so that couples decide to engage further in the<br> labour market and chose a higher tax rate to finance more government<br> spending.</br></br></br></br></br></br></br></p><p>Using a wide cross-section of data for developed and<br> developing countries, we show that higher participation by women in the<br> labour market are indeed positively associated with larger governments.<br> Furthermore, we investigate the causal link between the two variables<br> using as instrumental variables a unique and novel dataset on the<br> relative price of home appliances across OECD countries and over time.<br> We find strong evidence of a causal link between participation in the<br> labour market and government size: a 10 percent rise in participation in<br> the labour market leads to a 7 to 8 percent rise in government size.<br> This effect is robust to the country sample, time period, and a set of<br> controls in the spirit of Rodrik (1998).</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>This is also an implicit argument against female suffrage. However, the researchers’ hypothesis is incorrect, as government spending observably does not decrease the cost of child rearing and child care; one reason European families have so few children is that the cost of raising children is exorbitant despite the greater amount of spending by European governments. Free day care and year-long maternity leave doesn’t make up for the fact that food and gasoline cost considerably more than in the USA.</p><p>Voting is not freedom. The conflation of voting with freedom is one of the key deceptions upon which feminism rests. And like all ideologies based upon deception, the more powerful feminism becomes, the more likely it is that the polity in which it has become influential will collapse on the basis of the weight of its contradictions.</p></div>",
  "content_text": "The materially deleterious effect of women working on a society is illustrated in a paper entitled “Women Prefer Larger Governments: Growth, Structural Transformation and Government Size”\nThe increase in income per capita is accompanied, in virtually all\ncountries, by two changes in the structure of the economy, namely an\nincrease in the share of government spending in GDP and an increase in\nfemale labour force participation. This paper suggests that these two\nchanges are causally related. We develop a growth model where the\nstructure of the economy is endogenous so that participation in market\nactivities and government size are causally related.\nEconomic growth and\nrising incomes are accompanied by a greater incentive for women to\nengage in labour market activities as the opportunity cost of staying at\nhome increases. We hypothesize that government spending decreases the\ncost of performing household chores such as, but not limited to, child\nrearing and child care so that couples decide to engage further in the\nlabour market and chose a higher tax rate to finance more government\nspending.\nUsing a wide cross-section of data for developed and\ndeveloping countries, we show that higher participation by women in the\nlabour market are indeed positively associated with larger governments.\nFurthermore, we investigate the causal link between the two variables\nusing as instrumental variables a unique and novel dataset on the\nrelative price of home appliances across OECD countries and over time.\nWe find strong evidence of a causal link between participation in the\nlabour market and government size: a 10 percent rise in participation in\nthe labour market leads to a 7 to 8 percent rise in government size.\nThis effect is robust to the country sample, time period, and a set of\ncontrols in the spirit of Rodrik (1998).\nThis is also an implicit argument against female suffrage. However, the researchers’ hypothesis is incorrect, as government spending observably does not decrease the cost of child rearing and child care; one reason European families have so few children is that the cost of raising children is exorbitant despite the greater amount of spending by European governments. Free day care and year-long maternity leave doesn’t make up for the fact that food and gasoline cost considerably more than in the USA.\nVoting is not freedom. The conflation of voting with freedom is one of the key deceptions upon which feminism rests. And like all ideologies based upon deception, the more powerful feminism becomes, the more likely it is that the polity in which it has become influential will collapse on the basis of the weight of its contradictions.",
  "tags": [
    "economics",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2014-07-26T12:00:00+00:00"
}