{
  "url": "https://voxday.net/2021/06/16/a-little-reminder/",
  "scraped_at": "2026-01-08T12:37:44.654041",
  "title": "A little reminder",
  "date_display": "June 16, 2021",
  "date_iso": "2021-06-16T12:22:17+00:00",
  "date_from_url": "2021-06-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> I’m not expecting anything exciting to come out of the Geneva talks between Russian President Putin and US Fake President Fake Biden, but apparently the Sino-Russian alliance <a href=\"https://www.dailymail.co.uk/news/article-9690971/Russia-China-launch-provocative-war-games-Pacific.html\" rel=\"noopener\" target=\"_blank\">isn’t being subtle</a> about reminding everyone who has the initiative now:</p><blockquote><p>Russia and China have heaped pressure on Joe Biden with provocative military drills in the Pacific and the South China Sea ahead of the US President’s showdown with Vladimir Putin in Geneva today. </p><p>USAF stealth fighters were scrambled to Hawaii on Sunday as Moscow launched its biggest naval exercises in the Pacific since the Cold War, while in the South China Sea, an American carrier group has steamed in as Chinese warplanes tear around Taiwan.  </p><p>Biden will finally sit down with Putin on Wednesday for their first presidential summit on Lake Geneva – the choice of venue harking back to the Cold War meeting between Ronald Reagan and Soviet leader Mikhail Gorbachev in 1985. </p><p>Relations between the two sides are similarly cool – at their lowest ebb in decades after Putin’s outlandish cyber attacks against the US, aggression towards Ukraine, poisoning of Alexei Navalny and intervention in the Middle East.</p><p>Putin arrived at Geneva airport early this afternoon, a day after Biden, ahead of the meeting at the Villa de la Grange, a stunning chateau overlooking Lake Geneva ripe for photo-ops and small talk filled with bookcases, Trompe l’oeil ceiling details and a colorful rose garden. </p></blockquote><p>What appears to be taking place is stage-managing the displacement of the USA as the premier global power. This is a delicate process, chiefly because very few in the USA even believe this is possible, much less that it has already taken place. But people who pay close attention to these matters have been anticpating and planning for this moment <a href=\"https://www.haaretz.com/1.4920795\" rel=\"noopener\" target=\"_blank\">for more than a decade</a>.</p><blockquote><p>The fear expressed that “a real decline of the West, particularly the United States, would have dramatic consequences for the Jewish people,” also led to controversy. Brandeis University president Jehuda Reinharz agreed that this type of decline can be expected “in the coming two decades” – but Stuart Eisenstadt was less emphatic about it. He believes the United States will remain the leading power. In all events, it was agreed the Jews “should strengthen cultural links with non-Western civilizations, particularly China and also India,” powers that are on the ascent.</p></blockquote><p>That was 14 years ago. However, as we’ve seen, the project to establish a cultural connection with China did not go so well. </p></div>",
  "content_text": "I’m not expecting anything exciting to come out of the Geneva talks between Russian President Putin and US Fake President Fake Biden, but apparently the Sino-Russian alliance\nisn’t being subtle\nabout reminding everyone who has the initiative now:\nRussia and China have heaped pressure on Joe Biden with provocative military drills in the Pacific and the South China Sea ahead of the US President’s showdown with Vladimir Putin in Geneva today.\nUSAF stealth fighters were scrambled to Hawaii on Sunday as Moscow launched its biggest naval exercises in the Pacific since the Cold War, while in the South China Sea, an American carrier group has steamed in as Chinese warplanes tear around Taiwan.\nBiden will finally sit down with Putin on Wednesday for their first presidential summit on Lake Geneva – the choice of venue harking back to the Cold War meeting between Ronald Reagan and Soviet leader Mikhail Gorbachev in 1985.\nRelations between the two sides are similarly cool – at their lowest ebb in decades after Putin’s outlandish cyber attacks against the US, aggression towards Ukraine, poisoning of Alexei Navalny and intervention in the Middle East.\nPutin arrived at Geneva airport early this afternoon, a day after Biden, ahead of the meeting at the Villa de la Grange, a stunning chateau overlooking Lake Geneva ripe for photo-ops and small talk filled with bookcases, Trompe l’oeil ceiling details and a colorful rose garden.\nWhat appears to be taking place is stage-managing the displacement of the USA as the premier global power. This is a delicate process, chiefly because very few in the USA even believe this is possible, much less that it has already taken place. But people who pay close attention to these matters have been anticpating and planning for this moment\nfor more than a decade\n.\nThe fear expressed that “a real decline of the West, particularly the United States, would have dramatic consequences for the Jewish people,” also led to controversy. Brandeis University president Jehuda Reinharz agreed that this type of decline can be expected “in the coming two decades” – but Stuart Eisenstadt was less emphatic about it. He believes the United States will remain the leading power. In all events, it was agreed the Jews “should strengthen cultural links with non-Western civilizations, particularly China and also India,” powers that are on the ascent.\nThat was 14 years ago. However, as we’ve seen, the project to establish a cultural connection with China did not go so well.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-06-16T11:22:17+00:00"
}