{
  "url": "https://voxday.net/2021/06/30/a-very-bad-bargain/",
  "scraped_at": "2026-01-08T12:40:02.378795",
  "title": "A very bad bargain",
  "date_display": "June 30, 2021",
  "date_iso": "2021-06-30T12:00:03+00:00",
  "date_from_url": "2021-06-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Karl Denninger <a href=\"https://market-ticker.org/akcs-www?post=242825\" rel=\"noopener\" target=\"_blank\">does the math</a> and demonstrates that you are 20 times more likely to have your heart permanently damaged by the not-vaxxes than die of Covid:</p><blockquote><p>Here you go folks, from a mainstream media outlet.</p><p><i>The US Food and Drug Administration added a warning about the risk of myocarditis and pericarditis to fact sheets for Moderna and Pfizer-BioNTech Covid-19 vaccines Friday. The warning notes that reports of adverse events following vaccination — particularly after the second dose — suggest increased risks of both types of heart inflammation. Earlier this week, vaccine advisers to the US Centers for Disease Control and Prevention heard that the agency had received about 1,200 reports of such heart inflammation after 300 million doses of the two vaccines had been given. CDC has confirmed about 300 of those cases, many of them among young men and adolescents.</i></p><p>I will point out that the odds of a healthy under-18 person being killed by Covid-19 are approximately 1 in 250,000 in the US.  Only a small percentage of the total 150 million or so “vaccinated” (note that most are 2-dose, so the 300 million number is an attempt to cut the actual risk in half) are in kids thus far, perhaps 15 million or so.  It is thus roughly 20 times as likely as you will get hit by this if you’re a young person as you will die of Covid.</p><p>Further, a material percentage of these cases have reduced ejection fraction detected and materially elevated troponin values, both of which imply serious cardiac compromise.  That damage is likely permanent and the mortality rate from this condition is not encouraging.</p><p>Clearly, for an underlying disease that is almost-never fatal in healthy people under 30 that’s a bad bargain….  The FDA has now admitted that I, and a few others who blew the whistle on this months ago in terms of both the dangers from the shots and what was going to happen with the virus originally were right and yet exactly zero of those who were conned have nutted up and taken out the trash, so spare me the crying when it goes bad on you and those you love.  That which you cheered on deserves zero sympathy from anyone.</p></blockquote><p>Throw in the Israeli data indicating that there are 2 vaccine deaths for every 3 Covid deaths, and that bad bargain becomes a very bad one that crosses the line into reprehensibly stupid territory.</p><p>Do. Not. Get. Vaxxed. There is absolutely no reason or excuse or rationalization that can scientifically or statistically justify doing so under <i>any </i>circumstances. Not even if your obese, immuno-suppressed grandmother with asthma is celebrating her 95th birthday, your wife is threatening to divorce you, and your boss is threatening to fire you. </p><p>Do not do it.</p></div>",
  "content_text": "Karl Denninger\ndoes the math\nand demonstrates that you are 20 times more likely to have your heart permanently damaged by the not-vaxxes than die of Covid:\nHere you go folks, from a mainstream media outlet.\nThe US Food and Drug Administration added a warning about the risk of myocarditis and pericarditis to fact sheets for Moderna and Pfizer-BioNTech Covid-19 vaccines Friday. The warning notes that reports of adverse events following vaccination — particularly after the second dose — suggest increased risks of both types of heart inflammation. Earlier this week, vaccine advisers to the US Centers for Disease Control and Prevention heard that the agency had received about 1,200 reports of such heart inflammation after 300 million doses of the two vaccines had been given. CDC has confirmed about 300 of those cases, many of them among young men and adolescents.\nI will point out that the odds of a healthy under-18 person being killed by Covid-19 are approximately 1 in 250,000 in the US.  Only a small percentage of the total 150 million or so “vaccinated” (note that most are 2-dose, so the 300 million number is an attempt to cut the actual risk in half) are in kids thus far, perhaps 15 million or so.  It is thus roughly 20 times as likely as you will get hit by this if you’re a young person as you will die of Covid.\nFurther, a material percentage of these cases have reduced ejection fraction detected and materially elevated troponin values, both of which imply serious cardiac compromise.  That damage is likely permanent and the mortality rate from this condition is not encouraging.\nClearly, for an underlying disease that is almost-never fatal in healthy people under 30 that’s a bad bargain….  The FDA has now admitted that I, and a few others who blew the whistle on this months ago in terms of both the dangers from the shots and what was going to happen with the virus originally were right and yet exactly zero of those who were conned have nutted up and taken out the trash, so spare me the crying when it goes bad on you and those you love.  That which you cheered on deserves zero sympathy from anyone.\nThrow in the Israeli data indicating that there are 2 vaccine deaths for every 3 Covid deaths, and that bad bargain becomes a very bad one that crosses the line into reprehensibly stupid territory.\nDo. Not. Get. Vaxxed. There is absolutely no reason or excuse or rationalization that can scientifically or statistically justify doing so under\nany\ncircumstances. Not even if your obese, immuno-suppressed grandmother with asthma is celebrating her 95th birthday, your wife is threatening to divorce you, and your boss is threatening to fire you.\nDo not do it.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-06-30T11:00:03+00:00"
}