{
  "url": "https://voxday.net/2021/06/03/anticipating-the-unthinkable/",
  "scraped_at": "2026-01-08T12:35:30.130390",
  "title": "Anticipating the unthinkable",
  "date_display": "June 3, 2021",
  "date_iso": "2021-06-03T09:57:19+00:00",
  "date_from_url": "2021-06-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Technology can be created on demand, as Stefan Possony and I showed in <i>The Strategy of Technology</i>. This does not mean that all technologies should be created, merely that once something is possible, it is only a matter of time before it becomes real. There will be war; there will also be technologies that can only be deterred, not defended against.</p><p>Jerry Pournelle, Editor’s Introduction to: SEVEN KILL TIGER by Charles W. Shao</p><p>Six years ago, I worked with the great SF writer Jerry Pournelle in reviving the <i>There Will Be War</i> series by publishing <i><a href=\"https://www.amazon.com/There-Will-Be-War-Historys/dp/9527303249/\" rel=\"noopener\" target=\"_blank\">There Will Be War Vol. X</a></i>. Below follows an excerpt from the short story “Seven Kill Tiger”, which serves to demonstrate that the concept of a country creating a two-part genetic weapon that utilizes a purported vaccine as part of its delivery system was neither unthinkable nor unanticipated prior to COVID-19 and the not-vaccines.</p><p><span><a name=\"more\"></a></span></p><p>“They tell me your most recent test of <i>Huáng Hu</i> was successful.”</p><p>“Yes, Director. The terminal rate is now in excess of 80 percent. Based on the most conservative spread models, the pseudo-epidemic will cross the Angolan border within two weeks. Within nine months, the continent is expected to be clear of all undesirable populations. The task of disposal will obviously be enormous, and will create considerable additional health hazards, but I would expect that it would be safe to begin the settlement programs within 18 months of zero day.”</p><p>“Zero day?”</p><p>“The date upon which any opposing forces will be unable to stop the virus from going terminal in the target population. The estimates vary, but the average indicates zero day is D-day plus 28.”</p><p>“Is there any way to reduce the time to zero day?”</p><p>“Increase the number of transmission vectors, preferably in a manner scattered widely across the continent.”</p><p>Zhang nodded. “I will think on that.”</p><p>“If I may offer a suggestion, Director?”</p><p>“Please do.”</p><p>“There is an American foundation that has malaria vaccination campaigns running in every country in Africa. If a way could be found to substitute the substances injected, zero day could be reduced to a matter of two weeks or less.”</p><p>“Wouldn’t that increase the risk of detection?”</p><p>“Certainly.” The young scientist’s dark eyes were unperturbed. “But in light of how the vaccination campaigns are already regarded with a significant amount of local suspicion, detection would likely sow sufficient confusion to inhibit any effective response. Especially because the NGOs tasked with the response would be widely regarded as the guilty parties.”</p><p>“And combined with cutting the potential response time in half, it’s almost surely worth the risk as long as the substitutions can be made undetected.”</p><p>“I cannot speak to that, Director. It is outside my competence.”</p><p>Zhang thought a moment. “It’s too risky to interfere with the Americans. We don’t know their protocols. But Sinovac has a polio vaccine that’s already been prequalified by the World Health Organization and the Global Polio Eradication Initiative has endorsed it as a substitute for their primary oral vaccine. It would be much easier to substitute that. We can even arrange to have the vaccines shipped in through Dar es Salaam.”</p><p>“As you say, Director.”</p><p>Zhang couldn’t help but smile. The young scientist could not have made his indifference to anything but the technical aspects related to his specialty any more clear. “The potential consequences do not trouble you, Dr. Gao?”</p><p>“Not in the slightest, Director Zhang. To the contrary, you have my deepest admiration. What you propose to accomplish will make the Great Leap Forward appear little more than a precursor to the true advancement. What began as a Cultural Revolution has become a Scientific Revolution. Soon China will stand astride the globe as the master of two continents, and the nations of the world will bow before her!”</p><p>Zhang found himself mildly appalled by the young man’s fanaticism. Did Mao ever feel similarly alarmed by the enthusiasm of his own Red Guards? But the sentiments Gao expressed were sound enough. Africa was wasted on the Africans. China had spent 50 million Chinese lives to become a 20th-century power, how could she hesitate to spend twenty times that many more African lives to assume her rightful place as the one true 21st-century superpower?</p><p>“Thank you, Dr. Gao.”</p><p>“Director.” The young man bowed and left his office.</p><p>Zhang reflected on Gao’s words. A Scientific Revolution. A Greater Leap Forward! The young scientist’s confidence in the project quelled any remaining doubts that it was time to move forward and let the Central Military Commission know about his plans for the Dark Continent. But one question still remained: to release <i>Huáng Hu</i> before or after General Xu’s scheduled visit?</p><p>It would be a shame, after all, if he were to be executed before releasing the spirits to seek their revenge.</p><p style=\"text-align: center;\">***</p><p><i>The World Health Organization (WHO) has announced the prequalification of a Chinese-made vaccine for polio. The new WHO pre-qualified vaccine is produced by Sinovac Biotech Ltd, and is an inactive-virus vaccine that is considered to be safer than the live-virus vaccines now widely used across Asia and Africa.</i></p><p><i>“WHO prequalification of the Sinovac vaccine is another feather in the cap of China’s growing vaccine manufacturing industry,” said Dr. Bernhard Schwartländer, WHO Representative in China.</i></p><p><i>“This is also very good news for the millions of children in low- and middle-income countries which cannot afford to manufacture or purchase their inactive-virus vaccines. WHO prequalification of Sinovac’s vaccine will add to the worldwide arsenal of anti-polio vaccines, assisting the global campaign to eradicate the disease. In doing so, it will help to save lives,” Dr Schwartländer said.</i></p><p><i>Sinovac’s polio vaccine is the second vaccine made in China to achieve WHO prequalification, following prequalification of a Japanese-made encephalitis vaccine in 2013 and Hualan Biological’s influenza vaccine in 2015.</i></p><p>Philip Thompson shook his head as he returned the printout to Scott Berens. “You don’t seriously imagine that the Chinese would use a weaponized vaccine as a vehicle for genetic warfare, do you? They could maybe get one hot lot into the distribution system, two at most, and I can’t imagine that could possibly be worth permanently trashing their ability to access the export markets!”</p><p>“No, of course not.” His subordinate shrugged. “You told me to dig up anything that might be related to possible launch vectors. This is the only one I found that could conceivably be connected to Chinese corporate activity in the last two years.”</p><p>“I’d use bird flu myself,” Thompson mused.</p><p>“What’s that?”</p><p>“If you’re going to weaponize something, an aerosol vector is the most effective. And the world is accustomed to bird flu coming out of China every few years. That’s what that vaccine from Hualan was, it was an H1N1 vaccine. You could even combine the two, put the bomb in the flu virus itself, then trigger it with the vaccine.”</p><p>“Now who is imagining things, Doctor?”</p></div>",
  "content_text": "Technology can be created on demand, as Stefan Possony and I showed in\nThe Strategy of Technology\n. This does not mean that all technologies should be created, merely that once something is possible, it is only a matter of time before it becomes real. There will be war; there will also be technologies that can only be deterred, not defended against.\nJerry Pournelle, Editor’s Introduction to: SEVEN KILL TIGER by Charles W. Shao\nSix years ago, I worked with the great SF writer Jerry Pournelle in reviving the\nThere Will Be War\nseries by publishing\nThere Will Be War Vol. X\n. Below follows an excerpt from the short story “Seven Kill Tiger”, which serves to demonstrate that the concept of a country creating a two-part genetic weapon that utilizes a purported vaccine as part of its delivery system was neither unthinkable nor unanticipated prior to COVID-19 and the not-vaccines.\n“They tell me your most recent test of\nHuáng Hu\nwas successful.”\n“Yes, Director. The terminal rate is now in excess of 80 percent. Based on the most conservative spread models, the pseudo-epidemic will cross the Angolan border within two weeks. Within nine months, the continent is expected to be clear of all undesirable populations. The task of disposal will obviously be enormous, and will create considerable additional health hazards, but I would expect that it would be safe to begin the settlement programs within 18 months of zero day.”\n“Zero day?”\n“The date upon which any opposing forces will be unable to stop the virus from going terminal in the target population. The estimates vary, but the average indicates zero day is D-day plus 28.”\n“Is there any way to reduce the time to zero day?”\n“Increase the number of transmission vectors, preferably in a manner scattered widely across the continent.”\nZhang nodded. “I will think on that.”\n“If I may offer a suggestion, Director?”\n“Please do.”\n“There is an American foundation that has malaria vaccination campaigns running in every country in Africa. If a way could be found to substitute the substances injected, zero day could be reduced to a matter of two weeks or less.”\n“Wouldn’t that increase the risk of detection?”\n“Certainly.” The young scientist’s dark eyes were unperturbed. “But in light of how the vaccination campaigns are already regarded with a significant amount of local suspicion, detection would likely sow sufficient confusion to inhibit any effective response. Especially because the NGOs tasked with the response would be widely regarded as the guilty parties.”\n“And combined with cutting the potential response time in half, it’s almost surely worth the risk as long as the substitutions can be made undetected.”\n“I cannot speak to that, Director. It is outside my competence.”\nZhang thought a moment. “It’s too risky to interfere with the Americans. We don’t know their protocols. But Sinovac has a polio vaccine that’s already been prequalified by the World Health Organization and the Global Polio Eradication Initiative has endorsed it as a substitute for their primary oral vaccine. It would be much easier to substitute that. We can even arrange to have the vaccines shipped in through Dar es Salaam.”\n“As you say, Director.”\nZhang couldn’t help but smile. The young scientist could not have made his indifference to anything but the technical aspects related to his specialty any more clear. “The potential consequences do not trouble you, Dr. Gao?”\n“Not in the slightest, Director Zhang. To the contrary, you have my deepest admiration. What you propose to accomplish will make the Great Leap Forward appear little more than a precursor to the true advancement. What began as a Cultural Revolution has become a Scientific Revolution. Soon China will stand astride the globe as the master of two continents, and the nations of the world will bow before her!”\nZhang found himself mildly appalled by the young man’s fanaticism. Did Mao ever feel similarly alarmed by the enthusiasm of his own Red Guards? But the sentiments Gao expressed were sound enough. Africa was wasted on the Africans. China had spent 50 million Chinese lives to become a 20th-century power, how could she hesitate to spend twenty times that many more African lives to assume her rightful place as the one true 21st-century superpower?\n“Thank you, Dr. Gao.”\n“Director.” The young man bowed and left his office.\nZhang reflected on Gao’s words. A Scientific Revolution. A Greater Leap Forward! The young scientist’s confidence in the project quelled any remaining doubts that it was time to move forward and let the Central Military Commission know about his plans for the Dark Continent. But one question still remained: to release\nHuáng Hu\nbefore or after General Xu’s scheduled visit?\nIt would be a shame, after all, if he were to be executed before releasing the spirits to seek their revenge.\n***\nThe World Health Organization (WHO) has announced the prequalification of a Chinese-made vaccine for polio. The new WHO pre-qualified vaccine is produced by Sinovac Biotech Ltd, and is an inactive-virus vaccine that is considered to be safer than the live-virus vaccines now widely used across Asia and Africa.\n“WHO prequalification of the Sinovac vaccine is another feather in the cap of China’s growing vaccine manufacturing industry,” said Dr. Bernhard Schwartländer, WHO Representative in China.\n“This is also very good news for the millions of children in low- and middle-income countries which cannot afford to manufacture or purchase their inactive-virus vaccines. WHO prequalification of Sinovac’s vaccine will add to the worldwide arsenal of anti-polio vaccines, assisting the global campaign to eradicate the disease. In doing so, it will help to save lives,” Dr Schwartländer said.\nSinovac’s polio vaccine is the second vaccine made in China to achieve WHO prequalification, following prequalification of a Japanese-made encephalitis vaccine in 2013 and Hualan Biological’s influenza vaccine in 2015.\nPhilip Thompson shook his head as he returned the printout to Scott Berens. “You don’t seriously imagine that the Chinese would use a weaponized vaccine as a vehicle for genetic warfare, do you? They could maybe get one hot lot into the distribution system, two at most, and I can’t imagine that could possibly be worth permanently trashing their ability to access the export markets!”\n“No, of course not.” His subordinate shrugged. “You told me to dig up anything that might be related to possible launch vectors. This is the only one I found that could conceivably be connected to Chinese corporate activity in the last two years.”\n“I’d use bird flu myself,” Thompson mused.\n“What’s that?”\n“If you’re going to weaponize something, an aerosol vector is the most effective. And the world is accustomed to bird flu coming out of China every few years. That’s what that vaccine from Hualan was, it was an H1N1 vaccine. You could even combine the two, put the bomb in the flu virus itself, then trigger it with the vaccine.”\n“Now who is imagining things, Doctor?”",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-06-03T08:57:19+00:00"
}