{
  "url": "https://voxday.net/2021/06/03/crowdsourcing-investigative-journalism/",
  "scraped_at": "2026-01-08T12:35:33.811492",
  "title": "Crowdsourcing investigative journalism",
  "date_display": "June 3, 2021",
  "date_iso": "2021-06-03T12:26:36+00:00",
  "date_from_url": "2021-06-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> An international team of amateurs <a href=\"https://www.newsweek.com/exclusive-how-amateur-sleuths-broke-wuhan-lab-story-embarrassed-media-1596958?utm_term=Autofeed&amp;utm_medium=Social&amp;utm_source=Twitter#Echobox=1622658604\" rel=\"noopener\" target=\"_blank\">cracked the thin white-coated wall of silenc</a>e that professional scientists were maintaining, with the full collusion of the mainstream media, to hide the fact that the coronavirus was a man-made bioweapon:</p><blockquote><p>When the pandemic happened to break out on the doorstep of the lab with the largest collection of coronaviruses in the world, fueling speculation that the WIV might be involved, Daszak and 26 other scientists signed a letter that appeared in <i>The Lancet </i>on February 19, 2020. “We stand together to strongly condemn conspiracy theories suggesting that COVID-19 does not have a natural origin,” it stated.</p><p>We now know, thanks to a Freedom of Information Act request, that Daszak orchestrated the letter to squelch talk of a lab leak. He drafted it, reached out to fellow scientists to sign it, and worked behind the scenes to make it seem that the letter represented the views of a broad range of scientists. “This statement will not have the EcoHealth Alliance logo on it and will not be identifiable as coming from any one organization or person,” he wrote in his pitch to the co-signatories. Scientists whose work had overlapped with the WIV agreed not to sign it so they could “put it out in a way that doesn’t link it back to our collaboration.”</p><p>At the time, however, there was no hint of Daszak’s organizing role. The letter helped make Daszak a ubiquitous presence in the media, where he called a lab-leak “preposterous,” “baseless,” and “pure baloney.” He also attacked scientists who published evidence pointing to the lab. Part of the reason the lab theory made no sense, he argued, was because the Wuhan lab wasn’t culturing any viruses remotely similar to SARS-CoV-2. (Daszak has not responded to Newsweek’s request for comment.)</p><p>For a long time, Daszak was astonishingly influential. Few in the media questioned him or pointed out that his career and organization would be deeply damaged if it turned out his work had indirectly played a role in the pandemic….</p><p>By early 2020, The Seeker was beginning to question that viewpoint. He had begun to interact with people who were poking holes in the conventional wisdom. One important piece was an extensive Medium post by the Canadian longevity entrepreneur Yuri Deigin that discussed RaTG13, a virus Shi Zhengli had revealed to the world in a February 3 paper in the journal Nature. In that paper, Shi presented the first extensive analysis of SARS-CoV-2, which had seemed to come from nowhere—the virus was unlike any that had been seen before, including the first SARS, which had killed 774 people from 2002 to 2004. In her paper, however, Shi also introduced RaTG13, a virus that is similar in genetic makeup to SARS-CoV-2, making it the only known close relative at the time.</p><p>The paper was vague about where RaTG13 had come from. It didn’t say exactly where or when RaTG13 had been found, just that it had previously been detected in a bat in Yunnan Province, in southern China.</p><p>The paper aroused Deigin’s suspicions. He wondered if SARS-CoV-2 might have emerged through some genetic mixing and matching from a lab working with RaTG13 or related viruses. His post was cogent and comprehensive. The Seeker posted Deigin’s theory on Reddit, which promptly suspended his account permanently.</p><p>That early whiff of censorship piqued Seeker’s curiosity, so he read more of the Twitter group’s ideas. “I found a lively group of people eager to debate and explore the topic,” he told Newsweek by email.</p><p>It was an eclectic group. There were entrepreneurs, engineers, and a microbiologist from the University of Innsbruck named Rossana Segreto. None of them had known each other in advance; they gravitated to the forum after independently concluding that the conventional wisdom of the origins of COVID-19 didn’t make sense. Conversations were kept on track by a wisecracking coordinator living somewhere in Asia who went by the pseudonym Billy Bostickson, and whose Twitter icon was a cartoon of a beat-up lab monkey.</p><p>The Seeker fit right in. “They helped me catch up on the debate, and I started to educate myself,” he says. “Before I knew it, I got hooked into the mystery.” He was driven in part by curiosity, but also by a growing sense of civic duty. “COVID has taken the lives of countless people and devastated so many others. But it has also left so many clues that haven’t been followed up. Humanity deserves answers.”</p><p>The Seeker and the rest of the group became increasingly convinced that RaTG13 might hold the key to some of those answers. In a crackling thread, half a dozen participants hashed out its mysteries, combing the internet and the WIV’s previous papers for clues.</p><p>If there is a moment when the DRASTIC team coalesced into something more than its disparate parts, it would be this thread. In real time, for all the world to see, they worked through the data, tested various hypotheses, corrected each other, and scored some direct hits.</p><p>The key facts quickly came together. The genetic sequence for RaTG13 perfectly matched a small piece of genetic code posted as part of a paper written by Shi Zhengli years earlier, but never mentioned again. The code came from a virus the WIV had found in a Yunnan bat. Connecting key details in the two papers with old news stories, the DRASTIC team determined that RaTG13 had come from a mineshaft in Mojiang County, in Yunnan Province, where six men shoveling bat guano in 2012 had developed pneumonia. Three of them died. DRASTIC wondered if that event marked the first cases of human beings being infected with a precursor of SARS-CoV-2—perhaps RaTG13 or something like it.</p><p>In a profile in <i>Scientific American</i>, Shi Zhengli acknowledged working in a mineshaft in Mojiang County where miners had died. But she avoided connecting it to RaTG13 (an omission she had made in her scientific papers as well), claiming that a fungus in the cave had killed the miners.</p><p>That explanation didn’t sit well with the DRASTIC group. They suspected a SARS-like virus, not a fungus, had killed the miners and that, for whatever reason, the WIV was trying to hide that fact. It was a hunch, and they had no way of proving it.</p><p>At this point, The Seeker revealed his research powers to the group. In his online explorations, he’d recently discovered a massive Chinese database of academic journals and theses called CNKI. Now he wondered if somewhere in its vast circuitry might be information on the sickened miners.</p><p>Working through the night at his bedside table on phone and laptop, fueled by chai and using Chinese characters with the help of Google Translate, he plugged in “Mojiang”—the county where the mine was located—in combination with every other word he could think of that might be relevant, instantly translating each new flush of results back to English. “Mojiang + pneumonia”; “Mojiang + WIV”; “Mojiang + bats”; “Mojiang + SARS.” Each search brought back thousands of results and half a dozen different databases for journals, books, newspapers, master’s theses, doctoral dissertations. He combed through these results, night after night, but never found anything useful. When he ran out of energy, he broke for arcade games and more chai.</p><p>He was on the verge of calling it quits, he says, when he struck gold: a 60-page master’s thesis written by a student at Kunming Medical University in 2013 titled “The Analysis of 6 Patients with Severe Pneumonia Caused by Unknown Viruses.” In exhaustive detail, it described the conditions and step-by-step treatment of the miners. It named the suspected culprit: “Caused by SARS-like [coronavirus] from the Chinese horseshoe bat or other bats.”</p></blockquote><p>This is a failure of scientistry as much as it is a failure of the media. Remember this in the future: neither the mainstream media nor the professional scientific community can be trusted to tell you the truth in any way, about <i>anything</i>. They will not even hesitate to directly lie to you, and will afterwards go to great lengths to mislead, to redirect, and to cover their tracks.</p><p>Daszak and every other signatory of that February letter in <i>The Lancet</i> should have their funding pulled immediately. This illustrates why science is not only not the enemy of Christianity, but to the contrary, is dependent upon it. The method doesn’t mean a damn thing when the man utilizing it is corrupt.</p></div>",
  "content_text": "An international team of amateurs\ncracked the thin white-coated wall of silenc\ne that professional scientists were maintaining, with the full collusion of the mainstream media, to hide the fact that the coronavirus was a man-made bioweapon:\nWhen the pandemic happened to break out on the doorstep of the lab with the largest collection of coronaviruses in the world, fueling speculation that the WIV might be involved, Daszak and 26 other scientists signed a letter that appeared in\nThe Lancet\non February 19, 2020. “We stand together to strongly condemn conspiracy theories suggesting that COVID-19 does not have a natural origin,” it stated.\nWe now know, thanks to a Freedom of Information Act request, that Daszak orchestrated the letter to squelch talk of a lab leak. He drafted it, reached out to fellow scientists to sign it, and worked behind the scenes to make it seem that the letter represented the views of a broad range of scientists. “This statement will not have the EcoHealth Alliance logo on it and will not be identifiable as coming from any one organization or person,” he wrote in his pitch to the co-signatories. Scientists whose work had overlapped with the WIV agreed not to sign it so they could “put it out in a way that doesn’t link it back to our collaboration.”\nAt the time, however, there was no hint of Daszak’s organizing role. The letter helped make Daszak a ubiquitous presence in the media, where he called a lab-leak “preposterous,” “baseless,” and “pure baloney.” He also attacked scientists who published evidence pointing to the lab. Part of the reason the lab theory made no sense, he argued, was because the Wuhan lab wasn’t culturing any viruses remotely similar to SARS-CoV-2. (Daszak has not responded to Newsweek’s request for comment.)\nFor a long time, Daszak was astonishingly influential. Few in the media questioned him or pointed out that his career and organization would be deeply damaged if it turned out his work had indirectly played a role in the pandemic….\nBy early 2020, The Seeker was beginning to question that viewpoint. He had begun to interact with people who were poking holes in the conventional wisdom. One important piece was an extensive Medium post by the Canadian longevity entrepreneur Yuri Deigin that discussed RaTG13, a virus Shi Zhengli had revealed to the world in a February 3 paper in the journal Nature. In that paper, Shi presented the first extensive analysis of SARS-CoV-2, which had seemed to come from nowhere—the virus was unlike any that had been seen before, including the first SARS, which had killed 774 people from 2002 to 2004. In her paper, however, Shi also introduced RaTG13, a virus that is similar in genetic makeup to SARS-CoV-2, making it the only known close relative at the time.\nThe paper was vague about where RaTG13 had come from. It didn’t say exactly where or when RaTG13 had been found, just that it had previously been detected in a bat in Yunnan Province, in southern China.\nThe paper aroused Deigin’s suspicions. He wondered if SARS-CoV-2 might have emerged through some genetic mixing and matching from a lab working with RaTG13 or related viruses. His post was cogent and comprehensive. The Seeker posted Deigin’s theory on Reddit, which promptly suspended his account permanently.\nThat early whiff of censorship piqued Seeker’s curiosity, so he read more of the Twitter group’s ideas. “I found a lively group of people eager to debate and explore the topic,” he told Newsweek by email.\nIt was an eclectic group. There were entrepreneurs, engineers, and a microbiologist from the University of Innsbruck named Rossana Segreto. None of them had known each other in advance; they gravitated to the forum after independently concluding that the conventional wisdom of the origins of COVID-19 didn’t make sense. Conversations were kept on track by a wisecracking coordinator living somewhere in Asia who went by the pseudonym Billy Bostickson, and whose Twitter icon was a cartoon of a beat-up lab monkey.\nThe Seeker fit right in. “They helped me catch up on the debate, and I started to educate myself,” he says. “Before I knew it, I got hooked into the mystery.” He was driven in part by curiosity, but also by a growing sense of civic duty. “COVID has taken the lives of countless people and devastated so many others. But it has also left so many clues that haven’t been followed up. Humanity deserves answers.”\nThe Seeker and the rest of the group became increasingly convinced that RaTG13 might hold the key to some of those answers. In a crackling thread, half a dozen participants hashed out its mysteries, combing the internet and the WIV’s previous papers for clues.\nIf there is a moment when the DRASTIC team coalesced into something more than its disparate parts, it would be this thread. In real time, for all the world to see, they worked through the data, tested various hypotheses, corrected each other, and scored some direct hits.\nThe key facts quickly came together. The genetic sequence for RaTG13 perfectly matched a small piece of genetic code posted as part of a paper written by Shi Zhengli years earlier, but never mentioned again. The code came from a virus the WIV had found in a Yunnan bat. Connecting key details in the two papers with old news stories, the DRASTIC team determined that RaTG13 had come from a mineshaft in Mojiang County, in Yunnan Province, where six men shoveling bat guano in 2012 had developed pneumonia. Three of them died. DRASTIC wondered if that event marked the first cases of human beings being infected with a precursor of SARS-CoV-2—perhaps RaTG13 or something like it.\nIn a profile in\nScientific American\n, Shi Zhengli acknowledged working in a mineshaft in Mojiang County where miners had died. But she avoided connecting it to RaTG13 (an omission she had made in her scientific papers as well), claiming that a fungus in the cave had killed the miners.\nThat explanation didn’t sit well with the DRASTIC group. They suspected a SARS-like virus, not a fungus, had killed the miners and that, for whatever reason, the WIV was trying to hide that fact. It was a hunch, and they had no way of proving it.\nAt this point, The Seeker revealed his research powers to the group. In his online explorations, he’d recently discovered a massive Chinese database of academic journals and theses called CNKI. Now he wondered if somewhere in its vast circuitry might be information on the sickened miners.\nWorking through the night at his bedside table on phone and laptop, fueled by chai and using Chinese characters with the help of Google Translate, he plugged in “Mojiang”—the county where the mine was located—in combination with every other word he could think of that might be relevant, instantly translating each new flush of results back to English. “Mojiang + pneumonia”; “Mojiang + WIV”; “Mojiang + bats”; “Mojiang + SARS.” Each search brought back thousands of results and half a dozen different databases for journals, books, newspapers, master’s theses, doctoral dissertations. He combed through these results, night after night, but never found anything useful. When he ran out of energy, he broke for arcade games and more chai.\nHe was on the verge of calling it quits, he says, when he struck gold: a 60-page master’s thesis written by a student at Kunming Medical University in 2013 titled “The Analysis of 6 Patients with Severe Pneumonia Caused by Unknown Viruses.” In exhaustive detail, it described the conditions and step-by-step treatment of the miners. It named the suspected culprit: “Caused by SARS-like [coronavirus] from the Chinese horseshoe bat or other bats.”\nThis is a failure of scientistry as much as it is a failure of the media. Remember this in the future: neither the mainstream media nor the professional scientific community can be trusted to tell you the truth in any way, about\nanything\n. They will not even hesitate to directly lie to you, and will afterwards go to great lengths to mislead, to redirect, and to cover their tracks.\nDaszak and every other signatory of that February letter in\nThe Lancet\nshould have their funding pulled immediately. This illustrates why science is not only not the enemy of Christianity, but to the contrary, is dependent upon it. The method doesn’t mean a damn thing when the man utilizing it is corrupt.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-06-03T11:26:36+00:00"
}