{
  "url": "https://voxday.net/2021/06/24/gen-xs-music/",
  "scraped_at": "2026-01-08T12:39:06.775525",
  "title": "Gen X’s music",
  "date_display": "June 24, 2021",
  "date_iso": "2021-06-24T16:30:09+00:00",
  "date_from_url": "2021-06-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since we openly mock the Boomer obsession with their music, particularly the whole The Beatles are the greatest band in human history nonsense, it occurred to me to think about what music is most representational of, and influential for, my generation. Keep in mind that a generation’s music is not necessarily produced by its own members; John Lennon was not a Boomer, but The Beatles were most certainly not the Silent generation’s music. This is not a science of any kind, much less precise analytical engineering, but it’s surprisingly informative, as I think you’ll find if you contemplate the subject yourself.</p><p>Everyone knows that Gen X is generally considered to be prone to apathy and despair. But it also has a strain of resilience, and even irrational optimism, albeit an optimism in which it has no confidence. I think this is the result of the great disappointment of 1989-90, in which unexpected hope was rapidly transformed into disappointment and heightened cynicism after the fall of the Berlin Wall and the collapse of the Soviet Union did not prove to be harbingers of a better and more peaceful world.</p><p>I suspect one reason Generation X and the Zoomers will relate well is that both are heavily traumatized generations; Gen X by childhood divorce and the AIDS crisis, and Zoomers by the Covid-19 pandemic, which has been much harder on them than most people realize. But both generations are survivors at heart, which is a theme that persists through even Generation X’s happiest, poppiest melodies.</p><p>Anyhow, here’s my list of ten songs, in no particular order. I would include Prince’s <i>1999</i>, but that might be more of a Minnesota thing.</p><ul style=\"text-align: left;\"><li><i>I Ran</i>, A Flock of Seagulls. The first big musical departure plus a familiar lyrical theme.</li><li><i>In a Big Country</i>, Big Country. Too early and not popular enough to be THE Gen X song.</li><li><i>With Or Without You</i>, U2. Like them or not, U2 is the Gen X Beatles. I prefer <i>Streets </i>myself.</li><li><i>Right Here, Right Now</i>, Jesus Jones. It’s almost painful to recall that short-lived optimism now.</li><li><i>Smells Like Teen Spirit</i>, Nirvana. Musical and lyrical sarcasm plus the definitive Gen X lyric.</li><li><i>Blurry</i>, Puddle of Mudd. Exemplifies the Gen X perspective on divorce and children.</li><li><i>You Get What You Give</i>, New Radicals. The writer could be the generational poster boy.</li><li><i>Living on a Prayer</i>, Jon Bon Jovi. Sad, but true. I prefer Metallica, but we have to be honest.</li><li><i>Killing in the Name Of</i>, Rage Against the Machine. A succinct response to Boomer advice.</li><li><i>Loser</i>, Beck. Says it all in just six notes.</li></ul><div>Anyhow, your mileage may vary, but I think these 10 songs give about as good an idea of understanding the Gen X mentality as you’re going to get. This is not a list of my favorite music – there is no David Sylvian, Duran Duran, or Disturbed on it – but it’s music with which nearly everyone my age can more or less identify. There are some big names missing, but mostly for a reason. For example, there is no Madonna or Michael Jackson, but Jackson was a literal continuation of Boomer music while the closest Madonna ever got was actually down to William Orbit.</div><div>However, if I had to pick just one song, it wouldn’t be any of these. <strike>The one song that seems to combine all the emotional strains, including the contradictions, is <i>Semi-Charmed Life</i> by Third Eye Blind.</strike> Correction: it would HAVE to be <i>Epic </i>by Faith No More. No idea how I forgot that one.</div><div>On a tangential note, why did no one ever tell me that Razorfist used to play keyboards for Faith No More?</div><div>If New Radicals are more properly considered a Millennial band, I’d substitute <i>Alive and Kicking</i> by Simple Minds. It’s a good example of a borderline song, as the general theme is very GenX, but the music and the concept of “dreamer’s disease” lean Millennial.</div></div>",
  "content_text": "Since we openly mock the Boomer obsession with their music, particularly the whole The Beatles are the greatest band in human history nonsense, it occurred to me to think about what music is most representational of, and influential for, my generation. Keep in mind that a generation’s music is not necessarily produced by its own members; John Lennon was not a Boomer, but The Beatles were most certainly not the Silent generation’s music. This is not a science of any kind, much less precise analytical engineering, but it’s surprisingly informative, as I think you’ll find if you contemplate the subject yourself.\nEveryone knows that Gen X is generally considered to be prone to apathy and despair. But it also has a strain of resilience, and even irrational optimism, albeit an optimism in which it has no confidence. I think this is the result of the great disappointment of 1989-90, in which unexpected hope was rapidly transformed into disappointment and heightened cynicism after the fall of the Berlin Wall and the collapse of the Soviet Union did not prove to be harbingers of a better and more peaceful world.\nI suspect one reason Generation X and the Zoomers will relate well is that both are heavily traumatized generations; Gen X by childhood divorce and the AIDS crisis, and Zoomers by the Covid-19 pandemic, which has been much harder on them than most people realize. But both generations are survivors at heart, which is a theme that persists through even Generation X’s happiest, poppiest melodies.\nAnyhow, here’s my list of ten songs, in no particular order. I would include Prince’s\n1999\n, but that might be more of a Minnesota thing.\nI Ran\n, A Flock of Seagulls. The first big musical departure plus a familiar lyrical theme.\nIn a Big Country\n, Big Country. Too early and not popular enough to be THE Gen X song.\nWith Or Without You\n, U2. Like them or not, U2 is the Gen X Beatles. I prefer\nStreets\nmyself.\nRight Here, Right Now\n, Jesus Jones. It’s almost painful to recall that short-lived optimism now.\nSmells Like Teen Spirit\n, Nirvana. Musical and lyrical sarcasm plus the definitive Gen X lyric.\nBlurry\n, Puddle of Mudd. Exemplifies the Gen X perspective on divorce and children.\nYou Get What You Give\n, New Radicals. The writer could be the generational poster boy.\nLiving on a Prayer\n, Jon Bon Jovi. Sad, but true. I prefer Metallica, but we have to be honest.\nKilling in the Name Of\n, Rage Against the Machine. A succinct response to Boomer advice.\nLoser\n, Beck. Says it all in just six notes.\nAnyhow, your mileage may vary, but I think these 10 songs give about as good an idea of understanding the Gen X mentality as you’re going to get. This is not a list of my favorite music – there is no David Sylvian, Duran Duran, or Disturbed on it – but it’s music with which nearly everyone my age can more or less identify. There are some big names missing, but mostly for a reason. For example, there is no Madonna or Michael Jackson, but Jackson was a literal continuation of Boomer music while the closest Madonna ever got was actually down to William Orbit.\nHowever, if I had to pick just one song, it wouldn’t be any of these.\nThe one song that seems to combine all the emotional strains, including the contradictions, is\nSemi-Charmed Life\nby Third Eye Blind.\nCorrection: it would HAVE to be\nEpic\nby Faith No More. No idea how I forgot that one.\nOn a tangential note, why did no one ever tell me that Razorfist used to play keyboards for Faith No More?\nIf New Radicals are more properly considered a Millennial band, I’d substitute\nAlive and Kicking\nby Simple Minds. It’s a good example of a borderline song, as the general theme is very GenX, but the music and the concept of “dreamer’s disease” lean Millennial.",
  "tags": [
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-06-24T15:30:09+00:00"
}