{
  "url": "https://voxday.net/2021/06/05/jda-defeats-worldcon/",
  "scraped_at": "2026-01-08T12:35:48.728776",
  "title": "JDA defeats Worldcon",
  "date_display": "June 5, 2021",
  "date_iso": "2021-06-05T10:11:00+00:00",
  "date_from_url": "2021-06-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jon Del Arroz, Rislandia publisher, Arktoons contributor, and the Leading Hispanic Voice in Science Fiction, recently reached a settlement in his long-running legal dispute with Worldcon. For those of you who have no idea what that is, Worldcon is the organization of SJW science fiction fans that runs the annual convention that gives out the Hugo Awards.</p><p>Jon sent me an email to post here explaining what happened:</p><blockquote><p>In early 2017, Vox Day gave me a platform on this blog to speak the truth about how the science fiction publishing and fandom communities had become nothing more than toxic, gossip-filled political arms of the extreme Satanist, globalist elites. It was the first time I’d been unpersonned by SJWs trying to target me and my family over politics and he gave me the advice: “Learn to go public. One reason they get away with it is because everyone they do it to tries to keep it quiet. You shouldn’t.”</p><p>I named names, I exposed what was going on, and made a name for myself many of you know in science fiction and comics, of which I thank the readers of VP so much for your support over the years. It hasn’t been without its trials, however, the unpersoning continued with Worldcon 76 in San Jose, who banned me because I told them I had safety concerns about being physically attacked based on death threats made to me online, and they refused to even respond about assurances of security at their convention.</p><p>They took it a step further, going to their website and social media citing they were removing “racist bullying” from their convention, libeling me, a Hispanic man who is very proud of my heritage in the process.</p><p>I followed Vox’s lead and decided to fight it with everything I had. We filed suit for defamation and have been engaged in a long court battle for nearly 4 years. Finally, WorldCon opted to settle and wrote me a formal, public apology and gave us financial compensation:</p><p><i>SFSFC acknowledges the importance of reputation, especially for a relatively new author, and regrets that its public statement about barring his attendance might have led people unfamiliar with Mr. Del Arroz and his work to infer that he is or was a racist. For that, SFSFC apologizes. This attendance ban was specific to the Worldcon 76 events produced by SFSFC, and Mr. Del Arroz has the same opportunity as other members of the public to register for future SFSFC events. Worldcon 76 does not tolerate discrimination in any form — including through cosplay — based on but not limited to gender, race, ethnicity, religion, age, sexual orientation, gender identity, or physical/mental health conditions. SFSFC firmly believes that healthy political discourse requires active, mutual, good faith participation by members of the community with differing opinions.</i></p><p><i>Kevin Roche</i></p><p><i>Chair, Worldcon 76 in San Jose</i></p><p><i>President, San Francisco Science Fiction Conventions, Inc.</i></p><p>We are in dark times, but there is light and there is good. Even though it can seem overwhelming, you can fight the good fight, you can win. It isn’t easy, you can’t be low energy, and you must never concede, but know that truth will prevail. We follow the one true light of the world, our Lord Jesus Christ, and through him we will be his beacon and bring about his kingdom. It’s preordained. We have already won, and the lesson is to never be afraid of evil. Deus vult. </p></blockquote><p>The SJWs at File 770 <a href=\"http://file770.com/worldcon-76-settles-with-jon-del-arroz-issues-apology-will-pay-compensation/\" rel=\"noopener\" target=\"_blank\">are doing their thing</a>, attempting to transmogrify victory into defeat for Jon. Of course, being SJWs, they would deny that Jon won anything even if the entire Worldcon leadership was personally beheaded by the presiding judge and the entire contents of their meager bank accounts were presented to him on a golden platter.</p><p>Not every victory will be fast, flawless, or result in a large financial payout. Much more often, the best that one can reasonably expect to do is a public apology, a retreat from arbitration, the return of the filing fees, or the imposition of expenses that are essentially a rounding error to a massive corporation that one wouldn’t expect to even notice. But a victory is a victory, and more importantly, these victories stack over time to send a very strong message to everyone that converged individuals and organizations cannot continue to behave in the way they have been behaving.</p><p>Consider Amazon. Even mighty Amazon <a href=\"https://www.wsj.com/articles/amazon-faced-75-000-arbitration-demands-now-it-says-fine-sue-us-11622547000\" rel=\"noopener\" target=\"_blank\">had to drop its mandated arbitration policy</a>, and it now faces three class action lawsuits because <i>75,000 customers</i> brought consumer arbitrations against it. Each individual arbitration was a tiny drop in the bucket to the corporate giant, but collectively, they were enough to force Amazon to retreat and change its anti-consumer policies.</p></div>",
  "content_text": "Jon Del Arroz, Rislandia publisher, Arktoons contributor, and the Leading Hispanic Voice in Science Fiction, recently reached a settlement in his long-running legal dispute with Worldcon. For those of you who have no idea what that is, Worldcon is the organization of SJW science fiction fans that runs the annual convention that gives out the Hugo Awards.\nJon sent me an email to post here explaining what happened:\nIn early 2017, Vox Day gave me a platform on this blog to speak the truth about how the science fiction publishing and fandom communities had become nothing more than toxic, gossip-filled political arms of the extreme Satanist, globalist elites. It was the first time I’d been unpersonned by SJWs trying to target me and my family over politics and he gave me the advice: “Learn to go public. One reason they get away with it is because everyone they do it to tries to keep it quiet. You shouldn’t.”\nI named names, I exposed what was going on, and made a name for myself many of you know in science fiction and comics, of which I thank the readers of VP so much for your support over the years. It hasn’t been without its trials, however, the unpersoning continued with Worldcon 76 in San Jose, who banned me because I told them I had safety concerns about being physically attacked based on death threats made to me online, and they refused to even respond about assurances of security at their convention.\nThey took it a step further, going to their website and social media citing they were removing “racist bullying” from their convention, libeling me, a Hispanic man who is very proud of my heritage in the process.\nI followed Vox’s lead and decided to fight it with everything I had. We filed suit for defamation and have been engaged in a long court battle for nearly 4 years. Finally, WorldCon opted to settle and wrote me a formal, public apology and gave us financial compensation:\nSFSFC acknowledges the importance of reputation, especially for a relatively new author, and regrets that its public statement about barring his attendance might have led people unfamiliar with Mr. Del Arroz and his work to infer that he is or was a racist. For that, SFSFC apologizes. This attendance ban was specific to the Worldcon 76 events produced by SFSFC, and Mr. Del Arroz has the same opportunity as other members of the public to register for future SFSFC events. Worldcon 76 does not tolerate discrimination in any form — including through cosplay — based on but not limited to gender, race, ethnicity, religion, age, sexual orientation, gender identity, or physical/mental health conditions. SFSFC firmly believes that healthy political discourse requires active, mutual, good faith participation by members of the community with differing opinions.\nKevin Roche\nChair, Worldcon 76 in San Jose\nPresident, San Francisco Science Fiction Conventions, Inc.\nWe are in dark times, but there is light and there is good. Even though it can seem overwhelming, you can fight the good fight, you can win. It isn’t easy, you can’t be low energy, and you must never concede, but know that truth will prevail. We follow the one true light of the world, our Lord Jesus Christ, and through him we will be his beacon and bring about his kingdom. It’s preordained. We have already won, and the lesson is to never be afraid of evil. Deus vult.\nThe SJWs at File 770\nare doing their thing\n, attempting to transmogrify victory into defeat for Jon. Of course, being SJWs, they would deny that Jon won anything even if the entire Worldcon leadership was personally beheaded by the presiding judge and the entire contents of their meager bank accounts were presented to him on a golden platter.\nNot every victory will be fast, flawless, or result in a large financial payout. Much more often, the best that one can reasonably expect to do is a public apology, a retreat from arbitration, the return of the filing fees, or the imposition of expenses that are essentially a rounding error to a massive corporation that one wouldn’t expect to even notice. But a victory is a victory, and more importantly, these victories stack over time to send a very strong message to everyone that converged individuals and organizations cannot continue to behave in the way they have been behaving.\nConsider Amazon. Even mighty Amazon\nhad to drop its mandated arbitration policy\n, and it now faces three class action lawsuits because\n75,000 customers\nbrought consumer arbitrations against it. Each individual arbitration was a tiny drop in the bucket to the corporate giant, but collectively, they were enough to force Amazon to retreat and change its anti-consumer policies.",
  "tags": [
    "PinkSF"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-06-05T09:11:00+00:00"
}