{
  "url": "https://voxday.net/2021/06/06/not-one-cent-for-their-own/",
  "scraped_at": "2026-01-08T12:35:58.465268",
  "title": "Not one cent for their own",
  "date_display": "June 6, 2021",
  "date_iso": "2021-06-06T01:31:25+00:00",
  "date_from_url": "2021-06-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While media conservatives are giddy about the chance to financially support their political “opponents”.</p><blockquote><p>Matt Walsh@MattWalshBlog</p><p>As you’ve heard, @AOC’s abuela is living in a dilapidated home that was ravaged by Hurricane Maria. AOC is unable to help her own grandma for whatever reason, so I have set up this Go Fund Me campaign to save her home. Please give if you can. #HelpAbuela</p></blockquote><p>Cuckservatives love nothing better than to “surprise” people by materially supporting their enemies. Their primary objective is to be publicly seen as the nice people. As Stalin learned, the Left doesn’t even need to buy the rope with which to hang them, conservatives will literally give it to their would-be executioners for free.</p><p>Are you even a little bit surprised to learn that Ben Shapiro is pushing this idiocy too?</p><p><b>UPDATE: </b>For the benefit of those who are apparently too slow to understand that everyone here knows perfectly well what these moronic cucks were intending, we are aware the very clever plan is to OWN THE LIBS and MAKE THE DEMS LOOK LIKE HYPOCRITES! Our criticism is based on the fact that this objective is an unnecessary, pointless, and wasteful bit of grandstanding.</p></div>",
  "content_text": "While media conservatives are giddy about the chance to financially support their political “opponents”.\nMatt Walsh@MattWalshBlog\nAs you’ve heard, @AOC’s abuela is living in a dilapidated home that was ravaged by Hurricane Maria. AOC is unable to help her own grandma for whatever reason, so I have set up this Go Fund Me campaign to save her home. Please give if you can. #HelpAbuela\nCuckservatives love nothing better than to “surprise” people by materially supporting their enemies. Their primary objective is to be publicly seen as the nice people. As Stalin learned, the Left doesn’t even need to buy the rope with which to hang them, conservatives will literally give it to their would-be executioners for free.\nAre you even a little bit surprised to learn that Ben Shapiro is pushing this idiocy too?\nUPDATE:\nFor the benefit of those who are apparently too slow to understand that everyone here knows perfectly well what these moronic cucks were intending, we are aware the very clever plan is to OWN THE LIBS and MAKE THE DEMS LOOK LIKE HYPOCRITES! Our criticism is based on the fact that this objective is an unnecessary, pointless, and wasteful bit of grandstanding.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-06-06T00:31:25+00:00"
}