{
  "url": "https://voxday.net/2021/06/04/stalins-war-and-the-soviet-nazi-break/",
  "scraped_at": "2026-01-08T12:35:45.083094",
  "title": "Stalin’s War and the Soviet-Nazi break",
  "date_display": "June 4, 2021",
  "date_iso": "2021-06-04T15:47:32+00:00",
  "date_from_url": "2021-06-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.youtube.com/watch?v=FBRkVGpYZPg\" rel=\"noopener\" target=\"_blank\"> An interview with the author</a> of the highly recommended <i>Stalin’s War</i>:</p><blockquote><p>This is what I think one of the key discoveries that I made, although a few other historians have again tried to kind of guess at this they haven’t actually seen most of the files. The final break between Hitler and Stalin prior to what we now call Operation Barbarossa occurred over Balkan questions.  </p><p>There was this summit that has long been known about in Berlin, in November 1940. This is when Molotov went to meet with Hitler and Ribbentrop, and he also met Rudolf Hess, and Himmler, and all the other leading Nazis. It turned out that in fact the Germans thought the meetings had gone relatively well. They hadn’t agreed on everything, but they thought the meetings had been friendly.</p><p>We now know from Molotov’s own real-time telegraphic communications from Stalin that he and Stalin had in fact decided to break with Hitler even before the Germans broke with them. Stalin laid down what was in effect an ultimatum. Hitler had invited the Soviet Union to join the Tripartite Pact – they had restyled the old anti-Comintern pact with Italy, Germany, and Japan – so it’s now going to be restyled and the Soviets are invited to join.</p><p>Stalin insisted as a price of joining the Tripartite Pact that the Germans withdraw all of their troops from Finland and Romania, including military advisers, that Stalin be allowed to invade Bulgaria and to station troops at the Bosporus and the Dardanelles – that is to say the Turkish Straits. He was afraid of the British, he still saw the British as the enemy.</p><p>That’s one of the other really fascinating things that you see, if you actually read the real correspondence, is that Stalin before Barbarossa, and even to some extent after it and towards the end of the war, continued to view the Anglo-Saxons, as he called them, as his enemy. As he told Matsuoka, Japan’s foreign minister in April 1941 and also in their first meeting in March, he’d never viewed the Anglo-Saxons as his friends and he did not intend to befriend them now.</p><p>Now strangely enough, they had been wary of Stalin too, but then when Hitler does make this decision to invade, in part because of this break over the Balkans, in part because of Hitler’s own ideolog,  racial obsessions about <i>Lebensraum </i>and cleansing room for the German settlers in the east, it’s sort of like this act of almost diplomatic magic. There’s kind of a public relations miracle. To give you an idea of what I mean, even the Roosevelt administration, which had been relatively friendly vis-a-vis the Soviet Union, in the days before Barbarossa they had been about to expel Soviet spies, including aviation spies and experts who would actually burrow deeply into the U.S. aviation sector and were scheduled for deportation, relations were about to go into a deep freeze, suddenly – poof – everything vanishes!</p><p>Stalin is a hero, his peoples, they are heroes. Secretly at first, later, a fter November 1941 openly, Roosevelt opens the spigot of Lend-Lease aid to the Soviet Union and lavishes vast amounts of war materiel, industrial inputs, foodstuffs, boots, uniforms, you name it, it’s all given effectively for free to the Soviet Union.</p></blockquote><p>I very much recommend reading this book. The author apparently isn’t equipped to draw some of the obvious conclusions from his own observations and he doesn’t usually ask the obvious follow-on questions – for example, inquiring as to precisely which individuals in the USA were responsible for making that public relations miracle happen and how they did it – but that doesn’t lessen the importance of those well-documented observations in the slightest. </p></div>",
  "content_text": "An interview with the author\nof the highly recommended\nStalin’s War\n:\nThis is what I think one of the key discoveries that I made, although a few other historians have again tried to kind of guess at this they haven’t actually seen most of the files. The final break between Hitler and Stalin prior to what we now call Operation Barbarossa occurred over Balkan questions.\nThere was this summit that has long been known about in Berlin, in November 1940. This is when Molotov went to meet with Hitler and Ribbentrop, and he also met Rudolf Hess, and Himmler, and all the other leading Nazis. It turned out that in fact the Germans thought the meetings had gone relatively well. They hadn’t agreed on everything, but they thought the meetings had been friendly.\nWe now know from Molotov’s own real-time telegraphic communications from Stalin that he and Stalin had in fact decided to break with Hitler even before the Germans broke with them. Stalin laid down what was in effect an ultimatum. Hitler had invited the Soviet Union to join the Tripartite Pact – they had restyled the old anti-Comintern pact with Italy, Germany, and Japan – so it’s now going to be restyled and the Soviets are invited to join.\nStalin insisted as a price of joining the Tripartite Pact that the Germans withdraw all of their troops from Finland and Romania, including military advisers, that Stalin be allowed to invade Bulgaria and to station troops at the Bosporus and the Dardanelles – that is to say the Turkish Straits. He was afraid of the British, he still saw the British as the enemy.\nThat’s one of the other really fascinating things that you see, if you actually read the real correspondence, is that Stalin before Barbarossa, and even to some extent after it and towards the end of the war, continued to view the Anglo-Saxons, as he called them, as his enemy. As he told Matsuoka, Japan’s foreign minister in April 1941 and also in their first meeting in March, he’d never viewed the Anglo-Saxons as his friends and he did not intend to befriend them now.\nNow strangely enough, they had been wary of Stalin too, but then when Hitler does make this decision to invade, in part because of this break over the Balkans, in part because of Hitler’s own ideolog,  racial obsessions about\nLebensraum\nand cleansing room for the German settlers in the east, it’s sort of like this act of almost diplomatic magic. There’s kind of a public relations miracle. To give you an idea of what I mean, even the Roosevelt administration, which had been relatively friendly vis-a-vis the Soviet Union, in the days before Barbarossa they had been about to expel Soviet spies, including aviation spies and experts who would actually burrow deeply into the U.S. aviation sector and were scheduled for deportation, relations were about to go into a deep freeze, suddenly – poof – everything vanishes!\nStalin is a hero, his peoples, they are heroes. Secretly at first, later, a fter November 1941 openly, Roosevelt opens the spigot of Lend-Lease aid to the Soviet Union and lavishes vast amounts of war materiel, industrial inputs, foodstuffs, boots, uniforms, you name it, it’s all given effectively for free to the Soviet Union.\nI very much recommend reading this book. The author apparently isn’t equipped to draw some of the obvious conclusions from his own observations and he doesn’t usually ask the obvious follow-on questions – for example, inquiring as to precisely which individuals in the USA were responsible for making that public relations miracle happen and how they did it – but that doesn’t lessen the importance of those well-documented observations in the slightest.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-06-04T14:47:32+00:00"
}