{
  "url": "https://voxday.net/2021/06/14/the-new-power-pyramid/",
  "scraped_at": "2026-01-08T12:37:21.544041",
  "title": "The new power pyramid",
  "date_display": "June 14, 2021",
  "date_iso": "2021-06-14T10:41:03+00:00",
  "date_from_url": "2021-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t put a lot of credence in Sorcha Faal’s dramatic reports, but this analysis of <a href=\"https://www.whatdoesitmean.com/index3596.htm\" rel=\"noopener\" target=\"_blank\">the transformation from a global monopower to a tripartite system</a> in which China plays the leading role strikes me as highly credible:</p><blockquote><p>American efforts to undermine Russia-China partnership are doomed to fail because Washington doesn’t understand Moscow’s concerns.</p><p>The US is increasingly worried that Russia and China are forging a strong new strategic partnership. With Moscow and Beijing aligning their foreign policy stances, the relationship now seems to be an alliance in all but name.</p><p>It was initially expected that the Russian-Chinese partnership would run aground over Beijing’s economic ambitions in Central Asia. China is evidently the more powerful economy in the partnership with Russia, and those kinds of asymmetries create certain limitations.</p><p>Moscow accepts Chinese leadership but rejects Chinese dominance.</p><p>Thus, if China chooses the “first among equals” principle, the partnership will prove to be durable and Moscow can make its peace with playing second fiddle in economic affairs to the world’s most populous nation.</p><p>To date, China has not tried to make use of those asymmetries with Russia.</p><p>Unlike Washington’s efforts to peel Russia away from its neighbours in Eastern Europe and Central Asia, Beijing has avoided these kinds of schemes and instead worked towards accommodating Russian strategic interests.</p><p>Simply put, it is not in China’s interest to abandon its “first among equals” position in favour of unipolar ambitions. Russia is an indispensable partner for China to establish an economic leadership position in the Greater Eurasian region.</p><p>In a multipolar world, Moscow can adopt a swing power position and pivot to other centres of power if Beijing starts aspiring to move beyond leadership, in order to try and dominate.</p></blockquote><p>The US domination of Europe is officially over. Despite its best efforts, the US could not convince Europeans to stop the Nord Stream natural gas pipeline from Russia to Germany. And those who have read <i>Corporate Cancer</i> will understand the significance of the fact that one of the leading sponsors of Euro 2020, whose TV ads are running frequently before the matches, is Alipay.</p><p>If Russia is content to play second fiddle to China – and there is every sign that it is, due to the way the USA has waged economic war on Russia over the last decade – the USA will not only lose its premier global position, but soon find itself demoted to the number three world power when it loses its Western European economic force multiplier. This is good news, as it will give actual Americans a better chance to take back control in their own country.</p><p>Meanwhile, as China courts Russia, the USA continues to ineffectually try <a href=\"https://www.rt.com/business/526497-us-sanctions-russian-debt-bonds/\" rel=\"noopener\" target=\"_blank\">to impose its will</a>:</p><blockquote><p>The ban on purchasing Russia’s sovereign debt by US investors introduced by Washington earlier this year came into force on Monday. In April, US President Joe Biden signed an executive order authorizing the imposition of yet more restrictions. The move signaled a further expansion of Washington’s existing sanctions policy on Moscow, which is aimed at cutting off Russia from the global financial markets.</p></blockquote><p>This idiocy is almost certainly going to boomerang on the neo-liberal world order, as the countries of the world will react to Russia’s financial deplatforming in much the same way that consumers concerned about being deplatformed by Paypal are turning to new alternatives with relief and gratitude. </p></div>",
  "content_text": "I don’t put a lot of credence in Sorcha Faal’s dramatic reports, but this analysis of\nthe transformation from a global monopower to a tripartite system\nin which China plays the leading role strikes me as highly credible:\nAmerican efforts to undermine Russia-China partnership are doomed to fail because Washington doesn’t understand Moscow’s concerns.\nThe US is increasingly worried that Russia and China are forging a strong new strategic partnership. With Moscow and Beijing aligning their foreign policy stances, the relationship now seems to be an alliance in all but name.\nIt was initially expected that the Russian-Chinese partnership would run aground over Beijing’s economic ambitions in Central Asia. China is evidently the more powerful economy in the partnership with Russia, and those kinds of asymmetries create certain limitations.\nMoscow accepts Chinese leadership but rejects Chinese dominance.\nThus, if China chooses the “first among equals” principle, the partnership will prove to be durable and Moscow can make its peace with playing second fiddle in economic affairs to the world’s most populous nation.\nTo date, China has not tried to make use of those asymmetries with Russia.\nUnlike Washington’s efforts to peel Russia away from its neighbours in Eastern Europe and Central Asia, Beijing has avoided these kinds of schemes and instead worked towards accommodating Russian strategic interests.\nSimply put, it is not in China’s interest to abandon its “first among equals” position in favour of unipolar ambitions. Russia is an indispensable partner for China to establish an economic leadership position in the Greater Eurasian region.\nIn a multipolar world, Moscow can adopt a swing power position and pivot to other centres of power if Beijing starts aspiring to move beyond leadership, in order to try and dominate.\nThe US domination of Europe is officially over. Despite its best efforts, the US could not convince Europeans to stop the Nord Stream natural gas pipeline from Russia to Germany. And those who have read\nCorporate Cancer\nwill understand the significance of the fact that one of the leading sponsors of Euro 2020, whose TV ads are running frequently before the matches, is Alipay.\nIf Russia is content to play second fiddle to China – and there is every sign that it is, due to the way the USA has waged economic war on Russia over the last decade – the USA will not only lose its premier global position, but soon find itself demoted to the number three world power when it loses its Western European economic force multiplier. This is good news, as it will give actual Americans a better chance to take back control in their own country.\nMeanwhile, as China courts Russia, the USA continues to ineffectually try\nto impose its will\n:\nThe ban on purchasing Russia’s sovereign debt by US investors introduced by Washington earlier this year came into force on Monday. In April, US President Joe Biden signed an executive order authorizing the imposition of yet more restrictions. The move signaled a further expansion of Washington’s existing sanctions policy on Moscow, which is aimed at cutting off Russia from the global financial markets.\nThis idiocy is almost certainly going to boomerang on the neo-liberal world order, as the countries of the world will react to Russia’s financial deplatforming in much the same way that consumers concerned about being deplatformed by Paypal are turning to new alternatives with relief and gratitude.",
  "tags": [
    "Russia"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-06-14T09:41:03+00:00"
}