{
  "url": "https://voxday.net/2021/06/20/the-correct-word/",
  "scraped_at": "2026-01-08T12:38:23.673326",
  "title": "The correct word",
  "date_display": "June 20, 2021",
  "date_iso": "2021-06-20T16:00:04+00:00",
  "date_from_url": "2021-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A spade should always be called a spade. And those who engage in foolish behavior and make foolish choices are accurately described as fools. There is absolutely no excuse <a href=\"https://www.bitchute.com/video/fozbptI3ArJk/\" rel=\"noopener\" target=\"_blank\">for getting not-vaxxed</a>; the information is available and anyone who believes a single word of the mainstream media hasn’t been paying attention since William Randolph Hearst was lying about the Spanish sinking the <i>USS Maine</i>:</p><div><blockquote><p>She is being called a sheep. She did her research, she watched other people get the shot and they were fine (aren’t we all different) and so on. She did it to “help the community”. The road to hell is paved with good intentions. Those mocking her may want to go easy. I don’t think any of us are going to get out of this.</p></blockquote><p>There is tremendous social and media pressure on people to have their messenger RNA modified with experimental substances. So, the way to alleviate that pressure is to counteract it with effective rhetoric, which will involve coming down hard on every single individual who gives into the pressure, and making poster boys and girls of those who experience the adverse effects.</p><p>Those who can still be saved from the not-vaxxes should be the primary concern, not those who have already been victimized by them as a result of their tragic credulity. Defending the behavior of the sheep is only going to result in more sheep, and more victims.</p></div></div>",
  "content_text": "A spade should always be called a spade. And those who engage in foolish behavior and make foolish choices are accurately described as fools. There is absolutely no excuse\nfor getting not-vaxxed\n; the information is available and anyone who believes a single word of the mainstream media hasn’t been paying attention since William Randolph Hearst was lying about the Spanish sinking the\nUSS Maine\n:\nShe is being called a sheep. She did her research, she watched other people get the shot and they were fine (aren’t we all different) and so on. She did it to “help the community”. The road to hell is paved with good intentions. Those mocking her may want to go easy. I don’t think any of us are going to get out of this.\nThere is tremendous social and media pressure on people to have their messenger RNA modified with experimental substances. So, the way to alleviate that pressure is to counteract it with effective rhetoric, which will involve coming down hard on every single individual who gives into the pressure, and making poster boys and girls of those who experience the adverse effects.\nThose who can still be saved from the not-vaxxes should be the primary concern, not those who have already been victimized by them as a result of their tragic credulity. Defending the behavior of the sheep is only going to result in more sheep, and more victims.",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-06-20T15:00:04+00:00"
}