{
  "url": "https://voxday.net/2021/06/20/wicked-to-the-end/",
  "scraped_at": "2026-01-08T12:38:17.918084",
  "title": "Wicked to the end",
  "date_display": "June 20, 2021",
  "date_iso": "2021-06-20T00:03:57+00:00",
  "date_from_url": "2021-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This comment should prove educational for those who believe the younger generations are being too hard on the Boomers.</p><blockquote><p>Early Boomer here, Thank You, Knowing that I have in some way Triggered whatever it is you are makes me feel that the pain and suffering I have left in my wake justifies the entire adventure.</p></blockquote><p>They’ve earned their legacy. They fully merit history’s condemnation.</p><p>2/5 Pillows.</p><p>Speaking of Boomer wickedness, when abortion was legalized in 1973, the percentage of abortions to total pregnancies was 19.3. That percentage rose rapidly and peaked at 30.4 in 1982, the year that the last of the Boomers turned 18. That number gradually declined as Boomer women aged to menopause, and now that the Boomers can no longer get pregnant, the abortion percentage is <i>lower than when it was first legalized</i>, at 18.3 per 100 pregnancies.</p><p>That’s still 18.3 percent too high, of course, but it offers clear statistical evidence that the Boomers, as a generation, were considerably more wicked than their successors. Of course, not murdering one-third of your children is not a particularly high bar to clear.</p><p>Everyone knows that Boomers divorce at spectacularly high rates, but interestingly enough, Boomers also appear to commit suicide at a higher rate than Generation X, which is not at all what I would have expected given that our generational sins tend toward apathy, anger, and despair.</p><blockquote><p>CDC officials emphasized that the Baby Boomer generation is witnessing the highest increase in suicides (A Baby Boomer is a person who was born post-World War II, between the years 1946 and 1964, when the annual birthrate increased dramatically in the US). “It is the Baby Boomer group where we see the highest rates of suicide,” CDC deputy director, Dr. Ileana Arias, told the <i>New York Times</i>. “There may be something about that group, and how they think about life issues and their life choices that may make a difference.”</p></blockquote><p>And that was eight years ago. Since then, the suicide rate among the 55+ crowd has risen by two percent. Apparently pride and materialism are an even more lethal combination than despair.</p></div>",
  "content_text": "This comment should prove educational for those who believe the younger generations are being too hard on the Boomers.\nEarly Boomer here, Thank You, Knowing that I have in some way Triggered whatever it is you are makes me feel that the pain and suffering I have left in my wake justifies the entire adventure.\nThey’ve earned their legacy. They fully merit history’s condemnation.\n2/5 Pillows.\nSpeaking of Boomer wickedness, when abortion was legalized in 1973, the percentage of abortions to total pregnancies was 19.3. That percentage rose rapidly and peaked at 30.4 in 1982, the year that the last of the Boomers turned 18. That number gradually declined as Boomer women aged to menopause, and now that the Boomers can no longer get pregnant, the abortion percentage is\nlower than when it was first legalized\n, at 18.3 per 100 pregnancies.\nThat’s still 18.3 percent too high, of course, but it offers clear statistical evidence that the Boomers, as a generation, were considerably more wicked than their successors. Of course, not murdering one-third of your children is not a particularly high bar to clear.\nEveryone knows that Boomers divorce at spectacularly high rates, but interestingly enough, Boomers also appear to commit suicide at a higher rate than Generation X, which is not at all what I would have expected given that our generational sins tend toward apathy, anger, and despair.\nCDC officials emphasized that the Baby Boomer generation is witnessing the highest increase in suicides (A Baby Boomer is a person who was born post-World War II, between the years 1946 and 1964, when the annual birthrate increased dramatically in the US). “It is the Baby Boomer group where we see the highest rates of suicide,” CDC deputy director, Dr. Ileana Arias, told the\nNew York Times\n. “There may be something about that group, and how they think about life issues and their life choices that may make a difference.”\nAnd that was eight years ago. Since then, the suicide rate among the 55+ crowd has risen by two percent. Apparently pride and materialism are an even more lethal combination than despair.",
  "tags": [
    "BabyBoomers"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-06-19T23:03:57+00:00"
}