{
  "url": "https://voxday.net/2021/06/28/yes-youre-the-baddies/",
  "scraped_at": "2026-01-08T12:39:38.392775",
  "title": "Yes, you’re the baddies",
  "date_display": "June 28, 2021",
  "date_iso": "2021-06-28T09:53:49+00:00",
  "date_from_url": "2021-06-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A popular English comedy sketch once featured a pair of SS officers wondering if perhaps <a href=\"https://www.youtube.com/watch?v=hn1VxaMEjRU\" rel=\"noopener\" target=\"_blank\">they might be the bad guys</a>, what with the skulls on their hats and all. In like manner, US troops should understand by now that <a href=\"https://www.rt.com/news/527742-biden-strike-iraq-syria-border/\" rel=\"noopener\" target=\"_blank\">they are not the good guys</a> in the Middle East:</p><blockquote><p>The US executed a number of strikes on targeted facilities “utilized by Iran-backed militias” that were allegedly used to launch drone attacks against American personnel, the Department of Defense announced on Sunday.</p><p>“At President Biden’s direction, US military forces earlier this evening conducted defensive precision airstrikes against facilities used by Iran-backed militia groups in the Iraq-Syria border region,” Pentagon Press Secretary John Kirby said in a statement.</p><p>“The targets were selected because these facilities are utilized by Iran-backed militias that are engaged in unmanned aerial vehicle (UAV) attacks against US personnel and facilities in Iraq.”</p><p>Kirby insisted that the US “took necessary, appropriate, and deliberate action designed to limit the risk of escalation” after noting that the American military is in Iraq “at the invitation of the government of Iraq for the sole purpose of assisting the Iraqi Security Forces in their efforts to defeat ISIS.”</p></blockquote><p>So, not only is the US military actively attacking two countries with whom the USA is not at war, but the Pentagon is lying about the military having permission to be in one of them. That invitation was not permanent, it was issued under duress, and furthermore, the Iraqi parliament voted to expel US troops from the country more than 18 months ago.</p><p>It’s ironic that these attacks have taken place while the neocons are still attempting to create a <i>casus belli</i> out of Crimea, where the mostly Russian population overwhelmingly voted to confirm its annexation by Russia. Whatever happened to the oft-proclaimed US interest in democratic self-determination in Syria, Iraq, and Crimea? These media posturings may be psychological operations meant to pervert the perception of reality by the US citizenry, but they are incompetent, obvious, and hypocritical, and do not change the fact of which party is obviously in the wrong.</p></div>",
  "content_text": "A popular English comedy sketch once featured a pair of SS officers wondering if perhaps\nthey might be the bad guys\n, what with the skulls on their hats and all. In like manner, US troops should understand by now that\nthey are not the good guys\nin the Middle East:\nThe US executed a number of strikes on targeted facilities “utilized by Iran-backed militias” that were allegedly used to launch drone attacks against American personnel, the Department of Defense announced on Sunday.\n“At President Biden’s direction, US military forces earlier this evening conducted defensive precision airstrikes against facilities used by Iran-backed militia groups in the Iraq-Syria border region,” Pentagon Press Secretary John Kirby said in a statement.\n“The targets were selected because these facilities are utilized by Iran-backed militias that are engaged in unmanned aerial vehicle (UAV) attacks against US personnel and facilities in Iraq.”\nKirby insisted that the US “took necessary, appropriate, and deliberate action designed to limit the risk of escalation” after noting that the American military is in Iraq “at the invitation of the government of Iraq for the sole purpose of assisting the Iraqi Security Forces in their efforts to defeat ISIS.”\nSo, not only is the US military actively attacking two countries with whom the USA is not at war, but the Pentagon is lying about the military having permission to be in one of them. That invitation was not permanent, it was issued under duress, and furthermore, the Iraqi parliament voted to expel US troops from the country more than 18 months ago.\nIt’s ironic that these attacks have taken place while the neocons are still attempting to create a\ncasus belli\nout of Crimea, where the mostly Russian population overwhelmingly voted to confirm its annexation by Russia. Whatever happened to the oft-proclaimed US interest in democratic self-determination in Syria, Iraq, and Crimea? These media posturings may be psychological operations meant to pervert the perception of reality by the US citizenry, but they are incompetent, obvious, and hypocritical, and do not change the fact of which party is obviously in the wrong.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-06-28T08:53:49+00:00"
}