{
  "url": "https://voxday.net/2023/01/06/gammastalking-or-gangstalking/",
  "scraped_at": "2026-01-08T13:43:32.667322",
  "title": "Gammastalking or Gangstalking?",
  "date_display": "January 6, 2023",
  "date_iso": "2023-01-06T16:26:31+00:00",
  "date_from_url": "2023-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In case you don’t understand why you should never, ever, permit Gamma males anywhere within 10 miles of your family, your social circle, or your organization, this account of a long-term, extensive harassment campaign of a young homesteading family should suffice to convince you. Gammas are delusional and psychologically disturbed low-status creatures who absolutely merit all of the contempt and disgust in which they are held by women and ordinary men… but some of them may be little more than puppets for something even worse.</p><p><a href=\"https://www.youtube.com/watch?v=B3mR3L89M9k\">The experience of this couple</a> with a popular YouTube channel with 536k subscribers demonstrates that the behavior of the secret kings can be considerably worse than anything Owen or I have yet experienced, but this behavior differs primarily in the extent to which the Gammas responsible took it, because the pattern of harassment and stalking is almost exactly the same. It also demonstrates the importance of providing your local police with an extensive record of their behavior, both legal and criminal, complete with all of their posts, pictures, and identifications, both real and pseudonymous, to establish the pattern for when one of the more deranged among them eventually crosses an actionable line.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Seven years ago we moved to a rural property to learn how to become more self-sufficient and build a custom home our dream home by ourselves with our own two hands and try to become debt free. It felt right to document the journey and our hopes was that maybe we could do so in a way that would inspire other people to take action in their own lives.</p><p>Our channel shared a wholesome and positive story and rapidly grew. During the course of our home building projects as we were working on our home and our property busily, there were problems brewing underneath the surface. At first we experienced the typical mean comments, which are usually pretty benign and every creator deals with, and basic moderation tools take care of this. At some point a small but very cancerous group of people started watching our Channel and using the comments section of our latest videos to recruit viewers off of YouTube to their own private group using a story like we’re fake, we don’t live in our own house, our child died, we died, we sold our property, with a little Google research I was able to find their place now for sale, there was a rumor that they didn’t even live at their house, those types of things, and the only limit is your imagination.</p><p>These were the kinds of stories they came up with, and their own groups were a private place where they could control the narrative unmoderated. While we were actually busy building our property, our home, and creating, these people have seemingly bottomless time to stir up negativity. They did this across  numerous platforms, trying to stalk us and harass us. At first digitally, next they began digging through all available public records. Let me read to you a few things that they started digging for, they started digging through our internet history, public records, family history, employment history, past friends, business associates, criminal records, family criminal records, and any other publicly available piece of information that they could find about us. And as if that’s not really creepy enough, then they took the time and energy to compile all of that information into a mega document that people could download and read pretty much our entire life story whether we wanted it shared or not.</p><p>This group of people escalated and they started trying to coordinate attacks on our channel, such as stealing and trying to monetize our content, they created 3D rendering videos of our house and of us, mocking us as people and they created look-alike accounts on numerous platforms impersonating us, trying to trick naive people into thinking that we’re engaged in some really nasty and questionable behavior. They were actively recruiting across numerous channels, numerous platforms, trying to get people to join their digital crusade.</p><p>The problem with nefarious people when there’s no consequences is they tend to get more bold and they escalate their behavior, especially when there’s neurotic people who are either coordinating or egging them on, but eventually the group activity could no longer just be constrained to the Internet, it had to move to real life. People suggested getting together to fly drones over our house, we received death threats, people were following us in real time to see where we go and what our activities are, family members were contacted to see if anyone would out us for being the frauds that we are, people threatened to vandalize their airplane as well as track its every movement in real time, next they started working very hard to make sure as many people as possible know exactly where we live even though we never made that information public. They placed a Google pin on our house so that anybody with normal curiosity could find out the exact location of our home.</p></blockquote><p>It all sounds extraordinarily familiar, doesn’t it. The pattern is so consistent that it increasingly appears to be inorganic, at least in the more developed stages. At this point, it wouldn’t be at all surprising to eventually learn that certain individuals in groups like the Gamma Secret Kings <a href=\"https://www.reddit.com/r/gammasecretkings/\">on Reddit</a> or this family’s YouTube channel stalkers are utilized, if not directly employed, by the Surveillance State, playing a role similar to the one Ray Epps did among the January 6th protesters. As with the Twitter-bot operators and the Hasbara propagandists, the reason some of these professional Gammas have “seemingly bottomless time to stir up negativity” is that they are quite literally paid to harass people online.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-56510\" decoding=\"async\" fetchpriority=\"high\" height=\"381\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/01/image-7.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/01/image-7.png 512w, https://voxday.net/wp-content/uploads/2023/01/image-7-300x223.png 300w\" width=\"512\"/></figure></div><p>It’s hard to distinguish between the paid professional and the amateur obsessive due to the way in which the former mimics the latter, but regardless, there is observably a point at which what initially appears to be little more than a creepy Gamma obsession is transformed into full-blown professional gangstalking.</p><p><strong>UPDATE: </strong>Even a hand-built log cabin deep in the middle of the woods <a href=\"https://www.youtube.com/watch?v=gGbxhM7fv0I\">can’t ensure one’s privacy</a> or protection from the Stalkerstasi.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>These people were targeting me specifically because of my YouTube channel. They were harassing me to the point that the police threatened them with criminal harassment if they did it again. They had recording equipment and some kind of audio recording equipment set up across from my driveway<br/>recording my comings and goings, and that of my family. We don’t know what this person’s doing with this footage or this audio, and it’s very creepy and concerning.</p> <cite>Shawn James, 342k subscribers</cite></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/82329c31-70f0-401f-88b2-54275b07ed4c\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "In case you don’t understand why you should never, ever, permit Gamma males anywhere within 10 miles of your family, your social circle, or your organization, this account of a long-term, extensive harassment campaign of a young homesteading family should suffice to convince you. Gammas are delusional and psychologically disturbed low-status creatures who absolutely merit all of the contempt and disgust in which they are held by women and ordinary men… but some of them may be little more than puppets for something even worse.\nThe experience of this couple\nwith a popular YouTube channel with 536k subscribers demonstrates that the behavior of the secret kings can be considerably worse than anything Owen or I have yet experienced, but this behavior differs primarily in the extent to which the Gammas responsible took it, because the pattern of harassment and stalking is almost exactly the same. It also demonstrates the importance of providing your local police with an extensive record of their behavior, both legal and criminal, complete with all of their posts, pictures, and identifications, both real and pseudonymous, to establish the pattern for when one of the more deranged among them eventually crosses an actionable line.\nSeven years ago we moved to a rural property to learn how to become more self-sufficient and build a custom home our dream home by ourselves with our own two hands and try to become debt free. It felt right to document the journey and our hopes was that maybe we could do so in a way that would inspire other people to take action in their own lives.\nOur channel shared a wholesome and positive story and rapidly grew. During the course of our home building projects as we were working on our home and our property busily, there were problems brewing underneath the surface. At first we experienced the typical mean comments, which are usually pretty benign and every creator deals with, and basic moderation tools take care of this. At some point a small but very cancerous group of people started watching our Channel and using the comments section of our latest videos to recruit viewers off of YouTube to their own private group using a story like we’re fake, we don’t live in our own house, our child died, we died, we sold our property, with a little Google research I was able to find their place now for sale, there was a rumor that they didn’t even live at their house, those types of things, and the only limit is your imagination.\nThese were the kinds of stories they came up with, and their own groups were a private place where they could control the narrative unmoderated. While we were actually busy building our property, our home, and creating, these people have seemingly bottomless time to stir up negativity. They did this across  numerous platforms, trying to stalk us and harass us. At first digitally, next they began digging through all available public records. Let me read to you a few things that they started digging for, they started digging through our internet history, public records, family history, employment history, past friends, business associates, criminal records, family criminal records, and any other publicly available piece of information that they could find about us. And as if that’s not really creepy enough, then they took the time and energy to compile all of that information into a mega document that people could download and read pretty much our entire life story whether we wanted it shared or not.\nThis group of people escalated and they started trying to coordinate attacks on our channel, such as stealing and trying to monetize our content, they created 3D rendering videos of our house and of us, mocking us as people and they created look-alike accounts on numerous platforms impersonating us, trying to trick naive people into thinking that we’re engaged in some really nasty and questionable behavior. They were actively recruiting across numerous channels, numerous platforms, trying to get people to join their digital crusade.\nThe problem with nefarious people when there’s no consequences is they tend to get more bold and they escalate their behavior, especially when there’s neurotic people who are either coordinating or egging them on, but eventually the group activity could no longer just be constrained to the Internet, it had to move to real life. People suggested getting together to fly drones over our house, we received death threats, people were following us in real time to see where we go and what our activities are, family members were contacted to see if anyone would out us for being the frauds that we are, people threatened to vandalize their airplane as well as track its every movement in real time, next they started working very hard to make sure as many people as possible know exactly where we live even though we never made that information public. They placed a Google pin on our house so that anybody with normal curiosity could find out the exact location of our home.\nIt all sounds extraordinarily familiar, doesn’t it. The pattern is so consistent that it increasingly appears to be inorganic, at least in the more developed stages. At this point, it wouldn’t be at all surprising to eventually learn that certain individuals in groups like the Gamma Secret Kings\non Reddit\nor this family’s YouTube channel stalkers are utilized, if not directly employed, by the Surveillance State, playing a role similar to the one Ray Epps did among the January 6th protesters. As with the Twitter-bot operators and the Hasbara propagandists, the reason some of these professional Gammas have “seemingly bottomless time to stir up negativity” is that they are quite literally paid to harass people online.\nIt’s hard to distinguish between the paid professional and the amateur obsessive due to the way in which the former mimics the latter, but regardless, there is observably a point at which what initially appears to be little more than a creepy Gamma obsession is transformed into full-blown professional gangstalking.\nUPDATE:\nEven a hand-built log cabin deep in the middle of the woods\ncan’t ensure one’s privacy\nor protection from the Stalkerstasi.\nThese people were targeting me specifically because of my YouTube channel. They were harassing me to the point that the police threatened them with criminal harassment if they did it again. They had recording equipment and some kind of audio recording equipment set up across from my driveway\nrecording my comings and goings, and that of my family. We don’t know what this person’s doing with this footage or this audio, and it’s very creepy and concerning.\nShawn James, 342k subscribers\nDISCUSS ON SG",
  "tags": [
    "Gamma",
    "SSH"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-01-06T18:34:31+00:00"
}