{
  "url": "https://voxday.net/2023/01/23/hes-leading-the-parade/",
  "scraped_at": "2026-01-08T13:45:16.885174",
  "title": "Category Errors",
  "date_display": "January 23, 2023",
  "date_iso": "2023-01-23T11:00:35+00:00",
  "date_from_url": "2023-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s hilarious to see what happens when people jump in well after the fact and attempt to explain some of the ideas that they find intriguing. All too often, their need to delude themselves about reality in order to redefine themselves as winners inevitably causes them <a href=\"https://www.coaching-online.org/gamma-male/\">to get things significantly and observably wrong</a>. For example, this guy’s attempt to describe Deltas in a way that would appear to indicate them having a lower social status than Gammas is particularly egregious.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>What Is A Delta Male?</strong></p><p>Delta males really don’t bring much to the table at all.</p><p>They are characterised for having no interest in achievement or self-improvement. Often, they are mentally and physically sloppy.</p><p>They’re insecure around women, because they’ve spent most of their life being rejected by them. That’s assuming they ever had the courage to speak to them at all.</p><p>Sadly, it’s widely agreed that the majority of men are delta males.</p><p>Delta males can be resentful of others, seeing as they don’t get a lot out of life, although this isn’t a staple part of their character.</p></blockquote><p>The only two correct elements here are the Delta insecurity around women and the fact that they make up the majority of men. Literally everything else is not only wrong, but wildly wrong, to such an extent that it indicates the author doesn’t even understand why “Delta” was chosen to identify the particular behavioral pattern. Deltas not only bring a lot to the table, they are the bedrock of all civilization. They are literally the most necessary of all behavioral patterns, and society needs more of them, not less.</p><p>This miss on the Delta is a little strange, because the guy did a pretty good job addressing some of the other categories.</p><p>While I appreciate the high level of interest shown in the concepts of the socio-sexual hierarchy, and I’m glad so many people find them useful and intriguing, I find it amazing that some individuals keep attempting to change things and modify them in ways that can’t possibly help anyone utilize what is a fairly simple analytical tool and primarily serves to muddy the waters.</p><p>I really have to write the SSH book as soon as I’m done with <em>A SEA OF SKULLS.</em></p><p><strong>UPDATE: </strong>Oh, <a href=\"https://www.coaching-online.org/sigma-female/\">for crying out loud</a>. The guy is even attempting to describe female patterns of behavior in terms of male patterns of behavior. This is beyond retarded. Attempting to apply the SSH to women is akin to trying to categorize them on the basis of their penis sizes. It’s a fundamental category error.</p><p><em><a href=\"https://social.infogalactic.com/micropost/b09a53d2-562d-44ed-a836-1a295ef29fa3\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s hilarious to see what happens when people jump in well after the fact and attempt to explain some of the ideas that they find intriguing. All too often, their need to delude themselves about reality in order to redefine themselves as winners inevitably causes them\nto get things significantly and observably wrong\n. For example, this guy’s attempt to describe Deltas in a way that would appear to indicate them having a lower social status than Gammas is particularly egregious.\nWhat Is A Delta Male?\nDelta males really don’t bring much to the table at all.\nThey are characterised for having no interest in achievement or self-improvement. Often, they are mentally and physically sloppy.\nThey’re insecure around women, because they’ve spent most of their life being rejected by them. That’s assuming they ever had the courage to speak to them at all.\nSadly, it’s widely agreed that the majority of men are delta males.\nDelta males can be resentful of others, seeing as they don’t get a lot out of life, although this isn’t a staple part of their character.\nThe only two correct elements here are the Delta insecurity around women and the fact that they make up the majority of men. Literally everything else is not only wrong, but wildly wrong, to such an extent that it indicates the author doesn’t even understand why “Delta” was chosen to identify the particular behavioral pattern. Deltas not only bring a lot to the table, they are the bedrock of all civilization. They are literally the most necessary of all behavioral patterns, and society needs more of them, not less.\nThis miss on the Delta is a little strange, because the guy did a pretty good job addressing some of the other categories.\nWhile I appreciate the high level of interest shown in the concepts of the socio-sexual hierarchy, and I’m glad so many people find them useful and intriguing, I find it amazing that some individuals keep attempting to change things and modify them in ways that can’t possibly help anyone utilize what is a fairly simple analytical tool and primarily serves to muddy the waters.\nI really have to write the SSH book as soon as I’m done with\nA SEA OF SKULLS.\nUPDATE:\nOh,\nfor crying out loud\n. The guy is even attempting to describe female patterns of behavior in terms of male patterns of behavior. This is beyond retarded. Attempting to apply the SSH to women is akin to trying to categorize them on the basis of their penis sizes. It’s a fundamental category error.\nDISCUSS ON SG",
  "tags": [
    "Gamma",
    "SSH"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-01-23T15:05:12+00:00"
}