{
  "url": "https://voxday.net/2023/01/18/history-as-written-by-the-winners/",
  "scraped_at": "2026-01-08T13:44:45.288646",
  "title": "History, As Written by the Winners",
  "date_display": "January 18, 2023",
  "date_iso": "2023-01-18T11:17:56+00:00",
  "date_from_url": "2023-01-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Those who <a href=\"https://thesaker.is/echoes-from-the-first-neocon-war-in-europe-and-some-music/\">lied about NATO’s previous war</a> are now lying about the current one.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>At the time of the NATO war against the Serbian nation I was working for the UN Institute for Disarmament Research, a kind of a UN think tank for the Conference of Disarmament. While this institute was not part of UNPROFOR, we had access to internal UNPROFOR documents. Furthermore, at that time I also had access to classified documents from the Swiss Strategic Intelligence Service. Finally, and unbeknownst to my various bosses, I also had personal friends who were Serbs and Russians with access to all sorts of interesting info. In other words, at the time I <em>knew</em> for a fact that the media was lying about this war and I can now personally confirm the following (though I cannot offer any proof):</p><ul class=\"wp-block-list\"><li>The bombings of the Markale market in Sarajevo were false flag operations and the UNPROFOR specialists in the field saw through the propaganda and reported that up the chain of command which, of course, classified and ignored these reports.</li><li>The “Srebrenica genocide” never happened, but scores of Muslims did get killed, most while retreating through the woody hills towards Gorazde and in some cases there were executions of POW, the latter were ordered by CIA plants in the Milosevic administration. It was a carefully prepared PSYOP to give the West a reason to attack for “humanitarian reasons”, the same role MH17 fulfilled years later.</li><li>The (in)famous Racak massacre never happened. The EU monitors quickly realized that and they did report this up their own chain of command which, of course, classified and ignored these reports. Except that some of these folks were friends of mine and told me the truth 🙂 What actually happened was a gun battle between KLA terrorists and Serbian units.</li><li>Just like in the Ukraine today, the West pumped a lot of money, weapons and “volunteers” into Bosnia, in direct violation of plenty of UNSC Resolutions. The entire UN was hijacked, which was made especially easy with clowns like Eltsin or Kozyrev sitting in the Kremlin.</li><li>When NATO and the Croats attacked the UNPAs in Croation the UNPROFOR forces were ordered by their respective national commands to step aside and not interfere. The Serbs had agreed to give over their heavy weapons and be placed under the “protection” of the UN. We all know what happened after that.</li><li>NATO provided aircraft to bring in hundreds of flights al-Qaeda terrorists into Bosnia, working hand in hand with Turkey and, alas, Iran (Iran’s stance on Bosnia is, in my opinion, the worst mistake ever made by the Islamic Republic who did not have the courage to resist the hysterics in the Muslim world triggered by US PSYOPs).</li><li>EU “observers” were mostly officers of western intelligence agencies. The same goes for a lot of personnel in the so-called “humanitarian” organizations, especially MSF. And, of course, this is also true for many “journalists”. Still, while some of them <em>did</em> very honestly report what they saw, many were simply collecting intelligence and even participating in covert support for the Wahabis in Bosnia (and Chechnia, by the way).</li></ul><p>Why is this important today? Because we have many of the same actors operating in the Ukraine and elsewhere.</p></blockquote><p>Keep these things in mind when the inevitable false flag is produced in order to inflame American patriots against Clown World’s enemies in Russia, China, Venezuela, and now Saudi Arabia. Remember the real history of the <em>Maine</em>. Remember the fake horror stories about the Kuwaiti incubators. Remember the real history of Pearl Harbor and the Gulf of Tonkin. Understand that pointing your justifiable anger elsewhere, at anyone except those who have actually invaded, enervated, and financially pillaged your country, is one of Clown World’s top priorities.</p><p><em><a href=\"https://social.infogalactic.com/micropost/58ed36a7-373b-4b4e-8cb2-96abc4cc4d98\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Those who\nlied about NATO’s previous war\nare now lying about the current one.\nAt the time of the NATO war against the Serbian nation I was working for the UN Institute for Disarmament Research, a kind of a UN think tank for the Conference of Disarmament. While this institute was not part of UNPROFOR, we had access to internal UNPROFOR documents. Furthermore, at that time I also had access to classified documents from the Swiss Strategic Intelligence Service. Finally, and unbeknownst to my various bosses, I also had personal friends who were Serbs and Russians with access to all sorts of interesting info. In other words, at the time I\nknew\nfor a fact that the media was lying about this war and I can now personally confirm the following (though I cannot offer any proof):\nThe bombings of the Markale market in Sarajevo were false flag operations and the UNPROFOR specialists in the field saw through the propaganda and reported that up the chain of command which, of course, classified and ignored these reports.\nThe “Srebrenica genocide” never happened, but scores of Muslims did get killed, most while retreating through the woody hills towards Gorazde and in some cases there were executions of POW, the latter were ordered by CIA plants in the Milosevic administration. It was a carefully prepared PSYOP to give the West a reason to attack for “humanitarian reasons”, the same role MH17 fulfilled years later.\nThe (in)famous Racak massacre never happened. The EU monitors quickly realized that and they did report this up their own chain of command which, of course, classified and ignored these reports. Except that some of these folks were friends of mine and told me the truth 🙂 What actually happened was a gun battle between KLA terrorists and Serbian units.\nJust like in the Ukraine today, the West pumped a lot of money, weapons and “volunteers” into Bosnia, in direct violation of plenty of UNSC Resolutions. The entire UN was hijacked, which was made especially easy with clowns like Eltsin or Kozyrev sitting in the Kremlin.\nWhen NATO and the Croats attacked the UNPAs in Croation the UNPROFOR forces were ordered by their respective national commands to step aside and not interfere. The Serbs had agreed to give over their heavy weapons and be placed under the “protection” of the UN. We all know what happened after that.\nNATO provided aircraft to bring in hundreds of flights al-Qaeda terrorists into Bosnia, working hand in hand with Turkey and, alas, Iran (Iran’s stance on Bosnia is, in my opinion, the worst mistake ever made by the Islamic Republic who did not have the courage to resist the hysterics in the Muslim world triggered by US PSYOPs).\nEU “observers” were mostly officers of western intelligence agencies. The same goes for a lot of personnel in the so-called “humanitarian” organizations, especially MSF. And, of course, this is also true for many “journalists”. Still, while some of them\ndid\nvery honestly report what they saw, many were simply collecting intelligence and even participating in covert support for the Wahabis in Bosnia (and Chechnia, by the way).\nWhy is this important today? Because we have many of the same actors operating in the Ukraine and elsewhere.\nKeep these things in mind when the inevitable false flag is produced in order to inflame American patriots against Clown World’s enemies in Russia, China, Venezuela, and now Saudi Arabia. Remember the real history of the\nMaine\n. Remember the fake horror stories about the Kuwaiti incubators. Remember the real history of Pearl Harbor and the Gulf of Tonkin. Understand that pointing your justifiable anger elsewhere, at anyone except those who have actually invaded, enervated, and financially pillaged your country, is one of Clown World’s top priorities.\nDISCUSS ON SG",
  "tags": [
    "Fake News",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-01-18T11:23:17+00:00"
}