{
  "url": "https://voxday.net/2023/01/24/pressuring-the-fake-president/",
  "scraped_at": "2026-01-08T13:45:20.530426",
  "title": "Pressuring the Fake President",
  "date_display": "January 24, 2023",
  "date_iso": "2023-01-24T10:19:23+00:00",
  "date_from_url": "2023-01-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Clown World is desperate for <a href=\"https://www.unz.com/mwhitney/is-biden-being-blackmailed-to-send-us-combat-troops-to-ukraine/\">one last big roll of the dice</a> to salvage its project in Ukraine, and Joe Biden, of all people, is standing in the way:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>No one should be surprised that Joe Biden’s ‘classified documents problem’ has emerged at the same time a key city in Ukraine (Soledar) has been liberated by Russian troops. All of the recent reports from the frontlines indicate that the Russian army is steadily seizing more territory in the eastern part of the country while inflicting heavy casualties on the over-matched Ukrainian forces. In short, the Ukrainian army is being beaten badly forcing US war planners to rethink their approach. What the US needs to do to prevail in its proxy-war with Russia, is to enlist a coalition of nations (US, Poland, Romania, and UK) that are willing to commit combat troops to the conflict with the tacit understanding that NATO will not directly participate in any ground war with Russia. Biden previously rejected the idea of sending troops to Ukraine acknowledging that it would be tantamount to launching a Third World War.</p><p>But as the ‘classified documents’ scandal gains momentum, the malleable president will likely fall-in-line and do whatever the hawkish foreign policy establishment demands of him. In short, the documents flap is being used by behind-the-scenes powerbrokers who are blackmailing the president to pursue their own narrow interests. They have Brandon over-a-barrel.</p><p>Most readers will recall that Hunter Biden’s laptop contains an abundance of information related to the Biden family’s vast influence peddling operation. All of this information was deliberately suppressed in the mainstream media in order to pave the way for Biden’s victory in the 2020 presidential election. So why—we wonder—has this new scandal become headline news while the laptop story was completely buried? And why are the most hawkish neocons in the senate, like Lindsey Graham, calling for a “special counsel” when they made no such effort to reveal the sordid details of the laptop?</p><p>So, now Lindsey Graham is a champion of truth and transparency?</p><p>Don’t make me laugh.</p><p>I assure you, if Biden announced the deployment of US combat troops to Ukraine tomorrow, Graham would withdraw his request for a special counsel immediately. This is about Ukraine, not classified documents or potentially unlawful presidential behavior. And—whatever you think of Biden—he doesn’t want to be the president who starts WW3. Unfortunately, the elites who control the media, the politicians and most of the nation’s wealth—are determined to widen the conflict which is why the narrative in the media has dramatically changed in the last week.</p></blockquote><p>That article was published nearly two weeks ago, and since then, the pressure on Biden has only increased. From the revelations of the classified papers stored in his garage to a large diamond given to his son, more and more heat is being applied to Biden for some reason.</p><p>It could simply be pressure to resign in favor of Kamala Harris, who is more willing and able to do as she’s told. It could be, as the author reasonably surmises, pressure to unleash the US military openly against Russia. Or, what is more likely, it’s a combination of both.</p><p>However, if Biden is <a href=\"https://dailycaller.com/2023/01/22/james-comer-biden-china/\">a fully-owned creature of the Chinese government</a>, then it’s not going to be possible for him to give into the pressure, because China can break him more completely than Clown World can. Clown World can certainly impeach him and remove him from office, but that is a process which will take more time than the Ukraine Project likely has. Still, it is remarkable that even a dementia-addled elderly man who can barely remember his own name knows better than the evil geniuses of Clown World how crazy it is to take on Russia in a land war if your last name isn’t “Khan”.</p><p><em><a href=\"https://social.infogalactic.com/micropost/c7f54fe6-c244-4aaa-8095-1ee47a867e9f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Clown World is desperate for\none last big roll of the dice\nto salvage its project in Ukraine, and Joe Biden, of all people, is standing in the way:\nNo one should be surprised that Joe Biden’s ‘classified documents problem’ has emerged at the same time a key city in Ukraine (Soledar) has been liberated by Russian troops. All of the recent reports from the frontlines indicate that the Russian army is steadily seizing more territory in the eastern part of the country while inflicting heavy casualties on the over-matched Ukrainian forces. In short, the Ukrainian army is being beaten badly forcing US war planners to rethink their approach. What the US needs to do to prevail in its proxy-war with Russia, is to enlist a coalition of nations (US, Poland, Romania, and UK) that are willing to commit combat troops to the conflict with the tacit understanding that NATO will not directly participate in any ground war with Russia. Biden previously rejected the idea of sending troops to Ukraine acknowledging that it would be tantamount to launching a Third World War.\nBut as the ‘classified documents’ scandal gains momentum, the malleable president will likely fall-in-line and do whatever the hawkish foreign policy establishment demands of him. In short, the documents flap is being used by behind-the-scenes powerbrokers who are blackmailing the president to pursue their own narrow interests. They have Brandon over-a-barrel.\nMost readers will recall that Hunter Biden’s laptop contains an abundance of information related to the Biden family’s vast influence peddling operation. All of this information was deliberately suppressed in the mainstream media in order to pave the way for Biden’s victory in the 2020 presidential election. So why—we wonder—has this new scandal become headline news while the laptop story was completely buried? And why are the most hawkish neocons in the senate, like Lindsey Graham, calling for a “special counsel” when they made no such effort to reveal the sordid details of the laptop?\nSo, now Lindsey Graham is a champion of truth and transparency?\nDon’t make me laugh.\nI assure you, if Biden announced the deployment of US combat troops to Ukraine tomorrow, Graham would withdraw his request for a special counsel immediately. This is about Ukraine, not classified documents or potentially unlawful presidential behavior. And—whatever you think of Biden—he doesn’t want to be the president who starts WW3. Unfortunately, the elites who control the media, the politicians and most of the nation’s wealth—are determined to widen the conflict which is why the narrative in the media has dramatically changed in the last week.\nThat article was published nearly two weeks ago, and since then, the pressure on Biden has only increased. From the revelations of the classified papers stored in his garage to a large diamond given to his son, more and more heat is being applied to Biden for some reason.\nIt could simply be pressure to resign in favor of Kamala Harris, who is more willing and able to do as she’s told. It could be, as the author reasonably surmises, pressure to unleash the US military openly against Russia. Or, what is more likely, it’s a combination of both.\nHowever, if Biden is\na fully-owned creature of the Chinese government\n, then it’s not going to be possible for him to give into the pressure, because China can break him more completely than Clown World can. Clown World can certainly impeach him and remove him from office, but that is a process which will take more time than the Ukraine Project likely has. Still, it is remarkable that even a dementia-addled elderly man who can barely remember his own name knows better than the evil geniuses of Clown World how crazy it is to take on Russia in a land war if your last name isn’t “Khan”.\nDISCUSS ON SG",
  "tags": [
    "China",
    "Clown World",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-01-24T10:56:04+00:00"
}