{
  "url": "https://voxday.net/2023/01/06/reading-list-2022/",
  "scraped_at": "2026-01-08T13:43:29.715577",
  "title": "Reading List 2022",
  "date_display": "January 6, 2023",
  "date_iso": "2023-01-06T11:39:49+00:00",
  "date_from_url": "2023-01-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In the absence of any new Murakami novels last year, I went on a fairly serious Japanese murder mystery bender. Of the 58 books I read in 2022, I’d say the best were <em>Journey Under the Midnight Sun</em>, <em>The Penguin Book of Japanese Short Stories</em>, and <em>Masks</em>. I also discovered that a) Banana Yoshimoto is actually a pretty good pop writer and b) Ryunosuke Akutagawa’s literary influence not only runs deep, but is well-merited.</p><p>China Mieville, This Census-Taker<br/>Mike Florio, Playmakers<br/>Robert E. Howard, The Robert E. Howard Omnibus<br/>Seth Wickersham, It’s Better to Be Feared<br/>Keigo Higashino, Journey Under the Midnight Sun<br/>Keigo Higashino, The Devotion of Suspect X<br/>Keigo Higashino, A Midsummer’s Equation<br/>Keigo Higashino, The Name of the Game is a Kidnapping<br/>Keigo Higashino, Naoko<br/>Keigo Higashino, Salvation of a Saint<br/>Keigo Higashino, The Miracles of the Namiya General Store<br/>Seicho Matsumoto, Points and Lines<br/>Seicho Matsumoto, A Tale of False Fortunes<br/>Fumiko Enchi, Masks<br/>Kaoru Takamura, Lady Joker<br/>Haruki Murakami, The Penguin Book of Japanese Short Stories<br/>Rampo Edogawa, The Black Lizard<br/>Seishi Yokomizo, The Inagumi Curse<br/>Seishi Yokomizo, The Village of Eight Graves<br/>Seishi Yokomizo, The Honjin Murders<br/>Keigo Higashino, Silent Parade<br/>Banana Yoshimoto, Kitchen<br/>Banana Yoshimoto, Goodbye Tsugumi<br/>Junchiro Tanizaki, The Makioka Sisters<br/>Yuko Tsushima, Territory of Light<br/>Eric Cline, 1177 B.C.<br/>Glenn Cook, Gilded Latten Bones<br/>Glenn Cook, An Empire Unacquainted With Defeat<br/>Glenn Cook, The Black Company<br/>Glenn Cook, Shadows Linger<br/>Glenn Cook, The White Rose<br/>Glenn Cook, Shadow Games<br/>Glenn Cook, Dreams of Steel<br/>Glenn Cook, The Silver Spike<br/>Julian May, The Many-Colored Land<br/>Julian May, The Golden Torc<br/>Julian May, The Nonborn King<br/>Julian May, The Adversary<br/>Julian May, Sorceror’s Moon<br/>Julian May, Ironcrown Moon<br/>Julian May, Congueror’s Moon<br/>Julian May, The Intervention Omnibus<br/>Yoko Ogawa, The Memory Police<br/>Marcel Proust, Swann’s Way<br/>Kanae Minato, Penance<br/>Kanae Minato, Confessions<br/>Joel Dicker, The Enigma of Room 622<br/>Soji Shimada, The Tokyo Zodiac Murders<br/>Piero Chiara, The Disappearance of Signora Giulia<br/>Osamu Dazai, Crackling Mountain and Other Stories<br/>Bill Simmons, The Book of Basketball<br/>Ryunosuke Akutagawa, Rashomon and 17 Other Stories<br/>Jake Adelstein, Tokyo Vice<br/>Sayaka Murata, Convenience Store Woman<br/>Yoko Tawada, Facing the Bridge<br/>Chuck Dixon, Siege of the Black Citadel</p><p>I never got around to posting these on the blog last year, but I’ll go over the list on the Darkstream.</p><p><em><a href=\"https://social.infogalactic.com/micropost/60ab2317-4543-4101-b03e-2d856f008626\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "In the absence of any new Murakami novels last year, I went on a fairly serious Japanese murder mystery bender. Of the 58 books I read in 2022, I’d say the best were\nJourney Under the Midnight Sun\n,\nThe Penguin Book of Japanese Short Stories\n, and\nMasks\n. I also discovered that a) Banana Yoshimoto is actually a pretty good pop writer and b) Ryunosuke Akutagawa’s literary influence not only runs deep, but is well-merited.\nChina Mieville, This Census-Taker\nMike Florio, Playmakers\nRobert E. Howard, The Robert E. Howard Omnibus\nSeth Wickersham, It’s Better to Be Feared\nKeigo Higashino, Journey Under the Midnight Sun\nKeigo Higashino, The Devotion of Suspect X\nKeigo Higashino, A Midsummer’s Equation\nKeigo Higashino, The Name of the Game is a Kidnapping\nKeigo Higashino, Naoko\nKeigo Higashino, Salvation of a Saint\nKeigo Higashino, The Miracles of the Namiya General Store\nSeicho Matsumoto, Points and Lines\nSeicho Matsumoto, A Tale of False Fortunes\nFumiko Enchi, Masks\nKaoru Takamura, Lady Joker\nHaruki Murakami, The Penguin Book of Japanese Short Stories\nRampo Edogawa, The Black Lizard\nSeishi Yokomizo, The Inagumi Curse\nSeishi Yokomizo, The Village of Eight Graves\nSeishi Yokomizo, The Honjin Murders\nKeigo Higashino, Silent Parade\nBanana Yoshimoto, Kitchen\nBanana Yoshimoto, Goodbye Tsugumi\nJunchiro Tanizaki, The Makioka Sisters\nYuko Tsushima, Territory of Light\nEric Cline, 1177 B.C.\nGlenn Cook, Gilded Latten Bones\nGlenn Cook, An Empire Unacquainted With Defeat\nGlenn Cook, The Black Company\nGlenn Cook, Shadows Linger\nGlenn Cook, The White Rose\nGlenn Cook, Shadow Games\nGlenn Cook, Dreams of Steel\nGlenn Cook, The Silver Spike\nJulian May, The Many-Colored Land\nJulian May, The Golden Torc\nJulian May, The Nonborn King\nJulian May, The Adversary\nJulian May, Sorceror’s Moon\nJulian May, Ironcrown Moon\nJulian May, Congueror’s Moon\nJulian May, The Intervention Omnibus\nYoko Ogawa, The Memory Police\nMarcel Proust, Swann’s Way\nKanae Minato, Penance\nKanae Minato, Confessions\nJoel Dicker, The Enigma of Room 622\nSoji Shimada, The Tokyo Zodiac Murders\nPiero Chiara, The Disappearance of Signora Giulia\nOsamu Dazai, Crackling Mountain and Other Stories\nBill Simmons, The Book of Basketball\nRyunosuke Akutagawa, Rashomon and 17 Other Stories\nJake Adelstein, Tokyo Vice\nSayaka Murata, Convenience Store Woman\nYoko Tawada, Facing the Bridge\nChuck Dixon, Siege of the Black Citadel\nI never got around to posting these on the blog last year, but I’ll go over the list on the Darkstream.\nDISCUSS ON SG",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-01-06T11:39:52+00:00"
}