{
  "url": "https://voxday.net/2023/01/04/release-the-memes-3/",
  "scraped_at": "2026-01-08T13:43:17.933185",
  "title": "Release the Memes",
  "date_display": "January 4, 2023",
  "date_iso": "2023-01-04T11:17:32+00:00",
  "date_from_url": "2023-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s time for the first Meme Review of 2023. You know where to send them. Just one, please. If you send more than one, they’ll all be thrown out, so don’t bother. Subject: MEME REVIEW.</p><p>On a not-particularly-related subject, if you wish to keep up with my daily word count tracker, which I’ve implemented to put pressure on myself to improve my literary output, you can do so via <a href=\"https://social.infogalactic.com/micropost/e25f37af-f04d-472c-967d-5b8f0e03138d\">this thread at SocialGalactic</a> and the link to it on the right sidebar. What <strong>% GOAL</strong> means is what the current total run rate is compared to my annual goal of 365,000 words. In other words, whether I’m ahead of the annual schedule or behind it. I’ll add a <strong>TOTAL WORDS</strong> line with tonight’s update that should help clarify the matter for those who miss this explanation.</p><p>And yes, at present, the <strong>FICTION</strong> genre refers to <em>A SEA OF SKULLS.</em></p><p>UPDATE: <a href=\"https://gab.com/William_TM/posts/109620802633810945\">William is calculating</a> when the next novel will be published. Unfortunately, his work was based on a false premise and therefore the results are incorrect. Both <em>A THRONE OF BONES</em> and <em>A SEA OF SKULLS</em> are 297,500 words apiece.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>…trying to figure when the next Vox Day novel will drop based on new information…</p><p>…assuming about 200,000 words in a novel the size of Throne of Bones…</p><p>…of course, this is not counting work being done in parallel, or things being thrown out…</p><p>…ok, we’ve got this… run a Farey sequence on the probability envelope of a daily routine given parameters of Environment, Distraction, Drive, Accuracy… input variables into a non-linear optimization routine… convince some intern this all makes sense and make him do all the work to figure it out… done.</p><p>Vox will have written 4,000 new novels by the end of the year, and 24 of them will have become motion picture productions.</p><p>The intern was JF.</p></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/b8ee5229-1c75-4ad6-a9e8-5532e1267bd1\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s time for the first Meme Review of 2023. You know where to send them. Just one, please. If you send more than one, they’ll all be thrown out, so don’t bother. Subject: MEME REVIEW.\nOn a not-particularly-related subject, if you wish to keep up with my daily word count tracker, which I’ve implemented to put pressure on myself to improve my literary output, you can do so via\nthis thread at SocialGalactic\nand the link to it on the right sidebar. What\n% GOAL\nmeans is what the current total run rate is compared to my annual goal of 365,000 words. In other words, whether I’m ahead of the annual schedule or behind it. I’ll add a\nTOTAL WORDS\nline with tonight’s update that should help clarify the matter for those who miss this explanation.\nAnd yes, at present, the\nFICTION\ngenre refers to\nA SEA OF SKULLS.\nUPDATE:\nWilliam is calculating\nwhen the next novel will be published. Unfortunately, his work was based on a false premise and therefore the results are incorrect. Both\nA THRONE OF BONES\nand\nA SEA OF SKULLS\nare 297,500 words apiece.\n…trying to figure when the next Vox Day novel will drop based on new information…\n…assuming about 200,000 words in a novel the size of Throne of Bones…\n…of course, this is not counting work being done in parallel, or things being thrown out…\n…ok, we’ve got this… run a Farey sequence on the probability envelope of a daily routine given parameters of Environment, Distraction, Drive, Accuracy… input variables into a non-linear optimization routine… convince some intern this all makes sense and make him do all the work to figure it out… done.\nVox will have written 4,000 new novels by the end of the year, and 24 of them will have become motion picture productions.\nThe intern was JF.\nDISCUSS ON SG",
  "tags": [
    "MemeWars"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-01-04T13:18:01+00:00"
}