{
  "url": "https://voxday.net/2023/01/15/sam-harris-has-lost-his-mind/",
  "scraped_at": "2026-01-08T13:44:27.273611",
  "title": "Sam Harris Has Lost His Mind",
  "date_display": "January 15, 2023",
  "date_iso": "2023-01-15T11:44:30+00:00",
  "date_from_url": "2023-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sam Harris, one of the Four Horsemen of the New Atheism, was always an incredibly sloppy thinker. But he used to be coherent in his wrongness; his erroneous syllogisms were logically correct, they were simply based on false foundations. Now, however, his faith in science has not only become illogical, but has rendered him ridiculous.</p><p>This was his response to an interview addressing the fact that his fellow “Intellectual Dark Web” member was correct to trust Ivermectin rather than the vaxx in response to Covid.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I mean, so, let’s say let’s say five years from now we learned that Ivermectin is actually perfect, right? Just for whatever reason the studies we had back in 2020 and 2021 were poorly run but we did this perfect study and you know Ivermectin is perfect and what’s more the vaccines, they’re way more dangerous than anyone thought, and you know you don’t want any of that mRNA stuff in you, right?</p><p>So, Brett Weinstein turns out he was right about everything, right? Will he be Vindicated?</p><p>Not really, because at the time his reasons for thinking what he was thinking at the time were insufficient, right? His conviction at the time was bizarre, I mean he literally called the vaccine ‘the crime of the century,’ right? And predicted that millions of people are going to die from it, right? If millions of people do die from it, it’s still true that at the time he said that, it was a deranged and deranging claim, right? And it just made absolutely no sense.</p></blockquote><p>Setting aside the fact that we’re now seeing a retroactive attempt by the media to establish a fence-straddling intellectual nonentity like Not-Harvey Weinstein as the leading anti-vaxx critic because nearly every other ticket-taking public intellectual is vaxxed, this demonstrates that Sam Harris is both a) functionally retarded and b) has paid absolutely no attention to either the financial corruption of scientistry or the reproducibility crisis in scientody of the last decade. Even his biggest fans are now calling him out for his absurdities.</p><ul class=\"wp-block-list\"><li><em>Sam has absolutely lost the plot. Excruciating to listen to him. I’m embarrassed to say I used to listen to every single one of his podcasts before he fell off the deep end. He’s just a run of the mill statist at this point. Anything to justify the establishments actions.</em></li><li><em>Sam Harris DESPERATELY wishing away his cognitive dissonance</em></li><li><em>He just can’t accept that Bret was right, and he was dangerously wrong.</em></li><li><em>I used to listen to Harris quite a bit, however you’ve really got to ask WTF happened to him? Trump &amp; Covid etc has absolutely broken him.</em></li><li><em>The guy has a huge ego that prevents him from seeing how wrong he was. Now he’s using a hypothetical to justify his wrong position</em>.</li><li><em>I used to listen to Sam Harris. Unfortunately it seems as though he has completely lost the plot.</em></li><li><em>If reality was like Sam thought he would have been right but it wasn’t which makes him right anyway, according to Sam.</em></li></ul><p>Cerno’s take is pretty funny, as is that of one of his follower’s.</p><ul class=\"wp-block-list\"><li><em>Sam Harris does finally admit that the vaccine doesn’t stop the transmission of Covid-19. I misheard the video earlier. My goodness. This video is a long way of avoiding saying, “I was totally wrong and I apologize for my hysteria.” What a pretzel.</em></li><li><em>That’s the face of an “intellectual” who just realized he lost THE debate of his lifetime… of someone who just realized they’d been lying to themselves more than anyone else…</em></li></ul><p>Since I pay zero attention to ticket-takers and their well-compensated blatherings while being aware of their propensity for inversion, it occurred to me that it was entirely possible Not-Harvey Weinstein had been naive enough to get himself vaxxed prior to jumping in front of the anti-vaxx parade. <em>See: Robert Malone, Steve Kirsch, et al. </em>However, it appears that he may actually be a genuine Pureblood based on <a href=\"https://archive.ph/TdEd5\">this article from May 2022</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Ivermectin, the Parasite Drug Touted by Portland Podcaster Bret Weinstein, Is Shown to Be Worthless for Treating COVID-19</strong></p><p><em>A big, comprehensive study flies in the face of Weinstein’s claims.</em></p><p>“The evidence is surprisingly compelling, indicating Ivermectin dramatically improves outcomes in COVID patients, and is very effective preventing infection,” Weinstein tweeted on May 29, 2021.</p><p>Lately, though, science has caught up to them.</p><p>The latest, best studies show that ivermectin does little to prevent or treat COVID. A bombshell arrived this week, when the New England Journal of Medicine, the ne plus ultra of medical research, published a study showing that ivermectin did nothing to treat COVID infections or keep them from worsening to the point of hospitalization.</p><p>“Treatment with ivermectin did not result in a lower incidence of medical admission to a hospital,” the researchers wrote. “There were no significant effects of ivermectin use on secondary outcomes or adverse events.” The secondary outcomes included death.</p><p>In short, ivermectin did nothing to cure COVID-19. Unlike the previous studies that got people like Weinstein and Heying fired up about the drug, this one was double-blind, randomized, placebo-controlled, and large, with 3,515 patients.</p> <cite>Anthony Effinger, <em>Williamette Week</em>, March 30, 2022</cite></blockquote><p>There is an important veriphysical lesson here about metareasoning and science. This is where we see the vital importance of questioning one’s base axioms and assumptions when a syllogism produces an observably false conclusion. The primary assumption in this case is that scientody is reliable, and the secondary assumption is that scientistry is incorruptible. Therefore, the major premise is that the conclusions of a large, double-blind, randomized, placebo-controlled and peer-reviewed study are correctly indicative of reality.</p><p>But this is a false premise. We know for a fact that 60 percent – yes, the MAJORITY, which is to say MOST – of the gold-standard scientific studies published <em>cannot be reproduced</em>. An even higher percentage of non-landmark published studies fail the reproducibility test. This does not mean that most of the hypotheses concerned are necessarily falsified, but it does mean that no scientific study should ever be confused with reliable evidence, let alone conclusive proof. In fact, a strong statistical correlation is presently a better and more reliable indication of causation than so-called “scientific proof” of it.</p><p>Forget feelings. Facts don’t care about your ex post facto rationalizations.</p><p><em><a href=\"https://social.infogalactic.com/micropost/a8fabf93-7cca-411a-913a-6a69a2db4862\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Sam Harris, one of the Four Horsemen of the New Atheism, was always an incredibly sloppy thinker. But he used to be coherent in his wrongness; his erroneous syllogisms were logically correct, they were simply based on false foundations. Now, however, his faith in science has not only become illogical, but has rendered him ridiculous.\nThis was his response to an interview addressing the fact that his fellow “Intellectual Dark Web” member was correct to trust Ivermectin rather than the vaxx in response to Covid.\nI mean, so, let’s say let’s say five years from now we learned that Ivermectin is actually perfect, right? Just for whatever reason the studies we had back in 2020 and 2021 were poorly run but we did this perfect study and you know Ivermectin is perfect and what’s more the vaccines, they’re way more dangerous than anyone thought, and you know you don’t want any of that mRNA stuff in you, right?\nSo, Brett Weinstein turns out he was right about everything, right? Will he be Vindicated?\nNot really, because at the time his reasons for thinking what he was thinking at the time were insufficient, right? His conviction at the time was bizarre, I mean he literally called the vaccine ‘the crime of the century,’ right? And predicted that millions of people are going to die from it, right? If millions of people do die from it, it’s still true that at the time he said that, it was a deranged and deranging claim, right? And it just made absolutely no sense.\nSetting aside the fact that we’re now seeing a retroactive attempt by the media to establish a fence-straddling intellectual nonentity like Not-Harvey Weinstein as the leading anti-vaxx critic because nearly every other ticket-taking public intellectual is vaxxed, this demonstrates that Sam Harris is both a) functionally retarded and b) has paid absolutely no attention to either the financial corruption of scientistry or the reproducibility crisis in scientody of the last decade. Even his biggest fans are now calling him out for his absurdities.\nSam has absolutely lost the plot. Excruciating to listen to him. I’m embarrassed to say I used to listen to every single one of his podcasts before he fell off the deep end. He’s just a run of the mill statist at this point. Anything to justify the establishments actions.\nSam Harris DESPERATELY wishing away his cognitive dissonance\nHe just can’t accept that Bret was right, and he was dangerously wrong.\nI used to listen to Harris quite a bit, however you’ve really got to ask WTF happened to him? Trump & Covid etc has absolutely broken him.\nThe guy has a huge ego that prevents him from seeing how wrong he was. Now he’s using a hypothetical to justify his wrong position\n.\nI used to listen to Sam Harris. Unfortunately it seems as though he has completely lost the plot.\nIf reality was like Sam thought he would have been right but it wasn’t which makes him right anyway, according to Sam.\nCerno’s take is pretty funny, as is that of one of his follower’s.\nSam Harris does finally admit that the vaccine doesn’t stop the transmission of Covid-19. I misheard the video earlier. My goodness. This video is a long way of avoiding saying, “I was totally wrong and I apologize for my hysteria.” What a pretzel.\nThat’s the face of an “intellectual” who just realized he lost THE debate of his lifetime… of someone who just realized they’d been lying to themselves more than anyone else…\nSince I pay zero attention to ticket-takers and their well-compensated blatherings while being aware of their propensity for inversion, it occurred to me that it was entirely possible Not-Harvey Weinstein had been naive enough to get himself vaxxed prior to jumping in front of the anti-vaxx parade.\nSee: Robert Malone, Steve Kirsch, et al.\nHowever, it appears that he may actually be a genuine Pureblood based on\nthis article from May 2022\n.\nIvermectin, the Parasite Drug Touted by Portland Podcaster Bret Weinstein, Is Shown to Be Worthless for Treating COVID-19\nA big, comprehensive study flies in the face of Weinstein’s claims.\n“The evidence is surprisingly compelling, indicating Ivermectin dramatically improves outcomes in COVID patients, and is very effective preventing infection,” Weinstein tweeted on May 29, 2021.\nLately, though, science has caught up to them.\nThe latest, best studies show that ivermectin does little to prevent or treat COVID. A bombshell arrived this week, when the New England Journal of Medicine, the ne plus ultra of medical research, published a study showing that ivermectin did nothing to treat COVID infections or keep them from worsening to the point of hospitalization.\n“Treatment with ivermectin did not result in a lower incidence of medical admission to a hospital,” the researchers wrote. “There were no significant effects of ivermectin use on secondary outcomes or adverse events.” The secondary outcomes included death.\nIn short, ivermectin did nothing to cure COVID-19. Unlike the previous studies that got people like Weinstein and Heying fired up about the drug, this one was double-blind, randomized, placebo-controlled, and large, with 3,515 patients.\nAnthony Effinger,\nWilliamette Week\n, March 30, 2022\nThere is an important veriphysical lesson here about metareasoning and science. This is where we see the vital importance of questioning one’s base axioms and assumptions when a syllogism produces an observably false conclusion. The primary assumption in this case is that scientody is reliable, and the secondary assumption is that scientistry is incorruptible. Therefore, the major premise is that the conclusions of a large, double-blind, randomized, placebo-controlled and peer-reviewed study are correctly indicative of reality.\nBut this is a false premise. We know for a fact that 60 percent – yes, the MAJORITY, which is to say MOST – of the gold-standard scientific studies published\ncannot be reproduced\n. An even higher percentage of non-landmark published studies fail the reproducibility test. This does not mean that most of the hypotheses concerned are necessarily falsified, but it does mean that no scientific study should ever be confused with reliable evidence, let alone conclusive proof. In fact, a strong statistical correlation is presently a better and more reliable indication of causation than so-called “scientific proof” of it.\nForget feelings. Facts don’t care about your ex post facto rationalizations.\nDISCUSS ON SG",
  "tags": [
    "science",
    "Veriphysics"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-01-16T00:54:58+00:00"
}