{
  "url": "https://voxday.net/2023/01/24/schroedingers-cornerback/",
  "scraped_at": "2026-01-08T13:45:22.009908",
  "title": "Schroedinger’s Cornerback",
  "date_display": "January 24, 2023",
  "date_iso": "2023-01-24T15:35:38+00:00",
  "date_from_url": "2023-01-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Consider how the “revelation of the method” deception works. It’s a very Gamma technique and it works most effectively on Gammas, Deltas, and women. To utilize it, you admit what you are doing, but you do so in a sarcastic or snarky manner that is intended to leave the audience with the impression that you are denying what you are literally admitting. It’s perceived denial by admission.</p><p>In the case of the NFL cornerback who may or may not be alive, there is an additional element of <em>reductio ad absurdum</em>. No one, literally no one, believes that Damar Hamlin has been replaced by a genetic clone of his that was prepared more than two decades ago just in case he died of an adverse reaction to a mandated genetic therapy in front of tens of millions of viewers. What skeptics actually think is that the unfortunate Mr. Hamlin either died or is in very poor health, and he is presently being portrayed in public by a stand-in who is two inches shorter and about 15 pounds lighter, based on a comparison of the video evidence with his measurements at the NFL Combine as well as the fact that “he” resolutely avoids showing his face on camera or in public.</p><p>Now, the skeptics may be wrong. Perhaps Damar Hamlin is every bit as alive and healthy <a href=\"https://eu.usatoday.com/story/news/factcheck/2020/12/23/fact-check-nurse-who-fainted-after-being-vaccinated-alive/4024424001/\">as Tiffany Dover</a>, the nurse who we have been assured totally didn’t die after being publicly vaccinated and collapsing unconscious on camera. And if Damar Hamlin shows up and plays for the Buffalo Bills next year, it will be obvious that he did not die on the field or in the hospital that was inexplicably surrounded by federal agents on the night he went into cardiac arrest.</p><p>On the other hand, if he tragically dies in a boating accident this offseason after assiduously avoiding the cameras until then, we’ll have a very different sort of confirmation.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-56799\" decoding=\"async\" fetchpriority=\"high\" height=\"719\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/01/image-27.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/01/image-27.png 512w, https://voxday.net/wp-content/uploads/2023/01/image-27-214x300.png 214w\" width=\"512\"/></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/b5c4795b-c1f4-4390-98a4-7b71eb0534f6\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Consider how the “revelation of the method” deception works. It’s a very Gamma technique and it works most effectively on Gammas, Deltas, and women. To utilize it, you admit what you are doing, but you do so in a sarcastic or snarky manner that is intended to leave the audience with the impression that you are denying what you are literally admitting. It’s perceived denial by admission.\nIn the case of the NFL cornerback who may or may not be alive, there is an additional element of\nreductio ad absurdum\n. No one, literally no one, believes that Damar Hamlin has been replaced by a genetic clone of his that was prepared more than two decades ago just in case he died of an adverse reaction to a mandated genetic therapy in front of tens of millions of viewers. What skeptics actually think is that the unfortunate Mr. Hamlin either died or is in very poor health, and he is presently being portrayed in public by a stand-in who is two inches shorter and about 15 pounds lighter, based on a comparison of the video evidence with his measurements at the NFL Combine as well as the fact that “he” resolutely avoids showing his face on camera or in public.\nNow, the skeptics may be wrong. Perhaps Damar Hamlin is every bit as alive and healthy\nas Tiffany Dover\n, the nurse who we have been assured totally didn’t die after being publicly vaccinated and collapsing unconscious on camera. And if Damar Hamlin shows up and plays for the Buffalo Bills next year, it will be obvious that he did not die on the field or in the hospital that was inexplicably surrounded by federal agents on the night he went into cardiac arrest.\nOn the other hand, if he tragically dies in a boating accident this offseason after assiduously avoiding the cameras until then, we’ll have a very different sort of confirmation.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "Gamma",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-01-24T15:35:41+00:00"
}