{
  "url": "https://voxday.net/2023/01/19/the-subversion-of-the-hero/",
  "scraped_at": "2026-01-08T13:44:50.453418",
  "title": "The Subversion of the Hero",
  "date_display": "January 19, 2023",
  "date_iso": "2023-01-19T14:31:41+00:00",
  "date_from_url": "2023-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And <a href=\"https://thesaxoncross.substack.com/p/marvel-morality\">the intrinsic immorality</a> of the Marvel hero. One thing you’ll notice about Arkhaven heroes compared to Marvel and DC heroes: they are absolutely willing to kill the wicked without hesitation or remorse. This is an excellent piece on the insidious modern subversion of the Western hero:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Classical heroes kill their enemies. This is really their most essential job. The role of the hero archetype is to slay dragons and evil kings. Their purpose is to root out evil. They may show mercy on occasion, but this is not their primary role. Mercy-giver is the role of the king. The Folk Hero’s job is a violent one for the sake of good.</p><p>However, your typical modern era hero story almost always includes a moment where the villain must be offered a chance for “rehabilitation”, or must stand trial, or where the hero does everything in his power to avoid using deadly force out of some moral reluctance. The modern hero is suspiciously full of reluctance to stamp out evil.</p><p>This “Marvel morality” is everywhere.</p><p>Try paying attention to this next time you watch a modern action movie. There is almost universally a moment in every film where the main character will show some reluctance to kill a truly evil villain (never mind the countless nameless villains the hero kills- this sentiment is reserved only for the main antagonist). This is a truly inexplicable trope. What is reveals is a reluctance on the part of modern Western culture to define actual evil. Everything must be nuanced. When we knew what evil was, heroes did not have to waste time on these silly moral dilemmas. There was no question on whether the heroes dead wife and children “would have wanted” him to take revenge on their killer, no question on whether the tyrant should be violently thrown down from the slain king’s throne. Questions like these would not have even been asked a couple generations ago, but in modern media a hero that kills evil without hesitation is unheard of. It would offend our modern sensibilities.</p><p>Think of Superman, or Batman. One of their defining traits is an unwillingness to kill. Even to kill evil, heinous villains. Its fine for Superman to destroy an entire city and likely countless civilians, but not to actually kill the main antagonist. Why? It is because they are products of a Neo-liberal marvel morality.</p><p>You could look to The Chronicles of Narnia as an example. In Prince Caspian, Peter duels the tyrannical king Miraz in a single combat. During the duel Miraz is traitorously slain by his own nobles, but there is never any question that King Peter is absolutely trying to kill Miraz. There is never any discussion between Peter and Caspian about sparing Miraz’s life- why would they?</p><p>However, the movie version of the story completely changes the this into a scene that could only have been written in the 21st century. No, Peter is not too “cowardly to take life”. This is a ridiculous question.</p><p>Peter saying Mira’s life is “not mine to take”. This is ridiculous. They are in a single combat to the death for the rule of Peter’s kingdom. Of course it is his to take. It is in fact his duty to do so.</p><p>Ok, he hands the sword to Caspian. This is fine I guess. Peter is not abandoning his duty, but letting the exiled prince avenge his father. Maybe the scene will turn out ok?</p><p>Nope.</p><p>Miraz then implies that Caspian killing him means “he has the makings of a Telmarine King”. This is ridiculous. Only a Telmarine King would slay a traitorous, fratricidal tryant? What?</p><p>Caspian says “not one like you”. As if avenging his father is comparable to his uncle’s crime of regicide and fratricide? This is ridiculous.</p><p>Then, Caspian inexplicably, ridiculously, spares his traitorous uncle in what appears to be some demonstration of high moral character.</p><p>Why even write this scene at all? Why show both Peter and Caspian spare Miraz when neither of them do in the book? Why not just have Mira’s nobles murder him during the duel?</p><p>Because in the eyes of the writers of this science, this makes them noble. For some reason, the hero must be shown being merciful to the main antagonist. Because in our modern eyes, for them to single-mindedly seek his destruction would be apprehensible. Note that both Peter and Caspian kill numerous other Telmarines in this movie with no moral qualms, Telmarine soldiers that have all wronged them less than their Lord Miraz did. This scene is in the movie for no reason other than to shove 21st century Neo-Liberal values down the audience’s throats.</p><p>This scene is awful.</p><p>Mercy is not a bad thing. But it is almost always used inappropriately in modern media like this. It is used not as true mercy, but as nauseating moralizing.</p><p>As a result of this inability to define true evil and treat it as such, our heroes must also become less heroic. Our popular media is filled to the brim with antiheroes.</p><p>A real folk hero suffers none of these delusions. If Superman were a real hero, he would kill evil men, not let them live to murder another day.</p></blockquote><p>Indeed. Even as a child, I found it infuriating how Hollywood never permitted a hero to take decisive action, but only allowed him to use lethal force after first defeating, then mercifully sparing, the villain, who would then inexplicably attempt, and fail, to kill the hero, leaving the latter no choice but to finally finish off the villain. The first <em>Lethal Weapon</em> is a particularly egregious example of this cinematic trope.</p><p>In fact, at this point Batman should really be regarded as an accomplice and an enabler of the Joker, given how many times he has spared him and thereby permitted him to murder again and again and again. One might not unreasonably suspect of Batman of harboring secret sympathies for the Joker’s attitude toward the human race.</p><p><em><a href=\"https://social.infogalactic.com/micropost/7acb2248-9de0-4668-ad25-0982eb792966\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "And\nthe intrinsic immorality\nof the Marvel hero. One thing you’ll notice about Arkhaven heroes compared to Marvel and DC heroes: they are absolutely willing to kill the wicked without hesitation or remorse. This is an excellent piece on the insidious modern subversion of the Western hero:\nClassical heroes kill their enemies. This is really their most essential job. The role of the hero archetype is to slay dragons and evil kings. Their purpose is to root out evil. They may show mercy on occasion, but this is not their primary role. Mercy-giver is the role of the king. The Folk Hero’s job is a violent one for the sake of good.\nHowever, your typical modern era hero story almost always includes a moment where the villain must be offered a chance for “rehabilitation”, or must stand trial, or where the hero does everything in his power to avoid using deadly force out of some moral reluctance. The modern hero is suspiciously full of reluctance to stamp out evil.\nThis “Marvel morality” is everywhere.\nTry paying attention to this next time you watch a modern action movie. There is almost universally a moment in every film where the main character will show some reluctance to kill a truly evil villain (never mind the countless nameless villains the hero kills- this sentiment is reserved only for the main antagonist). This is a truly inexplicable trope. What is reveals is a reluctance on the part of modern Western culture to define actual evil. Everything must be nuanced. When we knew what evil was, heroes did not have to waste time on these silly moral dilemmas. There was no question on whether the heroes dead wife and children “would have wanted” him to take revenge on their killer, no question on whether the tyrant should be violently thrown down from the slain king’s throne. Questions like these would not have even been asked a couple generations ago, but in modern media a hero that kills evil without hesitation is unheard of. It would offend our modern sensibilities.\nThink of Superman, or Batman. One of their defining traits is an unwillingness to kill. Even to kill evil, heinous villains. Its fine for Superman to destroy an entire city and likely countless civilians, but not to actually kill the main antagonist. Why? It is because they are products of a Neo-liberal marvel morality.\nYou could look to The Chronicles of Narnia as an example. In Prince Caspian, Peter duels the tyrannical king Miraz in a single combat. During the duel Miraz is traitorously slain by his own nobles, but there is never any question that King Peter is absolutely trying to kill Miraz. There is never any discussion between Peter and Caspian about sparing Miraz’s life- why would they?\nHowever, the movie version of the story completely changes the this into a scene that could only have been written in the 21st century. No, Peter is not too “cowardly to take life”. This is a ridiculous question.\nPeter saying Mira’s life is “not mine to take”. This is ridiculous. They are in a single combat to the death for the rule of Peter’s kingdom. Of course it is his to take. It is in fact his duty to do so.\nOk, he hands the sword to Caspian. This is fine I guess. Peter is not abandoning his duty, but letting the exiled prince avenge his father. Maybe the scene will turn out ok?\nNope.\nMiraz then implies that Caspian killing him means “he has the makings of a Telmarine King”. This is ridiculous. Only a Telmarine King would slay a traitorous, fratricidal tryant? What?\nCaspian says “not one like you”. As if avenging his father is comparable to his uncle’s crime of regicide and fratricide? This is ridiculous.\nThen, Caspian inexplicably, ridiculously, spares his traitorous uncle in what appears to be some demonstration of high moral character.\nWhy even write this scene at all? Why show both Peter and Caspian spare Miraz when neither of them do in the book? Why not just have Mira’s nobles murder him during the duel?\nBecause in the eyes of the writers of this science, this makes them noble. For some reason, the hero must be shown being merciful to the main antagonist. Because in our modern eyes, for them to single-mindedly seek his destruction would be apprehensible. Note that both Peter and Caspian kill numerous other Telmarines in this movie with no moral qualms, Telmarine soldiers that have all wronged them less than their Lord Miraz did. This scene is in the movie for no reason other than to shove 21st century Neo-Liberal values down the audience’s throats.\nThis scene is awful.\nMercy is not a bad thing. But it is almost always used inappropriately in modern media like this. It is used not as true mercy, but as nauseating moralizing.\nAs a result of this inability to define true evil and treat it as such, our heroes must also become less heroic. Our popular media is filled to the brim with antiheroes.\nA real folk hero suffers none of these delusions. If Superman were a real hero, he would kill evil men, not let them live to murder another day.\nIndeed. Even as a child, I found it infuriating how Hollywood never permitted a hero to take decisive action, but only allowed him to use lethal force after first defeating, then mercifully sparing, the villain, who would then inexplicably attempt, and fail, to kill the hero, leaving the latter no choice but to finally finish off the villain. The first\nLethal Weapon\nis a particularly egregious example of this cinematic trope.\nIn fact, at this point Batman should really be regarded as an accomplice and an enabler of the Joker, given how many times he has spared him and thereby permitted him to murder again and again and again. One might not unreasonably suspect of Batman of harboring secret sympathies for the Joker’s attitude toward the human race.\nDISCUSS ON SG",
  "tags": [
    "comics",
    "Hellmouth",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-01-19T14:31:44+00:00"
}