{
  "url": "https://voxday.net/2023/01/14/the-fauci-flop/",
  "scraped_at": "2026-01-08T13:44:23.624468",
  "title": "The Fauci Flop",
  "date_display": "January 14, 2023",
  "date_iso": "2023-01-14T18:34:17+00:00",
  "date_from_url": "2023-01-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Karl Denninger concludes <a href=\"https://market-ticker.org/akcs-www?singlepost=3940205\">it’s time to take a victory lap</a>. And there is no doubt about it, he was absolutely right about the pernicious nature of the vaxx. In a just world, he’d receive a Presidential Medal of Freedom for the tens of thousands of lives he saved by his diligent and persistent efforts.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em>We won, they lost.</em></p><p>The outcome was in doubt for quite some time. But now, its not.</p><p>Rasmussen ran a poll not long ago and found a very large percentage of people who are convinced that someone they knew was seriously injured or killed by the vexxines. Remember the old mantra — safe and effective? Its no longer an opinion that holds sway among the American people.</p><p>But its not just opinion anymore: Now its fact, as we keep seeing. Report after report, even showing up in the mainstream media, of people taking the Fauci Flop. Allegedly healthy people, even elite level athletes, suddenly collapsing and in many cases dying.</p><p>Reality is that everyone dies and death is not uncommon. But unexpected, sudden death among people younger than 60 or so is quite unusual. Especially among athletes and other people of prominence, except from drugs, which of course have always been a scourge and have claimed people all the time. Elvis infamously died on the crapper and upon autopsy they found ten prescription drugs in size and a seriously damaged liver. Not all that long ago my sister died under similar circumstances, and from similar root causes. I’ve had friends who also succumbed from the same sort of abuse of substances and that sucks.</p><p>But many of these are not slow suicides by drug abuse — or, for that matter, by potato chip and sugared beverages. They’re “side effects” of something peddled to the masses and everyone knows it. Those who were conned are scared of meeting God and having to explain their personal insanity to him, thus that fearful look in their eye. Their attacks on you both over the last two years and today are from that exact reason: <em>They’re scared they got it wrong and you had it right — and they may be literally walking while already dead. </em>Those who conned others or worse, who were enforcers either through soft coercion or even literal force, such as politicians, police officers, CEOs and supervisory people are not just scared they might be next but that their particular fiefdom and ambitions are screwed, never mind their personal life and wealth, perhaps terminally so.</p></blockquote><p>I’ve already lost a brother to the vaxx. Our family very nearly lost a good friend to it; she survived, but it was touch-and-go for a while there. And I know there will be more Unexpected, and more Suddenly, and more people performing the Fauci Flop in the future. That is why I am determined, like Karl, to make certain that absolutely no one is permitted to erase from memory what happened during what may yet turn out to be one of the most infamous events in human history.</p><p>But the most important thing is that everyone, vaxxed and unvaxxed, must understand from this point forward that neither the government nor the scientists, neither the media nor the health care system, have your best interests at heart. Never, ever, believe any of them again.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-56650\" decoding=\"async\" fetchpriority=\"high\" height=\"456\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2023/01/image-13.png\" srcset=\"https://voxday.net/wp-content/uploads/2023/01/image-13.png 512w, https://voxday.net/wp-content/uploads/2023/01/image-13-300x267.png 300w\" width=\"512\"/></figure></div><p>I wonder who will play him in the movie one day?</p><p><a href=\"https://social.infogalactic.com/micropost/b4e5bd9a-89f9-4545-a19b-5bc7a0ad6cbf\"><em>DISCUSS ON SG</em></a></p></div>",
  "content_text": "Karl Denninger concludes\nit’s time to take a victory lap\n. And there is no doubt about it, he was absolutely right about the pernicious nature of the vaxx. In a just world, he’d receive a Presidential Medal of Freedom for the tens of thousands of lives he saved by his diligent and persistent efforts.\nWe won, they lost.\nThe outcome was in doubt for quite some time. But now, its not.\nRasmussen ran a poll not long ago and found a very large percentage of people who are convinced that someone they knew was seriously injured or killed by the vexxines. Remember the old mantra — safe and effective? Its no longer an opinion that holds sway among the American people.\nBut its not just opinion anymore: Now its fact, as we keep seeing. Report after report, even showing up in the mainstream media, of people taking the Fauci Flop. Allegedly healthy people, even elite level athletes, suddenly collapsing and in many cases dying.\nReality is that everyone dies and death is not uncommon. But unexpected, sudden death among people younger than 60 or so is quite unusual. Especially among athletes and other people of prominence, except from drugs, which of course have always been a scourge and have claimed people all the time. Elvis infamously died on the crapper and upon autopsy they found ten prescription drugs in size and a seriously damaged liver. Not all that long ago my sister died under similar circumstances, and from similar root causes. I’ve had friends who also succumbed from the same sort of abuse of substances and that sucks.\nBut many of these are not slow suicides by drug abuse — or, for that matter, by potato chip and sugared beverages. They’re “side effects” of something peddled to the masses and everyone knows it. Those who were conned are scared of meeting God and having to explain their personal insanity to him, thus that fearful look in their eye. Their attacks on you both over the last two years and today are from that exact reason:\nThey’re scared they got it wrong and you had it right — and they may be literally walking while already dead.\nThose who conned others or worse, who were enforcers either through soft coercion or even literal force, such as politicians, police officers, CEOs and supervisory people are not just scared they might be next but that their particular fiefdom and ambitions are screwed, never mind their personal life and wealth, perhaps terminally so.\nI’ve already lost a brother to the vaxx. Our family very nearly lost a good friend to it; she survived, but it was touch-and-go for a while there. And I know there will be more Unexpected, and more Suddenly, and more people performing the Fauci Flop in the future. That is why I am determined, like Karl, to make certain that absolutely no one is permitted to erase from memory what happened during what may yet turn out to be one of the most infamous events in human history.\nBut the most important thing is that everyone, vaxxed and unvaxxed, must understand from this point forward that neither the government nor the scientists, neither the media nor the health care system, have your best interests at heart. Never, ever, believe any of them again.\nI wonder who will play him in the movie one day?\nDISCUSS ON SG",
  "tags": [
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-01-15T02:16:07+00:00"
}