{
  "url": "https://voxday.net/2023/01/30/the-thumb-on-the-scale/",
  "scraped_at": "2026-01-08T13:45:56.831430",
  "title": "The Thumb on the Scale",
  "date_display": "January 30, 2023",
  "date_iso": "2023-01-30T11:21:32+00:00",
  "date_from_url": "2023-01-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While I stopped subscribing to NFL Game Pass and playing fantasy football after the NFL went woke, I still watch all the playoff games. But one thing that made it easier to invest considerably less time in the sport that I’ve followed since childhood was the observation I’d made around the same time, which is that the NFL Commissioner’s office appears to have gotten more aggressively involved in influencing the end results than in previous decades.</p><p>While there were a few plays over the years that struck me as highly questionable, for the most part they appeared to be sporadic and generally free of any larger pattern. (<em>See: </em>Drew Pearson a) catching the ball out of bounds, b) pushing off in <a href=\"https://www.startribune.com/dec-29-1975-drew-pearson-s-hail-mary-catch/81598612/\">the 1975 Minnesota – Dallas game</a>, and c) the two non-holding calls on both plays.) The approach has definitely changed, because it’s now become regularly recognizable which team the league would prefer to win the game by the end of the first drive by each team. Note that I said “drive”, not “possession”, because it’s usually impossible to learn anything from an initial three-and-out.</p><p>A lot of this year’s playoff games were really good. And the NFL isn’t dictating or scripting the games, it appears to be content to simply put a thumb on the scale, giving the preferred team a small advantage that is worth somewhere between 3 and 7 points in the end. This is an advantage that can be overcome fairly easily by a superior or very well-coached team, but in contests in which the “game of inches” description is apt, it tends to make the crucial difference. The usual reason for assigning the advantage is to help the inferior team and keep the games close, except in those cases when the league has a larger narrative to protect.</p><p>For example, in the conference championship games, it was immediately clear that the refs were favoring Philadelphia and Kansas City. I didn’t initially understand why, since the “Andy Reid Bowl” story didn’t seem to justify it, until I read this line from Peter King’s regular Monday morning column.</p><p><em>Historic game: It’s the first of the 57 Super Bowls with two starting Black quarterbacks facing off. Mahomes plays in his third for Kansas City, Jalen Hurts in his first for Philadelphia</em></p><p>And there’s the missing piece. The narrative drives everything.</p><p>Philadelphia had absolutely no need of the assistance, as even an excellent 49ers team couldn’t hope to overcome the loss of both its quarterbacks to injury. (The NFL really should go back to 14 game regular seasons and 10 teams in the playoffs. They won’t, but they should in the interest of the quality of the games.) But Kansas City needed every bit of the thumb-on-the-scale in order to eke out a 23-20 win over Cincinnati; the Chiefs also required a failed two-minute drive by the Bengals offense plus an incredibly dumb but 100-percent legitimate penalty by a Bengals linebacker in order to kick the winning field goal in regular time.</p><p>As strange as it might sound, recognizing this pattern of subtle intervention tends to make the sport a little more interesting to me, not less. Now it all makes more sense, and I find myself particularly interested in the first two drives, just so I can work out which team is going to get the benefit of the dubious calls <em>at the important moments</em>. Because it’s also observable that the referees attempt to cover what I presume is their league-ordered bias by making a dubious call or two in favor of the disadvantaged team late in the game if that will help make the game closer. <em>See:</em> the ridiculous roughing-the-passer call against the Giants at the end of the Minnesota – New York game.</p><p>Now, I can understand if die-hard fans of the game find this hard to believe. But so far, the hypothesis has not been falsified.</p><p><strong>UPDATE: </strong>These penalty statistics are interesting, especially the comparison with the two previous games between Cincinnati and Kansas City.</p><ul class=\"wp-block-list\"><li>4-30, 2-11</li><li>6-55, 4-35</li><li>9-71, 4-55</li></ul><p>The statistics are similar for the NFC Championship game between San Francisco and Philadelphia.</p><ul class=\"wp-block-list\"><li>11-81, 4-34</li></ul><p>These discrepancies are particularly intriguing given the fact that the Bengals were the 2nd least penalized team in terms of yardage whereas the 49ers were the 12th least penalized team. The Eagles were 8th and the Chiefs were 20th.</p><p><em><a href=\"https://social.infogalactic.com/micropost/84f81ad0-1654-4736-a1ab-4b43a09ee6ea\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "While I stopped subscribing to NFL Game Pass and playing fantasy football after the NFL went woke, I still watch all the playoff games. But one thing that made it easier to invest considerably less time in the sport that I’ve followed since childhood was the observation I’d made around the same time, which is that the NFL Commissioner’s office appears to have gotten more aggressively involved in influencing the end results than in previous decades.\nWhile there were a few plays over the years that struck me as highly questionable, for the most part they appeared to be sporadic and generally free of any larger pattern. (\nSee:\nDrew Pearson a) catching the ball out of bounds, b) pushing off in\nthe 1975 Minnesota – Dallas game\n, and c) the two non-holding calls on both plays.) The approach has definitely changed, because it’s now become regularly recognizable which team the league would prefer to win the game by the end of the first drive by each team. Note that I said “drive”, not “possession”, because it’s usually impossible to learn anything from an initial three-and-out.\nA lot of this year’s playoff games were really good. And the NFL isn’t dictating or scripting the games, it appears to be content to simply put a thumb on the scale, giving the preferred team a small advantage that is worth somewhere between 3 and 7 points in the end. This is an advantage that can be overcome fairly easily by a superior or very well-coached team, but in contests in which the “game of inches” description is apt, it tends to make the crucial difference. The usual reason for assigning the advantage is to help the inferior team and keep the games close, except in those cases when the league has a larger narrative to protect.\nFor example, in the conference championship games, it was immediately clear that the refs were favoring Philadelphia and Kansas City. I didn’t initially understand why, since the “Andy Reid Bowl” story didn’t seem to justify it, until I read this line from Peter King’s regular Monday morning column.\nHistoric game: It’s the first of the 57 Super Bowls with two starting Black quarterbacks facing off. Mahomes plays in his third for Kansas City, Jalen Hurts in his first for Philadelphia\nAnd there’s the missing piece. The narrative drives everything.\nPhiladelphia had absolutely no need of the assistance, as even an excellent 49ers team couldn’t hope to overcome the loss of both its quarterbacks to injury. (The NFL really should go back to 14 game regular seasons and 10 teams in the playoffs. They won’t, but they should in the interest of the quality of the games.) But Kansas City needed every bit of the thumb-on-the-scale in order to eke out a 23-20 win over Cincinnati; the Chiefs also required a failed two-minute drive by the Bengals offense plus an incredibly dumb but 100-percent legitimate penalty by a Bengals linebacker in order to kick the winning field goal in regular time.\nAs strange as it might sound, recognizing this pattern of subtle intervention tends to make the sport a little more interesting to me, not less. Now it all makes more sense, and I find myself particularly interested in the first two drives, just so I can work out which team is going to get the benefit of the dubious calls\nat the important moments\n. Because it’s also observable that the referees attempt to cover what I presume is their league-ordered bias by making a dubious call or two in favor of the disadvantaged team late in the game if that will help make the game closer.\nSee:\nthe ridiculous roughing-the-passer call against the Giants at the end of the Minnesota – New York game.\nNow, I can understand if die-hard fans of the game find this hard to believe. But so far, the hypothesis has not been falsified.\nUPDATE:\nThese penalty statistics are interesting, especially the comparison with the two previous games between Cincinnati and Kansas City.\n4-30, 2-11\n6-55, 4-35\n9-71, 4-55\nThe statistics are similar for the NFC Championship game between San Francisco and Philadelphia.\n11-81, 4-34\nThese discrepancies are particularly intriguing given the fact that the Bengals were the 2nd least penalized team in terms of yardage whereas the 49ers were the 12th least penalized team. The Eagles were 8th and the Chiefs were 20th.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-01-30T23:30:38+00:00"
}