{
  "url": "https://voxday.net/2023/01/12/the-review-police/",
  "scraped_at": "2026-01-08T13:44:11.060984",
  "title": "The Review Police",
  "date_display": "January 12, 2023",
  "date_iso": "2023-01-12T11:58:29+00:00",
  "date_from_url": "2023-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Amazon <a href=\"https://www.newenglishreview.org/censored-again/\">is disappearing reviews</a> of disfavored books.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Like countless others, I’ve been reviewing products that I have bought on Amazon for almost a decade. Around a year ago, I favorably reviewed a book titled <em>SJWs Always Lie: Taking Down the Thought Police</em> (I recommend it). Reviews are in turn reviewed by Amazon apparatchiks prior to being posted. My review of the book was taken down for going against some general standards (which in this case I was criticizing leftists who censor).</p><p>Life went on. I kept reviewing books, CDs, clothes, etc. and my reviews were always brief, like others in the site. Sometimes my reviews involving books on or by leftists were characteristically caustic, but no one minded.</p><p>Except a month ago, with my review of <em>American Injustice</em> (an extended review was accepted here, in The Iconoclast). It was not accepted for the usual vague reasons (“violates our Community Guidelines”). I could appeal, which I did.</p><p>Whereupon all of my reviews were taken down. My reviews on electronics, on t-shirts, on shoes, on books, on games, on films—all taken down. Apparently, the leftist censor thought that my reviews of Jorge Bolet. Rediscovered Liszt Recital, Midnight in the Garden of Good and Evil, The Moon Is a Harsh Mistress, All Creatures Great and Small, Batman Forever, The Confessions of St. Augustine, Duck Tales Vol.1, Gandhi: An Autobiography, Blue Jasmine, World War Z, 20 Million Miles to Earth, Fifty Shades of Grey, The Essential Artie Shaw, Jimmy Neutron- The Best of Season 2, Darwin’s Blind Spot: Evolution Beyond Natural Selection, The Biosphere, Lysenko’s Ghost: Epigenetics and Russia, Littleboutique Fashion Magazine Show Stiletto Sandals Nigh Club Strap Pumps, Basic Questions in Paleontology, The 39 Steps, The mosquito hypothetically considered as an agent in the transmission of yellow fever poison, 1881, 1177 B.C.: The Year Civilization Collapsed, The Sex Lives of Cannibals, and many, many, many more were worthy of censorship.</p><p>Gone. All gone.</p><p>I appealed, of course, several times. Ignored each time.</p></blockquote><p>I’m not terribly surprised. I think this began around the middle of 2021, as you can see that there are relatively few reviews of SJWAL or A THRONE OF BONES that have been published in the last two years. I haven’t paid any attention to Amazon for a while, since I’ve been focused on other projects for most of that time, but it appears that in the aftermath of decimating the ebook market and centralizing its control of it through Kindle Unlimited, Amazon has now moved on to actively managing what books its customers are permitted to read or not by filtering its reviewers.</p><p>There are <a href=\"https://www.amazon.com/SJWs-Always-Lie-Taking-Thought/dp/9527065682/\">884 reviews of SJWAL</a>, but the most recent is dated October 18, 2021. There are <a href=\"https://www.amazon.com/Throne-Bones-Arts-Dark-Light-ebook/dp/B00I6H0J7S/\">443 reviews of ATOB</a>, and the most recent is September 19, 2022.</p><p><strong>UPDATE:</strong> Amazon has deleted 11 ATOB reviews since this post, leaving 432.</p><p><em><a href=\"https://social.infogalactic.com/micropost/c2bfb850-3644-437e-b8a6-cc5858d42d25\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Amazon\nis disappearing reviews\nof disfavored books.\nLike countless others, I’ve been reviewing products that I have bought on Amazon for almost a decade. Around a year ago, I favorably reviewed a book titled\nSJWs Always Lie: Taking Down the Thought Police\n(I recommend it). Reviews are in turn reviewed by Amazon apparatchiks prior to being posted. My review of the book was taken down for going against some general standards (which in this case I was criticizing leftists who censor).\nLife went on. I kept reviewing books, CDs, clothes, etc. and my reviews were always brief, like others in the site. Sometimes my reviews involving books on or by leftists were characteristically caustic, but no one minded.\nExcept a month ago, with my review of\nAmerican Injustice\n(an extended review was accepted here, in The Iconoclast). It was not accepted for the usual vague reasons (“violates our Community Guidelines”). I could appeal, which I did.\nWhereupon all of my reviews were taken down. My reviews on electronics, on t-shirts, on shoes, on books, on games, on films—all taken down. Apparently, the leftist censor thought that my reviews of Jorge Bolet. Rediscovered Liszt Recital, Midnight in the Garden of Good and Evil, The Moon Is a Harsh Mistress, All Creatures Great and Small, Batman Forever, The Confessions of St. Augustine, Duck Tales Vol.1, Gandhi: An Autobiography, Blue Jasmine, World War Z, 20 Million Miles to Earth, Fifty Shades of Grey, The Essential Artie Shaw, Jimmy Neutron- The Best of Season 2, Darwin’s Blind Spot: Evolution Beyond Natural Selection, The Biosphere, Lysenko’s Ghost: Epigenetics and Russia, Littleboutique Fashion Magazine Show Stiletto Sandals Nigh Club Strap Pumps, Basic Questions in Paleontology, The 39 Steps, The mosquito hypothetically considered as an agent in the transmission of yellow fever poison, 1881, 1177 B.C.: The Year Civilization Collapsed, The Sex Lives of Cannibals, and many, many, many more were worthy of censorship.\nGone. All gone.\nI appealed, of course, several times. Ignored each time.\nI’m not terribly surprised. I think this began around the middle of 2021, as you can see that there are relatively few reviews of SJWAL or A THRONE OF BONES that have been published in the last two years. I haven’t paid any attention to Amazon for a while, since I’ve been focused on other projects for most of that time, but it appears that in the aftermath of decimating the ebook market and centralizing its control of it through Kindle Unlimited, Amazon has now moved on to actively managing what books its customers are permitted to read or not by filtering its reviewers.\nThere are\n884 reviews of SJWAL\n, but the most recent is dated October 18, 2021. There are\n443 reviews of ATOB\n, and the most recent is September 19, 2022.\nUPDATE:\nAmazon has deleted 11 ATOB reviews since this post, leaving 432.\nDISCUSS ON SG",
  "tags": [
    "books",
    "reviews",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-01-12T21:28:36+00:00"
}