{
  "url": "https://voxday.net/2023/01/01/traffic-report-2022/",
  "scraped_at": "2026-01-08T13:42:59.218757",
  "title": "Traffic Report 2022",
  "date_display": "January 1, 2023",
  "date_iso": "2023-01-01T12:09:23+00:00",
  "date_from_url": "2023-01-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>2022 was another year in which I failed to finish <em>A SEA OF SKULLS</em>. It was also a year that saw the full effects of Google’s banning of the blog, as the precipitous decline to 12 million annual views from the previous year was actually smaller than the immediate month-on-month decline. Shadowbanning and deplatforming works, to a certain extent, which is why they do it. I also suspect that people are just exhausted with vaccine-related news, given that it’s mostly a grim chronicle of things going from bad to worse for the majority of the population. One can only read so many stories about young men and women dying from Suddenly before tapping out.</p><p>In 2022, Vox Popoli had 12,018,040 Google pageviews, down 69 percent from last year. The blog is now running at an average rate of 30,307 daily pageviews, down 17.9 percent from an average 36,091 last year. Total historic blog views closed out the year at 264,572,806. The running annual pageview totals are as follows:</p><p>2008: 3,496,757</p><p>2009: 4,414,801</p><p>2010: 4,827,183</p><p>2011: 5,422,628</p><p>2012: 6,098,774</p><p>2013: 9,340,663</p><p>2014: 11,236,085</p><p>2015: 16,211,875</p><p>2016: 25,817,343</p><p>2017: 31,216,357</p><p>2018: 32,260,094</p><p>2019: 32,757,068</p><p>2020: 41,338,037</p><p>2021: 38,884,355</p><p>2022: 12,018,040</p><p>It appears that it is time to retire the annual comparison to the former Most Popular Blog in Science Fiction, because there is no data to which this blog’s traffic can be compared. Also, <em>Whatever </em>now features as many posts by Scalzi’s daughter, with whom I have no issue, as it does by Scalzi himself, so the comparison is not even all that relevant anymore.</p><p>To be honest, this year feels a bit like the passing of a torch, not to any one individual, but rather, to the community as a whole. No one actually needs to visit here to access my ideas anymore, not when a single video promulgating concepts first presented here has 21 million views. This is not a complaint, but rather, an observation made with no little sense of satisfaction; it’s very freeing to know that others will not only take on the burden of spreading the ideas around, but will do so far more effectively than I ever have.</p><p>Intellectual success isn’t people knowing your name, it’s people embracing your ideas without ever needing to know your name. Having reached the point of having self-appointed populizers means being able to focus on breaking new ground rather than simply repeating the same basic things over and over again.</p><p>I won’t be taking a step back or reducing blog posts and Darkstreams, but I will attempt to focus them less on the operational details and other distractions and more on the core ideas. The Bindery, Selenoth, and a revival of Castalia’s traditional publishing are my top priorities for the new year; among other things, we’ll be publishing THREE new Conan novels by The Legend Chuck Dixon in 2023.</p><p><em><a href=\"https://social.infogalactic.com/micropost/51b5191a-dbf3-4845-a62d-a7c436f46518\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "2022 was another year in which I failed to finish\nA SEA OF SKULLS\n. It was also a year that saw the full effects of Google’s banning of the blog, as the precipitous decline to 12 million annual views from the previous year was actually smaller than the immediate month-on-month decline. Shadowbanning and deplatforming works, to a certain extent, which is why they do it. I also suspect that people are just exhausted with vaccine-related news, given that it’s mostly a grim chronicle of things going from bad to worse for the majority of the population. One can only read so many stories about young men and women dying from Suddenly before tapping out.\nIn 2022, Vox Popoli had 12,018,040 Google pageviews, down 69 percent from last year. The blog is now running at an average rate of 30,307 daily pageviews, down 17.9 percent from an average 36,091 last year. Total historic blog views closed out the year at 264,572,806. The running annual pageview totals are as follows:\n2008: 3,496,757\n2009: 4,414,801\n2010: 4,827,183\n2011: 5,422,628\n2012: 6,098,774\n2013: 9,340,663\n2014: 11,236,085\n2015: 16,211,875\n2016: 25,817,343\n2017: 31,216,357\n2018: 32,260,094\n2019: 32,757,068\n2020: 41,338,037\n2021: 38,884,355\n2022: 12,018,040\nIt appears that it is time to retire the annual comparison to the former Most Popular Blog in Science Fiction, because there is no data to which this blog’s traffic can be compared. Also,\nWhatever\nnow features as many posts by Scalzi’s daughter, with whom I have no issue, as it does by Scalzi himself, so the comparison is not even all that relevant anymore.\nTo be honest, this year feels a bit like the passing of a torch, not to any one individual, but rather, to the community as a whole. No one actually needs to visit here to access my ideas anymore, not when a single video promulgating concepts first presented here has 21 million views. This is not a complaint, but rather, an observation made with no little sense of satisfaction; it’s very freeing to know that others will not only take on the burden of spreading the ideas around, but will do so far more effectively than I ever have.\nIntellectual success isn’t people knowing your name, it’s people embracing your ideas without ever needing to know your name. Having reached the point of having self-appointed populizers means being able to focus on breaking new ground rather than simply repeating the same basic things over and over again.\nI won’t be taking a step back or reducing blog posts and Darkstreams, but I will attempt to focus them less on the operational details and other distractions and more on the core ideas. The Bindery, Selenoth, and a revival of Castalia’s traditional publishing are my top priorities for the new year; among other things, we’ll be publishing THREE new Conan novels by The Legend Chuck Dixon in 2023.\nDISCUSS ON SG",
  "tags": [
    "books",
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2023-01-01T12:17:38+00:00"
}