{
  "url": "https://voxday.net/2009/02/20/bill-moyers-fairy-hunter/",
  "scraped_at": "2026-01-08T22:48:35.776775",
  "title": "Bill Moyers: Fairy Hunter",
  "date_display": "February 20, 2009",
  "date_iso": "2009-02-20T10:32:00+00:00",
  "date_from_url": "2009-02-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Somehow, it’s totally unsurprising to learn that of the most despicably sanctimonious members of the liberal media elite <a href=\"http://www.washingtonpost.com/wp-dyn/content/article/2009/02/18/AR2009021803819.html?hpid=topnews\">was a professional character assassin</a>:</p><blockquote><p>Bill Moyers, a White House aide now best known as a liberal television commentator, is described in the records as seeking information on the sexual preferences of White House staff members.</p></blockquote><p>Moyers is playing forgetful, of course, but it’s obvious from <a href=\"http://www.opinionjournal.com/editorial/feature.html?id=110006987\">this 2005 Wall Street Journal article</a> that he remembers exactly what he did.  Given the surprising number of extant examples, from Robert Byrd’s KKK membership to Bill Moyers’s queer hunting, it’s pretty clear that when white male liberals accuse conservatives of being intolerant, they’re psychologically projecting and inaccurately attributing political opposition to personal issues akin to their own.</p><p>It’s delightful to know that the fact that these revelations were made in the Washington Post will not only permanently taint the reputation of the self-proclaimed St. Moyers, especially in PBS-listening circles, but Moyers knows it will.  And it’s more than a little ironic that people who make personal judgments based on religion and ideology tend to assume that someone like me, who quite happily worked with an openly gay music label, is intolerant or even hateful, while the man who was paid to hunt out closeted gay men and destroy their careers is a paragon of tolerance.</p></div>",
  "content_text": "Somehow, it’s totally unsurprising to learn that of the most despicably sanctimonious members of the liberal media elite\nwas a professional character assassin\n:\nBill Moyers, a White House aide now best known as a liberal television commentator, is described in the records as seeking information on the sexual preferences of White House staff members.\nMoyers is playing forgetful, of course, but it’s obvious from\nthis 2005 Wall Street Journal article\nthat he remembers exactly what he did.  Given the surprising number of extant examples, from Robert Byrd’s KKK membership to Bill Moyers’s queer hunting, it’s pretty clear that when white male liberals accuse conservatives of being intolerant, they’re psychologically projecting and inaccurately attributing political opposition to personal issues akin to their own.\nIt’s delightful to know that the fact that these revelations were made in the Washington Post will not only permanently taint the reputation of the self-proclaimed St. Moyers, especially in PBS-listening circles, but Moyers knows it will.  And it’s more than a little ironic that people who make personal judgments based on religion and ideology tend to assume that someone like me, who quite happily worked with an openly gay music label, is intolerant or even hateful, while the man who was paid to hunt out closeted gay men and destroy their careers is a paragon of tolerance.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-02-20T10:32:00+00:00"
}