{
  "url": "https://voxday.net/2009/02/19/confusing-effort-with-resu/",
  "scraped_at": "2026-01-08T22:48:30.311798",
  "title": "Confusing effort with result",
  "date_display": "February 19, 2009",
  "date_iso": "2009-02-19T15:30:00+00:00",
  "date_from_url": "2009-02-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>University educations <a href=\"http://www.nytimes.com/2009/02/18/education/18college.html?em\">are totally wasted</a> on these crippled minds:</p><blockquote><p>Nearly two-thirds of the students surveyed said that if they explained to a professor that they were trying hard, that should be taken into account in their grade.  Jason Greenwood, a senior kinesiology major at the University of Maryland echoed that view.</p><p>“I think putting in a lot of effort should merit a high grade,” Mr. Greenwood said. “What else is there really than the effort that you put in?”</p><p>“If you put in all the effort you have and get a C, what is the point?” he added. “If someone goes to every class and reads every chapter in the book and does everything the teacher asks of them and more, then they should be getting an A like their effort deserves. If your maximum effort can only be average in a teacher’s mind, then something is wrong.”</p></blockquote><p>What else is there?  I don’t know, perhaps <i>demonstrating that you actually learned anything.</i> Now, I’m probably more skeptical than most about the idea that receiving good grades and acquiring academic knowledge is a reliable indicator that one is actually useful for anything, but if an A now means nothing more than the retarded kid managing to avoid eating the pages out of his textbook and humping his female classmates during the lectures, there will be no loss in shutting down the entire university system today.</p><p>And to think people are accepting a lifetime of debt for these magic pieces of worthless paper….</p><p>As for me, I could not possibly care less how hard people try.  I’m only interested in results and I much prefer those who achieve them by working smart to those who do it by working hard.  If you can deliver results while rolling out of bed at the crack of noon and taking hourly bong breaks, that’s just fine with me.  Excellence often requires effort, but it should never be equated with it.</p></div>",
  "content_text": "University educations\nare totally wasted\non these crippled minds:\nNearly two-thirds of the students surveyed said that if they explained to a professor that they were trying hard, that should be taken into account in their grade.  Jason Greenwood, a senior kinesiology major at the University of Maryland echoed that view.\n“I think putting in a lot of effort should merit a high grade,” Mr. Greenwood said. “What else is there really than the effort that you put in?”\n“If you put in all the effort you have and get a C, what is the point?” he added. “If someone goes to every class and reads every chapter in the book and does everything the teacher asks of them and more, then they should be getting an A like their effort deserves. If your maximum effort can only be average in a teacher’s mind, then something is wrong.”\nWhat else is there?  I don’t know, perhaps\ndemonstrating that you actually learned anything.\nNow, I’m probably more skeptical than most about the idea that receiving good grades and acquiring academic knowledge is a reliable indicator that one is actually useful for anything, but if an A now means nothing more than the retarded kid managing to avoid eating the pages out of his textbook and humping his female classmates during the lectures, there will be no loss in shutting down the entire university system today.\nAnd to think people are accepting a lifetime of debt for these magic pieces of worthless paper….\nAs for me, I could not possibly care less how hard people try.  I’m only interested in results and I much prefer those who achieve them by working smart to those who do it by working hard.  If you can deliver results while rolling out of bed at the crack of noon and taking hourly bong breaks, that’s just fine with me.  Excellence often requires effort, but it should never be equated with it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-02-19T15:30:00+00:00"
}