{
  "url": "https://voxday.net/2009/02/16/elder-exits/",
  "scraped_at": "2026-01-08T22:48:13.980904",
  "title": "The Elder exits",
  "date_display": "February 16, 2009",
  "date_iso": "2009-02-16T16:30:00+00:00",
  "date_from_url": "2009-02-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I would be remiss if I failed to note that Chad the Elder of the Fraters Libertas, that longtime stalwart of the Northern Alliance Radio Show, <a href=\"http://www.fraterslibertas.com/2009/02/somethings-got-to-give.html\">announced the end of his radio career last week</a>.  I always enjoyed being a guest on the show, and very much appreciated his favorable blurb of <i>The Irrational Atheist</i>.  He will be sadly missed by at least 14 of the 67 people in the Twin Cities who still have AM radio.</p><p>I wish him the very best of fortune in his future endeavors, and eagerly anticipate what will surely be his inevitable Favrean return to radio when the itch to perform on the audio stage overwhelms him this autumn.</p><p>As always, the Nihilist in Golf Pants has <a href=\"http://nihlist.blogspot.com/2009/02/top-11-real-reasons-chad-elder-is.html\">the real story behind the story</a>.</p></div>",
  "content_text": "I would be remiss if I failed to note that Chad the Elder of the Fraters Libertas, that longtime stalwart of the Northern Alliance Radio Show,\nannounced the end of his radio career last week\n.  I always enjoyed being a guest on the show, and very much appreciated his favorable blurb of\nThe Irrational Atheist\n.  He will be sadly missed by at least 14 of the 67 people in the Twin Cities who still have AM radio.\nI wish him the very best of fortune in his future endeavors, and eagerly anticipate what will surely be his inevitable Favrean return to radio when the itch to perform on the audio stage overwhelms him this autumn.\nAs always, the Nihilist in Golf Pants has\nthe real story behind the story\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-02-16T16:30:00+00:00"
}