{
  "url": "https://voxday.net/2009/02/10/flaw-in-geithners-logic/",
  "scraped_at": "2026-01-08T22:47:46.015238",
  "title": "The flaw in Geithner’s logic",
  "date_display": "February 10, 2009",
  "date_iso": "2009-02-10T18:03:00+00:00",
  "date_from_url": "2009-02-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Treasury Secretary <a href=\"http://www.reuters.com/article/ousiv/idUSTRE5194C920090210?sp=true\">talks</a>:</p><p><b>“As President Obama said in his inaugural address, our economic strength is derived from ‘the doers, the makers of things.”</b></p><p>True.</p><p><b>“The innovators who create and expand enterprises.”</b></p><p>True.</p><p><b>“The workers who provide life to companies and, with their earnings, support families and invest in their future… This is what drives economic growth.”</b></p><p>True, in combination with the first two statements.</p><p><b>“The financial system is central to this process, transforming the earnings and savings of American workers into the loans that finance a first home, a new car or a college education, the credit necessary to build a company around a new idea.”</b></p><p>Partially true, but the underlying implication is false.  Credit only allows the speeding up of the process.  This is not necessarily a good thing.</p><p><b>“Without credit, economies cannot grow, and right now, critical parts of our financial system are damaged.</b></p><p>The financial system may be damaged, but it is not critical and the first part of the statement is totally false.  Most economic growth throughout human history has taken place in the absence of credit, but rather has resulted from savings.   This savings can also be used as credit, or leveraged into credit inflation, but its main use is for non-credit investment or delayed consumption.  It’s worth noting that as every AGDer knows, credit in its inflated form is the primary cause of the investment misallocations and overstimulated consumption that cause economic <i>contraction</i>.</p></div>",
  "content_text": "The Treasury Secretary\ntalks\n:\n“As President Obama said in his inaugural address, our economic strength is derived from ‘the doers, the makers of things.”\nTrue.\n“The innovators who create and expand enterprises.”\nTrue.\n“The workers who provide life to companies and, with their earnings, support families and invest in their future… This is what drives economic growth.”\nTrue, in combination with the first two statements.\n“The financial system is central to this process, transforming the earnings and savings of American workers into the loans that finance a first home, a new car or a college education, the credit necessary to build a company around a new idea.”\nPartially true, but the underlying implication is false.  Credit only allows the speeding up of the process.  This is not necessarily a good thing.\n“Without credit, economies cannot grow, and right now, critical parts of our financial system are damaged.\nThe financial system may be damaged, but it is not critical and the first part of the statement is totally false.  Most economic growth throughout human history has taken place in the absence of credit, but rather has resulted from savings.   This savings can also be used as credit, or leveraged into credit inflation, but its main use is for non-credit investment or delayed consumption.  It’s worth noting that as every AGDer knows, credit in its inflated form is the primary cause of the investment misallocations and overstimulated consumption that cause economic\ncontraction\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-02-10T18:03:00+00:00"
}