{
  "url": "https://voxday.net/2009/02/22/it-would-be-difficult-to-care-less/",
  "scraped_at": "2026-01-08T22:48:48.464855",
  "title": "It would be difficult to care less",
  "date_display": "February 22, 2009",
  "date_iso": "2009-02-22T10:50:00+00:00",
  "date_from_url": "2009-02-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since I don’t know anyone <a href=\"http://www.deadlinehollywooddaily.com/oscars-crisis-hollywood-frustrations-and-fears-over-sundays-awards-stars-and-advertisers-give-show-cold-shoulder/\">who watches the Oscars</a>.  Spacebunny likes the red carpet action, but she doesn’t ever watch the actual show.  It seems pretty obvious that traditional live-action Hollywood is well along the path already trod by Broadway; a gay ghetto that 98 percent of the men and a large majority of women simply don’t ever think about:</p><blockquote><p>The people who put on the Academy Awards are in a flopsweat panic as the hours tick away before this year’s big broadcast, which is having its major rehearsal and technical run-through today. For weeks now, they’ve been begging me and the other journalists who cover the Oscars not to trash the planning and performances for this year’s telecast like we have in years past. Because their frustration and fear is that, if Sunday’s top-to-bottom reworked show can’t bring back viewers after 2008’s sunk to its lowest ratings ever, then nothing will. And the worst part is that not even Hollywood wants to participate in the Oscars anymore….</p><p>One new idea thought up by the producers that will be seen Sunday? Trophy boys. The result is that very handsome young men will now join very beautiful young women on stage carrying out the Oscar statuettes. If that’s not an acknowledgement that viewership for the Academy Awards these days is limited to only females and gays, I don’t know what is.</p></blockquote><p>I concluded very early on that the movie awards were a complete charade when the greatest movie in the history of film-making didn’t win an Oscar for best movie.  Since <i>Star Wars</i> was spurned by the Academy voters, I haven’t paid the Academy Awards a speck of notice.  Of course, I don’t even watch movies these days; the last one I saw in the theatre was <i>The Return of the King</i>.  The next one will be <i>The Hobbit</i>.</p><p>The interesting thing is the way that animation, and eventually game-based machinima, are coming to replace the live-action movie.  I don’t know about you, but I, for one, tend to think that the inevitable decline in status of the Hollywood actor can’t be anything but a good thing for society.</p><p>The comments are hilarious, by the way.  Especially those made by California liberals failing to make the connection between labling half the population as mouth-breathing rednecks and the increased unwillingness of American audiences to buy movie tickets.  In the immortal words of Chuck D: “Burn, Hollywood, burn!”  Or, as one commenter put it: “<i>The best thing that could happen to the USA is that we get nuked in two areas. Hollywood and Washington. They are both full of hypocrites and crooks.”</i></p><p>Throw in New York City and America might actually have a shot at retaining a dominant position in the 21st century too.</p></div>",
  "content_text": "Since I don’t know anyone\nwho watches the Oscars\n.  Spacebunny likes the red carpet action, but she doesn’t ever watch the actual show.  It seems pretty obvious that traditional live-action Hollywood is well along the path already trod by Broadway; a gay ghetto that 98 percent of the men and a large majority of women simply don’t ever think about:\nThe people who put on the Academy Awards are in a flopsweat panic as the hours tick away before this year’s big broadcast, which is having its major rehearsal and technical run-through today. For weeks now, they’ve been begging me and the other journalists who cover the Oscars not to trash the planning and performances for this year’s telecast like we have in years past. Because their frustration and fear is that, if Sunday’s top-to-bottom reworked show can’t bring back viewers after 2008’s sunk to its lowest ratings ever, then nothing will. And the worst part is that not even Hollywood wants to participate in the Oscars anymore….\nOne new idea thought up by the producers that will be seen Sunday? Trophy boys. The result is that very handsome young men will now join very beautiful young women on stage carrying out the Oscar statuettes. If that’s not an acknowledgement that viewership for the Academy Awards these days is limited to only females and gays, I don’t know what is.\nI concluded very early on that the movie awards were a complete charade when the greatest movie in the history of film-making didn’t win an Oscar for best movie.  Since\nStar Wars\nwas spurned by the Academy voters, I haven’t paid the Academy Awards a speck of notice.  Of course, I don’t even watch movies these days; the last one I saw in the theatre was\nThe Return of the King\n.  The next one will be\nThe Hobbit\n.\nThe interesting thing is the way that animation, and eventually game-based machinima, are coming to replace the live-action movie.  I don’t know about you, but I, for one, tend to think that the inevitable decline in status of the Hollywood actor can’t be anything but a good thing for society.\nThe comments are hilarious, by the way.  Especially those made by California liberals failing to make the connection between labling half the population as mouth-breathing rednecks and the increased unwillingness of American audiences to buy movie tickets.  In the immortal words of Chuck D: “Burn, Hollywood, burn!”  Or, as one commenter put it: “\nThe best thing that could happen to the USA is that we get nuked in two areas. Hollywood and Washington. They are both full of hypocrites and crooks.”\nThrow in New York City and America might actually have a shot at retaining a dominant position in the 21st century too.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-02-22T10:50:00+00:00"
}