{
  "url": "https://voxday.net/2009/02/05/karaoke-challenge/",
  "scraped_at": "2026-01-08T22:47:18.545697",
  "title": "Karaoke challenge",
  "date_display": "February 5, 2009",
  "date_iso": "2009-02-05T15:24:00+00:00",
  "date_from_url": "2009-02-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Responsible Puppet <a href=\"http://jamsco.wordpress.com/2009/01/26/your-best-song-meme/\">throws down the gauntlet</a>:</p><blockquote><p>List the song or songs that you would perform best in a karaoke situation. Note: The songs should be somewhat mainstream.</p><p> Extra points for:</p><p>– A list of more than one song.</p><p>– Songs that you are a bit embarrassed to know that well, or that might surprise others.</p><p>– Mentioning how much preparation you would require (i.e – Would require a half an hour to learn the notes/word, would require no time, but you would need the lyrics in front of you, would require no time and you would not need the lyrics.)</p></blockquote><p>With the caveat that I’m not exactly up on most popular music from any era except perhaps the mid-1980s, my list, for which I would not need the lyrics, is as follows:</p><p>1. <a href=\"http://www.youtube.com/watch?v=DCKQ3ZNkivY\">Fuck Her Gently</a> – Tenacious D.  I can’t stand campfire guitar music, so I learned all the lyrics to this just in case I ever found myself trapped in another Bible study singalong situation.  Also, it’s beyond awesome.</p><p>2. <a href=\"http://www.youtube.com/watch?v=YrAT9b9WokY\">Down with the Sickness</a> – Disturbed.  This is the only one I’ve actually sung at a karaoke bar.  It brought down a house quite obviously more accustomed to serious karaoke practitioners singing Whitney Houston and Dan Fogelberg.  Okay, perhaps “left it wide-eyed and shell-shocked” might be a better description.  The White Buffalo and Big Chilly can testify; they were there.</p><p>3. <a href=\"http://www.youtube.com/watch?v=E2dgMNm64Mg\">Orpheus </a>– David Sylvian.  One of my all-time favorite songs, although there are two low notes that I’d have to be a bit lucky to hit properly.</p><p>4. <a href=\"http://www.youtube.com/watch?v=oiS8YokFzeY\">The Wind Beneath My Wings</a> – Bette Midler.  I’m totally kidding.  I’m not really sure what song this is, as I tend to confuse it with that “turn around bright eyes” one.  Assuming, of course, that they are different songs.  They are, aren’t they?  Actually <a href=\"http://www.youtube.com/watch?v=HTN6Du3MCgI\">this</a>.</p><p>5. <a href=\"http://www.youtube.com/watch?v=VCD4rtcOgHE\">Save a Prayer</a> – Duran Duran.  I sang this one at a concert a long, long time ago.  It went down rather well, especially with the young ladies, but then, as you can see, I did have that sweet Nick Rhodes hair going at the time.</p><p><a href=\"http://3.bp.blogspot.com/_3UXl0oMYPLs/SYsa9DrhbBI/AAAAAAAAAGg/o8XrhZcO7hE/s1600-h/voxhs.jpg\" onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\"><noscript><img alt=\"\" border=\"0\" decoding=\"async\" id=\"BLOGGER_PHOTO_ID_5299359022793714706\" src=\"http://www.milobookclub.com/wp-content/uploads/2009/02/voxhs.jpg\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;width: 242px; height: 320px;\"/></noscript><img alt=\"\" border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2009/02/voxhs.jpg\" decoding=\"async\" id=\"BLOGGER_PHOTO_ID_5299359022793714706\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;width: 242px; height: 320px;\"/></a></p></div>",
  "content_text": "The Responsible Puppet\nthrows down the gauntlet\n:\nList the song or songs that you would perform best in a karaoke situation. Note: The songs should be somewhat mainstream.\nExtra points for:\n– A list of more than one song.\n– Songs that you are a bit embarrassed to know that well, or that might surprise others.\n– Mentioning how much preparation you would require (i.e – Would require a half an hour to learn the notes/word, would require no time, but you would need the lyrics in front of you, would require no time and you would not need the lyrics.)\nWith the caveat that I’m not exactly up on most popular music from any era except perhaps the mid-1980s, my list, for which I would not need the lyrics, is as follows:\n1.\nFuck Her Gently\n– Tenacious D.  I can’t stand campfire guitar music, so I learned all the lyrics to this just in case I ever found myself trapped in another Bible study singalong situation.  Also, it’s beyond awesome.\n2.\nDown with the Sickness\n– Disturbed.  This is the only one I’ve actually sung at a karaoke bar.  It brought down a house quite obviously more accustomed to serious karaoke practitioners singing Whitney Houston and Dan Fogelberg.  Okay, perhaps “left it wide-eyed and shell-shocked” might be a better description.  The White Buffalo and Big Chilly can testify; they were there.\n3.\nOrpheus\n– David Sylvian.  One of my all-time favorite songs, although there are two low notes that I’d have to be a bit lucky to hit properly.\n4.\nThe Wind Beneath My Wings\n– Bette Midler.  I’m totally kidding.  I’m not really sure what song this is, as I tend to confuse it with that “turn around bright eyes” one.  Assuming, of course, that they are different songs.  They are, aren’t they?  Actually\nthis\n.\n5.\nSave a Prayer\n– Duran Duran.  I sang this one at a concert a long, long time ago.  It went down rather well, especially with the young ladies, but then, as you can see, I did have that sweet Nick Rhodes hair going at the time.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-02-05T15:24:00+00:00"
}