{
  "url": "https://voxday.net/2009/02/18/legendary/",
  "scraped_at": "2026-01-08T22:48:23.175709",
  "title": "Legendary",
  "date_display": "February 18, 2009",
  "date_iso": "2009-02-18T11:09:00+00:00",
  "date_from_url": "2009-02-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The art of MMO gaming reaches a new height as Band Of Brothers, the most powerful alliance in Eve, is taken apart… <a href=\"http://www.neogaf.com/forum/showpost.php?p=14665239&amp;postcount=121\">from the inside</a>:</p><blockquote><p> noooooo<br> dice<br> is not in the allince<br> wtf<br> nor is finfl<br> omg<br> The war between FinFleet and Abbach Alliance is coming to an end. FinFleet has surrendered to Abbach Alliance. The war will be declared as being over after approximately 24 hours.<br> someone did a bubu ..<br> um<br> Um…<br> the allince<br> that’s going to be interesting<br> dotn exisit anymore ?<br> no<br> bob is closed<br> looks like bob closed<br> FUCK<br>…<br> who is arkannen<br> a gm ?<br> dian said he was sure it was paid<br> I am almost certain it was paid<br> and cflux, there’s no record of ANY alliance reg fee ever being paid<br> Mako: arkannen? arkanon? hes the internal security guy<br> and the last one<br> is listed as the 8th of jan<br> so no, this should not be happening<br> and the one before that<br> is december<br> exactly a month before<br> so yeh, no fucking way<br> who is arkannen<br> so it should go down on 8th feb?<br> Mako: arkannen? arkanon? hes the internal security guy<br> who is gonna sit online<br> that I can direct a gm to?<br> i can be online<br> all night<br> I can too<br> i can be online as well<br> till 11 or so<br> Same for Evol<br> some with that name took al the wallet from hat<br> *all night<br> wtf?<br> and left reson<br> huh<br> the mittani says hi<br> first one who gets contact of a GM, tell him we need our constellation sovs returned<br> omg<br> you have got to be shitting<br> Arkannen – Haargoth Agamar<br> rut roh</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Since that dialogue probably didn’t make a whole lot of sense to the uninitiated, read <a href=\"http://www.neogaf.com/forum/showpost.php?p=14666827&amp;postcount=129\">the full explanation of the exploit</a> to appreciate how brutally brilliant it was.  Long live The Mittani!  And every gamer has to love the triumphant ruthlessness of those who are leading the charge to trample upon <a href=\"http://go-dl1.eve-files.com/media/corp/verite/20090204.png\">the formerly mighty</a> now that they <a href=\"http://go-dl1.eve-files.com/media/corp/Verite/influence.png\">are fallen</a>:</p><p><i>I believe it’s pretty clear to you by now that we are pretty systemically destroying you. Within a very short period of time Delve will belong to Goonswarm and camped into stations or not, there is nothing at all you can do about it. Were I Remedial this would be about the time I’d offer you terms of surrender. I am not Remedial however. I do not want nor care for your surrender. I want every single second of this to hurt. I want it to be as painful for you as possible and I have the people behind me to make this happen….</i></p><p>Your time is over. This is as it should be.</p></div>",
  "content_text": "The art of MMO gaming reaches a new height as Band Of Brothers, the most powerful alliance in Eve, is taken apart…\nfrom the inside\n:\nnoooooo\ndice\nis not in the allince\nwtf\nnor is finfl\nomg\nThe war between FinFleet and Abbach Alliance is coming to an end. FinFleet has surrendered to Abbach Alliance. The war will be declared as being over after approximately 24 hours.\nsomeone did a bubu ..\num\nUm…\nthe allince\nthat’s going to be interesting\ndotn exisit anymore ?\nno\nbob is closed\nlooks like bob closed\nFUCK\n…\nwho is arkannen\na gm ?\ndian said he was sure it was paid\nI am almost certain it was paid\nand cflux, there’s no record of ANY alliance reg fee ever being paid\nMako: arkannen? arkanon? hes the internal security guy\nand the last one\nis listed as the 8th of jan\nso no, this should not be happening\nand the one before that\nis december\nexactly a month before\nso yeh, no fucking way\nwho is arkannen\nso it should go down on 8th feb?\nMako: arkannen? arkanon? hes the internal security guy\nwho is gonna sit online\nthat I can direct a gm to?\ni can be online\nall night\nI can too\ni can be online as well\ntill 11 or so\nSame for Evol\nsome with that name took al the wallet from hat\n*all night\nwtf?\nand left reson\nhuh\nthe mittani says hi\nfirst one who gets contact of a GM, tell him we need our constellation sovs returned\nomg\nyou have got to be shitting\nArkannen – Haargoth Agamar\nrut roh\nSince that dialogue probably didn’t make a whole lot of sense to the uninitiated, read\nthe full explanation of the exploit\nto appreciate how brutally brilliant it was.  Long live The Mittani!  And every gamer has to love the triumphant ruthlessness of those who are leading the charge to trample upon\nthe formerly mighty\nnow that they\nare fallen\n:\nI believe it’s pretty clear to you by now that we are pretty systemically destroying you. Within a very short period of time Delve will belong to Goonswarm and camped into stations or not, there is nothing at all you can do about it. Were I Remedial this would be about the time I’d offer you terms of surrender. I am not Remedial however. I do not want nor care for your surrender. I want every single second of this to hurt. I want it to be as painful for you as possible and I have the people behind me to make this happen….\nYour time is over. This is as it should be.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-02-18T11:09:00+00:00"
}