{
  "url": "https://voxday.net/2009/02/23/little-old-ones/",
  "scraped_at": "2026-01-08T22:48:55.855587",
  "title": "The Little Old Ones",
  "date_display": "February 23, 2009",
  "date_iso": "2009-02-23T19:30:00+00:00",
  "date_from_url": "2009-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I think Jamie will rather like this one.  It’s a very good quasi-remake of Blackbox’s <i>Ride on Time</i> by J-ax, a Milanese rapper, called <a href=\"http://www.youtube.com/watch?v=0YUbrAzThcc\">I Vecchietti Fanno O</a>.  It’s very catchy and is on all the time at the gym lately.  The lyrics are actually rather smart, describing how his “iron generation” has aged without maturing.</p><p><i>How do you, how do you, how do you<br>Get old without maturity?<br>It will touch us, it will touch us<br>Getting old without maturity.</br></br></br></i></p><p>While the song is openly celebratory of this lifelong immaturity, with amusing lines about putting a DJ on the dance floor of the old folks home and how it will be surprising if anyone lives long enough to make it there given the Cold War and the way everyone used tanning beds, one shouldn’t mistake the cynical attitude underneath it either. <i>I Vecchietti Fanno O</i> is a very Generation X response to the Baby Boomers and their <i>My Generation</i> theme.  There’s no bathetic posturing about hoping to die before one gets old, merely a desire to preserve a youthful mentality in old age.  Let’s face it, there’s no doubt that some of us will be playing Nintendo Wii, or the 2050 equivalent, in the retirement home.</p><p>As a one-time lyricist myself, I especially liked the way he turned the repetition of “You’re such a…” into “I already know it”, which in Italian sounds almost identical to the English.  And it’s interesting that Italians are about the only European nationality that has flow, although the language is certainly a big help with its easy rhymes.</p></div>",
  "content_text": "I think Jamie will rather like this one.  It’s a very good quasi-remake of Blackbox’s\nRide on Time\nby J-ax, a Milanese rapper, called\nI Vecchietti Fanno O\n.  It’s very catchy and is on all the time at the gym lately.  The lyrics are actually rather smart, describing how his “iron generation” has aged without maturing.\nHow do you, how do you, how do you\nGet old without maturity?\nIt will touch us, it will touch us\nGetting old without maturity.\nWhile the song is openly celebratory of this lifelong immaturity, with amusing lines about putting a DJ on the dance floor of the old folks home and how it will be surprising if anyone lives long enough to make it there given the Cold War and the way everyone used tanning beds, one shouldn’t mistake the cynical attitude underneath it either.\nI Vecchietti Fanno O\nis a very Generation X response to the Baby Boomers and their\nMy Generation\ntheme.  There’s no bathetic posturing about hoping to die before one gets old, merely a desire to preserve a youthful mentality in old age.  Let’s face it, there’s no doubt that some of us will be playing Nintendo Wii, or the 2050 equivalent, in the retirement home.\nAs a one-time lyricist myself, I especially liked the way he turned the repetition of “You’re such a…” into “I already know it”, which in Italian sounds almost identical to the English.  And it’s interesting that Italians are about the only European nationality that has flow, although the language is certainly a big help with its easy rhymes.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-02-23T19:30:00+00:00"
}