{
  "url": "https://voxday.net/2009/02/26/mailvox-in-defense-of-feminis/",
  "scraped_at": "2026-01-08T22:49:13.650320",
  "title": "Mailvox: in defense of feminism",
  "date_display": "February 26, 2009",
  "date_iso": "2009-02-26T20:35:00+00:00",
  "date_from_url": "2009-02-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Other Renee writes:</p><blockquote><p>I read a couple of you posts about feminism a while ago, and it left me thinking a lot about things.  For one thing, if the feminism movement never took place, do you think that women would have as much rights and opportunities as they do today?  Do you think that they even belong in the workplace?  Also, how do you feel about unequal wages between men and women; do you think that women deserve equal pay?  I understand and agree that men and women are not biologically the same and should not be treated as such, but idealy and under the law, they do deserve the same rights and privileges.  Now I know feminism isn’t perfect, but I kind of feel that it’s more the people than the actual idea of it.  Like religion (stick with me here).  Many people think Christianity is bad, but it’s some of the followers that make it bad, the religion itself isn’t bad.  I REEEAALLY hope that made sense.</p></blockquote><p>If feminism had never existed, women would have more rights, fewer opportunities, and they would be better off by numerous objective measures including health, wealth, and de facto ability to choose how to live their lives.  To ask if women “belong in the workplace” is a misleading question, as lower class women have always worked.  Feminism is a middle class phenomenon; upper- and middle-class women do not belong in the full-time workplace if they are going to marry and have children as their contributions are far less important in the workplace than in the home.  About a third of the female population have to work for one reason or another and traditional societies have always accommodated that.  I understand your last point and there are certainly no shortage of evil feminists, but unlike some other religions and ideologies, the inherent problem is not with the ideologues but rather with the ideology itself.</p><blockquote><p>In the end, I feel that I am an egalitarian when it comes to equality in political, economic, social, and civil rights.</p></blockquote><p>You’re obviously mistaking me for someone who gives an airborne rodent’s posterior.  Equality is an utter myth and does not exist except in the imaginations of those who are insufficiently rooted in material reality.  I find Nzambi Mpungu and the Labor Theory of Value to be more credible.</p><blockquote><p>In “A feminist throws in the towel” back in October 2, 2008, you said this: <i>The truth is that “sexism” is merely one of the many excuses that the incompetent use to justify their failures. Nobody gets a fair shake, even those who have massive advantages usually know what it’s like to not get a chance….  If you’re a loser of either sex, you complain about how everyone else is responsible for your failures, you come up with a label to justify them, and you wallow in the unfairness of it all. If you’re not, you just shrug, assess the situation, and take your best shot where you can. Life isn’t fair. There probably isn’t a single genuinely fair individual to be found anywhere in the world. So what? That’s the situation – what are you going to do about it? Change the world by force and government fiat? Yeah, that’s worked so very well so often in the past!</i></p><p>I admit, I don’t know how they decided who was sexist and who wasn’t, but something bothers me.  There’s a difference between blaming people for your failures, and being denied promotions, advancements, equal wage, etc. based on your sex despite doing your VERY BEST and doing excellent work on your job (even performing better than some of the men).  Of course no one gets a fair shake in life.  But if I’m in the workplace and I’m being denied equal wage and potential promotions, all because I’m a woman, I’m not supposed to do anything about it?  I should just accept it?  Even if the guy does excellent work, if he’s genuinely sexist, then disciplinary actions must be taken even if he is at the top.  I know that life isn’t fair, but in certain situations like unequality and discrimination on the job, I’m not going to critize someone for bringing to light what’s going on at that particular workplace and trying to make a difference.</p><p>Here’s an example.  After many years of women being denied equal pay in the workplace despite doing the exact same jobs as men in many instances, the Senate passed the Lilly Ledbetter Fair Pay Act of 2009, and the President has promised to sign it into law.  After endless protests and hardwork to end unequal pay (or at least decrease the frequency of such cases), this happened.</p></blockquote><p>Renee’s attitude is all too typical of the inherent liberal fascism that afflicts so many women.  First, on what planet does the person doing the VERY BEST job have an inalienable legal right <i>to anything?</i> Does Renee seriously believe that if I walk in the door and can prove that I can do a better job than she does, she should be immediately fired and her job should be given to me?  If not, then what on Earth is she complaining about.  It’s no business of hers what metric the employer chooses to use to evaluate employees.  It’s amazing, but entirely predictable that she thinks the only two options are to either a) just accept it, or b) institute a massive Federal bureaucracy applying pseudo-objective measures to every job in the country and watching over how closely employers are abiding by those measures.  And note this ominous declaration: “Even if the guy does excellent work, if he’s genuinely sexist, then disciplinary actions must be taken even if he is at the top.</p><p>So, it turns out that despite her concerns about excellence in the workplace that’s just a red herring to disguise Renee’s real goal, which is the forced imposition of her belief in her nonexistent god on everyone.  While she means well, the only difference between Renee and an Islamic Jihadist is that the jihadist is willing to use personal force in imposing his will on the populace, Renee prefers to use politicians to do her dirty work for her.</p><p>Furthermore, the “Fair Pay Act” isn’t about equal pay for equal work, it’s about equal pay for less work.  The main difference in male and female compensation is that on average, women in the same job as men work fewer hours per month than men and are more likely to quit than men.  This makes them less valuable to employers, and therefore worth less pay.  There’s nothing to prevent Renee and her fellow feminists from starting their own corporations and running them however they want.  But then, that would involve taking personal responsibility, making decisions and doing actual work, rather than simply whining at politicians and benefiting parasitically from the effort of others.</p></div>",
  "content_text": "The Other Renee writes:\nI read a couple of you posts about feminism a while ago, and it left me thinking a lot about things.  For one thing, if the feminism movement never took place, do you think that women would have as much rights and opportunities as they do today?  Do you think that they even belong in the workplace?  Also, how do you feel about unequal wages between men and women; do you think that women deserve equal pay?  I understand and agree that men and women are not biologically the same and should not be treated as such, but idealy and under the law, they do deserve the same rights and privileges.  Now I know feminism isn’t perfect, but I kind of feel that it’s more the people than the actual idea of it.  Like religion (stick with me here).  Many people think Christianity is bad, but it’s some of the followers that make it bad, the religion itself isn’t bad.  I REEEAALLY hope that made sense.\nIf feminism had never existed, women would have more rights, fewer opportunities, and they would be better off by numerous objective measures including health, wealth, and de facto ability to choose how to live their lives.  To ask if women “belong in the workplace” is a misleading question, as lower class women have always worked.  Feminism is a middle class phenomenon; upper- and middle-class women do not belong in the full-time workplace if they are going to marry and have children as their contributions are far less important in the workplace than in the home.  About a third of the female population have to work for one reason or another and traditional societies have always accommodated that.  I understand your last point and there are certainly no shortage of evil feminists, but unlike some other religions and ideologies, the inherent problem is not with the ideologues but rather with the ideology itself.\nIn the end, I feel that I am an egalitarian when it comes to equality in political, economic, social, and civil rights.\nYou’re obviously mistaking me for someone who gives an airborne rodent’s posterior.  Equality is an utter myth and does not exist except in the imaginations of those who are insufficiently rooted in material reality.  I find Nzambi Mpungu and the Labor Theory of Value to be more credible.\nIn “A feminist throws in the towel” back in October 2, 2008, you said this:\nThe truth is that “sexism” is merely one of the many excuses that the incompetent use to justify their failures. Nobody gets a fair shake, even those who have massive advantages usually know what it’s like to not get a chance….  If you’re a loser of either sex, you complain about how everyone else is responsible for your failures, you come up with a label to justify them, and you wallow in the unfairness of it all. If you’re not, you just shrug, assess the situation, and take your best shot where you can. Life isn’t fair. There probably isn’t a single genuinely fair individual to be found anywhere in the world. So what? That’s the situation – what are you going to do about it? Change the world by force and government fiat? Yeah, that’s worked so very well so often in the past!\nI admit, I don’t know how they decided who was sexist and who wasn’t, but something bothers me.  There’s a difference between blaming people for your failures, and being denied promotions, advancements, equal wage, etc. based on your sex despite doing your VERY BEST and doing excellent work on your job (even performing better than some of the men).  Of course no one gets a fair shake in life.  But if I’m in the workplace and I’m being denied equal wage and potential promotions, all because I’m a woman, I’m not supposed to do anything about it?  I should just accept it?  Even if the guy does excellent work, if he’s genuinely sexist, then disciplinary actions must be taken even if he is at the top.  I know that life isn’t fair, but in certain situations like unequality and discrimination on the job, I’m not going to critize someone for bringing to light what’s going on at that particular workplace and trying to make a difference.\nHere’s an example.  After many years of women being denied equal pay in the workplace despite doing the exact same jobs as men in many instances, the Senate passed the Lilly Ledbetter Fair Pay Act of 2009, and the President has promised to sign it into law.  After endless protests and hardwork to end unequal pay (or at least decrease the frequency of such cases), this happened.\nRenee’s attitude is all too typical of the inherent liberal fascism that afflicts so many women.  First, on what planet does the person doing the VERY BEST job have an inalienable legal right\nto anything?\nDoes Renee seriously believe that if I walk in the door and can prove that I can do a better job than she does, she should be immediately fired and her job should be given to me?  If not, then what on Earth is she complaining about.  It’s no business of hers what metric the employer chooses to use to evaluate employees.  It’s amazing, but entirely predictable that she thinks the only two options are to either a) just accept it, or b) institute a massive Federal bureaucracy applying pseudo-objective measures to every job in the country and watching over how closely employers are abiding by those measures.  And note this ominous declaration: “Even if the guy does excellent work, if he’s genuinely sexist, then disciplinary actions must be taken even if he is at the top.\nSo, it turns out that despite her concerns about excellence in the workplace that’s just a red herring to disguise Renee’s real goal, which is the forced imposition of her belief in her nonexistent god on everyone.  While she means well, the only difference between Renee and an Islamic Jihadist is that the jihadist is willing to use personal force in imposing his will on the populace, Renee prefers to use politicians to do her dirty work for her.\nFurthermore, the “Fair Pay Act” isn’t about equal pay for equal work, it’s about equal pay for less work.  The main difference in male and female compensation is that on average, women in the same job as men work fewer hours per month than men and are more likely to quit than men.  This makes them less valuable to employers, and therefore worth less pay.  There’s nothing to prevent Renee and her fellow feminists from starting their own corporations and running them however they want.  But then, that would involve taking personal responsibility, making decisions and doing actual work, rather than simply whining at politicians and benefiting parasitically from the effort of others.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-02-26T20:35:00+00:00"
}