{
  "url": "https://voxday.net/2009/02/09/mailvox-questions-about-womens-rights/",
  "scraped_at": "2026-01-08T22:47:38.697767",
  "title": "Mailvox: questions about women’s rights",
  "date_display": "February 9, 2009",
  "date_iso": "2009-02-09T14:45:00+00:00",
  "date_from_url": "2009-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A self-declared evolutionary dead-end named FS has a bunch of them:</p><blockquote><p>I have a few questions after reading ‘women’s rights.’ I’m a student, female, and I don’t plan on getting married (thus contributing to the downfall of Western civilization), although given my background, someone like yourself might think that this a good thing.</p><p>However, it just seems a tad..one sided, forgive me, as a naive young student, but you seem to be laying all the blame for civilization’s ills at women’s rights. Are women to blame for everything, since Adam and Eve? I knew a couple of women who married young (21 and 22), and since, really regretted it. But I guess you, as a man, can’t have that type of experience, which is why I think you’re being a little one-sided. And I have a few questions:</p></blockquote><p>It’s difficult to know exactly where to start here, since many of civilization’s ills long preceded the women’s rights that date back to the early 20th century.  She also seems to think that women had absolutely no rights prior to the development of special “women’s rights”, which is simply not the case.  And women are not to blame for everything, the Sports Guys mantra notwithstanding, although it would obviously be very difficult to find another party to blame for demographic decline than the specific group who are declining to propagate the species.  I further note that I know a lot more women than two who did not marry at all and eventually came to regret it, regardless, the plural of anecdote is not data.  But on to the specific questions….</p><blockquote><p>1) If women should merely stay at home and take care of the children and do nothing else, how should such a family survive in the days when you need a dual income and the cost of everything is going up?</p></blockquote><p>FS doesn’t understand that the primary reason a dual income is required is because so many women are working now.  This is basic supply and demand.  If you double the work force, you halve the price of labor.  Two incomes are now needed where one previously sufficed.  Now, about thirty percent of women have always worked; the present situation exists because around sixty percent of women now work.  Send the 20 million immigrants home and remove the 30 million women from the work force who entered it after 1950 and wage rates will suffice to support single-income families again.  We’ll leave the inflation aspect out of this since I don’t think she’s equipped to have that discussion, but every regular VP reader knows why the cost of everything has been going up for the last century.  That’s the price of having a central bank to “stabilize” the currency.</p><blockquote><p>2) If women have no rights, what should they do when abandoned by their husbands? Ever hear of Jean Pare? She was a stay at home mom with four kids until her husband walked out on her when she was 38, so she had to work. So if women shouldn’t have any rights (much like in the days of yore), what option is there for someone like that to fall back on, without working?</p></blockquote><p>First, I note that women are the ones walking out of most marriages, not men.  Second, no one has said that women shouldn’t have any rights, only that they should have no special rights that depend entirely on their being female.  But why shouldn’t a woman be expected to work and support herself if she isn’t married anymore?  Are women children, totally incapable of supporting themselves?  Whatever happened to that whole strong, independent motif?  And the man is still the children’s father, if he can support them, then he should have custody and primary responsibility for them.</p><blockquote><p>3) If women shouldn’t  have rights, what should they do in the case of domestic abuse? Should they merely put up with it? Given the fact that, under a rule of thumb suggesting that women shouldn’t work and have no rights, should she just put up with it?</p></blockquote><p>There’s no such thing as domestic abuse; assault is assault.  If you are the victim of a criminal assault, you have the ability press charges.  Of course, since women commit as much “domestic abuse” as men, an genuinely equitable legal system would see a lot more women getting arrested and jailed.  As a general rule, if you don’t want to get hit, don’t hit someone first.  There’s no shortage of cases where a woman assaults a man, he punches her back, and then he gets charged.  That’s not justice.</p><blockquote><p>4) As you mention: ” the feminized family court system that transformed marriage from a mutually beneficial contract into a financial and emotional liability, and the removal of paternal responsibility for the sexual behavior of young women.” — does that mean the standard of living and the cost of everything and needing to work is directly blamed on feminism, and not big business, corporate greed, the economic decimation of America’s Middle Class by U.S. Global Businessmen, has NOTHING TO do with it and is all blamed on women’s rights?</p></blockquote><p>No, it’s clearly not all feminism.  There are various other factors at work, although feminism, particularly women’s suffrage, are two important ones.  But it would be worthwhile for many feminists to exam who has historically been supporting “women’s rights” and why they have been doing so.  As I’ve pointed out before, until 1973, the most immediate effect of young, marriageable women entering the work force after 1950 was allowing old men to retire, collect Social Security benefits, and hit the links.  Does that sound like a good trade-off for young women?  After 1973, more women were entering than men were retiring, which was when average wages began falling.</p><blockquote><p>5) If women’s rights should be reversed, should all other rights be reversed too? What about the civil rights movement? Should rights for Blacks and minorities be revoked as well? Why stop at merely women’s rights? And how would you justify that? After all, slavery has been quite beneficial to certian societies as well.</p></blockquote><p>No.  What about it?  Yes, all special rights should be revoked… and note that voting is not and has never been a right.  As for slavery, its return in the form of the growing sex trade is the direct result of the economic destruction caused in part by women’s suffrage.  When women can’t find a man to support them, they often prefer to sell their bodies rather than find productive work because it’s an easier option, especially for the young and attractive.</p><blockquote><p>6) If, as you mention:  Europe’s demise is all but assured, thanks to them, as women’s individual choices taken in the collective have stricken European society and brought on successive waves of feminist-friendly Islamic immigration by reducing Europe’s birth rates far below replacement levels.” — does that have NOTHING to do with the fact that, living in a society where life expectancy is high, and women do not always need to have as many children – say, for instance, women used to have several children to ensure that at least 1 or 2 survived to adulthood..would fathers, in such a society, what would be the need for that?</p></blockquote><p>This is incoherent.  Perhaps FS could rephrase the question.</p><blockquote><p>7) Talking about Europe’s demise, why not simply create substantial financial incentives for women to have chilren?</p></blockquote><p>They already do in many European countries, with payments of several hundred dollars per month per child.  Either they are insufficient or they don’t work very well.  Also, merely having children isn’t enough, as the US welfare system has shown that creating an incentive for single mothers to have more children is the most effective way to create a permanent criminal underclass.  Children within a functioning traditional family is what nations require to survive, otherwise vats of clones would be a viable solution.</p><blockquote><p>8) Are women simply created to serve men and give birth to babies and have relatively little freedom? A<br> s you suggest, women’s individual rights are the demise of all that is good..</br></p></blockquote><p>I don’t pretend to know what the grand purpose of woman is.  But it is a demonstrable fact that when women are given free and full political license, the collective actions of women have reliably had the result of eradicating freedom, destroying economic growth, and demographically murdering the societies in which they live.  If you think that’s a reasonable trade-off for three generations of liberated women before everything falls apart and the barbarian patriarchy returns, well, we can certainly agree to disagree.</p><blockquote><p>9) Would you, if you were a woman, agree that your own rights have effectively curtailed western society, and agree to personally revoke your rights and stay at home and give birth to several chlidren with a husband?</p></blockquote><p>Absolutely.  Ann Coulter and numerous women who read this blog have often expressed the opinion that they would give up their vote if that would prevent all of their left-leaning sisters from voting.  By the way, I already live, by choice, in a society where I have no current right to vote.  I prefer genuine freedom and wealth to the pretense of it.</p><blockquote><p>10) You write: “the feminized family court system that transformed marriage from a mutually beneficial contract into a financial and emotional liability, and the removal of paternal responsibility for the sexual behavior of young women.” — well, first of all, divorce was historically easier for men than for women, women historically were denied certain rights, such as earning income, inheriting property, etc, so I”m not sure what you mean by ‘mutually beneficial contract.’</p></blockquote><p>FS needs to re-read her history.  Women were never denied the right to earn an income and they had the right to inherit property for the entire existence of the United States.  She is confusing social norms for law.  If she doesn’t understand how marriage was a “mutually beneficial contract”, I don’t see how I can explain it to her.  But I’ll try.  In simple terms, women traded sex and children for a lifetime of being supported.  This was generally considered of sufficient benefit to both parties, since it was not necessary to force either party into it.  The declining numbers electing to marry under the present system indicates that the current system is considered less mutually beneficial by the prospective participants.</p><blockquote><p>Second, ‘the removal of paternal responsibility and the sexual behaviour of young women’ — I see a contradiction here, if America is the land of personal responsibility, then shouldn’t young men realize their own responsibility of taking care of their children? Or is this another case of all the blame being laid at the feet of women?</p></blockquote><p>Yes, men should be responsible for taking care of their own children.  But it’s women who lobbied to remove the laws that historically gave custody to the father… even though the father didn’t receive support from the non-custodial mother.  But no man should be held responsible for a child that isn’t his, as is legally the case today.</p><blockquote><p>11) women stuck in traditional roles (not all, but those TRAPPED in traditional roles), generally are twice as likely as men to suffer from depression..how would you solve this, if women have fewer rights?</p></blockquote><p>I don’t think it’s a problem that need solving, although I’d like to see the study you’re citing before I accept it.  From what I understand, women are far more likely to be depressed and neurotic than men in general.</p><blockquote><p>12) What should women do with themselves, if they have no rights, when the sons have left for college and the mother can no longer bear children? What should she do then, with no education, no rights, etc?</p></blockquote><p>When did she lose her education?  And why can’t she work if she’s not being supported by a husband?</p><blockquote><p>13) Since today, in Western culture, which contrasts with the 12 century Jihadist culture, as you are inclined to think it is, instead of bereating women, abortion, consentual sex outside of marriage (men do it too), why not focus that energy into other problems, real problems? Since Western men have created structures to  channel their aggression into business, the courts and sports (all of which they mostly dominate), why not, instead of setting aside their civilized rule of law, and fight “12th century” male culture, though warfare or, preferably, by using guile, such as removing the barbarians’ source of funding from oil profits and denying the barbarians easy entrance as immigrants? that way, you won’t have to put aside women’s basic rights?</p></blockquote><p>The problems of Western society aren’t external.  That’s why.  How is one going to fight “12th century” male culture when one’s society is in demographic decline and aging rapidly?</p><blockquote><p>14) if women’s rights are bar none, and you have a daughter, would you tell her that she should be nothing but a housewife and mother and little more? For the good of civilization, while her brothers go to to school and get education?</p></blockquote><p>First, I don’t believe in going to school to get an education.  Second, yes, I would absolutely encourage her to be a housewife and mother first and second, and then whatever else she wants to be.  After all, there is absolutely nothing she can do that is more important than ensuring the continuance of the human race.  Plus, I’ve got some excellent genes that practically demand propagation in these latter days of idiocracy.</p><blockquote><p>15) In areas of science and technology, where men still dominate, would a greater number of increasing women be beneficial? To increase the volume of research done in this area? As well as an increase in differing perspectives? Or should this again, be entirely dominated by men?</p></blockquote><p>No.  Absolutely not.  Technological advancement doesn’t depend upon numbers.  Do you seriously want everyone living in grass huts?</p><blockquote><p>16) If women have no rights, what kind of education should they be given? Would you prefer a Taliban style of education? Or perhaps a greek style of education where girls simply remained at home with their mothers learning to be wives for future husbands?</p></blockquote><p>I don’t know why you think I have any problem with women being educated.  I don’t.  But you shouldn’t mistake a piece of paper from a paper mill with an education either.  I prefer both boys and girls to remain at home, learning from their mothers.  You’ll note that this system actually requires women to have excellent educations; the nature of your questions shows there’s no doubt that Spacebunny has a better and more comprehensive education than you presently have.</p><blockquote><p>17) If women have no rights, does that mean that the gender that has always fought wars, made developments in science and technology, etc., will always have to be male, and that women shouldn’t, for the necessity for Western civilization, go into such fields?</p></blockquote><p>It means that regardless of whether women have special rights nor not.  The great failure of feminism has been the collective failure of women to achieve anything more notable than they were already achieving prior to the 20th century.  I don’t consider the invention of the credit default swap and the ruination of the fantasy literature genre to be great steps forward for the species.</p><blockquote><p>18) Since gender roles are changing, does it behoove men to stay at home with the children?</p></blockquote><p>They’re not substantively changing.  So, no.  Short-term responses to a temporary legal environment should not be confused with permanent changes.  Once the legal environment changes again, any apparent changes in gender roles will disappear.</p></div>",
  "content_text": "A self-declared evolutionary dead-end named FS has a bunch of them:\nI have a few questions after reading ‘women’s rights.’ I’m a student, female, and I don’t plan on getting married (thus contributing to the downfall of Western civilization), although given my background, someone like yourself might think that this a good thing.\nHowever, it just seems a tad..one sided, forgive me, as a naive young student, but you seem to be laying all the blame for civilization’s ills at women’s rights. Are women to blame for everything, since Adam and Eve? I knew a couple of women who married young (21 and 22), and since, really regretted it. But I guess you, as a man, can’t have that type of experience, which is why I think you’re being a little one-sided. And I have a few questions:\nIt’s difficult to know exactly where to start here, since many of civilization’s ills long preceded the women’s rights that date back to the early 20th century.  She also seems to think that women had absolutely no rights prior to the development of special “women’s rights”, which is simply not the case.  And women are not to blame for everything, the Sports Guys mantra notwithstanding, although it would obviously be very difficult to find another party to blame for demographic decline than the specific group who are declining to propagate the species.  I further note that I know a lot more women than two who did not marry at all and eventually came to regret it, regardless, the plural of anecdote is not data.  But on to the specific questions….\n1) If women should merely stay at home and take care of the children and do nothing else, how should such a family survive in the days when you need a dual income and the cost of everything is going up?\nFS doesn’t understand that the primary reason a dual income is required is because so many women are working now.  This is basic supply and demand.  If you double the work force, you halve the price of labor.  Two incomes are now needed where one previously sufficed.  Now, about thirty percent of women have always worked; the present situation exists because around sixty percent of women now work.  Send the 20 million immigrants home and remove the 30 million women from the work force who entered it after 1950 and wage rates will suffice to support single-income families again.  We’ll leave the inflation aspect out of this since I don’t think she’s equipped to have that discussion, but every regular VP reader knows why the cost of everything has been going up for the last century.  That’s the price of having a central bank to “stabilize” the currency.\n2) If women have no rights, what should they do when abandoned by their husbands? Ever hear of Jean Pare? She was a stay at home mom with four kids until her husband walked out on her when she was 38, so she had to work. So if women shouldn’t have any rights (much like in the days of yore), what option is there for someone like that to fall back on, without working?\nFirst, I note that women are the ones walking out of most marriages, not men.  Second, no one has said that women shouldn’t have any rights, only that they should have no special rights that depend entirely on their being female.  But why shouldn’t a woman be expected to work and support herself if she isn’t married anymore?  Are women children, totally incapable of supporting themselves?  Whatever happened to that whole strong, independent motif?  And the man is still the children’s father, if he can support them, then he should have custody and primary responsibility for them.\n3) If women shouldn’t  have rights, what should they do in the case of domestic abuse? Should they merely put up with it? Given the fact that, under a rule of thumb suggesting that women shouldn’t work and have no rights, should she just put up with it?\nThere’s no such thing as domestic abuse; assault is assault.  If you are the victim of a criminal assault, you have the ability press charges.  Of course, since women commit as much “domestic abuse” as men, an genuinely equitable legal system would see a lot more women getting arrested and jailed.  As a general rule, if you don’t want to get hit, don’t hit someone first.  There’s no shortage of cases where a woman assaults a man, he punches her back, and then he gets charged.  That’s not justice.\n4) As you mention: ” the feminized family court system that transformed marriage from a mutually beneficial contract into a financial and emotional liability, and the removal of paternal responsibility for the sexual behavior of young women.” — does that mean the standard of living and the cost of everything and needing to work is directly blamed on feminism, and not big business, corporate greed, the economic decimation of America’s Middle Class by U.S. Global Businessmen, has NOTHING TO do with it and is all blamed on women’s rights?\nNo, it’s clearly not all feminism.  There are various other factors at work, although feminism, particularly women’s suffrage, are two important ones.  But it would be worthwhile for many feminists to exam who has historically been supporting “women’s rights” and why they have been doing so.  As I’ve pointed out before, until 1973, the most immediate effect of young, marriageable women entering the work force after 1950 was allowing old men to retire, collect Social Security benefits, and hit the links.  Does that sound like a good trade-off for young women?  After 1973, more women were entering than men were retiring, which was when average wages began falling.\n5) If women’s rights should be reversed, should all other rights be reversed too? What about the civil rights movement? Should rights for Blacks and minorities be revoked as well? Why stop at merely women’s rights? And how would you justify that? After all, slavery has been quite beneficial to certian societies as well.\nNo.  What about it?  Yes, all special rights should be revoked… and note that voting is not and has never been a right.  As for slavery, its return in the form of the growing sex trade is the direct result of the economic destruction caused in part by women’s suffrage.  When women can’t find a man to support them, they often prefer to sell their bodies rather than find productive work because it’s an easier option, especially for the young and attractive.\n6) If, as you mention:  Europe’s demise is all but assured, thanks to them, as women’s individual choices taken in the collective have stricken European society and brought on successive waves of feminist-friendly Islamic immigration by reducing Europe’s birth rates far below replacement levels.” — does that have NOTHING to do with the fact that, living in a society where life expectancy is high, and women do not always need to have as many children – say, for instance, women used to have several children to ensure that at least 1 or 2 survived to adulthood..would fathers, in such a society, what would be the need for that?\nThis is incoherent.  Perhaps FS could rephrase the question.\n7) Talking about Europe’s demise, why not simply create substantial financial incentives for women to have chilren?\nThey already do in many European countries, with payments of several hundred dollars per month per child.  Either they are insufficient or they don’t work very well.  Also, merely having children isn’t enough, as the US welfare system has shown that creating an incentive for single mothers to have more children is the most effective way to create a permanent criminal underclass.  Children within a functioning traditional family is what nations require to survive, otherwise vats of clones would be a viable solution.\n8) Are women simply created to serve men and give birth to babies and have relatively little freedom? A\ns you suggest, women’s individual rights are the demise of all that is good..\nI don’t pretend to know what the grand purpose of woman is.  But it is a demonstrable fact that when women are given free and full political license, the collective actions of women have reliably had the result of eradicating freedom, destroying economic growth, and demographically murdering the societies in which they live.  If you think that’s a reasonable trade-off for three generations of liberated women before everything falls apart and the barbarian patriarchy returns, well, we can certainly agree to disagree.\n9) Would you, if you were a woman, agree that your own rights have effectively curtailed western society, and agree to personally revoke your rights and stay at home and give birth to several chlidren with a husband?\nAbsolutely.  Ann Coulter and numerous women who read this blog have often expressed the opinion that they would give up their vote if that would prevent all of their left-leaning sisters from voting.  By the way, I already live, by choice, in a society where I have no current right to vote.  I prefer genuine freedom and wealth to the pretense of it.\n10) You write: “the feminized family court system that transformed marriage from a mutually beneficial contract into a financial and emotional liability, and the removal of paternal responsibility for the sexual behavior of young women.” — well, first of all, divorce was historically easier for men than for women, women historically were denied certain rights, such as earning income, inheriting property, etc, so I”m not sure what you mean by ‘mutually beneficial contract.’\nFS needs to re-read her history.  Women were never denied the right to earn an income and they had the right to inherit property for the entire existence of the United States.  She is confusing social norms for law.  If she doesn’t understand how marriage was a “mutually beneficial contract”, I don’t see how I can explain it to her.  But I’ll try.  In simple terms, women traded sex and children for a lifetime of being supported.  This was generally considered of sufficient benefit to both parties, since it was not necessary to force either party into it.  The declining numbers electing to marry under the present system indicates that the current system is considered less mutually beneficial by the prospective participants.\nSecond, ‘the removal of paternal responsibility and the sexual behaviour of young women’ — I see a contradiction here, if America is the land of personal responsibility, then shouldn’t young men realize their own responsibility of taking care of their children? Or is this another case of all the blame being laid at the feet of women?\nYes, men should be responsible for taking care of their own children.  But it’s women who lobbied to remove the laws that historically gave custody to the father… even though the father didn’t receive support from the non-custodial mother.  But no man should be held responsible for a child that isn’t his, as is legally the case today.\n11) women stuck in traditional roles (not all, but those TRAPPED in traditional roles), generally are twice as likely as men to suffer from depression..how would you solve this, if women have fewer rights?\nI don’t think it’s a problem that need solving, although I’d like to see the study you’re citing before I accept it.  From what I understand, women are far more likely to be depressed and neurotic than men in general.\n12) What should women do with themselves, if they have no rights, when the sons have left for college and the mother can no longer bear children? What should she do then, with no education, no rights, etc?\nWhen did she lose her education?  And why can’t she work if she’s not being supported by a husband?\n13) Since today, in Western culture, which contrasts with the 12 century Jihadist culture, as you are inclined to think it is, instead of bereating women, abortion, consentual sex outside of marriage (men do it too), why not focus that energy into other problems, real problems? Since Western men have created structures to  channel their aggression into business, the courts and sports (all of which they mostly dominate), why not, instead of setting aside their civilized rule of law, and fight “12th century” male culture, though warfare or, preferably, by using guile, such as removing the barbarians’ source of funding from oil profits and denying the barbarians easy entrance as immigrants? that way, you won’t have to put aside women’s basic rights?\nThe problems of Western society aren’t external.  That’s why.  How is one going to fight “12th century” male culture when one’s society is in demographic decline and aging rapidly?\n14) if women’s rights are bar none, and you have a daughter, would you tell her that she should be nothing but a housewife and mother and little more? For the good of civilization, while her brothers go to to school and get education?\nFirst, I don’t believe in going to school to get an education.  Second, yes, I would absolutely encourage her to be a housewife and mother first and second, and then whatever else she wants to be.  After all, there is absolutely nothing she can do that is more important than ensuring the continuance of the human race.  Plus, I’ve got some excellent genes that practically demand propagation in these latter days of idiocracy.\n15) In areas of science and technology, where men still dominate, would a greater number of increasing women be beneficial? To increase the volume of research done in this area? As well as an increase in differing perspectives? Or should this again, be entirely dominated by men?\nNo.  Absolutely not.  Technological advancement doesn’t depend upon numbers.  Do you seriously want everyone living in grass huts?\n16) If women have no rights, what kind of education should they be given? Would you prefer a Taliban style of education? Or perhaps a greek style of education where girls simply remained at home with their mothers learning to be wives for future husbands?\nI don’t know why you think I have any problem with women being educated.  I don’t.  But you shouldn’t mistake a piece of paper from a paper mill with an education either.  I prefer both boys and girls to remain at home, learning from their mothers.  You’ll note that this system actually requires women to have excellent educations; the nature of your questions shows there’s no doubt that Spacebunny has a better and more comprehensive education than you presently have.\n17) If women have no rights, does that mean that the gender that has always fought wars, made developments in science and technology, etc., will always have to be male, and that women shouldn’t, for the necessity for Western civilization, go into such fields?\nIt means that regardless of whether women have special rights nor not.  The great failure of feminism has been the collective failure of women to achieve anything more notable than they were already achieving prior to the 20th century.  I don’t consider the invention of the credit default swap and the ruination of the fantasy literature genre to be great steps forward for the species.\n18) Since gender roles are changing, does it behoove men to stay at home with the children?\nThey’re not substantively changing.  So, no.  Short-term responses to a temporary legal environment should not be confused with permanent changes.  Once the legal environment changes again, any apparent changes in gender roles will disappear.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-02-09T14:45:00+00:00"
}