{
  "url": "https://voxday.net/2009/02/24/of-scientific-models-and-other-frauds/",
  "scraped_at": "2026-01-08T22:49:03.212054",
  "title": "Of “scientific” models and other frauds",
  "date_display": "February 24, 2009",
  "date_iso": "2009-02-24T21:12:00+00:00",
  "date_from_url": "2009-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SP emails word that other people with experience in both finance and computers have noticed <a href=\"http://www.climate-skeptic.com/2009/02/the-plug.html\">the same problem with global warming</a> that I have often described with regards to both global warming and evolution:</p><blockquote><p>I have always been suspicious of climate models, in part because I spent some time in college trying to model chaotic dynamic systems, and in part because I have a substantial amount of experience with financial modeling.   There are a number of common traps one can fall into when modeling any system, and it appears to me that climate modelers are falling into most of them.</p></blockquote><p>Of course the underlying issue, in less mathematical terms, also tends to apply to the reliably unreliable evolutionary models.  At least the global warming faithful appear to understand the basics of predictive modeling enough to try manipulating them; evolutionary biologists are so mathematically and/or computer illiterate that they often don’t understand that historical backtesting is not a dependable form of proof.  For example, Richard Dawkins’s <a href=\"http://en.wikipedia.org/wiki/Weasel_program\">Weasel program</a> really has to be seen to be believed; it’s an amazing demonstration of the completely obvious that not only misses the point, but exposes the crudity of the thought processes behind evolutionary theory.</p><p>And, as was pointed out <a href=\"http://www.nytimes.com/2009/02/24/science/24tier.html?8dpc\">in the New York Times today</a>, no amount of hiding behind “science” will change the fact that what they’re actually doing is dogmatic politics and ideology, not actual hypothesize-test-and-observe science.</p><p><i>A scientist can enter the fray by becoming an advocate for certain policies, like limits on carbon emissions or subsidies for wind power. That’s a perfectly legitimate role for scientists, as long as they acknowledge that they’re promoting their own agendas.  But too often, Dr. Pielke says, they pose as impartial experts pointing politicians to the only option that makes scientific sense. To bolster their case, they’re prone to exaggerate their expertise (like enumerating the catastrophes that would occur if their policies aren’t adopted), while denigrating their political opponents as “unqualified” or “unscientific.”</i></p><p>“Some scientists want to influence policy in a certain direction and still be able to claim to be above politics,” Dr. Pielke says. “So they engage in what I call ‘stealth issue advocacy’ by smuggling political arguments into putative scientific ones.”</p></div>",
  "content_text": "SP emails word that other people with experience in both finance and computers have noticed\nthe same problem with global warming\nthat I have often described with regards to both global warming and evolution:\nI have always been suspicious of climate models, in part because I spent some time in college trying to model chaotic dynamic systems, and in part because I have a substantial amount of experience with financial modeling.   There are a number of common traps one can fall into when modeling any system, and it appears to me that climate modelers are falling into most of them.\nOf course the underlying issue, in less mathematical terms, also tends to apply to the reliably unreliable evolutionary models.  At least the global warming faithful appear to understand the basics of predictive modeling enough to try manipulating them; evolutionary biologists are so mathematically and/or computer illiterate that they often don’t understand that historical backtesting is not a dependable form of proof.  For example, Richard Dawkins’s\nWeasel program\nreally has to be seen to be believed; it’s an amazing demonstration of the completely obvious that not only misses the point, but exposes the crudity of the thought processes behind evolutionary theory.\nAnd, as was pointed out\nin the New York Times today\n, no amount of hiding behind “science” will change the fact that what they’re actually doing is dogmatic politics and ideology, not actual hypothesize-test-and-observe science.\nA scientist can enter the fray by becoming an advocate for certain policies, like limits on carbon emissions or subsidies for wind power. That’s a perfectly legitimate role for scientists, as long as they acknowledge that they’re promoting their own agendas.  But too often, Dr. Pielke says, they pose as impartial experts pointing politicians to the only option that makes scientific sense. To bolster their case, they’re prone to exaggerate their expertise (like enumerating the catastrophes that would occur if their policies aren’t adopted), while denigrating their political opponents as “unqualified” or “unscientific.”\n“Some scientists want to influence policy in a certain direction and still be able to claim to be above politics,” Dr. Pielke says. “So they engage in what I call ‘stealth issue advocacy’ by smuggling political arguments into putative scientific ones.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-02-24T21:12:00+00:00"
}