{
  "url": "https://voxday.net/2009/02/05/primer-on-state-capitalis/",
  "scraped_at": "2026-01-08T22:47:16.679558",
  "title": "A primer on state capitalism",
  "date_display": "February 5, 2009",
  "date_iso": "2009-02-05T11:17:00+00:00",
  "date_from_url": "2009-02-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is an excellent post on political economy that is <a href=\"http://www.nyu.edu/projects/sciabarra/notablog/archives/001540.html\">well worth reading</a>, even if “corporatism” or “faux-financialism” might be more accurate terms for the collapsing system of “state capitalism” it describes.</p><blockquote><p>The current state and the current banking sector require one another; neither can exist without the other. They are so reciprocally intertwined that each is an extension of the other….  It is therefore no surprise that the loudest advocates for the effective nationalization of the finance industry are to be found on Wall Street; at this point, failing financiers welcome any government actions that will socialize their risks. But such actions that socialize “losses while keeping the profits in private hands” are a hallmark of fascist and neofascist economies. They are just another manifestation of “Horwitz’s First Law of Political Economy”: “no one hates capitalism more than capitalists.”</p></blockquote><p>The extent to which belief in this fraudulent form of “capitalism” spreads can be seen in the way that some “conservatives” can be seen on Fox and other networks complaining about the incipient executive compensation caps, as if there is <i>anything at all free market</i> about the government-created, government-regulated, government-funded entities that will be affected by the regulation.</p><p>The caps are a minor issue, of course.  The much larger problem is the fact that the entire infrastructure built around central finance and debt-back money is inherently flawed and looking increasingly likely to collapse.  History will show that it wasn’t ultimately any more sustainable than Soviet Communism, to name one failed political economy of similar duration.</p></div>",
  "content_text": "This is an excellent post on political economy that is\nwell worth reading\n, even if “corporatism” or “faux-financialism” might be more accurate terms for the collapsing system of “state capitalism” it describes.\nThe current state and the current banking sector require one another; neither can exist without the other. They are so reciprocally intertwined that each is an extension of the other….  It is therefore no surprise that the loudest advocates for the effective nationalization of the finance industry are to be found on Wall Street; at this point, failing financiers welcome any government actions that will socialize their risks. But such actions that socialize “losses while keeping the profits in private hands” are a hallmark of fascist and neofascist economies. They are just another manifestation of “Horwitz’s First Law of Political Economy”: “no one hates capitalism more than capitalists.”\nThe extent to which belief in this fraudulent form of “capitalism” spreads can be seen in the way that some “conservatives” can be seen on Fox and other networks complaining about the incipient executive compensation caps, as if there is\nanything at all free market\nabout the government-created, government-regulated, government-funded entities that will be affected by the regulation.\nThe caps are a minor issue, of course.  The much larger problem is the fact that the entire infrastructure built around central finance and debt-back money is inherently flawed and looking increasingly likely to collapse.  History will show that it wasn’t ultimately any more sustainable than Soviet Communism, to name one failed political economy of similar duration.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-02-05T11:17:00+00:00"
}