{
  "url": "https://voxday.net/2009/02/21/ron-paul-on-bill-maher/",
  "scraped_at": "2026-01-08T22:48:43.050629",
  "title": "Ron Paul on Bill Maher (Feb 20)",
  "date_display": "February 21, 2009",
  "date_iso": "2009-02-21T11:38:00+00:00",
  "date_from_url": "2009-02-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Summary: <i>The 1921 depression ended in a year.  The 1929 depression didn’t because the government and monetary authorities chose to intervene.  The present depression will last 15 years and the Federal Reserve is responsible for it.  End the Empire.  Bring the troops home.  End the Drug War.  Don’t listen to Keynesian economists; they are wrong. Republicans have no credibility because they didn’t practice what they preached.  Democrats have made a bad beginning and they will lose their credibility too.</i></p><p>And to think that this is the man that elite, media, and grass-roots Republicans alike rejected in favor of John McCain even as they were plunging into credit-inflated chaos.  All I can say is that Republicans richly deserve the contempt in which I and so many other individuals on both the Left and Right hold them.</p></div>",
  "content_text": "Summary:\nThe 1921 depression ended in a year.  The 1929 depression didn’t because the government and monetary authorities chose to intervene.  The present depression will last 15 years and the Federal Reserve is responsible for it.  End the Empire.  Bring the troops home.  End the Drug War.  Don’t listen to Keynesian economists; they are wrong. Republicans have no credibility because they didn’t practice what they preached.  Democrats have made a bad beginning and they will lose their credibility too.\nAnd to think that this is the man that elite, media, and grass-roots Republicans alike rejected in favor of John McCain even as they were plunging into credit-inflated chaos.  All I can say is that Republicans richly deserve the contempt in which I and so many other individuals on both the Left and Right hold them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-02-21T11:38:00+00:00"
}