{
  "url": "https://voxday.net/2009/02/08/shower-dreams/",
  "scraped_at": "2026-01-08T22:47:31.399088",
  "title": "Shower dreams",
  "date_display": "February 8, 2009",
  "date_iso": "2009-02-08T13:09:00+00:00",
  "date_from_url": "2009-02-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I suppose it was inevitable, given the attitude of female journalists towards the last Democratic president.  Even so, <a href=\"http://warner.blogs.nytimes.com/2009/02/05/sometimes-a-president-is-just-a-president/\">ye cats</a>!  And by cats, I mean giant freaking striped ones!</p><blockquote><p>The other night I dreamt of Barack Obama. He was taking a shower right when I needed to get into the bathroom to shave my legs, and then he was being yelled at by my husband, Max, for smoking in the house. It was not clear whether Max was feeling protective of the president’s health or jealous because of the cigarette….</p><p>I figured that my friend and I couldn’t possibly be the only ones dreaming, brooding or otherwise obsessing about the Obamas….  Many women — not too surprisingly — were dreaming about sex with the president.</p></blockquote><p><i>She voted in November and she’s heading for the shower.<br>She’s thinking really hard about that presidential tower.<br>She’ll spin the dial to massage dreaming of those juggy ears,<br>Because nothing gets a girl off like the thought of four more years.</br></br></br></i></p><p>White House fever.<br>She’s going out of her mind.<br>Obama fever.<br>It’s in the New York Times.</br></br></br></p><p>She’s got a callus on her finger and her wrist is hurting too;<br>She’s been self-abusing so much that her labia turned blue. <br>She feels awful for Michelle, but her legs are open wide<br>Because she can’t miss the chance to give the president a ride.</br></br></br></p><p>Obama slapped her on the ass afterwards and had a smoke.<br>As her husband raged outside, he just laughed and told a joke:<br>“See, this is how I plan to keep the nation stimulated,<br>The audacity of hope and change should not be underrated!”<br/></br></br></br></p><p>Seriously, what is wrong with these women?  And what on Earth possesses them to openly confess their psychotic sex fantasies in the newspaper?  I have to note that among the many horrified comments following the column, far and away the best was this one: <i>“Taking a shower and smoking a cigarette—-after having had sex with you, presumably?  And it’s somehow unclear what your husband is angry about?  Paging Dr Freud to the Warner residence!”</i></p></div>",
  "content_text": "I suppose it was inevitable, given the attitude of female journalists towards the last Democratic president.  Even so,\nye cats\n!  And by cats, I mean giant freaking striped ones!\nThe other night I dreamt of Barack Obama. He was taking a shower right when I needed to get into the bathroom to shave my legs, and then he was being yelled at by my husband, Max, for smoking in the house. It was not clear whether Max was feeling protective of the president’s health or jealous because of the cigarette….\nI figured that my friend and I couldn’t possibly be the only ones dreaming, brooding or otherwise obsessing about the Obamas….  Many women — not too surprisingly — were dreaming about sex with the president.\nShe voted in November and she’s heading for the shower.\nShe’s thinking really hard about that presidential tower.\nShe’ll spin the dial to massage dreaming of those juggy ears,\nBecause nothing gets a girl off like the thought of four more years.\nWhite House fever.\nShe’s going out of her mind.\nObama fever.\nIt’s in the New York Times.\nShe’s got a callus on her finger and her wrist is hurting too;\nShe’s been self-abusing so much that her labia turned blue.\nShe feels awful for Michelle, but her legs are open wide\nBecause she can’t miss the chance to give the president a ride.\nObama slapped her on the ass afterwards and had a smoke.\nAs her husband raged outside, he just laughed and told a joke:\n“See, this is how I plan to keep the nation stimulated,\nThe audacity of hope and change should not be underrated!”\nSeriously, what is wrong with these women?  And what on Earth possesses them to openly confess their psychotic sex fantasies in the newspaper?  I have to note that among the many horrified comments following the column, far and away the best was this one:\n“Taking a shower and smoking a cigarette—-after having had sex with you, presumably?  And it’s somehow unclear what your husband is angry about?  Paging Dr Freud to the Warner residence!”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-02-08T13:09:00+00:00"
}