{
  "url": "https://voxday.net/2009/02/28/this-may-amuse/",
  "scraped_at": "2026-01-08T22:49:24.816577",
  "title": "This may amuse",
  "date_display": "February 28, 2009",
  "date_iso": "2009-02-28T22:39:00+00:00",
  "date_from_url": "2009-02-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Forget debate, now I totally want to take Dawkins on in the Octagon.  With CHUCK NORRIS as a tag team partner, I have no doubt that we could take on all four New Atheists at once:</p><blockquote><p>For proof on God’s existence I recommend Lee Strobel’s <i>The Case for a Creator</i> or Hugh Ross’s <i>The Creator and the Cosmos: How the Latest Scientific Discoveries of the Century Reveal God</i>.  Another recent great book is Vox Day’s <i>The Irrational Atheist</i>, which defends belief in God against the militant atheism of antagonists like Richard Dawkins, Sam Harris, and Daniel Dennett.<br>– Chuck Norris, <i>Black Belt Patriotism</i>, p. 226</br></p></blockquote><p>Actually, before we kick their asses, we would totally debate them first for some metaphorical ass-kickery as a warm-up.  We’d skip right past the whole religion thing in order to debate Dawkins in his area of expertise, because it will be a piece of cake to prove there is no theory of evolution, <i>there is just a list of creatures Chuck Norris has allowed to live.</i></p></div>",
  "content_text": "Forget debate, now I totally want to take Dawkins on in the Octagon.  With CHUCK NORRIS as a tag team partner, I have no doubt that we could take on all four New Atheists at once:\nFor proof on God’s existence I recommend Lee Strobel’s\nThe Case for a Creator\nor Hugh Ross’s\nThe Creator and the Cosmos: How the Latest Scientific Discoveries of the Century Reveal God\n.  Another recent great book is Vox Day’s\nThe Irrational Atheist\n, which defends belief in God against the militant atheism of antagonists like Richard Dawkins, Sam Harris, and Daniel Dennett.\n– Chuck Norris,\nBlack Belt Patriotism\n, p. 226\nActually, before we kick their asses, we would totally debate them first for some metaphorical ass-kickery as a warm-up.  We’d skip right past the whole religion thing in order to debate Dawkins in his area of expertise, because it will be a piece of cake to prove there is no theory of evolution,\nthere is just a list of creatures Chuck Norris has allowed to live.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-02-28T22:39:00+00:00"
}