{
  "url": "https://voxday.net/2009/02/23/wnd-column_23-7/",
  "scraped_at": "2026-01-08T22:48:52.181092",
  "title": "WND column",
  "date_display": "February 23, 2009",
  "date_iso": "2009-02-23T07:45:00+00:00",
  "date_from_url": "2009-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.worldnetdaily.com/index.php?fa=PAGE.view&amp;pageId=89679\">War or <i>wu-wei</i>?</a></p><blockquote><p>Last week, I explained the purpose of Obama’s $787 billion stimulus bill and why it is doomed to fail. Intriguingly, Wall Street’s massive vote of no confidence in the bill, which saw the Dow Jones Industrial Average drop 6.2 percent last week and smash through significant technical support at 7,550, seems to have shaken the confidence of some of the economists who had most strongly supported the stimulus notion.</p></blockquote><p>After reading Krugman’s blog post attacking the Gilded Age this weekend, I’m a little less convinced that he’s moving away from his previous position.  Instead, it’s entirely possible that he’s simply demonstrating intellectual incoherence, as he doesn’t seem to realize that part of what he wrote in that post directly contradicts what was written in the NYT column published a few days later.  And it should be very interesting to see what the neokeyns make <a href=\"http://www.bloomberg.com/apps/news?pid=20601103&amp;sid=atVV2FPHWlH4&amp;refer=us\">of Obama’s proposal</a> to <i>cut</i> the budget deficit by raising taxes and reducing some spending, as an untimely focus on deficit reduction is precisely why they claim FDR’s New Deal wasn’t properly applied Keynesianism.</p></div>",
  "content_text": "War or\nwu-wei\n?\nLast week, I explained the purpose of Obama’s $787 billion stimulus bill and why it is doomed to fail. Intriguingly, Wall Street’s massive vote of no confidence in the bill, which saw the Dow Jones Industrial Average drop 6.2 percent last week and smash through significant technical support at 7,550, seems to have shaken the confidence of some of the economists who had most strongly supported the stimulus notion.\nAfter reading Krugman’s blog post attacking the Gilded Age this weekend, I’m a little less convinced that he’s moving away from his previous position.  Instead, it’s entirely possible that he’s simply demonstrating intellectual incoherence, as he doesn’t seem to realize that part of what he wrote in that post directly contradicts what was written in the NYT column published a few days later.  And it should be very interesting to see what the neokeyns make\nof Obama’s proposal\nto\ncut\nthe budget deficit by raising taxes and reducing some spending, as an untimely focus on deficit reduction is precisely why they claim FDR’s New Deal wasn’t properly applied Keynesianism.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-02-23T07:45:00+00:00"
}