{
  "url": "https://voxday.net/2025/02/23/copyright-must-reform/",
  "scraped_at": "2026-01-08T19:39:58.925667",
  "title": "Copyright Must Reform",
  "date_display": "February 23, 2025",
  "date_iso": "2025-02-23T11:22:45+00:00",
  "date_from_url": "2025-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Anna of Anna’s Archive, the largest archive of books outside the corpocracy, explains why the Asian approach to AI <a href=\"https://annas-archive.org/blog/ai-copyright.html\">necessitates the complete rethink of copyright </a>in the rest of the world on the basis of national security:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>When Z-Library faced shutdown, I had already backed up its entire library and was searching for a platform to house it. That was my motivation for starting Anna’s Archive: a continuation of the mission behind those earlier initiatives. We’ve since grown to be the largest shadow library in the world, hosting more than 140 million copyrighted texts across numerous formats — books, academic papers, magazines, newspapers, and beyond.</p><p>Me and my team are ideologues. We believe that preserving and hosting these files is morally right. Libraries around the world are seeing funding cuts, and we can’t trust humanity’s heritage to corporations either.</p><p>Then came AI. Virtually all major companies building LLMs contacted us to train on our data. Most (but not all!) US-based companies reconsidered once they realized the illegal nature of our work. By contrast, Chinese firms have enthusiastically embraced our collection, apparently untroubled by its legality. This is notable given China’s role as a signatory to nearly all major international copyright treaties.</p><p>We have given high-speed access to about 30 companies. Most of them are LLM companies, and some are data brokers, who will resell our collection. Most are Chinese, though we’ve also worked with companies from the US, Europe, Russia, South Korea, and Japan. DeepSeek admitted that an earlier version was trained on part of our collection, though they’re tight-lipped about their latest model (probably also trained on our data though).</p><p>If the West wants to stay ahead in the race of LLMs, and ultimately, AGI, it needs to reconsider its position on copyright, and soon. Whether you agree with us or not on our moral case, this is now becoming a case of economics, and even of national security. All power blocs are building artificial super-scientists, super-hackers, and super-militaries. Freedom of information is becoming a matter of survival for these countries — even a matter of national security.</p><p>Our team is from all over the world, and we don’t have a particular alignment. But we’d encourage countries with strong copyright laws to use this existential threat to reform them. So what to do?</p><p>Our first recommendation is straightforward: shorten the copyright term. In the US, copyright is granted for 70 years after the author’s death. This is absurd. We can bring this in line with patents, which are granted for 20 years after filing. This should be more than enough time for authors of books, papers, music, art, and other creative works, to get fully compensated for their efforts (including longer-term projects such as movie adaptations).</p></blockquote><p>I could not agree more. Copyright doesn’t protect creators, it protects the corporations who buy up copyrights and utilize them to stifle innovation for decades. The reason you can’t buy Chuck Dixon’s <em>Conan </em>novels 89 years after Robert Howard’s death is copyright. The reason Amazon is free to demolish the legacy of Tolkien, and now James Bond, is copyright. The reason the worst people on the planet control the intellectual properties that people love is copyright.</p><p>The pre-copyright era produced the works of Aristotle, Homer, and William Shakespeare. The copyright era didn’t even protect Tanith Lee from Neil Gaiman ripping her off. There is absolutely no justification for the current copyright laws; I’m speaking with one elderly creator now who is seriously contemplating putting his works into the public domain after his death in order to prevent the corpocracy from taking control of it.</p><p>But the fact that copyright will put the entire Western corpocracy at a massive disadvantage should at least provide some impetus for things to move in a much more reasonable direction, particularly if the matter is brought to the God-Emperor’s attention.</p><p><em><a href=\"https://socialgalactic.com/micropost/4d669ecc-4eda-4142-97c1-af81504ee2c3\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Anna of Anna’s Archive, the largest archive of books outside the corpocracy, explains why the Asian approach to AI\nnecessitates the complete rethink of copyright\nin the rest of the world on the basis of national security:\nWhen Z-Library faced shutdown, I had already backed up its entire library and was searching for a platform to house it. That was my motivation for starting Anna’s Archive: a continuation of the mission behind those earlier initiatives. We’ve since grown to be the largest shadow library in the world, hosting more than 140 million copyrighted texts across numerous formats — books, academic papers, magazines, newspapers, and beyond.\nMe and my team are ideologues. We believe that preserving and hosting these files is morally right. Libraries around the world are seeing funding cuts, and we can’t trust humanity’s heritage to corporations either.\nThen came AI. Virtually all major companies building LLMs contacted us to train on our data. Most (but not all!) US-based companies reconsidered once they realized the illegal nature of our work. By contrast, Chinese firms have enthusiastically embraced our collection, apparently untroubled by its legality. This is notable given China’s role as a signatory to nearly all major international copyright treaties.\nWe have given high-speed access to about 30 companies. Most of them are LLM companies, and some are data brokers, who will resell our collection. Most are Chinese, though we’ve also worked with companies from the US, Europe, Russia, South Korea, and Japan. DeepSeek admitted that an earlier version was trained on part of our collection, though they’re tight-lipped about their latest model (probably also trained on our data though).\nIf the West wants to stay ahead in the race of LLMs, and ultimately, AGI, it needs to reconsider its position on copyright, and soon. Whether you agree with us or not on our moral case, this is now becoming a case of economics, and even of national security. All power blocs are building artificial super-scientists, super-hackers, and super-militaries. Freedom of information is becoming a matter of survival for these countries — even a matter of national security.\nOur team is from all over the world, and we don’t have a particular alignment. But we’d encourage countries with strong copyright laws to use this existential threat to reform them. So what to do?\nOur first recommendation is straightforward: shorten the copyright term. In the US, copyright is granted for 70 years after the author’s death. This is absurd. We can bring this in line with patents, which are granted for 20 years after filing. This should be more than enough time for authors of books, papers, music, art, and other creative works, to get fully compensated for their efforts (including longer-term projects such as movie adaptations).\nI could not agree more. Copyright doesn’t protect creators, it protects the corporations who buy up copyrights and utilize them to stifle innovation for decades. The reason you can’t buy Chuck Dixon’s\nConan\nnovels 89 years after Robert Howard’s death is copyright. The reason Amazon is free to demolish the legacy of Tolkien, and now James Bond, is copyright. The reason the worst people on the planet control the intellectual properties that people love is copyright.\nThe pre-copyright era produced the works of Aristotle, Homer, and William Shakespeare. The copyright era didn’t even protect Tanith Lee from Neil Gaiman ripping her off. There is absolutely no justification for the current copyright laws; I’m speaking with one elderly creator now who is seriously contemplating putting his works into the public domain after his death in order to prevent the corpocracy from taking control of it.\nBut the fact that copyright will put the entire Western corpocracy at a massive disadvantage should at least provide some impetus for things to move in a much more reasonable direction, particularly if the matter is brought to the God-Emperor’s attention.\nDISCUSS ON SG",
  "tags": [
    "books",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-02-23T11:22:47+00:00"
}