{
  "url": "https://voxday.net/2025/02/04/deep-state-and-deep-church/",
  "scraped_at": "2026-01-08T19:37:53.335310",
  "title": "Deep State and Deep Church",
  "date_display": "February 4, 2025",
  "date_iso": "2025-02-04T16:53:31+00:00",
  "date_from_url": "2025-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Archbishop Vignano <a href=\"https://www.thegatewaypundit.com/2025/02/archbishop-vigano-letter-american-catholics/\">calls out two subversive Clown World entities</a> serving Satan and seeking to destroy Mankind: the Deep State and the Deep Church:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><em><strong>Two Subversive Entities</strong></em></p><p>Among the entities that support the globalist agenda for the profits they derive from it in terms of power and money is the <em><strong>deep state</strong></em>, made up of those apparatuses that have embedded themselves within the government and that determine its political action and choices, regardless of the color of the various alternating administrations, acting for their own interests against those of the citizens they claim to serve.</p><p>However, there is also what I myself have called the<em><strong> deep church</strong></em>, which is similarly composed of exponents of the Catholic Hierarchy, who after decades of progressive infiltration and occupation have come to take full control of the Catholic Church, along with Jorge Mario Bergoglio. These fifth columns of the globalist elite use their authority for the interests of third parties, in opposition to the glory of God, the honor of the Church, and the good of souls.</p><p>These two subversive entities – <em>deep state and deep church</em>, as I recalled in my first Open Letter to President Trump in 2020 (<a href=\"https://exsurgedomine.it/200607-trump-eng/\">here</a>) – are mirror images and complementary: their members are traitors in the service of illegitimate powers, which we have seen acting in a coordinated way during the pandemic farce, with “green fraud” and trafficking in illegal immigrants. American citizens and faithful Catholics have now understood that the serious social, economic, and religious crisis of the nation has been caused and prepared from afar by the coup of these forces subverting legitimate authority, one in the civil sphere and the other in the religious sphere. Americans have also come to understand that there is a huge difference between the refugee fleeing persecution and an organized mass of adult men of military age, transferred in a systematic way within national borders, who effectively constitute in a contingent of enemy soldiers and a potential threat to national security and the safety of citizens.</p><p><em><strong>The Complicity of the Deep State with the Deep Church</strong></em></p><p>The proof of the complicity between the <em>deep state</em> and the <em>deep church</em> is given not only by the fact that both support the programmatic points of <em>Agenda 2030</em> because they derive an immediate advantage from them, but also by their mutual unwillingness to accept the reality that a legitimately elected President now desires to concretely implement the commitments he made during his electoral campaign. Their resistance is due to the fact that Trump’s initiatives seek to put an end to the network of interests and profits that they have fraudulently constructed in recent years. It is no mystery that the United States Conference of Catholic Bishops (USCCB) has never – and I repeat: <em>never</em> – raised a penny to fight abortion, but rather has funded with tens of millions of dollars associations that adhere to the <em>Catholic Campaign for Human Development</em> and promote abortion, contraception, and homosexuality. Nor does the USCCB have any qualms about receiving subsidies from the Department of the Treasury for its management of illegal immigration, as its budgets, which are public, prove. And it should be remembered that, in addition to government funds, the USCCB receives funding from institutions and private foundations for the same purposes.</p><p>If in fact, as some would have us believe, the Bergoglian Hierarchy truly had at heart the salvation of souls – of <em>all</em> souls, both the souls of US citizens and the souls of the migrants who arrive on US territory – it should be doing what the Catholic Church has already very successfully undertaken in the past: providing for the evangelization, conversion, and religious instruction of these souls. I am thinking, for example, of Saint Frances Xavier Cabrini, the foundress of the Missionaries of the Sacred Heart of Jesus, the first American citizen to be raised to the honors of the altar. Her work of assistance to immigrants (initially Italians) expanded to include all those in need. She built churches, kindergartens, schools, boarding schools for female students, orphanages, retirement homes for lay and religious women, hospitals, and colleges thanks to the generosity of Catholics. Her example of a true apostolic and missionary spirit has been renounced, and<em> cancel culture</em>, so much in vogue today in the Bergoglian Church, is almost ashamed of the charitable work undertaken by her and other Saints.</p><p><em><strong>The Bergoglian Church is an Accomplice in Ethnic Replacement</strong></em></p><p>In this context, it is dismaying to hear the words of Jorge Mario Bergoglio, who recently stated – referring to Italy but speaking about the entire Western world – that, in the face of demographic decline, the only workable solution is to import immigrants, thus concretizing the <em>ethnic replacement</em> theorized by Kalergi, the pan-European. This proposal is also widely reflected in similar requests from multinational corporations, who see the importation of immigrants as a way to drastically reduce the cost of labor to the detriment of native workers, further increasing their profits. As we can see, Authority is now completely subservient to the<em> diktats</em> of the elite, with the complicity of the <em>mainstream</em> media, even if this leads to a worsening of the social and working conditions of the population. Or rather, <em>it is precisely for this reason</em>, since, as I said, the ultimate goal of this lobby is the extermination of a sizeable portion of the human race.</p></blockquote><p>Make no mistake, every accommodation of the Deep State and the Deep Church is an accommodation with satanry. The civic nationalism of the conservatives is every bit as subversive, and every bit as false, as the globalism of the socialists. Transnationalism is no more legitimate than transgenderism or transracialism.</p><p>Never forget the conclusion of the great Israeli historian Martin van Creveld: <em>Immigration is War.</em></p><p><em><a href=\"https://socialgalactic.com/micropost/5b288d13-958b-4a45-b368-cf92998ac561\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Archbishop Vignano\ncalls out two subversive Clown World entities\nserving Satan and seeking to destroy Mankind: the Deep State and the Deep Church:\nTwo Subversive Entities\nAmong the entities that support the globalist agenda for the profits they derive from it in terms of power and money is the\ndeep state\n, made up of those apparatuses that have embedded themselves within the government and that determine its political action and choices, regardless of the color of the various alternating administrations, acting for their own interests against those of the citizens they claim to serve.\nHowever, there is also what I myself have called the\ndeep church\n, which is similarly composed of exponents of the Catholic Hierarchy, who after decades of progressive infiltration and occupation have come to take full control of the Catholic Church, along with Jorge Mario Bergoglio. These fifth columns of the globalist elite use their authority for the interests of third parties, in opposition to the glory of God, the honor of the Church, and the good of souls.\nThese two subversive entities –\ndeep state and deep church\n, as I recalled in my first Open Letter to President Trump in 2020 (\nhere\n) – are mirror images and complementary: their members are traitors in the service of illegitimate powers, which we have seen acting in a coordinated way during the pandemic farce, with “green fraud” and trafficking in illegal immigrants. American citizens and faithful Catholics have now understood that the serious social, economic, and religious crisis of the nation has been caused and prepared from afar by the coup of these forces subverting legitimate authority, one in the civil sphere and the other in the religious sphere. Americans have also come to understand that there is a huge difference between the refugee fleeing persecution and an organized mass of adult men of military age, transferred in a systematic way within national borders, who effectively constitute in a contingent of enemy soldiers and a potential threat to national security and the safety of citizens.\nThe Complicity of the Deep State with the Deep Church\nThe proof of the complicity between the\ndeep state\nand the\ndeep church\nis given not only by the fact that both support the programmatic points of\nAgenda 2030\nbecause they derive an immediate advantage from them, but also by their mutual unwillingness to accept the reality that a legitimately elected President now desires to concretely implement the commitments he made during his electoral campaign. Their resistance is due to the fact that Trump’s initiatives seek to put an end to the network of interests and profits that they have fraudulently constructed in recent years. It is no mystery that the United States Conference of Catholic Bishops (USCCB) has never – and I repeat:\nnever\n– raised a penny to fight abortion, but rather has funded with tens of millions of dollars associations that adhere to the\nCatholic Campaign for Human Development\nand promote abortion, contraception, and homosexuality. Nor does the USCCB have any qualms about receiving subsidies from the Department of the Treasury for its management of illegal immigration, as its budgets, which are public, prove. And it should be remembered that, in addition to government funds, the USCCB receives funding from institutions and private foundations for the same purposes.\nIf in fact, as some would have us believe, the Bergoglian Hierarchy truly had at heart the salvation of souls – of\nall\nsouls, both the souls of US citizens and the souls of the migrants who arrive on US territory – it should be doing what the Catholic Church has already very successfully undertaken in the past: providing for the evangelization, conversion, and religious instruction of these souls. I am thinking, for example, of Saint Frances Xavier Cabrini, the foundress of the Missionaries of the Sacred Heart of Jesus, the first American citizen to be raised to the honors of the altar. Her work of assistance to immigrants (initially Italians) expanded to include all those in need. She built churches, kindergartens, schools, boarding schools for female students, orphanages, retirement homes for lay and religious women, hospitals, and colleges thanks to the generosity of Catholics. Her example of a true apostolic and missionary spirit has been renounced, and\ncancel culture\n, so much in vogue today in the Bergoglian Church, is almost ashamed of the charitable work undertaken by her and other Saints.\nThe Bergoglian Church is an Accomplice in Ethnic Replacement\nIn this context, it is dismaying to hear the words of Jorge Mario Bergoglio, who recently stated – referring to Italy but speaking about the entire Western world – that, in the face of demographic decline, the only workable solution is to import immigrants, thus concretizing the\nethnic replacement\ntheorized by Kalergi, the pan-European. This proposal is also widely reflected in similar requests from multinational corporations, who see the importation of immigrants as a way to drastically reduce the cost of labor to the detriment of native workers, further increasing their profits. As we can see, Authority is now completely subservient to the\ndiktats\nof the elite, with the complicity of the\nmainstream\nmedia, even if this leads to a worsening of the social and working conditions of the population. Or rather,\nit is precisely for this reason\n, since, as I said, the ultimate goal of this lobby is the extermination of a sizeable portion of the human race.\nMake no mistake, every accommodation of the Deep State and the Deep Church is an accommodation with satanry. The civic nationalism of the conservatives is every bit as subversive, and every bit as false, as the globalism of the socialists. Transnationalism is no more legitimate than transgenderism or transracialism.\nNever forget the conclusion of the great Israeli historian Martin van Creveld:\nImmigration is War.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "Clown World",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-02-04T16:58:46+00:00"
}