{
  "url": "https://voxday.net/2025/02/22/elon-musk-is-a-midwit/",
  "scraped_at": "2026-01-08T19:39:53.389695",
  "title": "Elon Musk is a Midwit",
  "date_display": "February 22, 2025",
  "date_iso": "2025-02-22T13:00:42+00:00",
  "date_from_url": "2025-02-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>He’s just an actor who is playing the part of what the average man believes a brilliant and successful man to be. But <a href=\"https://www.yahoo.com/news/author-upcoming-elon-musk-biography-040538098.html\">it’s not real</a>. It has never, ever, been real or even remotely convincing. Anyone who reads here regularly knows that I have denigrated his obvious lack of intelligence all along.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Attorney, journalist, and Elon Musk biographer Seth Abramson eviscerated both Elon Musk and his “fanboys” who have attempted to use the billionaire’s IQ as an indication of his intellectual prowess in a series of messages shared on X Thursday evening and into Friday. “You are in a cult,” he wrote in one before he later noted Musk “has zero <em>personal</em> intellectual achievements.”</p><p>“As an Elon Musk biographer, I would peg his IQ as between 100 and 110,” Abramson tweeted Thursday afternoon. “There’s zero evidence in his biography of anything higher. And I want to repeat that now, lest you think it a typo. There’s zero evidence, from his life history, of Musk having anything higher than a 110 IQ.”</p></blockquote><p>Elon Musk, like Albert Einstein, Jordan Peterson, Ben Shapiro, Steven Gould, and Richard Dawkins, is a fake intellectual. There are many men whose aphorisms and utterances I have observed to contain sparks of brilliance, insight, and wisdom. Umberto Eco. Thomas Aquinas. Jerry Pournelle. Martin van Creveld. William S. Lind. Christopher Hallpike. John C. Wright. Nassim Nicholas Taleb. Nicholas Machiavelli. GK Chesterton. JRR Tolkien. Above all, Aristotle.</p><p>Elon Musk is not, and has never been, one of them.</p><p>This is not to say that I am opposed to what Elon Musk, or Elon Mask, as the case may be, is achieving with DOGE. I’m all for it. Long may the act continue. But it is an act, nothing more.</p><p>That’s the trouble with propping up midwits and pretending that they possess brilliant minds. Those who know what the real thing is can always see right through it.</p><p>That being said, give credit where credit is due. Even a midwit is capable of seeing through the <s>Patriot</s> FBI Front.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-66553\" decoding=\"async\" fetchpriority=\"high\" height=\"414\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2025/02/image-28.png\" srcset=\"https://voxday.net/wp-content/uploads/2025/02/image-28.png 512w, https://voxday.net/wp-content/uploads/2025/02/image-28-300x243.png 300w\" width=\"512\"/></figure></div><p><em><a href=\"https://socialgalactic.com/micropost/7aa5d57c-7cb7-4a8d-874e-5231f953619f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "He’s just an actor who is playing the part of what the average man believes a brilliant and successful man to be. But\nit’s not real\n. It has never, ever, been real or even remotely convincing. Anyone who reads here regularly knows that I have denigrated his obvious lack of intelligence all along.\nAttorney, journalist, and Elon Musk biographer Seth Abramson eviscerated both Elon Musk and his “fanboys” who have attempted to use the billionaire’s IQ as an indication of his intellectual prowess in a series of messages shared on X Thursday evening and into Friday. “You are in a cult,” he wrote in one before he later noted Musk “has zero\npersonal\nintellectual achievements.”\n“As an Elon Musk biographer, I would peg his IQ as between 100 and 110,” Abramson tweeted Thursday afternoon. “There’s zero evidence in his biography of anything higher. And I want to repeat that now, lest you think it a typo. There’s zero evidence, from his life history, of Musk having anything higher than a 110 IQ.”\nElon Musk, like Albert Einstein, Jordan Peterson, Ben Shapiro, Steven Gould, and Richard Dawkins, is a fake intellectual. There are many men whose aphorisms and utterances I have observed to contain sparks of brilliance, insight, and wisdom. Umberto Eco. Thomas Aquinas. Jerry Pournelle. Martin van Creveld. William S. Lind. Christopher Hallpike. John C. Wright. Nassim Nicholas Taleb. Nicholas Machiavelli. GK Chesterton. JRR Tolkien. Above all, Aristotle.\nElon Musk is not, and has never been, one of them.\nThis is not to say that I am opposed to what Elon Musk, or Elon Mask, as the case may be, is achieving with DOGE. I’m all for it. Long may the act continue. But it is an act, nothing more.\nThat’s the trouble with propping up midwits and pretending that they possess brilliant minds. Those who know what the real thing is can always see right through it.\nThat being said, give credit where credit is due. Even a midwit is capable of seeing through the\nPatriot\nFBI Front.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-02-22T13:26:49+00:00"
}