{
  "url": "https://voxday.net/2025/02/05/nfl-referees-confirm-suspicions/",
  "scraped_at": "2026-01-08T19:37:58.939646",
  "title": "NFL Referees Confirm Suspicions",
  "date_display": "February 5, 2025",
  "date_iso": "2025-02-05T13:44:07+00:00",
  "date_from_url": "2025-02-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The NFL referees practically <a href=\"https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/nfl-referees-association-calls-conspiracy-theories-both-insulting-and-preposterous\">confirm that certain games are being rigged</a> on the orders of the league office in their very suspicious non-denial denial of their own corruption.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>On Monday, Commissioner Roger Goodell pushed back on the suggestion that game officials favor the Chiefs. On Tuesday, the union representing game officials issued a statement expressing appreciation for the Commissioner’s remarks.</p><p>“Commissioner Goodell’s comments that it is ‘ridiculous’ to presume that NFL Officials are not doing everything possible to make the right call on every play is spot on,” NFL Referees Association executive director Scott Green said. “Officiating crews do not work the same team more than twice each regular season. It is insulting and preposterous to hear conspiracy theories that somehow 17 officiating crews consisting of 138 officials are colluding to assist one team.”</p><p>That’s a bit strong. And it teeters on the possibility of protesting too much.</p></blockquote><p>It doesn’t teeter on the possibility of protesting too much, it’s an obvious non-denial denial. When someone suspected of robbing a specific liquor store at a specific time pompously declares that it is insulting and preposterous to hear conspiracy theories that somehow 17 different criminal organizations are colluding to rob 138 different liquor stores and gas stations, instead of directly addressing the actual accusation, that’s such an obvious evasion that it serves as a practical confession.</p><p>We all know that the NFL puts the thumb on the scale when one team is blowing out another team at halftime. We can all see when a coach and quarterback have been instructed to lose a game. And it’s absolutely and entirely obvious when a head referee has been told which team should get the important calls. The NFL and the NFL Referees Association is insulting our intelligence when they try to pretend that they are a completely honest and organic sporting association when we all know that they are a for-profit <em>entertainment </em>organization that has the legal right to put on a show in any way it deems most entertaining.</p><p>The more they protest in such stupid and obvious ways, the more they confirm our suspicions. And if the Vikings bring back Sam Darnold, that will serve as strong support for the hypothesis that the last two games of the 2024 season were intentionally thrown by the Vikings on the orders of the NFL.</p><p><em><a href=\"https://socialgalactic.com/micropost/cdea9ad1-ca48-4675-8002-8f0b56c68d72\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The NFL referees practically\nconfirm that certain games are being rigged\non the orders of the league office in their very suspicious non-denial denial of their own corruption.\nOn Monday, Commissioner Roger Goodell pushed back on the suggestion that game officials favor the Chiefs. On Tuesday, the union representing game officials issued a statement expressing appreciation for the Commissioner’s remarks.\n“Commissioner Goodell’s comments that it is ‘ridiculous’ to presume that NFL Officials are not doing everything possible to make the right call on every play is spot on,” NFL Referees Association executive director Scott Green said. “Officiating crews do not work the same team more than twice each regular season. It is insulting and preposterous to hear conspiracy theories that somehow 17 officiating crews consisting of 138 officials are colluding to assist one team.”\nThat’s a bit strong. And it teeters on the possibility of protesting too much.\nIt doesn’t teeter on the possibility of protesting too much, it’s an obvious non-denial denial. When someone suspected of robbing a specific liquor store at a specific time pompously declares that it is insulting and preposterous to hear conspiracy theories that somehow 17 different criminal organizations are colluding to rob 138 different liquor stores and gas stations, instead of directly addressing the actual accusation, that’s such an obvious evasion that it serves as a practical confession.\nWe all know that the NFL puts the thumb on the scale when one team is blowing out another team at halftime. We can all see when a coach and quarterback have been instructed to lose a game. And it’s absolutely and entirely obvious when a head referee has been told which team should get the important calls. The NFL and the NFL Referees Association is insulting our intelligence when they try to pretend that they are a completely honest and organic sporting association when we all know that they are a for-profit\nentertainment\norganization that has the legal right to put on a show in any way it deems most entertaining.\nThe more they protest in such stupid and obvious ways, the more they confirm our suspicions. And if the Vikings bring back Sam Darnold, that will serve as strong support for the hypothesis that the last two games of the 2024 season were intentionally thrown by the Vikings on the orders of the NFL.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "rhetoric",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-02-05T14:46:57+00:00"
}