{
  "url": "https://voxday.net/2025/02/23/no-one-will-fight-for-clown-world/",
  "scraped_at": "2026-01-08T19:40:00.765832",
  "title": "No One Will Fight for Clown World",
  "date_display": "February 23, 2025",
  "date_iso": "2025-02-23T14:47:39+00:00",
  "date_from_url": "2025-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Macron-Starmer proposal of 30,000 British and French troops to serve as a “Reassurance Force” in Ukraine was <a href=\"https://www.rt.com/news/613114-britain-working-class-starmer-war-ukraine/\">obviously DUA, dead upon articulation.</a></p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The British public and Parliament were caught off guard by what many see as a reckless proposal from their PM. He announced the possibility of “British boots on the ground” just hours after the Munich meeting ended. This decision, or threat, appears to be a unilateral move by Starmer. It is unlikely to gain widespread support across the country and is already sparking outrage, particularly in the “Red Wall” – Britain’s former industrial heartlands. A poll in The Times just last week showed that only 11% of young people in the UK would consider fighting for their country, showing what we all know: that the UK is deeply divided over class, race, and region.</p><p>This is a problem for Starmer and the British liberals who have yet again found their war drums that were put away following the disastrous follies in Iraq and Afghanistan. What was once the Labour heartlands, the de-industrialized parts of the country, have also been the typical recruiting fields for the British Soldier – the white working class. These communities have been badly let down by all politicians have become deeply resentful and detached from what is happening within the politics, media and chattering classes of London.</p><p>It is no coincidence that those beating the war drums in London are the same individuals who supported the Iraq invasion and opposed the outcome of the EU referendum that led to Brexit. There has been a distinct division throughout the country since Brexit and I suspect Starmer’s reckless offering up of our military to “peacekeep” for the EU is a signal that he wants a closer relationship with the bloc. Unfortunately for Starmer, his brand of Labour – middle-class metropolitan liberals – will never offer up their own children for military service and will look north towards the very people they have spent the nine years since the Brexit referendum accusing of being racists, bigots, and xenophobes.</p><p>Starmer and Macron are deeply unpopular in their own countries. Perhaps they think they can paint over the damage done in their countries by successive neo-liberal governments by pulling the patriotic chord through the threat of war. But Starmer must realise that this will never be his Falklands War moment – when an unpopular Margaret Thatcher and her Tory government turned around their unpopularity by going to war with Argentina in 1982. Working-class populations outside the big metropolitan cities, in places like Blyth, Sunderland, Mansfield and Stoke-on-Trent, have traditionally been patriotic and supported the British military, but they will not follow Starmer and the failed EU leaders into a battle they see as ‘not theirs’.</p><p>The lesson here for the Western European political leaders is that ignoring sections of the population, allowing deep divisions and inequalities to fester, and then banging the war drums and expecting the working class to go and fight a war for you is not going to work. They can see right through this, and Vance’s words spoke to them more directly than a despised European elite class ever could.</p></blockquote><p>Only the professionalization of the US military in the post-Vietnam era permitted its misuse and abuse as the enforcement arm of Clown World. But that was a much more innocent era, when the young were indoctrinated into patriotism and love of their nation. We’re now two generations into the redefinition of patriotism as racism and love of one’s nation as hate, which means that the only young men capable of fighting are either a) foreigners who hate the nation they’ve invaded and b) nationalists who hate the Clown Worlders who despise and hate them.</p><p>The vast majority of young British men are far more inclined to take up arms against the Starmer government than fight for it, much less to do so in defense of the illegitimate, anti-democratic Kiev regime.</p><p>I am descended from a long line of men who served the US military with great distinction dating back to Valley Forge. From there to Guadacanal and Korea, they fought and they bled for the Stars and Stripes, because they believed in serving their nation. Not an ideology, not some lines drawn on a map, not an idea, and not a state bureaucracy. They served their <em>nation</em>.</p><p>But neither I nor any of my descendants will ever lift a single finger in defense of Clown World, not in Ukraine, and not anywhere on the planet.</p><p><em><a href=\"https://socialgalactic.com/micropost/e69915c1-5652-4786-9c99-2dba4c370fe0\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Macron-Starmer proposal of 30,000 British and French troops to serve as a “Reassurance Force” in Ukraine was\nobviously DUA, dead upon articulation.\nThe British public and Parliament were caught off guard by what many see as a reckless proposal from their PM. He announced the possibility of “British boots on the ground” just hours after the Munich meeting ended. This decision, or threat, appears to be a unilateral move by Starmer. It is unlikely to gain widespread support across the country and is already sparking outrage, particularly in the “Red Wall” – Britain’s former industrial heartlands. A poll in The Times just last week showed that only 11% of young people in the UK would consider fighting for their country, showing what we all know: that the UK is deeply divided over class, race, and region.\nThis is a problem for Starmer and the British liberals who have yet again found their war drums that were put away following the disastrous follies in Iraq and Afghanistan. What was once the Labour heartlands, the de-industrialized parts of the country, have also been the typical recruiting fields for the British Soldier – the white working class. These communities have been badly let down by all politicians have become deeply resentful and detached from what is happening within the politics, media and chattering classes of London.\nIt is no coincidence that those beating the war drums in London are the same individuals who supported the Iraq invasion and opposed the outcome of the EU referendum that led to Brexit. There has been a distinct division throughout the country since Brexit and I suspect Starmer’s reckless offering up of our military to “peacekeep” for the EU is a signal that he wants a closer relationship with the bloc. Unfortunately for Starmer, his brand of Labour – middle-class metropolitan liberals – will never offer up their own children for military service and will look north towards the very people they have spent the nine years since the Brexit referendum accusing of being racists, bigots, and xenophobes.\nStarmer and Macron are deeply unpopular in their own countries. Perhaps they think they can paint over the damage done in their countries by successive neo-liberal governments by pulling the patriotic chord through the threat of war. But Starmer must realise that this will never be his Falklands War moment – when an unpopular Margaret Thatcher and her Tory government turned around their unpopularity by going to war with Argentina in 1982. Working-class populations outside the big metropolitan cities, in places like Blyth, Sunderland, Mansfield and Stoke-on-Trent, have traditionally been patriotic and supported the British military, but they will not follow Starmer and the failed EU leaders into a battle they see as ‘not theirs’.\nThe lesson here for the Western European political leaders is that ignoring sections of the population, allowing deep divisions and inequalities to fester, and then banging the war drums and expecting the working class to go and fight a war for you is not going to work. They can see right through this, and Vance’s words spoke to them more directly than a despised European elite class ever could.\nOnly the professionalization of the US military in the post-Vietnam era permitted its misuse and abuse as the enforcement arm of Clown World. But that was a much more innocent era, when the young were indoctrinated into patriotism and love of their nation. We’re now two generations into the redefinition of patriotism as racism and love of one’s nation as hate, which means that the only young men capable of fighting are either a) foreigners who hate the nation they’ve invaded and b) nationalists who hate the Clown Worlders who despise and hate them.\nThe vast majority of young British men are far more inclined to take up arms against the Starmer government than fight for it, much less to do so in defense of the illegitimate, anti-democratic Kiev regime.\nI am descended from a long line of men who served the US military with great distinction dating back to Valley Forge. From there to Guadacanal and Korea, they fought and they bled for the Stars and Stripes, because they believed in serving their nation. Not an ideology, not some lines drawn on a map, not an idea, and not a state bureaucracy. They served their\nnation\n.\nBut neither I nor any of my descendants will ever lift a single finger in defense of Clown World, not in Ukraine, and not anywhere on the planet.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "UK",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-02-23T14:47:42+00:00"
}