{
  "url": "https://voxday.net/2025/02/19/not-much-room-for-complaint/",
  "scraped_at": "2026-01-08T19:39:29.885907",
  "title": "Not Much Room for Complaint",
  "date_display": "February 19, 2025",
  "date_iso": "2025-02-19T11:23:44+00:00",
  "date_from_url": "2025-02-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is no reason the God-Emperor 2.0, or anyone else, should take the complaints of the Ukrainians or the Europeans seriously. <a href=\"https://www.rt.com/news/612992-trump-disappointment-ukraine/\">He’s absolutely correct to point out</a> that the Kiev regime had a seat at the negotiating table in both the Minsk 1.0 and the Minsk 2.0 talks, and not only did it fail to keep their agreements, but they actually passed a law making it illegal to talk to the Russians at all. So they’re out, and they should be out, because they’re part of the problem, not part of the solution.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>US President Donald Trump has expressed disappointment with Ukraine’s leadership over its complaints that it was not invited to US-Russia peace talks in Saudi Arabia, suggesting that it has squandered opportunities to end the conflict on its own for years. Speaking to reporters after high-level talks in Riyadh on Tuesday, Trump was asked if he had a message for Ukrainians who may have felt “betrayed or disappointed” about not having a seat at the table.</p><p>“I’m really disappointed in what’s happened. I’ve been watching this for three years… I hear that, you know, they’re upset about not having a seat. Well, they’ve had a seat for three years and a long time before that.”</p><p>Trump added that the conflict “could have been settled very easily. A half-baked negotiator could have settled this years ago without the loss of much land, very little land. Without the loss of any lives and without the loss of cities,” he said.</p></blockquote><p>And as for Europe, if any of the European countries want to be part of any post-surrender peacekeeping, that’s up to them. But it’s not the USA’s problem, the USA’s responsibility, or in line with the wishes of the American people.</p><p><em>Trump said he would welcome an EU peacekeeping force in Ukraine in case of a ceasefire between Moscow and Kiev. “If they want to do it, that’s great. I’m all for it. I would not object to it at all,” he said. Trump stressed that US troops would not be involved in any peacekeeping arrangement.</em></p><p>Besides, all those pro-Ukrainian morons have been telling us for years that Russia is weak, that Russia is losing the war, that the Russian economy is crumbling and that Russia is running out of ammunition in two weeks. So why are they suddenly crying about their fears of a Russian invasion of Europe? And why should anyone pay any attention to anything they say ever again?</p><p><em><a href=\"https://socialgalactic.com/micropost/6396ced0-4ab9-4634-9a12-f8574e2f2609\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "There is no reason the God-Emperor 2.0, or anyone else, should take the complaints of the Ukrainians or the Europeans seriously.\nHe’s absolutely correct to point out\nthat the Kiev regime had a seat at the negotiating table in both the Minsk 1.0 and the Minsk 2.0 talks, and not only did it fail to keep their agreements, but they actually passed a law making it illegal to talk to the Russians at all. So they’re out, and they should be out, because they’re part of the problem, not part of the solution.\nUS President Donald Trump has expressed disappointment with Ukraine’s leadership over its complaints that it was not invited to US-Russia peace talks in Saudi Arabia, suggesting that it has squandered opportunities to end the conflict on its own for years. Speaking to reporters after high-level talks in Riyadh on Tuesday, Trump was asked if he had a message for Ukrainians who may have felt “betrayed or disappointed” about not having a seat at the table.\n“I’m really disappointed in what’s happened. I’ve been watching this for three years… I hear that, you know, they’re upset about not having a seat. Well, they’ve had a seat for three years and a long time before that.”\nTrump added that the conflict “could have been settled very easily. A half-baked negotiator could have settled this years ago without the loss of much land, very little land. Without the loss of any lives and without the loss of cities,” he said.\nAnd as for Europe, if any of the European countries want to be part of any post-surrender peacekeeping, that’s up to them. But it’s not the USA’s problem, the USA’s responsibility, or in line with the wishes of the American people.\nTrump said he would welcome an EU peacekeeping force in Ukraine in case of a ceasefire between Moscow and Kiev. “If they want to do it, that’s great. I’m all for it. I would not object to it at all,” he said. Trump stressed that US troops would not be involved in any peacekeeping arrangement.\nBesides, all those pro-Ukrainian morons have been telling us for years that Russia is weak, that Russia is losing the war, that the Russian economy is crumbling and that Russia is running out of ammunition in two weeks. So why are they suddenly crying about their fears of a Russian invasion of Europe? And why should anyone pay any attention to anything they say ever again?\nDISCUSS ON SG",
  "tags": [
    "EU",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-02-19T11:23:46+00:00"
}