{
  "url": "https://voxday.net/2025/02/09/our-world-has-changed/",
  "scraped_at": "2026-01-08T19:38:29.490797",
  "title": "Our World Has Changed",
  "date_display": "February 9, 2025",
  "date_iso": "2025-02-09T13:45:43+00:00",
  "date_from_url": "2025-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Carter explains <a href=\"https://substack.com/home/post/p-156741047\">why we’re going to have to change our mindset</a> now that the latest iteration of The Empire That Never Ended appears to have fallen and we are the hunters:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>It isn’t only the left whose world has come undone, practically overnight. Our world, too, has changed irrevocably. For long, desperate years we have been as hunted animals in the wilderness, partisans hiding in the badlands of the Internet, launching culture jamming raids to harry the enemy at his points of weakness. We have become accustomed to our role as outsiders locked in permanent guerrilla war with the Regime. We’ve taken horrific casualties, yes – careers destroyed, lives ruined, in some cases even lives lost: millions of young men have died deaths of despair, and while only a few of them were direct combatants in the meme war, the civilian casualties must be counted towards the enemy’s grim toll.</p><p>Infuriating as the meme war could often be, there was also a sense of comradeship within the Society of Frens. When your account got banned, or your friend got doxxed, people would come together, offering solidarity, even helping out financially. We were all in this together, after all. More, the meme war was fun, and over the years we became expert in our trade. There’s a thrill to piling into the replies of a hapless libtard, a fierce joy in dismantling their pseudo-intellectual paramoralisms to the point that they ragequit the interaction by blocking you, a grim pleasure in taking some piece of hackneyed focus-grouped public relations slop and reformatting it into counter-propaganda that leverages the system’s own words and imagery against it, a quiet satisfaction in seeing the ideas germinated in your anonymous shitpoasts being laundered through the mouths of high-profile personalities.</p><p>By and large that’s over now. The legacy media is simply irrelevant to the public discourse now. The libs are mostly shocked into silence. Our hungry frogs are so starved for prey that they’re falling on squishy centrist conservatives, who stupidly stepped into the role vacated by the shitlibs when they fled X for the great hugbox in the (blue)sky. We’ve won. We’re not partisan raiders, but an occupying force. We aren’t being hunted, but are the hunters. We are not at war with the Regime, because we are the Regime. It will take time to adjust to this, and many will not adjust well.</p><p>There was a Taliban soldier who, after the fall of Kabul, lamented that he missed the good old days of sleeping under the stars with his brothers in arms, playing a lethal game of hide and seek with the US military. Hard and uncomfortable as that was, in retrospect it had been a lot more fun than sitting in an air-conditioned office dealing with the administrative minutiae of parking regulations.</p><p>That’s us, now, and we haven’t really come to terms with it. The enemy has collapsed. Decades of preference falsification have come apart, as they always do, in a preference cascade – people admitting that they don’t actually believe the things they pretended to believe because everyone else was pretending to believe them and they didn’t realize everyone was pretending, only now they do know, so they’re saying what they really believed all along, and so is everyone else. It’s an Emperor’s New Clothes moment, a Fall of the Berlin Wall moment. The invulnerability conferred by the appearance of monolithic consensus has been cracked; the illusion having been dispelled, the spell is impossible to cast again. They’re done.</p><p>We’ll be dealing with the fallout for many years to come. There are so many secrets to be revealed, so many ugly little scandals to be uncovered, such a depth and variety of mendacious little conspiracies and corrupt petty grifts that have permeated our society at every level, paralyzing it so it could be parasitized. Clearing out the organizational, financial, cultural, and psychological wreckage will take decades. These people have been running their sick social engineering experiments for generations; we’ve all grown up in their MKULTRA world, and have no real idea just how fake and gay our kayfabe Truman Show society really is. But I think we’re going to find out, and it’s going to shock a lot of people – both those who, though ‘redpilled’, didn’t really know just how bad it really was, but especially those who, because bluepilled, had no idea that their entire identity is a psyop. People’s minds are going to shatter from that; many will never come back (how do you come back from surgically trooning yourself, or worse, your child?), and we’ll be carrying that burden of walking wounded for the rest of our lives.</p><p>And, here’s the annoying thing: it is you, yes, you, the person reading this right now, the rightist dissident that set himself against the powers of the Earth when the risk of doing so was greatest, who is responsible for doing all of this. Or at least whatever your small part in it is. You’re not on the outside looking in anymore: you’re the Regime, now. For years we’ve contented ourselves by pointing out the injustice, incompetence, and inefficiency of the demented ruling class and its army of flying rainbow butt monkeys. Mere critique is no longer enough. The worldsoul has heard us, and it has decided to give us exactly what we said we wanted: power. We have said for years that we know better than the fools in charge. Now we’re the fools in charge. We’ve talked the talk, now we have to walk the walk. It is put up or shut up time.</p></blockquote><p>It’s not over, though. It’s not even close to over. I’m still banned from YouTube, from X, and from Blusky. Unauthorized is still recovering from last year. There are still no shortage of people, even so-called “conservatives” who conspicuously disdain to work with us even when it makes obvious sense for them to do so. We have a reliable crowdfunding site now, or rather, a reliable and friendly crowdfunding site now. We even have what is rapidly becoming the leading news site in cultural entertainment with Fandom Pulse, and refugees from the Great Comics Collapse of 2024 are contacting Arkhaven on a regular basis; we’re already beginning to work with former DC and Marvel illustrators. We have a working bindery. The Legend has a movie coming out next month and there is a very good chance it is going to hit the top spot on the box office.</p><p>But speaking only for myself and our teams, we’re not going to get complacent and cruise. We fought too hard and too long to forget the lessons that we learned while struggling to financially survive to take the foot off the gas or remove our protective armor.</p><p>Don’t relax. Don’t let up. Don’t give any quarter, because they never gave any to us. It’s easy to be frosty when being frosty is necessary for survival, it’s not so easy when the sun is shining, the champagne is flowing, and the beach is beckoning. So stay frosty, don’t hesitate to say things, take advantage of this reprieve to become even stronger, ignore the charlatans who were never part of the parade who will seek to jump to the front of it, and <em>don’t ever forget</em> the frens who stood by you when no one else would.</p><p><em><a href=\"https://socialgalactic.com/micropost/669d57c7-533a-46bc-be50-dc03f7d3d862\">DISCUSS ON SG</a></em></p><p></p></div>",
  "content_text": "John Carter explains\nwhy we’re going to have to change our mindset\nnow that the latest iteration of The Empire That Never Ended appears to have fallen and we are the hunters:\nIt isn’t only the left whose world has come undone, practically overnight. Our world, too, has changed irrevocably. For long, desperate years we have been as hunted animals in the wilderness, partisans hiding in the badlands of the Internet, launching culture jamming raids to harry the enemy at his points of weakness. We have become accustomed to our role as outsiders locked in permanent guerrilla war with the Regime. We’ve taken horrific casualties, yes – careers destroyed, lives ruined, in some cases even lives lost: millions of young men have died deaths of despair, and while only a few of them were direct combatants in the meme war, the civilian casualties must be counted towards the enemy’s grim toll.\nInfuriating as the meme war could often be, there was also a sense of comradeship within the Society of Frens. When your account got banned, or your friend got doxxed, people would come together, offering solidarity, even helping out financially. We were all in this together, after all. More, the meme war was fun, and over the years we became expert in our trade. There’s a thrill to piling into the replies of a hapless libtard, a fierce joy in dismantling their pseudo-intellectual paramoralisms to the point that they ragequit the interaction by blocking you, a grim pleasure in taking some piece of hackneyed focus-grouped public relations slop and reformatting it into counter-propaganda that leverages the system’s own words and imagery against it, a quiet satisfaction in seeing the ideas germinated in your anonymous shitpoasts being laundered through the mouths of high-profile personalities.\nBy and large that’s over now. The legacy media is simply irrelevant to the public discourse now. The libs are mostly shocked into silence. Our hungry frogs are so starved for prey that they’re falling on squishy centrist conservatives, who stupidly stepped into the role vacated by the shitlibs when they fled X for the great hugbox in the (blue)sky. We’ve won. We’re not partisan raiders, but an occupying force. We aren’t being hunted, but are the hunters. We are not at war with the Regime, because we are the Regime. It will take time to adjust to this, and many will not adjust well.\nThere was a Taliban soldier who, after the fall of Kabul, lamented that he missed the good old days of sleeping under the stars with his brothers in arms, playing a lethal game of hide and seek with the US military. Hard and uncomfortable as that was, in retrospect it had been a lot more fun than sitting in an air-conditioned office dealing with the administrative minutiae of parking regulations.\nThat’s us, now, and we haven’t really come to terms with it. The enemy has collapsed. Decades of preference falsification have come apart, as they always do, in a preference cascade – people admitting that they don’t actually believe the things they pretended to believe because everyone else was pretending to believe them and they didn’t realize everyone was pretending, only now they do know, so they’re saying what they really believed all along, and so is everyone else. It’s an Emperor’s New Clothes moment, a Fall of the Berlin Wall moment. The invulnerability conferred by the appearance of monolithic consensus has been cracked; the illusion having been dispelled, the spell is impossible to cast again. They’re done.\nWe’ll be dealing with the fallout for many years to come. There are so many secrets to be revealed, so many ugly little scandals to be uncovered, such a depth and variety of mendacious little conspiracies and corrupt petty grifts that have permeated our society at every level, paralyzing it so it could be parasitized. Clearing out the organizational, financial, cultural, and psychological wreckage will take decades. These people have been running their sick social engineering experiments for generations; we’ve all grown up in their MKULTRA world, and have no real idea just how fake and gay our kayfabe Truman Show society really is. But I think we’re going to find out, and it’s going to shock a lot of people – both those who, though ‘redpilled’, didn’t really know just how bad it really was, but especially those who, because bluepilled, had no idea that their entire identity is a psyop. People’s minds are going to shatter from that; many will never come back (how do you come back from surgically trooning yourself, or worse, your child?), and we’ll be carrying that burden of walking wounded for the rest of our lives.\nAnd, here’s the annoying thing: it is you, yes, you, the person reading this right now, the rightist dissident that set himself against the powers of the Earth when the risk of doing so was greatest, who is responsible for doing all of this. Or at least whatever your small part in it is. You’re not on the outside looking in anymore: you’re the Regime, now. For years we’ve contented ourselves by pointing out the injustice, incompetence, and inefficiency of the demented ruling class and its army of flying rainbow butt monkeys. Mere critique is no longer enough. The worldsoul has heard us, and it has decided to give us exactly what we said we wanted: power. We have said for years that we know better than the fools in charge. Now we’re the fools in charge. We’ve talked the talk, now we have to walk the walk. It is put up or shut up time.\nIt’s not over, though. It’s not even close to over. I’m still banned from YouTube, from X, and from Blusky. Unauthorized is still recovering from last year. There are still no shortage of people, even so-called “conservatives” who conspicuously disdain to work with us even when it makes obvious sense for them to do so. We have a reliable crowdfunding site now, or rather, a reliable and friendly crowdfunding site now. We even have what is rapidly becoming the leading news site in cultural entertainment with Fandom Pulse, and refugees from the Great Comics Collapse of 2024 are contacting Arkhaven on a regular basis; we’re already beginning to work with former DC and Marvel illustrators. We have a working bindery. The Legend has a movie coming out next month and there is a very good chance it is going to hit the top spot on the box office.\nBut speaking only for myself and our teams, we’re not going to get complacent and cruise. We fought too hard and too long to forget the lessons that we learned while struggling to financially survive to take the foot off the gas or remove our protective armor.\nDon’t relax. Don’t let up. Don’t give any quarter, because they never gave any to us. It’s easy to be frosty when being frosty is necessary for survival, it’s not so easy when the sun is shining, the champagne is flowing, and the beach is beckoning. So stay frosty, don’t hesitate to say things, take advantage of this reprieve to become even stronger, ignore the charlatans who were never part of the parade who will seek to jump to the front of it, and\ndon’t ever forget\nthe frens who stood by you when no one else would.\nDISCUSS ON SG",
  "tags": [
    "God-Emperor 2.0",
    "philosophy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-02-09T13:45:47+00:00"
}