{
  "url": "https://voxday.net/2025/02/10/the-damage-is-profound/",
  "scraped_at": "2026-01-08T19:38:35.005225",
  "title": "The Damage is Profound",
  "date_display": "February 10, 2025",
  "date_iso": "2025-02-10T10:41:00+00:00",
  "date_from_url": "2025-02-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The most important thing to note about President Trump’s return to the White House is the way in which it completely confounds the arguments that Republican moderates and conservatives alike have been making since 1988, which is that chasing the electorate left is the way to win elections and gain popularity. <a href=\"https://archive.is/2025.02.07-205205/https://www.nytimes.com/2025/02/06/opinion/democratic-party-donald-trump.html#selection-4991.0-4993.186\">The New York Times is panicking</a> over the disarray in which the Democratic Party finds itself.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Patrick Healy:</strong> In my 20-plus years writing about politics, I’ve never seen the Democratic Party in such trouble nationally. They lost the White House and Senate and are seen unfavorably by record numbers of voters and out of step on key issues, according to recent polls. I think part of this is a trust problem — you still hear from independents and even some Democrats that the party tried to pull a fast one on America by circling the wagons around a cognitively diminished president and then subbing in a new nominee whom voters didn’t pick. I think the damage to the party is worse — and maybe longer lasting — than Democratic leaders may realize, and these problems make it harder for the Democrats to persuasively counter President Trump. How do you see the state of the party?</p><p><strong>Michelle Goldberg:</strong> I agree that the damage to the party is profound, but I’m not sure there’s reason to think it will be lasting. After 2004, another devastating election for Democrats, absolutely no one would have predicted that Democrats would triumph four years later by nominating an urbane Black first-term senator from Chicago whose middle name was Hussein. After Jan. 6, many of us naïvely thought that Trump’s brand was irreparably damaged. The one constant in American politics, it seems to me, is that things tend to change faster than people predict. The last Trump administration ended in absolute mayhem, and the signs so far suggest that this one will be worse. I’m not sure how much anyone will be thinking about Joe Biden’s age in 2028, or even 2026.</p><p><strong>Bret Stephens</strong>: Democrats don’t seem to realize how profoundly out of touch they are with that segment of America that they can’t identify through a collection of letters or neologisms: BIPOC, L.G.B.T.Q.I.+, A.A.P.I., the “unhoused,” the “undocumented” and so on. They have lost themselves in forms of identity politics that divide Americans into categories many don’t recognize or from which they feel excluded. And I don’t just mean white, male, Christian Americans. For example, ask many Hispanics what they think of the term “Latinx,” a nonsensical term in a gendered language like Spanish, and you might begin to grasp why more than 40 percent of Hispanic men voted for Trump. Similarly, ask many feminists what they think of the term “birthing people” or “persons with vaginas” and you might risk a well-deserved slap…</p><p><strong>Stephens: </strong>Democrats tried the politics of “resistance” against Trump by painting him as a beyond-the-pale threat to the constitutional order. Maybe that’s right, but I don’t think it’s effective. </p></blockquote><p>People want leadership, and followership is not leadership. The stronger the horse, the more it pulls people in the direction that it is going. And President Trump is a very strong horse indeed.</p><p><em><a href=\"https://socialgalactic.com/micropost/bd0fbcd5-bf88-4ca3-bf39-1b1d4e93691d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The most important thing to note about President Trump’s return to the White House is the way in which it completely confounds the arguments that Republican moderates and conservatives alike have been making since 1988, which is that chasing the electorate left is the way to win elections and gain popularity.\nThe New York Times is panicking\nover the disarray in which the Democratic Party finds itself.\nPatrick Healy:\nIn my 20-plus years writing about politics, I’ve never seen the Democratic Party in such trouble nationally. They lost the White House and Senate and are seen unfavorably by record numbers of voters and out of step on key issues, according to recent polls. I think part of this is a trust problem — you still hear from independents and even some Democrats that the party tried to pull a fast one on America by circling the wagons around a cognitively diminished president and then subbing in a new nominee whom voters didn’t pick. I think the damage to the party is worse — and maybe longer lasting — than Democratic leaders may realize, and these problems make it harder for the Democrats to persuasively counter President Trump. How do you see the state of the party?\nMichelle Goldberg:\nI agree that the damage to the party is profound, but I’m not sure there’s reason to think it will be lasting. After 2004, another devastating election for Democrats, absolutely no one would have predicted that Democrats would triumph four years later by nominating an urbane Black first-term senator from Chicago whose middle name was Hussein. After Jan. 6, many of us naïvely thought that Trump’s brand was irreparably damaged. The one constant in American politics, it seems to me, is that things tend to change faster than people predict. The last Trump administration ended in absolute mayhem, and the signs so far suggest that this one will be worse. I’m not sure how much anyone will be thinking about Joe Biden’s age in 2028, or even 2026.\nBret Stephens\n: Democrats don’t seem to realize how profoundly out of touch they are with that segment of America that they can’t identify through a collection of letters or neologisms: BIPOC, L.G.B.T.Q.I.+, A.A.P.I., the “unhoused,” the “undocumented” and so on. They have lost themselves in forms of identity politics that divide Americans into categories many don’t recognize or from which they feel excluded. And I don’t just mean white, male, Christian Americans. For example, ask many Hispanics what they think of the term “Latinx,” a nonsensical term in a gendered language like Spanish, and you might begin to grasp why more than 40 percent of Hispanic men voted for Trump. Similarly, ask many feminists what they think of the term “birthing people” or “persons with vaginas” and you might risk a well-deserved slap…\nStephens:\nDemocrats tried the politics of “resistance” against Trump by painting him as a beyond-the-pale threat to the constitutional order. Maybe that’s right, but I don’t think it’s effective.\nPeople want leadership, and followership is not leadership. The stronger the horse, the more it pulls people in the direction that it is going. And President Trump is a very strong horse indeed.\nDISCUSS ON SG",
  "tags": [
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-02-10T10:41:02+00:00"
}