{
  "url": "https://voxday.net/2025/02/22/the-inevitable-retreat-of-nato/",
  "scraped_at": "2026-01-08T19:39:55.265255",
  "title": "The Inevitable Retreat of NATO",
  "date_display": "February 22, 2025",
  "date_iso": "2025-02-22T17:01:23+00:00",
  "date_from_url": "2025-02-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The retreat of NATO is obviously in the works if <a href=\"https://www.rt.com/news/613130-bild-us-could-withdraw-troops-nato-east/\">the Europeans are already openly wringing their hands</a> about the US withdrawing its troops and its security guarantees from Eastern and Central Europe.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Western security services and politicians are worried about a potential exit of US troops from NATO member states in Central and Eastern Europe, <em>Bild </em>has reported on Wednesday, citing unnamed sources. The tabloid suggests that Russia is trying to get the US to radically downgrade its military presence on the continent.</p><p><em>Bild </em>claimed that European members of NATO “feared” that the high-level US-Russia talks in Saudi Arabia on Tuesday, could lead to such an outcome. The German media outlet quoted an anonymous Western European security official as saying, “according to our information, we’re talking about Putin’s 2021 demands, that is, the withdrawal of US troops from all NATO states that joined the alliance after 1990.”</p><p>In December 2021, Russia presented the US and NATO with a list of proposals aimed at reshaping the security architecture in Europe, and to rule out Ukraine’s accession. The West rejected the Kremlin’s overture as an ultimatum at the time. <em>Bild </em>also quoted former Lithuanian Foreign Minister Gabrielius Landsbergis who posted on X on Tuesday that “it seems much more than likely” that the Kremlin would renew its demands that “NATO must go back to its 1997 borders, retreating from everything except East Germany.” He noted that while Trump technically cannot unilaterally implement a “reversal of NATO enlargement,” he could still “withdraw US troops from the Eastern Flank, which would have almost the same effect.”</p><p>The nations that would theoretically be affected include Albania, Bulgaria, Croatia, the Czech Republic, Estonia, Finland, Hungary, Latvia, Lithuania, Montenegro, North Macedonia, Poland, Romania, Slovakia, Slovenia, and Sweden.</p></blockquote><p>Or, as one might say, a good start. Germany and Italy should be added to that list as well.</p><p>And what was that about how <em>“Trump technically cannot unilaterally implement a ‘reversal of NATO enlargement'”</em>? After what we’ve witnessed in the first month of the God-Emperors second incarnation, who would be foolish enough to rule it out? In fact, I’d go so far as to express my confidence that if Trump declares such a reversal – and he absolutely should – it will be implemented immediately, no matter how the Eurotards wail and gnash their teeth.</p><p>Wiser heads would have taken the Russian deal in 2021. They should pray that the Russians don’t see fit to further alter it from what is being offered now.</p><p>The US not only could withdraw its troops from Europe, it should and it will. The Russian ultimatum is neither here nor there, because the God-Emperor may want those troops for the occupations of Canada and Greenland…</p><p><em><a href=\"https://socialgalactic.com/micropost/42acfb43-740f-4757-a616-96f53da6bf46\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The retreat of NATO is obviously in the works if\nthe Europeans are already openly wringing their hands\nabout the US withdrawing its troops and its security guarantees from Eastern and Central Europe.\nWestern security services and politicians are worried about a potential exit of US troops from NATO member states in Central and Eastern Europe,\nBild\nhas reported on Wednesday, citing unnamed sources. The tabloid suggests that Russia is trying to get the US to radically downgrade its military presence on the continent.\nBild\nclaimed that European members of NATO “feared” that the high-level US-Russia talks in Saudi Arabia on Tuesday, could lead to such an outcome. The German media outlet quoted an anonymous Western European security official as saying, “according to our information, we’re talking about Putin’s 2021 demands, that is, the withdrawal of US troops from all NATO states that joined the alliance after 1990.”\nIn December 2021, Russia presented the US and NATO with a list of proposals aimed at reshaping the security architecture in Europe, and to rule out Ukraine’s accession. The West rejected the Kremlin’s overture as an ultimatum at the time.\nBild\nalso quoted former Lithuanian Foreign Minister Gabrielius Landsbergis who posted on X on Tuesday that “it seems much more than likely” that the Kremlin would renew its demands that “NATO must go back to its 1997 borders, retreating from everything except East Germany.” He noted that while Trump technically cannot unilaterally implement a “reversal of NATO enlargement,” he could still “withdraw US troops from the Eastern Flank, which would have almost the same effect.”\nThe nations that would theoretically be affected include Albania, Bulgaria, Croatia, the Czech Republic, Estonia, Finland, Hungary, Latvia, Lithuania, Montenegro, North Macedonia, Poland, Romania, Slovakia, Slovenia, and Sweden.\nOr, as one might say, a good start. Germany and Italy should be added to that list as well.\nAnd what was that about how\n“Trump technically cannot unilaterally implement a ‘reversal of NATO enlargement'”\n? After what we’ve witnessed in the first month of the God-Emperors second incarnation, who would be foolish enough to rule it out? In fact, I’d go so far as to express my confidence that if Trump declares such a reversal – and he absolutely should – it will be implemented immediately, no matter how the Eurotards wail and gnash their teeth.\nWiser heads would have taken the Russian deal in 2021. They should pray that the Russians don’t see fit to further alter it from what is being offered now.\nThe US not only could withdraw its troops from Europe, it should and it will. The Russian ultimatum is neither here nor there, because the God-Emperor may want those troops for the occupations of Canada and Greenland…\nDISCUSS ON SG",
  "tags": [
    "EU",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-02-22T17:01:26+00:00"
}