{
  "url": "https://voxday.net/2025/02/23/the-conservative-media-is-fake/",
  "scraped_at": "2026-01-08T19:40:02.603816",
  "title": "The Conservative Media is Fake",
  "date_display": "February 23, 2025",
  "date_iso": "2025-02-23T17:50:46+00:00",
  "date_from_url": "2025-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The so-called conservative media not only isn’t a genuine alternative to the mainstream media, since the days of William F. Buckley <a href=\"https://x.com/BasedSamParker/status/1893418594681397611\">it has always been a neocon psy-op</a> meant to derail American nationalism and prevent any genuine American nationalist media from being formed in reaction to the growing awareness of Clown World and rejection of it.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>In the first New York Post article the day after Ashley St. Clair announced her baby with Elon Musk, she claimed that she didn’t initially have an “much of an interest in Elon” until after she met him in May 2023 at an interview at Twitter HQ. But there she is on May 2nd, 2023, telling @IsabellaIsMoody that she wants to be funny for Elon in order to have his “rocket babies.” This date is important.</p><p>That meeting with Elon Musk at Twitter HQ was on May 22–<em>3 weeks after</em> telling Isabella she wanted Elon’s babies. IOW, she lied in the Post article about not being interested in Elon until after she met him. Strange. It looks like she’s constructing a false narrative to make it look like their romance was innocent &amp; spontaneous after having met. Why would she need to do that unless it wasn’t actually innocent &amp; spontaneous?</p><p>But the plot thickens a little more. Seth Dillon, CEO of the Babylon Bee, is the one that facilitated her meeting Elon IRL. He had her fly out for that Babylon Bee interview with Elon, as Ashley noted in the Post article and confirmed by Ashley’s own tweet from May 22, 2023.</p><p>But Ashley wasn’t ultimately pictured in the Bee’s announcement of the interview with Elon, nor did she participate in the video interview itself at any point. This sort of begs the question: why did Seth Dillon fly her out to meet Elon?</p><p>Is it because Dillon is part of an israeli influence operation himself as some–including myself–have suggested?</p></blockquote><p>We already knew the Babylon Bee is fake opposition that gatekeeps Christians. That’s been obvious for some time now, ever since the guy who bought it from its founder unmasked himself. But the extent to which its subversive activities go, and its apparent influence over other fake media conservatives, was not previously suspected.</p><p>It appears there is little strategic difference between Epstein, Disney, Jordan Peterson, the Daily Wire, and the Babylon Bee, except for their target populations.</p><p><em><a href=\"https://socialgalactic.com/micropost/f7f8a7a1-a9c9-4231-bfbc-39e011d118f4\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The so-called conservative media not only isn’t a genuine alternative to the mainstream media, since the days of William F. Buckley\nit has always been a neocon psy-op\nmeant to derail American nationalism and prevent any genuine American nationalist media from being formed in reaction to the growing awareness of Clown World and rejection of it.\nIn the first New York Post article the day after Ashley St. Clair announced her baby with Elon Musk, she claimed that she didn’t initially have an “much of an interest in Elon” until after she met him in May 2023 at an interview at Twitter HQ. But there she is on May 2nd, 2023, telling @IsabellaIsMoody that she wants to be funny for Elon in order to have his “rocket babies.” This date is important.\nThat meeting with Elon Musk at Twitter HQ was on May 22–\n3 weeks after\ntelling Isabella she wanted Elon’s babies. IOW, she lied in the Post article about not being interested in Elon until after she met him. Strange. It looks like she’s constructing a false narrative to make it look like their romance was innocent & spontaneous after having met. Why would she need to do that unless it wasn’t actually innocent & spontaneous?\nBut the plot thickens a little more. Seth Dillon, CEO of the Babylon Bee, is the one that facilitated her meeting Elon IRL. He had her fly out for that Babylon Bee interview with Elon, as Ashley noted in the Post article and confirmed by Ashley’s own tweet from May 22, 2023.\nBut Ashley wasn’t ultimately pictured in the Bee’s announcement of the interview with Elon, nor did she participate in the video interview itself at any point. This sort of begs the question: why did Seth Dillon fly her out to meet Elon?\nIs it because Dillon is part of an israeli influence operation himself as some–including myself–have suggested?\nWe already knew the Babylon Bee is fake opposition that gatekeeps Christians. That’s been obvious for some time now, ever since the guy who bought it from its founder unmasked himself. But the extent to which its subversive activities go, and its apparent influence over other fake media conservatives, was not previously suspected.\nIt appears there is little strategic difference between Epstein, Disney, Jordan Peterson, the Daily Wire, and the Babylon Bee, except for their target populations.\nDISCUSS ON SG",
  "tags": [
    "Clown World",
    "judeo-christianity",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-02-23T17:50:48+00:00"
}