{
  "url": "https://voxday.net/2025/02/01/the-pointlessness-of-posturing/",
  "scraped_at": "2026-01-08T19:37:31.354596",
  "title": "The Pointlessness of Posturing",
  "date_display": "February 1, 2025",
  "date_iso": "2025-02-01T19:44:18+00:00",
  "date_from_url": "2025-02-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Either a number of people associated with Baen Books <a href=\"https://fandompulse.substack.com/p/baen-books-author-larry-correia-announces\">are less dialed-in</a> to what is happening on the business side than they believe themselves to be or they desperately need lessons in some of the basics of public relations.</p><ul class=\"wp-block-list\"><li>PR 101: Never deny anything that you know someone else can prove.</li><li>PR 102: Never get into a fight with anyone who buys ink by the barrel.</li></ul><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><a href=\"https://x.com/monsterhunter45/status/1885413461523398673\">Larry Correia posted a long-winded rant both on his blog and on X </a>regarding the piece, opening with the personal attack, “So I hear certain people are trying to stir up outrage clicks spreading dumb rumors about some publishers again.”</p><p>Our article, however, does not contain any speculation, only a reporting of facts that have been verified and direct commentary from several Baen Books authors and employees, as previously noted.</p><p>Correia did, however, elaborate that he intends to diversify his book portfolio from Baen Books even further in the coming years. He said, “Here, I’ll even add to the freak out, I’m also going to be doing some pure indy stuff in the future too. Why? Because I can, and I want to see what happens when I do. It has been a long time since I’ve experimented in that, the market has changed a ton since then, and has a lot of potential. I like making money. Me doing an indy project might make money. Go figure.”</p><p>Many of Correia’s fans reacted to his rant, voicing support for the author and making odd comments mocking his “career-ending,” responding to everything he said but not any of the information in Fandom Pulse’s article, as Correia obfuscated as to what the topic was at hand.</p><p>Former Sad Puppy Sarah A. Hoyt, who was dropped from Baen due to her poor sales and is not an American, replied with a bizarre comment, “Yeah. People asked, so I actually read the idiocy. It’s all a thinly veiled tissue of hallucinations…. Having been the subject of such ‘reporting’ before, I’m not even amused.” It’s unclear what she’s talking about.</p></blockquote><p>It doesn’t take a genius to observe that Baen Books is unlikely to survive the loss of Larry Correia to both a) another publisher and b) going independent. Perhaps some of the people quoted don’t know this, but Baen is 25 percent owned by Tor Books and has a very limited number of distribution slots through its distribution partner. As with most mainstream publishers, it is heavily dependent upon its bestselling author or two propping up the rest of its authors.</p><p>This is the problem that Tor Books faces as well. The reason John Scalzi was given a massive lead author contract was because Tor needed to replace Brandon Sanderson, the late Robert Jordan, and the game tie-in business that it lost, unfortunately for Tor and Scalzi, he has been unable to do so. He still sells, he just doesn’t sell well enough.</p><p>The fact that Larry Correia walked means that Baen Books couldn’t afford the right of first refusal to his new series, which is hardly surprising. I told Larry back in 2015 that he should go independent and I’ve expected to see him do so ever since Brandon Sanderson demonstrated how high the ceiling can be for an independent author. The fact that he was willing to prop up Baen for nearly ten years longer than he probably should have from a financial perspective is testimony to his loyalty and gratitude to his longtime publisher.</p><p>But Baen has been circling the drain for years anyhow, because its business practices are out of date. It ignored the authors it should have been courting – including Nick Cole, Jason Anspach, John C. Wright, JDA, and myself, among others – while also ignoring the advent of crowdfunding and the negative impact of Kindle Unlimited. And now its window of opportunity has closed.</p><p>People can preen and posture all they like, but what will be will be. And it’s both foolish and futile to get one’s panties in a bunch over educated observers simply noting what has happened, what is happening, and what is likely to happen. Let bygones be bygones and make hay while the sun is shining; just yesterday one of my more vehement past critics and I achieved mutual understanding on a potential future project with excellent prospects for both of us; whether we follow through on it or not, the mere fact of our discussion is a testimony to the professional approach to these things.</p><p>I may not be fond of John Scalzi, just to give one example, but if the man ever decides he wants to do a deluxe edition of <em>Old Man’s War</em> in leather, I’ll not only agree to work with him, I’ll guarantee him that we will make him a higher-quality and more attractive edition than Easton or Folio Society will give him. Because an important part of being professional is learning how to set aside one’s personal predilections.</p><p><em><a href=\"https://socialgalactic.com/micropost/f0587b88-07ca-4270-bed7-daa719da4f3d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Either a number of people associated with Baen Books\nare less dialed-in\nto what is happening on the business side than they believe themselves to be or they desperately need lessons in some of the basics of public relations.\nPR 101: Never deny anything that you know someone else can prove.\nPR 102: Never get into a fight with anyone who buys ink by the barrel.\nLarry Correia posted a long-winded rant both on his blog and on X\nregarding the piece, opening with the personal attack, “So I hear certain people are trying to stir up outrage clicks spreading dumb rumors about some publishers again.”\nOur article, however, does not contain any speculation, only a reporting of facts that have been verified and direct commentary from several Baen Books authors and employees, as previously noted.\nCorreia did, however, elaborate that he intends to diversify his book portfolio from Baen Books even further in the coming years. He said, “Here, I’ll even add to the freak out, I’m also going to be doing some pure indy stuff in the future too. Why? Because I can, and I want to see what happens when I do. It has been a long time since I’ve experimented in that, the market has changed a ton since then, and has a lot of potential. I like making money. Me doing an indy project might make money. Go figure.”\nMany of Correia’s fans reacted to his rant, voicing support for the author and making odd comments mocking his “career-ending,” responding to everything he said but not any of the information in Fandom Pulse’s article, as Correia obfuscated as to what the topic was at hand.\nFormer Sad Puppy Sarah A. Hoyt, who was dropped from Baen due to her poor sales and is not an American, replied with a bizarre comment, “Yeah. People asked, so I actually read the idiocy. It’s all a thinly veiled tissue of hallucinations…. Having been the subject of such ‘reporting’ before, I’m not even amused.” It’s unclear what she’s talking about.\nIt doesn’t take a genius to observe that Baen Books is unlikely to survive the loss of Larry Correia to both a) another publisher and b) going independent. Perhaps some of the people quoted don’t know this, but Baen is 25 percent owned by Tor Books and has a very limited number of distribution slots through its distribution partner. As with most mainstream publishers, it is heavily dependent upon its bestselling author or two propping up the rest of its authors.\nThis is the problem that Tor Books faces as well. The reason John Scalzi was given a massive lead author contract was because Tor needed to replace Brandon Sanderson, the late Robert Jordan, and the game tie-in business that it lost, unfortunately for Tor and Scalzi, he has been unable to do so. He still sells, he just doesn’t sell well enough.\nThe fact that Larry Correia walked means that Baen Books couldn’t afford the right of first refusal to his new series, which is hardly surprising. I told Larry back in 2015 that he should go independent and I’ve expected to see him do so ever since Brandon Sanderson demonstrated how high the ceiling can be for an independent author. The fact that he was willing to prop up Baen for nearly ten years longer than he probably should have from a financial perspective is testimony to his loyalty and gratitude to his longtime publisher.\nBut Baen has been circling the drain for years anyhow, because its business practices are out of date. It ignored the authors it should have been courting – including Nick Cole, Jason Anspach, John C. Wright, JDA, and myself, among others – while also ignoring the advent of crowdfunding and the negative impact of Kindle Unlimited. And now its window of opportunity has closed.\nPeople can preen and posture all they like, but what will be will be. And it’s both foolish and futile to get one’s panties in a bunch over educated observers simply noting what has happened, what is happening, and what is likely to happen. Let bygones be bygones and make hay while the sun is shining; just yesterday one of my more vehement past critics and I achieved mutual understanding on a potential future project with excellent prospects for both of us; whether we follow through on it or not, the mere fact of our discussion is a testimony to the professional approach to these things.\nI may not be fond of John Scalzi, just to give one example, but if the man ever decides he wants to do a deluxe edition of\nOld Man’s War\nin leather, I’ll not only agree to work with him, I’ll guarantee him that we will make him a higher-quality and more attractive edition than Easton or Folio Society will give him. Because an important part of being professional is learning how to set aside one’s personal predilections.\nDISCUSS ON SG",
  "tags": [
    "books",
    "philosophy",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-02-01T19:51:20+00:00"
}