{
  "url": "https://voxday.net/2025/02/06/these-are-not-our-principles/",
  "scraped_at": "2026-01-08T19:38:08.257767",
  "title": "These are Not Our Principles",
  "date_display": "February 6, 2025",
  "date_iso": "2025-02-06T20:33:44+00:00",
  "date_from_url": "2025-02-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>But they do make for a good point from which to begin contemplating them. From Walter Isaacson’s excellent biography of Steve Jobs.</p><p>Markkula would become a father figure to Jobs… “Mike really took me under his wing,” Jobs recalled. “His values were much aligned with mine. He emphasized that you should never start a company with the goal of getting rich. Your goal should be making something you believe in and making a company that will last.”</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Markkula wrote his principles in a one-page paper titled “The Apple Marketing Philosophy” that stressed three points. The first was <em>empathy</em>, an intimate connection with the feelings of the customer: “We will truly understand their needs better than any other company.” The second was <em>focus</em>: “In order to do a good job of those things that we decide to do, we must eliminate all of the unimportant opportunities.” The third and equally important principle, awkwardly named, was <em>impute</em>. It emphasized that people form an opinion about a company or product based on the signals that it conveys. “People DO judge a book by its cover,” he wrote. “We may have the best product, the highest quality, the most useful software etc.; if we present them in a slipshod manner, they will be perceived as slipshod; if we present them in a creative, professional manner, we will impute the desired qualities.”</p></blockquote><p>It’s not for us to say, but I think we’re doing reasonably well on all three scores. The biggest failure, I think, is impute, with regards to which we very much need to improve our Internet store game. And, obviously, we need to reduce our release times, but we’re already focused on that.</p><p>The only way to improve is to contemplate one’s failings.</p><p><em><a href=\"https://socialgalactic.com/micropost/091e89a1-9358-474f-aa75-e16740505df0\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "But they do make for a good point from which to begin contemplating them. From Walter Isaacson’s excellent biography of Steve Jobs.\nMarkkula would become a father figure to Jobs… “Mike really took me under his wing,” Jobs recalled. “His values were much aligned with mine. He emphasized that you should never start a company with the goal of getting rich. Your goal should be making something you believe in and making a company that will last.”\nMarkkula wrote his principles in a one-page paper titled “The Apple Marketing Philosophy” that stressed three points. The first was\nempathy\n, an intimate connection with the feelings of the customer: “We will truly understand their needs better than any other company.” The second was\nfocus\n: “In order to do a good job of those things that we decide to do, we must eliminate all of the unimportant opportunities.” The third and equally important principle, awkwardly named, was\nimpute\n. It emphasized that people form an opinion about a company or product based on the signals that it conveys. “People DO judge a book by its cover,” he wrote. “We may have the best product, the highest quality, the most useful software etc.; if we present them in a slipshod manner, they will be perceived as slipshod; if we present them in a creative, professional manner, we will impute the desired qualities.”\nIt’s not for us to say, but I think we’re doing reasonably well on all three scores. The biggest failure, I think, is impute, with regards to which we very much need to improve our Internet store game. And, obviously, we need to reduce our release times, but we’re already focused on that.\nThe only way to improve is to contemplate one’s failings.\nDISCUSS ON SG",
  "tags": [
    "Castalia",
    "corpocracy",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-02-06T20:33:46+00:00"
}