{
  "url": "https://voxday.net/2025/02/18/write-what-thou-wilt/",
  "scraped_at": "2026-01-08T19:39:22.854447",
  "title": "Write What Thou Wilt",
  "date_display": "February 18, 2025",
  "date_iso": "2025-02-18T14:23:12+00:00",
  "date_from_url": "2025-02-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>This selection from an essay by the late Roger Zelazny pretty well encapsulates why I never get caught up in the popular illusion that sales = quality or the importance of a writer. From The Road to Amber</em>:</p><p>The anecdote that fascinates me most is about the man I have a secret admiration for—Timothy Shay Arthur, who amazingly in the 1840s wrote five percent of everything published in America. He was the most prolific author of his day. If they wanted temperance books, he’d grind out temperance books by the ream. If abolition suddenly became a popular notion politically, he’d be writing abolition tracts. If somebody wanted frontier novels, he’d be writing frontier novels. Everybody was reading Timothy Shay Arthur. If you asked the man on the street then who was the best author of the day, he’d most likely say Timothy Shay Arthur.</p><p>During the time Timothy Shay Arthur was writing five percent of everything published in America, Henry David Thoreau was writing Walden. Nobody read Walden except a handful of New England intellectuals, most of whom were personal friends of the author. Yet, if we look back now through the history of American letters we discover that apart from the small song called “Father, Dear Father, Come Home with Me Now” from a temperance play called Ten Nights in a Bar-Room, Timothy Shay Arthur is not remembered. But everybody knows of Thoreau’s Walden. Even if they haven’t read Walden, they at least know it is a story about a guy who went and lived in the woods and reflected on the nature of society and on nature itself. His book persisted. Nobody knew at the time that it was a classic. I think one is foolish to set out to try to write a classic. One just does the best job one can. But Arthur is barely remembered. Thoreau will still be read another hundred years from now.</p><p>Which leads to another consideration: Who judges in the present time? How valid are their judgments? Should you be writing to impress reviewers and critics, and even if you succeed in doing so, how lasting will their effects be upon your career? I am reminded in this regard of the fact that H. L. Mencken, American columnist, essayist, and editor for American Mercury—a fairly hip fellow on the literary scene back in the 1920s—decided to stick his neck out and write an essay on the people he thought would be remembered fifty, a hundred years down the line as the great American novelists of the 1920s. He chose three. He chose Carl Van Vechten, James Hunicher, and Clyde Brion-Davis. Everybody reads those today.</p><p>Carl Van Vechten wrote one nice book; it was called <em>Peter Wiffle</em>. He wrote six others and every book went downhill a little bit from the first one until he was writing so-so stuff at the end and he quit. He originally had been a music critic for a New York paper and he wound up writing books about cats, whom he cared about maybe more than people. I don’t know. James Hunicher, unfortunately, died shortly after Mencken’s essay appeared having written only one book, so we’ll never really know. Clyde Brion-Davis just never caught on the same way as the people Mencken did not mention in his essay, such as Ernest Hemingway, F. Scott Fitzgerald, John Dos Passos. They were writing all around Mencken at the time, and Mencken just didn’t feel they were doing as fine a job as Van Vechten, Hunicher, and Brion-Davis. It’s a very slippery thing to count upon your contemporaries for judgment.</p><p>I feel the only person that you must please as a writer, really, is your own self at its deepest levels.</p><p><em>I had to laugh at the part about the descent of Carl Van Vechten. It tends to remind me of a certain so-called “science fiction author” who has somehow managed to follow exactly the same path, with every book going downhill from the first one until he wound up writing books about cats…</em></p><p><em>The sad thing is that Zelazny himself is already forgotten; even his greatest novel, which was lauded by some as one of the best science fiction novels ever written, is virtually unknown to any reader under the age of 50.</em></p><p><em>Write what thou wilt, with due regard for those happy few who are interested in reading your books.</em></p><p><em><a href=\"https://socialgalactic.com/micropost/fed4a40a-12b5-4f92-b616-ee0e54515716\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This selection from an essay by the late Roger Zelazny pretty well encapsulates why I never get caught up in the popular illusion that sales = quality or the importance of a writer. From The Road to Amber\n:\nThe anecdote that fascinates me most is about the man I have a secret admiration for—Timothy Shay Arthur, who amazingly in the 1840s wrote five percent of everything published in America. He was the most prolific author of his day. If they wanted temperance books, he’d grind out temperance books by the ream. If abolition suddenly became a popular notion politically, he’d be writing abolition tracts. If somebody wanted frontier novels, he’d be writing frontier novels. Everybody was reading Timothy Shay Arthur. If you asked the man on the street then who was the best author of the day, he’d most likely say Timothy Shay Arthur.\nDuring the time Timothy Shay Arthur was writing five percent of everything published in America, Henry David Thoreau was writing Walden. Nobody read Walden except a handful of New England intellectuals, most of whom were personal friends of the author. Yet, if we look back now through the history of American letters we discover that apart from the small song called “Father, Dear Father, Come Home with Me Now” from a temperance play called Ten Nights in a Bar-Room, Timothy Shay Arthur is not remembered. But everybody knows of Thoreau’s Walden. Even if they haven’t read Walden, they at least know it is a story about a guy who went and lived in the woods and reflected on the nature of society and on nature itself. His book persisted. Nobody knew at the time that it was a classic. I think one is foolish to set out to try to write a classic. One just does the best job one can. But Arthur is barely remembered. Thoreau will still be read another hundred years from now.\nWhich leads to another consideration: Who judges in the present time? How valid are their judgments? Should you be writing to impress reviewers and critics, and even if you succeed in doing so, how lasting will their effects be upon your career? I am reminded in this regard of the fact that H. L. Mencken, American columnist, essayist, and editor for American Mercury—a fairly hip fellow on the literary scene back in the 1920s—decided to stick his neck out and write an essay on the people he thought would be remembered fifty, a hundred years down the line as the great American novelists of the 1920s. He chose three. He chose Carl Van Vechten, James Hunicher, and Clyde Brion-Davis. Everybody reads those today.\nCarl Van Vechten wrote one nice book; it was called\nPeter Wiffle\n. He wrote six others and every book went downhill a little bit from the first one until he was writing so-so stuff at the end and he quit. He originally had been a music critic for a New York paper and he wound up writing books about cats, whom he cared about maybe more than people. I don’t know. James Hunicher, unfortunately, died shortly after Mencken’s essay appeared having written only one book, so we’ll never really know. Clyde Brion-Davis just never caught on the same way as the people Mencken did not mention in his essay, such as Ernest Hemingway, F. Scott Fitzgerald, John Dos Passos. They were writing all around Mencken at the time, and Mencken just didn’t feel they were doing as fine a job as Van Vechten, Hunicher, and Brion-Davis. It’s a very slippery thing to count upon your contemporaries for judgment.\nI feel the only person that you must please as a writer, really, is your own self at its deepest levels.\nI had to laugh at the part about the descent of Carl Van Vechten. It tends to remind me of a certain so-called “science fiction author” who has somehow managed to follow exactly the same path, with every book going downhill from the first one until he wound up writing books about cats…\nThe sad thing is that Zelazny himself is already forgotten; even his greatest novel, which was lauded by some as one of the best science fiction novels ever written, is virtually unknown to any reader under the age of 50.\nWrite what thou wilt, with due regard for those happy few who are interested in reading your books.\nDISCUSS ON SG",
  "tags": [
    "philosophy",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-02-18T14:23:17+00:00"
}