{
  "url": "https://voxday.net/2025/02/28/you-dont-have-the-cards/",
  "scraped_at": "2026-01-08T19:40:37.506711",
  "title": "You Don’t Have the Cards",
  "date_display": "February 28, 2025",
  "date_iso": "2025-02-28T18:31:30+00:00",
  "date_from_url": "2025-02-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The God-Emperor 2.0 and his Vice-President <a href=\"https://www.youtube.com/live/4bkXGLsXd84\">chew out Vladimir Zelensky</a> right in front of the cameras. Incredible.</p><p><em>Yes it’s going to be a very hard thing to do business like this. Just say thanks. You said a lot of things except that, there are disagreements, and let’s go litigate those disagreements rather than trying to fight it out in the American Media when you’re wrong. We know that you’re wrong, but you see, I think it’s<br/>good for the American people to see what’s going on. Understand? I think it’s very important, that’s why I kept this going so long. You have to be thankful. You don’t have the cards. You’re buried there. Your people are dying, you’re running low on soldiers, listen, you’re running low on soldiers. It would be a damn good thing, and then you tell us ‘I don’t want to ceasefire, I don’t want a ceasefire.’</em></p><p><em>I don’t know if you can make a deal. The problem is I’ve empowered you to be a tough guy and I don’t think you’d be a tough guy without the United States. Your people are very brave, but you’re either going to make a deal or we’re out. And if we’re out, you’ll fight it out. I don’t think it’s going to be pretty, but you’ll fight it out and you don’t have the cards.</em></p><p><em><a href=\"https://socialgalactic.com/micropost/5124431a-2c4d-4b05-a3d8-83aa28d64eef\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The God-Emperor 2.0 and his Vice-President\nchew out Vladimir Zelensky\nright in front of the cameras. Incredible.\nYes it’s going to be a very hard thing to do business like this. Just say thanks. You said a lot of things except that, there are disagreements, and let’s go litigate those disagreements rather than trying to fight it out in the American Media when you’re wrong. We know that you’re wrong, but you see, I think it’s\ngood for the American people to see what’s going on. Understand? I think it’s very important, that’s why I kept this going so long. You have to be thankful. You don’t have the cards. You’re buried there. Your people are dying, you’re running low on soldiers, listen, you’re running low on soldiers. It would be a damn good thing, and then you tell us ‘I don’t want to ceasefire, I don’t want a ceasefire.’\nI don’t know if you can make a deal. The problem is I’ve empowered you to be a tough guy and I don’t think you’d be a tough guy without the United States. Your people are very brave, but you’re either going to make a deal or we’re out. And if we’re out, you’ll fight it out. I don’t think it’s going to be pretty, but you’ll fight it out and you don’t have the cards.\nDISCUSS ON SG",
  "tags": [
    "news",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2025-02-28T18:31:32+00:00"
}