{
  "url": "https://voxday.net/2013/07/08/a-failure-to-comprehend/",
  "scraped_at": "2025-12-14T22:34:34.467575",
  "title": "A failure to comprehend",
  "date_display": "July 8, 2013",
  "date_iso": "2013-07-08T08:58:00+00:00",
  "date_from_url": "2013-07-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m sure you recall the various academics and would-be academics at Pharyngula crying about what PZ Myers described as <a href=\"http://freethoughtblogs.com/pharyngula/2012/08/21/academic-realities/\">the “depressing” state of reality</a> in American academia.  The accomplished genetic scientist writes in <a href=\"http://freethoughtblogs.com/pharyngula/2012/08/16/woe-is-us-academics/\">Woe is us academics</a>:</p><blockquote class=\"tr_bq\"><p> Yeah, that’s the reward for earning a Ph.D. Most of you won’t get employed in academia, and most of you who do will get the terrifyingly fragile job of adjunct. And if you do manage to get a real tenure-track position, after 4-6 years of graduate school and a post-doc or two, you’ll get paid $40-50K/year, and be damned grateful for it.</p></blockquote><p>The comments to these posts are full of the lamentations of angry, highly credentialed, but unemployed Obama-voting progressives who consider any limitation on immigration to be racist, bigoted, and overtly evil.  Which is why, despite opposing the administration-endorsed Senate bill on “immigration reform”, I found myself laughing when reading <a href=\"http://www.nytimes.com/2013/07/08/opinion/keller-liberals-vs-immigration-reform.html?hpw\">this description of the bill</a> by Bill Keller at the New York Times.</p><blockquote class=\"tr_bq\"><p> Any foreigner who gets a graduate degree from an American university in<br> science, technology, engineering or mathematics (STEM in the vernacular)<br> and has a job offer can apply for a green card — even if he or she<br> studied for a field that is already crowded with native job applicants.<br> The bill would award permanent residence to anyone with a Ph.D. in any<br> subject from any university in the world, if he or she has a job offer<br> in that field.</br></br></br></br></br></br></p></blockquote><p>If the credentialed geniuses in academia think things are difficult for them now, just wait until they have to start competing with PhDs from Bangladesh and Zimbabwe who are willing to work for $5k per year and a green card.  It is ironic that the only thing standing between them and the complete economic devaluation of the credentials they so treasure is the Republican House that they so despise.</p><p>The immigration bill multiplies the blessings of diversity with the blessings of free trade.  Imagine how much USA will benefit if wages for PhDs are reduced by 90 percent!</p></div>",
  "content_text": "I’m sure you recall the various academics and would-be academics at Pharyngula crying about what PZ Myers described as\nthe “depressing” state of reality\nin American academia.  The accomplished genetic scientist writes in\nWoe is us academics\n:\nYeah, that’s the reward for earning a Ph.D. Most of you won’t get employed in academia, and most of you who do will get the terrifyingly fragile job of adjunct. And if you do manage to get a real tenure-track position, after 4-6 years of graduate school and a post-doc or two, you’ll get paid $40-50K/year, and be damned grateful for it.\nThe comments to these posts are full of the lamentations of angry, highly credentialed, but unemployed Obama-voting progressives who consider any limitation on immigration to be racist, bigoted, and overtly evil.  Which is why, despite opposing the administration-endorsed Senate bill on “immigration reform”, I found myself laughing when reading\nthis description of the bill\nby Bill Keller at the New York Times.\nAny foreigner who gets a graduate degree from an American university in\nscience, technology, engineering or mathematics (STEM in the vernacular)\nand has a job offer can apply for a green card — even if he or she\nstudied for a field that is already crowded with native job applicants.\nThe bill would award permanent residence to anyone with a Ph.D. in any\nsubject from any university in the world, if he or she has a job offer\nin that field.\nIf the credentialed geniuses in academia think things are difficult for them now, just wait until they have to start competing with PhDs from Bangladesh and Zimbabwe who are willing to work for $5k per year and a green card.  It is ironic that the only thing standing between them and the complete economic devaluation of the credentials they so treasure is the Republican House that they so despise.\nThe immigration bill multiplies the blessings of diversity with the blessings of free trade.  Imagine how much USA will benefit if wages for PhDs are reduced by 90 percent!",
  "tags": [
    "economics",
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-08T07:58:00+00:00"
}