{
  "url": "https://voxday.net/2013/07/02/a-scandal-day-for-sfwa/",
  "scraped_at": "2025-12-14T22:34:00.251184",
  "title": "A scandal a day for SFWA",
  "date_display": "July 2, 2013",
  "date_iso": "2013-07-02T19:56:00+00:00",
  "date_from_url": "2013-07-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While the organization is still reeling from the loss of our intrepid president of the last three years, it appears another member has just seriously violated SFWA’s confidentiality rules by posting screencaps of posts by Jerry Pournelle, Susan Schwartz, Jim Bailey, William Barton, Brad Torgersen, Gordon van Gelder, Bud Webster, and Jim Fiscus <a href=\"http://specfriction.tumblr.com/\">on Speculative Friction</a>.  On the basis of the posts selected, it appears to have been done by a member who is sympathetic to Ms Jemisin.</p><blockquote class=\"tr_bq\"><p> Some Background: After John Scalzi became president of SFWA in 2010<br> the organization moved the official SFWA forums away from SFF.net to a<br> server under the SFWA.org domain. Many members moved to the new forums,<br> but the private SFWA forum on SFF.net remained for people who did not<br> want to make the change. The conversations on this Tumblr come from the<br> private SFF.net forums.</br></br></br></br></br></p><p>These discussions center around the proposed expulsion of Theodore<br> Beale/Vox Day from the organization and a speech given by author N. K.<br> Jemisin. There is also mention of a recent issue with the SFWA Bulletin.<br> Context for all of this:</br></br></br></p></blockquote><p>(My apologies, Josh, I was incorrect.) While SFF.NET is not SFWA.ORG, I am informed that it is every bit as off-limits to make the private messages from sff.private.sfwa.lounge public as it is to quote the messages posted in the SFWA forums.</p><p>And if you think these conversations are entertaining, I only wish you could read the insane drivel being posted by the pinkshirts.</p></div>",
  "content_text": "While the organization is still reeling from the loss of our intrepid president of the last three years, it appears another member has just seriously violated SFWA’s confidentiality rules by posting screencaps of posts by Jerry Pournelle, Susan Schwartz, Jim Bailey, William Barton, Brad Torgersen, Gordon van Gelder, Bud Webster, and Jim Fiscus\non Speculative Friction\n.  On the basis of the posts selected, it appears to have been done by a member who is sympathetic to Ms Jemisin.\nSome Background: After John Scalzi became president of SFWA in 2010\nthe organization moved the official SFWA forums away from SFF.net to a\nserver under the SFWA.org domain. Many members moved to the new forums,\nbut the private SFWA forum on SFF.net remained for people who did not\nwant to make the change. The conversations on this Tumblr come from the\nprivate SFF.net forums.\nThese discussions center around the proposed expulsion of Theodore\nBeale/Vox Day from the organization and a speech given by author N. K.\nJemisin. There is also mention of a recent issue with the SFWA Bulletin.\nContext for all of this:\n(My apologies, Josh, I was incorrect.) While SFF.NET is not SFWA.ORG, I am informed that it is every bit as off-limits to make the private messages from sff.private.sfwa.lounge public as it is to quote the messages posted in the SFWA forums.\nAnd if you think these conversations are entertaining, I only wish you could read the insane drivel being posted by the pinkshirts.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-02T18:56:00+00:00"
}