{
  "url": "https://voxday.net/2013/07/10/apple-found-guilty-of-ebook-price-fixing/",
  "scraped_at": "2025-12-14T22:34:52.349812",
  "title": "Apple found guilty of ebook price-fixing",
  "date_display": "July 10, 2013",
  "date_iso": "2013-07-10T17:00:00+00:00",
  "date_from_url": "2013-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now this is going to cause <a href=\"http://www.telegraph.co.uk/finance/newsbysector/mediatechnologyandtelecoms/electronics/10171727/Apple-found-guilty-of-price-fixing-conspiracy-for-electronic-books.html\">some SERIOUS tremors</a> throughout the publishing world.</p><blockquote class=\"tr_bq\"><div class=\"firstPar\"> The tech giant’s defeat in a New York court is likely to cost the iPad and<br> iPhone maker hundreds of millions of dollars in damages. The technology giant battled the US Department of Justice in the landmark<br> case, heard last month in Manhattan, over whether a policy of allowing<br> publishers to set the price of ebooks broke America’s anti-trust laws.</br></br></br></div><div class=\"thirdPar\"> <br> On Wednesday District Judge Denise Cote, who oversaw the trial, said that<br> Apple was the ringleader in a conspiracy, which forced the price of ebooks<br> upwards from the $9.99 Amazon had set as standard to $12.99 and in some<br> cases $14.99.</br></br></br></br></div><div class=\"fourthPar\"> <br> “The plaintiffs have shown that the publisher defendants conspired with<br> each other to eliminate retail price competition in order to raise e-book<br> prices, and that Apple played a central role in facilitating and executing<br> that conspiracy,” Judge Cote said. “Without Apple’s orchestration of this conspiracy, it would not have<br> succeeded as it did in the spring of 2010,” she added.</br></br></br></br></br></div></blockquote><p>The good news is that ebook prices should continue to fall to more economically sensible levels.  And the power of the gatekeepers is going to continue to dwindle as their revenues and profit margins continue to fall in response to the greater competition they are facing from independent publishers and self-publishers.</p><p>Another interesting thing is that for contractual reasons I am not at liberty to divulge, the major publishers will not be able to sell books through the in-game retail channel.  This will provide even more incentive for the big game developers to retain their media tie-in rights rather than continuing to license them to publishers unable to sell the books through their games.</p></div>",
  "content_text": "Now this is going to cause\nsome SERIOUS tremors\nthroughout the publishing world.\nThe tech giant’s defeat in a New York court is likely to cost the iPad and\niPhone maker hundreds of millions of dollars in damages. The technology giant battled the US Department of Justice in the landmark\ncase, heard last month in Manhattan, over whether a policy of allowing\npublishers to set the price of ebooks broke America’s anti-trust laws.\nOn Wednesday District Judge Denise Cote, who oversaw the trial, said that\nApple was the ringleader in a conspiracy, which forced the price of ebooks\nupwards from the $9.99 Amazon had set as standard to $12.99 and in some\ncases $14.99.\n“The plaintiffs have shown that the publisher defendants conspired with\neach other to eliminate retail price competition in order to raise e-book\nprices, and that Apple played a central role in facilitating and executing\nthat conspiracy,” Judge Cote said. “Without Apple’s orchestration of this conspiracy, it would not have\nsucceeded as it did in the spring of 2010,” she added.\nThe good news is that ebook prices should continue to fall to more economically sensible levels.  And the power of the gatekeepers is going to continue to dwindle as their revenues and profit margins continue to fall in response to the greater competition they are facing from independent publishers and self-publishers.\nAnother interesting thing is that for contractual reasons I am not at liberty to divulge, the major publishers will not be able to sell books through the in-game retail channel.  This will provide even more incentive for the big game developers to retain their media tie-in rights rather than continuing to license them to publishers unable to sell the books through their games.",
  "tags": [
    "books",
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-10T16:00:00+00:00"
}