{
  "url": "https://voxday.net/2013/07/21/behind-scenes-2/",
  "scraped_at": "2025-12-14T22:36:11.359236",
  "title": "Behind the scenes",
  "date_display": "July 21, 2013",
  "date_iso": "2013-07-21T17:00:00+00:00",
  "date_from_url": "2013-07-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Unusual changes <a href=\"http://www.marinecorpstimes.com/article/20130718/CAREERS03/307180027/Commander-22nd-Marine-Expeditionary-Unit-relieved-command\">in the Corps</a>:</p><blockquote class=\"tr_bq\"><p> The commander of the 22nd Marine Expeditionary Unit was removed from<br> his position on Wednesday, less than a week after the force’s<br> subordinate units were first brought together to deploy in 2014, Marine<br> officials said. Col. James Christmas was relieved of command by<br> Maj. Gen. Raymond Fox, the commander of II Marine Expeditionary Force,<br> out of Camp Lejeune, N.C., after the general lost confidence in<br> Christmas’ ability to continue commanding the Marines and sailors of the<br> 22nd MEU,” said Capt. Binford Strickland, a Marine spokesman. No<br> additional explanation was given for the decision….</br></br></br></br></br></br></br></br></p><p>At least six other Marine officers have been<br> removed from command since mid-March. In each case, Marine officials<br> have provided little explanation for why the decisions were made, saying<br> a general officer had lost confidence in that commander’s ability to<br> lead his personnel.</br></br></br></br></p></blockquote><p>I don’t even have a crazy conspiracy theory here, I just know that seven reliefs of command in four months appears to be out of the ordinary.</p><p>UPDATE: Talk of “purges” is considerably overblown, in my opinion.  Now, this is a purge: “Of 90 generals arrested, only six survived the purges, as did only 36 of<br> 180 divisional commanders, and just seven out of 57 army corps<br> commanders. In total, some 30,000 Red Army personnel were executed.”</br></br></p><p>It occurs to me, however, that there is one time when it would make very good sense to replace MEU commanders, and that is when new military action is at hand.  When one considers how the Syrian rebels appear to have failed in their bid to overthrow Assad and the recent army coup in Egypt, I find myself wondering if this might be an early sign of expanded American military intervention in the Middle East.</p></div>",
  "content_text": "Unusual changes\nin the Corps\n:\nThe commander of the 22nd Marine Expeditionary Unit was removed from\nhis position on Wednesday, less than a week after the force’s\nsubordinate units were first brought together to deploy in 2014, Marine\nofficials said. Col. James Christmas was relieved of command by\nMaj. Gen. Raymond Fox, the commander of II Marine Expeditionary Force,\nout of Camp Lejeune, N.C., after the general lost confidence in\nChristmas’ ability to continue commanding the Marines and sailors of the\n22nd MEU,” said Capt. Binford Strickland, a Marine spokesman. No\nadditional explanation was given for the decision….\nAt least six other Marine officers have been\nremoved from command since mid-March. In each case, Marine officials\nhave provided little explanation for why the decisions were made, saying\na general officer had lost confidence in that commander’s ability to\nlead his personnel.\nI don’t even have a crazy conspiracy theory here, I just know that seven reliefs of command in four months appears to be out of the ordinary.\nUPDATE: Talk of “purges” is considerably overblown, in my opinion.  Now, this is a purge: “Of 90 generals arrested, only six survived the purges, as did only 36 of\n180 divisional commanders, and just seven out of 57 army corps\ncommanders. In total, some 30,000 Red Army personnel were executed.”\nIt occurs to me, however, that there is one time when it would make very good sense to replace MEU commanders, and that is when new military action is at hand.  When one considers how the Syrian rebels appear to have failed in their bid to overthrow Assad and the recent army coup in Egypt, I find myself wondering if this might be an early sign of expanded American military intervention in the Middle East.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-21T16:00:00+00:00"
}