{
  "url": "https://voxday.net/2013/07/16/black-on-brown/",
  "scraped_at": "2025-12-14T22:35:36.529797",
  "title": "Black on brown",
  "date_display": "July 16, 2013",
  "date_iso": "2013-07-16T07:56:00+00:00",
  "date_from_url": "2013-07-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I suspect <a href=\"http://www.baltimoresun.com/news/maryland/crime/blog/bs-md-trayvon-martin-george-zimmerman-monday-20130715,0,5135359.story\">this sort of response</a> isn’t going to end well for the African-American community:</p><blockquote class=\"tr_bq\"><p> [R]eal estate agent<br> Christina Dudley said she was walking to her car just before 9 p.m.<br> when she saw several young black males and two black females chasing a<br> 37-year-old Hispanic man west on North Linwood Avenue past East Fairmont<br> Avenue. “One of the boys had a handgun out and it was pointed at the back of him,” Dudley said in an interview.</br></br></br></br></p><p>They<br> caught up to the man at the corner of Fairmount and N. Streeper Street,<br> and the male with the gun beat the victim with what appeared to be his<br> gun while others kicked and stomped him, Dudley said.</br></br></br></p><p>“They were<br> just yelling and calling him names as they ran after him, but once they<br> were hitting him and after that they started yelling, “This is for<br> Trayvon, [expletive],” said Dudley, who heard the chant repeated<br> multiple times….</br></br></br></br></p><p>Using a translator, police spoke to the victim, who knows some<br> English, according to the police report. The victim told officers that<br> he was standing in the intersection of Fairmont and N. Potomac Street<br> when a group of five black males first approached him. He<br> described all of the males as between 16 and 18 and told police a 6-foot<br> suspect with a black “stretchy” shirt and mohawk told him, “What’s up,<br> [expletive].” When the victim raised his phone to call 911, the suspect<br> raised his shirt and flashed a silver handgun in his waistband.</br></br></br></br></br></br></br></p><p>The<br> victim turned and ran before he was caught in the 2800 block of<br> Fairmont and was beaten, police said. He sustained abrasions to his<br> elbows and forearms but refused medical attention. Police listed all of the suspects involved as black males. Three were “skinny” while one was described as overweight.</br></br></br></p></blockquote><p>As can be seen in Mexico, the moderate time preferences of Hispanics tend to make them more organized than blacks and less temperate than whites when they turn violent. When black and white communities collide, the result tends to lean towards segregation. When black and brown communities collide, the result tends to lean towards the eradication of the former.</p><p>Blacks not infrequently engage in this sort of <strike>random </strike>public group beating.  Hispanics not infrequently leave collections of dead bodies neatly displayed in public.  Welcome to America 3.0.</p><p>However, it is interesting to note that the black community understands George Zimmerman is Hispanic, even though the mainstream media still wants to affect that he is white.</p></div>",
  "content_text": "I suspect\nthis sort of response\nisn’t going to end well for the African-American community:\n[R]eal estate agent\nChristina Dudley said she was walking to her car just before 9 p.m.\nwhen she saw several young black males and two black females chasing a\n37-year-old Hispanic man west on North Linwood Avenue past East Fairmont\nAvenue. “One of the boys had a handgun out and it was pointed at the back of him,” Dudley said in an interview.\nThey\ncaught up to the man at the corner of Fairmount and N. Streeper Street,\nand the male with the gun beat the victim with what appeared to be his\ngun while others kicked and stomped him, Dudley said.\n“They were\njust yelling and calling him names as they ran after him, but once they\nwere hitting him and after that they started yelling, “This is for\nTrayvon, [expletive],” said Dudley, who heard the chant repeated\nmultiple times….\nUsing a translator, police spoke to the victim, who knows some\nEnglish, according to the police report. The victim told officers that\nhe was standing in the intersection of Fairmont and N. Potomac Street\nwhen a group of five black males first approached him. He\ndescribed all of the males as between 16 and 18 and told police a 6-foot\nsuspect with a black “stretchy” shirt and mohawk told him, “What’s up,\n[expletive].” When the victim raised his phone to call 911, the suspect\nraised his shirt and flashed a silver handgun in his waistband.\nThe\nvictim turned and ran before he was caught in the 2800 block of\nFairmont and was beaten, police said. He sustained abrasions to his\nelbows and forearms but refused medical attention. Police listed all of the suspects involved as black males. Three were “skinny” while one was described as overweight.\nAs can be seen in Mexico, the moderate time preferences of Hispanics tend to make them more organized than blacks and less temperate than whites when they turn violent. When black and white communities collide, the result tends to lean towards segregation. When black and brown communities collide, the result tends to lean towards the eradication of the former.\nBlacks not infrequently engage in this sort of\nrandom\npublic group beating.  Hispanics not infrequently leave collections of dead bodies neatly displayed in public.  Welcome to America 3.0.\nHowever, it is interesting to note that the black community understands George Zimmerman is Hispanic, even though the mainstream media still wants to affect that he is white.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-16T06:56:00+00:00"
}