{
  "url": "https://voxday.net/2013/07/24/carlos-danger-for-presiden/",
  "scraped_at": "2025-12-14T22:36:27.824695",
  "title": "Carlos Danger for President",
  "date_display": "July 24, 2013",
  "date_iso": "2013-07-24T07:37:00+00:00",
  "date_from_url": "2013-07-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to say, I like <a href=\"http://www.nytimes.com/2013/07/24/opinion/mr-weiner-and-the-elusive-truth.html?hp\">the cut of his jib</a>. We’ve already got the idiocracy, now all we need is the leader with the insane and unfounded confidence of Dwayne Elizondo Mountain Dew Herbert Camacho.  And I say Carlos Danger, aka C. Anthony’s Weiner, may be just that man.</p><blockquote class=\"tr_bq\"><p> When the first texts were revealed two years ago, Mr. Weiner lied about<br> it, saying he had been the victim of hackers. Then he owned up,<br> tearfully abandoned his office and retreated into private life. Then he<br> was back, telling the world that therapy and his wife’s forgiveness had<br> turned him around and that he was ready to begin a new chapter. That<br> turned out to be the mayor’s race, which he entered in May. What he did<br> not say then, and what voters did not realize until Tuesday, was that<br> his resignation had not been the end of his sexual misconduct.</br></br></br></br></br></br></br></p><p>The timing here matters, as it would for any politician who violates the<br> public’s trust and then asks to have it back. Things are different now,<br> he insists. “This behavior is behind me,” he said again on Tuesday. He<br> suggested that people should have known that his sexting was an<br> unresolved problem well into 2012.</br></br></br></br></p><p>That’s ridiculous and speaks to a familiar but repellent pattern of misleading and evasion.</p></blockquote><p>To the contrary, I say a ridiculous candidate is ideally suited for an American democracy that knowingly re-elected Bill Clinton, Bush the Younger, and Barry Soebarkah. Carlos Danger would be the perfect president to lead America into its final collapse.  As the economy contracts and interracial violence erupts from Florida to California, the citizenry would be cheered and inspired by frequent press conferences featuring the presidential weiner. </p><p>Why should the New York Times be perturbed by what Carlos Danger does with his dongle?  After all, his wife clearly doesn’t care what he does with it so long as he keeps it away from her.</p><p>Carlos Danger in 2016!</p></div>",
  "content_text": "I have to say, I like\nthe cut of his jib\n. We’ve already got the idiocracy, now all we need is the leader with the insane and unfounded confidence of Dwayne Elizondo Mountain Dew Herbert Camacho.  And I say Carlos Danger, aka C. Anthony’s Weiner, may be just that man.\nWhen the first texts were revealed two years ago, Mr. Weiner lied about\nit, saying he had been the victim of hackers. Then he owned up,\ntearfully abandoned his office and retreated into private life. Then he\nwas back, telling the world that therapy and his wife’s forgiveness had\nturned him around and that he was ready to begin a new chapter. That\nturned out to be the mayor’s race, which he entered in May. What he did\nnot say then, and what voters did not realize until Tuesday, was that\nhis resignation had not been the end of his sexual misconduct.\nThe timing here matters, as it would for any politician who violates the\npublic’s trust and then asks to have it back. Things are different now,\nhe insists. “This behavior is behind me,” he said again on Tuesday. He\nsuggested that people should have known that his sexting was an\nunresolved problem well into 2012.\nThat’s ridiculous and speaks to a familiar but repellent pattern of misleading and evasion.\nTo the contrary, I say a ridiculous candidate is ideally suited for an American democracy that knowingly re-elected Bill Clinton, Bush the Younger, and Barry Soebarkah. Carlos Danger would be the perfect president to lead America into its final collapse.  As the economy contracts and interracial violence erupts from Florida to California, the citizenry would be cheered and inspired by frequent press conferences featuring the presidential weiner.\nWhy should the New York Times be perturbed by what Carlos Danger does with his dongle?  After all, his wife clearly doesn’t care what he does with it so long as he keeps it away from her.\nCarlos Danger in 2016!",
  "tags": [
    "freakshow",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-24T06:37:00+00:00"
}