{
  "url": "https://voxday.net/2013/07/20/change-or-face-real-change/",
  "scraped_at": "2025-12-14T22:36:07.070392",
  "title": "Change or face real change",
  "date_display": "July 20, 2013",
  "date_iso": "2013-07-20T20:00:00+00:00",
  "date_from_url": "2013-07-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Radley Balko has an excellent article in the Wall Street Journal on <a href=\"http://online.wsj.com/article/SB10001424127887323848804578608040780519904.html?mod=WSJ_hpp_LEFTTopStories\">the need to demilitarize</a> American police culture:</p><blockquote class=\"tr_bq\"><p> [I]t is crucial to change the culture of militarization in American law enforcement. Consider today’s police recruitment<br> videos (widely available on YouTube), which often feature cops<br> rappelling from helicopters, shooting big guns, kicking down doors and<br> tackling suspects. Such campaigns embody an American policing culture<br> that has become too isolated, confrontational and militaristic, and they<br> tend to attract recruits for the wrong reasons.</br></br></br></br></br></p><p><a href=\"http://www.blogger.com/null\" name=\"U902071844303TBH\"></a>If you browse online police discussion<br> boards, or chat with younger cops today, you will often encounter some<br> version of the phrase, “Whatever I need to do to get home safe.” It is a<br> sentiment that suggests that every interaction with a citizen may be<br> the officer’s last.</br></br></br></br></p></blockquote><p>Now, we know that the police actively discriminate against the intelligent in building their department rosters, so perhaps we shouldn’t be too hard on those who have the inability to think through the logical consequences of their militaristic, short-sighted attitudes.</p><p>And demilitarization is without question in the material interests of the police as well.  They have started a war of escalation and attrition that they cannot possibly win.  Perhaps you recall how completely freaked out the LAPD was when the ex-cop went rogue and started targeting police families?  And maybe you remember how much fear was expressed throughout law enforcement communities when it appeared prosecutors were being targeted at home?</p><p>It does not take a master logician to observe that all the “whatever I need to do to get home safe” mentality guarantees is that abusive police homes will soon be unsafe.  And the growing Hispanic population means that there will likely be more Latin American-style infiltration, assassination, and terror directed at the lower levels of law enforcement.  Indeed, there are some analysts who believe this is already taking place in parts of the American Southwest.</p></div>",
  "content_text": "Radley Balko has an excellent article in the Wall Street Journal on\nthe need to demilitarize\nAmerican police culture:\n[I]t is crucial to change the culture of militarization in American law enforcement. Consider today’s police recruitment\nvideos (widely available on YouTube), which often feature cops\nrappelling from helicopters, shooting big guns, kicking down doors and\ntackling suspects. Such campaigns embody an American policing culture\nthat has become too isolated, confrontational and militaristic, and they\ntend to attract recruits for the wrong reasons.\nIf you browse online police discussion\nboards, or chat with younger cops today, you will often encounter some\nversion of the phrase, “Whatever I need to do to get home safe.” It is a\nsentiment that suggests that every interaction with a citizen may be\nthe officer’s last.\nNow, we know that the police actively discriminate against the intelligent in building their department rosters, so perhaps we shouldn’t be too hard on those who have the inability to think through the logical consequences of their militaristic, short-sighted attitudes.\nAnd demilitarization is without question in the material interests of the police as well.  They have started a war of escalation and attrition that they cannot possibly win.  Perhaps you recall how completely freaked out the LAPD was when the ex-cop went rogue and started targeting police families?  And maybe you remember how much fear was expressed throughout law enforcement communities when it appeared prosecutors were being targeted at home?\nIt does not take a master logician to observe that all the “whatever I need to do to get home safe” mentality guarantees is that abusive police homes will soon be unsafe.  And the growing Hispanic population means that there will likely be more Latin American-style infiltration, assassination, and terror directed at the lower levels of law enforcement.  Indeed, there are some analysts who believe this is already taking place in parts of the American Southwest.",
  "tags": [
    "NWA was right",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-20T19:00:00+00:00"
}