{
  "url": "https://voxday.net/2013/07/29/combat-barbie-wear/",
  "scraped_at": "2025-12-14T22:37:05.785384",
  "title": "Combat Barbie wear",
  "date_display": "July 29, 2013",
  "date_iso": "2013-07-29T19:00:00+00:00",
  "date_from_url": "2013-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>They still won’t be able to outfight a Boy Scout troop armed with jackknives, but the important thing is wearing the right clothes will help them <a href=\"http://atlanta.cbslocal.com/2013/07/28/unisex-uniforms-debut-as-army-opens-units-to-women/\">feel more like real soldiers</a>.</p><blockquote class=\"tr_bq\"><p> A new combat uniform with special consideration to the female body is<br> now available at Fort Gordon, almost a month after the Army announced<br> plans to open all units and military jobs to women by 2016. The March debut of the Combat Uniform-Alternate is the first in a<br> series of moves the Army hopes to make in the next three years to help<br> female soldiers feel like more professional members, officials said.</br></br></br></br></p><p>With narrower shoulders, a slightly tapered waist and a more spacious<br> seat, the unisex clothing line has been in the works since 2009 and is<br> being issued to all installations – except Fort Benning in Columbus, Ga.<br> – for men and women with a smaller or more slender body.</br></br></br></p></blockquote><p>Enough of all the talk talk.  Let’s see some war war out of our brave amazons.  Let’s see the US Army form a combat division of its most formidable Combat Barbies and send it to Afghanistan.  Perhaps they can make a reality TV show of it called “Rape, Rout, or RIP?”</p></div>",
  "content_text": "They still won’t be able to outfight a Boy Scout troop armed with jackknives, but the important thing is wearing the right clothes will help them\nfeel more like real soldiers\n.\nA new combat uniform with special consideration to the female body is\nnow available at Fort Gordon, almost a month after the Army announced\nplans to open all units and military jobs to women by 2016. The March debut of the Combat Uniform-Alternate is the first in a\nseries of moves the Army hopes to make in the next three years to help\nfemale soldiers feel like more professional members, officials said.\nWith narrower shoulders, a slightly tapered waist and a more spacious\nseat, the unisex clothing line has been in the works since 2009 and is\nbeing issued to all installations – except Fort Benning in Columbus, Ga.\n– for men and women with a smaller or more slender body.\nEnough of all the talk talk.  Let’s see some war war out of our brave amazons.  Let’s see the US Army form a combat division of its most formidable Combat Barbies and send it to Afghanistan.  Perhaps they can make a reality TV show of it called “Rape, Rout, or RIP?”",
  "tags": [
    "trainwreck",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-29T18:00:00+00:00"
}