{
  "url": "https://voxday.net/2013/07/18/courage-as-cowardice/",
  "scraped_at": "2025-12-14T22:35:48.866538",
  "title": "Courage as cowardice",
  "date_display": "July 18, 2013",
  "date_iso": "2013-07-18T08:09:00+00:00",
  "date_from_url": "2013-07-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you’re going to redefine cowardice as a willingness to engage in conflict, and portray a refusal to engage in it as manhood, you might as well start wearing a pink Gamma Rabbit shirt.  A commenter at Dr. Helen’s <a href=\"http://pjmedia.com/drhelen/2013/07/17/should-gamma-males-really-be-beaten/\">objects to my post yesterday</a> at Alpha Game:</p><blockquote class=\"tr_bq\"><p> Your post highlights a big problem with the “manosphere”: It’s quite<br> misogynistic and not very manly. A man does what is right regardless of<br> the consequences, and he does it as a function of his own sense of self.<br> The “manosphere”, in contrast, is all about men shaping themselves in<br> their profoundly negative view of women. Vox Day is characteristically<br> defining manhood downwards by his approval of men using physical<br> violence against women, even if it is in self-defense.</br></br></br></br></br></br></p><p>A warrior<br> would never define himself by the number of children and old ladies he<br> had defeated in combat, any more than a real man would pride himself on<br> the number of women he’s beaten. An alpha takes the blows and walks away<br> with his self-respect intact. But for Vox Day and his sleazy ilk, men<br> exist only as responses to women. If women are horrible, then men must<br> be as well. What an awful world that makes for.</br></br></br></br></br></br></p></blockquote><p>First of all, there is nothing more intrinsically wrong about using physical violence against women than against men. This white-knighting gamma knows nothing about the genuine warrior ethic; by his reckoning, the greatest warriors of history were not warriors at all because they slaughtered men, women, and children with equal abandon.  Warrior’s codes teach respect for all, which in martial terms means taking even the most seemingly overmatched opponent seriously and dispatching her without needless humiliation.</p><p>The outmoded code of the gentleman to which Funktacular is implicitly referring is European and is based on a post-martial chivalric ideal that primarily relates to the transition of the medieval aristocracy from a warrior elite to a post-warrior social elite.  As such, it is the exact opposite of a warrior ethic.  Joseph Schumpeter addresses this in some detail in<i> Imperialism and Social Classes</i>. The warrior ethic is focused on the defeat of the enemy, and the defeat of the enemy requires the destruction of his women from whom the future enemy combatants will come in as the destruction of the current generation of combatants.</p><p>Were the Romans less than manly because they destroyed Carthage?  Was Genghis Khan a coward because he spared neither women nor children, neither dog or rat, when he stacked skulls outside the shattered walls of the city where one of his sons died?  Was Shalmeneser III defining manhood downwards when, on his annual summer vacation, he crossed the Euphrates, threw down the walls of one city or another, and burned it with fire?</p><p>As for misogyny, one need not hate women to refuse to subject oneself to physical assaults by women.  Shall we similarly conclude that the man who defends himself against attacks by men is a misanthrope? The logic is wholly specious.</p><p>Funktacular’s comment isn’t merely anti-equality, it is also anti-male, because he attempts to deny men one of their most basic and fundamental rights, the right to self-defense.  He attempts to create a virtue out of cowardice, and in doing so, lends support to the environment where sniping and running away is considered brave, while standing one’s ground is falsely accused of defining manhood downward.  And in doing so, he provides a useful example of how the gamma delusion bubble distorts a man’s view of reality.</p><p>Finally, I note that one cannot “turn the other cheek” unless one is first willing to assert the right to strike back.  He who claims there is no right to strike back cannot also claim to be purposefully declining to exert his nonexistent right.</p></div>",
  "content_text": "If you’re going to redefine cowardice as a willingness to engage in conflict, and portray a refusal to engage in it as manhood, you might as well start wearing a pink Gamma Rabbit shirt.  A commenter at Dr. Helen’s\nobjects to my post yesterday\nat Alpha Game:\nYour post highlights a big problem with the “manosphere”: It’s quite\nmisogynistic and not very manly. A man does what is right regardless of\nthe consequences, and he does it as a function of his own sense of self.\nThe “manosphere”, in contrast, is all about men shaping themselves in\ntheir profoundly negative view of women. Vox Day is characteristically\ndefining manhood downwards by his approval of men using physical\nviolence against women, even if it is in self-defense.\nA warrior\nwould never define himself by the number of children and old ladies he\nhad defeated in combat, any more than a real man would pride himself on\nthe number of women he’s beaten. An alpha takes the blows and walks away\nwith his self-respect intact. But for Vox Day and his sleazy ilk, men\nexist only as responses to women. If women are horrible, then men must\nbe as well. What an awful world that makes for.\nFirst of all, there is nothing more intrinsically wrong about using physical violence against women than against men. This white-knighting gamma knows nothing about the genuine warrior ethic; by his reckoning, the greatest warriors of history were not warriors at all because they slaughtered men, women, and children with equal abandon.  Warrior’s codes teach respect for all, which in martial terms means taking even the most seemingly overmatched opponent seriously and dispatching her without needless humiliation.\nThe outmoded code of the gentleman to which Funktacular is implicitly referring is European and is based on a post-martial chivalric ideal that primarily relates to the transition of the medieval aristocracy from a warrior elite to a post-warrior social elite.  As such, it is the exact opposite of a warrior ethic.  Joseph Schumpeter addresses this in some detail in\nImperialism and Social Classes\n. The warrior ethic is focused on the defeat of the enemy, and the defeat of the enemy requires the destruction of his women from whom the future enemy combatants will come in as the destruction of the current generation of combatants.\nWere the Romans less than manly because they destroyed Carthage?  Was Genghis Khan a coward because he spared neither women nor children, neither dog or rat, when he stacked skulls outside the shattered walls of the city where one of his sons died?  Was Shalmeneser III defining manhood downwards when, on his annual summer vacation, he crossed the Euphrates, threw down the walls of one city or another, and burned it with fire?\nAs for misogyny, one need not hate women to refuse to subject oneself to physical assaults by women.  Shall we similarly conclude that the man who defends himself against attacks by men is a misanthrope? The logic is wholly specious.\nFunktacular’s comment isn’t merely anti-equality, it is also anti-male, because he attempts to deny men one of their most basic and fundamental rights, the right to self-defense.  He attempts to create a virtue out of cowardice, and in doing so, lends support to the environment where sniping and running away is considered brave, while standing one’s ground is falsely accused of defining manhood downward.  And in doing so, he provides a useful example of how the gamma delusion bubble distorts a man’s view of reality.\nFinally, I note that one cannot “turn the other cheek” unless one is first willing to assert the right to strike back.  He who claims there is no right to strike back cannot also claim to be purposefully declining to exert his nonexistent right.",
  "tags": [
    "Alpha Game",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-18T07:09:00+00:00"
}