{
  "url": "https://voxday.net/2013/07/25/dancing-around-obvious/",
  "scraped_at": "2025-12-14T22:36:38.598682",
  "title": "Dancing around the obvious",
  "date_display": "July 25, 2013",
  "date_iso": "2013-07-25T17:00:00+00:00",
  "date_from_url": "2013-07-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s interesting to see the mainstream press <a href=\"http://www.nypost.com/p/news/local/the_good_wife_oh_give_us_break_dteBZaqloz1aNNXg1kcz8H\">delicately dancing around</a> something that all of them have heard about for years in their coverage of Weinergate II: Carlos Danger:</p><blockquote class=\"tr_bq\"><p> It’s also time to declare a moratorium on the line that Huma Abedin<br> is the smartest, shrewdest, most level-headed and glamorous asset the<br> Democratic Party has, and if she’s OK with Anthony, we should be, too.<br> Clearly, there is something very wrong with Abedin — whether it’s simply<br> that she shares her husband’s vaulting ambition or that she has a<br> pathological need to be publicly humiliated, something’s up. When The<br> New York Times is calling for you to take your sad assemblage of sexual<br> compulsions out the door, you should consider that a wake-up call. Silda<br> may have stood by Eliot, but even she never opened her mouth in his<br> defense.</br></br></br></br></br></br></br></br></br></p><p>Abedin took the good-wife act one step further at<br> Tuesday’s press conference, admitting her collusion in this new lie: “We<br> discussed all of this before Anthony decided to run for mayor,” she<br> said. So clearly, as Abedin sat for these joint interviews in which<br> Weiner claimed to be a changed man, she knew that wasn’t the truth, and<br> was happy to lie to a public that had been nothing but sympathetic<br> toward poor, brilliant Huma, saddled with such a dud. Perhaps they’re a<br> better match than we knew.</br></br></br></br></br></br></br></p></blockquote><p>Something very wrong with Abedin… something’s up.  I wonder what that something might be that would cause a wife to be totally indifferent to her freakshow husband spending his evenings tweeting pictures of his genitalia to younger women.  Whatever could it possibly be?</p><p>I still recall the look of utter panic on Sean Hannity’s face when Gennifer Flowers came out and said something to the effect of “everyone in Little Rock knows Hilary is a lesbian” on his show.  If I recall correctly, they went right to commercials.</p></div>",
  "content_text": "It’s interesting to see the mainstream press\ndelicately dancing around\nsomething that all of them have heard about for years in their coverage of Weinergate II: Carlos Danger:\nIt’s also time to declare a moratorium on the line that Huma Abedin\nis the smartest, shrewdest, most level-headed and glamorous asset the\nDemocratic Party has, and if she’s OK with Anthony, we should be, too.\nClearly, there is something very wrong with Abedin — whether it’s simply\nthat she shares her husband’s vaulting ambition or that she has a\npathological need to be publicly humiliated, something’s up. When The\nNew York Times is calling for you to take your sad assemblage of sexual\ncompulsions out the door, you should consider that a wake-up call. Silda\nmay have stood by Eliot, but even she never opened her mouth in his\ndefense.\nAbedin took the good-wife act one step further at\nTuesday’s press conference, admitting her collusion in this new lie: “We\ndiscussed all of this before Anthony decided to run for mayor,” she\nsaid. So clearly, as Abedin sat for these joint interviews in which\nWeiner claimed to be a changed man, she knew that wasn’t the truth, and\nwas happy to lie to a public that had been nothing but sympathetic\ntoward poor, brilliant Huma, saddled with such a dud. Perhaps they’re a\nbetter match than we knew.\nSomething very wrong with Abedin… something’s up.  I wonder what that something might be that would cause a wife to be totally indifferent to her freakshow husband spending his evenings tweeting pictures of his genitalia to younger women.  Whatever could it possibly be?\nI still recall the look of utter panic on Sean Hannity’s face when Gennifer Flowers came out and said something to the effect of “everyone in Little Rock knows Hilary is a lesbian” on his show.  If I recall correctly, they went right to commercials.",
  "tags": [
    "freakshow",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-25T16:00:00+00:00"
}