{
  "url": "https://voxday.net/2013/07/18/detroit-finally-files/",
  "scraped_at": "2025-12-14T22:35:54.527248",
  "title": "Detroit finally files",
  "date_display": "July 18, 2013",
  "date_iso": "2013-07-18T21:56:00+00:00",
  "date_from_url": "2013-07-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.detroitnews.com/article/20130718/METRO01/307180103/Detroit-files-Chapter-9-bankruptcy?odyssey=mod|breaking|text|FRONTPAGE\">This bankruptcy filing</a> isn’t exactly a surprise, but it does mark a potentially significant step in the deflationary process:</p><blockquote class=\"tr_bq\"><div itemprop=\"articleBody\"> The city of Detroit filed the largest<br> municipal bankruptcy case in U.S. history Thursday afternoon,<br> culminating a decades-long slide that transformed the nation’s iconic<br> industrial town into a model of urban decline crippled by population<br> loss, a dwindling tax base and financial problems. The 16-page petition was filed in U.S. Bankruptcy Court in Detroit….</br></br></br></br></div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> The Chapter 9 filing could take<br> years, experts say, despite hopes by the governor and Orr that the case<br> can be wrapped up in a year. A bankruptcy judge could trump the state<br> constitution by slashing retiree pensions, ripping up contracts and<br> paying creditors roughly a dime on the dollar for unsecured claims worth<br> $11.45 billion.</br></br></br></br></br></div><div itemprop=\"articleBody\"></div><div itemprop=\"articleBody\"> During a month of<br> negotiations, Orr has reached a settlement with only two creditors: Bank<br> of America Corp. and UBS AG. They have agreed to accept 75 cents on the<br> dollar for approximately $340 million in swaps liabilities, according<br> to a source familiar with the deal.</br></br></br></br></div></blockquote><p>$18 billion may not sound like much, but the problem is that due to the way debt is stacked on top of debt, who knows how much more credit money will evaporate on the basis of its debt collateral having vanished.  And it’s not terribly surprising that the only creditors who are getting away without too much damage are the largest US bank and the largest Swiss bank.  They know the score, and 75 cents on the dollar is actually better than the average 60 cents on the dollar which their nominal assets are worth.</p><p>Where it’s going to get very interesting is when either Illinois or California attempts to declare bankruptcy, or, as a sovereign State, simply eliminate its debts by fiat.</p></div>",
  "content_text": "This bankruptcy filing\nisn’t exactly a surprise, but it does mark a potentially significant step in the deflationary process:\nThe city of Detroit filed the largest\nmunicipal bankruptcy case in U.S. history Thursday afternoon,\nculminating a decades-long slide that transformed the nation’s iconic\nindustrial town into a model of urban decline crippled by population\nloss, a dwindling tax base and financial problems. The 16-page petition was filed in U.S. Bankruptcy Court in Detroit….\nThe Chapter 9 filing could take\nyears, experts say, despite hopes by the governor and Orr that the case\ncan be wrapped up in a year. A bankruptcy judge could trump the state\nconstitution by slashing retiree pensions, ripping up contracts and\npaying creditors roughly a dime on the dollar for unsecured claims worth\n$11.45 billion.\nDuring a month of\nnegotiations, Orr has reached a settlement with only two creditors: Bank\nof America Corp. and UBS AG. They have agreed to accept 75 cents on the\ndollar for approximately $340 million in swaps liabilities, according\nto a source familiar with the deal.\n$18 billion may not sound like much, but the problem is that due to the way debt is stacked on top of debt, who knows how much more credit money will evaporate on the basis of its debt collateral having vanished.  And it’s not terribly surprising that the only creditors who are getting away without too much damage are the largest US bank and the largest Swiss bank.  They know the score, and 75 cents on the dollar is actually better than the average 60 cents on the dollar which their nominal assets are worth.\nWhere it’s going to get very interesting is when either Illinois or California attempts to declare bankruptcy, or, as a sovereign State, simply eliminate its debts by fiat.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-18T20:56:00+00:00"
}