{
  "url": "https://voxday.net/2013/07/01/edward-snowdons-statemen/",
  "scraped_at": "2025-12-14T22:33:53.603656",
  "title": "Edward Snowden’s statement",
  "date_display": "July 1, 2013",
  "date_iso": "2013-07-01T23:35:00+00:00",
  "date_from_url": "2013-07-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote class=\"tr_bq\"><p> One week ago I left Hong Kong after it became clear that my freedom<br> and safety were under threat for revealing the truth.  My continued<br> liberty has been owed to the efforts of friends new and old, family, and<br> others who I have never met and probably never will.  I trusted them<br> with my life and they returned that trust with a faith in me for which I<br> will always be thankful.</br></br></br></br></br></p><p>On Thursday, President Obama declared before the world that he would<br> not permit any diplomatic “wheeling and dealing” over my case.  Yet now<br> it is being reported that after promising not to do so, the President<br> ordered his Vice President to pressure the leaders of nations from which<br> I have requested protection to deny my asylum petitions.</br></br></br></br></p><p>This kind of deception from a world leader is not justice, and<br> neither is the extralegal penalty of exile. These are the old, bad tools<br> of political aggression.</br></br></p><p>Their purpose is to frighten, not me, but<br> those who would come after me.</br></p><p>For decades the United States of America has been one of the<br> strongest defenders of the human right to seek asylum.  Sadly, this<br> right, laid out and voted for by the U.S. in Article 14 of the Universal<br> Declaration of Human Rights, is now being rejected by the current<br> government of my country. The Obama administration has now adopted the<br> strategy of using citizenship as a weapon.</br></br></br></br></br></p><p>Although I am convicted of<br> nothing, it has unilaterally revoked my passport, leaving me a stateless<br> person. Without any judicial order, the administration now seeks to<br> stop me exercising a basic right. A right that belongs to everybody. The<br> right to seek asylum.</br></br></br></br></p><p>In the end the Obama administration is not afraid of whistleblowers<br> like me, Bradley Manning or Thomas Drake. We are stateless, imprisoned,<br> or powerless.</br></br></p><p>No, the Obama administration is afraid of you. It is<br> afraid of an informed, angry public demanding the constitutional<br> government it was promised — and it should be.</br></br></p><p>I am unbowed in my convictions and impressed at the efforts taken by so many.</p><p>Edward Joseph Snowden<br> Monday 1st July 2013</br></p></blockquote><p>Those aren’t the words of a traitor to his country. Those are the words of a hero and patriot who has exposed the misdeeds of a government that exceeds its bounds and views the people as its enemy.</p></div>",
  "content_text": "One week ago I left Hong Kong after it became clear that my freedom\nand safety were under threat for revealing the truth.  My continued\nliberty has been owed to the efforts of friends new and old, family, and\nothers who I have never met and probably never will.  I trusted them\nwith my life and they returned that trust with a faith in me for which I\nwill always be thankful.\nOn Thursday, President Obama declared before the world that he would\nnot permit any diplomatic “wheeling and dealing” over my case.  Yet now\nit is being reported that after promising not to do so, the President\nordered his Vice President to pressure the leaders of nations from which\nI have requested protection to deny my asylum petitions.\nThis kind of deception from a world leader is not justice, and\nneither is the extralegal penalty of exile. These are the old, bad tools\nof political aggression.\nTheir purpose is to frighten, not me, but\nthose who would come after me.\nFor decades the United States of America has been one of the\nstrongest defenders of the human right to seek asylum.  Sadly, this\nright, laid out and voted for by the U.S. in Article 14 of the Universal\nDeclaration of Human Rights, is now being rejected by the current\ngovernment of my country. The Obama administration has now adopted the\nstrategy of using citizenship as a weapon.\nAlthough I am convicted of\nnothing, it has unilaterally revoked my passport, leaving me a stateless\nperson. Without any judicial order, the administration now seeks to\nstop me exercising a basic right. A right that belongs to everybody. The\nright to seek asylum.\nIn the end the Obama administration is not afraid of whistleblowers\nlike me, Bradley Manning or Thomas Drake. We are stateless, imprisoned,\nor powerless.\nNo, the Obama administration is afraid of you. It is\nafraid of an informed, angry public demanding the constitutional\ngovernment it was promised — and it should be.\nI am unbowed in my convictions and impressed at the efforts taken by so many.\nEdward Joseph Snowden\nMonday 1st July 2013\nThose aren’t the words of a traitor to his country. Those are the words of a hero and patriot who has exposed the misdeeds of a government that exceeds its bounds and views the people as its enemy.",
  "tags": [
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-01T22:35:00+00:00"
}