{
  "url": "https://voxday.net/2013/07/18/fred-reed-on-zimmerman-v-martin/",
  "scraped_at": "2025-12-14T22:35:52.708919",
  "title": "Fred Reed on Zimmerman v Martin",
  "date_display": "July 18, 2013",
  "date_iso": "2013-07-18T16:40:00+00:00",
  "date_from_url": "2013-07-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not so much the trial as <a href=\"http://www.fredoneverything.net/Zim.shtml\">everything around it</a> that bodes ill for America 3.0:</p><blockquote class=\"tr_bq\"><p> Never have I seen  such sprawling, cacophonous, indignant ignorance<br> and frightful stupidity as  that being exhibited by the American public.<br> We are doomed.  I am delighted. Curmudgeons love doom.</br></br></p><p>Has there  ever been such focused inattention as the case has<br> produced? Nothing of  importance is noticed, and everything lacking it<br> is. The crucial fact to come  out of the whole adventure—crucial, and<br> therefore utterly overlooked–was  that  Rachel Jeantel, a prosecution<br> witness and black girl aged nineteen years, can´t read. The grim<br> implication of  this fact is confirmed by the illiteracy of tweets from<br> blacks regarding the  case. “Ima kill dat dumass cracker be racis.” Here<br> we see as neatly displayed  as if in a jewelry box why so many young<br> blacks will go nowhere in the remaining  fifty years of their lives.<br> They can´t read, or barely can. In a fading  techno-industrial<br> civilization—I use the latter word frivolously—this consigns  them to a<br> life on charity. Is this not of more note than who started what?</br></br></br></br></br></br></br></br></br></br></br></p><p>No. The  educational disaster that will leave Rachel and<br> millions of her confreres in  meaningless lives on welfare pales in<br> importance compared to the question: Did  Trayvon Martin and Zimmerman<br> have the proper racial attitudes?</br></br></br></p></blockquote><p>It is interesting, is it not, that questions concerning proper attitudes are deemed so much more important than other, much less important questions such as “are multicultural and multiracial societies sustainable in the absence of the greatest credit boom of all time?”  I understand many people believe that they are.  What I don’t understand is the basis for their belief, beyond the prosaic observation that the previous straw did not break the camel’s back.</p><p>As for Fred, the old curmudgeon is quite clearly enjoying all of this.  As he should, considering that he’s doing so from the safety of Mexico.</p></div>",
  "content_text": "It’s not so much the trial as\neverything around it\nthat bodes ill for America 3.0:\nNever have I seen  such sprawling, cacophonous, indignant ignorance\nand frightful stupidity as  that being exhibited by the American public.\nWe are doomed.  I am delighted. Curmudgeons love doom.\nHas there  ever been such focused inattention as the case has\nproduced? Nothing of  importance is noticed, and everything lacking it\nis. The crucial fact to come  out of the whole adventure—crucial, and\ntherefore utterly overlooked–was  that  Rachel Jeantel, a prosecution\nwitness and black girl aged nineteen years, can´t read. The grim\nimplication of  this fact is confirmed by the illiteracy of tweets from\nblacks regarding the  case. “Ima kill dat dumass cracker be racis.” Here\nwe see as neatly displayed  as if in a jewelry box why so many young\nblacks will go nowhere in the remaining  fifty years of their lives.\nThey can´t read, or barely can. In a fading  techno-industrial\ncivilization—I use the latter word frivolously—this consigns  them to a\nlife on charity. Is this not of more note than who started what?\nNo. The  educational disaster that will leave Rachel and\nmillions of her confreres in  meaningless lives on welfare pales in\nimportance compared to the question: Did  Trayvon Martin and Zimmerman\nhave the proper racial attitudes?\nIt is interesting, is it not, that questions concerning proper attitudes are deemed so much more important than other, much less important questions such as “are multicultural and multiracial societies sustainable in the absence of the greatest credit boom of all time?”  I understand many people believe that they are.  What I don’t understand is the basis for their belief, beyond the prosaic observation that the previous straw did not break the camel’s back.\nAs for Fred, the old curmudgeon is quite clearly enjoying all of this.  As he should, considering that he’s doing so from the safety of Mexico.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-18T15:40:00+00:00"
}