{
  "url": "https://voxday.net/2013/07/19/hiding-from-lig/",
  "scraped_at": "2025-12-14T22:35:58.221844",
  "title": "Hiding from the light",
  "date_display": "July 19, 2013",
  "date_iso": "2013-07-19T17:00:00+00:00",
  "date_from_url": "2013-07-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>MIT is <a href=\"http://www.wired.com/threatlevel/2013/07/mit-swartz-intervene/\">trying to conceal its involvement</a> in the Aaron Swartz affair:</p><blockquote class=\"tr_bq\"><p> Lawyers representing MIT are filing a motion to intervene in my FOIA<br> lawsuit over thousands of pages of Secret Service documents about the<br> late activist and coder Aaron Swartz…. MIT claims it’s afraid the release of Swartz’s file will identify the<br> names of MIT people who helped the Secret Service and federal<br> prosecutors pursue felony charges against Swartz for his bulk<br> downloading of academic articles from MIT’s network in 2011.</br></br></br></br></br></p><p>MIT argues that those people might face threats and harassment if<br> their names become public. But it’s worth noting that names of third<br> parties are already redacted from documents produced under FOIA.</br></br></p><p>I’ll post MIT’s motion here once it’s filed.</p><p>I have never, in fifteen years of reporting, seen a non-governmental<br> party argue for the right to interfere in a Freedom of Information Act<br> release of government documents. My lawyer has been litigating FOIA for<br> decades, and he’s never encountered it either. It’s saddening to see an<br> academic institution set this precedent.</br></br></br></br></p></blockquote><p>I find it<br> fascinating to observe how organizations appear to be increasingly disposed to try keeping their<br> actions against individuals hidden from the public view.  I recently<br> received an email from the Canadian Regional Director complaining about<br> how I’d characterized his previous communications with me:</br></br></br></br></p><p><i>“The membership numbers in the online directory represent our best data. We do not track membership numbers by specific dates.</i></p><p>“I<br> note that you have misrepresented my answer to your last request on<br> your blog. Failure to correct this will be considered in reviewing your<br> response.</br></br></br></p><p>“As previously instructed, all further correspondence in this matter should be directed to me.”</p><p>As<br> requested, I replaced what I’d previously written with a direct quote<br> to avoid any possibility of misrepresentation. However, note that this is what he<br> claimed to be a misrepresentation of his answer:<br> <i><br/></i><br> <i>“Mr. Johnson informed me that the membership numbers in the online<br> directory represent the organization’s best data and that SFWA does not<br> track membership numbers.”</br></br></i></br></br></br></br></br></p><p>Of course, if that is<br> misrepresentation, what is one to make of the numerous, shall we say,<br> less than entirely accurate representations contained in Mr. Johnson’s report to<br> the SFWA Board?  Will his failure to correct them also be considered by the Board?  Based on his last sentence, I fear I will<br> likely not be hearing back from the Secretary concerning the number of<br> members in the organization on the three dates requested, Article V,<br> Section 5 (c) of the SFWA bylaws notwithstanding.</br></br></br></br></br></br></p></div>",
  "content_text": "MIT is\ntrying to conceal its involvement\nin the Aaron Swartz affair:\nLawyers representing MIT are filing a motion to intervene in my FOIA\nlawsuit over thousands of pages of Secret Service documents about the\nlate activist and coder Aaron Swartz…. MIT claims it’s afraid the release of Swartz’s file will identify the\nnames of MIT people who helped the Secret Service and federal\nprosecutors pursue felony charges against Swartz for his bulk\ndownloading of academic articles from MIT’s network in 2011.\nMIT argues that those people might face threats and harassment if\ntheir names become public. But it’s worth noting that names of third\nparties are already redacted from documents produced under FOIA.\nI’ll post MIT’s motion here once it’s filed.\nI have never, in fifteen years of reporting, seen a non-governmental\nparty argue for the right to interfere in a Freedom of Information Act\nrelease of government documents. My lawyer has been litigating FOIA for\ndecades, and he’s never encountered it either. It’s saddening to see an\nacademic institution set this precedent.\nI find it\nfascinating to observe how organizations appear to be increasingly disposed to try keeping their\nactions against individuals hidden from the public view.  I recently\nreceived an email from the Canadian Regional Director complaining about\nhow I’d characterized his previous communications with me:\n“The membership numbers in the online directory represent our best data. We do not track membership numbers by specific dates.\n“I\nnote that you have misrepresented my answer to your last request on\nyour blog. Failure to correct this will be considered in reviewing your\nresponse.\n“As previously instructed, all further correspondence in this matter should be directed to me.”\nAs\nrequested, I replaced what I’d previously written with a direct quote\nto avoid any possibility of misrepresentation. However, note that this is what he\nclaimed to be a misrepresentation of his answer:\n“Mr. Johnson informed me that the membership numbers in the online\ndirectory represent the organization’s best data and that SFWA does not\ntrack membership numbers.”\nOf course, if that is\nmisrepresentation, what is one to make of the numerous, shall we say,\nless than entirely accurate representations contained in Mr. Johnson’s report to\nthe SFWA Board?  Will his failure to correct them also be considered by the Board?  Based on his last sentence, I fear I will\nlikely not be hearing back from the Secretary concerning the number of\nmembers in the organization on the three dates requested, Article V,\nSection 5 (c) of the SFWA bylaws notwithstanding.",
  "tags": [
    "Board Report",
    "conspiracy",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-19T16:00:00+00:00"
}