{
  "url": "https://voxday.net/2013/07/11/how-steve-jobs-sank-apples-case/",
  "scraped_at": "2025-12-14T22:35:03.516639",
  "title": "How Steve Jobs sank Apple’s case",
  "date_display": "July 11, 2013",
  "date_iso": "2013-07-11T20:00:00+00:00",
  "date_from_url": "2013-07-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Beldar sums up the Apple price-fixing case and quotes the judge’s decision:</p><blockquote class=\"tr_bq\"><p> “On January 27, Jobs launched the iPad. As part of a beautifully<br> orchestrated presentation, he also introduced the iPad’s e-reader<br> capability and the iBookstore. He proudly displayed the names and logos<br> of each Publisher Defendant whose books would populate the iBookstore.<br> To show the ease with which an iTunes customer could buy a book,<br> standing in front of a giant screen displaying his own iPad’s screen,<br> Jobs browsed through his iBooks “bookshelf,” clicked on the “store”<br> button in the upper corner of his e-book shelf display, watched the<br> shelf seamlessly flip to the iBookstore, and purchased one of Hachette’s<br> NYT Bestsellers, Edward M. Kennedy’s memoir, <i>True Compass</i>, for $14.99. With one tap, the e-book was downloaded, and its cover appeared on Jobs’s bookshelf, ready to be opened and read.</br></br></br></br></br></br></br></br></br></p><p>“When asked by a reporter later that day why people would pay $14.99<br> in the iBookstore to purchase an e-book that was selling at Amazon for<br> $9.99, Jobs told a reporter, “Well, that won’t be the case.” When the<br> reporter sought to clarify, “You mean you won’t be 14.99 or they won’t<br> be 9.99?” Jobs paused, and with a knowing nod responded, “The price will<br> be the same,” and explained that “Publishers are actually withholding<br> their books from Amazon because they are not happy.” With that<br> statement, Jobs acknowledged his understanding that the Publisher<br> Defendants would now wrest control of pricing from Amazon and raise<br> e-book prices, and that Apple would not have to face any competition<br> from Amazon on price.</br></br></br></br></br></br></br></br></br></br></p><p>“The import of Jobs’s statement was obvious. On January 29, the<br> General Counsel of [Simon &amp; Schuster] wrote to [the CEO of S&amp;S,<br> Carolyn] Reidy that she “cannot believe that Jobs made the statement”<br> and considered it “[i]ncredibly stupid.””</br></br></br></p></blockquote><p>Beldar sums up the decision: “This is just a methodical thrashing. In every appeal, the first thing<br> the appellate judges (and their law clerks) read is the district judge’s<br> opinion. After reading this one, I think almost any appellate judge is<br> going to be favorably impressed with its comprehensiveness and clarity.<br> It’s the kind of opinion after which you exhale and say, “Whew! That’s<br> going to be hard to fault in any significant way.””</br></br></br></br></br></p><p>And so the expected post-Jobs descent of Apple begins.</p></div>",
  "content_text": "Beldar sums up the Apple price-fixing case and quotes the judge’s decision:\n“On January 27, Jobs launched the iPad. As part of a beautifully\norchestrated presentation, he also introduced the iPad’s e-reader\ncapability and the iBookstore. He proudly displayed the names and logos\nof each Publisher Defendant whose books would populate the iBookstore.\nTo show the ease with which an iTunes customer could buy a book,\nstanding in front of a giant screen displaying his own iPad’s screen,\nJobs browsed through his iBooks “bookshelf,” clicked on the “store”\nbutton in the upper corner of his e-book shelf display, watched the\nshelf seamlessly flip to the iBookstore, and purchased one of Hachette’s\nNYT Bestsellers, Edward M. Kennedy’s memoir,\nTrue Compass\n, for $14.99. With one tap, the e-book was downloaded, and its cover appeared on Jobs’s bookshelf, ready to be opened and read.\n“When asked by a reporter later that day why people would pay $14.99\nin the iBookstore to purchase an e-book that was selling at Amazon for\n$9.99, Jobs told a reporter, “Well, that won’t be the case.” When the\nreporter sought to clarify, “You mean you won’t be 14.99 or they won’t\nbe 9.99?” Jobs paused, and with a knowing nod responded, “The price will\nbe the same,” and explained that “Publishers are actually withholding\ntheir books from Amazon because they are not happy.” With that\nstatement, Jobs acknowledged his understanding that the Publisher\nDefendants would now wrest control of pricing from Amazon and raise\ne-book prices, and that Apple would not have to face any competition\nfrom Amazon on price.\n“The import of Jobs’s statement was obvious. On January 29, the\nGeneral Counsel of [Simon & Schuster] wrote to [the CEO of S&S,\nCarolyn] Reidy that she “cannot believe that Jobs made the statement”\nand considered it “[i]ncredibly stupid.””\nBeldar sums up the decision: “This is just a methodical thrashing. In every appeal, the first thing\nthe appellate judges (and their law clerks) read is the district judge’s\nopinion. After reading this one, I think almost any appellate judge is\ngoing to be favorably impressed with its comprehensiveness and clarity.\nIt’s the kind of opinion after which you exhale and say, “Whew! That’s\ngoing to be hard to fault in any significant way.””\nAnd so the expected post-Jobs descent of Apple begins.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-11T19:00:00+00:00"
}