{
  "url": "https://voxday.net/2013/07/23/ignorance-of-law/",
  "scraped_at": "2025-12-14T22:36:24.118064",
  "title": "Ignorance of the law",
  "date_display": "July 23, 2013",
  "date_iso": "2013-07-23T17:00:00+00:00",
  "date_from_url": "2013-07-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Is no excuse for looking like a moron.  Instapundit wonders what the vibrant ignorati posturing publicly about Florida law will do when they realize that Florida is not the only state in question here:</p><blockquote class=\"tr_bq\"><p> WHAT WILL THEY DO WHEN THEY FIND OUT THAT CALIFORNIA, MASSACHUSETTS AND PENNSYLVANIA HAVE STAND-YOUR-GROUND LAWS, TOO? Some of the music industry’s biggest acts are joining Stevie Wonder in boycotting Florida over the state’s controversial “stand your ground” law. UPDATE: Illinois has “Stand Your Ground” Too — And Obama Voted For It. Will they boycott White House performances? Dumbasses.</p></blockquote><p>Tomato, tomahto….  Stevie Wonder declares: “I decided today that until the ‘stand your ground’ law is abolished in<br> Florida, I will never perform there again,” he said. “As a matter of<br> fact, wherever I find that law exists, I will not perform in that state<br> or in that part of the world.”</br></br></br></p><p>From Wikipedia:<i> “Many states have some form of stand-your-ground law. Alabama, Alaska, Arizona, California, Florida, Georgia, Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine, Massachusetts, Michigan, Mississippi, Missouri, Montana, New Hampshire, North Dakota, Ohio, Oklahoma, Pennsylvania, Rhode Island, South Carolina, South Dakota, Tennessee, Texas, Utah, West Virginia, Wisconsin, and Wyoming.”</i></p><p>Blindness isn’t merely a physical phenomenon. It should be amusing to see how quickly Mr. Wonder backs down once he realizes he just effectively ended his career outside the recording studio.</p></div>",
  "content_text": "Is no excuse for looking like a moron.  Instapundit wonders what the vibrant ignorati posturing publicly about Florida law will do when they realize that Florida is not the only state in question here:\nWHAT WILL THEY DO WHEN THEY FIND OUT THAT CALIFORNIA, MASSACHUSETTS AND PENNSYLVANIA HAVE STAND-YOUR-GROUND LAWS, TOO? Some of the music industry’s biggest acts are joining Stevie Wonder in boycotting Florida over the state’s controversial “stand your ground” law. UPDATE: Illinois has “Stand Your Ground” Too — And Obama Voted For It. Will they boycott White House performances? Dumbasses.\nTomato, tomahto….  Stevie Wonder declares: “I decided today that until the ‘stand your ground’ law is abolished in\nFlorida, I will never perform there again,” he said. “As a matter of\nfact, wherever I find that law exists, I will not perform in that state\nor in that part of the world.”\nFrom Wikipedia:\n“Many states have some form of stand-your-ground law. Alabama, Alaska, Arizona, California, Florida, Georgia, Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine, Massachusetts, Michigan, Mississippi, Missouri, Montana, New Hampshire, North Dakota, Ohio, Oklahoma, Pennsylvania, Rhode Island, South Carolina, South Dakota, Tennessee, Texas, Utah, West Virginia, Wisconsin, and Wyoming.”\nBlindness isn’t merely a physical phenomenon. It should be amusing to see how quickly Mr. Wonder backs down once he realizes he just effectively ended his career outside the recording studio.",
  "tags": [
    "law",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-23T16:00:00+00:00"
}