{
  "url": "https://voxday.net/2013/07/01/king-log-is-now-king-stork/",
  "scraped_at": "2025-12-14T22:33:51.751889",
  "title": "King Log is now King Stork",
  "date_display": "July 1, 2013",
  "date_iso": "2013-07-01T20:00:00+00:00",
  "date_from_url": "2013-07-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Who would have dreamed, back in the 1980s, that patriotic <a href=\"http://thehill.com/blogs/defcon-hill/policy-and-strategy/308717-us-russia-look-for-solution-to-snowden-controversy#ixzz2XoAt8Fni\">American dissidents would be fleeing to Moscow</a> in pursuit of safety:</p><blockquote class=\"tr_bq\"><p> Putin said Russia ruled out handing Snowden over to the United<br> States. Putin said that Snowden was “not a Russian agent” and that<br> Russian intelligence services weren’t working with him, according to<br> Reuters.  He said that Snowden should choose his final destination<br> and travel there, but also offered some compliments to the National<br> Security Agency leaker.  Putin said he considered Snowden to be a<br> rights activist, calling him a “new dissident,” according to The<br> Associated Press, and compared him to Nobel Peace Prize winner Andrei<br> Sakharov.</br></br></br></br></br></br></br></br></p></blockquote><p>Putin makes it possible for our generation to understand how historical strongmen became popular in their day.  In the meantime, he’s certainly winning the world’s favor by protecting the man who revealed just how pernicious the US empire has become.</p></div>",
  "content_text": "Who would have dreamed, back in the 1980s, that patriotic\nAmerican dissidents would be fleeing to Moscow\nin pursuit of safety:\nPutin said Russia ruled out handing Snowden over to the United\nStates. Putin said that Snowden was “not a Russian agent” and that\nRussian intelligence services weren’t working with him, according to\nReuters.  He said that Snowden should choose his final destination\nand travel there, but also offered some compliments to the National\nSecurity Agency leaker.  Putin said he considered Snowden to be a\nrights activist, calling him a “new dissident,” according to The\nAssociated Press, and compared him to Nobel Peace Prize winner Andrei\nSakharov.\nPutin makes it possible for our generation to understand how historical strongmen became popular in their day.  In the meantime, he’s certainly winning the world’s favor by protecting the man who revealed just how pernicious the US empire has become.",
  "tags": [
    "Americana"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-01T19:00:00+00:00"
}