{
  "url": "https://voxday.net/2013/07/12/less-equal-than-others/",
  "scraped_at": "2025-12-14T22:35:12.702523",
  "title": "Less equal than others",
  "date_display": "July 12, 2013",
  "date_iso": "2013-07-12T20:02:00+00:00",
  "date_from_url": "2013-07-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> It’s official: blacks in 27 states <a href=\"http://blogs.the-american-interest.com/wrm/2013/07/11/federal-government-now-endorses-soft-bigotry-of-low-expectations/\">are less academically able</a> than Asians in those states.</p><blockquote class=\"tr_bq\"><p> Beginning this fall, Alabama public schools will be under a new<br> state-created academic accountability system that sets different goals<br> for students in math and reading based on their race, economic status,<br> ability to speak English and disabilities.” Alabama’s Plan 2020 “sets a<br> different standard for students in each of several subgroups — American<br> Indian, Asian/Pacific islander, black, English language learners,<br> Hispanic, multirace, poverty, special education and white.” Of the 33 states granted a waiver last year, 27 now have different achievement goals for different groups of students.</br></br></br></br></br></br></p></blockquote><p>Now, according to those who support “marriage equality”, the state goverments have the right and ability to define marriage.  Marriage, they assert, is solely defined by what the government declares it to be.  But this is no less true of equality. Based on this logic, blacks must be academically inferior to Asians because the state governments have established their position on the matter.  Ergo, it is so.</p><p>Leftists never seem to understand that government is a sword that cuts equally well either way, and sometimes irrespective of who happens to be holding at the moment.</p></div>",
  "content_text": "It’s official: blacks in 27 states\nare less academically able\nthan Asians in those states.\nBeginning this fall, Alabama public schools will be under a new\nstate-created academic accountability system that sets different goals\nfor students in math and reading based on their race, economic status,\nability to speak English and disabilities.” Alabama’s Plan 2020 “sets a\ndifferent standard for students in each of several subgroups — American\nIndian, Asian/Pacific islander, black, English language learners,\nHispanic, multirace, poverty, special education and white.” Of the 33 states granted a waiver last year, 27 now have different achievement goals for different groups of students.\nNow, according to those who support “marriage equality”, the state goverments have the right and ability to define marriage.  Marriage, they assert, is solely defined by what the government declares it to be.  But this is no less true of equality. Based on this logic, blacks must be academically inferior to Asians because the state governments have established their position on the matter.  Ergo, it is so.\nLeftists never seem to understand that government is a sword that cuts equally well either way, and sometimes irrespective of who happens to be holding at the moment.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-12T19:02:00+00:00"
}