{
  "url": "https://voxday.net/2013/07/21/mailvox-on-moderation/",
  "scraped_at": "2025-12-14T22:36:09.521919",
  "title": "Mailvox: on moderation",
  "date_display": "July 21, 2013",
  "date_iso": "2013-07-21T15:02:00+00:00",
  "date_from_url": "2013-07-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Halojones-Fan erroneously believes moderation equates to copyright and responsibility:</p><blockquote class=\"tr_bq\"><p> Someone as smart as you figure yourself to be should understand that, if<br> you’re talking in a legal-proceedings sense, there is no such thing as<br> “light” moderation.  It’s like saying you’re “a little bit” pregnant.<br> If you delete comments for content, beyond simple “this is spam”, then<br> you’re implying that you review and approve of whatever stays on the<br> blog.  You provide the discussion forum; you allow people to wander in<br> and use it; you are as responsible for the content as the editor of a<br> newspaper is responsible for what’s in his rag.</br></br></br></br></br></br></br></p><p>That moderating is hard is not an excuse to not moderate.</p><p>“But it’s other people saying these things, not me!”  Then let them get their own blogs.</p></blockquote><p>First, his argument is intrinsically self-contradictory.  How is spam excerpted from this magical review and approve process?  Furthermore, the fact that a comment is not deleted does not mean it has been reviewed and approved; it does not even mean that it has been read.</p><p>The newspaper comparison is a false equivalence. The very important difference between me and the editor of a newspaper is that the editor of the newspaper is soliciting and paying for the content he publishes.  The newspaper also often owns the copyright for the material he publishes, whereas I do not solicit comments, pay for them, or claim ownership of their copyright.</p><p>To say that I am responsible for the comments made by the commenters on this blog is more closely akin to claiming that the owner of a restaurant is responsible for the comments made by the people who come to eat there.  The fact that the comments are written here rather than spoken is irrelevant; it is totally absurd to attempt to hold any blogger responsible for the free speech of his commenters and I am unaware of any case in which a blogger has been legally held responsible for the comments of his commenters regardless of whether moderation is allowed or not.</p><p>Furthermore, even in the legal sense, there is a distinction between light moderation and heavy moderation, just as there is a definite legal difference between a woman who is pregnant for two weeks and one who is pregnant for eight months.  Halojones-fan point is observably absurd, as the law quite clearly distinguishes between a woman who is “lightly pregnant” and a woman who is “heavily pregnant” in numerous ways.</p></div>",
  "content_text": "Halojones-Fan erroneously believes moderation equates to copyright and responsibility:\nSomeone as smart as you figure yourself to be should understand that, if\nyou’re talking in a legal-proceedings sense, there is no such thing as\n“light” moderation.  It’s like saying you’re “a little bit” pregnant.\nIf you delete comments for content, beyond simple “this is spam”, then\nyou’re implying that you review and approve of whatever stays on the\nblog.  You provide the discussion forum; you allow people to wander in\nand use it; you are as responsible for the content as the editor of a\nnewspaper is responsible for what’s in his rag.\nThat moderating is hard is not an excuse to not moderate.\n“But it’s other people saying these things, not me!”  Then let them get their own blogs.\nFirst, his argument is intrinsically self-contradictory.  How is spam excerpted from this magical review and approve process?  Furthermore, the fact that a comment is not deleted does not mean it has been reviewed and approved; it does not even mean that it has been read.\nThe newspaper comparison is a false equivalence. The very important difference between me and the editor of a newspaper is that the editor of the newspaper is soliciting and paying for the content he publishes.  The newspaper also often owns the copyright for the material he publishes, whereas I do not solicit comments, pay for them, or claim ownership of their copyright.\nTo say that I am responsible for the comments made by the commenters on this blog is more closely akin to claiming that the owner of a restaurant is responsible for the comments made by the people who come to eat there.  The fact that the comments are written here rather than spoken is irrelevant; it is totally absurd to attempt to hold any blogger responsible for the free speech of his commenters and I am unaware of any case in which a blogger has been legally held responsible for the comments of his commenters regardless of whether moderation is allowed or not.\nFurthermore, even in the legal sense, there is a distinction between light moderation and heavy moderation, just as there is a definite legal difference between a woman who is pregnant for two weeks and one who is pregnant for eight months.  Halojones-fan point is observably absurd, as the law quite clearly distinguishes between a woman who is “lightly pregnant” and a woman who is “heavily pregnant” in numerous ways.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-21T14:02:00+00:00"
}