{
  "url": "https://voxday.net/2013/07/01/milton-friedman-heretic-keynesian/",
  "scraped_at": "2025-12-14T22:33:46.633021",
  "title": "Milton Friedman: heretic Keynesian",
  "date_display": "July 1, 2013",
  "date_iso": "2013-07-01T08:40:00+00:00",
  "date_from_url": "2013-07-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I find it fascinating that as time has gone on, more and more economists are coming around to my view, which I explained in <i>The Return of the Great Depression</i>, that Milton Friedman was not an opponent of Keynesianism, as was always taught in the economics department of my university, but rather, a practitioner of a heretical form of it.  The freshwater vs saltwater conflict was an entirely internecine battle between Keynesians, it was not on the level of Hayek vs Keynes, let alone Mises vs Marx.</p><p>In an excerpt from his new book, <a href=\"http://mises.org/daily/6467/Milton-Friedman-Freshwater-Keynesian\">David Stockman writes</a> about how Friedman’s activities as an influential economist completely contradicted his very good essays on human liberty:</p><blockquote class=\"tr_bq\"><p> At the end of the day, Friedman jettisoned the gold standard for a<br> remarkable statist reason. Just as Keynes had been, he was afflicted<br> with the<br> economist’s ambition to prescribe the route to higher national income<br> and prosperity and the intervention tools and recipes that would deliver<br> it. The only<br> difference was that Keynes was originally and primarily a fiscalist,<br> whereas Friedman had seized upon open market operations by the central<br> bank as the<br> route to optimum aggregate demand and national income.</br></br></br></br></br></br></br></br></br></p><p>There were massive and multiple ironies in that stance. It put the<br> central bank in the proactive and morally sanctioned business of buying<br> the government’s<br> debt in the conduct of its open market operations. Friedman said, of<br> course, that the FOMC should buy bonds and bills at a rate no greater<br> than 3 percent<br> per annum, but that limit was a thin reed.</br></br></br></br></br></br></p><p>Indeed, it cannot be gainsaid that it was Professor Friedman, the<br> scourge of Big Government, who showed the way for Republican central<br> bankers to foster<br> that very thing. Under their auspices, the Fed was soon gorging on the<br> Treasury’s debt emissions, thereby alleviating the inconvenience of<br> funding more<br> government with more taxes.</br></br></br></br></br></br></p><p>Friedman also said democracy would thrive better under a régime of free<br> markets, and he was entirely correct. Yet his preferred tool of<br> prosperity<br> promotion, Fed management of the money supply, was far more<br> anti-democratic than Keynes’s methods. Fiscal policy activism was at<br> least subject to the<br> deliberations of the legislature and, in some vague sense, electoral<br> review by the citizenry.</br></br></br></br></br></br></br></p><p>By contrast, the twelve-member FOMC is about as close to an unelected<br> politburo as is obtainable under American governance. When in the<br> fullness of time,<br> the FOMC lined up squarely on the side of debtors, real estate owners,<br> and leveraged financial speculators—and against savers, wage earners,<br> and equity<br> financed businessmen—the latter had no recourse from its policy actions.</br></br></br></br></br></br></p></blockquote><p>For me, Milton Friedman is, like Margaret Thatcher, a tragic figure of history, an well-intentioned individual with a genuine love of human freedom who nevertheless betrayed his ideals with his professional actions.</p></div>",
  "content_text": "I find it fascinating that as time has gone on, more and more economists are coming around to my view, which I explained in\nThe Return of the Great Depression\n, that Milton Friedman was not an opponent of Keynesianism, as was always taught in the economics department of my university, but rather, a practitioner of a heretical form of it.  The freshwater vs saltwater conflict was an entirely internecine battle between Keynesians, it was not on the level of Hayek vs Keynes, let alone Mises vs Marx.\nIn an excerpt from his new book,\nDavid Stockman writes\nabout how Friedman’s activities as an influential economist completely contradicted his very good essays on human liberty:\nAt the end of the day, Friedman jettisoned the gold standard for a\nremarkable statist reason. Just as Keynes had been, he was afflicted\nwith the\neconomist’s ambition to prescribe the route to higher national income\nand prosperity and the intervention tools and recipes that would deliver\nit. The only\ndifference was that Keynes was originally and primarily a fiscalist,\nwhereas Friedman had seized upon open market operations by the central\nbank as the\nroute to optimum aggregate demand and national income.\nThere were massive and multiple ironies in that stance. It put the\ncentral bank in the proactive and morally sanctioned business of buying\nthe government’s\ndebt in the conduct of its open market operations. Friedman said, of\ncourse, that the FOMC should buy bonds and bills at a rate no greater\nthan 3 percent\nper annum, but that limit was a thin reed.\nIndeed, it cannot be gainsaid that it was Professor Friedman, the\nscourge of Big Government, who showed the way for Republican central\nbankers to foster\nthat very thing. Under their auspices, the Fed was soon gorging on the\nTreasury’s debt emissions, thereby alleviating the inconvenience of\nfunding more\ngovernment with more taxes.\nFriedman also said democracy would thrive better under a régime of free\nmarkets, and he was entirely correct. Yet his preferred tool of\nprosperity\npromotion, Fed management of the money supply, was far more\nanti-democratic than Keynes’s methods. Fiscal policy activism was at\nleast subject to the\ndeliberations of the legislature and, in some vague sense, electoral\nreview by the citizenry.\nBy contrast, the twelve-member FOMC is about as close to an unelected\npolitburo as is obtainable under American governance. When in the\nfullness of time,\nthe FOMC lined up squarely on the side of debtors, real estate owners,\nand leveraged financial speculators—and against savers, wage earners,\nand equity\nfinanced businessmen—the latter had no recourse from its policy actions.\nFor me, Milton Friedman is, like Margaret Thatcher, a tragic figure of history, an well-intentioned individual with a genuine love of human freedom who nevertheless betrayed his ideals with his professional actions.",
  "tags": [
    "economics",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-01T07:40:00+00:00"
}