{
  "url": "https://voxday.net/2013/07/15/moving-goalposts/",
  "scraped_at": "2025-12-14T22:35:32.875894",
  "title": "Moving the goalposts",
  "date_display": "July 15, 2013",
  "date_iso": "2013-07-15T17:24:00+00:00",
  "date_from_url": "2013-07-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of Steve Sailer’s readers makes <a href=\"http://www.milobookclub.com/2013/07/15/moving-goalposts/\">a perceptive observation</a> concerning the media’s behavior in the Trayvon affair:</p><blockquote class=\"tr_bq\"><p> Has anyone outside the Steve-o-Sphere noticed that, in typical fashion, the grounds for outrage keep subtly shifting?</p><p>Month 1- “A crazed white vigilante murdered an innocent, angelic boy!”.<br> Then it turned out that Martin wasn’t so innocent or angelic, and was<br> for all practical purposes a man, not a boy. Zimmerman was also revealed<br> to be not so crazed and not so white. So that angle was dropped.</br></br></br></p><p>Later- “It’s those awful ‘Stand your Ground’ laws, that’s what’s<br> wrong!”. But the defense didn’t even need to mention that law at trial,<br> because was totally irrelevant to the case….</br></br></p><p>This kind of “outrage distillation” is common when the press push a<br> bull***t narrative and then discover that they were mostly wrong. The<br> can’t continue lying, but they can focus the same amount of anger and<br> opprobrium onto smaller and smaller sins.</br></br></br></p></blockquote><p>The anger remains the same, it’s the justification for it that remains a moving target. That process does sound rather familiar, for some reason.  I can’t quite seem to place it, though.</p></div>",
  "content_text": "One of Steve Sailer’s readers makes\na perceptive observation\nconcerning the media’s behavior in the Trayvon affair:\nHas anyone outside the Steve-o-Sphere noticed that, in typical fashion, the grounds for outrage keep subtly shifting?\nMonth 1- “A crazed white vigilante murdered an innocent, angelic boy!”.\nThen it turned out that Martin wasn’t so innocent or angelic, and was\nfor all practical purposes a man, not a boy. Zimmerman was also revealed\nto be not so crazed and not so white. So that angle was dropped.\nLater- “It’s those awful ‘Stand your Ground’ laws, that’s what’s\nwrong!”. But the defense didn’t even need to mention that law at trial,\nbecause was totally irrelevant to the case….\nThis kind of “outrage distillation” is common when the press push a\nbull***t narrative and then discover that they were mostly wrong. The\ncan’t continue lying, but they can focus the same amount of anger and\nopprobrium onto smaller and smaller sins.\nThe anger remains the same, it’s the justification for it that remains a moving target. That process does sound rather familiar, for some reason.  I can’t quite seem to place it, though.",
  "tags": [
    "media",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-15T16:24:00+00:00"
}