{
  "url": "https://voxday.net/2013/07/03/my-convention-policy/",
  "scraped_at": "2025-12-14T22:34:05.791553",
  "title": "My convention policy",
  "date_display": "July 3, 2013",
  "date_iso": "2013-07-03T15:00:00+00:00",
  "date_from_url": "2013-07-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Inspired by McRapey’s brave decision to tell the SF conventions of the world what is, and what is not, acceptable to the public, I too have decided to provide a list of hard requirements for my being a panelist,<br> participant or Guest of Honor at a SF convention in the interest of making the world a better, safer, and more respectful place for everyone:</br></p><p><b>1.</b> That the convention has a harassment policy, and<br> that the harassment policy is clear on precisely how all Tor authors and editors will be harassing the other attendees, sexually, ocularly, olfactory and otherwise.  I mean, given the probability that McRapey is going to be running around in his little red pumps while “Hands” Frenkel is feeling up the lumpy protruberances of spike-haired shoggoths and the Toad of Tor is squatting in the corner croaking threats at all who pass it by, these are sights and sounds – and smells –  for which one desperately wants to be prepared.  Preferably with a hazmat suit and a flamethrower.</br></p><p><b>2.</b> That the convention provide a list of the fawning terms by which I am to be addressed at all times by the attendees, by<br> at least one and preferably more than one of the following: posting the list on their Website, placing it in their written and electronic<br> programs, putting up flyers in the common areas, discussing the list<br> at opening ceremonies or at other well-attended common events.</br></br></br></p><p><b>3.</b> In cases when I am invited as a Guest of Honor,<br> personal affirmation from the convention chair that I will be provided with two (2) attractive cisgendered women, age not to exceed 25, BMI not to exceed 18.5, and height no less than 5’6″, dressed in age-appropriate Dallas Cowboys Cheerleaders attire to serve as my personal entourage. Pictures of the prospective candidates are to be provided by email no less than two weeks prior to the event for my approval. </br></p><p>Thank you for your support of my courage and goodthought. I will now bathe in the smug comfort of my self-regard.</p><p>On a tangential note, I would be remiss if I failed to show my support for the reinvention of SFWA as the Science Fiction and Fantasy Sexual Harassment Police.  In their feeding frenzy, the pinkshirts are demonstrating, more convincingly than I could ever have managed myself, that SFWA is no longer fit for purpose and is now essentially divorced from the business of writing and publishing science fiction.</p></div>",
  "content_text": "Inspired by McRapey’s brave decision to tell the SF conventions of the world what is, and what is not, acceptable to the public, I too have decided to provide a list of hard requirements for my being a panelist,\nparticipant or Guest of Honor at a SF convention in the interest of making the world a better, safer, and more respectful place for everyone:\n1.\nThat the convention has a harassment policy, and\nthat the harassment policy is clear on precisely how all Tor authors and editors will be harassing the other attendees, sexually, ocularly, olfactory and otherwise.  I mean, given the probability that McRapey is going to be running around in his little red pumps while “Hands” Frenkel is feeling up the lumpy protruberances of spike-haired shoggoths and the Toad of Tor is squatting in the corner croaking threats at all who pass it by, these are sights and sounds – and smells –  for which one desperately wants to be prepared.  Preferably with a hazmat suit and a flamethrower.\n2.\nThat the convention provide a list of the fawning terms by which I am to be addressed at all times by the attendees, by\nat least one and preferably more than one of the following: posting the list on their Website, placing it in their written and electronic\nprograms, putting up flyers in the common areas, discussing the list\nat opening ceremonies or at other well-attended common events.\n3.\nIn cases when I am invited as a Guest of Honor,\npersonal affirmation from the convention chair that I will be provided with two (2) attractive cisgendered women, age not to exceed 25, BMI not to exceed 18.5, and height no less than 5’6″, dressed in age-appropriate Dallas Cowboys Cheerleaders attire to serve as my personal entourage. Pictures of the prospective candidates are to be provided by email no less than two weeks prior to the event for my approval.\nThank you for your support of my courage and goodthought. I will now bathe in the smug comfort of my self-regard.\nOn a tangential note, I would be remiss if I failed to show my support for the reinvention of SFWA as the Science Fiction and Fantasy Sexual Harassment Police.  In their feeding frenzy, the pinkshirts are demonstrating, more convincingly than I could ever have managed myself, that SFWA is no longer fit for purpose and is now essentially divorced from the business of writing and publishing science fiction.",
  "tags": [
    "McRapey",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-03T14:00:00+00:00"
}