{
  "url": "https://voxday.net/2013/07/28/out-credentialing-credentializers/",
  "scraped_at": "2025-12-14T22:36:58.459278",
  "title": "Out-credentialing the credentializers",
  "date_display": "July 28, 2013",
  "date_iso": "2013-07-28T17:00:00+00:00",
  "date_from_url": "2013-07-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve noted that the Left makes a regular fetish of academic credentials because so many of their arguments rest upon nothing more than naked appeals to authority.  As we’ve seen again and again, even leftists without any significant credentials attempt to use appeals to nonexistent authorities to avoid having their arguments exposed via debate, i.e. the “you and/or your ideas are not even worthy” excuse.</p><p>I always find that excuse to be interesting in light of how my ideas are so often deemed eminently worthy of their attentions so long as they are able to remain on the attack. It is only when my critics unexpectedly find themselves forced to defend their own positions that my ideas mysteriously cease to be worthy of consideration.</p><p>In fact, if one stops and thinks through the logical implications, if my ideas merit substantial criticism while theirs do not, that means it is their ideas that are, in their own estimation, the unworthy ones.</p><p>Our resident female physics PhD often enjoys ambushing the unwary credentializer with her indubitably superior academic credentials.  I suspect she might relate to this anecdote, which I’ve dredged from the comments because it merits reading:</p><blockquote class=\"tr_bq\"><p> <b>Garuda: “I just love how confused they get when not only does their credential<br> trump-card NOT work to cow their opponent, but is itself trumped by a<br> higher-value credential delivered by an aggressive debater.</br></br></b>“</p><p>TJIC: “Best<br> example of this I ever saw: law professor and free market guru David<br> Friedman was talking about climate change in his blog. (He wasn’t<br> convinced by some detail of the orthodoxy.)</br></br></br></p><p>“A drive-by commentor<br> unloaded some Cathedral snark on him, appealing to the god SCIENCE.  It<br> went something like “I don’t know why I should care about the opinion of<br> a mere law professor.  I took some physics courses in college and I can<br> tell you that XYZ.”</br></br></br></br></p><p>“David replied calmly: ‘Well, I teach law in a law school, but I’m self-taught in that field.  My PhD is in physics.'”</p></blockquote><p>Trusting to your academic credentials is like placing faith in your IQ.  No matter how lofty they are, there is always someone out there with the means to trump you.  That’s why it is much better to hone your abilities to present effective arguments and utilize them instead; the correct and effective use of facts and reason will defeat even the most impressive academic credentials and the highest IQ when those things are mustered in defense of that which is demonstrably untrue.</p><p>As Aristotle did before him, in his <i>Defense of the Divine Revelation against the Objections of the Freethinkers</i> the brilliant mathematician Leonhard Euler observed that there are people who are simply incapable of being reached by reason:</p><p><i>“The freethinkers have yet to produce any objections that have not long been refuted most thoroughly. But since they are not motivated by the love of truth, and since they have an entirely different point of view, we should not be surprised that the best refutations count for nothing and that the weakest and most ridiculous reasoning, which has so often been shown to be baseless, is continuously repeated. If these people maintained the slightest rigor, the slightest taste for the truth, it would be quite easy to steer them away from their errors; but their tendency towards stubbornness makes this completely impossible.”</i></p><p>It makes no difference if one calls them rabbits, r-selected, freethinkers, scientists, credentialists, or “people whom one cannot instruct”.  What they are, in their core, are lovers of lies. They are haters of truth and they can never be convinced by any knowledge or logical argument because they will literally be damned before they will dare to question, let alone abandon, the dogma instilled in them by their warren.</p><p>The fact that Man’s greatest geniuses anticipated them and described them with utter contempt doesn’t even give them a moment’s pause is no surprise, but rather, a confirmation of the predictive model.</p></div>",
  "content_text": "I’ve noted that the Left makes a regular fetish of academic credentials because so many of their arguments rest upon nothing more than naked appeals to authority.  As we’ve seen again and again, even leftists without any significant credentials attempt to use appeals to nonexistent authorities to avoid having their arguments exposed via debate, i.e. the “you and/or your ideas are not even worthy” excuse.\nI always find that excuse to be interesting in light of how my ideas are so often deemed eminently worthy of their attentions so long as they are able to remain on the attack. It is only when my critics unexpectedly find themselves forced to defend their own positions that my ideas mysteriously cease to be worthy of consideration.\nIn fact, if one stops and thinks through the logical implications, if my ideas merit substantial criticism while theirs do not, that means it is their ideas that are, in their own estimation, the unworthy ones.\nOur resident female physics PhD often enjoys ambushing the unwary credentializer with her indubitably superior academic credentials.  I suspect she might relate to this anecdote, which I’ve dredged from the comments because it merits reading:\nGaruda: “I just love how confused they get when not only does their credential\ntrump-card NOT work to cow their opponent, but is itself trumped by a\nhigher-value credential delivered by an aggressive debater.\n“\nTJIC: “Best\nexample of this I ever saw: law professor and free market guru David\nFriedman was talking about climate change in his blog. (He wasn’t\nconvinced by some detail of the orthodoxy.)\n“A drive-by commentor\nunloaded some Cathedral snark on him, appealing to the god SCIENCE.  It\nwent something like “I don’t know why I should care about the opinion of\na mere law professor.  I took some physics courses in college and I can\ntell you that XYZ.”\n“David replied calmly: ‘Well, I teach law in a law school, but I’m self-taught in that field.  My PhD is in physics.'”\nTrusting to your academic credentials is like placing faith in your IQ.  No matter how lofty they are, there is always someone out there with the means to trump you.  That’s why it is much better to hone your abilities to present effective arguments and utilize them instead; the correct and effective use of facts and reason will defeat even the most impressive academic credentials and the highest IQ when those things are mustered in defense of that which is demonstrably untrue.\nAs Aristotle did before him, in his\nDefense of the Divine Revelation against the Objections of the Freethinkers\nthe brilliant mathematician Leonhard Euler observed that there are people who are simply incapable of being reached by reason:\n“The freethinkers have yet to produce any objections that have not long been refuted most thoroughly. But since they are not motivated by the love of truth, and since they have an entirely different point of view, we should not be surprised that the best refutations count for nothing and that the weakest and most ridiculous reasoning, which has so often been shown to be baseless, is continuously repeated. If these people maintained the slightest rigor, the slightest taste for the truth, it would be quite easy to steer them away from their errors; but their tendency towards stubbornness makes this completely impossible.”\nIt makes no difference if one calls them rabbits, r-selected, freethinkers, scientists, credentialists, or “people whom one cannot instruct”.  What they are, in their core, are lovers of lies. They are haters of truth and they can never be convinced by any knowledge or logical argument because they will literally be damned before they will dare to question, let alone abandon, the dogma instilled in them by their warren.\nThe fact that Man’s greatest geniuses anticipated them and described them with utter contempt doesn’t even give them a moment’s pause is no surprise, but rather, a confirmation of the predictive model.",
  "tags": [
    "debate"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-28T16:00:00+00:00"
}