{
  "url": "https://voxday.net/2013/07/10/president-stasi/",
  "scraped_at": "2025-12-14T22:34:54.167701",
  "title": "President Stasi",
  "date_display": "July 10, 2013",
  "date_iso": "2013-07-10T17:00:00+00:00",
  "date_from_url": "2013-07-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Obama sets federal workers <a href=\"http://www.mcclatchydc.com/2013/07/09/196211/linchpin-for-obamas-plan-to-predict.html#.UdyoKL0SVPw\">to spying on each other</a>:</p><blockquote class=\"tr_bq\"><p> In an initiative aimed<br> at rooting out future leakers and other security violators, President<br> Barack Obama has ordered federal employees to report suspicious actions<br> of their colleagues based on behavioral profiling techniques that are<br> not scientifically proven to work, according to experts and government<br> documents. The techniques are a key pillar of the Insider Threat<br> Program, an unprecedented government-wide crackdown under which millions<br> of federal bureaucrats and contractors must watch out for “high-risk<br> persons or behaviors” among co-workers. Those who fail to report them<br> could face penalties, including criminal charges.</br></br></br></br></br></br></br></br></br></p></blockquote><p>Anyone noticing a theme here with this president?  He’s got the government spying on everyone around the globe, he’s got bureaucrats spying on other bureaucrats, he’s got doctors spying on patients, and I suppose it won’t be long before he’ll have kids spying on parents.</p></div>",
  "content_text": "Obama sets federal workers\nto spying on each other\n:\nIn an initiative aimed\nat rooting out future leakers and other security violators, President\nBarack Obama has ordered federal employees to report suspicious actions\nof their colleagues based on behavioral profiling techniques that are\nnot scientifically proven to work, according to experts and government\ndocuments. The techniques are a key pillar of the Insider Threat\nProgram, an unprecedented government-wide crackdown under which millions\nof federal bureaucrats and contractors must watch out for “high-risk\npersons or behaviors” among co-workers. Those who fail to report them\ncould face penalties, including criminal charges.\nAnyone noticing a theme here with this president?  He’s got the government spying on everyone around the globe, he’s got bureaucrats spying on other bureaucrats, he’s got doctors spying on patients, and I suppose it won’t be long before he’ll have kids spying on parents.",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-10T16:00:00+00:00"
}