{
  "url": "https://voxday.net/2013/07/04/regression-from-carnis/",
  "scraped_at": "2025-12-14T22:34:09.429170",
  "title": "Regression from carnism",
  "date_display": "July 4, 2013",
  "date_iso": "2013-07-04T00:00:00+00:00",
  "date_from_url": "2013-07-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Vegan Sellout List’s <a href=\"http://www.exvegans.com/our-mission/\">quixotic mission</a>:</p><blockquote class=\"tr_bq\"><p> <b>If you’re no longer vegan, you’re going on the list.</b><br> <b> </b><br> <br> The spirits of the billions murdered have risen to deliver: The Vegan<br> Sellout List – an online directory of those who have regressed from<br> moral consistency to moral depravity.</br></br></br></br></br></p><p>The Vegan Sellout List is our answer to the epidemic of vegan<br> sellouts – those who are aware of the suffering caused by meat, dairy,<br> egg, fur, and leather production, yet choose to look away while the<br> animals suffer.</br></br></br></p><p>Selling out veganism is a trend on the upswing, bringing with it<br> swarms of haughty, nose-turning carnists uttering nonsensical buzzwords<br> re: veganism being “privileged”, or “trendy”, critiquing themselves into<br> ethical degeneracy and paleo-terrorism.</br></br></br></p></blockquote><p>I think this one is my favorite example.  And I tend to agree, this Minneapolis woman does merit some form of severe punishment.</p><p><i>“Made us all even eat vegan pumpkin pie for Thanksgiving one year and then found out she closet ate cheeseburgers.”</i></p><p>Vegan pumpkin pie?  Stick to the nuts, twigs, and berries, you freakshows.  The thing I find most entertaining about vegans and vegetarians is their attempt to appeal to a “morality” that somehow manages to be simultaneously nonexistent and incoherent.</p><p>And look, it’s time to point out the truth. No straight man has ever been a vegan and very few outside of India are genuine vegetarians.  They simply fake it in order to have sex with the sort of mentally unbalanced women who believe crystals possess healing powers.</p><p>If you want to convert a vegan to carnism, take her to Barcelona.  I once unwittingly corrupted a woman there.  A group of us were out to dinner at a conference, she was sitting next to me, and my plate of pata negra proved too tempting.  I simply offered her a piece, not knowing she was a vegetarian, and she scarfed most of the plate in about ten seconds.  It was like watching a single piranha skeletonize a cow.</p><p>She apologized afterwards and explained it was the first meat she’d ordered in seven years. I congratulated her on her recovery, ordered two more plates, and until they arrived, kept a watchful eye on her and a hand on my steak knife, just in case she went for my shoulder.</p></div>",
  "content_text": "The Vegan Sellout List’s\nquixotic mission\n:\nIf you’re no longer vegan, you’re going on the list.\nThe spirits of the billions murdered have risen to deliver: The Vegan\nSellout List – an online directory of those who have regressed from\nmoral consistency to moral depravity.\nThe Vegan Sellout List is our answer to the epidemic of vegan\nsellouts – those who are aware of the suffering caused by meat, dairy,\negg, fur, and leather production, yet choose to look away while the\nanimals suffer.\nSelling out veganism is a trend on the upswing, bringing with it\nswarms of haughty, nose-turning carnists uttering nonsensical buzzwords\nre: veganism being “privileged”, or “trendy”, critiquing themselves into\nethical degeneracy and paleo-terrorism.\nI think this one is my favorite example.  And I tend to agree, this Minneapolis woman does merit some form of severe punishment.\n“Made us all even eat vegan pumpkin pie for Thanksgiving one year and then found out she closet ate cheeseburgers.”\nVegan pumpkin pie?  Stick to the nuts, twigs, and berries, you freakshows.  The thing I find most entertaining about vegans and vegetarians is their attempt to appeal to a “morality” that somehow manages to be simultaneously nonexistent and incoherent.\nAnd look, it’s time to point out the truth. No straight man has ever been a vegan and very few outside of India are genuine vegetarians.  They simply fake it in order to have sex with the sort of mentally unbalanced women who believe crystals possess healing powers.\nIf you want to convert a vegan to carnism, take her to Barcelona.  I once unwittingly corrupted a woman there.  A group of us were out to dinner at a conference, she was sitting next to me, and my plate of pata negra proved too tempting.  I simply offered her a piece, not knowing she was a vegetarian, and she scarfed most of the plate in about ten seconds.  It was like watching a single piranha skeletonize a cow.\nShe apologized afterwards and explained it was the first meat she’d ordered in seven years. I congratulated her on her recovery, ordered two more plates, and until they arrived, kept a watchful eye on her and a hand on my steak knife, just in case she went for my shoulder.",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-03T23:00:00+00:00"
}