{
  "url": "https://voxday.net/2013/07/26/season-of-red-wolf-fails-to-note-two/",
  "scraped_at": "2025-12-14T22:36:45.906845",
  "title": "There is no middle ground",
  "date_display": "July 26, 2013",
  "date_iso": "2013-07-26T20:00:00+00:00",
  "date_from_url": "2013-07-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Season of the Red Wolf fails to note two vital things in his attempt <a href=\"http://seasonoftheredwolf.wordpress.com/2013/07/26/why-conservatism-cannot-save-science-fiction-from-the-depths-of-idiot-moral-relativist-pc-leftism-in-which-it-is-ensnared/\">to call a pox on both houses</a>.  First, I am neither a conservative nor a reactionary.  My positions stand on their own from first principles, they are not formed in reaction to anything. Second, he does not, (and I suspect cannot), make a case against either my position on either gays or women beyond the usual pointing, shrieking, and not bothering to go into details because his position is self-evident:</p><blockquote class=\"tr_bq\"><p> All this brings me to Theodore Beale aka Vox Day, the voice for ‘conservative sanity’ in the Science Fiction genre community. So he thinks. Yes Beale does have on occasion some sensible things to say, about the moral relativist and cultural relativist far Left insanity that pervades the SF genre community, and the odious liberal gate-keeping of the commercial and ‘artistic’ award circus. However Beale is – to put it as politely and diplomatically as possible – not the most reasonable alternative to the status quo. It’s not that he’s a little cranky, or odd, who isn’t in the genre community? Who isn’t period? It’s that his um opinions on women and homosexuality are simply eyebrow raising. There is no other way to put it.</p><p>Now I don’t care for RationalWiki any more than I care for Wiki on controversial issues. RationalWiki’s bias to so-called enlightenment values that are not always such is apparent and in-your-face. It appears to have a clear anti-religious and scientific materialist agenda, an agenda that hews to the liberal status quo across the board, and RationalWiki may well suffer from moral and cultural relativist delusions that Western liberalism suffers from as a whole. I mention this because this is Beale’s page at RationalWiki. However there are some quotes there attributed to Beale – I am talking about what he has to say about women and homosexuality – that make one wonder if they are for real or at least intended to be tongue-in-cheek. Well they are for real and no they are not intended to be sarcastic.</p><p>Here are <a href=\"http://www.milobookclub.com/2010/08/19/ending-gay-defec/\">some of his choice remarks on gays</a> for example.</p><p>I am not going to bother going into details on why the above is just misguided, disturbing and contradictory. Either you see it or you don’t. Homosexuality is “a combination of nature…” and yet it is “a birth defect”. And ‘civilized society’ needs to treat it as such. The path down which this kind of thinking leads is not one I care to go down… Beale appears to be sincere in that he intends no personal malice or hatred to homosexuals – he makes it clear he doesn’t see homosexuality as bad per se. And yet Beale does give comfort and justification to those who are hateful to homosexuals. However Beale may vociferously deny it and not intend it at all. This is why Beale’s self-deceptive thinking on this front is so dangerous and beyond the pale. [PS No I am not gay myself, although I know some people think so]</p><p>On women in science and well, women, he is arguably misogynistic. And no I don’t take seriously the claims of militant feminists here at all, since the latter have no credibility whatsoever (witness the Malzberg and Resnick witch-hunt after all); but Beale’s more mainstream critics and his own *actual remarks* here speak for themselves (I mean one just needs to quote Beale without comment):</p><p>Now if Beale were just reacting and mocking the idiotic extremes of far Left feminism (and militant feminism in the academy for that matter), and its anti-male prejudice and out-and-out imbecility (as exemplified by the Malzberg-Resnick kerfluffle), I would and do concur. The militant feminists are the flip side of the coin to old-fashioned misogyny and excessive patriarchy in our society. However the problem with Beale is that he appears to go further than that, and his remarks on women as a whole appear to be persistently and consistently troubling, a little over the top.</p><p>The thing is Beale easily alienates or risks alienating (one assumes) half the genre community with his breezy, negative remarks on the female sex. One would think he would want as many readers as possible, as much support as he could get from SFFWA voters, when everything is rigged against you. Does Beale not realize that there are as likely to be as many genre females who are infuriated with moronic Leftism and its hold on the genre, as males? Or does Beale think that women are disproportionately in favor of selling the political status quo? Even if he does believe that, does he really want to alienate the women who don’t care for how feminism has lost its way (when it comes to militant feminism, plenty of women just roll their eyes); and women who don’t care for the Left’s and the genre Left’s love affair/apologetics for reactionary Islam? Well that’s the message Beale could easily be construed as sending out.</p><p>More recently Beale has gotten into a spat with N K Jemisin, radical US feminist genre writer over the latter’s controversial speech in Australia (just google it if you can be bothered). One wonders when Jemisin will be visiting Egypt or the Sudan or any nation in the Persian Gulf to let us know about what she thinks of how women and girls are treated there by Sharia law, but as they say when hell freezes over…  Yet Beale’s response to Jemisin  in some parts falls into the same trap, the same mold, they are both reacting off one another with stereotypes, superficial finger-pointing and offensive generalizations that are fallacious. He is reactionary, she is well a far Leftist (enough said).</p><p>Another thing that I cannot leave out, is that Beale is in bitter dispute with the SFWA given that he accuses the latter of unfair discrimination and negative attacks against Beale’s person at the latter’s (private) forums, and similar issues. Given the snakes’ nest and vile gossipy nature of the SFWA, and the latter’s odious far Left political bent on top of all that; well I’m not on the side of the SFWA here. However I don’t know what has gone on behind the scenes and thus I cannot comment on this with any real knowledge whatsoever, so will leave off. If anybody is so interested, Beale has quite a lot to say about it at his blog.</p><p>The thing is conservatives who cheer him on either haven’t noticed his uh problematic side, or they don’t care to notice, or they simply share his reactionary tendencies. We have common enemies after all, and you know let’s not look to closely at our embarrassing relatives who are effective leaders and sell lots of books… The enemy of my enemy is my friend, goes the thinking on both sides of the Isle. And this is symptomatic of why there is no hope for conservative SF. And conservatism really. The same lack of concern of prejudice, that infects the Left like a cancer. Misogyny? Yawn. Well depends on how you look at it. Gays shmays. Whatever. The far Left are misogynistic too, horribly so. This is especially the case with far Left feminists, but who knows that? Given liberal militant feminists’ running cover for reactionary Islam (as liberals are wont to do as a whole), and the latter’s in-your-face misogyny; well this shows up a core of  self-loathing, of masochism, of a strong anti-female streak within the militant feminist Movement. The ironies with the Left are beyond compare. That’s a whole other thing, beyond this article’s general scope. Just read the authentic feminist Phyllis Chesler’s Woman’s Inhumanity to Woman and The Death of Feminism. Not that these feminists ever will. None of the Left’s misogyny and the genre Left’s misogyny (that they don’t begin to recognize at all, along with the anti-Semitism) excuse such misogyny if it comes from conservative circles, in and out of the genre community. And so partisans on both sides of the isle will point fingers at the other and close ranks. We have dragons to fight after all, and you can’t make an omelette without breaking some eggs. So it goes. Yeah well count me out.</p><p>In other words, Gould had no real competition. Although Fordham U prof Paul Levinson has served as president of the SFWA, and Levinson is a political crackpot. I’m sure there are plenty of genre pro writers and wannabe writers who don’t care for the status quo and the business-as-usual approach from Gould, but Beale as the alternative is no viable alternative.</p><p>And as I make clear further up, Scalzi is guilty of PC identity politics and its explicit racism, and likewise doesn’t have the tiniest problem whatsoever with extreme Jew-hatred from the genre community. Ditto Scalzi’s successor, Court Jew Steven Gould. So how is Scalzi better than Beale? How is Gould? Other than the fact that Scalzi’s identity politics prejudice and enforcement of deafening silence to Jew-hatred from genre writers is just going along with the zeitgeist of our times; that is the genre Thought Police’s prejudices are respectable prejudices and Beale’s are not. Scalzi (and Gould) aren’t any better than Beale and neither are the formers’ supporters.</p><p>The thing is though that Beale’s reactionary slant isn’t the way forward, heck by definition reactionary thinking is going back to the past and past mistakes. It’s answering the horrible prejudices of Scalzi and his ilk with Beale’s own neuroses. And it makes no sense to say that Beale’s prejudices are preferable to Scalzi’s or vice versa. Yet Scalzi’s race-baiting has its seal of approval from liberal America, from the White House itself, from a dumb media, the Ivy League. And it’s all branded as anti-racism, anti-prejudice. That’s what makes Scalzi and the genre Thought Police’s prejudices so very scary.</p></blockquote><p>What Season is missing here is that the truth is the truth, regardless of whom it might happen to give “aid and comfort”.  If science makes him uncomfortable because it proves that all humans are not equally homo sapiens sapiens or indicates it will be possible to genetically prevent fetuses from developing into homosexuals, that just means reality makes him uncomfortable, it doesn’t mean that the science doesn’t exist or must be incorrect.</p><p>I am not saying that SF/F should go back and blindly imitate the masters of the past. Who among us can reasonably hope to equate the achievement of Tolkien, let alone surpass it?  But SF/F could do, and is doing, considerably worse than rejecting the lessons and examples set by the classics and embarking on a politically correct course that is neither scientific nor literary.  In fact, if one accepts the definition of art as that which is true to the artist’s feelings, most modern SF/F is manifestly not even artistic, being rife with cowardice, self-deceit, and derivation.</p><p>I don’t pretend to be THE alternative to the status quo, I am merely one alternative to it.  And I would encourage Seasons to read A Throne of Bones before blithely dismissing that alternative; it is as foolish to judge my novels by my blog posts as it is to judge Neil Gaiman’s novels by his choice in female companions.  In answer to his questions:</p><p><i>1. “Does Beale not realize that there are as likely to be as many genre<br> females who are infuriated with moronic Leftism and its hold on the<br> genre, as males?”</br></br></i></p><p>I disagree.  That’s simply not true. Such women do exist.  But there are far fewer of them because they observably have not fled the SF/F genre in the same numbers as men.</p><p><i>2.  “Or does Beale think that women are disproportionately<br> in favor of selling the political status quo?” </br></i></p><p>Yes, I think women disproportionately lean politically left and tend to prefer fiction about romance to fiction about science or ideas.  So, naturally, they are more accepting of the current SF/F status quo than men; men don’t buy novels about necrobestial love triangles in space.  Women do.</p><p><i>3. “Even if he does believe<br> that, does he really want to alienate the women who don’t care for how<br> feminism has lost its way (when it comes to militant feminism, plenty of<br> women just roll their eyes); and women who don’t care for the Left’s<br> and the genre Left’s love affair/apologetics for reactionary Islam?” </br></br></br></br></i></p><p>I don’t wish to alienate them, but I don’t care if I do.  I don’t believe feminism “lost its way”, I believe feminism, in all its forms, however, mild, is an ideology that is observably and materially more evil than Fascism or National Socialism.  If people refuse to read my fiction because they disagree with my politics or my ideology, that is certainly their prerogative.  I don’t care in the slightest so long as they don’t attempt to pronounce judgment upon it without actually reading it.</p><p>I write what I write. Perhaps my blend of traditional high fantasy and modern “realistic” fantasy will prove influential, or perhaps it will not. Most of those who have read it have enjoyed it. Most of those who are negative about it have not.  In the end, a work of fiction must always stand on its own, without the benefit or the disadvantage of its author’s views.</p></div>",
  "content_text": "Season of the Red Wolf fails to note two vital things in his attempt\nto call a pox on both houses\n.  First, I am neither a conservative nor a reactionary.  My positions stand on their own from first principles, they are not formed in reaction to anything. Second, he does not, (and I suspect cannot), make a case against either my position on either gays or women beyond the usual pointing, shrieking, and not bothering to go into details because his position is self-evident:\nAll this brings me to Theodore Beale aka Vox Day, the voice for ‘conservative sanity’ in the Science Fiction genre community. So he thinks. Yes Beale does have on occasion some sensible things to say, about the moral relativist and cultural relativist far Left insanity that pervades the SF genre community, and the odious liberal gate-keeping of the commercial and ‘artistic’ award circus. However Beale is – to put it as politely and diplomatically as possible – not the most reasonable alternative to the status quo. It’s not that he’s a little cranky, or odd, who isn’t in the genre community? Who isn’t period? It’s that his um opinions on women and homosexuality are simply eyebrow raising. There is no other way to put it.\nNow I don’t care for RationalWiki any more than I care for Wiki on controversial issues. RationalWiki’s bias to so-called enlightenment values that are not always such is apparent and in-your-face. It appears to have a clear anti-religious and scientific materialist agenda, an agenda that hews to the liberal status quo across the board, and RationalWiki may well suffer from moral and cultural relativist delusions that Western liberalism suffers from as a whole. I mention this because this is Beale’s page at RationalWiki. However there are some quotes there attributed to Beale – I am talking about what he has to say about women and homosexuality – that make one wonder if they are for real or at least intended to be tongue-in-cheek. Well they are for real and no they are not intended to be sarcastic.\nHere are\nsome of his choice remarks on gays\nfor example.\nI am not going to bother going into details on why the above is just misguided, disturbing and contradictory. Either you see it or you don’t. Homosexuality is “a combination of nature…” and yet it is “a birth defect”. And ‘civilized society’ needs to treat it as such. The path down which this kind of thinking leads is not one I care to go down… Beale appears to be sincere in that he intends no personal malice or hatred to homosexuals – he makes it clear he doesn’t see homosexuality as bad per se. And yet Beale does give comfort and justification to those who are hateful to homosexuals. However Beale may vociferously deny it and not intend it at all. This is why Beale’s self-deceptive thinking on this front is so dangerous and beyond the pale. [PS No I am not gay myself, although I know some people think so]\nOn women in science and well, women, he is arguably misogynistic. And no I don’t take seriously the claims of militant feminists here at all, since the latter have no credibility whatsoever (witness the Malzberg and Resnick witch-hunt after all); but Beale’s more mainstream critics and his own *actual remarks* here speak for themselves (I mean one just needs to quote Beale without comment):\nNow if Beale were just reacting and mocking the idiotic extremes of far Left feminism (and militant feminism in the academy for that matter), and its anti-male prejudice and out-and-out imbecility (as exemplified by the Malzberg-Resnick kerfluffle), I would and do concur. The militant feminists are the flip side of the coin to old-fashioned misogyny and excessive patriarchy in our society. However the problem with Beale is that he appears to go further than that, and his remarks on women as a whole appear to be persistently and consistently troubling, a little over the top.\nThe thing is Beale easily alienates or risks alienating (one assumes) half the genre community with his breezy, negative remarks on the female sex. One would think he would want as many readers as possible, as much support as he could get from SFFWA voters, when everything is rigged against you. Does Beale not realize that there are as likely to be as many genre females who are infuriated with moronic Leftism and its hold on the genre, as males? Or does Beale think that women are disproportionately in favor of selling the political status quo? Even if he does believe that, does he really want to alienate the women who don’t care for how feminism has lost its way (when it comes to militant feminism, plenty of women just roll their eyes); and women who don’t care for the Left’s and the genre Left’s love affair/apologetics for reactionary Islam? Well that’s the message Beale could easily be construed as sending out.\nMore recently Beale has gotten into a spat with N K Jemisin, radical US feminist genre writer over the latter’s controversial speech in Australia (just google it if you can be bothered). One wonders when Jemisin will be visiting Egypt or the Sudan or any nation in the Persian Gulf to let us know about what she thinks of how women and girls are treated there by Sharia law, but as they say when hell freezes over…  Yet Beale’s response to Jemisin  in some parts falls into the same trap, the same mold, they are both reacting off one another with stereotypes, superficial finger-pointing and offensive generalizations that are fallacious. He is reactionary, she is well a far Leftist (enough said).\nAnother thing that I cannot leave out, is that Beale is in bitter dispute with the SFWA given that he accuses the latter of unfair discrimination and negative attacks against Beale’s person at the latter’s (private) forums, and similar issues. Given the snakes’ nest and vile gossipy nature of the SFWA, and the latter’s odious far Left political bent on top of all that; well I’m not on the side of the SFWA here. However I don’t know what has gone on behind the scenes and thus I cannot comment on this with any real knowledge whatsoever, so will leave off. If anybody is so interested, Beale has quite a lot to say about it at his blog.\nThe thing is conservatives who cheer him on either haven’t noticed his uh problematic side, or they don’t care to notice, or they simply share his reactionary tendencies. We have common enemies after all, and you know let’s not look to closely at our embarrassing relatives who are effective leaders and sell lots of books… The enemy of my enemy is my friend, goes the thinking on both sides of the Isle. And this is symptomatic of why there is no hope for conservative SF. And conservatism really. The same lack of concern of prejudice, that infects the Left like a cancer. Misogyny? Yawn. Well depends on how you look at it. Gays shmays. Whatever. The far Left are misogynistic too, horribly so. This is especially the case with far Left feminists, but who knows that? Given liberal militant feminists’ running cover for reactionary Islam (as liberals are wont to do as a whole), and the latter’s in-your-face misogyny; well this shows up a core of  self-loathing, of masochism, of a strong anti-female streak within the militant feminist Movement. The ironies with the Left are beyond compare. That’s a whole other thing, beyond this article’s general scope. Just read the authentic feminist Phyllis Chesler’s Woman’s Inhumanity to Woman and The Death of Feminism. Not that these feminists ever will. None of the Left’s misogyny and the genre Left’s misogyny (that they don’t begin to recognize at all, along with the anti-Semitism) excuse such misogyny if it comes from conservative circles, in and out of the genre community. And so partisans on both sides of the isle will point fingers at the other and close ranks. We have dragons to fight after all, and you can’t make an omelette without breaking some eggs. So it goes. Yeah well count me out.\nIn other words, Gould had no real competition. Although Fordham U prof Paul Levinson has served as president of the SFWA, and Levinson is a political crackpot. I’m sure there are plenty of genre pro writers and wannabe writers who don’t care for the status quo and the business-as-usual approach from Gould, but Beale as the alternative is no viable alternative.\nAnd as I make clear further up, Scalzi is guilty of PC identity politics and its explicit racism, and likewise doesn’t have the tiniest problem whatsoever with extreme Jew-hatred from the genre community. Ditto Scalzi’s successor, Court Jew Steven Gould. So how is Scalzi better than Beale? How is Gould? Other than the fact that Scalzi’s identity politics prejudice and enforcement of deafening silence to Jew-hatred from genre writers is just going along with the zeitgeist of our times; that is the genre Thought Police’s prejudices are respectable prejudices and Beale’s are not. Scalzi (and Gould) aren’t any better than Beale and neither are the formers’ supporters.\nThe thing is though that Beale’s reactionary slant isn’t the way forward, heck by definition reactionary thinking is going back to the past and past mistakes. It’s answering the horrible prejudices of Scalzi and his ilk with Beale’s own neuroses. And it makes no sense to say that Beale’s prejudices are preferable to Scalzi’s or vice versa. Yet Scalzi’s race-baiting has its seal of approval from liberal America, from the White House itself, from a dumb media, the Ivy League. And it’s all branded as anti-racism, anti-prejudice. That’s what makes Scalzi and the genre Thought Police’s prejudices so very scary.\nWhat Season is missing here is that the truth is the truth, regardless of whom it might happen to give “aid and comfort”.  If science makes him uncomfortable because it proves that all humans are not equally homo sapiens sapiens or indicates it will be possible to genetically prevent fetuses from developing into homosexuals, that just means reality makes him uncomfortable, it doesn’t mean that the science doesn’t exist or must be incorrect.\nI am not saying that SF/F should go back and blindly imitate the masters of the past. Who among us can reasonably hope to equate the achievement of Tolkien, let alone surpass it?  But SF/F could do, and is doing, considerably worse than rejecting the lessons and examples set by the classics and embarking on a politically correct course that is neither scientific nor literary.  In fact, if one accepts the definition of art as that which is true to the artist’s feelings, most modern SF/F is manifestly not even artistic, being rife with cowardice, self-deceit, and derivation.\nI don’t pretend to be THE alternative to the status quo, I am merely one alternative to it.  And I would encourage Seasons to read A Throne of Bones before blithely dismissing that alternative; it is as foolish to judge my novels by my blog posts as it is to judge Neil Gaiman’s novels by his choice in female companions.  In answer to his questions:\n1. “Does Beale not realize that there are as likely to be as many genre\nfemales who are infuriated with moronic Leftism and its hold on the\ngenre, as males?”\nI disagree.  That’s simply not true. Such women do exist.  But there are far fewer of them because they observably have not fled the SF/F genre in the same numbers as men.\n2.  “Or does Beale think that women are disproportionately\nin favor of selling the political status quo?”\nYes, I think women disproportionately lean politically left and tend to prefer fiction about romance to fiction about science or ideas.  So, naturally, they are more accepting of the current SF/F status quo than men; men don’t buy novels about necrobestial love triangles in space.  Women do.\n3. “Even if he does believe\nthat, does he really want to alienate the women who don’t care for how\nfeminism has lost its way (when it comes to militant feminism, plenty of\nwomen just roll their eyes); and women who don’t care for the Left’s\nand the genre Left’s love affair/apologetics for reactionary Islam?”\nI don’t wish to alienate them, but I don’t care if I do.  I don’t believe feminism “lost its way”, I believe feminism, in all its forms, however, mild, is an ideology that is observably and materially more evil than Fascism or National Socialism.  If people refuse to read my fiction because they disagree with my politics or my ideology, that is certainly their prerogative.  I don’t care in the slightest so long as they don’t attempt to pronounce judgment upon it without actually reading it.\nI write what I write. Perhaps my blend of traditional high fantasy and modern “realistic” fantasy will prove influential, or perhaps it will not. Most of those who have read it have enjoyed it. Most of those who are negative about it have not.  In the end, a work of fiction must always stand on its own, without the benefit or the disadvantage of its author’s views.",
  "tags": [
    "books",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-26T19:00:00+00:00"
}