{
  "url": "https://voxday.net/2013/07/06/sexual-harassment-and-sfwa/",
  "scraped_at": "2025-12-14T22:34:23.803595",
  "title": "Sexual harassment and SFWA",
  "date_display": "July 6, 2013",
  "date_iso": "2013-07-06T06:00:00+00:00",
  "date_from_url": "2013-07-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I posted the following in the SFWA forums a few days ago and hereby grant myself permission to quote myself:</p><blockquote class=\"tr_bq\"><p> Jerry Pournelle raised the historical example of a friend of his and<br> his eccentric habit of politely, and very directly, inviting women to<br> have sex with him.  Two things became clear in the course of the<br> discussion that followed, which was a) most of the members commenting<br> believed that this single polite invitation constituted sexual<br> harassment, and b) most of those members believed that their position<br> was the popular and mainstream one.  As I suspected that the consensus<br> opinion of the vocal membership on sexual harassment is somewhat out of<br> the mainstream for various reasons, I took a poll of the readers at one<br> of my blogs.</br></br></br></br></br></br></br></br></br></p><p>I first asked for the sex of the reader, then asked the following question, based on the example Jerry cited:  <i>Do<br> you consider it to be sexual harassment when a man asks a woman with<br> whom he is unacquainted, once, politely, and with no physical contact,<br> if she is willing to have sex with him?  </br></br></br></i>I counted most answers with conditions as “YES”.</p><p><b>MEN: </b>121 NO, 13 YES</p><p><b>WOMEN: </b>28 NO, 2 YES</p><p>One woman commented: <i>“I am astonished at how many men are saying<br> yes or trying to qualify the answers with conditions and settings. Most<br> women get propositioned in some way, shape or form (not necessarily the<br> question directly, but jeezly, even innuendo, joking, and waggling<br> eyebrows convey the same question in a different format while leaving an<br> out of “I was just joking!”). You just say no if you are not DTF. It is<br> not a hard set of questions. If you have the victim mentality, which I<br> know some women do, then you will feel threatened by the mere asking.<br> But if you have a shred of backbone, you might be shocked at the<br> forthrightness of the question, but shock is not feeling threatened and<br> “harassed.” Any man or woman who says yes to the second question is an<br> idiot.”</br></br></br></br></br></br></br></br></br></br></br></i></p><p>And one individual took the question to his company’s HR specialist. <i>“It<br> is not, under [state] and Federal law, harassment to ask ONCE. <br> However, if it got to court, it is even money to be ruled sexual<br> harassment if the question happened at work and was unwanted. Full<br> discloser, we have a manager who was sleeping around with his<br> underlings. Nothing happened since he was “good looking” (no law suits).<br> Also had a supervisor buy flowers for another staff member’s birthday.<br> That was viewed as harassment and he was forced out. He was old and fat.</br></br></br></br></br></br></br></i>“</p><p>So, it should be clear that many people outside the organization<br> disagree with the consensus opinion expressed here and that the core of<br> the problem here is that the men one encounters at cons too often tend to<br> violate the unspoken rules of avoiding the commission of sexual harassment:</br></br></br></p><p>1. Be handsome;<br> 2. Be attractive;<br> 3. Don’t be unattractive.</br></br></p><p>Now, one can certainly presume that the male and female readers of my<br> blog are a different subset of humanity than the members here.  I would<br> not dispute that, my objective is merely to point out that the present<br> groupthink here is not necessarily the societal norm and that by<br> attempting to take on the role of SF Sexual Police to the convention<br> world, (at the very least), SFWA is not only stepping far outside its<br> legitimate responsibilities, but will also look completely insane to<br> people who are, to be polite, of different socio-sexual classes than<br> most of the SFWA membership.</br></br></br></br></br></br></br></br></p><p>I am no stranger to sexual harassment.  I was in a successful band on<br> a gay-run music label in my early 20s and I can safely assert that I<br> have been sexually harassed by more men and women than most members<br> here. It can be annoying, and for women I’m sure it can at times feel<br> threatening.  And even so, sexual harassment is still irrelevant to the<br> organization’s primary purpose of helping the members write and publish<br> science fiction and fantasy.  Therefore, it is something that the<br> organization should not make itself look ridiculous in attempting to<br> combat, at SF conventions or anywhere else.</br></br></br></br></br></br></br></br></p></blockquote><p>Needless to say, this lead to a civil, rational, and mutually edifying exchange of views among the professional science fiction writing membership, which was so exceedingly civil that the poor moderator was forced to lock it down barely two hours later.  And while the shambling shoggoths didn’t hesitate to declare their objections to, well, everything, it should nevertheless be readily apparent to all the members of SFWA that their position concerning a single polite but unsolicited invitation amounting to sexual harassment is not necessarily the societal consensus.</p><p>It would seem remarkable that those apparently least likely to receive such invitations appear to be the most terrified of them, until one reflects upon what sort of bottom-feeding omegas are likely to make a pass at a shambler.</p></div>",
  "content_text": "I posted the following in the SFWA forums a few days ago and hereby grant myself permission to quote myself:\nJerry Pournelle raised the historical example of a friend of his and\nhis eccentric habit of politely, and very directly, inviting women to\nhave sex with him.  Two things became clear in the course of the\ndiscussion that followed, which was a) most of the members commenting\nbelieved that this single polite invitation constituted sexual\nharassment, and b) most of those members believed that their position\nwas the popular and mainstream one.  As I suspected that the consensus\nopinion of the vocal membership on sexual harassment is somewhat out of\nthe mainstream for various reasons, I took a poll of the readers at one\nof my blogs.\nI first asked for the sex of the reader, then asked the following question, based on the example Jerry cited:\nDo\nyou consider it to be sexual harassment when a man asks a woman with\nwhom he is unacquainted, once, politely, and with no physical contact,\nif she is willing to have sex with him?\nI counted most answers with conditions as “YES”.\nMEN:\n121 NO, 13 YES\nWOMEN:\n28 NO, 2 YES\nOne woman commented:\n“I am astonished at how many men are saying\nyes or trying to qualify the answers with conditions and settings. Most\nwomen get propositioned in some way, shape or form (not necessarily the\nquestion directly, but jeezly, even innuendo, joking, and waggling\neyebrows convey the same question in a different format while leaving an\nout of “I was just joking!”). You just say no if you are not DTF. It is\nnot a hard set of questions. If you have the victim mentality, which I\nknow some women do, then you will feel threatened by the mere asking.\nBut if you have a shred of backbone, you might be shocked at the\nforthrightness of the question, but shock is not feeling threatened and\n“harassed.” Any man or woman who says yes to the second question is an\nidiot.”\nAnd one individual took the question to his company’s HR specialist.\n“It\nis not, under [state] and Federal law, harassment to ask ONCE.\nHowever, if it got to court, it is even money to be ruled sexual\nharassment if the question happened at work and was unwanted. Full\ndiscloser, we have a manager who was sleeping around with his\nunderlings. Nothing happened since he was “good looking” (no law suits).\nAlso had a supervisor buy flowers for another staff member’s birthday.\nThat was viewed as harassment and he was forced out. He was old and fat.\n“\nSo, it should be clear that many people outside the organization\ndisagree with the consensus opinion expressed here and that the core of\nthe problem here is that the men one encounters at cons too often tend to\nviolate the unspoken rules of avoiding the commission of sexual harassment:\n1. Be handsome;\n2. Be attractive;\n3. Don’t be unattractive.\nNow, one can certainly presume that the male and female readers of my\nblog are a different subset of humanity than the members here.  I would\nnot dispute that, my objective is merely to point out that the present\ngroupthink here is not necessarily the societal norm and that by\nattempting to take on the role of SF Sexual Police to the convention\nworld, (at the very least), SFWA is not only stepping far outside its\nlegitimate responsibilities, but will also look completely insane to\npeople who are, to be polite, of different socio-sexual classes than\nmost of the SFWA membership.\nI am no stranger to sexual harassment.  I was in a successful band on\na gay-run music label in my early 20s and I can safely assert that I\nhave been sexually harassed by more men and women than most members\nhere. It can be annoying, and for women I’m sure it can at times feel\nthreatening.  And even so, sexual harassment is still irrelevant to the\norganization’s primary purpose of helping the members write and publish\nscience fiction and fantasy.  Therefore, it is something that the\norganization should not make itself look ridiculous in attempting to\ncombat, at SF conventions or anywhere else.\nNeedless to say, this lead to a civil, rational, and mutually edifying exchange of views among the professional science fiction writing membership, which was so exceedingly civil that the poor moderator was forced to lock it down barely two hours later.  And while the shambling shoggoths didn’t hesitate to declare their objections to, well, everything, it should nevertheless be readily apparent to all the members of SFWA that their position concerning a single polite but unsolicited invitation amounting to sexual harassment is not necessarily the societal consensus.\nIt would seem remarkable that those apparently least likely to receive such invitations appear to be the most terrified of them, until one reflects upon what sort of bottom-feeding omegas are likely to make a pass at a shambler.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-06T05:00:00+00:00"
}