{
  "url": "https://voxday.net/2013/07/08/the-wrong-question_8/",
  "scraped_at": "2025-12-14T22:34:38.141228",
  "title": "The wrong question",
  "date_display": "July 8, 2013",
  "date_iso": "2013-07-08T17:00:00+00:00",
  "date_from_url": "2013-07-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Horrified by a picture of observable reality with which he was hitherto unfamiliar, ESR asks: <a href=\"http://esr.ibiblio.org/?p=4987\">how can we keep the bigots from winning</a>?</p><blockquote class=\"tr_bq\"><p> I have read very little in the last few decades that is as shocking to me as this: <a href=\"http://www.amren.com/ar/2009/07/index.html\">Essay by a teacher in a black high school</a>. My first reaction was that I wanted to believe it was a bigot’s fabrication.  I’d still like to believe that, but it was <a href=\"http://www.black-and-right.com/2013/07/01/before-its-deleted-of-the-day/\">reposted</a><br> by a black man who claims it is representative of “dirty laundry”: bad<br> stuff [known among blacks] about black folk never to be said around<br> whites.</br></br></br></p><p>My second reaction, afterwards, was: for those of us who insist that<br> people ought to be judged by the content of their characters rather than<br> the color of their skins, what emotionally compelling argument do we<br> have against anti-black racism that reading this doesn’t blow to<br> smithereens?</br></br></br></br></p><p>But if this is really where they came from – if this is what they’re<br> right-end-of-the-bell-curve exceptions to, and that reality becomes<br> widely known or believed – rational argument won’t be enough.  How can<br> we keep the bigots from winning?</br></br></br></p></blockquote><p>That’s not the right<br> question.  ESR is still making false assumptions in ignorance; he still<br> believes “all the rational arguments against racism are still sound”.<br> It is said that one must let reason be silent when experience gainsays<br> its conclusions, so the correct question for the genuinely rational<br> individual is: “what if those we called bigots were right all along?”</br></br></br></br></br></p><p>I<br> have to admit, all this shock and horror from politically correct<br> goodthinkers is more than a little amusing to me.  I linked to <a href=\"http://www.milobookclub.com/2007/05/23/importance-of-college-2/\">a similar post back in 2007</a> and wrote about my own experiences with <a href=\"http://www.milobookclub.com/2011/12/23/cruelty-of-affirmative-action/\">the cruelty of affirmative action</a> in 2011.  And, of course, I was called raciss and bigoted and so on, even though <a href=\"http://www.milobookclub.com/2009/04/12/familial-popery/\">I have been entirely open</a> about the fact that I am, by every political and genetic measure, a bona fide Person of Color.</br></br></p><p>And<br> as such, I can reassure ESR that the facts are simply the facts.  Facts<br> can only be true or false, they cannot be purple, or racist, or<br> ruffled.  They don’t change depending upon whether the individual<br> acknowledging them is white, black, or canine.</br></br></br></br></p></div>",
  "content_text": "Horrified by a picture of observable reality with which he was hitherto unfamiliar, ESR asks:\nhow can we keep the bigots from winning\n?\nI have read very little in the last few decades that is as shocking to me as this:\nEssay by a teacher in a black high school\n. My first reaction was that I wanted to believe it was a bigot’s fabrication.  I’d still like to believe that, but it was\nreposted\nby a black man who claims it is representative of “dirty laundry”: bad\nstuff [known among blacks] about black folk never to be said around\nwhites.\nMy second reaction, afterwards, was: for those of us who insist that\npeople ought to be judged by the content of their characters rather than\nthe color of their skins, what emotionally compelling argument do we\nhave against anti-black racism that reading this doesn’t blow to\nsmithereens?\nBut if this is really where they came from – if this is what they’re\nright-end-of-the-bell-curve exceptions to, and that reality becomes\nwidely known or believed – rational argument won’t be enough.  How can\nwe keep the bigots from winning?\nThat’s not the right\nquestion.  ESR is still making false assumptions in ignorance; he still\nbelieves “all the rational arguments against racism are still sound”.\nIt is said that one must let reason be silent when experience gainsays\nits conclusions, so the correct question for the genuinely rational\nindividual is: “what if those we called bigots were right all along?”\nI\nhave to admit, all this shock and horror from politically correct\ngoodthinkers is more than a little amusing to me.  I linked to\na similar post back in 2007\nand wrote about my own experiences with\nthe cruelty of affirmative action\nin 2011.  And, of course, I was called raciss and bigoted and so on, even though\nI have been entirely open\nabout the fact that I am, by every political and genetic measure, a bona fide Person of Color.\nAnd\nas such, I can reassure ESR that the facts are simply the facts.  Facts\ncan only be true or false, they cannot be purple, or racist, or\nruffled.  They don’t change depending upon whether the individual\nacknowledging them is white, black, or canine.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-08T16:00:00+00:00"
}