{
  "url": "https://voxday.net/2013/07/07/the-harrowing-of-holy-see/",
  "scraped_at": "2025-12-14T22:34:31.157669",
  "title": "The Harrowing of the Holy See",
  "date_display": "July 7, 2013",
  "date_iso": "2013-07-07T13:00:00+00:00",
  "date_from_url": "2013-07-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Pope Francis takes on <a href=\"http://www.guardian.co.uk/world/2013/jun/30/pope-gay-lobby-vatican-gossip\">the Lavender Lobby</a>: </p><blockquote class=\"tr_bq\"><p> A tide of lurid speculation, questionable accusations and possible blackmail attempts is buffeting the <a href=\"http://www.guardian.co.uk/world/vatican\" title=\"More from guardian.co.uk on Vatican\">Vatican</a> following <a href=\"http://www.guardian.co.uk/world/pope-francis\" title=\"More from guardian.co.uk on Pope Francis\">Pope Francis</a>‘s claim that he is preparing to tackle a gay lobby secretly at work behind the Holy See’s walls.</p><p>The new pope’s private <a href=\"http://www.guardian.co.uk/world/2013/jun/12/reports-pope-gay-prelate-network\" title=\"\">comments to a group of visiting South American churchmen</a>,<br> which caused a sensation when they appeared on a religious website last<br> week, prompted blushes in the Vatican and unleashed feverish gossip in<br> Rome regarding the contents of a report on Vatican infighting prepared<br> last year for Francis’s predecessor, Joseph Ratzinger.</br></br></br></br></p><p>On his<br> retirement in February, Ratzinger handed his Argentine successor the<br> dossier, which reportedly describes a lobby of gay, senior churchmen<br> inside the Vatican, running a network of patronage while fighting off<br> blackmailers. The pope’s unguarded remarks, which appeared to<br> confirm the speculation, have fuelled a new round of accusations,<br> beginning with a convicted paedophile priest, Father Patrizio Poggi, who<br> last week named nine fellow prelates in Rome as part of a secret band<br> who used a police officer to supply them with eastern European rent<br> boys.</br></br></br></br></br></br></br></br></br></p></blockquote><p>It’s long been rumored in Italian Catholic circles that the Catholic hierarchy, and the Vatican itself, have been infested with homosexuals and secret Satanists since before Vatican II.  Many believed that while the Pope Emeritus’s resignation was to permit the next pope to take on that lobby, Cardinal Bergoglio was not his chosen successor for the task.  And there are certainly some Catholics, like <a href=\"http://barnhardt.biz/\">Ann Barnhardt</a>, who has reservations about Pope Francis’s ability to do what his predecessor could not:</p><blockquote class=\"tr_bq\"><p> Here’s the deal. Pope Francis, while the Vicar of Christ gloriously reigning, is not a terribly bright man. What brings Jorge Maria Bergoglio’s intellectual shortcomings into even starker relief is the fact that his predecessor, Benedict XVI Ratzinger is not only a bona fide genius, but also … still alive. Francis is a mediocre intellect, poorly educated, and a member of an order (the Jesuits) that is so far gone that it should be suppressed. Layer on top of this the generation of which Francis is a product: perhaps the most godless, evil, blind generation in human history, and add in the fact that while being poorly educated in the age of the hippy, he has also lived his entire life in South America, which has been more steadily and overtly influenced by Marxism, both in the secular world as well as in the Church, than either Europe or North America over the last fifty years.</p><p>Jorge Maria Bergoglio is the first “affirmative action” pope – which is a different thing entirely from nepotism. The College of Cardinals, again, not exactly a collection of the smartest men in the world – remember Tracksuit Timmy Dolan, dinner host of antichrists and celebrant of “gay” Masses, a man whose capacity for intellectual nuance is on par with a box of hair, is not only a cardinal, but the head of the U.S. Bishop’s conference – went into the conclave wanting to elect not the best man, not the brightest intellect, not the most competent manager. No. The criteria were racial and geographical. “Um, we need to have a pope from the Western Hemisphere. We need to have a pope from a Spanish-speaking country. We need to make the Latinos feel good and keep the Latino money flowing, because they are the only ones not contracepting themselves into extinction.”</p><p>And, if this culture of stupidity persists, then mark my words: they will elect a black African next time for no other reason than “affirmative action”.</p><p>Now, back to Francis’ sermonettes, and defending the press. There is a tremendous uproar on the internet with people cursing the Vatican Press Office for not releasing the full transcripts of Francis’ sermonettes but instead only piecemeal summaries consisting of brief quotes from Francis with press-written prose between the quotes to give context. “Give us the full transcripts!”</p><p>The reason they aren’t releasing the full transcripts is because Francis’ sermonettes are so rambling, so incoherent and sometimes so embarrassing in their delivery (verbal ticks like, “eh?” and “right?”) that the Vatican Press Office is trying to protect both Francis and the dignity of the Holy See by taking Francis’ stream-of-consciousness rhetorical sausage and presenting it as something that could maybe pass as steak.</p></blockquote><p>On the other hand, intellectual genius and superlative rhetorical skill are no substitute for a determination and a willingness to give the necessary orders.  So, I suppose we shall have to wait and see.</p></div>",
  "content_text": "Pope Francis takes on\nthe Lavender Lobby\n:\nA tide of lurid speculation, questionable accusations and possible blackmail attempts is buffeting the\nVatican\nfollowing\nPope Francis\n‘s claim that he is preparing to tackle a gay lobby secretly at work behind the Holy See’s walls.\nThe new pope’s private\ncomments to a group of visiting South American churchmen\n,\nwhich caused a sensation when they appeared on a religious website last\nweek, prompted blushes in the Vatican and unleashed feverish gossip in\nRome regarding the contents of a report on Vatican infighting prepared\nlast year for Francis’s predecessor, Joseph Ratzinger.\nOn his\nretirement in February, Ratzinger handed his Argentine successor the\ndossier, which reportedly describes a lobby of gay, senior churchmen\ninside the Vatican, running a network of patronage while fighting off\nblackmailers. The pope’s unguarded remarks, which appeared to\nconfirm the speculation, have fuelled a new round of accusations,\nbeginning with a convicted paedophile priest, Father Patrizio Poggi, who\nlast week named nine fellow prelates in Rome as part of a secret band\nwho used a police officer to supply them with eastern European rent\nboys.\nIt’s long been rumored in Italian Catholic circles that the Catholic hierarchy, and the Vatican itself, have been infested with homosexuals and secret Satanists since before Vatican II.  Many believed that while the Pope Emeritus’s resignation was to permit the next pope to take on that lobby, Cardinal Bergoglio was not his chosen successor for the task.  And there are certainly some Catholics, like\nAnn Barnhardt\n, who has reservations about Pope Francis’s ability to do what his predecessor could not:\nHere’s the deal. Pope Francis, while the Vicar of Christ gloriously reigning, is not a terribly bright man. What brings Jorge Maria Bergoglio’s intellectual shortcomings into even starker relief is the fact that his predecessor, Benedict XVI Ratzinger is not only a bona fide genius, but also … still alive. Francis is a mediocre intellect, poorly educated, and a member of an order (the Jesuits) that is so far gone that it should be suppressed. Layer on top of this the generation of which Francis is a product: perhaps the most godless, evil, blind generation in human history, and add in the fact that while being poorly educated in the age of the hippy, he has also lived his entire life in South America, which has been more steadily and overtly influenced by Marxism, both in the secular world as well as in the Church, than either Europe or North America over the last fifty years.\nJorge Maria Bergoglio is the first “affirmative action” pope – which is a different thing entirely from nepotism. The College of Cardinals, again, not exactly a collection of the smartest men in the world – remember Tracksuit Timmy Dolan, dinner host of antichrists and celebrant of “gay” Masses, a man whose capacity for intellectual nuance is on par with a box of hair, is not only a cardinal, but the head of the U.S. Bishop’s conference – went into the conclave wanting to elect not the best man, not the brightest intellect, not the most competent manager. No. The criteria were racial and geographical. “Um, we need to have a pope from the Western Hemisphere. We need to have a pope from a Spanish-speaking country. We need to make the Latinos feel good and keep the Latino money flowing, because they are the only ones not contracepting themselves into extinction.”\nAnd, if this culture of stupidity persists, then mark my words: they will elect a black African next time for no other reason than “affirmative action”.\nNow, back to Francis’ sermonettes, and defending the press. There is a tremendous uproar on the internet with people cursing the Vatican Press Office for not releasing the full transcripts of Francis’ sermonettes but instead only piecemeal summaries consisting of brief quotes from Francis with press-written prose between the quotes to give context. “Give us the full transcripts!”\nThe reason they aren’t releasing the full transcripts is because Francis’ sermonettes are so rambling, so incoherent and sometimes so embarrassing in their delivery (verbal ticks like, “eh?” and “right?”) that the Vatican Press Office is trying to protect both Francis and the dignity of the Holy See by taking Francis’ stream-of-consciousness rhetorical sausage and presenting it as something that could maybe pass as steak.\nOn the other hand, intellectual genius and superlative rhetorical skill are no substitute for a determination and a willingness to give the necessary orders.  So, I suppose we shall have to wait and see.",
  "tags": [
    "Christianity",
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-07T12:00:00+00:00"
}