{
  "url": "https://voxday.net/2013/07/17/the-map-is-still-not-territory/",
  "scraped_at": "2025-12-14T22:35:42.196604",
  "title": "The map is still not the territory",
  "date_display": "July 17, 2013",
  "date_iso": "2013-07-17T08:34:00+00:00",
  "date_from_url": "2013-07-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Notice how <a href=\"http://www.nytimes.com/2013/07/03/world/asia/myanmars-muslim-minority-confronts-fear-and-mistrust.html?pagewanted=2&amp;_r=0&amp;hp\">the New York Times is always afraid for Muslims</a> in non-Muslim countries, while remaining mostly indifferent to the plight of non-Muslims in Muslim countries:</p><blockquote class=\"tr_bq\"><p> After decades of peaceful coexistence with the Buddhist majority in the<br> country, Muslims say they now constantly fear the next attack. Over the<br> past year, they say several violent episodes across the country led by<br> rampaging Buddhist mobs have taught them that if violence comes to their<br> neighborhood, they are on their own. “I don’t think the police will protect us,” Mr. Nyi Nyi said.</br></br></br></br></p><p>The neighborhood watch program, a motley corps of men who check for any<br> suspicious outsiders and keep wooden clubs and metal rods stashed<br> nearby, is a symbol of how much relations have deteriorated between<br> Buddhists and Muslims in Myanmar, formerly known as Burma.</br></br></br></p><p>About 90 percent of the country’s population of 55 million is Buddhist, with Muslims making up 4 to 8 percent… The root of the violence, which has left around 200 Muslims dead over<br> the past year, appears partly a legacy of colonial years when Indians,<br> many of them Muslims, arrived in the country as civil servants and<br> soldiers, stirring resentment among Burmese Buddhists. In recent months<br> radical monks have since built on those historic grievances, fanning<br> fears that Muslims are having more children than Buddhists and could<br> dilute the country’s Buddhist character….</br></br></br></br></br></br></p><p>Some Muslims with means have fled to Malaysia or Singapore. Muslim-owned<br> businesses are losing Buddhist customers. A growing Buddhist movement<br> known as 969 that has the blessing of some of the country’s leaders is<br> campaigning for a boycott of Muslim products and businesses and a ban on<br> interfaith marriages.</br></br></br></br></p></blockquote><p>I imagine the Burmese people have remembered what Americans and Europeans have forgotten. They have observed the examples of Nigeria, Paris, and Londonistan. They have learned the lesson: the Paynim always comes to conquer, however humbly he may enter.</p><p><i>“The suggestion that Muslims leave the country has been a common refrain<br> during the violence, which bewilders many Muslims who have always<br> considered themselves Burmese. Mr. Khin Maung Htay, his father and his<br> grandfather were all born in Myanmar.”</br></br></br></i></p><p>What of it? This merely shows the intrinsic falsehood of the multicultural mantra, which is that nationality is determined by government bureaucracy and geographic location.  After three generations Mr. Khin Maung Htay is not considered to be Burmese by the Burmese people because the map is not the territory and there is far more to cultural integration than filling out the necessary paperwork.</p><div itemprop=\"articleBody\"></div></div>",
  "content_text": "Notice how\nthe New York Times is always afraid for Muslims\nin non-Muslim countries, while remaining mostly indifferent to the plight of non-Muslims in Muslim countries:\nAfter decades of peaceful coexistence with the Buddhist majority in the\ncountry, Muslims say they now constantly fear the next attack. Over the\npast year, they say several violent episodes across the country led by\nrampaging Buddhist mobs have taught them that if violence comes to their\nneighborhood, they are on their own. “I don’t think the police will protect us,” Mr. Nyi Nyi said.\nThe neighborhood watch program, a motley corps of men who check for any\nsuspicious outsiders and keep wooden clubs and metal rods stashed\nnearby, is a symbol of how much relations have deteriorated between\nBuddhists and Muslims in Myanmar, formerly known as Burma.\nAbout 90 percent of the country’s population of 55 million is Buddhist, with Muslims making up 4 to 8 percent… The root of the violence, which has left around 200 Muslims dead over\nthe past year, appears partly a legacy of colonial years when Indians,\nmany of them Muslims, arrived in the country as civil servants and\nsoldiers, stirring resentment among Burmese Buddhists. In recent months\nradical monks have since built on those historic grievances, fanning\nfears that Muslims are having more children than Buddhists and could\ndilute the country’s Buddhist character….\nSome Muslims with means have fled to Malaysia or Singapore. Muslim-owned\nbusinesses are losing Buddhist customers. A growing Buddhist movement\nknown as 969 that has the blessing of some of the country’s leaders is\ncampaigning for a boycott of Muslim products and businesses and a ban on\ninterfaith marriages.\nI imagine the Burmese people have remembered what Americans and Europeans have forgotten. They have observed the examples of Nigeria, Paris, and Londonistan. They have learned the lesson: the Paynim always comes to conquer, however humbly he may enter.\n“The suggestion that Muslims leave the country has been a common refrain\nduring the violence, which bewilders many Muslims who have always\nconsidered themselves Burmese. Mr. Khin Maung Htay, his father and his\ngrandfather were all born in Myanmar.”\nWhat of it? This merely shows the intrinsic falsehood of the multicultural mantra, which is that nationality is determined by government bureaucracy and geographic location.  After three generations Mr. Khin Maung Htay is not considered to be Burmese by the Burmese people because the map is not the territory and there is far more to cultural integration than filling out the necessary paperwork.",
  "tags": [
    "immigration",
    "religion"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-17T07:34:00+00:00"
}