{
  "url": "https://voxday.net/2013/07/25/the-blue-rot_25/",
  "scraped_at": "2025-12-14T22:36:36.754780",
  "title": "The blue rot",
  "date_display": "July 25, 2013",
  "date_iso": "2013-07-25T13:00:00+00:00",
  "date_from_url": "2013-07-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not “a few bad apples”. The American police are systematically corrupt and the few good men in the force<a href=\"http://reason.com/reasontv/2013/07/24/how-quotas-pervert-police-priorities-fir\"> are fired</a> whenever they speak out against the blue rot:</p><blockquote class=\"tr_bq\"><p> After the arrival of a new police<br> chief in 2010, the department entered an era of ticket quotas and<br> worse. “When I first heard about the quotas I was appalled,” says<br> former Auburn police officer Justin Hanners, who claims he and<br> other cops were given directives to hassle, ticket, or arrest<br> specific numbers of residents per shift. “I got into law<br> enforcement to serve and protect, not be a bully.”</br></br></br></br></br></br></p><p>Hanners blew the whistle on the department’s tactics and was<br> eventually fired for refusing to comply and keep quiet. He says<br> that each officer was required to make 100 contacts each month,<br> which included tickets, arrests, field interviews, and warnings.<br> This equates to 72,000 contacts a year in a 50,000 person town. His<br> claims are backed up by audio recordings of his superiors he made.</br></br></br></br></br></p></blockquote><p>Do you want to know where the good men on the police force are?  They are “fired for refusing to comply and keep quiet”.  As Radley Balko says: “You have a policy that encourages police to create petty crimes<br> and ignore serious crimes.”</br></p></div>",
  "content_text": "It’s not “a few bad apples”. The American police are systematically corrupt and the few good men in the force\nare fired\nwhenever they speak out against the blue rot:\nAfter the arrival of a new police\nchief in 2010, the department entered an era of ticket quotas and\nworse. “When I first heard about the quotas I was appalled,” says\nformer Auburn police officer Justin Hanners, who claims he and\nother cops were given directives to hassle, ticket, or arrest\nspecific numbers of residents per shift. “I got into law\nenforcement to serve and protect, not be a bully.”\nHanners blew the whistle on the department’s tactics and was\neventually fired for refusing to comply and keep quiet. He says\nthat each officer was required to make 100 contacts each month,\nwhich included tickets, arrests, field interviews, and warnings.\nThis equates to 72,000 contacts a year in a 50,000 person town. His\nclaims are backed up by audio recordings of his superiors he made.\nDo you want to know where the good men on the police force are?  They are “fired for refusing to comply and keep quiet”.  As Radley Balko says: “You have a policy that encourages police to create petty crimes\nand ignore serious crimes.”",
  "tags": [
    "NWA was right"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-25T12:00:00+00:00"
}