{
  "url": "https://voxday.net/2013/07/26/the-necessity-of-limiting-free-speec/",
  "scraped_at": "2025-12-14T22:36:40.433953",
  "title": "The “necessity” of limiting free speech",
  "date_display": "July 26, 2013",
  "date_iso": "2013-07-26T08:58:00+00:00",
  "date_from_url": "2013-07-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Well, I did warn you this sort of thing wasn’t limited to the SFWA, after all.  What a pity it didn’t occur to conservatives a few decades ago that all the free speech they found unpalatable could simply <a href=\"http://www.alternet.org/civil-liberties/case-censoring-hate-speech?page=0%2C1\">be limited out of “necessity”</a>.</p><blockquote class=\"tr_bq\"><p> For the past few years speech has moved online, leading to fierce<br> debates about its regulation. Most recently, feminists have led the<br> charge to purge Facebook of misogyny that clearly violates its hate<br> speech code. Facebook took a small step two weeks ago, creating a<br> feature that will remove ads from pages deemed “controversial.” But such<br> a move is half-hearted; Facebook and other social networking websites<br> should not tolerate hate speech and, in the absence of a government<br> mandate, adopt a European model of expunging offensive material.<br/></br></br></br></br></br></br></br></p><div></div><p>Stricter regulation of Internet speech will not be popular with the<br> libertarian-minded citizens of the United States, but it’s necessary….</br></p><p>American free speech jurisprudence relies upon the assumption that<br> speech is merely the extension of a thought, and not an action. If we<br> consider it an action, then saying that we should combat hate speech<br> with more positive speech is an absurd proposition; the speech has<br> already done the harm, and no amount of support will defray the victim’s<br> impression that they are not truly secure in this society. We don’t<br> simply tell the victim of a robbery, “Hey, it’s okay, there are lots of<br> other people who aren’t going to rob you.” Similarly, it isn’t<br> incredibly useful to tell someone who has just had their<br> race/gender/sexuality defamed, “There are a lot of other nice people out<br> there.” </br></br></br></br></br></br></br></br></br></br></p></blockquote><p>Of course, under this logic, if the law simply considers being black, or Jewish, or homosexual an action, then such actions can be criminalized.  After all, “to be” is a verb, and verbs denote action, so therefore there is no justification for not criminalizing anyone who happens to be anything considered undesirable by the majority.  And since when is an “impression that [one is] truly secure in this society” the basis for Constitutional jurisprudence?</p><p>As this reasoning shows, progressives are not merely short-sighted, they are downright delusional.  This is pure rhetoric presented as dialectic; at absolutely no point does the argument hold up to even a cursory rational analysis.</p><p>Needless to say, if imposed impartially, such a standard would affect the groups claiming to need protection more than anyone, as many of them regularly engage in the group libel of men, whites, and the religious.  The assault on free speech is just another faux equalitarian stalking horse.</p></div>",
  "content_text": "Well, I did warn you this sort of thing wasn’t limited to the SFWA, after all.  What a pity it didn’t occur to conservatives a few decades ago that all the free speech they found unpalatable could simply\nbe limited out of “necessity”\n.\nFor the past few years speech has moved online, leading to fierce\ndebates about its regulation. Most recently, feminists have led the\ncharge to purge Facebook of misogyny that clearly violates its hate\nspeech code. Facebook took a small step two weeks ago, creating a\nfeature that will remove ads from pages deemed “controversial.” But such\na move is half-hearted; Facebook and other social networking websites\nshould not tolerate hate speech and, in the absence of a government\nmandate, adopt a European model of expunging offensive material.\nStricter regulation of Internet speech will not be popular with the\nlibertarian-minded citizens of the United States, but it’s necessary….\nAmerican free speech jurisprudence relies upon the assumption that\nspeech is merely the extension of a thought, and not an action. If we\nconsider it an action, then saying that we should combat hate speech\nwith more positive speech is an absurd proposition; the speech has\nalready done the harm, and no amount of support will defray the victim’s\nimpression that they are not truly secure in this society. We don’t\nsimply tell the victim of a robbery, “Hey, it’s okay, there are lots of\nother people who aren’t going to rob you.” Similarly, it isn’t\nincredibly useful to tell someone who has just had their\nrace/gender/sexuality defamed, “There are a lot of other nice people out\nthere.”\nOf course, under this logic, if the law simply considers being black, or Jewish, or homosexual an action, then such actions can be criminalized.  After all, “to be” is a verb, and verbs denote action, so therefore there is no justification for not criminalizing anyone who happens to be anything considered undesirable by the majority.  And since when is an “impression that [one is] truly secure in this society” the basis for Constitutional jurisprudence?\nAs this reasoning shows, progressives are not merely short-sighted, they are downright delusional.  This is pure rhetoric presented as dialectic; at absolutely no point does the argument hold up to even a cursory rational analysis.\nNeedless to say, if imposed impartially, such a standard would affect the groups claiming to need protection more than anyone, as many of them regularly engage in the group libel of men, whites, and the religious.  The assault on free speech is just another faux equalitarian stalking horse.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-26T07:58:00+00:00"
}