{
  "url": "https://voxday.net/2013/07/09/the-biggest-bubble/",
  "scraped_at": "2025-12-14T22:34:45.426416",
  "title": "The biggest bubble",
  "date_display": "July 9, 2013",
  "date_iso": "2013-07-09T17:00:00+00:00",
  "date_from_url": "2013-07-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Arguably today’s most important economist, Steve Keen, writes about <a href=\"http://www.zerohedge.com/news/2013-07-07/guest-post-bubble-so-big-we-cant-even-see-it\">the biggest bubble of them all</a> on Zerohedge</p><blockquote class=\"tr_bq\"><p> <a href=\"http://www.zerohedge.com/sites/default/files/images/user3303/imageroot/2013/07/20130707_keen4.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"227\" src=\"http://www.zerohedge.com/sites/default/files/images/user3303/imageroot/2013/07/20130707_keen4.jpg\" width=\"320\"/></a>Let’s start by taking a closer look at the data than Alan [Greenpan] did. There are a number of surprises when one does – even for me. Frankly, I did <i>not </i>expect<br> to see some of the results I show here: as I used to frequently tell my<br> students before the financial crisis began, I wouldn’t dare make up the<br> numbers I found in the actual data. That theme continues with margin<br> debt for the USA, which I’ve only just located (I expected it to be in<br> the Federal Reserve Flow of Funds, and it wasn’t – instead it’s recorded<br> by the New York Stock Exchange). The first surprise came when comparing the S&amp;P500 to the<br> Consumer Price Index over the last century – since what really tells you<br> whether the stock market is “performing well” is not just whether it’s<br> rising, but whether it’s rising faster than consumer prices. Figure 1 shows the S&amp;P500 and the US CPI from the same common date-1890—until today. In contrast to house prices, there are good reasons to expect stock<br> prices to rise faster than consumer prices (two of which are the<br> reinvestment of retained earnings, and the existence of firms like<br> Microsoft and Berkshire Hathaway that don’t pay dividends at all). I<br> therefore expected to see a sustained divergence over time, with of<br> course periods of booms and crashes in stock prices.</br></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p>That wasn’t what the data revealed at all. Instead, <b>there was<br> a period from 1890 till 1950 where there was no sustained divergence,<br> while almost all of the growth of share prices relative to consumer<br> prices appeared to have occurred since 1980</br></br></br></b>. Figure 2<br> illustrates this by showing the ratio of the S&amp;P500 to the CPI –<br> starting from 1890 when the ratio is set to 1. The result shocked me –<br> even though I’m a dyed in the wool cynic about the stock market. The<br> divergence between stock prices and consumer prices, which virtually<br> everyone (me included) has come to regard as the normal state of<br> affairs, began in earnest only in 1982.</br></br></br></br></br></br></p><p>Until then, apart from a couple of little bubbles in stock prices in<br> 1929 (yes I’m being somewhat ironic, but take a look at the chart!) and<br> 1966, there had been precious little real divergence between stock<br> prices and consumer prices.</br></br></br></p><p>My causal argument commences from my definition of aggregate demand<br> as being the sum of GDP plus the change in debt—a concept that at<br> present only heretics like myself, Michael Hudson, Dirk Bezemer and<br> Richard Werner assert, but which I hope will become mainstream one day.<br> Matched to this is a redefinition of supply to include not only goods<br> and services but also turnover on asset markets.<b> This implies a causal link between the rate of change of debt<br> and the level of asset prices, and therefore between the acceleration<br> of debt and the rate of change of asset prices—but not one between the<br> level of debt and the level of asset prices</br></br></br></b>. Nonetheless there<br> is one in the US data, and it’s a doozy: the correlation between the<br> level of margin debt and the level of the Dow Jones is 0.945.<b> </b></br></br></br></br></br></br></br></p></blockquote><p>For those who didn’t follow, what Keen is saying is that the stock market has been one giant debt-inflated bubble since 1980.  And it means that when the change of debt goes negative, asset prices are going to contract at a speed proportional to the rate of the debt contraction.  This, of course, is why the Fed has been pumping so desperately for five years, and also why it was always doomed to eventual failure.</p><p>What I find particularly significant is that Keen has reached a very similar conclusion about the stock market that Karl Denninger and I both independently reached about the economy through a different approach, which involved calculating the dollar amount of debt required to buy one dollar of economic growth.  By any of our three methods, it readily becomes apparent that there has been no genuine economic growth in the USA since 1980, give or take a year.</p><p>That sense of national decline that most Americans sense isn’t an illusion, rather, it is the idea that the US economy has expanded in any material manner over the last 30 years that is the illusion.  It is actually a debt-funded mass delusion that is no more substantial than drug-fueled hallucinations.</p></div>",
  "content_text": "Arguably today’s most important economist, Steve Keen, writes about\nthe biggest bubble of them all\non Zerohedge\nLet’s start by taking a closer look at the data than Alan [Greenpan] did. There are a number of surprises when one does – even for me. Frankly, I did\nnot\nexpect\nto see some of the results I show here: as I used to frequently tell my\nstudents before the financial crisis began, I wouldn’t dare make up the\nnumbers I found in the actual data. That theme continues with margin\ndebt for the USA, which I’ve only just located (I expected it to be in\nthe Federal Reserve Flow of Funds, and it wasn’t – instead it’s recorded\nby the New York Stock Exchange). The first surprise came when comparing the S&P500 to the\nConsumer Price Index over the last century – since what really tells you\nwhether the stock market is “performing well” is not just whether it’s\nrising, but whether it’s rising faster than consumer prices. Figure 1 shows the S&P500 and the US CPI from the same common date-1890—until today. In contrast to house prices, there are good reasons to expect stock\nprices to rise faster than consumer prices (two of which are the\nreinvestment of retained earnings, and the existence of firms like\nMicrosoft and Berkshire Hathaway that don’t pay dividends at all). I\ntherefore expected to see a sustained divergence over time, with of\ncourse periods of booms and crashes in stock prices.\nThat wasn’t what the data revealed at all. Instead,\nthere was\na period from 1890 till 1950 where there was no sustained divergence,\nwhile almost all of the growth of share prices relative to consumer\nprices appeared to have occurred since 1980\n. Figure 2\nillustrates this by showing the ratio of the S&P500 to the CPI –\nstarting from 1890 when the ratio is set to 1. The result shocked me –\neven though I’m a dyed in the wool cynic about the stock market. The\ndivergence between stock prices and consumer prices, which virtually\neveryone (me included) has come to regard as the normal state of\naffairs, began in earnest only in 1982.\nUntil then, apart from a couple of little bubbles in stock prices in\n1929 (yes I’m being somewhat ironic, but take a look at the chart!) and\n1966, there had been precious little real divergence between stock\nprices and consumer prices.\nMy causal argument commences from my definition of aggregate demand\nas being the sum of GDP plus the change in debt—a concept that at\npresent only heretics like myself, Michael Hudson, Dirk Bezemer and\nRichard Werner assert, but which I hope will become mainstream one day.\nMatched to this is a redefinition of supply to include not only goods\nand services but also turnover on asset markets.\nThis implies a causal link between the rate of change of debt\nand the level of asset prices, and therefore between the acceleration\nof debt and the rate of change of asset prices—but not one between the\nlevel of debt and the level of asset prices\n. Nonetheless there\nis one in the US data, and it’s a doozy: the correlation between the\nlevel of margin debt and the level of the Dow Jones is 0.945.\nFor those who didn’t follow, what Keen is saying is that the stock market has been one giant debt-inflated bubble since 1980.  And it means that when the change of debt goes negative, asset prices are going to contract at a speed proportional to the rate of the debt contraction.  This, of course, is why the Fed has been pumping so desperately for five years, and also why it was always doomed to eventual failure.\nWhat I find particularly significant is that Keen has reached a very similar conclusion about the stock market that Karl Denninger and I both independently reached about the economy through a different approach, which involved calculating the dollar amount of debt required to buy one dollar of economic growth.  By any of our three methods, it readily becomes apparent that there has been no genuine economic growth in the USA since 1980, give or take a year.\nThat sense of national decline that most Americans sense isn’t an illusion, rather, it is the idea that the US economy has expanded in any material manner over the last 30 years that is the illusion.  It is actually a debt-funded mass delusion that is no more substantial than drug-fueled hallucinations.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-09T16:00:00+00:00"
}