{
  "url": "https://voxday.net/2013/07/03/the-usg-attack-on-sovereignty/",
  "scraped_at": "2025-12-14T22:34:03.941826",
  "title": "The USG attack on sovereignty",
  "date_display": "July 3, 2013",
  "date_iso": "2013-07-03T10:30:00+00:00",
  "date_from_url": "2013-07-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> Zerohedge reports that due to USG pressure, France, Portugal, Italy, and Spain are all <a href=\"http://www.zerohedge.com/news/2013-07-02/airplane-bolivian-president-denied-passage-over-french-portuguese-airspace-due-snowd\">interfering with the flight path of Bolivian president’s plane</a>, forcing it to land in Vienna:</p><blockquote class=\"tr_bq\"><p> <i></i>Moments ago a rather surreal episode of international diplomacy, or<br> rather lack thereof, took place when the airplane of Bolivian President<br> Evo Morales was forced to land in Austria over suspicions that NSA<br> whistleblower Edward Snowden was on board, a claim Bolivian authorities<br> denied. The reason: France and Portugal reportedly refused to allow the<br> flight to cross their airspace due to concerns that Snowden may have<br> been aboard the plane. It is what international law allows countries to<br> deny their airspace to presidents of sovereign countries, when the only<br> transgression is unproven speculation of harboring a whistleblower.</br></br></br></br></br></br></br></br></p><p>Of<br> course, with both insolvent countries bent over and in dire need of some<br> all too precious Uncle Sam liquidity, we can see how they would do<br> anything and everything to gain some favor with Obama.</br></br></br></p><p><i>Update: </i>Italy and Spain have also been confirmed as states<br> that refused passage above their airspace to Bolivia’s Morales on<br> suspicions of harboring a patriot.</br></br></p></blockquote><p>It would appear that all the NSA spying on European leaders has produced a useful quantity of dirt on them.  And also that the hunt for Snowden is a little more critical than the administration would have the public believe.</p><p>UPDATE: <i>“Morales’ plane was stranded at Vienna airport<br> for several hours after Portugal and France abruptly canceled air<br> permits for it to fly through their airspace, but eventually resumed its<br> flight home form an energy meeting in Moscow. Austria found no sign of Snowden on board.” </br></br></br></i></p><p>UPDATE II: <i>“Bolivia’s ambassador to the United Nations, speaking in Geneva<br> Wednesday, continued to insist that several European countries had<br> refused permission for the plane to fly in their airspace. Sacha Llorenti said it was an “act of aggression” and that France, Portugal, Spain and Italy violated international law. Llorenti<br> said “the orders came from the United States” but other nations<br> violated the immunity of the president and his plane, putting his life<br> at risk.”</br></br></br></br></br></i></p></div>",
  "content_text": "Zerohedge reports that due to USG pressure, France, Portugal, Italy, and Spain are all\ninterfering with the flight path of Bolivian president’s plane\n, forcing it to land in Vienna:\nMoments ago a rather surreal episode of international diplomacy, or\nrather lack thereof, took place when the airplane of Bolivian President\nEvo Morales was forced to land in Austria over suspicions that NSA\nwhistleblower Edward Snowden was on board, a claim Bolivian authorities\ndenied. The reason: France and Portugal reportedly refused to allow the\nflight to cross their airspace due to concerns that Snowden may have\nbeen aboard the plane. It is what international law allows countries to\ndeny their airspace to presidents of sovereign countries, when the only\ntransgression is unproven speculation of harboring a whistleblower.\nOf\ncourse, with both insolvent countries bent over and in dire need of some\nall too precious Uncle Sam liquidity, we can see how they would do\nanything and everything to gain some favor with Obama.\nUpdate:\nItaly and Spain have also been confirmed as states\nthat refused passage above their airspace to Bolivia’s Morales on\nsuspicions of harboring a patriot.\nIt would appear that all the NSA spying on European leaders has produced a useful quantity of dirt on them.  And also that the hunt for Snowden is a little more critical than the administration would have the public believe.\nUPDATE:\n“Morales’ plane was stranded at Vienna airport\nfor several hours after Portugal and France abruptly canceled air\npermits for it to fly through their airspace, but eventually resumed its\nflight home form an energy meeting in Moscow. Austria found no sign of Snowden on board.”\nUPDATE II:\n“Bolivia’s ambassador to the United Nations, speaking in Geneva\nWednesday, continued to insist that several European countries had\nrefused permission for the plane to fly in their airspace. Sacha Llorenti said it was an “act of aggression” and that France, Portugal, Spain and Italy violated international law. Llorenti\nsaid “the orders came from the United States” but other nations\nviolated the immunity of the president and his plane, putting his life\nat risk.”",
  "tags": [
    "corpocracy",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-03T09:30:00+00:00"
}