{
  "url": "https://voxday.net/2013/07/11/the-hit-and-runs-americans-wont-cause/",
  "scraped_at": "2025-12-14T22:34:59.845622",
  "title": "The hit-and-runs Americans won’t cause",
  "date_display": "July 11, 2013",
  "date_iso": "2013-07-11T14:00:00+00:00",
  "date_from_url": "2013-07-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.twincities.com/localnews/ci_23628577/charges-filed-hit-and-run-death-minneapolis-cyclist\">More blessings of diversity</a> in Mogadishu on the Mississippi:</p><blockquote class=\"tr_bq\"><p> A 24-year-old Minneapolis man was charged Tuesday<br> in last week’s hit-and-run death of a bicyclist, in which the driver<br> allegedly sped through a stop sign with his car’s headlights off, ran<br> over the victim and then fled. Abdirahman Abdi Ali, 24, was charged in Hennepin County District<br> Court with two counts of felony criminal vehicular homicide. Each charge<br> carries a penalty of up to 10 years in prison and a $20,000 fine.</br></br></br></br></br></p><p>Authorities believe Ali was driving the car that struck 24-year-old<br> Jessica Hanson around 10:30 p.m. Wednesday in the Whittier neighborhood<br> as she biked to her boyfriend’s house. Witnesses said the car’s<br> headlights were off on when it sped north on Pleasant Avenue South, went<br> through the stop sign at West 28th Street and hit Hanson in the<br> intersection and didn’t stop….</br></br></br></br></br></p><p> Ali, who had a revoked driver’s license, called police Friday evening<br> and said he had struck a person as he drove along Pleasant Avenue. He<br> said his vehicle was being shot at and that he did not know whom or what<br> he hit when he sped away. Ali’s mother later told police she had spoken<br> with her son Friday morning and that he had told her he had been in an<br> accident and thought he might have struck a bicyclist.</br></br></br></br></br></p><p>Police said Abdirahman Ali is the older brother of Ahmed Shire Ali,<br> who is serving an 18-year prison sentence for pleading guilty to his<br> role in the January 2010 slayings of three people at Seward Market &amp;<br> Halal Meats on East Franklin Avenue in Minneapolis. The gunman in that case, Mahdi Hassan Ali, was tried in 2011,<br> convicted and sentenced to life in prison for the deaths of store clerk<br> Osman Jama Elmi, 28; his cousin, Mohamed Abdi Warfa, 30; and customer<br> Anwar Salah Mohamed, 31.</br></br></br></br></br></br></p></blockquote><p>As I mentioned last month, we were in Rome with some friends from Minneapolis and they commented on how they were surprised to see fewer Africans and Muslims in Rome than in Minneapolis.  Of course, the Romans recall what eventually happens in every multicultural society.</p><p>But what is just <a href=\"http://blogs.citypages.com/blotter/2013/07/jessica_hanson_24_killed_while_bicycling_in_hit_and_run_near_lyn-lake.php\">another dead white girl</a> in comparison with the manifold blessings of St. Diversity.</p></div>",
  "content_text": "More blessings of diversity\nin Mogadishu on the Mississippi:\nA 24-year-old Minneapolis man was charged Tuesday\nin last week’s hit-and-run death of a bicyclist, in which the driver\nallegedly sped through a stop sign with his car’s headlights off, ran\nover the victim and then fled. Abdirahman Abdi Ali, 24, was charged in Hennepin County District\nCourt with two counts of felony criminal vehicular homicide. Each charge\ncarries a penalty of up to 10 years in prison and a $20,000 fine.\nAuthorities believe Ali was driving the car that struck 24-year-old\nJessica Hanson around 10:30 p.m. Wednesday in the Whittier neighborhood\nas she biked to her boyfriend’s house. Witnesses said the car’s\nheadlights were off on when it sped north on Pleasant Avenue South, went\nthrough the stop sign at West 28th Street and hit Hanson in the\nintersection and didn’t stop….\nAli, who had a revoked driver’s license, called police Friday evening\nand said he had struck a person as he drove along Pleasant Avenue. He\nsaid his vehicle was being shot at and that he did not know whom or what\nhe hit when he sped away. Ali’s mother later told police she had spoken\nwith her son Friday morning and that he had told her he had been in an\naccident and thought he might have struck a bicyclist.\nPolice said Abdirahman Ali is the older brother of Ahmed Shire Ali,\nwho is serving an 18-year prison sentence for pleading guilty to his\nrole in the January 2010 slayings of three people at Seward Market &\nHalal Meats on East Franklin Avenue in Minneapolis. The gunman in that case, Mahdi Hassan Ali, was tried in 2011,\nconvicted and sentenced to life in prison for the deaths of store clerk\nOsman Jama Elmi, 28; his cousin, Mohamed Abdi Warfa, 30; and customer\nAnwar Salah Mohamed, 31.\nAs I mentioned last month, we were in Rome with some friends from Minneapolis and they commented on how they were surprised to see fewer Africans and Muslims in Rome than in Minneapolis.  Of course, the Romans recall what eventually happens in every multicultural society.\nBut what is just\nanother dead white girl\nin comparison with the manifold blessings of St. Diversity.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-11T13:00:00+00:00"
}