{
  "url": "https://voxday.net/2013/07/29/vaccines-science-and-equipose/",
  "scraped_at": "2025-12-14T22:37:00.283485",
  "title": "Vaccines, science, and equipose",
  "date_display": "July 29, 2013",
  "date_iso": "2013-07-29T08:26:00+00:00",
  "date_from_url": "2013-07-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Phonician previously embarrassed himself by demonstrating that he couldn’t tell the difference between Massachusetts and California.  Now he follows that up by showing that he can’t tell the difference between science and someone providing excuses to not make use of science.</p><blockquote class=\"tr_bq\"><p> Tell us again <a href=\"http://scienceblogs.com/insolence/2012/06/06/quoth-vox-day-vaccines-are-killing-babies/\">how much better you understand</a> the science, Dipshit…</p></blockquote><p>I will first point out that epidemiology is not science.  It is little more than professional statistical review and pattern recognition, and most epidemiologists are not even trained as scientists but have “a master’s in public health or a related field.”  They’re government bureaucrats. “More than half of epidemiologists work for government agencies at the local, state and federal levels.”</p><p>If epidemiology is science, then so is Tetris and technical analysis of the stock market.  Very little epidemiology involves the scientific method of developing hypotheses, performing experimental tests, and observing the results; the fact that the goal of epidemiology is to reduce infectious diseases doesn’t make it any more intrinsically scientific than sacrificing a white bull to Apollo to allay his wrath.</p><p>Orac explicitly points out that he is excusing the refusal of vaccine researchers to use the scientific method of blind clinical experiments to determine the safety of vaccines used in combination on very small humans due to “research ethics”.  That is not correcting me on the science, that is confirming my most central point!  There is no science being utilized at all, the “good scientific reason(s)” to which Orac appeals refers to the general consensus of the scientists based on unscientific grounds and not to genuine scientific evidence produced by the scientific method.</p><p><i>“Vox needs a lesson in clinical trial ethics. Again. Sadly, it will probably fall on the proverbial deaf ears, but I’ll give it a try again, starting with two words: Clinical equipoise.</i></p><p>Stated briefly, for purposes of clinical trials, clinical equipoise demands that there be a state of genuine scientific uncertainty in the medical community over which of the drugs or treatments being tested is more efficacious and safer or whether a drug being tested with placebo is better or worse than doing nothing. Without that genuine scientific uncertainty over which option being tested in a clinical trial is better (or at least less harmful), the trial cannot be ethical because investigators would be knowingly assigning one group of subjects to a treatment known to be inferior, or at least strongly suspected to be….  </p><p><i>Vox, for all his self-proclaimed Mensa awesomeness, seems totally unable<br> to understand that for some questions that is the best we can do<br> because scientific rigor sometimes conflicts with human subjects<br> research ethics.”</br></br></br></i></p><p>Of course, this is the same medical community that once possessed genuine “scientific” certainty that opening up patients’ veins and bleeding them was better than doing nothing. The long history of incorrect scientific consensuses that were eventually overturned by an individual who performed an actual scientific experiment suggests that one day, clinical equipose notwithstanding, it will be clearly seen that the mass administration of hundreds of millions of vaccines without any scientific evidence to support their safety was a far more egregious ethical violation than permitting a few hundred children to go unvaccinated for a few years.  And it strikes me that was a pattern recognized, so do you realize what we’re doing here?  That’s right, this is straight up epidemiology!</p><p>On a tangentially related subject, Scoobius Doobious demonstrates a certain failure of logic while bringing up the conventional justification for the mass administration of vaccines:</p><blockquote class=\"tr_bq\"><p> I’m no controversialist on the vaccine question (don’t know enough<br> to comment with a strong opinion), but I will remind you that there are<br> two very prominent bits of historical data worth pondering:</br></br></p><p>a) within<br> living human memory, polio was a terrible, monstrous scourge; and in<br> the wake of vaccine development, it is all but forgotten — polio didn’t<br> just burn itself out the way the Black Plague did, it was consciously<br> eradicated via vaccination.</br></br></br></br></p><p>b) ditto smallpox, IIRC.</p><p>Worth pondering.</p></blockquote><p>I’m not sure why Scoobius appears to think it is necessary to remind anyone involved in this discussion of those two prominent bits of historical data.  But very well, let us ponder.</p><ol><li>Correlation is not causation and the correlation is not precise. The 95 percent decline in smallpox, diphtheria, pertussis, scarlet fever, and<br> measles deaths from 1850 to 1945 all preceded the mass vaccination programs.</br></li><li>Polio and smallpox killed or severely harmed considerably more people than whooping cough, measles, and chicken pox have.  The reward aspect of the risk/reward ratio for the vaccines is very different.</li><li>Different vaccines result in different adverse reactions. They pose different risks.  The risk aspect of the risk/reward ratio for the vaccines is very different.</li></ol><p>Post-pondering, it should be clear that justifying the administration of any and all vaccines because polio and smallpox is logically indefensible.  Even if we assume that the near-eradication of both diseases was the result of the mass vaccination programs, the risk/reward ratios of the various vaccine schedules need to be compared.  Unfortunately, that is the very information that clinical equipoise denies us.</p><p>I am not anti-vaccination.  I got a tetanus booster a few years ago myself.  My children were vaccinated against certain diseases, but not according to the government schedule, let alone the US schedule that many European doctors believe to be, (and here I quote a highly respected European epidemiologist), “insane”.  But I do take a very conservative approach to vaccines because I have personally witnessed an adverse reaction, and because, unlike Phoenician, I am aware that there is absolutely no scientific evidence for the safety of the current US vaccine schedule. Because clinical equipose.</p></div>",
  "content_text": "Phonician previously embarrassed himself by demonstrating that he couldn’t tell the difference between Massachusetts and California.  Now he follows that up by showing that he can’t tell the difference between science and someone providing excuses to not make use of science.\nTell us again\nhow much better you understand\nthe science, Dipshit…\nI will first point out that epidemiology is not science.  It is little more than professional statistical review and pattern recognition, and most epidemiologists are not even trained as scientists but have “a master’s in public health or a related field.”  They’re government bureaucrats. “More than half of epidemiologists work for government agencies at the local, state and federal levels.”\nIf epidemiology is science, then so is Tetris and technical analysis of the stock market.  Very little epidemiology involves the scientific method of developing hypotheses, performing experimental tests, and observing the results; the fact that the goal of epidemiology is to reduce infectious diseases doesn’t make it any more intrinsically scientific than sacrificing a white bull to Apollo to allay his wrath.\nOrac explicitly points out that he is excusing the refusal of vaccine researchers to use the scientific method of blind clinical experiments to determine the safety of vaccines used in combination on very small humans due to “research ethics”.  That is not correcting me on the science, that is confirming my most central point!  There is no science being utilized at all, the “good scientific reason(s)” to which Orac appeals refers to the general consensus of the scientists based on unscientific grounds and not to genuine scientific evidence produced by the scientific method.\n“Vox needs a lesson in clinical trial ethics. Again. Sadly, it will probably fall on the proverbial deaf ears, but I’ll give it a try again, starting with two words: Clinical equipoise.\nStated briefly, for purposes of clinical trials, clinical equipoise demands that there be a state of genuine scientific uncertainty in the medical community over which of the drugs or treatments being tested is more efficacious and safer or whether a drug being tested with placebo is better or worse than doing nothing. Without that genuine scientific uncertainty over which option being tested in a clinical trial is better (or at least less harmful), the trial cannot be ethical because investigators would be knowingly assigning one group of subjects to a treatment known to be inferior, or at least strongly suspected to be….\nVox, for all his self-proclaimed Mensa awesomeness, seems totally unable\nto understand that for some questions that is the best we can do\nbecause scientific rigor sometimes conflicts with human subjects\nresearch ethics.”\nOf course, this is the same medical community that once possessed genuine “scientific” certainty that opening up patients’ veins and bleeding them was better than doing nothing. The long history of incorrect scientific consensuses that were eventually overturned by an individual who performed an actual scientific experiment suggests that one day, clinical equipose notwithstanding, it will be clearly seen that the mass administration of hundreds of millions of vaccines without any scientific evidence to support their safety was a far more egregious ethical violation than permitting a few hundred children to go unvaccinated for a few years.  And it strikes me that was a pattern recognized, so do you realize what we’re doing here?  That’s right, this is straight up epidemiology!\nOn a tangentially related subject, Scoobius Doobious demonstrates a certain failure of logic while bringing up the conventional justification for the mass administration of vaccines:\nI’m no controversialist on the vaccine question (don’t know enough\nto comment with a strong opinion), but I will remind you that there are\ntwo very prominent bits of historical data worth pondering:\na) within\nliving human memory, polio was a terrible, monstrous scourge; and in\nthe wake of vaccine development, it is all but forgotten — polio didn’t\njust burn itself out the way the Black Plague did, it was consciously\neradicated via vaccination.\nb) ditto smallpox, IIRC.\nWorth pondering.\nI’m not sure why Scoobius appears to think it is necessary to remind anyone involved in this discussion of those two prominent bits of historical data.  But very well, let us ponder.\nCorrelation is not causation and the correlation is not precise. The 95 percent decline in smallpox, diphtheria, pertussis, scarlet fever, and\nmeasles deaths from 1850 to 1945 all preceded the mass vaccination programs.\nPolio and smallpox killed or severely harmed considerably more people than whooping cough, measles, and chicken pox have.  The reward aspect of the risk/reward ratio for the vaccines is very different.\nDifferent vaccines result in different adverse reactions. They pose different risks.  The risk aspect of the risk/reward ratio for the vaccines is very different.\nPost-pondering, it should be clear that justifying the administration of any and all vaccines because polio and smallpox is logically indefensible.  Even if we assume that the near-eradication of both diseases was the result of the mass vaccination programs, the risk/reward ratios of the various vaccine schedules need to be compared.  Unfortunately, that is the very information that clinical equipoise denies us.\nI am not anti-vaccination.  I got a tetanus booster a few years ago myself.  My children were vaccinated against certain diseases, but not according to the government schedule, let alone the US schedule that many European doctors believe to be, (and here I quote a highly respected European epidemiologist), “insane”.  But I do take a very conservative approach to vaccines because I have personally witnessed an adverse reaction, and because, unlike Phoenician, I am aware that there is absolutely no scientific evidence for the safety of the current US vaccine schedule. Because clinical equipose.",
  "tags": [
    "science",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-29T07:26:00+00:00"
}