{
  "url": "https://voxday.net/2013/07/04/what-confidentiality-rules/",
  "scraped_at": "2025-12-14T22:34:14.934057",
  "title": "What confidentiality rules?",
  "date_display": "July 4, 2013",
  "date_iso": "2013-07-04T19:43:00+00:00",
  "date_from_url": "2013-07-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I received an email from a gentleman from the SFWA today:</p><blockquote class=\"tr_bq\"><p> Complaints against you have been filed by<br> multiple members of SFWA. In following our procedures for responding to<br> such complaints a report was prepared by a Board-appointed investigator<br> and found, by a Board vote, to merit continuing our complaint process.</br></br></br></p><p>Our current protocols mandate presenting you with the report and<br> adequate opportunity to respond so that the Board may make a<br> determination. Responses may include, but need not be limited to,<br> denial, claiming extenuating circumstances, and claiming provocation.<br> You have 14 days to respond. If you require statements by others to be<br> submitted for the record, such statements shall be collected and added<br> to the record. If you request an extension of time to collect these<br> statements, one additional 7-day-period shall be granted.</br></br></br></br></br></br></br></p><p>Please find attached the Board investigator’s report. This report<br> and all contents not publicly available fall under SFWA confidentiality<br> rules and may not be publicly disclosed.</br></br></p></blockquote><p>Now, here is what remains something of a mystery.  I examined the organization bylaws and there are no “confidentiality rules”.  There are confidentiality rules in the Forum, which are clearly posted, but an unsolicited email is not a Forum post and is no more protected by expectations of confidentiality than spam.</p><p>However, I certainly wouldn’t want to violate any more organization rules than I already have, so I requested more information from the gentleman: <br> <i><br/></i><br> <i>I have received the information you sent me.  I shall be pleased to<br> review it.  However, I do not recognize that the information falls under<br> any “confidentiality rules”, as this is not the SFWA Forum, but an<br> unsolicited email sent to me.  Nor are there any “confidentiality rules”<br> in the SFWA bylaws.<br> </br></br></br></br></br></i><br> <i><br>Please inform me by what “confidentiality rules” you believe this report<br> falls under within 24 hours or I will assume that there are none<br> pertinent to this report and I am therefore free to reproduce its<br> contents in its entirety wherever I see fit.<br> </br></br></br></br></br></i></br></br></br></p><p>Now, perhaps there are some double-secret confidentiality rules of which I am unaware, in which case I shall, of course, abide by them.  But if there are no such rules, then I shall certainly not hesitate to make the report available to the public.</p></div>",
  "content_text": "I received an email from a gentleman from the SFWA today:\nComplaints against you have been filed by\nmultiple members of SFWA. In following our procedures for responding to\nsuch complaints a report was prepared by a Board-appointed investigator\nand found, by a Board vote, to merit continuing our complaint process.\nOur current protocols mandate presenting you with the report and\nadequate opportunity to respond so that the Board may make a\ndetermination. Responses may include, but need not be limited to,\ndenial, claiming extenuating circumstances, and claiming provocation.\nYou have 14 days to respond. If you require statements by others to be\nsubmitted for the record, such statements shall be collected and added\nto the record. If you request an extension of time to collect these\nstatements, one additional 7-day-period shall be granted.\nPlease find attached the Board investigator’s report. This report\nand all contents not publicly available fall under SFWA confidentiality\nrules and may not be publicly disclosed.\nNow, here is what remains something of a mystery.  I examined the organization bylaws and there are no “confidentiality rules”.  There are confidentiality rules in the Forum, which are clearly posted, but an unsolicited email is not a Forum post and is no more protected by expectations of confidentiality than spam.\nHowever, I certainly wouldn’t want to violate any more organization rules than I already have, so I requested more information from the gentleman:\nI have received the information you sent me.  I shall be pleased to\nreview it.  However, I do not recognize that the information falls under\nany “confidentiality rules”, as this is not the SFWA Forum, but an\nunsolicited email sent to me.  Nor are there any “confidentiality rules”\nin the SFWA bylaws.\nPlease inform me by what “confidentiality rules” you believe this report\nfalls under within 24 hours or I will assume that there are none\npertinent to this report and I am therefore free to reproduce its\ncontents in its entirety wherever I see fit.\nNow, perhaps there are some double-secret confidentiality rules of which I am unaware, in which case I shall, of course, abide by them.  But if there are no such rules, then I shall certainly not hesitate to make the report available to the public.",
  "tags": [
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-04T18:43:00+00:00"
}