{
  "url": "https://voxday.net/2013/07/15/where-is-lef/",
  "scraped_at": "2025-12-14T22:35:31.050167",
  "title": "Where is the Left?",
  "date_display": "July 15, 2013",
  "date_iso": "2013-07-15T12:47:00+00:00",
  "date_from_url": "2013-07-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I find it fascinating how the ideological Left is far more concerned about slavery that ended nearly 150 years ago than <a href=\"http://www.cbn.com/cbnnews/insideisrael/2013/July/Tortured-in-the-Sinai-I-Was-Hanged-for-Days/\">slavery that is taking place today</a>.  It appears that if they can’t blame something on white people, they’re just not interested in it:</p><blockquote class=\"tr_bq\"><p> From the West Coast of Africa to the deserts of Sinai, Bedouin tribes<br> are conducting a human trafficking trade on a massive scale… This man is just one victim of this widespread modern-day slavery,<br> kidnapping, and torture trade in the Sinai desert. There are many<br> pictures and videos of this horrible practice on the Internet. For this story, this Christian man from the African country of<br> Eritrea is going by “Philip,” but that’s not his real name. CBN News<br> covered his identity for his protection.</br></br></br></br></br></p><p>“In some cases, we were tortured simply because we were Christians,” he told us, his chest trembling slightly as he spoke. “Sinai was always a place for human smuggling, but since around two<br> years ago — even a bit more — it started also to be a place of human<br> torture,” Shahar Shoham, director of <a href=\"http://www.phr.org.il/default.asp?PageID=4\" rel=\"nofollow noopener\" target=\"_blank\">Physicians for Human Rights</a>, told CBN News.</br></br></p></blockquote><p>I don’t know if you’ve noticed, but it is readily apparent that everything, including the truth, is nothing more than a useful weapon to the Left.  With a few noble exceptions, for whom I harbor an amount of respect, they just don’t appear to have any genuine principles beyond whatever they find useful at the moment. </p><p>This is true of some who are nominally on the right, of course.  You don’t need to remind me, I was acquainted with Ken Lay and some members of Bush the Elder’s “Houston Mafia”.  But it appears to be true of nearly everyone, especially at the grass roots, on the Left.</p></div>",
  "content_text": "I find it fascinating how the ideological Left is far more concerned about slavery that ended nearly 150 years ago than\nslavery that is taking place today\n.  It appears that if they can’t blame something on white people, they’re just not interested in it:\nFrom the West Coast of Africa to the deserts of Sinai, Bedouin tribes\nare conducting a human trafficking trade on a massive scale… This man is just one victim of this widespread modern-day slavery,\nkidnapping, and torture trade in the Sinai desert. There are many\npictures and videos of this horrible practice on the Internet. For this story, this Christian man from the African country of\nEritrea is going by “Philip,” but that’s not his real name. CBN News\ncovered his identity for his protection.\n“In some cases, we were tortured simply because we were Christians,” he told us, his chest trembling slightly as he spoke. “Sinai was always a place for human smuggling, but since around two\nyears ago — even a bit more — it started also to be a place of human\ntorture,” Shahar Shoham, director of\nPhysicians for Human Rights\n, told CBN News.\nI don’t know if you’ve noticed, but it is readily apparent that everything, including the truth, is nothing more than a useful weapon to the Left.  With a few noble exceptions, for whom I harbor an amount of respect, they just don’t appear to have any genuine principles beyond whatever they find useful at the moment.\nThis is true of some who are nominally on the right, of course.  You don’t need to remind me, I was acquainted with Ken Lay and some members of Bush the Elder’s “Houston Mafia”.  But it appears to be true of nearly everyone, especially at the grass roots, on the Left.",
  "tags": [
    "Christianity",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-15T11:47:00+00:00"
}