{
  "url": "https://voxday.net/2013/07/27/who-doesnt-understand-wha/",
  "scraped_at": "2025-12-14T22:36:52.882086",
  "title": "Who doesn’t understand what?",
  "date_display": "July 27, 2013",
  "date_iso": "2013-07-27T20:00:00+00:00",
  "date_from_url": "2013-07-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The current SFWA president provides a fascinating <a href=\"https://twitter.com/scalzi/status/358590229340372993\">retweet from the previous SFWA president</a>.</p><p><i>John Scalzi ‏@scalzi 20 Jul</i><br> <i>As a general rule, a person too stupid to understand satire shouldn’t try to use it as an affirmative defense.</i><br> <i>Retweeted by Steven Gould </i></br></br></p><p>Now, logic suggests that there are two possibilities here.  The first is that a member of Mensa doesn’t understand satire.  The second is that John Scalzi is a foolish ass who didn’t stop and think before he asserted his belief in a dimwitted reader’s interpretation of one of my posts.</p><p>Whatever could the answer be?  Remember, leftist attacks often involve psychological projection of their own deficiencies.  Consider the similarities between McRapey’s claims that I don’t understand satire and his response to my explanation for the readily observable fact that women write very little hard science fiction <a href=\"http://nielsenhayden.com/electrolite/archives/006122.html#75964\">more than eight years ago</a>:</p><blockquote class=\"tr_bq\"><p> <i>“John, you think it makes more sense to postulate that despite my<br> obvious familiarity with the hard SF works of various women, I am<br> dedicated to a theory of genetic female inferiority while simultaneously<br> being in denial of the existence of books I own, than to admit you<br> failed to grasp an obvious rhetorical device.”</br></br></br></br></i></p><p>It’s possible, Vox. On the other hand, I have a degree in philosophy<br> from the University of Chicago (specializing in the philosophy of<br> language), and therefore have ample training in rhetoric, so I doubt<br> that rhetorical deficiencies on this end are the issue.</br></br></br></p></blockquote><p>McRapey can’t be wrong, you see, because credentials.  Credentials and ample training.</p></div>",
  "content_text": "The current SFWA president provides a fascinating\nretweet from the previous SFWA president\n.\nJohn Scalzi ‏@scalzi 20 Jul\nAs a general rule, a person too stupid to understand satire shouldn’t try to use it as an affirmative defense.\nRetweeted by Steven Gould\nNow, logic suggests that there are two possibilities here.  The first is that a member of Mensa doesn’t understand satire.  The second is that John Scalzi is a foolish ass who didn’t stop and think before he asserted his belief in a dimwitted reader’s interpretation of one of my posts.\nWhatever could the answer be?  Remember, leftist attacks often involve psychological projection of their own deficiencies.  Consider the similarities between McRapey’s claims that I don’t understand satire and his response to my explanation for the readily observable fact that women write very little hard science fiction\nmore than eight years ago\n:\n“John, you think it makes more sense to postulate that despite my\nobvious familiarity with the hard SF works of various women, I am\ndedicated to a theory of genetic female inferiority while simultaneously\nbeing in denial of the existence of books I own, than to admit you\nfailed to grasp an obvious rhetorical device.”\nIt’s possible, Vox. On the other hand, I have a degree in philosophy\nfrom the University of Chicago (specializing in the philosophy of\nlanguage), and therefore have ample training in rhetoric, so I doubt\nthat rhetorical deficiencies on this end are the issue.\nMcRapey can’t be wrong, you see, because credentials.  Credentials and ample training.",
  "tags": [
    "McRapey",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-27T19:00:00+00:00"
}