{
  "url": "https://voxday.net/2013/07/31/why-rabbits-cant-think-straig/",
  "scraped_at": "2025-12-14T22:37:18.363046",
  "title": "Why the rabbits can’t think straight",
  "date_display": "July 31, 2013",
  "date_iso": "2013-07-31T12:30:00+00:00",
  "date_from_url": "2013-07-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An English professor and evolutionary psychologist attempts to explain <a href=\"http://iqpersonalitygenius.blogspot.ch/2013/07/dishonesty-reduces-applied-intelligence.html\">the inability of certain rabbits</a> to successfully engage in honest dialectic and why they are limited to rhetorical discourse:</p><blockquote class=\"tr_bq\"><p> Surveying the modern intellectual scene, the world of public discourse<br> among the educational elites, I conclude that dishonesty does not only<br> reduce the efficiency and effectiveness of thinking – but it actually <i>reduces applied intelligence</i> – probably by<i> re-wiring the brain</i>.</br></br></p><p>What I am suggesting is that, although the fundamental efficiency of<br> neural processing is an hereditary characteristic which is robust to<br> environmental differences and changes (short of something like<br> destructive brain pathology – encephalitis, neurotoxin, head injury,<br> dementia etc) – habitual dishonesty (such as is mainstream among the<br> modern intellectual elite) will generate brain changes, and a<br> long-lasting (although probably, eventually, reversible) pathology in<br> applied intelligence – such that what ought to be simple and obvious<br> inferential reasoning becomes impossible.</br></br></br></br></br></br></br></br></p><p>I mean <i>impossible</i>.</p><p>Habitual dishonesty (most notable political correctness) is a form of<br> learning; and learning strengthens some brain pathways and brain<br> connections; while allowing other pathways and connections to wither and<br> (perhaps eventually) perish.</br></br></br></p><p>Therefore, even on those rare occasions when a typical modern<br> intellectual tries to be honest and to think straight – they cannot do<br> it, because their reasoning processes have been sabotaged by their own<br> repeated habits of dishonesty – their attempts at honest thoughts will<br> be inhibited, and instead channelled down the usual lying pathways…</br></br></br></br></p><p>Thus, in modern intellectual life, honesty is punished and dishonesty is rewarded; <i>honest brain pathways decay, dishonest brain pathways enlarge</i>.</p><p>After years and years of conditioning in dishonesty, the typical modern<br> intellectual (whether journalist, scientist, lawyer, teacher, doctor or<br> whatever) becomes <i>physically unable to think straight</i>.</br></br></p></blockquote><p>I’m far from the only one to observe that the trolls and anklebiters that seek to infest the blog are reliably dishonest.  But I had always thought it was a Machiavellian tactic and assumed that they knew they were lying.  After all, how many times can you have your positions methodically destroyed and still turn around and espouse it if one is not pathologically dishonest or simply playing a game?</p><p>However, in reading comments by the same individuals made when safely ensconced in their warrens, I observed that they not only espoused the same positions there, but genuinely appeared to believe that they had acquitted themselves well despite making absolutely undeniable blunders.  That’s when I began to realize that there was something fundamentally wrong with the way their minds worked.  It’s not so much that they will readily tell lies and espouse nonsense, but that they will continue doing so even when the falsity of their positions has been exposed and is observable for all to see.</p><p>This isn’t true of all rabbits. Rabbits like PZ Myers and McRapey know when they are shown to be wrong.  The avoidance patterns of their behavior and their swift reactions to when they are caught out betray this. They fear being seen to be wrong, which why they resolutely avoid public debate with anyone capable of calling them out and exposing them on their nonsense, but that very fear shows their awareness of it.  They may be dishonest at times, and will readily assume false postures, (e.g. “I’m done pretending to be nice”), but their dishonesty is not pathological and usually serves some sort of identifiable purpose.  This is very different from the behavior we often see from anklebiters here, where no amount of knowledge suffices to correct them and no rational purpose underlying their behavior can be discerned.</p><p>I don’t know if Charlton’s theory is correct. But it is certainly an area where a considerable amount of scientific research would be justified, and let’s face it, some of these brains could only be improved by dissection.  On the other hand, as Markku pointed out, there may be a spiritual element involved, as CS Lewis described in <i>The Great Divorce</i>.</p><p><i>“But, beyond all these, I saw other grotesque phantoms in which hardly a trace of the human form remained; monsters who had faced the journey to the bus stop-perhaps for them it was thousands of miles-and come up to the country of the Shadow of Life and limped far into it over the torturing grass, only to spit and gibber out in one ecstasy of hatred their envy and (what is harder to understand) their contempt, of joy. The voyage seemed to them a small price to pay if once, only once, within sight of that eternal dawn, they could tell the prigs, the toffs, the sanctimonious humbugs, the snobs, the “haves,” what they thought of them.”</i></p></div>",
  "content_text": "An English professor and evolutionary psychologist attempts to explain\nthe inability of certain rabbits\nto successfully engage in honest dialectic and why they are limited to rhetorical discourse:\nSurveying the modern intellectual scene, the world of public discourse\namong the educational elites, I conclude that dishonesty does not only\nreduce the efficiency and effectiveness of thinking – but it actually\nreduces applied intelligence\n– probably by\nre-wiring the brain\n.\nWhat I am suggesting is that, although the fundamental efficiency of\nneural processing is an hereditary characteristic which is robust to\nenvironmental differences and changes (short of something like\ndestructive brain pathology – encephalitis, neurotoxin, head injury,\ndementia etc) – habitual dishonesty (such as is mainstream among the\nmodern intellectual elite) will generate brain changes, and a\nlong-lasting (although probably, eventually, reversible) pathology in\napplied intelligence – such that what ought to be simple and obvious\ninferential reasoning becomes impossible.\nI mean\nimpossible\n.\nHabitual dishonesty (most notable political correctness) is a form of\nlearning; and learning strengthens some brain pathways and brain\nconnections; while allowing other pathways and connections to wither and\n(perhaps eventually) perish.\nTherefore, even on those rare occasions when a typical modern\nintellectual tries to be honest and to think straight – they cannot do\nit, because their reasoning processes have been sabotaged by their own\nrepeated habits of dishonesty – their attempts at honest thoughts will\nbe inhibited, and instead channelled down the usual lying pathways…\nThus, in modern intellectual life, honesty is punished and dishonesty is rewarded;\nhonest brain pathways decay, dishonest brain pathways enlarge\n.\nAfter years and years of conditioning in dishonesty, the typical modern\nintellectual (whether journalist, scientist, lawyer, teacher, doctor or\nwhatever) becomes\nphysically unable to think straight\n.\nI’m far from the only one to observe that the trolls and anklebiters that seek to infest the blog are reliably dishonest.  But I had always thought it was a Machiavellian tactic and assumed that they knew they were lying.  After all, how many times can you have your positions methodically destroyed and still turn around and espouse it if one is not pathologically dishonest or simply playing a game?\nHowever, in reading comments by the same individuals made when safely ensconced in their warrens, I observed that they not only espoused the same positions there, but genuinely appeared to believe that they had acquitted themselves well despite making absolutely undeniable blunders.  That’s when I began to realize that there was something fundamentally wrong with the way their minds worked.  It’s not so much that they will readily tell lies and espouse nonsense, but that they will continue doing so even when the falsity of their positions has been exposed and is observable for all to see.\nThis isn’t true of all rabbits. Rabbits like PZ Myers and McRapey know when they are shown to be wrong.  The avoidance patterns of their behavior and their swift reactions to when they are caught out betray this. They fear being seen to be wrong, which why they resolutely avoid public debate with anyone capable of calling them out and exposing them on their nonsense, but that very fear shows their awareness of it.  They may be dishonest at times, and will readily assume false postures, (e.g. “I’m done pretending to be nice”), but their dishonesty is not pathological and usually serves some sort of identifiable purpose.  This is very different from the behavior we often see from anklebiters here, where no amount of knowledge suffices to correct them and no rational purpose underlying their behavior can be discerned.\nI don’t know if Charlton’s theory is correct. But it is certainly an area where a considerable amount of scientific research would be justified, and let’s face it, some of these brains could only be improved by dissection.  On the other hand, as Markku pointed out, there may be a spiritual element involved, as CS Lewis described in\nThe Great Divorce\n.\n“But, beyond all these, I saw other grotesque phantoms in which hardly a trace of the human form remained; monsters who had faced the journey to the bus stop-perhaps for them it was thousands of miles-and come up to the country of the Shadow of Life and limped far into it over the torturing grass, only to spit and gibber out in one ecstasy of hatred their envy and (what is harder to understand) their contempt, of joy. The voyage seemed to them a small price to pay if once, only once, within sight of that eternal dawn, they could tell the prigs, the toffs, the sanctimonious humbugs, the snobs, the “haves,” what they thought of them.”",
  "tags": [
    "rabbitology",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2013-07-31T11:30:00+00:00"
}