{
  "url": "https://voxday.net/2019/12/18/a-nonexistent-insider-2/",
  "scraped_at": "2025-12-21T03:09:41.907716",
  "title": "A nonexistent insider",
  "date_display": "December 18, 2019",
  "date_iso": "2019-12-18T10:41:58+00:00",
  "date_from_url": "2019-12-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of Big Bear’s anklebiters is claiming that “a Vox Day insider” and “vfm member” is exposing <a href=\"https://www.youtube.com/watch?v=NmJ8-Wem4ks\">all sorts of nonexistent scams and shenanigans</a> on our part.</p><blockquote class=\"tr_bq\"><p>we dont trust him but let me share some private messages from a vfm member, paid member an someone who is our mole on the inside.</p></blockquote><p>However, the individual that appears to be behind this baseless slander is one Evan Shulz, an Alt-Hero:Q backer who helped bounce the rubble before getting aggressively butthurt over the Owen Benjamin-Nick Fuentes drama. He is neither an “insider” nor is he VFM, as should be evident from his comments on the video linked above.</p><blockquote><p>Evan Schulz<br>You are dead on with the scamming and ponzi scheme angle, and many of us who respected Vox and have been involved with his projects in the past have become disillusioned since this partnership with crazy Owen and the endless grift that has ensued.</br></p><p>Evan Schulz<br>I’ve followed his work for a number of years. His book SJWs Always Lie was quite influential. “What you have to understand” (spoken in Vox voice) is that this grifting and constant fund raising is new and out of character.</br></p><p>Evan Schulz<br>he was always a pompouse ass. But he had interesting insights on certain topics that he is well read on. If someone is an interesting thinker, I can overlook a bad personality. But the whole Owen partnership and the constant grifting and lying and counter signaling people who are doing good things is new and bizarre.</br></p></blockquote><p>I was thinking that name sounded familiar and went to check my email. Sure enough, the search revealed an object lesson in why one MUST always excise the gammas from one’s social circles, organizations, and even fan clubs. They are INEVITABLY treacherous, self-righteous little shits who will eventually seek to destroy whatever they cannot influence to their liking, no matter what “fans” or “supporters” they previously claimed to be.</p><blockquote class=\"tr_bq\"><p>7/14/2019 9:50 AM<br>Evan Schulz wrote:<br><i>Owen. I’ll be blunt. This man is extremely reckless in attacking Nick Fuentes. The remainder of the Bears that still put up with him are cultist sycophants. To dox Nick’s dad and so viciously attack him is putting Nick’s safety at risk from deranged people. Either Owen is too dumb to realize this, or he is a malicious actor working against our worldview and interests. He has diminished your well deserved reputation. My advice is to cut ties sooner rather than later.</i></br></br></p></blockquote><p>To which I responded after unbanning him – unwisely, as it turns out – from the Darkstream chat, from which he’d been banned for repeating a question to which he’d already received an answer.</p><p><i>Evan,</i><br><i><br/></i><i>What on Earth do you think you were doing by repeating your question – which I’d already answered – on the stream? First, it’s not your business. Second, you’re wrong.</i><br><i><br/></i><i>Third, how long will it take for you to admit you are wrong when Owen fails to turn on me? Two weeks? Two months?</i><br><i><br/></i><i>Either way, this simply isn’t your concern.</i><br><i><br/></i><i>Best regards,</i><br><i><br/></i><i>Vox</i></br></br></br></br></br></p><blockquote><p>7/16/2019, 5:58 PM<br>Evan Schulz wrote:<br><i>I apologize for addressing it publicly. In hindsight that was not very mature of me. For some reason I had not received notification of your email response. </i><br><i><br/></i><i>That being said, I stand by what I said. My main concern was not your reputation, but the wreckless nature of Owen’s behavior and the damage it does to the nationalist movement.</i><br><i><br/></i><i>I’m happy to agree to disagree on this one. I still have a tremendous amount of respect for your body of work and original thinking.</i></br></br></br></br></p></blockquote><p>Note that it is now December, five months after this email exchange, and we are still awaiting Owen’s supposedly imminent heel turn. And the prediction is more than a little ironic in light of Evan’s own rapid devolution from a tremendously respectful AH:Q backer to a publicly slanderous anklebiter who is henceforth banned from this blog, from the Darkstream, and from all of our collective projects.Perhaps he will find some modicum of consolation in his newfound status with his fellow anklebiters.</p><p>The lesson, as always, is this: <b><i>BANISH YOUR GAMMAS</i></b>. And in the unlikely event there actually is an Annual Unauthorized member who is discontent with the service that we are providing or believes that we have lied about it, rest assured that we will not hesitate to refund the entire amount to you regardless of when you happened to subscribe.</p><p><b>UPDATE: </b>This excerpt was particularly amusing in light of the YouTuber’s complete failure to grasp the obvious implications of the situation.</p><blockquote class=\"tr_bq\"><p>Just like he’s saying with a Patreon lawsuit, just like he’s saying about suing YouTube, he said the same thing about IndieGoGo, yet he’s still using that company. And like with YouTube, he’s still using that company. There’s not gonna be a lawsuit against these companies.</p></blockquote><p>His claims of engagement declining significantly are true, because the mods have done an excellent job of methodically beating down and banning the trolls. What he leaves out is that since the Darkstream’s peak engagement was set on February 25, watch time is up 119 percent and average view duration is up 7 percent.</p><p><b>UPDATE: </b>Evan Schulz denies being the fake insider who emailed Davey Crocko and claimed to be VFM and an Unauthorized subscriber. I can’t confirm that, but I can confirm he is neither. He writes:</p><blockquote class=\"tr_bq\"><p>I have never been in contact with Davey Crocko, and am not attempting to be an insider “whisleblower”. I am neither. I am not a bear, I am not VFM. All my interactions with Vox have been via email. All my YouTube comments are public and I stand by them. Please retract this smear.</p></blockquote></div>",
  "content_text": "One of Big Bear’s anklebiters is claiming that “a Vox Day insider” and “vfm member” is exposing\nall sorts of nonexistent scams and shenanigans\non our part.\nwe dont trust him but let me share some private messages from a vfm member, paid member an someone who is our mole on the inside.\nHowever, the individual that appears to be behind this baseless slander is one Evan Shulz, an Alt-Hero:Q backer who helped bounce the rubble before getting aggressively butthurt over the Owen Benjamin-Nick Fuentes drama. He is neither an “insider” nor is he VFM, as should be evident from his comments on the video linked above.\nEvan Schulz\nYou are dead on with the scamming and ponzi scheme angle, and many of us who respected Vox and have been involved with his projects in the past have become disillusioned since this partnership with crazy Owen and the endless grift that has ensued.\nEvan Schulz\nI’ve followed his work for a number of years. His book SJWs Always Lie was quite influential. “What you have to understand” (spoken in Vox voice) is that this grifting and constant fund raising is new and out of character.\nEvan Schulz\nhe was always a pompouse ass. But he had interesting insights on certain topics that he is well read on. If someone is an interesting thinker, I can overlook a bad personality. But the whole Owen partnership and the constant grifting and lying and counter signaling people who are doing good things is new and bizarre.\nI was thinking that name sounded familiar and went to check my email. Sure enough, the search revealed an object lesson in why one MUST always excise the gammas from one’s social circles, organizations, and even fan clubs. They are INEVITABLY treacherous, self-righteous little shits who will eventually seek to destroy whatever they cannot influence to their liking, no matter what “fans” or “supporters” they previously claimed to be.\n7/14/2019 9:50 AM\nEvan Schulz wrote:\nOwen. I’ll be blunt. This man is extremely reckless in attacking Nick Fuentes. The remainder of the Bears that still put up with him are cultist sycophants. To dox Nick’s dad and so viciously attack him is putting Nick’s safety at risk from deranged people. Either Owen is too dumb to realize this, or he is a malicious actor working against our worldview and interests. He has diminished your well deserved reputation. My advice is to cut ties sooner rather than later.\nTo which I responded after unbanning him – unwisely, as it turns out – from the Darkstream chat, from which he’d been banned for repeating a question to which he’d already received an answer.\nEvan,\nWhat on Earth do you think you were doing by repeating your question – which I’d already answered – on the stream? First, it’s not your business. Second, you’re wrong.\nThird, how long will it take for you to admit you are wrong when Owen fails to turn on me? Two weeks? Two months?\nEither way, this simply isn’t your concern.\nBest regards,\nVox\n7/16/2019, 5:58 PM\nEvan Schulz wrote:\nI apologize for addressing it publicly. In hindsight that was not very mature of me. For some reason I had not received notification of your email response.\nThat being said, I stand by what I said. My main concern was not your reputation, but the wreckless nature of Owen’s behavior and the damage it does to the nationalist movement.\nI’m happy to agree to disagree on this one. I still have a tremendous amount of respect for your body of work and original thinking.\nNote that it is now December, five months after this email exchange, and we are still awaiting Owen’s supposedly imminent heel turn. And the prediction is more than a little ironic in light of Evan’s own rapid devolution from a tremendously respectful AH:Q backer to a publicly slanderous anklebiter who is henceforth banned from this blog, from the Darkstream, and from all of our collective projects.Perhaps he will find some modicum of consolation in his newfound status with his fellow anklebiters.\nThe lesson, as always, is this:\nBANISH YOUR GAMMAS\n. And in the unlikely event there actually is an Annual Unauthorized member who is discontent with the service that we are providing or believes that we have lied about it, rest assured that we will not hesitate to refund the entire amount to you regardless of when you happened to subscribe.\nUPDATE:\nThis excerpt was particularly amusing in light of the YouTuber’s complete failure to grasp the obvious implications of the situation.\nJust like he’s saying with a Patreon lawsuit, just like he’s saying about suing YouTube, he said the same thing about IndieGoGo, yet he’s still using that company. And like with YouTube, he’s still using that company. There’s not gonna be a lawsuit against these companies.\nHis claims of engagement declining significantly are true, because the mods have done an excellent job of methodically beating down and banning the trolls. What he leaves out is that since the Darkstream’s peak engagement was set on February 25, watch time is up 119 percent and average view duration is up 7 percent.\nUPDATE:\nEvan Schulz denies being the fake insider who emailed Davey Crocko and claimed to be VFM and an Unauthorized subscriber. I can’t confirm that, but I can confirm he is neither. He writes:\nI have never been in contact with Davey Crocko, and am not attempting to be an insider “whisleblower”. I am neither. I am not a bear, I am not VFM. All my interactions with Vox have been via email. All my YouTube comments are public and I stand by them. Please retract this smear.",
  "tags": [
    "anklebiters"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-12-18T10:41:58+00:00"
}