{
  "url": "https://voxday.net/2019/12/12/i-told-you-hes-not-that-smart/",
  "scraped_at": "2025-12-21T03:08:55.523040",
  "title": "I told you he’s not that smart",
  "date_display": "December 12, 2019",
  "date_iso": "2019-12-12T01:25:01+00:00",
  "date_from_url": "2019-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the things that separates the intelligent from the average is the ability to learn from the experience of others. Nick Fuentes obviously falls in the latter category, as he not only talked to the mainstream media upon request, he actually invited them into his mother’s house. <i>For an entire week</i>. Needless to say, <a href=\"https://twitter.com/NickJFuentes/status/1204538741743861761\">it didn’t turn out well</a>.</p><blockquote><p>In February 2018, a production company called “Karga7” reached out and said they were interested in filming an episode of MTV True Life about me and my show. They spent a full week filming at my house but never released any of the footage until tonight, almost two years later.</p><p>Almost two years after a shoot for an episode of True Life, MTV has repackaged the footage into a mini-doc about “White Supremacy” which attempts to portray me as a spiritual successor to this low IQ skinhead buffoon, conveniently right after Groyper Wars!</p><p>At the time of this shoot I was 19 years old and had only been doing my show for a year. I initially declined to do the show because I knew “Jason Wolfe” and the media would not be kind to me but I never imagined a farce like this. Obviously I made a big mistake.</p></blockquote><p>Ah, but he was only 19 years old, as opposed to the wise old culture war veteran of 21 that he is now. If only someone had told poor, naive, little Nicky not to talk to the media <a href=\"http://voxday.blogspot.com/2017/02/the-opposition-media-is-fake-news.html\">before February 2018</a>! If only someone more experienced, someone more familiar with the media, someone considerably more intelligent, <a href=\"http://voxday.blogspot.com/2017/08/reminder-dont-talk-to-media.html\">had reminded</a> the innocent young lad not to talk to the media, this easily avoidable debacle might have been easily avoided.</p><p>Why didn’t anyone warn this impressionable young master of optics about how the media actually works <a href=\"http://voxday.blogspot.com/2016/06/dont-talk-to-media.html\">before February 2018</a>? Why didn’t anyone tell him what was bound to happen if he talked to the mainstream media?<br><i><br/></i><i>I didn’t listen to @voxday. I gave an interview to unfriendly media. They trashed the shit out of me. Listen to Vox.</i><br>– Jon Del Arroz, August 4, 2017</br></br></p><p>Never have any sympathy for anyone who falls for the usual bait-and-switch, especially when it was offered by the mainstream media. Because it requires a certain amount of ignorance, arrogance, and narcissism to imagine that you can beat the media at its own game.</p><p><b>UPDATE: </b>The amusing thing is that before this even posted as scheduled, I received an interview request for my views on certain subjects. I sent the would-be interviewer my standard response to those who are not obviously running the conventional discredit and disqualify routine.</p><p><i>Thank you for your request. I am afraid I must decline, as I no longer give interviews to anyone for any reason. If you are interested in my views on matters related to [REDACTED], I suggest you read my books [REDACTED], or review the 21,855 posts on my blog.</i></p><p>If I am feeling less kind and gentle, I simply turn the prospective interviewer over to my official PR representative, Pax Dickenson, to set up the interview.</p><p><b>UPDATE: </b>As Nick Fuentes has indicated that he is willing to debate me so long as the topic does not concern certain events that took place in the middle of the 20th century, I have proposed a written debate to him concerning his assertion that we have to live with multiracialism. I not only disagree with his contention, I assert, to the contrary, that multiracialism is intrinsically incompatible with societal survival.</p></div>",
  "content_text": "One of the things that separates the intelligent from the average is the ability to learn from the experience of others. Nick Fuentes obviously falls in the latter category, as he not only talked to the mainstream media upon request, he actually invited them into his mother’s house.\nFor an entire week\n. Needless to say,\nit didn’t turn out well\n.\nIn February 2018, a production company called “Karga7” reached out and said they were interested in filming an episode of MTV True Life about me and my show. They spent a full week filming at my house but never released any of the footage until tonight, almost two years later.\nAlmost two years after a shoot for an episode of True Life, MTV has repackaged the footage into a mini-doc about “White Supremacy” which attempts to portray me as a spiritual successor to this low IQ skinhead buffoon, conveniently right after Groyper Wars!\nAt the time of this shoot I was 19 years old and had only been doing my show for a year. I initially declined to do the show because I knew “Jason Wolfe” and the media would not be kind to me but I never imagined a farce like this. Obviously I made a big mistake.\nAh, but he was only 19 years old, as opposed to the wise old culture war veteran of 21 that he is now. If only someone had told poor, naive, little Nicky not to talk to the media\nbefore February 2018\n! If only someone more experienced, someone more familiar with the media, someone considerably more intelligent,\nhad reminded\nthe innocent young lad not to talk to the media, this easily avoidable debacle might have been easily avoided.\nWhy didn’t anyone warn this impressionable young master of optics about how the media actually works\nbefore February 2018\n? Why didn’t anyone tell him what was bound to happen if he talked to the mainstream media?\nI didn’t listen to @voxday. I gave an interview to unfriendly media. They trashed the shit out of me. Listen to Vox.\n– Jon Del Arroz, August 4, 2017\nNever have any sympathy for anyone who falls for the usual bait-and-switch, especially when it was offered by the mainstream media. Because it requires a certain amount of ignorance, arrogance, and narcissism to imagine that you can beat the media at its own game.\nUPDATE:\nThe amusing thing is that before this even posted as scheduled, I received an interview request for my views on certain subjects. I sent the would-be interviewer my standard response to those who are not obviously running the conventional discredit and disqualify routine.\nThank you for your request. I am afraid I must decline, as I no longer give interviews to anyone for any reason. If you are interested in my views on matters related to [REDACTED], I suggest you read my books [REDACTED], or review the 21,855 posts on my blog.\nIf I am feeling less kind and gentle, I simply turn the prospective interviewer over to my official PR representative, Pax Dickenson, to set up the interview.\nUPDATE:\nAs Nick Fuentes has indicated that he is willing to debate me so long as the topic does not concern certain events that took place in the middle of the 20th century, I have proposed a written debate to him concerning his assertion that we have to live with multiracialism. I not only disagree with his contention, I assert, to the contrary, that multiracialism is intrinsically incompatible with societal survival.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-12-12T01:25:01+00:00"
}