{
  "url": "https://voxday.net/2019/12/25/nationalist-economics/",
  "scraped_at": "2025-12-21T03:10:38.950630",
  "title": "Nationalist economics",
  "date_display": "December 25, 2019",
  "date_iso": "2019-12-25T15:43:49+00:00",
  "date_from_url": "2019-12-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>I was asked to address the intersection of nationalism and economics two years ago, for an anthology that was never published, at least, not to the best of my knowledge. But the conclusions I reached, though not what one could really call timeless, are still definitely relevant as 2019 comes to a close. </i><i>Consider it a Christmas present of sorts to the old school readers who enjoyed my focus on economics in the past.</i></p><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0in;\"></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\"><b>NATIONALIST ECONOMICS AND THE NEW RIGHT</b></span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\"><b>by Vox Day</b><p>It is one of the great ironies of modern politics that free trade and economic globalism have somehow become identified as not only right-wing policies, but right-wing dogma. This was not historically true, though, as from the very start, free trade has generally been a hallmark of the LEFT side of the political spectrum. If you recall, the infamous mercantilists attacked so furiously by Adam Smith in <i>The Wealth of Nations</i> were, almost to a man, royalists, not revolutionaries, while the great prophet of the Left, Karl Marx, openly advocated free trade on the grounds that it would help bring about world socialist revolution and the emancipation of the proletariat. </p></span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0in;\"></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">In the 240 years since Adam Smith triumphed over the mercantilists, the question of free trade has generally revolved around whether it is good for the nation concerned. However, this is not actually the right question to ask, as the more fundamental one is whether free trade and nations are even <i>compatible</i>. And, as it turns out, the answer is no.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">But let us not get ahead of ourselves and instead begin at the historical beginning. It is vital to first understand that the intellectual foundation for free trade is considerably shakier than most conservatives realize, particularly those conservatives who believe that David Ricardo settled the matter once and for all with his articulation of the Theory of Comparative Advantage.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><b 12pt;\"=\"\" adobe=\"\" font-size:=\"\" garamond=\"\" pro\",=\"\" serif;=\"\" style=\"font-family: \"></b></div><p><a name=\"more\"></a></p><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><b 12pt;\"=\"\" adobe=\"\" font-size:=\"\" garamond=\"\" pro\",=\"\" serif;=\"\" style=\"font-family: \">The Failure of the Free Trade Champions</b></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">David Ricardo was not an economist in the modern professional sense. He was a stockbroker, a successful con artist who put Michael Milken and Bernie Madoff to shame, a politician who purchased his seat in the House of Lords with his ill-gotten gains, and a pamphleteer. His works were not written with an aim of better understanding the matter addressed, but were primarily written as extended opinion editorials meant to advocate specific political policies. Moreover, his arguments were so heavily biased toward his preconceived conclusions that Joseph Schumpeter was moved to describe the custom of economists creating hopelessly impractical theories on the basis of heavily biased simplifications as “the Ricardian Vice”.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Besides the Theory of Comparative Advantage, which Ricardo cribbed without attribution from “An Essay on the External Corn Trade”, a work that was published two years earlier by Robert Torrens, Ricardo’s two other theories of historical note are the labor theory of value, which you may recall is the logical foundation of Marxist economics, and a highly peculiar theory of wages and profit that concludes the rate of profit ultimately rests upon the price of corn.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Seriously. I’m not kidding.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">In fact, despite its massive influence on economists, politicians and trade policy for the last two centuries, the Theory of Comparative Advantage was never mathematically modeled or put to a serious theoretical test for 134 years. And although it was initially claimed that a comparison of textile and automobile production in the U.S.A. versus the United Kingdom broadly confirmed the Ricardian Model, more stringent tests soon demonstrated that neither the model nor the theory on which it was based had much application to the real world.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">In his landmark book, <i>Free Trade Doesn’t Work</i>, Ian Fletcher identified seven specific flaws in Ricardo’s version of comparative advantage, which consist of assumptions that do not necessarily hold in any given trade environment, and in many cases, do not apply at all. These seven dubious assumptions are:</span></span></div><ul><li><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Trade  is intrinsically sustainable.</span></span></div></li><li><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">There  are no external costs.</span></span></div></li><li><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Production  factors move easily between industries.</span></span></div></li><li><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Trade  does not increase income inequality.</span></span></div></li><li><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Capital  is not internationally mobile.</span></span></div></li><li><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Short-term  efficiency causes long-term growth.</span></span></div></li><li><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Trade  does not inhibit foreign productivity.</span></span></div></li></ul><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Of course David Ricardo is not the only economist cited by defenders of free trade. Another common right-wing reference is Henry Hazlitt, the Austrian economist whose <i>Economics In One Lesson</i>, published in 1946, is popular among homeschoolers for its clarity and brevity. Chapter 11 of that work, which is devoted to making the case for free trade, is easily the weakest chapter in the book, as it contains no less than 23 specific errors. Since this article is merely a contribution to an anthology and not a book in its own right, I shall restrict myself to pointing out seven of them.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\"><b>Error #1: </b>Hazlitt assumes that manufacturers are the primary beneficiaries of barriers to trade and therefore the leading advocates of them. This may have once been true, but it is clearly no longer the case. <i>Economics in One Lesson</i> was published in 1946, when the U.S. balance of trade ran a 35 percent surplus and trade amounted to 6.8 percent of GDP. Free trade was operating to the benefit of most American manufacturers and workers alike; since the industrial infrastructures of Europe and Asia were in ruins, few American sectors were at a competitive disadvantage. Like Ricardo, Hazlitt clearly never imagined a scenario when jobs would not be lost to foreign manufacturing competitors, but to the new foreign factories established by the former domestic manufacturers. The additional profit provided by a $5 tariff is now of less interest to the domestic manufacturer than the opportunity to set up a factory in Bangladesh, make the sweater at a lower cost, then import it and sell it for $25. If we leave out the distribution channel, which is the same for both foreign and domestic manufacturers, and assume a profit margin of 50 percent, we can compare the profit margins of the various alternatives.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">At the 50 percent profit margin, we know that the manufacturer’s domestic costs were $15 and his profit was $15 with the protection of the $5 tariff. But Bangladesh has a wage rate that is one-thirtieth that of the USA, so if labor is one-third the cost of production and international shipping is 10 percent of the manufacturing cost, his new production and delivery cost will be $11.17. This reduction of $3.83 in costs means the offshored manufacturer can now afford to sell the imported sweater for 22.34 and still make the same 50 percent profit margin he did before; without tariffs he can compete on price with the $25 English sweaters and actually increase his profit margin by nearly six percent. At the old $30 price, his profit margin has risen to 63 percent, thereby creating a serious incentive to move production to Bangladesh even in the absence of any price pressure from the English sweater makers. Either way, the consumers benefit, the manufacturer benefits, and only the thousands of workers, who lost their $5/sweater jobs, suffer.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">So, the $5 tariff not only protects the domestic manufacturer from the English competitor, but more importantly, protects the worker from the domestic manufacturer as the tariff would reduce the domestic manufacturer’s profit margin from 63 percent to 46 percent. With the tariff in place, the domestic manufacturer has no reason to go to all the trouble and expense to relocate his factory to Bangladesh simply to lose four percent from his profit margin. Hazlitt’s error here is the result of the failure of the theory of comparative advantage to account for the international mobility of capital.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\"><b>Error #2: </b>Hazlitt asserts that the $5 left over from the reduced import price of the sweater will go to help employment in any number of other industries in the United States. It may. Alternatively, it may not. Also, it should be kept in mind that Hazlitt was writing when imports accounted for a trivial 2.9 percent of GDP. They now account for 16.3 percent, so that $5 is nearly <i>six</i> <i>times</i> more likely to go towards increasing employment in industries outside the United States than it was in 1946. Therefore, what was theoretically supposed to be $5 of the tariff going towards U.S. employment must be reduced to $4.19 on average.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\"><b>Error #3: </b>Hazlitt erroneously assumes that the British will buy more from U.S. manufacturers because their possession of U.S. dollars will force them to buy more American goods. This is untrue, however, because the dollar is the world’s reserve currency and is frequently utilized for trade between foreign countries; the British are no more forced to buy American goods due to their possession of dollars than the Thebans were forced to buy Athenian goods due to their possession of silver Athenian talents. </span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\"><b>Error #4: </b>Hazlitt assumes that foreign dollar balances cannot remain perpetually unspent in the United States. But there are presently an estimated 1.25 billion in Eurodollars being held in foreign banks that will never come back to the United States, as they are presently used as the basis for 90 percent of all international loans. Furthermore, the United State has been running a continuous and growing balance of trade deficit in goods since 1976. The $9 billion that went overseas that year has not only not returned to be spent here, but has since increased to $750 billion. 41 years and counting is a long time to wait for this supposedly inevitable return, and moreover, is very unlikely to provide any comfort to the worker who lost his job as a result more than four decades ago.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\"><b>Error #5: </b>Hazlitt assumes that an American worker who loses his job in one sector will automatically find it in another sector. This repeats Ricardo’s mistake and is the sixth false assumption identified by Fletcher. There is no reason to assume that the loss of a job in one sector will create any additional demand in another sector, indeed, to the extent there is worker mobility between industries, all the loss of a job in one sector will do is create downward pressure on wages in the other sectors. There is a hidden and implicit appeal to James Mill here, (or alternatively, to Keynes’s critical formulation of Say’s Law), in the idea that supply somehow magically creates demand. While this can be true in a technological sense, as there was no demand for CD players prior to their invention, it is most certainly not a reliable economic law, as the excess supply of U.S. housing or the dead inventory stock of any business will suffice to demonstrate.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\"><b>Error #</b><b>6</b><b>: </b>Hazlitt assumes that American employment on net balance will not go down, and that American and British production on net balance will go up. This is not necessarily true, being an erroneous conclusion based on the previous error. The American worker may well remain unemployed on a permanent basis, as have one-quarter of the formerly-employed male workers since 1948.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\"><b>Error #</b><b>7</b><b>: </b>Hazlitt assumes that consumers in both countries are better off because they are able to buy what they want where they can get it cheapest. But this is a false assumption because most consumers are also workers, or are dependent upon workers. The consumer who is employed can better afford the $30 domestic sweater than the unemployed consumer can afford the $25 import. Free trade does work to the advantage of a small number of Americans in the financial sector as well as to its foreign beneficiaries, but at an inordinately heavy short-term cost to around 25 percent of Americans as well as a severe long-term cost to the entire American economy.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">The many flaws of Hazlitt’s case notwithstanding, it should be noted that none of the traditional critiques of free trade even begins to address the most fundamental problem with the policy, which is the significant modern increase in the mobility of labor, a factor that has never been properly accounted for by economists or policymakers in the 200 years since David Ricardo published </span><i 12pt;\"=\"\" adobe=\"\" font-size:=\"\" garamond=\"\" pro\",=\"\" serif;=\"\" style=\"font-family: \">The Principles of Political Economy</i><span ,=\"\" 12pt;\"=\"\" adobe=\"\" font-size:=\"\" garamond=\"\" pro\"=\"\" serif;=\"\" style=\"font-family: \">.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><b 12pt;\"=\"\" adobe=\"\" font-size:=\"\" garamond=\"\" pro\",=\"\" serif;=\"\" style=\"font-family: \"><br/></b></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><b 12pt;\"=\"\" adobe=\"\" font-size:=\"\" garamond=\"\" pro\",=\"\" serif;=\"\" style=\"font-family: \">Five Arguments Against Free Trade</b></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Nor is the inability to account for the technology-enhanced mobility of labor the only failure in the free trade model. There are actually five separate and specific arguments against free trade, each of which alone suffices to prove that free trade has had a negative effect on wealthy Western nations. Even more, they show that the freer the trade has been, the worse the effects. In order of their appearance, these five arguments are the empirical, mathematical, nationalist, practical, and logical arguments. And each of these five arguments represents a very serious and substantial challenge to the claim that free trade makes a nation wealthier or better off in the long term.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\"><b>The empirical case</b> against free trade addresses the conventional argument for it. This childishly simple pro-free trade argument has changed very little over the centuries, and was repeated last year in a major essay by Francis Fukuyama in <i>Foreign Affairs</i>. The conventional argument for free trade is a <i>post hoc ergo propter hoc </i>construction which states:</span></span></div><ol><li><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">International  trade has become increasingly free over time.</span></span></div></li><li><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Wealth  has increased during the same period.</span></span></div></li><li><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Therefore,  free trade produces wealth.</span></span></div></li></ol><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">But this is absolutely not true. We have considerable evidence that freer global trade does not <i>necessarily</i> make an individual country wealthier, and in many cases, actually makes it poorer. Although the free trade in goods has considerably increased over the last 50 years, average real wages are lower in the U.S.A. than they were 43 years ago. Still, even though wages are lower, could not the country still be wealthier? Proponents of free trade often cite growing GDP per capita as evidence of a country’s wealth increasing, and it is true that since 1964, U.S. GDP per capita has risen from $3,500 to $54,600, a 15.6 times increase. Many interpret that rise in GDP per capita as proof that the U.S.A. is wealthier, but they are absolutely incorrect to do so because over that same 50-year period, total US debt per capita has risen more than twice as much, by a factor of 34.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">If your income doubles, but your personal debt increases by more than twice that, are you genuinely wealthier? No, of course not! Your perceived increase in wealth is a mirage, and you are actually poorer than you were before. Freer trade has clearly not produced greater wealth for America or Americans, but has instead resulted in <i>greater indebtedness</i>. This is not to say free trade can never benefit a national economy, but we have clear empirical evidence that it has not in the case of the United States over the last five decades. Nor has it been of net benefit to any Western nation once debt is correctly accounted for. Therefore, the conventional pro-free trade argument is obviously and inarguably false on empirical grounds.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\"><b>The mathematical case</b> against free trade is an abstract one that is considerably beyond the ability of most individuals to calculate and confirm for themselves, but it nevertheless merits a brief mention. At its core, free trade theory relies upon the Law of Supply and Demand as articulated by Adam Smith. This well-known law dictates that as prices rise, demand will fall, given constant supply, thereby producing a downward-sloping demand curve. But in his revolutionary <i>Debunking Economics</i>, Australian economist Steve Keen cites the work of William Gorman, who in 1953 utilized mathematical logic to prove that the Law of Demand does not apply to a general market-wide demand curve, but only applies to individual demand curves. Moreover, it is not possible to derive a conventional downward-sloping market-wide demand curve by simply adding together the quantities demanded by all individuals at every possible price; the resulting curve that represents cumulative demand can actually be of almost any shape at all.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">In other words, the combination of all rational consumer preferences results in an irrational market where lower prices may, or may not, increase demand at any given point of supply. This mathematical proof has many implications for economics that have not yet been properly explored by economists, but among the obvious casualties is the theory of comparative advantage. In summary, the math required for free trade to reliably operate in an economically beneficial manner according to the theory of comparative advantage literally does not add up.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\"><b>The practical case</b> against free trade turns the usual free trade attack on tariffs around on the attackers. It is extremely common for free trade advocates to point out that protective tariffs are taxes on domestic citizens, not on foreign producers, and this is true. However, it is false to conclude from this fact, as they do, that these taxes on domestic citizens make the country poorer by raising taxes, because this would only be true if the alternative to taxes in the form of tariffs was no taxes at all. That is obviously not the case, and it will never be the case in any country where the government is also funded by income, property, wealth, and value-added taxes. </span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">It should be readily apparent that a nation possessing a government funded by tariffs will tend to be wealthier and more free than one with a government funded by income taxes and sales taxes, because tariffs are considerably less intrusive on the domestic citizenry, are considerably less expensive to administer, and are massively less economically disruptive than either personal or corporate income taxes. And tariffs are literally nothing more than a sales tax, albeit a very limited form of sales tax that only affects a small percentage of the goods that are available in the national economy.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">In 2020, a complete reliance upon tariffs would mean that less than one-fifth of GDP would be subject to federal taxation instead of all of it being liable to multiple forms of taxation. Even from the conservative small government perspective, it should be entirely obvious that free trade cannot make a country any more wealthy if its import taxes are replaced with income and property taxes.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\"><b>The logical case</b> against free trade is straightforward, and yet is frequently dismissed due to a failure to understand it.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">As Ludwig von Mises wrote in <i>Liberalism</i>, “production is more restricted where the conditions of production are comparatively favorable than would be the case if there were full freedom of migration. Thus, the effects of restricting the freedom of movement are just the same as those of a protective tariff.” This means there is no credible way to rationally argue in favor of the free trade in goods without also accepting that <i>those very same arguments</i> apply to the free trade in services too. There is no meaningful way to distinguish between the argument for the free movement of goods and capital, and the argument for the free movement of labor. From the logical perspective, they are one and the same argument.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Whether it is their intention to do so or not, those who argue for unrestricted free trade are also arguing for <i>un</i><i>restrict</i><i>ed immigration</i>. It is not a coincidence that everywhere free trade policies have been adopted, the level of immigration has increased while the native employment rate has declined. While free trade advocates claim America is wealthier as a result of its freer trade and more liberal immigration policies, the fact that 104 million Americans are now either unemployed or out of the workforce, that they are collectively $73.4 trillion in debt, and that all the jobs created since the 2008 recession went to immigrants are an eloquent and conclusive rebuttal to their assertions. Freer trade with China alone costs the USA 185,000 jobs per year; the resultant increase in the unemployment rate obviously does not make Americans wealthier.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">And last, but most certainly not least, is <b>the nationalist case </b>against free trade. It is very common to hear free trade advocates wonder why we don’t look at international trade the same way we look at domestic trade. As the Austrian economist Robert Murphy put it, “someone might worry about trade deficits with China—whereas not lose a moment’s sleep over interstate trade deficits within the borders of the United States.” But the benefits of domestic trade require people moving from Michigan and Massachusetts to take jobs in California, where they make the goods that are subsequently shipped to Florida, Texas, and other states within U.S. borders. That movement that is required to efficiently provide workers with available jobs in locations that require them to change their residence is called labor mobility, and in the United States, the rate of labor mobility is 3.2 percent per year. </span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">If we extend that rate of labor mobility to the world, which is absolutely necessary if the United States is to receive the the same benefits of international free trade that it presently obtains from domestic free trade, that rate of labor mobility mathematically dictates that nearly <i>half</i> of all Americans would have to emigrate to find jobs in other countries before the age of 35. The benefits of free trade depend upon the most efficient matching of labor with capital, which is why Americans with a talent for robotics would have to travel to where the robotics industry is operating at maximum cost-efficiency, which would presumably be Japan or South Korea, while talented young filmmakers everywhere from Albania to Vietnam would be moving en masse to Hollywood, or Vancouver, or wherever movies were being made most efficiently.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Is the United States genuinely better off if half its children have to leave the country and find jobs elsewhere in the world? Is any nation better off? No, obviously not. Free trade advocates cannot reasonably claim that the national economy will be materially better off if the nation ceases to exist.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\"><b>A Closer Look at Comparative Advantage</b></span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\"><u>Unit Labor Costs</u></span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Britain: 100 cloth, 110 wine</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Portugal: 90 cloth 80 wine</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">A comparison of the unit labor cloths shows that in the absence of transportation costs, it is more efficient for Britain to produce cloth, and Portugal to produce wine. This is because if we assume that the two goods trade at an equal price of 1 unit of cloth for 1 unit of wine, Britain can obtain wine at a cost of 100 labor units by producing cloth and trading, instead of at the cost of 110 units by producing the wine itself, and Portugal can obtain cloth at a cost of 80 units through trade rather than 90 through domestic production.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">So far, so good for the Ricardian model. But now let us introduce the free movement of labor into the equation. In this scenario, both wine and cloth workers will move to Britain, since by doing so they will receive an 11 percent raise and a 38 percent raise, respectively. However, once they get there, the doubling of the labor supply in Britain this immigration causes will quickly cause the price of labor to fall. It will fall considerably, so that Britain’s labor costs are now actually half that of Portugal.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">This is great for Britain! It can now produce the same amount of cloth as before for price of only 47.5 units of labor, and the same amount of wine for 47.5 labor units as well, thereby obtaining an equal quantity of both wine and cloth for less than what it used to cost to produce the wine alone. This will vastly increase profits in the British cloth and wine industries, as well as creating a windfall for the financial industry investing those profits! Granted, this has only happened because wages have fallen by 50 percent; other consequences include how all of the newly unemployed British workers go on the dole or turn to crime to making a living, how the new British voters are inordinately inclined to vote for the Labour Party, thereby imbalancing the British political system, and, over time, how many British women begin bearing half-Portuguese children and thereby reduce the average IQ of the next generation from 100 to 97.5. Fortunately for economists, these are all non-economic factors and therefore can be safely ignored in concluding that free trade and the free movement of labor are beneficial to Britain.</span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">That sounds suspiciously familiar, though, doesn’t it? </span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">In conclusion, the addition of the free movement of labor to the Ricardian model mathematically proves that free trade combined with unrestricted immigration is not only economically beneficial, but is mathematically preferable to comparative advantage by a factor of 1.9, and to pure protectionism by a factor of 2. <i>Q</i><i>uod erat demonstrandum</i><i>. </i></span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">What else can we conclude from this unseemly exercise of the Ricardian Vice?</span></span></div><ul><li><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Ricardo  implicitly postulated the immobility of labor.</span></span></div></li><li><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">The  mobility of labor not only fails to disprove comparative advantage,  but actually strengthens the case for even freer trade so long as  one only considers the case from the perspective of manufacturers in  the country with higher labor costs, and the only factors considered  are the labor costs and the manufacturer’s profits.</span></span></div></li><li><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">The  mobility of labor will eliminate international trade since everyone  will be living in Britain.</span></span></div></li><li><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">The  mobility of labor operates to the detriment of labor.</span></span></div></li><li><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">David  Ricardo and his fellow free traders are dishonest charlatans.</span></span></div></li></ul><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">That being said, the strongest case against free trade does not rest on David Ricardo’s intellectual corpse. It is not even, strictly speaking, entirely economic in nature. </span></span></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><b 12pt;\"=\"\" adobe=\"\" font-size:=\"\" garamond=\"\" pro\",=\"\" serif;=\"\" style=\"font-family: \"><br/></b></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><b 12pt;\"=\"\" adobe=\"\" font-size:=\"\" garamond=\"\" pro\",=\"\" serif;=\"\" style=\"font-family: \">The Vox Day Argument Against Free Trade.</b></div><ol><li><div style=\"margin-bottom: 0in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Free  trade, in its true, complete, and intellectually coherent form, is  not limited to the free movement of goods, but includes the free  movement of capital and labor as well. The “invisible judicial  line” doesn’t magically materialize only when human bodies are  involved.</span></span></div></li><li><div style=\"margin-bottom: 0in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">The  difference between domestic economies and the global international  economy is not trivial, but is substantive, material, and based on  significant genetic, cultural, traditional, and legal differences  between various self-identified peoples. </span></span></div></li><li><div style=\"margin-bottom: 0in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Due  to these differences, free trade will have varying effects on a  nation’s wealth, and it can reduce, as well as raise, a nation’s  standard of living.</span></span></div></li><li><div style=\"margin-bottom: 0in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Regardless,  free trade is totally incompatible with national sovereignty,  democracy, and self-determination, as well as the existence of  independent nation-states with the right and ability to set their  own laws according to the preferences of their nationals. </span></span></div></li><li><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Therefore,  free trade must be opposed by every sovereign, democratic, or  self-determined people who wish to preserve themselves as a free and  distinct nation possessed of its own culture, traditions, and laws. </span></span></li></ol><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><b 12pt;\"=\"\" adobe=\"\" font-size:=\"\" garamond=\"\" pro\",=\"\" serif;=\"\" style=\"font-family: \"><br/></b></div><div style=\"line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><b 12pt;\"=\"\" adobe=\"\" font-size:=\"\" garamond=\"\" pro\",=\"\" serif;=\"\" style=\"font-family: \">Toward a Nationalist Trade Policy</b></div><div style=\"font-weight: normal; line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">To determine an optimal trade policy for anation, it is first necessary to decide what the objectives of that trade policy will be. Furthermore, due to the number of rival interests involved, it is also necessary to order those objectives in terms of their priority.</span></span></div><ol><li><div style=\"font-weight: normal; line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Maintain  the population demographics of the nation.</span></span></div></li><li><div style=\"font-weight: normal; line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Increase  per capita wealth without increasing per capita debt.</span></span></div></li><li><div style=\"font-weight: normal; line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Improve  the state of the physical capital and infrastructure.</span></span></div></li><li><div style=\"font-weight: normal; line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Increase  per capita income.</span></span></div></li><li><div style=\"font-weight: normal; line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Modify  the amount of inequalities of wealth and income.</span></span></div></li></ol><div style=\"font-weight: normal; line-height: 100{de336c7190f620554615b98f51c6a13b1cc922a472176e2638084251692035b3}; margin-bottom: 0.12in;\"><span ,=\"\" adobe=\"\" garamond=\"\" pro\"=\"\" serif;\"=\"\" style=\"font-family: \"><span style=\"font-size: small;\">Before any trade policy can be adopted, the probable consequences for the nation and the economy must be understood and accepted by the people as well as the politicians and corporate leaders. To do otherwise is to risk imbalanced costs and benefits, political upheaval, societal instability, and long-term economic contraction.</span></span></div></div>",
  "content_text": "I was asked to address the intersection of nationalism and economics two years ago, for an anthology that was never published, at least, not to the best of my knowledge. But the conclusions I reached, though not what one could really call timeless, are still definitely relevant as 2019 comes to a close.\nConsider it a Christmas present of sorts to the old school readers who enjoyed my focus on economics in the past.\nNATIONALIST ECONOMICS AND THE NEW RIGHT\nby Vox Day\nIt is one of the great ironies of modern politics that free trade and economic globalism have somehow become identified as not only right-wing policies, but right-wing dogma. This was not historically true, though, as from the very start, free trade has generally been a hallmark of the LEFT side of the political spectrum. If you recall, the infamous mercantilists attacked so furiously by Adam Smith in\nThe Wealth of Nations\nwere, almost to a man, royalists, not revolutionaries, while the great prophet of the Left, Karl Marx, openly advocated free trade on the grounds that it would help bring about world socialist revolution and the emancipation of the proletariat.\nIn the 240 years since Adam Smith triumphed over the mercantilists, the question of free trade has generally revolved around whether it is good for the nation concerned. However, this is not actually the right question to ask, as the more fundamental one is whether free trade and nations are even\ncompatible\n. And, as it turns out, the answer is no.\nBut let us not get ahead of ourselves and instead begin at the historical beginning. It is vital to first understand that the intellectual foundation for free trade is considerably shakier than most conservatives realize, particularly those conservatives who believe that David Ricardo settled the matter once and for all with his articulation of the Theory of Comparative Advantage.\nThe Failure of the Free Trade Champions\nDavid Ricardo was not an economist in the modern professional sense. He was a stockbroker, a successful con artist who put Michael Milken and Bernie Madoff to shame, a politician who purchased his seat in the House of Lords with his ill-gotten gains, and a pamphleteer. His works were not written with an aim of better understanding the matter addressed, but were primarily written as extended opinion editorials meant to advocate specific political policies. Moreover, his arguments were so heavily biased toward his preconceived conclusions that Joseph Schumpeter was moved to describe the custom of economists creating hopelessly impractical theories on the basis of heavily biased simplifications as “the Ricardian Vice”.\nBesides the Theory of Comparative Advantage, which Ricardo cribbed without attribution from “An Essay on the External Corn Trade”, a work that was published two years earlier by Robert Torrens, Ricardo’s two other theories of historical note are the labor theory of value, which you may recall is the logical foundation of Marxist economics, and a highly peculiar theory of wages and profit that concludes the rate of profit ultimately rests upon the price of corn.\nSeriously. I’m not kidding.\nIn fact, despite its massive influence on economists, politicians and trade policy for the last two centuries, the Theory of Comparative Advantage was never mathematically modeled or put to a serious theoretical test for 134 years. And although it was initially claimed that a comparison of textile and automobile production in the U.S.A. versus the United Kingdom broadly confirmed the Ricardian Model, more stringent tests soon demonstrated that neither the model nor the theory on which it was based had much application to the real world.\nIn his landmark book,\nFree Trade Doesn’t Work\n, Ian Fletcher identified seven specific flaws in Ricardo’s version of comparative advantage, which consist of assumptions that do not necessarily hold in any given trade environment, and in many cases, do not apply at all. These seven dubious assumptions are:\nTrade  is intrinsically sustainable.\nThere  are no external costs.\nProduction  factors move easily between industries.\nTrade  does not increase income inequality.\nCapital  is not internationally mobile.\nShort-term  efficiency causes long-term growth.\nTrade  does not inhibit foreign productivity.\nOf course David Ricardo is not the only economist cited by defenders of free trade. Another common right-wing reference is Henry Hazlitt, the Austrian economist whose\nEconomics In One Lesson\n, published in 1946, is popular among homeschoolers for its clarity and brevity. Chapter 11 of that work, which is devoted to making the case for free trade, is easily the weakest chapter in the book, as it contains no less than 23 specific errors. Since this article is merely a contribution to an anthology and not a book in its own right, I shall restrict myself to pointing out seven of them.\nError #1:\nHazlitt assumes that manufacturers are the primary beneficiaries of barriers to trade and therefore the leading advocates of them. This may have once been true, but it is clearly no longer the case.\nEconomics in One Lesson\nwas published in 1946, when the U.S. balance of trade ran a 35 percent surplus and trade amounted to 6.8 percent of GDP. Free trade was operating to the benefit of most American manufacturers and workers alike; since the industrial infrastructures of Europe and Asia were in ruins, few American sectors were at a competitive disadvantage. Like Ricardo, Hazlitt clearly never imagined a scenario when jobs would not be lost to foreign manufacturing competitors, but to the new foreign factories established by the former domestic manufacturers. The additional profit provided by a $5 tariff is now of less interest to the domestic manufacturer than the opportunity to set up a factory in Bangladesh, make the sweater at a lower cost, then import it and sell it for $25. If we leave out the distribution channel, which is the same for both foreign and domestic manufacturers, and assume a profit margin of 50 percent, we can compare the profit margins of the various alternatives.\nAt the 50 percent profit margin, we know that the manufacturer’s domestic costs were $15 and his profit was $15 with the protection of the $5 tariff. But Bangladesh has a wage rate that is one-thirtieth that of the USA, so if labor is one-third the cost of production and international shipping is 10 percent of the manufacturing cost, his new production and delivery cost will be $11.17. This reduction of $3.83 in costs means the offshored manufacturer can now afford to sell the imported sweater for 22.34 and still make the same 50 percent profit margin he did before; without tariffs he can compete on price with the $25 English sweaters and actually increase his profit margin by nearly six percent. At the old $30 price, his profit margin has risen to 63 percent, thereby creating a serious incentive to move production to Bangladesh even in the absence of any price pressure from the English sweater makers. Either way, the consumers benefit, the manufacturer benefits, and only the thousands of workers, who lost their $5/sweater jobs, suffer.\nSo, the $5 tariff not only protects the domestic manufacturer from the English competitor, but more importantly, protects the worker from the domestic manufacturer as the tariff would reduce the domestic manufacturer’s profit margin from 63 percent to 46 percent. With the tariff in place, the domestic manufacturer has no reason to go to all the trouble and expense to relocate his factory to Bangladesh simply to lose four percent from his profit margin. Hazlitt’s error here is the result of the failure of the theory of comparative advantage to account for the international mobility of capital.\nError #2:\nHazlitt asserts that the $5 left over from the reduced import price of the sweater will go to help employment in any number of other industries in the United States. It may. Alternatively, it may not. Also, it should be kept in mind that Hazlitt was writing when imports accounted for a trivial 2.9 percent of GDP. They now account for 16.3 percent, so that $5 is nearly\nsix\ntimes\nmore likely to go towards increasing employment in industries outside the United States than it was in 1946. Therefore, what was theoretically supposed to be $5 of the tariff going towards U.S. employment must be reduced to $4.19 on average.\nError #3:\nHazlitt erroneously assumes that the British will buy more from U.S. manufacturers because their possession of U.S. dollars will force them to buy more American goods. This is untrue, however, because the dollar is the world’s reserve currency and is frequently utilized for trade between foreign countries; the British are no more forced to buy American goods due to their possession of dollars than the Thebans were forced to buy Athenian goods due to their possession of silver Athenian talents.\nError #4:\nHazlitt assumes that foreign dollar balances cannot remain perpetually unspent in the United States. But there are presently an estimated 1.25 billion in Eurodollars being held in foreign banks that will never come back to the United States, as they are presently used as the basis for 90 percent of all international loans. Furthermore, the United State has been running a continuous and growing balance of trade deficit in goods since 1976. The $9 billion that went overseas that year has not only not returned to be spent here, but has since increased to $750 billion. 41 years and counting is a long time to wait for this supposedly inevitable return, and moreover, is very unlikely to provide any comfort to the worker who lost his job as a result more than four decades ago.\nError #5:\nHazlitt assumes that an American worker who loses his job in one sector will automatically find it in another sector. This repeats Ricardo’s mistake and is the sixth false assumption identified by Fletcher. There is no reason to assume that the loss of a job in one sector will create any additional demand in another sector, indeed, to the extent there is worker mobility between industries, all the loss of a job in one sector will do is create downward pressure on wages in the other sectors. There is a hidden and implicit appeal to James Mill here, (or alternatively, to Keynes’s critical formulation of Say’s Law), in the idea that supply somehow magically creates demand. While this can be true in a technological sense, as there was no demand for CD players prior to their invention, it is most certainly not a reliable economic law, as the excess supply of U.S. housing or the dead inventory stock of any business will suffice to demonstrate.\nError #\n6\n:\nHazlitt assumes that American employment on net balance will not go down, and that American and British production on net balance will go up. This is not necessarily true, being an erroneous conclusion based on the previous error. The American worker may well remain unemployed on a permanent basis, as have one-quarter of the formerly-employed male workers since 1948.\nError #\n7\n:\nHazlitt assumes that consumers in both countries are better off because they are able to buy what they want where they can get it cheapest. But this is a false assumption because most consumers are also workers, or are dependent upon workers. The consumer who is employed can better afford the $30 domestic sweater than the unemployed consumer can afford the $25 import. Free trade does work to the advantage of a small number of Americans in the financial sector as well as to its foreign beneficiaries, but at an inordinately heavy short-term cost to around 25 percent of Americans as well as a severe long-term cost to the entire American economy.\nThe many flaws of Hazlitt’s case notwithstanding, it should be noted that none of the traditional critiques of free trade even begins to address the most fundamental problem with the policy, which is the significant modern increase in the mobility of labor, a factor that has never been properly accounted for by economists or policymakers in the 200 years since David Ricardo published\nThe Principles of Political Economy\n.\nFive Arguments Against Free Trade\nNor is the inability to account for the technology-enhanced mobility of labor the only failure in the free trade model. There are actually five separate and specific arguments against free trade, each of which alone suffices to prove that free trade has had a negative effect on wealthy Western nations. Even more, they show that the freer the trade has been, the worse the effects. In order of their appearance, these five arguments are the empirical, mathematical, nationalist, practical, and logical arguments. And each of these five arguments represents a very serious and substantial challenge to the claim that free trade makes a nation wealthier or better off in the long term.\nThe empirical case\nagainst free trade addresses the conventional argument for it. This childishly simple pro-free trade argument has changed very little over the centuries, and was repeated last year in a major essay by Francis Fukuyama in\nForeign Affairs\n. The conventional argument for free trade is a\npost hoc ergo propter hoc\nconstruction which states:\nInternational  trade has become increasingly free over time.\nWealth  has increased during the same period.\nTherefore,  free trade produces wealth.\nBut this is absolutely not true. We have considerable evidence that freer global trade does not\nnecessarily\nmake an individual country wealthier, and in many cases, actually makes it poorer. Although the free trade in goods has considerably increased over the last 50 years, average real wages are lower in the U.S.A. than they were 43 years ago. Still, even though wages are lower, could not the country still be wealthier? Proponents of free trade often cite growing GDP per capita as evidence of a country’s wealth increasing, and it is true that since 1964, U.S. GDP per capita has risen from $3,500 to $54,600, a 15.6 times increase. Many interpret that rise in GDP per capita as proof that the U.S.A. is wealthier, but they are absolutely incorrect to do so because over that same 50-year period, total US debt per capita has risen more than twice as much, by a factor of 34.\nIf your income doubles, but your personal debt increases by more than twice that, are you genuinely wealthier? No, of course not! Your perceived increase in wealth is a mirage, and you are actually poorer than you were before. Freer trade has clearly not produced greater wealth for America or Americans, but has instead resulted in\ngreater indebtedness\n. This is not to say free trade can never benefit a national economy, but we have clear empirical evidence that it has not in the case of the United States over the last five decades. Nor has it been of net benefit to any Western nation once debt is correctly accounted for. Therefore, the conventional pro-free trade argument is obviously and inarguably false on empirical grounds.\nThe mathematical case\nagainst free trade is an abstract one that is considerably beyond the ability of most individuals to calculate and confirm for themselves, but it nevertheless merits a brief mention. At its core, free trade theory relies upon the Law of Supply and Demand as articulated by Adam Smith. This well-known law dictates that as prices rise, demand will fall, given constant supply, thereby producing a downward-sloping demand curve. But in his revolutionary\nDebunking Economics\n, Australian economist Steve Keen cites the work of William Gorman, who in 1953 utilized mathematical logic to prove that the Law of Demand does not apply to a general market-wide demand curve, but only applies to individual demand curves. Moreover, it is not possible to derive a conventional downward-sloping market-wide demand curve by simply adding together the quantities demanded by all individuals at every possible price; the resulting curve that represents cumulative demand can actually be of almost any shape at all.\nIn other words, the combination of all rational consumer preferences results in an irrational market where lower prices may, or may not, increase demand at any given point of supply. This mathematical proof has many implications for economics that have not yet been properly explored by economists, but among the obvious casualties is the theory of comparative advantage. In summary, the math required for free trade to reliably operate in an economically beneficial manner according to the theory of comparative advantage literally does not add up.\nThe practical case\nagainst free trade turns the usual free trade attack on tariffs around on the attackers. It is extremely common for free trade advocates to point out that protective tariffs are taxes on domestic citizens, not on foreign producers, and this is true. However, it is false to conclude from this fact, as they do, that these taxes on domestic citizens make the country poorer by raising taxes, because this would only be true if the alternative to taxes in the form of tariffs was no taxes at all. That is obviously not the case, and it will never be the case in any country where the government is also funded by income, property, wealth, and value-added taxes.\nIt should be readily apparent that a nation possessing a government funded by tariffs will tend to be wealthier and more free than one with a government funded by income taxes and sales taxes, because tariffs are considerably less intrusive on the domestic citizenry, are considerably less expensive to administer, and are massively less economically disruptive than either personal or corporate income taxes. And tariffs are literally nothing more than a sales tax, albeit a very limited form of sales tax that only affects a small percentage of the goods that are available in the national economy.\nIn 2020, a complete reliance upon tariffs would mean that less than one-fifth of GDP would be subject to federal taxation instead of all of it being liable to multiple forms of taxation. Even from the conservative small government perspective, it should be entirely obvious that free trade cannot make a country any more wealthy if its import taxes are replaced with income and property taxes.\nThe logical case\nagainst free trade is straightforward, and yet is frequently dismissed due to a failure to understand it.\nAs Ludwig von Mises wrote in\nLiberalism\n, “production is more restricted where the conditions of production are comparatively favorable than would be the case if there were full freedom of migration. Thus, the effects of restricting the freedom of movement are just the same as those of a protective tariff.” This means there is no credible way to rationally argue in favor of the free trade in goods without also accepting that\nthose very same arguments\napply to the free trade in services too. There is no meaningful way to distinguish between the argument for the free movement of goods and capital, and the argument for the free movement of labor. From the logical perspective, they are one and the same argument.\nWhether it is their intention to do so or not, those who argue for unrestricted free trade are also arguing for\nun\nrestrict\ned immigration\n. It is not a coincidence that everywhere free trade policies have been adopted, the level of immigration has increased while the native employment rate has declined. While free trade advocates claim America is wealthier as a result of its freer trade and more liberal immigration policies, the fact that 104 million Americans are now either unemployed or out of the workforce, that they are collectively $73.4 trillion in debt, and that all the jobs created since the 2008 recession went to immigrants are an eloquent and conclusive rebuttal to their assertions. Freer trade with China alone costs the USA 185,000 jobs per year; the resultant increase in the unemployment rate obviously does not make Americans wealthier.\nAnd last, but most certainly not least, is\nthe nationalist case\nagainst free trade. It is very common to hear free trade advocates wonder why we don’t look at international trade the same way we look at domestic trade. As the Austrian economist Robert Murphy put it, “someone might worry about trade deficits with China—whereas not lose a moment’s sleep over interstate trade deficits within the borders of the United States.” But the benefits of domestic trade require people moving from Michigan and Massachusetts to take jobs in California, where they make the goods that are subsequently shipped to Florida, Texas, and other states within U.S. borders. That movement that is required to efficiently provide workers with available jobs in locations that require them to change their residence is called labor mobility, and in the United States, the rate of labor mobility is 3.2 percent per year.\nIf we extend that rate of labor mobility to the world, which is absolutely necessary if the United States is to receive the the same benefits of international free trade that it presently obtains from domestic free trade, that rate of labor mobility mathematically dictates that nearly\nhalf\nof all Americans would have to emigrate to find jobs in other countries before the age of 35. The benefits of free trade depend upon the most efficient matching of labor with capital, which is why Americans with a talent for robotics would have to travel to where the robotics industry is operating at maximum cost-efficiency, which would presumably be Japan or South Korea, while talented young filmmakers everywhere from Albania to Vietnam would be moving en masse to Hollywood, or Vancouver, or wherever movies were being made most efficiently.\nIs the United States genuinely better off if half its children have to leave the country and find jobs elsewhere in the world? Is any nation better off? No, obviously not. Free trade advocates cannot reasonably claim that the national economy will be materially better off if the nation ceases to exist.\nA Closer Look at Comparative Advantage\nUnit Labor Costs\nBritain: 100 cloth, 110 wine\nPortugal: 90 cloth 80 wine\nA comparison of the unit labor cloths shows that in the absence of transportation costs, it is more efficient for Britain to produce cloth, and Portugal to produce wine. This is because if we assume that the two goods trade at an equal price of 1 unit of cloth for 1 unit of wine, Britain can obtain wine at a cost of 100 labor units by producing cloth and trading, instead of at the cost of 110 units by producing the wine itself, and Portugal can obtain cloth at a cost of 80 units through trade rather than 90 through domestic production.\nSo far, so good for the Ricardian model. But now let us introduce the free movement of labor into the equation. In this scenario, both wine and cloth workers will move to Britain, since by doing so they will receive an 11 percent raise and a 38 percent raise, respectively. However, once they get there, the doubling of the labor supply in Britain this immigration causes will quickly cause the price of labor to fall. It will fall considerably, so that Britain’s labor costs are now actually half that of Portugal.\nThis is great for Britain! It can now produce the same amount of cloth as before for price of only 47.5 units of labor, and the same amount of wine for 47.5 labor units as well, thereby obtaining an equal quantity of both wine and cloth for less than what it used to cost to produce the wine alone. This will vastly increase profits in the British cloth and wine industries, as well as creating a windfall for the financial industry investing those profits! Granted, this has only happened because wages have fallen by 50 percent; other consequences include how all of the newly unemployed British workers go on the dole or turn to crime to making a living, how the new British voters are inordinately inclined to vote for the Labour Party, thereby imbalancing the British political system, and, over time, how many British women begin bearing half-Portuguese children and thereby reduce the average IQ of the next generation from 100 to 97.5. Fortunately for economists, these are all non-economic factors and therefore can be safely ignored in concluding that free trade and the free movement of labor are beneficial to Britain.\nThat sounds suspiciously familiar, though, doesn’t it?\nIn conclusion, the addition of the free movement of labor to the Ricardian model mathematically proves that free trade combined with unrestricted immigration is not only economically beneficial, but is mathematically preferable to comparative advantage by a factor of 1.9, and to pure protectionism by a factor of 2.\nQ\nuod erat demonstrandum\n.\nWhat else can we conclude from this unseemly exercise of the Ricardian Vice?\nRicardo  implicitly postulated the immobility of labor.\nThe  mobility of labor not only fails to disprove comparative advantage,  but actually strengthens the case for even freer trade so long as  one only considers the case from the perspective of manufacturers in  the country with higher labor costs, and the only factors considered  are the labor costs and the manufacturer’s profits.\nThe  mobility of labor will eliminate international trade since everyone  will be living in Britain.\nThe  mobility of labor operates to the detriment of labor.\nDavid  Ricardo and his fellow free traders are dishonest charlatans.\nThat being said, the strongest case against free trade does not rest on David Ricardo’s intellectual corpse. It is not even, strictly speaking, entirely economic in nature.\nThe Vox Day Argument Against Free Trade.\nFree  trade, in its true, complete, and intellectually coherent form, is  not limited to the free movement of goods, but includes the free  movement of capital and labor as well. The “invisible judicial  line” doesn’t magically materialize only when human bodies are  involved.\nThe  difference between domestic economies and the global international  economy is not trivial, but is substantive, material, and based on  significant genetic, cultural, traditional, and legal differences  between various self-identified peoples.\nDue  to these differences, free trade will have varying effects on a  nation’s wealth, and it can reduce, as well as raise, a nation’s  standard of living.\nRegardless,  free trade is totally incompatible with national sovereignty,  democracy, and self-determination, as well as the existence of  independent nation-states with the right and ability to set their  own laws according to the preferences of their nationals.\nTherefore,  free trade must be opposed by every sovereign, democratic, or  self-determined people who wish to preserve themselves as a free and  distinct nation possessed of its own culture, traditions, and laws.\nToward a Nationalist Trade Policy\nTo determine an optimal trade policy for anation, it is first necessary to decide what the objectives of that trade policy will be. Furthermore, due to the number of rival interests involved, it is also necessary to order those objectives in terms of their priority.\nMaintain  the population demographics of the nation.\nIncrease  per capita wealth without increasing per capita debt.\nImprove  the state of the physical capital and infrastructure.\nIncrease  per capita income.\nModify  the amount of inequalities of wealth and income.\nBefore any trade policy can be adopted, the probable consequences for the nation and the economy must be understood and accepted by the people as well as the politicians and corporate leaders. To do otherwise is to risk imbalanced costs and benefits, political upheaval, societal instability, and long-term economic contraction.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-12-25T15:43:49+00:00"
}