{
  "url": "https://voxday.net/2019/12/18/please-retract-this-smear/",
  "scraped_at": "2025-12-21T03:09:43.728069",
  "title": "“Please retract this smear”",
  "date_display": "December 18, 2019",
  "date_iso": "2019-12-18T11:40:21+00:00",
  "date_from_url": "2019-12-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now this is funny. Evan Schulz wants me to “retract this smear” against him. And precisely what “smear” is that?</p><blockquote class=\"tr_bq\"><p>I have never been in contact with Davey Crocko, and am not attempting to be an insider “whisleblower”. I am neither. I am not a bear, I am not VFM. All my interactions with Vox have been via email. All my YouTube comments are public and I stand by them. Please retract this smear.</p></blockquote><p>So, Mr. Schulz believes a perfectly factual statement concerning the POSSIBILITY that he MIGHT be someone, posted with evidence of his direct connection to the individual concerned in the form of his comments on the latter’s channel, is a smear, while he stands by the following false statements:</p><ul><li>“You are dead on with the scamming and ponzi scheme angle”</li><li>“this grifting”</li><li>“the constant grifting and lying”</li><li>“many of us who respected Vox and have been involved with his projects in the past have become disillusioned”</li></ul><p>He also asserted the following via email:</p><ul><li>“Either Owen is too dumb to realize this, or he is a malicious actor.”</li><li>“The remainder of the Bears that still put up with him are cultist sycophants.”</li></ul><p>Mr. Schulz appears to be too stupid to realize that he has very publicly published several false statements that are damaging to multiple persons’ reputations, and that in doing so he has committed several acts of written defamation. In addition to those acts, he has also insulted every single Unauthorized, Castalia House, and Arkhaven customer, and the entire community of Bears.</p><p>As I told him in an email, the only one “fallaciously smearing” anyone is him. However, in the interest of accuracy, I have posted an update to <a href=\"http://voxday.blogspot.com/2019/12/a-nonexistent-insider.html\">the original post</a> making it clear that he denies being the individual who emailed Owen’s anklebiter and claimed to be VFM and an Annual member.</p><p>Unfortunately for Evan Schulz and his preference to not be a public figure, his defamatory statements are now part of the public record, and will be available to every friend, foe, family member, and prospective employer in perpetuity.</p><p>One thing that people tend to forget is that I’ve been a public figure for 26 years, ever since my weekly column began appearing, complete with my picture, in the <i>St. Paul Pioneer Press</i>. This means that I am very, very accustomed to dealing with all of the various problems and challenges and complications that entails in a way that most people are not. So, if you are a self-appointed critic, you just may want to think twice before getting into a written conflict with me, because I will never hesitate to ensure that your words will follow you around for the rest of your life.</p><p>I have had to deal with that for most of my adult life. Why do you think you shouldn’t have to do the same?</p></div>",
  "content_text": "Now this is funny. Evan Schulz wants me to “retract this smear” against him. And precisely what “smear” is that?\nI have never been in contact with Davey Crocko, and am not attempting to be an insider “whisleblower”. I am neither. I am not a bear, I am not VFM. All my interactions with Vox have been via email. All my YouTube comments are public and I stand by them. Please retract this smear.\nSo, Mr. Schulz believes a perfectly factual statement concerning the POSSIBILITY that he MIGHT be someone, posted with evidence of his direct connection to the individual concerned in the form of his comments on the latter’s channel, is a smear, while he stands by the following false statements:\n“You are dead on with the scamming and ponzi scheme angle”\n“this grifting”\n“the constant grifting and lying”\n“many of us who respected Vox and have been involved with his projects in the past have become disillusioned”\nHe also asserted the following via email:\n“Either Owen is too dumb to realize this, or he is a malicious actor.”\n“The remainder of the Bears that still put up with him are cultist sycophants.”\nMr. Schulz appears to be too stupid to realize that he has very publicly published several false statements that are damaging to multiple persons’ reputations, and that in doing so he has committed several acts of written defamation. In addition to those acts, he has also insulted every single Unauthorized, Castalia House, and Arkhaven customer, and the entire community of Bears.\nAs I told him in an email, the only one “fallaciously smearing” anyone is him. However, in the interest of accuracy, I have posted an update to\nthe original post\nmaking it clear that he denies being the individual who emailed Owen’s anklebiter and claimed to be VFM and an Annual member.\nUnfortunately for Evan Schulz and his preference to not be a public figure, his defamatory statements are now part of the public record, and will be available to every friend, foe, family member, and prospective employer in perpetuity.\nOne thing that people tend to forget is that I’ve been a public figure for 26 years, ever since my weekly column began appearing, complete with my picture, in the\nSt. Paul Pioneer Press\n. This means that I am very, very accustomed to dealing with all of the various problems and challenges and complications that entails in a way that most people are not. So, if you are a self-appointed critic, you just may want to think twice before getting into a written conflict with me, because I will never hesitate to ensure that your words will follow you around for the rest of your life.\nI have had to deal with that for most of my adult life. Why do you think you shouldn’t have to do the same?",
  "tags": [
    "anklebiters"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-12-18T11:40:21+00:00"
}