{
  "url": "https://voxday.net/2019/12/16/relax-mcrapey/",
  "scraped_at": "2025-12-21T03:09:25.886758",
  "title": "Relax, McRapey",
  "date_display": "December 16, 2019",
  "date_iso": "2019-12-16T02:05:39+00:00",
  "date_from_url": "2019-12-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Scalzi looks back over the last ten years of his literary career and devotes nearly one-third of the article – 31.6 percent – <a href=\"https://whatever.scalzi.com/2019/12/07/the-10s-in-review-my-career/\">to his critics</a>:</p><blockquote><p>Any discussion of my career over the last decade needs to include the antipathy of me by a certain cadre of right-wing SF writers and fans, a group which overlaps (considerably) with the “Sad/Rabid Puppies” who publicly shat themselves so dramatically during the middle bit of the decade with regard to the Hugo Awards and other aspects of the business and community of SF/F literature. I noticed the first real push of the antipathy after Redshirts won the Hugo, and certain dudes suggested that Redshirts won because I had sucked up to the Social Justice Warriors sufficiently, rather than because, say, it was a popular book riffing off a beloved science fiction franchise in a clever and affectionate way, written by a writer who’d been nominated for Best Novel a few times before.</p><p>In the full bloom of the Puppy beclownery there was more of the same, a fair amount of snide discussion of my sexuality and gender, and general allegations that my sales numbers were inflated and/or propped up by bulk purchases by my publisher, which, by the way, was doing terribly and would soon be out of business. My personal favorite bit of this was when there was a long discussion about how my 2014 novel Lock In had been a massive sales failure and that Tor was about to drop me as an author; this discussion was happening simultaneously with me negotiating with Tor for my multi-book, multi-year, multimillion-dollar contract (which included not one but two sequels to Lock In). When the contract was announced, the narrative shifted to how much more I would have made self-publishing, and then later how I’d never really make as much money as the public figure of the contract. Which, well, okay, dudes. In time most of them have left off this nonsense, but there are a few of them still out there on this bullshit — why, I was chucklingly misgendered just this week!</p><p>What is it about me that bugged and in some cases still bugs these dudes? If you ask them they will give you all sorts of reasons, but having dealt with this nonsense for a better part of a decade I’ll tell you it’s mostly envy, and frustration about the state of their own careers, which they feel should be better because they write the sort of science fiction they’ve always loved and assume others still love as well. And which I also do, so why the hell do I get the big contracts and they’re (mostly) left to scrape by? There has to be something else involved — thus the secret cabal of SJWs, bulk purchases, also I’m gay and/or trans and thus not a man at all, hur hur hur. Add to this the fact that at least a couple of these dudes legit dislike me for other reasons (most of which boil down to the fact they can’t argue their way out of a paper bag and at one point or another I pointed that out to them in public), and some of them just happen to be bigoted as fuck, and you’ve got a fairly toxic mix of resentment and complete bullshit.</p><p>This hasn’t affected my career in any meaningful way — see the summary earlier in the piece — but on a personal level it could be tiresome. I’m guilty of taunting some of these dickheads on occasion, because they deserve the taunting and because I know my successes irritate the shit out of them. But mostly I’m glad it’s largely done and over with, save a few stragglers. I think after a certain point it just became difficult to argue that I was a failure, and that their doing so just accentuated their own relative positions, which they preferred not to do. And also, after a certain point you do just have to get on with your life and write your things. To the extent that some of them are doing that, good for them. Those that aren’t, well. Bless your hearts, dudes.</p></blockquote><p>As always, Ol’ Johnny is lying and attempting to retroactively spin the narrative when he thinks no one is going to call him on it. No one was ever saying that he was a failure – quite to the contrary, he is almost certainly science fiction’s most <i>financially </i>successful grifter of the last fifty years.</p><p>What we said, and still say to this day, and what we can prove, is that he is a serial liar, a fraud, and a literary mediocrity. That’s all there ever was to it. And the reason no one even bothers to criticize him any more is because it is obvious to everyone that he is over and done. He can relax now. The hounds, like everyone else, have lost interest in him.</p></div>",
  "content_text": "John Scalzi looks back over the last ten years of his literary career and devotes nearly one-third of the article – 31.6 percent –\nto his critics\n:\nAny discussion of my career over the last decade needs to include the antipathy of me by a certain cadre of right-wing SF writers and fans, a group which overlaps (considerably) with the “Sad/Rabid Puppies” who publicly shat themselves so dramatically during the middle bit of the decade with regard to the Hugo Awards and other aspects of the business and community of SF/F literature. I noticed the first real push of the antipathy after Redshirts won the Hugo, and certain dudes suggested that Redshirts won because I had sucked up to the Social Justice Warriors sufficiently, rather than because, say, it was a popular book riffing off a beloved science fiction franchise in a clever and affectionate way, written by a writer who’d been nominated for Best Novel a few times before.\nIn the full bloom of the Puppy beclownery there was more of the same, a fair amount of snide discussion of my sexuality and gender, and general allegations that my sales numbers were inflated and/or propped up by bulk purchases by my publisher, which, by the way, was doing terribly and would soon be out of business. My personal favorite bit of this was when there was a long discussion about how my 2014 novel Lock In had been a massive sales failure and that Tor was about to drop me as an author; this discussion was happening simultaneously with me negotiating with Tor for my multi-book, multi-year, multimillion-dollar contract (which included not one but two sequels to Lock In). When the contract was announced, the narrative shifted to how much more I would have made self-publishing, and then later how I’d never really make as much money as the public figure of the contract. Which, well, okay, dudes. In time most of them have left off this nonsense, but there are a few of them still out there on this bullshit — why, I was chucklingly misgendered just this week!\nWhat is it about me that bugged and in some cases still bugs these dudes? If you ask them they will give you all sorts of reasons, but having dealt with this nonsense for a better part of a decade I’ll tell you it’s mostly envy, and frustration about the state of their own careers, which they feel should be better because they write the sort of science fiction they’ve always loved and assume others still love as well. And which I also do, so why the hell do I get the big contracts and they’re (mostly) left to scrape by? There has to be something else involved — thus the secret cabal of SJWs, bulk purchases, also I’m gay and/or trans and thus not a man at all, hur hur hur. Add to this the fact that at least a couple of these dudes legit dislike me for other reasons (most of which boil down to the fact they can’t argue their way out of a paper bag and at one point or another I pointed that out to them in public), and some of them just happen to be bigoted as fuck, and you’ve got a fairly toxic mix of resentment and complete bullshit.\nThis hasn’t affected my career in any meaningful way — see the summary earlier in the piece — but on a personal level it could be tiresome. I’m guilty of taunting some of these dickheads on occasion, because they deserve the taunting and because I know my successes irritate the shit out of them. But mostly I’m glad it’s largely done and over with, save a few stragglers. I think after a certain point it just became difficult to argue that I was a failure, and that their doing so just accentuated their own relative positions, which they preferred not to do. And also, after a certain point you do just have to get on with your life and write your things. To the extent that some of them are doing that, good for them. Those that aren’t, well. Bless your hearts, dudes.\nAs always, Ol’ Johnny is lying and attempting to retroactively spin the narrative when he thinks no one is going to call him on it. No one was ever saying that he was a failure – quite to the contrary, he is almost certainly science fiction’s most\nfinancially\nsuccessful grifter of the last fifty years.\nWhat we said, and still say to this day, and what we can prove, is that he is a serial liar, a fraud, and a literary mediocrity. That’s all there ever was to it. And the reason no one even bothers to criticize him any more is because it is obvious to everyone that he is over and done. He can relax now. The hounds, like everyone else, have lost interest in him.",
  "tags": [
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-12-16T02:05:39+00:00"
}