{
  "url": "https://voxday.net/2019/12/09/remoras-think-they-power-the-shark/",
  "scraped_at": "2025-12-21T03:08:36.061934",
  "title": "Remoras think they power the shark",
  "date_display": "December 9, 2019",
  "date_iso": "2019-12-09T01:48:10+00:00",
  "date_from_url": "2019-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ron Unz, quite rightly, has <a href=\"http://www.unz.com/announcement/monthly-fees-for-heavy-users/#new_comments\">broached the idea</a> of offering subscriptions to the Unz Review and tying it to the amount of comments a user is able to make.</p><blockquote><p>The underlying principle is simple. If you spend a great deal of time doing something, then you have empirically demonstrated that it must be worth the hourly value of your time. And it hardly seems unreasonable to financially contribute a small additional fraction to help support the iconoclastic writers who are providing that service.</p><p>Restricting access to our webzine to casual or ordinary readers would defeat our entire purpose of widely disseminating important and controversial material. But I think that our heavier website users, perhaps those who spend more than 5 or 10 hours per month here, should be encouraged or even required to support it. A stepped-fee somewhere in the range of $1 per hour seems fairly reasonable, and such a figure would go a long way toward covering the payments to our existing writers, allowing for further expansion, and helping to make this website self-sustaining. I doubt that a charge of $1/hour would strain many budgets given that it’s much less than the cost of a cup of coffee or most daily newspapers.</p><p>A substantial fraction of our heavy readers are probably ideologically-committed individuals, who might welcome a chance to support writers and thinkers whose content they often admire and whose writing may rarely be found elsewhere.</p><p>Perhaps the handful of irritating “trolls” possibly employed by various hostile organizations will be annoyed at having to request an expense account payment to cover such costs, causing them to effectively subsidize the distribution of ideas they abhor and would eagerly censor. But I think they deserve such a fate, and if they choose instead to permanently depart, I doubt they will be much missed.</p><p>The exact details and payment methodology will need to be determined, perhaps involving Patreon or other similar systems as an option. But I thought I’d first open on a discussion on this general topic and see what thoughts or suggestions our readers had.</p></blockquote><p>Needless to say, this perfectly reasonable evolution has not gone over well with the troll brigade or the free lunch crowd there. One example of a typical response:</p><blockquote><p>You mean he’d really like to censor opinions he doesn’t like but he doesn’t want to be seen to be doing so? In other words he’s just like everyone else. He believes in freedom of speech but doesn’t really think it should apply to people he disagrees with?</p><p>If that’s his intention he is choosing absolutely the worst way to do it. He’ll end up with just as many crazies and trolls as he has now but he’ll have chased away the thoughtful commenters.</p><p>And to be brutally honest, in general the comments here are a hell of a lot better and more interesting than the articles. Most of the articles are puerile or they’re simply rants. Most of the “writers” here are here because they can’t get published elsewhere, not because they’re controversial but because they’re nuts. There are three or four really good writers here and that’s about it.</p><p>I think Mr Unz will discover that most people come here for the lively discussions in the comment sections, not for the articles. He seems to be aiming to destroy the one great asset that the site has.</p></blockquote><p>I’ve heard this self-serving, narcissistic argument every time I turned comment moderation on over the past 16 years. The fact that there are around 100 non-commenting readers for every commenter never seems to register with them, nor does the fact that when comments were turned entirely off, the site traffic here actually <i>increased </i>by about five percent.</p><p>Now, I’m willing to permit comments here as a courtesy to regular readers who want them. I think they can be a net benefit to everyone here, although it is clear that open and anonymous commenting is unfortunately no longer viable. But commenters should not delude themselves. No one – literally no one – is primarily here to read the comments.</p><p>Bonus project: identify the key word that gives away the commenter’s SSH game.</p><p><b>ANSWER: </b>“thoughtful”. It’s not the only indicator, and a number of people correctly pointed to the obvious “seems”, but I was interested to see if anyone would spot a tell that I have not previously pointed out. One thing I have noticed over time is that only Gammas ever describe themselves as thoughtful. One can always tell that a blog is going to be meandering, boring, pointless, and self-absorbed when it advertises itself as featuring “thoughtful commentary”, as just about every failed blog started by a journalist in the early 2000s did.</p></div>",
  "content_text": "Ron Unz, quite rightly, has\nbroached the idea\nof offering subscriptions to the Unz Review and tying it to the amount of comments a user is able to make.\nThe underlying principle is simple. If you spend a great deal of time doing something, then you have empirically demonstrated that it must be worth the hourly value of your time. And it hardly seems unreasonable to financially contribute a small additional fraction to help support the iconoclastic writers who are providing that service.\nRestricting access to our webzine to casual or ordinary readers would defeat our entire purpose of widely disseminating important and controversial material. But I think that our heavier website users, perhaps those who spend more than 5 or 10 hours per month here, should be encouraged or even required to support it. A stepped-fee somewhere in the range of $1 per hour seems fairly reasonable, and such a figure would go a long way toward covering the payments to our existing writers, allowing for further expansion, and helping to make this website self-sustaining. I doubt that a charge of $1/hour would strain many budgets given that it’s much less than the cost of a cup of coffee or most daily newspapers.\nA substantial fraction of our heavy readers are probably ideologically-committed individuals, who might welcome a chance to support writers and thinkers whose content they often admire and whose writing may rarely be found elsewhere.\nPerhaps the handful of irritating “trolls” possibly employed by various hostile organizations will be annoyed at having to request an expense account payment to cover such costs, causing them to effectively subsidize the distribution of ideas they abhor and would eagerly censor. But I think they deserve such a fate, and if they choose instead to permanently depart, I doubt they will be much missed.\nThe exact details and payment methodology will need to be determined, perhaps involving Patreon or other similar systems as an option. But I thought I’d first open on a discussion on this general topic and see what thoughts or suggestions our readers had.\nNeedless to say, this perfectly reasonable evolution has not gone over well with the troll brigade or the free lunch crowd there. One example of a typical response:\nYou mean he’d really like to censor opinions he doesn’t like but he doesn’t want to be seen to be doing so? In other words he’s just like everyone else. He believes in freedom of speech but doesn’t really think it should apply to people he disagrees with?\nIf that’s his intention he is choosing absolutely the worst way to do it. He’ll end up with just as many crazies and trolls as he has now but he’ll have chased away the thoughtful commenters.\nAnd to be brutally honest, in general the comments here are a hell of a lot better and more interesting than the articles. Most of the articles are puerile or they’re simply rants. Most of the “writers” here are here because they can’t get published elsewhere, not because they’re controversial but because they’re nuts. There are three or four really good writers here and that’s about it.\nI think Mr Unz will discover that most people come here for the lively discussions in the comment sections, not for the articles. He seems to be aiming to destroy the one great asset that the site has.\nI’ve heard this self-serving, narcissistic argument every time I turned comment moderation on over the past 16 years. The fact that there are around 100 non-commenting readers for every commenter never seems to register with them, nor does the fact that when comments were turned entirely off, the site traffic here actually\nincreased\nby about five percent.\nNow, I’m willing to permit comments here as a courtesy to regular readers who want them. I think they can be a net benefit to everyone here, although it is clear that open and anonymous commenting is unfortunately no longer viable. But commenters should not delude themselves. No one – literally no one – is primarily here to read the comments.\nBonus project: identify the key word that gives away the commenter’s SSH game.\nANSWER:\n“thoughtful”. It’s not the only indicator, and a number of people correctly pointed to the obvious “seems”, but I was interested to see if anyone would spot a tell that I have not previously pointed out. One thing I have noticed over time is that only Gammas ever describe themselves as thoughtful. One can always tell that a blog is going to be meandering, boring, pointless, and self-absorbed when it advertises itself as featuring “thoughtful commentary”, as just about every failed blog started by a journalist in the early 2000s did.",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-12-09T01:48:10+00:00"
}