{
  "url": "https://voxday.net/2019/12/09/sexual-immorality-and-the-decline-of-the-west/",
  "scraped_at": "2025-12-21T03:08:39.381211",
  "title": "Sexual immorality and the decline of the West",
  "date_display": "December 9, 2019",
  "date_iso": "2019-12-09T14:13:18+00:00",
  "date_from_url": "2019-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://frjohnpeck.com/why-sexual-morality-may-be-far-more-important-than-you-ever-thought/\">This summary of J.D. Unwin’s work</a> from the 1930s is the practical application of the theoretical argument that connects Western post-Christianity to the observable decline of the West:</p><blockquote><ol><li><b>Effect of sexual constraints:</b> Increased sexual constraints, either pre or post-nuptial, always led to increased flourishing of a culture. Conversely, increased sexual freedom always led to the collapse of a culture three generations later. </li><li><b>Single most influential factor:</b> Surprisingly, the data revealed that the single most important correlation with the flourishing of a culture was whether pre-nuptial chastity was required or not. It had a very significant effect either way.</li><li><b>Highest flourishing of culture:</b> The most powerful combination was pre-nuptial chastity coupled with “absolute monogamy”. Rationalist cultures that retained this combination for at least three generations exceeded all other cultures in every area, including literature, art, science, furniture, architecture, engineering, and agriculture. Only three out of the eighty-six cultures studied ever attained this level.</li><li><b>Effect of abandoning prenuptial chastity: </b>When strict prenuptial chastity was no longer the norm, absolute monogamy, deism, and rational thinking also disappeared within three generations.</li><li><b>Total sexual freedom:</b> If total sexual freedom was embraced by a culture, that culture collapsed within three generations to the lowest state of flourishing — which Unwin describes as “inert” and at a “dead level of conception” and is characterized by people who have little interest in much else other than their own wants and needs. At this level, the culture is usually conquered or taken over by another culture with greater social energy.</li><li><b>Time lag:</b> If there is a change in sexual constraints, either increased or decreased restraints, the full effect of that change is not realized until the third generation. </li></ol><p>Thanks to the rationalist generations that preceded them, the first generation of a society setting aside its sexual restraints can still enjoy its new-found sexual freedom before any significant decline in culture, but the data shows that this “having your cake and eating it too” phase lasts a maximum of one generation before the decline sets in. Unwin wrote:</p><p><i>The history of these societies consists of a series of monotonous repetitions; and it is difficult to decide which aspect of the story is the more significant: the lamentable lack of original thought which in each case the reformers displayed, or the amazing alacrity with which, after a period of intense compulsory continence (sexual restraint), the human organism seizes the earliest opportunity to satisfy its innate desires in a direct or perverted manner. Sometimes a man has been heard to declare that he wishes both to enjoy the advantages of high culture and to abolish compulsory continence. The inherent nature of the human organism, however, seems to be such that these desires are incompatible, even contradictory. The reformer may be likened to the foolish boy who desires both to keep his cake and to consume it. Any human society is free to choose either to display great energy or to enjoy sexual freedom; the evidence is that it cannot do both for more than one generation.</i></p><p>Looking at our own sexual revolution, the “having your cake and eating it too” phase would have lasted into the early 2000’s. We are now at a stage where we should begin to observe the verification or falsification of Unwin’s predictions.</p></blockquote><p>As any honest observer would readily conclude, Unwin’s predictions are being verified with a vengeance. The solution is simple: walk the narrow path. Get married. Be faithful. Have children. And then plant the acorns that will grow into the mighty oaks underneath which your great-grandchildren will play.</p></div>",
  "content_text": "This summary of J.D. Unwin’s work\nfrom the 1930s is the practical application of the theoretical argument that connects Western post-Christianity to the observable decline of the West:\nEffect of sexual constraints:\nIncreased sexual constraints, either pre or post-nuptial, always led to increased flourishing of a culture. Conversely, increased sexual freedom always led to the collapse of a culture three generations later.\nSingle most influential factor:\nSurprisingly, the data revealed that the single most important correlation with the flourishing of a culture was whether pre-nuptial chastity was required or not. It had a very significant effect either way.\nHighest flourishing of culture:\nThe most powerful combination was pre-nuptial chastity coupled with “absolute monogamy”. Rationalist cultures that retained this combination for at least three generations exceeded all other cultures in every area, including literature, art, science, furniture, architecture, engineering, and agriculture. Only three out of the eighty-six cultures studied ever attained this level.\nEffect of abandoning prenuptial chastity:\nWhen strict prenuptial chastity was no longer the norm, absolute monogamy, deism, and rational thinking also disappeared within three generations.\nTotal sexual freedom:\nIf total sexual freedom was embraced by a culture, that culture collapsed within three generations to the lowest state of flourishing — which Unwin describes as “inert” and at a “dead level of conception” and is characterized by people who have little interest in much else other than their own wants and needs. At this level, the culture is usually conquered or taken over by another culture with greater social energy.\nTime lag:\nIf there is a change in sexual constraints, either increased or decreased restraints, the full effect of that change is not realized until the third generation.\nThanks to the rationalist generations that preceded them, the first generation of a society setting aside its sexual restraints can still enjoy its new-found sexual freedom before any significant decline in culture, but the data shows that this “having your cake and eating it too” phase lasts a maximum of one generation before the decline sets in. Unwin wrote:\nThe history of these societies consists of a series of monotonous repetitions; and it is difficult to decide which aspect of the story is the more significant: the lamentable lack of original thought which in each case the reformers displayed, or the amazing alacrity with which, after a period of intense compulsory continence (sexual restraint), the human organism seizes the earliest opportunity to satisfy its innate desires in a direct or perverted manner. Sometimes a man has been heard to declare that he wishes both to enjoy the advantages of high culture and to abolish compulsory continence. The inherent nature of the human organism, however, seems to be such that these desires are incompatible, even contradictory. The reformer may be likened to the foolish boy who desires both to keep his cake and to consume it. Any human society is free to choose either to display great energy or to enjoy sexual freedom; the evidence is that it cannot do both for more than one generation.\nLooking at our own sexual revolution, the “having your cake and eating it too” phase would have lasted into the early 2000’s. We are now at a stage where we should begin to observe the verification or falsification of Unwin’s predictions.\nAs any honest observer would readily conclude, Unwin’s predictions are being verified with a vengeance. The solution is simple: walk the narrow path. Get married. Be faithful. Have children. And then plant the acorns that will grow into the mighty oaks underneath which your great-grandchildren will play.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-12-09T14:13:18+00:00"
}