{
  "url": "https://voxday.net/2019/12/17/the-critics-rave-2/",
  "scraped_at": "2025-12-21T03:09:36.463569",
  "title": "The critics rave!",
  "date_display": "December 17, 2019",
  "date_iso": "2019-12-17T16:14:20+00:00",
  "date_from_url": "2019-12-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I wonder who is still buying <a href=\"https://www.dailymail.co.uk/tvshowbiz/article-7801607/Star-Wars-Rise-Skywalker-receives-RAVE-reactions-critics.html\">the obvious shill-o-ganda</a> from the Devil Mouse? Besides, of course, the mainstream media.</p><blockquote><p>It’s the final film in the Skywalker saga that concludes the nine-film epic space opera. And critics were full of praise for <i>Star Wars: The Rise Of Skywalker</i> as they revealed their initial reactions to seeing the film at the Los Angeles premiere on Monday night.</p><p>While Disney has embargoed full reviews until Wednesday, those inside the three cinemas screening the film were so delighted they took to Twitter to give their spoiler-free thoughts on the film on Tuesday.</p><p>‘I am absolutely blown away!’ <i>Star Wars: The Rise Of Skywalker</i> received RAVE first reactions from critics as they gushed on Tuesday about the ‘immensely satisfying’ conclusion</p><p>Calling the J.J. Abrams-directed film an ‘immensely satisfying’, many critics claimed it was a ‘fitting end’ to the franchise. SlashFilm’s Peter Scrietta gushed that ‘JJ Abrams nailed it, as he added: ‘He was able to bring a cohesive arc to this trilogy that feels like a fitting end to the saga as a whole. I’m so emotionally drained. Star Wars fans will be very happy.’</p><p>While SYFY Wire’s Jenna Busch added: ‘OH MY GOD! I am absolutely blown away! I’ve never been so satisfied by a film. This is the end of an era and a franchise that has defined my life and this did it justice in a way I didn’t imagine it could. You WILL cry….’</p></blockquote><p>Color me EXTREMELY dubious. Of course, I haven’t seen a single Star Wars film since <i>The Phantom Menace</i>, so perhaps those who are more tolerant of bad cinema and terrible SF will genuinely be entertained.</p></div>",
  "content_text": "I wonder who is still buying\nthe obvious shill-o-ganda\nfrom the Devil Mouse? Besides, of course, the mainstream media.\nIt’s the final film in the Skywalker saga that concludes the nine-film epic space opera. And critics were full of praise for\nStar Wars: The Rise Of Skywalker\nas they revealed their initial reactions to seeing the film at the Los Angeles premiere on Monday night.\nWhile Disney has embargoed full reviews until Wednesday, those inside the three cinemas screening the film were so delighted they took to Twitter to give their spoiler-free thoughts on the film on Tuesday.\n‘I am absolutely blown away!’\nStar Wars: The Rise Of Skywalker\nreceived RAVE first reactions from critics as they gushed on Tuesday about the ‘immensely satisfying’ conclusion\nCalling the J.J. Abrams-directed film an ‘immensely satisfying’, many critics claimed it was a ‘fitting end’ to the franchise. SlashFilm’s Peter Scrietta gushed that ‘JJ Abrams nailed it, as he added: ‘He was able to bring a cohesive arc to this trilogy that feels like a fitting end to the saga as a whole. I’m so emotionally drained. Star Wars fans will be very happy.’\nWhile SYFY Wire’s Jenna Busch added: ‘OH MY GOD! I am absolutely blown away! I’ve never been so satisfied by a film. This is the end of an era and a franchise that has defined my life and this did it justice in a way I didn’t imagine it could. You WILL cry….’\nColor me EXTREMELY dubious. Of course, I haven’t seen a single Star Wars film since\nThe Phantom Menace\n, so perhaps those who are more tolerant of bad cinema and terrible SF will genuinely be entertained.",
  "tags": [
    "film"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-12-17T16:14:20+00:00"
}