{
  "url": "https://voxday.net/2019/12/20/the-secret-federal-stasi-2/",
  "scraped_at": "2025-12-21T03:10:00.639611",
  "title": "The secret federal Stasi",
  "date_display": "December 20, 2019",
  "date_iso": "2019-12-20T12:42:40+00:00",
  "date_from_url": "2019-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears The Storm is coming sooner rather than later, as AC’s longtime insistence that the FBI and other federal agencies were corrupted and US citizens have been subject to a massive private surveillance state <a href=\"https://www.theepochtimes.com/nsa-director-rogers-disclosed-fisa-abuse-days-after-carter-page-fisa-was-issued_2692033.html\">is being confirmed</a> through recent declassifications:</p><blockquote><p>On March 9, 2016, Department of Justice (DOJ) oversight personnel learned that the FBI had been employing outside contractors who had access to raw Section 702 Foreign Intelligence Surveillance Act (FISA) data, and retained that access after their work for the FBI was completed.</p><p>This information was disclosed in a 99-page FISA court ruling on April 26, 2017, that was declassified by Director of National Intelligence Dan Coats.</p><p>That wasn’t an isolated incident and the improper access granted to outside contractors “seems to have been the result of deliberate decisionmaking” (footnote – page 87).</p><p>The FISA court noted the “FBI’s apparent disregard of minimization rules” and questioned “whether the FBI may be engaging in similar disclosures of raw Section 702 information that have not been reported.”</p><p>On the same day of the discovery of the FBI’s use of private contractors, FBI lawyer Lisa Page sent a text to FBI agent Peter Strzok: “Need to try to fix a HUGE who f-up.”</p></blockquote><p>AC himself explains what appears to have happened:</p><p><i>What has Q said? <b>“We have it all.” “FISA Declass will bring down the house.” “This thing is bigger than you could possibly believe.”</b></i><br><i><br/></i><i>What have I said? Cabal has amassed detailed surveillance files on every American, including conversations, intimate moments, and embarrassing details gathered from within the most private parts of their private homes, where they thought they had sanctuary to relax. This is what Q is saying. They have got it all. There is only one “it all” in this game. It is the whole ball of wax, the whole enchilada, the big database with all the files on everyone in America. Everything else is nothing by comparison.</i><br><i><br/></i><i>I thought it was gathered off the record, by private companies that hired contractors which would shield it behind the Fourth Amendment. But then, I thought the spying on Trump would have been done by a private sector company with plausibly deniable ties to the Cabal.</i><br><i><br/></i><i>I was wrong. These dumbasses used official government resources and signed official orders sanctioning the use. I hear R. Lee Ermey catching the recruit who wisecracked, with his eyes bugging out saying, <b>“Oh, now you are FUCKED! I’ve got you! I know who you are! I know your fucking name!”</b> They put their fucking names on it.  </i><br><i><br/></i>This is bigger than Watergate + 9/11 + the Bay of Pigs + almost every other conspiracy theory you can name combined. It is also why you’re seeing definite signs of panic and desperation everywhere from the House of Representatives to the mainstream media to the boardrooms of the Fortune 500. This reaches from the heart of the Swamp in Washington DC to Silicon Valley and Seattle, Washington. In East Germany, it came out after the Wall fell that one-fifth of the population was involved in the surveillance of the other four-fifths of the population; now keep in mind that due to the mathematical reach of the FISA warrants, the 825 million surveillance orders issued actually exceeds the 320 million population of the USA.</br></br></br></br></p><p>Now we know how and why Google and Amazon and Facebook got so big, so fast. They were the corporate arm of the surveillance state. No wonder their top executives are retiring and running and applying for citizenship in non-extradition treaty countries like New Zealand.</p></div>",
  "content_text": "It appears The Storm is coming sooner rather than later, as AC’s longtime insistence that the FBI and other federal agencies were corrupted and US citizens have been subject to a massive private surveillance state\nis being confirmed\nthrough recent declassifications:\nOn March 9, 2016, Department of Justice (DOJ) oversight personnel learned that the FBI had been employing outside contractors who had access to raw Section 702 Foreign Intelligence Surveillance Act (FISA) data, and retained that access after their work for the FBI was completed.\nThis information was disclosed in a 99-page FISA court ruling on April 26, 2017, that was declassified by Director of National Intelligence Dan Coats.\nThat wasn’t an isolated incident and the improper access granted to outside contractors “seems to have been the result of deliberate decisionmaking” (footnote – page 87).\nThe FISA court noted the “FBI’s apparent disregard of minimization rules” and questioned “whether the FBI may be engaging in similar disclosures of raw Section 702 information that have not been reported.”\nOn the same day of the discovery of the FBI’s use of private contractors, FBI lawyer Lisa Page sent a text to FBI agent Peter Strzok: “Need to try to fix a HUGE who f-up.”\nAC himself explains what appears to have happened:\nWhat has Q said?\n“We have it all.” “FISA Declass will bring down the house.” “This thing is bigger than you could possibly believe.”\nWhat have I said? Cabal has amassed detailed surveillance files on every American, including conversations, intimate moments, and embarrassing details gathered from within the most private parts of their private homes, where they thought they had sanctuary to relax. This is what Q is saying. They have got it all. There is only one “it all” in this game. It is the whole ball of wax, the whole enchilada, the big database with all the files on everyone in America. Everything else is nothing by comparison.\nI thought it was gathered off the record, by private companies that hired contractors which would shield it behind the Fourth Amendment. But then, I thought the spying on Trump would have been done by a private sector company with plausibly deniable ties to the Cabal.\nI was wrong. These dumbasses used official government resources and signed official orders sanctioning the use. I hear R. Lee Ermey catching the recruit who wisecracked, with his eyes bugging out saying,\n“Oh, now you are FUCKED! I’ve got you! I know who you are! I know your fucking name!”\nThey put their fucking names on it.\nThis is bigger than Watergate + 9/11 + the Bay of Pigs + almost every other conspiracy theory you can name combined. It is also why you’re seeing definite signs of panic and desperation everywhere from the House of Representatives to the mainstream media to the boardrooms of the Fortune 500. This reaches from the heart of the Swamp in Washington DC to Silicon Valley and Seattle, Washington. In East Germany, it came out after the Wall fell that one-fifth of the population was involved in the surveillance of the other four-fifths of the population; now keep in mind that due to the mathematical reach of the FISA warrants, the 825 million surveillance orders issued actually exceeds the 320 million population of the USA.\nNow we know how and why Google and Amazon and Facebook got so big, so fast. They were the corporate arm of the surveillance state. No wonder their top executives are retiring and running and applying for citizenship in non-extradition treaty countries like New Zealand.",
  "tags": [
    "conspiracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-12-20T12:42:40+00:00"
}