{
  "url": "https://voxday.net/2019/12/21/this-certainly-looks-promising-2/",
  "scraped_at": "2025-12-21T03:10:09.745070",
  "title": "This certainly looks promising",
  "date_display": "December 21, 2019",
  "date_iso": "2019-12-21T11:03:57+00:00",
  "date_from_url": "2019-12-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was alerted by several readers about some recent changes at a certain social technology company. After review by some of the LLoE members, a consensus conclusion was reached.</p><p><b>Item One: </b>Patreon has <a href=\"https://archive.is/wip/fdTfe\">new terms of use</a>. But the effective date is more than a little… odd. I’ve never seen anything like it. Neither had anyone else.</p><p><i>Effective immediately for users joining Patreon on or after December 20th, 2019. Effective for existing users on, and applicable to claims not yet asserted by, January 1st, 2020.</i></p><p><b>Item Two: </b>Patreon follows the JAMS policy on Consumer Arbitrations, which, as a California corporation, it is required to do.</p><p><i>For creators and patrons who are consumers, we also follow the JAMS Policy on Consumer Arbitrations Pursuant to Pre-Dispute Clauses Minimum Standards of Procedural Fairness for consumer arbitrations done under these terms. For the purpose of an arbitration subject to the consumer standards, if any portion of these terms do not follow that standard, that portion is severed from these terms.</i></p><p><b>Item Three: </b>Patreon doesn’t understand how California law applies to consumer arbitrations or the JAMS policy it claims to follow. That, or they’re hoping against hope that no one else does.</p><p><i>You may not bring a claim against us for suspending or terminating another person’s account, and you agree you will not bring such a claim. If you try to bring such a claim, you are responsible for the damages caused, including attorneys fees and costs.</i><br><i><br/></i><b>Item Four: </b>JAMS, however, does.</br></p><p><i>In California, the arbitration provision may not require the consumer to pay the fees and costs incurred by the opposing party if the consumer does not prevail.</i><br><b><i><br/></i>Conclusion: </b>Patreon already has a pretty good idea they are going to lose. Badly.</br></p></div>",
  "content_text": "I was alerted by several readers about some recent changes at a certain social technology company. After review by some of the LLoE members, a consensus conclusion was reached.\nItem One:\nPatreon has\nnew terms of use\n. But the effective date is more than a little… odd. I’ve never seen anything like it. Neither had anyone else.\nEffective immediately for users joining Patreon on or after December 20th, 2019. Effective for existing users on, and applicable to claims not yet asserted by, January 1st, 2020.\nItem Two:\nPatreon follows the JAMS policy on Consumer Arbitrations, which, as a California corporation, it is required to do.\nFor creators and patrons who are consumers, we also follow the JAMS Policy on Consumer Arbitrations Pursuant to Pre-Dispute Clauses Minimum Standards of Procedural Fairness for consumer arbitrations done under these terms. For the purpose of an arbitration subject to the consumer standards, if any portion of these terms do not follow that standard, that portion is severed from these terms.\nItem Three:\nPatreon doesn’t understand how California law applies to consumer arbitrations or the JAMS policy it claims to follow. That, or they’re hoping against hope that no one else does.\nYou may not bring a claim against us for suspending or terminating another person’s account, and you agree you will not bring such a claim. If you try to bring such a claim, you are responsible for the damages caused, including attorneys fees and costs.\nItem Four:\nJAMS, however, does.\nIn California, the arbitration provision may not require the consumer to pay the fees and costs incurred by the opposing party if the consumer does not prevail.\nConclusion:\nPatreon already has a pretty good idea they are going to lose. Badly.",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-12-21T11:03:57+00:00"
}