{
  "url": "https://voxday.net/2019/12/05/this-is-why-you-eject-gammas/",
  "scraped_at": "2025-12-21T03:08:11.003465",
  "title": "This is why you eject gammas",
  "date_display": "December 5, 2019",
  "date_iso": "2019-12-05T15:00:44+00:00",
  "date_from_url": "2019-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is quintessential gamma behavior in action. Ex-fans bitter about their rejection by the object of their adoration are now devoting themselves to attacking those who have not been similarly rejected:</p><blockquote class=\"tr_bq\"><p>Fyi those hit by the ban hammer are organizing against Owen and his ass kissers that haven’t been banned. You bears only accept ass kissing as legitimate, anyone else gets banned. Ex bears are bear hunting.</p></blockquote><p>This is precisely why you should never admit anyone you even <i>suspect </i>of possibly possessing gamma traits into your organization, no matter how enthusiastically they volunteer or how helpful they appear to be. The usual pattern is that they fail to do what they say they will do, but instead come up with all sorts of things that they think other people should be doing. They particularly like to question and criticize the strategies and policies being formulated by the people at the top. Then, when their suggestions are not promptly adopted, they start attacking others in the organization and attempting to undermine and discredit them, at which point it usually becomes necessary to eject them.</p><p>After his ejection, the gamma then turns on the very people he previously professed to admire and declares himself a sworn enemy of them and their projects. That’s why, as with SJWs, it is always best to keep them out from the start.</p><p>Speaking of addition by subtraction, it is perhaps worth pointing out that those who erroneously believed that moderating the comments at this blog would lead to an inevitable decline in traffic have again proven to be incorrect. VP had been averaging 96k daily pageviews for the last month, but since turning on full-time moderation, the average daily traffic has increased to 104.5k pageviews.</p></div>",
  "content_text": "This is quintessential gamma behavior in action. Ex-fans bitter about their rejection by the object of their adoration are now devoting themselves to attacking those who have not been similarly rejected:\nFyi those hit by the ban hammer are organizing against Owen and his ass kissers that haven’t been banned. You bears only accept ass kissing as legitimate, anyone else gets banned. Ex bears are bear hunting.\nThis is precisely why you should never admit anyone you even\nsuspect\nof possibly possessing gamma traits into your organization, no matter how enthusiastically they volunteer or how helpful they appear to be. The usual pattern is that they fail to do what they say they will do, but instead come up with all sorts of things that they think other people should be doing. They particularly like to question and criticize the strategies and policies being formulated by the people at the top. Then, when their suggestions are not promptly adopted, they start attacking others in the organization and attempting to undermine and discredit them, at which point it usually becomes necessary to eject them.\nAfter his ejection, the gamma then turns on the very people he previously professed to admire and declares himself a sworn enemy of them and their projects. That’s why, as with SJWs, it is always best to keep them out from the start.\nSpeaking of addition by subtraction, it is perhaps worth pointing out that those who erroneously believed that moderating the comments at this blog would lead to an inevitable decline in traffic have again proven to be incorrect. VP had been averaging 96k daily pageviews for the last month, but since turning on full-time moderation, the average daily traffic has increased to 104.5k pageviews.",
  "tags": [
    "Gamma"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-12-05T15:00:44+00:00"
}