{
  "url": "https://voxday.net/2024/06/05/46-billion/",
  "scraped_at": "2026-01-08T14:34:23.673952",
  "title": "46 Billion",
  "date_display": "June 5, 2024",
  "date_iso": "2024-06-05T13:47:16+00:00",
  "date_from_url": "2024-06-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sometimes, I can almost empathize with the clowns whose job it is to suppress the various Unauthorized creators and prevent us from becoming mainstream figures. It’s got to be frustrating to keep us off all of the mainstream platforms, and yet see our ideas still winning out over all of their ticket-takers and approved, algorithm-pushed, and well-funded pet intellectuals. <a href=\"https://en.wikipedia.org/wiki/Sigma_male\">From Wikipedia</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Sigma male</strong><br/>Sigma male (or simply sigma) (/sɪɡmə məɪl/ ⓘ) is a term in internet slang used most often to describe archetype of a male who is a “lone wolf”. The name is a product of the manosphere message boards in the 2010s, the term has gained widespread prominence within internet culture, and since the early 2020s, has become an internet meme. Commonly regarded as the “rarest” type of male, a sigma male is typically denoted as an archetype of a male who is similar to the alpha male. Unlike an alpha male, sigma males are more introverted and seek to dominate themselves, in other words “self-mastery”. On social media, the term is often used to describe the idolization of masculine characters from films and TV shows, or celebrities.</p><p>Alternatively, the term has taken on an ironic and satirical meaning, mocking the concept of the manosphere and the sigma grindset.</p><p>In 2023, #sigma gained over 46 billion views on the social media platform TikTok.</p></blockquote><p>I find it more than a little ironic that a) it is deemed a “contentious topic” and b) despite it having its own page, there is no reference to it on the Wikipedia page about me. It appears the Wikipedia admins would prefer to believe that I am known for imaginary things I’ve never said than for genuine things I have.</p><p>Anyhow, this is why you should contemplate <a href=\"https://unauthorized.tv/account/new/\">subscribing to UATV</a> if you haven’t already. It will put you somewhere between ten and 20 years ahead of the curve, depending upon the topic.</p><p><em><a href=\"https://social.infogalactic.com/micropost/01a38c4e-bc64-4846-8cd5-abb6a6e674e1\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Sometimes, I can almost empathize with the clowns whose job it is to suppress the various Unauthorized creators and prevent us from becoming mainstream figures. It’s got to be frustrating to keep us off all of the mainstream platforms, and yet see our ideas still winning out over all of their ticket-takers and approved, algorithm-pushed, and well-funded pet intellectuals.\nFrom Wikipedia\n:\nSigma male\nSigma male (or simply sigma) (/sɪɡmə məɪl/ ⓘ) is a term in internet slang used most often to describe archetype of a male who is a “lone wolf”. The name is a product of the manosphere message boards in the 2010s, the term has gained widespread prominence within internet culture, and since the early 2020s, has become an internet meme. Commonly regarded as the “rarest” type of male, a sigma male is typically denoted as an archetype of a male who is similar to the alpha male. Unlike an alpha male, sigma males are more introverted and seek to dominate themselves, in other words “self-mastery”. On social media, the term is often used to describe the idolization of masculine characters from films and TV shows, or celebrities.\nAlternatively, the term has taken on an ironic and satirical meaning, mocking the concept of the manosphere and the sigma grindset.\nIn 2023, #sigma gained over 46 billion views on the social media platform TikTok.\nI find it more than a little ironic that a) it is deemed a “contentious topic” and b) despite it having its own page, there is no reference to it on the Wikipedia page about me. It appears the Wikipedia admins would prefer to believe that I am known for imaginary things I’ve never said than for genuine things I have.\nAnyhow, this is why you should contemplate\nsubscribing to UATV\nif you haven’t already. It will put you somewhere between ten and 20 years ahead of the curve, depending upon the topic.\nDISCUSS ON SG",
  "tags": [
    "media",
    "Sigma Game",
    "UATV"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-06-05T13:47:18+00:00"
}