{
  "url": "https://voxday.net/2024/06/01/a-wake-up-call/",
  "scraped_at": "2026-01-08T14:33:59.301973",
  "title": "A Wake-Up Call",
  "date_display": "June 1, 2024",
  "date_iso": "2024-06-01T09:48:03+00:00",
  "date_from_url": "2024-06-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Swiss government abandoned both banking privacy and neutrality under pressure from the USA and the EU. As a direct result, both its giant banks have already failed – one was bailed out and illegally given the resources of the other one at bargain prices – its peace summit is a complete failure, and now the world-famous Geneva Motor Show is shutting down after 119 years.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The Geneva International Motor Show is to end after more than a century due to lower interest and a tough market environment, organisers said on Friday. The organisers of the show have encountered difficulties in their preparations for the 2025 edition, they said. The signals from the market in favour of another edition were poor.</p><p>When asking the manufacturers to prepare for the 2025 edition, “we had the impression that we were going against the market,” Alexandre de Senarclens, President of the Geneva International Motor Show Foundation, told the Keystone-SDA news agency on Friday.</p></blockquote><p><strong>Translation: </strong>The Chinese, who have over 60 percent of the global electric car market and were among the few brands to appear at this year’s show, informed the organisers that they won’t be coming next year, in solidarity with their Russian allies.</p><p>The failure of the century-old Geneva show is probably a bigger blow to Switzerland than <a href=\"https://www.globaltimes.cn/page/202405/1313412.shtml\">the widespread international rejection</a> of the one-sided peace summit. One hopes that the Swiss people will soon recognize from the ongoing collapse of the USA and the EU countries that obediently following the directives of Clown World is not progress to anything but material loss, societal degradation, and violent post-civilizational chaos.</p><p><em>China confirmed on Friday that it will not attend a Ukraine peace conference in Switzerland next month, as the meeting falls short of China’s requests, according to Chinese Ministry of Foreign Affairs spokesperson Mao Ning. The Chinese spokesperson emphasized that China consistently insists that international conference on Ukraine should have the recognition of both Russia and Ukraine, equal participation of all parties, and fair discussions on all peace proposals, as these three elements are crucial for the effectiveness of restoring peace.</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/024a964a-25ba-4736-a55a-3d6b2ba36bf4\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Swiss government abandoned both banking privacy and neutrality under pressure from the USA and the EU. As a direct result, both its giant banks have already failed – one was bailed out and illegally given the resources of the other one at bargain prices – its peace summit is a complete failure, and now the world-famous Geneva Motor Show is shutting down after 119 years.\nThe Geneva International Motor Show is to end after more than a century due to lower interest and a tough market environment, organisers said on Friday. The organisers of the show have encountered difficulties in their preparations for the 2025 edition, they said. The signals from the market in favour of another edition were poor.\nWhen asking the manufacturers to prepare for the 2025 edition, “we had the impression that we were going against the market,” Alexandre de Senarclens, President of the Geneva International Motor Show Foundation, told the Keystone-SDA news agency on Friday.\nTranslation:\nThe Chinese, who have over 60 percent of the global electric car market and were among the few brands to appear at this year’s show, informed the organisers that they won’t be coming next year, in solidarity with their Russian allies.\nThe failure of the century-old Geneva show is probably a bigger blow to Switzerland than\nthe widespread international rejection\nof the one-sided peace summit. One hopes that the Swiss people will soon recognize from the ongoing collapse of the USA and the EU countries that obediently following the directives of Clown World is not progress to anything but material loss, societal degradation, and violent post-civilizational chaos.\nChina confirmed on Friday that it will not attend a Ukraine peace conference in Switzerland next month, as the meeting falls short of China’s requests, according to Chinese Ministry of Foreign Affairs spokesperson Mao Ning. The Chinese spokesperson emphasized that China consistently insists that international conference on Ukraine should have the recognition of both Russia and Ukraine, equal participation of all parties, and fair discussions on all peace proposals, as these three elements are crucial for the effectiveness of restoring peace.\nDISCUSS ON SG",
  "tags": [
    "China",
    "economics",
    "Switzerland"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-06-01T09:50:42+00:00"
}