{
  "url": "https://voxday.net/2024/06/20/do-not-fear-the-good/",
  "scraped_at": "2026-01-08T14:35:34.909158",
  "title": "Do Not Fear the Good",
  "date_display": "June 20, 2024",
  "date_iso": "2024-06-20T12:45:52+00:00",
  "date_from_url": "2024-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For the last 24 hours, we have polled the subscribers of the Castalia Library substack to determine which work we would serialize in the aftermath of the very successful serialization of Oman’s <em>STUDIES IN THE NAPOLEONIC WARS</em>. The results were as follows, with <a href=\"https://castalialibrary.substack.com/p/the-cambridge-medieval-history-i\"><em>Medieval History</em> eking out a narrow victory</a> over <em>Meditations</em>, which was a surprise to me, as I expected <em>Discourses </em>would be the favorite after having narrowly finished second last time, although I voted for the Marcus Aurelius work myself.</p><ul class=\"wp-block-list\"><li><strong>35% <em>THE CAMBRIDGE MEDIEVAL HISTORY</em></strong></li><li>32% <em>MEDITATIONS</em></li><li>19% <em>DISCOURSES ON LIVY</em></li><li>13% <em>POLITICS</em></li></ul><p>Now, although we have not yet presented the logo for Castalia Library proper, as opposed to the logo for Castalia History, we already have the Latin motto for it: <em>NOLITE TIMERE BONI</em>. This admonition to not be afraid of the Good can be interpreted in several ways, one of which is “don’t be afraid to do it right”. This mindset applies to everything we do at the Library, from taking risks on ancient machines that may or may not work to abandoning a perfectly good space for a better one that provides us with room to grow in the future.</p><p>In this context, however, it applies to which version of the <em>Cambridge Medieval History</em> we serialize. Although I was originally thinking of the serialization in the context of the abbreviated edition by Charles Previté-Orton that we published in two volumes, both of which are already sold out, it occurred to us that the lack of material limitations that applied to the leather books does not apply to the digital domain of the substack. So, we’ve decided that instead of the 1952 Previté-Orton edition, we will serialize the first volume of the original 1911 edition edited by J.B. Bury, entitled <em>The Christian Roman Empire and the Foundation of the Teutonic Kingdoms</em>.</p><p>At 614 pages, not including the bibliography which we will not serialize, it’s of a similar length to the edition we published, but it goes much deeper into the details of historical events such as the original Nicene Council and Diocletian’s persecution of the Christians than the shorter Previté-Orton edition. Given the chance to provide our readers with the deeper and more substantive material, our philosophy dictates that we do so.</p><p>The serialization has already begun. Therefore, please enjoy <a href=\"https://castalialibrary.substack.com/p/the-cambridge-medieval-history-i\">the preface to volume I</a> as presented by the editors.</p><p><em>The present volume covers a space of about two hundred years beginning with Constantine and stopping a little short of Justinian. At its opening the Roman Empire is standing in its ancient majesty, drawing new strength from the reforms of Diocletian and the statesmanship of Constantine: at its close the Empire has vanished from the West, while the East is slowly recovering from the pressure of the barbarians in the fifth century, and gathering strength for Justinian’s wars of conquest. At its opening heathenism is still a mighty power, society is built up on heathen pride of class, and Rome still seems the centre of the world: at its ending we see Christianity supreme, Constantinople the seat of power, and the old heathen order of society in the West dissolving in the confusion of barbarian devastations. At its opening Caesar’s will is law from the Atlantic to Armenia: at its ending a great system of Teutonic and Arian kingdoms in the West has just been grievously shaken by the conversion of the Franks from heathenism direct to orthodoxy.</em></p><p><em><a href=\"https://social.infogalactic.com/micropost/b6a9f1ac-67e2-4425-b2a9-6fcf0c1b60a8\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "For the last 24 hours, we have polled the subscribers of the Castalia Library substack to determine which work we would serialize in the aftermath of the very successful serialization of Oman’s\nSTUDIES IN THE NAPOLEONIC WARS\n. The results were as follows, with\nMedieval History\neking out a narrow victory\nover\nMeditations\n, which was a surprise to me, as I expected\nDiscourses\nwould be the favorite after having narrowly finished second last time, although I voted for the Marcus Aurelius work myself.\n35%\nTHE CAMBRIDGE MEDIEVAL HISTORY\n32%\nMEDITATIONS\n19%\nDISCOURSES ON LIVY\n13%\nPOLITICS\nNow, although we have not yet presented the logo for Castalia Library proper, as opposed to the logo for Castalia History, we already have the Latin motto for it:\nNOLITE TIMERE BONI\n. This admonition to not be afraid of the Good can be interpreted in several ways, one of which is “don’t be afraid to do it right”. This mindset applies to everything we do at the Library, from taking risks on ancient machines that may or may not work to abandoning a perfectly good space for a better one that provides us with room to grow in the future.\nIn this context, however, it applies to which version of the\nCambridge Medieval History\nwe serialize. Although I was originally thinking of the serialization in the context of the abbreviated edition by Charles Previté-Orton that we published in two volumes, both of which are already sold out, it occurred to us that the lack of material limitations that applied to the leather books does not apply to the digital domain of the substack. So, we’ve decided that instead of the 1952 Previté-Orton edition, we will serialize the first volume of the original 1911 edition edited by J.B. Bury, entitled\nThe Christian Roman Empire and the Foundation of the Teutonic Kingdoms\n.\nAt 614 pages, not including the bibliography which we will not serialize, it’s of a similar length to the edition we published, but it goes much deeper into the details of historical events such as the original Nicene Council and Diocletian’s persecution of the Christians than the shorter Previté-Orton edition. Given the chance to provide our readers with the deeper and more substantive material, our philosophy dictates that we do so.\nThe serialization has already begun. Therefore, please enjoy\nthe preface to volume I\nas presented by the editors.\nThe present volume covers a space of about two hundred years beginning with Constantine and stopping a little short of Justinian. At its opening the Roman Empire is standing in its ancient majesty, drawing new strength from the reforms of Diocletian and the statesmanship of Constantine: at its close the Empire has vanished from the West, while the East is slowly recovering from the pressure of the barbarians in the fifth century, and gathering strength for Justinian’s wars of conquest. At its opening heathenism is still a mighty power, society is built up on heathen pride of class, and Rome still seems the centre of the world: at its ending we see Christianity supreme, Constantinople the seat of power, and the old heathen order of society in the West dissolving in the confusion of barbarian devastations. At its opening Caesar’s will is law from the Atlantic to Armenia: at its ending a great system of Teutonic and Arian kingdoms in the West has just been grievously shaken by the conversion of the Franks from heathenism direct to orthodoxy.\nDISCUSS ON SG",
  "tags": [
    "Castalia Library",
    "Christianity",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-06-20T12:48:20+00:00"
}