{
  "url": "https://voxday.net/2024/06/24/mailvox-the-war-on-knowledge/",
  "scraped_at": "2026-01-08T14:35:54.215288",
  "title": "Mailvox: The War on Knowledge",
  "date_display": "June 24, 2024",
  "date_iso": "2024-06-24T12:57:41+00:00",
  "date_from_url": "2024-06-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An email from a reader illustrates how even the profession of the Librarian has been inverted in order to destroy the knowledge they are charged with preserving.</p><p><em>My wife and I are volunteers for the Friends of the Library at the branch library in the college town where we first met, where every year we help out at the book sales. A month ago we received a peculiar donation. It turns out the new director of the library at our alma mater made the decision to liquidate the library’s special collections. Among those liquidations was a special collection library that had been initiated in the nineteenth century by a member of college founder’s immediate family.</em></p><p><em>In my years at college, I treasured this special library – it was housed in an elegant top-level room in the college’s oldest building, and required special access to visit. Nearly all the books were old, and all of them were on special subjects of great interest to me – literature, poetry, theology, the sciences. Many titles had bookplates with the names of the alumni who donated them over the years.</em></p><p><em>After some investigation I discovered that this new head of the college library pulled all of the books out of that special library, and put them in an enormous rented bin in the main lobby, with a sign suggesting that students could use them for art projects and scrapbooking, you know, to cut and paste their contents to express themselves and be “creative.” The majority of books sat there for weeks, and then she called our group to donate them to our book sale.</em></p><p><em>The last day of the book sale is bag day, where a brown grocery bag of books is only a dollar. What the library doesn’t sell at the end of sale is brought to a pulper. I pulled all of these books and placed them in private storage—if I hadn’t, they would have literally been shredded a week ago.</em></p><p><em>The process is ongoing. I’m told that the librarian is closing all of the special collections in all departments of the college, so I don’t want to share any names just yet, but before this is over, I hope I’ll have saved at least a thousand out-of-print books.</em></p><p><em>This is not new. Well over a decade ago, another university library in my state was destroyed. This library, in a literal ivory tower built exclusively for holding and preserving hundreds of thousands of books, was at one time among the top ten libraries in the nation. A new library director had not only decided to gut the<br/>interior of the building and destroy all of the original architectural detail and period decor, but he also pulled out and destroyed a great majority of the books to make room for “computer stations.” They did not sell the books, they did not offer to donate them, and the director specifically instructed staff to discard the books in locked university dumpsters so that they couldn’t be taken by anyone.</em></p><p><em>The bad, the ugly, and the false. That is the makeup of the world these people are actively contriving and constructing. It really is time to build a consortium of knowledge, physical and digital, containing archives of the world’s books and works that are under attack and being taken away.</em></p><p>The Serpent promises knowledge and provides nothing but ignorance. What we have collectively taken on as a responsibility with Castalia Library and Infogalactic may eventually prove to be one of the most important things any of us have ever done. We are the only true Librarians and we stand between Man and the state of Zero History that Clown World seeks to impose on him.</p><p>The Zero Historians need to destroy all human knowledge because only in its absence can they present their lies as truth. And indeed, the better we understand their motives and methods, the more it appears this is not the first time they have attempted such a grand endeavor.</p><p>Inversion is always the key. Now it should be perfectly clear what a fundamental lie the asserted conflict between Christianity and Science, and between Faith and Knowledge, has always been.</p><p><em><a href=\"https://social.infogalactic.com/micropost/47a42928-f557-4113-84e3-7c75877fb6ad\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "An email from a reader illustrates how even the profession of the Librarian has been inverted in order to destroy the knowledge they are charged with preserving.\nMy wife and I are volunteers for the Friends of the Library at the branch library in the college town where we first met, where every year we help out at the book sales. A month ago we received a peculiar donation. It turns out the new director of the library at our alma mater made the decision to liquidate the library’s special collections. Among those liquidations was a special collection library that had been initiated in the nineteenth century by a member of college founder’s immediate family.\nIn my years at college, I treasured this special library – it was housed in an elegant top-level room in the college’s oldest building, and required special access to visit. Nearly all the books were old, and all of them were on special subjects of great interest to me – literature, poetry, theology, the sciences. Many titles had bookplates with the names of the alumni who donated them over the years.\nAfter some investigation I discovered that this new head of the college library pulled all of the books out of that special library, and put them in an enormous rented bin in the main lobby, with a sign suggesting that students could use them for art projects and scrapbooking, you know, to cut and paste their contents to express themselves and be “creative.” The majority of books sat there for weeks, and then she called our group to donate them to our book sale.\nThe last day of the book sale is bag day, where a brown grocery bag of books is only a dollar. What the library doesn’t sell at the end of sale is brought to a pulper. I pulled all of these books and placed them in private storage—if I hadn’t, they would have literally been shredded a week ago.\nThe process is ongoing. I’m told that the librarian is closing all of the special collections in all departments of the college, so I don’t want to share any names just yet, but before this is over, I hope I’ll have saved at least a thousand out-of-print books.\nThis is not new. Well over a decade ago, another university library in my state was destroyed. This library, in a literal ivory tower built exclusively for holding and preserving hundreds of thousands of books, was at one time among the top ten libraries in the nation. A new library director had not only decided to gut the\ninterior of the building and destroy all of the original architectural detail and period decor, but he also pulled out and destroyed a great majority of the books to make room for “computer stations.” They did not sell the books, they did not offer to donate them, and the director specifically instructed staff to discard the books in locked university dumpsters so that they couldn’t be taken by anyone.\nThe bad, the ugly, and the false. That is the makeup of the world these people are actively contriving and constructing. It really is time to build a consortium of knowledge, physical and digital, containing archives of the world’s books and works that are under attack and being taken away.\nThe Serpent promises knowledge and provides nothing but ignorance. What we have collectively taken on as a responsibility with Castalia Library and Infogalactic may eventually prove to be one of the most important things any of us have ever done. We are the only true Librarians and we stand between Man and the state of Zero History that Clown World seeks to impose on him.\nThe Zero Historians need to destroy all human knowledge because only in its absence can they present their lies as truth. And indeed, the better we understand their motives and methods, the more it appears this is not the first time they have attempted such a grand endeavor.\nInversion is always the key. Now it should be perfectly clear what a fundamental lie the asserted conflict between Christianity and Science, and between Faith and Knowledge, has always been.\nDISCUSS ON SG",
  "tags": [
    "books",
    "Christianity",
    "Clown World",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-06-24T12:57:43+00:00"
}