{
  "url": "https://voxday.net/2024/06/01/real-madrid-2-borussia-dortmund-0/",
  "scraped_at": "2026-01-08T14:34:04.484872",
  "title": "Real Madrid 2, Borussia Dortmund 0",
  "date_display": "June 1, 2024",
  "date_iso": "2024-06-01T22:43:20+00:00",
  "date_from_url": "2024-06-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Champion’s League final was over at halftime, as Dortmund had failed to capitalize on its three chances in the first half. When you’re playing a team as good as Real Madrid, you have to make the most of all your opportunities, because you’re just not going to get very many over the course of 90 minutes.</p><p>I thought the Dortmund defense simply ran out of gas in the end, first giving up one lazy goal on what should have been an unnecessary corner, followed by a horrific backpass that went right to Vinicius Junior at the top of the Dortmund area and would have been unacceptable at the <em>scuola calcio</em> level. And the goal that would have made it a game at the end was correctly ruled offside.</p><p>While it’s fun to see a new team make it to the final, there is a reason it’s usually the most-expensive, top-quality teams meeting there.</p><p><em><a href=\"https://social.infogalactic.com/micropost/8e7051b3-9b99-4ab4-8994-5bf492cd434e\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Champion’s League final was over at halftime, as Dortmund had failed to capitalize on its three chances in the first half. When you’re playing a team as good as Real Madrid, you have to make the most of all your opportunities, because you’re just not going to get very many over the course of 90 minutes.\nI thought the Dortmund defense simply ran out of gas in the end, first giving up one lazy goal on what should have been an unnecessary corner, followed by a horrific backpass that went right to Vinicius Junior at the top of the Dortmund area and would have been unacceptable at the\nscuola calcio\nlevel. And the goal that would have made it a game at the end was correctly ruled offside.\nWhile it’s fun to see a new team make it to the final, there is a reason it’s usually the most-expensive, top-quality teams meeting there.\nDISCUSS ON SG",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-06-01T22:43:22+00:00"
}