{
  "url": "https://voxday.net/2024/06/02/russia-is-playing-black/",
  "scraped_at": "2026-01-08T14:34:06.325675",
  "title": "Russia is Playing Black",
  "date_display": "June 2, 2024",
  "date_iso": "2024-06-02T06:59:53+00:00",
  "date_from_url": "2024-06-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>But I’m not entirely sure that Clown World <a href=\"https://x.com/apocalypseos/status/1796035505806802953\">is even playing chess</a>. It looks a lot more like checkers to me.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>In the conversation between Russia and the United States, a certain readable language has emerged that can be read and understood. The sequence of steps and actions is this language: everything has a clear meaning. This makes it possible to understand what both sides are trying to achieve and to state that such a language of gestures is still readable and that the situation has not collapsed into chaos.</p><p>Thus, we see a clear desire on the part of the West to drive Russia into an escalation algorithm favorable to NATO. This is a protracted war of attrition against our country, waged exclusively with conventional weapons, for which NATO has the potential for quantitative and/or qualitative advantage. Even in those weapons where Russia has a predominance, NATO is trying to compensate for the situation with the combined use of other means of attack.</p><p>Russia is signaling that it sees this scenario and is conducting TNW deployment exercises, albeit without loading warheads. This is a warning that there is a counter-scenario and that the West will not be able to impose its war plan.</p><p>The West immediately responds with strikes on Russian missile warning system (MWS) radar stations near Armavir and Orenburg, with a simultaneous attack on an antenna in Crimea, also used for this purpose. So far, this is only a demonstration. But the West has outlined the trajectories of future strikes and made it clear that it is capable of attacking Russia’s SPRN in a combined and serial manner, if Russia develops the topic of TNWs, rather than continuing the war according to the NATO plan by conventional means, where the West expects to realize its resource advantage.</p><p>At the same time, Russia is being given to understand that the West sees the problem of manning the AFU and is preparing to introduce contingents of NATO countries into Ukraine. NATO intends to block Russian intentions to block this build-up with TNWs by denoting its ability to blind our Strategic Nuclear Forces. This, according to the West, should force Russia to give up its strong trump card and accept an ultimatum in the fall, the text of which will be approved in Switzerland in June.</p><p>At the same time, the West is conducting exercises to launch nuclear attacks near our borders. The pressure on the Russian leadership is exerted on all fronts, in combination. Preparedness for nuclear attacks, counting on internal instability, demonstrating readiness to expand escalation without restrictions – this is the language the West is now using with Russia. The goal is to convince the Russian leadership that it is impossible to inflict unacceptable damage on the West and surrender.</p><p>Before us is a chess game where Russia is playing Black. Her strategy is built in relation to White’s strategy. The opening is over, the exchange phase (middlegame) has begun. White shows that he is ready to throw pieces off the board and move to a fight. Black shows that it will cost White a lot.</p><p>The strategy of the West is a penned hunt, the strategy of Russia is a hunt for the hunter. These strategies are 200 years old, they are constant and are now being repeated. The West understands only real answers, it will not stop until it has tried everything. Russia will have to respond in kind. It’s about where Ukraine’s borders will be drawn and how the new balance of power in Europe will be formed.</p></blockquote><p>What I find so astonishingly bizarre about the mainstream coverage of the Ukraine situation is the way in which it is always discussed in complete isolation from everything else going on in WWIII. Yes, it’s true that Russia might well struggle if forced to face the combined might of Clown World alone – which is the USA, the UK, the EU, and Japan – but Russia is not alone! Russia is very far from alone, <a href=\"https://japantoday.com/category/politics/corrected-update2-japan-conveys-concern-to-china-over-military-activity\">being more closely allied to China</a> than Japan or any of the European satrapies are to the USA.</p><p><em>Defense Minister Minoru Kihara conveyed Tokyo’s “serious concern” about Beijing’s increased military activity near Japan during talks with his Chinese counterpart Dong Jun on Saturday, while both agreed to maintain bilateral dialogue, according to the Japanese Defense Ministry. In their first meeting held on the sidelines of the annual Asia Security Summit in Singapore, known as the Shangri-La Dialogue, Kihara said there are “many security concerns” for the two Asian nations, such as a territorial row in the East China Sea and increased joint military activities by Beijing and Russia around Japan.</em></p><p>Only the UK is tied to the USA by more than threats and political corruption, and both the combined demographics and industrial capacity of the BRICSIA alliance far surpasses that of Clown World. Indeed, I think that the event the Chinese are waiting for prior to their next major move, whatever that may be, is either a) a NATO attack on Russia or b) a massive Russian offensive aimed at knocking Kiev out of the war.</p><p>Remember, for all its careful harboring of its resources in the current Special Military Operation, the 20th Century Russians specialized in the Zhukovian art of unexpectedly delivering overwhelming force on a scale larger than anything the West has ever known.</p><p><em><a href=\"https://social.infogalactic.com/micropost/bec16c3e-e5a4-4d14-ae74-5bc47938addc\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "But I’m not entirely sure that Clown World\nis even playing chess\n. It looks a lot more like checkers to me.\nIn the conversation between Russia and the United States, a certain readable language has emerged that can be read and understood. The sequence of steps and actions is this language: everything has a clear meaning. This makes it possible to understand what both sides are trying to achieve and to state that such a language of gestures is still readable and that the situation has not collapsed into chaos.\nThus, we see a clear desire on the part of the West to drive Russia into an escalation algorithm favorable to NATO. This is a protracted war of attrition against our country, waged exclusively with conventional weapons, for which NATO has the potential for quantitative and/or qualitative advantage. Even in those weapons where Russia has a predominance, NATO is trying to compensate for the situation with the combined use of other means of attack.\nRussia is signaling that it sees this scenario and is conducting TNW deployment exercises, albeit without loading warheads. This is a warning that there is a counter-scenario and that the West will not be able to impose its war plan.\nThe West immediately responds with strikes on Russian missile warning system (MWS) radar stations near Armavir and Orenburg, with a simultaneous attack on an antenna in Crimea, also used for this purpose. So far, this is only a demonstration. But the West has outlined the trajectories of future strikes and made it clear that it is capable of attacking Russia’s SPRN in a combined and serial manner, if Russia develops the topic of TNWs, rather than continuing the war according to the NATO plan by conventional means, where the West expects to realize its resource advantage.\nAt the same time, Russia is being given to understand that the West sees the problem of manning the AFU and is preparing to introduce contingents of NATO countries into Ukraine. NATO intends to block Russian intentions to block this build-up with TNWs by denoting its ability to blind our Strategic Nuclear Forces. This, according to the West, should force Russia to give up its strong trump card and accept an ultimatum in the fall, the text of which will be approved in Switzerland in June.\nAt the same time, the West is conducting exercises to launch nuclear attacks near our borders. The pressure on the Russian leadership is exerted on all fronts, in combination. Preparedness for nuclear attacks, counting on internal instability, demonstrating readiness to expand escalation without restrictions – this is the language the West is now using with Russia. The goal is to convince the Russian leadership that it is impossible to inflict unacceptable damage on the West and surrender.\nBefore us is a chess game where Russia is playing Black. Her strategy is built in relation to White’s strategy. The opening is over, the exchange phase (middlegame) has begun. White shows that he is ready to throw pieces off the board and move to a fight. Black shows that it will cost White a lot.\nThe strategy of the West is a penned hunt, the strategy of Russia is a hunt for the hunter. These strategies are 200 years old, they are constant and are now being repeated. The West understands only real answers, it will not stop until it has tried everything. Russia will have to respond in kind. It’s about where Ukraine’s borders will be drawn and how the new balance of power in Europe will be formed.\nWhat I find so astonishingly bizarre about the mainstream coverage of the Ukraine situation is the way in which it is always discussed in complete isolation from everything else going on in WWIII. Yes, it’s true that Russia might well struggle if forced to face the combined might of Clown World alone – which is the USA, the UK, the EU, and Japan – but Russia is not alone! Russia is very far from alone,\nbeing more closely allied to China\nthan Japan or any of the European satrapies are to the USA.\nDefense Minister Minoru Kihara conveyed Tokyo’s “serious concern” about Beijing’s increased military activity near Japan during talks with his Chinese counterpart Dong Jun on Saturday, while both agreed to maintain bilateral dialogue, according to the Japanese Defense Ministry. In their first meeting held on the sidelines of the annual Asia Security Summit in Singapore, known as the Shangri-La Dialogue, Kihara said there are “many security concerns” for the two Asian nations, such as a territorial row in the East China Sea and increased joint military activities by Beijing and Russia around Japan.\nOnly the UK is tied to the USA by more than threats and political corruption, and both the combined demographics and industrial capacity of the BRICSIA alliance far surpasses that of Clown World. Indeed, I think that the event the Chinese are waiting for prior to their next major move, whatever that may be, is either a) a NATO attack on Russia or b) a massive Russian offensive aimed at knocking Kiev out of the war.\nRemember, for all its careful harboring of its resources in the current Special Military Operation, the 20th Century Russians specialized in the Zhukovian art of unexpectedly delivering overwhelming force on a scale larger than anything the West has ever known.\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-06-02T07:23:50+00:00"
}