{
  "url": "https://voxday.net/2024/06/14/the-rehabilitation-of-a-pedo/",
  "scraped_at": "2026-01-08T14:35:11.404854",
  "title": "The Rehabilitation of a Pedo",
  "date_display": "June 14, 2024",
  "date_iso": "2024-06-14T13:23:35+00:00",
  "date_from_url": "2024-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Not only does SFWA resolutely refuse to eject the pedophiles, past and present, convicted and unconvicted, from its midst, but the morally-depraved science fiction community is now even <a href=\"https://scifi.radio/2024/06/03/remembering-marion-zimmer-bradley-on-her-birthday/\">trying to rehabilitate the reputation</a> of confirmed dead lesbian child-abuser Marion Zimmer Bradley, upon whose work the new Star Wars Acolyte is obviously based.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>After her death, Marion Zimmer Bradley’s daughter, Moira Greyland accused her not only of aiding and abetting her second husband in child molestation, but in herself molesting their daughter. Since Ms. Greyland made this accusations only after MZB was dead and could no longer defend herself or refute the charges, MZB had no opportunity to go to court and clear her name. Some authors have donated the money earned from sales to Bradley to various child-related charities. Given that she edited Breen’s book, Greek Love, and edited and contributed at least one article to his journal, The International Journal of Greek Love, she had to at least suspected his unhealthy interest in boys. “Greek love” is an old euphemism for male homosexuality, especially the relationship between an older man and a boy or youth. Many who knew her well said they had never seen or suspected anything untoward. However, others believed the accusations. Victor Gollancz, Ltd., the publisher of Bradley’s digital backlist, donated all the profits to the British charity Save the Children. Author Janni Lee Simner donated the money she earned from sales to MZB to the American anti-sexual assault organization Rape, Abuse, &amp; Incest National Network. Other writers chose to keep the money they earned…</p><p>She was awarded the World Fantasy Award for lifetime achievement in 2000 posthumously.</p><p>After her death, she was cremated, and her ashes, appropriately enough were scattered on Glastonbury Tor, in Somerset, England.</p><p>Her influence as a writer will last so long as her stories are in print. Her influence as an editor continues to spread, as the writers she mentored are now mentoring a further generations of writers.</p> <cite>Remembering Marion Zimmer Bradley on Her Birthday, SCIFI.RADIO, 3 June 2024 </cite></blockquote><p>If her influence as a writer continues to bear fruit such as <em>Acolyte</em>, she’ll be completely forgotten, and deservedly so, before the end of the decade. No one reads Darkover anymore and the market for lesbian pedophile space witches isn’t likely to survive Clown World’s collapse.</p><p>It’s fascinating to observe how the same freaks who believe and assiduously repeat obviously false information about those of whom they assiduously disapprove will openly deny and attempt to discredit the direct and convincing testimonial evidence of the actual victims of the criminals they are defending.</p><p>The dead lesbian pedo Marion Zimmer Bradley has never been disavowed by SFWA, is still recognized as a Hugo and Nebula Award winner, and there are at least two known pedophiles who are honored as SFWA Grand Masters. The real reason the SF community hates me to this day with a white hot passion has nothing to do with Sad Puppies, Rabid Puppies, my open contempt for their diversity pets, or even my ideological views. It’s because <a href=\"https://www.amazon.com/Last-Closet-Moira-Greyland/dp/9527065208/\">I published this book</a> and they know their attempts to rehabilitate their fallen heroes will never, ever succeed.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><a href=\"https://www.amazon.com/Last-Closet-Moira-Greyland/dp/9527065208/\"><img alt=\"\" class=\"wp-image-63213\" decoding=\"async\" fetchpriority=\"high\" height=\"819\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/06/image-13.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/06/image-13.png 512w, https://voxday.net/wp-content/uploads/2024/06/image-13-188x300.png 188w\" width=\"512\"/></a></figure></div><p>There is a perfectly valid argument for separating the art from the artist in many cases. The problem, in the specific case of MZB, is that it is not possible to do so when so much of her art was steeped in her particular wickedness and written with the avowed objective of infecting society with it.</p><p><strong>UPDATE: </strong>From Wikipedia. It will be interesting to see how many of these SF authors join the rehabilitation efforts going forward. And notice that there is no mention of me being one of the authors who has publicly condemned her.</p><p><em>A number of science fiction authors have publicly condemned Bradley. Among the first was John Scalzi, who within a day of the allegations being made public, described the allegations as “horrific”. Hugo Award winner Jim C. Hines wrote that Bradley’s positive effect on her readers and associates “makes the revelations about Marion Zimmer Bradley protecting a known child rapist and molesting her own daughter and others even more tragic.” G Willow Wilson, who along with Bradley is a fellow World Fantasy Award winner, said she was “speechless”. Diana L. Paxson, who collaborated with Bradley on a number of novels and who continued to write novels set in the Avalon Series after Bradley’s death, said that she was “shocked and appalled to read Moira Greyland’s posts about her mother… I never personally observed, nor had any reason to suspect, that (Bradley) was abusing either of her children.”</em></p><p><strong>UPDATE: </strong>In response to this post, SciFi.radio has memory-holed the article. But the Internet remembers…</p><p><em><a href=\"https://social.infogalactic.com/micropost/1f1e0c2b-2bf9-4dab-ac6e-5359c6b50b61\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Not only does SFWA resolutely refuse to eject the pedophiles, past and present, convicted and unconvicted, from its midst, but the morally-depraved science fiction community is now even\ntrying to rehabilitate the reputation\nof confirmed dead lesbian child-abuser Marion Zimmer Bradley, upon whose work the new Star Wars Acolyte is obviously based.\nAfter her death, Marion Zimmer Bradley’s daughter, Moira Greyland accused her not only of aiding and abetting her second husband in child molestation, but in herself molesting their daughter. Since Ms. Greyland made this accusations only after MZB was dead and could no longer defend herself or refute the charges, MZB had no opportunity to go to court and clear her name. Some authors have donated the money earned from sales to Bradley to various child-related charities. Given that she edited Breen’s book, Greek Love, and edited and contributed at least one article to his journal, The International Journal of Greek Love, she had to at least suspected his unhealthy interest in boys. “Greek love” is an old euphemism for male homosexuality, especially the relationship between an older man and a boy or youth. Many who knew her well said they had never seen or suspected anything untoward. However, others believed the accusations. Victor Gollancz, Ltd., the publisher of Bradley’s digital backlist, donated all the profits to the British charity Save the Children. Author Janni Lee Simner donated the money she earned from sales to MZB to the American anti-sexual assault organization Rape, Abuse, & Incest National Network. Other writers chose to keep the money they earned…\nShe was awarded the World Fantasy Award for lifetime achievement in 2000 posthumously.\nAfter her death, she was cremated, and her ashes, appropriately enough were scattered on Glastonbury Tor, in Somerset, England.\nHer influence as a writer will last so long as her stories are in print. Her influence as an editor continues to spread, as the writers she mentored are now mentoring a further generations of writers.\nRemembering Marion Zimmer Bradley on Her Birthday, SCIFI.RADIO, 3 June 2024\nIf her influence as a writer continues to bear fruit such as\nAcolyte\n, she’ll be completely forgotten, and deservedly so, before the end of the decade. No one reads Darkover anymore and the market for lesbian pedophile space witches isn’t likely to survive Clown World’s collapse.\nIt’s fascinating to observe how the same freaks who believe and assiduously repeat obviously false information about those of whom they assiduously disapprove will openly deny and attempt to discredit the direct and convincing testimonial evidence of the actual victims of the criminals they are defending.\nThe dead lesbian pedo Marion Zimmer Bradley has never been disavowed by SFWA, is still recognized as a Hugo and Nebula Award winner, and there are at least two known pedophiles who are honored as SFWA Grand Masters. The real reason the SF community hates me to this day with a white hot passion has nothing to do with Sad Puppies, Rabid Puppies, my open contempt for their diversity pets, or even my ideological views. It’s because\nI published this book\nand they know their attempts to rehabilitate their fallen heroes will never, ever succeed.\nThere is a perfectly valid argument for separating the art from the artist in many cases. The problem, in the specific case of MZB, is that it is not possible to do so when so much of her art was steeped in her particular wickedness and written with the avowed objective of infecting society with it.\nUPDATE:\nFrom Wikipedia. It will be interesting to see how many of these SF authors join the rehabilitation efforts going forward. And notice that there is no mention of me being one of the authors who has publicly condemned her.\nA number of science fiction authors have publicly condemned Bradley. Among the first was John Scalzi, who within a day of the allegations being made public, described the allegations as “horrific”. Hugo Award winner Jim C. Hines wrote that Bradley’s positive effect on her readers and associates “makes the revelations about Marion Zimmer Bradley protecting a known child rapist and molesting her own daughter and others even more tragic.” G Willow Wilson, who along with Bradley is a fellow World Fantasy Award winner, said she was “speechless”. Diana L. Paxson, who collaborated with Bradley on a number of novels and who continued to write novels set in the Avalon Series after Bradley’s death, said that she was “shocked and appalled to read Moira Greyland’s posts about her mother… I never personally observed, nor had any reason to suspect, that (Bradley) was abusing either of her children.”\nUPDATE:\nIn response to this post, SciFi.radio has memory-holed the article. But the Internet remembers…\nDISCUSS ON SG",
  "tags": [
    "books",
    "freakshow",
    "Pink SF",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-06-15T10:51:58+00:00"
}