{
  "url": "https://voxday.net/2024/06/11/the-limits-of-jacobson/",
  "scraped_at": "2026-01-08T14:34:50.111063",
  "title": "The Limits of JACOBSON",
  "date_display": "June 11, 2024",
  "date_iso": "2024-06-11T14:36:03+00:00",
  "date_from_url": "2024-06-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Karl Denninger points out <a href=\"https://market-ticker.org/akcs-www?post=251466\">the significance of the recent 9th Circuit Court decision</a> overturning the constitutionality of Covid-19 mandates is that it goes far beyond the not-vaccine of the Vaxx to disqualify the vast majority of current vaccines:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>So why is this decision much larger than just Covid?</p><p>Because since the DTP vaccine fiasco that led to the NCVIA multiple (and indeed nearly all) alleged “vaccines”, along with the original injected polio formulation still used (IPV) are in fact personal prophylaxis and do not prevent either contracting or transmitting the disease in question. Specifically all of the following fall into this category and thus all of them, per this decision, cannot be mandated by any government-connected agency including a school or a medical system citing government contracts (e.g. Medicare):</p><p>IPV – injected polio. Of note OPV, the oral version, colonizes the gut and is sterilizing. We used to give IPV first to prevent the rare reversion that can occur with OPV and cause polio but since polio has disappeared from the United States we no longer do.</p><p>The aP portion of DTaP, the reformulated DTP shot that led to the injuries in the 1970s, and since it is not separable from the other two none of the three can be mandated so long as they are combined. Further Tetanus, which might well be a very good idea to take anyway for what should be obvious reasons, can’t be mandated at all because it is not transmissible at all between persons. Therefore it is entirely legitimate to legally force the separation of all three shots.</p><p>Flu shots — they do not sterilize. Period.</p><p>Hep-B — Commonly given to infants this is a non-sterilizing shot and is utterly worthless in infants generally since Hep-B is passed only through blood and serum exchange, meaning injected drugs and (especially anal) sex. Obviously an infant subjected to either of those is being wildly abused but this also means no mandate can be enforced in this regard when it comes to adults even in health care as there is no sterilization effect and thus it cannot protect potential patients from exposure.</p><p>Vit-K — Commonly given to infants at birth this has no immunization effect at all and thus is mere personal prophylaxis which the parents, as agents for the child, have an unquestioned right to direct in the acceptance or refusal without interference.</p><p>RSV – A new one the CDC is now pushing but it is non-sterilizing. The safety profile over long periods of time is unknown as the shot is too new but it uses mRNA technology which makes it instantly suspect as the dose of the actual antigen producing thing cannot be controlled.</p><p>Rotavirus – Again, non-sterilizing.</p><p>Varicella (chicken pox) – Again, non-sterilizing however, since Chicken Pox is wildly more dangerous in adults than children if you haven’t gotten it the old-fashioned way by the time you go into school you probably want to consider it for that reason.</p><p>Meningococcal – That too is non-sterilizing and yet colleges, in particular, try to mandate it. Under this decision that is also illegal as the benefit is entirely personal.</p></blockquote><p>The reason is that the basis for which <em>Jacobson </em>permitted the smallpox vaccine mandate is because the vaccine was sterilizing. As Denninger explains: “the case turned on the fact that the smallpox vaccine in question was sterilizing; that is, it prevented spread of the disease because once inoculated you could neither acquire or transmit the infection. On this basis the Supreme Court held that despite a person’s objections and potential harms from taking it they could be fined if they refused.”</p><p>This means there is virtually no grounds for submitting to any vaccine mandate in the future. Unless and until a vaccine is legally declared to be sterilizing by a court, any attempt to mandate it is unconstitutional and illegal on its face.</p><p><em><a href=\"https://social.infogalactic.com/micropost/e8cd7709-3f3d-41fb-b9f3-4ee4308e95f5\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Karl Denninger points out\nthe significance of the recent 9th Circuit Court decision\noverturning the constitutionality of Covid-19 mandates is that it goes far beyond the not-vaccine of the Vaxx to disqualify the vast majority of current vaccines:\nSo why is this decision much larger than just Covid?\nBecause since the DTP vaccine fiasco that led to the NCVIA multiple (and indeed nearly all) alleged “vaccines”, along with the original injected polio formulation still used (IPV) are in fact personal prophylaxis and do not prevent either contracting or transmitting the disease in question. Specifically all of the following fall into this category and thus all of them, per this decision, cannot be mandated by any government-connected agency including a school or a medical system citing government contracts (e.g. Medicare):\nIPV – injected polio. Of note OPV, the oral version, colonizes the gut and is sterilizing. We used to give IPV first to prevent the rare reversion that can occur with OPV and cause polio but since polio has disappeared from the United States we no longer do.\nThe aP portion of DTaP, the reformulated DTP shot that led to the injuries in the 1970s, and since it is not separable from the other two none of the three can be mandated so long as they are combined. Further Tetanus, which might well be a very good idea to take anyway for what should be obvious reasons, can’t be mandated at all because it is not transmissible at all between persons. Therefore it is entirely legitimate to legally force the separation of all three shots.\nFlu shots — they do not sterilize. Period.\nHep-B — Commonly given to infants this is a non-sterilizing shot and is utterly worthless in infants generally since Hep-B is passed only through blood and serum exchange, meaning injected drugs and (especially anal) sex. Obviously an infant subjected to either of those is being wildly abused but this also means no mandate can be enforced in this regard when it comes to adults even in health care as there is no sterilization effect and thus it cannot protect potential patients from exposure.\nVit-K — Commonly given to infants at birth this has no immunization effect at all and thus is mere personal prophylaxis which the parents, as agents for the child, have an unquestioned right to direct in the acceptance or refusal without interference.\nRSV – A new one the CDC is now pushing but it is non-sterilizing. The safety profile over long periods of time is unknown as the shot is too new but it uses mRNA technology which makes it instantly suspect as the dose of the actual antigen producing thing cannot be controlled.\nRotavirus – Again, non-sterilizing.\nVaricella (chicken pox) – Again, non-sterilizing however, since Chicken Pox is wildly more dangerous in adults than children if you haven’t gotten it the old-fashioned way by the time you go into school you probably want to consider it for that reason.\nMeningococcal – That too is non-sterilizing and yet colleges, in particular, try to mandate it. Under this decision that is also illegal as the benefit is entirely personal.\nThe reason is that the basis for which\nJacobson\npermitted the smallpox vaccine mandate is because the vaccine was sterilizing. As Denninger explains: “the case turned on the fact that the smallpox vaccine in question was sterilizing; that is, it prevented spread of the disease because once inoculated you could neither acquire or transmit the infection. On this basis the Supreme Court held that despite a person’s objections and potential harms from taking it they could be fined if they refused.”\nThis means there is virtually no grounds for submitting to any vaccine mandate in the future. Unless and until a vaccine is legally declared to be sterilizing by a court, any attempt to mandate it is unconstitutional and illegal on its face.\nDISCUSS ON SG",
  "tags": [
    "law",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-06-11T14:36:04+00:00"
}