{
  "url": "https://voxday.net/2024/06/28/the-streets-of-midnight/",
  "scraped_at": "2026-01-08T14:36:13.354895",
  "title": "The Streets of Midnight",
  "date_display": "June 28, 2024",
  "date_iso": "2024-06-28T14:46:36+00:00",
  "date_from_url": "2024-06-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>SILENZIOSA </em>is not the only Arkhaven comic that is running new episodes this week. Both <em><a href=\"https://www.arkhaven.com/comics/supernatural/midnights-war/65-on-the-hunt\">MIDNIGHT’S WAR: NIGHT STREETS</a></em> and <em><a href=\"https://www.arkhaven.com/comics/comedy/hypergamouse/108-mice-going-own-way-108\">HYPERGAMOUSE </a></em>are back in action.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><a href=\"https://www.arkhaven.com/comics/supernatural/midnights-war/65-on-the-hunt\"><img alt=\"\" class=\"wp-image-63372\" decoding=\"async\" fetchpriority=\"high\" height=\"581\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/06/image-35.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/06/image-35.png 512w, https://voxday.net/wp-content/uploads/2024/06/image-35-264x300.png 264w\" width=\"512\"/></a></figure></div><p>One thing that has changed is that we’re going to make use of more black-and-white due to the fact that we’ve observed color comics double the production costs while seldom increasing the sales at all. And the leather editions will have black-and-white interiors anyhow, so while we definitely prefer the look of color, and while we will continue using color for those comics with the support for it such as <em>ALT-HERO</em>, our new <em>MIDNIGHT’S WAR</em> and <em>BLACK WARRANT</em> comics will be monochrome until further notice.</p><p>And while neither Arkhaven nor Arktoons have yet proven to be quite as successful as we anticipated, the infrastructure we’ve built is very sound and you’re going to see a lot more new products being released, both in print and on Arktoons, from <em>GHOST OF THE BADLANDS</em> and <em>SOMETHING BIG</em> to <em>OVERMIND</em>. The fact that we’re not only stable, but growing, when DC, Marvel, and IDW are all teetering on the brink of complete collapse is one positive, another one is the way that even the flagship mainstream comics-related shows are observably taking note of what Arkhaven is doing.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><a href=\"https://www.arkhaven.com/comics/superhero/alt-hero/31-suck-it-up\"><noscript><img alt=\"\" class=\"wp-image-63374\" decoding=\"async\" height=\"480\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/06/image-37.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/06/image-37.png 512w, https://voxday.net/wp-content/uploads/2024/06/image-37-300x281.png 300w\" width=\"512\"/></noscript><img alt=\"\" class=\"lazyload wp-image-63374\" data-sizes=\"(max-width: 512px) 100vw, 512px\" data-src=\"https://voxday.net/wp-content/uploads/2024/06/image-37.png\" data-srcset=\"https://voxday.net/wp-content/uploads/2024/06/image-37.png 512w, https://voxday.net/wp-content/uploads/2024/06/image-37-300x281.png 300w\" decoding=\"async\" height=\"480\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20512%20480%22%3E%3C/svg%3E\" width=\"512\"/></a></figure></div><p>Firecracker, “the leader of the Alt-Supe” movement on <em>THE BOYS</em>, looks pretty familiar, doesn’t she? And that’s her formal costume with the Seven; when she’s first introduced on the show has somehow become an overt apologia for elite Hellmouth pedophilia, she’s wearing cutoff jeans just like a certain Alabama cheerleader who also has a Southern acccent.</p><p>If you want to know what’s new to Arktoons every day, be sure to subscribe to <a href=\"https://arkhaven.substack.com/\">the Arkhaven Comics substack</a>.</p><p><em><a href=\"https://social.infogalactic.com/micropost/5bf5be3f-e162-4ed2-81a9-aa6f47910261\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "SILENZIOSA\nis not the only Arkhaven comic that is running new episodes this week. Both\nMIDNIGHT’S WAR: NIGHT STREETS\nand\nHYPERGAMOUSE\nare back in action.\nOne thing that has changed is that we’re going to make use of more black-and-white due to the fact that we’ve observed color comics double the production costs while seldom increasing the sales at all. And the leather editions will have black-and-white interiors anyhow, so while we definitely prefer the look of color, and while we will continue using color for those comics with the support for it such as\nALT-HERO\n, our new\nMIDNIGHT’S WAR\nand\nBLACK WARRANT\ncomics will be monochrome until further notice.\nAnd while neither Arkhaven nor Arktoons have yet proven to be quite as successful as we anticipated, the infrastructure we’ve built is very sound and you’re going to see a lot more new products being released, both in print and on Arktoons, from\nGHOST OF THE BADLANDS\nand\nSOMETHING BIG\nto\nOVERMIND\n. The fact that we’re not only stable, but growing, when DC, Marvel, and IDW are all teetering on the brink of complete collapse is one positive, another one is the way that even the flagship mainstream comics-related shows are observably taking note of what Arkhaven is doing.\nFirecracker, “the leader of the Alt-Supe” movement on\nTHE BOYS\n, looks pretty familiar, doesn’t she? And that’s her formal costume with the Seven; when she’s first introduced on the show has somehow become an overt apologia for elite Hellmouth pedophilia, she’s wearing cutoff jeans just like a certain Alabama cheerleader who also has a Southern acccent.\nIf you want to know what’s new to Arktoons every day, be sure to subscribe to\nthe Arkhaven Comics substack\n.\nDISCUSS ON SG",
  "tags": [
    "Arkhaven",
    "Arktoons",
    "comics"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-06-28T19:51:44+00:00"
}