{
  "url": "https://voxday.net/2024/06/16/the-anonymity-of-the-innovator/",
  "scraped_at": "2026-01-08T14:35:15.107945",
  "title": "The Anonymity of the Innovator",
  "date_display": "June 16, 2024",
  "date_iso": "2024-06-16T18:45:24+00:00",
  "date_from_url": "2024-06-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the early innovators in the knife-training world <a href=\"https://www.forcenecessary.com/have-i-fallen-on-the-knife-big-mistakes-i-have-made-teaching-my-knife-course-over-the-decades/\">contemplates some of his business mistakes</a>, and expresses his exasperation with the youngsters in the field who have no idea that they are standing on his shoulders.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>My review/remark caused a lot of guffaws and a few smart ass remarks, among the 20 and 30 year old readers, most of whom were so submerged in modern “dynasty jargon,” up to their fad-beards in mystique, and lost in the web world. They’d never even heard of us older guys from the 1990s and 2000s. I mean, who am I to comment like this on their latest fad-boy genius?</p></blockquote><p>I can identify. While I don’t fault my fellow GamerGaters who still don’t know, and have no reason to know, about my connection to the initial launch of GamerGate, it was a little astonishing to hear die-hard gamers claiming, with a straight face, that I had no connection to gaming or game development at all. But that doesn’t bother me, just as the litany of my various failures by the usual anklebiters doesn’t</p><p>That’s not to say that none of my failures bother me. The failure in particular that haunts me the most wasn’t even my fault, perhaps in part because I keep <a href=\"https://edition.cnn.com/2024/06/05/investing/nvidia-stock-apple-microsoft-market-value/index.html\">being reminded of it</a> on a regular basis. And virtually no one who wasn’t in a very small and elite circle even remembers anything about it. As a result, <a href=\"https://voxday.net/2013/06/03/mailvox-they-want-to-disbelieve/\">no one wants to believe it</a>, or would believe it if it weren’t <a href=\"https://archive.org/details/Computer_Gaming_World_Issue_115/page/n9/mode/2up\">a matter of historical and public record</a>.</p><hr class=\"wp-block-separator has-alpha-channel-opacity\"/><p><em>The Latest News From The Gaming World: Sim Fans—Welcome To The Next Level</em><br/><strong>ARTIST Graphics’ 3GA Chip Feeds The Need For 3D Speed</strong></p><p>ARTIST Graphics, a Minneapolis-based hardware manufacturer, has announced a new graphics chip that may transform your work-a-day PC into a high-performance graphics workstation.</p><p>Consider the current state of the art: <em>IndyCar Racing</em>. Papyrus’s hot new game creates a very intense environment for simulated racing action. To do so, it pushes current technology to produce 12,000 flat shaded or 2,000 texture-mapped polygons per second. Bur imagine how much richer, how much more intense, a simulation could be if it could process 12 million flat-shaded, or 30,000 texture-mapped polygons per second at a higher screen resolution than standard VGA. While this might sound as far off as Gibsonian cyberspace, ARTIST Graphics and their 36/1 video processing chips may well make such simulations a very real possibility in ‘94.</p><p>ARTIST Graphics has been a manufacturer of graphics hardware used primarily for Computer Aided Design since 1982. Their chips and video boards are used widely by CAD professionals for applications that need heavy graphics horsepower. Adapting ARTIST Graphics’ latest high-end graphics technology to the PC games market is largely the result of a conversation that took place in 1992 between Chris Taylor, senior software engineer at Electronic Arts, and Theodore Beale, “trans-dimensional evangelist” at ARTIST Graphics.</p><p>“Chris had called to find out about VESA support on some of our cards,” said Beale. “We got to talking games, and I swapped him a graphics board in return for a couple of EA games. After playing with it for a few weeks, he suggested that we add a few features to our next-generation chip that would make it a really killer device for 3D simulators and action games. I went back to our engineers and asked them about adding the features, and Io and behold, the 3GA.”</p><p>According to ARTIST, the chip is capable of displaying up to 12 million flat-shadowed, two hundred thousand Gouraud-shaded, or thirty-thousand texture-mapped polygons per second in a game. These numbers approach RISC-based graphic workstation performance. Simulated benchmark tests have yielded 90 million WinMarks on the WinBench 3.11 test at 1280 x 1024 x 8 resolution on a 486/66 PCI bus machine (an average local-bus VGA video card at 640×480 yields 6 million WinMarks). Games could be written to run with the 3GA from within Windows, with the game’s code written to effectively bypass the Windows’ graphics routines. This would allow 3D intensive games to run under Windows without degradation of performance.</p><p>The 3GA chip’s 64-bit wide local memory bus supports up to 4 megabytes of VRAM and up to 8 megabytes of DRAM. The memory allows a game to load a huge portion of a game’s graphic data directly onto the card, thereby relieving the computer of a huge burden. Additionally, the 3GA chip has an on-chip VGA architecture which supports standard VGA text and graphics modes, and VESA SVGA modes up to 1024 x 768 resolution at 8 bits per pixel.</p><p>“With this kind of technology,” says Fred Savage, director at Origin Systems, “the limitations of the VGA architecture are removed. Anything that allows us to reduce the load on the CPU is going to let us have a much larger scope for our PC-based games.”</p><p>ARTIST’ Graphics is currently working on an OEM deal with a major video card manufacturer. For more information, contact ARTIST’ Graphics at (612) 631-7800.</p><p><em>Computer Gaming World</em>, February 2024</p><hr class=\"wp-block-separator has-alpha-channel-opacity\"/><p>One of these days I’ll go into more detail on the panoply of mistakes that were made, by me and others, that opened the door for Nvidea, and also answer some intriguing anomalies, such as why Artist Graphics held the original trademark for the 3D Blaster and how my biggest, most massive mistake until 30 years after the fact.</p><p><em><a href=\"https://social.infogalactic.com/micropost/9c1845df-0e01-430c-a710-c9c791f39e55\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "One of the early innovators in the knife-training world\ncontemplates some of his business mistakes\n, and expresses his exasperation with the youngsters in the field who have no idea that they are standing on his shoulders.\nMy review/remark caused a lot of guffaws and a few smart ass remarks, among the 20 and 30 year old readers, most of whom were so submerged in modern “dynasty jargon,” up to their fad-beards in mystique, and lost in the web world. They’d never even heard of us older guys from the 1990s and 2000s. I mean, who am I to comment like this on their latest fad-boy genius?\nI can identify. While I don’t fault my fellow GamerGaters who still don’t know, and have no reason to know, about my connection to the initial launch of GamerGate, it was a little astonishing to hear die-hard gamers claiming, with a straight face, that I had no connection to gaming or game development at all. But that doesn’t bother me, just as the litany of my various failures by the usual anklebiters doesn’t\nThat’s not to say that none of my failures bother me. The failure in particular that haunts me the most wasn’t even my fault, perhaps in part because I keep\nbeing reminded of it\non a regular basis. And virtually no one who wasn’t in a very small and elite circle even remembers anything about it. As a result,\nno one wants to believe it\n, or would believe it if it weren’t\na matter of historical and public record\n.\nThe Latest News From The Gaming World: Sim Fans—Welcome To The Next Level\nARTIST Graphics’ 3GA Chip Feeds The Need For 3D Speed\nARTIST Graphics, a Minneapolis-based hardware manufacturer, has announced a new graphics chip that may transform your work-a-day PC into a high-performance graphics workstation.\nConsider the current state of the art:\nIndyCar Racing\n. Papyrus’s hot new game creates a very intense environment for simulated racing action. To do so, it pushes current technology to produce 12,000 flat shaded or 2,000 texture-mapped polygons per second. Bur imagine how much richer, how much more intense, a simulation could be if it could process 12 million flat-shaded, or 30,000 texture-mapped polygons per second at a higher screen resolution than standard VGA. While this might sound as far off as Gibsonian cyberspace, ARTIST Graphics and their 36/1 video processing chips may well make such simulations a very real possibility in ‘94.\nARTIST Graphics has been a manufacturer of graphics hardware used primarily for Computer Aided Design since 1982. Their chips and video boards are used widely by CAD professionals for applications that need heavy graphics horsepower. Adapting ARTIST Graphics’ latest high-end graphics technology to the PC games market is largely the result of a conversation that took place in 1992 between Chris Taylor, senior software engineer at Electronic Arts, and Theodore Beale, “trans-dimensional evangelist” at ARTIST Graphics.\n“Chris had called to find out about VESA support on some of our cards,” said Beale. “We got to talking games, and I swapped him a graphics board in return for a couple of EA games. After playing with it for a few weeks, he suggested that we add a few features to our next-generation chip that would make it a really killer device for 3D simulators and action games. I went back to our engineers and asked them about adding the features, and Io and behold, the 3GA.”\nAccording to ARTIST, the chip is capable of displaying up to 12 million flat-shadowed, two hundred thousand Gouraud-shaded, or thirty-thousand texture-mapped polygons per second in a game. These numbers approach RISC-based graphic workstation performance. Simulated benchmark tests have yielded 90 million WinMarks on the WinBench 3.11 test at 1280 x 1024 x 8 resolution on a 486/66 PCI bus machine (an average local-bus VGA video card at 640×480 yields 6 million WinMarks). Games could be written to run with the 3GA from within Windows, with the game’s code written to effectively bypass the Windows’ graphics routines. This would allow 3D intensive games to run under Windows without degradation of performance.\nThe 3GA chip’s 64-bit wide local memory bus supports up to 4 megabytes of VRAM and up to 8 megabytes of DRAM. The memory allows a game to load a huge portion of a game’s graphic data directly onto the card, thereby relieving the computer of a huge burden. Additionally, the 3GA chip has an on-chip VGA architecture which supports standard VGA text and graphics modes, and VESA SVGA modes up to 1024 x 768 resolution at 8 bits per pixel.\n“With this kind of technology,” says Fred Savage, director at Origin Systems, “the limitations of the VGA architecture are removed. Anything that allows us to reduce the load on the CPU is going to let us have a much larger scope for our PC-based games.”\nARTIST’ Graphics is currently working on an OEM deal with a major video card manufacturer. For more information, contact ARTIST’ Graphics at (612) 631-7800.\nComputer Gaming World\n, February 2024\nOne of these days I’ll go into more detail on the panoply of mistakes that were made, by me and others, that opened the door for Nvidea, and also answer some intriguing anomalies, such as why Artist Graphics held the original trademark for the 3D Blaster and how my biggest, most massive mistake until 30 years after the fact.\nDISCUSS ON SG",
  "tags": [
    "games",
    "history",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-06-16T21:05:06+00:00"
}