{
  "url": "https://voxday.net/2024/06/28/the-russian-historiography-of-wii/",
  "scraped_at": "2026-01-08T14:36:11.534099",
  "title": "The Russian Historiography of WII",
  "date_display": "June 28, 2024",
  "date_iso": "2024-06-28T13:31:18+00:00",
  "date_from_url": "2024-06-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This looks like <a href=\"https://www.thepostil.com/of-collective-security-an-interview-with-michael-jabara-carley/\">a book worth reading</a> once I’m finished with Jack Vance’s <em>Treasury</em>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>The Postil (TP): </strong><em>You have written a trilogy on the Great Patriotic War, that is the Second World War as experienced by Soviet Union. The first part of this magisterial study will be published soon. What is your overall aim?</em></p><p><strong>Michael Jabara Carley (MJC):</strong> My trilogy, as I call it, deals with the origins and early conduct of the Second World War and the Great Patriotic War (Velikaia Otechestvennaia voina). The VOV is the name given to the war in Soviet and Russian history arising from the German invasion of the USSR on 22 June 1941. My work runs from January 1930 to December 1941. My project was first entitled “A Near-run Thing: The Improbable Grand Alliance of World War II,” supported by an “Insight” research grant from the Social Sciences and Humanities Research Council of Canada. My initial objective was to write a narrative history of how the USSR, Britain, and the United States, powers hostile to each other during the interwar years, became allies against Nazi Germany and the Axis. The work evolved from an envisioned single volume into three dealing with Soviet relations with the great and lesser European powers and the United States.</p><p><strong>TP: </strong><em>Is there a difference between a Western historiography of WWII and a Russian one?</em></p><p><strong>MJC: </strong>Oh yes, the difference is enormous. During the war, it was clear to all who had eyes to see that the Red Army played the key role in smashing the Nazi Wehrmacht and winning the war in Europe. The United States and Britain played supporting roles. After 1945 the war became an important object of propaganda in the Cold War. The new narrative was that the United States or Churchill single-handedly won the war in which the USSR was practically invisible. In the western media, histories, iconography, Hollywood films, comic books, more recently video games, the Red Army is invisible. The key moment in the war was operation Overlord, the Normandy landings, when in fact, they were an anticlimax, grand to be sure, in a war whose outcome had already been determined by the Red Army. In the context of the Cold War, it was normal that the United States would seek in various ways to rub out the memories of the Soviet role in the war, for otherwise how could you portray the USSR as a menacing communist enemy.</p></blockquote><p>I’ll report back on it once I’ve finished it. It should be interesting to see if he supports or contradicts the <em>Icebreaker </em>theory of Operation Barbarossa.</p><p><em><a href=\"https://social.infogalactic.com/micropost/aee14c40-d68d-4d76-93f2-3feae1db8ab1\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "This looks like\na book worth reading\nonce I’m finished with Jack Vance’s\nTreasury\n.\nThe Postil (TP):\nYou have written a trilogy on the Great Patriotic War, that is the Second World War as experienced by Soviet Union. The first part of this magisterial study will be published soon. What is your overall aim?\nMichael Jabara Carley (MJC):\nMy trilogy, as I call it, deals with the origins and early conduct of the Second World War and the Great Patriotic War (Velikaia Otechestvennaia voina). The VOV is the name given to the war in Soviet and Russian history arising from the German invasion of the USSR on 22 June 1941. My work runs from January 1930 to December 1941. My project was first entitled “A Near-run Thing: The Improbable Grand Alliance of World War II,” supported by an “Insight” research grant from the Social Sciences and Humanities Research Council of Canada. My initial objective was to write a narrative history of how the USSR, Britain, and the United States, powers hostile to each other during the interwar years, became allies against Nazi Germany and the Axis. The work evolved from an envisioned single volume into three dealing with Soviet relations with the great and lesser European powers and the United States.\nTP:\nIs there a difference between a Western historiography of WWII and a Russian one?\nMJC:\nOh yes, the difference is enormous. During the war, it was clear to all who had eyes to see that the Red Army played the key role in smashing the Nazi Wehrmacht and winning the war in Europe. The United States and Britain played supporting roles. After 1945 the war became an important object of propaganda in the Cold War. The new narrative was that the United States or Churchill single-handedly won the war in which the USSR was practically invisible. In the western media, histories, iconography, Hollywood films, comic books, more recently video games, the Red Army is invisible. The key moment in the war was operation Overlord, the Normandy landings, when in fact, they were an anticlimax, grand to be sure, in a war whose outcome had already been determined by the Red Army. In the context of the Cold War, it was normal that the United States would seek in various ways to rub out the memories of the Soviet role in the war, for otherwise how could you portray the USSR as a menacing communist enemy.\nI’ll report back on it once I’ve finished it. It should be interesting to see if he supports or contradicts the\nIcebreaker\ntheory of Operation Barbarossa.\nDISCUSS ON SG",
  "tags": [
    "history",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-06-28T13:31:20+00:00"
}