{
  "url": "https://voxday.net/2024/06/13/try-try-and-try-again/",
  "scraped_at": "2026-01-08T14:35:00.781819",
  "title": "The Sad, Stupid Rise of the Sigma Male",
  "date_display": "June 13, 2024",
  "date_iso": "2024-06-13T10:48:50+00:00",
  "date_from_url": "2024-06-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>The Guardian</em> has come a long way since it first started trying to discredit me <a href=\"https://voxday.net/2013/02/05/very-important-international-news/\">back in 2013</a>. Back then, I didn’t merit identification by name, but was merely “one particular individual” and John Scalzi’s “bête noir”. They started identifying me as Vox Day <a href=\"https://voxday.net/2015/07/25/its-not-new-proble/\">in 2016</a> when the Rabid Puppies upended the Hugo Awards, but now that the concepts of the Sigma Male and the SSH have entered the mainstream discourse, I’ve been upgraded <a href=\"https://archive.is/VxqPj\">to full “real name” status</a>, complete with unequivocal libel and false attributions:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>The sad, stupid rise of the sigma male: how toxic masculinity took over social media</strong></p><p>The “sigma male” emerged from this primordial testosterone swamp largely thanks to a 55-year-old American science-fiction writer and publisher named Theodore Robert Beale, who blogs under the name Vox Day. A proud Christian nationalist, racist and misogynist, Beale has argued that black men are genetically more inclined to violence than white men, that women should not be allowed to vote, and that feminism was “a seductive but destructive Jewish ideology that was more incoherent than communism, more bloodthirsty than nazism, and more histrionic than fascism”.</p><p>In 2010 Beale wrote a blog post in which he attempted to expand the “overly simplistic” division of men into alphas and betas. He came up with his own “sociosexual hierarchy”, with alphas at the top – “the male elite, the leaders of men for whom women naturally lust” – followed by betas, deltas, gammas, lambdas, right down to omegas – “the losers”. Sitting outside this imaginary pyramid of masculinity were sigmas – “the lone wolves”. Beale defined sigmas as “outsiders who don’t play the social game and manage to win at it anyhow” and who “often like women, but also tend to be contemptuous of them”. They were on a par with alphas, but just didn’t show off about it.</p><p>“There is very little – if any – convincing science behind the notion that personality types exist or are fixed,” says Debbie Ging, professor of digital media and gender at Dublin City University. “It’s basically a really simplistic, misguided and bio-determinist account of human behaviour, which doesn’t take into account the sociocultural construction of gender identity or the impact of economic and political forces on people’s choices or lack thereof.”</p></blockquote><p>The purpose, of course, is to seed Wikipedia and provide other publications with identification and spotting in order to encourage them to fire for effect. That’s why the full name, nationality, and age are provided, to ensure that the journalists in the SJW school follow this particular turn of direction correctly. So, we can anticipate a few more hit pieces from the lesser media sites, although I expect the Swiss journalists have learned their lesson about the validity of Internet sources by now and are less than enthusiastic about sitting down for another round of interviews with the police.</p><p>The piece by a pretty good specimen of journalistic deceit. The author, Steve Rose, is almost certainly aware that the idea that “black men are genetically more inclined to violence than white men” is not my argument, but rather an observation by the British editor of <em>Science</em>, <em>Nature</em>, and the science section of <em>The New York Times</em>, Nicholas Wade, in his controversial 2014 book <em>A Troublesome Inheritance: Genes, Race and Human History</em>.</p><p>Rose knows this, because there are no less than 11 references to Wade’s work on this blog, including the direct quote from the book that is the basis for the argument to which Rose is referring and falsely attributing to me.</p><p><em>“As it happens, the promoter for MAO-A is quite variable in the human population. People may have two, three, four or five copies of it, and the more copies they have, the more of the MAO-A enzyme their cells produce. What difference does this make to a person’s behavior? Quite a lot, it turns out. People with three, four or five copies of the MAO-A promoter are normal but those with only two copies have a much higher level of delinquency…. He and his colleagues looked at the MAO-A promoters in African Americans. The subjects were the same 2,524 American youths in the study by Shih mentioned above. Of the African American men in the sample, 5% carried two MAO-A promoters, the condition that Shih had found to be associated with higher levels of delinquency. Members of the two-promoter group were significantly more likely to have been arrested and imprisoned than African Americans who carried three or four promoters. The same comparison could not be made in white, or Caucasian, males, the researchers report, because only 0.1% carry the two-promoter allele.”</em></p><p>Now, why would my fellow former contributor to the <em>Atlanta Journal/Constitution</em> – Rose didn’t mention that either, naughty naughty – falsely attribute my reference to Wade’s book and Shi’s study as being an original argument of my own? Because it’s just another hit piece, of course.</p><p>Anyhow, just as the Swiss hit piece only made me look like a prescient genius with regards to the Russian military victory in Ukraine, this British hit piece is going to demonstrate, once more, that I’m well ahead of the scientists and the current state of scientage. Because while the mainstream Narrative is asserting, correctly, that there is no “convincing science behind the notion that personality types exist or are fixed”, they are too low-IQ to understand that scientage is a dynamic and incomplete collection of accepted knowledge, some of which is verifiably true and some of which is provably false.</p><p>There is little, if any, scientific evidence for generally fixed behavioral profiles because I am the one who provided the original hypothesis, just as I was the one who provided <a href=\"https://voxday.net/2007/08/02/socially-autistic-atheis/\">the original hypothesis in 2007</a>, now supported by <a href=\"https://voxday.net/2010/05/31/scientific-american-and-social-autis/\">the scientific evidence</a> of several studies, for the link between atheism and autism. The fact that the evidence has not yet been provided by professional scientists for a new scientific hypothesis says absolutely nothing about the hypothesis being supported or falsified by the scientody required to produce, or fail to produce, the scientific evidence.</p><p>And the fact that the SSH is a taxonomy, one that describes real and observable patterns of human behavior, means that the evidence to back the hypothesis will inevitably be forthcoming. There are no amount of experiments and studies that will deny the existence of the readily observable; deny the okapi all you like, but everyone can go and literally see it at the zoo.</p><p>Which is why I find this particular hit piece to be both informative and extremely useful. It’s informative because it tells us that the SSH is getting popular enough that Clown World wants to either a) disappear it or at least b) sever its link with me, and it’s useful because it will serve as additional proof of precedence for what will eventually be my well-deserved claim to be the father of anthrothesiology once the scientists begin to catch up with the concepts I’ve introduced and begin not only substantiating them, but utilizing them.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-63199\" decoding=\"async\" fetchpriority=\"high\" height=\"500\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/06/image-12.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/06/image-12.png 512w, https://voxday.net/wp-content/uploads/2024/06/image-12-300x293.png 300w\" width=\"512\"><figcaption class=\"wp-element-caption\"><em>The Rise of Anthrothesiology</em></figcaption></img></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/a66f708c-1c5a-4487-88c6-738a04f79644\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Guardian\nhas come a long way since it first started trying to discredit me\nback in 2013\n. Back then, I didn’t merit identification by name, but was merely “one particular individual” and John Scalzi’s “bête noir”. They started identifying me as Vox Day\nin 2016\nwhen the Rabid Puppies upended the Hugo Awards, but now that the concepts of the Sigma Male and the SSH have entered the mainstream discourse, I’ve been upgraded\nto full “real name” status\n, complete with unequivocal libel and false attributions:\nThe sad, stupid rise of the sigma male: how toxic masculinity took over social media\nThe “sigma male” emerged from this primordial testosterone swamp largely thanks to a 55-year-old American science-fiction writer and publisher named Theodore Robert Beale, who blogs under the name Vox Day. A proud Christian nationalist, racist and misogynist, Beale has argued that black men are genetically more inclined to violence than white men, that women should not be allowed to vote, and that feminism was “a seductive but destructive Jewish ideology that was more incoherent than communism, more bloodthirsty than nazism, and more histrionic than fascism”.\nIn 2010 Beale wrote a blog post in which he attempted to expand the “overly simplistic” division of men into alphas and betas. He came up with his own “sociosexual hierarchy”, with alphas at the top – “the male elite, the leaders of men for whom women naturally lust” – followed by betas, deltas, gammas, lambdas, right down to omegas – “the losers”. Sitting outside this imaginary pyramid of masculinity were sigmas – “the lone wolves”. Beale defined sigmas as “outsiders who don’t play the social game and manage to win at it anyhow” and who “often like women, but also tend to be contemptuous of them”. They were on a par with alphas, but just didn’t show off about it.\n“There is very little – if any – convincing science behind the notion that personality types exist or are fixed,” says Debbie Ging, professor of digital media and gender at Dublin City University. “It’s basically a really simplistic, misguided and bio-determinist account of human behaviour, which doesn’t take into account the sociocultural construction of gender identity or the impact of economic and political forces on people’s choices or lack thereof.”\nThe purpose, of course, is to seed Wikipedia and provide other publications with identification and spotting in order to encourage them to fire for effect. That’s why the full name, nationality, and age are provided, to ensure that the journalists in the SJW school follow this particular turn of direction correctly. So, we can anticipate a few more hit pieces from the lesser media sites, although I expect the Swiss journalists have learned their lesson about the validity of Internet sources by now and are less than enthusiastic about sitting down for another round of interviews with the police.\nThe piece by a pretty good specimen of journalistic deceit. The author, Steve Rose, is almost certainly aware that the idea that “black men are genetically more inclined to violence than white men” is not my argument, but rather an observation by the British editor of\nScience\n,\nNature\n, and the science section of\nThe New York Times\n, Nicholas Wade, in his controversial 2014 book\nA Troublesome Inheritance: Genes, Race and Human History\n.\nRose knows this, because there are no less than 11 references to Wade’s work on this blog, including the direct quote from the book that is the basis for the argument to which Rose is referring and falsely attributing to me.\n“As it happens, the promoter for MAO-A is quite variable in the human population. People may have two, three, four or five copies of it, and the more copies they have, the more of the MAO-A enzyme their cells produce. What difference does this make to a person’s behavior? Quite a lot, it turns out. People with three, four or five copies of the MAO-A promoter are normal but those with only two copies have a much higher level of delinquency…. He and his colleagues looked at the MAO-A promoters in African Americans. The subjects were the same 2,524 American youths in the study by Shih mentioned above. Of the African American men in the sample, 5% carried two MAO-A promoters, the condition that Shih had found to be associated with higher levels of delinquency. Members of the two-promoter group were significantly more likely to have been arrested and imprisoned than African Americans who carried three or four promoters. The same comparison could not be made in white, or Caucasian, males, the researchers report, because only 0.1% carry the two-promoter allele.”\nNow, why would my fellow former contributor to the\nAtlanta Journal/Constitution\n– Rose didn’t mention that either, naughty naughty – falsely attribute my reference to Wade’s book and Shi’s study as being an original argument of my own? Because it’s just another hit piece, of course.\nAnyhow, just as the Swiss hit piece only made me look like a prescient genius with regards to the Russian military victory in Ukraine, this British hit piece is going to demonstrate, once more, that I’m well ahead of the scientists and the current state of scientage. Because while the mainstream Narrative is asserting, correctly, that there is no “convincing science behind the notion that personality types exist or are fixed”, they are too low-IQ to understand that scientage is a dynamic and incomplete collection of accepted knowledge, some of which is verifiably true and some of which is provably false.\nThere is little, if any, scientific evidence for generally fixed behavioral profiles because I am the one who provided the original hypothesis, just as I was the one who provided\nthe original hypothesis in 2007\n, now supported by\nthe scientific evidence\nof several studies, for the link between atheism and autism. The fact that the evidence has not yet been provided by professional scientists for a new scientific hypothesis says absolutely nothing about the hypothesis being supported or falsified by the scientody required to produce, or fail to produce, the scientific evidence.\nAnd the fact that the SSH is a taxonomy, one that describes real and observable patterns of human behavior, means that the evidence to back the hypothesis will inevitably be forthcoming. There are no amount of experiments and studies that will deny the existence of the readily observable; deny the okapi all you like, but everyone can go and literally see it at the zoo.\nWhich is why I find this particular hit piece to be both informative and extremely useful. It’s informative because it tells us that the SSH is getting popular enough that Clown World wants to either a) disappear it or at least b) sever its link with me, and it’s useful because it will serve as additional proof of precedence for what will eventually be my well-deserved claim to be the father of anthrothesiology once the scientists begin to catch up with the concepts I’ve introduced and begin not only substantiating them, but utilizing them.\nThe Rise of Anthrothesiology\nDISCUSS ON SG",
  "tags": [
    "media",
    "Sigma Game",
    "SJW",
    "Voxiversity"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-06-13T12:25:27+00:00"
}