{
  "url": "https://voxday.net/2010/08/20/affirmative-action-presiden/",
  "scraped_at": "2026-01-08T23:35:08.177892",
  "title": "The affirmative-action president",
  "date_display": "August 20, 2010",
  "date_iso": "2010-08-20T08:12:00+00:00",
  "date_from_url": "2010-08-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jennifer Rubin is among those who have finally figured out that <a href=\"http://www.commentarymagazine.com/blogs/index.php/rubin/343946\">Soebarkah is nowhere near as intelligent</a> as advertised:</p><blockquote><p>To be blunt, Obama suffers from a lifetime of others excessively praising his intellect. It insulates him from ideas and facts that conflict with his pre-existing liberal rubric (so “every economist” believed his stimulus would work). It leaves him unprepared to engage in real debate with informed opponents (e.g. the health-care summit). It skews his understanding of how geopolitics works, as he imagines that his own wonderfulness can sway adversaries and override nations’ fundamental interests (the Middle East)….  The image of himself clashes with the results he achieves and the reaction he inspires. No wonder he’s so prickly. You’d be, too, if everyone your entire life had told you that you were swell but now, when the chips are down and the spotlight is on, you are failing so badly in your job.</p></blockquote><p>I figured out during the campaign that while Soebarkah is more intelligent than the average, <a href=\"http://www.milobookclub.com/2008/09/18/barack-obamas-iq-is-116_18/\">he is far less intelligent </a>than his academic background would normally lead one to believe.  He’s simply not as smart as his underlings or most of his peers in the political elite and he knows it, which is why he accepts the de facto leadership of Reid and Pelosi.  This doesn’t make him uniquely cretinous among the Washington set; John Kerry has a similar IQ in the 115 to 120 range.  But because people expect more from a president, I have little doubt that by the time Soebarkah’s political career is done, most likely after his first term, the national consensus will be that he was one of the dumbest presidents with whom the electorate has ever inflicted itself.</p></div>",
  "content_text": "Jennifer Rubin is among those who have finally figured out that\nSoebarkah is nowhere near as intelligent\nas advertised:\nTo be blunt, Obama suffers from a lifetime of others excessively praising his intellect. It insulates him from ideas and facts that conflict with his pre-existing liberal rubric (so “every economist” believed his stimulus would work). It leaves him unprepared to engage in real debate with informed opponents (e.g. the health-care summit). It skews his understanding of how geopolitics works, as he imagines that his own wonderfulness can sway adversaries and override nations’ fundamental interests (the Middle East)….  The image of himself clashes with the results he achieves and the reaction he inspires. No wonder he’s so prickly. You’d be, too, if everyone your entire life had told you that you were swell but now, when the chips are down and the spotlight is on, you are failing so badly in your job.\nI figured out during the campaign that while Soebarkah is more intelligent than the average,\nhe is far less intelligent\nthan his academic background would normally lead one to believe.  He’s simply not as smart as his underlings or most of his peers in the political elite and he knows it, which is why he accepts the de facto leadership of Reid and Pelosi.  This doesn’t make him uniquely cretinous among the Washington set; John Kerry has a similar IQ in the 115 to 120 range.  But because people expect more from a president, I have little doubt that by the time Soebarkah’s political career is done, most likely after his first term, the national consensus will be that he was one of the dumbest presidents with whom the electorate has ever inflicted itself.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-20T07:12:00+00:00"
}