{
  "url": "https://voxday.net/2010/08/04/against-god-and-homeschooling/",
  "scraped_at": "2026-01-08T23:33:51.286322",
  "title": "Against God and homeschooling",
  "date_display": "August 4, 2010",
  "date_iso": "2010-08-04T14:30:00+00:00",
  "date_from_url": "2010-08-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>What a surprise.  A man who is dependent upon government “education” handouts is a <a href=\"http://scienceblogs.com/pharyngula/2010/08/i_am_the_wrong_person_to_answe.php\">proponent of totalitarian school law</a>:</p><blockquote><p>I am not a fan of homeschooling; in fact, if I had my way, I’d make it illegal. Too often it’s an excuse to isolate kids and hammer them full of ideological nonsense, and in a troubled public school system, it doesn’t help to strip students and money from a struggling district — it should be part of the social contract that we ought to provide a good education to everyone.</p></blockquote><p>Of course he would.  PZ is a conventional godless fascist of the early 20th century variety.  Totalitarians always oppose everything that strengthens individual freedom and poses a potential rival to the secular religion of the state.  There is a very good reason why the Nazis banned homeschooling in 1938 and “Free education for all children in public schools” is the tenth pillar of the Communist Manifesto, while it is nowhere to be found in the U.S. Constitution or the English Common Law.</p><p>UPDATE – I realize some of my critics, especially those partial to Pharyngula, find it difficult to believe that PZ is really as stupid as I consider him to be.  Perhaps this quote will help them understand that I am not exaggerating in the slightest.  And try to remember, PZ isn’t a scientist or a professor at an elite university, he’s an ex-scientist who hasn’t published in years and now teaches at a former community college.  “<i>When I told PZ Myers that in order for everyone to be equal we would have to make the smart people stupid. His response was to tell me that instead everyone should be educated. In order for everyone to be equal through education, we would have to force everyone to understand university level biology. Not only that, but everyone would have to understand university level mathematics, university level physics, university level English, and so forth.”</i></p><p>Equality through education.  The amusing thing is that PZ’s idea of a solution is one of the concepts used to bring about the dumbing-down of American education in the first place.  The clueless professor doesn’t even grasp the basic concept of the lowest common denominator, probably because he is too close to it.  Nor does he understand that educators cannot educate intelligence any more than basketball coaches can coach height.</p></div>",
  "content_text": "What a surprise.  A man who is dependent upon government “education” handouts is a\nproponent of totalitarian school law\n:\nI am not a fan of homeschooling; in fact, if I had my way, I’d make it illegal. Too often it’s an excuse to isolate kids and hammer them full of ideological nonsense, and in a troubled public school system, it doesn’t help to strip students and money from a struggling district — it should be part of the social contract that we ought to provide a good education to everyone.\nOf course he would.  PZ is a conventional godless fascist of the early 20th century variety.  Totalitarians always oppose everything that strengthens individual freedom and poses a potential rival to the secular religion of the state.  There is a very good reason why the Nazis banned homeschooling in 1938 and “Free education for all children in public schools” is the tenth pillar of the Communist Manifesto, while it is nowhere to be found in the U.S. Constitution or the English Common Law.\nUPDATE – I realize some of my critics, especially those partial to Pharyngula, find it difficult to believe that PZ is really as stupid as I consider him to be.  Perhaps this quote will help them understand that I am not exaggerating in the slightest.  And try to remember, PZ isn’t a scientist or a professor at an elite university, he’s an ex-scientist who hasn’t published in years and now teaches at a former community college.  “\nWhen I told PZ Myers that in order for everyone to be equal we would have to make the smart people stupid. His response was to tell me that instead everyone should be educated. In order for everyone to be equal through education, we would have to force everyone to understand university level biology. Not only that, but everyone would have to understand university level mathematics, university level physics, university level English, and so forth.”\nEquality through education.  The amusing thing is that PZ’s idea of a solution is one of the concepts used to bring about the dumbing-down of American education in the first place.  The clueless professor doesn’t even grasp the basic concept of the lowest common denominator, probably because he is too close to it.  Nor does he understand that educators cannot educate intelligence any more than basketball coaches can coach height.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-04T13:30:00+00:00"
}