{
  "url": "https://voxday.net/2010/08/23/and-your-poin/",
  "scraped_at": "2026-01-08T23:35:27.034269",
  "title": "And your point?",
  "date_display": "August 23, 2010",
  "date_iso": "2010-08-23T14:30:00+00:00",
  "date_from_url": "2010-08-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The New York Times shows why it is a rapidly fading force in printing <a href=\"http://www.nytimes.com/2010/08/22/opinion/22sun2.html?_r=1\">the single most stupid statement</a> ever to appear in a mainstream newspaper:</p><blockquote><p>The Justice Department decided last week not to bring charges against Tom DeLay, whose unethical conduct represented a modern low among Congressional leaders. The decision is a reminder that some of Washington’s worst big-money practices remain either legal or far too difficult to prosecute.  Mr. DeLay, the Texas Republican who had been the House majority leader, crowed that he had been “found innocent.” <b>But many of Mr. DeLay’s actions remain legal only because lawmakers have chosen not to criminalize them.</b></p></blockquote><p>Emphasis added.  I note that actions such as selling cocaine and whipping slaves remain illegal only because lawmakers have chosen to criminalize them.  It is interesting that the New York Times is so much more upset about a Republican lawmaker’s admittedly legal actions than it is about the blatantly illegal fraud that is still being committed by the banking industry on a daily basis.</p></div>",
  "content_text": "The New York Times shows why it is a rapidly fading force in printing\nthe single most stupid statement\never to appear in a mainstream newspaper:\nThe Justice Department decided last week not to bring charges against Tom DeLay, whose unethical conduct represented a modern low among Congressional leaders. The decision is a reminder that some of Washington’s worst big-money practices remain either legal or far too difficult to prosecute.  Mr. DeLay, the Texas Republican who had been the House majority leader, crowed that he had been “found innocent.”\nBut many of Mr. DeLay’s actions remain legal only because lawmakers have chosen not to criminalize them.\nEmphasis added.  I note that actions such as selling cocaine and whipping slaves remain illegal only because lawmakers have chosen to criminalize them.  It is interesting that the New York Times is so much more upset about a Republican lawmaker’s admittedly legal actions than it is about the blatantly illegal fraud that is still being committed by the banking industry on a daily basis.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-23T13:30:00+00:00"
}