{
  "url": "https://voxday.net/2010/08/12/anklebiters-anonymous/",
  "scraped_at": "2026-01-08T23:34:31.425145",
  "title": "Anklebiters Anonymous",
  "date_display": "August 12, 2010",
  "date_iso": "2010-08-12T08:44:00+00:00",
  "date_from_url": "2010-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In the interest of helping our resident trolls evolve into substantive commenters, as well as assisting non-Ilk readers recognize the usual suspects, I have decided to create a “best of” series which should serve as both amusement and edification.  The honor of the first “Beezle” award goes to Cabal, whose epic defense of science he quite clearly doesn’t understand was eviscerated by the merciless duo of Bob Mando and DaveD.  Please note that the ellipses are Cabal’s; his award-winning comment is quoted precisely and in full.</p><p><i>“Every single living organism that we know of is carbon-based and all of them require oxygen to live…without exception. And carbon is a by product of oxygen. the relationship between the 2 couldnt be clearer.”</i><br> – <b>Cabal: 8/10/10 10:37 AM</b>, <a href=\"http://www.milobookclub.com/2010/08/09/science-gets-it-wrong-again/\">Science gets it wrong… again </a></br></p><p>“Pure, unadulterated BS. there are <a href=\"http://en.wikipedia.org/wiki/Anaerobic_organism\">numerous KNOWN organisms</a> which will die in the presence of oxygen.</p><p>a – photosynthesis is possible without oxygen, even by carbon based life forms.<br> b – it is a founding principle of Evolution that cyanobacteria generated the free oxygen that exists in the atmosphere now as waste products.<br> c – it is a founding principle of Evolution that cyanobacteria ‘evolved’ from more primitive forms of bacteria which did not use oxygen at all in the photosynthesis process.</br></br></p><p>You are wrong about … well, pretty much everything, really.  Carbon is a non-radioactive base element, number 6.  Oxygen is also a non-radioactive base element, number 8.  Neither of these elements can ever be a “product” of the other without the intervention of fusion or quantum manipulation.  Carbon dioxide, on the other hand, is a compound element which breaks down into one carbon atom and two oxygen atoms through simple chemical processes.”<br> – Bob K. Mando</br></p><p>“You have shown yourself to be profoundly ignorant of both biology (“Every single living organism….require oxygen to live…without exception.” Except the ones that don’t.) and basic chemistry (“And carbon is a by product of oxygen.”) You haven’t even grasped the most basic elements of the observable world, which you interact with everyday. Why, then, should we pay any attention at all to your ramblings on the more abstract aspects of life and the universe?”<br> – DaveD</br></p><p>Congratulations to all.  The award is named for the banned commenter Beelzebub, whose ability to mangle facts and logic in the process of attempting to “correct” others is unparalleled.</p><p>UPDATE – Cabal amused the crowd by accepting his award, but not the chemistry lesson. <b>Cabal: 8/12/10 9:57 AM:</b> <i>“I was not in error. Remove oxygen molecules from the universe and carbon based life becomes impossible.”</i></p></div>",
  "content_text": "In the interest of helping our resident trolls evolve into substantive commenters, as well as assisting non-Ilk readers recognize the usual suspects, I have decided to create a “best of” series which should serve as both amusement and edification.  The honor of the first “Beezle” award goes to Cabal, whose epic defense of science he quite clearly doesn’t understand was eviscerated by the merciless duo of Bob Mando and DaveD.  Please note that the ellipses are Cabal’s; his award-winning comment is quoted precisely and in full.\n“Every single living organism that we know of is carbon-based and all of them require oxygen to live…without exception. And carbon is a by product of oxygen. the relationship between the 2 couldnt be clearer.”\n–\nCabal: 8/10/10 10:37 AM\n,\nScience gets it wrong… again\n“Pure, unadulterated BS. there are\nnumerous KNOWN organisms\nwhich will die in the presence of oxygen.\na – photosynthesis is possible without oxygen, even by carbon based life forms.\nb – it is a founding principle of Evolution that cyanobacteria generated the free oxygen that exists in the atmosphere now as waste products.\nc – it is a founding principle of Evolution that cyanobacteria ‘evolved’ from more primitive forms of bacteria which did not use oxygen at all in the photosynthesis process.\nYou are wrong about … well, pretty much everything, really.  Carbon is a non-radioactive base element, number 6.  Oxygen is also a non-radioactive base element, number 8.  Neither of these elements can ever be a “product” of the other without the intervention of fusion or quantum manipulation.  Carbon dioxide, on the other hand, is a compound element which breaks down into one carbon atom and two oxygen atoms through simple chemical processes.”\n– Bob K. Mando\n“You have shown yourself to be profoundly ignorant of both biology (“Every single living organism….require oxygen to live…without exception.” Except the ones that don’t.) and basic chemistry (“And carbon is a by product of oxygen.”) You haven’t even grasped the most basic elements of the observable world, which you interact with everyday. Why, then, should we pay any attention at all to your ramblings on the more abstract aspects of life and the universe?”\n– DaveD\nCongratulations to all.  The award is named for the banned commenter Beelzebub, whose ability to mangle facts and logic in the process of attempting to “correct” others is unparalleled.\nUPDATE – Cabal amused the crowd by accepting his award, but not the chemistry lesson.\nCabal: 8/12/10 9:57 AM:\n“I was not in error. Remove oxygen molecules from the universe and carbon based life becomes impossible.”",
  "tags": [
    "anklebiters",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-12T07:44:00+00:00"
}