{
  "url": "https://voxday.net/2010/08/22/badge-gang/",
  "scraped_at": "2026-01-08T23:35:21.436176",
  "title": "The badge gang (Mexican edition)",
  "date_display": "August 22, 2010",
  "date_iso": "2010-08-22T17:15:00+00:00",
  "date_from_url": "2010-08-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Do you honestly believe American police <a href=\"http://news.yahoo.com/s/time/20100821/wl_time/08599201236100;_ylt=Ahosfvf.R7KTym3CMuDkZXdzfNdF\">are any less corrupt</a>?</p><blockquote><p>The killers came for Mayor Cavazos in the early hours of Aug. 16 when seven SUV’s rolled up and men in police uniforms descended on his palatial home. Servants stood back terrified, as their boss was forced away at gunpoint. On Aug. 18, his corpse was dumped on a nearby road. There was a mercy of sorts in the manner of his killing – shot dead with two bullets in the head and one in the chest, and spared the mutilation and rape inflicted on so many other victims. The following day, hundreds of residents wept over his coffin in Santiago’s central plaza, lining the stairs up to the church with candles and holding signs calling for peace.</p><p>Then on Aug. 20, more disturbing news broke. State agents arrested six of the mayor’s own police officers and said they confessed to involvement in the murder.</p></blockquote><p>In fact, given the draconian seizure laws that permit American police to arrest <i>money</i> and keep a percentage of it, there is a sound basis for arguing that American police forces are even more structurally corrupt than their Mexican counterparts.  They may not be murdering any mayors, but then, they make even more money without having to do wetwork for hire.  The American history of Prohibition strongly suggests that main reason for the insane violence on the Mexican side of the border and the police corruption on the American side is that some drugs are deemed illegal.  Legalizing all drugs would eliminate both the violence and the corruption, which of course is why most police oppose drug legalization so strongly.  It would mean the end of their drug war-financed gravy train, which is worth around <s>$450 million</s><a href=\"http://www.npr.org/templates/story/story.php?storyId=91490480\">$1.58 billion per year</a> to the LOCAL law enforcement agencies of the country.</p></div>",
  "content_text": "Do you honestly believe American police\nare any less corrupt\n?\nThe killers came for Mayor Cavazos in the early hours of Aug. 16 when seven SUV’s rolled up and men in police uniforms descended on his palatial home. Servants stood back terrified, as their boss was forced away at gunpoint. On Aug. 18, his corpse was dumped on a nearby road. There was a mercy of sorts in the manner of his killing – shot dead with two bullets in the head and one in the chest, and spared the mutilation and rape inflicted on so many other victims. The following day, hundreds of residents wept over his coffin in Santiago’s central plaza, lining the stairs up to the church with candles and holding signs calling for peace.\nThen on Aug. 20, more disturbing news broke. State agents arrested six of the mayor’s own police officers and said they confessed to involvement in the murder.\nIn fact, given the draconian seizure laws that permit American police to arrest\nmoney\nand keep a percentage of it, there is a sound basis for arguing that American police forces are even more structurally corrupt than their Mexican counterparts.  They may not be murdering any mayors, but then, they make even more money without having to do wetwork for hire.  The American history of Prohibition strongly suggests that main reason for the insane violence on the Mexican side of the border and the police corruption on the American side is that some drugs are deemed illegal.  Legalizing all drugs would eliminate both the violence and the corruption, which of course is why most police oppose drug legalization so strongly.  It would mean the end of their drug war-financed gravy train, which is worth around\n$450 million\n$1.58 billion per year\nto the LOCAL law enforcement agencies of the country.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-22T16:15:00+00:00"
}