{
  "url": "https://voxday.net/2010/08/23/bloggers-at-treasury/",
  "scraped_at": "2026-01-08T23:35:30.716672",
  "title": "Bloggers at the Treasury",
  "date_display": "August 23, 2010",
  "date_iso": "2010-08-23T20:47:00+00:00",
  "date_from_url": "2010-08-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The personable personalities behind the Neo-Keynesian lunacy aside, it’s pretty much <a href=\"http://www.interfluidity.com/v2/933.html\">as bad as I expected</a>:</p><blockquote><p>On HAMP, officials were surprisingly candid. The program has gotten a lot of bad press in terms of its Kafka-esque qualification process and its limited success in generating mortgage modifications under which families become able and willing to pay their debt. Officials pointed out that what may have been an agonizing process for individuals was a useful palliative for the system as a whole. Even if most HAMP applicants ultimately default, the program prevented an outbreak of foreclosures exactly when the system could have handled it least. There were murmurs among the bloggers of “extend and pretend”, but I don’t think that’s quite right. This was extend-and-don’t-even-bother-to-pretend. The program was successful in the sense that it kept the patient alive until it had begun to heal. And the patient of this metaphor was not a struggling homeowner, but the financial system, a.k.a. the banks. Policymakers openly judged HAMP to be a qualified success because it helped banks muddle through what might have been a fatal shock. I believe these policymakers conflate, in full sincerity, incumbent financial institutions with “the system”, “the economy”, and “ordinary Americans”. Treasury officials are not cruel people. I’m sure they would have preferred if the program had worked out better for homeowners as well. But they have larger concerns, and from their perspective, HAMP has helped to address those.</p></blockquote><p>Needless to say, I’m shocked.  These programs are NEVER designed to help the people they are advertised as helping in order to justify their passage through Congress.  It was just another form of bank bailout.  The mistake, of course, is the assumption that the banks are going to be in any better shape to handle the flood of foreclosures that have been delayed since the “expected” economic recovery has proved illusory.  The fact that the past situation was dangerous is no indication that the future one will be any less so.</p><blockquote><p>Finally, our conversation turned to the current macroeconomic doldrums. Thankfully, there was none of the “let’s look on the bright side” chipperness of Timothy Geithner’s recent New York Times op-ed. Treasury officials didn’t downplay how bad things are. They did point out that considering  the headwinds the economy faces, things are a bit better than they might be. The account went roughly like this: Last year, after the doldrums of March, the economy grew faster and performed better than most would have forecast. But recently it encountered two obstacles, one expected, the other an unexpected near cataclysm. The spurt of GDP growth due to post-panic inventory restocking was always going to end. But a sovereign debt crisis in Europe strong enough to shake confidence and financial markets in the US was not expected. Taking all that into account, things are a bit better than they might have been. One Treasury official pointed out that if we could return to the path of consensus growth forecasts from just before the troubles in Europe, we would have two or three difficult years ahead of us yet, but would be on a decent path. I took this as a kind of optimistic but plausible thought experiment on where we might be going….  I was impressed that Treasury officials had a pretty good understanding of the impediments to growth going forward. They understood that the core problem preventing business expansion isn’t access to capital but absence of demand.</p></blockquote><p>I find this self-serving and ex post facto explanation to be entirely dubious.  The Treasury gang might have as reasonably broken into song and blamed Canada.  I was one of many economics observers to expect numerous sovereign debt crises, which is why I was writing about them in RGD before they happened.  I expected them to begin in Ireland and Spain, not Dubai and Greece, but sovereign debt overload is an extraordinarily target-rich environment these days.  The only country that comes up for discussion in this regard that isn’t a likely candidate for the next debt crisis is Italy because its debt/GDP issues don’t take into account its sizable black economy.</p><p>The grimly amusing thing is that we are presently on the precipice of another 2008-style meltdown and precisely none of these bloggers or Treasury officials appear to be aware of it.  This is probably because they’re clearly all still subject to the conceptual limitations of their Neo-Keynesian models.  The core problem isn’t either access to capital or an absence of demand, but rather a widespread inability to service debt or add more debt combined with the natural shifting back of the demand curve to <a href=\"http://www.milobookclub.com/2009/06/28/laughing-at-myself/\">its normal non-debt-inflated limits</a>.  And this isn’t a problem they can do much about; in fact, trying to keep the insolvent zombie banks afloat throughout the debt-deleveraging process is only going to waste incredible sums of money and extend the depression for years.</p><p>As Instapundit likes to say, the country is in the very best of hands.</p></div>",
  "content_text": "The personable personalities behind the Neo-Keynesian lunacy aside, it’s pretty much\nas bad as I expected\n:\nOn HAMP, officials were surprisingly candid. The program has gotten a lot of bad press in terms of its Kafka-esque qualification process and its limited success in generating mortgage modifications under which families become able and willing to pay their debt. Officials pointed out that what may have been an agonizing process for individuals was a useful palliative for the system as a whole. Even if most HAMP applicants ultimately default, the program prevented an outbreak of foreclosures exactly when the system could have handled it least. There were murmurs among the bloggers of “extend and pretend”, but I don’t think that’s quite right. This was extend-and-don’t-even-bother-to-pretend. The program was successful in the sense that it kept the patient alive until it had begun to heal. And the patient of this metaphor was not a struggling homeowner, but the financial system, a.k.a. the banks. Policymakers openly judged HAMP to be a qualified success because it helped banks muddle through what might have been a fatal shock. I believe these policymakers conflate, in full sincerity, incumbent financial institutions with “the system”, “the economy”, and “ordinary Americans”. Treasury officials are not cruel people. I’m sure they would have preferred if the program had worked out better for homeowners as well. But they have larger concerns, and from their perspective, HAMP has helped to address those.\nNeedless to say, I’m shocked.  These programs are NEVER designed to help the people they are advertised as helping in order to justify their passage through Congress.  It was just another form of bank bailout.  The mistake, of course, is the assumption that the banks are going to be in any better shape to handle the flood of foreclosures that have been delayed since the “expected” economic recovery has proved illusory.  The fact that the past situation was dangerous is no indication that the future one will be any less so.\nFinally, our conversation turned to the current macroeconomic doldrums. Thankfully, there was none of the “let’s look on the bright side” chipperness of Timothy Geithner’s recent New York Times op-ed. Treasury officials didn’t downplay how bad things are. They did point out that considering  the headwinds the economy faces, things are a bit better than they might be. The account went roughly like this: Last year, after the doldrums of March, the economy grew faster and performed better than most would have forecast. But recently it encountered two obstacles, one expected, the other an unexpected near cataclysm. The spurt of GDP growth due to post-panic inventory restocking was always going to end. But a sovereign debt crisis in Europe strong enough to shake confidence and financial markets in the US was not expected. Taking all that into account, things are a bit better than they might have been. One Treasury official pointed out that if we could return to the path of consensus growth forecasts from just before the troubles in Europe, we would have two or three difficult years ahead of us yet, but would be on a decent path. I took this as a kind of optimistic but plausible thought experiment on where we might be going….  I was impressed that Treasury officials had a pretty good understanding of the impediments to growth going forward. They understood that the core problem preventing business expansion isn’t access to capital but absence of demand.\nI find this self-serving and ex post facto explanation to be entirely dubious.  The Treasury gang might have as reasonably broken into song and blamed Canada.  I was one of many economics observers to expect numerous sovereign debt crises, which is why I was writing about them in RGD before they happened.  I expected them to begin in Ireland and Spain, not Dubai and Greece, but sovereign debt overload is an extraordinarily target-rich environment these days.  The only country that comes up for discussion in this regard that isn’t a likely candidate for the next debt crisis is Italy because its debt/GDP issues don’t take into account its sizable black economy.\nThe grimly amusing thing is that we are presently on the precipice of another 2008-style meltdown and precisely none of these bloggers or Treasury officials appear to be aware of it.  This is probably because they’re clearly all still subject to the conceptual limitations of their Neo-Keynesian models.  The core problem isn’t either access to capital or an absence of demand, but rather a widespread inability to service debt or add more debt combined with the natural shifting back of the demand curve to\nits normal non-debt-inflated limits\n.  And this isn’t a problem they can do much about; in fact, trying to keep the insolvent zombie banks afloat throughout the debt-deleveraging process is only going to waste incredible sums of money and extend the depression for years.\nAs Instapundit likes to say, the country is in the very best of hands.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-23T19:47:00+00:00"
}