{
  "url": "https://voxday.net/2010/08/02/culture-of-science-fetishis/",
  "scraped_at": "2026-01-08T23:33:39.915593",
  "title": "The culture of science fetishism",
  "date_display": "August 2, 2010",
  "date_iso": "2010-08-02T20:15:00+00:00",
  "date_from_url": "2010-08-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The New York Times belatedly discovers that sciencebloggers don’t actually give a damn <a href=\"http://www.nytimes.com/2010/08/01/magazine/01FOB-medium-t.html?_r=2\">about science qua science</a>.</p><blockquote><p>Clearly I’ve been out of some loop for too long, but does everyone take for granted now that science sites are where graduate students, researchers, doctors and the “skeptical community” go not to interpret data or review experiments but to chip off one-liners, promote their books and jeer at smokers, fat people and churchgoers? And can anyone who still enjoys this class-inflected bloodsport tell me why it has to happen under the banner of science?</p><p>Hammering away at an ideology, substituting stridency for contemplation, pummeling its enemies in absentia: ScienceBlogs has become Fox News for the religion-baiting, peak-oil crowd. Though Myers and other science bloggers boast that they can be jerky in the service of anti-charlatanism, that’s not what’s bothersome about them. What’s bothersome is that the site is misleading. It’s not science by scientists, not even remotely; it’s science blogging by science bloggers. And science blogging, apparently, is a form of redundant and effortfully incendiary rhetoric that draws bad-faith moral authority from the word “science” and from occasional invocations of “peer-reviewed” thises and thats.</p></blockquote><p>There is the salient bit: <i>“rhetoric that draws bad-faith moral authority from the word “science”.”</i> That is exactly the same point about the fraudulent bait-and-switch so often utilized by scientists upon which I have been hammering for several years now.  It is interesting that an increasingly broad spectrum of people are now beginning to notice that just as not all that glitters is gold, not all that identifies itself with science is actually scientific.  Writing about science isn’t science.  Bitching about the Catholic church isn’t science.  Molesting food with malicious intent isn’t science.  Even <i>teaching about science</i> isn’t science.  These things may be important, they may be necessary, they may be entertaining, but they are not science.  This is precisely why I have always identified PZ Myers and others like him as charlatans; they claim to be scientists on the basis of their academic credentials rather than because they are actually doing any science.</p><p>By which logic I note that I am not only an economist, but East Asian to boot.  If studying Japan doesn’t make you Japanese, studying science cannot make you a scientist.</p></div>",
  "content_text": "The New York Times belatedly discovers that sciencebloggers don’t actually give a damn\nabout science qua science\n.\nClearly I’ve been out of some loop for too long, but does everyone take for granted now that science sites are where graduate students, researchers, doctors and the “skeptical community” go not to interpret data or review experiments but to chip off one-liners, promote their books and jeer at smokers, fat people and churchgoers? And can anyone who still enjoys this class-inflected bloodsport tell me why it has to happen under the banner of science?\nHammering away at an ideology, substituting stridency for contemplation, pummeling its enemies in absentia: ScienceBlogs has become Fox News for the religion-baiting, peak-oil crowd. Though Myers and other science bloggers boast that they can be jerky in the service of anti-charlatanism, that’s not what’s bothersome about them. What’s bothersome is that the site is misleading. It’s not science by scientists, not even remotely; it’s science blogging by science bloggers. And science blogging, apparently, is a form of redundant and effortfully incendiary rhetoric that draws bad-faith moral authority from the word “science” and from occasional invocations of “peer-reviewed” thises and thats.\nThere is the salient bit:\n“rhetoric that draws bad-faith moral authority from the word “science”.”\nThat is exactly the same point about the fraudulent bait-and-switch so often utilized by scientists upon which I have been hammering for several years now.  It is interesting that an increasingly broad spectrum of people are now beginning to notice that just as not all that glitters is gold, not all that identifies itself with science is actually scientific.  Writing about science isn’t science.  Bitching about the Catholic church isn’t science.  Molesting food with malicious intent isn’t science.  Even\nteaching about science\nisn’t science.  These things may be important, they may be necessary, they may be entertaining, but they are not science.  This is precisely why I have always identified PZ Myers and others like him as charlatans; they claim to be scientists on the basis of their academic credentials rather than because they are actually doing any science.\nBy which logic I note that I am not only an economist, but East Asian to boot.  If studying Japan doesn’t make you Japanese, studying science cannot make you a scientist.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-02T19:15:00+00:00"
}