{
  "url": "https://voxday.net/2010/08/13/dating-down/",
  "scraped_at": "2026-01-08T23:34:38.708130",
  "title": "Dating down",
  "date_display": "August 13, 2010",
  "date_iso": "2010-08-13T10:56:00+00:00",
  "date_from_url": "2010-08-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This Daily Mail article helps demonstrate why women with casual sexual experience are prone to overrating themselves and underlines the sexual economics that underlies Game.  The comparison between the virgin and the cougar-blimp is anecdotal and no doubt one could easily find an opposite pair to serve as a counterexample, but is there any doubt that a 31 year-old man with 50 lovers could not be as unattractive <a href=\"http://www.dailymail.co.uk/femail/article-1302310/Ones-virgin-slept-50-men--guess-lovers-women-had.html\">as the example shown here</a>?</p><p>However, this is the part that I found the most indicative of Game theory:</p><blockquote><p>I was rather prim when I was growing up – I didn’t have a sexual relationship until I was 17.  That was a classic holiday romance – he was a Turkish student and I met him when I was on holiday in Turkey with my sister. He fished my shoe out of the sea, and we got chatting. We spent the entire week together and slept together after a few days.  To me, sex meant commitment and I convinced myself I was madly in love. But like all holiday romances, it fizzled out.</p></blockquote><p>Sending a young woman between the ages of 15 and 18 on a vacation without serious adult supervision is the close equivalent of buying a hooker for a young man of the same age.  The difference is that there is a reasonable chance the hooker would be more acceptable as a long term partner.  Send her to France and she’ll do a Frenchman, send her to the mountains of Peru and she’ll do a squatty Incan if the raffish tour guide isn’t available.  For a variety of reasons, women are always much, much more prone to let their hair down and lift their skirts up whenever they have flown somewhere.  Throw in curiosity and teenage hormones as well as the appeal of the exotic Other and it’s a virtual lock.</p><p>The most amusing part, however, are the famous last words uttered by the woman with 25 notches on her bedpost:</p><blockquote><p>Jonny and I haven’t really talked about how many sexual partners we’ve had because we both take the same view that it’s the here and now that’s important, not the past.  I don’t think he will be concerned when he reads my tally. He doesn’t judge me and I don’t judge him.</p></blockquote><p>Of course he doesn’t… what a fortuitous coincidence that a man should happen to share an opinion with the woman he is casually banging!  How often does that happen?  It’s a shame there won’t be a follow-up piece explaining how Jonny, who no doubt finds it very hard to meet women <i>in the music industry</i>, read the article and eventually made use of it as an excuse to denounce Jodie as an incorrigible slut who is incapable of remaining faithful when he moved on to the next opportunity.</p><p><a href=\"http://www.milobookclub.com/2010/07/09/mailvox-hierarchy-of-female/\">Slutty Jane </a>is really not the category in which a woman wants to find herself when she’s ready to be done having fun and start settling down.</p></div>",
  "content_text": "This Daily Mail article helps demonstrate why women with casual sexual experience are prone to overrating themselves and underlines the sexual economics that underlies Game.  The comparison between the virgin and the cougar-blimp is anecdotal and no doubt one could easily find an opposite pair to serve as a counterexample, but is there any doubt that a 31 year-old man with 50 lovers could not be as unattractive\nas the example shown here\n?\nHowever, this is the part that I found the most indicative of Game theory:\nI was rather prim when I was growing up – I didn’t have a sexual relationship until I was 17.  That was a classic holiday romance – he was a Turkish student and I met him when I was on holiday in Turkey with my sister. He fished my shoe out of the sea, and we got chatting. We spent the entire week together and slept together after a few days.  To me, sex meant commitment and I convinced myself I was madly in love. But like all holiday romances, it fizzled out.\nSending a young woman between the ages of 15 and 18 on a vacation without serious adult supervision is the close equivalent of buying a hooker for a young man of the same age.  The difference is that there is a reasonable chance the hooker would be more acceptable as a long term partner.  Send her to France and she’ll do a Frenchman, send her to the mountains of Peru and she’ll do a squatty Incan if the raffish tour guide isn’t available.  For a variety of reasons, women are always much, much more prone to let their hair down and lift their skirts up whenever they have flown somewhere.  Throw in curiosity and teenage hormones as well as the appeal of the exotic Other and it’s a virtual lock.\nThe most amusing part, however, are the famous last words uttered by the woman with 25 notches on her bedpost:\nJonny and I haven’t really talked about how many sexual partners we’ve had because we both take the same view that it’s the here and now that’s important, not the past.  I don’t think he will be concerned when he reads my tally. He doesn’t judge me and I don’t judge him.\nOf course he doesn’t… what a fortuitous coincidence that a man should happen to share an opinion with the woman he is casually banging!  How often does that happen?  It’s a shame there won’t be a follow-up piece explaining how Jonny, who no doubt finds it very hard to meet women\nin the music industry\n, read the article and eventually made use of it as an excuse to denounce Jodie as an incorrigible slut who is incapable of remaining faithful when he moved on to the next opportunity.\nSlutty Jane\nis really not the category in which a woman wants to find herself when she’s ready to be done having fun and start settling down.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-13T09:56:00+00:00"
}