{
  "url": "https://voxday.net/2010/08/03/demonstrating-ignorance/",
  "scraped_at": "2026-01-08T23:33:41.771298",
  "title": "Demonstrating ignorance",
  "date_display": "August 3, 2010",
  "date_iso": "2010-08-03T08:24:00+00:00",
  "date_from_url": "2010-08-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Gary Gutting of Notre Dame <a href=\"http://opinionator.blogs.nytimes.com/2010/08/01/philosophy-and-faith/\">upsets the league of the ignorant godless</a>:</p><blockquote><p>In these popular debates about God’s existence, the winners are neither theists nor atheists, but agnostics — the neglected step-children of religious controversy, who rightly point out that neither side in the debate has made its case.   This is the position supported by the consensus of expert philosophical opinion.  This conclusion should particularly discomfit popular proponents of atheism, such as Richard Dawkins, whose position is entirely based on demonstrably faulty arguments.</p></blockquote><p>A professional academic’s dismissal of Richard Dawkins hapless arguments?  Make that the league of the indignant and ignorant godless.  The comments are hilarious, as the immediate reaction from the usual sort of moderate-IQ atheist is demands for Gutting to “support” or “prove” his factual statement that Dawkins’s position is “entirely based on demonstrably faulty arguments”.  Of course, whenever someone does bother to demonstrate precisely how Dawkins’s arguments are factually and logically flawed, the reaction of most such atheists is to a) refuse to read it, b) lie about the substance and attack strawman substitutes, and c) fall into an abrupt silence and hope the criticism goes away on its own.</p><p>On a tangential note, Half-Sigma’s <a href=\"http://www.halfsigma.com/2010/08/religion.html\">argument for superior atheist intelligence</a> is almost Hitchensian in its self-refuting quality.</p><p><i>I want to address the controversy of “atheism” vs. “agnosticism.” In the comment section, some people said that agnostics are smarter than atheists. I find this unlikely. Rather, smarter people are more adept at fitting in and avoiding controversy.</i></p><p>That’s what passes for his argument.  Note how this fits the classic pattern of atheist illogic, to say nothing of the bait-and-switch of turning to fundamentally philosophical arguments instead of making any use of the science upon which they claim to rely.  Half-Sigma happens to personally “find” it unlikely, (as opposed to “believing” it), ergo it must not be.  But who fits in better and avoids more controversy, agnostics or atheists?  Agnostics, quite clearly.  So, agnostics are smarter than atheists by Half-Sigma’s own metric, his real argument is that he doesn’t believe (find?) that they are <i>truly</i> agnostic, the Archbishop of Oxford’s statement that he himself is actually an agnostic who leans atheist, not a genuine strong atheist notwithstanding.</p><p>If I did not believe in the existence of God, I would be downright embarrassed to call myself an atheist these days.  I don’t know if it is because they are all studying butterfly collecting and evolution by something that is vaguely related to natural selection rather than history, philosophy, and literature, but they are simply incapable of presenting coherent arguments, let alone valid ones.</p><p>As for the myth of high atheist intelligence, that is one of several myths that are addressed in the <a href=\"http://www.voxday.net/mart/AgainstNewAtheism.ppt\">Against the New Atheism </a>slide show.  You don’t have to be of limited intelligence to be a militant atheist, but it most certainly helps.  The ironic thing is that like <a href=\"http://www.milobookclub.com/2010/07/15/more-atheist-ignorance/\">Ilya Somin of the Volokh Conspiracy</a>, Half-Sigma is neither as stupid nor as ignorant as his reflexive atheism makes him sound.  Consider, for example, <a href=\"http://isteve.blogspot.com/2010/08/jim-manzis-new-article.html\">Steve Sailer’s citation of his correct take</a> on the results of meritocratic testing: <i>“For example, a few years, Mayor Bloomberg and NYC schools supremo Joel Klein decided to fix the ramshackle admissions process to the gifted schools by imposing a standardized test on all applicants. Blogger Half Sigma immediately predicted that the percentage of Asians and whites admitted would rise at the expense of blacks and Hispanics, which would cause a sizable unexpected political problem for Bloomberg and Klein. All that has come to pass.”</i></p><p>It was obvious, perhaps, but sound reasoning even so.  The problem is that due to a combination of factors that tend to include familial relationships, social inadequacies, sexual obsessions, group dynamics, and intellectual pride, otherwise intelligent atheists insist on continuing to dumb themselves down by repeatedly staking out completely indefensible positions contra religion, especially Christianity.  I don’t mind that they do so, since it only makes it that much easier to shoot them down, but for the sake of intellectual exercise if nothing else we theists would be better served by a higher class of atheist apologists.</p></div>",
  "content_text": "Gary Gutting of Notre Dame\nupsets the league of the ignorant godless\n:\nIn these popular debates about God’s existence, the winners are neither theists nor atheists, but agnostics — the neglected step-children of religious controversy, who rightly point out that neither side in the debate has made its case.   This is the position supported by the consensus of expert philosophical opinion.  This conclusion should particularly discomfit popular proponents of atheism, such as Richard Dawkins, whose position is entirely based on demonstrably faulty arguments.\nA professional academic’s dismissal of Richard Dawkins hapless arguments?  Make that the league of the indignant and ignorant godless.  The comments are hilarious, as the immediate reaction from the usual sort of moderate-IQ atheist is demands for Gutting to “support” or “prove” his factual statement that Dawkins’s position is “entirely based on demonstrably faulty arguments”.  Of course, whenever someone does bother to demonstrate precisely how Dawkins’s arguments are factually and logically flawed, the reaction of most such atheists is to a) refuse to read it, b) lie about the substance and attack strawman substitutes, and c) fall into an abrupt silence and hope the criticism goes away on its own.\nOn a tangential note, Half-Sigma’s\nargument for superior atheist intelligence\nis almost Hitchensian in its self-refuting quality.\nI want to address the controversy of “atheism” vs. “agnosticism.” In the comment section, some people said that agnostics are smarter than atheists. I find this unlikely. Rather, smarter people are more adept at fitting in and avoiding controversy.\nThat’s what passes for his argument.  Note how this fits the classic pattern of atheist illogic, to say nothing of the bait-and-switch of turning to fundamentally philosophical arguments instead of making any use of the science upon which they claim to rely.  Half-Sigma happens to personally “find” it unlikely, (as opposed to “believing” it), ergo it must not be.  But who fits in better and avoids more controversy, agnostics or atheists?  Agnostics, quite clearly.  So, agnostics are smarter than atheists by Half-Sigma’s own metric, his real argument is that he doesn’t believe (find?) that they are\ntruly\nagnostic, the Archbishop of Oxford’s statement that he himself is actually an agnostic who leans atheist, not a genuine strong atheist notwithstanding.\nIf I did not believe in the existence of God, I would be downright embarrassed to call myself an atheist these days.  I don’t know if it is because they are all studying butterfly collecting and evolution by something that is vaguely related to natural selection rather than history, philosophy, and literature, but they are simply incapable of presenting coherent arguments, let alone valid ones.\nAs for the myth of high atheist intelligence, that is one of several myths that are addressed in the\nAgainst the New Atheism\nslide show.  You don’t have to be of limited intelligence to be a militant atheist, but it most certainly helps.  The ironic thing is that like\nIlya Somin of the Volokh Conspiracy\n, Half-Sigma is neither as stupid nor as ignorant as his reflexive atheism makes him sound.  Consider, for example,\nSteve Sailer’s citation of his correct take\non the results of meritocratic testing:\n“For example, a few years, Mayor Bloomberg and NYC schools supremo Joel Klein decided to fix the ramshackle admissions process to the gifted schools by imposing a standardized test on all applicants. Blogger Half Sigma immediately predicted that the percentage of Asians and whites admitted would rise at the expense of blacks and Hispanics, which would cause a sizable unexpected political problem for Bloomberg and Klein. All that has come to pass.”\nIt was obvious, perhaps, but sound reasoning even so.  The problem is that due to a combination of factors that tend to include familial relationships, social inadequacies, sexual obsessions, group dynamics, and intellectual pride, otherwise intelligent atheists insist on continuing to dumb themselves down by repeatedly staking out completely indefensible positions contra religion, especially Christianity.  I don’t mind that they do so, since it only makes it that much easier to shoot them down, but for the sake of intellectual exercise if nothing else we theists would be better served by a higher class of atheist apologists.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-03T07:24:00+00:00"
}