{
  "url": "https://voxday.net/2010/08/02/downward-spira/",
  "scraped_at": "2026-01-08T23:33:38.072284",
  "title": "The downward spiral",
  "date_display": "August 2, 2010",
  "date_iso": "2010-08-02T17:15:00+00:00",
  "date_from_url": "2010-08-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sasquatch writes: <i>I sincerely hope you can write a blog entry about this.  I can’t properly put into words how much rage I feel for those who’ve tried to destroy this man’s life. <a href=\"http://www.falselyaccuseddad.com/about/\">He was falsely accused of molesting a neighbor’s child</a> and he’s put together the entire journey in detailed fashion.  It touches on so many of the issues you write about – abuses of the Department of Social Services, misuse of police powers, herd mentality, churchianity, and the pressure on a traditional nuclear family.</i></p><blockquote><p>In November of 2006, I was accused by a family whom we considered our  friends, of inappropriately touching their 4 year old daughter during a  party out my home.  The accusation was ridiculous, as in our house at  the time were more than 15 adults.  Regardless, I was <a href=\"http://www.falselyaccuseddad.com/arrested/\">arrested</a>, placed in jail, released, lost my job, <a href=\"http://www.falselyaccuseddad.com/cps-at-the-front-door/\">removed from my home</a> for a year, lost all but our closest of friends, and shunned by our  neighbors.  For the first time in all of my years of living in the US, I  have a criminal record.  What makes all of this so shocking is I did  nothing.  There was no evidence beyond the word of a 4-year old girl.</p></blockquote><p>Follow the money and notice that the “victim’s” family actually made a couple of thousand dollars off the accusing process.  And note that it is ALWAYS a mistake to speak to the police in America without a lawyer present.  Be pleasant and be polite, but do not ever offer information or cooperate in any way, shape or form.  They will take even the smallest shred of barely relevant information and use it to spin a fictional narrative; their job is to find a perpetrator and feed him into the machine, not to divine the truth.  Unless you wish to become a part of that narrative, you must keep your mouth shut.  Furthermore, keep in mind that their assurances to you are worthless; courts have repeatedly confirmed that the police are permitted to lie to witnesses and suspected perpetrators alike.</p><p>Now, perhaps I’ve been living in Italy too long, but it seems to me that the man would likely have been better off spending the thirty thousand on MS-13 instead of lawyers and court fees if he wanted to get the charges dropped.  These miscarriages of justice are exactly why people have historically turned to godfathers and gangleaders instead of being willing to let the machinery of the system run its course.</p><p>Of course, the primary lesson is to absolutely refuse all physical contact with children who are not your own.  I’m not the touchy-feely type, so this is not at all a problem for me, but men of an avuncular inclination should take note.  If you never touch other children, much less permit them to sit on your lap, your denials of any potential false accusation will be all the more credible.</p></div>",
  "content_text": "Sasquatch writes:\nI sincerely hope you can write a blog entry about this.  I can’t properly put into words how much rage I feel for those who’ve tried to destroy this man’s life.\nHe was falsely accused of molesting a neighbor’s child\nand he’s put together the entire journey in detailed fashion.  It touches on so many of the issues you write about – abuses of the Department of Social Services, misuse of police powers, herd mentality, churchianity, and the pressure on a traditional nuclear family.\nIn November of 2006, I was accused by a family whom we considered our  friends, of inappropriately touching their 4 year old daughter during a  party out my home.  The accusation was ridiculous, as in our house at  the time were more than 15 adults.  Regardless, I was\narrested\n, placed in jail, released, lost my job,\nremoved from my home\nfor a year, lost all but our closest of friends, and shunned by our  neighbors.  For the first time in all of my years of living in the US, I  have a criminal record.  What makes all of this so shocking is I did  nothing.  There was no evidence beyond the word of a 4-year old girl.\nFollow the money and notice that the “victim’s” family actually made a couple of thousand dollars off the accusing process.  And note that it is ALWAYS a mistake to speak to the police in America without a lawyer present.  Be pleasant and be polite, but do not ever offer information or cooperate in any way, shape or form.  They will take even the smallest shred of barely relevant information and use it to spin a fictional narrative; their job is to find a perpetrator and feed him into the machine, not to divine the truth.  Unless you wish to become a part of that narrative, you must keep your mouth shut.  Furthermore, keep in mind that their assurances to you are worthless; courts have repeatedly confirmed that the police are permitted to lie to witnesses and suspected perpetrators alike.\nNow, perhaps I’ve been living in Italy too long, but it seems to me that the man would likely have been better off spending the thirty thousand on MS-13 instead of lawyers and court fees if he wanted to get the charges dropped.  These miscarriages of justice are exactly why people have historically turned to godfathers and gangleaders instead of being willing to let the machinery of the system run its course.\nOf course, the primary lesson is to absolutely refuse all physical contact with children who are not your own.  I’m not the touchy-feely type, so this is not at all a problem for me, but men of an avuncular inclination should take note.  If you never touch other children, much less permit them to sit on your lap, your denials of any potential false accusation will be all the more credible.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-02T16:15:00+00:00"
}