{
  "url": "https://voxday.net/2010/08/04/employing-imprisoned/",
  "scraped_at": "2026-01-08T23:33:49.439461",
  "title": "Employing the imprisoned",
  "date_display": "August 4, 2010",
  "date_iso": "2010-08-04T10:13:00+00:00",
  "date_from_url": "2010-08-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p><a href=\"http://www.angrybearblog.com/2010/08/one-in-31-adults.html?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+blogspot%2FHzoh+%28Angry+Bear%29\">One in 31 adults</a> are under the control of the correctional system (prison, parole, probation) according to a March 2009 Pew Center Report.  1 in every one hundred adults are imprisoned in jail, state prisons, or federal facilities. 25 years ago those under the control of the correctional system was one in 77 adults….  By historical standards the rate of imprisonment in the US is 350+ percent of what it was in 1980. Globally, the US is 3 times higher than the next in line for imprisonment, seven times higher than the median rate for an OCED country, and seventeen times higher than Iceland which has the lowest rate of incarceration.</p></blockquote><p>After reading this, I did a little research and learned that according to the National Institute of Corrections, the cost of imprisoning my father will be right around $500,000 if he serves most of the 15 years he was sentenced.  That is just over 40% of the amount he was convicted of not paying in taxes; if one takes into account the amount of taxes he actually did pay over the previous decade, the federal government can expect to be out around 13x more than they believe to have lost on his taxes alone.  And that doesn’t even begin to take into account all of the jobs that were lost and the opportunities that are presently being forgone as a result of locking up a proven entrepreneur.  I understand the logic of making an example, of course, but I tend to doubt even those who conceptually support the long-term imprisonment of “tax evaders” would conclude that spending <i>at least</i> $13 to chase $1 is an intelligent investment, especially not for a nation in which the debt per taxpayer is already $120,000.</p><p>Meanwhile, John Kerry, Tim Geithner and other “public servants” who have never contributed anything in the way of creating jobs or economic activity continue to go about their business of interfering with the economy unmolested.  Now, I’m not looking for any justice here nor am I ranting about the US tax or correctional systems; they are what they are and I’m not interested in their idiosyncracies.  I am merely observing that the statistics related to them are another obvious sign of the structural precariousness of the current economic system.</p><p>Rather than borrowing money to imprison people, wouldn’t it make more sense to hire out minimum-security prisoners on foreign contracts?  That’s not all that far off from how the English settled Australia, after all, and surely it would be to everyone’s benefit if the US had talented business executives, computer programmers, technical experts and even movie stars available for overseas hire.  Let them remain in exile for the duration of their sentence and have one-quarter of the revenue they generate go towards paying the costs of the correctional system.  Another quarter would go towards allowing them to pay off their fines before they are released from the system, and half would be their incentive to perform well.</p><p>This would also help mitigate an imminent problem.  With the increase in crime and decline in tax payments that have already been observed as a result of the economic contraction, it is very unlikely that the automatic reaction – to imprison all of the new offenders – is going to be an option given the way in which the overloaded correctional system is already helping drive states like California and Illinois into bankruptcy.  We know that 1 in 77 is sustainable.  But I don’t think either the economy or the nation can hope to survive a ratio of 1 in 25, which at this rate will be reached in early 2014.</p><p>Perhaps exile employment contracts sound too exotic and potentially enjoyable to serve as “corrections”.  But I don’t think too many people would sign up for running a technology company in Iraq, overseeing mining operations in Afghanistan, or starring in low-budget Venezuelan action-flicks of their own accord.  And as the projections indicate, the system is going to be forced to change very, very soon.</p></div>",
  "content_text": "One in 31 adults\nare under the control of the correctional system (prison, parole, probation) according to a March 2009 Pew Center Report.  1 in every one hundred adults are imprisoned in jail, state prisons, or federal facilities. 25 years ago those under the control of the correctional system was one in 77 adults….  By historical standards the rate of imprisonment in the US is 350+ percent of what it was in 1980. Globally, the US is 3 times higher than the next in line for imprisonment, seven times higher than the median rate for an OCED country, and seventeen times higher than Iceland which has the lowest rate of incarceration.\nAfter reading this, I did a little research and learned that according to the National Institute of Corrections, the cost of imprisoning my father will be right around $500,000 if he serves most of the 15 years he was sentenced.  That is just over 40% of the amount he was convicted of not paying in taxes; if one takes into account the amount of taxes he actually did pay over the previous decade, the federal government can expect to be out around 13x more than they believe to have lost on his taxes alone.  And that doesn’t even begin to take into account all of the jobs that were lost and the opportunities that are presently being forgone as a result of locking up a proven entrepreneur.  I understand the logic of making an example, of course, but I tend to doubt even those who conceptually support the long-term imprisonment of “tax evaders” would conclude that spending\nat least\n$13 to chase $1 is an intelligent investment, especially not for a nation in which the debt per taxpayer is already $120,000.\nMeanwhile, John Kerry, Tim Geithner and other “public servants” who have never contributed anything in the way of creating jobs or economic activity continue to go about their business of interfering with the economy unmolested.  Now, I’m not looking for any justice here nor am I ranting about the US tax or correctional systems; they are what they are and I’m not interested in their idiosyncracies.  I am merely observing that the statistics related to them are another obvious sign of the structural precariousness of the current economic system.\nRather than borrowing money to imprison people, wouldn’t it make more sense to hire out minimum-security prisoners on foreign contracts?  That’s not all that far off from how the English settled Australia, after all, and surely it would be to everyone’s benefit if the US had talented business executives, computer programmers, technical experts and even movie stars available for overseas hire.  Let them remain in exile for the duration of their sentence and have one-quarter of the revenue they generate go towards paying the costs of the correctional system.  Another quarter would go towards allowing them to pay off their fines before they are released from the system, and half would be their incentive to perform well.\nThis would also help mitigate an imminent problem.  With the increase in crime and decline in tax payments that have already been observed as a result of the economic contraction, it is very unlikely that the automatic reaction – to imprison all of the new offenders – is going to be an option given the way in which the overloaded correctional system is already helping drive states like California and Illinois into bankruptcy.  We know that 1 in 77 is sustainable.  But I don’t think either the economy or the nation can hope to survive a ratio of 1 in 25, which at this rate will be reached in early 2014.\nPerhaps exile employment contracts sound too exotic and potentially enjoyable to serve as “corrections”.  But I don’t think too many people would sign up for running a technology company in Iraq, overseeing mining operations in Afghanistan, or starring in low-budget Venezuelan action-flicks of their own accord.  And as the projections indicate, the system is going to be forced to change very, very soon.",
  "tags": [
    "economics",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-04T09:13:00+00:00"
}