{
  "url": "https://voxday.net/2010/08/28/game-and-two-ahd-half-men/",
  "scraped_at": "2026-01-08T23:35:54.135791",
  "title": "Game and Two-ahd-a-Half-Men",
  "date_display": "August 28, 2010",
  "date_iso": "2010-08-28T10:09:00+00:00",
  "date_from_url": "2010-08-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Derbyshire explains why it is a<a href=\"http://www.johnderbyshire.com/Reviews/Miscellaneous/twoandahalfmen.html\">n effective and PC-subversive television show</a>:</p><blockquote><p>For a strictly limited time period, we’re permitted take a break from official reality to ponder unpalatable truths.</p><p>In a post-Malthusian society that has shed most customary constraints on mating (class/race/religious endogamy, arranged marriage, doweries, etc.) and un-hitched sex from procreation, mating is an open Darwinian struggle. Beautiful young women and men gifted with the seductive arts (“game”) mate a lot; plain women and gauche men are left in the dust.</p><p>Inside a pretty woman there is often a slut, who can be awakened by a man with good “game.” But …</p><p>… ceteris paribus, a woman’s desire for long-term commitment is greater than a man’s.</p><p>Meek provider-type males with no “game” rather frequently end up having their life blood, and bank balance, drained away by whiny self-centered ex-wives.</p><p>Ambitious, worldly parents are resented by their offspring, and …</p><p>…  such parents in turn regard the less successful of those offspring with mild contempt.</p><p>Kids, even intelligent kids, often dislike school. Boys particularly dislike the feminized PC pablum that forms the curriculum of the average American public school today. They would sit all day eating junk food, watching TV cop shows, and playing Call of Duty on a GameBoy if they could.</p><p>Low-class white women are often obese and coarse.</p></blockquote><p>It is also interesting to watch how being engaged to Chelsea is rapidly turning Charlie into a gamma as he fails test after test with her.  The minute she turns a stern look on him and says his name in a deep voice, he caves.  I don’t know if this is the result of new writers attempting to “tame” him and thereby ruin the show or if they are setting the stage for Charlie to stand his ground as a man and declare <i>non servium</i> while bringing the show to a close in a glorious blaze of alcohol and escorts as Alan marries the annoying woman instead.</p><p>I assume the former, however, since Chelsea didn’t seem the sort who would hold any significant appeal for Charlie from the beginning.  But then, I tend to catch the show sporadically and out of order, so I could easily be missing something.  In any event, it would appear Charlie Sheen may be the last American hero to be permitted to the masses on television.</p></div>",
  "content_text": "Derbyshire explains why it is a\nn effective and PC-subversive television show\n:\nFor a strictly limited time period, we’re permitted take a break from official reality to ponder unpalatable truths.\nIn a post-Malthusian society that has shed most customary constraints on mating (class/race/religious endogamy, arranged marriage, doweries, etc.) and un-hitched sex from procreation, mating is an open Darwinian struggle. Beautiful young women and men gifted with the seductive arts (“game”) mate a lot; plain women and gauche men are left in the dust.\nInside a pretty woman there is often a slut, who can be awakened by a man with good “game.” But …\n… ceteris paribus, a woman’s desire for long-term commitment is greater than a man’s.\nMeek provider-type males with no “game” rather frequently end up having their life blood, and bank balance, drained away by whiny self-centered ex-wives.\nAmbitious, worldly parents are resented by their offspring, and …\n…  such parents in turn regard the less successful of those offspring with mild contempt.\nKids, even intelligent kids, often dislike school. Boys particularly dislike the feminized PC pablum that forms the curriculum of the average American public school today. They would sit all day eating junk food, watching TV cop shows, and playing Call of Duty on a GameBoy if they could.\nLow-class white women are often obese and coarse.\nIt is also interesting to watch how being engaged to Chelsea is rapidly turning Charlie into a gamma as he fails test after test with her.  The minute she turns a stern look on him and says his name in a deep voice, he caves.  I don’t know if this is the result of new writers attempting to “tame” him and thereby ruin the show or if they are setting the stage for Charlie to stand his ground as a man and declare\nnon servium\nwhile bringing the show to a close in a glorious blaze of alcohol and escorts as Alan marries the annoying woman instead.\nI assume the former, however, since Chelsea didn’t seem the sort who would hold any significant appeal for Charlie from the beginning.  But then, I tend to catch the show sporadically and out of order, so I could easily be missing something.  In any event, it would appear Charlie Sheen may be the last American hero to be permitted to the masses on television.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-28T09:09:00+00:00"
}