{
  "url": "https://voxday.net/2010/08/08/get-over-yourself-already/",
  "scraped_at": "2026-01-08T23:34:09.170968",
  "title": "Get over yourself already",
  "date_display": "August 8, 2010",
  "date_iso": "2010-08-08T08:43:00+00:00",
  "date_from_url": "2010-08-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First, “psychiatric therapy” is complete, utter, and total BS.  It’s not therapy of any kind, it’s nothing more than paying someone to listen to you talk about your favorite subject under the guise of a pseudo-scientific veneer.  A pastor (religion) or a pill (science) would do anyone more good.   Some of us see this right away, it takes others <a href=\"http://www.nytimes.com/2010/08/08/magazine/08Psychoanalysis-t.html?pagewanted=1&amp;hpw\">40 years of incessant “therapy” from a multitude of “therapists”</a> to realize it.  Second, it’s obvious that what is wrong with the author is nothing more than an extreme case of conventional female narcissism.  That being said, reading this endless solipsism of the self-centered mind does nicely illustrate how a focus on yourself is ultimately crippling and provides women with a warning of the peril presented by constant snowflaking.</p><blockquote><p>The truth of the matter was that in more than 40 years of therapy (the only person I knew who may have been at it longer than me was Woody Allen, who once offered me his own analyst), I never developed a set of criteria by which to assess the skill of a given therapist, the way you would assess a dentist or a plumber. Other than a presentable degree of intelligence and an office that didn’t set off aesthetic alarms — I tended to prefer genteelly shabby interiors to overly well-appointed ones, although I was wary of therapists who exhibited a Collyer Brothers-like inability to throw anything away — I wasn’t sure what made for a good one. I never felt entitled to look at them as members of a service profession, which is what, underneath all the crisscrossing of need and wishfulness, they essentially were….  Just as some people believe in the idea of soul mates, I held fast to the conviction that my perfect therapeutic match was out there. If only I looked hard enough I would find this person, and then the demons that haunted me — my love/hate relationship with my difficult mother (who has been dead now for four years), my self-torturing and intransigently avoidant attitude toward my work, my abiding sense of aloneness and seeming inability to sustain a romantic relationship and, above all, my lapses into severe depression — would become, with my therapist’s help, easier to manage.</p></blockquote><p>The byline says: “Daphne Merkin is a contributing writer. She is working on a book based on an article she wrote for the magazine about her struggle with chronic depression.”  Of course she is.  It’s eminently clear that she couldn’t possibly write about anything other than her own precious little snowflake self.</p><p>Quote of the Day: “Neurotics are a rabble, good only to support us financially and to allow us to learn from their cases: psychoanalysis as a therapy may be worthless.”<br> – <s>Sandor Ferenczi, President of the International Psychoanalytical Association</s>Sigmund Freud</br></p><p>However, I’m not saying that all therapists are con artists.  The ones who actually help people are those who provide a service politely telling people to stop acting like self-destructive morons.  But that’s not “therapy”, that’s just being paid to cushion the obvious blow.</p></div>",
  "content_text": "First, “psychiatric therapy” is complete, utter, and total BS.  It’s not therapy of any kind, it’s nothing more than paying someone to listen to you talk about your favorite subject under the guise of a pseudo-scientific veneer.  A pastor (religion) or a pill (science) would do anyone more good.   Some of us see this right away, it takes others\n40 years of incessant “therapy” from a multitude of “therapists”\nto realize it.  Second, it’s obvious that what is wrong with the author is nothing more than an extreme case of conventional female narcissism.  That being said, reading this endless solipsism of the self-centered mind does nicely illustrate how a focus on yourself is ultimately crippling and provides women with a warning of the peril presented by constant snowflaking.\nThe truth of the matter was that in more than 40 years of therapy (the only person I knew who may have been at it longer than me was Woody Allen, who once offered me his own analyst), I never developed a set of criteria by which to assess the skill of a given therapist, the way you would assess a dentist or a plumber. Other than a presentable degree of intelligence and an office that didn’t set off aesthetic alarms — I tended to prefer genteelly shabby interiors to overly well-appointed ones, although I was wary of therapists who exhibited a Collyer Brothers-like inability to throw anything away — I wasn’t sure what made for a good one. I never felt entitled to look at them as members of a service profession, which is what, underneath all the crisscrossing of need and wishfulness, they essentially were….  Just as some people believe in the idea of soul mates, I held fast to the conviction that my perfect therapeutic match was out there. If only I looked hard enough I would find this person, and then the demons that haunted me — my love/hate relationship with my difficult mother (who has been dead now for four years), my self-torturing and intransigently avoidant attitude toward my work, my abiding sense of aloneness and seeming inability to sustain a romantic relationship and, above all, my lapses into severe depression — would become, with my therapist’s help, easier to manage.\nThe byline says: “Daphne Merkin is a contributing writer. She is working on a book based on an article she wrote for the magazine about her struggle with chronic depression.”  Of course she is.  It’s eminently clear that she couldn’t possibly write about anything other than her own precious little snowflake self.\nQuote of the Day: “Neurotics are a rabble, good only to support us financially and to allow us to learn from their cases: psychoanalysis as a therapy may be worthless.”\n–\nSandor Ferenczi, President of the International Psychoanalytical Association\nSigmund Freud\nHowever, I’m not saying that all therapists are con artists.  The ones who actually help people are those who provide a service politely telling people to stop acting like self-destructive morons.  But that’s not “therapy”, that’s just being paid to cushion the obvious blow.",
  "tags": [
    "freakshow"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-08T07:43:00+00:00"
}