{
  "url": "https://voxday.net/2010/08/03/good-luck-ladies/",
  "scraped_at": "2026-01-08T23:33:45.482603",
  "title": "Good luck, ladies",
  "date_display": "August 3, 2010",
  "date_iso": "2010-08-03T17:15:00+00:00",
  "date_from_url": "2010-08-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you happen to be a woman who genuinely thinks life as a middle-aged divorcee with kids is a worthwhile trade <a href=\"http://www.momlogic.com/2010/05/update_31427_women_signed_up_for_ashley_madison_the_day_after_mothers_day.php\">for not getting flowers and a card on a Hallmark holiday</a>, I’d say your ex-husband-to-be is getting an even better deal:</p><blockquote><p>Momlogic has exclusively learned that 31,427 women signed up for AshleyMadison.com yesterday — which is over ten times the average number of women who typically sign up on any given Monday.  Ashley Madison took a sample survey of the women who signed up yesterday, and found that:</p><p>* 67 percent identified themselves as stay-at-home moms.<br> * The average age was 36.<br> * Over two-thirds had been considering an affair before Mother’s Day.</br></br></p></blockquote><p>Roissy, meanwhile, <a href=\"http://roissy.wordpress.com/2010/08/03/the-depedestalization-shall-continue-until-morale-improves/\">correctly ascertains</a> what are the first and third biggest signup days for Cheater Central.  The days after Valentine’s Day and New Year’s Day.  I wouldn’t put too much significance on the high percentage of stay-at-home moms, though.  Women who work at an office don’t need the help of a web site if they are inclined to seek a surreptitious ride or two on the carousel.</p><p>All that being said, let me note that this all sounds rather like a calculated PR stunt to me.</p></div>",
  "content_text": "If you happen to be a woman who genuinely thinks life as a middle-aged divorcee with kids is a worthwhile trade\nfor not getting flowers and a card on a Hallmark holiday\n, I’d say your ex-husband-to-be is getting an even better deal:\nMomlogic has exclusively learned that 31,427 women signed up for AshleyMadison.com yesterday — which is over ten times the average number of women who typically sign up on any given Monday.  Ashley Madison took a sample survey of the women who signed up yesterday, and found that:\n* 67 percent identified themselves as stay-at-home moms.\n* The average age was 36.\n* Over two-thirds had been considering an affair before Mother’s Day.\nRoissy, meanwhile,\ncorrectly ascertains\nwhat are the first and third biggest signup days for Cheater Central.  The days after Valentine’s Day and New Year’s Day.  I wouldn’t put too much significance on the high percentage of stay-at-home moms, though.  Women who work at an office don’t need the help of a web site if they are inclined to seek a surreptitious ride or two on the carousel.\nAll that being said, let me note that this all sounds rather like a calculated PR stunt to me.",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-03T16:15:00+00:00"
}