{
  "url": "https://voxday.net/2010/08/26/happy-unicorn-day/",
  "scraped_at": "2026-01-08T23:35:46.718117",
  "title": "Happy Unicorn Day!",
  "date_display": "August 26, 2010",
  "date_iso": "2010-08-26T20:39:00+00:00",
  "date_from_url": "2010-08-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Carrie Lukas <a href=\"http://www.nationalreview.com/corner/244879/celebrating-women-s-equality-day-carrie-lukas\">illustrates</a> why conservatives should be slow to embrace the leadership of women who call themselves conservatives:</p><blockquote><p>August 26 has been dubbed “Women’s Equality Day,” in celebration of the anniversary of the 19th Amendment. Passage of that amendment was the culmination of years of hard work and dedication on the part of America’s noble suffragettes, and it is indeed amazing to think of all of the progress women have made in our society in the ninety years following that breakthrough.</p></blockquote><p>It is amazing… amazingly horrific.  Let’s contemplate exactly what that progress has meant in material terms:</p><p>1.  Millions of murdered babies, disproportionately female.<br> 2.  A significant reduction in marriage rates and a large increase in divorce rates thanks to pro-female divorce laws and the heavily female-biased family court system.<br> 3.  The doubling of the female work force suppressing wages and creating a vicious cycle where married women who don’t want to work are forced to do so because their husband’s real wages are lower than in 1973.  To forestall the expected ignorance-based protests, I invite you to first consider what happens to the price of a commodity when the supply increases faster than the demand.<br> 4.  National insolvency.<br> 5.  A massive increase in sexually-transmitted disease.<br> 6.  A significant reduction of personal freedom for men and women alike.</br></br></br></br></br></p><p>It will be interesting to see if a nation that institutes female suffrage can remain sovereign and at least nominally free for even 100 years.  The UK gave up its national sovereignty to the EU only 81 years after it instituted women’s suffrage.  The US might make it, but it’s by no means a sure thing.</p><p>It’s important to remember that because the vast majority of the women identify themselves by the herd and by sex rather than as individuals, they will usually see themselves as women first and [fill in the ideological identification] second.  Thus we have the absurdity of a self-styled “conservative” woman celebrating profoundly anti-conservative and avowedly progressive progress.</p><p>As I have stated several times before, <i>there is no such thing as equality!</i> It does not exist in material terms, legal terms, moral terms, scientific terms, or spiritual terms.  There is no evidence for it because it simply does not exist.  Women who traded societal wealth and material freedom for nonexistent “equality” have made a terrible bargain since they literally traded something for nothing.  The foundation of the suffrage argument is the false assertion that voting is freedom.  My counterargument rests on the verifiable assertion that voting does not equal freedom.  That is the crux of the matter.</p></div>",
  "content_text": "Carrie Lukas\nillustrates\nwhy conservatives should be slow to embrace the leadership of women who call themselves conservatives:\nAugust 26 has been dubbed “Women’s Equality Day,” in celebration of the anniversary of the 19th Amendment. Passage of that amendment was the culmination of years of hard work and dedication on the part of America’s noble suffragettes, and it is indeed amazing to think of all of the progress women have made in our society in the ninety years following that breakthrough.\nIt is amazing… amazingly horrific.  Let’s contemplate exactly what that progress has meant in material terms:\n1.  Millions of murdered babies, disproportionately female.\n2.  A significant reduction in marriage rates and a large increase in divorce rates thanks to pro-female divorce laws and the heavily female-biased family court system.\n3.  The doubling of the female work force suppressing wages and creating a vicious cycle where married women who don’t want to work are forced to do so because their husband’s real wages are lower than in 1973.  To forestall the expected ignorance-based protests, I invite you to first consider what happens to the price of a commodity when the supply increases faster than the demand.\n4.  National insolvency.\n5.  A massive increase in sexually-transmitted disease.\n6.  A significant reduction of personal freedom for men and women alike.\nIt will be interesting to see if a nation that institutes female suffrage can remain sovereign and at least nominally free for even 100 years.  The UK gave up its national sovereignty to the EU only 81 years after it instituted women’s suffrage.  The US might make it, but it’s by no means a sure thing.\nIt’s important to remember that because the vast majority of the women identify themselves by the herd and by sex rather than as individuals, they will usually see themselves as women first and [fill in the ideological identification] second.  Thus we have the absurdity of a self-styled “conservative” woman celebrating profoundly anti-conservative and avowedly progressive progress.\nAs I have stated several times before,\nthere is no such thing as equality!\nIt does not exist in material terms, legal terms, moral terms, scientific terms, or spiritual terms.  There is no evidence for it because it simply does not exist.  Women who traded societal wealth and material freedom for nonexistent “equality” have made a terrible bargain since they literally traded something for nothing.  The foundation of the suffrage argument is the false assertion that voting is freedom.  My counterargument rests on the verifiable assertion that voting does not equal freedom.  That is the crux of the matter.",
  "tags": [
    "society",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-26T19:39:00+00:00"
}