{
  "url": "https://voxday.net/2010/08/12/home-of-bankrup/",
  "scraped_at": "2026-01-08T23:34:35.062084",
  "title": "The Home of the Bankrupt",
  "date_display": "August 12, 2010",
  "date_iso": "2010-08-12T19:04:00+00:00",
  "date_from_url": "2010-08-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The bankrupt banks are pretending to be solvent.  So, it should come as no surprise that the Federal government has been <a href=\"http://www.bloomberg.com/news/2010-08-11/u-s-is-bankrupt-and-we-don-t-even-know-commentary-by-laurence-kotlikoff.html\">following their lead</a>.</p><blockquote><p>[T]he IMF has effectively pronounced the U.S. bankrupt. Section 6 of the July 2010 Selected Issues Paper says: “The U.S. fiscal gap associated with today’s federal fiscal policy is huge for plausible discount rates.” It adds that “closing the fiscal gap requires a permanent annual fiscal adjustment equal to about 14 percent of U.S. GDP.”</p><p>The fiscal gap is the value today (the present value) of the difference between projected spending (including servicing official debt) and projected revenue in all future years.</p><p>To put 14 percent of gross domestic product in perspective, current federal revenue totals 14.9 percent of GDP. So the IMF is saying that closing the U.S. fiscal gap, from the revenue side, requires, roughly speaking, an immediate and permanent doubling of our personal-income, corporate and federal taxes as well as the payroll levy set down in the Federal Insurance Contribution Act.</p><p>Such a tax hike would leave the U.S. running a surplus equal to 5 percent of GDP this year, rather than a 9 percent deficit. So the IMF is really saying the U.S. needs to run a huge surplus now and for many years to come to pay for the spending that is scheduled.</p></blockquote><p>The scary thing is that these calculations indicating national insolvency are based on numbers that are ludicrously <i>optimistic</i>.  As I have been saying for more than two years now, it’s not a question of if the system collapses, it’s only a question of when.</p></div>",
  "content_text": "The bankrupt banks are pretending to be solvent.  So, it should come as no surprise that the Federal government has been\nfollowing their lead\n.\n[T]he IMF has effectively pronounced the U.S. bankrupt. Section 6 of the July 2010 Selected Issues Paper says: “The U.S. fiscal gap associated with today’s federal fiscal policy is huge for plausible discount rates.” It adds that “closing the fiscal gap requires a permanent annual fiscal adjustment equal to about 14 percent of U.S. GDP.”\nThe fiscal gap is the value today (the present value) of the difference between projected spending (including servicing official debt) and projected revenue in all future years.\nTo put 14 percent of gross domestic product in perspective, current federal revenue totals 14.9 percent of GDP. So the IMF is saying that closing the U.S. fiscal gap, from the revenue side, requires, roughly speaking, an immediate and permanent doubling of our personal-income, corporate and federal taxes as well as the payroll levy set down in the Federal Insurance Contribution Act.\nSuch a tax hike would leave the U.S. running a surplus equal to 5 percent of GDP this year, rather than a 9 percent deficit. So the IMF is really saying the U.S. needs to run a huge surplus now and for many years to come to pay for the spending that is scheduled.\nThe scary thing is that these calculations indicating national insolvency are based on numbers that are ludicrously\noptimistic\n.  As I have been saying for more than two years now, it’s not a question of if the system collapses, it’s only a question of when.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-12T18:04:00+00:00"
}