{
  "url": "https://voxday.net/2010/08/10/homogamy-and-civilizational-decline/",
  "scraped_at": "2026-01-08T23:34:20.480213",
  "title": "Homogamy and civilizational decline",
  "date_display": "August 10, 2010",
  "date_iso": "2010-08-10T09:08:00+00:00",
  "date_from_url": "2010-08-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ross Douthat writes <a href=\"http://www.nytimes.com/2010/08/09/opinion/09douthat.html?_r=1&amp;ref=opinion\">a pretty good column in the New York Times</a> explaining how the anti-homogamy side has made a mistake relying upon irrelevant arguments.  He also reiterates the one they should have been making from the start:</p><blockquote><p>The point of this ideal is not that other relationships have no value, or that only nuclear families can rear children successfully. Rather, it’s that lifelong heterosexual monogamy at its best can offer something distinctive and remarkable — a microcosm of civilization, and an organic connection between human generations — that makes it worthy of distinctive recognition and support.</p><p>Again, this is not how many cultures approach marriage. It’s a particularly Western understanding, derived from Jewish and Christian beliefs about the order of creation, and supplemented by later ideas about romantic love, the rights of children, and the equality of the sexes.  Or at least, it was the Western understanding. Lately, it has come to co-exist with a less idealistic, more accommodating approach, defined by no-fault divorce, frequent out-of-wedlock births, and serial monogamy.</p></blockquote><p>Douthat also inadvertantly mentions the source of the problem, as the supplementation of those later ideas, especially the fictional “equality” of the sexes has been far more destructive to Western civilization than homogamy will if the judicial activists are successful in imposing their antidemocratic will upon the people.  In fact, I tend to see homogamy and its assorted ills as being much more a late-stage symptom than a causal factor when it comes to societal collapse.</p><p>But that doesn’t change the easily observable fact that the forces pushing homogamy and open homosexuality are actively engaged in attempting to destroy one of the more successful civilizations in human history.  As I showed in <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=189197\">yesterday’s WND column</a>, there is no genuine “progress” being made here, social or moral, this is simply a return to the pagan decadence of a society that was in decline 18 centuries ago.  The observations of one of the first historians of women, Alfred Brittain, made at the turn of the 20th century about Roman women, was an insightful harbinger of the subsequent success of the suffrage movement.</p><p>“<i>Julia represented the prevalent social conditions of her time. Licentiousness, like a cancer, was eating into the heart of Roman society; and this was to grow still worse. It must be admitted also that female degeneracy kept pace with the increase of woman’s influence in the political world. Livia and Agrippina the Elder were exceptions; but the rule was, and has been in all history, that the activity of women in State affairs was accompanied by an abundance of meretricious amatory intrigues. It is a remarkable fact that in the history of the Roman woman–and possibly this statement might be given a much wider application–there is no instance where any individual woman designedly helped to bring about the enactment of a law for the public weal. Female politics always had for their object the advancement of the female politician’s own personal interests or those of some male favorite.”</i></p><p>To be fair, there have been the occasional exceptions over the last 100 years, such as Margaret Thatcher, but then of course she was declared to be “not of the gender woman” by fellow members of her sex for her sin of deviating from the female political pattern.*  What is ironic is that so many individuals who greatly cherish certain fruits of Western civilization, such as the science fetishists to give one example, completely fail to recognize that the societal decline they are lauding as “social progress” is much more likely to destroy the aspects of Western civilization that they enjoy, such as wealth, technology, science, free speech and relative political freedom, than it is to eliminate the moral and cultural aspects that they despise.  To repeat my comment from yesterday, ignorant pagans rutting in filth and poverty are not capable of funding either the development of new technologies or the expansion of the scientific knowledge base.  There are no science labs in grass huts.</p><p> *<i>This was a direct quote from a female professor at my university.</i></p></div>",
  "content_text": "Ross Douthat writes\na pretty good column in the New York Times\nexplaining how the anti-homogamy side has made a mistake relying upon irrelevant arguments.  He also reiterates the one they should have been making from the start:\nThe point of this ideal is not that other relationships have no value, or that only nuclear families can rear children successfully. Rather, it’s that lifelong heterosexual monogamy at its best can offer something distinctive and remarkable — a microcosm of civilization, and an organic connection between human generations — that makes it worthy of distinctive recognition and support.\nAgain, this is not how many cultures approach marriage. It’s a particularly Western understanding, derived from Jewish and Christian beliefs about the order of creation, and supplemented by later ideas about romantic love, the rights of children, and the equality of the sexes.  Or at least, it was the Western understanding. Lately, it has come to co-exist with a less idealistic, more accommodating approach, defined by no-fault divorce, frequent out-of-wedlock births, and serial monogamy.\nDouthat also inadvertantly mentions the source of the problem, as the supplementation of those later ideas, especially the fictional “equality” of the sexes has been far more destructive to Western civilization than homogamy will if the judicial activists are successful in imposing their antidemocratic will upon the people.  In fact, I tend to see homogamy and its assorted ills as being much more a late-stage symptom than a causal factor when it comes to societal collapse.\nBut that doesn’t change the easily observable fact that the forces pushing homogamy and open homosexuality are actively engaged in attempting to destroy one of the more successful civilizations in human history.  As I showed in\nyesterday’s WND column\n, there is no genuine “progress” being made here, social or moral, this is simply a return to the pagan decadence of a society that was in decline 18 centuries ago.  The observations of one of the first historians of women, Alfred Brittain, made at the turn of the 20th century about Roman women, was an insightful harbinger of the subsequent success of the suffrage movement.\n“\nJulia represented the prevalent social conditions of her time. Licentiousness, like a cancer, was eating into the heart of Roman society; and this was to grow still worse. It must be admitted also that female degeneracy kept pace with the increase of woman’s influence in the political world. Livia and Agrippina the Elder were exceptions; but the rule was, and has been in all history, that the activity of women in State affairs was accompanied by an abundance of meretricious amatory intrigues. It is a remarkable fact that in the history of the Roman woman–and possibly this statement might be given a much wider application–there is no instance where any individual woman designedly helped to bring about the enactment of a law for the public weal. Female politics always had for their object the advancement of the female politician’s own personal interests or those of some male favorite.”\nTo be fair, there have been the occasional exceptions over the last 100 years, such as Margaret Thatcher, but then of course she was declared to be “not of the gender woman” by fellow members of her sex for her sin of deviating from the female political pattern.*  What is ironic is that so many individuals who greatly cherish certain fruits of Western civilization, such as the science fetishists to give one example, completely fail to recognize that the societal decline they are lauding as “social progress” is much more likely to destroy the aspects of Western civilization that they enjoy, such as wealth, technology, science, free speech and relative political freedom, than it is to eliminate the moral and cultural aspects that they despise.  To repeat my comment from yesterday, ignorant pagans rutting in filth and poverty are not capable of funding either the development of new technologies or the expansion of the scientific knowledge base.  There are no science labs in grass huts.\n*\nThis was a direct quote from a female professor at my university.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-10T08:08:00+00:00"
}