{
  "url": "https://voxday.net/2010/08/01/mailvox-interpretive-fails/",
  "scraped_at": "2026-01-08T23:33:32.580182",
  "title": "Mailvox: interpretive fails",
  "date_display": "August 1, 2010",
  "date_iso": "2010-08-01T16:40:00+00:00",
  "date_from_url": "2010-08-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dawo appears to have a wildly inaccurate understanding of how the literary world works:</p><blockquote><p>I think the present blog is not designed to encourage actual debate, and it is likewise not designed to encourage echo-chamber-style mutual affirmation.  If I had to guess, I would guess that this blog is designed to maximize the writing career of the writer who blogs here.</p></blockquote><p>He’s correct in that the comments are just there to let people comment if they wish; I added them in response to numerous requests.  But I don’t think alienating pretty much every editor in both the SF/F and CBA publishing worlds with one’s exotic socio-political views is generally considered to be the optimal way to maximize one’s writing career.  I have had no less than three negotiated book contracts canceled simply because a female member of the pub board took offense to something I wrote in a column or on this blog.  One of them was even signed, so I ended up getting paid to NOT write the books.  This is why <i>Media Whores</i> and the UK translation of <i>The Irrational Atheist</i> do not exist.  Needless to say, this experience has completely caused me to rethink my position on female fascism and women’s tolerance for opinions that diverge from their own.</p><p>In short, I don’t give a damn about my writing career.  In fact, I seem to recall posting about how the very concept of the professional writing career is dying out not all that long ago.  By which I mean <i>scroll down one post!</i></p><p>Meanwhile, Joe theorizes about my interest in Game:</p><blockquote><p>Why women overrate themselves … or why Vox sublimates himself.  Man Vox, dont you have better things to think about? Your titular observations may be interesting to the ilk but boy, you likewise lower your value in your vocational pursuit for no apparent reason except for your amusing titalation of the ilk. I surmize you have unsettled issues with some so-so looker that beat you in arm wrestling one night on the bowery, correct?</p></blockquote><p>Well, I’m not terribly concerned about DLV’ing.  A picture being worth a thousand words and all, the following one may at least partially explain why I do not, in fact, have any unsettled issues with anyone, so-so looks or otherwise.  It’s not that there’s anything wrong with so-so looks, it’s just that they may as well be invisible to me.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://2.bp.blogspot.com/_3UXl0oMYPLs/TFWlLWthrjI/AAAAAAAAAMw/0oxNuEKMlu4/s1600/SB320.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2010/08/SB320.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2010/08/SB320.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div></div>",
  "content_text": "Dawo appears to have a wildly inaccurate understanding of how the literary world works:\nI think the present blog is not designed to encourage actual debate, and it is likewise not designed to encourage echo-chamber-style mutual affirmation.  If I had to guess, I would guess that this blog is designed to maximize the writing career of the writer who blogs here.\nHe’s correct in that the comments are just there to let people comment if they wish; I added them in response to numerous requests.  But I don’t think alienating pretty much every editor in both the SF/F and CBA publishing worlds with one’s exotic socio-political views is generally considered to be the optimal way to maximize one’s writing career.  I have had no less than three negotiated book contracts canceled simply because a female member of the pub board took offense to something I wrote in a column or on this blog.  One of them was even signed, so I ended up getting paid to NOT write the books.  This is why\nMedia Whores\nand the UK translation of\nThe Irrational Atheist\ndo not exist.  Needless to say, this experience has completely caused me to rethink my position on female fascism and women’s tolerance for opinions that diverge from their own.\nIn short, I don’t give a damn about my writing career.  In fact, I seem to recall posting about how the very concept of the professional writing career is dying out not all that long ago.  By which I mean\nscroll down one post!\nMeanwhile, Joe theorizes about my interest in Game:\nWhy women overrate themselves … or why Vox sublimates himself.  Man Vox, dont you have better things to think about? Your titular observations may be interesting to the ilk but boy, you likewise lower your value in your vocational pursuit for no apparent reason except for your amusing titalation of the ilk. I surmize you have unsettled issues with some so-so looker that beat you in arm wrestling one night on the bowery, correct?\nWell, I’m not terribly concerned about DLV’ing.  A picture being worth a thousand words and all, the following one may at least partially explain why I do not, in fact, have any unsettled issues with anyone, so-so looks or otherwise.  It’s not that there’s anything wrong with so-so looks, it’s just that they may as well be invisible to me.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-01T15:40:00+00:00"
}