{
  "url": "https://voxday.net/2010/08/06/men-work-more/",
  "scraped_at": "2026-01-08T23:34:03.717755",
  "title": "Men work more",
  "date_display": "August 6, 2010",
  "date_iso": "2010-08-06T15:33:00+00:00",
  "date_from_url": "2010-08-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Although I very much doubt <a href=\"http://www.telegraph.co.uk/relationships/7929014/Feminism-Forget-it-sisters.html\">this “news”</a> is going to suddenly bring about an end to feminist whining, much less feminism itself:</p><blockquote><p>The long night of modern feminism might be about to end. A glimmer of light is flickering in the encircling gloom.  A study published this week by Dr Catherine Hakim of the London School of Economics has found that men do slightly more work than the women they live with when employment and domestic work are measured together.</p><p>This is the first time I can remember in 40 years that an authoritative study on a key issue of so-called gender politics has come out with a self-evident truth that runs directly contrary to orthodox feminist ideology. The fact that it has been written and published by a woman makes it even more delightful.</p></blockquote><p>Clearly Dr. Hakim doesn’t understand how social studies involving gender work.  If the data shows that men work more in total, then quite clearly paid work outside the home shouldn’t count.  The rule is always that whatever permits women to pose as the victims of patriarchal male oppression must be the relevant metric.  If a man travels via ox-drawn cart on a business trip to train coal miners in Minsk the proper way to break rocks with a pick while the woman stays home watching their 23 year-old daughter, the correct interpretation is that he has enjoyed a paid European vacation while she has slaved away caring for the children at home.</p><p>If, on the other hand, a woman flies to Miami to lie on a beach with her old friends from college while the man stays home to care for their five children under the age of two, the correct interpretation is that he’s been having a grand old time sitting at home drinking beer and watching television while the poor woman is <i>absolutely worn out</i> from an <i>exhausting</i> week of being <i>dragged</i> to all sorts of social activities in which she most certainly did <i>not</i> want to participate.  (Roissy, of course, would put a different spin on why she’s so worn out, but that’s beside the point here.)</p><p>The lesson is this: solipsism is best avoided, because it makes you look insanely stupid to anyone who isn’t equally solipsistic.  But that somehow never stops the feminists.</p></div>",
  "content_text": "Although I very much doubt\nthis “news”\nis going to suddenly bring about an end to feminist whining, much less feminism itself:\nThe long night of modern feminism might be about to end. A glimmer of light is flickering in the encircling gloom.  A study published this week by Dr Catherine Hakim of the London School of Economics has found that men do slightly more work than the women they live with when employment and domestic work are measured together.\nThis is the first time I can remember in 40 years that an authoritative study on a key issue of so-called gender politics has come out with a self-evident truth that runs directly contrary to orthodox feminist ideology. The fact that it has been written and published by a woman makes it even more delightful.\nClearly Dr. Hakim doesn’t understand how social studies involving gender work.  If the data shows that men work more in total, then quite clearly paid work outside the home shouldn’t count.  The rule is always that whatever permits women to pose as the victims of patriarchal male oppression must be the relevant metric.  If a man travels via ox-drawn cart on a business trip to train coal miners in Minsk the proper way to break rocks with a pick while the woman stays home watching their 23 year-old daughter, the correct interpretation is that he has enjoyed a paid European vacation while she has slaved away caring for the children at home.\nIf, on the other hand, a woman flies to Miami to lie on a beach with her old friends from college while the man stays home to care for their five children under the age of two, the correct interpretation is that he’s been having a grand old time sitting at home drinking beer and watching television while the poor woman is\nabsolutely worn out\nfrom an\nexhausting\nweek of being\ndragged\nto all sorts of social activities in which she most certainly did\nnot\nwant to participate.  (Roissy, of course, would put a different spin on why she’s so worn out, but that’s beside the point here.)\nThe lesson is this: solipsism is best avoided, because it makes you look insanely stupid to anyone who isn’t equally solipsistic.  But that somehow never stops the feminists.",
  "tags": [
    "woman"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-06T14:33:00+00:00"
}