{
  "url": "https://voxday.net/2010/08/07/on-conservative-bikini-scandals/",
  "scraped_at": "2026-01-08T23:34:07.367711",
  "title": "On conservative bikini “scandals”",
  "date_display": "August 7, 2010",
  "date_iso": "2010-08-07T14:15:00+00:00",
  "date_from_url": "2010-08-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Other McCain <a href=\"http://theothermccain.com/2010/08/04/marcela-hoeven-bikini-scandal/\">points and laughs</a> at liberals attempting to create scandals out of very little fabric:</p><blockquote><p>Conservatives are not only smarter and more patriotic than liberals, we’re also better-looking. It’s high time we stopped letting liberals get inside our heads and tell us that it’s some kind of “hypocrisy” for conservatives even to acknowledge the existence of sex.</p></blockquote><p>It is true.  Even when liberal girls start out pretty, they rapidly end up making hags of themselves.  There’s something about being angry and self-righteous all the time that seems to warp a woman’s face as well as her soul.  Meanwhile, Cassy Fiano <a href=\"http://www.cassyfiano.com/2010/08/breaking-marcela-hoeven-looks-good-in-a-bikini\">explains the liberal thinking</a>, such as it is, behind these “scandals”.</p><blockquote><p>They like to paint conservatives as frigid, dried up, ugly old prudes, and of course, that couldn’t be further from the truth. And they hope that showing pictures of a conservative — or their family members — in bikinis will mean that other conservatives will be outrageously outraged. They’re always shocked when bikini photos do not, in fact, derail conservative candidates’ campaigns.</p></blockquote><p>It seems that more than a few left-liberals have failed to understand that the American Taliban metaphor was, in fact, a metaphor.  So, chalk me up a supporter of pretty conservative women in bikinis.  However, I find <a href=\"http://photos1.blogger.com/blogger/5786/315/1600/sbswimsuit.jpg\">libertarian women</a> to be the most attractive.  They’re smarter, more interesting, and much more fun than their pretty conservative counterparts.</p></div>",
  "content_text": "The Other McCain\npoints and laughs\nat liberals attempting to create scandals out of very little fabric:\nConservatives are not only smarter and more patriotic than liberals, we’re also better-looking. It’s high time we stopped letting liberals get inside our heads and tell us that it’s some kind of “hypocrisy” for conservatives even to acknowledge the existence of sex.\nIt is true.  Even when liberal girls start out pretty, they rapidly end up making hags of themselves.  There’s something about being angry and self-righteous all the time that seems to warp a woman’s face as well as her soul.  Meanwhile, Cassy Fiano\nexplains the liberal thinking\n, such as it is, behind these “scandals”.\nThey like to paint conservatives as frigid, dried up, ugly old prudes, and of course, that couldn’t be further from the truth. And they hope that showing pictures of a conservative — or their family members — in bikinis will mean that other conservatives will be outrageously outraged. They’re always shocked when bikini photos do not, in fact, derail conservative candidates’ campaigns.\nIt seems that more than a few left-liberals have failed to understand that the American Taliban metaphor was, in fact, a metaphor.  So, chalk me up a supporter of pretty conservative women in bikinis.  However, I find\nlibertarian women\nto be the most attractive.  They’re smarter, more interesting, and much more fun than their pretty conservative counterparts.",
  "tags": [
    "politics",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-07T13:15:00+00:00"
}