{
  "url": "https://voxday.net/2010/08/25/refusing-to-learn/",
  "scraped_at": "2026-01-08T23:35:37.654680",
  "title": "Refusing to learn",
  "date_display": "August 25, 2010",
  "date_iso": "2010-08-25T10:42:00+00:00",
  "date_from_url": "2010-08-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>My contempt for anklebiters notwithstanding, I very much appreciate substantive criticism.  This is why.  When you refuse to pay attention to your critics, all you manage to do is increase the likelihood that you will look even more ridiculous in the future, <a href=\"http://krugman.blogs.nytimes.com/2010/08/24/hangover-theory-at-the-fed/\">as Paul Krugman demonstrates</a> by continuing to cling to his ignorant idea of a nonexistent “hangover theory”:</p><blockquote><p>[A]t least some members of the FOMC have bought into the hangover theory — the modern version of liquidationism in which mass unemployment is somehow necessary in the aftermath of a burst bubble:</p><p><i>Narayana Kocherlakota, president of the Minneapolis Fed, argued that a large part of today’s unemployment problem is caused by issues the Fed can’t solve, such as the mismatch between the skills of jobless workers and the skills that employers wanted.</i></p><p>Here’s what Kocherlakota said in a speech after the meeting:</p><p><i>Whatever the source, though, it is hard to see how the Fed can do much to cure this problem. Monetary stimulus has provided conditions so that manufacturing plants want to hire new workers. But the Fed does not have a means to transform construction workers into manufacturing workers.</i></p><p>I tried, in <a href=\"http://www.slate.com/id/9593\">that old piece on hangover theorists</a>, to explain what’s wrong with this view in general.</p></blockquote><p>Tried and completely failed, Mr. Nobel Prize winner.  Krugman clearly has no idea <a href=\"http://www.milobookclub.com/2009/02/18/irrational-economis/\">how badly he was bitchslapped</a> on that piece by me and numerous others.  He knows nothing of Austrian economics, he has learned nothing in 12 years of its core concepts playing out right in front of his eyes, and he has absolutely no idea what is going on with the economy right now.</p><p>What’s worse is that Krugman clearly knows that his critics exist, as evidenced by his comments <a href=\"http://www.milobookclub.com/2009/12/11/note-to-paul-krugman/\">on his blog</a> and the fact that he reads the comments that are posted there.  Krugman isn’t just an ignorant economist, he has willfully and stubbornly chosen to remain that way.</p></div>",
  "content_text": "My contempt for anklebiters notwithstanding, I very much appreciate substantive criticism.  This is why.  When you refuse to pay attention to your critics, all you manage to do is increase the likelihood that you will look even more ridiculous in the future,\nas Paul Krugman demonstrates\nby continuing to cling to his ignorant idea of a nonexistent “hangover theory”:\n[A]t least some members of the FOMC have bought into the hangover theory — the modern version of liquidationism in which mass unemployment is somehow necessary in the aftermath of a burst bubble:\nNarayana Kocherlakota, president of the Minneapolis Fed, argued that a large part of today’s unemployment problem is caused by issues the Fed can’t solve, such as the mismatch between the skills of jobless workers and the skills that employers wanted.\nHere’s what Kocherlakota said in a speech after the meeting:\nWhatever the source, though, it is hard to see how the Fed can do much to cure this problem. Monetary stimulus has provided conditions so that manufacturing plants want to hire new workers. But the Fed does not have a means to transform construction workers into manufacturing workers.\nI tried, in\nthat old piece on hangover theorists\n, to explain what’s wrong with this view in general.\nTried and completely failed, Mr. Nobel Prize winner.  Krugman clearly has no idea\nhow badly he was bitchslapped\non that piece by me and numerous others.  He knows nothing of Austrian economics, he has learned nothing in 12 years of its core concepts playing out right in front of his eyes, and he has absolutely no idea what is going on with the economy right now.\nWhat’s worse is that Krugman clearly knows that his critics exist, as evidenced by his comments\non his blog\nand the fact that he reads the comments that are posted there.  Krugman isn’t just an ignorant economist, he has willfully and stubbornly chosen to remain that way.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-25T09:42:00+00:00"
}