{
  "url": "https://voxday.net/2010/08/27/revised/",
  "scraped_at": "2026-01-08T23:35:50.404732",
  "title": "Revised!",
  "date_display": "August 27, 2010",
  "date_iso": "2010-08-27T17:00:00+00:00",
  "date_from_url": "2010-08-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The revision was, of course, <a href=\"http://finance.yahoo.com/news/Economic-growth-slows-to-16-apf-1166859770.html?x=0&amp;sec=topStories&amp;pos=4&amp;asset=&amp;ccode=!\">UNEXPECTED</a>!</p><blockquote><p>The nation’s gross domestic product — the broadest measure of the economy’s output — grew at a 1.6 percent annual rate in the April-to-June period, the Commerce Department said Friday. That’s down from an initial estimate of 2.4 percent last month and much slower than the first quarter’s 3.7 percent pace.</p></blockquote><p>Anyone still think my prediction of at least one negative quarter for GDP in 2010 is going to be incorrect?  Heck, if you consider that they lowered the Q2 number by one-third from only one month ago, <i>Q2</i> might be reported negative before the end of the year.  And remember, that’s the map.  The territory has been negative no matter what the map says now.</p></div>",
  "content_text": "The revision was, of course,\nUNEXPECTED\n!\nThe nation’s gross domestic product — the broadest measure of the economy’s output — grew at a 1.6 percent annual rate in the April-to-June period, the Commerce Department said Friday. That’s down from an initial estimate of 2.4 percent last month and much slower than the first quarter’s 3.7 percent pace.\nAnyone still think my prediction of at least one negative quarter for GDP in 2010 is going to be incorrect?  Heck, if you consider that they lowered the Q2 number by one-third from only one month ago,\nQ2\nmight be reported negative before the end of the year.  And remember, that’s the map.  The territory has been negative no matter what the map says now.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-27T16:00:00+00:00"
}