{
  "url": "https://voxday.net/2010/08/31/strategy-for-short-run/",
  "scraped_at": "2026-01-08T23:36:05.495511",
  "title": "A strategy for the short run",
  "date_display": "August 31, 2010",
  "date_iso": "2010-08-31T10:11:00+00:00",
  "date_from_url": "2010-08-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Many women tend to get their panties in a bunch whenever I point out that their suffrage has led to less freedom and more government and their increased preference for paid employment has led to lower wages for everyone.  But their protestations are more than a little amusing in light of the fact that one of the arguments against cutting the size of government is <a href=\"http://www.washingtonpost.com/wp-dyn/content/article/2010/08/30/AR2010083003436.html?hpid=topnews\">the negative effect this will supposedly have</a> on women:</p><blockquote><p>Women, recent studies here show, are far more dependent on the state than men. Women are thus set to bear a disproportionate amount of the pain, prompting a legal challenge that could scuttle the government’s fiscal crusade and raise fairness questions over deficit-cutting campaigns underway from Greece to Spain, and in the United States when it eventually moves to curb spending.</p><p>One major target in Britain, for instance, is the bloated public sector, with as many as 600,000 government jobs – or one in 10 – potentially on the chopping block. But 65 percent of state employees are women, including single mothers in part-time job programs, setting them up to suffer more than men.</p><p>Overall, a report published by the House of Commons indicates, women stand to bear the burden of 72 percent of the government’s cuts.</p></blockquote><p>This is rather like people who oppose income tax cuts getting upset that the wealthy will pay less tax.  Of course they will pay less taxes, because you can’t cut taxes from people who aren’t paying any, the perverted Bush spendable “tax credits” notwithstanding.  Women disproportionately benefited from the great debt-funded expansion of government over the past four decades, so now that governments have to start shrinking due to falling tax revenues and debt-deflation, women should be expected to disproportionately suffer.</p><p>One point that those who favor more women in the workforce have never addressed is how <i>counterproductive</i> most of the additional women were.  (Remember, one-third of women always been in the labor force; “women in the workforce” actually means “educated middle class women who in the past would have gotten married and had children but instead chose to join the workforce”).  So, in summary, women got the vote, then used it to vote for politicians who would go into debt in order to hire them to harass the private sector.  And we’re supposed to be suprised this didn’t work out well?</p></div>",
  "content_text": "Many women tend to get their panties in a bunch whenever I point out that their suffrage has led to less freedom and more government and their increased preference for paid employment has led to lower wages for everyone.  But their protestations are more than a little amusing in light of the fact that one of the arguments against cutting the size of government is\nthe negative effect this will supposedly have\non women:\nWomen, recent studies here show, are far more dependent on the state than men. Women are thus set to bear a disproportionate amount of the pain, prompting a legal challenge that could scuttle the government’s fiscal crusade and raise fairness questions over deficit-cutting campaigns underway from Greece to Spain, and in the United States when it eventually moves to curb spending.\nOne major target in Britain, for instance, is the bloated public sector, with as many as 600,000 government jobs – or one in 10 – potentially on the chopping block. But 65 percent of state employees are women, including single mothers in part-time job programs, setting them up to suffer more than men.\nOverall, a report published by the House of Commons indicates, women stand to bear the burden of 72 percent of the government’s cuts.\nThis is rather like people who oppose income tax cuts getting upset that the wealthy will pay less tax.  Of course they will pay less taxes, because you can’t cut taxes from people who aren’t paying any, the perverted Bush spendable “tax credits” notwithstanding.  Women disproportionately benefited from the great debt-funded expansion of government over the past four decades, so now that governments have to start shrinking due to falling tax revenues and debt-deflation, women should be expected to disproportionately suffer.\nOne point that those who favor more women in the workforce have never addressed is how\ncounterproductive\nmost of the additional women were.  (Remember, one-third of women always been in the labor force; “women in the workforce” actually means “educated middle class women who in the past would have gotten married and had children but instead chose to join the workforce”).  So, in summary, women got the vote, then used it to vote for politicians who would go into debt in order to hire them to harass the private sector.  And we’re supposed to be suprised this didn’t work out well?",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-31T09:11:00+00:00"
}