{
  "url": "https://voxday.net/2010/08/05/total-surprise/",
  "scraped_at": "2026-01-08T23:33:56.752928",
  "title": "A sign of an indication?",
  "date_display": "August 5, 2010",
  "date_iso": "2010-08-05T08:21:00+00:00",
  "date_from_url": "2010-08-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which we are informed that the Lizard Queen is now making noises about <a href=\"http://www.telegraph.co.uk/news/worldnews/northamerica/usa/7090944/Hillary-Clinton-raises-prospect-of-resignation.html\">resigning from Obama’s Cabinet</a>:</p><blockquote><p>Hillary Clinton raises prospect of resignation.  Hillary Clinton, the US Secretary of State, has complained of the tiring natue of her job and said she will step back from the role before the end of Barack Obama’s presidency.</p></blockquote><p>R writes: <i>“I admit it doesn’t actually surprise me that it is so far playing out as you predicted.”</i>*  So far, so good, anyhow.  I have no doubt that Hillary will resign, most likely before the end of the first term.  Of course, the much more interesting question is if she intends to step back from the role in order to <i>bring about that end</i> to <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=187813\">Mr. Soebarkah’s presidency</a>.</p><p> *<i>“it is clear that he [President Soebarkah] is likely to be extraordinarily vulnerable if the Lizard Queen elects to strike against her current boss. The first indication that she intends to do so will be a growing chorus of elite Democratic opinion against Obama’s conduct of the war… <a href=\"http://www.milobookclub.com/2010/07/28/mr-buchanan-reads-blog/\">the more significant indicator</a> would be her resignation from the Cabinet next year.”</i></p></div>",
  "content_text": "In which we are informed that the Lizard Queen is now making noises about\nresigning from Obama’s Cabinet\n:\nHillary Clinton raises prospect of resignation.  Hillary Clinton, the US Secretary of State, has complained of the tiring natue of her job and said she will step back from the role before the end of Barack Obama’s presidency.\nR writes:\n“I admit it doesn’t actually surprise me that it is so far playing out as you predicted.”\n*  So far, so good, anyhow.  I have no doubt that Hillary will resign, most likely before the end of the first term.  Of course, the much more interesting question is if she intends to step back from the role in order to\nbring about that end\nto\nMr. Soebarkah’s presidency\n.\n*\n“it is clear that he [President Soebarkah] is likely to be extraordinarily vulnerable if the Lizard Queen elects to strike against her current boss. The first indication that she intends to do so will be a growing chorus of elite Democratic opinion against Obama’s conduct of the war…\nthe more significant indicator\nwould be her resignation from the Cabinet next year.”",
  "tags": [
    "mailvox",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-05T07:21:00+00:00"
}