{
  "url": "https://voxday.net/2010/08/25/unexpected/",
  "scraped_at": "2026-01-08T23:35:39.466236",
  "title": "Unexpected!",
  "date_display": "August 25, 2010",
  "date_iso": "2010-08-25T14:53:00+00:00",
  "date_from_url": "2010-08-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Except, you know, for those who <a href=\"http://finance.yahoo.com/news/Instant-View-New-home-sales-rb-1932018602.html?x=0&amp;sec=topStories&amp;pos=main&amp;asset=&amp;ccode=\">expected home sales to fall off a cliff</a> as a result of the homebuyer’s credit pulling demand forward, exactly as Austrian theory has been explaining for decades:</p><blockquote><p>New U.S. single-family home sales unexpectedly fell in July to set their slowest pace on record while prices were the lowest in more than 6-1/2 years.  The Commerce Department said sales dropped 12.4 percent to a 276,000 unit annual rate, the lowest since the series started in 1963, from a downwardly revised 315,000 units in June. <b>Analysts polled by Reuters had forecast new home sales unchanged</b> at a 330,000 unit pace last month.</p></blockquote><p>Emphasis added, with a good deal of derision.  Now note how they’re still talking about the <i>possibility</i> of a “double-dip” recession.</p><p><i>“”The odds of the dreaded double-dip are increasing. I’ve been one of the only people in the double-dip camp explicitly, but more and more of the people who have been playing in the game of what is the probability — 20 percent, 30 percent — are going to start saying maybe it is 50 percent.”</i></p><p>What a load of complete CYA nonsense.  There will be no double-dip because there has been absolutely no recovery from which to dip again.  The so-called recovery is a simple statistical trick utilizing government spending to paper over the continuing economic contraction.  As the second stimulus runs out, the extent of the contraction will become more readily apparent to everyone.  Extend, pretend, and hope for change has failed.</p></div>",
  "content_text": "Except, you know, for those who\nexpected home sales to fall off a cliff\nas a result of the homebuyer’s credit pulling demand forward, exactly as Austrian theory has been explaining for decades:\nNew U.S. single-family home sales unexpectedly fell in July to set their slowest pace on record while prices were the lowest in more than 6-1/2 years.  The Commerce Department said sales dropped 12.4 percent to a 276,000 unit annual rate, the lowest since the series started in 1963, from a downwardly revised 315,000 units in June.\nAnalysts polled by Reuters had forecast new home sales unchanged\nat a 330,000 unit pace last month.\nEmphasis added, with a good deal of derision.  Now note how they’re still talking about the\npossibility\nof a “double-dip” recession.\n“”The odds of the dreaded double-dip are increasing. I’ve been one of the only people in the double-dip camp explicitly, but more and more of the people who have been playing in the game of what is the probability — 20 percent, 30 percent — are going to start saying maybe it is 50 percent.”\nWhat a load of complete CYA nonsense.  There will be no double-dip because there has been absolutely no recovery from which to dip again.  The so-called recovery is a simple statistical trick utilizing government spending to paper over the continuing economic contraction.  As the second stimulus runs out, the extent of the contraction will become more readily apparent to everyone.  Extend, pretend, and hope for change has failed.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-25T13:53:00+00:00"
}