{
  "url": "https://voxday.net/2010/08/02/writers-lottery-part-ii/",
  "scraped_at": "2026-01-08T23:33:36.236403",
  "title": "The Writer’s Lottery, part II",
  "date_display": "August 2, 2010",
  "date_iso": "2010-08-02T13:15:00+00:00",
  "date_from_url": "2010-08-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Vrye Denker expresses a certain degree of incredulity: <i>The successful writing career of <b>Katie Price</b>? As in <b>Jordan</b></i>?</p><p>Yes.  Exactly.  In fact, the woman is topping the bestseller lists even as we contemplate the matter:</p><blockquote><p>July 29, 2010 – One time glamour model Katie Price looks set to reach the number one spot of the Sunday Times Bestseller list with the publication of her lastest book in the Angel trilogy entitled <i>Paradise</i>.  Katie known also as Jordan will see her novel go straight to the fiction top spot for hardbacks as her Random House publishers revealed that the book is outselling its nearest rival by two to one.</p></blockquote><p>In other words, she is presently outselling the best-selling Harry Potter novel and the bestselling Twilight novel <i>combined</i>.  And that would be why I don’t worry about how well my books sell or equate book sales with literary quality.  No doubt Katie Price will, like JK Rowling before her, have an entire generation of children – girls anyway – reading too. Having written numerous bestsellers, she is obviously a literary giant and an example to be much-imitated by ambitious young writers of the future.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://i.fanpix.net/images/orig/2/n/2n421eyj5nu74n1u.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://i.fanpix.net/images/orig/2/n/2n421eyj5nu74n1u.jpg\" width=\"213\"/></a></div><p>The face of modern literature</p></div>",
  "content_text": "Vrye Denker expresses a certain degree of incredulity:\nThe successful writing career of\nKatie Price\n? As in\nJordan\n?\nYes.  Exactly.  In fact, the woman is topping the bestseller lists even as we contemplate the matter:\nJuly 29, 2010 – One time glamour model Katie Price looks set to reach the number one spot of the Sunday Times Bestseller list with the publication of her lastest book in the Angel trilogy entitled\nParadise\n.  Katie known also as Jordan will see her novel go straight to the fiction top spot for hardbacks as her Random House publishers revealed that the book is outselling its nearest rival by two to one.\nIn other words, she is presently outselling the best-selling Harry Potter novel and the bestselling Twilight novel\ncombined\n.  And that would be why I don’t worry about how well my books sell or equate book sales with literary quality.  No doubt Katie Price will, like JK Rowling before her, have an entire generation of children – girls anyway – reading too. Having written numerous bestsellers, she is obviously a literary giant and an example to be much-imitated by ambitious young writers of the future.\nThe face of modern literature",
  "tags": [
    "books",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-02T12:15:00+00:00"
}