{
  "url": "https://voxday.net/2010/08/18/you-might-want-to-check-tha/",
  "scraped_at": "2026-01-08T23:35:00.875033",
  "title": "You might want to check that",
  "date_display": "August 18, 2010",
  "date_iso": "2010-08-18T10:06:00+00:00",
  "date_from_url": "2010-08-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The claims of average temperatures rising don’t mean a whole lot when <a href=\"http://www.climatechangefraud.com/climate-reports/7491-official-satellite-failure-means-decade-of-global-warming-data-doubtful\">the thermometers don’t work</a>:</p><blockquote><p>US Government admits satellite temperature readings “degraded.” All data taken offline in shock move. Global warming temperatures may be 10 to 15 degrees too high.  The fault was first detected after a tip off from an anonymous member of the public to climate skeptic blog, Climate Change Fraud</p><p>Caught in the center of the controversy is the beleaguered taxpayer funded National Oceanic and Atmospheric Administration (NOAA). NOAA’s Program Coordinator, Chuck Pistis has now confirmed that the fast spreading story on the respected climate skeptic blog is true….Great Lakes users of the satellite service were the first to blow the whistle on the wildly distorted readings that showed a multitude of impossibly high temperatures. NOAA admits that the machine-generated readings are not continuously monitored so that absurdly high false temperatures could have become hidden amidst the bulk of automated readings.</p><p>In one example swiftly taken down by NOAA after my first article, readings for June and July 2010 for Lake Michigan showed crazy temperatures off the scale ranging in the low to mid hundreds – with some parts of the Wisconsin area apparently reaching 612 F. With an increasing number of further errors now coming to light the discredited NOAA removed the entire set from public view.</p></blockquote><p>I found this level of incompetence a little hard to credit, so I checked the link.  Sure enough, here was the message: <i>“NOTICE (8/11/2010): Due to degradation of a satellite sensor used by this mapping product, some images have exhibited extreme high and low surface temperatures. Please disregard these images as anomalies.”</i></p><p>Needless to say, restructuring the global economy on the basis of conclusions drawn from data of this sort wouldn’t be so much stupid as absolutely and certifiably insane.  As for the so-called “scientific consensus”, remember two things.  1) Most people are idiots.  2) All scientists are people.  Ergo, it is safe to assume that <i>most scientists are idiots</i>, especially when one takes into account their apparent inability to understand either a) that science depends upon capitalist wealth not government largess, and, b) that the basic laws of supply and demand apply to their profession as well as their academic credentials.</p></div>",
  "content_text": "The claims of average temperatures rising don’t mean a whole lot when\nthe thermometers don’t work\n:\nUS Government admits satellite temperature readings “degraded.” All data taken offline in shock move. Global warming temperatures may be 10 to 15 degrees too high.  The fault was first detected after a tip off from an anonymous member of the public to climate skeptic blog, Climate Change Fraud\nCaught in the center of the controversy is the beleaguered taxpayer funded National Oceanic and Atmospheric Administration (NOAA). NOAA’s Program Coordinator, Chuck Pistis has now confirmed that the fast spreading story on the respected climate skeptic blog is true….Great Lakes users of the satellite service were the first to blow the whistle on the wildly distorted readings that showed a multitude of impossibly high temperatures. NOAA admits that the machine-generated readings are not continuously monitored so that absurdly high false temperatures could have become hidden amidst the bulk of automated readings.\nIn one example swiftly taken down by NOAA after my first article, readings for June and July 2010 for Lake Michigan showed crazy temperatures off the scale ranging in the low to mid hundreds – with some parts of the Wisconsin area apparently reaching 612 F. With an increasing number of further errors now coming to light the discredited NOAA removed the entire set from public view.\nI found this level of incompetence a little hard to credit, so I checked the link.  Sure enough, here was the message:\n“NOTICE (8/11/2010): Due to degradation of a satellite sensor used by this mapping product, some images have exhibited extreme high and low surface temperatures. Please disregard these images as anomalies.”\nNeedless to say, restructuring the global economy on the basis of conclusions drawn from data of this sort wouldn’t be so much stupid as absolutely and certifiably insane.  As for the so-called “scientific consensus”, remember two things.  1) Most people are idiots.  2) All scientists are people.  Ergo, it is safe to assume that\nmost scientists are idiots\n, especially when one takes into account their apparent inability to understand either a) that science depends upon capitalist wealth not government largess, and, b) that the basic laws of supply and demand apply to their profession as well as their academic credentials.",
  "tags": [
    "AGW/CC",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-18T09:06:00+00:00"
}