{
  "url": "https://voxday.net/2010/08/17/yowzers-2/",
  "scraped_at": "2026-01-08T23:34:57.226935",
  "title": "Yowzers",
  "date_display": "August 17, 2010",
  "date_iso": "2010-08-17T08:37:00+00:00",
  "date_from_url": "2010-08-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which Karl Denninger <a href=\"http://market-ticker.org/archives/2584-Revoke-Krugmans-PhD-Social-Security.html\">prison-rapes Paul Krugman’s bizarre meanderings</a> on Social Security:</p><blockquote><p>Seriously.  This tripe is so bereft of logic and actual mental acuity that it is unworthy of graduation from elementary school:</p><p><i>“About that math: Legally, Social Security has its own, dedicated funding, via the payroll tax (“FICA” on your pay statement). But it’s also part of the broader federal budget. This dual accounting means that there are two ways Social Security could face financial problems. First, that dedicated funding could prove inadequate, forcing the program either to cut benefits or to turn to Congress for aid. Second, Social Security costs could prove unsupportable for the federal budget as a whole.”</i></p><p>Baloney.  This is called fraud in the private-sector.  First, there is no dedicated funding.  Second, all the money taken in over the years was not “invested”, it was spent.</p><p><i>“Social Security has been running surpluses for the last quarter-century, banking those surpluses in a special account, the so-called trust fund.”</i></p><p>That so-called “trust fund” is a fraud.  It does not exist.</p><p>Here’s what actually happens (and Krugman knows this, which makes him a damned liar besides):</p><p>1.  Your tax dollars go to Treasury<br> 2.  Treasury keeps them and issues “special” Treasury bonds to the Social Security “trust fund.”<br> 3.  Treasury counts these tax receipts against the federal deficit, making it look (much, until the last year) smaller than it really is.</br></br></p><p>Note the slight-of-hand here.  Social Security gets an alleged “bond” but they can’t sell it to anyone but the Treasury.  That is, legally it is an IOU, not a bond.  A bond can be marketed in the open market to anyone who is willing to buy, for whatever they’re willing to pay.  These are unmarketable (intentionally) and thus can only be redeemed in one place – at Treasury.</p><p>The problem is that Treasury spent the money and thus doesn’t have anything with which to redeem the IOUs!</p></blockquote><p>Seriously, even people who don’t pay any attention to either politics or economics knows that the Social Security “trust fund” is nonexistent and that Congress has been operating on a pay-as-you-go system all along.  I can’t even pretend to understand what Krugman was thinking when he wrote <a href=\"http://www.nytimes.com/2010/08/16/opinion/16krugman.html?_r=2\">this ridiculous column</a>.  The money in the so-called “lock box” isn’t there because the box doesn’t exist either.  The money is nothing more than yet another government debt as it was all spent years ago.</p></div>",
  "content_text": "In which Karl Denninger\nprison-rapes Paul Krugman’s bizarre meanderings\non Social Security:\nSeriously.  This tripe is so bereft of logic and actual mental acuity that it is unworthy of graduation from elementary school:\n“About that math: Legally, Social Security has its own, dedicated funding, via the payroll tax (“FICA” on your pay statement). But it’s also part of the broader federal budget. This dual accounting means that there are two ways Social Security could face financial problems. First, that dedicated funding could prove inadequate, forcing the program either to cut benefits or to turn to Congress for aid. Second, Social Security costs could prove unsupportable for the federal budget as a whole.”\nBaloney.  This is called fraud in the private-sector.  First, there is no dedicated funding.  Second, all the money taken in over the years was not “invested”, it was spent.\n“Social Security has been running surpluses for the last quarter-century, banking those surpluses in a special account, the so-called trust fund.”\nThat so-called “trust fund” is a fraud.  It does not exist.\nHere’s what actually happens (and Krugman knows this, which makes him a damned liar besides):\n1.  Your tax dollars go to Treasury\n2.  Treasury keeps them and issues “special” Treasury bonds to the Social Security “trust fund.”\n3.  Treasury counts these tax receipts against the federal deficit, making it look (much, until the last year) smaller than it really is.\nNote the slight-of-hand here.  Social Security gets an alleged “bond” but they can’t sell it to anyone but the Treasury.  That is, legally it is an IOU, not a bond.  A bond can be marketed in the open market to anyone who is willing to buy, for whatever they’re willing to pay.  These are unmarketable (intentionally) and thus can only be redeemed in one place – at Treasury.\nThe problem is that Treasury spent the money and thus doesn’t have anything with which to redeem the IOUs!\nSeriously, even people who don’t pay any attention to either politics or economics knows that the Social Security “trust fund” is nonexistent and that Congress has been operating on a pay-as-you-go system all along.  I can’t even pretend to understand what Krugman was thinking when he wrote\nthis ridiculous column\n.  The money in the so-called “lock box” isn’t there because the box doesn’t exist either.  The money is nothing more than yet another government debt as it was all spent years ago.",
  "tags": [
    "economics",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2010-08-17T07:37:00+00:00"
}