{
  "url": "https://voxday.net/2021/08/08/bindery-campaign-update-5/",
  "scraped_at": "2026-01-08T12:46:30.727038",
  "title": "Bindery Campaign update 5",
  "date_display": "August 8, 2021",
  "date_iso": "2021-08-08T13:21:17+00:00",
  "date_from_url": "2021-08-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://arkhavencomics.com/product-category/leather/bindery/\" rel=\"noopener\" target=\"_blank\">Days Left: 23</a></p><p>Status: 50.3 percent of goal.</p><p>The Iliad: 170/500</p><p>The Odyssey: 165/500  </p><p>First, thanks very much to everyone who has already backed this campaign and is making the next big step possible. Second, as requested, we will add two more ways to support the campaign next week, at more affordable $50 and $150 levels. Third, I will remind you that I am neither customer nor technical support and all attempts to pursue either through this blog or on the Darkstream will be deleted and ignored.</p><p>I understand that many organizations operate under the principle that “the customer is always right”. <i>We absolutely do not.</i> To the contrary, we operate under the principle that could be described as “the customer is probably retarded”. This is not to say we do not appreciate, respect, or hold in the highest regard everyone who supports our projects and makes them possible, but the negative baseline is necessary if we are to successfully anticipate even a small fraction of the customer-related problems that inevitably arise over time. Remember, MPAI.</p><p>For example, there is literally nothing we can do about a customer spamming our emails besides telling people – usually to no avail – to check their Social folders and whitelist our URLs. There is nothing we can do about a customer not giving us a shipping address, or moving without telling us that his address has changed. We cannot accept payment from an expired credit card. We cannot force anyone to read the emails that we send them. We are legally barred from contacting customers who intentionally remove themselves from our mailing list. (Believe it or not, one or two people do this almost every time we send out a mass email. Almost invariably, they later complain that we’re not keeping them informed.) These are the quotidian realities we face.</p><p>Moreover, until the bindery becomes operational, our ability to ensure that everyone gets their books in a reasonable timeframe is limited because <i>we do not ship them to anyone</i>. We literally never see them at all, and while our two primary partners have the best of intentions, both of them tend to fall short of the level of service that we consider to be acceptable. <i>That is one of the primary reasons we are creating the bindery! </i>In order to provide the level of service we wish to provide you, we have to control the entire process. And right now, we don’t, and unfortunately, neither of our partners are anywhere close to the Amazon level of operational performance and efficiency.</p><p>Now this doesn’t mean we aren’t 100-percent committed to ensuring that every single supporter and book buyer gets his books eventually, one way or another. For example, to address those who haven’t received the Junior Classics 1-3 hardcovers, the reason we aren’t losing any sleep about sorting out your problem right away is because you know we are going to be sending you books 4-6 this summer, and given our limited influence over the very large printing and distribution company that ships them, it is more effective to sort out each shipping problem with them once rather than addressing it multiple times. Trust us, we’ve been working with them for years, we know what works and what flat-out doesn’t.</p><p>As for what is taking so long to produce the Junior Classics, in addition to the editorial and layout processes, we are going through literally thousands of images, selecting hundreds of them, then carefully checking to make sure that they all work together aesthetically as well as with the related stories they illustrate. This takes time. This takes a LOT of time. Sure, we could have just taken the Easton approach, scanned the 1918 editions, and shipped all 10 volumes together six months ago, but that’s not what we do. </p><p>I have the lovely two-volume Easton Press edition of <i>The Tale of Genji</i>. It is the exact same interior as my little octavo edition of the Waley translation I used in my Japanese literature course in college, scanned and blown up to royal octavo. And by “exact same”, I mean every typo and ink blot is perfectly replicated.</p><p>And I don’t believe that’s what our readers want. While we will use existing layouts for certain books in which the layouts cannot reasonably be improved – such as the Landmark history series, just to name one example for no particular reason at all – our standard modus operandi is to create new and unique layouts for each book in the Library.</p><p>I understand that some people would prefer that we provide gold-plated customer service. Since that’s not what we do at present, it would probably be better for such individuals to not do direct business with us, wait until the regular products are available through the mainstream channels, and pay the full retail price for them then. But it might be useful to reflect upon why so many of our customers are not meremly happy, but delighted with our products despite our horrific, bordering-on-nonexistent customer service.</p><p>We don’t spam, we don’t market (yet), we don’t even have an active dedicated Internet site at this point in time. All we do is make the highest-quality books that you can buy while systematically addressing one operational problem at a time. I very much hope that we can eventually reach the point where our customer service is as good as our interior layouts, but that is going to take at least two years, because it cannot be the priority at present. It will improve, just like the UATV technology is improving, but the process is intrinsically a gradual one that can be maddening at times.</p><p>Think about it. Are you really going to be happy with a gold-plated concierge service that calls you twice a day to inform you that your books are still not ready and you will not receive them today, tomorrow, or next week?</p></div>",
  "content_text": "Days Left: 23\nStatus: 50.3 percent of goal.\nThe Iliad: 170/500\nThe Odyssey: 165/500\nFirst, thanks very much to everyone who has already backed this campaign and is making the next big step possible. Second, as requested, we will add two more ways to support the campaign next week, at more affordable $50 and $150 levels. Third, I will remind you that I am neither customer nor technical support and all attempts to pursue either through this blog or on the Darkstream will be deleted and ignored.\nI understand that many organizations operate under the principle that “the customer is always right”.\nWe absolutely do not.\nTo the contrary, we operate under the principle that could be described as “the customer is probably retarded”. This is not to say we do not appreciate, respect, or hold in the highest regard everyone who supports our projects and makes them possible, but the negative baseline is necessary if we are to successfully anticipate even a small fraction of the customer-related problems that inevitably arise over time. Remember, MPAI.\nFor example, there is literally nothing we can do about a customer spamming our emails besides telling people – usually to no avail – to check their Social folders and whitelist our URLs. There is nothing we can do about a customer not giving us a shipping address, or moving without telling us that his address has changed. We cannot accept payment from an expired credit card. We cannot force anyone to read the emails that we send them. We are legally barred from contacting customers who intentionally remove themselves from our mailing list. (Believe it or not, one or two people do this almost every time we send out a mass email. Almost invariably, they later complain that we’re not keeping them informed.) These are the quotidian realities we face.\nMoreover, until the bindery becomes operational, our ability to ensure that everyone gets their books in a reasonable timeframe is limited because\nwe do not ship them to anyone\n. We literally never see them at all, and while our two primary partners have the best of intentions, both of them tend to fall short of the level of service that we consider to be acceptable.\nThat is one of the primary reasons we are creating the bindery!\nIn order to provide the level of service we wish to provide you, we have to control the entire process. And right now, we don’t, and unfortunately, neither of our partners are anywhere close to the Amazon level of operational performance and efficiency.\nNow this doesn’t mean we aren’t 100-percent committed to ensuring that every single supporter and book buyer gets his books eventually, one way or another. For example, to address those who haven’t received the Junior Classics 1-3 hardcovers, the reason we aren’t losing any sleep about sorting out your problem right away is because you know we are going to be sending you books 4-6 this summer, and given our limited influence over the very large printing and distribution company that ships them, it is more effective to sort out each shipping problem with them once rather than addressing it multiple times. Trust us, we’ve been working with them for years, we know what works and what flat-out doesn’t.\nAs for what is taking so long to produce the Junior Classics, in addition to the editorial and layout processes, we are going through literally thousands of images, selecting hundreds of them, then carefully checking to make sure that they all work together aesthetically as well as with the related stories they illustrate. This takes time. This takes a LOT of time. Sure, we could have just taken the Easton approach, scanned the 1918 editions, and shipped all 10 volumes together six months ago, but that’s not what we do.\nI have the lovely two-volume Easton Press edition of\nThe Tale of Genji\n. It is the exact same interior as my little octavo edition of the Waley translation I used in my Japanese literature course in college, scanned and blown up to royal octavo. And by “exact same”, I mean every typo and ink blot is perfectly replicated.\nAnd I don’t believe that’s what our readers want. While we will use existing layouts for certain books in which the layouts cannot reasonably be improved – such as the Landmark history series, just to name one example for no particular reason at all – our standard modus operandi is to create new and unique layouts for each book in the Library.\nI understand that some people would prefer that we provide gold-plated customer service. Since that’s not what we do at present, it would probably be better for such individuals to not do direct business with us, wait until the regular products are available through the mainstream channels, and pay the full retail price for them then. But it might be useful to reflect upon why so many of our customers are not meremly happy, but delighted with our products despite our horrific, bordering-on-nonexistent customer service.\nWe don’t spam, we don’t market (yet), we don’t even have an active dedicated Internet site at this point in time. All we do is make the highest-quality books that you can buy while systematically addressing one operational problem at a time. I very much hope that we can eventually reach the point where our customer service is as good as our interior layouts, but that is going to take at least two years, because it cannot be the priority at present. It will improve, just like the UATV technology is improving, but the process is intrinsically a gradual one that can be maddening at times.\nThink about it. Are you really going to be happy with a gold-plated concierge service that calls you twice a day to inform you that your books are still not ready and you will not receive them today, tomorrow, or next week?",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-08-08T12:21:17+00:00"
}