{
  "url": "https://voxday.net/2021/08/11/conflict-is-the-air-we-breathe/",
  "scraped_at": "2026-01-08T12:47:02.043640",
  "title": "Conflict is the air we breathe",
  "date_display": "August 11, 2021",
  "date_iso": "2021-08-11T10:37:52+00:00",
  "date_from_url": "2021-08-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As you’ve almost certainly noticed if you’re here, Google has decided to roll the dice and take its chances with the Legal Legion of Evil. As with YouTube, Blogger hasn’t entirely deplatformed the account, but instead elected to block access to the blog while publicly issuing false and defamatory statements about it.</p><p>This is not a surprise. This day has been a long time in coming, and we have been prepared for it on every front. You may wish to note that this post was made barely an hour after Google took action. Special thanks to the dev team, who were ready for instant action and whose rapid response time allowed such an easy and seamless transformation.</p><p>All the historical blog content is here dating back to 2003, but the comments are gone and we are not going to turn the comments on here yet. If you wish to comment on a post, we’ll be putting up SocialGalactic threads for each post here and you can discuss the posts there. Obviously, this doesn’t work for anyone who isn’t on SG, but then, all you have to do is <a data-id=\"http://subscribe.unauthorized.tv/join\" data-type=\"URL\" href=\"http://subscribe.unauthorized.tv/join\" rel=\"noreferrer noopener\" target=\"_blank\">subscribe to UATV</a> and you’ll get a free SG subscription that will give you access there. The sidebars are presently outdated, but they’ve been backed up as well and will be updated soon.</p><p>This is, of course, yet another reminder – as if another one was necessary – of why acclimatizing to the The Cult of Free is a fundamental mistake and why building our own platforms is an absolute priority.</p><p>There is nothing to fear here. This is a battle we have long anticipated, some more eagerly than others. Sadly, the hound dog who was Alphabet’s former head of legal is gone, so we can’t assume complete incompetence, but that will only make the eventual victory all the more glorious.</p><p>Remember, conflict is the air we breathe. It is the water in which we swim.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img alt=\"\" decoding=\"async\" fetchpriority=\"high\" height=\"325\" src=\"https://social.infogalactic.com/images/posts/6e064586-70fb-44eb-9c88-10f09338a330/original-94a6c22f8c09fca4e5f3fc8d430610f1.jpg?v=63795908889\" width=\"631\"/></figure></div><p><strong>UPDATE:</strong> some newly motivated people are asking how they can help. The two best ways, at present, are to subscribe to UATV or <a data-id=\"https://arkhavencomics.com/product-category/leather/bindery/\" data-type=\"URL\" href=\"https://arkhavencomics.com/product-category/leather/bindery/\" rel=\"noreferrer noopener\" target=\"_blank\">back the bindery</a> campaign.</p></div>",
  "content_text": "As you’ve almost certainly noticed if you’re here, Google has decided to roll the dice and take its chances with the Legal Legion of Evil. As with YouTube, Blogger hasn’t entirely deplatformed the account, but instead elected to block access to the blog while publicly issuing false and defamatory statements about it.\nThis is not a surprise. This day has been a long time in coming, and we have been prepared for it on every front. You may wish to note that this post was made barely an hour after Google took action. Special thanks to the dev team, who were ready for instant action and whose rapid response time allowed such an easy and seamless transformation.\nAll the historical blog content is here dating back to 2003, but the comments are gone and we are not going to turn the comments on here yet. If you wish to comment on a post, we’ll be putting up SocialGalactic threads for each post here and you can discuss the posts there. Obviously, this doesn’t work for anyone who isn’t on SG, but then, all you have to do is\nsubscribe to UATV\nand you’ll get a free SG subscription that will give you access there. The sidebars are presently outdated, but they’ve been backed up as well and will be updated soon.\nThis is, of course, yet another reminder – as if another one was necessary – of why acclimatizing to the The Cult of Free is a fundamental mistake and why building our own platforms is an absolute priority.\nThere is nothing to fear here. This is a battle we have long anticipated, some more eagerly than others. Sadly, the hound dog who was Alphabet’s former head of legal is gone, so we can’t assume complete incompetence, but that will only make the eventual victory all the more glorious.\nRemember, conflict is the air we breathe. It is the water in which we swim.\nUPDATE:\nsome newly motivated people are asking how they can help. The two best ways, at present, are to subscribe to UATV or\nback the bindery\ncampaign.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2021-08-11T09:37:52+00:00"
}