{
  "url": "https://voxday.net/2021/08/25/confucius-condemns-neoliberalism/",
  "scraped_at": "2026-01-08T12:49:22.584305",
  "title": "Confucius Condemns Neoliberalism",
  "date_display": "August 25, 2021",
  "date_iso": "2021-08-25T10:10:45+00:00",
  "date_from_url": "2021-08-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A philosophical experts on Aquinas considers <a href=\"https://edwardfeser.blogspot.com/2021/08/confucius-on-our-times.html\" rel=\"noreferrer noopener\" target=\"_blank\">the applicability of <em>The Analects</em></a><em> </em>to today’s catastrophically atomized society.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>What is essential to a well-functioning society? In a famous passage from <em>The Great Learning</em> traditionally attributed to Confucius (551-479 B.C.), the philosopher says:</p><p><em>The ancients who wished to illustrate illustrious virtue throughout the kingdom, first ordered well their own states. Wishing to order well their states, they first regulated their families. Wishing to regulate their families, they first cultivated their persons. Wishing to cultivate their persons, they first rectified their hearts. Wishing to rectify their hearts, they first sought to be sincere in their thoughts. Wishing to be sincere in their thoughts, they first extended to the utmost their knowledge. Such extension of knowledge lay in the investigation of things.</em></p><p><em>Things being investigated, knowledge became complete. Their knowledge being complete, their thoughts were sincere. Their thoughts being sincere, their hearts were then rectified. Their hearts being rectified, their persons were cultivated. Their persons being cultivated, their families were regulated. Their families being regulated, their states were rightly governed. Their states being rightly governed, the whole kingdom was made tranquil and happy.</em></p><p><em>From the Son of Heaven down to the mass of the people, all must consider the cultivation of the person the root of everything besides. It cannot be, when the root is neglected, that what should spring from it will be well ordered.</em></p><p>These words from the great man of the East would be warmly endorsed in the West by ancient thinkers like Plato and Aristotle and medieval thinkers like Thomas Aquinas. But they run counter to the modern West’s liberalism, including the libertarian brand of liberalism that too often passes for “conservatism.” The liberal attitude is that the moral character of individuals does not matter for social order so long as the right rules and institutions are in place. Part of Confucius’s point, and that of any conservatism worthy of the name, is that rules and institutions are ineffectual without individuals willing to subordinate their desires to them. And individuals who do not seek the good (so as to “rectify their hearts”) and the true (thus pursuing the “investigation of things”) can neither curb bad desires nor cultivate good ones. The brute force of legal coercion cannot substitute for this missing moral fiber. As we read in chapter 2 of <em>The Analects</em>:</p><p>The Master said: <em>“Lead them by political maneuvers, restrain them with punishments: the people will become cunning and shameless. Lead them by virtue, restrain them with ritual: they will develop a sense of shame and a sense of participation.” </em></p><p>And again:</p><p><em>Someone said to Confucius: “Master, why don’t you join the government?” The Master said: “In the Documents it is said: ‘Only cultivate filial piety and be kind to your brothers, and you will be contributing to the body politic.’ This is also a form of political action; one need not necessarily join the government.”</em></p><p>And in chapter 12:</p><p><em>The Master said: “I could adjudicate lawsuits as well as anyone. But I would prefer to make lawsuits unnecessary.”</em></p><p>In such passages, Confucius reminds us that the personal is the political, not in the totalitarian sense that absorbs the personal up into the political and tries to mold attitudes and actions via state coercion, but on the contrary in the humane sense that devolves the political down to the personal level, in the recognition that social order depends more fundamentally on prevailing morals and mores than on legislation.</p></blockquote><p>Wisdom comes in many forms. And it is remarkable how often wisdom from wildly disparate sources ultimately direct us toward the same conclusion.</p></div>",
  "content_text": "A philosophical experts on Aquinas considers\nthe applicability of\nThe Analects\nto today’s catastrophically atomized society.\nWhat is essential to a well-functioning society? In a famous passage from\nThe Great Learning\ntraditionally attributed to Confucius (551-479 B.C.), the philosopher says:\nThe ancients who wished to illustrate illustrious virtue throughout the kingdom, first ordered well their own states. Wishing to order well their states, they first regulated their families. Wishing to regulate their families, they first cultivated their persons. Wishing to cultivate their persons, they first rectified their hearts. Wishing to rectify their hearts, they first sought to be sincere in their thoughts. Wishing to be sincere in their thoughts, they first extended to the utmost their knowledge. Such extension of knowledge lay in the investigation of things.\nThings being investigated, knowledge became complete. Their knowledge being complete, their thoughts were sincere. Their thoughts being sincere, their hearts were then rectified. Their hearts being rectified, their persons were cultivated. Their persons being cultivated, their families were regulated. Their families being regulated, their states were rightly governed. Their states being rightly governed, the whole kingdom was made tranquil and happy.\nFrom the Son of Heaven down to the mass of the people, all must consider the cultivation of the person the root of everything besides. It cannot be, when the root is neglected, that what should spring from it will be well ordered.\nThese words from the great man of the East would be warmly endorsed in the West by ancient thinkers like Plato and Aristotle and medieval thinkers like Thomas Aquinas. But they run counter to the modern West’s liberalism, including the libertarian brand of liberalism that too often passes for “conservatism.” The liberal attitude is that the moral character of individuals does not matter for social order so long as the right rules and institutions are in place. Part of Confucius’s point, and that of any conservatism worthy of the name, is that rules and institutions are ineffectual without individuals willing to subordinate their desires to them. And individuals who do not seek the good (so as to “rectify their hearts”) and the true (thus pursuing the “investigation of things”) can neither curb bad desires nor cultivate good ones. The brute force of legal coercion cannot substitute for this missing moral fiber. As we read in chapter 2 of\nThe Analects\n:\nThe Master said:\n“Lead them by political maneuvers, restrain them with punishments: the people will become cunning and shameless. Lead them by virtue, restrain them with ritual: they will develop a sense of shame and a sense of participation.”\nAnd again:\nSomeone said to Confucius: “Master, why don’t you join the government?” The Master said: “In the Documents it is said: ‘Only cultivate filial piety and be kind to your brothers, and you will be contributing to the body politic.’ This is also a form of political action; one need not necessarily join the government.”\nAnd in chapter 12:\nThe Master said: “I could adjudicate lawsuits as well as anyone. But I would prefer to make lawsuits unnecessary.”\nIn such passages, Confucius reminds us that the personal is the political, not in the totalitarian sense that absorbs the personal up into the political and tries to mold attitudes and actions via state coercion, but on the contrary in the humane sense that devolves the political down to the personal level, in the recognition that social order depends more fundamentally on prevailing morals and mores than on legislation.\nWisdom comes in many forms. And it is remarkable how often wisdom from wildly disparate sources ultimately direct us toward the same conclusion.",
  "tags": [
    "philosophy",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-08-25T10:11:38+00:00"
}