{
  "url": "https://voxday.net/2021/08/29/neoclown-world-is-not-our-culture/",
  "scraped_at": "2026-01-08T12:50:04.411817",
  "title": "Neoclown World is Not Our Culture",
  "date_display": "August 29, 2021",
  "date_iso": "2021-08-29T09:55:52+00:00",
  "date_from_url": "2021-08-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"https://www.dailymail.co.uk/debate/article-9936693/MARY-HARRINGTON-Western-men-alienated-woke-culture-admire-Taliban.html\" rel=\"noreferrer noopener\" target=\"_blank\">A feminist worries</a> – rightly – about the Taliban providing the Men of the West with a useful role model:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Amid the blood-spattered horrors of Kabul, perhaps the most startling response has been an outpouring of warlike passion from disaffected young Western men. But they’re not backing Western soldiers. They’re cheering on the Taliban.</p><p>Far-Right groups are gloating. One user on an online message board called the toppled Western-backed Afghan government ‘globohomo-clownworld’. He characterised this as powered by ‘liberalism, consumerism, secularism, usury, democracy, global capitalism… and most of all, feminism/women’s rights/women’s liberation’.</p><p>Such men consider abhorrent this value system that an America-led coalition spent trillions of dollars trying to instil, via two decades of Afghan ‘nation-building’.</p><p>These alienated men hate all of it – the whole woke world view, from racial tolerance to LGBT rights to feminism. And they’re lionising the Taliban as heroic anti-woke freedom fighters.</p><p>One meme circulating on social media as Kabul fell depicted barefoot Taliban fighters next to a photo of American soldiers wearing high heels for a PR stunt, mockingly connecting Western support for gender-bending to a failure of military competence. And, above all else, these angry Western men detest feminism….</p><p>I’ll be the first to condemn this swamp of hatred – and, of course, there is a danger that in discussing it, the noxious opinions reach a wider audience. But just think for a moment about what it implies. Far from feeling a patriotic love for their own culture and nation, a minority of fighting-age Western men viscerally hate it.</p><p>They’re looking at images of gun-waving men in a violent, war-torn wasteland where women can be beaten with impunity. And they’re not horrified. They’re envious.</p></blockquote><p>Of course we have no patriotic love for the frauds that feign to fly the flags of our cultures and nations. Clown World <em>isn’t our culture</em>. Mixed-race multiethnic multireligious transgendered diversity <em>isn’t our nation</em>. The neoclowns <em>aren’t our people</em>. Every intelligent Western man and woman hates literally everything about the Tolerance, Equality, Progress, Inclusive, Diverse neoclown world, so much so that anyone who is sane would quite reasonably prefer the rule of anyone from the Chinese Neoconfucians and the Russian Orthodox Nationalists to the Taliban and MS-13 in preference to the inept and wicked rule of the moronic females and post-Christian pharisatanics who presently rule over the people of the West through word magic, credit money, and media fiat.</p><p>The nations will rise. The neoclown empire will fall. Christendom will return. And feminism, which is the only political ideology in history more stupid than Communism and more evil than National Socialism, will be eradicated.</p><p><em><a href=\"https://social.infogalactic.com/micropost/5643ea99-23ab-4dd5-a58c-2f73ed2af025\" rel=\"noreferrer noopener\" target=\"_blank\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "A feminist worries\n– rightly – about the Taliban providing the Men of the West with a useful role model:\nAmid the blood-spattered horrors of Kabul, perhaps the most startling response has been an outpouring of warlike passion from disaffected young Western men. But they’re not backing Western soldiers. They’re cheering on the Taliban.\nFar-Right groups are gloating. One user on an online message board called the toppled Western-backed Afghan government ‘globohomo-clownworld’. He characterised this as powered by ‘liberalism, consumerism, secularism, usury, democracy, global capitalism… and most of all, feminism/women’s rights/women’s liberation’.\nSuch men consider abhorrent this value system that an America-led coalition spent trillions of dollars trying to instil, via two decades of Afghan ‘nation-building’.\nThese alienated men hate all of it – the whole woke world view, from racial tolerance to LGBT rights to feminism. And they’re lionising the Taliban as heroic anti-woke freedom fighters.\nOne meme circulating on social media as Kabul fell depicted barefoot Taliban fighters next to a photo of American soldiers wearing high heels for a PR stunt, mockingly connecting Western support for gender-bending to a failure of military competence. And, above all else, these angry Western men detest feminism….\nI’ll be the first to condemn this swamp of hatred – and, of course, there is a danger that in discussing it, the noxious opinions reach a wider audience. But just think for a moment about what it implies. Far from feeling a patriotic love for their own culture and nation, a minority of fighting-age Western men viscerally hate it.\nThey’re looking at images of gun-waving men in a violent, war-torn wasteland where women can be beaten with impunity. And they’re not horrified. They’re envious.\nOf course we have no patriotic love for the frauds that feign to fly the flags of our cultures and nations. Clown World\nisn’t our culture\n. Mixed-race multiethnic multireligious transgendered diversity\nisn’t our nation\n. The neoclowns\naren’t our people\n. Every intelligent Western man and woman hates literally everything about the Tolerance, Equality, Progress, Inclusive, Diverse neoclown world, so much so that anyone who is sane would quite reasonably prefer the rule of anyone from the Chinese Neoconfucians and the Russian Orthodox Nationalists to the Taliban and MS-13 in preference to the inept and wicked rule of the moronic females and post-Christian pharisatanics who presently rule over the people of the West through word magic, credit money, and media fiat.\nThe nations will rise. The neoclown empire will fall. Christendom will return. And feminism, which is the only political ideology in history more stupid than Communism and more evil than National Socialism, will be eradicated.\nDISCUSS ON SG",
  "tags": [
    "decline and fall",
    "Judeochristianity",
    "neoclowns"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-08-29T11:14:00+00:00"
}