{
  "url": "https://voxday.net/2021/08/07/pedo-senator-in-arizona/",
  "scraped_at": "2026-01-08T12:46:19.761475",
  "title": "Pedo senator in Arizona",
  "date_display": "August 7, 2021",
  "date_iso": "2021-08-07T09:28:00+00:00",
  "date_from_url": "2021-08-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is literally zero chance that <a href=\"https://nationalfile.com/arizona-rising-star-democrat-state-senator-lgbtq-caucus-founder-tony-navarrete-arrested-for-child-molestation/\" rel=\"noopener\" target=\"_blank\">he’s the only one</a>.</p><blockquote><p>Arizona State Senator, Tony Navarrete, an openly gay Democrat and founding member of Arizona’s LGBTQ Caucus, has been arrested for child molestation. Phoenix Police confirm that Navarrete, widely considered a “rising star” within the Democrat Party, faces multiple counts of sexual conduct with a minor, among other charges.</p><p>While few details surrounding the charges and arrest have been made immediately available, local media has confirmed with Phoenix Police that Democrat State Senator Tony Navarrete “was arrested on Thursday, Aug. 5, and charged with multiple counts of sexual conduct with a minor among other charges.”</p><p>In the immediate aftermath of Senator Navarrete’s arrest for child molestation, his Senate Democrat colleagues had little to say, releasing a statement saying the caucus was aware of the arrest but had no comment on the situation.  “We are aware one of our members has been arrested and are awaiting further details and for law enforcement to do its job. We will not have further comment at this time,” Senate Democrats said in a statement.</p></blockquote><p>This may have profound implications for the Arizona vote audit. Note that Navarrete is “an openly gay Democrat and founding member of Arizona’s LGBTQ Caucus.” <i>Quelle surprise</i>….</p><p>Not all gays are pedos, but a sufficiently significant percentage of them are to render it child abuse to permit them around children <a href=\"https://nationalfile.com/exposed-arizona-senator-accused-of-child-sex-crimes-has-history-of-campaigning-around-teens-young-children/\" rel=\"noopener\" target=\"_blank\">in any capacity</a>. The fact that not every lion will devour a child doesn’t mean it isn’t child abuse to permit a child to walk into a cage occupied by a lion.</p><p><i>National File has now learned that in 2019, Navarrete was deeply involved in the educational sector, and has worked with children, young teens, and has even “worked closely” with the Arizona Department of Child Safety.</i></p><p>Predators go where the prey is. Remember, Navarrete wasn’t a “rising star” despite being a pedo. He was a rising star <i>because </i>he is a pedo.</p></div>",
  "content_text": "There is literally zero chance that\nhe’s the only one\n.\nArizona State Senator, Tony Navarrete, an openly gay Democrat and founding member of Arizona’s LGBTQ Caucus, has been arrested for child molestation. Phoenix Police confirm that Navarrete, widely considered a “rising star” within the Democrat Party, faces multiple counts of sexual conduct with a minor, among other charges.\nWhile few details surrounding the charges and arrest have been made immediately available, local media has confirmed with Phoenix Police that Democrat State Senator Tony Navarrete “was arrested on Thursday, Aug. 5, and charged with multiple counts of sexual conduct with a minor among other charges.”\nIn the immediate aftermath of Senator Navarrete’s arrest for child molestation, his Senate Democrat colleagues had little to say, releasing a statement saying the caucus was aware of the arrest but had no comment on the situation.  “We are aware one of our members has been arrested and are awaiting further details and for law enforcement to do its job. We will not have further comment at this time,” Senate Democrats said in a statement.\nThis may have profound implications for the Arizona vote audit. Note that Navarrete is “an openly gay Democrat and founding member of Arizona’s LGBTQ Caucus.”\nQuelle surprise\n….\nNot all gays are pedos, but a sufficiently significant percentage of them are to render it child abuse to permit them around children\nin any capacity\n. The fact that not every lion will devour a child doesn’t mean it isn’t child abuse to permit a child to walk into a cage occupied by a lion.\nNational File has now learned that in 2019, Navarrete was deeply involved in the educational sector, and has worked with children, young teens, and has even “worked closely” with the Arizona Department of Child Safety.\nPredators go where the prey is. Remember, Navarrete wasn’t a “rising star” despite being a pedo. He was a rising star\nbecause\nhe is a pedo.",
  "tags": [
    "Judeochristianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-08-07T08:28:00+00:00"
}