{
  "url": "https://voxday.net/2021/08/22/the-vaccinated-are-dying/",
  "scraped_at": "2026-01-08T12:49:00.276627",
  "title": "The Vaccinated are Dying",
  "date_display": "August 22, 2021",
  "date_iso": "2021-08-22T12:44:36+00:00",
  "date_from_url": "2021-08-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Contra the attempts of the media to invert statistical reality, 95.87 percent of the people now dying of Covid are vaccinated. Remember, there are no official or reliable statistics recording or reporting this data in the United States, but the same is not true in other countries.</p><p>In Israel, the most-vaccinated country in the world, where the third shot is already being given, 232 of the 242 people who died of Covid in July and August <a href=\"https://gab.com/LaurenWitzkeDE/posts/106799648494547758\" rel=\"noreferrer noopener\" target=\"_blank\">were vaccinated</a>. So pay zero attention to the scare stories, or the ludicrous reports that 90 percent of the people dying of Covid are unvaccinated.</p><p>It’s not a question of not trusting the US statistics because there are no comprehensive US statistics. It’s literally a comparison between the monthly reports published by a centralized Ministry of Health and hearsay from biased and unreliable anecdotal sources.</p><p>The corrupt doctors in the USA <strong>are flat-out lying</strong> with their “estimates” about the percentage of unvaccinated among the hospitalized. Just to put this on the record for future reference:</p><p><em>The T cells generated by the vaccines are holding up amazingly well, with 99% of the hospitalizations being among unvaccinated adults in the US,” Dr. Monica Gandhi, an infectious disease physician at UCSF, wrote in a tweet Wednesday. Estimates for the percent of unvaccinated people accounting for COVID-19 hospitalizations vary, but generally fall between 95% and 99%.”</em></p></div>",
  "content_text": "Contra the attempts of the media to invert statistical reality, 95.87 percent of the people now dying of Covid are vaccinated. Remember, there are no official or reliable statistics recording or reporting this data in the United States, but the same is not true in other countries.\nIn Israel, the most-vaccinated country in the world, where the third shot is already being given, 232 of the 242 people who died of Covid in July and August\nwere vaccinated\n. So pay zero attention to the scare stories, or the ludicrous reports that 90 percent of the people dying of Covid are unvaccinated.\nIt’s not a question of not trusting the US statistics because there are no comprehensive US statistics. It’s literally a comparison between the monthly reports published by a centralized Ministry of Health and hearsay from biased and unreliable anecdotal sources.\nThe corrupt doctors in the USA\nare flat-out lying\nwith their “estimates” about the percentage of unvaccinated among the hospitalized. Just to put this on the record for future reference:\nThe T cells generated by the vaccines are holding up amazingly well, with 99% of the hospitalizations being among unvaccinated adults in the US,” Dr. Monica Gandhi, an infectious disease physician at UCSF, wrote in a tweet Wednesday. Estimates for the percent of unvaccinated people accounting for COVID-19 hospitalizations vary, but generally fall between 95% and 99%.”",
  "tags": [
    "health care",
    "media",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-08-22T16:34:29+00:00"
}