{
  "url": "https://voxday.net/2021/08/02/what-if-they-know/",
  "scraped_at": "2026-01-08T12:45:26.338883",
  "title": "What if they know?",
  "date_display": "August 2, 2021",
  "date_iso": "2021-08-02T00:45:50+00:00",
  "date_from_url": "2021-08-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Brandon Smith at Zerohedge suspects the evil globalists already know what the long-term adverse effects of the Covid not-vaccines will be, which is why they are pushing so hard to eliminate any sizable control group that will make it clear precisely whom is responsible:</p><p><b></b></p><blockquote><p><b>What if the elites know exactly what the side effects will be? What if the vaccines are a pivotal part of their “Great Reset?”</b></p><p>The infertility question in particular is drawing the most fire from the establishment, and I would point out a particularly insidious narrative being implanted in the media. Whenever people question the chance of sterility caused by the vaccines, bureaucrats and media talking heads go on the attack, and then say “There’s no evidence that the vaccines cause infertility, but Covid-19 might cause it…” Just watch this recent speech by the governor of Arkansas where he and his medical flunky were almost run from the podium by an angry audience for peddling the same propaganda:</p><p>And there you have it. The stage is being set, in my view, for a mass infertility event, and covid will be blamed in place of the experimental vaccines. This is why the establishment needs a 100{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6} vaccination rate; unvaccinated people would stand as evidence of their crime. Let me explain…</p><p>My concern is that Klaus Schwab’s reset agenda is impossible to enforce in a permanent way unless the human population is greatly reduced over a short period of time (a generation or two). Globalists are constantly talking about population control and reduction. Elites like Bill Gates are famous for it. Is it any wonder that they would devise a plan to institute it?</p><p>What if, as many experts have suggested, the vaccine side effects create this condition of a diminishing population? What if they are meant to? We will not know for certain for a couple of years at least as autoimmune disorders and infertility take time to become visible in a population. The average timeline for actually diagnosing an autoimmune disorder is 4.5 years. Infertility can take six months to a year to diagnose.</p><p>If a large population of millions of people remain unvaccinated after the next couple of years, <b>then they will represent a sizable and undeniable control group.</b> A control group is a group of subjects that act as a pure sample untouched by a drug or vaccine experiment. If the vaccinated group becomes ill or dies from specific conditions and the control group does not have those same conditions, then that is a pretty good sign that your vaccine or drug is poison.</p><p>The 50{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6} of Americans and smaller percentages in other nations are a control group for the experimental vaccines. If something goes wrong with the vaccines, then we will be the proof. I suspect this is what the elites are really afraid of.</p></blockquote><p>Be the proof. Be the truth. Stay strong and testify. And don’t submit to sterilization.</p></div>",
  "content_text": "Brandon Smith at Zerohedge suspects the evil globalists already know what the long-term adverse effects of the Covid not-vaccines will be, which is why they are pushing so hard to eliminate any sizable control group that will make it clear precisely whom is responsible:\nWhat if the elites know exactly what the side effects will be? What if the vaccines are a pivotal part of their “Great Reset?”\nThe infertility question in particular is drawing the most fire from the establishment, and I would point out a particularly insidious narrative being implanted in the media. Whenever people question the chance of sterility caused by the vaccines, bureaucrats and media talking heads go on the attack, and then say “There’s no evidence that the vaccines cause infertility, but Covid-19 might cause it…” Just watch this recent speech by the governor of Arkansas where he and his medical flunky were almost run from the podium by an angry audience for peddling the same propaganda:\nAnd there you have it. The stage is being set, in my view, for a mass infertility event, and covid will be blamed in place of the experimental vaccines. This is why the establishment needs a 100{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6} vaccination rate; unvaccinated people would stand as evidence of their crime. Let me explain…\nMy concern is that Klaus Schwab’s reset agenda is impossible to enforce in a permanent way unless the human population is greatly reduced over a short period of time (a generation or two). Globalists are constantly talking about population control and reduction. Elites like Bill Gates are famous for it. Is it any wonder that they would devise a plan to institute it?\nWhat if, as many experts have suggested, the vaccine side effects create this condition of a diminishing population? What if they are meant to? We will not know for certain for a couple of years at least as autoimmune disorders and infertility take time to become visible in a population. The average timeline for actually diagnosing an autoimmune disorder is 4.5 years. Infertility can take six months to a year to diagnose.\nIf a large population of millions of people remain unvaccinated after the next couple of years,\nthen they will represent a sizable and undeniable control group.\nA control group is a group of subjects that act as a pure sample untouched by a drug or vaccine experiment. If the vaccinated group becomes ill or dies from specific conditions and the control group does not have those same conditions, then that is a pretty good sign that your vaccine or drug is poison.\nThe 50{cc08d85cfa54367952ab9c6bd910a003a6c2c0c101231e44cdffb103f39b73a6} of Americans and smaller percentages in other nations are a control group for the experimental vaccines. If something goes wrong with the vaccines, then we will be the proof. I suspect this is what the elites are really afraid of.\nBe the proof. Be the truth. Stay strong and testify. And don’t submit to sterilization.",
  "tags": [
    "globalism"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-08-01T23:45:50+00:00"
}