{
  "url": "https://voxday.net/2022/10/04/a-belated-peace/",
  "scraped_at": "2026-01-08T13:33:30.615585",
  "title": "A Belated Peace",
  "date_display": "October 4, 2022",
  "date_iso": "2022-10-04T22:05:17+00:00",
  "date_from_url": "2022-10-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Japan wants to end its long-standing war with Russia. But it doesn’t appear that Russia is interested now.</p><p><strong>ITEM: </strong><em>Tokyo, 3 October. </em>The Japanese government will continue to adhere to the course aimed at concluding a peace treaty with Russia, despite the deterioration of bilateral relations, said Prime Minister Fumio Kishida in a keynote address at the opening of the extraordinary parliamentary session. Relationships between Russia and Japan has been overshadowed by the absence of a peace treaty for many years, which countries have not signed after World War II.</p><p><strong>ITEM:</strong> <em>Moscow, 3 October.</em> Dmitry Peskov, Press Secretary for President Putin, ruled out the possibility of negotiations on a peace treaty with Japan. “Of course, in such conditions, negotiating a peace treaty is not possible,” Peskov told reporters. He added that Japan took a place among other Western countries and itself turned into an unfriendly country for Russia, which does not allow for negotiations.</p><p>So it doesn’t appear that Russia is going to be inclined to overlook the behavior of all of the unfriendly countries who stood with Ukraine in the future. But that’s not the interesting question here. That is: why Japan is so concerned about belatedly making peace with Russia at this particular moment in time?</p><p><em><a href=\"https://social.infogalactic.com/micropost/23fe3dc6-81d4-4742-94aa-eb314c84e65e\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Japan wants to end its long-standing war with Russia. But it doesn’t appear that Russia is interested now.\nITEM:\nTokyo, 3 October.\nThe Japanese government will continue to adhere to the course aimed at concluding a peace treaty with Russia, despite the deterioration of bilateral relations, said Prime Minister Fumio Kishida in a keynote address at the opening of the extraordinary parliamentary session. Relationships between Russia and Japan has been overshadowed by the absence of a peace treaty for many years, which countries have not signed after World War II.\nITEM:\nMoscow, 3 October.\nDmitry Peskov, Press Secretary for President Putin, ruled out the possibility of negotiations on a peace treaty with Japan. “Of course, in such conditions, negotiating a peace treaty is not possible,” Peskov told reporters. He added that Japan took a place among other Western countries and itself turned into an unfriendly country for Russia, which does not allow for negotiations.\nSo it doesn’t appear that Russia is going to be inclined to overlook the behavior of all of the unfriendly countries who stood with Ukraine in the future. But that’s not the interesting question here. That is: why Japan is so concerned about belatedly making peace with Russia at this particular moment in time?\nDISCUSS ON SG",
  "tags": [
    "history",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-10-04T22:16:15+00:00"
}