{
  "url": "https://voxday.net/2022/10/03/a-hitherto-unthinkable-restraint/",
  "scraped_at": "2026-01-08T13:33:17.770868",
  "title": "A Hitherto Unthinkable Restraint",
  "date_display": "October 3, 2022",
  "date_iso": "2022-10-03T13:36:25+00:00",
  "date_from_url": "2022-10-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>But sooner or later, their amassed leverage – which is the corporate word for debt – was inevitably going to start <a href=\"https://market-ticker.org/akcs-www?post=247085\">bringing down the big banks</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Today The Fed is holding an emergency meeting under “expedited procedures.”</p><p>The actions to be considered are the discount and advance rate — in other words, interest rates.</p><p>The rumored reason is that Credit Suisse may be in trouble — specifically due to writing interest rate swaps, along with a number of other institutions which happens to include pension funds both in the UK and US, none of whom should ever be playing with levered instruments for the simple reason that leverage is everywhere and always speculative.</p><p>But of course they are because nobody has ever gone to prison for using leverage as a means to evade requiring the underlying organization to fund pensions adequately with actual money. Why that would cause both firms and governments to have to behave responsibly and we can’t have that.</p><p>This sort of act is a ridiculous violation of anything approaching fiduciary responsibility — which is a legal obligation for pension managers, not a suggestion. After all its not their money — its the pensioners’ money and they are charged with prudent management of same, which the use of leverage, especially leverage on a trend 40 years old that cannot reasonably go below zero, is the exact opposite of “prudent.”</p><p>Of course the same is true for banks; they have fiduciary responsibilities too, including to the nation as a whole since they have a backstop through the government for depositors. Nobody went to prison last time in 2008 for this crap either, did they?</p><p>Never mind that exiting those positions (including at a loss) was clearly prudent in the two years after the US government along with everyone else threw trillions in printed credit into the economy as a result of the pandemic. Anyone with two IQ points to rub together had to expect that to reflect back into inflation and thus higher rates, never mind that its insane to expect that time has no value which is what a “zero rate” policy claims.</p><p>Now add to it that the economic report from Friday showed higher core inflation than The Fed and everyone else expected — not lower. In other words the bad news continued, and therefore the only logical “emergency” act is to withdraw even more credit from the system.</p></blockquote><p>The Fed refused to take the bitter medicine that was necessary back in 2008. They bought a lot more time than I would have imagined by kicking the can down the road, and the Covid lockdowns and “emergency spending measures” appear to have given them an additional two years. But now it’s October, historically a month when the debt chickens come home to roost, and two of the world’s biggest banks, Credit Suisse and Deutsche Bank, have managed to get themselves in seriously deep trouble again, <em>because no one ever stops doing what they’re doing when you prevent them from suffering the consequences of their actions.</em></p><p>While both giant banks are too big to be permitted to fail without significant ramifications through their host countries and the demi-global financial system – which now requires the prefix since the BRICSIA nations have their own system – and both are national flagships, the recent destruction of the energy pipelines suggests the hitherto unthinkable possibility that the Fed might not only be willing to let the banks fail, but perhaps even order the Swiss and German governments to refrain from bailing them out in the interest of furthering the Great Reset.</p><p>And both current governments are sufficiently corrupt, and sufficiently ignorant of economics, that they might well accept destructive direction from Washington DC on the subject. The fact that the only member of the Swiss Federal Council who has any grasp of economic matters just resigned last week might even be a sign that an unprecedented action – or rather, lack of action – may be in the offing.</p><p>This suggests that the next big economics battle will be the nationalization of banks and money vs centralized demi-global banking and a single digital currency for the former West.</p><p><em><a href=\"https://social.infogalactic.com/micropost/101a927b-42d0-4c90-8499-9309a364adb3\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "But sooner or later, their amassed leverage – which is the corporate word for debt – was inevitably going to start\nbringing down the big banks\n.\nToday The Fed is holding an emergency meeting under “expedited procedures.”\nThe actions to be considered are the discount and advance rate — in other words, interest rates.\nThe rumored reason is that Credit Suisse may be in trouble — specifically due to writing interest rate swaps, along with a number of other institutions which happens to include pension funds both in the UK and US, none of whom should ever be playing with levered instruments for the simple reason that leverage is everywhere and always speculative.\nBut of course they are because nobody has ever gone to prison for using leverage as a means to evade requiring the underlying organization to fund pensions adequately with actual money. Why that would cause both firms and governments to have to behave responsibly and we can’t have that.\nThis sort of act is a ridiculous violation of anything approaching fiduciary responsibility — which is a legal obligation for pension managers, not a suggestion. After all its not their money — its the pensioners’ money and they are charged with prudent management of same, which the use of leverage, especially leverage on a trend 40 years old that cannot reasonably go below zero, is the exact opposite of “prudent.”\nOf course the same is true for banks; they have fiduciary responsibilities too, including to the nation as a whole since they have a backstop through the government for depositors. Nobody went to prison last time in 2008 for this crap either, did they?\nNever mind that exiting those positions (including at a loss) was clearly prudent in the two years after the US government along with everyone else threw trillions in printed credit into the economy as a result of the pandemic. Anyone with two IQ points to rub together had to expect that to reflect back into inflation and thus higher rates, never mind that its insane to expect that time has no value which is what a “zero rate” policy claims.\nNow add to it that the economic report from Friday showed higher core inflation than The Fed and everyone else expected — not lower. In other words the bad news continued, and therefore the only logical “emergency” act is to withdraw even more credit from the system.\nThe Fed refused to take the bitter medicine that was necessary back in 2008. They bought a lot more time than I would have imagined by kicking the can down the road, and the Covid lockdowns and “emergency spending measures” appear to have given them an additional two years. But now it’s October, historically a month when the debt chickens come home to roost, and two of the world’s biggest banks, Credit Suisse and Deutsche Bank, have managed to get themselves in seriously deep trouble again,\nbecause no one ever stops doing what they’re doing when you prevent them from suffering the consequences of their actions.\nWhile both giant banks are too big to be permitted to fail without significant ramifications through their host countries and the demi-global financial system – which now requires the prefix since the BRICSIA nations have their own system – and both are national flagships, the recent destruction of the energy pipelines suggests the hitherto unthinkable possibility that the Fed might not only be willing to let the banks fail, but perhaps even order the Swiss and German governments to refrain from bailing them out in the interest of furthering the Great Reset.\nAnd both current governments are sufficiently corrupt, and sufficiently ignorant of economics, that they might well accept destructive direction from Washington DC on the subject. The fact that the only member of the Swiss Federal Council who has any grasp of economic matters just resigned last week might even be a sign that an unprecedented action – or rather, lack of action – may be in the offing.\nThis suggests that the next big economics battle will be the nationalization of banks and money vs centralized demi-global banking and a single digital currency for the former West.\nDISCUSS ON SG",
  "tags": [
    "banks",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-10-03T13:36:27+00:00"
}