{
  "url": "https://voxday.net/2022/10/05/a-vast-and-silent-emptiness/",
  "scraped_at": "2026-01-08T13:33:37.935858",
  "title": "A Vast and Silent Emptiness",
  "date_display": "October 5, 2022",
  "date_iso": "2022-10-05T16:57:08+00:00",
  "date_from_url": "2022-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One tends to imagine a vast, wind-swept emptiness devoid of sound in the place of a rich interior monologue. <a href=\"https://gab.com/Kollins/posts/109116283348756213\">This was posted</a> in response to the NPC Rhetoric meme seen below.</p><p><strong>VD: </strong>This is what a dialectical meme looks like. It’s utterly ineffective as a meme – it will probably mystify most – and yet it expresses a dialectically vital concept in rhetorical terms.</p><p><strong>Kollins: </strong><em>It doesn’t appear to be dialectic at all and it would never go viral, so it’s not actually a meme. (WTF Webster’s online dictionary defines dialectical as “of, relating to, or in accordance with dialectic” which is about as useful as , “falling: of or related to a fall.”) It doesn’t convey a useful message, it isn’t catchy enough to spread and it appears as if you went full Karine Jean-Claude with that word salad of useless big words for the sake of sounding intellectual.</em></p><p><strong>VD: </strong>You’re literally retarded. I am referring – obviously – to Aristotelian dialectic, as opposed to Hegelian or Maxian dialectic, and a meme does not need to go viral in order to be a meme. What part of “highly ineffective” was hard for you to understand? It would probably be a good idea for you to refrain from ever reading anything I write or post. It will be lost on you.</p><p><em><a href=\"https://social.infogalactic.com/micropost/5ad800f3-bf62-4acb-b213-926b4dc3e826\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "One tends to imagine a vast, wind-swept emptiness devoid of sound in the place of a rich interior monologue.\nThis was posted\nin response to the NPC Rhetoric meme seen below.\nVD:\nThis is what a dialectical meme looks like. It’s utterly ineffective as a meme – it will probably mystify most – and yet it expresses a dialectically vital concept in rhetorical terms.\nKollins:\nIt doesn’t appear to be dialectic at all and it would never go viral, so it’s not actually a meme. (WTF Webster’s online dictionary defines dialectical as “of, relating to, or in accordance with dialectic” which is about as useful as , “falling: of or related to a fall.”) It doesn’t convey a useful message, it isn’t catchy enough to spread and it appears as if you went full Karine Jean-Claude with that word salad of useless big words for the sake of sounding intellectual.\nVD:\nYou’re literally retarded. I am referring – obviously – to Aristotelian dialectic, as opposed to Hegelian or Maxian dialectic, and a meme does not need to go viral in order to be a meme. What part of “highly ineffective” was hard for you to understand? It would probably be a good idea for you to refrain from ever reading anything I write or post. It will be lost on you.\nDISCUSS ON SG",
  "tags": [
    "anklebiters",
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-10-05T16:57:11+00:00"
}