{
  "url": "https://voxday.net/2022/10/21/newsmax-is-promethean/",
  "scraped_at": "2026-01-08T13:35:10.436236",
  "title": "Newsmax is Promethean",
  "date_display": "October 21, 2022",
  "date_iso": "2022-10-21T10:58:41+00:00",
  "date_from_url": "2022-10-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve never believed, despite all their conservative pretensions, that Newsmax was on the side of the Good, the Beautiful, and the True, even before I had a very negative experience with their mediocre internet advertising service many years ago. But <a href=\"https://www.mediaite.com/news/newsmax-tv-severs-ties-with-lara-logan-after-she-says-world-leaders-dine-on-the-blood-of-children/\">their decision to jettison Lara Logan</a> for her forthright Christian denouncement of the global satanists clearly indicates in whose service they labor.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Newsmax TV has severed ties with Lara Logan after she said on the network the global elite “dine on the blood of children” and made other bizarre statements.</p><p>Logan interviewed with network host Eric Bolling Wednesday on The Balance about global elites and their embrace of socialism. She responded she is a “firm and solid and immovable believer in God.” She added those controlling the levers of power “want us eating insects,” and implied they “dine on the blood of children.”</p><p>The network issued a statement to the Daily Beast Thursday night.</p><p>“Newsmax condemns in the strongest terms the reprehensible statements made by Lara Logan and her views do not reflect our network,” someone from the network said. “We have no plans to interview her again.”</p><p>In her interview with Bolling, he asked her about her faith in connection to the country’s southern border.</p><p>She said:</p><p><em>God believes in sovereignty, and national identity, and the sanctity of family, and all the things that we’ve lived with from the beginning of time. And he knows that the open border is Satan’s way of taking control of the world through all of these people who are his stooges and his and his servants.</em></p><p><em>And they may think that they’re going to become gods. That’s what they tell us. you’ve all known [historian Yuval Noah] Harari and all the rest of them at the World Economic Forum. You know, the ones who want us eating insects, cockroaches, and that while they dine on the blood of children? Those are the people, right? They’re not gonna win. They’re not going to win.</em></p></blockquote><p>Lara Logan knows what she’s talking about, as an elite reporter in the ABCNNBCBS medial cabal. And if there is one thing global satanists cannot bear besides the Name of Jesus Christ of Nazareth, it is an open denunciation of their wicked practices. Observe the way in which Newsmax’s statement makes it perfectly clear, “in the strongest terms”, that they not only endorse both the evil practices and their practitioners, but are willing to defend them.</p><p>The line between Good and Evil are becoming more clear every day. The time for being lukewarm and attempting to sit on the fence is over. And be aware that some of those you formerly believed were good guys who were more or less on your side are not.</p><p>And speaking of Prometheans, be very wary of what appears to be <a href=\"https://www.thedailybeast.com/magas-new-shock-jock-is-a-bounty-hunter-with-a-troubled-past\">a newly-anointed gatekeeper, Stew Peters</a>. Yes, it’s another <em>Daily Beast</em> hit piece, but as a rule, the faster they blow up, the more likely it is that they are manufactured personas. And in the aftermath of the Jordan Peterson Experience, we know that faux attacks are integral to elevating the profile of the appointed gatekeepers.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>This year, Peters emerged from obscurity as the face of “Red Voice Media,” an online video company based around promoting professionally produced “The Stew Peters Show.” The Minneapolis Star-Tribune dubbed him “​​Minnesota’s best-known bounty hunter.” Peters quickly became a leading voice on the far-right, especially after his early October attacks on Jordan.</p></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/da4df067-db76-437c-8633-00ee0b959554\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I’ve never believed, despite all their conservative pretensions, that Newsmax was on the side of the Good, the Beautiful, and the True, even before I had a very negative experience with their mediocre internet advertising service many years ago. But\ntheir decision to jettison Lara Logan\nfor her forthright Christian denouncement of the global satanists clearly indicates in whose service they labor.\nNewsmax TV has severed ties with Lara Logan after she said on the network the global elite “dine on the blood of children” and made other bizarre statements.\nLogan interviewed with network host Eric Bolling Wednesday on The Balance about global elites and their embrace of socialism. She responded she is a “firm and solid and immovable believer in God.” She added those controlling the levers of power “want us eating insects,” and implied they “dine on the blood of children.”\nThe network issued a statement to the Daily Beast Thursday night.\n“Newsmax condemns in the strongest terms the reprehensible statements made by Lara Logan and her views do not reflect our network,” someone from the network said. “We have no plans to interview her again.”\nIn her interview with Bolling, he asked her about her faith in connection to the country’s southern border.\nShe said:\nGod believes in sovereignty, and national identity, and the sanctity of family, and all the things that we’ve lived with from the beginning of time. And he knows that the open border is Satan’s way of taking control of the world through all of these people who are his stooges and his and his servants.\nAnd they may think that they’re going to become gods. That’s what they tell us. you’ve all known [historian Yuval Noah] Harari and all the rest of them at the World Economic Forum. You know, the ones who want us eating insects, cockroaches, and that while they dine on the blood of children? Those are the people, right? They’re not gonna win. They’re not going to win.\nLara Logan knows what she’s talking about, as an elite reporter in the ABCNNBCBS medial cabal. And if there is one thing global satanists cannot bear besides the Name of Jesus Christ of Nazareth, it is an open denunciation of their wicked practices. Observe the way in which Newsmax’s statement makes it perfectly clear, “in the strongest terms”, that they not only endorse both the evil practices and their practitioners, but are willing to defend them.\nThe line between Good and Evil are becoming more clear every day. The time for being lukewarm and attempting to sit on the fence is over. And be aware that some of those you formerly believed were good guys who were more or less on your side are not.\nAnd speaking of Prometheans, be very wary of what appears to be\na newly-anointed gatekeeper, Stew Peters\n. Yes, it’s another\nDaily Beast\nhit piece, but as a rule, the faster they blow up, the more likely it is that they are manufactured personas. And in the aftermath of the Jordan Peterson Experience, we know that faux attacks are integral to elevating the profile of the appointed gatekeepers.\nThis year, Peters emerged from obscurity as the face of “Red Voice Media,” an online video company based around promoting professionally produced “The Stew Peters Show.” The Minneapolis Star-Tribune dubbed him “​​Minnesota’s best-known bounty hunter.” Peters quickly became a leading voice on the far-right, especially after his early October attacks on Jordan.\nDISCUSS ON SG",
  "tags": [
    "Christianity",
    "globalism",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-10-21T11:07:33+00:00"
}