{
  "url": "https://voxday.net/2022/10/13/rebels-run-update-3/",
  "scraped_at": "2026-01-08T13:34:21.362237",
  "title": "Rebel’s Run Update",
  "date_display": "October 13, 2022",
  "date_iso": "2022-10-13T10:16:55+00:00",
  "date_from_url": "2022-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While I discussed this on the Darkstream in considerable detail last night, I think a short summary posted here for the benefit of those who aren’t UATV subscribers would be a good idea.</p><ul class=\"wp-block-list\"><li>The escrow company holding the $1 million security for the $4 million loan turned out to be a scam. The money was stolen and used to purchase medical gear for resale as part of what appears to be a massive Ponzi scheme the day it was sent from the VFM film company’s account.</li><li>VFM’s lawyers did their due diligence correctly, and on that basis refused to sign the final contract or to approve the security deposit without certain contingencies being met. However, the producer who originally initiated the project transferred the money to the fake escrow account despite the contract being unsigned and the contingencies being unmet.</li><li>Despite requests to return the security deposit as per the contract, and various “proofs” being provided that to show the money would be/had been returned, the security deposit was not returned to VFM.</li><li>VFM’s lawyers have been in contact with special agents from the FBI and cooperating with their investigations for the last two years. This is why no one has been able to say anything about the state of the project until now.</li><li>The man alleged to be primarily responsible for the false escrow company <a href=\"https://www.justice.gov/usao-ut/pr/spanish-fork-man-and-his-two-businesses-charged-wire-fraud-and-money-laundering-offenses\">has been arrested and charged</a> with seven felony counts of wire fraud and money laundering stemming from this and several other scams. Two Assistant United States Attorneys are prosecuting the case in Federal District court and special agents from the FBI are conducting the investigation.</li><li>FBI and <a href=\"https://www.sec.gov/litigation/litreleases/2022/lr25537.htm\">SEC investigations</a> of other individuals and organizations known to have been connected in some way to the financial structure of the Rebel’s Run project are proceeding. I will not comment on the possible fate of others who appear to have been involved in the scheme, except to say that it would not be a surprise if the first arrest does not turn out to be the last one.</li><li>The script for the movie written by myself and Chuck Dixon is complete and was approved for shooting by the director and the film company.</li><li>There is a legitimate possibility that part or all of the security deposit will be returned eventually, but now that the indictment has been made, restitution will not be discussed until the sentencing phase is reached.</li><li>The VFM partners are putting together a plan for making a different and less-expensive movie that will not require any additional financing from outside the community if the consensus is to continue moving forward on that front, regardless of whether restitution is made or not.</li></ul><p>For more details, please watch <em>Report on Rebel’s Run</em> on UATV. If you have any questions about what happened, how it happened, or what our future plans are, <a href=\"https://social.infogalactic.com/micropost/ccfd2dd0-5b02-4955-962e-9b136562fe1b\">please ask them on SG</a>.</p></div>",
  "content_text": "While I discussed this on the Darkstream in considerable detail last night, I think a short summary posted here for the benefit of those who aren’t UATV subscribers would be a good idea.\nThe escrow company holding the $1 million security for the $4 million loan turned out to be a scam. The money was stolen and used to purchase medical gear for resale as part of what appears to be a massive Ponzi scheme the day it was sent from the VFM film company’s account.\nVFM’s lawyers did their due diligence correctly, and on that basis refused to sign the final contract or to approve the security deposit without certain contingencies being met. However, the producer who originally initiated the project transferred the money to the fake escrow account despite the contract being unsigned and the contingencies being unmet.\nDespite requests to return the security deposit as per the contract, and various “proofs” being provided that to show the money would be/had been returned, the security deposit was not returned to VFM.\nVFM’s lawyers have been in contact with special agents from the FBI and cooperating with their investigations for the last two years. This is why no one has been able to say anything about the state of the project until now.\nThe man alleged to be primarily responsible for the false escrow company\nhas been arrested and charged\nwith seven felony counts of wire fraud and money laundering stemming from this and several other scams. Two Assistant United States Attorneys are prosecuting the case in Federal District court and special agents from the FBI are conducting the investigation.\nFBI and\nSEC investigations\nof other individuals and organizations known to have been connected in some way to the financial structure of the Rebel’s Run project are proceeding. I will not comment on the possible fate of others who appear to have been involved in the scheme, except to say that it would not be a surprise if the first arrest does not turn out to be the last one.\nThe script for the movie written by myself and Chuck Dixon is complete and was approved for shooting by the director and the film company.\nThere is a legitimate possibility that part or all of the security deposit will be returned eventually, but now that the indictment has been made, restitution will not be discussed until the sentencing phase is reached.\nThe VFM partners are putting together a plan for making a different and less-expensive movie that will not require any additional financing from outside the community if the consensus is to continue moving forward on that front, regardless of whether restitution is made or not.\nFor more details, please watch\nReport on Rebel’s Run\non UATV. If you have any questions about what happened, how it happened, or what our future plans are,\nplease ask them on SG\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2022-10-13T10:45:48+00:00"
}