{
  "url": "https://voxday.net/2022/10/08/russia-blows-up-bridge-to-crimea/",
  "scraped_at": "2026-01-08T13:33:53.776208",
  "title": "Russia Blows Up Bridge to Crimea",
  "date_display": "October 8, 2022",
  "date_iso": "2022-10-08T09:09:08+00:00",
  "date_from_url": "2022-10-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Just like they blew up their own pipeline to Germany, shelled the nuclear reactor under their control, and assassinated the daughter of Alexandre Dugin. Which is to say, <a href=\"https://www.dailymail.co.uk/news/breaking_news/article-11293851/Massive-explosion-destroys-key-bridge-linking-Crimea-Putins-Russia.html\">the Russians didn’t do it</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>A crucial bridge linking Russia and Ukraine has exploded in a suspected attack by Ukrainian saboteurs this morning, just hours after Vladimir Putin’s birthday.</p><p>Videos show the explosion rocking the Kerch Bridge linking the peninsula with the Russian mainland. The attack could cut supplies to Putin’s forces as Ukraine makes more advances in the south towards Kherson.</p><p>A section of the bridge has collapsed into the sea and a train caught fire in the blast. Long fuel lines are already forming in Crimea, despite Russian claims to have enough supplies to last two weeks.</p><p>Although Kyiv has not claimed responsibility for the attack, one Ukrainian official boasted that ‘Putin should be happy. Not everyone gets such an expensive birthday present’ – a reference to the Russian president’s 70th birthday yesterday.</p><p>It is unclear if a suicide bombing caused the blast, but there have been no reports of incoming missiles. Some witnesses claimed there were two explosions .</p></blockquote><p>Regardless of who <a href=\"https://t.me/kommersant/40806\">blew up the bridge</a> and how – and I would guess it was more likely underwater sabotage by a second US Navy SEAL team than the assumed suicide truck bomber – Russia has been doing an awful lot of not-responding of late. The Russian people are starting to get angry about all the not-responding. This makes me conclude that whatever the Russians are planning, it’s probably going to be something even bigger than the February surprise of the special military operation, because this was a direct attack on Russia.</p><p><strong>UPDATE:</strong> <em>Footage of the explosion which destroyed the only bridge between Russia and Crimea shows a mysterious ‘wave’ just before the blast – leading to speculation a drone packed with explosives or a boat could have been the cause.</em></p><p>Quelle surprise…</p><p><em><a href=\"https://social.infogalactic.com/micropost/0e76a822-5436-4752-9ffd-1e4393fc1c8c\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Just like they blew up their own pipeline to Germany, shelled the nuclear reactor under their control, and assassinated the daughter of Alexandre Dugin. Which is to say,\nthe Russians didn’t do it\n.\nA crucial bridge linking Russia and Ukraine has exploded in a suspected attack by Ukrainian saboteurs this morning, just hours after Vladimir Putin’s birthday.\nVideos show the explosion rocking the Kerch Bridge linking the peninsula with the Russian mainland. The attack could cut supplies to Putin’s forces as Ukraine makes more advances in the south towards Kherson.\nA section of the bridge has collapsed into the sea and a train caught fire in the blast. Long fuel lines are already forming in Crimea, despite Russian claims to have enough supplies to last two weeks.\nAlthough Kyiv has not claimed responsibility for the attack, one Ukrainian official boasted that ‘Putin should be happy. Not everyone gets such an expensive birthday present’ – a reference to the Russian president’s 70th birthday yesterday.\nIt is unclear if a suicide bombing caused the blast, but there have been no reports of incoming missiles. Some witnesses claimed there were two explosions .\nRegardless of who\nblew up the bridge\nand how – and I would guess it was more likely underwater sabotage by a second US Navy SEAL team than the assumed suicide truck bomber – Russia has been doing an awful lot of not-responding of late. The Russian people are starting to get angry about all the not-responding. This makes me conclude that whatever the Russians are planning, it’s probably going to be something even bigger than the February surprise of the special military operation, because this was a direct attack on Russia.\nUPDATE:\nFootage of the explosion which destroyed the only bridge between Russia and Crimea shows a mysterious ‘wave’ just before the blast – leading to speculation a drone packed with explosives or a boat could have been the cause.\nQuelle surprise…\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-10-08T14:25:18+00:00"
}