{
  "url": "https://voxday.net/2022/10/01/the-gammas-in-the-manger/",
  "scraped_at": "2026-01-08T13:33:06.105441",
  "title": "The Gammas in the Manger",
  "date_display": "October 1, 2022",
  "date_iso": "2022-10-01T14:29:31+00:00",
  "date_from_url": "2022-10-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yesterday, <a href=\"https://gab.com/voxday/posts/109087385453605853\">I posted the following</a> to Gab, to mark a significant milestone there. While SocialGalactic is, and will remain, my primary social media platform, Gab has become an increasingly effective way to reach those who are outside the community.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>It’s official. I now have more followers – 34k – on #GAB than I did on Twitter – 33k – when my account was permanently “suspended” there without any reason being given or anything controversial being tweeted. Thanks very much to @a for persevering through tremendous obstacles to provide everyone with this sound alternative platform.</p></blockquote><p>That’s a really big deal, not for me, but for the alternative platform. It serves as proof that for public figures, Gab is now a viable and credible alternative to Twitter. One of the primary challenges of any social media platform is to provide a compelling reason for people to join it, and one of the biggest attractions for users is the ability to follow the regular postings of the public figures they like and admire.</p><p>And as with the Wikipedia/Infogalactic situation, it’s very frustrating for those who go to the effort to provide alternatives to the mainstream platforms to observe how a) most public figures simply will not support the alternatives unless they are literally kicked off the mainstream platform, b) the vast majority of people would rather use a free platform that farms their data on behalf of globalists who hate them and want to see them dead than pay a very small amount to use a platform that is in accordance with their faith and society, and c) most people would rather cry about being deprived access to the mainstream platforms than make effective use of the alternatives.</p><p>So, this particular milestone is significant for Gab, because it proves that at least for minor public figures, there is no material advantage to being on Twitter any longer. Most people appeared to recognize this, as the post was liked by more than two thousand users, and yet, it still managed to trigger the Gammas of Gab, as the following comments demonstrate.</p><ul class=\"wp-block-list\"><li><strong>Space Bear: </strong>Also notice how he thanks @a but not to his followers. very telling. I am going to assume (rightfully or wrongly) that it is a tel of narcissism.</li><li><strong>Travis Hancock:</strong> And still, I don’t know what/what you are. Don’t care…..</li><li><strong>Alex Pazzo: </strong>wow you are so much better than other people with fewer followers. SIMP</li><li><strong>BrotherStephen444:</strong> Don’t like you, don’t care for you in the slightest, but, real freedom of speech allows you to succeed in you vainglorious attempt to prove to the world that there are some who actually want to listen to you. Good job, and I am sincere about that. I am also sincere when I tell you to crawl back under the rock you came out from under from.</li><li><strong>m249saw2004:</strong> gross. You equate your social media to actual achievement.</li><li><strong>ForeverLawless:</strong> Yet u only follow 43 people back</li><li><strong>Theycensoredme:</strong> You must be a shill…</li><li><strong>Mythbuster:</strong> Who cares about the number of followers? Get rid of your ego</li><li><strong>Ozymandias, King of King:</strong> It seems important to you, but why?</li><li><strong>Gerald VonGustav:</strong> Holy shit, you’re still grifting here? I for sure thought you would be completely irrelevant for everyone by now.</li><li><strong>SHELLSHOCK_1986:</strong> nice followbots gayboy</li><li><strong>7SEAL7:</strong> Says a person who only follows back less than 50 people. Numbers mean nothing. People should unfollow number Nazis</li><li><strong>Up A Damn Mountain:</strong> Yeah…but everyone knows there aren’t 34k actual human beings that use Gab actively, so is it REALLY that much of an accomplishment?</li></ul><p><em><a href=\"https://social.infogalactic.com/micropost/86039548-a2c4-4628-acde-48107f1e6258\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Yesterday,\nI posted the following\nto Gab, to mark a significant milestone there. While SocialGalactic is, and will remain, my primary social media platform, Gab has become an increasingly effective way to reach those who are outside the community.\nIt’s official. I now have more followers – 34k – on #GAB than I did on Twitter – 33k – when my account was permanently “suspended” there without any reason being given or anything controversial being tweeted. Thanks very much to @a for persevering through tremendous obstacles to provide everyone with this sound alternative platform.\nThat’s a really big deal, not for me, but for the alternative platform. It serves as proof that for public figures, Gab is now a viable and credible alternative to Twitter. One of the primary challenges of any social media platform is to provide a compelling reason for people to join it, and one of the biggest attractions for users is the ability to follow the regular postings of the public figures they like and admire.\nAnd as with the Wikipedia/Infogalactic situation, it’s very frustrating for those who go to the effort to provide alternatives to the mainstream platforms to observe how a) most public figures simply will not support the alternatives unless they are literally kicked off the mainstream platform, b) the vast majority of people would rather use a free platform that farms their data on behalf of globalists who hate them and want to see them dead than pay a very small amount to use a platform that is in accordance with their faith and society, and c) most people would rather cry about being deprived access to the mainstream platforms than make effective use of the alternatives.\nSo, this particular milestone is significant for Gab, because it proves that at least for minor public figures, there is no material advantage to being on Twitter any longer. Most people appeared to recognize this, as the post was liked by more than two thousand users, and yet, it still managed to trigger the Gammas of Gab, as the following comments demonstrate.\nSpace Bear:\nAlso notice how he thanks @a but not to his followers. very telling. I am going to assume (rightfully or wrongly) that it is a tel of narcissism.\nTravis Hancock:\nAnd still, I don’t know what/what you are. Don’t care…..\nAlex Pazzo:\nwow you are so much better than other people with fewer followers. SIMP\nBrotherStephen444:\nDon’t like you, don’t care for you in the slightest, but, real freedom of speech allows you to succeed in you vainglorious attempt to prove to the world that there are some who actually want to listen to you. Good job, and I am sincere about that. I am also sincere when I tell you to crawl back under the rock you came out from under from.\nm249saw2004:\ngross. You equate your social media to actual achievement.\nForeverLawless:\nYet u only follow 43 people back\nTheycensoredme:\nYou must be a shill…\nMythbuster:\nWho cares about the number of followers? Get rid of your ego\nOzymandias, King of King:\nIt seems important to you, but why?\nGerald VonGustav:\nHoly shit, you’re still grifting here? I for sure thought you would be completely irrelevant for everyone by now.\nSHELLSHOCK_1986:\nnice followbots gayboy\n7SEAL7:\nSays a person who only follows back less than 50 people. Numbers mean nothing. People should unfollow number Nazis\nUp A Damn Mountain:\nYeah…but everyone knows there aren’t 34k actual human beings that use Gab actively, so is it REALLY that much of an accomplishment?\nDISCUSS ON SG",
  "tags": [
    "#AltTech",
    "Gamma",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-10-01T14:29:34+00:00"
}