{
  "url": "https://voxday.net/2022/10/27/the-self-immolation-of-jordan-peterson/",
  "scraped_at": "2026-01-08T13:35:45.706782",
  "title": "The Self-Immolation of Jordan Peterson",
  "date_display": "October 27, 2022",
  "date_iso": "2022-10-27T10:06:48+00:00",
  "date_from_url": "2022-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>He really is the gift to humanity that keeps on giving. Did I not tell you he was quite literally crazy? Did I not observe that he was the product of multigenerational sexual abuse? And was the cover of <em>Jordanetics </em>not eerily prescient? Jordan Peterson’s inept excursion into poetry is simultaneously one of the funniest – and one of the saddest – things we will ever have the good fortune to witness in our lives.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Hello everyone! I’d like to tell you very briefly about my new book. It’s called <em>An ABC of Childhood Tragedy</em>. It’s illustrated and designed by Juliette Foger who’s the illustrator, who managed the illustrations for my last book, <em>Beyond Order</em>, published by Libra Press. It’s coming out mid-October, right now, it’s coming out just in a few days.</p><p>I wrote these poems, it’s 26 poems, one for each letter of the alphabet. I wrote these poems when I was doing a lot of clinical work and seeing the sorts of terrible things that happened within people’s families, and I suppose in some sense it was an attempt to blow off some steam. The book itself and the project is an attempt to investigate the Nexus, let’s say, of beauty and tragedy and humor, a strange triad, and maybe I’ll read you a couple of the alphabet poems so you get some sense of what you’re in for if you dare to buy the book. It’s pretty rough so be warned.</p><p><strong>A</strong><br/>Adela, an abusive sprout<br/>Was fond of teasing little brats<br/>They finally jumped her One Fine Day<br/>And now Adela’s locked away</p><p><strong>D</strong> – this is a very rough one.<br/>Dick was a damaged little boy<br/>Who’s prancing father made him coy<br/>When he ended up in jail<br/>All competed for his tail.</p><p><strong>F</strong><br/>Frederick was sadly flawed<br/>After he was madly pawed,<br/>By his neighbor deeply awed<br/>Where the hell was Christian God</p><p>Well, so these are a bit <em>Brothers Grimm</em>-like I suppose. Pretty brutal, terribly comical, perhaps, if you have that sense of humor, very beautiful. Juliet did a wonderful job, we have some music coming out to accompany it. It’ll be quite a contentious project, to say the least, and so if you’re interested in such things, if you liked <em>A Nightmare Before Christmas</em>, if you like Edward Gorey and his <em>Victorian Catastrophes in Poetic Form</em>, then maybe you’ll like An ABC of Childhood Tragedy.</p><p>Happy Reading, folks.</p></blockquote><p>I know, you’re thinking that this has to be a parody, or some sort of cruel caricature. But, as has repeatedly proven to be the case with the Most Influential Thinker in All of Human History, reality easily exceeds even the most vicious satire. And the only thing funnier than the book itself is the hundreds of comments by Peterson fans that are actually praising his doggerel.</p><ul class=\"wp-block-list\"><li>Hundreds of years from now, humanity is going to look back and recognize this man’s brilliance and contributions to the world. Thank you Doctor Peterson.</li><li>A wonderful gift for those who dare traverse the mysteriously gothic shadows from the creative depths of Petersons mind.</li><li>Jordan, you impact my soul, you reach into my heart where all the pain lives and you help me identify and pick it out bit by bit. I’m all alone in there except I allow you in every once in a while to coach me along, keep me away from shame and guilt. Thank you for being the fatherly figure I never had and have never met.</li><li>Another gem comes out of JP’s brilliant mind. God bless the man.</li><li>this book is going to be SO very therapeutic for so many of us.</li><li>Wow! I didn’t know Jordan could also write such beautiful art!</li></ul><p>I’m not going to lie. This book is going right to the top of my Christmas list. I just hope no one sane reaches Jordan Peterson in time to stop its publication. But it is, quite literally, inspirational, as I was inspired to commit a little alphabetical doggerel of my own.</p><p><strong>J</strong></p><p>Jordan was a wicked man<br/>Who wrote bad rhymes that didn’t scan<br/>And demonstrated his obsessions<br/>With incestuous transgressions</p><p><em><a href=\"https://social.infogalactic.com/micropost/7eb0072b-ebe8-4b19-b1aa-8d62b14cf752\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "He really is the gift to humanity that keeps on giving. Did I not tell you he was quite literally crazy? Did I not observe that he was the product of multigenerational sexual abuse? And was the cover of\nJordanetics\nnot eerily prescient? Jordan Peterson’s inept excursion into poetry is simultaneously one of the funniest – and one of the saddest – things we will ever have the good fortune to witness in our lives.\nHello everyone! I’d like to tell you very briefly about my new book. It’s called\nAn ABC of Childhood Tragedy\n. It’s illustrated and designed by Juliette Foger who’s the illustrator, who managed the illustrations for my last book,\nBeyond Order\n, published by Libra Press. It’s coming out mid-October, right now, it’s coming out just in a few days.\nI wrote these poems, it’s 26 poems, one for each letter of the alphabet. I wrote these poems when I was doing a lot of clinical work and seeing the sorts of terrible things that happened within people’s families, and I suppose in some sense it was an attempt to blow off some steam. The book itself and the project is an attempt to investigate the Nexus, let’s say, of beauty and tragedy and humor, a strange triad, and maybe I’ll read you a couple of the alphabet poems so you get some sense of what you’re in for if you dare to buy the book. It’s pretty rough so be warned.\nA\nAdela, an abusive sprout\nWas fond of teasing little brats\nThey finally jumped her One Fine Day\nAnd now Adela’s locked away\nD\n– this is a very rough one.\nDick was a damaged little boy\nWho’s prancing father made him coy\nWhen he ended up in jail\nAll competed for his tail.\nF\nFrederick was sadly flawed\nAfter he was madly pawed,\nBy his neighbor deeply awed\nWhere the hell was Christian God\nWell, so these are a bit\nBrothers Grimm\n-like I suppose. Pretty brutal, terribly comical, perhaps, if you have that sense of humor, very beautiful. Juliet did a wonderful job, we have some music coming out to accompany it. It’ll be quite a contentious project, to say the least, and so if you’re interested in such things, if you liked\nA Nightmare Before Christmas\n, if you like Edward Gorey and his\nVictorian Catastrophes in Poetic Form\n, then maybe you’ll like An ABC of Childhood Tragedy.\nHappy Reading, folks.\nI know, you’re thinking that this has to be a parody, or some sort of cruel caricature. But, as has repeatedly proven to be the case with the Most Influential Thinker in All of Human History, reality easily exceeds even the most vicious satire. And the only thing funnier than the book itself is the hundreds of comments by Peterson fans that are actually praising his doggerel.\nHundreds of years from now, humanity is going to look back and recognize this man’s brilliance and contributions to the world. Thank you Doctor Peterson.\nA wonderful gift for those who dare traverse the mysteriously gothic shadows from the creative depths of Petersons mind.\nJordan, you impact my soul, you reach into my heart where all the pain lives and you help me identify and pick it out bit by bit. I’m all alone in there except I allow you in every once in a while to coach me along, keep me away from shame and guilt. Thank you for being the fatherly figure I never had and have never met.\nAnother gem comes out of JP’s brilliant mind. God bless the man.\nthis book is going to be SO very therapeutic for so many of us.\nWow! I didn’t know Jordan could also write such beautiful art!\nI’m not going to lie. This book is going right to the top of my Christmas list. I just hope no one sane reaches Jordan Peterson in time to stop its publication. But it is, quite literally, inspirational, as I was inspired to commit a little alphabetical doggerel of my own.\nJ\nJordan was a wicked man\nWho wrote bad rhymes that didn’t scan\nAnd demonstrated his obsessions\nWith incestuous transgressions\nDISCUSS ON SG",
  "tags": [
    "doggerel",
    "Jordanetics"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-10-27T10:55:41+00:00"
}