{
  "url": "https://voxday.net/2022/10/10/tolstoy-on-maupassant/",
  "scraped_at": "2026-01-08T13:34:01.136563",
  "title": "Tolstoy on Maupassant",
  "date_display": "October 10, 2022",
  "date_iso": "2022-10-10T12:58:19+00:00",
  "date_from_url": "2022-10-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m always fascinated by one great mind’s take on another, which is one reason why I chose Machiavelli’s <em>Discourses on the First Ten Books of Titus Livy</em> for the Library subscription over his more famous works. So, <a href=\"https://en.m.wikisource.org/wiki/The_Works_of_Guy_de_Maupassant\">this review of the work</a> of one of my favorite writers – Guy de Maupassant – by another of my favorite writers – Leo Tolstoy – is of particular interest to me.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The author was endowed with that particular gift, called talent, which consists in the author’s ability to direct, according to his tastes, his intensified, strained attention to this or that subject, in consequence of which the author who is endowed with this ability sees in those subjects upon which he directs his attention, something new, something which others did not see. Maupassant evidently possessed that gift of seeing in subjects something which others did not see. But, to judge from the small volume which I had read, he was devoid of the chief condition necessary, besides talent, for a truly artistic production.</p><p>Of the three conditions:</p><p><em><strong>1) </strong>a correct, that is, a moral relation of the author to the subject,<br/><strong>2)</strong> the clearness of exposition, or the beauty of form, which is the same, and<br/><strong>3)</strong> sincerity, that is, an undisguised feeling of love or hatred for what the artist describes</em></p><p>Maupassant possessed only the last two, and was entirely devoid of the first. He had no correct, that is, no moral relation to the subjects described. From what I had read, I was convinced that Maupassant possessed talent, that is, the gift of attention, which in the objects and phenomena of life revealed to him those qualities which are not visible to other men; he also possessed a beautiful form, that is, he expressed clearly, simply, and beautifully what he wished to say, and also possessed that condition of the worth of an artistic production, without which it does not produce any effect, — sincerity, — that is, he did not simulate love or hatred, but actually loved and hated what he described. But unfortunately, being devoid of the first, almost the most important condition of the worth of an artistic production, of the correct, moral relation to what he represented, that is, of the knowledge of the difference between good and evil, he loved and represented what it was not right to love and represent, and did not love and did not represent what he ought to have loved and represented. Thus the author in this little volume describes with much detail and love how women tempt men and men tempt women, and even some incomprehensible obscenities, which are represented in <em>La Femme de Paul</em>, and he describes the labouring country people, not only with indifference, but even with contempt, as so many animals.</p><p>Particularly striking was that lack of distinction between bad and good in the story <em>Une Partie de Campagne</em>, in which, in the form of a most clever and amusing jest, he gives a detailed account of how two gentlemen with bared arms, rowing in a boat, simultaneously tempted, the one an old mother, and the other a young maiden, her daughter.</p><p>The author’s sympathy is during the whole time obviously to such an extent on the side of the two rascals, that he ignores, or, rather, does not see what the tempted mother, the girl, the father, and the young man, evidently the fiance of the daughter, must have suffered, and so we not only get a shocking description of a disgusting crime in the form of an amusing jest, but the event itself is described falsely, because only the most insignificant side of the subject, the pleasure afforded to the rascals, is described.</p><p>In the same volume there is a story, <em>Histoire d’une Fille de Ferme</em>, which Turgenev recommended to me more particularly, and which more particularly displeased me on account of the author’s incorrect relation to the subject. The author apparently sees in all the working people whom he describes nothing but animals, who do not rise above sexual and maternal love, and so the description leaves us with an incomplete, artificial impression.</p><p>The insufficient comprehension of the lives and interests of the working classes, and the representation of the men from those classes in the form of half-animals, which are moved only by sensuality, malice, and greed, forms one of the chief and most important defects of the majority of the modern French authors, among them Maupassant, not only in this story, but also in all the other stories, in which he touches on the people and always describes them as coarse, dull animals, whom one can only ridicule. Of course, the French authors must know the conditions of their people better than I know them; but, although I am a Russian and have not lived with the French people, I none the less assert that, in describing their masses, the French authors are wrong, and that the French masses cannot be as they are described. If there exists a France as we know it, with her truly great men and with those great contributions which these great men have made to science, art, civil polity, and the moral perfection of humanity, those labouring masses, which have held upon their shoulders this France and her great men, do not consist of animals, but of men with great spiritual qualities; and so I do not believe what I am told in novels like <em>La Terre</em>, and in Maupassant’s stories, just as I should not believe if I were told of the existence of a beautiful house standing on no foundation. It is very possible that the high qualities of the masses are not such as are described in <em>La petit Fadette</em> and in <em>La Mare au Diable</em>, but these qualities exist, that I know for certain, and the writer who describes the masses, as Maupassant does, by telling sympathetically of the “hanches” and “gorges” of Breton domestics, and with contempt and ridicule the life of the labouring people, commits a great error in an artistic sense, because he describes the subject from only one, the most uninteresting, physical side, and completely overlooks the other, the most important, spiritual side, which forms the essence of the subject.</p><cite>THE WORKS OF GUY DE MAUPASSANT, Leo Tolstoy, 1894</cite></blockquote><p>It’s interesting to see that Tolstoy criticizes Maupassant for <a href=\"http://www.milobookclub.com/2011/02/23/bakker-on-triumph-of-modern-fantasy/\">precisely the same failing</a> exhibited by even the most skilled authors of literature, fantasy, and science fiction today.  The absence of a spiritual awareness on the part of the author intrinsically limits their works, and leaves them painting with a palette devoid of true colors, as if they were photographers who possess only monochromatic film.</p><p><em><a href=\"https://social.infogalactic.com/micropost/6ddd6d9c-70d3-4ac8-b610-3e995a6792b1\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I’m always fascinated by one great mind’s take on another, which is one reason why I chose Machiavelli’s\nDiscourses on the First Ten Books of Titus Livy\nfor the Library subscription over his more famous works. So,\nthis review of the work\nof one of my favorite writers – Guy de Maupassant – by another of my favorite writers – Leo Tolstoy – is of particular interest to me.\nThe author was endowed with that particular gift, called talent, which consists in the author’s ability to direct, according to his tastes, his intensified, strained attention to this or that subject, in consequence of which the author who is endowed with this ability sees in those subjects upon which he directs his attention, something new, something which others did not see. Maupassant evidently possessed that gift of seeing in subjects something which others did not see. But, to judge from the small volume which I had read, he was devoid of the chief condition necessary, besides talent, for a truly artistic production.\nOf the three conditions:\n1)\na correct, that is, a moral relation of the author to the subject,\n2)\nthe clearness of exposition, or the beauty of form, which is the same, and\n3)\nsincerity, that is, an undisguised feeling of love or hatred for what the artist describes\nMaupassant possessed only the last two, and was entirely devoid of the first. He had no correct, that is, no moral relation to the subjects described. From what I had read, I was convinced that Maupassant possessed talent, that is, the gift of attention, which in the objects and phenomena of life revealed to him those qualities which are not visible to other men; he also possessed a beautiful form, that is, he expressed clearly, simply, and beautifully what he wished to say, and also possessed that condition of the worth of an artistic production, without which it does not produce any effect, — sincerity, — that is, he did not simulate love or hatred, but actually loved and hated what he described. But unfortunately, being devoid of the first, almost the most important condition of the worth of an artistic production, of the correct, moral relation to what he represented, that is, of the knowledge of the difference between good and evil, he loved and represented what it was not right to love and represent, and did not love and did not represent what he ought to have loved and represented. Thus the author in this little volume describes with much detail and love how women tempt men and men tempt women, and even some incomprehensible obscenities, which are represented in\nLa Femme de Paul\n, and he describes the labouring country people, not only with indifference, but even with contempt, as so many animals.\nParticularly striking was that lack of distinction between bad and good in the story\nUne Partie de Campagne\n, in which, in the form of a most clever and amusing jest, he gives a detailed account of how two gentlemen with bared arms, rowing in a boat, simultaneously tempted, the one an old mother, and the other a young maiden, her daughter.\nThe author’s sympathy is during the whole time obviously to such an extent on the side of the two rascals, that he ignores, or, rather, does not see what the tempted mother, the girl, the father, and the young man, evidently the fiance of the daughter, must have suffered, and so we not only get a shocking description of a disgusting crime in the form of an amusing jest, but the event itself is described falsely, because only the most insignificant side of the subject, the pleasure afforded to the rascals, is described.\nIn the same volume there is a story,\nHistoire d’une Fille de Ferme\n, which Turgenev recommended to me more particularly, and which more particularly displeased me on account of the author’s incorrect relation to the subject. The author apparently sees in all the working people whom he describes nothing but animals, who do not rise above sexual and maternal love, and so the description leaves us with an incomplete, artificial impression.\nThe insufficient comprehension of the lives and interests of the working classes, and the representation of the men from those classes in the form of half-animals, which are moved only by sensuality, malice, and greed, forms one of the chief and most important defects of the majority of the modern French authors, among them Maupassant, not only in this story, but also in all the other stories, in which he touches on the people and always describes them as coarse, dull animals, whom one can only ridicule. Of course, the French authors must know the conditions of their people better than I know them; but, although I am a Russian and have not lived with the French people, I none the less assert that, in describing their masses, the French authors are wrong, and that the French masses cannot be as they are described. If there exists a France as we know it, with her truly great men and with those great contributions which these great men have made to science, art, civil polity, and the moral perfection of humanity, those labouring masses, which have held upon their shoulders this France and her great men, do not consist of animals, but of men with great spiritual qualities; and so I do not believe what I am told in novels like\nLa Terre\n, and in Maupassant’s stories, just as I should not believe if I were told of the existence of a beautiful house standing on no foundation. It is very possible that the high qualities of the masses are not such as are described in\nLa petit Fadette\nand in\nLa Mare au Diable\n, but these qualities exist, that I know for certain, and the writer who describes the masses, as Maupassant does, by telling sympathetically of the “hanches” and “gorges” of Breton domestics, and with contempt and ridicule the life of the labouring people, commits a great error in an artistic sense, because he describes the subject from only one, the most uninteresting, physical side, and completely overlooks the other, the most important, spiritual side, which forms the essence of the subject.\nTHE WORKS OF GUY DE MAUPASSANT, Leo Tolstoy, 1894\nIt’s interesting to see that Tolstoy criticizes Maupassant for\nprecisely the same failing\nexhibited by even the most skilled authors of literature, fantasy, and science fiction today.  The absence of a spiritual awareness on the part of the author intrinsically limits their works, and leaves them painting with a palette devoid of true colors, as if they were photographers who possess only monochromatic film.\nDISCUSS ON SG",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-10-10T12:58:21+00:00"
}