{
  "url": "https://voxday.net/2022/10/05/trust-the-grandmaster/",
  "scraped_at": "2026-01-08T13:33:34.290630",
  "title": "Trust the Grandmaster",
  "date_display": "October 5, 2022",
  "date_iso": "2022-10-05T09:47:32+00:00",
  "date_from_url": "2022-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Especially when he’s a world champion. The cheating accusations made by the reigning world champion, Magnus Carlson, <a href=\"https://www.forbes.com/sites/carlieporterfield/2022/10/04/grandmaster-at-center-of-chess-world-scandal-likely-cheated-more-than-100-times-investigation-finds/\">have been substantially supported</a> by a 72-page investigative report by Chess.com. The entire report <a href=\"https://drive.google.com/file/d/11IokKgTVSXdpYEzAuyViIleSZ_2wl0ag/view\">can be downloaded here. (PDF)</a></p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Hans Niemann, the 19-year-old American grandmaster who last month was accused of cheating by World Chess Champion Magnus Carlsen after a shocking upset, was found to have “likely cheated” more than 100 times, according to an investigation by Chess.com, the world’s largest online chess platform.</p><p>The investigation, a report from which was seen by the <em>Wall Street Journal</em>, found Niemann likely “received illegal assistance” in more than 100 online chess matches that took place as recently as 2020 when he was 17 years old, allegations that contradict his earlier claims that he only cheated on several occasions as a young teenager.</p><p>A letter sent to Niemann by Chess.com’s chief chess officer Danny Rensch last month detailed how Niemann’s suspicious moves tended to coincide with Niemann opening up new screens on his computer, which could indicate that Niemann was using a chess engine, according to the <em>Journal</em>. Niemann “privately confessed” to the allegations–which included cheating in chess games where prize money was awarded–and was banned from the site, according to the Journal.</p><p>While the Chess.com investigation largely focused on Niemann’s online games, the report noted that his rise in rankings for in-person chess was “statistically extraordinary” and that specific games may merit further investigation (the sport’s international governing body, FIDE, is conducting a separate investigation).</p></blockquote><p>You can’t hide the math. I was certain that Niemann was cheating the moment that Grandmaster Hikaru Nakamura went over some of the statistical analysis being provided by data scientists around the world on his YouTube channel.</p><p>One thing that I found interesting about the scandal was the way that Niemann was defended by chess Gammas on Reddit. They were vehemently accusing Carlson of being insecure, a poor loser, and insisting that Niemann couldn’t possibly be guilty of cheating because it was theoretically possible that he was, in fact, the most rapidly improving world-class-level chess player in history.</p><p>Which tells us that it isn’t merely jocks and celebs – however minor – that Gammas hate, but elite performance and status as well. It also demonstrates their instinctive inclination toward dishonesty; they would literally prefer for the world chess champion to be a confirmed cheater than be a paragon of legitimate excellence.</p><p><strong>UPDATE: </strong>This quote from the report is nothing less than astonishing for those of us who can remember the first time Deep Blue beat Garry Kasparov in 1997:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The best humans play at an Elo rating of 2800. “Stockfish,” the most powerful chess engine, has an estimated rating of more than 3500. In a theoretical match between World Champion Magnus Carlsen vs. Stockfish, we estimate that it is most likely that Magnus Carlsen would lose every single game—no wins and no draws.</p></blockquote><p>While we know his Elo rating is fraudulent, one can’t help but wonder what Niemann’s ELoW rating is.</p><p><em><a href=\"https://social.infogalactic.com/micropost/7e88f536-fe86-43cf-9ef9-c0068c2bbc54\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Especially when he’s a world champion. The cheating accusations made by the reigning world champion, Magnus Carlson,\nhave been substantially supported\nby a 72-page investigative report by Chess.com. The entire report\ncan be downloaded here. (PDF)\nHans Niemann, the 19-year-old American grandmaster who last month was accused of cheating by World Chess Champion Magnus Carlsen after a shocking upset, was found to have “likely cheated” more than 100 times, according to an investigation by Chess.com, the world’s largest online chess platform.\nThe investigation, a report from which was seen by the\nWall Street Journal\n, found Niemann likely “received illegal assistance” in more than 100 online chess matches that took place as recently as 2020 when he was 17 years old, allegations that contradict his earlier claims that he only cheated on several occasions as a young teenager.\nA letter sent to Niemann by Chess.com’s chief chess officer Danny Rensch last month detailed how Niemann’s suspicious moves tended to coincide with Niemann opening up new screens on his computer, which could indicate that Niemann was using a chess engine, according to the\nJournal\n. Niemann “privately confessed” to the allegations–which included cheating in chess games where prize money was awarded–and was banned from the site, according to the Journal.\nWhile the Chess.com investigation largely focused on Niemann’s online games, the report noted that his rise in rankings for in-person chess was “statistically extraordinary” and that specific games may merit further investigation (the sport’s international governing body, FIDE, is conducting a separate investigation).\nYou can’t hide the math. I was certain that Niemann was cheating the moment that Grandmaster Hikaru Nakamura went over some of the statistical analysis being provided by data scientists around the world on his YouTube channel.\nOne thing that I found interesting about the scandal was the way that Niemann was defended by chess Gammas on Reddit. They were vehemently accusing Carlson of being insecure, a poor loser, and insisting that Niemann couldn’t possibly be guilty of cheating because it was theoretically possible that he was, in fact, the most rapidly improving world-class-level chess player in history.\nWhich tells us that it isn’t merely jocks and celebs – however minor – that Gammas hate, but elite performance and status as well. It also demonstrates their instinctive inclination toward dishonesty; they would literally prefer for the world chess champion to be a confirmed cheater than be a paragon of legitimate excellence.\nUPDATE:\nThis quote from the report is nothing less than astonishing for those of us who can remember the first time Deep Blue beat Garry Kasparov in 1997:\nThe best humans play at an Elo rating of 2800. “Stockfish,” the most powerful chess engine, has an estimated rating of more than 3500. In a theoretical match between World Champion Magnus Carlsen vs. Stockfish, we estimate that it is most likely that Magnus Carlsen would lose every single game—no wins and no draws.\nWhile we know his Elo rating is fraudulent, one can’t help but wonder what Niemann’s ELoW rating is.\nDISCUSS ON SG",
  "tags": [
    "games",
    "Gamma"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-10-05T13:01:50+00:00"
}