{
  "url": "https://voxday.net/2022/10/19/what-the-actual/",
  "scraped_at": "2026-01-08T13:35:00.725624",
  "title": "What The Actual…",
  "date_display": "October 19, 2022",
  "date_iso": "2022-10-19T23:27:34+00:00",
  "date_from_url": "2022-10-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not sure this explanation of the consequences is correct, but regardless, <a href=\"https://gab.com/LaurenWitzkeDE/posts/109197050281169494\">the latest action by the CDC </a>is a ghastly one in light of the fact that the Covid 19 vaccines are a) extremely unsafe, b) highly ineffective, and c) worse than worthless for children.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The CDC just now voted 15-0 to add the Covid 19 Vaxx to the childhood vax schedule. This means they are mandated the Covid 19 vaccine in order to attend public schools. This is the event that could spark an all-out civil war.</p></blockquote><p>On the bright side, people who insist on sending their children to public school despite knowing better <a href=\"https://www.thegatewaypundit.com/2022/10/update-cdc-votes-require-covid-vaccine-childrens-immunization-schedule-federal-programs/\">now have considerable motivation</a> to contemplate the superior alternatives. And between the children fleeing the public schools and the inevitable cases of Suddenly, this should significantly reduce class sizes.</p><p>Silver linings aside, it should be entirely obvious now that the wicked governments of the West are attempting to depopulate the nations over which they so insidiously rule.</p><p><em><a href=\"https://social.infogalactic.com/micropost/01d23da9-4126-4576-86bb-0082d849d5fc\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I’m not sure this explanation of the consequences is correct, but regardless,\nthe latest action by the CDC\nis a ghastly one in light of the fact that the Covid 19 vaccines are a) extremely unsafe, b) highly ineffective, and c) worse than worthless for children.\nThe CDC just now voted 15-0 to add the Covid 19 Vaxx to the childhood vax schedule. This means they are mandated the Covid 19 vaccine in order to attend public schools. This is the event that could spark an all-out civil war.\nOn the bright side, people who insist on sending their children to public school despite knowing better\nnow have considerable motivation\nto contemplate the superior alternatives. And between the children fleeing the public schools and the inevitable cases of Suddenly, this should significantly reduce class sizes.\nSilver linings aside, it should be entirely obvious now that the wicked governments of the West are attempting to depopulate the nations over which they so insidiously rule.\nDISCUSS ON SG",
  "tags": [
    "education",
    "healthcare",
    "vaccines"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-10-19T23:38:40+00:00"
}