{
  "url": "https://voxday.net/2009/11/20/agwcc-fraud-confirmed/",
  "scraped_at": "2026-01-08T23:12:41.497978",
  "title": "AGW/CC travesty confirmed",
  "date_display": "November 20, 2009",
  "date_iso": "2009-11-20T17:17:00+00:00",
  "date_from_url": "2009-11-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There isn’t any science to support the outrageous conclusions driving Kyoto and Copenhagen.  None.  Cram <a href=\"http://algorelied.com/?p=3177\">this statement from one of the leading IPCC scientists</a> down the throat of the next idiot you hear using the term “global warming denier”:</p><blockquote><p>The fact is that we can’t account for the lack of warming at the moment and it is a travesty that we can’t. The CERES data published in the August BAMS 09 supplement on 2008 shows there should be even more warming: but the data are surely wrong.<br> – Kevin Trenberth, head of the Climate Analysis Section at the National Center for Atmospheric Research and a lead author of the 2001 and 2007 IPCC Scientific Assessment of Climate Change</br></p></blockquote><p>Here’s another one: <i>“I’ve just completed Mike’s Nature trick of adding in the real temps to each series for the last 20 years (ie from 1981 onwards) and from 1961 for Keith’s to hide the decline.”</i></p><p>The so-called scientists know their models are wrong. They know the global warming they predicted isn’t happening.  And yet they are trying to keep it quiet, so that all the credulous science fetishists who believe wholeheartedly in the “science” won’t lose faith in the cause and pull out the scientific supports from the global governance scheme. Speaking of which, here’s another: <i>“One particular thing you said – and we agreed – was about the IPCC reports and the broader climate negotiations were working to the globalisation agenda driven by organisations like the WTO.”</i></p><p>This is confirmation that AGW/CC is indeed what I said it would turn out to be, namely, <a href=\"http://www.milobookclub.com/2009/09/25/agw-biggest-science-fraud-ye/\">The Biggest Science Fraud Yet</a>.  Of course, if the climate scientists had one-tenth the integrity that the fetishists claim they do, it wouldn’t have been necessary to learn what they really think about the matter from a whistleblower releasing <a href=\"http://wattsupwiththat.com/2009/11/19/breaking-news-story-hadley-cru-has-apparently-been-hacked-hundreds-of-files-released/\">hacked emails</a>.</p><p>Ian Wishart’s Investigate Magazine <a href=\"http://www.investigatemagazine.com/australia/latestissue.pdf\">confirms the emails are real</a>(4.1 meg PDF):</p><blockquote><p>The director of Britain’s leading Climate Research Unit, Phil Jones, has told Investigate magazine’s TGIF Edition tonight that his organization has been hacked, and the data flying all over the internet appears to be genuine. In an exclusive interview, Jones told TGIF, “It was a hacker. We were aware of this about three or four days ago that someone had hacked into our system and taken and copied loads of data files and emails.”</p></blockquote><p><i>We feel that climate science is, in the current situation, too important to be kept under wraps. We hereby release a random selection of correspondence, code, and documents.  Hopefully it will give some insight into the science and the people behind it.”</i></p><p>In a word: awesome!  Whoever did this merits knighthood by the Legion of Doom.</p></div>",
  "content_text": "There isn’t any science to support the outrageous conclusions driving Kyoto and Copenhagen.  None.  Cram\nthis statement from one of the leading IPCC scientists\ndown the throat of the next idiot you hear using the term “global warming denier”:\nThe fact is that we can’t account for the lack of warming at the moment and it is a travesty that we can’t. The CERES data published in the August BAMS 09 supplement on 2008 shows there should be even more warming: but the data are surely wrong.\n– Kevin Trenberth, head of the Climate Analysis Section at the National Center for Atmospheric Research and a lead author of the 2001 and 2007 IPCC Scientific Assessment of Climate Change\nHere’s another one:\n“I’ve just completed Mike’s Nature trick of adding in the real temps to each series for the last 20 years (ie from 1981 onwards) and from 1961 for Keith’s to hide the decline.”\nThe so-called scientists know their models are wrong. They know the global warming they predicted isn’t happening.  And yet they are trying to keep it quiet, so that all the credulous science fetishists who believe wholeheartedly in the “science” won’t lose faith in the cause and pull out the scientific supports from the global governance scheme. Speaking of which, here’s another:\n“One particular thing you said – and we agreed – was about the IPCC reports and the broader climate negotiations were working to the globalisation agenda driven by organisations like the WTO.”\nThis is confirmation that AGW/CC is indeed what I said it would turn out to be, namely,\nThe Biggest Science Fraud Yet\n.  Of course, if the climate scientists had one-tenth the integrity that the fetishists claim they do, it wouldn’t have been necessary to learn what they really think about the matter from a whistleblower releasing\nhacked emails\n.\nIan Wishart’s Investigate Magazine\nconfirms the emails are real\n(4.1 meg PDF):\nThe director of Britain’s leading Climate Research Unit, Phil Jones, has told Investigate magazine’s TGIF Edition tonight that his organization has been hacked, and the data flying all over the internet appears to be genuine. In an exclusive interview, Jones told TGIF, “It was a hacker. We were aware of this about three or four days ago that someone had hacked into our system and taken and copied loads of data files and emails.”\nWe feel that climate science is, in the current situation, too important to be kept under wraps. We hereby release a random selection of correspondence, code, and documents.  Hopefully it will give some insight into the science and the people behind it.”\nIn a word: awesome!  Whoever did this merits knighthood by the Legion of Doom.",
  "tags": [
    "AGW/CC",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-11-20T17:17:00+00:00"
}