{
  "url": "https://voxday.net/2009/11/18/al-gore-commits-igon-error/",
  "scraped_at": "2026-01-08T23:12:33.735034",
  "title": "Al Gore commits an Igon error",
  "date_display": "November 18, 2009",
  "date_iso": "2009-11-18T15:30:00+00:00",
  "date_from_url": "2009-11-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I have said many, many times before, AGW/CC is a complete crock of steaming bovine ejectus.  The “scientists” who subscribe to the theory are either corrupt, ignorant, or ideologically supportive of global governance and this will become increasingly obvious to everyone over time.  So, it should come as no surprise that the leading AGW/CC salesman should demonstrate that <a href=\"http://corner.nationalreview.com/post/?q=NDcxYThlNzBkOTcyM2EzZmM2MDEyNjFjOGQ3ZmE5M2M=\">he has very little grasp of temperature </a>as his numbers are off <i>by an order of magnitude</i>:</p><blockquote><p>Conan:   Now, what about … you talk in the book about geothermal energy …<br> Al:   Yeah, yeah.<br> Conan:     and that is, as I understand it, using the heat that’s generated from the core of the earth …<br> Al:   Yeah.<br> Conan:   … to create energy, and it sounds to me like an evil plan by Lex Luthor to defeat Superman. Can you, can you tell me, is this a viable solution, geothermal energy?<br> Al:   It definitely is, and it’s a relatively new one. People think about geothermal energy — when they think about it at all — in terms of the hot water bubbling up in some places, but two kilometers or so down in most places there are these incredibly hot rocks, ’cause the interior of the earth is extremely hot, several million degrees, and the crust of the earth is hot …</br></br></br></br></br></p></blockquote><p>The interior of the earth is actually somewhere between 3,700 and 6,000 degrees Celsius, depending upon the estimate.  Needless to say, this suffices to show that no intelligent individual should pay any attention whatsoever to Al Gore’s statements about planetary temperature, past, present, or future. Everyone makes mistakes, but in this particular case, as with Gladwell’s infamous Igon Value, the nature of the error indicates the degree of the ignorance.</p></div>",
  "content_text": "As I have said many, many times before, AGW/CC is a complete crock of steaming bovine ejectus.  The “scientists” who subscribe to the theory are either corrupt, ignorant, or ideologically supportive of global governance and this will become increasingly obvious to everyone over time.  So, it should come as no surprise that the leading AGW/CC salesman should demonstrate that\nhe has very little grasp of temperature\nas his numbers are off\nby an order of magnitude\n:\nConan:   Now, what about … you talk in the book about geothermal energy …\nAl:   Yeah, yeah.\nConan:     and that is, as I understand it, using the heat that’s generated from the core of the earth …\nAl:   Yeah.\nConan:   … to create energy, and it sounds to me like an evil plan by Lex Luthor to defeat Superman. Can you, can you tell me, is this a viable solution, geothermal energy?\nAl:   It definitely is, and it’s a relatively new one. People think about geothermal energy — when they think about it at all — in terms of the hot water bubbling up in some places, but two kilometers or so down in most places there are these incredibly hot rocks, ’cause the interior of the earth is extremely hot, several million degrees, and the crust of the earth is hot …\nThe interior of the earth is actually somewhere between 3,700 and 6,000 degrees Celsius, depending upon the estimate.  Needless to say, this suffices to show that no intelligent individual should pay any attention whatsoever to Al Gore’s statements about planetary temperature, past, present, or future. Everyone makes mistakes, but in this particular case, as with Gladwell’s infamous Igon Value, the nature of the error indicates the degree of the ignorance.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-11-18T15:30:00+00:00"
}