{
  "url": "https://voxday.net/2009/11/14/brilliant-sociopathy-of-gervais/",
  "scraped_at": "2026-01-08T23:12:11.221152",
  "title": "The brilliant sociopathy of Gervais",
  "date_display": "November 14, 2009",
  "date_iso": "2009-11-14T10:13:00+00:00",
  "date_from_url": "2009-11-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A very interesting interpretation of <i>The Office</i> as <a href=\"http://www.ribbonfarm.com/2009/10/07/the-gervais-principle-or-the-office-according-to-the-office/?t=59\">a structural re-envisioning of corporate culture</a>.  I have to admit that in my experience, the Gervais Principle, as the author names it, is superficially more convincing than either the Peter or Dilbert Principles.</p><blockquote><p>This is where Gervais has broken new ground, primarily because as an artist, he is interested in the subjective experience of being clueless. For your everyday sociopath, it is sufficient to label someone clueless and work around them. What Gervais managed to create is a very compelling portrait of the clueless, a work of art with real business value.</p><p>Here is the ultimate explanation of Michael Scott’s (and David Brent’s) careers: they are put into a position of having to explain their own apparent, unexpected and unexamined success. It is easy to explain failure. Random success is harder. Remember, they are promoted primarily as passive pawns to either allow the sociopaths to escape the risks of their actions, or to make way for the sociopaths to move up faster. They are presented with an interesting bit of cognitive dissonance: being nominally given greater power, but in reality being safely shunted away from the pathways of power. They must choose to either construct false narratives or decline apparent opportunities.</p><p>The clueless resolve this dissonance by choosing to believe in the reality of the organization. Not everybody is capable of this level of suspension of disbelief. Both Ricky Gervais (David Brent) and Steve Carrel (Michael Scott) play the brilliantly-drawn characters perfectly. The most visible sign of their capacity for self-delusion is their complete inability to generate an original thought. They quote movie lines, lyrics and perform terrible impersonations (at one point Michael goes, “You talking to me?” a line he attributes, in a masterful display of confusion, to “Al Pacino, Raging Bull“). For much of what he needs to say, he gropes for empty business phrases, deploying them with staggering incompetence. When Michael talks, he is attempting, like a child, to copy the flawless buzzspeak spoken by sociopaths like Jan and David Wallace. He is oblivious to the fact that the sociopaths use buzzspeak as a coded language with which to simultaneously sustain the (necessary) delusions of the clueless and communicate with each other.</p></blockquote><p>Of course, one would be remiss to fail to point out the way in which this postulated analytical brilliance strongly suggests Gervais’s own sociopathy.  This may offer partial explanation for his atheistic hostility to religion, (not his disbelief, mind you, just the hostility), whose creators and leaders he would naturally assume to be as sociopathic as he knows himself to be.</p><p>It would appear that I may have a sociopathic trait or two myself, as the author brings up one of my favorite tactics, the last sentence aside, in extra credit for his <a href=\"http://www.ribbonfarm.com/2007/07/14/the-15-laws-of-meeting-power/?t=59\">Law Number Five</a>: <i>“Quoting your opponents more accurately than they can quote themselves is one of the most fascinating moves you can employ. The original speaker is put on the defensive, forced to fumble and clarify, and in the process loses control. If you want to experience true schadenfreude listen closely to what your opponents say. Do not admit to enjoying this experience.”</i> Of course, despite the best efforts of many critics over the last eight years, this has seldom worked on me.  Since I make habitual use of the tactic myself, I never cease to anticipate it.  Also, there are few things more amusing than seeing an arrogant and insufficiently analytical critic snap at the bait you’ve laid before him.</p></div>",
  "content_text": "A very interesting interpretation of\nThe Office\nas\na structural re-envisioning of corporate culture\n.  I have to admit that in my experience, the Gervais Principle, as the author names it, is superficially more convincing than either the Peter or Dilbert Principles.\nThis is where Gervais has broken new ground, primarily because as an artist, he is interested in the subjective experience of being clueless. For your everyday sociopath, it is sufficient to label someone clueless and work around them. What Gervais managed to create is a very compelling portrait of the clueless, a work of art with real business value.\nHere is the ultimate explanation of Michael Scott’s (and David Brent’s) careers: they are put into a position of having to explain their own apparent, unexpected and unexamined success. It is easy to explain failure. Random success is harder. Remember, they are promoted primarily as passive pawns to either allow the sociopaths to escape the risks of their actions, or to make way for the sociopaths to move up faster. They are presented with an interesting bit of cognitive dissonance: being nominally given greater power, but in reality being safely shunted away from the pathways of power. They must choose to either construct false narratives or decline apparent opportunities.\nThe clueless resolve this dissonance by choosing to believe in the reality of the organization. Not everybody is capable of this level of suspension of disbelief. Both Ricky Gervais (David Brent) and Steve Carrel (Michael Scott) play the brilliantly-drawn characters perfectly. The most visible sign of their capacity for self-delusion is their complete inability to generate an original thought. They quote movie lines, lyrics and perform terrible impersonations (at one point Michael goes, “You talking to me?” a line he attributes, in a masterful display of confusion, to “Al Pacino, Raging Bull“). For much of what he needs to say, he gropes for empty business phrases, deploying them with staggering incompetence. When Michael talks, he is attempting, like a child, to copy the flawless buzzspeak spoken by sociopaths like Jan and David Wallace. He is oblivious to the fact that the sociopaths use buzzspeak as a coded language with which to simultaneously sustain the (necessary) delusions of the clueless and communicate with each other.\nOf course, one would be remiss to fail to point out the way in which this postulated analytical brilliance strongly suggests Gervais’s own sociopathy.  This may offer partial explanation for his atheistic hostility to religion, (not his disbelief, mind you, just the hostility), whose creators and leaders he would naturally assume to be as sociopathic as he knows himself to be.\nIt would appear that I may have a sociopathic trait or two myself, as the author brings up one of my favorite tactics, the last sentence aside, in extra credit for his\nLaw Number Five\n:\n“Quoting your opponents more accurately than they can quote themselves is one of the most fascinating moves you can employ. The original speaker is put on the defensive, forced to fumble and clarify, and in the process loses control. If you want to experience true schadenfreude listen closely to what your opponents say. Do not admit to enjoying this experience.”\nOf course, despite the best efforts of many critics over the last eight years, this has seldom worked on me.  Since I make habitual use of the tactic myself, I never cease to anticipate it.  Also, there are few things more amusing than seeing an arrogant and insufficiently analytical critic snap at the bait you’ve laid before him.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-11-14T10:13:00+00:00"
}