{
  "url": "https://voxday.net/2009/11/29/convenient-purge/",
  "scraped_at": "2026-01-08T23:13:29.430961",
  "title": "NO evidence for global warming",
  "date_display": "November 29, 2009",
  "date_iso": "2009-11-29T22:24:00+00:00",
  "date_from_url": "2009-11-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Perhaps in part due to my respect for actual science, I find most scientists to be contemptible.  But this news exceeds even my cynically low expectations of the charlatans.  Is <a href=\"http://www.timesonline.co.uk/tol/news/environment/article6936328.ece\">throwing out the original data</a> really the scientific norm these days?  Because I can testify that game developers, engineers, and computer programmers are all significantly more rigorous about protecting and saving their legacy information.</p><blockquote><p>SCIENTISTS at the University of East Anglia (UEA) have admitted throwing away much of the raw temperature data on which their predictions of global warming are based.  It means that other academics are not able to check basic calculations said to show a long-term rise in temperature over the past 150 years.  The UEA’s Climatic Research Unit (CRU) was forced to reveal the loss following requests for the data under Freedom of Information legislation….</p><p>The CRU is the world’s leading centre for reconstructing past climate and temperatures. Climate change sceptics have long been keen to examine exactly how its data were compiled. That is now impossible.</p></blockquote><p>Hang on… until yesterday, weren’t the CRU scientists claiming they weren’t providing the data because they had obtained it from various governmental organizations who held the rights to it and they had no permission to release it to the public?  Was Real Climate deceived by the CRU or was Real Climate lying when they wrote the following on November 23, 2009: <i>“<a href=\"http://www.realclimate.org/index.php/archives/2009/11/the-cru-hack-context/\">CRU data accessibility</a>. From the date of the first FOI request to CRU (in 2007), it has been made abundantly clear that the main impediment to releasing the whole CRU archive is the small % of it that was given to CRU on the understanding it wouldn’t be passed on to third parties.”</i></p><p>This is more than a smoking howitzer, it’s a meganuke that would – in a rational world of genuine science – blow away the AGW/CC charade permanently.  It also proves that scientists should always be regarded as shady con men unless and until the scientific evidence they produce in support of their hypotheses indicates otherwise.  Needless to say, all of “the value-added (quality controlled and homogenised) data” should immediately join the original data in the trash  Every so-called “scientist” at the CRU who was involved with this fraud should be immediately fired.  And those who stole taxpayer money on the basis of the scam should be prosecuted, along with those who junked the data if they did so – as suggested in the CRU emails –  in response to a Freedom of Information Act request.</p><p>Score yet another one for the scientific skeptic.  Never place any trust in an expert who can’t explain himself to your satisfaction.  Especially when he’s asking you for money.</p></div>",
  "content_text": "Perhaps in part due to my respect for actual science, I find most scientists to be contemptible.  But this news exceeds even my cynically low expectations of the charlatans.  Is\nthrowing out the original data\nreally the scientific norm these days?  Because I can testify that game developers, engineers, and computer programmers are all significantly more rigorous about protecting and saving their legacy information.\nSCIENTISTS at the University of East Anglia (UEA) have admitted throwing away much of the raw temperature data on which their predictions of global warming are based.  It means that other academics are not able to check basic calculations said to show a long-term rise in temperature over the past 150 years.  The UEA’s Climatic Research Unit (CRU) was forced to reveal the loss following requests for the data under Freedom of Information legislation….\nThe CRU is the world’s leading centre for reconstructing past climate and temperatures. Climate change sceptics have long been keen to examine exactly how its data were compiled. That is now impossible.\nHang on… until yesterday, weren’t the CRU scientists claiming they weren’t providing the data because they had obtained it from various governmental organizations who held the rights to it and they had no permission to release it to the public?  Was Real Climate deceived by the CRU or was Real Climate lying when they wrote the following on November 23, 2009:\n“\nCRU data accessibility\n. From the date of the first FOI request to CRU (in 2007), it has been made abundantly clear that the main impediment to releasing the whole CRU archive is the small % of it that was given to CRU on the understanding it wouldn’t be passed on to third parties.”\nThis is more than a smoking howitzer, it’s a meganuke that would – in a rational world of genuine science – blow away the AGW/CC charade permanently.  It also proves that scientists should always be regarded as shady con men unless and until the scientific evidence they produce in support of their hypotheses indicates otherwise.  Needless to say, all of “the value-added (quality controlled and homogenised) data” should immediately join the original data in the trash  Every so-called “scientist” at the CRU who was involved with this fraud should be immediately fired.  And those who stole taxpayer money on the basis of the scam should be prosecuted, along with those who junked the data if they did so – as suggested in the CRU emails –  in response to a Freedom of Information Act request.\nScore yet another one for the scientific skeptic.  Never place any trust in an expert who can’t explain himself to your satisfaction.  Especially when he’s asking you for money.",
  "tags": [
    "AGW/CC",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-11-29T22:24:00+00:00"
}