{
  "url": "https://voxday.net/2009/11/05/errata/",
  "scraped_at": "2026-01-08T23:11:30.065376",
  "title": "Errata",
  "date_display": "November 5, 2009",
  "date_iso": "2009-11-05T19:47:00+00:00",
  "date_from_url": "2009-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In any book full of statistical minutia, it’s highly probable that the author will make the occasional dumb mistake.  Sometimes it’s a typo, sometimes it’s a failure of research, sometimes it’s a misstatement, and sometimes it’s just an inexplicable error.  This doesn’t make you feel any better when you catch your own dumb mistakes, or worse, have to rely upon other people catching them for you.  But this historical howler, I have to confess, makes me feel rather better about <a href=\"http://www.milobookclub.com/2009/10/27/brief-note-to-ankle-biters/\">my own 1931-related error</a>.  It also may help explain my low opinion of certain mainstream economists for those who think I show insufficient lack of respect for fame and professional credentials.  And while I’m inclined to give authors the benefit of the doubt when it comes to statistical citations, I’m not sure this one can be considered an excusable error, especially since it was made by an economist who has often written about the Great Depression as if he knows a great deal about it.</p><p>“Back to bank runs: in 1931, about half the banks in the United States failed.  These banks were not all alike. Some were very badly run; some took excessive risks, even given what they knew before 1929; others were reasonably well, even conservatively managed.  But when panic spread across the land, and depositors everywhere wanted their money immediately, none of this mattered: only banks that had been extremely conservative, that had kept what in normal times would be an excessively large share of their deposits in cash, survived.”<br> – Paul Krugman, <i>The Return of Depression Economics</i>, p. 100  (1999)</br></p><p>I found myself wondering if he’d figured out his tremendous mistake or if anyone had bothered to point it out to him at some point in the ten years between editions.  Fortunately, I also happen to have his revised edition.  The answer: apparently not.</p><p>“Back to bank runs: in 1931, about half the banks in the United States failed.  These banks were not all alike. Some were very badly run; some took excessive risks, even given what they knew before 1929; others were reasonably well, even conservatively managed.  But when panic spread across the land, and depositors everywhere wanted their money immediately, none of this mattered: only banks that had been extremely conservative, that had kept what in normal times would be an excessively large share of their deposits in cash, survived.”<br> – Paul Krugman, <i>The Return of Depression Economics and the Crisis of 2008</i>, pp 96-97. (2009)</br></p><p>If you should happen to consult RGD, you’ll see that 2,293 of the 20,367 banks in the United States failed.  That’s 11 percent, which is not even close to “about half”.  You can also check <i>Banking and Monetary Statistics 1914-1941</i> or Friedman and Schwartz’s <i>A Monetary History of the United States 1857-1960</i> if you don’t wish to take my word for it.  The problem is that repeating this erroneous historical “fact” twice in ten years isn’t merely an error, it tends to suggest that Krugman really doesn’t know all that much about the Great Depression, and even worse, <i>hasn’t read Milton Friedman</i>.</p></div>",
  "content_text": "In any book full of statistical minutia, it’s highly probable that the author will make the occasional dumb mistake.  Sometimes it’s a typo, sometimes it’s a failure of research, sometimes it’s a misstatement, and sometimes it’s just an inexplicable error.  This doesn’t make you feel any better when you catch your own dumb mistakes, or worse, have to rely upon other people catching them for you.  But this historical howler, I have to confess, makes me feel rather better about\nmy own 1931-related error\n.  It also may help explain my low opinion of certain mainstream economists for those who think I show insufficient lack of respect for fame and professional credentials.  And while I’m inclined to give authors the benefit of the doubt when it comes to statistical citations, I’m not sure this one can be considered an excusable error, especially since it was made by an economist who has often written about the Great Depression as if he knows a great deal about it.\n“Back to bank runs: in 1931, about half the banks in the United States failed.  These banks were not all alike. Some were very badly run; some took excessive risks, even given what they knew before 1929; others were reasonably well, even conservatively managed.  But when panic spread across the land, and depositors everywhere wanted their money immediately, none of this mattered: only banks that had been extremely conservative, that had kept what in normal times would be an excessively large share of their deposits in cash, survived.”\n– Paul Krugman,\nThe Return of Depression Economics\n, p. 100  (1999)\nI found myself wondering if he’d figured out his tremendous mistake or if anyone had bothered to point it out to him at some point in the ten years between editions.  Fortunately, I also happen to have his revised edition.  The answer: apparently not.\n“Back to bank runs: in 1931, about half the banks in the United States failed.  These banks were not all alike. Some were very badly run; some took excessive risks, even given what they knew before 1929; others were reasonably well, even conservatively managed.  But when panic spread across the land, and depositors everywhere wanted their money immediately, none of this mattered: only banks that had been extremely conservative, that had kept what in normal times would be an excessively large share of their deposits in cash, survived.”\n– Paul Krugman,\nThe Return of Depression Economics and the Crisis of 2008\n, pp 96-97. (2009)\nIf you should happen to consult RGD, you’ll see that 2,293 of the 20,367 banks in the United States failed.  That’s 11 percent, which is not even close to “about half”.  You can also check\nBanking and Monetary Statistics 1914-1941\nor Friedman and Schwartz’s\nA Monetary History of the United States 1857-1960\nif you don’t wish to take my word for it.  The problem is that repeating this erroneous historical “fact” twice in ten years isn’t merely an error, it tends to suggest that Krugman really doesn’t know all that much about the Great Depression, and even worse,\nhasn’t read Milton Friedman\n.",
  "tags": [
    "books",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-11-05T19:47:00+00:00"
}