{
  "url": "https://voxday.net/2009/11/05/going-academic/",
  "scraped_at": "2026-01-08T23:11:28.184089",
  "title": "Going academic",
  "date_display": "November 5, 2009",
  "date_iso": "2009-11-05T12:30:00+00:00",
  "date_from_url": "2009-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While my contempt for the present university system, such as it is, runs both deep and wide, I was nevertheless pleasantly surprised to be informed by a professor at a large university of his intention to make use of RGD in one of his upper-level economics courses.  So, at least one group of economics majors won’t graduate without ever having heard of the Austrian School or learning about the intrinsic unreliability of macroeconomic statistics.</p><p> UPDATE – In other book-related news, a Muslim reader has informed me of his intention to translate TIA into Arabic; apparently someone has translated the first four chapters of Dawkins’s <i>The God Delusion</i> and he decided to see that the other side was represented.  He said he’ll send me a PDF when he finishes, and I’ll post it here for download.  I think it’s great, but I have to confess that it never occurred to me that the first language any of my books would be translated into would be Arabic.  Go figure.</p></div>",
  "content_text": "While my contempt for the present university system, such as it is, runs both deep and wide, I was nevertheless pleasantly surprised to be informed by a professor at a large university of his intention to make use of RGD in one of his upper-level economics courses.  So, at least one group of economics majors won’t graduate without ever having heard of the Austrian School or learning about the intrinsic unreliability of macroeconomic statistics.\nUPDATE – In other book-related news, a Muslim reader has informed me of his intention to translate TIA into Arabic; apparently someone has translated the first four chapters of Dawkins’s\nThe God Delusion\nand he decided to see that the other side was represented.  He said he’ll send me a PDF when he finishes, and I’ll post it here for download.  I think it’s great, but I have to confess that it never occurred to me that the first language any of my books would be translated into would be Arabic.  Go figure.",
  "tags": [
    "economics",
    "RGD"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-11-05T12:30:00+00:00"
}