{
  "url": "https://voxday.net/2009/11/24/great-backpedal-begins/",
  "scraped_at": "2026-01-08T23:12:59.794432",
  "title": "The great backpedal begins",
  "date_display": "November 24, 2009",
  "date_iso": "2009-11-24T08:21:00+00:00",
  "date_from_url": "2009-11-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A paleontologist and global warming activist openly admits <a href=\"http://blogs.news.com.au/heraldsun/andrewbolt/index.php/heraldsun/the_global_warming_conspiracy_news_spreads/\">That Which Was Not Supposed To Ever Be Mentioned</a>:</p><blockquote><p>We’re dealing with an incomplete understanding of the way the earth system works… When we come to the last few years when we haven’t seen a continuation of that (warming) trend we don’t understand all of the factors that create earth’s climate…We just don’t understand the way the whole system works… See, these people work with models, computer modelling. So when the computer modelling and the real world data disagree you’ve got a very interesting problem… Sure for the last 10 years we’ve gone through a slight cooling trend.</p></blockquote><p>No, really?  In other words, ah, the science isn’t exactly, um, <i>settled</i>.  It actually is pointing in, well, <i>precisely the opposite direction</i> from what we’ve been saying all along.  Which, of course, is what skeptics have been pointing out from the start.</p><p>Lord Monckton is characteristically forthright on the matter: <i>The tiny, close-knit clique of climate scientists who invented and now drive the “global warming” fraud — for fraud is what we now know it to be — tampered with temperature data so assiduously that, on the recent admission of one of them, land temperatures since 1980 have risen twice as fast as ocean temperatures….  In fact, there has been no statistically significant “global warming” for 15 years — and there has been rapid and significant cooling for nine years….  They are not merely bad scientists — they are crooks. And crooks who have perpetrated their crimes at the expense of British and U.S. taxpayers.</i></p><p>The reality is that you don’t actually need to know very much about science to detect scientific fraud.  I would go so far as to argue that non-scientists will tend to be better at noticing scientific fraud than scientists, for what should be the obvious reason that scientists tend to possess a lower level of people skills than the average individual.   This means that scientific con men tend to be rather clumsy and obvious compared to the non-scientific variety in in the act and the subsequent excuse-making, and it’s only because their fellow scientists are also so clueless about people that they are able to get away with as much as they do.</p><p>Of course, if you expect your science BS detector to work, it helps a great deal to not have your sense of identity ensconced in romantic notions of the sanctity of science and the inherently pure intentions of scientists.</p></div>",
  "content_text": "A paleontologist and global warming activist openly admits\nThat Which Was Not Supposed To Ever Be Mentioned\n:\nWe’re dealing with an incomplete understanding of the way the earth system works… When we come to the last few years when we haven’t seen a continuation of that (warming) trend we don’t understand all of the factors that create earth’s climate…We just don’t understand the way the whole system works… See, these people work with models, computer modelling. So when the computer modelling and the real world data disagree you’ve got a very interesting problem… Sure for the last 10 years we’ve gone through a slight cooling trend.\nNo, really?  In other words, ah, the science isn’t exactly, um,\nsettled\n.  It actually is pointing in, well,\nprecisely the opposite direction\nfrom what we’ve been saying all along.  Which, of course, is what skeptics have been pointing out from the start.\nLord Monckton is characteristically forthright on the matter:\nThe tiny, close-knit clique of climate scientists who invented and now drive the “global warming” fraud — for fraud is what we now know it to be — tampered with temperature data so assiduously that, on the recent admission of one of them, land temperatures since 1980 have risen twice as fast as ocean temperatures….  In fact, there has been no statistically significant “global warming” for 15 years — and there has been rapid and significant cooling for nine years….  They are not merely bad scientists — they are crooks. And crooks who have perpetrated their crimes at the expense of British and U.S. taxpayers.\nThe reality is that you don’t actually need to know very much about science to detect scientific fraud.  I would go so far as to argue that non-scientists will tend to be better at noticing scientific fraud than scientists, for what should be the obvious reason that scientists tend to possess a lower level of people skills than the average individual.   This means that scientific con men tend to be rather clumsy and obvious compared to the non-scientific variety in in the act and the subsequent excuse-making, and it’s only because their fellow scientists are also so clueless about people that they are able to get away with as much as they do.\nOf course, if you expect your science BS detector to work, it helps a great deal to not have your sense of identity ensconced in romantic notions of the sanctity of science and the inherently pure intentions of scientists.",
  "tags": [
    "AGW/CC",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-11-24T08:21:00+00:00"
}