{
  "url": "https://voxday.net/2009/11/29/hopelessly-compromised/",
  "scraped_at": "2026-01-08T23:13:25.774308",
  "title": "“Hopelessly compromised”",
  "date_display": "November 29, 2009",
  "date_iso": "2009-11-29T12:34:00+00:00",
  "date_from_url": "2009-11-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The mainstream European media is finally getting around to covering Climategate and reaching the obvious conclusion: this is <a href=\"http://www.telegraph.co.uk/comment/columnists/christopherbooker/6679082/Climate-change-this-is-the-worst-scientific-scandal-of-our-generation.html\">“the worst scientific scandal of our generation”.</a></p><blockquote><p>Back in 2006, when the eminent US statistician Professor Edward Wegman produced an expert report for the US Congress vindicating Steve McIntyre’s demolition of the “hockey stick”, he excoriated the way in which this same “tightly knit group” of academics seemed only too keen to collaborate with each other and to “peer review” each other’s papers in order to dominate the findings of those IPCC reports on which much of the future of the US and world economy may hang. In light of the latest revelations, it now seems even more evident that these men have been failing to uphold those principles which lie at the heart of genuine scientific enquiry and debate. Already one respected US climate scientist, Dr Eduardo Zorita, has called for Dr Mann and Dr Jones to be barred from any further participation in the IPCC. Even our own George Monbiot, horrified at finding how he has been betrayed by the supposed experts he has been revering and citing for so long, has called for Dr Jones to step down as head of the CRU.</p><p>Our hopelessly compromised scientific establishment cannot be allowed to get away with a whitewash of what has become the greatest scientific scandal of our age.</p></blockquote><p>Being merely human, scientists merit no more inherent trust than anyone else… and rather less than most when their careers and wallets are on the line.  Most scientists are useless, venal government-funded worker bees attempting to get along by trading on the accomplishments and reputations of the relatively small number of genuinely innovative scientists who have utilized the scientific method to make positive contributions to Mankind.</p><p>As for peer review, it is little more than an editorial charade that transforms science into a political exercise and should be eliminated entirely.  As one observer inaccurately but aptly commented, Einstein began his career in science at the post office, not Princeton.  (It was actually the <i>patent </i>office, but the point stands.)  Science is too important to be left to scientists.</p><p>UPDATE – Even the NYT has been forced <a href=\"http://www.nytimes.com/2009/11/28/science/earth/28hack.html\">to cover the story</a> outside of its usual self-appointed role as defense attorney:</p><blockquote><p>“This whole concept of, ‘We’re the experts, trust us,’ has clearly gone by the wayside with these e-mails,” said Judith Curry, a climate scientist at Georgia Institute of Technology.</p></blockquote><p>That is a succinct summary, yes.</p></div>",
  "content_text": "The mainstream European media is finally getting around to covering Climategate and reaching the obvious conclusion: this is\n“the worst scientific scandal of our generation”.\nBack in 2006, when the eminent US statistician Professor Edward Wegman produced an expert report for the US Congress vindicating Steve McIntyre’s demolition of the “hockey stick”, he excoriated the way in which this same “tightly knit group” of academics seemed only too keen to collaborate with each other and to “peer review” each other’s papers in order to dominate the findings of those IPCC reports on which much of the future of the US and world economy may hang. In light of the latest revelations, it now seems even more evident that these men have been failing to uphold those principles which lie at the heart of genuine scientific enquiry and debate. Already one respected US climate scientist, Dr Eduardo Zorita, has called for Dr Mann and Dr Jones to be barred from any further participation in the IPCC. Even our own George Monbiot, horrified at finding how he has been betrayed by the supposed experts he has been revering and citing for so long, has called for Dr Jones to step down as head of the CRU.\nOur hopelessly compromised scientific establishment cannot be allowed to get away with a whitewash of what has become the greatest scientific scandal of our age.\nBeing merely human, scientists merit no more inherent trust than anyone else… and rather less than most when their careers and wallets are on the line.  Most scientists are useless, venal government-funded worker bees attempting to get along by trading on the accomplishments and reputations of the relatively small number of genuinely innovative scientists who have utilized the scientific method to make positive contributions to Mankind.\nAs for peer review, it is little more than an editorial charade that transforms science into a political exercise and should be eliminated entirely.  As one observer inaccurately but aptly commented, Einstein began his career in science at the post office, not Princeton.  (It was actually the\npatent\noffice, but the point stands.)  Science is too important to be left to scientists.\nUPDATE – Even the NYT has been forced\nto cover the story\noutside of its usual self-appointed role as defense attorney:\n“This whole concept of, ‘We’re the experts, trust us,’ has clearly gone by the wayside with these e-mails,” said Judith Curry, a climate scientist at Georgia Institute of Technology.\nThat is a succinct summary, yes.",
  "tags": [
    "AGW/CC"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-11-29T12:34:00+00:00"
}