{
  "url": "https://voxday.net/2009/11/20/igon-value-of-intelligence/",
  "scraped_at": "2026-01-08T23:12:43.367806",
  "title": "The Igon Value of Intelligence",
  "date_display": "November 20, 2009",
  "date_iso": "2009-11-20T21:00:00+00:00",
  "date_from_url": "2009-11-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Steven Pinker <a href=\"http://www.nytimes.com/2009/11/29/books/review/Letters-t-LETSGOTOTHET_LETTERS.html?_r=2\">bitchslaps Gladwell</a>:</p><blockquote><p>What Malcolm Gladwell calls a “lonely ice floe” is what psychologists call “the mainstream.” In a 1997 editorial in the journal Intelligence, 52 signatories wrote, “I.Q. is strongly related, probably more so than any other single measurable human trait, to many important educational, occupational, economic and social outcomes.” Similar conclusions were affirmed in a unanimous blue-ribbon report by the American Psychological Association, and in recent studies (some focusing on outliers) by Dean Simonton, David Lubinski and others.</p><p>Gladwell is right, of course, to privilege peer-reviewed articles over blogs. But sports is a topic in which any academic must answer to an army of statistics-savvy amateurs, and in this instance, I judged, the bloggers were correct. They noted, among other things, that Berri and Simmons weakened their “weak correlation” (Gladwell described it in the New Yorker essay reprinted in “What the Dog Saw” as “no connection”) by omitting the lower-drafted quarterbacks who, unsurprisingly, turned out not to merit many plays. In any case, the relevance to teacher selection (the focus of the essay) remains tenuous.</p></blockquote><p>Actually, depending on the blog, you might be better off to bet on it over the average peer-reviewed article.  “Peer-review” is just a sciency name for what is more commonly known as “editing”.  And you have only to look at a newspaper to see that no amount of editors necessarily precludes egregious errors of fact and logic.  But otherwise, yeah.  Gladwell is a twit.  Sure, he’s sold a lot of books, but then, so did whoever wrote “Who Moved My Cheese” and “If You Give a Mouse a Cookie”.  Does anyone seriously ascribe intellectual relevance to those best-selling authors?</p><p>Steve Sailer follows up Pinker’s stake-and-garlic with a beheading, showing that Gladwell isn’t just a twit, <a href=\"http://isteve.blogspot.com/2009/11/beating-dead-horse-part-xviii.html\">he’s apparently a clueless and cowardly little bitch</a> as well:</p><blockquote><p>Without admitting it, Gladwell seems to have given up former position that NFL achievement “can’t be predicted,” there’s “no connection,” etc. etc. He now seems to be saying that, when you take into account the higher pay of higher draft picks, NFL teams aren’t economically optimizing their draft picks, which is a wildly different thing.</p></blockquote><p>NFL teams aren’t economically optimizing their draft picks!  I’m sure Detroit fans will be SHOCKED… as are those who have suffered through seasons of the Tarvaris Jackson Experiment (2nd round, 2006).  Gladwell obviously pays zero attention to professional football or he could not have possibly have written this: <b>“And what Berri and Simmons in particular—and Massey and Thaler in general—remind us is that that kind of blind faith in the likes of Matt Millen and Al Davis simply isn’t justified.”</b></p><p>Yes, because there were just <i>massive</i> legions of fans in Detroit and Oakland with <i>blind faith</i> in Davis and Millen…. For crying out loud, why do some people find it so impossible to admit that they’re wrong even when smart people are rubbing their noses in their mistakes in the national media?  Everyone is wrong from time to time.  Absolutely everyone!  I despise those who try to move the goalposts once they’ve been cornered and proven wrong; are they so stupid that they genuinely believe that no one is going to notice that what they’re saying now is not what they were saying before?</p></div>",
  "content_text": "Steven Pinker\nbitchslaps Gladwell\n:\nWhat Malcolm Gladwell calls a “lonely ice floe” is what psychologists call “the mainstream.” In a 1997 editorial in the journal Intelligence, 52 signatories wrote, “I.Q. is strongly related, probably more so than any other single measurable human trait, to many important educational, occupational, economic and social outcomes.” Similar conclusions were affirmed in a unanimous blue-ribbon report by the American Psychological Association, and in recent studies (some focusing on outliers) by Dean Simonton, David Lubinski and others.\nGladwell is right, of course, to privilege peer-reviewed articles over blogs. But sports is a topic in which any academic must answer to an army of statistics-savvy amateurs, and in this instance, I judged, the bloggers were correct. They noted, among other things, that Berri and Simmons weakened their “weak correlation” (Gladwell described it in the New Yorker essay reprinted in “What the Dog Saw” as “no connection”) by omitting the lower-drafted quarterbacks who, unsurprisingly, turned out not to merit many plays. In any case, the relevance to teacher selection (the focus of the essay) remains tenuous.\nActually, depending on the blog, you might be better off to bet on it over the average peer-reviewed article.  “Peer-review” is just a sciency name for what is more commonly known as “editing”.  And you have only to look at a newspaper to see that no amount of editors necessarily precludes egregious errors of fact and logic.  But otherwise, yeah.  Gladwell is a twit.  Sure, he’s sold a lot of books, but then, so did whoever wrote “Who Moved My Cheese” and “If You Give a Mouse a Cookie”.  Does anyone seriously ascribe intellectual relevance to those best-selling authors?\nSteve Sailer follows up Pinker’s stake-and-garlic with a beheading, showing that Gladwell isn’t just a twit,\nhe’s apparently a clueless and cowardly little bitch\nas well:\nWithout admitting it, Gladwell seems to have given up former position that NFL achievement “can’t be predicted,” there’s “no connection,” etc. etc. He now seems to be saying that, when you take into account the higher pay of higher draft picks, NFL teams aren’t economically optimizing their draft picks, which is a wildly different thing.\nNFL teams aren’t economically optimizing their draft picks!  I’m sure Detroit fans will be SHOCKED… as are those who have suffered through seasons of the Tarvaris Jackson Experiment (2nd round, 2006).  Gladwell obviously pays zero attention to professional football or he could not have possibly have written this:\n“And what Berri and Simmons in particular—and Massey and Thaler in general—remind us is that that kind of blind faith in the likes of Matt Millen and Al Davis simply isn’t justified.”\nYes, because there were just\nmassive\nlegions of fans in Detroit and Oakland with\nblind faith\nin Davis and Millen…. For crying out loud, why do some people find it so impossible to admit that they’re wrong even when smart people are rubbing their noses in their mistakes in the national media?  Everyone is wrong from time to time.  Absolutely everyone!  I despise those who try to move the goalposts once they’ve been cornered and proven wrong; are they so stupid that they genuinely believe that no one is going to notice that what they’re saying now is not what they were saying before?",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-11-20T21:00:00+00:00"
}