{
  "url": "https://voxday.net/2009/11/05/is-rumfeldian-rubik-solved/",
  "scraped_at": "2026-01-08T23:11:31.886844",
  "title": "Is the Rumsfeldian Rubik solved?",
  "date_display": "November 5, 2009",
  "date_iso": "2009-11-05T21:06:00+00:00",
  "date_from_url": "2009-11-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Perhaps <a href=\"http://www.foxnews.com/story/0,2933,572305,00.html\">the Fort Hood murders</a> are unrelated to the Global Struggle Against Violent Extremism and it’s just another disgruntled postal worker or three run amok, but it would appear that after only eight years, the terrorists have finally figured out the flaw in the clever Rumsfeldian strategy of fighting them there so we don’t have to fight them there.</p><blockquote><p>A mass shooting at Ft. Hood military post in Texas has left at least 7 dead and 20 wounded [MSNBC is reporting 12 and 31 now -VD] and one suspected gunman is on the loose, officials told Fox News.  A massive manhunt was under way for the suspect at large, Fox News confirmed. One person was in custody. The New York Post said that there were two shooters at the Army post massacre; other reports said there were three.</p></blockquote><p>I wouldn’t bet on the postal workers, though.</p><p>UPDATE – the attempted PC spin never fails to amuse: <i>“The official said the shootings could have been a criminal matter rather than a terrorism-related attack and that there was no intelligence to suggest a plot against Fort Hood.”</i></p><p>Or, it could have been an attack by aliens who have secretly infiltrated the U.S. military disguised as humans as part of their master plan to steal Earth’s water.  Or perhaps highly evolved land sharks.  But surely not Islamic terrorism, since we’re, you know, fighting them <i>over there</i>.</p><p>UPDATE II – I’m sure we are all shocked: <i>“The suspected gunman was identified as Major Malik Nadal Hasan.”</i> More of the joys of multiculturalism.</p></div>",
  "content_text": "Perhaps\nthe Fort Hood murders\nare unrelated to the Global Struggle Against Violent Extremism and it’s just another disgruntled postal worker or three run amok, but it would appear that after only eight years, the terrorists have finally figured out the flaw in the clever Rumsfeldian strategy of fighting them there so we don’t have to fight them there.\nA mass shooting at Ft. Hood military post in Texas has left at least 7 dead and 20 wounded [MSNBC is reporting 12 and 31 now -VD] and one suspected gunman is on the loose, officials told Fox News.  A massive manhunt was under way for the suspect at large, Fox News confirmed. One person was in custody. The New York Post said that there were two shooters at the Army post massacre; other reports said there were three.\nI wouldn’t bet on the postal workers, though.\nUPDATE – the attempted PC spin never fails to amuse:\n“The official said the shootings could have been a criminal matter rather than a terrorism-related attack and that there was no intelligence to suggest a plot against Fort Hood.”\nOr, it could have been an attack by aliens who have secretly infiltrated the U.S. military disguised as humans as part of their master plan to steal Earth’s water.  Or perhaps highly evolved land sharks.  But surely not Islamic terrorism, since we’re, you know, fighting them\nover there\n.\nUPDATE II – I’m sure we are all shocked:\n“The suspected gunman was identified as Major Malik Nadal Hasan.”\nMore of the joys of multiculturalism.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-11-05T21:06:00+00:00"
}