{
  "url": "https://voxday.net/2009/11/04/letter-to-common-sense-atheism-v/",
  "scraped_at": "2026-01-08T23:11:26.378926",
  "title": "Letter to Common Sense Atheism V",
  "date_display": "November 4, 2009",
  "date_iso": "2009-11-04T16:15:00+00:00",
  "date_from_url": "2009-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dear Luke,</p><p>I fear you have misunderstood the pleasure I take in demonstrating the waywardness of paths that do not lead to the truth for my purpose in seeking the correct one.  A path believed to be correct is either so or it is not so.  Observing the falsity of your claims to superlative theological knowledge was more than a work of my peculiar art, it was necessary for us to even begin getting at the truth of the matter because what we do not know usually impairs our ability to reason less than our belief in the truth of that which is false.  Given that you are contemplating the pursuit of a philosophy PhD, I can safely assume you have read Plato’s <i>Apology</i>.  If you have, then you will surely recall the way in which Socrates paraphrased the Oracle’s reference to him.  “He, O men, is the wisest, who, like Socrates, knows that his wisdom is in truth worth nothing.”  I see no need to dispute your claim to have spent hundreds of hours reading the Bible and various theological texts, because it is irrelevant.</p><p>Apes do read theology, Luke, they just don’t understand it.  Christianity no more concerns a Panglossian world actively managed by a magical omnibenevolent puppet-master where all things work out for the good of everyone than Aristotle was Belgian or the central message of Buddhism is every man for himself.</p><p>Before I get to the substance of this discussion, I find myself interested in learning how your belief in desirism is off-topic, given that: a) you up brought the subject and went into a fair amount of detail in describing it, b) this discussion does not only concern my beliefs, but yours as well, and, c) desirism is directly relevant to your definition of evil.  You must know that the references to your FAQ don’t even begin to answer the very serious philosophical and material problems with desirism that were articulated in my last letter.  In addition to the fact that you “answered” by referring to two points that remain unwritten, it is not accurate to say that the references to the answers to {3.20}, {3.21}, {3.22} addressed the problems raised, much less <i>successfully</i> addressed them.  Lest I find myself charged with more obscurantism or hand-waving, I will now explain why those three answers are insufficient.  I trust the nonexistence of answers {3.23} and {5.31} will serve to demonstrate the inadequacy of your present response to my points about the totalitarian aspects of desirism as well as the way in which desirism resembles a collectivist variant of Maoist ethics.</p><p>In {3.20} you answer the desirist calculation problem by asserting that “we can estimate” desires, that “neuroscience will eventually tell us” what desires look like and how to measure them, and that “we may be able to understand” the relationship between desires.  This is not an answer, this is just hope and hand-waving.  {3.21} is nothing more than another failure to apply the correct definition of the word “objective” to desirism in order to claim that an intrinsically subjective concept is actually objective.  This is not only absurd, but it has absolutely nothing to do with my criticism of desirism.  Furthermore, I explained the specious nature of this definitional dancing in my previous letter: “While it is true that there are many different definitions of objective and subjective, the philosophers’ concept of mind-independence is no more relevant to the subject at hand than the grammatical concept pertaining to the use of a form as the object of a transitive verb.”  {3.22} is merely a repetition of the very Knob Metaphor I had shown to be not only flawed, but downright backwards since it led you to an incorrect conclusion.  As I wrote, under the desirist moral code, the Nazi extermination program is confirmed to be good and and opposition to it, <i>or even mitigation of it</i>, is a definite evil.</p><p>You didn’t even make the slightest attempt to address that massive flaw in your reasoning, either in your FAQ or in your letter.  Now, I see no need to continue beating a deceased equine, so if at this point you wish to leave off discussing desirism, that’s certainly fine with me.  My recommendation would be that you abandon it altogether as an insignificant and untenable variant of utilitarianism, but that is your concern, not mine.  Still, I don’t regret the diversion as I find it fascinating how decent and civilized Western atheists have nevertheless managed to conceive what appears to be a more consequentially disastrous moral ethic than the one that produced the horrors of the Great Leap Forward.</p><p>Now Luke, there is a pattern of evasion that is becoming increasingly apparent in your letters, and I fail to see how it is either compatible with your personal search for the truth or can be of any utility to you in this discussion.  I am perfectly willing to continue refining our terms in as pedantic a manner as you require until you eventually run out of room to dance around the most relevant dictionary definition and have no choice but to directly confront the matter at hand.  I  did not declare “that the truth value of a proposition does not depend on the meaning of its terms”, I merely stated that given the context of the question, which your belief in <i>any form of evil</i>.  I already knew you didn’t believe in my definition of evil because you made it very clear that you did not in your second letter, so it was simply absurd to assert that you needed to be informed a second time of what I meant by “evil” before you could answer the question of whether you believe in it or not.  Of course, I could have avoided this by pinning you down more specifically regarding your belief or unbelief in <i>any form of evil</i> and now that I know you require a greater degree of precision on my part in order to respond in a relevant manner, I will be quite happy to provide it.  Meta-ethical philosopher Stephen Finlay’s belief in evil is of zero relevance here, it is only your belief that is relevant to this discussion.  Please note your declaration that “the definition of evil that we are using” cannot be contained by “any form of evil” is illogical; surely you did not mean to assert that the set does not contain the subset!</p><p>You finally admitted that you believe in a subjective form of evil in your fourth letter, although your constant wrestling with the objective/subjective issue somewhat muddied the admission.  This mildly complicates the discussion, but not severely since it does not affect your ability to discern which of the competing objective standards are most in line with your observations of the material world even though you happen to subscribe to none of them.  Speaking of definitions, while I agree that pain, anguish and privation of joy can all be reasonably described as suffering and that suffering is a prominent feature of this fallen world, I cannot accept your suggestion of it as a substitute for evil.  This is because for the Christian and the non-Christian alike, suffering can be quite reasonably deemed a distinctly positive good.  For example, a Christian is told to rejoice when he suffers for the faith, because he will be rewarded in Heaven for his travails and the testimony his suffering provides will cause others to believe in the gospel of salvation through Jesus Christ.  While we cannot confirm the former consequence, there can be no doubting the truth of the latter as it is known to have occurred in persecutions of Christians ranging from ancient Rome to modern North Korea.</p><p>And suffering can be a positive good for the non-Christian as well.  The pagan mother will embrace the pain of childbirth as gladly as the strong Christian embraces martyrdom; no pain can considered evil when it is an inescapable necessity for such a powerfully desired result.  Even the language of the weight room testifies to the non-intrinsically evil nature of suffering: “no pain, no gain”.  The suffering is voluntarily chosen and becomes the price of the good.  While suffering can certainly be the result of evil, I don’t think it can serve as a reasonable substitution for it.  We deem it evil for a man to kill 10 people because it amused him, but we do not consider a lethal storm that killed just as many to be evil even if an equivalent amount of suffering is created by the two incidents.  Furthermore, suffering lacks the intentional aspect that is usually required to deem an act or an intention evil.  So, taking that aspect into account, I suggest that we define <i>”taking pleasure in the involuntary and unjust suffering of another”</i> to be evil.</p><p>I entirely agree with your statement that our arguments will not meet each other if we do not agree upon a definition of evil.  This is precisely why I am trying to get you to commit to one.  And I also agree that I could quite easily construct a completely circular argument on the basis of my Christian definition of evil; this is precisely why I am trying to get you to commit to an objective and observable one.  So, with that in mind, would you be willing to agree to a definition of evil as “<i>”taking pleasure in the involuntary and unjust suffering of another”</i> as a useful metric by which we can compare the competing religious and philosophical accounts of evil?  While this is merely one of the broad panoply of theoretical evils from which we could plausibly select, it would at least serve as a reasonable starting point for the proposed comparison of various religious and philosophical accounts of evil.</p><p>This was written in response to the <a href=\"http://commonsenseatheism.com/?p=4203\">5th Letter to Vox Day</a></p></div>",
  "content_text": "Dear Luke,\nI fear you have misunderstood the pleasure I take in demonstrating the waywardness of paths that do not lead to the truth for my purpose in seeking the correct one.  A path believed to be correct is either so or it is not so.  Observing the falsity of your claims to superlative theological knowledge was more than a work of my peculiar art, it was necessary for us to even begin getting at the truth of the matter because what we do not know usually impairs our ability to reason less than our belief in the truth of that which is false.  Given that you are contemplating the pursuit of a philosophy PhD, I can safely assume you have read Plato’s\nApology\n.  If you have, then you will surely recall the way in which Socrates paraphrased the Oracle’s reference to him.  “He, O men, is the wisest, who, like Socrates, knows that his wisdom is in truth worth nothing.”  I see no need to dispute your claim to have spent hundreds of hours reading the Bible and various theological texts, because it is irrelevant.\nApes do read theology, Luke, they just don’t understand it.  Christianity no more concerns a Panglossian world actively managed by a magical omnibenevolent puppet-master where all things work out for the good of everyone than Aristotle was Belgian or the central message of Buddhism is every man for himself.\nBefore I get to the substance of this discussion, I find myself interested in learning how your belief in desirism is off-topic, given that: a) you up brought the subject and went into a fair amount of detail in describing it, b) this discussion does not only concern my beliefs, but yours as well, and, c) desirism is directly relevant to your definition of evil.  You must know that the references to your FAQ don’t even begin to answer the very serious philosophical and material problems with desirism that were articulated in my last letter.  In addition to the fact that you “answered” by referring to two points that remain unwritten, it is not accurate to say that the references to the answers to {3.20}, {3.21}, {3.22} addressed the problems raised, much less\nsuccessfully\naddressed them.  Lest I find myself charged with more obscurantism or hand-waving, I will now explain why those three answers are insufficient.  I trust the nonexistence of answers {3.23} and {5.31} will serve to demonstrate the inadequacy of your present response to my points about the totalitarian aspects of desirism as well as the way in which desirism resembles a collectivist variant of Maoist ethics.\nIn {3.20} you answer the desirist calculation problem by asserting that “we can estimate” desires, that “neuroscience will eventually tell us” what desires look like and how to measure them, and that “we may be able to understand” the relationship between desires.  This is not an answer, this is just hope and hand-waving.  {3.21} is nothing more than another failure to apply the correct definition of the word “objective” to desirism in order to claim that an intrinsically subjective concept is actually objective.  This is not only absurd, but it has absolutely nothing to do with my criticism of desirism.  Furthermore, I explained the specious nature of this definitional dancing in my previous letter: “While it is true that there are many different definitions of objective and subjective, the philosophers’ concept of mind-independence is no more relevant to the subject at hand than the grammatical concept pertaining to the use of a form as the object of a transitive verb.”  {3.22} is merely a repetition of the very Knob Metaphor I had shown to be not only flawed, but downright backwards since it led you to an incorrect conclusion.  As I wrote, under the desirist moral code, the Nazi extermination program is confirmed to be good and and opposition to it,\nor even mitigation of it\n, is a definite evil.\nYou didn’t even make the slightest attempt to address that massive flaw in your reasoning, either in your FAQ or in your letter.  Now, I see no need to continue beating a deceased equine, so if at this point you wish to leave off discussing desirism, that’s certainly fine with me.  My recommendation would be that you abandon it altogether as an insignificant and untenable variant of utilitarianism, but that is your concern, not mine.  Still, I don’t regret the diversion as I find it fascinating how decent and civilized Western atheists have nevertheless managed to conceive what appears to be a more consequentially disastrous moral ethic than the one that produced the horrors of the Great Leap Forward.\nNow Luke, there is a pattern of evasion that is becoming increasingly apparent in your letters, and I fail to see how it is either compatible with your personal search for the truth or can be of any utility to you in this discussion.  I am perfectly willing to continue refining our terms in as pedantic a manner as you require until you eventually run out of room to dance around the most relevant dictionary definition and have no choice but to directly confront the matter at hand.  I  did not declare “that the truth value of a proposition does not depend on the meaning of its terms”, I merely stated that given the context of the question, which your belief in\nany form of evil\n.  I already knew you didn’t believe in my definition of evil because you made it very clear that you did not in your second letter, so it was simply absurd to assert that you needed to be informed a second time of what I meant by “evil” before you could answer the question of whether you believe in it or not.  Of course, I could have avoided this by pinning you down more specifically regarding your belief or unbelief in\nany form of evil\nand now that I know you require a greater degree of precision on my part in order to respond in a relevant manner, I will be quite happy to provide it.  Meta-ethical philosopher Stephen Finlay’s belief in evil is of zero relevance here, it is only your belief that is relevant to this discussion.  Please note your declaration that “the definition of evil that we are using” cannot be contained by “any form of evil” is illogical; surely you did not mean to assert that the set does not contain the subset!\nYou finally admitted that you believe in a subjective form of evil in your fourth letter, although your constant wrestling with the objective/subjective issue somewhat muddied the admission.  This mildly complicates the discussion, but not severely since it does not affect your ability to discern which of the competing objective standards are most in line with your observations of the material world even though you happen to subscribe to none of them.  Speaking of definitions, while I agree that pain, anguish and privation of joy can all be reasonably described as suffering and that suffering is a prominent feature of this fallen world, I cannot accept your suggestion of it as a substitute for evil.  This is because for the Christian and the non-Christian alike, suffering can be quite reasonably deemed a distinctly positive good.  For example, a Christian is told to rejoice when he suffers for the faith, because he will be rewarded in Heaven for his travails and the testimony his suffering provides will cause others to believe in the gospel of salvation through Jesus Christ.  While we cannot confirm the former consequence, there can be no doubting the truth of the latter as it is known to have occurred in persecutions of Christians ranging from ancient Rome to modern North Korea.\nAnd suffering can be a positive good for the non-Christian as well.  The pagan mother will embrace the pain of childbirth as gladly as the strong Christian embraces martyrdom; no pain can considered evil when it is an inescapable necessity for such a powerfully desired result.  Even the language of the weight room testifies to the non-intrinsically evil nature of suffering: “no pain, no gain”.  The suffering is voluntarily chosen and becomes the price of the good.  While suffering can certainly be the result of evil, I don’t think it can serve as a reasonable substitution for it.  We deem it evil for a man to kill 10 people because it amused him, but we do not consider a lethal storm that killed just as many to be evil even if an equivalent amount of suffering is created by the two incidents.  Furthermore, suffering lacks the intentional aspect that is usually required to deem an act or an intention evil.  So, taking that aspect into account, I suggest that we define\n”taking pleasure in the involuntary and unjust suffering of another”\nto be evil.\nI entirely agree with your statement that our arguments will not meet each other if we do not agree upon a definition of evil.  This is precisely why I am trying to get you to commit to one.  And I also agree that I could quite easily construct a completely circular argument on the basis of my Christian definition of evil; this is precisely why I am trying to get you to commit to an objective and observable one.  So, with that in mind, would you be willing to agree to a definition of evil as “\n”taking pleasure in the involuntary and unjust suffering of another”\nas a useful metric by which we can compare the competing religious and philosophical accounts of evil?  While this is merely one of the broad panoply of theoretical evils from which we could plausibly select, it would at least serve as a reasonable starting point for the proposed comparison of various religious and philosophical accounts of evil.\nThis was written in response to the\n5th Letter to Vox Day",
  "tags": [
    "atheism",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-11-04T16:15:00+00:00"
}