{
  "url": "https://voxday.net/2009/11/17/malcolm-gladwell-is-whiny-little-liar/",
  "scraped_at": "2026-01-08T23:12:29.465839",
  "title": "Malcolm Gladwell is a whiny little liar",
  "date_display": "November 17, 2009",
  "date_iso": "2009-11-17T18:16:00+00:00",
  "date_from_url": "2009-11-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>His <a href=\"http://gladwell.typepad.com/gladwellcom/2009/11/pinker-on-what-the-dog-saw.html\">hapless attempt at CYA</a> isn’t going to convince anyone who isn’t already foolish enough to take the silly man seriously:</p><blockquote><p>It is always a pleasure to be reviewed by someone as accomplished as Stephen Pinker, even if—in his comments on “What the Dog Saw” (Nov. 15)—he is unhappy with my spelling (rightly!) and with the fact that I have not joined him on the lonely ice floe of IQ fundamentalism. But since football has been on my mind these days, I do want to make one small observation about his comments.</p><p>In one of my essays, I wrote that the position a quarterback is taken in the college draft is not a reliable indicator of his performance as a professional. That was based on the work of the academic economists David Berri and Rob Simmons, who, in a paper published the Journal of Productivity Analysis,  analyze forty years of National Football League data. Their conclusion was that the relation between aggregate quarterback performance and draft position was weak. Further, when they looked at per-play performance—in other words, when they adjusted for the fact that highly drafted quarterbacks are more likely to play more downs—they found that quarterbacks taken in positions 11 through 90 in the draft actually slightly outplay those more highly paid and lauded players taken in the draft’s top ten positions. I found this analysis fascinating. Pinker did not. This quarterback argument, he wrote, “is simply not true.”</p><p>I wondered about the basis of Pinker’s conclusion, so I e-mailed him, asking if he could tell me where to find the scientific data that would set me straight. He very graciously wrote me back. He had three sources, he said. The first was Steve Sailer. Sailer, for the uninitiated, is a California blogger with a marketing background who is best known for his belief that black people are intellectually inferior to white people. Sailer’s “proof” of the connection between draft position and performance is, I’m sure Pinker would agree, crude: his key variable is how many times a player has been named to the Pro Bowl.</p></blockquote><p>First, describing an eigenvalue as an “Igon Value” is not a spelling error, it’s strong evidence that you don’t know what the hell you are writing about.  It’s like an economist writing about Gross Domestic Prada; the nature of the mistake reveals the full extent of the ignorance.  Second, <a href=\"http://isteve.blogspot.com/2009/11/gladwell-strikes-back.html\">as Steve Sailer points out</a>, Gladwell did not write “that the position a quarterback is taken in the college draft is not a reliable indicator of his performance”, instead he claimed that there was “no connection between where a quarterback was taken in the draft… and how well he played in the pros.”  This clearly reveals that Gladwell is not only ignorant of eigenvalues, but of the NFL as well.  Yes, JaMarcus Russell sucks, as anyone with half a brain knew he would, but it’s not hard to note that the distribution of the excellent young quarterbacks in the league, from Eli Manning, Phillip Rivers and Ben Rothlisberger to Matt Ryan and Joe Flacco, was not random throughout the draft as it would be if Gladwell’s thesis was correct.  When it’s Gladwell vs Football Outsiders, who are you going to believe?</p><p>Third, Pro Bowls are a perfectly reasonable measure of NFL excellence, the players’ voting bias towards past performance notwithstanding.  More importantly, though, it’s only one of several measures that Sailer has cited, all of which demonstrate Gladwell’s ridiculous assertion to be false.  And fourth, Gladwell’s attack on Sailer as a source for Pinker is nothing but a naked genetic fallacy and suffices to show what a scrawny little slimeball he is.</p></div>",
  "content_text": "His\nhapless attempt at CYA\nisn’t going to convince anyone who isn’t already foolish enough to take the silly man seriously:\nIt is always a pleasure to be reviewed by someone as accomplished as Stephen Pinker, even if—in his comments on “What the Dog Saw” (Nov. 15)—he is unhappy with my spelling (rightly!) and with the fact that I have not joined him on the lonely ice floe of IQ fundamentalism. But since football has been on my mind these days, I do want to make one small observation about his comments.\nIn one of my essays, I wrote that the position a quarterback is taken in the college draft is not a reliable indicator of his performance as a professional. That was based on the work of the academic economists David Berri and Rob Simmons, who, in a paper published the Journal of Productivity Analysis,  analyze forty years of National Football League data. Their conclusion was that the relation between aggregate quarterback performance and draft position was weak. Further, when they looked at per-play performance—in other words, when they adjusted for the fact that highly drafted quarterbacks are more likely to play more downs—they found that quarterbacks taken in positions 11 through 90 in the draft actually slightly outplay those more highly paid and lauded players taken in the draft’s top ten positions. I found this analysis fascinating. Pinker did not. This quarterback argument, he wrote, “is simply not true.”\nI wondered about the basis of Pinker’s conclusion, so I e-mailed him, asking if he could tell me where to find the scientific data that would set me straight. He very graciously wrote me back. He had three sources, he said. The first was Steve Sailer. Sailer, for the uninitiated, is a California blogger with a marketing background who is best known for his belief that black people are intellectually inferior to white people. Sailer’s “proof” of the connection between draft position and performance is, I’m sure Pinker would agree, crude: his key variable is how many times a player has been named to the Pro Bowl.\nFirst, describing an eigenvalue as an “Igon Value” is not a spelling error, it’s strong evidence that you don’t know what the hell you are writing about.  It’s like an economist writing about Gross Domestic Prada; the nature of the mistake reveals the full extent of the ignorance.  Second,\nas Steve Sailer points out\n, Gladwell did not write “that the position a quarterback is taken in the college draft is not a reliable indicator of his performance”, instead he claimed that there was “no connection between where a quarterback was taken in the draft… and how well he played in the pros.”  This clearly reveals that Gladwell is not only ignorant of eigenvalues, but of the NFL as well.  Yes, JaMarcus Russell sucks, as anyone with half a brain knew he would, but it’s not hard to note that the distribution of the excellent young quarterbacks in the league, from Eli Manning, Phillip Rivers and Ben Rothlisberger to Matt Ryan and Joe Flacco, was not random throughout the draft as it would be if Gladwell’s thesis was correct.  When it’s Gladwell vs Football Outsiders, who are you going to believe?\nThird, Pro Bowls are a perfectly reasonable measure of NFL excellence, the players’ voting bias towards past performance notwithstanding.  More importantly, though, it’s only one of several measures that Sailer has cited, all of which demonstrate Gladwell’s ridiculous assertion to be false.  And fourth, Gladwell’s attack on Sailer as a source for Pinker is nothing but a naked genetic fallacy and suffices to show what a scrawny little slimeball he is.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-11-17T18:16:00+00:00"
}