{
  "url": "https://voxday.net/2009/11/26/more-climate-fraud/",
  "scraped_at": "2026-01-08T23:13:12.623236",
  "title": "More climate fraud",
  "date_display": "November 26, 2009",
  "date_iso": "2009-11-26T08:31:00+00:00",
  "date_from_url": "2009-11-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This time, <a href=\"http://wattsupwiththat.com/2009/11/25/uh-oh-raw-data-in-new-zealand-tells-a-different-story-than-the-official-one/\">it’s in New Zealand</a>:</p><blockquote><p>The New Zealand Government’s chief climate advisory unit NIWA is under fire for allegedly massaging raw climate data to show a global warming trend that wasn’t there.  The scandal breaks as fears grow worldwide that corruption of climate science is not confined to just Britain’s CRU climate research centre.  In New Zealand’s case, the figures published on NIWA’s [the National Institute of Water and Atmospheric research] website suggest a strong warming trend….  But analysis of the raw climate data from the same temperature stations has just turned up a very different result.</p></blockquote><p>Worldwide fears?  More like worldwide conclusions.  I’m not at all surprised.  The strong probability is that it has ALL been more or less faked, so the more closely the climate data is examined, the more likely it is that some amount of fraud is going to be detected.  This is why no “scientific consensus” that does not involve genuinely observable and replicable science should ever be considered science.  Today’s scientists held a position of public respect that relied on the successes of their predecessors but they have been shown to be unworthy of it with their stupid and shabby attempts to pass of non-science as science.</p><p>Science is not, and never will be, “what scientists happen to believe now”.  That’s merely opinion, and often it’s not even informed, educated, or honest opinion.</p><p>Incredibly, the snake-oil salesmen are still trying to sell their con job to the public: <i>“Tuesday’s report said no credible science supports an alternative hypothesis for the warming trend. Each year this decade has been among the top 10 warmest years since instrumental records began, the scientists said. ‘The science is quite decisive,’ said Michael Mann, a professor at Penn State University. ‘There is a very robust consensus about the reality of climate change and the need to confront it quickly.'”</i></p><p>That, by the way, is the very Michael Mann who created the “hockey stick” fraud.  And unless instrumental records only began ten years ago, each year this decade has NOT been among the top ten warmest years on record. <a href=\"http://www.norcalblogs.com/watts/2007/08/1998_no_longer_the_hottest_yea.html\">The hottest ten years according NASA’s GISS</a> are:</p><ol><li>1934</li><li>1998</li><li>1921</li><li>2006</li><li>1931</li><li>1999</li><li>1953</li><li>1990</li><li>1938</li><li>1939</li></ol></div>",
  "content_text": "This time,\nit’s in New Zealand\n:\nThe New Zealand Government’s chief climate advisory unit NIWA is under fire for allegedly massaging raw climate data to show a global warming trend that wasn’t there.  The scandal breaks as fears grow worldwide that corruption of climate science is not confined to just Britain’s CRU climate research centre.  In New Zealand’s case, the figures published on NIWA’s [the National Institute of Water and Atmospheric research] website suggest a strong warming trend….  But analysis of the raw climate data from the same temperature stations has just turned up a very different result.\nWorldwide fears?  More like worldwide conclusions.  I’m not at all surprised.  The strong probability is that it has ALL been more or less faked, so the more closely the climate data is examined, the more likely it is that some amount of fraud is going to be detected.  This is why no “scientific consensus” that does not involve genuinely observable and replicable science should ever be considered science.  Today’s scientists held a position of public respect that relied on the successes of their predecessors but they have been shown to be unworthy of it with their stupid and shabby attempts to pass of non-science as science.\nScience is not, and never will be, “what scientists happen to believe now”.  That’s merely opinion, and often it’s not even informed, educated, or honest opinion.\nIncredibly, the snake-oil salesmen are still trying to sell their con job to the public:\n“Tuesday’s report said no credible science supports an alternative hypothesis for the warming trend. Each year this decade has been among the top 10 warmest years since instrumental records began, the scientists said. ‘The science is quite decisive,’ said Michael Mann, a professor at Penn State University. ‘There is a very robust consensus about the reality of climate change and the need to confront it quickly.'”\nThat, by the way, is the very Michael Mann who created the “hockey stick” fraud.  And unless instrumental records only began ten years ago, each year this decade has NOT been among the top ten warmest years on record.\nThe hottest ten years according NASA’s GISS\nare:\n1934\n1998\n1921\n2006\n1931\n1999\n1953\n1990\n1938\n1939",
  "tags": [
    "AGW/CC",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-11-26T08:31:00+00:00"
}