{
  "url": "https://voxday.net/2009/11/20/multiculturalism-in-minnesota/",
  "scraped_at": "2026-01-08T23:12:39.645631",
  "title": "Multiculturalism in Minnesota",
  "date_display": "November 20, 2009",
  "date_iso": "2009-11-20T10:43:00+00:00",
  "date_from_url": "2009-11-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I tend to suspect <a href=\"http://www.startribune.com/local/70580252.html?elr=KArksLckD8EQDUoaEyqyP4O:DW3ckUiD3aPc:_Yyc:aUUsA\">the reported “racial tensions”</a> aren’t actually about race.  There were certainly never serious problems of this sort at North, South, Washburn, or Roosevelt when I was in school and there was not exactly a shortage of brothers there:</p><blockquote><p>Racial tension has been building at Owatonna High School this week after a fight broke out Monday between white and Somali students, prompting heightened police presence, backpack searches and widespread parental worries.  Owatonna Police Chief Shaun LaDue said between six and 15 officers have been assigned this week to the school, which usually uses one liaison officer.</p><p>Principal Don Johnson said the problems began when two white students wrote papers in recent weeks that were “inflammatory and very disrespectful.” One student handed out copies of his paper to friends, while the other posted his on a class blog. Both were suspended from the school of 1,600 students — about 100 of whom are Somali.</p><p>Johnson said that before the second student returned to school Monday, the student sent text messages over the weekend to white and Somali students that were “unapologetic and in your face.” He then walked into a common area Monday where more than 20 Somali students were gathered and sat down. An altercation erupted that sent one of the white students to the hospital for observation.</p></blockquote><p>Isn’t it lovely to see such vivid cultural vibrancy filling what was once a pallid and boring German-Scandinavian enclave!  It’s such a pity that the Somali students can’t be left alone to prepare for <a href=\"http://www.jihadwatch.org/2009/09/sixth-minnesota-jihadist-an-american-convert-to-islam-killed-in-somalia.html\">their future jihads</a> in peace.  Of course, given the reported bomb threat, perhaps they won’t even bother returning to Somalia before detonating themselves.</p><p>UPDATE: The only reasonable answer is to <a href=\"http://www.youtube.com/watch?v=3uBqUNv8w8I\">deport the criminal aliens</a>.  If they are so desperate for excitement, there is plenty to be found in their homeland.  Given Minnesota carry laws, it’s only a matter of time before one of the foreign idiots attacks the wrong individual and gets blown away.  At which point, no doubt the Star &amp; Sickle will run the usual sob story about the tragic end of the <s>dead imported thug</s>fine, upstanding example of foreign vibrancy just trying to live the American dream.  And, of course, the need for gun control.</p></div>",
  "content_text": "I tend to suspect\nthe reported “racial tensions”\naren’t actually about race.  There were certainly never serious problems of this sort at North, South, Washburn, or Roosevelt when I was in school and there was not exactly a shortage of brothers there:\nRacial tension has been building at Owatonna High School this week after a fight broke out Monday between white and Somali students, prompting heightened police presence, backpack searches and widespread parental worries.  Owatonna Police Chief Shaun LaDue said between six and 15 officers have been assigned this week to the school, which usually uses one liaison officer.\nPrincipal Don Johnson said the problems began when two white students wrote papers in recent weeks that were “inflammatory and very disrespectful.” One student handed out copies of his paper to friends, while the other posted his on a class blog. Both were suspended from the school of 1,600 students — about 100 of whom are Somali.\nJohnson said that before the second student returned to school Monday, the student sent text messages over the weekend to white and Somali students that were “unapologetic and in your face.” He then walked into a common area Monday where more than 20 Somali students were gathered and sat down. An altercation erupted that sent one of the white students to the hospital for observation.\nIsn’t it lovely to see such vivid cultural vibrancy filling what was once a pallid and boring German-Scandinavian enclave!  It’s such a pity that the Somali students can’t be left alone to prepare for\ntheir future jihads\nin peace.  Of course, given the reported bomb threat, perhaps they won’t even bother returning to Somalia before detonating themselves.\nUPDATE: The only reasonable answer is to\ndeport the criminal aliens\n.  If they are so desperate for excitement, there is plenty to be found in their homeland.  Given Minnesota carry laws, it’s only a matter of time before one of the foreign idiots attacks the wrong individual and gets blown away.  At which point, no doubt the Star & Sickle will run the usual sob story about the tragic end of the\ndead imported thug\nfine, upstanding example of foreign vibrancy just trying to live the American dream.  And, of course, the need for gun control.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-11-20T10:43:00+00:00"
}