{
  "url": "https://voxday.net/2009/11/04/perhaps-not-best-idea/",
  "scraped_at": "2026-01-08T23:11:22.522699",
  "title": "Perhaps not the best idea",
  "date_display": "November 4, 2009",
  "date_iso": "2009-11-04T07:37:00+00:00",
  "date_from_url": "2009-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It appears that a few of the less intelligent atheist ankle-biters have decided that it’s a good idea to attack my writing on economics because they find my opinions on atheism and evolution to be so distasteful.  Amusingly, they have decided that my criticism of Paul Krugman proves that I don’t know anything.  Because, you know, he has a Nobel Prize and all.  As it happens, last night I was re-reading Krugman’s book <i>The Accidental Theorist</i>, published in 1999 with absolutely no perception of the tech bubble that was about to burst.  Instead, he was still worried about currency crises.  I rather like the book because Krugman isn’t a complete idiot, he’s just willfully ignorant and inclined to cling to his defunct Keynesian models.  I intend to go through the chapters and highlight various points of interest good and bad, of which this snide slam on the supply-siders, written in the summer of 1997, is a good example of the latter.</p><blockquote><p>Suppose that you had managed your personal finances based on what you heard four years ago from Newt Gingrich, read in Forbes, or for that matter saw on this very page [The Wall Street Journal].  You would have sold all your stocks and probably put your money into gold.  If the supply-siders were fund managers, not only would you have fired them, you would have sued them for the lack of due diligence.</p></blockquote><p>This inspired me to take a look at the prices of stocks vs gold since August 1997.  Needless to say, there is a very good reason that Paul Krugman admits that he is not a successful investment forecaster.</p><p>Gold: <b>+336%</b> From $324.10 to $1,087.45<br> S&amp;P 500: <b>+9.5%</b> From 954.29 to 1,045.41</br></p><p>And this is not even taking into account the fact that the S&amp;P 500 of today is not the S&amp;P 500 of 12 years ago, as mergers, bankruptcies, and shrinking market caps have caused numerous stocks to vanish.  43 changes were made in 2007 alone!  Suppose that you had managed your personal finances based on what you heard 12 years ago from Paul Krugman… unfortunately, a lot of Americans basically did and went heavily into stocks and real estate instead of gold and commodities.  You would have done rather better to listen to <a href=\"http://www.returnofthegreatdepression.com/about/predictions/\">a non-laureate’s advice</a>.  And even for the five years from 1997 to 2002, you were better off with flat gold than with your stocks down 15 percent.</p><p>I somehow doubt this has caused Paul Krugman to revisit supply-side theory.  Not that I subscribe to it either, but if the performance of the stock markets vs gold is your metric of comparison, well, it would appear a serious rethink is in order.</p><p>But it must be said that Krugman reaches some very worthwhile conclusions on occasion.  Such as when, in the same book, he wrote what are arguably the most relevant words he has ever written: <i>“I am always grateful when influential pundits make such statements, especially in prominent places, for in doing so they protect us from the ever-present temptation to take people seriously simply because they are influential, to imagine that widely-held views must actually make at least some sense.”</i></p></div>",
  "content_text": "It appears that a few of the less intelligent atheist ankle-biters have decided that it’s a good idea to attack my writing on economics because they find my opinions on atheism and evolution to be so distasteful.  Amusingly, they have decided that my criticism of Paul Krugman proves that I don’t know anything.  Because, you know, he has a Nobel Prize and all.  As it happens, last night I was re-reading Krugman’s book\nThe Accidental Theorist\n, published in 1999 with absolutely no perception of the tech bubble that was about to burst.  Instead, he was still worried about currency crises.  I rather like the book because Krugman isn’t a complete idiot, he’s just willfully ignorant and inclined to cling to his defunct Keynesian models.  I intend to go through the chapters and highlight various points of interest good and bad, of which this snide slam on the supply-siders, written in the summer of 1997, is a good example of the latter.\nSuppose that you had managed your personal finances based on what you heard four years ago from Newt Gingrich, read in Forbes, or for that matter saw on this very page [The Wall Street Journal].  You would have sold all your stocks and probably put your money into gold.  If the supply-siders were fund managers, not only would you have fired them, you would have sued them for the lack of due diligence.\nThis inspired me to take a look at the prices of stocks vs gold since August 1997.  Needless to say, there is a very good reason that Paul Krugman admits that he is not a successful investment forecaster.\nGold:\n+336%\nFrom $324.10 to $1,087.45\nS&P 500:\n+9.5%\nFrom 954.29 to 1,045.41\nAnd this is not even taking into account the fact that the S&P 500 of today is not the S&P 500 of 12 years ago, as mergers, bankruptcies, and shrinking market caps have caused numerous stocks to vanish.  43 changes were made in 2007 alone!  Suppose that you had managed your personal finances based on what you heard 12 years ago from Paul Krugman… unfortunately, a lot of Americans basically did and went heavily into stocks and real estate instead of gold and commodities.  You would have done rather better to listen to\na non-laureate’s advice\n.  And even for the five years from 1997 to 2002, you were better off with flat gold than with your stocks down 15 percent.\nI somehow doubt this has caused Paul Krugman to revisit supply-side theory.  Not that I subscribe to it either, but if the performance of the stock markets vs gold is your metric of comparison, well, it would appear a serious rethink is in order.\nBut it must be said that Krugman reaches some very worthwhile conclusions on occasion.  Such as when, in the same book, he wrote what are arguably the most relevant words he has ever written:\n“I am always grateful when influential pundits make such statements, especially in prominent places, for in doing so they protect us from the ever-present temptation to take people seriously simply because they are influential, to imagine that widely-held views must actually make at least some sense.”",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-11-04T07:37:00+00:00"
}