{
  "url": "https://voxday.net/2009/11/21/so-how-about-that-debate-pz/",
  "scraped_at": "2026-01-08T23:12:45.219275",
  "title": "So, how about that debate, PZ?",
  "date_display": "November 21, 2009",
  "date_iso": "2009-11-21T12:02:00+00:00",
  "date_from_url": "2009-11-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Directly contra <a href=\"http://www.milobookclub.com/2009/08/13/at-least-hes-good-for-laug/\">his past excuse-making</a>, PZ Myers has reversed himself and decided that he is willing to engage in public debates with Unworthy Opponents again.  Debates sponsored by Christian radio stations, <a href=\"http://scienceblogs.com/pharyngula/2009/11/kkms_always_quick_to_defend_th.php\">no less</a>!  So, how about that public radio debate on the evidence for gods that Northern Alliance Radio is willing to host, PZ?  Or even one on the scientific evidence for evolution?  Or, in light of <a href=\"http://globaleconomicanalysis.blogspot.com/2009/11/hackers-prove-global-warming-is-scam.html\">the very public unmasking of the AGW/CC charade</a>, we could debate your manifestly unscientific belief in “global warming” aka “climate change”.</p><p>After all, an internationally known skeptic who appears regularly on radio shows around the world thanks to <a href=\"http://www.returnofthegreatdepression.com/about/predictions/\">a series of correct economic and financial forecasts</a> can’t possibly be less of a Worthy Opponent than <a href=\"http://scienceblogs.com/gregladen/2009/11/bergman_vs_myers_debate_should.php\">an erstwhile Jehovah’s Witness and Intelligent Design enthusiast</a>, right?</p><p>As everyone who posseses either above-average intelligence or a functional understanding of human nature has realized at this point, PZ is afraid to debate me because he knows perfectly well that I’ll destroy him regardless of the subject.  His fear is not misplaced; he has the advantage of educational quantity whereas I have the advantage of educational quality as well as an additional 25-35 IQ points.  We both know it, even if he’s not about to admit it in public.  But the real problem is not that PZ is a coward, it is that he is a liar.  That is why why he says he won’t debate crackpots before going on to debate crackpots and why he refuses to make an appearance on the “hostile territory” of a secular radio station before appearing on an openly Christian one.</p><p>Unfortunately, I can’t offer him a debate on teaching intelligent design in science classes because I don’t believe it should be taught there either.  Nor, for that matter should evolution by natural selection.  In fact, I believe the very notion of science classes for the great majority of students is eminently absurd.  We know the American schools cannot teach reading, writing, logic, and personal finance to the great majority of their students, so it is easy to demonstrate that there is neither reason nor evidence to support the notion that the schools are capable of effectively teaching science of any kind.</p><p>Speaking of predictions, I note with some amusement that yesterday mainstream economists were reported to be expecting the exciting 3.5% third quarter Advance report to be revised below three percent in the 2nd report.  (Remember, more than half of that was reported to be the direct result of the government-incentivized Cash for Clunkers-related increase in C.)  In addition to the two scheduled revisions, I think we can safely expect further post facto revisions to the third quarter of 2009 in 2010 and beyond.</p></div>",
  "content_text": "Directly contra\nhis past excuse-making\n, PZ Myers has reversed himself and decided that he is willing to engage in public debates with Unworthy Opponents again.  Debates sponsored by Christian radio stations,\nno less\n!  So, how about that public radio debate on the evidence for gods that Northern Alliance Radio is willing to host, PZ?  Or even one on the scientific evidence for evolution?  Or, in light of\nthe very public unmasking of the AGW/CC charade\n, we could debate your manifestly unscientific belief in “global warming” aka “climate change”.\nAfter all, an internationally known skeptic who appears regularly on radio shows around the world thanks to\na series of correct economic and financial forecasts\ncan’t possibly be less of a Worthy Opponent than\nan erstwhile Jehovah’s Witness and Intelligent Design enthusiast\n, right?\nAs everyone who posseses either above-average intelligence or a functional understanding of human nature has realized at this point, PZ is afraid to debate me because he knows perfectly well that I’ll destroy him regardless of the subject.  His fear is not misplaced; he has the advantage of educational quantity whereas I have the advantage of educational quality as well as an additional 25-35 IQ points.  We both know it, even if he’s not about to admit it in public.  But the real problem is not that PZ is a coward, it is that he is a liar.  That is why why he says he won’t debate crackpots before going on to debate crackpots and why he refuses to make an appearance on the “hostile territory” of a secular radio station before appearing on an openly Christian one.\nUnfortunately, I can’t offer him a debate on teaching intelligent design in science classes because I don’t believe it should be taught there either.  Nor, for that matter should evolution by natural selection.  In fact, I believe the very notion of science classes for the great majority of students is eminently absurd.  We know the American schools cannot teach reading, writing, logic, and personal finance to the great majority of their students, so it is easy to demonstrate that there is neither reason nor evidence to support the notion that the schools are capable of effectively teaching science of any kind.\nSpeaking of predictions, I note with some amusement that yesterday mainstream economists were reported to be expecting the exciting 3.5% third quarter Advance report to be revised below three percent in the 2nd report.  (Remember, more than half of that was reported to be the direct result of the government-incentivized Cash for Clunkers-related increase in C.)  In addition to the two scheduled revisions, I think we can safely expect further post facto revisions to the third quarter of 2009 in 2010 and beyond.",
  "tags": [
    "science",
    "W:AWCAAWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-11-21T12:02:00+00:00"
}