{
  "url": "https://voxday.net/2009/11/27/warning-feminist-committing-historica/",
  "scraped_at": "2026-01-08T23:13:21.867732",
  "title": "Warning: feminist committing historical analogy ahead",
  "date_display": "November 27, 2009",
  "date_iso": "2009-11-27T21:15:00+00:00",
  "date_from_url": "2009-11-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You have to know a bit about Rome to understand how amusing this clueless female <a href=\"http://www.reclusiveleftist.com/2009/11/21/dreaming-of-diocletian/\">attempt to draw upon history</a> is:</p><blockquote><p>When the Roman Empire was broken, Diocletian fixed it. He completely revamped the imperial government, discarding centuries of tradition in favor of a new organizational structure designed to meet the challenges of the day. You can do stuff like that when you’re an emperor. It was sort of a one-man Constitutional Convention.</p></blockquote><p>Considering that Diocletian’s economic reforms were a complete failure – his Edict on Maximum Prices is a byword for futility among economists – he was responsible for the bloodiest Roman religious persecutions since Nero, and his abdication led directly to an empire-wide civil war, it should be readily apparent that the historical example of Diocletian is not the ideal one for a would-be reformer to cite.  It’s almost impressive that the woman managed to outdo Thomas Friedman and his wistful dreams of Communist Chinese autocracy with this historically illiterate analogy.</p><p>Although I have little doubt that given his dithering over Afghanistan and the warnings of a Dubai default, it’s not going to be long before abdication will look more than a little attractive to Obama.</p><p> UPDATE – the poor woman <a href=\"http://www.reclusiveleftist.com/2009/11/27/oh-for-petes-sake/\">still doesn’t realize</a> how dim-witted her attempt to look scholarly by citing history was:</p><blockquote><p>You know what they think is the most important thing about Diocletian? Price controls. I’m serious. The Edict on Maximum Prices: that’s what they think is the big deal. The second thing they know about him is the Christian persecution.  Not one of them even mentions the division of the empire, which by any measure was one of the most critical and formative moments in history (one we’re still living with). None of them mentions the Tetrarchy. None of them is aware of what I would have thought was basic knowledge: that Diocletian fundamentally restructured the Empire and reformulated its constitution.</p></blockquote><p>First, Diocletian didn’t fix anything; most of his policies were failures.  As the Cambridge Medieval History writes: “It is natural to think of Diocletian as the projector and of Constantine as the completer of a new system of government for the Roman Empire, which persisted with mere changes of detail until it was laid in ruins by barbarians.  But in reality, the imperial institutions from Augustus onwards had passed through a course of continuous development.  Diocletian did but accelerate processes which had been in operation from the Empire’s earliest days….”  Of course, “the new type of monarchy” which Diocletian and Constantine established between them was a more centralized, more absolutist one, so it should come as absolutely no surprise that a feminist would find inspiration in it.</p><p>Second, she simply doesn’t understand that the salient point isn’t that Diocletian restructured the Empire, it is that the form his restructuring took was absolutely insane and led to precisely the sort of violent power struggles that could easily have been predicted from the failures of the First and Second Triumvirates, to say nothing of the four wars of the Diadochi that preceded them.  After Diocletian’s abdication in 305, the Tetrarchy lasted precisely ONE year before the inevitable civil wars began; these lasted 18 years until Constantine managed to defeat Maximian, Maxentius, and eventually Licinius in 324.</p><p>Also, Diocletian’s Edict on Maximum Prices is the most important thing about his rule today; it is far more <i>intellectually</i> significant now than the fact that a Roman Emperor elected to centralize power and establish a fundamentally flawed administrative scheme that failed on numerous occasions in the past.  Sure, the division of the empire affected the course of history, but then, so did the foolish decision of Perdiccas to marry Alexander’s sister and in a very similar manner.</p><p>Today, there is no one pushing the notion of four co-presidents and persecutions of American Christians are mostly limited to refusing to let Boy Scout troops meet at schools and refusing to say “Merry Christmas”.  Price controls, on the other hand, are still being enacted around the world despite the fact that Diocletian’s Edict offers powerful evidence that not even an autocratic government with a determined and violent dictator at the helm can successfully debase the currency or enforce predetermined price levels.</p><p>All that being said, note that I am definitely in favor of a third party, a fourth party, and a fifth party.  Regardless of whether you are on the left or the right, you should be able to recognize that America badly needs alternatives to the present bi-factional party ruling on behalf of the banks rather than the liberal or conservative bases its two factions purport to represent.</p></div>",
  "content_text": "You have to know a bit about Rome to understand how amusing this clueless female\nattempt to draw upon history\nis:\nWhen the Roman Empire was broken, Diocletian fixed it. He completely revamped the imperial government, discarding centuries of tradition in favor of a new organizational structure designed to meet the challenges of the day. You can do stuff like that when you’re an emperor. It was sort of a one-man Constitutional Convention.\nConsidering that Diocletian’s economic reforms were a complete failure – his Edict on Maximum Prices is a byword for futility among economists – he was responsible for the bloodiest Roman religious persecutions since Nero, and his abdication led directly to an empire-wide civil war, it should be readily apparent that the historical example of Diocletian is not the ideal one for a would-be reformer to cite.  It’s almost impressive that the woman managed to outdo Thomas Friedman and his wistful dreams of Communist Chinese autocracy with this historically illiterate analogy.\nAlthough I have little doubt that given his dithering over Afghanistan and the warnings of a Dubai default, it’s not going to be long before abdication will look more than a little attractive to Obama.\nUPDATE – the poor woman\nstill doesn’t realize\nhow dim-witted her attempt to look scholarly by citing history was:\nYou know what they think is the most important thing about Diocletian? Price controls. I’m serious. The Edict on Maximum Prices: that’s what they think is the big deal. The second thing they know about him is the Christian persecution.  Not one of them even mentions the division of the empire, which by any measure was one of the most critical and formative moments in history (one we’re still living with). None of them mentions the Tetrarchy. None of them is aware of what I would have thought was basic knowledge: that Diocletian fundamentally restructured the Empire and reformulated its constitution.\nFirst, Diocletian didn’t fix anything; most of his policies were failures.  As the Cambridge Medieval History writes: “It is natural to think of Diocletian as the projector and of Constantine as the completer of a new system of government for the Roman Empire, which persisted with mere changes of detail until it was laid in ruins by barbarians.  But in reality, the imperial institutions from Augustus onwards had passed through a course of continuous development.  Diocletian did but accelerate processes which had been in operation from the Empire’s earliest days….”  Of course, “the new type of monarchy” which Diocletian and Constantine established between them was a more centralized, more absolutist one, so it should come as absolutely no surprise that a feminist would find inspiration in it.\nSecond, she simply doesn’t understand that the salient point isn’t that Diocletian restructured the Empire, it is that the form his restructuring took was absolutely insane and led to precisely the sort of violent power struggles that could easily have been predicted from the failures of the First and Second Triumvirates, to say nothing of the four wars of the Diadochi that preceded them.  After Diocletian’s abdication in 305, the Tetrarchy lasted precisely ONE year before the inevitable civil wars began; these lasted 18 years until Constantine managed to defeat Maximian, Maxentius, and eventually Licinius in 324.\nAlso, Diocletian’s Edict on Maximum Prices is the most important thing about his rule today; it is far more\nintellectually\nsignificant now than the fact that a Roman Emperor elected to centralize power and establish a fundamentally flawed administrative scheme that failed on numerous occasions in the past.  Sure, the division of the empire affected the course of history, but then, so did the foolish decision of Perdiccas to marry Alexander’s sister and in a very similar manner.\nToday, there is no one pushing the notion of four co-presidents and persecutions of American Christians are mostly limited to refusing to let Boy Scout troops meet at schools and refusing to say “Merry Christmas”.  Price controls, on the other hand, are still being enacted around the world despite the fact that Diocletian’s Edict offers powerful evidence that not even an autocratic government with a determined and violent dictator at the helm can successfully debase the currency or enforce predetermined price levels.\nAll that being said, note that I am definitely in favor of a third party, a fourth party, and a fifth party.  Regardless of whether you are on the left or the right, you should be able to recognize that America badly needs alternatives to the present bi-factional party ruling on behalf of the banks rather than the liberal or conservative bases its two factions purport to represent.",
  "tags": [
    "politics",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2009-11-27T21:15:00+00:00"
}