{
  "url": "https://voxday.net/2019/01/13/a-neocon-guard-for-your-mind/",
  "scraped_at": "2025-12-20T05:25:04.565009",
  "title": "A Neocon guard for your mind",
  "date_display": "January 13, 2019",
  "date_iso": "2019-01-13T11:45:01+00:00",
  "date_from_url": "2019-01-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now that Neocon control over the Republican Party and the alternative media has slipped despite their powerful grip on the mainstream media and talk radio, the liberal imperialist world revolutionaries who used to call themselves “neocons” are imitating the SJWs in utilizing a techno-political approach to controlling the narrative <a href=\"https://medium.com/@caityjohnstone/a-new-narrative-control-firm-works-to-destroy-alternative-media-6b6ba43dc8ce\">by policing what you see and hear</a>:</p><blockquote><p>The product which NewsGuard markets to the general public is a browser plugin which advises online media consumers whether a news media outlet is trustworthy or untrustworthy based on a formula with a very pro-establishment bias which sees outlets like Fox News and the US propaganda outlet Voice of America getting trustworthy ratings while outlets like RT get very low ratings for trustworthiness. This plugin dominates the bulk of what comes up when you start researching NewsGuard, but circulating a plugin which individual internet users can voluntarily download to help their rulers control their minds is not one of the more nefarious agendas being pursued by this company. The full MintPress article gives a thorough breakdown of the yucky things NewsGuard has its fingers in, but here’s a summary of five of its more disturbing revelations:</p><p>1. The company has created a service called BrandGuard, billed as a “brand safety tool aimed at helping advertisers keep their brands off of unreliable news and information sites while giving them the assurance they need to support thousands of Green-rated [i.e., Newsguard-approved] news and information sites, big and small.” Popularizing the use of this service will attack the advertising revenue of unapproved alternative media outlets which run ads. NewsGuard is aggressively marketing this service to “ad tech firms, leading agencies, and major advertisers”.</p><p>2. NewsGuard’s advisory board reads like the fellowships list of a neocon think tank, and indeed one of its CEOs, Louis Gordon Crovitz, is a Council on Foreign Relations member who has worked with the American Enterprise Institute and Heritage Foundation. Members of the advisory board include George W Bush’s Secretary of Homeland Security Tom Ridge, deep intelligence community insider Michael Hayden, and the Obama administration’s Richard Stengel, who once publicly supported the need for domestic propaganda in the US. All of these men have appeared in influential think tanks geared toward putting a public smiley face on sociopathic warmongering agendas.</p><p>3. Despite one of its criteria for trustworthy sources being whether or not they are transparent about their funding, the specifics of NewsGuard’s financing is kept secret.</p><p>4. NewsGuard is also planning to get its news-ranking system integrated into social media outlets like Facebook and Twitter, pursuing a partnership which will make pro-establishment media consumption a part of your experience at those sites regardless of whether or not you download a NewsGuard app or plugin.</p><p>5. NewsGuard markets itself to state governments in order to get its plugin installed in all of that state’s public schools and libraries to keep internet users from consuming unauthorized narratives. It has already succeeded in accomplishing this in the state of Hawaii, with all of its library branches now running the NewsGuard plugin.</p></blockquote><p>If they were more honest, they would have simply named the company NeoConGuard, because the entire purpose of NewsGuard is to police the internet on behalf of the Israel First lobby in the United States. That’s why it is focused on upholding the Never-Trump Russia, Russia, Russia narrative and will almost certainly be used to push the state and federal anti-BDS laws as well as war in the Middle East and Ukraine, free trade, and unlimited immigration.</p><p>NeoConGuard is just a techno-political expansion of what Bill Kristol and Jon Podhoretz were trying to do with the now-failed <i>Weekly Standard</i>, which by Podhoretz’s own admission was “to create a publication that would help guide and keep honest the hard-charging Republican party that had scored its stunning lopsided victory over Bill Clinton’s Democrats.”</p></div>",
  "content_text": "Now that Neocon control over the Republican Party and the alternative media has slipped despite their powerful grip on the mainstream media and talk radio, the liberal imperialist world revolutionaries who used to call themselves “neocons” are imitating the SJWs in utilizing a techno-political approach to controlling the narrative\nby policing what you see and hear\n:\nThe product which NewsGuard markets to the general public is a browser plugin which advises online media consumers whether a news media outlet is trustworthy or untrustworthy based on a formula with a very pro-establishment bias which sees outlets like Fox News and the US propaganda outlet Voice of America getting trustworthy ratings while outlets like RT get very low ratings for trustworthiness. This plugin dominates the bulk of what comes up when you start researching NewsGuard, but circulating a plugin which individual internet users can voluntarily download to help their rulers control their minds is not one of the more nefarious agendas being pursued by this company. The full MintPress article gives a thorough breakdown of the yucky things NewsGuard has its fingers in, but here’s a summary of five of its more disturbing revelations:\n1. The company has created a service called BrandGuard, billed as a “brand safety tool aimed at helping advertisers keep their brands off of unreliable news and information sites while giving them the assurance they need to support thousands of Green-rated [i.e., Newsguard-approved] news and information sites, big and small.” Popularizing the use of this service will attack the advertising revenue of unapproved alternative media outlets which run ads. NewsGuard is aggressively marketing this service to “ad tech firms, leading agencies, and major advertisers”.\n2. NewsGuard’s advisory board reads like the fellowships list of a neocon think tank, and indeed one of its CEOs, Louis Gordon Crovitz, is a Council on Foreign Relations member who has worked with the American Enterprise Institute and Heritage Foundation. Members of the advisory board include George W Bush’s Secretary of Homeland Security Tom Ridge, deep intelligence community insider Michael Hayden, and the Obama administration’s Richard Stengel, who once publicly supported the need for domestic propaganda in the US. All of these men have appeared in influential think tanks geared toward putting a public smiley face on sociopathic warmongering agendas.\n3. Despite one of its criteria for trustworthy sources being whether or not they are transparent about their funding, the specifics of NewsGuard’s financing is kept secret.\n4. NewsGuard is also planning to get its news-ranking system integrated into social media outlets like Facebook and Twitter, pursuing a partnership which will make pro-establishment media consumption a part of your experience at those sites regardless of whether or not you download a NewsGuard app or plugin.\n5. NewsGuard markets itself to state governments in order to get its plugin installed in all of that state’s public schools and libraries to keep internet users from consuming unauthorized narratives. It has already succeeded in accomplishing this in the state of Hawaii, with all of its library branches now running the NewsGuard plugin.\nIf they were more honest, they would have simply named the company NeoConGuard, because the entire purpose of NewsGuard is to police the internet on behalf of the Israel First lobby in the United States. That’s why it is focused on upholding the Never-Trump Russia, Russia, Russia narrative and will almost certainly be used to push the state and federal anti-BDS laws as well as war in the Middle East and Ukraine, free trade, and unlimited immigration.\nNeoConGuard is just a techno-political expansion of what Bill Kristol and Jon Podhoretz were trying to do with the now-failed\nWeekly Standard\n, which by Podhoretz’s own admission was “to create a publication that would help guide and keep honest the hard-charging Republican party that had scored its stunning lopsided victory over Bill Clinton’s Democrats.”",
  "tags": [
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-13T11:45:01+00:00"
}