{
  "url": "https://voxday.net/2019/01/15/advertisement-as-diversity-lecture/",
  "scraped_at": "2025-12-20T05:25:23.981045",
  "title": "Advertisement as diversity lecture",
  "date_display": "January 15, 2019",
  "date_iso": "2019-01-15T12:49:21+00:00",
  "date_from_url": "2019-01-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Why is Gillette lecturing white American men <a href=\"https://www.rt.com/usa/448820-gillette-toxic-masculinity-ad/\">about social justice and the evils of masculinity</a>?</p><blockquote class=\"tr_bq\"><p>Gillette is learning most people don’t want moral lessons from their razors after experiencing a colossal backlash against an ad they ran condemning “toxic masculinity.” As of Monday evening, the clip had over 122,000 dislikes and counting on YouTube (a 1:10 like:dislike ratio), with negative comments accumulating faster than they can be removed.</p></blockquote><p>Diversity would be why:</p><blockquote class=\"tr_bq\"><p>Gillette is “aiming to inspire change by acknowledging that the old saying ‘Boys Will Be Boys’ is not an excuse,” Gillette’s North American brand director Pankaj Bhalla told the Wall Street Journal. “We want to hold ourselves to a higher standard, and hope all the men we serve will come along on that journey to find our ‘best’ together.”</p></blockquote><p>Meanwhile, Congressional Republicans prove, as if yet another proof was needed, that <a href=\"https://thehill.com/homenews/senate/425348-another-gop-lawmaker-calls-on-steve-king-to-resign-over-white-supremacy\">Republicans are the Stupid Party</a>:</p><blockquote><p>House GOP leaders moved Monday to remove Rep. Steve King (R-Iowa) from all of his committee assignments following a firestorm over remarks considered racist. King faced bipartisan criticism after telling <i>The New York Times</i> in an interview published last week, “White nationalist, white supremacist, Western civilization — how did that language become offensive?”</p><p>King had been a member of the House Judiciary, Agriculture and Small Business committees. He had also served as chairman of the House Judiciary Subcommittee on the Constitution and Civil Justice in the last Congress, and could have stood to serve as its ranking member under the Democratic majority.</p></blockquote><p>Do the House GOP leaders truly not understand that whites are the only people who vote for Republicans in large numbers? Do they seriously not understand that Republicans are NEVER, EVER going to win the La Razan, the Vibrancy, the Diversity, or the Neo-Palestinian votes, no matter how many anti-white self-flagellating theatrics they put on display?</p><p>The fact is that Rep. King is absolutely right. No civilization can be restored with another people’s children. Immigration is invasion and diversity is the death of Western civilization. Without the European peoples, without Christianity, or without the Greco-Roman philosophical tradition, Western civilization cannot and will not survive.</p><p>However, Rep. King was also criminally stupid to sit down for an interview with <i>The New York Times</i>. What did he think was going to happen? DO NOT TALK TO THE MEDIA! How hard is that? How many times do stupidly vain men and women of the Right need to learn that they simply should not talk to the media UNDER ANY CIRCUMSTANCES whatsoever.</p><p>It doesn’t matter if you very cleverly record the interview. It doesn’t matter what the nominal topic is. It doesn’t matter if you are a freaking CONGRESSMAN and you release an official statement from your office to set the record straight, a statement that makes it clear you did not ever say what the media falsely claims you said.</p><p>This is precisely why I never, ever, talk to the media about anything anymore. Not even about completely apolitical subjects relating to books I have written, games I have designed, or comics I have published. Since November, I have probably turned down over 50 media and new media requests for interviews about <i>Jordanetics </i>alone, and about a dozen more concerning our claims and the class-action claims against Indiegogo. Stefan Molyneux had it right all along.</p><p>DO. NOT. TALK. TO. THE. MEDIA.</p></div>",
  "content_text": "Why is Gillette lecturing white American men\nabout social justice and the evils of masculinity\n?\nGillette is learning most people don’t want moral lessons from their razors after experiencing a colossal backlash against an ad they ran condemning “toxic masculinity.” As of Monday evening, the clip had over 122,000 dislikes and counting on YouTube (a 1:10 like:dislike ratio), with negative comments accumulating faster than they can be removed.\nDiversity would be why:\nGillette is “aiming to inspire change by acknowledging that the old saying ‘Boys Will Be Boys’ is not an excuse,” Gillette’s North American brand director Pankaj Bhalla told the Wall Street Journal. “We want to hold ourselves to a higher standard, and hope all the men we serve will come along on that journey to find our ‘best’ together.”\nMeanwhile, Congressional Republicans prove, as if yet another proof was needed, that\nRepublicans are the Stupid Party\n:\nHouse GOP leaders moved Monday to remove Rep. Steve King (R-Iowa) from all of his committee assignments following a firestorm over remarks considered racist. King faced bipartisan criticism after telling\nThe New York Times\nin an interview published last week, “White nationalist, white supremacist, Western civilization — how did that language become offensive?”\nKing had been a member of the House Judiciary, Agriculture and Small Business committees. He had also served as chairman of the House Judiciary Subcommittee on the Constitution and Civil Justice in the last Congress, and could have stood to serve as its ranking member under the Democratic majority.\nDo the House GOP leaders truly not understand that whites are the only people who vote for Republicans in large numbers? Do they seriously not understand that Republicans are NEVER, EVER going to win the La Razan, the Vibrancy, the Diversity, or the Neo-Palestinian votes, no matter how many anti-white self-flagellating theatrics they put on display?\nThe fact is that Rep. King is absolutely right. No civilization can be restored with another people’s children. Immigration is invasion and diversity is the death of Western civilization. Without the European peoples, without Christianity, or without the Greco-Roman philosophical tradition, Western civilization cannot and will not survive.\nHowever, Rep. King was also criminally stupid to sit down for an interview with\nThe New York Times\n. What did he think was going to happen? DO NOT TALK TO THE MEDIA! How hard is that? How many times do stupidly vain men and women of the Right need to learn that they simply should not talk to the media UNDER ANY CIRCUMSTANCES whatsoever.\nIt doesn’t matter if you very cleverly record the interview. It doesn’t matter what the nominal topic is. It doesn’t matter if you are a freaking CONGRESSMAN and you release an official statement from your office to set the record straight, a statement that makes it clear you did not ever say what the media falsely claims you said.\nThis is precisely why I never, ever, talk to the media about anything anymore. Not even about completely apolitical subjects relating to books I have written, games I have designed, or comics I have published. Since November, I have probably turned down over 50 media and new media requests for interviews about\nJordanetics\nalone, and about a dozen more concerning our claims and the class-action claims against Indiegogo. Stefan Molyneux had it right all along.\nDO. NOT. TALK. TO. THE. MEDIA.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-15T12:49:21+00:00"
}