{
  "url": "https://voxday.net/2019/01/16/an-onslaught-of-audiobooks/",
  "scraped_at": "2025-12-20T05:25:40.512191",
  "title": "An onslaught of audiobooks",
  "date_display": "January 16, 2019",
  "date_iso": "2019-01-16T21:01:58+00:00",
  "date_from_url": "2019-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The good news is that Audible graciously granted our request to make ALL of our audiobooks nonexclusive with them, which means that we can start offering them for sale on the Arkhaven store. This is great because we can sell them in a much higher-quality DRM-free MP4 format, which is both 4x better in audio terms and considerably more flexible in terms of the audiobook readers and audio players that can handle it.</p><p>For example, you can simply copy the file onto a USB stick and listen to it in your car.</p><p>However, since we have more than 40 audiobooks to convert to our preferred format and our Audio Editor is very busy editing the massive <i>A Throne of Bones</i> audiobook, <strike>we could use three volunteer audio interns to help us mass-convert the original audio files into the correct format. If you are a) interested, b) modestly competent technically and c) in possession of a reasonably modern Macintosh computer, please shoot me an email letting me know. If you’re on Windows or Linux, please do not volunteer, as the necessary software is Mac-only.</strike></p><p><b>UPDATE: </b>we now have more volunteers than we required. Thanks to everyone who contacted us. The Audio Editor will be in touch with you shortly.</p><p>One problem with the new format that we are currently sorting out is the way in which the iPhone’s walled garden attempts to prevent iPhone users from putting MP4 files on their iPhones. So far, the best alternative we have found is Bookmobile for iOS, which costs $4 in the App Store.</p><p>On Android we recommend Voice Audiobook Player, which is free in the Google Play Store. But we recommend that you read <a href=\"https://arkhavencomics.com/audiobook-info/\">our complete post concerning instructions for audio books</a> on the various platforms</p><blockquote class=\"tr_bq\"><p>Here’s what you need to do in order to play our .mp4 format audio books on different platforms. <i><b>But first of all:</b></i> On any platform, <i>do not simply click the link and start listening to it </i>in the browser’s internal player that will launch when you do. It will begin playing the file correctly, but eventually it will choke due to the very large length of the audiobook file. In all platforms, <i>you need to download the file</i> in one way or the other. Remember that the links will expire in a month. You will want to have the file in your own storage by that time.</p></blockquote><p><b>UPDATE:</b> <i>SJWs Always Lie</i> is now available in audiobook <a href=\"http://arkhavencomics.com/product/sjwal-audiobook/\">at the Arkhaven store</a>.</p></div>",
  "content_text": "The good news is that Audible graciously granted our request to make ALL of our audiobooks nonexclusive with them, which means that we can start offering them for sale on the Arkhaven store. This is great because we can sell them in a much higher-quality DRM-free MP4 format, which is both 4x better in audio terms and considerably more flexible in terms of the audiobook readers and audio players that can handle it.\nFor example, you can simply copy the file onto a USB stick and listen to it in your car.\nHowever, since we have more than 40 audiobooks to convert to our preferred format and our Audio Editor is very busy editing the massive\nA Throne of Bones\naudiobook,\nwe could use three volunteer audio interns to help us mass-convert the original audio files into the correct format. If you are a) interested, b) modestly competent technically and c) in possession of a reasonably modern Macintosh computer, please shoot me an email letting me know. If you’re on Windows or Linux, please do not volunteer, as the necessary software is Mac-only.\nUPDATE:\nwe now have more volunteers than we required. Thanks to everyone who contacted us. The Audio Editor will be in touch with you shortly.\nOne problem with the new format that we are currently sorting out is the way in which the iPhone’s walled garden attempts to prevent iPhone users from putting MP4 files on their iPhones. So far, the best alternative we have found is Bookmobile for iOS, which costs $4 in the App Store.\nOn Android we recommend Voice Audiobook Player, which is free in the Google Play Store. But we recommend that you read\nour complete post concerning instructions for audio books\non the various platforms\nHere’s what you need to do in order to play our .mp4 format audio books on different platforms.\nBut first of all:\nOn any platform,\ndo not simply click the link and start listening to it\nin the browser’s internal player that will launch when you do. It will begin playing the file correctly, but eventually it will choke due to the very large length of the audiobook file. In all platforms,\nyou need to download the file\nin one way or the other. Remember that the links will expire in a month. You will want to have the file in your own storage by that time.\nUPDATE:\nSJWs Always Lie\nis now available in audiobook\nat the Arkhaven store\n.",
  "tags": [
    "CastaliaHouse"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-16T21:01:58+00:00"
}