{
  "url": "https://voxday.net/2019/01/19/back-from-the-future/",
  "scraped_at": "2025-12-20T05:26:05.608085",
  "title": "Back from the future",
  "date_display": "January 19, 2019",
  "date_iso": "2019-01-19T16:35:51+00:00",
  "date_from_url": "2019-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Owen Benjamin <a href=\"https://www.youtube.com/watch?v=jziB4t0A8Ps\">returns to 1984</a> to help the younger generations understand how they have been prevented from being able to see what is right in front of them after 34 years of ideological subversion:</p><blockquote><p>Ideological subversion is is the process which is legitimate overt and open you can see it with your own eyes. All you have to do, all American mass media has to do is to unplug their bananas from the ears, open up their eyes, and they can see it there is no mystery, there is nothing to do with espionage. I know that espionage intelligence-gathering looks more romantic, it sells more the audience through the advertising, probably that’s why your Hollywood producers are so crazy about James Bond-type of three words, but in reality the main emphasis of the KGB is not in the area of intelligence at all. According to my opinion, and opinion of many defectors of my caliber, only about 15 percent of time, money, and manpower is spent on espionage as such the other 85 percent is a slow process which we call either ideological subversion or active measures in the language of the KGB, or psychological warfare.</p><p>What it basically means is to change the perception of reality of every American to such an extent that despite of the abundance of information, no one is able to come to sensible conclusions in the interests of defending themselves, their families, their community, and their country. It’s a great brainwashing process which goes very slow and it’s divided in four basic stages.</p><p>The first one being demoralisation. It takes from 15 to 20 years to demoralize a nation why that many years because this is the minimum number of years which requires to educate one generation of students in the country of your enemy exposed to the ideology of the enemy. In other words, Marxism Leninism ideology is being pumped into the soft heads of at least three generations of American students without being challenged or counterbalanced by the basic values of Americanism, American patriotism. The result the result you can see most of the people who graduated in 60s drop outs or half-baked intellectuals are now occupying the positions of power in the governor civil service business mass media educational system you are stuck with them you cannot get rid of them they are contaminated they are programmed to think and react to certain stimuli in a certain pattern you cannot change their mind even if you expose them to authentic information even if you prove that white is white and black is black you still cannot change the basic perception and the logic of behavior in other words these people the process of demoralization is complete and irreversible to get rid society of these people you have you need another 20 or 15 years to educate a new generation of patriotically minded and and common common sense people who would be acting in favor and in the interests of the United States society and yet these people have been programmed and as you say in place and you are favorable to an opening with the Soviet concept.</p><p>These are the very people who would be marked for extermination in this case, most of them, yes simply because the psychological shock when when they will see in future what they want, the beautiful society of equality and social justice, means in practice. Obviously they will revolt. They will be very unhappy frustrated people, and the Marxist Leninist regime does not tolerate these people, they obviously they will join the ranks of dissenters, dissidents. Unlike in the present United States there will be no place for dissent in future Marxist Leninist America. Here you can you can get popular like Daniel Ellsberg and filthy rich like Jane Fonda for being dissidents, for criticizing your Pentagon. In the future these people will be simply squashed like cockroaches. Nobody is going to pay them nothing for their beautiful noble ideas of equality. This they don’t understand and it will be greatest shock for them. Of course the demoralization process in the United States is basically completed already for the last 25 years, actually it’s over fulfilled because the demoralisation now reaches such areas where previously not even Comrade Andropov and all his experts would have ever dreamed of such a tremendous success.</p><p>Most of it is done by Americans to Americans thanks to a lack of moral standards. As I mentioned before, exposure to true information does not matter anymore. A person who is demoralized is unable to assess true information. The facts tell nothing to him. Even if I shower him with information, with the authentic proof, with documents, with pictures, even if I take him by force to the Soviet Union and show him concentration camp, he will refuse to believe it until he is going to receive a kick in the in his fat bottom. When a military boot crashes his balls then he will understand, but not before that, that’s the tragic of the situation of demoralisation. So basically America is stuck with with demoralisation, and even if you start right now, here, this minute, you start educating a new generation of Americans, it will still take you 15 to 20 years to turn the tide of ideological perception of reality back to normal normalcy and patriotism.</p><p>The next stage is destabilization. This time subversion does not care about your ideas and the patterns of your consumption, whether you eat junk food and get fat, it doesn’t matter anymore this time, and it takes only from two to five years to destabilize a nation. What matters is essentials. Economy, foreign relations, defense systems, and you can see it quite clearly that in some areas in such sensitive areas as defense and economy, the influence of Marxist Leninist ideas in the United States is absolutely fantastic. I could never believe it 14 years ago when I landed in this part of the world that the process will go that fast.</p><p>The next stage of course is crisis. It may take only up to six weeks to to bring a country to the verge of crisis. You can see it in in Central America now, and after crisis, with a violent change of power structure and economy you have the so-called period of normalization. It may last indefinitely. Normalization is a cynical expression borrowed from Soviet propaganda: when the Soviet tanks moved into Czechoslovakia in 68, Comrade Brezhnev said, “now the situation in brotherly Czechoslovakia is normalized. This is what will happen in the United States.</p></blockquote><p>The demoralization of the West is now very clear to even the most superficial observer. Notice the link to Aristotle’s dialectic/rhetoric model; the demoralized cannot process dialectic even when it is right in front of him. Notice also how the former KGB agent specifically uses the phrase “social justice”. None of this was an accident. The SJW insanity we now see that is dominant in so many societal institutions is the direct result of American DE-<b>MORAL</b>IZATION, the deliberate destruction of traditional American morality based on Christian Western civilization.</p><p>Which means we are deep into the destabilization phase and the crisis is rapidly approaching.</p></div>",
  "content_text": "Owen Benjamin\nreturns to 1984\nto help the younger generations understand how they have been prevented from being able to see what is right in front of them after 34 years of ideological subversion:\nIdeological subversion is is the process which is legitimate overt and open you can see it with your own eyes. All you have to do, all American mass media has to do is to unplug their bananas from the ears, open up their eyes, and they can see it there is no mystery, there is nothing to do with espionage. I know that espionage intelligence-gathering looks more romantic, it sells more the audience through the advertising, probably that’s why your Hollywood producers are so crazy about James Bond-type of three words, but in reality the main emphasis of the KGB is not in the area of intelligence at all. According to my opinion, and opinion of many defectors of my caliber, only about 15 percent of time, money, and manpower is spent on espionage as such the other 85 percent is a slow process which we call either ideological subversion or active measures in the language of the KGB, or psychological warfare.\nWhat it basically means is to change the perception of reality of every American to such an extent that despite of the abundance of information, no one is able to come to sensible conclusions in the interests of defending themselves, their families, their community, and their country. It’s a great brainwashing process which goes very slow and it’s divided in four basic stages.\nThe first one being demoralisation. It takes from 15 to 20 years to demoralize a nation why that many years because this is the minimum number of years which requires to educate one generation of students in the country of your enemy exposed to the ideology of the enemy. In other words, Marxism Leninism ideology is being pumped into the soft heads of at least three generations of American students without being challenged or counterbalanced by the basic values of Americanism, American patriotism. The result the result you can see most of the people who graduated in 60s drop outs or half-baked intellectuals are now occupying the positions of power in the governor civil service business mass media educational system you are stuck with them you cannot get rid of them they are contaminated they are programmed to think and react to certain stimuli in a certain pattern you cannot change their mind even if you expose them to authentic information even if you prove that white is white and black is black you still cannot change the basic perception and the logic of behavior in other words these people the process of demoralization is complete and irreversible to get rid society of these people you have you need another 20 or 15 years to educate a new generation of patriotically minded and and common common sense people who would be acting in favor and in the interests of the United States society and yet these people have been programmed and as you say in place and you are favorable to an opening with the Soviet concept.\nThese are the very people who would be marked for extermination in this case, most of them, yes simply because the psychological shock when when they will see in future what they want, the beautiful society of equality and social justice, means in practice. Obviously they will revolt. They will be very unhappy frustrated people, and the Marxist Leninist regime does not tolerate these people, they obviously they will join the ranks of dissenters, dissidents. Unlike in the present United States there will be no place for dissent in future Marxist Leninist America. Here you can you can get popular like Daniel Ellsberg and filthy rich like Jane Fonda for being dissidents, for criticizing your Pentagon. In the future these people will be simply squashed like cockroaches. Nobody is going to pay them nothing for their beautiful noble ideas of equality. This they don’t understand and it will be greatest shock for them. Of course the demoralization process in the United States is basically completed already for the last 25 years, actually it’s over fulfilled because the demoralisation now reaches such areas where previously not even Comrade Andropov and all his experts would have ever dreamed of such a tremendous success.\nMost of it is done by Americans to Americans thanks to a lack of moral standards. As I mentioned before, exposure to true information does not matter anymore. A person who is demoralized is unable to assess true information. The facts tell nothing to him. Even if I shower him with information, with the authentic proof, with documents, with pictures, even if I take him by force to the Soviet Union and show him concentration camp, he will refuse to believe it until he is going to receive a kick in the in his fat bottom. When a military boot crashes his balls then he will understand, but not before that, that’s the tragic of the situation of demoralisation. So basically America is stuck with with demoralisation, and even if you start right now, here, this minute, you start educating a new generation of Americans, it will still take you 15 to 20 years to turn the tide of ideological perception of reality back to normal normalcy and patriotism.\nThe next stage is destabilization. This time subversion does not care about your ideas and the patterns of your consumption, whether you eat junk food and get fat, it doesn’t matter anymore this time, and it takes only from two to five years to destabilize a nation. What matters is essentials. Economy, foreign relations, defense systems, and you can see it quite clearly that in some areas in such sensitive areas as defense and economy, the influence of Marxist Leninist ideas in the United States is absolutely fantastic. I could never believe it 14 years ago when I landed in this part of the world that the process will go that fast.\nThe next stage of course is crisis. It may take only up to six weeks to to bring a country to the verge of crisis. You can see it in in Central America now, and after crisis, with a violent change of power structure and economy you have the so-called period of normalization. It may last indefinitely. Normalization is a cynical expression borrowed from Soviet propaganda: when the Soviet tanks moved into Czechoslovakia in 68, Comrade Brezhnev said, “now the situation in brotherly Czechoslovakia is normalized. This is what will happen in the United States.\nThe demoralization of the West is now very clear to even the most superficial observer. Notice the link to Aristotle’s dialectic/rhetoric model; the demoralized cannot process dialectic even when it is right in front of him. Notice also how the former KGB agent specifically uses the phrase “social justice”. None of this was an accident. The SJW insanity we now see that is dominant in so many societal institutions is the direct result of American DE-\nMORAL\nIZATION, the deliberate destruction of traditional American morality based on Christian Western civilization.\nWhich means we are deep into the destabilization phase and the crisis is rapidly approaching.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-19T16:35:51+00:00"
}