{
  "url": "https://voxday.net/2019/01/05/comicsgate-history-2vs-edition/",
  "scraped_at": "2025-12-20T05:23:59.701765",
  "title": "ComicsGate history: 2VS edition",
  "date_display": "January 5, 2019",
  "date_iso": "2019-01-05T15:09:15+00:00",
  "date_from_url": "2019-01-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://cdn.idka.com/e637e984-664d-4c3a-9f65-a2b9669f48b2\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" data-original-height=\"340\" data-original-width=\"512\" decoding=\"async\" fetchpriority=\"high\" height=\"212\" src=\"https://cdn.idka.com/e637e984-664d-4c3a-9f65-a2b9669f48b2\" width=\"320\"/></a></div><p>2VS is up to his usual antics again, this time <a href=\"https://www.youtube.com/watch?v=latXCiV5lCw\">on Captain Red Pill’s channel</a>. You all already know my position on 2VS. He’s not an enemy, unlike our actual enemies he’s not out to destroy Western civilization, Christianity, or the European nations. That being said, he’s not a friend, and due to his intrinsic unreliability, he’s not even a potential ally. And while he’s a talented illustrator, he draws far too slowly to function within Arkhaven’s production process.</p><p>I’m not angry about his decision to attempt to revise his past indiscretions with regards to ComicsGate, I’m not even annoyed. I find it to all be tedious and unnecessary at this point. What happened has happened. It’s a pity, it was ridiculous, and I wish I had simply stayed well out of it, but it was probably all for the best in the end. The thing is, between building our infrastructure, fighting our legal battle with Indiegogo (which is now officially on), and continuing to innovate and get our comics out, none of us at Arkhaven has any time or interest in any ongoing Internet drama. Ethan has his own issues to deal with, as <a href=\"https://www.youtube.com/watch?v=cQErymyeMao\">apparently there was some problem</a> with the writer he hired, and he’s already had to push the release of his comic back so far that we may actually complete and publish all six issues of AH:Q before Cyberfrog ships. Why he wants to keep going on and on about ComicsGate makes no sense to me.</p><blockquote><p><b>2VS:</b> Vox Day is somebody who I really, really enjoyed my acquaintance with. I didn’t really know him — like, I didn’t know his beliefs — but what I did know is that he was kind of Alt‑Right, and he decided he wanted to come in and fight these SJWs in comics without having known anything about comics, and he put out this crowdfunded comic book called Alt★Hero.</p><p>She was wearing, like, a Confederate flag for a costume. She was a hot chick. It was everything meant to trigger social justice warriors. Now, my attitude was, look, you don’t want to fight the extremes with an extreme; you want to offer a moderate — you want to offer a centrist alternative to get all the audience, get all the customers. Yeah, you know, something that was my plan. His plan was just to be the opposite side. So we we fought about that for a little while. I had him on my show, interviewed him, you know. I don’t know … we kind of talked. We formed kind of a weird kind of friendship over the telephone. And then what happened was he decided that what he wanted to do was he wanted to make a publishing imprint called ComicsGate.</p><p><b>CRP: </b>Oh, now I remember. So he stole your name?</p><p><b>2VS: </b>Well, it’s not my name. It’s just a hashtag. But in point of fact, you know, it’s like there are people who consider themselves ComicsGaters who just didn’t want the forced association with Vox Day. The idea was that the hashtag belongs to everybody and nobody, and you can’t really —  like, if you’re gonna — if Vox Day is going to publish a comic book company called ComicsGate, the implication is that, you know, ComicsGate is Vox Day’s belief system.</p><p>And people had a real, real tough time with that and didn’t want him to co-opt the movement. So I talked to some lawyers, and they said, “You do a YouTube show called ComicsGate Live, you actually own the copyright to the name ‘ComicsGate’.”</p><p><b>CRP:</b> Oh, wow.</p><p><b>2VS:</b> “Well, that’s like …”</p><p><b>CRP:</b> Shit.</p><p><b>2VS:</b> “… because you monetized it first.” So I hit Vox day with a ‘cease and desist’ and threatened him with a lawsuit and we’ve had problems ever since, he and I. But I told him, you know, when he told me he was gonna do this, I said, “Vox” — and these are magic words coming from me — I said, “Vox, as a friend, don’t do it.” And he just ignored me and went on to a Livestream and announced it. Now, if I say to you “as a friend”, and you go against that, I’m asking for a favor like that, and you just defy it … you turn, you know … I can either owe you a favor or we’re gonna become enemies; it’s one of those two things. That’s the way it works in my world. That’s the way it’s always worked in my world. So if I say to you, “Coach Red Pill, as a friend, don’t do that to me” — don’t do this, don’t do that — and you do it anyway, you’ve become my enemy, because I rarely say things like that. I don’t make requests to people, but I knew this was gonna cause all kinds of trouble. And it has.</p><p>I mean, it’s a shame. So Vox Day went on a whole tirade, trying to smear me and calling me two-faced and everything. I’m very much singularly-faced. I asked him not to do this because I felt that it would hurt the movement that we’ve been working so hard to nurture and build into something, and he chose to try to co-opt it, I think, for his own reasons, which I don’t want to speculate about. But anyway, Vox Day also has gone after Jordan Peterson. Just, I mean, total … sorry. The book 12 … well, yeah, like he … I think so … I think he had some good points. I actually told him. I said, “I gotta say, I’m friends with Jordan Peterson. I like him. But you did a good job. I mean, I think you did point out some of his foibles and weaknesses.” Yeah, you know, good on him. But, you know, you got to be honest with people even if you … yeah, even if you don’t agree with them about everything. Even if you’re in a fight, man. When they get one over, you gotta kind of acknowledge. It’s humility, you know. You got call ’em like you see ’em, you know, not like you’d like to see ’em, you know?</p><p><b>CRP:</b> No, I’d … Look, in so far as Vox Day … I have no opinion about him. I have never interacted with the guy, you know … but in so far as what you said earlier, that he wanted to do a comic book character who would, like, trigger the SJWs, trigger the Libs, right? All right. Here, with you, I agree that it has to be something that will appeal to the normies, to the broad middle.</p><p><b>2VS:</b> That’s the only way to beat them.</p><p><b>CRP: </b>Yeah, and to go for the extreme? No. You just create a caricature. Not a cartoon in a cool way. Like, you do, but like a character in the sense of a very small niche audience is gonna care about that shit, you know. And if you’re a businessman, because you are and I used to be involved in commercial art, okay? I mean, I was writing stuff for money. I just, you know, not not for accolades. I could give a shit about that. I was, you know, it’s something that I was remunerated for, the same for you. You do comic books for money. It’s a profession. It’s a job. It’s a perfectly respectable profession. And so the idea of doing something that will only appeal to a niche seems to me counterintuitive. You want to appeal to as broad an audience as possible. And sometimes you recognize that you have to put in elements that will appeal to a niche who will be like the hook for the bigger fish of the wider audience if you will, to make a very crude or weird metaphor, but you seen I’m saying. I mean it’s all perfectly fine, but you’re trying to appeal to as broad an audience as possible, and that I think what Vox Day is doing, it’s just not appealing to me.</p><p><b>2VS:</b> He can do it. I mean, you know, the thing is, Vox Day can call himself … there are people in the chat that are, like, you know, Vox Day fans that are outraged right now. This guy HorseMumbler1 one says, “Ethan is lying, Coach Red Pill. Go listen to what Vox said about it at the time. The ComicsGaters acted like a bunch of half-wits.”</p><p>Well, HorseMumbler1, you know, I mean, I think we’ve litigated this to death, but I mean, I have the receipts, and, you know, Vox knows that I’ve got the receipts. And by the way, since then Vox has come to me asking for some favors. I want you to know that.</p><p><b>CRP:</b> What kind of favors?</p><p><b>2VS:</b> No … no comment … so, you know, Vox has his way of spinning a tale, of spinning a yarn. I wouldn’t necessarily think that what Vox had to say …</p><p>By the way, Vox is so smart about some things and so fucking dumb about other things, it’s unreal. Like, he recently got his fans all together to explain to them why his model for the comic book industry was so much better than mine. I mean, I’ve lived in comics for 25 years. But what he did was he took Cyberfrog, and he said, “Look, Ethan’s raised $628,000 for Cyberfrog, so why don’t we divide … you know, the main book is 48 pages long. Divide 48 into 628,000, that’s how much each page costs of Cyberfrog to make. Ethan needs this. He needs $15,000/page to draw Cyberfrog. Now, on the other hand my book over here, Alt★Hero, brought in $25,000. Divide 48 into 25,000, we’re bringing it in at $500 a page, so obviously our model is much more economic and makes more sense.” Because I was like …</p><p><b>CRP: </b>You raised pre-sales, pre-sales of the book, right?</p><p><b>2VS:</b> It’s called profit, Vox. It’s not … I make more per page than you. I don’t require that much. I can draw it for free. But, you know, it’s like saying, “How the hell is JK Rowling gonna write another Harry Potter book?” You know, her first book earned $117,000,000. Divide that by 500 pages. It’s too expensive to write another Harry Potter book. Most half-witted and weirdo argument that he was making to his credulous audience, and, uh, you know, they’re here.</p><p>I mean, you know I love you guys. But anyway the point is that, you know, their complaint is that did I gatekeep Vox Day? No, he just wasn’t … I wasn’t gonna let him have the name ComicsGate if I had any legal protection over it, which I did, and he knew that. But, you know, it’s everybody’s. It’s just not Vox’s exclusively, let’s put it that way. I saved it for everyone.</p><p><b>CRP: </b>So right now it’s sort of like, you have the rights to it, but you’re basically standing aside so anybody can use it?</p><p><b>2VS: </b>That’s correct, okay. Vox Day can say, “I am ComicsGate,” and I will say, “Okay, Vox, they can have a YouTube show called ComicsGate, and I’ll say, “Okay,” and everybody will, but if Vox Day wants to set up a publishing … like a monetized publishing arm that makes it look as though he represents ComicsGate, I’m not gonna let that happen, because ComicsGate is just a hashtag that everybody has to be able to use, and it doesn’t imply association, like, unwanted association with any one individual. It can’t be political like that. People can’t perceive it to be Alt-Right. It has to be moderate. It has to be everyone. Now, the Alt-Right can be involved if they want. The Alt-Left can be involved. It doesn’t really matter. It’s just ComicsGate … the idea is that there are no politics. It’s apolitical. It’s all about money. It’s all about serving the customer. It’s the opposite of the mainstream of the comic book industry right now.</p></blockquote><p>With regards to my asking Ethan for a favor, it’s absolutely true that I did recently ask him for something through a third party, something that is in literally everyone’s interest, and I can confirm that he had the decency and the good sense to provide me with what I requested. As I have repeatedly said, <i>he is not the enemy</i>, and I would not hesitate to return the favor. I also should point out that contra some of the comments in last night’s Darkstream, it’s very clear that Ethan did NOT accuse me of ripping of Taleb, which everyone here knows perfectly well that I did not do. In fact, Ethan doesn’t even appear to be familiar with Taleb in the first place.</p><blockquote class=\"tr_bq\"><p>Did you hear that Vox Day fans I use one of Vox’s words anti fragile is Talab invented that all the time yeah yeah yeah well anti fragile is a concept that Nassim Taleb invented which is very very astute concept but yeah it’s basically a system that becomes stronger with more use and abuse yeah Vox, they ripped that off him oh that’s funny okay I didn’t know about that.</p></blockquote><p>For reference, here is the very first reference to antifragility in my 2015 bestseller, <i>SJWs Always Lie: Taking Down the Thought Police</i>.</p><p><b>Strategic Principle #8: Be antifragile.</b><br><i><br/></i><i>I cannot too highly recommend Nassim Nicholas Taleb’s 2012 book, <b>Antifragile: Things That Gain from Disorder</b>, or too strongly stress the importance of applying the principles he explains in it to your life, especially if you are going to take a stand against the SJW Narrative. It should be your goal to become “a thing that gains from disorder” because disorder is the natural state of the world, particularly now that SJWs have become increasingly influential within it. Antifragility in this context means you have a maximal degree of flexibility, a high level of freedom of movement, sufficient psychological strength to withstand collective social pressure, and a lack of vulnerability to the usual SJW tactics of disqualification, discrediting, and disemployment.</i></br></p><p>On what planet could that possibly be considered “ripping off”, much less “plagiarism”, as one person characterized it?</p></div>",
  "content_text": "2VS is up to his usual antics again, this time\non Captain Red Pill’s channel\n. You all already know my position on 2VS. He’s not an enemy, unlike our actual enemies he’s not out to destroy Western civilization, Christianity, or the European nations. That being said, he’s not a friend, and due to his intrinsic unreliability, he’s not even a potential ally. And while he’s a talented illustrator, he draws far too slowly to function within Arkhaven’s production process.\nI’m not angry about his decision to attempt to revise his past indiscretions with regards to ComicsGate, I’m not even annoyed. I find it to all be tedious and unnecessary at this point. What happened has happened. It’s a pity, it was ridiculous, and I wish I had simply stayed well out of it, but it was probably all for the best in the end. The thing is, between building our infrastructure, fighting our legal battle with Indiegogo (which is now officially on), and continuing to innovate and get our comics out, none of us at Arkhaven has any time or interest in any ongoing Internet drama. Ethan has his own issues to deal with, as\napparently there was some problem\nwith the writer he hired, and he’s already had to push the release of his comic back so far that we may actually complete and publish all six issues of AH:Q before Cyberfrog ships. Why he wants to keep going on and on about ComicsGate makes no sense to me.\n2VS:\nVox Day is somebody who I really, really enjoyed my acquaintance with. I didn’t really know him — like, I didn’t know his beliefs — but what I did know is that he was kind of Alt‑Right, and he decided he wanted to come in and fight these SJWs in comics without having known anything about comics, and he put out this crowdfunded comic book called Alt★Hero.\nShe was wearing, like, a Confederate flag for a costume. She was a hot chick. It was everything meant to trigger social justice warriors. Now, my attitude was, look, you don’t want to fight the extremes with an extreme; you want to offer a moderate — you want to offer a centrist alternative to get all the audience, get all the customers. Yeah, you know, something that was my plan. His plan was just to be the opposite side. So we we fought about that for a little while. I had him on my show, interviewed him, you know. I don’t know … we kind of talked. We formed kind of a weird kind of friendship over the telephone. And then what happened was he decided that what he wanted to do was he wanted to make a publishing imprint called ComicsGate.\nCRP:\nOh, now I remember. So he stole your name?\n2VS:\nWell, it’s not my name. It’s just a hashtag. But in point of fact, you know, it’s like there are people who consider themselves ComicsGaters who just didn’t want the forced association with Vox Day. The idea was that the hashtag belongs to everybody and nobody, and you can’t really —  like, if you’re gonna — if Vox Day is going to publish a comic book company called ComicsGate, the implication is that, you know, ComicsGate is Vox Day’s belief system.\nAnd people had a real, real tough time with that and didn’t want him to co-opt the movement. So I talked to some lawyers, and they said, “You do a YouTube show called ComicsGate Live, you actually own the copyright to the name ‘ComicsGate’.”\nCRP:\nOh, wow.\n2VS:\n“Well, that’s like …”\nCRP:\nShit.\n2VS:\n“… because you monetized it first.” So I hit Vox day with a ‘cease and desist’ and threatened him with a lawsuit and we’ve had problems ever since, he and I. But I told him, you know, when he told me he was gonna do this, I said, “Vox” — and these are magic words coming from me — I said, “Vox, as a friend, don’t do it.” And he just ignored me and went on to a Livestream and announced it. Now, if I say to you “as a friend”, and you go against that, I’m asking for a favor like that, and you just defy it … you turn, you know … I can either owe you a favor or we’re gonna become enemies; it’s one of those two things. That’s the way it works in my world. That’s the way it’s always worked in my world. So if I say to you, “Coach Red Pill, as a friend, don’t do that to me” — don’t do this, don’t do that — and you do it anyway, you’ve become my enemy, because I rarely say things like that. I don’t make requests to people, but I knew this was gonna cause all kinds of trouble. And it has.\nI mean, it’s a shame. So Vox Day went on a whole tirade, trying to smear me and calling me two-faced and everything. I’m very much singularly-faced. I asked him not to do this because I felt that it would hurt the movement that we’ve been working so hard to nurture and build into something, and he chose to try to co-opt it, I think, for his own reasons, which I don’t want to speculate about. But anyway, Vox Day also has gone after Jordan Peterson. Just, I mean, total … sorry. The book 12 … well, yeah, like he … I think so … I think he had some good points. I actually told him. I said, “I gotta say, I’m friends with Jordan Peterson. I like him. But you did a good job. I mean, I think you did point out some of his foibles and weaknesses.” Yeah, you know, good on him. But, you know, you got to be honest with people even if you … yeah, even if you don’t agree with them about everything. Even if you’re in a fight, man. When they get one over, you gotta kind of acknowledge. It’s humility, you know. You got call ’em like you see ’em, you know, not like you’d like to see ’em, you know?\nCRP:\nNo, I’d … Look, in so far as Vox Day … I have no opinion about him. I have never interacted with the guy, you know … but in so far as what you said earlier, that he wanted to do a comic book character who would, like, trigger the SJWs, trigger the Libs, right? All right. Here, with you, I agree that it has to be something that will appeal to the normies, to the broad middle.\n2VS:\nThat’s the only way to beat them.\nCRP:\nYeah, and to go for the extreme? No. You just create a caricature. Not a cartoon in a cool way. Like, you do, but like a character in the sense of a very small niche audience is gonna care about that shit, you know. And if you’re a businessman, because you are and I used to be involved in commercial art, okay? I mean, I was writing stuff for money. I just, you know, not not for accolades. I could give a shit about that. I was, you know, it’s something that I was remunerated for, the same for you. You do comic books for money. It’s a profession. It’s a job. It’s a perfectly respectable profession. And so the idea of doing something that will only appeal to a niche seems to me counterintuitive. You want to appeal to as broad an audience as possible. And sometimes you recognize that you have to put in elements that will appeal to a niche who will be like the hook for the bigger fish of the wider audience if you will, to make a very crude or weird metaphor, but you seen I’m saying. I mean it’s all perfectly fine, but you’re trying to appeal to as broad an audience as possible, and that I think what Vox Day is doing, it’s just not appealing to me.\n2VS:\nHe can do it. I mean, you know, the thing is, Vox Day can call himself … there are people in the chat that are, like, you know, Vox Day fans that are outraged right now. This guy HorseMumbler1 one says, “Ethan is lying, Coach Red Pill. Go listen to what Vox said about it at the time. The ComicsGaters acted like a bunch of half-wits.”\nWell, HorseMumbler1, you know, I mean, I think we’ve litigated this to death, but I mean, I have the receipts, and, you know, Vox knows that I’ve got the receipts. And by the way, since then Vox has come to me asking for some favors. I want you to know that.\nCRP:\nWhat kind of favors?\n2VS:\nNo … no comment … so, you know, Vox has his way of spinning a tale, of spinning a yarn. I wouldn’t necessarily think that what Vox had to say …\nBy the way, Vox is so smart about some things and so fucking dumb about other things, it’s unreal. Like, he recently got his fans all together to explain to them why his model for the comic book industry was so much better than mine. I mean, I’ve lived in comics for 25 years. But what he did was he took Cyberfrog, and he said, “Look, Ethan’s raised $628,000 for Cyberfrog, so why don’t we divide … you know, the main book is 48 pages long. Divide 48 into 628,000, that’s how much each page costs of Cyberfrog to make. Ethan needs this. He needs $15,000/page to draw Cyberfrog. Now, on the other hand my book over here, Alt★Hero, brought in $25,000. Divide 48 into 25,000, we’re bringing it in at $500 a page, so obviously our model is much more economic and makes more sense.” Because I was like …\nCRP:\nYou raised pre-sales, pre-sales of the book, right?\n2VS:\nIt’s called profit, Vox. It’s not … I make more per page than you. I don’t require that much. I can draw it for free. But, you know, it’s like saying, “How the hell is JK Rowling gonna write another Harry Potter book?” You know, her first book earned $117,000,000. Divide that by 500 pages. It’s too expensive to write another Harry Potter book. Most half-witted and weirdo argument that he was making to his credulous audience, and, uh, you know, they’re here.\nI mean, you know I love you guys. But anyway the point is that, you know, their complaint is that did I gatekeep Vox Day? No, he just wasn’t … I wasn’t gonna let him have the name ComicsGate if I had any legal protection over it, which I did, and he knew that. But, you know, it’s everybody’s. It’s just not Vox’s exclusively, let’s put it that way. I saved it for everyone.\nCRP:\nSo right now it’s sort of like, you have the rights to it, but you’re basically standing aside so anybody can use it?\n2VS:\nThat’s correct, okay. Vox Day can say, “I am ComicsGate,” and I will say, “Okay, Vox, they can have a YouTube show called ComicsGate, and I’ll say, “Okay,” and everybody will, but if Vox Day wants to set up a publishing … like a monetized publishing arm that makes it look as though he represents ComicsGate, I’m not gonna let that happen, because ComicsGate is just a hashtag that everybody has to be able to use, and it doesn’t imply association, like, unwanted association with any one individual. It can’t be political like that. People can’t perceive it to be Alt-Right. It has to be moderate. It has to be everyone. Now, the Alt-Right can be involved if they want. The Alt-Left can be involved. It doesn’t really matter. It’s just ComicsGate … the idea is that there are no politics. It’s apolitical. It’s all about money. It’s all about serving the customer. It’s the opposite of the mainstream of the comic book industry right now.\nWith regards to my asking Ethan for a favor, it’s absolutely true that I did recently ask him for something through a third party, something that is in literally everyone’s interest, and I can confirm that he had the decency and the good sense to provide me with what I requested. As I have repeatedly said,\nhe is not the enemy\n, and I would not hesitate to return the favor. I also should point out that contra some of the comments in last night’s Darkstream, it’s very clear that Ethan did NOT accuse me of ripping of Taleb, which everyone here knows perfectly well that I did not do. In fact, Ethan doesn’t even appear to be familiar with Taleb in the first place.\nDid you hear that Vox Day fans I use one of Vox’s words anti fragile is Talab invented that all the time yeah yeah yeah well anti fragile is a concept that Nassim Taleb invented which is very very astute concept but yeah it’s basically a system that becomes stronger with more use and abuse yeah Vox, they ripped that off him oh that’s funny okay I didn’t know about that.\nFor reference, here is the very first reference to antifragility in my 2015 bestseller,\nSJWs Always Lie: Taking Down the Thought Police\n.\nStrategic Principle #8: Be antifragile.\nI cannot too highly recommend Nassim Nicholas Taleb’s 2012 book,\nAntifragile: Things That Gain from Disorder\n, or too strongly stress the importance of applying the principles he explains in it to your life, especially if you are going to take a stand against the SJW Narrative. It should be your goal to become “a thing that gains from disorder” because disorder is the natural state of the world, particularly now that SJWs have become increasingly influential within it. Antifragility in this context means you have a maximal degree of flexibility, a high level of freedom of movement, sufficient psychological strength to withstand collective social pressure, and a lack of vulnerability to the usual SJW tactics of disqualification, discrediting, and disemployment.\nOn what planet could that possibly be considered “ripping off”, much less “plagiarism”, as one person characterized it?",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-05T15:09:15+00:00"
}