{
  "url": "https://voxday.net/2019/01/18/darkstream-dealing-with-deplatforming/",
  "scraped_at": "2025-12-20T05:25:55.102968",
  "title": "Darkstream: Dealing with deplatforming",
  "date_display": "January 18, 2019",
  "date_iso": "2019-01-18T10:26:06+00:00",
  "date_from_url": "2019-01-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/JLoYVe90yi8\" width=\"512\"></iframe></div><div style=\"text-align: center;\"></div><div style=\"text-align: left;\">One of the interesting things about <a href=\"https://youtu.be/JLoYVe90yi8\">this particular Bookstream</a> was that it was initially ad-limited, presumably by a YT algorithm that was set to trigger on either the word “deplatforming” or “SJW”. My assumption would be the latter, as there has been an attempt by SJWs to rule the word officially out of bounds as excessively pejorative.<p>(Which, you will note, underlines how foolish all the dialectic-speakers who kept trying to think up awkward alternatives to what has proven to be extremely effective rhetoric.)</p><p>This is why I encourage everyone who subscribes to the Darkstream on YT to also follow me <a href=\"https://www.stream.me/voxday\">on the Stream.Me channel</a> as a backup. Anyhow, I didn’t bother asking for a review of the limit because I have no idea what the advertiser preferences are. That’s why it was a surprise to see that the ad-limitation had already been lifted this morning, even though I knew there was absolutely nothing even remotely objectionable in the video itself. It appears sanity prevailed for the time being.</p><p>Speaking of deplatformings, the third torpedo in the Indiegogo campaign is off and away and the fourth will be launched later today. If you don’t resist each and every deplatforming attempt and make it <i>brutally </i>not worth their investment of time, effort, and legal expenses to target you, you can be relatively certain that another will soon follow. </p></div></div>",
  "content_text": "One of the interesting things about\nthis particular Bookstream\nwas that it was initially ad-limited, presumably by a YT algorithm that was set to trigger on either the word “deplatforming” or “SJW”. My assumption would be the latter, as there has been an attempt by SJWs to rule the word officially out of bounds as excessively pejorative.\n(Which, you will note, underlines how foolish all the dialectic-speakers who kept trying to think up awkward alternatives to what has proven to be extremely effective rhetoric.)\nThis is why I encourage everyone who subscribes to the Darkstream on YT to also follow me\non the Stream.Me channel\nas a backup. Anyhow, I didn’t bother asking for a review of the limit because I have no idea what the advertiser preferences are. That’s why it was a surprise to see that the ad-limitation had already been lifted this morning, even though I knew there was absolutely nothing even remotely objectionable in the video itself. It appears sanity prevailed for the time being.\nSpeaking of deplatformings, the third torpedo in the Indiegogo campaign is off and away and the fourth will be launched later today. If you don’t resist each and every deplatforming attempt and make it\nbrutally\nnot worth their investment of time, effort, and legal expenses to target you, you can be relatively certain that another will soon follow.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-18T10:26:06+00:00"
}