{
  "url": "https://voxday.net/2019/01/10/darkstream-the-magic-cuddle-puddlers/",
  "scraped_at": "2025-12-20T05:24:39.652504",
  "title": "Darkstream: the magic cuddle puddlers",
  "date_display": "January 10, 2019",
  "date_iso": "2019-01-10T11:12:41+00:00",
  "date_from_url": "2019-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/-zk5blc6rdU\" width=\"512\"></iframe></div><div style=\"text-align: center;\"></div><p>Unlike the Roganites and BJJ fanboys who were <a href=\"https://youtu.be/-zk5blc6rdU\">triggered by my observations</a>, a number of actual grapplers and Brazilian Jiu-Jitsu practitioners understood what I’ve been saying about grappling being, in most real-world situations, an impractical and dangerous approach to fighting. Especially these days. If Antifa is going to attack you, you can pretty much guarantee they will not do so 1v1.</p><ul><li><i>Dean lister actually says a lot of the same things vox does.﻿ I mean, he talks about bar fights etc and how bjj is not optimal in those situations and the kinds of things that are effective in real fights.﻿</i></li><li><i>Precisely. My experiences are the same as yours. Every serious fight I’ve been in ended up being me fighting more than four people. Last place you wanna be is the ground. There’s a reason BJJ isn’t taught for street defence.﻿</i></li><li><i>I’m a BJJ instructor and have trained Shotokan for 7 years and Muay Thai for about 4. I’ve been in about 6 real world fights. Only 1 was 1 on 1. You should have knowledge of both standing and ground game. Being able to execute take downs and know how to get back up if you get down is very important. Vox made some good points. Grapplers stop being triggered. 1 on 1 the grappler will most likely win. Anything other than that you need to be as mobile as possible which means you need to stay standing.﻿</i></li><li><i>I wrestled Division One on a team with a national champion and I can say Vox is more than correct in his assertions.  A wrestler’s only advantage is his strength and physical ability to take some abuse and crush a guy ONE ON ONE on the ground.  But wrestling in a bar or street fight is a no-win situation.  You have to strike and stay on your feet. You never want to end up on the ground.﻿</i></li><li><i>I disagree with some of what Vox pushes, especially on religion etc (and on Kenpo.. depending on the style). He is absolutely correct on this. Having done martial arts for many years and been in many confrontations he is pretty much on point on this topic. Wrestling rarely puts forth real-world situations and realities.﻿</i></li><li><i>He is correct. BJJ is “fake,” that is,  it takes place within a structure and it is effective within that structure. The GIF shown early on proves that grappling on the ground in a real fight opens you up to being crushed by someones mother. There’a a reason Kano emphasized throws﻿.</i></li></ul><p>The strangest thing about this situation has been the way that triggered Roganites and Brazilian Cuddle Puddlers keep demanding that I prove the truth of my experiences and claiming that my observations are somehow invalid if I don’t post a video of me physically harming people with my magical martial arts skills. Do they really not grasp the irony of the fact that they are fans of a UFC COMMENTATOR who talks about this subject all the time despite having no personal experience of either ring-fighting or real fighting?</p><p>My comments, observations, and opinions are either on point or they are not, regardless of whether you believe my colorful story about beating up 15 leprechauns who rode in together on a giant green-maned unicorn with an ancient Native American martial art I learned from the tribal shaman.</p><p>And <a href=\"https://www.youtube.com/watch?v=QNlQQ-SX3X4\">this video of Sakuraba</a> absolutely destroying the best that the Gracies had to offer demonstrates very clearly the fundamental weakness of building your attack plan around a ground game. Look how utterly stupid and helpless both Hoyce and Renzo Gracie are with Sakuraba standing over them, just deciding where he’s going to stomp on them next.</p><p>This comment sums it up well:<br><i><br/></i><i>how does that work then?</i><br><i>“I lay on the floor and get the shit kicked out of me.”</i><br><i>not sure this bjj works to be honest.﻿</i></br></br></br></p></div>",
  "content_text": "Unlike the Roganites and BJJ fanboys who were\ntriggered by my observations\n, a number of actual grapplers and Brazilian Jiu-Jitsu practitioners understood what I’ve been saying about grappling being, in most real-world situations, an impractical and dangerous approach to fighting. Especially these days. If Antifa is going to attack you, you can pretty much guarantee they will not do so 1v1.\nDean lister actually says a lot of the same things vox does.﻿ I mean, he talks about bar fights etc and how bjj is not optimal in those situations and the kinds of things that are effective in real fights.﻿\nPrecisely. My experiences are the same as yours. Every serious fight I’ve been in ended up being me fighting more than four people. Last place you wanna be is the ground. There’s a reason BJJ isn’t taught for street defence.﻿\nI’m a BJJ instructor and have trained Shotokan for 7 years and Muay Thai for about 4. I’ve been in about 6 real world fights. Only 1 was 1 on 1. You should have knowledge of both standing and ground game. Being able to execute take downs and know how to get back up if you get down is very important. Vox made some good points. Grapplers stop being triggered. 1 on 1 the grappler will most likely win. Anything other than that you need to be as mobile as possible which means you need to stay standing.﻿\nI wrestled Division One on a team with a national champion and I can say Vox is more than correct in his assertions.  A wrestler’s only advantage is his strength and physical ability to take some abuse and crush a guy ONE ON ONE on the ground.  But wrestling in a bar or street fight is a no-win situation.  You have to strike and stay on your feet. You never want to end up on the ground.﻿\nI disagree with some of what Vox pushes, especially on religion etc (and on Kenpo.. depending on the style). He is absolutely correct on this. Having done martial arts for many years and been in many confrontations he is pretty much on point on this topic. Wrestling rarely puts forth real-world situations and realities.﻿\nHe is correct. BJJ is “fake,” that is,  it takes place within a structure and it is effective within that structure. The GIF shown early on proves that grappling on the ground in a real fight opens you up to being crushed by someones mother. There’a a reason Kano emphasized throws﻿.\nThe strangest thing about this situation has been the way that triggered Roganites and Brazilian Cuddle Puddlers keep demanding that I prove the truth of my experiences and claiming that my observations are somehow invalid if I don’t post a video of me physically harming people with my magical martial arts skills. Do they really not grasp the irony of the fact that they are fans of a UFC COMMENTATOR who talks about this subject all the time despite having no personal experience of either ring-fighting or real fighting?\nMy comments, observations, and opinions are either on point or they are not, regardless of whether you believe my colorful story about beating up 15 leprechauns who rode in together on a giant green-maned unicorn with an ancient Native American martial art I learned from the tribal shaman.\nAnd\nthis video of Sakuraba\nabsolutely destroying the best that the Gracies had to offer demonstrates very clearly the fundamental weakness of building your attack plan around a ground game. Look how utterly stupid and helpless both Hoyce and Renzo Gracie are with Sakuraba standing over them, just deciding where he’s going to stomp on them next.\nThis comment sums it up well:\nhow does that work then?\n“I lay on the floor and get the shit kicked out of me.”\nnot sure this bjj works to be honest.﻿",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-10T11:12:41+00:00"
}