{
  "url": "https://voxday.net/2019/01/11/gamma-philosophy/",
  "scraped_at": "2025-12-20T05:24:48.564832",
  "title": "Gamma philosophy",
  "date_display": "January 11, 2019",
  "date_iso": "2019-01-11T13:31:11+00:00",
  "date_from_url": "2019-01-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>An exchange in the Darkstream comments:</p><blockquote><p>Chunky Monkey<br>Vox has argued that what he calls uniquely high IQ people think holistically, and then turns around and tries to vaguely quantify everything while ironically using that as justification.﻿</br></p><p>Darkstream<br>There is no quantification involved at all, vaguely or otherwise. You are confusing the concept of “categorization” with “quantification”. They are two different things. As a general rule, don’t try to correct your intellectual superiors, particularly using words you don’t understand.﻿</br></p></blockquote><p>If you are a Gamma, or even have Gamma tendencies, you simply must learn to resist the urge to correct others, particularly those who are more intelligent than you are. Also, try to keep the adverbs to a minimum. Gammas love adverbs, because adverbs qualify verbs, which permits them to put themselves in the position of implicitly pronouncing judgment on the actions of others.</p><p>Categorical thinking is vital to understanding. In fact, categorical thinking is the foundation of Western philosophy, to such an extent that the Stanford Encyclopedia considers Aristotle’s categorical system to be uniquely important.</p><blockquote class=\"tr_bq\"><p>Aristotle’s <i>Categories </i>is a singularly important work of philosophy. It not only presents the backbone of Aristotle’s own philosophical theorizing, but has exerted an unparalleled influence on the systems of many of the greatest philosophers in the western tradition. The set of doctrines in the Categories, which I will henceforth call categorialism, provides the framework of inquiry for a wide variety of Aristotle’s philosophical investigations, ranging from his discussions of time and change in the <i>Physics</i>, to the science of being qua being in the <i>Metaphysics</i>, and even extending to his rejection of Platonic ethics in the <i>Nicomachean Ethics</i>. Looking beyond his own works, Aristotle’s categorialism has engaged the attention of such diverse philosophers as Plotinus, Porphyry, Aquinas, Descartes, Spinoza, Leibniz, Locke, Berkeley, Hume, Kant, Hegel, Brentano and Heidegger (to mention just a few), who have variously embraced, defended, modified or rejected its central contentions. All, in their different ways, have thought it necessary to come to terms with features of Aristotle’s categorial scheme.</p></blockquote><p>Speaking of irony, it is more than a little ironic, it is downright remarkable that Chunky Monkey would attempt to use such a fundamentally philosophical action as categorical observation as a means of trying to disqualify and discredit someone.</p><p>UPDATE: in case you had any doubts whatsoever:</p><blockquote><p>Chunky Monkey<br>As a rule, don’t try to control definitions and back it up with a mealy mouthed ad hominem attack.  It is unnecessary reductionism and you know that.  I understand you want a catch term to discount people you have no interest in debating, but don’t think many people can’t sense that is what that is.</br></p><p>Darkstream<br>Chunky Monkey I literally created that definition, which is what the honest observer does rather than pervert existing definitions. Nor is it an ad hominem attack, “mealy mouthed” or otherwise, to observe that you are exhibiting classic gamma behavior. That’s not argumentum ad hominem, because that’s not WHY you are wrong.  You’re just wrong because you don’t know the difference between “categorize” and “quantify”. Your improper use of words you don’t understand, your use of adverbs to try to spin the situation, and your inability to simply admit that you are wrong are all entirely predictable. Because IN ADDITION to being wrong, you are, observably, a gamma male.</br></p><p>Chunky Monkey<br>Really missing the point.  I have seen hundreds of internet personalities create their own version of ‘x’-male: it is a cheap attack, and means nothing.  You may as well call me a racist. This is why I made an obvious mischaracterization: only SJWs get triggered over not being able to control definitions.  You have spent so much time studying and talking about SJWs and jordan peterson that the abyss has become you.  It happens to the best of us, please do not think that because you are smart you somehow transcend your human tendencies.﻿﻿</br></p></blockquote><p>Every. Single. Time. Secret King wins again!</p></div>",
  "content_text": "An exchange in the Darkstream comments:\nChunky Monkey\nVox has argued that what he calls uniquely high IQ people think holistically, and then turns around and tries to vaguely quantify everything while ironically using that as justification.﻿\nDarkstream\nThere is no quantification involved at all, vaguely or otherwise. You are confusing the concept of “categorization” with “quantification”. They are two different things. As a general rule, don’t try to correct your intellectual superiors, particularly using words you don’t understand.﻿\nIf you are a Gamma, or even have Gamma tendencies, you simply must learn to resist the urge to correct others, particularly those who are more intelligent than you are. Also, try to keep the adverbs to a minimum. Gammas love adverbs, because adverbs qualify verbs, which permits them to put themselves in the position of implicitly pronouncing judgment on the actions of others.\nCategorical thinking is vital to understanding. In fact, categorical thinking is the foundation of Western philosophy, to such an extent that the Stanford Encyclopedia considers Aristotle’s categorical system to be uniquely important.\nAristotle’s\nCategories\nis a singularly important work of philosophy. It not only presents the backbone of Aristotle’s own philosophical theorizing, but has exerted an unparalleled influence on the systems of many of the greatest philosophers in the western tradition. The set of doctrines in the Categories, which I will henceforth call categorialism, provides the framework of inquiry for a wide variety of Aristotle’s philosophical investigations, ranging from his discussions of time and change in the\nPhysics\n, to the science of being qua being in the\nMetaphysics\n, and even extending to his rejection of Platonic ethics in the\nNicomachean Ethics\n. Looking beyond his own works, Aristotle’s categorialism has engaged the attention of such diverse philosophers as Plotinus, Porphyry, Aquinas, Descartes, Spinoza, Leibniz, Locke, Berkeley, Hume, Kant, Hegel, Brentano and Heidegger (to mention just a few), who have variously embraced, defended, modified or rejected its central contentions. All, in their different ways, have thought it necessary to come to terms with features of Aristotle’s categorial scheme.\nSpeaking of irony, it is more than a little ironic, it is downright remarkable that Chunky Monkey would attempt to use such a fundamentally philosophical action as categorical observation as a means of trying to disqualify and discredit someone.\nUPDATE: in case you had any doubts whatsoever:\nChunky Monkey\nAs a rule, don’t try to control definitions and back it up with a mealy mouthed ad hominem attack.  It is unnecessary reductionism and you know that.  I understand you want a catch term to discount people you have no interest in debating, but don’t think many people can’t sense that is what that is.\nDarkstream\nChunky Monkey I literally created that definition, which is what the honest observer does rather than pervert existing definitions. Nor is it an ad hominem attack, “mealy mouthed” or otherwise, to observe that you are exhibiting classic gamma behavior. That’s not argumentum ad hominem, because that’s not WHY you are wrong.  You’re just wrong because you don’t know the difference between “categorize” and “quantify”. Your improper use of words you don’t understand, your use of adverbs to try to spin the situation, and your inability to simply admit that you are wrong are all entirely predictable. Because IN ADDITION to being wrong, you are, observably, a gamma male.\nChunky Monkey\nReally missing the point.  I have seen hundreds of internet personalities create their own version of ‘x’-male: it is a cheap attack, and means nothing.  You may as well call me a racist. This is why I made an obvious mischaracterization: only SJWs get triggered over not being able to control definitions.  You have spent so much time studying and talking about SJWs and jordan peterson that the abyss has become you.  It happens to the best of us, please do not think that because you are smart you somehow transcend your human tendencies.﻿﻿\nEvery. Single. Time. Secret King wins again!",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-11T13:31:11+00:00"
}