{
  "url": "https://voxday.net/2019/01/01/industrial-scale-wizardry/",
  "scraped_at": "2025-12-20T05:23:22.089464",
  "title": "Industrial scale wizardry",
  "date_display": "January 1, 2019",
  "date_iso": "2019-01-01T13:00:05+00:00",
  "date_from_url": "2019-01-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Jordan Peterson to <i>The Last Jedi</i>, you simply can’t believe anything that the media tells you about what is big or smart or successful or popular anymore. Because it’s all just <a href=\"https://www.brianniemeier.com/2018/12/the-last-jedi-and-fake-reviews.html\">corporate gaslighting for profit</a>.</p><blockquote><p><b>Director Kyle Newman: </b>You look at <i>The Last Jedi</i>, and honestly, I don’t know anybody out here, maybe two people in my life, out of hundreds of people that I’ve talked to, who liked the movie. All the filmmakers I know that won’t talk about it publicly. All the people I know internally, there’s all these people that won’t, even journalists who gave it positive reviews are like, I do that because I need to maintain my access. Privately, there’s a lot of people who really don’t like it.</p><p><b>Geeks and Gamers: </b>So you’re saying that the ones who gave it good reviews really are phony reviews.</p><p><b>Newman: </b>100 percent. I can’t name them, but yes, 100 percent.</p></blockquote><p>I find it interesting that despite the constant encouragement to “think different” and “question authority” and engage in “critical thinking”, the media devotes an incredible amount of resources to convincing those who consume its products to do precisely the opposite. This would appear to be the inversive wizardry that Owen Benjamin describes, albeit on a giant industrial scale.</p></div>",
  "content_text": "From Jordan Peterson to\nThe Last Jedi\n, you simply can’t believe anything that the media tells you about what is big or smart or successful or popular anymore. Because it’s all just\ncorporate gaslighting for profit\n.\nDirector Kyle Newman:\nYou look at\nThe Last Jedi\n, and honestly, I don’t know anybody out here, maybe two people in my life, out of hundreds of people that I’ve talked to, who liked the movie. All the filmmakers I know that won’t talk about it publicly. All the people I know internally, there’s all these people that won’t, even journalists who gave it positive reviews are like, I do that because I need to maintain my access. Privately, there’s a lot of people who really don’t like it.\nGeeks and Gamers:\nSo you’re saying that the ones who gave it good reviews really are phony reviews.\nNewman:\n100 percent. I can’t name them, but yes, 100 percent.\nI find it interesting that despite the constant encouragement to “think different” and “question authority” and engage in “critical thinking”, the media devotes an incredible amount of resources to convincing those who consume its products to do precisely the opposite. This would appear to be the inversive wizardry that Owen Benjamin describes, albeit on a giant industrial scale.",
  "tags": [
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-01T13:00:05+00:00"
}