{
  "url": "https://voxday.net/2019/01/28/laying-down-the-audio-law/",
  "scraped_at": "2025-12-20T05:27:34.923441",
  "title": "Laying down the audio law",
  "date_display": "January 28, 2019",
  "date_iso": "2019-01-28T13:30:11+00:00",
  "date_from_url": "2019-01-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://arkhavencomics.com/product-tag/lawdog/\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"512\" data-original-width=\"512\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"https://arkhavencomics.com/wp-content/uploads/2019/01/Lawdog_512.jpg\" width=\"320\"/></a></div><p>I fully expect <a href=\"http://arkhavencomics.com/product-tag/lawdog/\">these two books by Lawdog</a> to rapidly become our bestselling audiobooks because there is literally NOTHING better to listen to on a long car drive with the family. The vehicle was literally shaking with laughter for hours, and quotes from the two books were being  regularly dropped into conversation over the entire course of the conversation. We literally couldn’t sit down to eat without someone intoning in a high-pitched voice: “As God is my witness, I’ll never go hungry again!” Which was inevitably followed by shrieks of laughter.</p><p>Do you know how people often tell you something is funny, but when you actually watch it, or read it, or listen to it, you don’t see what the fuss was all about? Yeah, that’s not the case here. Both Lawdog books are reliably much funnier and more insightful than you’re expecting it can possibly be.</p><p>Both <i>The Lawdog Files</i> and <i>The Lawdog Files: African Adventures<b> </b></i>are now available as high-quality DRM-free audiobooks <a href=\"http://arkhavencomics.com/product-tag/lawdog/\">at Arkhaven</a>.</p><p><i><b><a href=\"http://arkhavencomics.com/product/lawdog-audiobook/\">THE LAWDOG FILES</a></b></i></p><p>LawDog had the honor of representing law and order in the Texas town of Bugscuffle as a sheriff’s deputy, where he became notorious for, among other things, the famous Case of the Pink Gorilla Suit. In <i>The LawDog Files</i>, he chronicles his official encounters with everything from naked bikers, combative eco-warriors, suicidal drunks, respectful methheads, prison tattoo artists, and creepy children to six-foot chickens and lethal chihuahuas.</p><p><i>The LawDog Files</i> range from the bittersweet to the explosively hilarious, as LawDog relates his unforgettable experiences in a laconic, self-deprecating manner that is funny in its own right. The audiobook is more than mere entertainment, it is an education in two English dialects, Police and Texas Country. And underlying the humor is an unmistakable sympathy for society’s less fortunate – and in most cases, significantly less intelligent – whose encounters with the law are an all-too-frequent affair. 4 hours, 29 minutes. $9.99</p><p><b><i><a href=\"http://arkhavencomics.com/product/lawdog-africa-audiobook/\">THE LAWDOG FILES: AFRICAN ADVENTURES</a></i></b></p><p>LawDog had the honor of representing law and order in the Texas town of Bugscuffle as a sheriff’s deputy, where he became notorious for, among other things, the famous Case of the Pink Gorilla Suit. But long before he first put on the deputy’s star, he grew up in Nigeria, where his experiences were equally unforgettable.</p><p>In <i>The Lawdog Files: African Adventures</i>, LawDog chronicles his encounters with everything from bush pilots, 15-foot pythons, pygmy mongooses, brigadier-captains, and Peace Corp hippies to the Nigerian space program. <i>The Lawdog Files: African Adventures</i> is every bit as hilarious as the previous volume, as LawDog relates his unforgettable experiences in a laconic, self-deprecating manner that is funny in its own right. Africa wins again, and again, and again, but so too does the reader in this sobering but hilarious collection of true tales from the Dark Continent. 4 hours, 11 minutes. $9.99.</p></div>",
  "content_text": "I fully expect\nthese two books by Lawdog\nto rapidly become our bestselling audiobooks because there is literally NOTHING better to listen to on a long car drive with the family. The vehicle was literally shaking with laughter for hours, and quotes from the two books were being  regularly dropped into conversation over the entire course of the conversation. We literally couldn’t sit down to eat without someone intoning in a high-pitched voice: “As God is my witness, I’ll never go hungry again!” Which was inevitably followed by shrieks of laughter.\nDo you know how people often tell you something is funny, but when you actually watch it, or read it, or listen to it, you don’t see what the fuss was all about? Yeah, that’s not the case here. Both Lawdog books are reliably much funnier and more insightful than you’re expecting it can possibly be.\nBoth\nThe Lawdog Files\nand\nThe Lawdog Files: African Adventures\nare now available as high-quality DRM-free audiobooks\nat Arkhaven\n.\nTHE LAWDOG FILES\nLawDog had the honor of representing law and order in the Texas town of Bugscuffle as a sheriff’s deputy, where he became notorious for, among other things, the famous Case of the Pink Gorilla Suit. In\nThe LawDog Files\n, he chronicles his official encounters with everything from naked bikers, combative eco-warriors, suicidal drunks, respectful methheads, prison tattoo artists, and creepy children to six-foot chickens and lethal chihuahuas.\nThe LawDog Files\nrange from the bittersweet to the explosively hilarious, as LawDog relates his unforgettable experiences in a laconic, self-deprecating manner that is funny in its own right. The audiobook is more than mere entertainment, it is an education in two English dialects, Police and Texas Country. And underlying the humor is an unmistakable sympathy for society’s less fortunate – and in most cases, significantly less intelligent – whose encounters with the law are an all-too-frequent affair. 4 hours, 29 minutes. $9.99\nTHE LAWDOG FILES: AFRICAN ADVENTURES\nLawDog had the honor of representing law and order in the Texas town of Bugscuffle as a sheriff’s deputy, where he became notorious for, among other things, the famous Case of the Pink Gorilla Suit. But long before he first put on the deputy’s star, he grew up in Nigeria, where his experiences were equally unforgettable.\nIn\nThe Lawdog Files: African Adventures\n, LawDog chronicles his encounters with everything from bush pilots, 15-foot pythons, pygmy mongooses, brigadier-captains, and Peace Corp hippies to the Nigerian space program.\nThe Lawdog Files: African Adventures\nis every bit as hilarious as the previous volume, as LawDog relates his unforgettable experiences in a laconic, self-deprecating manner that is funny in its own right. Africa wins again, and again, and again, but so too does the reader in this sobering but hilarious collection of true tales from the Dark Continent. 4 hours, 11 minutes. $9.99.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-28T13:30:11+00:00"
}