{
  "url": "https://voxday.net/2019/01/16/mailvox-the-inevitability-of-brexit/",
  "scraped_at": "2025-12-20T05:25:35.085315",
  "title": "Mailvox: the inevitability of Brexit",
  "date_display": "January 16, 2019",
  "date_iso": "2019-01-16T09:18:42+00:00",
  "date_from_url": "2019-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>This is an email from a British reader who wants to put the situation in perspective for non-British readers. And remember, the British mainstream media is every bit as unreliable when it comes to reporting the truth as the US mainstream media.</i></p><p>Anyone thinking that we’re inconsistent, or giving up, or will ever give up, is kidding themselves.</p><p>We would have been out of the EU a decade ago, but Blair and Cameron broke the principle of candidate selection by local party management, and imposed shortlists of approved candidates from the central party offices. This was an attempt to prevent infighting and create a consistent message to make the parties electable after the disasters of the Foot and Kinnock election attempts in the 80’s and 90’s (Labour Party), and Hague, Duncan-Smith and Howard in the 00’s (Conservative Party). The Burkean ideal was shattered by this and therefore the MPs simply do not even reflect the views of the ordinary party members of the Labour Party or the Conservative Party, let alone then ordinary voters. This is why there is a huge disconnect between the referendum result and the views in Westminster.</p><p>However, the EU issue, which had resulted in the defenestration of Thatcher to enable the Maastricht Treaty, simply wouldn’t go away – precisely because there was such an establishment consensus on staying in the EU. The party leaders on both sides took the view that they could ignore it because, “where else are our voters going to go?” Well, eventually, after trying almost every other option first to make the traditional Burkean arrangement work, the voters decided to go elsewhere.</p><p>May 2014: We voted UKIP as the largest party in the EU elections. Cameron realised the Tories were toast in the general election unless he offered the UKIP voters a reason to return. (Kippers are 2/3 Conservative and 1/3 Labour.) He thought he could promise a referendum and then bargain it away in negotiations with the Liberal Democrats.</p><p>May 2015: We voted Cameron a majority so that he couldn’t bargain away the manifesto commitment to an EU referendum. The Remain campaign’s pollsters told them they were going to lose at the start of the campaign by 52-48: “You do have a positive case for staying in the EU, don’t you?”, “Err… no.” Seriously, that’s what the pollster said they replied when he asked them!</p><p>June 2016: We voted to leave, by… exactly what was predicted the previous year. The EU is like Hillary – everyone’s opinion was already formed, and publicity campaigns were never going to change anyone’s mind.</p><p>June 2017: Theresa May wanted a huge majority, and projections were that she would have had easily enough Conservatives to win last night’s vote. But she got arrogant and blew it by stepping on the 3rd rail of British politics: The Alzheimer’s Tax, as it was dubbed. She demonstrated she couldn’t be trusted and so we ensured that she was hamstrung; precisely to achieve exactly the result of last night.</p><p>Of course Brexit was always going to be this way. It was always going to be trench warfare to get out. It was obvious from the EU’s negotiating position on 28 March 2017, the day before Article 50, that there could never be an agreement with the EU. We could never accept those terms. Even if the quisling politicians accepted them, we would simply repudiate them later using the 1970 Treaty of Vienna.</p><p>The EU seems to persistently operate under the fantasy that any British government can make commitments about the future. It can’t. The most fundamental principle of the British constitution is that no parliament may bind a future parliament. The EU keeps want us to be bound to unchanging commitments, which is an axiomatic impossibility, because we would later unbind ourselves.</p><p>On the matter of EU citizens saying that they don’t trust the British government in the future, well “Why are you even here if you don’t trust us? Because you are indeed talking about a future government that the British would choose.” The EU citizens are a bit like the Brits that move to the USA, and can’t cope with the fact that they do things differently there. We’re not Europe. We have a common law system with fundamentally different concepts of law and the relationship between the citizen and the state. And we drive on the correct side of the road.</p><p>If there is another referendum, we’ll vote to get out of the EU in exactly the same numbers. Channel 4 News presenter Jon Snow went to Leeds to interview 18-20 year olds who hadn’t voted in 2016, and was astonished to discover they were more adamant about Brexit than the older voters. It is always a false conceit of the left that they are the future, which I guess is why they are now run the world over by a gerontocracy that looks like the Chernenko regime overseeing the May Day parade, such as Pelosi and Corbyn.</p><p>Theresa May won’t authorise another referendum. It would open the door to referendums on other topics the progressives want to avoid. How about a referendum on the death penalty, abortion, abolition of the concept of asylum, or any other deplorable topic? How about another Scottish referendum? Sturgeon certainly wants it. That could open the way to an English independence referendum. The Welsh are terrified of that idea. How about a 3rd Brexit referendum? There isn’t going to be another referendum on anything, ever, if the establishment can prevent it.</p><p>Even if they manage to stop Brexit for the moment, it will remain the central issue of British politics until we are out of the EU. Nothing else is getting done in government. Brexit occupies 100 percent of government CPU capacity. They can’t wish Brexit away, much as they would like to. If this attempt to leave is stopped, then the electorate will do precisely what Cameron was trying to prevent and abandon the two main parties in order to achieve Brexit.</p><p>A prospect that I think would be really hilarious is if we are prevented from leaving, and then a Salvini-Orban grouping takes control of the EU parliament and selection of Junker’s replacement. There will be new commissioners nominated by the governments that have taken power since 2014. I can see British Remain supporters suddenly horrified: “We didn’t mean to stay in THIS EU, we meant to stay in the Merkel-Macron version!”</p><p>On a grander level, this is like the 1945 C.S. Lewis novel <i>That Hideous Strength</i> where Britain is covertly conquered by an apparently benign European bureaucracy. But the fact is that the problems are really caused by the Franco-German addiction to empire building on the European continent. We only went to war against Napoleon, the Kaiser, and Hitler because they went empire building in Europe, not because of any unpleasant domestic activities they may have engaged in. Establishing the empire peacefully is still an empire and people are still going to resist. Nationalism is sticking within your own borders. It is the Westphalian solution. It stopped the Thirty Years war. It is the path to peace, stability and prosperity.</p></div>",
  "content_text": "This is an email from a British reader who wants to put the situation in perspective for non-British readers. And remember, the British mainstream media is every bit as unreliable when it comes to reporting the truth as the US mainstream media.\nAnyone thinking that we’re inconsistent, or giving up, or will ever give up, is kidding themselves.\nWe would have been out of the EU a decade ago, but Blair and Cameron broke the principle of candidate selection by local party management, and imposed shortlists of approved candidates from the central party offices. This was an attempt to prevent infighting and create a consistent message to make the parties electable after the disasters of the Foot and Kinnock election attempts in the 80’s and 90’s (Labour Party), and Hague, Duncan-Smith and Howard in the 00’s (Conservative Party). The Burkean ideal was shattered by this and therefore the MPs simply do not even reflect the views of the ordinary party members of the Labour Party or the Conservative Party, let alone then ordinary voters. This is why there is a huge disconnect between the referendum result and the views in Westminster.\nHowever, the EU issue, which had resulted in the defenestration of Thatcher to enable the Maastricht Treaty, simply wouldn’t go away – precisely because there was such an establishment consensus on staying in the EU. The party leaders on both sides took the view that they could ignore it because, “where else are our voters going to go?” Well, eventually, after trying almost every other option first to make the traditional Burkean arrangement work, the voters decided to go elsewhere.\nMay 2014: We voted UKIP as the largest party in the EU elections. Cameron realised the Tories were toast in the general election unless he offered the UKIP voters a reason to return. (Kippers are 2/3 Conservative and 1/3 Labour.) He thought he could promise a referendum and then bargain it away in negotiations with the Liberal Democrats.\nMay 2015: We voted Cameron a majority so that he couldn’t bargain away the manifesto commitment to an EU referendum. The Remain campaign’s pollsters told them they were going to lose at the start of the campaign by 52-48: “You do have a positive case for staying in the EU, don’t you?”, “Err… no.” Seriously, that’s what the pollster said they replied when he asked them!\nJune 2016: We voted to leave, by… exactly what was predicted the previous year. The EU is like Hillary – everyone’s opinion was already formed, and publicity campaigns were never going to change anyone’s mind.\nJune 2017: Theresa May wanted a huge majority, and projections were that she would have had easily enough Conservatives to win last night’s vote. But she got arrogant and blew it by stepping on the 3rd rail of British politics: The Alzheimer’s Tax, as it was dubbed. She demonstrated she couldn’t be trusted and so we ensured that she was hamstrung; precisely to achieve exactly the result of last night.\nOf course Brexit was always going to be this way. It was always going to be trench warfare to get out. It was obvious from the EU’s negotiating position on 28 March 2017, the day before Article 50, that there could never be an agreement with the EU. We could never accept those terms. Even if the quisling politicians accepted them, we would simply repudiate them later using the 1970 Treaty of Vienna.\nThe EU seems to persistently operate under the fantasy that any British government can make commitments about the future. It can’t. The most fundamental principle of the British constitution is that no parliament may bind a future parliament. The EU keeps want us to be bound to unchanging commitments, which is an axiomatic impossibility, because we would later unbind ourselves.\nOn the matter of EU citizens saying that they don’t trust the British government in the future, well “Why are you even here if you don’t trust us? Because you are indeed talking about a future government that the British would choose.” The EU citizens are a bit like the Brits that move to the USA, and can’t cope with the fact that they do things differently there. We’re not Europe. We have a common law system with fundamentally different concepts of law and the relationship between the citizen and the state. And we drive on the correct side of the road.\nIf there is another referendum, we’ll vote to get out of the EU in exactly the same numbers. Channel 4 News presenter Jon Snow went to Leeds to interview 18-20 year olds who hadn’t voted in 2016, and was astonished to discover they were more adamant about Brexit than the older voters. It is always a false conceit of the left that they are the future, which I guess is why they are now run the world over by a gerontocracy that looks like the Chernenko regime overseeing the May Day parade, such as Pelosi and Corbyn.\nTheresa May won’t authorise another referendum. It would open the door to referendums on other topics the progressives want to avoid. How about a referendum on the death penalty, abortion, abolition of the concept of asylum, or any other deplorable topic? How about another Scottish referendum? Sturgeon certainly wants it. That could open the way to an English independence referendum. The Welsh are terrified of that idea. How about a 3rd Brexit referendum? There isn’t going to be another referendum on anything, ever, if the establishment can prevent it.\nEven if they manage to stop Brexit for the moment, it will remain the central issue of British politics until we are out of the EU. Nothing else is getting done in government. Brexit occupies 100 percent of government CPU capacity. They can’t wish Brexit away, much as they would like to. If this attempt to leave is stopped, then the electorate will do precisely what Cameron was trying to prevent and abandon the two main parties in order to achieve Brexit.\nA prospect that I think would be really hilarious is if we are prevented from leaving, and then a Salvini-Orban grouping takes control of the EU parliament and selection of Junker’s replacement. There will be new commissioners nominated by the governments that have taken power since 2014. I can see British Remain supporters suddenly horrified: “We didn’t mean to stay in THIS EU, we meant to stay in the Merkel-Macron version!”\nOn a grander level, this is like the 1945 C.S. Lewis novel\nThat Hideous Strength\nwhere Britain is covertly conquered by an apparently benign European bureaucracy. But the fact is that the problems are really caused by the Franco-German addiction to empire building on the European continent. We only went to war against Napoleon, the Kaiser, and Hitler because they went empire building in Europe, not because of any unpleasant domestic activities they may have engaged in. Establishing the empire peacefully is still an empire and people are still going to resist. Nationalism is sticking within your own borders. It is the Westphalian solution. It stopped the Thirty Years war. It is the path to peace, stability and prosperity.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-16T09:18:42+00:00"
}