{
  "url": "https://voxday.net/2019/01/07/neo-palestinian-priorities/",
  "scraped_at": "2025-12-20T05:24:11.075510",
  "title": "Neo-Palestinian priorities",
  "date_display": "January 7, 2019",
  "date_iso": "2019-01-07T11:47:11+00:00",
  "date_from_url": "2019-01-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m not sure whose grasp of American political realities is more tenuous and delusional, the Republicans in the Senate or the Neo-Palestinians who are pushing <a href=\"https://theintercept.com/2019/01/05/u-s-senates-first-bill-in-midst-of-shutdown-is-a-bipartisan-defense-of-the-israeli-government-from-boycotts/\">this blatant attack on American liberties</a>:</p><blockquote><p>WHEN EACH NEW CONGRESS is gaveled into session, the chambers attach symbolic importance to the first piece of legislation to be considered. For that reason, it bears the lofty designation of H.R.1 in the House, and S.1 in the Senate.</p><p>In the newly controlled Democratic House, H.R.1 – meant to signal the new majority’s priorities – is an anti-corruption bill that combines election and campaign finance reform, strengthening of voting rights, and matching public funds for small-dollar candidates. In the new 2017 Senate, the GOP-controlled S.1 was a bill, called the “Tax Cuts and Jobs Act,” that, among other provisions, cut various forms of corporate taxes.</p><p>But in the 2019 GOP-controlled Senate, the first bill to be considered – S.1 – is not designed to protect American workers, bolster U.S. companies, or address the various debates over border security and immigration. It’s not a bill to open the government. Instead, according to multiple sources involved in the legislative process, S.1 will be a compendium containing a handful of foreign-policy related measures, a main one of which is a provision, with Florida’s GOP Sen. Marco Rubio as a lead sponsor, to defend the Israeli government. The bill is a top legislative priority for AIPAC.</p><p>In the previous Congress, that measure was known as S.170, and it gives state and local governments explicit legal authority to boycott any U.S. companies which themselves are participating in a boycott against Israel. As the Intercept reported last month, 26 states now have enacted some version of a law to punish or otherwise sanction entities which participate in or support the boycott of Israel, while similar laws are pending in at least 13 additional states. Rubio’s bill is designed to strengthen the legal basis to defend those Israel-protecting laws from constitutional challenge.</p><p>Punishment aimed at companies which choose to boycott Israel can also sweep up individual American citizens in its punitive net, because individual contractors often work for state or local governments under the auspices of a sole proprietorship or some other business entity. That was the case with Texas elementary school speech pathologist Bahia Amawi, who lost her job working with autistic and speech-impaired children in Austin because she refused to promise not to boycott goods produced in Israel and/or illegal Israeli settlements.</p><p>Thus far, the two federal courts that have ruled on such bills have declared them to be unconstitutional violations of the First Amendment speech rights of American citizens.</p></blockquote><p>One almost suspects this to be a stealth plan being pushed by Israeli nationalists to force all the reluctant Neo-Palestinians in America to finally make good on their repeated vows to go home to Jerusalem.</p><p>Do they <i>want </i>Holocaust 2.0? Because this strikes me as being <i>a very good way</i> to go about getting<i> </i>Holocaust 2.0. Consider what Americans did to the Japanese just because they bombed some of our island real estate. Now the idiot Neo-Palestinians are dive-bombing basic American liberties – apparently the Israeli attack on the <i>U.S.S. Liberty</i> was a symbolic warning – and they think Americans will just smile and take it because a few Neo-Palestinian lawyers can produce some pharasaical reasoning to pseudo-rationalize it?</p><p>Look, I don’t support BDS. I have never supported it. I actively violate it on a regular basis. I’ve been working on two book deals with Israeli authors in the last week alone. But this outrageous, infuriating, disgusting attempt to literally FORCE Americans to economically submit to the Israeli economy makes me want to put every single God-damned Neo-Palestinian on a boat tomorrow. And I am pretty sure I know exactly where those Americans who are less well-inclined to Israel will want to put them. The mere fact that the Neo-Palestinian lobby in the USA could even <i>entertain </i>such an abominable action, let alone imagine that it is even remotely Constitutional and attempt to put it into effect, makes five things eminently clear to every single American.</p><ul><li>Jews are not and can never be Americans. They are a distinct nation with their own homeland and their own interests, some of which are totally incompatible with American interests and values.</li><li>Jews do not understand the first thing about America. They don’t fathom the core American concept of liberty any better than the average Amazonian tribesman or Swedish socialist does.</li><li>There was never any such thing as a “Judeo-Christian” heritage. There are no “Judeo-Christian” values. That is propaganda created in the mid-20th century and utilized to help pass the 1965 Naturalization Act that demographically destroyed the USA.</li><li>All those nations that kicked the Jews out over the last two thousand years probably had good reasons for doing so.</li><li>Marco Rubio is an enemy of the American people. This is exactly why you should never elect immigrants and the children of immigrants to rule over you.</li></ul><p>As a very good friend to Israel, President Trump HAS GOT to veto this bill if it ever crosses his desk, and he should promise to do so <i>right now</i>. In fact, even on its way out, the Netanyahu government would be wise to order the morons in AIPAC to reverse course on this legislation immediately; even the ADL understands that this is going to backfire, explosively, on the people of the very nation it is intended to help.</p><p>S.1 is not good for the Jews, it is more akin to assisted suicide. I will not support any politician who supports it, votes for it, or signs it, no matter what party they claim to be. Furthermore, I strongly suspect that the decision to push this provocative and obviously unconstitutional law now is part of the Republican establishment’s plan to kill the Wall, defend the Swamp, and primary President Trump in 2020.</p></div>",
  "content_text": "I’m not sure whose grasp of American political realities is more tenuous and delusional, the Republicans in the Senate or the Neo-Palestinians who are pushing\nthis blatant attack on American liberties\n:\nWHEN EACH NEW CONGRESS is gaveled into session, the chambers attach symbolic importance to the first piece of legislation to be considered. For that reason, it bears the lofty designation of H.R.1 in the House, and S.1 in the Senate.\nIn the newly controlled Democratic House, H.R.1 – meant to signal the new majority’s priorities – is an anti-corruption bill that combines election and campaign finance reform, strengthening of voting rights, and matching public funds for small-dollar candidates. In the new 2017 Senate, the GOP-controlled S.1 was a bill, called the “Tax Cuts and Jobs Act,” that, among other provisions, cut various forms of corporate taxes.\nBut in the 2019 GOP-controlled Senate, the first bill to be considered – S.1 – is not designed to protect American workers, bolster U.S. companies, or address the various debates over border security and immigration. It’s not a bill to open the government. Instead, according to multiple sources involved in the legislative process, S.1 will be a compendium containing a handful of foreign-policy related measures, a main one of which is a provision, with Florida’s GOP Sen. Marco Rubio as a lead sponsor, to defend the Israeli government. The bill is a top legislative priority for AIPAC.\nIn the previous Congress, that measure was known as S.170, and it gives state and local governments explicit legal authority to boycott any U.S. companies which themselves are participating in a boycott against Israel. As the Intercept reported last month, 26 states now have enacted some version of a law to punish or otherwise sanction entities which participate in or support the boycott of Israel, while similar laws are pending in at least 13 additional states. Rubio’s bill is designed to strengthen the legal basis to defend those Israel-protecting laws from constitutional challenge.\nPunishment aimed at companies which choose to boycott Israel can also sweep up individual American citizens in its punitive net, because individual contractors often work for state or local governments under the auspices of a sole proprietorship or some other business entity. That was the case with Texas elementary school speech pathologist Bahia Amawi, who lost her job working with autistic and speech-impaired children in Austin because she refused to promise not to boycott goods produced in Israel and/or illegal Israeli settlements.\nThus far, the two federal courts that have ruled on such bills have declared them to be unconstitutional violations of the First Amendment speech rights of American citizens.\nOne almost suspects this to be a stealth plan being pushed by Israeli nationalists to force all the reluctant Neo-Palestinians in America to finally make good on their repeated vows to go home to Jerusalem.\nDo they\nwant\nHolocaust 2.0? Because this strikes me as being\na very good way\nto go about getting\nHolocaust 2.0. Consider what Americans did to the Japanese just because they bombed some of our island real estate. Now the idiot Neo-Palestinians are dive-bombing basic American liberties – apparently the Israeli attack on the\nU.S.S. Liberty\nwas a symbolic warning – and they think Americans will just smile and take it because a few Neo-Palestinian lawyers can produce some pharasaical reasoning to pseudo-rationalize it?\nLook, I don’t support BDS. I have never supported it. I actively violate it on a regular basis. I’ve been working on two book deals with Israeli authors in the last week alone. But this outrageous, infuriating, disgusting attempt to literally FORCE Americans to economically submit to the Israeli economy makes me want to put every single God-damned Neo-Palestinian on a boat tomorrow. And I am pretty sure I know exactly where those Americans who are less well-inclined to Israel will want to put them. The mere fact that the Neo-Palestinian lobby in the USA could even\nentertain\nsuch an abominable action, let alone imagine that it is even remotely Constitutional and attempt to put it into effect, makes five things eminently clear to every single American.\nJews are not and can never be Americans. They are a distinct nation with their own homeland and their own interests, some of which are totally incompatible with American interests and values.\nJews do not understand the first thing about America. They don’t fathom the core American concept of liberty any better than the average Amazonian tribesman or Swedish socialist does.\nThere was never any such thing as a “Judeo-Christian” heritage. There are no “Judeo-Christian” values. That is propaganda created in the mid-20th century and utilized to help pass the 1965 Naturalization Act that demographically destroyed the USA.\nAll those nations that kicked the Jews out over the last two thousand years probably had good reasons for doing so.\nMarco Rubio is an enemy of the American people. This is exactly why you should never elect immigrants and the children of immigrants to rule over you.\nAs a very good friend to Israel, President Trump HAS GOT to veto this bill if it ever crosses his desk, and he should promise to do so\nright now\n. In fact, even on its way out, the Netanyahu government would be wise to order the morons in AIPAC to reverse course on this legislation immediately; even the ADL understands that this is going to backfire, explosively, on the people of the very nation it is intended to help.\nS.1 is not good for the Jews, it is more akin to assisted suicide. I will not support any politician who supports it, votes for it, or signs it, no matter what party they claim to be. Furthermore, I strongly suspect that the decision to push this provocative and obviously unconstitutional law now is part of the Republican establishment’s plan to kill the Wall, defend the Swamp, and primary President Trump in 2020.",
  "tags": [
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-07T11:47:11+00:00"
}