{
  "url": "https://voxday.net/2019/01/27/predicting-the-past/",
  "scraped_at": "2025-12-20T05:27:24.328337",
  "title": "Predicting the past",
  "date_display": "January 27, 2019",
  "date_iso": "2019-01-27T14:27:34+00:00",
  "date_from_url": "2019-01-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is <a href=\"https://english.stackexchange.com/questions/266975/word-for-a-prediction-about-the-past\">a useful exchange about linguistics</a> that many TENS defenders really need to read and take to heart:</p><blockquote><p><b>Q: </b>When the weatherman makes a prediction, we call it a forecast. If a scientist makes an estimate about something in the past (ex. the cost of a candy bar in 1850), what do we call it?</p><p><b>A: </b>A forecast is an extrapolation; it uses past and present observations to predict the future. To take a simple example, if I give you the series of data from successive years as 2,4,6,8 … you may reasonably extrapolate forwards to forecast that the next year’s number is 10. A hindcast (this is the term you are looking for) is also an extrapolation from a set of past observations to a time previous to those observations. For example, if I give you 15, 12, 9 for three years, you may reasonably extrapolate backwards to hindcast that in the previous two years the numbers were 21 and 18.</p></blockquote><p>I would prefer the term “postdiction” to refer to what evolutionists commonly do when they are backtesting claims based on their TENS-flavored theories. This is, of course, in response to a gentleman who was insisting that <a href=\"https://www.youtube.com/watch?v=K9riDSpOvoI&amp;lc=Ugxtb9w9JPH2LF_2-4d4AaABAg\">the past can be predicted</a>:</p><blockquote class=\"tr_bq\"><p>Vox, you can make predictions about history and past events that are not yet known but your theory predicts and such predictions have been made and found in the field of evolution. Ah I understand your confusion.  You are linking evolution to financial modeling.  The problem with that is that once you have a financial model and use it; the market adapts to that model such that it is no longer predictive because other people will copy the model so you cannot beat them. Genetecists not agreeing and being wrong about the gene mutation rate is not﻿</p></blockquote><p>To which I replied:</p><p>A prediction of a past event is not a prediction. Predictions do not concern the predictor’s present knowledge, they concern actual events taking place in the future. If I “predict” that the New York Yankees won a World Series game prior to 1950 – and I honestly don’t know since I don’t follow baseball – that does not make my statement a correct prediction if it turns out to be correct.﻿ Your core conception of “prediction” is false. Prediction is not based on <i>knowledge</i> of events, it is based on the <i>timing </i>of events. Look at the etymology of the word. “to say BEFORE”. That means before it HAPPENS, not before you happen to learn about it. What you are describing would be better described as postdiction.﻿</p><p>Of course, TENS has proven to be a near-complete failure even as a postdictive model. The interesting thing is that outside the topic of evolution, atheists and other skeptics tend to abhor <a href=\"https://infogalactic.com/info/Postdiction\">postdiction</a> and regard it as being indicative of intellectual sleight-of-hand.</p></div>",
  "content_text": "This is\na useful exchange about linguistics\nthat many TENS defenders really need to read and take to heart:\nQ:\nWhen the weatherman makes a prediction, we call it a forecast. If a scientist makes an estimate about something in the past (ex. the cost of a candy bar in 1850), what do we call it?\nA:\nA forecast is an extrapolation; it uses past and present observations to predict the future. To take a simple example, if I give you the series of data from successive years as 2,4,6,8 … you may reasonably extrapolate forwards to forecast that the next year’s number is 10. A hindcast (this is the term you are looking for) is also an extrapolation from a set of past observations to a time previous to those observations. For example, if I give you 15, 12, 9 for three years, you may reasonably extrapolate backwards to hindcast that in the previous two years the numbers were 21 and 18.\nI would prefer the term “postdiction” to refer to what evolutionists commonly do when they are backtesting claims based on their TENS-flavored theories. This is, of course, in response to a gentleman who was insisting that\nthe past can be predicted\n:\nVox, you can make predictions about history and past events that are not yet known but your theory predicts and such predictions have been made and found in the field of evolution. Ah I understand your confusion.  You are linking evolution to financial modeling.  The problem with that is that once you have a financial model and use it; the market adapts to that model such that it is no longer predictive because other people will copy the model so you cannot beat them. Genetecists not agreeing and being wrong about the gene mutation rate is not﻿\nTo which I replied:\nA prediction of a past event is not a prediction. Predictions do not concern the predictor’s present knowledge, they concern actual events taking place in the future. If I “predict” that the New York Yankees won a World Series game prior to 1950 – and I honestly don’t know since I don’t follow baseball – that does not make my statement a correct prediction if it turns out to be correct.﻿ Your core conception of “prediction” is false. Prediction is not based on\nknowledge\nof events, it is based on the\ntiming\nof events. Look at the etymology of the word. “to say BEFORE”. That means before it HAPPENS, not before you happen to learn about it. What you are describing would be better described as postdiction.﻿\nOf course, TENS has proven to be a near-complete failure even as a postdictive model. The interesting thing is that outside the topic of evolution, atheists and other skeptics tend to abhor\npostdiction\nand regard it as being indicative of intellectual sleight-of-hand.",
  "tags": [
    "ScienceReason"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-27T14:27:34+00:00"
}