{
  "url": "https://voxday.net/2019/01/02/rod-dreher-discovers-his-inner-nationalist/",
  "scraped_at": "2025-12-20T05:23:36.153667",
  "title": "Rod Dreher discovers his inner nationalist",
  "date_display": "January 2, 2019",
  "date_iso": "2019-01-02T18:13:00+00:00",
  "date_from_url": "2019-01-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Learning about the Spanish Civil War seems to have put a modicum of some stiffer substance – one can hardly call it steel – into Rod Dreher’s spine as he gradually begins to discover <a href=\"https://www.theamericanconservative.com/dreher/learning-from-the-spanish-civil-war/\">why the Nationalist Right is inevitable</a>.</p><blockquote><p>In 1930, the military dictatorship was overthrown, and municipal elections across the country the next year led to a big win for combined parties of left and right who favored a democratic republic. (N.B., not all leftists and rightists wanted a republic!) After the vote, the king abdicated, and the Republic was declared. Later that spring, leftist mobs burned convents and churches in various cities, while Republican police stood by doing nothing. This sent a deep shock wave through Spanish Catholicism.</p><p>The Republic, in typical European fashion, was strongly anticlerical. It quickly passed laws stripping the Catholic Church of property and the right to educate young people. There were other anticlerical measures taken. Anti-Christian laws, and violent mob action, were present at the beginning of the Republic. Prior to watching this documentary, I assumed they happened as part of the civil war itself. Imagine what it was like to see a new constitutional order (the Republic) come into being, and suddenly you can’t give your children a religious education, and your churches and convents are being torched. How confident would you be in the new order?</p><p>According to the film, Spain was still in the 19th century, in terms of economics. It was largely agrarian, with a massive peasantry that was underfed, and tended to be religious and traditional. On the other hand, they were dependent on large landowners who favored the semi-feudal conditions. These landowners were extremely conservative. Their interests clashed, obviously, and became violent when the land reform promised by the liberal Republicans did not materialize fast enough for the peasantry. Mind you, the Republic was declared in the middle of the global Great Depression, with all the political and economic turmoil that came with it.</p><p>The urban working class was organized along Marxist lines, though the left was badly fractured, and unstable. There were democratic socialists, but also communists who hewed closely to the Stalinist line. Plus, anarchists were a really significant force in Spain, something unique in Europe at the time. They competed politically, and usually aligned with the left in fighting the right. But they refused to compromise their principles by taking formal power, even when the defense of the Republic required it.</p><p>Regional autonomy also played a role in defining sides. When the civil war started, Catholics supported the Nationalist side (the Francoists) … but not in the Basque Country, which was religious, but which wanted more self-rule — something the Nationalists despised. Catalonia also wanted more independence, which meant it was firmly Republican. Barcelona, the Catalan capital, was a Republican stronghold for left-wing reasons, to be sure. I bring up the situation with the Basques and the Catalans simply to illustrate the complexity of the conflict.</p><p>Anyway, the 1933 elections resulted in a swing back to the right, with a coalition of center-right and far-right parties winning control, and reversing some of the initiatives of the previous government. Socialists, anarchists, and coal miners in the province of Asturias rebelled against the Republic. They murdered priests and government officials; the military, led by Gen. Franco, brutally suppressed the uprising. All of this radicalized the left even more.</p><p>By 1935, left-right opinion had become so polarized that there was practically no middle ground left. Both sides came to distrust democracy because it was the means by which their enemies might take power. And, as one Nationalist interviewed in the documentary puts it, people on the left and right just flat out hated each other. The whole country was a powder keg.</p><p>By the 1936 campaign, the centrist parties had practically disappeared.</p></blockquote><p>He’s really going to harden his position after he reads Anthony Beevor’s book on the war. Once you figure out that the other side really, genuinely, and truly wants to exterminate your religion and your race, only the suicidal and the delusional will persist in trying to “come together” and seek to “discuss our differences”. You can brag about being anti-racist, apolitical, post-ideological, colorblind, or even apathetic all you like, but once it finally registers that the other side is literally hell-bent on destroying everything and everyone you value, it’s no longer possible to continue lying to yourself.</p><p>I saw this in a microcosm in my interview with <i>Bleeding Cool</i> editor-in-chief Mark Siefert. He simply could not, and would not, believe what I was telling him about the SJWs in comics. He insisted that there must be a place at the table for everyone, that it didn’t have to be war to the knife. I assured him that he was wrong, and that the SJWs could not be reasoned with, and the next day, he discovered the truth when he was ejected from his position by the very SJWs he’d been defending as reasonable the day before.</p><p>The cuckspace is shrinking. The middle ground is rapidly vanishing and nothing is going to bring it back. There is nothing to bring it back, because diversity is, quite literally, disintegration. It won’t be long before those who believed they were morally superior for denouncing nationalists as fascists and nazis will be crying for those nationalists to save them… if they are not proclaiming themselves to have been nationalists all along.</p><p>The real lesson of the Spanish Civil War is this: you will not save your nation without fighting for it.</p></div>",
  "content_text": "Learning about the Spanish Civil War seems to have put a modicum of some stiffer substance – one can hardly call it steel – into Rod Dreher’s spine as he gradually begins to discover\nwhy the Nationalist Right is inevitable\n.\nIn 1930, the military dictatorship was overthrown, and municipal elections across the country the next year led to a big win for combined parties of left and right who favored a democratic republic. (N.B., not all leftists and rightists wanted a republic!) After the vote, the king abdicated, and the Republic was declared. Later that spring, leftist mobs burned convents and churches in various cities, while Republican police stood by doing nothing. This sent a deep shock wave through Spanish Catholicism.\nThe Republic, in typical European fashion, was strongly anticlerical. It quickly passed laws stripping the Catholic Church of property and the right to educate young people. There were other anticlerical measures taken. Anti-Christian laws, and violent mob action, were present at the beginning of the Republic. Prior to watching this documentary, I assumed they happened as part of the civil war itself. Imagine what it was like to see a new constitutional order (the Republic) come into being, and suddenly you can’t give your children a religious education, and your churches and convents are being torched. How confident would you be in the new order?\nAccording to the film, Spain was still in the 19th century, in terms of economics. It was largely agrarian, with a massive peasantry that was underfed, and tended to be religious and traditional. On the other hand, they were dependent on large landowners who favored the semi-feudal conditions. These landowners were extremely conservative. Their interests clashed, obviously, and became violent when the land reform promised by the liberal Republicans did not materialize fast enough for the peasantry. Mind you, the Republic was declared in the middle of the global Great Depression, with all the political and economic turmoil that came with it.\nThe urban working class was organized along Marxist lines, though the left was badly fractured, and unstable. There were democratic socialists, but also communists who hewed closely to the Stalinist line. Plus, anarchists were a really significant force in Spain, something unique in Europe at the time. They competed politically, and usually aligned with the left in fighting the right. But they refused to compromise their principles by taking formal power, even when the defense of the Republic required it.\nRegional autonomy also played a role in defining sides. When the civil war started, Catholics supported the Nationalist side (the Francoists) … but not in the Basque Country, which was religious, but which wanted more self-rule — something the Nationalists despised. Catalonia also wanted more independence, which meant it was firmly Republican. Barcelona, the Catalan capital, was a Republican stronghold for left-wing reasons, to be sure. I bring up the situation with the Basques and the Catalans simply to illustrate the complexity of the conflict.\nAnyway, the 1933 elections resulted in a swing back to the right, with a coalition of center-right and far-right parties winning control, and reversing some of the initiatives of the previous government. Socialists, anarchists, and coal miners in the province of Asturias rebelled against the Republic. They murdered priests and government officials; the military, led by Gen. Franco, brutally suppressed the uprising. All of this radicalized the left even more.\nBy 1935, left-right opinion had become so polarized that there was practically no middle ground left. Both sides came to distrust democracy because it was the means by which their enemies might take power. And, as one Nationalist interviewed in the documentary puts it, people on the left and right just flat out hated each other. The whole country was a powder keg.\nBy the 1936 campaign, the centrist parties had practically disappeared.\nHe’s really going to harden his position after he reads Anthony Beevor’s book on the war. Once you figure out that the other side really, genuinely, and truly wants to exterminate your religion and your race, only the suicidal and the delusional will persist in trying to “come together” and seek to “discuss our differences”. You can brag about being anti-racist, apolitical, post-ideological, colorblind, or even apathetic all you like, but once it finally registers that the other side is literally hell-bent on destroying everything and everyone you value, it’s no longer possible to continue lying to yourself.\nI saw this in a microcosm in my interview with\nBleeding Cool\neditor-in-chief Mark Siefert. He simply could not, and would not, believe what I was telling him about the SJWs in comics. He insisted that there must be a place at the table for everyone, that it didn’t have to be war to the knife. I assured him that he was wrong, and that the SJWs could not be reasoned with, and the next day, he discovered the truth when he was ejected from his position by the very SJWs he’d been defending as reasonable the day before.\nThe cuckspace is shrinking. The middle ground is rapidly vanishing and nothing is going to bring it back. There is nothing to bring it back, because diversity is, quite literally, disintegration. It won’t be long before those who believed they were morally superior for denouncing nationalists as fascists and nazis will be crying for those nationalists to save them… if they are not proclaiming themselves to have been nationalists all along.\nThe real lesson of the Spanish Civil War is this: you will not save your nation without fighting for it.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-02T18:13:00+00:00"
}