{
  "url": "https://voxday.net/2019/01/08/round-two-fired/",
  "scraped_at": "2025-12-20T05:24:23.519336",
  "title": "Round two: fired",
  "date_display": "January 8, 2019",
  "date_iso": "2019-01-08T14:27:51+00:00",
  "date_from_url": "2019-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The leader of the AH:Q backers’ class-action claim against Indiegogo has just informed me that their joint demand for arbitration has been sent off to both the arbitrator and Indiegogo’s VP/General Counsel. As per their recent research, they have added a claim of tortious interference by Indiegogo in the separate agreement between the campaign backers and Arkhaven.</p><p>If you are a backer of the AH:Q campaign on Indiegogo but are not one of the 195 class-action claimants – please don’t even THINK about asking if you are one of them, as if you have to ask, then you are <u>not</u> a part of it – you can still file your own demand for arbitration and the lawyers handling the class action have prepared a package that will help you do so. Note that it will cost $250 to file the claim, but that plus the cost of sending two registered mailings will be the full extent of your expenses, as stated in the Indiegogo Terms of Use.</p><p>If you are interested in filing your own demand, but have not already contacted me about doing so, please feel free to email me and I will pass your email on to the relevant parties.</p></div>",
  "content_text": "The leader of the AH:Q backers’ class-action claim against Indiegogo has just informed me that their joint demand for arbitration has been sent off to both the arbitrator and Indiegogo’s VP/General Counsel. As per their recent research, they have added a claim of tortious interference by Indiegogo in the separate agreement between the campaign backers and Arkhaven.\nIf you are a backer of the AH:Q campaign on Indiegogo but are not one of the 195 class-action claimants – please don’t even THINK about asking if you are one of them, as if you have to ask, then you are\nnot\na part of it – you can still file your own demand for arbitration and the lawyers handling the class action have prepared a package that will help you do so. Note that it will cost $250 to file the claim, but that plus the cost of sending two registered mailings will be the full extent of your expenses, as stated in the Indiegogo Terms of Use.\nIf you are interested in filing your own demand, but have not already contacted me about doing so, please feel free to email me and I will pass your email on to the relevant parties.",
  "tags": [
    "ELoE"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-08T14:27:51+00:00"
}