{
  "url": "https://voxday.net/2019/01/25/shut-up-and-code-bitches/",
  "scraped_at": "2025-12-20T05:27:05.996207",
  "title": "Shut up and code, bitches",
  "date_display": "January 25, 2019",
  "date_iso": "2019-01-25T18:08:38+00:00",
  "date_from_url": "2019-01-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Americans are <a href=\"http://www.informationliberation.com/?id=59721\">not exactly full of sympath</a>y for unexpectedly unemployed media figures these days:</p><div><blockquote><p>After news came out about mass layoffs at HuffPost, Buzzfeed and Gannett — in the midst of the media’s relentless smear-job against the Covington Catholic students — right-wing Twitter had a field day. Tons of leftist journalists announced they were laid off on Twitter and the top meme was telling them to “learn to code” — which is the same advice the media gave middle Americans whose jobs are being taken in traditional industries. </p></blockquote><p>Of course, the newly-jobless journalists understood the obvious schadenfreude involved, given their past lack of sympathy for Americans disemployed by imports and immigration, and endured the laughter at their expense with all the stoicism and <i>sang froid</i> one would naturally expect of enlightened and superior beings.</p><p>A lot of people are going to enjoy telling Kevin Williams that he is a negative asset who deserves to die when he loses his job. Again.</p></div></div>",
  "content_text": "Americans are\nnot exactly full of sympath\ny for unexpectedly unemployed media figures these days:\nAfter news came out about mass layoffs at HuffPost, Buzzfeed and Gannett — in the midst of the media’s relentless smear-job against the Covington Catholic students — right-wing Twitter had a field day. Tons of leftist journalists announced they were laid off on Twitter and the top meme was telling them to “learn to code” — which is the same advice the media gave middle Americans whose jobs are being taken in traditional industries.\nOf course, the newly-jobless journalists understood the obvious schadenfreude involved, given their past lack of sympathy for Americans disemployed by imports and immigration, and endured the laughter at their expense with all the stoicism and\nsang froid\none would naturally expect of enlightened and superior beings.\nA lot of people are going to enjoy telling Kevin Williams that he is a negative asset who deserves to die when he loses his job. Again.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-25T18:08:38+00:00"
}