{
  "url": "https://voxday.net/2019/01/29/the-consequences-of-russiagate/",
  "scraped_at": "2025-12-20T05:27:44.161266",
  "title": "The consequences of Russiagate",
  "date_display": "January 29, 2019",
  "date_iso": "2019-01-29T13:10:37+00:00",
  "date_from_url": "2019-01-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The most important consequences are not likely to be the outcome of the Mueller investigation or even the re-election of the God-Emperor, but <a href=\"https://www.rt.com/op-ed/449711-democracy-illusion-us-russiagate/\">the way in which it has further destroyed faith in the liberal democratic system</a> pushed by the neo-liberal world order everywhere from Moscow to Tokyo. This Russian perspective is very much not limited to the Russian people:</p><blockquote><p>What should interest us is how Russiagate allegations have tarnished America’s democratic reputation in Russia and thereby undermined the pro-American arguments of Russia’s liberal democrats, who were never a very potent political or electoral force and whose fortunes have already declined in recent years. Consider the following:</p><p> – Russian democrats argue that their country’s elections are manipulated and unfair, including, but not only, those that put and kept Vladimir Putin in the Kremlin. “Patriotic nationalists” now reply that Russiagate rests on the allegation, widely reported and believed in the United States, that an American presidential election was successfully manipulated on behalf of the desired candidate and that the entire US electoral system may be vulnerable to manipulation.</p><p>– Russian democrats protest that oligarchic and other money has corrupted Russian politics. Their opponents argue that special counsel Robert Mueller’s convictions and other indictments – in the cases of Paul Manafort and Michael Cohen, for example -prove that American political life is no less corrupt financially.</p><p>– Going back to Soviet times and continuing today, a major complaint of Russian democrats has been the shadowy, malevolent role played by intelligence agencies, particularly the KGB and its successor organization. Patriotic nationalists point to disclosures that their US institutional counterparts, the CIA and FBI, played a secretive and major role in the origins of Russiagate allegations against Trump as a presidential candidate and since his inauguration.</p><p>– Russian democratic dissidents have long protested, and been stifled by, varying degrees of official censorship. Their Russian opponents argue that campaigns now underway in the United States against “Russian disinformation” in the media are a form of American censorship.</p><p>– Many Russians distrust their media, particularly “mainstream” state media. Their opponents retort that American mainstream media is no better, having undertaken a kind of “war” against President Trump and along the way having had to retract dozens of widely circulated stories. In this connection, we may wonder what Russian skeptics made of an astonishingly revealing statement by the media critic of The New York Times – an authoritative newspaper in Russia as well – on January 21 that the “ultimate prize” for leading American journalists is having “helped bring down a president.” By now, Americans may not be shocked by such a repudiation by the Times of its own professed mission and standards, but for Russian journalists, who have long looked to the paper as a model, the reaction was likely profound disillusionment.</p></blockquote><p>The Neo-Western model has long been viewed askance by the global East and South. But not until very recently has it actually looked inferior to the alternative post-Communist systems that are now on the rise and competing effectively in Africa and Asia.</p></div>",
  "content_text": "The most important consequences are not likely to be the outcome of the Mueller investigation or even the re-election of the God-Emperor, but\nthe way in which it has further destroyed faith in the liberal democratic system\npushed by the neo-liberal world order everywhere from Moscow to Tokyo. This Russian perspective is very much not limited to the Russian people:\nWhat should interest us is how Russiagate allegations have tarnished America’s democratic reputation in Russia and thereby undermined the pro-American arguments of Russia’s liberal democrats, who were never a very potent political or electoral force and whose fortunes have already declined in recent years. Consider the following:\n– Russian democrats argue that their country’s elections are manipulated and unfair, including, but not only, those that put and kept Vladimir Putin in the Kremlin. “Patriotic nationalists” now reply that Russiagate rests on the allegation, widely reported and believed in the United States, that an American presidential election was successfully manipulated on behalf of the desired candidate and that the entire US electoral system may be vulnerable to manipulation.\n– Russian democrats protest that oligarchic and other money has corrupted Russian politics. Their opponents argue that special counsel Robert Mueller’s convictions and other indictments – in the cases of Paul Manafort and Michael Cohen, for example -prove that American political life is no less corrupt financially.\n– Going back to Soviet times and continuing today, a major complaint of Russian democrats has been the shadowy, malevolent role played by intelligence agencies, particularly the KGB and its successor organization. Patriotic nationalists point to disclosures that their US institutional counterparts, the CIA and FBI, played a secretive and major role in the origins of Russiagate allegations against Trump as a presidential candidate and since his inauguration.\n– Russian democratic dissidents have long protested, and been stifled by, varying degrees of official censorship. Their Russian opponents argue that campaigns now underway in the United States against “Russian disinformation” in the media are a form of American censorship.\n– Many Russians distrust their media, particularly “mainstream” state media. Their opponents retort that American mainstream media is no better, having undertaken a kind of “war” against President Trump and along the way having had to retract dozens of widely circulated stories. In this connection, we may wonder what Russian skeptics made of an astonishingly revealing statement by the media critic of The New York Times – an authoritative newspaper in Russia as well – on January 21 that the “ultimate prize” for leading American journalists is having “helped bring down a president.” By now, Americans may not be shocked by such a repudiation by the Times of its own professed mission and standards, but for Russian journalists, who have long looked to the paper as a model, the reaction was likely profound disillusionment.\nThe Neo-Western model has long been viewed askance by the global East and South. But not until very recently has it actually looked inferior to the alternative post-Communist systems that are now on the rise and competing effectively in Africa and Asia.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-29T13:10:37+00:00"
}