{
  "url": "https://voxday.net/2019/01/08/the-joy-of-gammas/",
  "scraped_at": "2025-12-20T05:24:21.658683",
  "title": "The joy of gammas",
  "date_display": "January 8, 2019",
  "date_iso": "2019-01-08T13:15:18+00:00",
  "date_from_url": "2019-01-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is one of the reasons I needed to be heavily encouraged to move into video. I knew the average IQ of the video commenters was going to be at least a standard deviation below the blog commenters, but it’s still painful to encounter and endure the retardery. I thought Gamma midwits were bad, but the average-IQ variants are arguably even worse:</p><blockquote><p>EhudofGera3<br>This is the second video of you I have seen. I’ve watched all the IDW, Owen Benjamin pointed me here, your so longwinded and have a poor presentation. What you’re saying may or may not be true, but the delivery needs work.﻿</br></p><p>Darkstream<br>Your grammar and punctuation both require improvement.﻿</br></p><p>Jakob Algeblad<br>Darkstream You seem too be a great man, responding to a respectful comment with insults…﻿</br></p><p>Darkstream<br>Your spelling requires improvement.﻿</br></p></blockquote><p>Now that I better understand them, I really, truly, and sincerely hate gammas. If you’re a gamma reading this, please understand that <i>offering unsolicited advice and criticism</i> is something that you should never, ever, do. That habit is one of the primary reasons that people not only don’t like you, but actively avoid your company. If you want to be more popular, then excise the words “should”, “need”, and “seem” from your vocabulary. Never, ever, use them.</p></div>",
  "content_text": "This is one of the reasons I needed to be heavily encouraged to move into video. I knew the average IQ of the video commenters was going to be at least a standard deviation below the blog commenters, but it’s still painful to encounter and endure the retardery. I thought Gamma midwits were bad, but the average-IQ variants are arguably even worse:\nEhudofGera3\nThis is the second video of you I have seen. I’ve watched all the IDW, Owen Benjamin pointed me here, your so longwinded and have a poor presentation. What you’re saying may or may not be true, but the delivery needs work.﻿\nDarkstream\nYour grammar and punctuation both require improvement.﻿\nJakob Algeblad\nDarkstream You seem too be a great man, responding to a respectful comment with insults…﻿\nDarkstream\nYour spelling requires improvement.﻿\nNow that I better understand them, I really, truly, and sincerely hate gammas. If you’re a gamma reading this, please understand that\noffering unsolicited advice and criticism\nis something that you should never, ever, do. That habit is one of the primary reasons that people not only don’t like you, but actively avoid your company. If you want to be more popular, then excise the words “should”, “need”, and “seem” from your vocabulary. Never, ever, use them.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-08T13:15:18+00:00"
}