{
  "url": "https://voxday.net/2019/01/16/there-will-not-be-war-with-china/",
  "scraped_at": "2025-12-20T05:25:38.701503",
  "title": "There will not be war with China",
  "date_display": "January 16, 2019",
  "date_iso": "2019-01-16T21:00:00+00:00",
  "date_from_url": "2019-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>That’s my assessment. I anticipate that <a href=\"https://www.zerohedge.com/news/2019-01-15/china-warns-us-navy-chief-will-defend-taiwan-claims-any-cost\">the USA is going to back down</a> and abandon Taiwan to the People’s Republic of China within five years due to the combination of carrier-killing technology and the absence of Neo-Palestinian interests in the South Pacific:</p><blockquote><p>A rare and under-reported tense exchange occurred between US and Chinese military commanders in Beijing on Tuesday. A high level Chinese military official, General Li Zuocheng, told the head of the United States Navy, Admiral John Richardson, in a face to face meeting that Beijing would defend its claim to Taiwan “at any cost”.</p><p>“The Taiwan issue is an internal matter of China, concerns China’s fundamental interests and the national feelings of the Chinese people, and no outside interference will be tolerated,” Li Zuocheng said in a statement released by the Ministry of Defense, cited by the AFP.</p><p>Admiral John Richardson traveled to China for talks aimed at reducing “risk and miscalculation”.<br>After a series of recent instances involving US Navy warships making provocative passages through the Taiwan Strait — which the US says is its right according to freedom to navigate international waters, it appears China is going “gloves off” in direct statements challenging US military commanders.</br></p><p>Gen. Zuocheng, who is a powerful member of the Central Military Commission further told the US Navy chief: <i>If anyone wants to separate Taiwan from China, the Chinese army will defend the unity of the motherland at any cost.</i></p><p>Alarmingly this comes after President Xi Jinping provoked an angry rebuke from Taiwan’s pro-independence president when he demanded during a landmark speech on Jan. 2  that Taiwan submit to “reunification” with Beijing.</p><p>And in a follow-up speech days after this before military officials, Xi took his belligerent rhetoric one step further by issuing his first military command of 2019: that “all military units must correctly understand major national security and development trends, and strengthen their sense of unexpected hardship, crisis and battle.” Xi had essentially ordered the Chinese military to prepare for war as his first act of 2019.</p></blockquote><p>By contrast, the first act of 2019 on the part of the US Senate was to attempt to pass a law violating the civil rights of the American people to not engage in commerce with Israel. China clearly grasps that the USA is no longer an independent actor capable of defending its own interests, let alone upholding its erstwhile global hegemony, and will not be hesitant to exploit the situation.</p></div>",
  "content_text": "That’s my assessment. I anticipate that\nthe USA is going to back down\nand abandon Taiwan to the People’s Republic of China within five years due to the combination of carrier-killing technology and the absence of Neo-Palestinian interests in the South Pacific:\nA rare and under-reported tense exchange occurred between US and Chinese military commanders in Beijing on Tuesday. A high level Chinese military official, General Li Zuocheng, told the head of the United States Navy, Admiral John Richardson, in a face to face meeting that Beijing would defend its claim to Taiwan “at any cost”.\n“The Taiwan issue is an internal matter of China, concerns China’s fundamental interests and the national feelings of the Chinese people, and no outside interference will be tolerated,” Li Zuocheng said in a statement released by the Ministry of Defense, cited by the AFP.\nAdmiral John Richardson traveled to China for talks aimed at reducing “risk and miscalculation”.\nAfter a series of recent instances involving US Navy warships making provocative passages through the Taiwan Strait — which the US says is its right according to freedom to navigate international waters, it appears China is going “gloves off” in direct statements challenging US military commanders.\nGen. Zuocheng, who is a powerful member of the Central Military Commission further told the US Navy chief:\nIf anyone wants to separate Taiwan from China, the Chinese army will defend the unity of the motherland at any cost.\nAlarmingly this comes after President Xi Jinping provoked an angry rebuke from Taiwan’s pro-independence president when he demanded during a landmark speech on Jan. 2  that Taiwan submit to “reunification” with Beijing.\nAnd in a follow-up speech days after this before military officials, Xi took his belligerent rhetoric one step further by issuing his first military command of 2019: that “all military units must correctly understand major national security and development trends, and strengthen their sense of unexpected hardship, crisis and battle.” Xi had essentially ordered the Chinese military to prepare for war as his first act of 2019.\nBy contrast, the first act of 2019 on the part of the US Senate was to attempt to pass a law violating the civil rights of the American people to not engage in commerce with Israel. China clearly grasps that the USA is no longer an independent actor capable of defending its own interests, let alone upholding its erstwhile global hegemony, and will not be hesitant to exploit the situation.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-16T21:00:00+00:00"
}