{
  "url": "https://voxday.net/2019/01/10/training-vs-fighting/",
  "scraped_at": "2025-12-20T05:24:43.423733",
  "title": "Training vs fighting",
  "date_display": "January 10, 2019",
  "date_iso": "2019-01-10T15:30:08+00:00",
  "date_from_url": "2019-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A karate black belt <a href=\"https://www.thecascadelegion.com/single-post/2019/01/09/Training-and-Fighting\">shares his thoughts</a> on my recent observations concerning the distinction between training and fighting.</p><blockquote><p><i>“Training is not fighting. Training is learning how to do things. Fighting is learning how to defeat the opponent who has a vote.”</i><br>– Vox Day</br></p><p> Everyone knows that training is important. Without training, success is a dice-roll, and failure is likely. Even if you get something right, it is easy to mis-attribute your success to one thing, when in reality something else entirely won the day. Only those with training know what to look for.</p><p>Through volume of repetition, training gives you the speed and instincts to do the right thing, whether that is resolving an argument, building a house, or coming out on top in a bar-fight.</p><p>But training isn’t enough. All the training in the world isn’t enough without experience.</p><p>In order to be confident in himself, a man has to know he can physically protect himself. It doesn’t matter if this is rational in the modern age. It just is. If wealth, charisma, or social connections are the measure of power today, physical fitness and skill in fighting still dominate how men evaluate other men, and how they think of themselves. It’s primordial.</p><p>Today’s generation half-understands this. They’ve seen <i>Fight Club</i>. They understand the attraction of being dangerous. They sign up in herds for Karate, Taekwondo, Brazilian Jiu-Jitsu, the works. But they mistake training for fighting. They mistake the tools for the finished product. The finger for the moon.</p><p>I received my black-belt in Shudokan karate when I was sixteen years old. By the time I had received that supposed sign of mastery, I had heard three fight stories involving black-belts.</p></blockquote><p>Read the whole thing <a href=\"https://www.thecascadelegion.com/single-post/2019/01/09/Training-and-Fighting\">there</a>. And then reflect upon the confidence and resilience that I exhibit, that some people despise and others admire. Even if you believe the confidence is a sham, or that it is delusional, from whence does the resilience spring? Why is it that I am so able to bounce back so quickly, so automatically, from the sort of attacks, expulsions, and deplatformings that others find so debilitating?</p><p>It’s just experience. It’s from the certain knowledge that you can get up and get back into the fight after you get knocked down. And the only way to acquire that knowledge, the only way to acquire that resilience, the only way to acquire that confidence in yourself, is to take the shots and face that moment of truth that no amount of self-deception can ever disguise. It’s a moment that observers can often see too.</p><p>That’s why real fighters often admire each other even if they actively dislike each other. That’s why boxers often hug with genuine affection after beating the hell out of each other. That’s why two men who get into a fight not infrequently become friends. Because the nature of the combat relationship is such that it often gives a man a glimpse of his opponent’s soul, and it is not uncommon to see something admirable there.</p></div>",
  "content_text": "A karate black belt\nshares his thoughts\non my recent observations concerning the distinction between training and fighting.\n“Training is not fighting. Training is learning how to do things. Fighting is learning how to defeat the opponent who has a vote.”\n– Vox Day\nEveryone knows that training is important. Without training, success is a dice-roll, and failure is likely. Even if you get something right, it is easy to mis-attribute your success to one thing, when in reality something else entirely won the day. Only those with training know what to look for.\nThrough volume of repetition, training gives you the speed and instincts to do the right thing, whether that is resolving an argument, building a house, or coming out on top in a bar-fight.\nBut training isn’t enough. All the training in the world isn’t enough without experience.\nIn order to be confident in himself, a man has to know he can physically protect himself. It doesn’t matter if this is rational in the modern age. It just is. If wealth, charisma, or social connections are the measure of power today, physical fitness and skill in fighting still dominate how men evaluate other men, and how they think of themselves. It’s primordial.\nToday’s generation half-understands this. They’ve seen\nFight Club\n. They understand the attraction of being dangerous. They sign up in herds for Karate, Taekwondo, Brazilian Jiu-Jitsu, the works. But they mistake training for fighting. They mistake the tools for the finished product. The finger for the moon.\nI received my black-belt in Shudokan karate when I was sixteen years old. By the time I had received that supposed sign of mastery, I had heard three fight stories involving black-belts.\nRead the whole thing\nthere\n. And then reflect upon the confidence and resilience that I exhibit, that some people despise and others admire. Even if you believe the confidence is a sham, or that it is delusional, from whence does the resilience spring? Why is it that I am so able to bounce back so quickly, so automatically, from the sort of attacks, expulsions, and deplatformings that others find so debilitating?\nIt’s just experience. It’s from the certain knowledge that you can get up and get back into the fight after you get knocked down. And the only way to acquire that knowledge, the only way to acquire that resilience, the only way to acquire that confidence in yourself, is to take the shots and face that moment of truth that no amount of self-deception can ever disguise. It’s a moment that observers can often see too.\nThat’s why real fighters often admire each other even if they actively dislike each other. That’s why boxers often hug with genuine affection after beating the hell out of each other. That’s why two men who get into a fight not infrequently become friends. Because the nature of the combat relationship is such that it often gives a man a glimpse of his opponent’s soul, and it is not uncommon to see something admirable there.",
  "tags": [
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-10T15:30:08+00:00"
}