{
  "url": "https://voxday.net/2019/01/03/universal-liberal-imperialism/",
  "scraped_at": "2025-12-20T05:23:41.408050",
  "title": "Universal liberal imperialism",
  "date_display": "January 3, 2019",
  "date_iso": "2019-01-03T12:54:30+00:00",
  "date_from_url": "2019-01-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As promised in <a href=\"https://youtu.be/83llKqBSmtM\">last night’s Darkstream</a>, I started reading Yoram Hazony’s <i>The Virtue of Nationalism</i> last night. I only read up to Chapter 8 before turning in, but so far, Hazony appears to be a genuine nationalist rather than a fake nationalist Neopalestine-Firster like Dennis Prager and Ben Shapiro. He makes some excellent observations, and while he so far has steered almost entirely clear of the heavy involvement of members of his nation in what he calls “the international liberal empire”, that’s not particularly important in light of the focus of his work on the intrinsic imperialism of universal liberalism.</p><blockquote><p>MY LIBERAL FRIENDS AND colleagues do not seem to understand that the advancing liberal construction is a form of imperialism. But to anyone not already immersed in the new order, the resemblance is easy to see. Much like the pharaohs and the Babylonian kings, the Roman emperors and the Roman Catholic Church until well into the modern period, as well as the Marxists of the last century, liberals, too, have their grand theory about how they are going to bring peace and economic prosperity to the world by pulling down all the borders and uniting mankind under their own universal rule. Infatuated with the clarity and intellectual rigor of this vision, they disdain the laborious process of consulting with the multitude of nations they believe should embrace their view of what is right. And like other imperialists, they are quick to express disgust, contempt, and anger when their vision of peace and prosperity meets with opposition from those who they are sure would benefit immensely by simply submitting.</p><p>Liberal imperialism is not monolithic, of course. When President George H. W. Bush declared the arrival of a “new world order” after the demise of the Communist bloc, he had in mind a world in which America supplies the military might necessary to impose a “rule of law” emanating from the Security Council of the United Nations. Subsequent American presidents rejected this scheme, preferring a world order based on unilateral American action in consultation with European allies and others. Europeans, on the other hand, have preferred to speak of “transnationalism,” a view that sees the power of independent nations, America included, as being subordinated to the decisions of international judicial and administrative bodies based in Europe. These disagreements over how the international liberal empire is to be governed are often described as if they are historically novel, but this is hardly so. For the most part, they are simply the reincarnation of threadworn medieval debates between the emperor and the pope over how the international Catholic empire should be governed—with the role of the emperor being reprised by those (mostly Americans) who insist that authority must be concentrated in Washington, the political and military center; and the role of the papacy being played by those (mostly European, but also many American academics) who see ultimate authority as residing with the highest interpreters of the universal law, namely, the judicial institutions of the United Nations and the European Union.</p><p>These arguments within the camp of liberal imperialism raise pressing questions for the coming liberal construction of the West. But for those of us who remain unconvinced of the desirability of maintaining such a liberal empire, the most salient fact is what the parties to these disagreements have in common. For all their bickering, proponents of the liberal construction are united in endorsing a single imperialist vision: They wish to see a world in which liberal principles are codified as universal law and imposed on the nations, if necessary by force. This, they agree, is what will bring us universal peace and prosperity.</p></blockquote><p>The book so far almost reads like something John Red Eagle and I might have written as a follow-up to <i>Cuckservative</i>. It’s definitely something Castalia House would not have hesitated to publish. A warning for libertarians, though. You will find yourself distinctly disappointed, if not outright angered, by the positions espoused by Ludwig von Mises and F.A. Hayek with regards to liberal imperialism.</p><p>It also makes me suspect that Hazony’s tangential attack on globalism as a particularly virulent form of imperialism might prove to be more effective rhetoric than attacking it directly in its own right.</p></div>",
  "content_text": "As promised in\nlast night’s Darkstream\n, I started reading Yoram Hazony’s\nThe Virtue of Nationalism\nlast night. I only read up to Chapter 8 before turning in, but so far, Hazony appears to be a genuine nationalist rather than a fake nationalist Neopalestine-Firster like Dennis Prager and Ben Shapiro. He makes some excellent observations, and while he so far has steered almost entirely clear of the heavy involvement of members of his nation in what he calls “the international liberal empire”, that’s not particularly important in light of the focus of his work on the intrinsic imperialism of universal liberalism.\nMY LIBERAL FRIENDS AND colleagues do not seem to understand that the advancing liberal construction is a form of imperialism. But to anyone not already immersed in the new order, the resemblance is easy to see. Much like the pharaohs and the Babylonian kings, the Roman emperors and the Roman Catholic Church until well into the modern period, as well as the Marxists of the last century, liberals, too, have their grand theory about how they are going to bring peace and economic prosperity to the world by pulling down all the borders and uniting mankind under their own universal rule. Infatuated with the clarity and intellectual rigor of this vision, they disdain the laborious process of consulting with the multitude of nations they believe should embrace their view of what is right. And like other imperialists, they are quick to express disgust, contempt, and anger when their vision of peace and prosperity meets with opposition from those who they are sure would benefit immensely by simply submitting.\nLiberal imperialism is not monolithic, of course. When President George H. W. Bush declared the arrival of a “new world order” after the demise of the Communist bloc, he had in mind a world in which America supplies the military might necessary to impose a “rule of law” emanating from the Security Council of the United Nations. Subsequent American presidents rejected this scheme, preferring a world order based on unilateral American action in consultation with European allies and others. Europeans, on the other hand, have preferred to speak of “transnationalism,” a view that sees the power of independent nations, America included, as being subordinated to the decisions of international judicial and administrative bodies based in Europe. These disagreements over how the international liberal empire is to be governed are often described as if they are historically novel, but this is hardly so. For the most part, they are simply the reincarnation of threadworn medieval debates between the emperor and the pope over how the international Catholic empire should be governed—with the role of the emperor being reprised by those (mostly Americans) who insist that authority must be concentrated in Washington, the political and military center; and the role of the papacy being played by those (mostly European, but also many American academics) who see ultimate authority as residing with the highest interpreters of the universal law, namely, the judicial institutions of the United Nations and the European Union.\nThese arguments within the camp of liberal imperialism raise pressing questions for the coming liberal construction of the West. But for those of us who remain unconvinced of the desirability of maintaining such a liberal empire, the most salient fact is what the parties to these disagreements have in common. For all their bickering, proponents of the liberal construction are united in endorsing a single imperialist vision: They wish to see a world in which liberal principles are codified as universal law and imposed on the nations, if necessary by force. This, they agree, is what will bring us universal peace and prosperity.\nThe book so far almost reads like something John Red Eagle and I might have written as a follow-up to\nCuckservative\n. It’s definitely something Castalia House would not have hesitated to publish. A warning for libertarians, though. You will find yourself distinctly disappointed, if not outright angered, by the positions espoused by Ludwig von Mises and F.A. Hayek with regards to liberal imperialism.\nIt also makes me suspect that Hazony’s tangential attack on globalism as a particularly virulent form of imperialism might prove to be more effective rhetoric than attacking it directly in its own right.",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-03T12:54:30+00:00"
}