{
  "url": "https://voxday.net/2019/01/19/why-there-will-not-be-war/",
  "scraped_at": "2025-12-20T05:26:01.999684",
  "title": "Why there will not be war",
  "date_display": "January 19, 2019",
  "date_iso": "2019-01-19T11:59:31+00:00",
  "date_from_url": "2019-01-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Between Russia and Ukraine. A retired officer from the General Staff of the Russian Armed Forces <a href=\"https://www.rt.com/op-ed/449130-russia-ukraine-war-possible/\">spells it out</a> for the slow and stupid.</p><blockquote><p>First, precisely formulated and put on paper, any military-political goals involving a large-scale armed conflict with Russia would look like, to put it bluntly, delusional.</p><p>Could you seriously say things it would have to contain, out loud:<i> “As part of a short military campaign, defeat the main forces of the Russian Army deployed at the state border of Ukraine; assault and capture the city of Moscow and St. Petersburg; proceed to the Ural Mountains and the adjacent areas of Western Siberia and force the opposing side to sign a peace treaty on conditions favorable to Ukraine.”</i></p><p>This looks so unrealistic that it’s hard to believe the Ukrainian military are even discussing it, let alone making some real plans on paper.</p><p>Second, even if the Ukrainian military were to get such an order, they would have to face the fact that they have no resources or capabilities to implement it, and that’s something they won’t have for quite a while. As of today, the Armed Forces of Ukraine have very modest, to say the least, Navy and Air Force. Let’s be honest, even the country’s ground forces are not much of a force.</p><p>To win a war against a supreme military power, one needs to deliver a preemptive decisive blow of the kind the enemy cannot recover from. With the military capacities Ukraine has now it’s simply impossible.</p><p>It’s only fair to assume the Ukrainian military know this just as well, which is why it appears highly unlikely they would be considering starting a war against Russia.</p><p>The idea of Russia invading Ukraine is just as unrealistic, first and foremost for one good reason, or rather the absence of any good reason, whether military or political, to do so.  While Russia does have the military capabilities to crush the Ukrainian Army, it’s completely unclear why that would be necessary or what the plan could be for post-war Ukraine in such a case.</p><p>The international community is also not very supportive of Russia, to say the least. Deemed by many world powers to be no less than ‘a force of evil’, Moscow would need to feel really politically suicidal to begin a military campaign against Ukraine.</p><p>There’s yet another important lesson history teaches us: states going through a serious economic crisis are very unlikely to engage in a war, let alone start it. It’s no secret to anyone that neither of these two economies under discussion is exactly booming. A full-scale war would add such a financial burden to their budgets that might simply devastate them.</p><p>Thus, the only place a war between Moscow and Kiev may exist is the narrative created by the relevant expert communities.</p></blockquote><p>The idea that Russia is going to attack Ukraine, or vice-versa, is about as plausible as the idea that the RUSSIA-RUSSIA-RUSSIANS elected Donald Trump as President of the USA. The only reason Russia would have attacked Ukraine is if Hillary Clinton was elected, because she was going to invite Ukraine to join NATO.</p><p>Don’t believe the media narrative. Not with regards to foreign policy, not with regards to domestic policy. Because it is always and inevitably false.</p></div>",
  "content_text": "Between Russia and Ukraine. A retired officer from the General Staff of the Russian Armed Forces\nspells it out\nfor the slow and stupid.\nFirst, precisely formulated and put on paper, any military-political goals involving a large-scale armed conflict with Russia would look like, to put it bluntly, delusional.\nCould you seriously say things it would have to contain, out loud:\n“As part of a short military campaign, defeat the main forces of the Russian Army deployed at the state border of Ukraine; assault and capture the city of Moscow and St. Petersburg; proceed to the Ural Mountains and the adjacent areas of Western Siberia and force the opposing side to sign a peace treaty on conditions favorable to Ukraine.”\nThis looks so unrealistic that it’s hard to believe the Ukrainian military are even discussing it, let alone making some real plans on paper.\nSecond, even if the Ukrainian military were to get such an order, they would have to face the fact that they have no resources or capabilities to implement it, and that’s something they won’t have for quite a while. As of today, the Armed Forces of Ukraine have very modest, to say the least, Navy and Air Force. Let’s be honest, even the country’s ground forces are not much of a force.\nTo win a war against a supreme military power, one needs to deliver a preemptive decisive blow of the kind the enemy cannot recover from. With the military capacities Ukraine has now it’s simply impossible.\nIt’s only fair to assume the Ukrainian military know this just as well, which is why it appears highly unlikely they would be considering starting a war against Russia.\nThe idea of Russia invading Ukraine is just as unrealistic, first and foremost for one good reason, or rather the absence of any good reason, whether military or political, to do so.  While Russia does have the military capabilities to crush the Ukrainian Army, it’s completely unclear why that would be necessary or what the plan could be for post-war Ukraine in such a case.\nThe international community is also not very supportive of Russia, to say the least. Deemed by many world powers to be no less than ‘a force of evil’, Moscow would need to feel really politically suicidal to begin a military campaign against Ukraine.\nThere’s yet another important lesson history teaches us: states going through a serious economic crisis are very unlikely to engage in a war, let alone start it. It’s no secret to anyone that neither of these two economies under discussion is exactly booming. A full-scale war would add such a financial burden to their budgets that might simply devastate them.\nThus, the only place a war between Moscow and Kiev may exist is the narrative created by the relevant expert communities.\nThe idea that Russia is going to attack Ukraine, or vice-versa, is about as plausible as the idea that the RUSSIA-RUSSIA-RUSSIANS elected Donald Trump as President of the USA. The only reason Russia would have attacked Ukraine is if Hillary Clinton was elected, because she was going to invite Ukraine to join NATO.\nDon’t believe the media narrative. Not with regards to foreign policy, not with regards to domestic policy. Because it is always and inevitably false.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-19T11:59:31+00:00"
}