{
  "url": "https://voxday.net/2019/01/12/you-opined-we-listened/",
  "scraped_at": "2025-12-20T05:25:01.304200",
  "title": "You opined, we listened",
  "date_display": "January 12, 2019",
  "date_iso": "2019-01-12T16:51:42+00:00",
  "date_from_url": "2019-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While we’re not always able to be responsive to various peoples’ ideas and requests, we do at least try to be amenable to suggestions for improvement. So, here is a partial list of some of the things the various teams have added lately.</p><ul><li>You can now use Paypal <a href=\"https://arkhavencomics.com/shop/\">at the Arkhaven store</a>. Please note that we’d still prefer to have you use your credit card because Paypal’s transaction cost is 2x higher, but if you’re having problems with your card being accepted, Paypal is now a viable option.</li><li>Castalia House <a href=\"https://arkhavencomics.com/product-category/audiobooks/\">audiobooks </a>sold from the Arkhaven store now come in a high-quality DRM-free single-file MP4 format. The audio quality is approximately 4x that of an Audible audiobook and you can use the file with a broad range of mobile and desktop readers and other media players. We’ve also added an AUDIOBOOKS link on the black bar on the main page to make them easier to find. We intend to eventually put our new audiobooks on Audible as well, but we are waiting to hear back from them about being able to make our 40+ existing audiobooks available on the Arkhaven store.</li><li>The Darkstream now accepts superchats. So, if you’d like to support it that way, it is now a viable option. We did <a href=\"https://www.youtube.com/watch?v=WEdG3iPr2qI\">an initial test last night</a> and it was considerably more successful than I’d imagined.</li><li>The Darkstream will soon be available in podcast format on iTunes. You can find a few recent podcasts <a href=\"https://voxday.podbean.com/\">here</a>.</li><li>The digital editions of Arkhaven and Dark Legion comics are now available <a href=\"https://arkhavencomics.com/product-category/comics/\">in high-resolution CBZ format</a>. Not all of the previously published comics have been converted yet, but all of the new releases will be.</li></ul><div>There is a lot more to come in the near future, but this is what we have already implemented and can announce to date. On the Indiegogo front, things are proceeding according to the process, and there is nothing more to say at the present time except that we are aware of the way in which SJWs are putting pressure on Indiegogo to deplatform other creators of whom they do not approve.</div></div>",
  "content_text": "While we’re not always able to be responsive to various peoples’ ideas and requests, we do at least try to be amenable to suggestions for improvement. So, here is a partial list of some of the things the various teams have added lately.\nYou can now use Paypal\nat the Arkhaven store\n. Please note that we’d still prefer to have you use your credit card because Paypal’s transaction cost is 2x higher, but if you’re having problems with your card being accepted, Paypal is now a viable option.\nCastalia House\naudiobooks\nsold from the Arkhaven store now come in a high-quality DRM-free single-file MP4 format. The audio quality is approximately 4x that of an Audible audiobook and you can use the file with a broad range of mobile and desktop readers and other media players. We’ve also added an AUDIOBOOKS link on the black bar on the main page to make them easier to find. We intend to eventually put our new audiobooks on Audible as well, but we are waiting to hear back from them about being able to make our 40+ existing audiobooks available on the Arkhaven store.\nThe Darkstream now accepts superchats. So, if you’d like to support it that way, it is now a viable option. We did\nan initial test last night\nand it was considerably more successful than I’d imagined.\nThe Darkstream will soon be available in podcast format on iTunes. You can find a few recent podcasts\nhere\n.\nThe digital editions of Arkhaven and Dark Legion comics are now available\nin high-resolution CBZ format\n. Not all of the previously published comics have been converted yet, but all of the new releases will be.\nThere is a lot more to come in the near future, but this is what we have already implemented and can announce to date. On the Indiegogo front, things are proceeding according to the process, and there is nothing more to say at the present time except that we are aware of the way in which SJWs are putting pressure on Indiegogo to deplatform other creators of whom they do not approve.",
  "tags": [
    "Darkstream"
  ],
  "categories": [],
  "sitemap_lastmod": "2019-01-12T16:51:42+00:00"
}