{
  "url": "https://voxday.net/2005/04/11/aiding-national-treasure/",
  "scraped_at": "2026-01-08T19:58:54.702866",
  "title": "Aiding a national treasure",
  "date_display": "April 11, 2005",
  "date_iso": "2005-04-11T12:30:00+00:00",
  "date_from_url": "2005-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Those of us who regularly pollute our souls by reading <a href=\"http://banedad.blogspot.com/\">BaneRants</a> are aware that as just recompense for his multitude of evils, a vast list of crimes against humanity exceeded only by Hilary Clinton and various Elder Gods now sleeping (we hope) beneath the Antarctic ice, Bane has been inflicted by various plagues and poxes of the financial variety, mostly due to his fateful decision to pass on his inferior genetics to future generations.</p><p>Since he is the most likely vice-presidential nominee for the Cthulhu 2008 campaign, it is of course desirable that the fiscal viability of this probable candidate and potential savior of the nation be maintained.  Therefore, I would encourage the regulars to consider doing one of two things:</p><p>Visit the <a href=\"http://blogathons.blogspot.com/\"> Blogathon for Bane</a> site and make a pledge, which is in no way tax-deductible and will in all probability be used to pay for expanding Difster’s already gargantuan collection of lesbian Chinese midget porn, but, like USA For Africa, will make you feel good while achieving absolutely nothing, or simply hit <a href=\"http://s1.amazon.com/exec/varzea/pay/T3VJGEAG6N6922/104-7949864-7218365\">Bane’s tip jar</a> and give the money directly to Amazon.com and increase the value of Jeff Bezos’ stock options.</p><p>I should probably add that one of the prizes mentioned by Difster will be a copy of THE ANTHOLOGY AT THE END OF THE UNIVERSE signed by two contributors, the Original Cyberpunk and me.</p></div>",
  "content_text": "Those of us who regularly pollute our souls by reading\nBaneRants\nare aware that as just recompense for his multitude of evils, a vast list of crimes against humanity exceeded only by Hilary Clinton and various Elder Gods now sleeping (we hope) beneath the Antarctic ice, Bane has been inflicted by various plagues and poxes of the financial variety, mostly due to his fateful decision to pass on his inferior genetics to future generations.\nSince he is the most likely vice-presidential nominee for the Cthulhu 2008 campaign, it is of course desirable that the fiscal viability of this probable candidate and potential savior of the nation be maintained.  Therefore, I would encourage the regulars to consider doing one of two things:\nVisit the\nBlogathon for Bane\nsite and make a pledge, which is in no way tax-deductible and will in all probability be used to pay for expanding Difster’s already gargantuan collection of lesbian Chinese midget porn, but, like USA For Africa, will make you feel good while achieving absolutely nothing, or simply hit\nBane’s tip jar\nand give the money directly to Amazon.com and increase the value of Jeff Bezos’ stock options.\nI should probably add that one of the prizes mentioned by Difster will be a copy of THE ANTHOLOGY AT THE END OF THE UNIVERSE signed by two contributors, the Original Cyberpunk and me.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-04-11T11:30:00+00:00"
}