{
  "url": "https://voxday.net/2005/04/15/do-these-people-actually-cover-sports/",
  "scraped_at": "2026-01-08T19:59:35.418137",
  "title": "Do these people actually cover sports?",
  "date_display": "April 15, 2005",
  "date_iso": "2005-04-15T11:26:00+00:00",
  "date_from_url": "2005-04-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Sports Illustrated:</p><blockquote><p>One odd fact has emerged from the controversy in Italy over a recent wave of soccer-related violence. Premier Silvio Berlusconi said on Wednesday that “drastic measures” may be necessary to curtail the unrest. That’s not the strange part; what is unusual is that Berlusconi is also the owner of soccer giant AC Milan.</p></blockquote><p>That is news, considering that Berlusconi bought Milan in 1986, a mere NINETEEN YEARS AGO!  And he was first elected Prime Minister in 1994.</p><p>I know sportswriters aren’t the brightest bulbs in the generally pallid <em>giardino</em> of journalism, but this combination of parochialism and ignorance is truly impressive.  It’s one thing to not be up on the minutiae of curling coaches or the all-stars of Scottish telephone pole tossing, but Milan only happens to be one of the five biggest teams in the biggest sport in the world.</p></div>",
  "content_text": "From Sports Illustrated:\nOne odd fact has emerged from the controversy in Italy over a recent wave of soccer-related violence. Premier Silvio Berlusconi said on Wednesday that “drastic measures” may be necessary to curtail the unrest. That’s not the strange part; what is unusual is that Berlusconi is also the owner of soccer giant AC Milan.\nThat is news, considering that Berlusconi bought Milan in 1986, a mere NINETEEN YEARS AGO!  And he was first elected Prime Minister in 1994.\nI know sportswriters aren’t the brightest bulbs in the generally pallid\ngiardino\nof journalism, but this combination of parochialism and ignorance is truly impressive.  It’s one thing to not be up on the minutiae of curling coaches or the all-stars of Scottish telephone pole tossing, but Milan only happens to be one of the five biggest teams in the biggest sport in the world.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-04-15T10:26:00+00:00"
}