{
  "url": "https://voxday.net/2005/04/13/do-they-know-nothing-about-women/",
  "scraped_at": "2026-01-08T19:59:18.840120",
  "title": "Do they know nothing about women?",
  "date_display": "April 13, 2005",
  "date_iso": "2005-04-13T15:45:00+00:00",
  "date_from_url": "2005-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to question the logic expressed by <a href=\"http://pharyngula.org/index/weblog/comments/minnesota_has_its_share_of_morons/\">Pharyngurl</a> and some of my other critics.  They assert that I only got my column thanks to my wealthy father while simultaneously insisting that there has historically been a dearth of attractive women with an interest in volunteering for use as my personal sex toy.  Ergo, my presumed bitterness with the sex in general, which, of course, is the only possible explanation for my outrageous (to them) anti-suffragism.</p><p>Now, even if one ignores the fact that barely half of one percent of America’s women watch Bill O’Reilly, much less care what someone writes on the Internet, I have no doubt that I could write columns demanding that every literate woman be sent to the guillotine and it would actually INCREASE the number of willing and eager volunteers for short-term sex toy status. <em>And most of them would be liberal Democrats</em>!</p><p>I suppose that somewhere out there in the vast multiplicity of universes that surround us, there is a place where wealthy, good-looking young men require more than thirty seconds to find attractive women interested in having sex with them.  But not in this particular space-time continuum.</p><p>See <a href=\"http://www.tuckermax.com/\">Tucker Max</a> if you still can’t get this concept through your little socialist brain.</p><p>I further note that not a single critic has even attempted to make the case that the female franchise has been a positive step for economic or individual liberties in this nation or any other.  But if you prefer to simply call me a loser who can’t get laid, well, that’s effective too.  Very persuasive, really.</p></div>",
  "content_text": "I have to question the logic expressed by\nPharyngurl\nand some of my other critics.  They assert that I only got my column thanks to my wealthy father while simultaneously insisting that there has historically been a dearth of attractive women with an interest in volunteering for use as my personal sex toy.  Ergo, my presumed bitterness with the sex in general, which, of course, is the only possible explanation for my outrageous (to them) anti-suffragism.\nNow, even if one ignores the fact that barely half of one percent of America’s women watch Bill O’Reilly, much less care what someone writes on the Internet, I have no doubt that I could write columns demanding that every literate woman be sent to the guillotine and it would actually INCREASE the number of willing and eager volunteers for short-term sex toy status.\nAnd most of them would be liberal Democrats\n!\nI suppose that somewhere out there in the vast multiplicity of universes that surround us, there is a place where wealthy, good-looking young men require more than thirty seconds to find attractive women interested in having sex with them.  But not in this particular space-time continuum.\nSee\nTucker Max\nif you still can’t get this concept through your little socialist brain.\nI further note that not a single critic has even attempted to make the case that the female franchise has been a positive step for economic or individual liberties in this nation or any other.  But if you prefer to simply call me a loser who can’t get laid, well, that’s effective too.  Very persuasive, really.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-04-13T14:45:00+00:00"
}