{
  "url": "https://voxday.net/2005/04/21/hollywood-bastards/",
  "scraped_at": "2026-01-08T20:00:17.947214",
  "title": "Hollywood bastards",
  "date_display": "April 21, 2005",
  "date_iso": "2005-04-21T10:25:00+00:00",
  "date_from_url": "2005-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Hitchhiker’s review, courtesy of the OC:</p><blockquote><p>The Hitchhiker’s Guide to the Galaxy movie is bad. Really bad. <a href=\"http://www.planetmagrathea.com/shortreview.html\">You just won’t believe how vastly, staggeringly, jaw-droppingly bad it is</a>. I mean, you might think that The Phantom Menace was a hopelessly misguided attempt to reinvent a much-loved franchise by people who, though well-intentioned, completely failed to understand what made the original popular – but that’s just peanuts to the Hitchhiker’s movie. Listen.</p><p>And so on…</p><p>It’s bad on a big scale because enormous swathes of the story have been dispensed with – most of the Guide entries, whole scenes – or changed beyond all recognition. And it is bad on a small scale because many, many wonderful lines have been cut or in some cases actually rewritten to make them less funny. Whatever your favourite line from Hitchhiker’s, there’s a good chance that it won’t be in the film. Even if it’s really well-known, widely-quoted, much-loved, very funny – it will probably be absent from the movie. Or if it is there, it might have been changed.</p></blockquote><p>I cannot even describe how deeply I loathe Hollywood.  The baseless arrogance of those cretinous idiots who think they can tell a story better than the master storytellers is just sickening.</p><p>Thank God for Peter Jackson.  He alone has proved himself worthy of his source material.</p></div>",
  "content_text": "A Hitchhiker’s review, courtesy of the OC:\nThe Hitchhiker’s Guide to the Galaxy movie is bad. Really bad.\nYou just won’t believe how vastly, staggeringly, jaw-droppingly bad it is\n. I mean, you might think that The Phantom Menace was a hopelessly misguided attempt to reinvent a much-loved franchise by people who, though well-intentioned, completely failed to understand what made the original popular – but that’s just peanuts to the Hitchhiker’s movie. Listen.\nAnd so on…\nIt’s bad on a big scale because enormous swathes of the story have been dispensed with – most of the Guide entries, whole scenes – or changed beyond all recognition. And it is bad on a small scale because many, many wonderful lines have been cut or in some cases actually rewritten to make them less funny. Whatever your favourite line from Hitchhiker’s, there’s a good chance that it won’t be in the film. Even if it’s really well-known, widely-quoted, much-loved, very funny – it will probably be absent from the movie. Or if it is there, it might have been changed.\nI cannot even describe how deeply I loathe Hollywood.  The baseless arrogance of those cretinous idiots who think they can tell a story better than the master storytellers is just sickening.\nThank God for Peter Jackson.  He alone has proved himself worthy of his source material.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-04-21T09:25:00+00:00"
}