{
  "url": "https://voxday.net/2005/04/21/i-roomba/",
  "scraped_at": "2026-01-08T20:00:16.117933",
  "title": "I, Roomba",
  "date_display": "April 21, 2005",
  "date_iso": "2005-04-21T09:37:00+00:00",
  "date_from_url": "2005-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>So, we <a href=\" http://www.irobotstore.com\">got our first robot this week</a>.  If you think marriage was in trouble thanks to homosexual nuptuals, well, Western civilization hasn’t seen anything yet.  This fat, oversized frisbee does a better job of vaccuuming a room than I’d expected; if it isn’t necessarily up to female expectations of housecleanliness, well, neither am I.</p><p>A little bit of preparation goes a long way, and even if it has a tough time with the larger dust bunnies – which in all fairness should more rightly be designated mutant dust hares on steroids – as Space Bunny pointed out, the ease of letting Roomba do her little robot dance means that they’re less likely to build up in the first place.</p><p>Even if it didn’t work, the entertainment value is surprisingly high, especially if you factor in the inclusion of an increasingly alarmed 95-pound Ridgeback among the spectators.  But it does work, and I’m now eagerly anticipating the inevitable introduction of Moppa, a Roomba companion with soap-and-water functionality.</p><p>We actually have a household robot.  How cool is that!</p></div>",
  "content_text": "So, we\ngot our first robot this week\n.  If you think marriage was in trouble thanks to homosexual nuptuals, well, Western civilization hasn’t seen anything yet.  This fat, oversized frisbee does a better job of vaccuuming a room than I’d expected; if it isn’t necessarily up to female expectations of housecleanliness, well, neither am I.\nA little bit of preparation goes a long way, and even if it has a tough time with the larger dust bunnies – which in all fairness should more rightly be designated mutant dust hares on steroids – as Space Bunny pointed out, the ease of letting Roomba do her little robot dance means that they’re less likely to build up in the first place.\nEven if it didn’t work, the entertainment value is surprisingly high, especially if you factor in the inclusion of an increasingly alarmed 95-pound Ridgeback among the spectators.  But it does work, and I’m now eagerly anticipating the inevitable introduction of Moppa, a Roomba companion with soap-and-water functionality.\nWe actually have a household robot.  How cool is that!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-04-21T08:37:00+00:00"
}