{
  "url": "https://voxday.net/2005/04/21/mailvox-no-one-expects-marita/",
  "scraped_at": "2026-01-08T20:00:22.169050",
  "title": "Mailvox: no one expects the marital inquisition!",
  "date_display": "April 21, 2005",
  "date_iso": "2005-04-21T18:25:00+00:00",
  "date_from_url": "2005-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There’s been a lot of email like this today, thanks to the Lew Rockwell link.  Note to PR’s kids – don’t make a big deal about your parents’ 50th anniversary!</p><blockquote><p>Could I perhaps comment on your article ‘Stay Single Young Man’. Sadly I am not a young man and have been married for probably longer than you have been alive. However, your sentiments and message are something I emphatically support. I feel desperate for young men and want them so much not to make the same mistake as I did. Those I meet I try to warn but it is a uphill task. All I can do is to tell them and you that there is nothing in marriage for a man. You might ask why I did it. My answer is that it was not my idea. I was just maneuvered and coerced into what was expected without wanting it at all. Men are easily manipulated when they are in their twenties and suffering from being sexually charged.</p><p>Being married is like having your own private torturer. It is the death of your very self as you become no more than a wage earner put to the task of supporting a womans dreams. Of course the man always fails – forever condemned for being inadequate in only providing ninety percent of what is being demanded.</p></blockquote><p>I know that not all marriages turn out like this, but it is important for young men to understand that many do.  Also, the changes our society has undergone has greatly improved the chances that you will never be capable of providing the woman you marry with the happiness she believes is hers by right.</p><p>This quote which purports to be from a woman’s discussion forum may help demonstrate that your expectations and hers are unlikely to be in perfect alignment: <em>“My second husband and I were pregnant and happy. He has 3 children from a prior marriage, and all seemed peaceful. His ex wife, upon learning he was having a child with me engaged an attorney and upped the child support to the point where half of his income after taxes is being paid to her.</em></p><p>Now, instead of being able to stay home with my new daughter, I will have to go to work to support her. And if it ever goes bad in my marriage, I will receive very little support….  This is what I am thinking. Maybe just cash out now, sell the house at some point, and let him pay until the inheritance hits. In the meantime, I can remarry, after a little “playtime”.  I do feel like he promised me happiness and now it is all just sadness and I have to work.</p><p>Notice that he didn’t actually promise her happiness, but the mere feeling that he did is rationalization for a divorce.  This guy can certainly pick them, can’t he!  So, cheer up, PR, it quite obviously could be worse.</p></div>",
  "content_text": "There’s been a lot of email like this today, thanks to the Lew Rockwell link.  Note to PR’s kids – don’t make a big deal about your parents’ 50th anniversary!\nCould I perhaps comment on your article ‘Stay Single Young Man’. Sadly I am not a young man and have been married for probably longer than you have been alive. However, your sentiments and message are something I emphatically support. I feel desperate for young men and want them so much not to make the same mistake as I did. Those I meet I try to warn but it is a uphill task. All I can do is to tell them and you that there is nothing in marriage for a man. You might ask why I did it. My answer is that it was not my idea. I was just maneuvered and coerced into what was expected without wanting it at all. Men are easily manipulated when they are in their twenties and suffering from being sexually charged.\nBeing married is like having your own private torturer. It is the death of your very self as you become no more than a wage earner put to the task of supporting a womans dreams. Of course the man always fails – forever condemned for being inadequate in only providing ninety percent of what is being demanded.\nI know that not all marriages turn out like this, but it is important for young men to understand that many do.  Also, the changes our society has undergone has greatly improved the chances that you will never be capable of providing the woman you marry with the happiness she believes is hers by right.\nThis quote which purports to be from a woman’s discussion forum may help demonstrate that your expectations and hers are unlikely to be in perfect alignment:\n“My second husband and I were pregnant and happy. He has 3 children from a prior marriage, and all seemed peaceful. His ex wife, upon learning he was having a child with me engaged an attorney and upped the child support to the point where half of his income after taxes is being paid to her.\nNow, instead of being able to stay home with my new daughter, I will have to go to work to support her. And if it ever goes bad in my marriage, I will receive very little support….  This is what I am thinking. Maybe just cash out now, sell the house at some point, and let him pay until the inheritance hits. In the meantime, I can remarry, after a little “playtime”.  I do feel like he promised me happiness and now it is all just sadness and I have to work.\nNotice that he didn’t actually promise her happiness, but the mere feeling that he did is rationalization for a divorce.  This guy can certainly pick them, can’t he!  So, cheer up, PR, it quite obviously could be worse.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-04-21T17:25:00+00:00"
}