{
  "url": "https://voxday.net/2005/04/11/mailvox-never-trust-lawyer/",
  "scraped_at": "2026-01-08T19:58:50.995398",
  "title": "Mailvox: never trust a lawyer",
  "date_display": "April 11, 2005",
  "date_iso": "2005-04-11T12:18:00+00:00",
  "date_from_url": "2005-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>SB, Esquire, isn’t up on the games governments play:</p><blockquote><p>It appears you are at it again.  The last time I wrote you, which was a good while ago, you were adopting the fatally flawed arguments of tax protesters regarding the federal income tax.  Now, in your latest column, which is generally full of good points, I see this:</p><p>“the family “courts” (which are actually fraudulent executive-branch entities that operate in total violation of the constitutional law’s separation of powers)….”</p><p>What, exactly, does that mean?  For one thing, only state, not federal, courts handle issues of family law like divorce and child custody.  My own state of Georgia’s constitution has a provision that the executive, legislative and judicial powers are and shall forever remain separate and distinct.  Can you provide an example of a state where this practice is not followed?</p></blockquote><p>Lesson: never trust the so-called experts.  Despite the fact that I’ve never even glanced at George law, I’m sure that Georgia, like every other state in the Union and the federal government, completely ignores the separation of powers and uses administrative courts that look, act and feel like judicial courts, but are in fact nothing of the kind.</p><p>Give an example?  Sure.  The Minnesota Tax Court.  Or, for that matter, the Minnesota family courts.  Both of which are staffed by employees of the relevant state agency, not judges.  Need proof?  No problem.  “<em>271.01 Creation of tax court; jurisdiction. Subdivision 1. Membership, appointment, qualifications. There is hereby created a tax court as an independent agency of the executive branch of the government.</em>“</p><p>Furthermore, as the Minnesota Supreme Court stated in its appalling and convoluted decision, (WULFF v.TAX COURT OF APPEALS, 1979), justifying an overt violation of the separation of powers spelled out in its state constitution: “<em>[1] We must note at the outset that nomenclature is not determinative. The names of the various administrative agencies in the state change with regularity, and with respect to its constitutionality, whether the Tax Court is called a court, a board, an agency, or a commission seems to us less important than a critical analysis of its function in conjunction with an examination of the doctrine of separation of powers….As we stated earlier in this opinion, taxation is a peculiar function of the legislature. Solely because of this unique nature and the judicial checks present in this case, we are not disposed to render the Tax Court statute unconstitutional.</em>“</p><p>Dante, no doubt, would have those judges burning in one of the lower circles of Hell for that twisted abuse of power, language and reason.  The truth is that a law degree doesn’t mean that you know anything about the law.  In fact, it’s almost an assurance that you have no idea what is creeping about in its dark corners.</p><p>UPDATE – I’m wrong about the Georgia family courts.  “<em>No, our Georgia Superior Courts (which handle family law matters, among other things) are not in any sense of the word executive branch entities.  While we do have administrative law judges (or hearing officers) for some things, such as initial hearings of workers’ compensation cases, the Superior Courts are delineated in the state constitution as part of the judicial branch, and every county in the state has one.”</em> I am, however, correct about the Minnesota “courts” and the federal immigration “courts”.  No word on the Georgia tax courts, or if they even have such beasts.</p></div>",
  "content_text": "SB, Esquire, isn’t up on the games governments play:\nIt appears you are at it again.  The last time I wrote you, which was a good while ago, you were adopting the fatally flawed arguments of tax protesters regarding the federal income tax.  Now, in your latest column, which is generally full of good points, I see this:\n“the family “courts” (which are actually fraudulent executive-branch entities that operate in total violation of the constitutional law’s separation of powers)….”\nWhat, exactly, does that mean?  For one thing, only state, not federal, courts handle issues of family law like divorce and child custody.  My own state of Georgia’s constitution has a provision that the executive, legislative and judicial powers are and shall forever remain separate and distinct.  Can you provide an example of a state where this practice is not followed?\nLesson: never trust the so-called experts.  Despite the fact that I’ve never even glanced at George law, I’m sure that Georgia, like every other state in the Union and the federal government, completely ignores the separation of powers and uses administrative courts that look, act and feel like judicial courts, but are in fact nothing of the kind.\nGive an example?  Sure.  The Minnesota Tax Court.  Or, for that matter, the Minnesota family courts.  Both of which are staffed by employees of the relevant state agency, not judges.  Need proof?  No problem.  “\n271.01 Creation of tax court; jurisdiction. Subdivision 1. Membership, appointment, qualifications. There is hereby created a tax court as an independent agency of the executive branch of the government.\n“\nFurthermore, as the Minnesota Supreme Court stated in its appalling and convoluted decision, (WULFF v.TAX COURT OF APPEALS, 1979), justifying an overt violation of the separation of powers spelled out in its state constitution: “\n[1] We must note at the outset that nomenclature is not determinative. The names of the various administrative agencies in the state change with regularity, and with respect to its constitutionality, whether the Tax Court is called a court, a board, an agency, or a commission seems to us less important than a critical analysis of its function in conjunction with an examination of the doctrine of separation of powers….As we stated earlier in this opinion, taxation is a peculiar function of the legislature. Solely because of this unique nature and the judicial checks present in this case, we are not disposed to render the Tax Court statute unconstitutional.\n“\nDante, no doubt, would have those judges burning in one of the lower circles of Hell for that twisted abuse of power, language and reason.  The truth is that a law degree doesn’t mean that you know anything about the law.  In fact, it’s almost an assurance that you have no idea what is creeping about in its dark corners.\nUPDATE – I’m wrong about the Georgia family courts.  “\nNo, our Georgia Superior Courts (which handle family law matters, among other things) are not in any sense of the word executive branch entities.  While we do have administrative law judges (or hearing officers) for some things, such as initial hearings of workers’ compensation cases, the Superior Courts are delineated in the state constitution as part of the judicial branch, and every county in the state has one.”\nI am, however, correct about the Minnesota “courts” and the federal immigration “courts”.  No word on the Georgia tax courts, or if they even have such beasts.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-04-11T11:18:00+00:00"
}