{
  "url": "https://voxday.net/2005/04/13/myth-of-voting-and-other-nonsense/",
  "scraped_at": "2026-01-08T19:59:17.020213",
  "title": "The myth of voting and other nonsense",
  "date_display": "April 13, 2005",
  "date_iso": "2005-04-13T10:06:00+00:00",
  "date_from_url": "2005-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently Miss Orac managed to pull herself off the fainting couch long enough to stick her pretty little foot even further into her pretty little mouth.  Now she’s insisting that I’m not a member of the Taliban – no, really – but that I’m a Taliban wannabee.</p><p>Right.  I so want to grow a beard and figure out where Mecca is.  And if only I could convert my club’s field into an execution grounds, how happy I would be!</p><p>Orac is so caught up in his outrage over my anti-suffrage position that he hasn’t stopped to consider that there is no connection whatsoever between voting and liberty.  None.  By his reckoning, George Washington and Thomas Jefferson were also Taliban wannabees.  I’m not just talking about the obvious fact that women were permitted to vote in Zimbabwe, the Soviet Union and Saddam Hussein’s Iraq either, but the fact that many adults are not permitted to vote in the freest countries in the world.</p><p>For you see, a resident alien is not permitted to vote in almost any Western country.  Switzerland is rightly considered more free than the United States by the Heritage Foundation, and yet 17 percent of its population are non-citizen permanent residents.  These are people who have gone to great effort and expense – it is very difficult to get residence there – and are pleased to trade their right to vote for greater individual and economic liberty.</p><p>Being a typically parochial American focused on the superficiality of rights rather than their substance, this means of examining the matter would not appear to have occurred to Orac or those of his mindset.</p><p>There are three possible results of women’s suffrage:</p><p>(1)  The women’s vote has improved the nation by enhancing liberty.<br>(2)  The women’s vote has harmed the nation by degrading liberty.<br>(3)  The women’s vote has not effected the nation for better or for worse.</br></br></p><p>If you believe (1), then of course you think I’m an evil lunatic.  Feel free to try making that case and I’ll happily consider it.  If you believe (3), then you have no reason to care if women are permitted to vote or not since it has made no difference.  But, if you examine the historical evidence, you are very likely to conclude (2), in which case a failure to share my anti-suffrage position is either intellectual cowardice or the aforementioned preference for superficiality over substance.</p><p>As for the other inaccuracies scattered about in the comments, my column runs all day on WND and frequently for a second day, I have never, ever complained about Universal Press Syndicate – this is actually the SECOND time they’ve dropped a column of mine, by the way – my father has not been on the board of WND for years and far from being a criminal, was recently offered a massive settlement by the state, (which has already admitted that he never owed them any money), in a desperate and unsuccessful attempt to avoid the jury trial he has been seeking for four years.</p><p>Men certainly have many flaws, but they also have no shortage of writers willing, even eager, to point them out.  I simply happen to be one of the only male columnists who isn’t afraid to provide a rational counterpoint to the many, many female writers who make a living off their irrational misandry.</p><p>As for my “whining and bitching about other conservative columnists”, I seldom criticize the genuine conservatives.  Can anyone recall the last time I went after Ann Coulter, Pat Buchanan, Dinesh D’Souza, Ramesh Ponnuru or even George Will?  I respect them, even when I disagree with them.  It’s the strong government neosocialists who fraudulently pass themselves off as conservatives that will often be found in the crosshairs of my keyboard.</p><p>UPDATE – Pharyngurl and a few others are equally weak kneed over this.  Someone get the smelling salts!  The prize, however, has to go to Burningbird, who <a href=\"http://weblog.burningbird.net/archives/2005/04/12/dont-get-distracted-by-the-shiny-cross/\">produced this gem of cluelessness</a>:</p><p><em>Leaving aside such breathless leaps of inference, again if we look at history, we’ll see that women have campaigned vigorously against slavery, for free schools and libraries, accessible medical care, and for the rights of workers. In fact, women were some of the most vocal anti-slavery campaigners, and the earliest union members. So if we are extrapolating from women’s activism to a specific political and financial system, women have historically favored a more *socialistic form of government and society.</em></p><p>In other words, generally more freedom (if you leave out that little war on the American front), less freedom, more government ownership of resources, less freedom, and less freedom.  She then relies on Wikipedia to claim that fascism isn’t socialism, which completely ignores both the historical Fascist program as well as the lifelong socialism of Giovanni Gentile and Benito Mussolini.  In fact, Mussolini received his title of <em>Il Duce</em> as a leader of the Italian Socialists long before he founded the Fascist Party and the only reason he abandoned his positions as the editor of Avanti! and a member of the National Executive Committee of the Socialist Party was his change of opinion on the issue of Italian participation in World War I.</p><p><a href=\"http://www.la-articles.org.uk/fascism.htm\">Five Facts about Fascism</a>:</p><p>“1.  Fascism was a doctrine well elaborated years before it was named.</p><p>As an intellectual edifice, Fascism was mostly in place by about 1910. Historically, the taproot of Fascism lies in the 1890s–in the “Crisis of Marxism” and in the interaction of nineteenth-century revolutionary socialism with fin de siècle anti-rationalism and anti-liberalism.</p><p>2.  Fascism changed dramatically between 1919 and 1922, and again changed dramatically after 1922.</p><p>Many of the older treatments of Fascism are misleading because they cobble together Fascist pronouncements, almost entirely from after 1922, reflecting the pressures on a broad and flexible political movement solidifying its rule by compromises, and suppose that by this method they can isolate the character and motivation of Fascist ideology. It is as if we were to reconstruct the ideas of Bolshevism by collecting the pronouncements of the Soviet government in 1943, which would lead us to conclude that Marxism owed a lot to Ivan the Terrible and Peter the Great.</p><p>3.  Fascism was a movement with its roots primarily in the left.</p><p>Its leaders and initiators were secular-minded, highly progressive intellectuals, hard-headed haters of existing society and especially of its most bourgeois aspects.</p><p>4.  Fascism was intellectually sophisticated.</p><p>Here we should note a difference between Marxism and Fascism. The leader of a Marxist political movement is always considered by his followers to be a master of theory and a theoretical innovator on the scale of Copernicus. Fascists were less prone to any such delusion. Mussolini was more widely-read than Lenin and a better writer, but Fascist intellectuals did not consider him a major contributor to the body of Fascist theory, more a leader of genius who could distil theory into action.</p><p>5.  Fascists were radical modernizers.</p><p>By temperament they were neither conservative nor reactionary. Fascists despised the status quo and were not attracted by a return to bygone conditions.”</p><p>In other words, Burningbird, the only reason you suffered whiplash is because you don’t know anything about European history or the political ideology of the Left.  Arguing that Fascism is not closely akin to Socialism is as absurd as attempting to assert that there is no relationship between Bolshevism and Menshevism.  The only serious difference between Socialism and National Socialism is, obviously, the nationalist element.  Stalin’s brand of communism was equally nationalistic – in opposition to Trotsky’s loyalty to the concept of world revolution – but few ar<br> e silly enough to argue that Stalin’s “National Communism” was the polar opposite of the Marxist-Leninism from which it sprang.  But, as David Ramsey Steele explains, 70 years of indoctrination by socialist academics eager to wash the blame for National Socialism off the Left’s hands leads the historically ignorant to this confusion.</br></p><p>The reason that a little knowledge – courtesy of Google or Wikipedia – can be more dangerous than none is that barely informed individuals such as Burningbird actually believe they know what they’re talking about.  They don’t.</p></div>",
  "content_text": "Apparently Miss Orac managed to pull herself off the fainting couch long enough to stick her pretty little foot even further into her pretty little mouth.  Now she’s insisting that I’m not a member of the Taliban – no, really – but that I’m a Taliban wannabee.\nRight.  I so want to grow a beard and figure out where Mecca is.  And if only I could convert my club’s field into an execution grounds, how happy I would be!\nOrac is so caught up in his outrage over my anti-suffrage position that he hasn’t stopped to consider that there is no connection whatsoever between voting and liberty.  None.  By his reckoning, George Washington and Thomas Jefferson were also Taliban wannabees.  I’m not just talking about the obvious fact that women were permitted to vote in Zimbabwe, the Soviet Union and Saddam Hussein’s Iraq either, but the fact that many adults are not permitted to vote in the freest countries in the world.\nFor you see, a resident alien is not permitted to vote in almost any Western country.  Switzerland is rightly considered more free than the United States by the Heritage Foundation, and yet 17 percent of its population are non-citizen permanent residents.  These are people who have gone to great effort and expense – it is very difficult to get residence there – and are pleased to trade their right to vote for greater individual and economic liberty.\nBeing a typically parochial American focused on the superficiality of rights rather than their substance, this means of examining the matter would not appear to have occurred to Orac or those of his mindset.\nThere are three possible results of women’s suffrage:\n(1)  The women’s vote has improved the nation by enhancing liberty.\n(2)  The women’s vote has harmed the nation by degrading liberty.\n(3)  The women’s vote has not effected the nation for better or for worse.\nIf you believe (1), then of course you think I’m an evil lunatic.  Feel free to try making that case and I’ll happily consider it.  If you believe (3), then you have no reason to care if women are permitted to vote or not since it has made no difference.  But, if you examine the historical evidence, you are very likely to conclude (2), in which case a failure to share my anti-suffrage position is either intellectual cowardice or the aforementioned preference for superficiality over substance.\nAs for the other inaccuracies scattered about in the comments, my column runs all day on WND and frequently for a second day, I have never, ever complained about Universal Press Syndicate – this is actually the SECOND time they’ve dropped a column of mine, by the way – my father has not been on the board of WND for years and far from being a criminal, was recently offered a massive settlement by the state, (which has already admitted that he never owed them any money), in a desperate and unsuccessful attempt to avoid the jury trial he has been seeking for four years.\nMen certainly have many flaws, but they also have no shortage of writers willing, even eager, to point them out.  I simply happen to be one of the only male columnists who isn’t afraid to provide a rational counterpoint to the many, many female writers who make a living off their irrational misandry.\nAs for my “whining and bitching about other conservative columnists”, I seldom criticize the genuine conservatives.  Can anyone recall the last time I went after Ann Coulter, Pat Buchanan, Dinesh D’Souza, Ramesh Ponnuru or even George Will?  I respect them, even when I disagree with them.  It’s the strong government neosocialists who fraudulently pass themselves off as conservatives that will often be found in the crosshairs of my keyboard.\nUPDATE – Pharyngurl and a few others are equally weak kneed over this.  Someone get the smelling salts!  The prize, however, has to go to Burningbird, who\nproduced this gem of cluelessness\n:\nLeaving aside such breathless leaps of inference, again if we look at history, we’ll see that women have campaigned vigorously against slavery, for free schools and libraries, accessible medical care, and for the rights of workers. In fact, women were some of the most vocal anti-slavery campaigners, and the earliest union members. So if we are extrapolating from women’s activism to a specific political and financial system, women have historically favored a more *socialistic form of government and society.\nIn other words, generally more freedom (if you leave out that little war on the American front), less freedom, more government ownership of resources, less freedom, and less freedom.  She then relies on Wikipedia to claim that fascism isn’t socialism, which completely ignores both the historical Fascist program as well as the lifelong socialism of Giovanni Gentile and Benito Mussolini.  In fact, Mussolini received his title of\nIl Duce\nas a leader of the Italian Socialists long before he founded the Fascist Party and the only reason he abandoned his positions as the editor of Avanti! and a member of the National Executive Committee of the Socialist Party was his change of opinion on the issue of Italian participation in World War I.\nFive Facts about Fascism\n:\n“1.  Fascism was a doctrine well elaborated years before it was named.\nAs an intellectual edifice, Fascism was mostly in place by about 1910. Historically, the taproot of Fascism lies in the 1890s–in the “Crisis of Marxism” and in the interaction of nineteenth-century revolutionary socialism with fin de siècle anti-rationalism and anti-liberalism.\n2.  Fascism changed dramatically between 1919 and 1922, and again changed dramatically after 1922.\nMany of the older treatments of Fascism are misleading because they cobble together Fascist pronouncements, almost entirely from after 1922, reflecting the pressures on a broad and flexible political movement solidifying its rule by compromises, and suppose that by this method they can isolate the character and motivation of Fascist ideology. It is as if we were to reconstruct the ideas of Bolshevism by collecting the pronouncements of the Soviet government in 1943, which would lead us to conclude that Marxism owed a lot to Ivan the Terrible and Peter the Great.\n3.  Fascism was a movement with its roots primarily in the left.\nIts leaders and initiators were secular-minded, highly progressive intellectuals, hard-headed haters of existing society and especially of its most bourgeois aspects.\n4.  Fascism was intellectually sophisticated.\nHere we should note a difference between Marxism and Fascism. The leader of a Marxist political movement is always considered by his followers to be a master of theory and a theoretical innovator on the scale of Copernicus. Fascists were less prone to any such delusion. Mussolini was more widely-read than Lenin and a better writer, but Fascist intellectuals did not consider him a major contributor to the body of Fascist theory, more a leader of genius who could distil theory into action.\n5.  Fascists were radical modernizers.\nBy temperament they were neither conservative nor reactionary. Fascists despised the status quo and were not attracted by a return to bygone conditions.”\nIn other words, Burningbird, the only reason you suffered whiplash is because you don’t know anything about European history or the political ideology of the Left.  Arguing that Fascism is not closely akin to Socialism is as absurd as attempting to assert that there is no relationship between Bolshevism and Menshevism.  The only serious difference between Socialism and National Socialism is, obviously, the nationalist element.  Stalin’s brand of communism was equally nationalistic – in opposition to Trotsky’s loyalty to the concept of world revolution – but few ar\ne silly enough to argue that Stalin’s “National Communism” was the polar opposite of the Marxist-Leninism from which it sprang.  But, as David Ramsey Steele explains, 70 years of indoctrination by socialist academics eager to wash the blame for National Socialism off the Left’s hands leads the historically ignorant to this confusion.\nThe reason that a little knowledge – courtesy of Google or Wikipedia – can be more dangerous than none is that barely informed individuals such as Burningbird actually believe they know what they’re talking about.  They don’t.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-04-13T09:06:00+00:00"
}