{
  "url": "https://voxday.net/2005/04/30/next-weeks-blog-star/",
  "scraped_at": "2026-01-08T20:01:35.684395",
  "title": "Next week’s blog star",
  "date_display": "April 30, 2005",
  "date_iso": "2005-04-30T04:49:00+00:00",
  "date_from_url": "2005-04-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Crystal Lake Observatory is next week’s guest blogger of the week.  Please note that I have decided to kick the limit up to 1,000 words, so have them into me by Friday, May 6.</p><p>By the way, I was surprised at how few people managed to follow the directions on volunteering this week.  If you’re interested in blog starring next week, please recall that you need to be one of the Voxologisti from the blog roll down and to the right.  Also, you need to submit the name of your blog, as I don’t keep track of what belongs to who.</p><p>If you’re not a regular reader and you’ve got something to say, however critical, just email me.  Blog starring is for the regulars, both fans and critics, although a survey of the archives should demonstrate that I’m happy to post detailed point-counterpoints on those rare occasions when a critic can manage to actually scrabble together some semblance of an argument instead of drawing randomly from the usual grab-bag of wild-eyed assertions that I am <a href=\"http://www.pandagon.net/archives/2005/04/overview_of_the.html\">a Mega Stupid Poopyhead</a> who is scared of Strong Independent Women and can’t get chicks even though my Daddy is rich because I use a pen name designed to hide my secret gayness and bitter envy of Robert Jordan, Liam Howlett and Michelle Malkin.  Or something.</p></div>",
  "content_text": "The Crystal Lake Observatory is next week’s guest blogger of the week.  Please note that I have decided to kick the limit up to 1,000 words, so have them into me by Friday, May 6.\nBy the way, I was surprised at how few people managed to follow the directions on volunteering this week.  If you’re interested in blog starring next week, please recall that you need to be one of the Voxologisti from the blog roll down and to the right.  Also, you need to submit the name of your blog, as I don’t keep track of what belongs to who.\nIf you’re not a regular reader and you’ve got something to say, however critical, just email me.  Blog starring is for the regulars, both fans and critics, although a survey of the archives should demonstrate that I’m happy to post detailed point-counterpoints on those rare occasions when a critic can manage to actually scrabble together some semblance of an argument instead of drawing randomly from the usual grab-bag of wild-eyed assertions that I am\na Mega Stupid Poopyhead\nwho is scared of Strong Independent Women and can’t get chicks even though my Daddy is rich because I use a pen name designed to hide my secret gayness and bitter envy of Robert Jordan, Liam Howlett and Michelle Malkin.  Or something.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-04-30T03:49:00+00:00"
}