{
  "url": "https://voxday.net/2005/04/13/pull-your-head-out-of-pop-psychology/",
  "scraped_at": "2026-01-08T19:59:24.419224",
  "title": "Pull your head out of the pop psychology, please",
  "date_display": "April 13, 2005",
  "date_iso": "2005-04-13T22:34:00+00:00",
  "date_from_url": "2005-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>OR shares some misplaced sympathy:</p><blockquote><p>I’ve quickly perused your website after hearing part of your interview on NARN this weekend.  You get a pass from me because it sounds like you had a nasty divorce and are (rightly) bitter.  Hopefully you don’t let the bitterness take over.  There is light at the end of the tunnel–I know.  I was married to a lawyer(!) who screwed our nanny and then screwed me and my kids at every turn in the divorce proceedings.</p><p>It is not always the woman who is the bad one, although there are more bad women out there than I’d like to admit.  I hope you’ll learn to not care as much about protecting your “stuff” and worry more about building real relationships with a good<br>woman.  Keep saying to yourself “This too shall pass.”</br></p></blockquote><p>When did everything become personal in America?  Are there no ideas which are not deeply rooted in one’s psyche anymore?  You know it’s bad when even the sympathetic readers are so hopelessly off-base.</p><p>I’m not bitter.  I don’t hate women and I have no reason to do so.  I’ve been very happily married to a very nice, very pretty woman for a long time.  Since I do not limit myself to considering only those topics which are approved for public discussion, you can expect to occasionally encounter concepts that you find a priori outrageous.  If you can manage to control your knee-jerk reaction, you will usually find that even if I turn out to have gone off the proverbial deep end, there is a logical case to be found down there somewhere.</p><p>America did not get from point A to point B by random walk, and it is massively unreasonable to assert that suffragism has had no effect whatsoever on American history.  Now, as I am famously skeptical about the future of this country, it should come as no surprise that I believe the female franchise has been one of the various negative factors in the significant reduction of American liberties in the last century.  If you think America is headed in the right direction and is getting better every day, no doubt you will disagree.</p><p>The reality is that the pallid, strictly limited form of democracy practiced in America is a placebo.  The ease with which the electorate can be manipulated is so great that I am sure we would be better off with the pure democracy that technology now makes possible.  And yet, how many of these frothing-at-the-mouth voting rights absolutists are willing to support such an expansion of democracy here in America?  Very, very few, I suspect.</p></div>",
  "content_text": "OR shares some misplaced sympathy:\nI’ve quickly perused your website after hearing part of your interview on NARN this weekend.  You get a pass from me because it sounds like you had a nasty divorce and are (rightly) bitter.  Hopefully you don’t let the bitterness take over.  There is light at the end of the tunnel–I know.  I was married to a lawyer(!) who screwed our nanny and then screwed me and my kids at every turn in the divorce proceedings.\nIt is not always the woman who is the bad one, although there are more bad women out there than I’d like to admit.  I hope you’ll learn to not care as much about protecting your “stuff” and worry more about building real relationships with a good\nwoman.  Keep saying to yourself “This too shall pass.”\nWhen did everything become personal in America?  Are there no ideas which are not deeply rooted in one’s psyche anymore?  You know it’s bad when even the sympathetic readers are so hopelessly off-base.\nI’m not bitter.  I don’t hate women and I have no reason to do so.  I’ve been very happily married to a very nice, very pretty woman for a long time.  Since I do not limit myself to considering only those topics which are approved for public discussion, you can expect to occasionally encounter concepts that you find a priori outrageous.  If you can manage to control your knee-jerk reaction, you will usually find that even if I turn out to have gone off the proverbial deep end, there is a logical case to be found down there somewhere.\nAmerica did not get from point A to point B by random walk, and it is massively unreasonable to assert that suffragism has had no effect whatsoever on American history.  Now, as I am famously skeptical about the future of this country, it should come as no surprise that I believe the female franchise has been one of the various negative factors in the significant reduction of American liberties in the last century.  If you think America is headed in the right direction and is getting better every day, no doubt you will disagree.\nThe reality is that the pallid, strictly limited form of democracy practiced in America is a placebo.  The ease with which the electorate can be manipulated is so great that I am sure we would be better off with the pure democracy that technology now makes possible.  And yet, how many of these frothing-at-the-mouth voting rights absolutists are willing to support such an expansion of democracy here in America?  Very, very few, I suspect.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-04-13T21:34:00+00:00"
}