{
  "url": "https://voxday.net/2005/04/11/umberto-eco-on-jules-verne/",
  "scraped_at": "2026-01-08T19:58:56.536733",
  "title": "Umberto Eco on Jules Verne",
  "date_display": "April 11, 2005",
  "date_iso": "2005-04-11T13:46:00+00:00",
  "date_from_url": "2005-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Umberto Eco <a href=\"http://www.espressonline.it/eol/free/jsp/detail.jsp?m1s=o&amp;m2s=null&amp;idCategory=4789&amp;idContent=894551\">writes of the great science-fiction author</a> on the centenary of his death in an article that was published on 11 April, 2005, in L’Espresso:</p><blockquote><p> VOYAGE TO THE CENTER OF JULES VERNE</p><p>When<br> we were boys, we were divided into two groups: those that held to<br> Salgari [Italian author Emilio Salgari] and those that held to Verne.  I<br> quickly confess that at that time I held for Salgari, and now History<br> compels me to revisit my opinions of that time.  Salgari, retold, cited<br> from memory, loved for all the colors it gave one’s infancy, no longer<br> seduces new generations or – to tell the truth  –  the elders either.<br> When they reread him in search of a little ironic nostalgia, the reading<br> simply makes them tired, and too many of those mangroves and wild pigs<br> come to be an annoyance.</br></br></br></br></br></br></br></br></br></p><p>Instead, in 2005 we are celebrating the<br> centenary of the death of Jules Verne, and not only in France are there<br> daily and weekly conventions dedicated to him, searching to demonstrate<br> the many ways that his fantasies anticipated reality.  A look at the<br> editorial catalogs in our country suggest to me that Verne was<br> republished far more often than Salgari, to say nothing of France, where<br> there exists an absolute industry of Vernian antiquities. The old<br> hardbound Hetzel editions are certainly very beautiful.  (In Paris, on<br> the Left Bank alone, there are at least two stores possessing these<br> splended volumes laid out in red and gold, offered at a prohibitive<br> price.)</br></br></br></br></br></br></br></br></br></br></p><p>For all the merits that our Salgari must be remembered,<br> the father of Sandokan did not have a great sense of humor, (not unlike<br> the rest of his characters, with the exception of Yanez), while the<br> romances of Verne were full of humor.  It is enough to remember those<br> splendid pages of “Michele Strogoff” where, after the battle of Kolyvan,<br> the reporter from the Daily Telegraph, Harry Blount, goes to the<br> telegraph office and spends thousands of rubles transmitting verses of<br> the Bible* to his corrispondent in Paris in order to impede his rival,<br> Alcide Jolivet.  But Jolivet succeeds in robbing Blount of his position<br> at the telegraph and blocks him in turn by transmitting the little songs<br> of [François] Béranger.</br></br></br></br></br></br></br></br></br></br></p><p>“Hallo!” said Harry Blount.<br>“Just so,” answered Jolivet.”</br></p><p>And tell me if this is not style!</p><p>Another<br> reason for this fascination is that many futuristic stories, read at a<br> temporal distance when that future is already known, leaves the reader a<br> little disappointed, because the things that truly happened, the<br> inventions that were actually realized, are more marvelous than those<br> imagined by the books of the previous era.  With Verne this is not so,<br> no atomic submarine will be more technologically wonderful than the<br> Nautilus and no dirigible or jumbo jet will ever be as fascinating as<br> the majestic helix ship of Robur the Conquistador….</br></br></br></br></br></br></br></br></p><p>And if we<br> do not have the money to buy the old Hetzel editions from antique<br> bookstores and we are not satisfied with the contemporary re-editions?<br> You can go on the Internet, to the address <a href=\"http://jv.gilead.org.il/\">http://jv.gilead.org.il/</a>.<br> There a gentleman by the name of Zvi Har’El, a collector of all the<br> news of Verne, has a list of the worldwide celebrations, a complete<br> bibliography, an anthology of sayings, 304 incredible stamps dedicated<br> to Verne from various countries, translations in Hebrew, and most of<br> all, a virtual library where you can find integral texts of Verne in<br> various languages and see the original French editions as well all of<br> the engravings to save and afterwards enlarge as you like because,<br> sometimes, we are even more captivated the second time.</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>One<br> of the most decent things about writers, a famously indecent lot, is<br> that they are one of the few disciplines who trouble to remember those<br> who went before.</br></br></br></p><p><em>*Eco makes an uncharacteristic mistake here,<br> as “the verses learned in his childhood” do not refer to the Bible, but<br> rather “the well-known verses of Cowper”, which is to say, William<br> Cowper, the English poet.</br></br></br></em></p></div>",
  "content_text": "Umberto Eco\nwrites of the great science-fiction author\non the centenary of his death in an article that was published on 11 April, 2005, in L’Espresso:\nVOYAGE TO THE CENTER OF JULES VERNE\nWhen\nwe were boys, we were divided into two groups: those that held to\nSalgari [Italian author Emilio Salgari] and those that held to Verne.  I\nquickly confess that at that time I held for Salgari, and now History\ncompels me to revisit my opinions of that time.  Salgari, retold, cited\nfrom memory, loved for all the colors it gave one’s infancy, no longer\nseduces new generations or – to tell the truth  –  the elders either.\nWhen they reread him in search of a little ironic nostalgia, the reading\nsimply makes them tired, and too many of those mangroves and wild pigs\ncome to be an annoyance.\nInstead, in 2005 we are celebrating the\ncentenary of the death of Jules Verne, and not only in France are there\ndaily and weekly conventions dedicated to him, searching to demonstrate\nthe many ways that his fantasies anticipated reality.  A look at the\neditorial catalogs in our country suggest to me that Verne was\nrepublished far more often than Salgari, to say nothing of France, where\nthere exists an absolute industry of Vernian antiquities. The old\nhardbound Hetzel editions are certainly very beautiful.  (In Paris, on\nthe Left Bank alone, there are at least two stores possessing these\nsplended volumes laid out in red and gold, offered at a prohibitive\nprice.)\nFor all the merits that our Salgari must be remembered,\nthe father of Sandokan did not have a great sense of humor, (not unlike\nthe rest of his characters, with the exception of Yanez), while the\nromances of Verne were full of humor.  It is enough to remember those\nsplendid pages of “Michele Strogoff” where, after the battle of Kolyvan,\nthe reporter from the Daily Telegraph, Harry Blount, goes to the\ntelegraph office and spends thousands of rubles transmitting verses of\nthe Bible* to his corrispondent in Paris in order to impede his rival,\nAlcide Jolivet.  But Jolivet succeeds in robbing Blount of his position\nat the telegraph and blocks him in turn by transmitting the little songs\nof [François] Béranger.\n“Hallo!” said Harry Blount.\n“Just so,” answered Jolivet.”\nAnd tell me if this is not style!\nAnother\nreason for this fascination is that many futuristic stories, read at a\ntemporal distance when that future is already known, leaves the reader a\nlittle disappointed, because the things that truly happened, the\ninventions that were actually realized, are more marvelous than those\nimagined by the books of the previous era.  With Verne this is not so,\nno atomic submarine will be more technologically wonderful than the\nNautilus and no dirigible or jumbo jet will ever be as fascinating as\nthe majestic helix ship of Robur the Conquistador….\nAnd if we\ndo not have the money to buy the old Hetzel editions from antique\nbookstores and we are not satisfied with the contemporary re-editions?\nYou can go on the Internet, to the address\nhttp://jv.gilead.org.il/\n.\nThere a gentleman by the name of Zvi Har’El, a collector of all the\nnews of Verne, has a list of the worldwide celebrations, a complete\nbibliography, an anthology of sayings, 304 incredible stamps dedicated\nto Verne from various countries, translations in Hebrew, and most of\nall, a virtual library where you can find integral texts of Verne in\nvarious languages and see the original French editions as well all of\nthe engravings to save and afterwards enlarge as you like because,\nsometimes, we are even more captivated the second time.\nOne\nof the most decent things about writers, a famously indecent lot, is\nthat they are one of the few disciplines who trouble to remember those\nwho went before.\n*Eco makes an uncharacteristic mistake here,\nas “the verses learned in his childhood” do not refer to the Bible, but\nrather “the well-known verses of Cowper”, which is to say, William\nCowper, the English poet.",
  "tags": [
    "books",
    "Eco"
  ],
  "categories": [],
  "sitemap_lastmod": "2005-04-11T12:46:00+00:00"
}