{
  "url": "https://voxday.net/2005/04/24/we-are-all-homeschoolers-now/",
  "scraped_at": "2026-01-08T20:00:45.645646",
  "title": "We are all homeschoolers now",
  "date_display": "April 24, 2005",
  "date_iso": "2005-04-24T16:30:00+00:00",
  "date_from_url": "2005-04-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From <a href=\"http://216.239.59.104/search?q=cache:7HZK6vW4SE4J:www.ed.gov/rschstat/research/pubs/misconductreview/report.pdf+educator+sexual+misconduct&amp;hl=en&amp;start=1\">the US Dept. of Education</a>, brought to my attention by TZ:</p><blockquote><p>Responses from students who indicated they had experienced one of the listed behaviors were analyzed using descriptive statistics and frequencies. This analysis (Shakeshaft, 2003) indicates that 9.6 percent of all students in grades 8 to 11 report contact and/or noncontact educator sexual misconduct that was unwanted. 8.7 percent report only noncontact sexual misconduct and 6.7 percent experienced only contact misconduct….  Of students who experienced any kind of sexual misconduct in schools, 21 percent were targets of educators, while the remaining 79 percent were targets of other students.</p></blockquote><p>So, think for a moment about how much unwanted ass-grabbing and whatnot was going on around you at your high school.  Now figure a quarter of that was also happening a little less publicly thanks to the teachers, principals and coaches around you.  Strangely, male students are nearly as likely to be targeted as female students, although male educators do most of the abusing.  This proclivity of public school teachers for homosexual abuse is supported by the fact that 4 of the 22 school employees <a href=\"http://www.detnews.com/2005/specialreport/0504/24/A12-159841.htm\"> exposed in a recent Detroit article</a> were men attacking boys.</p><p>Another interesting tidbit is the fact that the younger the abused child is, the more likely the abuser is to be an award-winning teacher considered to be one of the best ones in the school.  This shouldn’t be that surprising, as it’s only logical to expect pedophiles to go where the kids are.  I’ve always had a certain skepticism about any man who voluntarily spends a inordinate amount of time with children; most dads consider four straight hours with their own kids to be an overdose.  Especially all those youth pastors with mustaches….</p><p>I coach little kids soccer myself, so one could argue that I belong on the sketchy list too, but in my defense, I don’t even pretend to be interested in the kids.  They are simply my little pawns on the big green chess board… I teach them the skills and tactics they need to succeed on the field, nothing more.  The parents appeared to be stunned at the first big tournament I coached, when we had a break for 90 minutes and I simply told them where to bring the kids for the next game, then walked away for the duration.  Hey, they were all right there and I’m a coach, not a babysitter.</p><p>I’m pretty sure they would have demanded my dismissal by the club had we not shocked everyone by winning the tournament, in the finals beating a team that had stomped us 14-0 only three months before.  You want the Phil Jackson of kiddy soccer, you’re going to put up with some idiosyncracies.  Minus, of course, the mustache.</p><p>Finally, I should note that 6 of the 14 teachers convicted in that Detroit report are still certified to teach in the Detroit public schools.  Socialization is important, after all!</p></div>",
  "content_text": "From\nthe US Dept. of Education\n, brought to my attention by TZ:\nResponses from students who indicated they had experienced one of the listed behaviors were analyzed using descriptive statistics and frequencies. This analysis (Shakeshaft, 2003) indicates that 9.6 percent of all students in grades 8 to 11 report contact and/or noncontact educator sexual misconduct that was unwanted. 8.7 percent report only noncontact sexual misconduct and 6.7 percent experienced only contact misconduct….  Of students who experienced any kind of sexual misconduct in schools, 21 percent were targets of educators, while the remaining 79 percent were targets of other students.\nSo, think for a moment about how much unwanted ass-grabbing and whatnot was going on around you at your high school.  Now figure a quarter of that was also happening a little less publicly thanks to the teachers, principals and coaches around you.  Strangely, male students are nearly as likely to be targeted as female students, although male educators do most of the abusing.  This proclivity of public school teachers for homosexual abuse is supported by the fact that 4 of the 22 school employees\nexposed in a recent Detroit article\nwere men attacking boys.\nAnother interesting tidbit is the fact that the younger the abused child is, the more likely the abuser is to be an award-winning teacher considered to be one of the best ones in the school.  This shouldn’t be that surprising, as it’s only logical to expect pedophiles to go where the kids are.  I’ve always had a certain skepticism about any man who voluntarily spends a inordinate amount of time with children; most dads consider four straight hours with their own kids to be an overdose.  Especially all those youth pastors with mustaches….\nI coach little kids soccer myself, so one could argue that I belong on the sketchy list too, but in my defense, I don’t even pretend to be interested in the kids.  They are simply my little pawns on the big green chess board… I teach them the skills and tactics they need to succeed on the field, nothing more.  The parents appeared to be stunned at the first big tournament I coached, when we had a break for 90 minutes and I simply told them where to bring the kids for the next game, then walked away for the duration.  Hey, they were all right there and I’m a coach, not a babysitter.\nI’m pretty sure they would have demanded my dismissal by the club had we not shocked everyone by winning the tournament, in the finals beating a team that had stomped us 14-0 only three months before.  You want the Phil Jackson of kiddy soccer, you’re going to put up with some idiosyncracies.  Minus, of course, the mustache.\nFinally, I should note that 6 of the 14 teachers convicted in that Detroit report are still certified to teach in the Detroit public schools.  Socialization is important, after all!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2005-04-24T15:30:00+00:00"
}