{
  "url": "https://voxday.net/2021/02/24/armed-and-unprepared/",
  "scraped_at": "2025-12-21T22:38:55.421912",
  "title": "Armed and unprepared",
  "date_display": "February 24, 2021",
  "date_iso": "2021-02-24T17:38:14+00:00",
  "date_from_url": "2021-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> I don’t agree at all with <a href=\"https://amgreatness.com/2021/02/23/the-last-stop-before-thermopylae/\" rel=\"noopener\" target=\"_blank\">this American Greatness article</a>. The recent election demonstrated, beyond any shadow of a doubt, that democracy is dead and there is no political exit. It strikes me as yet another conservative finger-wagging “this is your LAST chance to vote your way to safety”. But the voting machines have been compromised, ergo no one’s votes matter in the slightest. There is no more Democrat vs Republican, there is only <i>optimate </i>vs <i>populare</i>.</p><blockquote><p>Many traditional Americans are sleepwalking into a conflict they are not mentally prepared to handle. The ideals of blind justice and due process are now, for all intents and purposes, quaint relics, and relying on constitutional rights for protection is dangerously naïve. </p><p>Like it or not, we live in a police state, controlled by an increasingly authoritarian regime with near-total electronic surveillance. The national security apparatus views conservatives and free-thinkers as domestic terrorists, and there are now more military deployed in our nation’s capital than in war zones overseas. If America were any other country, it would be considered a non-permissive environment—not a free country.</p><p>The pundit class recommends midterm elections and unifying the GOP as remedies, but they ignore the real elephant in the room—representative government is not representing us. While conservative and independent voices are censored and banned from the community square, their elected representatives cower behind their desks and make sweetheart deals with the new regime. </p><p>We are facing a new post-justice, post-truth society. We won’t be able to debate our way out of it, vote our way out of it, or tweet our way out of it. No one is coming to save us. If traditional America wants to be free, it will have to stop living in the past, get up off the couch, and take action.</p></blockquote><p>The good news is that there is nothing particularly difficult about the present situation. The only difference between the two parties described in the article and the two parties of Roman history is that in the USA, the <i>optimates </i>are mostly foreigners. Indeed, it is the situation in which the overwhelming majority of humanity found itself for the greater part of human history. The <i>populares </i>defeated the <i>optimates </i>in Rome, and they will defeat them again in America.</p></div>",
  "content_text": "I don’t agree at all with\nthis American Greatness article\n. The recent election demonstrated, beyond any shadow of a doubt, that democracy is dead and there is no political exit. It strikes me as yet another conservative finger-wagging “this is your LAST chance to vote your way to safety”. But the voting machines have been compromised, ergo no one’s votes matter in the slightest. There is no more Democrat vs Republican, there is only\noptimate\nvs\npopulare\n.\nMany traditional Americans are sleepwalking into a conflict they are not mentally prepared to handle. The ideals of blind justice and due process are now, for all intents and purposes, quaint relics, and relying on constitutional rights for protection is dangerously naïve.\nLike it or not, we live in a police state, controlled by an increasingly authoritarian regime with near-total electronic surveillance. The national security apparatus views conservatives and free-thinkers as domestic terrorists, and there are now more military deployed in our nation’s capital than in war zones overseas. If America were any other country, it would be considered a non-permissive environment—not a free country.\nThe pundit class recommends midterm elections and unifying the GOP as remedies, but they ignore the real elephant in the room—representative government is not representing us. While conservative and independent voices are censored and banned from the community square, their elected representatives cower behind their desks and make sweetheart deals with the new regime.\nWe are facing a new post-justice, post-truth society. We won’t be able to debate our way out of it, vote our way out of it, or tweet our way out of it. No one is coming to save us. If traditional America wants to be free, it will have to stop living in the past, get up off the couch, and take action.\nThe good news is that there is nothing particularly difficult about the present situation. The only difference between the two parties described in the article and the two parties of Roman history is that in the USA, the\noptimates\nare mostly foreigners. Indeed, it is the situation in which the overwhelming majority of humanity found itself for the greater part of human history. The\npopulares\ndefeated the\noptimates\nin Rome, and they will defeat them again in America.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-02-24T17:38:14+00:00"
}