{
  "url": "https://voxday.net/2021/02/17/baen-under-sjw-assault/",
  "scraped_at": "2025-12-21T22:38:09.053078",
  "title": "Baen under SJW assault",
  "date_display": "February 17, 2021",
  "date_iso": "2021-02-17T18:02:26+00:00",
  "date_from_url": "2021-02-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And based on their initial response, <a href=\"https://monsterhunternation.com/2021/02/16/publishing-house-baen-books-attacked-by-cancel-culture/\" rel=\"noopener\" target=\"_blank\">it’s not going to go well</a> for them:</p><blockquote><p>Baen Books is a sci-fi/fantasy publishing house that has been around since the early 1980s. They’ve published thousands of titles from hundreds of authors. Baen is notable in our current time period because it is one of the only traditional publishers who does not bend the knee to the woke mob. Our publisher, Toni Weisskopf, truly believes in free speech. Baen’s Bar is one of the oldest forums on the internet. It’s a place for authors and fans to hang out and talk. Today Toni is shutting down the Bar in order to stave off a Parler style cancel culture attack against Baen’s service providers.</p><p>Yesterday some nobody, wannabe writer, social justice twit released a hit piece “expose” about how posters on Baen’s Bar were fomenting insurrection or some such nonsense. It was the usual bullshit hit piece (the sad part is, by saying the usual, half the country immediately knows exactly what I’m talking about). It was lots of pearl clutching over regular people not toeing their arbitrary political lines, misquotes, errors, quotes taken out of context, and some flat out lies.</p><p>However, this was clearly part of a coordinated attack in order to materially harm our business, because immediately after the hit piece was released complaints were filed with the various internet companies Baen uses for services to pressure them into kicking us off the internet. This hit piece was presented as “evidence”. Without going into details the companies then contacted Baen about these “serious allegations” so last night Baen temporarily took down the Bar forum to protect the rest of the company from being deplatformed.</p></blockquote><p>Castalia is under attack as well, but to say that we’re a) not concerned about it and b) prepared for any resulting conflict is probably unnecessary. The minefields were put in place long ago and we’ve got much bigger targets in our sights.</p><p>It is mildly amusing to see the moderates, a few of whom didn’t hesitate to join the SJWs in pointing-and-shrieking at us, now coming under the same sort of attacks that we’ve been weathering for years. I hasten to point out that Larry Correia is most certainly <u>not</u> one of them, as he has always been a stand-up champion of everyone on the Right and he has disdained every invitation to denounce and disavow both the Rabid Puppies and me. He may not embrace the conflict as we do, but he fights. I have nothing but respect and regard for the man, because the Mountain is not my personal army. The VFM are.</p><p>But the targeting of Baen is further proof, as if any were needed, that moderation is no refuge from SJW attack. To the contrary, they’ve now become the favored targets due our increasing antifragility and our proven ability to hit them back harder than they ever imagined.</p><p><b>UPDATE: </b>With regards to the inevitable comments about how “Baen should SUE them”, Larry is exactly right. Only an ignoramus who knows nothing about the legal system operates would think that filing a lawsuit is a viable option for Baen at the moment. However, those who are defending Baen’s decision to immediately take down the Baen Bar in response are foolish if they think that it was a “tactical decision”. It wasn’t, it was a plain and simple demonstration of vulnerability that amounts to an apology that almost assures that at least one amenable authority will take a shot at them now that Baen has shown weakness.</p><p>The correct strategy is to go private. Require some sort of inexpenive subscription to join the Bar that includes a few ebooks, then deny access to everyone else. It’s much, much harder for SJWs to make a coherent complaint about a private forum, particularly one to which they do not belong.</p></div>",
  "content_text": "And based on their initial response,\nit’s not going to go well\nfor them:\nBaen Books is a sci-fi/fantasy publishing house that has been around since the early 1980s. They’ve published thousands of titles from hundreds of authors. Baen is notable in our current time period because it is one of the only traditional publishers who does not bend the knee to the woke mob. Our publisher, Toni Weisskopf, truly believes in free speech. Baen’s Bar is one of the oldest forums on the internet. It’s a place for authors and fans to hang out and talk. Today Toni is shutting down the Bar in order to stave off a Parler style cancel culture attack against Baen’s service providers.\nYesterday some nobody, wannabe writer, social justice twit released a hit piece “expose” about how posters on Baen’s Bar were fomenting insurrection or some such nonsense. It was the usual bullshit hit piece (the sad part is, by saying the usual, half the country immediately knows exactly what I’m talking about). It was lots of pearl clutching over regular people not toeing their arbitrary political lines, misquotes, errors, quotes taken out of context, and some flat out lies.\nHowever, this was clearly part of a coordinated attack in order to materially harm our business, because immediately after the hit piece was released complaints were filed with the various internet companies Baen uses for services to pressure them into kicking us off the internet. This hit piece was presented as “evidence”. Without going into details the companies then contacted Baen about these “serious allegations” so last night Baen temporarily took down the Bar forum to protect the rest of the company from being deplatformed.\nCastalia is under attack as well, but to say that we’re a) not concerned about it and b) prepared for any resulting conflict is probably unnecessary. The minefields were put in place long ago and we’ve got much bigger targets in our sights.\nIt is mildly amusing to see the moderates, a few of whom didn’t hesitate to join the SJWs in pointing-and-shrieking at us, now coming under the same sort of attacks that we’ve been weathering for years. I hasten to point out that Larry Correia is most certainly\nnot\none of them, as he has always been a stand-up champion of everyone on the Right and he has disdained every invitation to denounce and disavow both the Rabid Puppies and me. He may not embrace the conflict as we do, but he fights. I have nothing but respect and regard for the man, because the Mountain is not my personal army. The VFM are.\nBut the targeting of Baen is further proof, as if any were needed, that moderation is no refuge from SJW attack. To the contrary, they’ve now become the favored targets due our increasing antifragility and our proven ability to hit them back harder than they ever imagined.\nUPDATE:\nWith regards to the inevitable comments about how “Baen should SUE them”, Larry is exactly right. Only an ignoramus who knows nothing about the legal system operates would think that filing a lawsuit is a viable option for Baen at the moment. However, those who are defending Baen’s decision to immediately take down the Baen Bar in response are foolish if they think that it was a “tactical decision”. It wasn’t, it was a plain and simple demonstration of vulnerability that amounts to an apology that almost assures that at least one amenable authority will take a shot at them now that Baen has shown weakness.\nThe correct strategy is to go private. Require some sort of inexpenive subscription to join the Bar that includes a few ebooks, then deny access to everyone else. It’s much, much harder for SJWs to make a coherent complaint about a private forum, particularly one to which they do not belong.",
  "tags": [
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-02-17T18:02:26+00:00"
}