{
  "url": "https://voxday.net/2021/02/19/disinviting-baen/",
  "scraped_at": "2025-12-21T22:38:25.005865",
  "title": "Disinviting Baen",
  "date_display": "February 19, 2021",
  "date_iso": "2021-02-19T23:34:24+00:00",
  "date_from_url": "2021-02-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>To the surprise of precisely zero Rabid Puppies, Baen Books shuttering the Bar didn’t suffice to appease the SJW swarmtroopers after Jason Sanford pointed-and-shrieked at it. As an expression of gratitude for cowering before the mob, Worldcon has disinvited its 2021 Guest of Honor, Baen Books publisher Toni Weisskopf:</p><blockquote><p>DisCon III condemns the violent and hostile content found within Baen Books’ forums. We also cannot condone the fact such content was enabled and allowed to ferment for so long. We want to make it clear abusive behavior is not, and will not be, tolerated at DisCon III. Such behavior goes entirely against our already established policies concerning inclusivity and creating a welcoming environment for our members, which can be found here: https://discon3.org/about/inclusion/.</p><p>We knew simply saying those words with no actions to back them up would be unacceptable. Too often, we have seen individuals and organizations say they are on the right side of issues yet do nothing to act on those words. We knew we had to take a hard look at our own position and take action based on our established policies.</p><p>As a result, after discussion with her, we have notified Toni Weisskopf we are removing her as a Guest of Honor for DisCon III.</p><p>We know this decision was not as quick as some of you would have wanted, and we understand your frustration. Our committee’s leadership was always in full agreement that there was a fundamental difference between the values Worldcon strives to uphold and the values allowed to be espoused on the forums-in-question.</p><p>In the entire eighty-plus year history of our community, no Worldcon has ever removed someone as a Guest of Honor. To remove a Guest of Honor was an unprecedented decision that needed discussion, consideration, and consensus. Those mechanisms sometimes do not move as fast as some would want, and we thank the community for its patience.</p><p>We also want to let everyone know that we are not planning on adding additional individuals to our Guest of Honor list.</p></blockquote><p>In fairness, this almost certainly would have happened anyhow, no matter what Ms Weisskopf did. But demonstrating weakness in front of SJWs is nearly as predictably counterproductive as doing so in front of an angry, snarling dog. And to say that <a href=\"https://monsterhunternation.com/2021/02/19/an-open-letter-to-the-old-time-fans-at-worldcon/\" rel=\"noopener\" target=\"_blank\">this attempt at public humiliation has angered The International Lord of Hate</a> would be the understatement of the year. SJWs, beware! You may come to regret awakening the Mountain to the true depths of your spite and provoking him to action.</p><blockquote><p>Toni had been participating in WorldCons for decades. She grew up in your scene. She volunteered. She hung out with you. She helped out. When she got into the publishing business she kept on helping out, whatever you needed, she was always there for you. She became an editor, and a damned good one too (and you fucking know it).</p><p>In fact, she became one of the best and most successful editors in the history of the genre… yet year after year, she got no prestigious award nomination, and instead you just kept giving the award to the same assholes from the same publishing house, over and over and over, as you ignored Toni because she was at that publishing house. The uncouth one. You talk a big game about “honoring strong women” as you took turns rotating through the same cadre of old white dudes for best editor.</p><p>It took me, the barbaric outsider, to rally the barbaric outsider fans to finally get Toni some recognition in your sainted halls. And even though your bleating social justice contingent threw a fit, you know what most of you old time, old school, long attending WorldConners told me in private? Good. About time.</p><p>Because even though you hated me and my friends (and trust me, we’re cool with that) you knew that Toni deserved it. Toni had earned it. She had long since put in the work. As George R.R. Martin so haughtily proclaimed when he finally admitted I was right all those years ago, and that Hugos were not for everybody (as long claimed) but rather only for your elite select body of special fans, only people who had served their time deserved your fancy awards. Except by every fucking measure in the universe, Toni had served her time.</p><p>Then along came the awards, and you snubbed her. Hell, you didn’t just snub her. They openly mocked her, said all sorts of hateful shit, and you people who claimed to be her friends, you old timers who claimed to be all about the sainted dignity of WorldCon, you sat there, silent and afraid, as they did their little high school mean girl games. Toni got up and left the awards ceremony because she wouldn’t give the sicks fucks the satisfaction of watching her endure it. Unlike you, Toni has dignity.</p><p>You fuckers talk a big game about tradition. But then the instant there was heat you crumbled before the woke mob that doesn’t give a shit about your precious traditions either. You even renamed one of your awards just to placate their tantrum.</p><p>And when those assholes fucked her over last time, you did nothing. Some of you put up some timid posts, but overall you cowered before the mob you helped create, the same one you mocked me for warning you about. People who claimed to be Toni’s friends sat there, silent, worried that if they did the right thing the mob would come for them next. At least they had the decency to stab her in the front. You stabbed her in the back.</p></blockquote><p>The lesson, as always, is this: no olive branches for SJWs.</p></div>",
  "content_text": "To the surprise of precisely zero Rabid Puppies, Baen Books shuttering the Bar didn’t suffice to appease the SJW swarmtroopers after Jason Sanford pointed-and-shrieked at it. As an expression of gratitude for cowering before the mob, Worldcon has disinvited its 2021 Guest of Honor, Baen Books publisher Toni Weisskopf:\nDisCon III condemns the violent and hostile content found within Baen Books’ forums. We also cannot condone the fact such content was enabled and allowed to ferment for so long. We want to make it clear abusive behavior is not, and will not be, tolerated at DisCon III. Such behavior goes entirely against our already established policies concerning inclusivity and creating a welcoming environment for our members, which can be found here: https://discon3.org/about/inclusion/.\nWe knew simply saying those words with no actions to back them up would be unacceptable. Too often, we have seen individuals and organizations say they are on the right side of issues yet do nothing to act on those words. We knew we had to take a hard look at our own position and take action based on our established policies.\nAs a result, after discussion with her, we have notified Toni Weisskopf we are removing her as a Guest of Honor for DisCon III.\nWe know this decision was not as quick as some of you would have wanted, and we understand your frustration. Our committee’s leadership was always in full agreement that there was a fundamental difference between the values Worldcon strives to uphold and the values allowed to be espoused on the forums-in-question.\nIn the entire eighty-plus year history of our community, no Worldcon has ever removed someone as a Guest of Honor. To remove a Guest of Honor was an unprecedented decision that needed discussion, consideration, and consensus. Those mechanisms sometimes do not move as fast as some would want, and we thank the community for its patience.\nWe also want to let everyone know that we are not planning on adding additional individuals to our Guest of Honor list.\nIn fairness, this almost certainly would have happened anyhow, no matter what Ms Weisskopf did. But demonstrating weakness in front of SJWs is nearly as predictably counterproductive as doing so in front of an angry, snarling dog. And to say that\nthis attempt at public humiliation has angered The International Lord of Hate\nwould be the understatement of the year. SJWs, beware! You may come to regret awakening the Mountain to the true depths of your spite and provoking him to action.\nToni had been participating in WorldCons for decades. She grew up in your scene. She volunteered. She hung out with you. She helped out. When she got into the publishing business she kept on helping out, whatever you needed, she was always there for you. She became an editor, and a damned good one too (and you fucking know it).\nIn fact, she became one of the best and most successful editors in the history of the genre… yet year after year, she got no prestigious award nomination, and instead you just kept giving the award to the same assholes from the same publishing house, over and over and over, as you ignored Toni because she was at that publishing house. The uncouth one. You talk a big game about “honoring strong women” as you took turns rotating through the same cadre of old white dudes for best editor.\nIt took me, the barbaric outsider, to rally the barbaric outsider fans to finally get Toni some recognition in your sainted halls. And even though your bleating social justice contingent threw a fit, you know what most of you old time, old school, long attending WorldConners told me in private? Good. About time.\nBecause even though you hated me and my friends (and trust me, we’re cool with that) you knew that Toni deserved it. Toni had earned it. She had long since put in the work. As George R.R. Martin so haughtily proclaimed when he finally admitted I was right all those years ago, and that Hugos were not for everybody (as long claimed) but rather only for your elite select body of special fans, only people who had served their time deserved your fancy awards. Except by every fucking measure in the universe, Toni had served her time.\nThen along came the awards, and you snubbed her. Hell, you didn’t just snub her. They openly mocked her, said all sorts of hateful shit, and you people who claimed to be her friends, you old timers who claimed to be all about the sainted dignity of WorldCon, you sat there, silent and afraid, as they did their little high school mean girl games. Toni got up and left the awards ceremony because she wouldn’t give the sicks fucks the satisfaction of watching her endure it. Unlike you, Toni has dignity.\nYou fuckers talk a big game about tradition. But then the instant there was heat you crumbled before the woke mob that doesn’t give a shit about your precious traditions either. You even renamed one of your awards just to placate their tantrum.\nAnd when those assholes fucked her over last time, you did nothing. Some of you put up some timid posts, but overall you cowered before the mob you helped create, the same one you mocked me for warning you about. People who claimed to be Toni’s friends sat there, silent, worried that if they did the right thing the mob would come for them next. At least they had the decency to stab her in the front. You stabbed her in the back.\nThe lesson, as always, is this: no olive branches for SJWs.",
  "tags": [
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-02-19T23:34:24+00:00"
}