{
  "url": "https://voxday.net/2021/02/28/it-is-good-to-hate-the-boomer/",
  "scraped_at": "2025-12-21T22:39:30.925510",
  "title": "It is good to hate the Boomer",
  "date_display": "February 28, 2021",
  "date_iso": "2021-02-28T13:59:19+00:00",
  "date_from_url": "2021-02-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t hate old people. I hate Boomers. I hate literally <i>everything</i> about Boomerdom. There is not one single thing I like about it. I hate their music, I hate their clothes. I hate their stupid hair and their stupid civnattery. I hate their materialism. I hate their horrible 70s fabrics and colors. But most of all, I hate their juvenile and terminally dyscivilizational self-obsession. This is not a recent phenomenon. I have hated everything about them since the late 1970s, when I first began to become aware that things had not always been so ugly and myopic and awful.</p><blockquote><p>These idiots are proud of hating on a targeted group, the old.</p><p>This is ageist nonsense. If you like being insulted by children go to Vox to be insulted; you may have invented personal computers, the internet, and gone to the moon. You could be Tim Berners-Lee, It won’t matter. Vox is a bigot against anyone who has been around longer than himself. If you don’t like it he will ban you.</p><p>He must hates his parents so he takes it out any one who is older than himself.</p></blockquote><p>How much do you love that he actually worked the Moon in there. The point is that if you self-identify as a Boomer, if you are offended when younger generations exhibit their contempt for Boomers, then you are accepting culpability for all the many sins of your g-g-generation. I don’t hate or despise old people. To the contrary, I have always respected and sought to learn from my elders. I harbor no contempt for pre-Boomers, or with people born between 1946 and 1964 who repudiate Boomerism. It’s not when one was born that matters, but rather, one’s identity and values.</p><p>Boomers don’t understand this because they never respected their elders and identified themselves by their long-distant youth. That’s why they always say, incorrectly, that our children and grandchildren will despise us the way theirs despise them, and the way they despised their parents and grandparents. But that is not true, because we loved our grandparents, we love our children, and we will love our grandchildren. And we don’t merely love them, we prioritize them. We sacrifice for them and we do so gladly.</p><p>The best description of the Boomer I have ever heard is this: the Boomer criticizes his grandchildren for failing to plant the acorns of the nonexistent oaks under which he cannot sit.</p><p>I have consciously hated Boomers since they were declaring that 40 is the new 20 and I always will. The Day of the Pillow is coming for all of them. And the best thing is that we are <i>literally writing their history</i>, because none of those self-obsessed losers had enough interest in anything outside of their g-g-generation to be able to put it in historical context.</p><p>God hates the wicked. That is why it is good to hate the Boomer.</p></div>",
  "content_text": "I don’t hate old people. I hate Boomers. I hate literally\neverything\nabout Boomerdom. There is not one single thing I like about it. I hate their music, I hate their clothes. I hate their stupid hair and their stupid civnattery. I hate their materialism. I hate their horrible 70s fabrics and colors. But most of all, I hate their juvenile and terminally dyscivilizational self-obsession. This is not a recent phenomenon. I have hated everything about them since the late 1970s, when I first began to become aware that things had not always been so ugly and myopic and awful.\nThese idiots are proud of hating on a targeted group, the old.\nThis is ageist nonsense. If you like being insulted by children go to Vox to be insulted; you may have invented personal computers, the internet, and gone to the moon. You could be Tim Berners-Lee, It won’t matter. Vox is a bigot against anyone who has been around longer than himself. If you don’t like it he will ban you.\nHe must hates his parents so he takes it out any one who is older than himself.\nHow much do you love that he actually worked the Moon in there. The point is that if you self-identify as a Boomer, if you are offended when younger generations exhibit their contempt for Boomers, then you are accepting culpability for all the many sins of your g-g-generation. I don’t hate or despise old people. To the contrary, I have always respected and sought to learn from my elders. I harbor no contempt for pre-Boomers, or with people born between 1946 and 1964 who repudiate Boomerism. It’s not when one was born that matters, but rather, one’s identity and values.\nBoomers don’t understand this because they never respected their elders and identified themselves by their long-distant youth. That’s why they always say, incorrectly, that our children and grandchildren will despise us the way theirs despise them, and the way they despised their parents and grandparents. But that is not true, because we loved our grandparents, we love our children, and we will love our grandchildren. And we don’t merely love them, we prioritize them. We sacrifice for them and we do so gladly.\nThe best description of the Boomer I have ever heard is this: the Boomer criticizes his grandchildren for failing to plant the acorns of the nonexistent oaks under which he cannot sit.\nI have consciously hated Boomers since they were declaring that 40 is the new 20 and I always will. The Day of the Pillow is coming for all of them. And the best thing is that we are\nliterally writing their history\n, because none of those self-obsessed losers had enough interest in anything outside of their g-g-generation to be able to put it in historical context.\nGod hates the wicked. That is why it is good to hate the Boomer.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-02-28T13:59:19+00:00"
}