{
  "url": "https://voxday.net/2021/02/03/mailvox-the-midwit-mind-and-the-media/",
  "scraped_at": "2025-12-21T22:36:24.283462",
  "title": "Mailvox: the midwit mind and the media",
  "date_display": "February 3, 2021",
  "date_iso": "2021-02-03T13:00:01+00:00",
  "date_from_url": "2021-02-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you want to know why I hold all binary thinkers unable to grasp even a modicum of second-order reasoning in contempt, this is precisely why:</p><p><i></i></p><blockquote><p><i>What part of never talk to the media is hard to understand?</i></p><p>Apparently the part where you want to do it yourself.</p><p>I’m sorry but as much as I like reading this blog this is just plain hypocrisy. You’re trying to shred the guy for talking to the media and say that you should never talk to the media. Then you try to justify you doing it yourself. That’s what liberals do.</p><p>I don’t agree with everything Peterson says but from what I’ve seen of him I like how he analyses some topics. Sure be critical of the guy if you disagree with something he says or does, just don’t expect people to let your own hypocrisy slide.</p></blockquote><p>What midwits are simply incapable of understanding is the fact that a) legitimate exceptions to most rules exist in certain contexts and b) the fact that there are exceptions does not disprove the rule. They simply don’t grasp context. They have a total inability to read negative space.</p><p>“Never talk to the police” does not mean “don’t call 911 when someone is trying to break into your house.” “Never apologize” doesn’t mean “don’t say ‘I’m sorry’ to your wife when you forget to fill up the car with gas when you told her you would.” </p><p>And “never talk to the media” doesn’t mean not issuing press releases or not talking to specialist media outlets about new products. Doing that is literally a necessary part of the job. It means “don’t talk to any member of the media that wants to talk to you because all they want is ammunition for the inevitable hit piece.” It means “don’t talk to the media about yourself, your ideas, or your books.” It is rhetoric, not dialectic, and it’s formulated strongly in order to keep all the special boys from concluding that the general rule doesn’t apply to them because the media is obviously going to give them a pass for being so special. </p><p>The famous last words of a special boy: <i>They even said they wanted to let me tell my side of the story! </i>Because no one’s ever heard THAT one before….</p><p>Please note that I am still rejecting every media request and interview request sent to me by everyone from <i>The New York Times</i> to right-wing BitChute channels and high-school fans, and will continue to do so. Have you seen or read one anywhere? Nevertheless, I absolutely will be letting the relevant organizations know about Project Asteroid, because all of their audiences will be extremely interested in it and there are certain aspects that we want to be sure their audiences know about. And I will do it rather than permit any other member of the team to do so because if there is any unpleasant blowback that does happen to result from this, as there may well be, I am much better equipped to endure it than anyone else.</p><p>So if you genuinely consider that to be “plain hypocrisy” then by all means leave this blog, leave this community, and follow Jordan Peterson into his schizophrenic Hell.</p></div>",
  "content_text": "If you want to know why I hold all binary thinkers unable to grasp even a modicum of second-order reasoning in contempt, this is precisely why:\nWhat part of never talk to the media is hard to understand?\nApparently the part where you want to do it yourself.\nI’m sorry but as much as I like reading this blog this is just plain hypocrisy. You’re trying to shred the guy for talking to the media and say that you should never talk to the media. Then you try to justify you doing it yourself. That’s what liberals do.\nI don’t agree with everything Peterson says but from what I’ve seen of him I like how he analyses some topics. Sure be critical of the guy if you disagree with something he says or does, just don’t expect people to let your own hypocrisy slide.\nWhat midwits are simply incapable of understanding is the fact that a) legitimate exceptions to most rules exist in certain contexts and b) the fact that there are exceptions does not disprove the rule. They simply don’t grasp context. They have a total inability to read negative space.\n“Never talk to the police” does not mean “don’t call 911 when someone is trying to break into your house.” “Never apologize” doesn’t mean “don’t say ‘I’m sorry’ to your wife when you forget to fill up the car with gas when you told her you would.”\nAnd “never talk to the media” doesn’t mean not issuing press releases or not talking to specialist media outlets about new products. Doing that is literally a necessary part of the job. It means “don’t talk to any member of the media that wants to talk to you because all they want is ammunition for the inevitable hit piece.” It means “don’t talk to the media about yourself, your ideas, or your books.” It is rhetoric, not dialectic, and it’s formulated strongly in order to keep all the special boys from concluding that the general rule doesn’t apply to them because the media is obviously going to give them a pass for being so special.\nThe famous last words of a special boy:\nThey even said they wanted to let me tell my side of the story!\nBecause no one’s ever heard THAT one before….\nPlease note that I am still rejecting every media request and interview request sent to me by everyone from\nThe New York Times\nto right-wing BitChute channels and high-school fans, and will continue to do so. Have you seen or read one anywhere? Nevertheless, I absolutely will be letting the relevant organizations know about Project Asteroid, because all of their audiences will be extremely interested in it and there are certain aspects that we want to be sure their audiences know about. And I will do it rather than permit any other member of the team to do so because if there is any unpleasant blowback that does happen to result from this, as there may well be, I am much better equipped to endure it than anyone else.\nSo if you genuinely consider that to be “plain hypocrisy” then by all means leave this blog, leave this community, and follow Jordan Peterson into his schizophrenic Hell.",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-02-03T13:00:01+00:00"
}