{
  "url": "https://voxday.net/2021/02/14/marked-for-death/",
  "scraped_at": "2025-12-21T22:37:48.712198",
  "title": "Marked for death",
  "date_display": "February 14, 2021",
  "date_iso": "2021-02-14T18:30:02+00:00",
  "date_from_url": "2021-02-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Forget the dangers posed by a potential reaction to the Covid “vaccine”. The far more significant danger is that the pseudo-vaccine will provide the next virus <a href=\"https://market-ticker.org/akcs-www?post=241577\" rel=\"noopener\" target=\"_blank\">with a marker to target</a>. In fact, the “success” of the Covid vaccine program may have already assured that China will win its 5GW wars with both the USA and the Jewish diaspora.</p><blockquote><p>Coronaviruses are notorious for ADE reactions, where antibody presence potentiates the infection instead of protecting against it.  Using that as a bioweapon is stupid because you will score “own goals” on your own people and there is no way to control that.  As a result biological weapons generally are dumb; poison gas and such don’t have this risk since it does not propagate but any disease does.</p><p>The poster child for ADE in coronaviruses was an attempted vaccine for a feline coronavirus that often made cats very sick.  The vaccine killed every one of them in the test when they were later exposed, wildly potentiating the infection.</p><p>Read that again folks: NOT ONE VACCINATED CAT SURVIVED A CHALLENGE WITH THE ACTUAL VIRUS.</p><p>Ordinary vaccines we have lots of experience with, such as measles, the flu shot, mumps and similar do not carry a risk beyond that of natural infection and cannot be weaponized because they produce the exact same antibody response as a natural infection.  If you have had either the measles or the shot you will have antibodies but an antibody test will not tell you which since they’re not distinguishable.</p><p>I suspected from the start that due to the way these mRNA shots work — they are not actually a vaccine at all in that they do not “mimic” natural infection but rather cause your cells to produce the spike protein that the virus has and that elicits an immune response — that the antibodies produced by those jabs would be distinct and distinguishable from natural infection.</p><p>All of the so-called “experts” who worked to develop these and the firms involved knew damn well this was the case when they started developing them — and did it anyway.</p><p>Now we have hard, scientific confirmation of that and it’s very bad. In fact it’s potentially nation-ending bad.</p><p>An adversary that develops a virus (e.g. another modified/mutated bat virus, for example) that selectively targets ADE in people with the specific antibodies from vaccination, which are distinct from natural infection, could easily kill every single person who was vaccinated and not harm or only make mildly sick those who either had Covid-19 naturally or who were uninfected and unvaccinated.</p><p>The nightmare scenario that has always driven bioweapons research is the push to discover some genetically distinct means of targeting a bioweapon such that it only kills your adversary and leaves everyone else alone.  It’s even worse for your adversary if your side gets and transmits it but doesn’t get sick.  This has never been found despite diligent effort in the past; all attempts to find such a distinct vulnerability have failed, showing reactivity across the board and thus strongly suggesting that if that “thing” was completed and got out it would kill indiscriminately.  That you cannot stop a virus from circulating (even isolated islands eventually got hit by the 1918 pandemic flu!) means that releasing a virus or bacteria that nobody on “your” side has been sensitized to yet doesn’t help because when (not if) the sensitizing agent gets into your population all your people die too.</p><p>This has now, for the first time in human history, been changed by the idiotic actions of our governments and pharmaceutical companies in that we are now tagging people for death by the literal millions and they will die if an adversary is able to develop a virus that targets those specific antibodies. </p></blockquote><p>It could be <i>Seven Kill Tiger</i>-level horrific. But the silver lining in the dark cloud is that the surviving population will be far more intelligent and K-oriented than those who voluntarily accepted the death-mark. Nevertheless, Karl Denninger is absolutely right.</p><p><b><i>The use of any “vaccine” that does not produce an identical antibody to natural infection must be halted immediately and never done again.</i></b></p></div>",
  "content_text": "Forget the dangers posed by a potential reaction to the Covid “vaccine”. The far more significant danger is that the pseudo-vaccine will provide the next virus\nwith a marker to target\n. In fact, the “success” of the Covid vaccine program may have already assured that China will win its 5GW wars with both the USA and the Jewish diaspora.\nCoronaviruses are notorious for ADE reactions, where antibody presence potentiates the infection instead of protecting against it.  Using that as a bioweapon is stupid because you will score “own goals” on your own people and there is no way to control that.  As a result biological weapons generally are dumb; poison gas and such don’t have this risk since it does not propagate but any disease does.\nThe poster child for ADE in coronaviruses was an attempted vaccine for a feline coronavirus that often made cats very sick.  The vaccine killed every one of them in the test when they were later exposed, wildly potentiating the infection.\nRead that again folks: NOT ONE VACCINATED CAT SURVIVED A CHALLENGE WITH THE ACTUAL VIRUS.\nOrdinary vaccines we have lots of experience with, such as measles, the flu shot, mumps and similar do not carry a risk beyond that of natural infection and cannot be weaponized because they produce the exact same antibody response as a natural infection.  If you have had either the measles or the shot you will have antibodies but an antibody test will not tell you which since they’re not distinguishable.\nI suspected from the start that due to the way these mRNA shots work — they are not actually a vaccine at all in that they do not “mimic” natural infection but rather cause your cells to produce the spike protein that the virus has and that elicits an immune response — that the antibodies produced by those jabs would be distinct and distinguishable from natural infection.\nAll of the so-called “experts” who worked to develop these and the firms involved knew damn well this was the case when they started developing them — and did it anyway.\nNow we have hard, scientific confirmation of that and it’s very bad. In fact it’s potentially nation-ending bad.\nAn adversary that develops a virus (e.g. another modified/mutated bat virus, for example) that selectively targets ADE in people with the specific antibodies from vaccination, which are distinct from natural infection, could easily kill every single person who was vaccinated and not harm or only make mildly sick those who either had Covid-19 naturally or who were uninfected and unvaccinated.\nThe nightmare scenario that has always driven bioweapons research is the push to discover some genetically distinct means of targeting a bioweapon such that it only kills your adversary and leaves everyone else alone.  It’s even worse for your adversary if your side gets and transmits it but doesn’t get sick.  This has never been found despite diligent effort in the past; all attempts to find such a distinct vulnerability have failed, showing reactivity across the board and thus strongly suggesting that if that “thing” was completed and got out it would kill indiscriminately.  That you cannot stop a virus from circulating (even isolated islands eventually got hit by the 1918 pandemic flu!) means that releasing a virus or bacteria that nobody on “your” side has been sensitized to yet doesn’t help because when (not if) the sensitizing agent gets into your population all your people die too.\nThis has now, for the first time in human history, been changed by the idiotic actions of our governments and pharmaceutical companies in that we are now tagging people for death by the literal millions and they will die if an adversary is able to develop a virus that targets those specific antibodies.\nIt could be\nSeven Kill Tiger\n-level horrific. But the silver lining in the dark cloud is that the surviving population will be far more intelligent and K-oriented than those who voluntarily accepted the death-mark. Nevertheless, Karl Denninger is absolutely right.\nThe use of any “vaccine” that does not produce an identical antibody to natural infection must be halted immediately and never done again.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-02-14T18:30:02+00:00"
}