{
  "url": "https://voxday.net/2021/02/19/the-surrender-of-the-usas-foreign-elite/",
  "scraped_at": "2025-12-21T22:38:19.443412",
  "title": "The surrender of the USA’s foreign elite",
  "date_display": "February 19, 2021",
  "date_iso": "2021-02-19T12:31:34+00:00",
  "date_from_url": "2021-02-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is <a href=\"https://www.tabletmag.com/sections/news/articles/the-thirty-tyrants\" rel=\"noopener\" target=\"_blank\">historical precedent for the sellout</a> of Americans by the not-Americans of the globalist corpocracy who have been ruling them for the last 20+ years, as Lee Smith points out how an Athenian elite sold out the people of Athens after its defeat by Sparta:</p><blockquote><p>In Chapter 5 of <i>The Prince</i>, Niccolo Machiavelli describes three options for how a conquering power might best treat those it has defeated in war. The first is to ruin them; the second is to rule directly; the third is to create “therein a state of the few which might keep it friendly to you.”</p><p>The example Machiavelli gives of the last is the friendly government Sparta established in Athens upon defeating it after 27 years of war in 404 BCE. For the upper caste of an Athenian elite already contemptuous of democracy, the city’s defeat in the Peloponnesian War confirmed that Sparta’s system was preferable. It was a high-spirited military aristocracy ruling over a permanent servant class, the helots, who were periodically slaughtered to condition them to accept their subhuman status. Athenian democracy by contrast gave too much power to the low-born. The pro-Sparta oligarchy used their patrons’ victory to undo the rights of citizens, and settle scores with their domestic rivals, exiling and executing them and confiscating their wealth.</p><p>The Athenian government disloyal to Athens’ laws and contemptuous of its traditions was known as the Thirty Tyrants, and understanding its role and function helps explain what is happening in America today.</p><p>For my last column I spoke with <i>The New York Times</i>’ Thomas Friedman about an article he wrote more than a decade ago, during the first year of Barack Obama’s presidency. His important piece documents the exact moment when the American elite decided that democracy wasn’t working for them. Blaming the Republican Party for preventing them from running roughshod over the American public, they migrated to the Democratic Party in the hopes of strengthening the relationships that were making them rich.</p><p>A trade consultant told Friedman: “The need to compete in a globalized world has forced the meritocracy, the multinational corporate manager, the Eastern financier and the technology entrepreneur to reconsider what the Republican Party has to offer. In principle, they have left the party, leaving behind not a pragmatic coalition but a group of ideological naysayers.”</p><p>In the more than 10 years since Friedman’s column was published, the disenchanted elite that the Times columnist identified has further impoverished American workers while enriching themselves. The one-word motto they came to live by was globalism—that is, the freedom to structure commercial relationships and social enterprises without reference to the well-being of the particular society in which they happened to make their livings and raise their children.</p><p>Undergirding the globalist enterprise was China’s accession to the World Trade Organization in 2001. For decades, American policymakers and the corporate class said they saw China as a rival, but the elite that Friedman described saw enlightened Chinese autocracy as a friend and even as a model—which was not surprising, given that the Chinese Communist Party became their source of power, wealth, and prestige. Why did they trade with an authoritarian regime and send millions of American manufacturing jobs off to China thereby impoverish working Americans? Because it made them rich. They salved their consciences by telling themselves they had no choice but to deal with China: It was big, productive, and efficient and its rise was inevitable. And besides, the American workers hurt by the deal deserved to be punished—who could defend a class of reactionary and racist ideological naysayers standing in the way of what was best for progress?</p></blockquote><p>This is a really important article if you want to better understand the grand strategic situation. Read the whole thing, and understand the way in which it is connected to the original plan of the Learned Elders of Wye to make the Great Leap Eastward that was publicly rejected by the Chinese in 2015. </p></div>",
  "content_text": "There is\nhistorical precedent for the sellout\nof Americans by the not-Americans of the globalist corpocracy who have been ruling them for the last 20+ years, as Lee Smith points out how an Athenian elite sold out the people of Athens after its defeat by Sparta:\nIn Chapter 5 of\nThe Prince\n, Niccolo Machiavelli describes three options for how a conquering power might best treat those it has defeated in war. The first is to ruin them; the second is to rule directly; the third is to create “therein a state of the few which might keep it friendly to you.”\nThe example Machiavelli gives of the last is the friendly government Sparta established in Athens upon defeating it after 27 years of war in 404 BCE. For the upper caste of an Athenian elite already contemptuous of democracy, the city’s defeat in the Peloponnesian War confirmed that Sparta’s system was preferable. It was a high-spirited military aristocracy ruling over a permanent servant class, the helots, who were periodically slaughtered to condition them to accept their subhuman status. Athenian democracy by contrast gave too much power to the low-born. The pro-Sparta oligarchy used their patrons’ victory to undo the rights of citizens, and settle scores with their domestic rivals, exiling and executing them and confiscating their wealth.\nThe Athenian government disloyal to Athens’ laws and contemptuous of its traditions was known as the Thirty Tyrants, and understanding its role and function helps explain what is happening in America today.\nFor my last column I spoke with\nThe New York Times\n’ Thomas Friedman about an article he wrote more than a decade ago, during the first year of Barack Obama’s presidency. His important piece documents the exact moment when the American elite decided that democracy wasn’t working for them. Blaming the Republican Party for preventing them from running roughshod over the American public, they migrated to the Democratic Party in the hopes of strengthening the relationships that were making them rich.\nA trade consultant told Friedman: “The need to compete in a globalized world has forced the meritocracy, the multinational corporate manager, the Eastern financier and the technology entrepreneur to reconsider what the Republican Party has to offer. In principle, they have left the party, leaving behind not a pragmatic coalition but a group of ideological naysayers.”\nIn the more than 10 years since Friedman’s column was published, the disenchanted elite that the Times columnist identified has further impoverished American workers while enriching themselves. The one-word motto they came to live by was globalism—that is, the freedom to structure commercial relationships and social enterprises without reference to the well-being of the particular society in which they happened to make their livings and raise their children.\nUndergirding the globalist enterprise was China’s accession to the World Trade Organization in 2001. For decades, American policymakers and the corporate class said they saw China as a rival, but the elite that Friedman described saw enlightened Chinese autocracy as a friend and even as a model—which was not surprising, given that the Chinese Communist Party became their source of power, wealth, and prestige. Why did they trade with an authoritarian regime and send millions of American manufacturing jobs off to China thereby impoverish working Americans? Because it made them rich. They salved their consciences by telling themselves they had no choice but to deal with China: It was big, productive, and efficient and its rise was inevitable. And besides, the American workers hurt by the deal deserved to be punished—who could defend a class of reactionary and racist ideological naysayers standing in the way of what was best for progress?\nThis is a really important article if you want to better understand the grand strategic situation. Read the whole thing, and understand the way in which it is connected to the original plan of the Learned Elders of Wye to make the Great Leap Eastward that was publicly rejected by the Chinese in 2015.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-02-19T12:31:34+00:00"
}