{
  "url": "https://voxday.net/2021/02/11/the-next-gatekeeper-platform/",
  "scraped_at": "2025-12-21T22:37:24.785986",
  "title": "The next gatekeeper platform",
  "date_display": "February 11, 2021",
  "date_iso": "2021-02-11T16:00:00+00:00",
  "date_from_url": "2021-02-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> No. Just no. No sooner has Parler bitten the dust than <a href=\"https://www.wnd.com/2021/02/one-platform-counter-google-facebook-twitter-youtube/\" rel=\"noopener\" target=\"_blank\">yet another new “alternative”</a> is being waggled out there as bait.</p><blockquote><p>Emphasizing free speech and privacy, a tech entrepreneur who has been developing a search engine for the past decade plans to roll out a platform that will include the features of Google, Facebook, YouTube and Twitter.</p><p>Find.com, says Jeffrey Sisk, will begin with a messaging platform similar to Twitter then add the search, social networking and video features, putting them together in one app.</p><p>“It’s the convergence of an amazing brand name, innovative technology and a public that is desperate to find any new way to help win this war on truth,” he told WND.</p><p>Sisk said he is inviting the millions of Americans who are seeking an alternative to the Big Tech giants to join him in funding the venture.</p><p>He’s launched a GoFundMe page in which he explains his vision.</p><p>“We are committing to you now that we will forever support the core values enshrined in the Bill of Rights,” he says in the GoFundMe description of the project. “As a platform, yes, we will remove content that contains the obvious bad things, such as graphic violence or pornography. But we will always support constitutionally protected free speech and the First Amendment. That is our firm commitment to you, the American public.”</p><p>After the funding comes in, he said, he plans to launch Find.com’s public messaging platform in the first couple of months.</p></blockquote><p>Free speech + funding = gatekeeper. How many times are conservative idiots going to fall for this line? From Emma Lazarus to the Tea Party and Jordan Peterson, it’s always the same rhetorical bait for the conservatives they want to keep away from a) Christianity and b) nationalism.</p><p>Christian Nationalism is the only genuine alternative to the globosatanism of the Prometheans. Any platform, program, person, or organization who doesn’t <i>explicitly </i>advocate Christian nationalism should not be trusted one iota. And those that do should be regarded with relentless skepticism and closely watched for signs of convergence.</p></div>",
  "content_text": "No. Just no. No sooner has Parler bitten the dust than\nyet another new “alternative”\nis being waggled out there as bait.\nEmphasizing free speech and privacy, a tech entrepreneur who has been developing a search engine for the past decade plans to roll out a platform that will include the features of Google, Facebook, YouTube and Twitter.\nFind.com, says Jeffrey Sisk, will begin with a messaging platform similar to Twitter then add the search, social networking and video features, putting them together in one app.\n“It’s the convergence of an amazing brand name, innovative technology and a public that is desperate to find any new way to help win this war on truth,” he told WND.\nSisk said he is inviting the millions of Americans who are seeking an alternative to the Big Tech giants to join him in funding the venture.\nHe’s launched a GoFundMe page in which he explains his vision.\n“We are committing to you now that we will forever support the core values enshrined in the Bill of Rights,” he says in the GoFundMe description of the project. “As a platform, yes, we will remove content that contains the obvious bad things, such as graphic violence or pornography. But we will always support constitutionally protected free speech and the First Amendment. That is our firm commitment to you, the American public.”\nAfter the funding comes in, he said, he plans to launch Find.com’s public messaging platform in the first couple of months.\nFree speech + funding = gatekeeper. How many times are conservative idiots going to fall for this line? From Emma Lazarus to the Tea Party and Jordan Peterson, it’s always the same rhetorical bait for the conservatives they want to keep away from a) Christianity and b) nationalism.\nChristian Nationalism is the only genuine alternative to the globosatanism of the Prometheans. Any platform, program, person, or organization who doesn’t\nexplicitly\nadvocate Christian nationalism should not be trusted one iota. And those that do should be regarded with relentless skepticism and closely watched for signs of convergence.",
  "tags": [
    "corpocracy"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-02-11T16:00:00+00:00"
}