{
  "url": "https://voxday.net/2021/02/08/the-moral-hypocrisy/",
  "scraped_at": "2025-12-21T22:37:02.704930",
  "title": "The Moral Hypocrisy",
  "date_display": "February 8, 2021",
  "date_iso": "2021-02-08T13:00:05+00:00",
  "date_from_url": "2021-02-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>This is the article by Gad Saad condemning celebrity virtue-signalers <a href=\"https://www.thebuffalotribune.com/post/the-moral-hypocrisy-of-celebrities-the-case-of-seth-rogen\" rel=\"noopener\" target=\"_blank\">that was vanished</a> by Psychology Today, most likely because it intellectually jiu-jitsued the historical communist tactic of medicalizing ideological opponents. Possibly also because he had the unseemly temerity to suggest that a celebrity actually read a book.</i></p><p>Back in 2009, I authored an article on this platform titled <i>The Narcissism and Grandiosity of Celebrities</i>.  Continuing this tradition, this past week on my social media platforms, I critiqued the virtue signalling that members of the privileged classes engage in. Here is what I wrote: </p><p>“Let me explain yet again the source for all of the platitudinous virtue signalling. The truly privileged elites know that deep down they are frauds. They suffer from existential guilt. Hence, one of the ways by which they assuage the guilt albatross around their necks is to demonstrate to the world that they are truly compassionate, truly loving, truly caring, truly profound. Hence, they love all “undocumented” immigrants. They love Mother Earth. They love the ozone layer. They love BLM. They love socialism. They love inner cities. They hate the gentrification of neighbourhoods. They love mentors of color. They cherish diversity. They love LGBTQ movies. They adore queer architecture. They are better than you. More caring, more cultured, more empathetic. This permits them to sleep better at night. See, I’m not a fraud. I may be a gargantuan parasitic hedge fund bullshitter but I really care. I may be an overpaid BS actor but I fight for solar panels. Those fly over rubes deserve their lot in life. They are racists who bed their siblings. We are science supporters who fight against Mother Earth rapists whilst flying in our private jets. It is a classic ego defensive strategy that permits the ruling class to exist within their fractured selves. Save this thread. Memorize it. I’m offering you a deep psychological explanation of our times.”</p><p>Seth Rogen who had been tagged on Twitter regarding the latter, retorted as follows:</p><p><i>“I actually watched your video and it’s so stupid. Why was I a left wing socialist when I was broke and unemployed according to your brilliant theory?”</i></p><p>To which I replied:</p><p><i>“Thanks for watching. Many young people are socialists when they are driven by immature impulses of utopia. They then grow up. You are a grown man with tons of money. Your current stances are rooted in vacuous empty signalling rooted in a desire to belong in Hollywood. It takes zero courage to hold your stances within the entertainment ecosystem. You espouse bullshit rhetoric that wins you points at the cool kids’ parties but you are otherwise as ignorant as my out-of-order toaster. I’d be happy to chat with you on my show as you have a very large platform and as such you have the opportunity to actually make a difference. Stop succumbing to the herd mindset. Learn how to think critically. Learn the meaning and implications of socialism vs. capitalism. You are among the MOST privileged people in the history of humanity. And yet you walk around as though you are a Che Guevara revolutionary. You are the product of capitalism. If you are such a socialist, send me some of your money. I’m trying to build an interdisciplinary research institute. Live out your convictions. If you are a socialist, you have no business being the beneficiary of the most capitalist industry in the most capitalist country in the history of humanity. Don’t be a hypocritical fraud. Cheers amigo.”</i></p><p>In my recently released bestselling book <i>The Parasitic Mind: How Infectious Ideas Are Killing Common Sense</i>, I discuss the differences between virtue signalling and honest signalling. Here are two relevant excerpts from a section titled “Do Not Virtue-Signal”: </p><p>“Each time that a terrorist attack takes place in some Western city, nauseating hordes of cowards do one of two things: 1) Change their social media handles to the flag of the country that was attacked; 2) Share a hashtag on Twitter to signal their solidarity with a given cause (#JeSuisCharlie following the terror killings at the Charlie Hebdo offices in Paris; #BringBackOurGirls, made famous by Michelle Obama, in support of the Nigerian girls kidnapped by Boko Haram). Politicians seek to outdo one another in offering vacuous “heartfelt” condolences while in many cases continuing to enact policies that are directly responsible for the terror attacks in question. In the great majority of instances, these are utterly useless endeavors meant to do nothing but advertise one’s supposed virtue to the world (hence the term virtue-signaling). It is a form of cheap and costless self-aggrandizing that feeds one’s ego. I must be a good person who truly cares, as evidenced by my progressive hashtag. Nothing could be further from the truth. Those who engage in such platitudinous signaling are cowardly and meek.” (p. 178)</p><p>Later I added the following (pp. 180-181):</p><p>“During a highly publicized 2017 event held in Toronto, Oren Amitay, Jordan Peterson, and I were asked to identify our respective freedom of speech heroes. I responded that the ultimate heroes are those who risk their lives to defend such freedoms. I pointed to individuals from the Middle East (some of whom have been guests on my show) who are willing to defend these ideals knowing full well that they may pay the ultimate price. This is what having skin in the game looks like. This is costly virtue, not virtue-signaling. Over the past year or so, I have become good friends with Ensaf Haidar, the wife of jailed Saudi blogger Raif Badawi, and I had the pleasure of meeting her three lovely children at a dinner organized by the actor Mark Pellegrino and his wife. Raif is serving a ten-year prison sentence and was scheduled to receive one thousand lashes (“only” fifty of which have thus far been administered) for having the temerity to question, in a rather tepid manner, various religious and cultural realities in the region. Retweeting #JeSuisCharlie is impotent virtue-signaling; critiquing the Saudi regime from within Saudi Arabia is courage in action.”</p><p>Bottom line: In order for a signal to be an honest one, it must be handicapping; it must be costly to the one who emits the signal. Raif Badawi lived out his convictions. He engaged in costly signalling. Seth Rogen and other champagne socialists do not live out their convictions. They are vacuous parasitic virtue signallers who wear Che Guevara t-shirts from the luxury of their Malibu homes. Be the former and reject the latter.</p></div>",
  "content_text": "This is the article by Gad Saad condemning celebrity virtue-signalers\nthat was vanished\nby Psychology Today, most likely because it intellectually jiu-jitsued the historical communist tactic of medicalizing ideological opponents. Possibly also because he had the unseemly temerity to suggest that a celebrity actually read a book.\nBack in 2009, I authored an article on this platform titled\nThe Narcissism and Grandiosity of Celebrities\n.  Continuing this tradition, this past week on my social media platforms, I critiqued the virtue signalling that members of the privileged classes engage in. Here is what I wrote:\n“Let me explain yet again the source for all of the platitudinous virtue signalling. The truly privileged elites know that deep down they are frauds. They suffer from existential guilt. Hence, one of the ways by which they assuage the guilt albatross around their necks is to demonstrate to the world that they are truly compassionate, truly loving, truly caring, truly profound. Hence, they love all “undocumented” immigrants. They love Mother Earth. They love the ozone layer. They love BLM. They love socialism. They love inner cities. They hate the gentrification of neighbourhoods. They love mentors of color. They cherish diversity. They love LGBTQ movies. They adore queer architecture. They are better than you. More caring, more cultured, more empathetic. This permits them to sleep better at night. See, I’m not a fraud. I may be a gargantuan parasitic hedge fund bullshitter but I really care. I may be an overpaid BS actor but I fight for solar panels. Those fly over rubes deserve their lot in life. They are racists who bed their siblings. We are science supporters who fight against Mother Earth rapists whilst flying in our private jets. It is a classic ego defensive strategy that permits the ruling class to exist within their fractured selves. Save this thread. Memorize it. I’m offering you a deep psychological explanation of our times.”\nSeth Rogen who had been tagged on Twitter regarding the latter, retorted as follows:\n“I actually watched your video and it’s so stupid. Why was I a left wing socialist when I was broke and unemployed according to your brilliant theory?”\nTo which I replied:\n“Thanks for watching. Many young people are socialists when they are driven by immature impulses of utopia. They then grow up. You are a grown man with tons of money. Your current stances are rooted in vacuous empty signalling rooted in a desire to belong in Hollywood. It takes zero courage to hold your stances within the entertainment ecosystem. You espouse bullshit rhetoric that wins you points at the cool kids’ parties but you are otherwise as ignorant as my out-of-order toaster. I’d be happy to chat with you on my show as you have a very large platform and as such you have the opportunity to actually make a difference. Stop succumbing to the herd mindset. Learn how to think critically. Learn the meaning and implications of socialism vs. capitalism. You are among the MOST privileged people in the history of humanity. And yet you walk around as though you are a Che Guevara revolutionary. You are the product of capitalism. If you are such a socialist, send me some of your money. I’m trying to build an interdisciplinary research institute. Live out your convictions. If you are a socialist, you have no business being the beneficiary of the most capitalist industry in the most capitalist country in the history of humanity. Don’t be a hypocritical fraud. Cheers amigo.”\nIn my recently released bestselling book\nThe Parasitic Mind: How Infectious Ideas Are Killing Common Sense\n, I discuss the differences between virtue signalling and honest signalling. Here are two relevant excerpts from a section titled “Do Not Virtue-Signal”:\n“Each time that a terrorist attack takes place in some Western city, nauseating hordes of cowards do one of two things: 1) Change their social media handles to the flag of the country that was attacked; 2) Share a hashtag on Twitter to signal their solidarity with a given cause (#JeSuisCharlie following the terror killings at the Charlie Hebdo offices in Paris; #BringBackOurGirls, made famous by Michelle Obama, in support of the Nigerian girls kidnapped by Boko Haram). Politicians seek to outdo one another in offering vacuous “heartfelt” condolences while in many cases continuing to enact policies that are directly responsible for the terror attacks in question. In the great majority of instances, these are utterly useless endeavors meant to do nothing but advertise one’s supposed virtue to the world (hence the term virtue-signaling). It is a form of cheap and costless self-aggrandizing that feeds one’s ego. I must be a good person who truly cares, as evidenced by my progressive hashtag. Nothing could be further from the truth. Those who engage in such platitudinous signaling are cowardly and meek.” (p. 178)\nLater I added the following (pp. 180-181):\n“During a highly publicized 2017 event held in Toronto, Oren Amitay, Jordan Peterson, and I were asked to identify our respective freedom of speech heroes. I responded that the ultimate heroes are those who risk their lives to defend such freedoms. I pointed to individuals from the Middle East (some of whom have been guests on my show) who are willing to defend these ideals knowing full well that they may pay the ultimate price. This is what having skin in the game looks like. This is costly virtue, not virtue-signaling. Over the past year or so, I have become good friends with Ensaf Haidar, the wife of jailed Saudi blogger Raif Badawi, and I had the pleasure of meeting her three lovely children at a dinner organized by the actor Mark Pellegrino and his wife. Raif is serving a ten-year prison sentence and was scheduled to receive one thousand lashes (“only” fifty of which have thus far been administered) for having the temerity to question, in a rather tepid manner, various religious and cultural realities in the region. Retweeting #JeSuisCharlie is impotent virtue-signaling; critiquing the Saudi regime from within Saudi Arabia is courage in action.”\nBottom line: In order for a signal to be an honest one, it must be handicapping; it must be costly to the one who emits the signal. Raif Badawi lived out his convictions. He engaged in costly signalling. Seth Rogen and other champagne socialists do not live out their convictions. They are vacuous parasitic virtue signallers who wear Che Guevara t-shirts from the luxury of their Malibu homes. Be the former and reject the latter.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-02-08T13:00:05+00:00"
}