{
  "url": "https://voxday.net/2021/02/09/the-end-of-instapundit/",
  "scraped_at": "2025-12-21T22:37:06.402571",
  "title": "The end of Instapundit",
  "date_display": "February 9, 2021",
  "date_iso": "2021-02-09T13:25:47+00:00",
  "date_from_url": "2021-02-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s genuinely tragic to observe <a href=\"https://pjmedia.com/instapundit/431009/\" rel=\"noopener\" target=\"_blank\">the ongoing decline of Instapundit into irrelevance</a>. Glenn is a smart man who made a suboptimal, but understandable decision to get involved with a petty wannabe media tycoon when Roger Simon launched Pajamas Media, mostly on the back of Instapundit’s popularity. The real problem is that Glenn exacerbated that poor decision with the horrendous one to give the execrable Ed Driscoll and the equally ridiculous Stephen Green posting privileges there for reasons that remain an utter mystery.</p><p>While I’m grateful to Glenn and Helen for supporting Castalia House in the early years by posting links to our new book releases, I first stopped reading there, and then actually removed my links to their site some time ago due to the incessant judeosatanist propaganda being relentlessly pushed by Driscoll and Green there. And now it’s evident that more than a few of Instapundit’s readers feel the same way.</p><blockquote><p>Sheesh, reading some of these comments I wonder why I even bother with this place. Then again, that’s probably the aim.</p></blockquote><p>No, Glenn, it’s the exact opposite of the aim. Listen to what your fans and supporters are telling you! Your site simply sucks now. Plain and simple. It’s literally unreadable, what with all the non-stop neoconnery and Never-Trumpism, to the point that it’s actually hard to distinguish it from <i>National Review</i>. It isn’t trolls who are hammering you, it is your longtime readers who dislike what you permitted Instapundit to become. They don’t want you to quit. They desperately want you to kick out Driscoll, Green, and Treacher and get back to doing what you once did better than everyone else.</p><ul style=\"text-align: left;\"><li><i>“This place?” It’s YOUR place, remember? You built it. It seems like you sold off most of it to Driscoll, but despite some disagreements we may have, you’re an important voice. It’s sad that you only get paid on amazon clicks now. You deserve better.</i></li><li><i>This is beneath a man of your integrity. You associate your site with men of low character (Treacher), your partner (Driscoll) ignores good faith criticism of that, and then you wonder why your rep is taking a hit? Are you intending to treat your audience with disdain and contempt? Because that is how it is coming across to me, and I have read you (and Ace) almost every day for the last 20 years. You are just going to continue to ignore people like me? Loyal readers. Turn sheepdogs into wolves?</i></li></ul><p>Partner? Sold off? Interesting. If it is true that Glenn permitted Driscoll to “invest” in Instapundit, that would certainly explain its ongoing, and inevitable, decline.</p></div>",
  "content_text": "It’s genuinely tragic to observe\nthe ongoing decline of Instapundit into irrelevance\n. Glenn is a smart man who made a suboptimal, but understandable decision to get involved with a petty wannabe media tycoon when Roger Simon launched Pajamas Media, mostly on the back of Instapundit’s popularity. The real problem is that Glenn exacerbated that poor decision with the horrendous one to give the execrable Ed Driscoll and the equally ridiculous Stephen Green posting privileges there for reasons that remain an utter mystery.\nWhile I’m grateful to Glenn and Helen for supporting Castalia House in the early years by posting links to our new book releases, I first stopped reading there, and then actually removed my links to their site some time ago due to the incessant judeosatanist propaganda being relentlessly pushed by Driscoll and Green there. And now it’s evident that more than a few of Instapundit’s readers feel the same way.\nSheesh, reading some of these comments I wonder why I even bother with this place. Then again, that’s probably the aim.\nNo, Glenn, it’s the exact opposite of the aim. Listen to what your fans and supporters are telling you! Your site simply sucks now. Plain and simple. It’s literally unreadable, what with all the non-stop neoconnery and Never-Trumpism, to the point that it’s actually hard to distinguish it from\nNational Review\n. It isn’t trolls who are hammering you, it is your longtime readers who dislike what you permitted Instapundit to become. They don’t want you to quit. They desperately want you to kick out Driscoll, Green, and Treacher and get back to doing what you once did better than everyone else.\n“This place?” It’s YOUR place, remember? You built it. It seems like you sold off most of it to Driscoll, but despite some disagreements we may have, you’re an important voice. It’s sad that you only get paid on amazon clicks now. You deserve better.\nThis is beneath a man of your integrity. You associate your site with men of low character (Treacher), your partner (Driscoll) ignores good faith criticism of that, and then you wonder why your rep is taking a hit? Are you intending to treat your audience with disdain and contempt? Because that is how it is coming across to me, and I have read you (and Ace) almost every day for the last 20 years. You are just going to continue to ignore people like me? Loyal readers. Turn sheepdogs into wolves?\nPartner? Sold off? Interesting. If it is true that Glenn permitted Driscoll to “invest” in Instapundit, that would certainly explain its ongoing, and inevitable, decline.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-02-09T13:25:47+00:00"
}