{
  "url": "https://voxday.net/2021/02/24/the-antifragile-threat/",
  "scraped_at": "2025-12-21T22:38:59.082402",
  "title": "The antifragile threat",
  "date_display": "February 24, 2021",
  "date_iso": "2021-02-24T23:02:36+00:00",
  "date_from_url": "2021-02-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always a good idea to keep up on <a href=\"https://www.militarystrategymagazine.com/article/antifragile-adversaries-how-to-defeat-them/\" rel=\"noopener\" target=\"_blank\">the latest ideas</a> being produced by the system strategists, especially since some of them are likely to be applied to us in due course.</p><blockquote><p>Any useful categorization of adversaries cuts to the essence of strategy, to the utility of violent interaction. Strategy is about the purposeful use made of violent engagements with the adversary. The purpose of strategy is to decrease the adversary’s military capabilities or his will to fight. Strategic performance, in its consequences, determines whether the purpose is achieved. Therefore, the effects produced by strategic performance are what matters the most in strategy. These effects may vary in three directions. They can decrease the adversary’s capability/will to fight, leave these variables unchanged or increase them. A proper categorization of adversaries helps the strategist orient himself in the logic of these three scenarios.</p><p>The main goal here is to develop a new typology of adversaries and to zoom in on those who get stronger when engaged in strategic performance. The paper draws upon the concept of antifragility, popularized by Nassim Nicholas Taleb in his book <i>Anti-fragile: The Things That Gain from Disorder</i>. I argue that depending on their reaction to strategic performance, adversaries can be put on a spectrum from fragile to resilient, to antifragile ones. To keep the scope of the investigation reasonably limited, the paper focuses on the effects of strategic performance on the adversary’s military capabilities rather on his will to fight. The first category describes the adversaries whose military capabilities shrink as a consequence of engaging in strategic performance. The second category is reserved for those adversaries who are able to replenish their military capabilities to the original position after engaging in strategic performance. The last category describes those adversaries whose military capabilities increase as a consequence of taking part in strategic performance. These are, of course, ideal types and their manifestations in strategic practice are less clear-cut.</p><p>Antifragile adversaries pose a particular, but not unsolvable, challenge. The challenge resides in the fact that attrition, the most common effect in strategic practice, strengthens these adversaries instead of weakening them. Nonetheless, there are four distinct ways to defeat antifragile adversaries. These include rapid sequential strategies, strategies of decisive battle, cumulative strategies of underwhelming attacks, and the deliberate uses of peace. The secondary argument of this paper is that antifragility in the context of strategy is as much a function of the adversary’s capacity to adapt as of strategist’s own conduct of strategy. Strategist is responsible for the character of the adversary, he shapes it by his own choices and performance. Antifragility is therefore not an inherent nor a stable characteristic but rather a quality which the adversary acquires temporarily and in an interactive relationship.</p><p><b>The things that gain from disorder</b></p><p>Taleb coined the term antifragile in order to describe phenomena that are at the opposite spectrum of the fragile ones. When facing challenges, fragile objects get damaged or collapse completely. A typical example is anything made of regular glass. When thrown against the wall it breaks and is of no use for anyone. Then there are resilient objects, which can sustain challenges with no permanent damage taken. An inflatable ball thrown against the wall may slightly change its shape for a second only to return to the original form in the next moment, with no impact on its utility for the future.</p><p>Antifragile objects benefit from facing challenges. Bones have to be challenged regularly in order to get stronger and muscles only grow when repeatedly damaged. In fact, both bones and muscles get weak if unchallenged for longer periods of time. Two key requirements need to be present for the manifestation of the anti-fragile potential. First, the challenges have to be proportionate to the capacities of the object. Jumping from places that are too high may be an overwhelming challenge for bones and lifting stuff that is too heavy may irreversibly damage muscles. At the same time, challenges far below the capacity of the object may result in having no effect at all. A professional bodybuilder lifting weights of one kilogram every-day does not benefit from this exercise. Second, enough time has to pass between individual challenges to grant the object the space for improvement.[v] With no time to grow stronger, both bones and muscles deteriorate under constant pressure. Antifragility is therefore as much a function of the inherent predispositions of the object as it is of the character of the challenges the object faces.</p><p>The third ideal type is the antifragile adversary. For this one, strategic performance serves as a stimulus for the growth in his military capabilities. This happens when the adversary with antifragile predispositions faces regular challenges appropriate to his current capabilities. Of course, what is “regular” and “appropriate” is context dependent. Antifragile adversaries are less common in strategic history. This is so because they manifest themselves only in instances when their predispositions match with the favourable character of the strategist’s attacks. One historical example that comes close to the ideal type were the Thebans in their wars against the Spartans (395-362 B.C.). The two polities fought each other regularly during the first half of the fourth century. The continual engagement in strategic performance made Theban forces stronger from one major battle to another. Though first suffering a defeat at Nemea (394 B.C.), Thebans fought Spartans to a standstill at Coronea (394 B.C.), routed them at Tegyra (375 B.C.), and slaughtered them at Leuctra (371 B.C.) and Mantinea (362 B.C.).[vi] Over the course of the wars, Thebans enjoyed gradually increasing morale, explored innovative echelon tactics and developed new kinds of military units. Therefore, by their own efforts as well by the repeated violent interaction with the Spartans, the Thebans fulfilled their anti-fragile potential. Seeing this development in practice, one Spartan sarcastically congratulated his own king that by the repeated attacks against Thebes, he had taught his adversary how to fight. Antifragile adversaries are not an artefact of a distant past. In fact, as David Betz and Hugo Stanford-Tuck argue in their recent piece, even the contemporary West has often pursued a way of war “which through one’s own efforts leaves the enemy stronger at the end than at the beginning.” Antifragile adversaries are universal and so is the unique challenge they pose.</p><p>The main challenge in facing antifragile adversaries is that what does not kill them makes them stronger. This is a bit of exaggeration, but in general it does apply. To start with, most strategies seeking to attrite that adversary do not work. Worse, these strategies work for the antifragile adversaries. Actively seeking out the antifragile adversary and trying to attrite his military capabilities by frequent engagements is a reliable receipt for making him stronger. This may not seem like a big deal when the other strategies are available. The problem is, most of the other strategies eventually turn into some sort of attrition contest as well. Strategists too often envision quick and decisive wars of annihilation and get prolonged wars of attrition instead. Others, who start out with terrorist attacks and guerrilla raids, turn to attrition once they develop sufficient military capabilities to have a reasonable chance of success. Not all the strategic options lead to attrition but too many of them do. It follows that most options for dealing with the antifragile adversaries convey high risks of failure. </p></blockquote><p>The battle of the 72 Bears with Patreon is a classic example of an antifragile adversary vs a resilient adversary. The Bears have antifragility on their side; the LLOE is getting stronger as more lawyers take up the cause and they become better versed in the arbitratry vagaries of arbitration and the California court system. As Sparta did with Thebes, Patreon’s lawyers are literally teaching the LLOE how to defeat them. Patreon, on the other hand, has significant, but finite resources that are being continuously drained at an increasing rate. The eventual outcome is obvious to any strategic observer, since the Bears haven’t even needed to tap into the massive human resources that are available to them while Patreon is conservatively estimated to have already spent more than one-half of its annual revenue on the dispute.</p><p>Physicists know the harsh truth: math always wins in the end.</p><p>But it is interesting to note that antifragility has become a serious concern to the system strategists. I’ll analyse the proposed strategy for defeating antifragility in a future post.</p></div>",
  "content_text": "It’s always a good idea to keep up on\nthe latest ideas\nbeing produced by the system strategists, especially since some of them are likely to be applied to us in due course.\nAny useful categorization of adversaries cuts to the essence of strategy, to the utility of violent interaction. Strategy is about the purposeful use made of violent engagements with the adversary. The purpose of strategy is to decrease the adversary’s military capabilities or his will to fight. Strategic performance, in its consequences, determines whether the purpose is achieved. Therefore, the effects produced by strategic performance are what matters the most in strategy. These effects may vary in three directions. They can decrease the adversary’s capability/will to fight, leave these variables unchanged or increase them. A proper categorization of adversaries helps the strategist orient himself in the logic of these three scenarios.\nThe main goal here is to develop a new typology of adversaries and to zoom in on those who get stronger when engaged in strategic performance. The paper draws upon the concept of antifragility, popularized by Nassim Nicholas Taleb in his book\nAnti-fragile: The Things That Gain from Disorder\n. I argue that depending on their reaction to strategic performance, adversaries can be put on a spectrum from fragile to resilient, to antifragile ones. To keep the scope of the investigation reasonably limited, the paper focuses on the effects of strategic performance on the adversary’s military capabilities rather on his will to fight. The first category describes the adversaries whose military capabilities shrink as a consequence of engaging in strategic performance. The second category is reserved for those adversaries who are able to replenish their military capabilities to the original position after engaging in strategic performance. The last category describes those adversaries whose military capabilities increase as a consequence of taking part in strategic performance. These are, of course, ideal types and their manifestations in strategic practice are less clear-cut.\nAntifragile adversaries pose a particular, but not unsolvable, challenge. The challenge resides in the fact that attrition, the most common effect in strategic practice, strengthens these adversaries instead of weakening them. Nonetheless, there are four distinct ways to defeat antifragile adversaries. These include rapid sequential strategies, strategies of decisive battle, cumulative strategies of underwhelming attacks, and the deliberate uses of peace. The secondary argument of this paper is that antifragility in the context of strategy is as much a function of the adversary’s capacity to adapt as of strategist’s own conduct of strategy. Strategist is responsible for the character of the adversary, he shapes it by his own choices and performance. Antifragility is therefore not an inherent nor a stable characteristic but rather a quality which the adversary acquires temporarily and in an interactive relationship.\nThe things that gain from disorder\nTaleb coined the term antifragile in order to describe phenomena that are at the opposite spectrum of the fragile ones. When facing challenges, fragile objects get damaged or collapse completely. A typical example is anything made of regular glass. When thrown against the wall it breaks and is of no use for anyone. Then there are resilient objects, which can sustain challenges with no permanent damage taken. An inflatable ball thrown against the wall may slightly change its shape for a second only to return to the original form in the next moment, with no impact on its utility for the future.\nAntifragile objects benefit from facing challenges. Bones have to be challenged regularly in order to get stronger and muscles only grow when repeatedly damaged. In fact, both bones and muscles get weak if unchallenged for longer periods of time. Two key requirements need to be present for the manifestation of the anti-fragile potential. First, the challenges have to be proportionate to the capacities of the object. Jumping from places that are too high may be an overwhelming challenge for bones and lifting stuff that is too heavy may irreversibly damage muscles. At the same time, challenges far below the capacity of the object may result in having no effect at all. A professional bodybuilder lifting weights of one kilogram every-day does not benefit from this exercise. Second, enough time has to pass between individual challenges to grant the object the space for improvement.[v] With no time to grow stronger, both bones and muscles deteriorate under constant pressure. Antifragility is therefore as much a function of the inherent predispositions of the object as it is of the character of the challenges the object faces.\nThe third ideal type is the antifragile adversary. For this one, strategic performance serves as a stimulus for the growth in his military capabilities. This happens when the adversary with antifragile predispositions faces regular challenges appropriate to his current capabilities. Of course, what is “regular” and “appropriate” is context dependent. Antifragile adversaries are less common in strategic history. This is so because they manifest themselves only in instances when their predispositions match with the favourable character of the strategist’s attacks. One historical example that comes close to the ideal type were the Thebans in their wars against the Spartans (395-362 B.C.). The two polities fought each other regularly during the first half of the fourth century. The continual engagement in strategic performance made Theban forces stronger from one major battle to another. Though first suffering a defeat at Nemea (394 B.C.), Thebans fought Spartans to a standstill at Coronea (394 B.C.), routed them at Tegyra (375 B.C.), and slaughtered them at Leuctra (371 B.C.) and Mantinea (362 B.C.).[vi] Over the course of the wars, Thebans enjoyed gradually increasing morale, explored innovative echelon tactics and developed new kinds of military units. Therefore, by their own efforts as well by the repeated violent interaction with the Spartans, the Thebans fulfilled their anti-fragile potential. Seeing this development in practice, one Spartan sarcastically congratulated his own king that by the repeated attacks against Thebes, he had taught his adversary how to fight. Antifragile adversaries are not an artefact of a distant past. In fact, as David Betz and Hugo Stanford-Tuck argue in their recent piece, even the contemporary West has often pursued a way of war “which through one’s own efforts leaves the enemy stronger at the end than at the beginning.” Antifragile adversaries are universal and so is the unique challenge they pose.\nThe main challenge in facing antifragile adversaries is that what does not kill them makes them stronger. This is a bit of exaggeration, but in general it does apply. To start with, most strategies seeking to attrite that adversary do not work. Worse, these strategies work for the antifragile adversaries. Actively seeking out the antifragile adversary and trying to attrite his military capabilities by frequent engagements is a reliable receipt for making him stronger. This may not seem like a big deal when the other strategies are available. The problem is, most of the other strategies eventually turn into some sort of attrition contest as well. Strategists too often envision quick and decisive wars of annihilation and get prolonged wars of attrition instead. Others, who start out with terrorist attacks and guerrilla raids, turn to attrition once they develop sufficient military capabilities to have a reasonable chance of success. Not all the strategic options lead to attrition but too many of them do. It follows that most options for dealing with the antifragile adversaries convey high risks of failure.\nThe battle of the 72 Bears with Patreon is a classic example of an antifragile adversary vs a resilient adversary. The Bears have antifragility on their side; the LLOE is getting stronger as more lawyers take up the cause and they become better versed in the arbitratry vagaries of arbitration and the California court system. As Sparta did with Thebes, Patreon’s lawyers are literally teaching the LLOE how to defeat them. Patreon, on the other hand, has significant, but finite resources that are being continuously drained at an increasing rate. The eventual outcome is obvious to any strategic observer, since the Bears haven’t even needed to tap into the massive human resources that are available to them while Patreon is conservatively estimated to have already spent more than one-half of its annual revenue on the dispute.\nPhysicists know the harsh truth: math always wins in the end.\nBut it is interesting to note that antifragility has become a serious concern to the system strategists. I’ll analyse the proposed strategy for defeating antifragility in a future post.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-02-24T23:02:36+00:00"
}