{
  "url": "https://voxday.net/2021/02/23/the-con-mans-escape/",
  "scraped_at": "2025-12-21T22:38:48.073565",
  "title": "The con man’s escape",
  "date_display": "February 23, 2021",
  "date_iso": "2021-02-23T15:24:39+00:00",
  "date_from_url": "2021-02-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you don’t understand how Rush Limbaugh was a gatekeeper and a deceiver rather than the fearless pursuer of truth that he publicly affected to be, <a href=\"https://archive.vn/0cIrI#selection-973.0-1035.30\" rel=\"noopener\" target=\"_blank\">consider this Clinton-era exchange</a> from his radio program. Pay particular attention to the way he generates a way to extricate himself from the discussion in a manner designed to discredit the caller:</p><blockquote><p>Larry: The point- well, I don’t know if he committed suicide or not, but I know we haven’t been told the truth, and you always say you’re in relentless pursuit of the truth, but not on the this issue you’re not. You ducked this issue. You do not pursue the truth here. That’s a fact. We’ve not been told the truth, and that’s the fact, too. You can read the Fiske report and see that it’s full of errors. Have you read the Fiske report?</p><p>Limbaugh: I- yeah- well, no, but I.</p><p>Larry: Well then, you’re not in pursuit of the truth.</p><p>Limbaugh: ..but, I-, I- so, what we have here, you are—</p><p>Larry: You’re not informed.</p><p>Limbaugh; …you are not, as- as Mr. Snerdley thought, a Clinton supporter.</p><p>Larry: Well, I think Clinton’s going to be re-elected.</p><p>Limbaugh: No, no, no. Did you tell him you were a Clinton supporter..</p><p>Larry Yes. I, yeah, I… (Limbaugh dumped his telephonic tormentor.)</p><p>Limbaugh: Well, so you lied, Larry. So, when you tell one lie, all of what you say is worthless. That’s the mantra, today. So sir, you’re not going to be rewarded by saying- you don’t have to lie to get on this program. If you are in the pursuit of Vince Foster being murdered, get your own show, and you go out and pursue it as best you- as best you can, but don’t lie to get on this program, to accuse me of malfeasance, or some- some sort of incompetence, as host.</p></blockquote><p>If we are to judge Limbaugh by his own standard, everything he ever said was worthless. First, that’s a ridiculous standard. Second, how would Larry’s preference for Clinton or Dole make any difference whatsoever with regards to the subject being discussed? Limbaugh was merely casting about for an excuse to extricate himself from a position that was discrediting him, which is exactly what con men do. Notice how he suddenly becomes much more smooth and eloquent once he has established his rhetorical escape route.</p><p>Beware the man who always uses the word “because” to rationalize his words and deeds. An honest man is content to state his position. The dishonest man always has to sell you on whatever it happens to be at the moment.</p><p>Now, I don’t care about Rush Limbaugh and a perusal of the blog archives will demonstrate that I never have. But as Sam Harris and Jordan Peterson fans can confirm, one of the most effective ways to focus my baleful gaze on an individual or a concept about which I am otherwise indifferent is to dispute my casual comments on the subject. So, if you’re a big fan of Rush, I would recommend that you don’t try too hard to defend him here.</p><p><b>UPDATE: </b>I am far too busy to even begin doing the research that would be necessary to write such a book. And Rush is no longer even potentially relevant, for obvious reasons. Therefore, I will happily leave the task to some other writer.</p></div>",
  "content_text": "If you don’t understand how Rush Limbaugh was a gatekeeper and a deceiver rather than the fearless pursuer of truth that he publicly affected to be,\nconsider this Clinton-era exchange\nfrom his radio program. Pay particular attention to the way he generates a way to extricate himself from the discussion in a manner designed to discredit the caller:\nLarry: The point- well, I don’t know if he committed suicide or not, but I know we haven’t been told the truth, and you always say you’re in relentless pursuit of the truth, but not on the this issue you’re not. You ducked this issue. You do not pursue the truth here. That’s a fact. We’ve not been told the truth, and that’s the fact, too. You can read the Fiske report and see that it’s full of errors. Have you read the Fiske report?\nLimbaugh: I- yeah- well, no, but I.\nLarry: Well then, you’re not in pursuit of the truth.\nLimbaugh: ..but, I-, I- so, what we have here, you are—\nLarry: You’re not informed.\nLimbaugh; …you are not, as- as Mr. Snerdley thought, a Clinton supporter.\nLarry: Well, I think Clinton’s going to be re-elected.\nLimbaugh: No, no, no. Did you tell him you were a Clinton supporter..\nLarry Yes. I, yeah, I… (Limbaugh dumped his telephonic tormentor.)\nLimbaugh: Well, so you lied, Larry. So, when you tell one lie, all of what you say is worthless. That’s the mantra, today. So sir, you’re not going to be rewarded by saying- you don’t have to lie to get on this program. If you are in the pursuit of Vince Foster being murdered, get your own show, and you go out and pursue it as best you- as best you can, but don’t lie to get on this program, to accuse me of malfeasance, or some- some sort of incompetence, as host.\nIf we are to judge Limbaugh by his own standard, everything he ever said was worthless. First, that’s a ridiculous standard. Second, how would Larry’s preference for Clinton or Dole make any difference whatsoever with regards to the subject being discussed? Limbaugh was merely casting about for an excuse to extricate himself from a position that was discrediting him, which is exactly what con men do. Notice how he suddenly becomes much more smooth and eloquent once he has established his rhetorical escape route.\nBeware the man who always uses the word “because” to rationalize his words and deeds. An honest man is content to state his position. The dishonest man always has to sell you on whatever it happens to be at the moment.\nNow, I don’t care about Rush Limbaugh and a perusal of the blog archives will demonstrate that I never have. But as Sam Harris and Jordan Peterson fans can confirm, one of the most effective ways to focus my baleful gaze on an individual or a concept about which I am otherwise indifferent is to dispute my casual comments on the subject. So, if you’re a big fan of Rush, I would recommend that you don’t try too hard to defend him here.\nUPDATE:\nI am far too busy to even begin doing the research that would be necessary to write such a book. And Rush is no longer even potentially relevant, for obvious reasons. Therefore, I will happily leave the task to some other writer.",
  "tags": [
    "rhetoric"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-02-23T15:24:39+00:00"
}