{
  "url": "https://voxday.net/2021/02/04/they-never-learn-3/",
  "scraped_at": "2025-12-21T22:36:35.939964",
  "title": "They never learn",
  "date_display": "February 4, 2021",
  "date_iso": "2021-02-04T17:36:35+00:00",
  "date_from_url": "2021-02-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not terribly difficult to understand why US imperialists find it impossible to learn the vital lesson of sinking the ships and keeping the immigrants and refugees out in light of the fact that the Roman imperialists didn’t learn it a scant six years after the Goths killed the Emperor Valens, who had given them refuge from the Huns, on the battlefield of Adrianople. From <i>The Day of the Barbarians</i>:</p><blockquote><p>The rhetorician Themistius, who a few years earlier had publicly congratulated Valens for making peace with the Goths, was charged with delivering an encomium in honor of Saturninus. In this oration, humanitarian rhetoric encountered before can be heard to vibrate anew, as if nothing had changed. Themistius lauded the government for having found a political solution to the problem, for receiving the Goths in peace instead of trying to annihilate them: “Philanthropy has prevailed over destruction. Would it perhaps have been better to fill Thrace with corpses instead of farmers? The barbarians are already transforming their weapons into hoes and sickles and cultivating the fields.” This was the ideology of the “melting pot,” viewing the barbarians as destined to be integrated into the empire as so many had been admitted in the past. Their descendants, Themistius said, “can’t be called barbarians; for all intents and purposes, they’re Romans. They pay the same taxes we do, they serve with us in the army, they’re governed in the same way and subject to the same laws. And before long, the same thing will happen with the Goths.”</p><p>In practice, Theodosius’s solution to the Gothic problem had been in the air for a long time and more than once had been on the point of implementation before going awry. Valens had let the Goths into the empire with the idea of enlisting them in the army, and although the inefficiency and corruption that characterized the military authorities’ treatment of the refugees had driven them to rebellion, Valens had always remained open to the prospect of a negotiated peace; indeed, just a few hours before being killed at Adrianople, the emperor had been involved in discussions with Fritigern’s envoys, trying to find a solution. In 382, Theodosius did exactly what could have been done six years before, though he could not easily cancel out everything that had happened in the interval—the years of pillaging and atrocities, the destruction of an army, the death of an emperor, and the siege of the imperial capital. After Adrianople, enrolling Gothic warriors in the imperial army was much more difficult, as was explaining to the civilian population that the Goths were really just refugees, people who should receive humane treatment, a useful workforce.</p><p>And yet the ruling classes of the empire gave this a try, and one can either admire their goodwill or be astonished by their cynicism. To the politicians who collaborated with Theodosius, the acceptance of the Goths, despite everything that had happened, posed no problem at all; official speeches and the verses of the court poets all harped on the same string. A Gaulish rhetorician, Pacatus, enthused over all the new Roman soldiers, barbarians, yes, but so willing to learn: “O wonderful and memorable! Those who once had been enemies of Rome, now marching under Roman commanders and Roman banners, following the standards they used to fight against, filling as soldiers the cities they had formerly emptied and devastated as enemies. The Goth, the Hun, and the Alan, learning to express themselves according to the rules and taking their turn on guard duty and fearful of being criticized in their officers’ reports.” The tale of the barbarian who throws away his animal skins and learns to dress like a civilized person and obey orders and observe discipline was told again and again by the authors of Theodosius’s time, and the implication was clear: Exchanging those bestial clothes for garb befitting a citizen and learning to live according to the rules made one a Roman. All the rhetoric about the universality of the empire, about its capacity for assimilation, was trotted out to demonstrate that Theodosius had made the right choice.</p></blockquote><p>The Italian author, the historian Alessandro Barbero, observes that “it wasn’t all empty rhetoric; to a certain degree, that capacity for assimilation genuinely existed. The empire really was absorbing the barbarians, even though, as it did so, it inevitably changed.”</p><p>Of course, the wisdom and success of that absorption can be questioned by the fact that a Goth named Flavius Alaricus was named <i>magister militum</i> and given command of all the Roman troops in lllyricum. You probably know him better as Alaric the Goth, as ten years later, he sacked Rome.</p></div>",
  "content_text": "It’s not terribly difficult to understand why US imperialists find it impossible to learn the vital lesson of sinking the ships and keeping the immigrants and refugees out in light of the fact that the Roman imperialists didn’t learn it a scant six years after the Goths killed the Emperor Valens, who had given them refuge from the Huns, on the battlefield of Adrianople. From\nThe Day of the Barbarians\n:\nThe rhetorician Themistius, who a few years earlier had publicly congratulated Valens for making peace with the Goths, was charged with delivering an encomium in honor of Saturninus. In this oration, humanitarian rhetoric encountered before can be heard to vibrate anew, as if nothing had changed. Themistius lauded the government for having found a political solution to the problem, for receiving the Goths in peace instead of trying to annihilate them: “Philanthropy has prevailed over destruction. Would it perhaps have been better to fill Thrace with corpses instead of farmers? The barbarians are already transforming their weapons into hoes and sickles and cultivating the fields.” This was the ideology of the “melting pot,” viewing the barbarians as destined to be integrated into the empire as so many had been admitted in the past. Their descendants, Themistius said, “can’t be called barbarians; for all intents and purposes, they’re Romans. They pay the same taxes we do, they serve with us in the army, they’re governed in the same way and subject to the same laws. And before long, the same thing will happen with the Goths.”\nIn practice, Theodosius’s solution to the Gothic problem had been in the air for a long time and more than once had been on the point of implementation before going awry. Valens had let the Goths into the empire with the idea of enlisting them in the army, and although the inefficiency and corruption that characterized the military authorities’ treatment of the refugees had driven them to rebellion, Valens had always remained open to the prospect of a negotiated peace; indeed, just a few hours before being killed at Adrianople, the emperor had been involved in discussions with Fritigern’s envoys, trying to find a solution. In 382, Theodosius did exactly what could have been done six years before, though he could not easily cancel out everything that had happened in the interval—the years of pillaging and atrocities, the destruction of an army, the death of an emperor, and the siege of the imperial capital. After Adrianople, enrolling Gothic warriors in the imperial army was much more difficult, as was explaining to the civilian population that the Goths were really just refugees, people who should receive humane treatment, a useful workforce.\nAnd yet the ruling classes of the empire gave this a try, and one can either admire their goodwill or be astonished by their cynicism. To the politicians who collaborated with Theodosius, the acceptance of the Goths, despite everything that had happened, posed no problem at all; official speeches and the verses of the court poets all harped on the same string. A Gaulish rhetorician, Pacatus, enthused over all the new Roman soldiers, barbarians, yes, but so willing to learn: “O wonderful and memorable! Those who once had been enemies of Rome, now marching under Roman commanders and Roman banners, following the standards they used to fight against, filling as soldiers the cities they had formerly emptied and devastated as enemies. The Goth, the Hun, and the Alan, learning to express themselves according to the rules and taking their turn on guard duty and fearful of being criticized in their officers’ reports.” The tale of the barbarian who throws away his animal skins and learns to dress like a civilized person and obey orders and observe discipline was told again and again by the authors of Theodosius’s time, and the implication was clear: Exchanging those bestial clothes for garb befitting a citizen and learning to live according to the rules made one a Roman. All the rhetoric about the universality of the empire, about its capacity for assimilation, was trotted out to demonstrate that Theodosius had made the right choice.\nThe Italian author, the historian Alessandro Barbero, observes that “it wasn’t all empty rhetoric; to a certain degree, that capacity for assimilation genuinely existed. The empire really was absorbing the barbarians, even though, as it did so, it inevitably changed.”\nOf course, the wisdom and success of that absorption can be questioned by the fact that a Goth named Flavius Alaricus was named\nmagister militum\nand given command of all the Roman troops in lllyricum. You probably know him better as Alaric the Goth, as ten years later, he sacked Rome.",
  "tags": [
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2021-02-04T17:36:35+00:00"
}