{
  "url": "https://voxday.net/2024/05/06/a-physicist-endorses-mittens/",
  "scraped_at": "2026-01-08T14:31:44.866934",
  "title": "A Physicist Endorses MITTENS",
  "date_display": "May 6, 2024",
  "date_iso": "2024-05-06T13:26:44+00:00",
  "date_from_url": "2024-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Your MITTENS Theorem is of course valid, and more precise and detailed than was possible for the physicists in 1966. You have also independently proposed the correct, and only possible alternative to Neo-Darwinism, what you termed IGM in your <a href=\"https://voxday.net/2012/10/14/mailvox-alternative-mechanis/\">October 14, 2012 blog post</a>. You should repost this mechanism, together with more discussion. This mechanism has been repeatedly rediscovered since the famous 19th century Harvard biologist Asa Gray first proposed it, correctly identifying God, not intelligent aliens, as the agent. Charles Darwin himself denounced Gray’s version of your theory, which is less precise than your version.</em><br/>– Dr. Frank Tipler, Professor of Mathematics and Physics, Tulane University</p><p>I had no idea what he was talking about until I looked up the post. It turns out that IGM stands for Intelligent Genetic Manipulation, which is a mechanism I developed in response to four points put forth to me by one of the more reasonable Neo-Darwinians.</p><ol class=\"wp-block-list\"><li><em>Let us take as evidentially established the fact that species which existed in the past now exist no longer and are extinct.</em></li><li><em>Let us take as evidentially established the fact that not all species now extant existed at all times throughout the history of organic life.</em></li><li><em>Therefore, it must be possible for species which did not exist to come into existence by some mechanism, just as species which do exist can go extinct by any variety of mechanisms.</em></li><li><em>If it is a fact that new species can come into existence while others go extinct, by what mechanism other than evolution through natural selection are these species proposed to arise, and does that proposed mechanism explain more of the observed evidence than TeNS?</em></li></ol><p>I more or less concurred with the first three points, and in response to the fourth, proposed Intelligent Genetic Manipulation as a mechanism that not only explains more of the observed evidence than TeNS, but unlike TeNS, remains potentially valid because it has not been mathematically ruled out by MITTENS. Please keep in mind that this was written 12 years ago, long before some of the significant advances in the various genome projects which are far more consistent with intelligent genetic manipulation than with the Theorum of Evolution by (probably) Natural Selection, Biased Mutation, Genetic Drift, and Gene Flow, or TE(p)NSBMGDaGF, as it is properly identified in its full epicycular form.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Intelligent Genetic Manipulation is the mechanism that I propose. And yes, I believe that explains more of the observed evidence than TENS, since IGM is a scientific proposition, a readily observed action, and a successful predictive model, whereas TENS is a philosophical proposition, an unobserved process, and an unsuccessful predictive model.</p><p>Now, this does not provide any basis for assuming the existence of a Creator God, or even declaring that TENS did not actually take place. The logical fact of the matter is that even if TENS can be conclusively demonstrated to have taken place in various species, which has not happened despite more than 150 years of trying, that doesn’t necessarily mean the process was sufficient to produce Man. If one contemplates the biological differences between ape and man, the vast leap in cognitive capacity taking place in a relatively small sum of generational cycles from the proposed common ancestor in comparison with the timelines supposedly required for other, less complicated evolutionary changes, the logic suggests – though it does not prove – that some degree of purposeful genetic manipulation has likely taken place at various points in the origin of the species and the development of <em>homo sapiens sapiens</em>.</p><p>I’m not talking about Intelligent Design, but rather intelligent editing. And the interesting thing is that IGM should be an increasingly falsifiable concept as genetic science continues to improve. Only recently have we learned that junk DNA serves a purpose; even though we have sequenced various genomes, we haven’t yet understood how the code works or fully comprehended the various ways it can be manipulated. As our understanding grows, we should be able to develop an ability to recognize patterns that indicate purposeful alterations in the code have been made.</p> <cite>An Alternative Mechanism, 12 October 2012</cite></blockquote><p>Twelve years later, it is now clear that IGM is superior to the Theorum of Evolution by (probably) Natural Selection, Biased Mutation, Genetic Drift, and Gene Flow in every single way. It is not only not mathematically impossible, we know for certain it is possible because we already engage in purposeful genetic manipulation ourselves. IGM is not a philosophical tautology, it is an eminently falsifiable scientific hypothesis, as we are already developing mechanisms that provide the retroactive ability to see that a gene has been edited, and IGM already provides a better, more credible explanation for genetic anomalies such as human chromosome 2 (HSA2) <a href=\"https://molecularcytogenetics.biomedcentral.com/articles/10.1186/s13039-016-0283-3\">that scientists presently imagine</a> to have been caused by a single freak mutation that happened to fuse two primate chromosomes at the precise moment of a population bottleneck 740,000 years ago, a mutation that was so amazingly beneficial that it somehow managed to fixate through the entire human species at a rate much faster than Genghis Khan’s genetic lineage has been observed to propagate.</p><p>And if IGM does not address the question of the origin of life, well, neither does TE(p)NSBMGDaGF. And unlike TE(p)NSBMGDaGF, it even “predicts” the utility and significance of what was once erroneously labled “junk DNA” whereas all that TE(p)NSBMGDaGF ever “predicted” was the possibility of the existence of a rodent that had already been known to Man for centuries.</p><p>Biologists should not be the least bit reluctant to leave the useless theories of Neo-Darwinism behind or to abandon evolution by natural selection. To the contrary, we now have a growing body of scientific evidence that humanity is not, and never was, alone in the universe. And whoever, or whatever, the parties responsible may be, we know that they have at least a modicum of what appears to be beneficial interest in us, or they would not have manipulated our genes to enhance our cognition and self-awareness as they appear to have done.</p><p>On a philosophical note, I very much doubt it is a question of God or aliens. Because the answer, in all probability, will somehow involve both. We know that God works through men, even through the most unlikely of men. Logic therefore suggests that if aliens of any kind exist, God will work through them too.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-62824\" decoding=\"async\" fetchpriority=\"high\" height=\"512\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/05/image-15.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/05/image-15.png 512w, https://voxday.net/wp-content/uploads/2024/05/image-15-300x300.png 300w, https://voxday.net/wp-content/uploads/2024/05/image-15-150x150.png 150w\" width=\"512\"><figcaption class=\"wp-element-caption\"><em>“Yeah, I know, make sure it lays eggs, on it.”</em></figcaption></img></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/e49407db-1762-4164-9951-0734e329bb5f\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Your MITTENS Theorem is of course valid, and more precise and detailed than was possible for the physicists in 1966. You have also independently proposed the correct, and only possible alternative to Neo-Darwinism, what you termed IGM in your\nOctober 14, 2012 blog post\n. You should repost this mechanism, together with more discussion. This mechanism has been repeatedly rediscovered since the famous 19th century Harvard biologist Asa Gray first proposed it, correctly identifying God, not intelligent aliens, as the agent. Charles Darwin himself denounced Gray’s version of your theory, which is less precise than your version.\n– Dr. Frank Tipler, Professor of Mathematics and Physics, Tulane University\nI had no idea what he was talking about until I looked up the post. It turns out that IGM stands for Intelligent Genetic Manipulation, which is a mechanism I developed in response to four points put forth to me by one of the more reasonable Neo-Darwinians.\nLet us take as evidentially established the fact that species which existed in the past now exist no longer and are extinct.\nLet us take as evidentially established the fact that not all species now extant existed at all times throughout the history of organic life.\nTherefore, it must be possible for species which did not exist to come into existence by some mechanism, just as species which do exist can go extinct by any variety of mechanisms.\nIf it is a fact that new species can come into existence while others go extinct, by what mechanism other than evolution through natural selection are these species proposed to arise, and does that proposed mechanism explain more of the observed evidence than TeNS?\nI more or less concurred with the first three points, and in response to the fourth, proposed Intelligent Genetic Manipulation as a mechanism that not only explains more of the observed evidence than TeNS, but unlike TeNS, remains potentially valid because it has not been mathematically ruled out by MITTENS. Please keep in mind that this was written 12 years ago, long before some of the significant advances in the various genome projects which are far more consistent with intelligent genetic manipulation than with the Theorum of Evolution by (probably) Natural Selection, Biased Mutation, Genetic Drift, and Gene Flow, or TE(p)NSBMGDaGF, as it is properly identified in its full epicycular form.\nIntelligent Genetic Manipulation is the mechanism that I propose. And yes, I believe that explains more of the observed evidence than TENS, since IGM is a scientific proposition, a readily observed action, and a successful predictive model, whereas TENS is a philosophical proposition, an unobserved process, and an unsuccessful predictive model.\nNow, this does not provide any basis for assuming the existence of a Creator God, or even declaring that TENS did not actually take place. The logical fact of the matter is that even if TENS can be conclusively demonstrated to have taken place in various species, which has not happened despite more than 150 years of trying, that doesn’t necessarily mean the process was sufficient to produce Man. If one contemplates the biological differences between ape and man, the vast leap in cognitive capacity taking place in a relatively small sum of generational cycles from the proposed common ancestor in comparison with the timelines supposedly required for other, less complicated evolutionary changes, the logic suggests – though it does not prove – that some degree of purposeful genetic manipulation has likely taken place at various points in the origin of the species and the development of\nhomo sapiens sapiens\n.\nI’m not talking about Intelligent Design, but rather intelligent editing. And the interesting thing is that IGM should be an increasingly falsifiable concept as genetic science continues to improve. Only recently have we learned that junk DNA serves a purpose; even though we have sequenced various genomes, we haven’t yet understood how the code works or fully comprehended the various ways it can be manipulated. As our understanding grows, we should be able to develop an ability to recognize patterns that indicate purposeful alterations in the code have been made.\nAn Alternative Mechanism, 12 October 2012\nTwelve years later, it is now clear that IGM is superior to the Theorum of Evolution by (probably) Natural Selection, Biased Mutation, Genetic Drift, and Gene Flow in every single way. It is not only not mathematically impossible, we know for certain it is possible because we already engage in purposeful genetic manipulation ourselves. IGM is not a philosophical tautology, it is an eminently falsifiable scientific hypothesis, as we are already developing mechanisms that provide the retroactive ability to see that a gene has been edited, and IGM already provides a better, more credible explanation for genetic anomalies such as human chromosome 2 (HSA2)\nthat scientists presently imagine\nto have been caused by a single freak mutation that happened to fuse two primate chromosomes at the precise moment of a population bottleneck 740,000 years ago, a mutation that was so amazingly beneficial that it somehow managed to fixate through the entire human species at a rate much faster than Genghis Khan’s genetic lineage has been observed to propagate.\nAnd if IGM does not address the question of the origin of life, well, neither does TE(p)NSBMGDaGF. And unlike TE(p)NSBMGDaGF, it even “predicts” the utility and significance of what was once erroneously labled “junk DNA” whereas all that TE(p)NSBMGDaGF ever “predicted” was the possibility of the existence of a rodent that had already been known to Man for centuries.\nBiologists should not be the least bit reluctant to leave the useless theories of Neo-Darwinism behind or to abandon evolution by natural selection. To the contrary, we now have a growing body of scientific evidence that humanity is not, and never was, alone in the universe. And whoever, or whatever, the parties responsible may be, we know that they have at least a modicum of what appears to be beneficial interest in us, or they would not have manipulated our genes to enhance our cognition and self-awareness as they appear to have done.\nOn a philosophical note, I very much doubt it is a question of God or aliens. Because the answer, in all probability, will somehow involve both. We know that God works through men, even through the most unlikely of men. Logic therefore suggests that if aliens of any kind exist, God will work through them too.\n“Yeah, I know, make sure it lays eggs, on it.”\nDISCUSS ON SG",
  "tags": [
    "evolution",
    "philosophy",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-05-06T13:32:43+00:00"
}