{
  "url": "https://voxday.net/2024/05/08/an-appeal-to-innumeracy/",
  "scraped_at": "2026-01-08T14:31:58.071106",
  "title": "An Appeal to Innumeracy",
  "date_display": "May 8, 2024",
  "date_iso": "2024-05-08T15:18:09+00:00",
  "date_from_url": "2024-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to admit, while I was confident that all the true believers in the Theory of Evolution by Natural Selection were going to do their level best to avoid every doing any of the simple math required by MITTENS (Mathematical Impossibility of The Theory of Evolution by Natural Selection), I didn’t realize they were going to go so far as to literally deny the applicability of mathematics to what can now only be described as “the magic of evolution”.</p><p><strong>Whitelightning777:</strong> <em>Humans and chimps only differ genetically by 1% or so. That’s hardly revolutionary. When zoos have to do surgery on primates, the vets often consult human surgeons for expert advice. Go to a zoo. Look at the hands of chimps. A common ancestor is obvious. There is no way that’s a coincidence!! Just the fact that chimps can learn sign language ought to show a recent divergence. The fact that they can use human metallic tools shows that the brain also works in a similar fashion, just that chimps still aren’t quite as smart as humans, about what a 3 to 5 year old child can do. Look at the difference between wild carp and goldfish. Living things can be pressured to change structure rapidly when circumstances create the pressure to do so.</em></p><p><strong>Spacebunny:</strong> You have no idea what you’re talking about. You can’t do math, nor do you understand the significance of the numbers given. No, they could not have done any such thing “a few million years ago”. It is literally mathematically impossible.</p><p><strong>Whitelightning777:</strong> <em>Both a 1% to a 10% difference or maybe even more could be accomplished over a period of 2 to 4 million years. The main issues are what factors exactly drove this natural selection and how much pressure was exerted upon humans by nature, animal predators and other human species attacking each other. By the way, neanderthals weren’t necessarily as nice as we all seem to think.</em></p><p><strong>James Dixon:</strong> The math says no.</p><p><strong>VD: </strong>1.23 percent of the human genome means 37,500,000 unique base pairs specific to humans. Now, tell us how long it would take to mutate and fixate that degree of genetic disparity…</p><p><strong>Whitelightning777:</strong> <em>First of all, the majority of your DNA is essentially junk. The exact percentage is disputed but can be as high as 90%. Small genetic changes can quickly lead to huge differences. Over a few million years you don’t have to change very much from one generation to the next. The ABILITY to evolve, genetic flexibility itself is something that nature selects for. Creatures that can’t evolve are usually extinct. The multiple numbers of human races attest to our genetic flexibility. The modern races are only a few hundred thousand years old &amp; have meaningful differences in health and IQ, although the extent is disputed. If our species lost it’s ability to evolve, it wouldn’t be able to split off into races either. Chimps themselves also have different races and species. Bonobos behave very differently from other chimps, even though they can all interbreed.</em></p><p><strong>Dirk Gently: </strong> So, in other words, you don’t even comprehend what Vox is saying</p><p><strong>Whitelightning777:</strong> <em>Vox is setting a “math trap”. This is a device used by creationists. What Vox fails to realize is that 90% of that DNA is junk and that there is no upper limit to how fast evolution and generic change which can occur so long as the offspring survives and is able to reproduce. What Vox fails to realize is that a creature that can only evolve slowly will go extinct, falling behind and losing out to those with more generic flexibility.</em></p><p><strong>VD: </strong> A “math trap” is a simply a basic calculation used by people who are numerate. It’s not witchcraft, no matter how opaque it may be to you. There absolutely is an upper limit to how fast mutated genes can fixate. Evolution by natural selection, biased mutation, genetic drift, and gene flow is utterly impossible by the very fastest rates of fixation ever observed in the wild or in laboratories. I will put the problem in two very simple analogies so you might be able to understand the problem.</p><p>If someone tells you the score of a professional baseball game is 562,987 to 3, you know the score is incorrect. If someone tells you he walked from New York City to Los Angeles in 34 minutes, you know he is lying. And when someone tells you that the 37.5 million human-specific base-pairs in the human genome were mutated and fixated by natural selection in less than 10 million years, you know they are absolutely wrong. Your junior high logic will never bridge that gap. It cannot. Because it is based on incorrect and impossible premises.</p><p><strong>Whitelightning777:</strong> <em>MATH DOESN’T APPLY to evolution.</em></p><p><strong>VD: </strong>Of all the absurdly retarded statements I’ve ever seen on every form of social media dating back to the bulletin boards of the 1990s, this is, without any doubt whatsoever, the most retarded. Congratulations. Even the kid who thought bacon came from rocks was simply ignorant. But this assertion actually required enough brainpower to contemplate the concept, think it through, and then reject the idea that mathematics necessarily applies to a process that is conceived to take place over a quantifiable period of time.</p><p><strong>Whitelightning777:</strong> <em>Let’s keep this simple. The only math that matters with evolution is that the birth rate of a particular lifeform exceeds the death rate or barring that is at an equilibrium. Creatures for whom the death rate exceeds their birth rate are dysgenic. Creationist trick boxes are neither required nor desired.</em></p><p><strong>VD: </strong>You’re literally retarded.</p><p>You don’t have to be retarded to… well, yes, at this point, it is abundantly clear that you do have to be literally retarded to believe in evolution by natural selection. As you can see, the challenge posed to the Neo-Darwinian synthesis by MITTENS is so overwhelmingly devastating that the evolutionists have to abandon not only science, but math itself, in order to cling to their outmoded, outdated, and disproven explanation for the observable diversity of life.</p><p><em><a href=\"https://social.infogalactic.com/micropost/a63adc8e-d656-4ce1-b883-d32065e40faa\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I have to admit, while I was confident that all the true believers in the Theory of Evolution by Natural Selection were going to do their level best to avoid every doing any of the simple math required by MITTENS (Mathematical Impossibility of The Theory of Evolution by Natural Selection), I didn’t realize they were going to go so far as to literally deny the applicability of mathematics to what can now only be described as “the magic of evolution”.\nWhitelightning777:\nHumans and chimps only differ genetically by 1% or so. That’s hardly revolutionary. When zoos have to do surgery on primates, the vets often consult human surgeons for expert advice. Go to a zoo. Look at the hands of chimps. A common ancestor is obvious. There is no way that’s a coincidence!! Just the fact that chimps can learn sign language ought to show a recent divergence. The fact that they can use human metallic tools shows that the brain also works in a similar fashion, just that chimps still aren’t quite as smart as humans, about what a 3 to 5 year old child can do. Look at the difference between wild carp and goldfish. Living things can be pressured to change structure rapidly when circumstances create the pressure to do so.\nSpacebunny:\nYou have no idea what you’re talking about. You can’t do math, nor do you understand the significance of the numbers given. No, they could not have done any such thing “a few million years ago”. It is literally mathematically impossible.\nWhitelightning777:\nBoth a 1% to a 10% difference or maybe even more could be accomplished over a period of 2 to 4 million years. The main issues are what factors exactly drove this natural selection and how much pressure was exerted upon humans by nature, animal predators and other human species attacking each other. By the way, neanderthals weren’t necessarily as nice as we all seem to think.\nJames Dixon:\nThe math says no.\nVD:\n1.23 percent of the human genome means 37,500,000 unique base pairs specific to humans. Now, tell us how long it would take to mutate and fixate that degree of genetic disparity…\nWhitelightning777:\nFirst of all, the majority of your DNA is essentially junk. The exact percentage is disputed but can be as high as 90%. Small genetic changes can quickly lead to huge differences. Over a few million years you don’t have to change very much from one generation to the next. The ABILITY to evolve, genetic flexibility itself is something that nature selects for. Creatures that can’t evolve are usually extinct. The multiple numbers of human races attest to our genetic flexibility. The modern races are only a few hundred thousand years old & have meaningful differences in health and IQ, although the extent is disputed. If our species lost it’s ability to evolve, it wouldn’t be able to split off into races either. Chimps themselves also have different races and species. Bonobos behave very differently from other chimps, even though they can all interbreed.\nDirk Gently:\nSo, in other words, you don’t even comprehend what Vox is saying\nWhitelightning777:\nVox is setting a “math trap”. This is a device used by creationists. What Vox fails to realize is that 90% of that DNA is junk and that there is no upper limit to how fast evolution and generic change which can occur so long as the offspring survives and is able to reproduce. What Vox fails to realize is that a creature that can only evolve slowly will go extinct, falling behind and losing out to those with more generic flexibility.\nVD:\nA “math trap” is a simply a basic calculation used by people who are numerate. It’s not witchcraft, no matter how opaque it may be to you. There absolutely is an upper limit to how fast mutated genes can fixate. Evolution by natural selection, biased mutation, genetic drift, and gene flow is utterly impossible by the very fastest rates of fixation ever observed in the wild or in laboratories. I will put the problem in two very simple analogies so you might be able to understand the problem.\nIf someone tells you the score of a professional baseball game is 562,987 to 3, you know the score is incorrect. If someone tells you he walked from New York City to Los Angeles in 34 minutes, you know he is lying. And when someone tells you that the 37.5 million human-specific base-pairs in the human genome were mutated and fixated by natural selection in less than 10 million years, you know they are absolutely wrong. Your junior high logic will never bridge that gap. It cannot. Because it is based on incorrect and impossible premises.\nWhitelightning777:\nMATH DOESN’T APPLY to evolution.\nVD:\nOf all the absurdly retarded statements I’ve ever seen on every form of social media dating back to the bulletin boards of the 1990s, this is, without any doubt whatsoever, the most retarded. Congratulations. Even the kid who thought bacon came from rocks was simply ignorant. But this assertion actually required enough brainpower to contemplate the concept, think it through, and then reject the idea that mathematics necessarily applies to a process that is conceived to take place over a quantifiable period of time.\nWhitelightning777:\nLet’s keep this simple. The only math that matters with evolution is that the birth rate of a particular lifeform exceeds the death rate or barring that is at an equilibrium. Creatures for whom the death rate exceeds their birth rate are dysgenic. Creationist trick boxes are neither required nor desired.\nVD:\nYou’re literally retarded.\nYou don’t have to be retarded to… well, yes, at this point, it is abundantly clear that you do have to be literally retarded to believe in evolution by natural selection. As you can see, the challenge posed to the Neo-Darwinian synthesis by MITTENS is so overwhelmingly devastating that the evolutionists have to abandon not only science, but math itself, in order to cling to their outmoded, outdated, and disproven explanation for the observable diversity of life.\nDISCUSS ON SG",
  "tags": [
    "evolution",
    "philosophy",
    "science",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-05-08T15:32:44+00:00"
}