{
  "url": "https://voxday.net/2024/05/15/an-accurate-review/",
  "scraped_at": "2026-01-08T14:32:28.198467",
  "title": "An Accurate Review",
  "date_display": "May 15, 2024",
  "date_iso": "2024-05-15T17:25:58+00:00",
  "date_from_url": "2024-05-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which <a href=\"https://www.youtube.com/@MattsFantasyBookReviews\">a reviewer of fantasy books</a> tries, and quite understandably fails, to finish reading the award-winning masterworks of one N.K. Jemisin:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I believe that the Broken Earth Trilogy specifically the fifth season which is the first book is so bad<br/>that it’s essentially unreadable. I don’t remember a book that I’ve read that I believe personally is as bad as this one, and it shocks me that not only is this book extremely popular, but every single book in the trilogy won the Hugo award for the best book. This is a beloved series that many people claim<br/>this is the best fantasy series of all time and I could not have a more contrary opinion to my feeling about<br/>this book.</p><p>The fact that a third of this book was written in the second person is a ridiculous, ridiculous thing. The second person does not work when it comes to books, it works in some other forms of media, it works in video games, it works quite well in video games where you can picture yourself into the main character and people are talking to you in that way, but in a book it comes off so odd that it’s off-putting and difficult to suck in. There is a reason that virtually no books utilize the second person, and it’s not because they’re not as smart as NK Jemisin that they haven’t been able to pull it off, it’s because it doesn’t work.</p><p>I believed, constantly, as I read this book, that Jemisin was trying to be too smart and it came off as ridiculous. The second person is horrible, the way that she writes is atrocious. At times where she uses these italics and bolds and all caps within the text to really drive home a point, to really make this strong emphasis, you shouldn’t have to rely on that to make a really strong point. It comes off as kind of crazy.</p><p>I thought the twist that was in this book, and there is a major one, and I still don’t know if it actually occurs because I didn’t finish the book.  I got 95 percent of the way through, and I said ‘I cannot bear to finish this book’ but I’m about 100 percent confident that there is a major twist that happens at the end of this book that is so obvious that it becomes one of the most telegraphed and poor choices for a twist that I’ve ever read. I can’t say what it is, but I can say that myself, and I suspect a great many readers figured out what it is within the first 50 or so pages. It’s not so much that the twist is ruined, you know. I’ve figured out twists before and it’s disappointing, it doesn’t happen a lot for me. I’m not the smartest guy in the world, I’m oftentimes the last person to pick up on these things, and I really do like it that way. I prefer to be surprised, I don’t want to figure stuff out, I don’t want to be the smartest guy in the room. I want to be, you know, the dummy that is the last one to get it, but man, it’s obvious.</p><p>The problem is that the way that the book is structured with this bouncing around in a timeline is ruined<br/>because of the twist. It’s a really poor way to tell the story and the story would have been much preferable to be in a more cohesive, clear, linear fashion, and I don’t think that’s true for all books. I think some books that use time jumps and these different point of views and these things can be very very good, some of my favorite books utilize that, but I think the book sacrificed a great deal in quality to do this and it didn’t work. The twist did not achieve its stated goals.</p><p>Now when I’ve said this before, I heard a lot of people in the comments say ‘you’re supposed to figure it out.’ No, you’re not! That is a retrospective retelling of the events to try to justify what occurred in this book. Now the last thing I’ll say about a major reason that I disliked this book is the way that characters move on from traumatic events. I think it’s horrible, some horrible things happen in this book, and this book bills itself as being a tear-jerker and just very depressing and these bad things happen, and that<br/>that’s true for the large part, but the characters have these horrible things happen and they reminisce about them for a moment, and they take it in, and then they just move on. That’s crazy, that’s not real life. When horrible things happen people sit with them for great amounts of time, and maybe in later books they reinvestigate this, but in this first book, man, it didn’t work well.</p><p>So I can’t say enough negative things about this book and I am absolutely floored at how popular this book and this book series are.</p></blockquote><p>The secret is that the book and the book series are not even remotely popular. By her own admission, N… K… Jemisin can’t making a living off them. This is the problem with manufactured “success”. It simply isn’t real, and no amount of fakery and propping up pets, poster children, and other imposters is going to fool anyone who actually knows what they’re talking about.</p><p>And yes, the reviewer is correct. One of the cruelest things I have ever done is inspire the SFWA crowd to demolish their own awards by handing a Best Novel award or two to N… K… Yes, <a href=\"https://voxday.net/2017/08/21/sf-sjw-unleashed/\">I knew “the indirect backlash and overcorrection” would happen</a>. Yes, it was intentional. But no, I never imagined that they would do it THREE straight years in a row. That really exceeded my expectations.</p><p>The only thing that would have been funnier would have been if they’d actually followed through on their rhetoric and given an award to Chuck Tingle. But even that would have been less damaging than what they actually did.</p><p><em><a href=\"https://social.infogalactic.com/micropost/2b2f9d98-af73-4db1-bfa5-add630b7fc6a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "In which\na reviewer of fantasy books\ntries, and quite understandably fails, to finish reading the award-winning masterworks of one N.K. Jemisin:\nI believe that the Broken Earth Trilogy specifically the fifth season which is the first book is so bad\nthat it’s essentially unreadable. I don’t remember a book that I’ve read that I believe personally is as bad as this one, and it shocks me that not only is this book extremely popular, but every single book in the trilogy won the Hugo award for the best book. This is a beloved series that many people claim\nthis is the best fantasy series of all time and I could not have a more contrary opinion to my feeling about\nthis book.\nThe fact that a third of this book was written in the second person is a ridiculous, ridiculous thing. The second person does not work when it comes to books, it works in some other forms of media, it works in video games, it works quite well in video games where you can picture yourself into the main character and people are talking to you in that way, but in a book it comes off so odd that it’s off-putting and difficult to suck in. There is a reason that virtually no books utilize the second person, and it’s not because they’re not as smart as NK Jemisin that they haven’t been able to pull it off, it’s because it doesn’t work.\nI believed, constantly, as I read this book, that Jemisin was trying to be too smart and it came off as ridiculous. The second person is horrible, the way that she writes is atrocious. At times where she uses these italics and bolds and all caps within the text to really drive home a point, to really make this strong emphasis, you shouldn’t have to rely on that to make a really strong point. It comes off as kind of crazy.\nI thought the twist that was in this book, and there is a major one, and I still don’t know if it actually occurs because I didn’t finish the book.  I got 95 percent of the way through, and I said ‘I cannot bear to finish this book’ but I’m about 100 percent confident that there is a major twist that happens at the end of this book that is so obvious that it becomes one of the most telegraphed and poor choices for a twist that I’ve ever read. I can’t say what it is, but I can say that myself, and I suspect a great many readers figured out what it is within the first 50 or so pages. It’s not so much that the twist is ruined, you know. I’ve figured out twists before and it’s disappointing, it doesn’t happen a lot for me. I’m not the smartest guy in the world, I’m oftentimes the last person to pick up on these things, and I really do like it that way. I prefer to be surprised, I don’t want to figure stuff out, I don’t want to be the smartest guy in the room. I want to be, you know, the dummy that is the last one to get it, but man, it’s obvious.\nThe problem is that the way that the book is structured with this bouncing around in a timeline is ruined\nbecause of the twist. It’s a really poor way to tell the story and the story would have been much preferable to be in a more cohesive, clear, linear fashion, and I don’t think that’s true for all books. I think some books that use time jumps and these different point of views and these things can be very very good, some of my favorite books utilize that, but I think the book sacrificed a great deal in quality to do this and it didn’t work. The twist did not achieve its stated goals.\nNow when I’ve said this before, I heard a lot of people in the comments say ‘you’re supposed to figure it out.’ No, you’re not! That is a retrospective retelling of the events to try to justify what occurred in this book. Now the last thing I’ll say about a major reason that I disliked this book is the way that characters move on from traumatic events. I think it’s horrible, some horrible things happen in this book, and this book bills itself as being a tear-jerker and just very depressing and these bad things happen, and that\nthat’s true for the large part, but the characters have these horrible things happen and they reminisce about them for a moment, and they take it in, and then they just move on. That’s crazy, that’s not real life. When horrible things happen people sit with them for great amounts of time, and maybe in later books they reinvestigate this, but in this first book, man, it didn’t work well.\nSo I can’t say enough negative things about this book and I am absolutely floored at how popular this book and this book series are.\nThe secret is that the book and the book series are not even remotely popular. By her own admission, N… K… Jemisin can’t making a living off them. This is the problem with manufactured “success”. It simply isn’t real, and no amount of fakery and propping up pets, poster children, and other imposters is going to fool anyone who actually knows what they’re talking about.\nAnd yes, the reviewer is correct. One of the cruelest things I have ever done is inspire the SFWA crowd to demolish their own awards by handing a Best Novel award or two to N… K… Yes,\nI knew “the indirect backlash and overcorrection” would happen\n. Yes, it was intentional. But no, I never imagined that they would do it THREE straight years in a row. That really exceeded my expectations.\nThe only thing that would have been funnier would have been if they’d actually followed through on their rhetoric and given an award to Chuck Tingle. But even that would have been less damaging than what they actually did.\nDISCUSS ON SG",
  "tags": [
    "Book Review",
    "books",
    "Puppies",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-05-15T18:54:43+00:00"
}