{
  "url": "https://voxday.net/2024/05/11/an-inept-defense/",
  "scraped_at": "2026-01-08T14:32:14.217274",
  "title": "An Inept Defense",
  "date_display": "May 11, 2024",
  "date_iso": "2024-05-11T22:54:24+00:00",
  "date_from_url": "2024-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Word magic doesn’t work for domestic abusers and it’s certainly not going to work <a href=\"https://www.rt.com/news/597385-switzerland-neutral-ukraine-peace-summit/\">for wartime belligerents</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Switzerland’s neutrality remains unchanged, the country’s foreign ministry has insisted ahead of the peace conference on the Ukraine conflict next month. Russia has accused Bern of effectively siding with the West and Kiev in the current confrontation, making it an unfit mediator…</p><p>On Friday, Reuters quoted a Swiss foreign ministry representative as stressing that Bern’s neutrality is “constant” and will not be affected by the summit on June 15-16. The statement noted, however, that “being neutral does not mean being indifferent.”</p><p>“Switzerland strongly condemns Russia’s aggression against Ukraine. Outside the military realm, the right to neutrality does not stand in the way of solidarity and support for Ukraine and its people,” the ministry clarified, as quoted by Reuters.</p><p>Despite not being a member of either the EU or NATO, Switzerland has supported the West’s sanctions against Russia over its actions in Ukraine. Last month, the country’s national agency overseeing sanctions revealed that Bern was holding an estimated 13 billion francs ($14.3 billion) in Russian assets, which remain frozen in its financial institutions.</p></blockquote><p>It’s certainly a fascinating attempt to deny the undeniable. It’s rather like a domestic abuser admitting that he repeatedly punched his wife in the mouth and pushed her down the stairs, but nevertheless insisting that he never abused her. You can’t sanction and strongly condemn another state and still claim to be neutral.</p><p>It’s not only inept diplomacy, it’s flat-out false, as even <a href=\"https://www.thesaurus.com/browse/neutral\">a cursory glance at a thesaurus</a> will prove. The fact is that “being neutral” quite literally does mean “being indifferent.”</p><h1 class=\"wp-block-heading\">neutral</h1><p id=\"impartial-noncommittal\">adjective <em>as in <strong>impartial, noncommittal</strong></em></p><p><strong>Strongest matches</strong></p><ul class=\"wp-block-list\"><li>disinterested</li><li>inactive</li><li>indifferent</li><li>uninvolved</li></ul><p>“Indifferent” is precisely what “neutral” means.</p><p>Regardless, the important thing about neutrality is that the neutral party’s opinion of itself doesn’t matter in the slightest. If <em>either </em>party feels you’re taking the other party’s side, then you’re obviously not going to be recognized as a neutral. And if your partiality is obvious to everyone, then you have eliminated yourself from consideration for any role requiring a neutral party. It’s frankly shocking that the Swiss diplomats would prove to be so inept in this regard, although given the fact that plans for a Swiss Army knife without an actual blade have been announced, it’s very much in line with Clown World’s inverted approach to reality.</p><p>What’s next, an announcement that Swiss chocolate will hitherto be cocoa-free?</p><p><em><a href=\"https://social.infogalactic.com/micropost/26a93c2a-5e02-4432-9fee-79167c1f7b59\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Word magic doesn’t work for domestic abusers and it’s certainly not going to work\nfor wartime belligerents\n:\nSwitzerland’s neutrality remains unchanged, the country’s foreign ministry has insisted ahead of the peace conference on the Ukraine conflict next month. Russia has accused Bern of effectively siding with the West and Kiev in the current confrontation, making it an unfit mediator…\nOn Friday, Reuters quoted a Swiss foreign ministry representative as stressing that Bern’s neutrality is “constant” and will not be affected by the summit on June 15-16. The statement noted, however, that “being neutral does not mean being indifferent.”\n“Switzerland strongly condemns Russia’s aggression against Ukraine. Outside the military realm, the right to neutrality does not stand in the way of solidarity and support for Ukraine and its people,” the ministry clarified, as quoted by Reuters.\nDespite not being a member of either the EU or NATO, Switzerland has supported the West’s sanctions against Russia over its actions in Ukraine. Last month, the country’s national agency overseeing sanctions revealed that Bern was holding an estimated 13 billion francs ($14.3 billion) in Russian assets, which remain frozen in its financial institutions.\nIt’s certainly a fascinating attempt to deny the undeniable. It’s rather like a domestic abuser admitting that he repeatedly punched his wife in the mouth and pushed her down the stairs, but nevertheless insisting that he never abused her. You can’t sanction and strongly condemn another state and still claim to be neutral.\nIt’s not only inept diplomacy, it’s flat-out false, as even\na cursory glance at a thesaurus\nwill prove. The fact is that “being neutral” quite literally does mean “being indifferent.”\nneutral\nadjective\nas in\nimpartial, noncommittal\nStrongest matches\ndisinterested\ninactive\nindifferent\nuninvolved\n“Indifferent” is precisely what “neutral” means.\nRegardless, the important thing about neutrality is that the neutral party’s opinion of itself doesn’t matter in the slightest. If\neither\nparty feels you’re taking the other party’s side, then you’re obviously not going to be recognized as a neutral. And if your partiality is obvious to everyone, then you have eliminated yourself from consideration for any role requiring a neutral party. It’s frankly shocking that the Swiss diplomats would prove to be so inept in this regard, although given the fact that plans for a Swiss Army knife without an actual blade have been announced, it’s very much in line with Clown World’s inverted approach to reality.\nWhat’s next, an announcement that Swiss chocolate will hitherto be cocoa-free?\nDISCUSS ON SG",
  "tags": [
    "Russia",
    "Switzerland"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-05-11T22:55:04+00:00"
}