{
  "url": "https://voxday.net/2024/05/26/china-warns-japan-2/",
  "scraped_at": "2026-01-08T14:33:27.711747",
  "title": "China Warns Japan",
  "date_display": "May 26, 2024",
  "date_iso": "2024-05-26T12:13:58+00:00",
  "date_from_url": "2024-05-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And after Japanese protests, repeated the official warning about not lending support to Taiwanese independence:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>CCTV: </strong><em>On May 20, Chinese Ambassador to Japan Wu Jianghao sent a serious warning to the Japanese side over its recent negative moves on the Taiwan question. Wu said that “If Japan ties itself onto the chariot of splitting China, the Japanese people will be led into a pit of fire.” It’s reported that on May 22, Japan’s Chief Cabinet Secretary Yoshimasa Hayashi said that Wu’s remarks were “extremely inappropriate.” What’s China’s comment?</em></p><p><strong>Wang Wenbin: </strong>The Taiwan question is at the very core of China’s core interests. It bears on the political foundation of China-Japan relations and is a red line that must not be crossed. Some in Japan have been making negative moves on Taiwan, including repeating the preposterous and dangerous notion that “any contingency for Taiwan is a contingency for Japan”, which seriously violates the spirit of the four political documents between China and Japan and the commitments Japan has made.</p><p>Ambassador Wu Jianghao categorically and rightfully stated China’s position. They are based on facts and the intention is sincere and earnest. His words are entirely proper and necessary. Let me stress once again that no one should underestimate the resolve, will and ability of the Chinese people to defend national sovereignty and territorial integrity. Anyone bent on interfering in China’s internal affairs and holding back China’s reunification will pay a heavy price.</p></blockquote><p>Clown World seems to be having a tough time grasping the observable fact that their past ability to shame sovereign nations into submitting to its will are over. First, Russia, and now China, are repeatedly making it clear that they have no concern whatsoever for the rhetorical machinations of Clown World’s pet media.</p><p><em><a href=\"https://social.infogalactic.com/micropost/d4b5d924-2e29-4e12-af06-16cc8260766e\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "And after Japanese protests, repeated the official warning about not lending support to Taiwanese independence:\nCCTV:\nOn May 20, Chinese Ambassador to Japan Wu Jianghao sent a serious warning to the Japanese side over its recent negative moves on the Taiwan question. Wu said that “If Japan ties itself onto the chariot of splitting China, the Japanese people will be led into a pit of fire.” It’s reported that on May 22, Japan’s Chief Cabinet Secretary Yoshimasa Hayashi said that Wu’s remarks were “extremely inappropriate.” What’s China’s comment?\nWang Wenbin:\nThe Taiwan question is at the very core of China’s core interests. It bears on the political foundation of China-Japan relations and is a red line that must not be crossed. Some in Japan have been making negative moves on Taiwan, including repeating the preposterous and dangerous notion that “any contingency for Taiwan is a contingency for Japan”, which seriously violates the spirit of the four political documents between China and Japan and the commitments Japan has made.\nAmbassador Wu Jianghao categorically and rightfully stated China’s position. They are based on facts and the intention is sincere and earnest. His words are entirely proper and necessary. Let me stress once again that no one should underestimate the resolve, will and ability of the Chinese people to defend national sovereignty and territorial integrity. Anyone bent on interfering in China’s internal affairs and holding back China’s reunification will pay a heavy price.\nClown World seems to be having a tough time grasping the observable fact that their past ability to shame sovereign nations into submitting to its will are over. First, Russia, and now China, are repeatedly making it clear that they have no concern whatsoever for the rhetorical machinations of Clown World’s pet media.\nDISCUSS ON SG",
  "tags": [
    "Asia",
    "China"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-05-26T12:14:02+00:00"
}