{
  "url": "https://voxday.net/2024/05/12/clown-worlds-best-intellectuals-are-retarded/",
  "scraped_at": "2026-01-08T14:32:17.909328",
  "title": "Clown World’s Best Intellectuals are Retarded",
  "date_display": "May 12, 2024",
  "date_iso": "2024-05-12T12:27:23+00:00",
  "date_from_url": "2024-05-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Don’t get me wrong. I LIKE Victor Davis Hanson. A lot. I own several of his books. I genuinely admire his work. But there is no way to escape the obvious. At the end of the day, <a href=\"https://www.zerohedge.com/political/end-near-victor-davis-hanson-ponders-threat-annihilation\">VDH is totally fucking retarded</a> about the decline and fall of a West that has already been infiltrated, subverted, subjugated, and functionally disarmed by the global satanists:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>VDH: </strong>I don’t think the average American understands that the Chinese are producing four ships per year to our one ship. Or that if you took any of our $15 billion carriers and you put them in the straits between Taiwan and China, they wouldn’t last more than an hour given the Chinese have developed missile batteries where they could launch 5,000 or 6,000 small missiles that would go about 6 inches above the water and hit the waterline at night. And you couldn’t stop that.</p><p>They are building nuclear weapons at a phenomenal rate. They’re working on anti-missile defense. They’re back up to probably 250,000 students in the United States; if 1 percent are engaged in espionage—and the FBI says it’s more than that—you’ve got thousands of people who are appropriating technology.</p><p>I don’t think anybody understands that it’s going to take us six years to replenish Javelin stocks and maybe we can’t. North Korea is producing more 155-mm shells than we are. At least they sent 2 million of them to the Russians.</p><p>So we are not armed, and yet, our strategic responsibilities, our strategic confidence, our arrogance has not lessened commensurately with our reduced defense capacity.</p><p>We’re 40,000 recruits short now in the military—never happened before. And when you analyze who is not joining the military, it’s not blacks, it’s not Latinos, it’s not gays, it’s not women, it’s not trans people, all of those numbers are the same … the largest group are white males from the lower and middle classes whose families fought in Vietnam, first Gulf War, Afghanistan, but this third and fourth generation are not joining up.</p><p>And unfortunately, for the military, if you look at the casualty or the fatality rates in Afghanistan and Iraq, that demographic dies at twice their demographics—72 percent to 74 percent of all the dead in Afghanistan, in Iraq are white males from the middle and lower classes.</p><p>And yet, this is the very demographic that [retired Gen.] Mark Milley, chairman of the Joint Chiefs of Staff, and [Defense Secretary] Lloyd Austin, in testimonies, have suggested suffer from white rage or white privilege. And the Pentagon was investigating just those kind of slanders about that demographic, and they found, of course, in December, they quietly issued a report, there was no cabal of white supremacists.</p><p>But the point is, you can’t really have a successful military when you’re 40,000 recruits short in just a year.</p><p><strong>Mr. Bluey: </strong>What do you suggest that societies today, including the United States, learn from those historical examples you gave us earlier in the interview to maybe mitigate some of the risks that we might find ourselves in in the future?</p><p><strong>VDH: </strong>I would not put much confidence in international bodies or even in so-called close allies. The Spartans came all the way up to the Thebans and they heard the Macedonians, they turned right back. On the last day of the existence of Constantinople, they were looking out at the walls at the Hellespont thinking that Venetian galleys en masse would come up and save them.</p><p>So … I support NATO.</p></blockquote><p>NATO? NATO is supposed to be the answer to the complete destruction of industrial capacity across the post-Christian West? That’s not a viable strategic analysis by a military historian, that’s Salvador Dali multiplied by Jackson Pollock on mushrooms.</p><p>I’ll definitely read his new book. It appears to be ominously relevant, particularly in light of VDH’s own prescriptions.</p><p><em><a href=\"https://social.infogalactic.com/micropost/8552051a-1c3a-4322-b26b-d8238b623593\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Don’t get me wrong. I LIKE Victor Davis Hanson. A lot. I own several of his books. I genuinely admire his work. But there is no way to escape the obvious. At the end of the day,\nVDH is totally fucking retarded\nabout the decline and fall of a West that has already been infiltrated, subverted, subjugated, and functionally disarmed by the global satanists:\nVDH:\nI don’t think the average American understands that the Chinese are producing four ships per year to our one ship. Or that if you took any of our $15 billion carriers and you put them in the straits between Taiwan and China, they wouldn’t last more than an hour given the Chinese have developed missile batteries where they could launch 5,000 or 6,000 small missiles that would go about 6 inches above the water and hit the waterline at night. And you couldn’t stop that.\nThey are building nuclear weapons at a phenomenal rate. They’re working on anti-missile defense. They’re back up to probably 250,000 students in the United States; if 1 percent are engaged in espionage—and the FBI says it’s more than that—you’ve got thousands of people who are appropriating technology.\nI don’t think anybody understands that it’s going to take us six years to replenish Javelin stocks and maybe we can’t. North Korea is producing more 155-mm shells than we are. At least they sent 2 million of them to the Russians.\nSo we are not armed, and yet, our strategic responsibilities, our strategic confidence, our arrogance has not lessened commensurately with our reduced defense capacity.\nWe’re 40,000 recruits short now in the military—never happened before. And when you analyze who is not joining the military, it’s not blacks, it’s not Latinos, it’s not gays, it’s not women, it’s not trans people, all of those numbers are the same … the largest group are white males from the lower and middle classes whose families fought in Vietnam, first Gulf War, Afghanistan, but this third and fourth generation are not joining up.\nAnd unfortunately, for the military, if you look at the casualty or the fatality rates in Afghanistan and Iraq, that demographic dies at twice their demographics—72 percent to 74 percent of all the dead in Afghanistan, in Iraq are white males from the middle and lower classes.\nAnd yet, this is the very demographic that [retired Gen.] Mark Milley, chairman of the Joint Chiefs of Staff, and [Defense Secretary] Lloyd Austin, in testimonies, have suggested suffer from white rage or white privilege. And the Pentagon was investigating just those kind of slanders about that demographic, and they found, of course, in December, they quietly issued a report, there was no cabal of white supremacists.\nBut the point is, you can’t really have a successful military when you’re 40,000 recruits short in just a year.\nMr. Bluey:\nWhat do you suggest that societies today, including the United States, learn from those historical examples you gave us earlier in the interview to maybe mitigate some of the risks that we might find ourselves in in the future?\nVDH:\nI would not put much confidence in international bodies or even in so-called close allies. The Spartans came all the way up to the Thebans and they heard the Macedonians, they turned right back. On the last day of the existence of Constantinople, they were looking out at the walls at the Hellespont thinking that Venetian galleys en masse would come up and save them.\nSo … I support NATO.\nNATO? NATO is supposed to be the answer to the complete destruction of industrial capacity across the post-Christian West? That’s not a viable strategic analysis by a military historian, that’s Salvador Dali multiplied by Jackson Pollock on mushrooms.\nI’ll definitely read his new book. It appears to be ominously relevant, particularly in light of VDH’s own prescriptions.\nDISCUSS ON SG",
  "tags": [
    "books",
    "history",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-05-12T12:27:24+00:00"
}