{
  "url": "https://voxday.net/2024/05/02/dunning-kruger-science/",
  "scraped_at": "2026-01-08T14:31:21.212156",
  "title": "Dunning-Kruger Science",
  "date_display": "May 2, 2024",
  "date_iso": "2024-05-02T14:33:25+00:00",
  "date_from_url": "2024-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The fundamental problem in dealing with scientists in general and biologists in particular is that they literally <a href=\"https://evolutionnews.org/2018/11/wistar-been-there-done-that/\">do not know how stupid they are</a>. Very, very few, if any, of them are even National Merit-level intelligence, which is to say they are not only sub-geniuses, they are relatively low-level midwits. And this was true of them sixty years ago; imagine how much dumber today’s diversity scientists are, especially given their decidedly-inferior modern educations:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The report of the exchange is fascinating, not just because of the substance of the mathematical challenge, but even more because of the logic of the Darwinist response. For example, the mathematician D.S. Ulam argued that it was highly improbable that the eye could have evolved by the accumulation of small mutations, because the number of mutations would have to be so large and the time available was not nearly long enough for them to appear. Sir Peter Medawar and C.H. Waddington responded that Ulam was doing his science backwards; the fact was that the eye had evolved and therefore the mathematical difficulties must only be apparent. Ernst Mayer observed that Ulam’s calculations were based on assumptions that might be unfounded, and concluded that ‘Somehow or other by adjusting these figures we will come out all right. We are comforted by the fact that evolution has occurred.’</p><p>“The Darwinists were trying to be reasonable, but it was as if Ulam had presented equations proving that gravity is too weak a force to prevent us all from floating off into space. Darwinism to them was not a theory open to refutation but a fact to be accounted for, at least until the mathematicians could produce an acceptable alternative. The discussion became particularly heated after a French mathematician named Schützenberger concluded that ‘there is a considerable gap in the neo-Darwinian theory of evolution, and we believe this gap to be of such a nature that it cannot be bridged within the current conception of biology.’ C.H. Waddington thought he saw where this reasoning was headed, and retorted that ‘Your argument is simply that life must have come about by special creation.’ Schützenberger (and anonymous voices from the audience) shouted ‘No!,’ but in fact the mathematicians did not present an alternative.”</p> <cite>Phillip Johnson, <em>Darwin on Trial,</em> 1991</cite></blockquote><p>Now, if it’s not immediately apparent how fundamentally retarded this scientific illogic is, imagine that instead of debating the validity of a scientific theory, these gentlemen were in a court of law, and that Waddington was the prosecutor, Schützenberger the defense attorney, and Sir Peter Medawar the judge.</p><p><strong>Schützenberger: </strong>Your honor, my client could not have committed the attack on the late victim, which the surveillance cameras confirm took place in Philadelphia at 10 PM on April 15th. We have here an airline ticket from Philadelphia to Miami on April 15th that left Philadelphia at 7 PM and landed in Miami at 9 PM, affadavits from fellow passengers and airline stewardesses testifying to my client’s presence on the flight to Miami, and security camera footage from the Miami Hilton at 10 PM, all of which clearly proves my client is not guilty because he was not in Philadelphia at the time the murder took place.</p><p><strong>C.H. Waddington:</strong> So your argument is simply that the victim was killed for his money!</p><p><strong>Schützenberger: </strong>No, that’s not my argument. I am not making any argument about the motivations for the murder and I don’t know who was responsible for it. My argument is that my client did not kill the victim. My client could not have killed the victim. It’s not possible for my client to have killed the victim, because the murder took place in Philadelphia at a time when it has been conclusively demonstrated that he was in Miami!</p><p><strong>C.H. Waddington:</strong> But if the accused didn’t kill the victim, who did? Who is the culprit? What’s the alternative?</p><p><strong>Schützenberger: </strong>I have no idea. I don’t have an alternative.</p><p><strong>C.H. Waddington:</strong> Your honor will note that I’ve asked for an alternative theory and the defense refuses to provide one.</p><p><strong>Sir Peter: </strong>Noted. Is that the best you can do, counselor? Do you have any alternative to the active theory, any alternative at all? I will remind you that the active theory is a consensus that is widely supported by the scientific community, a consensus based on the assumption that your client did, in fact, kill the victim.</p><p><strong>Schützenberger: </strong>Finding the actual killer is not my job, your honor. I’m a defense attorney, not a detective.</p><p><strong>Sir Peter: </strong>The counselor will answer the question.</p><p><strong>Schützenberger: </strong>No, your honor, I do not have an alternative theory.</p><p><strong>Sir Peter: </strong>Very well. Since no alternative theories have been presented, I have no choice but to pronounce the accused guilty. Bailiff, take him away!</p><p>That would be totally absurd, doesn’t it? An absolute parody of justice, truth, and reason. No prosecutor would even attempt to advance such an obviously stupid argument in front of any judge. And yet, that is absolutely, 100-percent confirmed to have been the actual state of what passes for scientific thinking on the subject of evolution for the last sixty years. Don’t <em>ever </em>give scientists even a modicum of intellectual respect on the basis of their profession. Not only have they not earned it, they have repeatedly and reliably demonstrated that their level of philosophical analysis and their ability to discern truth is considerably below that of trial lawyers and public defenders.</p><p>Lest you think I exaggerate, consider the attempt of one true Darwinian believer to defend the science on the basis of criticizing my math, which apparently pains him, even though he admits there is no mathematical error.</p><p><em>I’m no biologist, and I do enjoy math. It pains me to see bad math, which is the only reason I keep on poking at this. Ultimately, it’s not even a math error, the error is in the priors. Asserting that 1600 fixations per generation is the highest possible fixation rate is the root.</em></p><p>The reader will, I hope, note that <a href=\"https://voxday.net/2019/02/07/maximal-mutations/\">the actual number concerned</a> is not “1600 fixations per generation” but rather “Generations per fixed mutation: 1600”.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>BACTERIA<br/>Years: 3,800,000,000<br/>Years per generation: 0.000071347 (37.5 mins per generation)<br/>Generations per fixed mutation: 1600<br/>Years per fixed mutation: 0.114<br/>Maximum fixed mutations: 33,288,000,916</p><p><strong>Source: </strong>Sequencing of 19 whole genomes detected 25 mutations that were fixed in the 40,000 generations of the experiment.<br/><em>NATURE</em>, 2009</p> <cite>Maximal Mutations, Vox Day, February 7, 2019</cite></blockquote><p>I’ll admit that I probably use the description “reprehensibly stupid” too liberally, but this sort of multi-level stupidity really is reprehensible.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-62724\" decoding=\"async\" fetchpriority=\"high\" height=\"458\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/05/image-1.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/05/image-1.png 512w, https://voxday.net/wp-content/uploads/2024/05/image-1-300x268.png 300w\" width=\"512\"><figcaption class=\"wp-element-caption\"><em>When Neo-Darwinians attempt to math.</em></figcaption></img></figure></div><p><em><a href=\"https://social.infogalactic.com/micropost/3668c062-58d0-42c5-a74b-e3a6d32e794c\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The fundamental problem in dealing with scientists in general and biologists in particular is that they literally\ndo not know how stupid they are\n. Very, very few, if any, of them are even National Merit-level intelligence, which is to say they are not only sub-geniuses, they are relatively low-level midwits. And this was true of them sixty years ago; imagine how much dumber today’s diversity scientists are, especially given their decidedly-inferior modern educations:\nThe report of the exchange is fascinating, not just because of the substance of the mathematical challenge, but even more because of the logic of the Darwinist response. For example, the mathematician D.S. Ulam argued that it was highly improbable that the eye could have evolved by the accumulation of small mutations, because the number of mutations would have to be so large and the time available was not nearly long enough for them to appear. Sir Peter Medawar and C.H. Waddington responded that Ulam was doing his science backwards; the fact was that the eye had evolved and therefore the mathematical difficulties must only be apparent. Ernst Mayer observed that Ulam’s calculations were based on assumptions that might be unfounded, and concluded that ‘Somehow or other by adjusting these figures we will come out all right. We are comforted by the fact that evolution has occurred.’\n“The Darwinists were trying to be reasonable, but it was as if Ulam had presented equations proving that gravity is too weak a force to prevent us all from floating off into space. Darwinism to them was not a theory open to refutation but a fact to be accounted for, at least until the mathematicians could produce an acceptable alternative. The discussion became particularly heated after a French mathematician named Schützenberger concluded that ‘there is a considerable gap in the neo-Darwinian theory of evolution, and we believe this gap to be of such a nature that it cannot be bridged within the current conception of biology.’ C.H. Waddington thought he saw where this reasoning was headed, and retorted that ‘Your argument is simply that life must have come about by special creation.’ Schützenberger (and anonymous voices from the audience) shouted ‘No!,’ but in fact the mathematicians did not present an alternative.”\nPhillip Johnson,\nDarwin on Trial,\n1991\nNow, if it’s not immediately apparent how fundamentally retarded this scientific illogic is, imagine that instead of debating the validity of a scientific theory, these gentlemen were in a court of law, and that Waddington was the prosecutor, Schützenberger the defense attorney, and Sir Peter Medawar the judge.\nSchützenberger:\nYour honor, my client could not have committed the attack on the late victim, which the surveillance cameras confirm took place in Philadelphia at 10 PM on April 15th. We have here an airline ticket from Philadelphia to Miami on April 15th that left Philadelphia at 7 PM and landed in Miami at 9 PM, affadavits from fellow passengers and airline stewardesses testifying to my client’s presence on the flight to Miami, and security camera footage from the Miami Hilton at 10 PM, all of which clearly proves my client is not guilty because he was not in Philadelphia at the time the murder took place.\nC.H. Waddington:\nSo your argument is simply that the victim was killed for his money!\nSchützenberger:\nNo, that’s not my argument. I am not making any argument about the motivations for the murder and I don’t know who was responsible for it. My argument is that my client did not kill the victim. My client could not have killed the victim. It’s not possible for my client to have killed the victim, because the murder took place in Philadelphia at a time when it has been conclusively demonstrated that he was in Miami!\nC.H. Waddington:\nBut if the accused didn’t kill the victim, who did? Who is the culprit? What’s the alternative?\nSchützenberger:\nI have no idea. I don’t have an alternative.\nC.H. Waddington:\nYour honor will note that I’ve asked for an alternative theory and the defense refuses to provide one.\nSir Peter:\nNoted. Is that the best you can do, counselor? Do you have any alternative to the active theory, any alternative at all? I will remind you that the active theory is a consensus that is widely supported by the scientific community, a consensus based on the assumption that your client did, in fact, kill the victim.\nSchützenberger:\nFinding the actual killer is not my job, your honor. I’m a defense attorney, not a detective.\nSir Peter:\nThe counselor will answer the question.\nSchützenberger:\nNo, your honor, I do not have an alternative theory.\nSir Peter:\nVery well. Since no alternative theories have been presented, I have no choice but to pronounce the accused guilty. Bailiff, take him away!\nThat would be totally absurd, doesn’t it? An absolute parody of justice, truth, and reason. No prosecutor would even attempt to advance such an obviously stupid argument in front of any judge. And yet, that is absolutely, 100-percent confirmed to have been the actual state of what passes for scientific thinking on the subject of evolution for the last sixty years. Don’t\never\ngive scientists even a modicum of intellectual respect on the basis of their profession. Not only have they not earned it, they have repeatedly and reliably demonstrated that their level of philosophical analysis and their ability to discern truth is considerably below that of trial lawyers and public defenders.\nLest you think I exaggerate, consider the attempt of one true Darwinian believer to defend the science on the basis of criticizing my math, which apparently pains him, even though he admits there is no mathematical error.\nI’m no biologist, and I do enjoy math. It pains me to see bad math, which is the only reason I keep on poking at this. Ultimately, it’s not even a math error, the error is in the priors. Asserting that 1600 fixations per generation is the highest possible fixation rate is the root.\nThe reader will, I hope, note that\nthe actual number concerned\nis not “1600 fixations per generation” but rather “Generations per fixed mutation: 1600”.\nBACTERIA\nYears: 3,800,000,000\nYears per generation: 0.000071347 (37.5 mins per generation)\nGenerations per fixed mutation: 1600\nYears per fixed mutation: 0.114\nMaximum fixed mutations: 33,288,000,916\nSource:\nSequencing of 19 whole genomes detected 25 mutations that were fixed in the 40,000 generations of the experiment.\nNATURE\n, 2009\nMaximal Mutations, Vox Day, February 7, 2019\nI’ll admit that I probably use the description “reprehensibly stupid” too liberally, but this sort of multi-level stupidity really is reprehensible.\nWhen Neo-Darwinians attempt to math.\nDISCUSS ON SG",
  "tags": [
    "evolution",
    "philosophy",
    "science",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-05-02T15:00:22+00:00"
}