{
  "url": "https://voxday.net/2024/05/05/genghis-khan-and-the-refinement-of-mittens/",
  "scraped_at": "2026-01-08T14:31:54.725899",
  "title": "How Genghis Khan’s MITTENS Strangled Darwin",
  "date_display": "May 5, 2024",
  "date_iso": "2024-05-05T13:28:22+00:00",
  "date_from_url": "2024-05-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the reasons I occasionally find it profitable to engage with anklebiters is that they help me get a handle on what I need to do to bridge the communication gap with normal individuals. No offense, but I often can’t tell the difference between the average midwit and the average retard, or determine precisely where along the logic rollercoaster someone is going to fall off without being provided the assistance of some sort of safety rails keeping them on the track.</p><p>So, it was with a bit of chagrin that I realized how, despite my best efforts to make every element of my case for <a href=\"https://voxday.net/2019/02/07/maximal-mutations/\">the Mathematical Impossibility of The Theory of Evolution by Natural Selection</a> (MITTENS) easily intelligible, I had made precisely the same mistake that the symposium physicists did in 1966. Which is to say, I was requiring my critics to possess an ability to make a correct logical leap that is observably beyond the ability of most people, and had thereby rendered what should have been an incontrovertible argument theoretically contestable in the eyes of the average individual. MPAI strikes again.</p><p>Fortunately, a Darwinian true believer who lacked the necessary ability chose to inform me on Gab that the math in MITTENS was both “bad” and “wrong” without bothering to correct it.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I’m no biologist, and I do enjoy math. It pains me to see bad math, which is the only reason I keep on poking at this. Ultimately, it’s not even a math error, the error is in the priors. Asserting that 1600 fixations per generation is the highest possible fixation rate is the root.</p></blockquote><p>First, it’s worth pointing out that setting a ceiling of 1600 fixations per generation would not be an error, and in fact is considerably higher than the highest possible fixation rate ever imagined by anyone. Second, I responded to him by pointing out that since he had somehow managed to reverse the relationship between generations and fixations, and was therefore asserting that it was reasonable to imagine a blistering and hitherto-unseen super-parallel rate of 1,600 fixations per generation, it was unlikely that he had truly been able to detect a mathematical error in what, after all, is some very basic math.</p><p>It will probably not surprise you to know that this obvious error neither stopped him nor slowed him down in the slightest:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>If I said 1600 per generation, that was a typo. I am flawed, I do make the occasional mistake. That’s the rate for bacteria. Using it for chimps requires more than simply asserting it is so. I will concede that the math itself is correct. Vox is capable of multiplication. The analysis is flawed because the input is incorrect.</p><p>It is like taking the top speed of a snail (Best I could find is 0.2 miles per hour for the giant African land snail) and using that to claim we never went to the moon. 226000 miles / 0.2 miles per hour = 1,130,000 hours = 129 years. It has been less than 129 years since the Apollo program, so we can’t have made it there yet.</p><p>If you use the wrong starting values, the math leads you astray.</p></blockquote><p>I responded by observing that now he had reversed the appropriate analogy as well. My argument for the mathematical impossibility of the theory of evolution by natural selection is much more akin to pointing out that since the maximum speed of a Moon rocket is the 24,791 mph recorded by Apollo 10, and since it took three days, three hours and 49 minutes for Apollo 11 to reach the Moon, any claim that a Giant African Land Snail travelling at 0.2 mph had flown to the Moon under its own power in less than 24 hours must be false.</p><p>This second correction somehow did not dissuade him from continuing to claim that while my math was admittedly correct, the mathematical argument it supported was still “weak”.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The rate of mutation is typically cited per individual per generation. The rate of fixation is of course a population-wide measure. The experiment in the 2009 Nature paper measured a fixation rate of 1 fixation per 1600 generations. The bacteria in the experiment have a rate of mutation of about 1/1000 per generation per individual.</p><p>The rate of fixation of neutral mutations is proportional to the rate of mutation (and with certain simplifying assumptions, is equal to the rate of mutation per individual per generation).</p><p>The rate of mutation per generation per individual in chimps and humans is on the rough order of 30, over four orders of magnitude higher than that of the bacteria. The rate of fixation will thus be proportionately higher. Using the correct rate of fixation produces numbers comparable to the ones evolutionary geneticists use in molecular clock calculations.</p><p>This is why Vox’s “mathematical” argument is weak – it’s using an invalid prior to come to an incorrect conclusion.</p></blockquote><p>I therefore observed that in his attempted defense of neo-Darwinism, he was asserting that mutations fix four orders of magnitude faster ACROSS THE ENTIRE GLOBALLY-DISTRIBUTED SPECIES in both humans and chimpanzees alike than across a small population of laboratory bacteria, which is total nonsense because the fixation rate in laboratory bacteria in the 2009 study published in <em>NATURE </em>is the fastest ever observed by scientists.</p><p>I also pointed out his extrapolation that more mutations occurring in a growing, geographically-distributed, and more genetically complex species necessarily means that species will fixate much more quickly than the simpler species was a logical error. To be more precise, his baseless assertion was absolute and utter nonsense; since chimpanzees and humans are far more widely distributed than bacteria living in a single petri dish, any advantageous mutations making an appearance will tend to fixate much more slowly in their populations than in the bacteria.</p><p>In fact, the theory of natural selection even suggests that what is an advantageous mutation in one geographical area might well be a disadvantage elsewhere, thereby preventing its fixation. He was literally appealing to his own imagination rather than math, science, or any observable evidence, and he proved quite willing to continue standing upon that imaginary foundation.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Your math is still wrong. Fixation proceeds in parallel. The rate of fixation is equal to the rate of mutation, and the latter can be measured. (Former’s a touch harder, but some bacterial experiments have done it, and confirm the rate.) The rate of mutation needed for the genetic clock is within a factor of two of what’s observed now.</p></blockquote><p>He was, of course, incorrect, as he was citing Wikipedia or some other Internet source without understanding it. As it happens, according to the scientific papers, the rate of fixation is absolutely <span style=\"text-decoration: underline;\">not</span> equal to the rate of mutation for a) any non-static population, or, b) any beneficial mutation, which happens to be the only kind of mutation that is relevant to the topic of fixation. Also, my critic apparently did not know that the original average of 1,600 generations per fixation reported in the <em>NATURE </em>study specifically included several mutations fixed in parallel.</p><p>However, his stubborn insistence that my argument was insufficiently conclusive made me realize that I had unwittingly gifted him the out to which he was clinging by erroneously expecting him to be able to accept what I considered to be obvious: I was assuming that the fastest mutational fixations ever observed in laboratory bacteria were faster, in generational terms, than any fixation occurring in a more genetically complicated species dwelling in the wild. Just as relying upon probability rendered the physicists’ math-based arguments too difficult for the innumerate biologists of the 1966 symposium to understand and accept, my failure to provide a specific example of natural fixation rates among species with higher mutation rates gave my logic-challenged critic sufficient cover to retreat to an ontological <em>argumentum ad imaginariam</em>.</p><p>And while I am aware of no substantive studies on mutational fixation rates in humans, which is understandable given the challenge presented by the time frames involved, there does happen to be the famous case of Genghis Khan, who is popularly supposed to have been the male ancestor for nearly one-quarter of the human race. Upon review, this turned out to be a fairly serious exaggeration of his actual genetic influence, but it proved useful nonetheless. And, better yet, his genetic legacy had already been analyzed in terms of mutational fixation!</p><p><strong><em>The Genetic Legacy of the Mongols: a groundbreaking 2003 historical genetics study. </em></strong></p><p><em>When sampling DNA from 16 populations across Asia, researchers were surprised to find that nearly one in 12 men on the continent shared an unusual Y-chromosomal lineage – one that they said likely came from Genghis Khan. The genetic line showed that about 8 percent of men in the region of the former Mongol empire, and therefore about one in 200 worldwide, share one single male ancestor.</em></p><p><em>This rise in frequency, if spread evenly over ∼34 generations, would require an average increase by a factor of ∼1.36 per generation and is thus comparable to the most extreme selective events observed in natural populations, such as the spread of melanic moths in 19th-century England in response to industrial pollution (Edleston 1865).</em></p><p>Note two things before we get to the math. First, based on the 2003 date of publication, the researchers were using a period of 23.44 years per generation, distinct from the 20 years per generation I’ve been using. They also appear to have used a slightly starting date for unknown reasons. But these differences are irrelevant and I only mention them to explain the different base number of generations: 40.85 vs ~34. Second, pay very close attention to this phrase: <strong><em>“is thus comparable to the most extreme selective events observed in natural populations”</em></strong>.</p><p>Genghis Khan’s third son, and successor, was born in 1186. It took 817 years, or 40.85 generations of 20 years, for his father’s genes to propagate sufficiently to reach 0.5 percent (the 1 in 200 worldwide figure reported in the study expressed in percentage terms) of a species-wide fixation. At this rate, which is “comparable to the most extreme selective events observed in natural populations”, it would take 8,170 generations (40.85 generations x 200) and 163,400 years to fixate a hypothetical “Genghis Khan gene” across the human population, although just to be clear, there is no evidence that there is any genuine mutational advantage to being descended from the individual who was the greatest warlord in human history as well as one of its more conspicuous collectors of fertile young concubines. This application of sexual selection, however one-sided, rather than natural selection per se, means that 8,170 generations per fixation is almost certainly a very conservative estimate.</p><p>This means that the fastest observed rate of practical partial fixation in the natural human population has run at 19.58 percent of the fastest-ever rate of observed fixation in laboratory bacteria. As the logic used to construct MITTENS correctly suggested, the bacteria in the lab have been observed to fixate mutations at a rate <em>at least</em> five times faster than the human population has ever been observed to do.</p><p>Since evolution by natural selection has now been reduced to purely ontological arguments, what sort of fitness advantage can you possibly imagine that would be more powerful than the sexual-selection advantage the literally rapacious Khan of Khans himself was historically known to utilize?</p><p>I’ll lay out the math in analogical terms that everyone can easily grasp in a future post, but for now, the genetic legacy of Genghis Khan should suffice to address any remaining structural objections to the legitimacy of MITTENS and its conclusive falsification of the Neo-Darwinian synthesis.</p><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-62773\" decoding=\"async\" fetchpriority=\"high\" height=\"512\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2024/05/image-10.png\" srcset=\"https://voxday.net/wp-content/uploads/2024/05/image-10.png 512w, https://voxday.net/wp-content/uploads/2024/05/image-10-300x300.png 300w, https://voxday.net/wp-content/uploads/2024/05/image-10-150x150.png 150w\" width=\"512\"/></figure></div><p><strong>UPDATE: </strong>You might think I’m exaggerating the stupidity and the innumeracy of the biologists. I’m not. They legitimately do not comprehend the existence of the concept of an “average”, much less have the ability to grasp MITTENS. This is an actual quote from one self-appointed defender of Darwin:</p><p>“<em>This so-called math isn’t necessary to evolution since there is no one set speed of evolution or even of mutation.</em>“</p><p><em><a href=\"https://social.infogalactic.com/micropost/e7333b44-a61b-4434-bbd6-4b27f59d6121\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "One of the reasons I occasionally find it profitable to engage with anklebiters is that they help me get a handle on what I need to do to bridge the communication gap with normal individuals. No offense, but I often can’t tell the difference between the average midwit and the average retard, or determine precisely where along the logic rollercoaster someone is going to fall off without being provided the assistance of some sort of safety rails keeping them on the track.\nSo, it was with a bit of chagrin that I realized how, despite my best efforts to make every element of my case for\nthe Mathematical Impossibility of The Theory of Evolution by Natural Selection\n(MITTENS) easily intelligible, I had made precisely the same mistake that the symposium physicists did in 1966. Which is to say, I was requiring my critics to possess an ability to make a correct logical leap that is observably beyond the ability of most people, and had thereby rendered what should have been an incontrovertible argument theoretically contestable in the eyes of the average individual. MPAI strikes again.\nFortunately, a Darwinian true believer who lacked the necessary ability chose to inform me on Gab that the math in MITTENS was both “bad” and “wrong” without bothering to correct it.\nI’m no biologist, and I do enjoy math. It pains me to see bad math, which is the only reason I keep on poking at this. Ultimately, it’s not even a math error, the error is in the priors. Asserting that 1600 fixations per generation is the highest possible fixation rate is the root.\nFirst, it’s worth pointing out that setting a ceiling of 1600 fixations per generation would not be an error, and in fact is considerably higher than the highest possible fixation rate ever imagined by anyone. Second, I responded to him by pointing out that since he had somehow managed to reverse the relationship between generations and fixations, and was therefore asserting that it was reasonable to imagine a blistering and hitherto-unseen super-parallel rate of 1,600 fixations per generation, it was unlikely that he had truly been able to detect a mathematical error in what, after all, is some very basic math.\nIt will probably not surprise you to know that this obvious error neither stopped him nor slowed him down in the slightest:\nIf I said 1600 per generation, that was a typo. I am flawed, I do make the occasional mistake. That’s the rate for bacteria. Using it for chimps requires more than simply asserting it is so. I will concede that the math itself is correct. Vox is capable of multiplication. The analysis is flawed because the input is incorrect.\nIt is like taking the top speed of a snail (Best I could find is 0.2 miles per hour for the giant African land snail) and using that to claim we never went to the moon. 226000 miles / 0.2 miles per hour = 1,130,000 hours = 129 years. It has been less than 129 years since the Apollo program, so we can’t have made it there yet.\nIf you use the wrong starting values, the math leads you astray.\nI responded by observing that now he had reversed the appropriate analogy as well. My argument for the mathematical impossibility of the theory of evolution by natural selection is much more akin to pointing out that since the maximum speed of a Moon rocket is the 24,791 mph recorded by Apollo 10, and since it took three days, three hours and 49 minutes for Apollo 11 to reach the Moon, any claim that a Giant African Land Snail travelling at 0.2 mph had flown to the Moon under its own power in less than 24 hours must be false.\nThis second correction somehow did not dissuade him from continuing to claim that while my math was admittedly correct, the mathematical argument it supported was still “weak”.\nThe rate of mutation is typically cited per individual per generation. The rate of fixation is of course a population-wide measure. The experiment in the 2009 Nature paper measured a fixation rate of 1 fixation per 1600 generations. The bacteria in the experiment have a rate of mutation of about 1/1000 per generation per individual.\nThe rate of fixation of neutral mutations is proportional to the rate of mutation (and with certain simplifying assumptions, is equal to the rate of mutation per individual per generation).\nThe rate of mutation per generation per individual in chimps and humans is on the rough order of 30, over four orders of magnitude higher than that of the bacteria. The rate of fixation will thus be proportionately higher. Using the correct rate of fixation produces numbers comparable to the ones evolutionary geneticists use in molecular clock calculations.\nThis is why Vox’s “mathematical” argument is weak – it’s using an invalid prior to come to an incorrect conclusion.\nI therefore observed that in his attempted defense of neo-Darwinism, he was asserting that mutations fix four orders of magnitude faster ACROSS THE ENTIRE GLOBALLY-DISTRIBUTED SPECIES in both humans and chimpanzees alike than across a small population of laboratory bacteria, which is total nonsense because the fixation rate in laboratory bacteria in the 2009 study published in\nNATURE\nis the fastest ever observed by scientists.\nI also pointed out his extrapolation that more mutations occurring in a growing, geographically-distributed, and more genetically complex species necessarily means that species will fixate much more quickly than the simpler species was a logical error. To be more precise, his baseless assertion was absolute and utter nonsense; since chimpanzees and humans are far more widely distributed than bacteria living in a single petri dish, any advantageous mutations making an appearance will tend to fixate much more slowly in their populations than in the bacteria.\nIn fact, the theory of natural selection even suggests that what is an advantageous mutation in one geographical area might well be a disadvantage elsewhere, thereby preventing its fixation. He was literally appealing to his own imagination rather than math, science, or any observable evidence, and he proved quite willing to continue standing upon that imaginary foundation.\nYour math is still wrong. Fixation proceeds in parallel. The rate of fixation is equal to the rate of mutation, and the latter can be measured. (Former’s a touch harder, but some bacterial experiments have done it, and confirm the rate.) The rate of mutation needed for the genetic clock is within a factor of two of what’s observed now.\nHe was, of course, incorrect, as he was citing Wikipedia or some other Internet source without understanding it. As it happens, according to the scientific papers, the rate of fixation is absolutely\nnot\nequal to the rate of mutation for a) any non-static population, or, b) any beneficial mutation, which happens to be the only kind of mutation that is relevant to the topic of fixation. Also, my critic apparently did not know that the original average of 1,600 generations per fixation reported in the\nNATURE\nstudy specifically included several mutations fixed in parallel.\nHowever, his stubborn insistence that my argument was insufficiently conclusive made me realize that I had unwittingly gifted him the out to which he was clinging by erroneously expecting him to be able to accept what I considered to be obvious: I was assuming that the fastest mutational fixations ever observed in laboratory bacteria were faster, in generational terms, than any fixation occurring in a more genetically complicated species dwelling in the wild. Just as relying upon probability rendered the physicists’ math-based arguments too difficult for the innumerate biologists of the 1966 symposium to understand and accept, my failure to provide a specific example of natural fixation rates among species with higher mutation rates gave my logic-challenged critic sufficient cover to retreat to an ontological\nargumentum ad imaginariam\n.\nAnd while I am aware of no substantive studies on mutational fixation rates in humans, which is understandable given the challenge presented by the time frames involved, there does happen to be the famous case of Genghis Khan, who is popularly supposed to have been the male ancestor for nearly one-quarter of the human race. Upon review, this turned out to be a fairly serious exaggeration of his actual genetic influence, but it proved useful nonetheless. And, better yet, his genetic legacy had already been analyzed in terms of mutational fixation!\nThe Genetic Legacy of the Mongols: a groundbreaking 2003 historical genetics study.\nWhen sampling DNA from 16 populations across Asia, researchers were surprised to find that nearly one in 12 men on the continent shared an unusual Y-chromosomal lineage – one that they said likely came from Genghis Khan. The genetic line showed that about 8 percent of men in the region of the former Mongol empire, and therefore about one in 200 worldwide, share one single male ancestor.\nThis rise in frequency, if spread evenly over ∼34 generations, would require an average increase by a factor of ∼1.36 per generation and is thus comparable to the most extreme selective events observed in natural populations, such as the spread of melanic moths in 19th-century England in response to industrial pollution (Edleston 1865).\nNote two things before we get to the math. First, based on the 2003 date of publication, the researchers were using a period of 23.44 years per generation, distinct from the 20 years per generation I’ve been using. They also appear to have used a slightly starting date for unknown reasons. But these differences are irrelevant and I only mention them to explain the different base number of generations: 40.85 vs ~34. Second, pay very close attention to this phrase:\n“is thus comparable to the most extreme selective events observed in natural populations”\n.\nGenghis Khan’s third son, and successor, was born in 1186. It took 817 years, or 40.85 generations of 20 years, for his father’s genes to propagate sufficiently to reach 0.5 percent (the 1 in 200 worldwide figure reported in the study expressed in percentage terms) of a species-wide fixation. At this rate, which is “comparable to the most extreme selective events observed in natural populations”, it would take 8,170 generations (40.85 generations x 200) and 163,400 years to fixate a hypothetical “Genghis Khan gene” across the human population, although just to be clear, there is no evidence that there is any genuine mutational advantage to being descended from the individual who was the greatest warlord in human history as well as one of its more conspicuous collectors of fertile young concubines. This application of sexual selection, however one-sided, rather than natural selection per se, means that 8,170 generations per fixation is almost certainly a very conservative estimate.\nThis means that the fastest observed rate of practical partial fixation in the natural human population has run at 19.58 percent of the fastest-ever rate of observed fixation in laboratory bacteria. As the logic used to construct MITTENS correctly suggested, the bacteria in the lab have been observed to fixate mutations at a rate\nat least\nfive times faster than the human population has ever been observed to do.\nSince evolution by natural selection has now been reduced to purely ontological arguments, what sort of fitness advantage can you possibly imagine that would be more powerful than the sexual-selection advantage the literally rapacious Khan of Khans himself was historically known to utilize?\nI’ll lay out the math in analogical terms that everyone can easily grasp in a future post, but for now, the genetic legacy of Genghis Khan should suffice to address any remaining structural objections to the legitimacy of MITTENS and its conclusive falsification of the Neo-Darwinian synthesis.\nUPDATE:\nYou might think I’m exaggerating the stupidity and the innumeracy of the biologists. I’m not. They legitimately do not comprehend the existence of the concept of an “average”, much less have the ability to grasp MITTENS. This is an actual quote from one self-appointed defender of Darwin:\n“\nThis so-called math isn’t necessary to evolution since there is no one set speed of evolution or even of mutation.\n“\nDISCUSS ON SG",
  "tags": [
    "anklebiters",
    "evolution",
    "history",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-05-07T22:41:30+00:00"
}