{
  "url": "https://voxday.net/2024/05/02/the-secret-weapon/",
  "scraped_at": "2026-01-08T14:31:19.371032",
  "title": "The Secret Weapon",
  "date_display": "May 2, 2024",
  "date_iso": "2024-05-02T10:16:21+00:00",
  "date_from_url": "2024-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You can’t make yourself smarter, but you can make yourself more prepared than everyone else. One of the ways I was able to break into the game industry was because I knew more about all of the people involved than anyone except a few of the deepest and most experienced insiders.</p><p>How did I do that despite being just out of college, with zero contacts in the industry, and never having attended a single industry event? I studied every single issue of <em>Computer Gaming World</em> like a seminary student performing exegesis on a single Bible verse, putting every single name I could find into a database with their position, company, and associated titles. So, when I finally attended CGDC for the first time, I knew most of the guys there and could speak intelligently with them about their past and present projects.</p><p>Not only that, but when they would recognize someone they knew, I’d be able to say something like “Carter… is that the Carter from SSI?” Which, almost inevitably, would lead to a friendly introduction from a trusted source. By my second conference, I was already acquainted with two-thirds of the devs there; by the third one, I was speaking at the conference, regarded by most as one of the old school, and was openly recognized a member of the CGW team, being the only active dev who was permitted to write reviews for the magazine.</p><p>I truly loved those days. Epic, Blizzard, Activision… the corporate monsters of today were just guys like everyone else. I’ve never felt a sense of unlimited possibility like that before or since.</p><p>Paul Pierce, the NBA champion, clearly knew the power of researching people. He was the Celtics’ longtime play-by-play announcer’s favorite, but <a href=\"https://www.si.com/nba/2024/05/01/celtics-broadcaster-mike-gorman-signs-off\">there was more to their close relationship</a> than mere mutual affection:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>People used to say, ‘Boy, it’s great the relationship you have with Paul Pierce,’ because every time, second time through the layup line, Paul would come and give me a hug no matter where I was. People said that’s great. Well, what was happening was Paul would give me the hug and say, ‘Who we got tonight [officiating the game]?’ And I’d say, ‘It’s Chris, Danny’s the Black guy, and Joe is the white guy. He’s kind of bald.’ And then Paul would go through around the layup line, I’d see him go, ‘Hey, Danny, how are you tonight, Paul? What’s happening over there?’ And I swear it used to buy him one or two whistles every game at least.”</p></blockquote><p>There is really no excuse for not bothering to put in the effort of truly knowing the field you’re in. It takes nothing but persistence and a little time. And yet, not one man in a thousand ever bothers to make even minimal efforts in this direction, despite the fact that it reliably pays off no matter what the industry or field.</p><p><em><a href=\"https://social.infogalactic.com/micropost/a015d7b1-81cb-4089-9ddc-1445450ae8fa\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "You can’t make yourself smarter, but you can make yourself more prepared than everyone else. One of the ways I was able to break into the game industry was because I knew more about all of the people involved than anyone except a few of the deepest and most experienced insiders.\nHow did I do that despite being just out of college, with zero contacts in the industry, and never having attended a single industry event? I studied every single issue of\nComputer Gaming World\nlike a seminary student performing exegesis on a single Bible verse, putting every single name I could find into a database with their position, company, and associated titles. So, when I finally attended CGDC for the first time, I knew most of the guys there and could speak intelligently with them about their past and present projects.\nNot only that, but when they would recognize someone they knew, I’d be able to say something like “Carter… is that the Carter from SSI?” Which, almost inevitably, would lead to a friendly introduction from a trusted source. By my second conference, I was already acquainted with two-thirds of the devs there; by the third one, I was speaking at the conference, regarded by most as one of the old school, and was openly recognized a member of the CGW team, being the only active dev who was permitted to write reviews for the magazine.\nI truly loved those days. Epic, Blizzard, Activision… the corporate monsters of today were just guys like everyone else. I’ve never felt a sense of unlimited possibility like that before or since.\nPaul Pierce, the NBA champion, clearly knew the power of researching people. He was the Celtics’ longtime play-by-play announcer’s favorite, but\nthere was more to their close relationship\nthan mere mutual affection:\nPeople used to say, ‘Boy, it’s great the relationship you have with Paul Pierce,’ because every time, second time through the layup line, Paul would come and give me a hug no matter where I was. People said that’s great. Well, what was happening was Paul would give me the hug and say, ‘Who we got tonight [officiating the game]?’ And I’d say, ‘It’s Chris, Danny’s the Black guy, and Joe is the white guy. He’s kind of bald.’ And then Paul would go through around the layup line, I’d see him go, ‘Hey, Danny, how are you tonight, Paul? What’s happening over there?’ And I swear it used to buy him one or two whistles every game at least.”\nThere is really no excuse for not bothering to put in the effort of truly knowing the field you’re in. It takes nothing but persistence and a little time. And yet, not one man in a thousand ever bothers to make even minimal efforts in this direction, despite the fact that it reliably pays off no matter what the industry or field.\nDISCUSS ON SG",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-05-02T10:16:24+00:00"
}