{
  "url": "https://voxday.net/2024/05/22/theres-always-one/",
  "scraped_at": "2026-01-08T14:33:08.606586",
  "title": "There’s Always One",
  "date_display": "May 22, 2024",
  "date_iso": "2024-05-22T21:58:36+00:00",
  "date_from_url": "2024-05-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I pointed out a few obvious observations about tattoos <a href=\"https://sigmagame.substack.com/p/the-tattoo-fail\">at Sigma Game</a>. I know you’ll find this very hard to believe, but one reader shared a personal anecdote that proved those observations are completely unfounded.</p><p><strong>READER: </strong><em>Huh, my partner has tattoos and also a very good job at an old company with renowned retirement benefits. As in, an extremely conventional employer. He’s doubled his income in the past three years and recently got his annual salary in shares as a bonus.</em></p><p><strong>VD: </strong>Well, your unverifiable personal anecdote is obviously conclusive and clearly obviates every other bit of statistical and observational data on the subject. We now understand that tattoos are sexy, high-class, and will only help one’s career progress. You must be exceptionally nice and pretty to have locked down such an exceptional partner. You should probably tattoo FUKC on your forehead; I’m sure it will do wonders for your future prospects, which we will follow with interest.</p><p><em><a href=\"https://social.infogalactic.com/micropost/500171ac-7309-4e55-8fe5-da95c80e9803\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I pointed out a few obvious observations about tattoos\nat Sigma Game\n. I know you’ll find this very hard to believe, but one reader shared a personal anecdote that proved those observations are completely unfounded.\nREADER:\nHuh, my partner has tattoos and also a very good job at an old company with renowned retirement benefits. As in, an extremely conventional employer. He’s doubled his income in the past three years and recently got his annual salary in shares as a bonus.\nVD:\nWell, your unverifiable personal anecdote is obviously conclusive and clearly obviates every other bit of statistical and observational data on the subject. We now understand that tattoos are sexy, high-class, and will only help one’s career progress. You must be exceptionally nice and pretty to have locked down such an exceptional partner. You should probably tattoo FUKC on your forehead; I’m sure it will do wonders for your future prospects, which we will follow with interest.\nDISCUSS ON SG",
  "tags": [
    "philosophy",
    "Sigma Game"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-05-22T21:58:38+00:00"
}