{
  "url": "https://voxday.net/2024/05/23/three-simple-steps-to-sigma/",
  "scraped_at": "2026-01-08T14:33:11.890540",
  "title": "Three Simple Steps to Sigma",
  "date_display": "May 23, 2024",
  "date_iso": "2024-05-23T14:23:56+00:00",
  "date_from_url": "2024-05-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s really quite easy if you know what to do. <a href=\"https://sigmagame.substack.com/p/be-a-sigma-male-with-this-one-simple\">From Sigma Game</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I’ll be honest. Given my talent for unorthodox thinking and my ability to write more or less coherently, I assumed from a fairly young age that I would leave some intellectual legacy behind. Nothing particularly major on the scale of an Aristotle, a Thomas Aquinas, or an Adam Smith, but something more on the level of a Hermann Hesse, a Samuel Huntington, or a John Bagot Glubb.</p><p>Umberto Eco, I felt, probably represented my potential ceiling, although my inability to execute <em>Summa Elvetica</em> as I’d envisioned it made it pretty clear that even the Eco strata was beyond me. <em>C’est la vie.</em> It’s better to aim high and fall short than content oneself with mediocrity.</p><p>And while my small contributions to gaming, literature, science, and theology are likely to survive in some anonymous capacity to be expanded upon by future intellectuals, it’s been a real surprise to discover that the Socio-Sexual Hierarchy, and the concept of the Sigma Male in particular, have gone viral to the point that they are being adopted and applied, however erroneously, to a wide variety of cultural applications. Well and good, even if Sigma is literally the least important of the various behavioral profiles to understand for practical purposes.</p><p>But it’s more than a little bizarre to see the way AI systems have ingested and processed the concept, to the point that it has now even incorporated my personal clothing preferences…</p></blockquote><p>My intellectual ambition circa 2005 to 2015 was to one day write the <em>Summa Economica</em>, doing for economics what Thomas Aquinas did for theology. Now my ambitions are considerably more curtailed, as I’m just hoping to be able to publish Steve Keen’s magnum opus, finish <em>Arts of Dark and Light</em>, and wrap up the definitive work on the SSH before my ability to string words together goes the way of Mr. Martin and other washed-up writers.</p><p><em><a href=\"https://social.infogalactic.com/micropost/97456068-e8a3-4b2e-a89f-62eabb213c7d\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "It’s really quite easy if you know what to do.\nFrom Sigma Game\n:\nI’ll be honest. Given my talent for unorthodox thinking and my ability to write more or less coherently, I assumed from a fairly young age that I would leave some intellectual legacy behind. Nothing particularly major on the scale of an Aristotle, a Thomas Aquinas, or an Adam Smith, but something more on the level of a Hermann Hesse, a Samuel Huntington, or a John Bagot Glubb.\nUmberto Eco, I felt, probably represented my potential ceiling, although my inability to execute\nSumma Elvetica\nas I’d envisioned it made it pretty clear that even the Eco strata was beyond me.\nC’est la vie.\nIt’s better to aim high and fall short than content oneself with mediocrity.\nAnd while my small contributions to gaming, literature, science, and theology are likely to survive in some anonymous capacity to be expanded upon by future intellectuals, it’s been a real surprise to discover that the Socio-Sexual Hierarchy, and the concept of the Sigma Male in particular, have gone viral to the point that they are being adopted and applied, however erroneously, to a wide variety of cultural applications. Well and good, even if Sigma is literally the least important of the various behavioral profiles to understand for practical purposes.\nBut it’s more than a little bizarre to see the way AI systems have ingested and processed the concept, to the point that it has now even incorporated my personal clothing preferences…\nMy intellectual ambition circa 2005 to 2015 was to one day write the\nSumma Economica\n, doing for economics what Thomas Aquinas did for theology. Now my ambitions are considerably more curtailed, as I’m just hoping to be able to publish Steve Keen’s magnum opus, finish\nArts of Dark and Light\n, and wrap up the definitive work on the SSH before my ability to string words together goes the way of Mr. Martin and other washed-up writers.\nDISCUSS ON SG",
  "tags": [
    "philosophy",
    "Rules of Writing",
    "Sigma Game"
  ],
  "categories": [],
  "sitemap_lastmod": "2024-05-23T14:23:58+00:00"
}