{
  "url": "https://voxday.net/2022/01/10/color-revolution-fail/",
  "scraped_at": "2026-01-08T13:05:59.495141",
  "title": "Color Revolution Fail",
  "date_display": "January 10, 2022",
  "date_iso": "2022-01-10T19:40:34+00:00",
  "date_from_url": "2022-01-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Vladimir Putin confirms that the unrest in Kazakhstan <a href=\"https://www.rt.com/russia/545553-kazakhstan-facing-maidan-tactics-putin/\">was another attempted color revolution</a> by the Promethean neocons. Unlike Ukraine, this attempted coup failed thanks to the prompt action by the Russian Federation and the other CSTO states:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Violent and bloody clashes in Kazakhstan are a form of aggression leveled against the country, Russian President Vladimir Putin has said, claiming the same tactics used in Ukraine in 2014 were deployed to coordinate protests.</p><p>Speaking as part of a meeting of the Collective Security Treaty Organization (CSTO) on Monday, Putin said that the mutual defense pact’s troops were working to secure the Central Asian nation after armed groups captured a number of key facilities and effectively took control of its largest city, Almaty. Kazakh President Kassym-Jomart Tokayev requested military support last week, insisting that the country was under attack from foreign terrorists.</p><p>“Well-organized and well-controlled groups of militants were used,” President Putin alleged, “including those who had apparently been trained in terrorist camps abroad.” At the same time, he went on, “Maidan technologies” were used to support the rioters and share information, akin to those that led to the ousting of the Ukrainian government.</p></blockquote><p>This is a serious <em>casus belli</em>, and if the Fake Biden administration refuses to accede to Russia’s reasonable demands for security and non-interference in the states that border it in the current Geneva talks, don’t be surprised if the Iran-Russia-China alliance does not pass Go, does not collect $200, but proceeds directly to war.</p><p><em><a href=\"https://social.infogalactic.com/micropost/36d1a5c7-040c-4d4f-a493-b8f1c43ef852\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Vladimir Putin confirms that the unrest in Kazakhstan\nwas another attempted color revolution\nby the Promethean neocons. Unlike Ukraine, this attempted coup failed thanks to the prompt action by the Russian Federation and the other CSTO states:\nViolent and bloody clashes in Kazakhstan are a form of aggression leveled against the country, Russian President Vladimir Putin has said, claiming the same tactics used in Ukraine in 2014 were deployed to coordinate protests.\nSpeaking as part of a meeting of the Collective Security Treaty Organization (CSTO) on Monday, Putin said that the mutual defense pact’s troops were working to secure the Central Asian nation after armed groups captured a number of key facilities and effectively took control of its largest city, Almaty. Kazakh President Kassym-Jomart Tokayev requested military support last week, insisting that the country was under attack from foreign terrorists.\n“Well-organized and well-controlled groups of militants were used,” President Putin alleged, “including those who had apparently been trained in terrorist camps abroad.” At the same time, he went on, “Maidan technologies” were used to support the rioters and share information, akin to those that led to the ousting of the Ukrainian government.\nThis is a serious\ncasus belli\n, and if the Fake Biden administration refuses to accede to Russia’s reasonable demands for security and non-interference in the states that border it in the current Geneva talks, don’t be surprised if the Iran-Russia-China alliance does not pass Go, does not collect $200, but proceeds directly to war.\nDISCUSS ON SG",
  "tags": [
    "neocons",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-01-10T19:40:37+00:00"
}