{
  "url": "https://voxday.net/2022/01/20/evil-always-eats-its-own/",
  "scraped_at": "2026-01-08T13:07:02.721242",
  "title": "Evil Always Eats Its Own",
  "date_display": "January 20, 2022",
  "date_iso": "2022-01-20T15:02:14+00:00",
  "date_from_url": "2022-01-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Those who have taken the ticket or are celebrated for their utility in building the false case against God had better enjoy their public adulation while it lasts. Even the most famous and well-respected scientists, who were lauded for their brilliance and whose work was absolutely integral in constructing the false scientific edifice of evolution by natural selection, are discovering that they and their work will be discredited and dishonored once the satanic narrative moves beyond them, as demonstrated by this article in <em>Scientific American</em> <a href=\"https://www.scientificamerican.com/article/the-complicated-legacy-of-e-o-wilson/?amp;text=The\">denigrating the legacy of evolutionary biologist E.O. Wilson</a>:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>With the death of biologist E. O. Wilson on Sunday, I find myself again reflecting on the complicated legacies of scientists whose works are built on racist ideas and how these ideas came to define our understanding of the world.</p><p>After a long clinical career as a registered nurse, I became a laboratory-trained scientist as researchers mapped the first draft of the human genome. It was during this time that I intimately familiarized myself with Wilson’s work and his dangerous ideas on what factors influence human behavior.</p><p>His influential text Sociobiology: The New Synthesis contributed to the false dichotomy of nature versus nurture and spawned an entire field of behavioral psychology grounded in the notion that differences among humans could be explained by genetics, inheritance and other biological mechanisms. Finding out that Wilson thought this way was a huge disappointment, because I had enjoyed his novel <em>Anthill</em>, which was published much later and written for the public.</p><p>Wilson was hardly alone in his problematic beliefs. His predecessors—mathematician Karl Pearson, anthropologist Francis Galton, Charles Darwin, Gregor Mendel and others—also published works and spoke of theories fraught with racist ideas about distributions of health and illness in populations without any attention to the context in which these distributions occur.</p><p>Even modern geneticists and genome scientists struggle with inherent racism in the way they gather and analyze data. In his memoir A Life Decoded: My Genome: My Life, geneticist J. Craig Venter writes, “The complex provenance of ideas means their origin is often open to interpretation.”</p><p>To put the legacy of their work in the proper perspective, a more nuanced understanding of problematic scientists is necessary. It is true that work can be both important and problematic—they can coexist. Therefore it is necessary to evaluate and critique these scientists, considering, specifically the value of their work and, at the same time, their contributions to scientific racism.</p></blockquote><p>Those who reject Truth will eventually find their work deemed worthless, especially by those who reject the truth even more vehemently. Don’t ever curry the world’s favor. It simply isn’t worth it.</p><p>Jesus Christ stands by his followers even when they fail. Satan abandons his servants even when they succeed.</p><p><em><a href=\"https://social.infogalactic.com/micropost/56556b1a-6a17-45ee-9d64-24093a1f822a\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Those who have taken the ticket or are celebrated for their utility in building the false case against God had better enjoy their public adulation while it lasts. Even the most famous and well-respected scientists, who were lauded for their brilliance and whose work was absolutely integral in constructing the false scientific edifice of evolution by natural selection, are discovering that they and their work will be discredited and dishonored once the satanic narrative moves beyond them, as demonstrated by this article in\nScientific American\ndenigrating the legacy of evolutionary biologist E.O. Wilson\n:\nWith the death of biologist E. O. Wilson on Sunday, I find myself again reflecting on the complicated legacies of scientists whose works are built on racist ideas and how these ideas came to define our understanding of the world.\nAfter a long clinical career as a registered nurse, I became a laboratory-trained scientist as researchers mapped the first draft of the human genome. It was during this time that I intimately familiarized myself with Wilson’s work and his dangerous ideas on what factors influence human behavior.\nHis influential text Sociobiology: The New Synthesis contributed to the false dichotomy of nature versus nurture and spawned an entire field of behavioral psychology grounded in the notion that differences among humans could be explained by genetics, inheritance and other biological mechanisms. Finding out that Wilson thought this way was a huge disappointment, because I had enjoyed his novel\nAnthill\n, which was published much later and written for the public.\nWilson was hardly alone in his problematic beliefs. His predecessors—mathematician Karl Pearson, anthropologist Francis Galton, Charles Darwin, Gregor Mendel and others—also published works and spoke of theories fraught with racist ideas about distributions of health and illness in populations without any attention to the context in which these distributions occur.\nEven modern geneticists and genome scientists struggle with inherent racism in the way they gather and analyze data. In his memoir A Life Decoded: My Genome: My Life, geneticist J. Craig Venter writes, “The complex provenance of ideas means their origin is often open to interpretation.”\nTo put the legacy of their work in the proper perspective, a more nuanced understanding of problematic scientists is necessary. It is true that work can be both important and problematic—they can coexist. Therefore it is necessary to evaluate and critique these scientists, considering, specifically the value of their work and, at the same time, their contributions to scientific racism.\nThose who reject Truth will eventually find their work deemed worthless, especially by those who reject the truth even more vehemently. Don’t ever curry the world’s favor. It simply isn’t worth it.\nJesus Christ stands by his followers even when they fail. Satan abandons his servants even when they succeed.\nDISCUSS ON SG",
  "tags": [
    "evolution",
    "history",
    "science",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-01-20T15:20:16+00:00"
}