{
  "url": "https://voxday.net/2022/01/02/honest-liberal-successful-gamma/",
  "scraped_at": "2026-01-08T13:04:59.218101",
  "title": "Honest Liberal, Successful Gamma",
  "date_display": "January 2, 2022",
  "date_iso": "2022-01-02T09:56:00+00:00",
  "date_from_url": "2022-01-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have long believed that Garrison Keillor was one of the greatest writers of the Boomer generation, both in terms of style and substance. One of the reasons for my belief is that as a native-born Minnesotan raised in a deeply Christian family, he is too honest and accurate an observer to fail to report even that which directly contradicts his personal preferences, which, as a Scots-Scandinavian hybrid, are unfailingly progressive and liberal. And Keillor himself<a href=\"https://www.garrisonkeillor.com/ill-buy-lunch-you-fly-the-plane/\"> is refreshingly aware</a> of the contradictions that complete him.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>I am all in favor of diversity and inclusivity in theory, but when the pilot comes on the horn and welcomes us from the cockpit, I want to feel that he or she is a Republican. I want to hear authority in the voice, a growliness that comes from having shouted orders at people. I do not want my pilot to come on singing “Off we go into the wild blue yonder” and if he does, I’m off the plane. If it’s a woman pilot, I want her to be crisp and chill, not warm and caring. If she mentions turbulent conditions ahead, I don’t want to hear concern in her voice. I do not want her to thank us for flying — that’s for the flight attendants. I prefer my pilot to be a Republican with military service, preferably at the rank of captain or higher, preferably as an aviator, not in the Quartermaster Corps. I’m a Democrat and I’d be leery of a progressive Democrat pilot whose concern about air pollution might make him reluctant to use full power on takeoff. I don’t want anyone like me up front. No deep thinkers. A high-flier, please.</p></blockquote><p>You might ask, not unreasonably, how a man raised in a good Christian home, with a strong inclination toward honesty and a deep familiarity with Scripture, could fall so completely into error. Part of the answer is his genetics; the Scandinavians are the innocent lambs of the world, psychologically shaped by their need for mutual cooperation to survive in the icy North, as evidenced by his grandmother’s belief in the native superiority of the coloreds, a belief of the sort that can only be formed in perfect ignorance of the subject.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Grandma whistles under her breath, a tuneless music. She cuts me a slice of warm yeasty bread and pours me a cup of Salada tea. Her fingers are knotted at the knuckles. She is a woman of firm beliefs. If you leave your windows open at night, you won’t get sick. Chew your food thirty times before you swallow. There’s no need for herbs if the ingredients are good. You catch more flies with honey than with vinegar. And once I heard her say, “The colored are better looking, more intelligent, more talented, harder working, more honest, and more loving toward their families than Caucasians.” I was impressed. Her grandfather had been a federal administrator in the South after the Civil War, during Reconstruction, and she got her ideas about people of color from him.</p><cite><em>That Time of Year: A Minnesota Life</em>, Garrison Keillor</cite></blockquote><p>You could still hear Minnesotans say things like that in the early 1980s. I rather doubt they are so inclined to do so any more, now that they have actual experience living in the vicinity of those hypothetical paragons of intelligence, honesty, and hard work. Now they blame LBJ and the Federal government for ruining them with welfare. They’re still entirely ignorant of the history of Africa and its various peoples, but they are a little less clueless about color now.</p><p>The other reason is that he was doomed by nurture as well as nature to gamma status that no amount of height, money, or worldly success could ever balance. His 2018 firing by Minnesota Public Radio for purported “sexually inappropriate incidents” is only remarkable in how long it took for his SSH rank to catch up to him; it was all but inevitable from the start.</p><ul class=\"wp-block-list\"><li><em>I took an eye test and had to get glasses, and after that I stayed clear of organized sports and stuck to the disorganized; instead of the respect of my peers, I sought the approval of teachers and aunts.</em></li><li><em>I didn’t shine in high school. I was a B-minus student, thanks to my perfect pitch on multiple choice tests. The correct answer tended to be C. If you went with C, you could probably get a B and B was good enough. And I found a path in life there. I shied away from competition—speech contests, sports, honor roll—I didn’t care if I were 3.0 or 3.6—I wanted to be unique and so turned to writing.</em></li><li><em>I became Garrison. Eventually it wound up on my driver’s license and tax return— my girlfriend Mary married me as Garrison. In my heart, however, I still am Gary: Garrison feels like a fake mustache.</em></li><li><em>I started out playing with ambiguity, a fine way to disguise ignorance. “To be great is to be misunderstood,” said Emerson, so, in search of greatness, I wrote poems that couldn’t be understood because they made no sense.</em></li><li><em>I trace my heterosexuality to the offer of a seat on the bus at the age of thirteen. Boys defended territory. Girls were civilized and shared.</em></li></ul><p>And yet, it is through the ruthless exploitation and chronicling of Gary’s weaknesses, failures, and secret shames that Garrison Keillor became a legitimate and substantial success as a writer. He even, after several failed attempts, managed to establish a lasting marriage with <a href=\"https://imgr.search.brave.com/Le3N7aQRlm3cYREuW8JpMy60rVN-ua95-egtrQXnFvE/fit/790/522/ce/1/aHR0cHM6Ly9kLm5l/d3N3ZWVrLmNvbS9l/bi9mdWxsLzcyNjM1/NC9rZWlsbG9yLWZh/bWlseS5qcGc_dz03/OTAmZj02ZTBjNTYx/NDM4ZDgzMzM4Zjgz/MTU1NDUwZjI3Y2E0/Yw\">an attractive woman</a>. And there is a lesson in that for the gamma, which is that relentless honesty and systematic perseverance can provide even the deepest double-dyed gamma a means of surmounting his natural patterns of behavior.</p><p><em><a href=\"https://social.infogalactic.com/micropost/093459e5-b62e-448a-8f27-e6a48e803806\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "I have long believed that Garrison Keillor was one of the greatest writers of the Boomer generation, both in terms of style and substance. One of the reasons for my belief is that as a native-born Minnesotan raised in a deeply Christian family, he is too honest and accurate an observer to fail to report even that which directly contradicts his personal preferences, which, as a Scots-Scandinavian hybrid, are unfailingly progressive and liberal. And Keillor himself\nis refreshingly aware\nof the contradictions that complete him.\nI am all in favor of diversity and inclusivity in theory, but when the pilot comes on the horn and welcomes us from the cockpit, I want to feel that he or she is a Republican. I want to hear authority in the voice, a growliness that comes from having shouted orders at people. I do not want my pilot to come on singing “Off we go into the wild blue yonder” and if he does, I’m off the plane. If it’s a woman pilot, I want her to be crisp and chill, not warm and caring. If she mentions turbulent conditions ahead, I don’t want to hear concern in her voice. I do not want her to thank us for flying — that’s for the flight attendants. I prefer my pilot to be a Republican with military service, preferably at the rank of captain or higher, preferably as an aviator, not in the Quartermaster Corps. I’m a Democrat and I’d be leery of a progressive Democrat pilot whose concern about air pollution might make him reluctant to use full power on takeoff. I don’t want anyone like me up front. No deep thinkers. A high-flier, please.\nYou might ask, not unreasonably, how a man raised in a good Christian home, with a strong inclination toward honesty and a deep familiarity with Scripture, could fall so completely into error. Part of the answer is his genetics; the Scandinavians are the innocent lambs of the world, psychologically shaped by their need for mutual cooperation to survive in the icy North, as evidenced by his grandmother’s belief in the native superiority of the coloreds, a belief of the sort that can only be formed in perfect ignorance of the subject.\nGrandma whistles under her breath, a tuneless music. She cuts me a slice of warm yeasty bread and pours me a cup of Salada tea. Her fingers are knotted at the knuckles. She is a woman of firm beliefs. If you leave your windows open at night, you won’t get sick. Chew your food thirty times before you swallow. There’s no need for herbs if the ingredients are good. You catch more flies with honey than with vinegar. And once I heard her say, “The colored are better looking, more intelligent, more talented, harder working, more honest, and more loving toward their families than Caucasians.” I was impressed. Her grandfather had been a federal administrator in the South after the Civil War, during Reconstruction, and she got her ideas about people of color from him.\nThat Time of Year: A Minnesota Life\n, Garrison Keillor\nYou could still hear Minnesotans say things like that in the early 1980s. I rather doubt they are so inclined to do so any more, now that they have actual experience living in the vicinity of those hypothetical paragons of intelligence, honesty, and hard work. Now they blame LBJ and the Federal government for ruining them with welfare. They’re still entirely ignorant of the history of Africa and its various peoples, but they are a little less clueless about color now.\nThe other reason is that he was doomed by nurture as well as nature to gamma status that no amount of height, money, or worldly success could ever balance. His 2018 firing by Minnesota Public Radio for purported “sexually inappropriate incidents” is only remarkable in how long it took for his SSH rank to catch up to him; it was all but inevitable from the start.\nI took an eye test and had to get glasses, and after that I stayed clear of organized sports and stuck to the disorganized; instead of the respect of my peers, I sought the approval of teachers and aunts.\nI didn’t shine in high school. I was a B-minus student, thanks to my perfect pitch on multiple choice tests. The correct answer tended to be C. If you went with C, you could probably get a B and B was good enough. And I found a path in life there. I shied away from competition—speech contests, sports, honor roll—I didn’t care if I were 3.0 or 3.6—I wanted to be unique and so turned to writing.\nI became Garrison. Eventually it wound up on my driver’s license and tax return— my girlfriend Mary married me as Garrison. In my heart, however, I still am Gary: Garrison feels like a fake mustache.\nI started out playing with ambiguity, a fine way to disguise ignorance. “To be great is to be misunderstood,” said Emerson, so, in search of greatness, I wrote poems that couldn’t be understood because they made no sense.\nI trace my heterosexuality to the offer of a seat on the bus at the age of thirteen. Boys defended territory. Girls were civilized and shared.\nAnd yet, it is through the ruthless exploitation and chronicling of Gary’s weaknesses, failures, and secret shames that Garrison Keillor became a legitimate and substantial success as a writer. He even, after several failed attempts, managed to establish a lasting marriage with\nan attractive woman\n. And there is a lesson in that for the gamma, which is that relentless honesty and systematic perseverance can provide even the deepest double-dyed gamma a means of surmounting his natural patterns of behavior.\nDISCUSS ON SG",
  "tags": [
    "Gamma",
    "SSH",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-01-02T13:19:52+00:00"
}