{
  "url": "https://voxday.net/2022/01/04/it-has-always-been-the-flu/",
  "scraped_at": "2026-01-08T13:05:11.763287",
  "title": "It Has Always Been The Flu",
  "date_display": "January 4, 2022",
  "date_iso": "2022-01-04T01:57:25+00:00",
  "date_from_url": "2022-01-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Andrew Anglin committee <a href=\"https://www.unz.com/aanglin/no-there-is-no-new-virus-the-flu-was-renamed-covid-19/\">very patiently spells everything out</a> for even the most retarded.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>If you’ve already understood this little game you can play with the media’s “different from the flu hoax,” then I apologize for talking to you like you’re a retard, but I hope it amused you. If you still don’t understand this and are still talking about how “covid is different from the flu because you lose your sense of smell,” after reading me explain this to you for two years, then you literally are retarded, and you deserve to be talked to like a retarded person.</p><p>None of the claims that I have made have been outrageous, none of them have been disproved, all of them probably qualify as self-evident.</p><p>What we appear to have here is another “midwit crisis.”</p><p>When I tell some guy working at the Sunoco, “this is all just a big hoax – they just renamed the flu,” the standard reply is “man, that’s what I been saying!”</p><p>Meanwhile, most intelligent people on the internet have completely given up on all of this bat soup and lab leak gibberish, and have come around to agree that the alleged coronavirus is a rebranding of the flu.</p><p>This is what I have said:</p><p>It didn’t come from bat soup<br/>It didn’t come from a laboratory<br/>The government is openly faking the numbers<br/>Hospitals are openly being paid by the government to fake numbers<br/>Hospitals are being paid to put people on ventilators that kill them<br/>It is not more deadly than the normal flu (we have no way of knowing exact numbers because of all of the fakery, but none of you know anyone who died from it)<br/>It does not have unique characteristics that have not been recorded in previous flus<br/>The way it was allegedly isolated is absurd, and proves nothing<br/>The PCR test is a joke<br/>Antibody tests pick up antibodies for the common cold, which is also a coronavirus<br/>The widely-distributed vaccine is now causing a disease indistinguishable from “covid-19”<br/>And, most importantly:</p><p>If the media and government wouldn’t have mentioned the existence of a new disease, no one would have noticed a new disease. That includes hospitals.</p><p>There would have been back page news stories about a flu outbreak in Italy and a malaria outbreak in India, like there are back page articles about regional disease outbreaks every year. It’s possible that papers in medical journals would have been published about differences in the 2020 flu strand, but it’s unlikely, because there are no identifiably unique characteristics of “coronavirus” in comparison with the normal respiratory viruses we’ve always had. That’s all.</p><p>The “coronavirus pandemic” is a complete creation of the government/media, and of the lying medical industrial complex, with the obvious purpose of completely restructuring global human society at rocket-pace.</p><p>They want you to stop working, they want you on a digital currency UBI system, they want to cram you into high-rise tenements where you can watch Netflix and porn until you die.</p></blockquote><p>He’s generally right. There was no effective bioweapon; it is the <em>vaccine </em>that is the bioweapon. While there have obviously been serial attempts to manufacture a gain-of-function, disease-based bioweapon for decades, the way this scenario has played out suggests that those efforts have continued to fail and the rebranding and replacement of the flu was the result of plan F being put into play.</p><p>Even though I coined the acronym MPAI, the expansive limits of human stupidity still manage to astonish me. The way in which a substantial portion of the population actually fell for the magical “disappearance of the flu in 2020” meme will forever mark the hard boundary between “functioning mind” and “non-functioning mind” for me.</p><p>It is interesting to see the way in which “midwit” has entered the language though. I’m glad to see that other observers of the human condition are finding it to be a useful concept.</p><p><em><a href=\"https://social.infogalactic.com/micropost/a376b2d4-6b5f-4566-9f3f-4e7e19c4dbd2\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The Andrew Anglin committee\nvery patiently spells everything out\nfor even the most retarded.\nIf you’ve already understood this little game you can play with the media’s “different from the flu hoax,” then I apologize for talking to you like you’re a retard, but I hope it amused you. If you still don’t understand this and are still talking about how “covid is different from the flu because you lose your sense of smell,” after reading me explain this to you for two years, then you literally are retarded, and you deserve to be talked to like a retarded person.\nNone of the claims that I have made have been outrageous, none of them have been disproved, all of them probably qualify as self-evident.\nWhat we appear to have here is another “midwit crisis.”\nWhen I tell some guy working at the Sunoco, “this is all just a big hoax – they just renamed the flu,” the standard reply is “man, that’s what I been saying!”\nMeanwhile, most intelligent people on the internet have completely given up on all of this bat soup and lab leak gibberish, and have come around to agree that the alleged coronavirus is a rebranding of the flu.\nThis is what I have said:\nIt didn’t come from bat soup\nIt didn’t come from a laboratory\nThe government is openly faking the numbers\nHospitals are openly being paid by the government to fake numbers\nHospitals are being paid to put people on ventilators that kill them\nIt is not more deadly than the normal flu (we have no way of knowing exact numbers because of all of the fakery, but none of you know anyone who died from it)\nIt does not have unique characteristics that have not been recorded in previous flus\nThe way it was allegedly isolated is absurd, and proves nothing\nThe PCR test is a joke\nAntibody tests pick up antibodies for the common cold, which is also a coronavirus\nThe widely-distributed vaccine is now causing a disease indistinguishable from “covid-19”\nAnd, most importantly:\nIf the media and government wouldn’t have mentioned the existence of a new disease, no one would have noticed a new disease. That includes hospitals.\nThere would have been back page news stories about a flu outbreak in Italy and a malaria outbreak in India, like there are back page articles about regional disease outbreaks every year. It’s possible that papers in medical journals would have been published about differences in the 2020 flu strand, but it’s unlikely, because there are no identifiably unique characteristics of “coronavirus” in comparison with the normal respiratory viruses we’ve always had. That’s all.\nThe “coronavirus pandemic” is a complete creation of the government/media, and of the lying medical industrial complex, with the obvious purpose of completely restructuring global human society at rocket-pace.\nThey want you to stop working, they want you on a digital currency UBI system, they want to cram you into high-rise tenements where you can watch Netflix and porn until you die.\nHe’s generally right. There was no effective bioweapon; it is the\nvaccine\nthat is the bioweapon. While there have obviously been serial attempts to manufacture a gain-of-function, disease-based bioweapon for decades, the way this scenario has played out suggests that those efforts have continued to fail and the rebranding and replacement of the flu was the result of plan F being put into play.\nEven though I coined the acronym MPAI, the expansive limits of human stupidity still manage to astonish me. The way in which a substantial portion of the population actually fell for the magical “disappearance of the flu in 2020” meme will forever mark the hard boundary between “functioning mind” and “non-functioning mind” for me.\nIt is interesting to see the way in which “midwit” has entered the language though. I’m glad to see that other observers of the human condition are finding it to be a useful concept.\nDISCUSS ON SG",
  "tags": [
    "conspiracy",
    "globalism",
    "MPAI",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-01-04T02:12:41+00:00"
}