{
  "url": "https://voxday.net/2022/01/27/no-longer-breathing/",
  "scraped_at": "2026-01-08T13:07:47.568583",
  "title": "No Longer Breathing",
  "date_display": "January 27, 2022",
  "date_iso": "2022-01-27T14:50:36+00:00",
  "date_from_url": "2022-01-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em>Introduced on last night’s Darkstream the latest anthem from Boomer Patrol, <a href=\"https://soundcloud.com/john-bradley-298288478/no-longer-breathing?in=john-bradley-298288478/sets/boomer-patrol\">No Longer Breathing</a>, is now available for your audio-pondering.</em></p><p>You know what I’m doing, this is the time and place<br/>I feel nothing but fabric, when I press down on your face<br/>You really had me goin’, headin’ where you are<br/>The explanation for you is eviler by far<br/>I believed your generation, was going to change the world<br/>And now your own grandchildren don’t know they’re boy or girl<br/>There’s not much to examine, there’s nothing left to hide<br/>You really can’t be serious if you have to ask me why<br/>I say goodbye</p><p>Cause you’re no longer breathing, and now you’re out of air<br/>Don’t know who you’re kidding, imagining I care<br/>And I could stand here waiting, and watch as you fade away<br/>I don’t suppose it’s worth the price, you’re worth the price, the price that I would pay</p><p>And everyone keeps asking, why we’re all so mad<br/>How we can lament it, the life we never had<br/>What’s the destination, can’t you feel the pain?<br/>There’s nothing left to reason and only you to blame<br/>You’ll never change</p><p>Cause you’re no longer breathing, and now you’re out of air<br/>Don’t know who you’re kidding, imagining I care<br/>And I could stand here waiting, and watch as you fade away<br/>I don’t suppose it’s worth the price, you’re worth the price, the price that I would pay<br/>But I’m thinking it over anyway<br/>I’m thinking it over anyway</p><p>I said goodbye, it’s time to go<br/>You’re out of time, a soft pillow<br/>My hand above, your face below<br/>And every breath that comes and goes<br/>Boomer, it’s time to move on</p><p>Cause you’re no longer breathing, and now you’re out of air<br/>Don’t know who you’re kidding, imagining I care<br/>And I could stand here waiting, and watch as you fade away<br/>I don’t suppose it’s worth the price, you’re worth the price, the price that I would pay<br/>But I’m thinking it over anyway<br/>I’m thinking it over anyway</p><p>I know what to do now. I’ll end it now, right here.</p><p><em><a href=\"https://social.infogalactic.com/micropost/9fb841d0-2a43-4e56-abf9-12c16101a005\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Introduced on last night’s Darkstream the latest anthem from Boomer Patrol,\nNo Longer Breathing\n, is now available for your audio-pondering.\nYou know what I’m doing, this is the time and place\nI feel nothing but fabric, when I press down on your face\nYou really had me goin’, headin’ where you are\nThe explanation for you is eviler by far\nI believed your generation, was going to change the world\nAnd now your own grandchildren don’t know they’re boy or girl\nThere’s not much to examine, there’s nothing left to hide\nYou really can’t be serious if you have to ask me why\nI say goodbye\nCause you’re no longer breathing, and now you’re out of air\nDon’t know who you’re kidding, imagining I care\nAnd I could stand here waiting, and watch as you fade away\nI don’t suppose it’s worth the price, you’re worth the price, the price that I would pay\nAnd everyone keeps asking, why we’re all so mad\nHow we can lament it, the life we never had\nWhat’s the destination, can’t you feel the pain?\nThere’s nothing left to reason and only you to blame\nYou’ll never change\nCause you’re no longer breathing, and now you’re out of air\nDon’t know who you’re kidding, imagining I care\nAnd I could stand here waiting, and watch as you fade away\nI don’t suppose it’s worth the price, you’re worth the price, the price that I would pay\nBut I’m thinking it over anyway\nI’m thinking it over anyway\nI said goodbye, it’s time to go\nYou’re out of time, a soft pillow\nMy hand above, your face below\nAnd every breath that comes and goes\nBoomer, it’s time to move on\nCause you’re no longer breathing, and now you’re out of air\nDon’t know who you’re kidding, imagining I care\nAnd I could stand here waiting, and watch as you fade away\nI don’t suppose it’s worth the price, you’re worth the price, the price that I would pay\nBut I’m thinking it over anyway\nI’m thinking it over anyway\nI know what to do now. I’ll end it now, right here.\nDISCUSS ON SG",
  "tags": [
    "Baby Boomers",
    "Boomer Patrol",
    "music"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-01-27T14:50:38+00:00"
}