{
  "url": "https://voxday.net/2022/01/09/our-fingers-were-crossed/",
  "scraped_at": "2026-01-08T13:05:46.783726",
  "title": "Our Fingers Were Crossed!",
  "date_display": "January 9, 2022",
  "date_iso": "2022-01-09T10:51:58+00:00",
  "date_from_url": "2022-01-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The US Secretary of State is attempting to play revisionist talmudics in order <a href=\"https://www.rt.com/russia/545463-blinken-nato-russia-promise-expand/\">to justify the NATO expansion</a> that has both Russia and China on a war footing:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>NATO has never promised not to admit new members, US Secretary of State Antony Blinken claimed on Friday, labelling Russia’s demands of the bloc inadmissible. However, long-declassified Western documents suggest otherwise.</p><p>“NATO never promised not to admit new members,” the top American diplomat told journalists during Friday’s press briefing, as he commented on Moscow’s proposals to the bloc on security guarantees, ahead of upcoming NATO-Russia meetings next week.</p><p>“It could not and would not – the ‘open door policy’ was a core provision of the 1949 North Atlantic Treaty that founded NATO,” Blinken added. He then pointed to the fact that both Mikhail Gorbachev – the Soviet leader who’d allegedly received the guarantees of non-expansion from the Western leaders – and the former US Secretary of State James Baker, who allegedly provided them, among others – denied anything like that ever happened.</p><p>“There was no promise that NATO wouldn’t expand,” Blinken concluded, adding that, instead, Moscow had itself recognized every European nation’s right to choose its own path in the field of security by joining the Istanbul Charter for European Security in 1999.</p><p>Such a position has apparently become commonplace in the bloc after Moscow came up with a set of proposals that it said would alleviate current tensions between Russia and the collective West. The proposals would see the Brussels-based organisation agree to curb its territorial growth as a form of a security guarantee for Russia.</p><p>After the proposals were presented to NATO in December 2021, its Secretary General Jens Stoltenberg also stated that the bloc had never promised not to expand. Yet, a trove of documents, made public as early as in 2017, suggests that it did.</p><cite><em>Russia Today</em></cite></blockquote><p>This is a <em>remarkably stupid </em>game the Fake Biden administration is playing. The neocons are attempting to utilize juvenile narrative-shaping tactics in a world of hardened diplomats and generals who couldn’t care less what a few lawyers assumed back in 1949. It appears the neocons are about to discover that their lawyerly verbal tactics don’t work on people who, unlike Americans and Europeans, are not high-trusting children.</p><p>It’s the usual bait-and-switch offered by a deceiver. Even if NATO never made any formal promises not to expand, the leaders of every major Western country at the time promised that NATO would not expand to the <em>EAST</em>, i.e. in the direction of Russia. Which NATO subsequently did after 1991 and the collapse of the Soviet Union that was the raison d’etre for its existence. If Vladimir Putin were to reassure the world that Russia will not attack NATO, just all of the countries that violated their past assurances to Russia, would anyone find that comforting?</p><p>The neocons would do very well to recall that the Russians have never promised not to nuke New York or Jerusalem. The Chinese have never promised not to genocide Hollywood and Silicon Valley. Neither the wisdom nor the rightness of an action relies upon the fact that one has never promised not to do it. The balance of power rests upon capabilities, not contracts. And Russia has promised that it will never permit NATO to reach its borders.</p><p>In addition to never promising not to invade Taiwan, China has repeatedly vowed to unify the island with the mainland. Would the US Secretary of State argue that China therefore has a right to do so? Because under his own logic, China has a stronger argument than the one he is presenting in favor of NATO expansion.</p><p><strong>UPDATE:</strong> Yes, China <a href=\"https://www.globaltimes.cn/page/202201/1245391.shtml\">knows exactly what’s happening</a> in Kazakhstan and who is responsible.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>China can offer support in the fields of economic cooperation and assistance, as well as counter-terrorism, to help neighboring Kazakhstan restore stability and realize effective reforms and long-term economic development, according to Chinese analysts, as Kazakh President Kassym-Jomart Tokayev and the government thanked Russia and China, as well as other leaders worldwide and heads of international organizations for support offered to the country amid domestic unrest. The situation in Kazakhstan has the clear characteristics of a “color revolution” and the involvement of foreign forces and the “Three Devils” (terrorism, religious extremism and separatism), said Chinese analysts.</p><p>China, Xi said, firmly opposes any force undermining Kazakhstan’s stability, threatening the country’s security, and sabotaging the peaceful lives of the Kazakh people. China also strongly rejects any attempt by external forces to provoke unrest and instigate “color revolution” in Kazakhstan, as well as any attempt to harm the friendship between China and Kazakhstan and disrupt the two countries’ cooperation. And, China is ready to provide necessary support to help Kazakhstan overcome the difficulties.</p><cite><em>Global Times</em></cite></blockquote><p><em><a href=\"https://social.infogalactic.com/micropost/12f3d23b-9d11-4aef-b46b-55bc7601d558\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The US Secretary of State is attempting to play revisionist talmudics in order\nto justify the NATO expansion\nthat has both Russia and China on a war footing:\nNATO has never promised not to admit new members, US Secretary of State Antony Blinken claimed on Friday, labelling Russia’s demands of the bloc inadmissible. However, long-declassified Western documents suggest otherwise.\n“NATO never promised not to admit new members,” the top American diplomat told journalists during Friday’s press briefing, as he commented on Moscow’s proposals to the bloc on security guarantees, ahead of upcoming NATO-Russia meetings next week.\n“It could not and would not – the ‘open door policy’ was a core provision of the 1949 North Atlantic Treaty that founded NATO,” Blinken added. He then pointed to the fact that both Mikhail Gorbachev – the Soviet leader who’d allegedly received the guarantees of non-expansion from the Western leaders – and the former US Secretary of State James Baker, who allegedly provided them, among others – denied anything like that ever happened.\n“There was no promise that NATO wouldn’t expand,” Blinken concluded, adding that, instead, Moscow had itself recognized every European nation’s right to choose its own path in the field of security by joining the Istanbul Charter for European Security in 1999.\nSuch a position has apparently become commonplace in the bloc after Moscow came up with a set of proposals that it said would alleviate current tensions between Russia and the collective West. The proposals would see the Brussels-based organisation agree to curb its territorial growth as a form of a security guarantee for Russia.\nAfter the proposals were presented to NATO in December 2021, its Secretary General Jens Stoltenberg also stated that the bloc had never promised not to expand. Yet, a trove of documents, made public as early as in 2017, suggests that it did.\nRussia Today\nThis is a\nremarkably stupid\ngame the Fake Biden administration is playing. The neocons are attempting to utilize juvenile narrative-shaping tactics in a world of hardened diplomats and generals who couldn’t care less what a few lawyers assumed back in 1949. It appears the neocons are about to discover that their lawyerly verbal tactics don’t work on people who, unlike Americans and Europeans, are not high-trusting children.\nIt’s the usual bait-and-switch offered by a deceiver. Even if NATO never made any formal promises not to expand, the leaders of every major Western country at the time promised that NATO would not expand to the\nEAST\n, i.e. in the direction of Russia. Which NATO subsequently did after 1991 and the collapse of the Soviet Union that was the raison d’etre for its existence. If Vladimir Putin were to reassure the world that Russia will not attack NATO, just all of the countries that violated their past assurances to Russia, would anyone find that comforting?\nThe neocons would do very well to recall that the Russians have never promised not to nuke New York or Jerusalem. The Chinese have never promised not to genocide Hollywood and Silicon Valley. Neither the wisdom nor the rightness of an action relies upon the fact that one has never promised not to do it. The balance of power rests upon capabilities, not contracts. And Russia has promised that it will never permit NATO to reach its borders.\nIn addition to never promising not to invade Taiwan, China has repeatedly vowed to unify the island with the mainland. Would the US Secretary of State argue that China therefore has a right to do so? Because under his own logic, China has a stronger argument than the one he is presenting in favor of NATO expansion.\nUPDATE:\nYes, China\nknows exactly what’s happening\nin Kazakhstan and who is responsible.\nChina can offer support in the fields of economic cooperation and assistance, as well as counter-terrorism, to help neighboring Kazakhstan restore stability and realize effective reforms and long-term economic development, according to Chinese analysts, as Kazakh President Kassym-Jomart Tokayev and the government thanked Russia and China, as well as other leaders worldwide and heads of international organizations for support offered to the country amid domestic unrest. The situation in Kazakhstan has the clear characteristics of a “color revolution” and the involvement of foreign forces and the “Three Devils” (terrorism, religious extremism and separatism), said Chinese analysts.\nChina, Xi said, firmly opposes any force undermining Kazakhstan’s stability, threatening the country’s security, and sabotaging the peaceful lives of the Kazakh people. China also strongly rejects any attempt by external forces to provoke unrest and instigate “color revolution” in Kazakhstan, as well as any attempt to harm the friendship between China and Kazakhstan and disrupt the two countries’ cooperation. And, China is ready to provide necessary support to help Kazakhstan overcome the difficulties.\nGlobal Times\nDISCUSS ON SG",
  "tags": [
    "China",
    "neocons",
    "Russia",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-01-09T11:39:30+00:00"
}