{
  "url": "https://voxday.net/2022/01/16/pad-for-performance/",
  "scraped_at": "2026-01-08T13:06:36.120013",
  "title": "Pad for Performance",
  "date_display": "January 16, 2022",
  "date_iso": "2022-01-16T10:38:08+00:00",
  "date_from_url": "2022-01-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And elevate for excellence. Bill Belichick’s system illustrates <a href=\"https://www.si.com/nfl/2022/01/14/belichick-arts-and-crafts-play-diagramming-method-daily-cover\">the effort and the level of detail</a> that are required to set yourself apart, even among the most successful:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>As the son of a coach, and a lifelong football devotee, Brian Ferentz figured he could handle every possible expectation that came with his new job as a low-level offensive assistant in New England. He would live the Patriots’ infamous 20/20 coaching existence, working up to 20 hours a day, for about $20,000 a year. He knew he would become an anonymous cog in a high-functioning machine, spending his days—and most nights—swamped in grunt work while receiving little credit for his toiling. But he also knew he had gained entry to a coaching laboratory that could change the trajectory of his life, starting in 2009.</p><p>He expected it would be hard. He didn’t expect … an art project? But the team assigned him the NFL equivalent of one, immediately. Bill Belichick summoned Ferentz to his office, where he’d school him on one particular—and particularly tedious—process that New England emphasized more than any other team. Belichick called it “padding,” his method of diagramming plays from opponents. It served to gauge football knowledge, inform game plans and teach the nuances of an infinitely complex sport—part torture chamber, part proving ground, part barrier to entry and part football seminar all wrapped into one exercise.</p><p>Every NFL team charts its opposition, on some level, to varying degrees. And other coaches, like Bill Parcells, made their entry-level assistants pad. But while those familiar with the process claim not to know its origin—whether it started with Parcells; Belichick; Belichick’s father, Steve; top-secret Patriots assistant Ernie Adams; or elsewhere—all agree that no one embraced the method, or gleaned more value from it, than Belichick himself.</p><p>Ferentz understood the extent immediately. Two words popped into his mind: “holy” and “s—.” A man who once considered himself ready for every nuance of the job was now doubting whether he could do it. He would scour film of upcoming opponents and diagram their offensive plays in staggering detail, then take those diagrams, cut them out, place them into booklets and hand them over for review. Some games took eight hours, depending on the number of plays and the complexity of the scheme, while others could be completed in closer to four. With four or five games to review each week, his mass of other responsibilities and actual coaching, he started to add up the math for a 17-week season, only to stop because he had to pad again.</p><p>The “pads” were sheets of paper, 8½ x 11 inches, with a horizontal line dividing the page. They sketched one diagram on top and the other on the bottom. The assistants filled in four plays on each sheet by using both sides. They noted the down and distance; field position, quarter and time remaining; numbers for each of the 22 players and their assignments….</p><p>Thirteen years later, Ferentz is Iowa’s offensive coordinator. He’s still a coach, and one who never expected to embrace that “miserable, terrible, awful” process that once forced him to question both his chosen profession and, at times, his existence. Instead, he came to view one specific process, from all of New England’s myriad approaches, as the primary element that built the nebulous, mystical aura known as the Patriot Way.</p><p>He’s now a padding proponent. Lifetime membership.</p></blockquote><p>It’s not an accident that both JRR Tolkien and Umberto Eco demonstrated near-psychotic attention to detail in the process of creating their great literary works. Tolkien’s philological depths are rightly famous; it’s less well-known how Eco built a virtual monastery so that he could time how long it took to walk from point A to point B in order to ensure that the conversations in <em>The Name of the Rose</em> fit the amount of time that was required for the traversal.</p><p>My level of success is orders of magnitude below the two great writers of the 20th century, but one thing I have noticed is that a) I make a habit of writing design drafts as well as keeping lists and spreadsheets, and b) I always have a much better idea of what is going on, and what needs to be done, than nearly everyone else involved in a given project. I’m regularly astonished by how little most people know about what is required of them to simply do their jobs correctly.</p><p>So, to up your game, I highly recommend getting in the habit of writing things down and regularly noting what needs to be done, when it needs to be done, who is doing it, and when you should check on them to see if they are going to deliver it on time. Think of it as padding for life.</p><p><em><a href=\"https://social.infogalactic.com/micropost/050a94da-7ef0-4c1d-9da0-f4f3a0731f2e\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "And elevate for excellence. Bill Belichick’s system illustrates\nthe effort and the level of detail\nthat are required to set yourself apart, even among the most successful:\nAs the son of a coach, and a lifelong football devotee, Brian Ferentz figured he could handle every possible expectation that came with his new job as a low-level offensive assistant in New England. He would live the Patriots’ infamous 20/20 coaching existence, working up to 20 hours a day, for about $20,000 a year. He knew he would become an anonymous cog in a high-functioning machine, spending his days—and most nights—swamped in grunt work while receiving little credit for his toiling. But he also knew he had gained entry to a coaching laboratory that could change the trajectory of his life, starting in 2009.\nHe expected it would be hard. He didn’t expect … an art project? But the team assigned him the NFL equivalent of one, immediately. Bill Belichick summoned Ferentz to his office, where he’d school him on one particular—and particularly tedious—process that New England emphasized more than any other team. Belichick called it “padding,” his method of diagramming plays from opponents. It served to gauge football knowledge, inform game plans and teach the nuances of an infinitely complex sport—part torture chamber, part proving ground, part barrier to entry and part football seminar all wrapped into one exercise.\nEvery NFL team charts its opposition, on some level, to varying degrees. And other coaches, like Bill Parcells, made their entry-level assistants pad. But while those familiar with the process claim not to know its origin—whether it started with Parcells; Belichick; Belichick’s father, Steve; top-secret Patriots assistant Ernie Adams; or elsewhere—all agree that no one embraced the method, or gleaned more value from it, than Belichick himself.\nFerentz understood the extent immediately. Two words popped into his mind: “holy” and “s—.” A man who once considered himself ready for every nuance of the job was now doubting whether he could do it. He would scour film of upcoming opponents and diagram their offensive plays in staggering detail, then take those diagrams, cut them out, place them into booklets and hand them over for review. Some games took eight hours, depending on the number of plays and the complexity of the scheme, while others could be completed in closer to four. With four or five games to review each week, his mass of other responsibilities and actual coaching, he started to add up the math for a 17-week season, only to stop because he had to pad again.\nThe “pads” were sheets of paper, 8½ x 11 inches, with a horizontal line dividing the page. They sketched one diagram on top and the other on the bottom. The assistants filled in four plays on each sheet by using both sides. They noted the down and distance; field position, quarter and time remaining; numbers for each of the 22 players and their assignments….\nThirteen years later, Ferentz is Iowa’s offensive coordinator. He’s still a coach, and one who never expected to embrace that “miserable, terrible, awful” process that once forced him to question both his chosen profession and, at times, his existence. Instead, he came to view one specific process, from all of New England’s myriad approaches, as the primary element that built the nebulous, mystical aura known as the Patriot Way.\nHe’s now a padding proponent. Lifetime membership.\nIt’s not an accident that both JRR Tolkien and Umberto Eco demonstrated near-psychotic attention to detail in the process of creating their great literary works. Tolkien’s philological depths are rightly famous; it’s less well-known how Eco built a virtual monastery so that he could time how long it took to walk from point A to point B in order to ensure that the conversations in\nThe Name of the Rose\nfit the amount of time that was required for the traversal.\nMy level of success is orders of magnitude below the two great writers of the 20th century, but one thing I have noticed is that a) I make a habit of writing design drafts as well as keeping lists and spreadsheets, and b) I always have a much better idea of what is going on, and what needs to be done, than nearly everyone else involved in a given project. I’m regularly astonished by how little most people know about what is required of them to simply do their jobs correctly.\nSo, to up your game, I highly recommend getting in the habit of writing things down and regularly noting what needs to be done, when it needs to be done, who is doing it, and when you should check on them to see if they are going to deliver it on time. Think of it as padding for life.\nDISCUSS ON SG",
  "tags": [
    "philosophy",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-01-16T11:32:55+00:00"
}