{
  "url": "https://voxday.net/2022/01/12/scott-adams-melts-down/",
  "scraped_at": "2026-01-08T13:06:08.384233",
  "title": "Scott Adams Melts Down",
  "date_display": "January 12, 2022",
  "date_iso": "2022-01-12T11:23:04+00:00",
  "date_from_url": "2022-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scott Adams goes full Gamma <a href=\"https://archive.is/9mvJl\">and it is glorious</a>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Compare my actual Covid prediction record (the best in the nation): http://shorturl.at/dotC3 with the interpretation below and spot the cognitive dissonance tells.</p><p>It’s weirdly fascinating to see how easily people hallucinate entirely different lives for me.</p></blockquote><p>Not only does his “actual Covid prediction record” not come anywhere close to Karl Denninger’s, but he was actually dumb enough to get injected with a substance that was already known to be unsafe and ineffective at both times he submitted to the vaccine regime. According to AC and others who watch his streams, <a href=\"https://www.anonymousconservative.com/blog/news-briefs-01-12-2022/\">he’s psychologically breaking down</a> over the cognitive dissonance of a) needing to believe that he is a Very Smart Boy and b) knowing that he was dumb enough to voluntarily take the killshot when tens of millions of Americans were smart enough to avoid following the health care recommendations of global depopulationists.</p><p>This <a href=\"https://www.youtube.com/watch?v=nrf-S6DJQP0&amp;t=4247s\">vulgar, eye-twitching rant</a> in response to a viewer telling him that he should simply admit that he was wrong tells you everything you need to know about the man’s mental state.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>Scott Adams is freaking out. The eye blinking in the video is the tell. Here is one decent probability, in the range of possibilities in the probability matrix of what is going on with him. Scott has some inflammatory issues, mostly producing nerve dysfunction, and those things are impacting his ability to draw and do the things he wants to do, according to some accounts. It is a shame, and people should feel bad about that, as little is as irritating as the spirit having the drive and the body breaking down and holding it back. I think the jab increases the probabilities of those issues getting worse, and he may have begun to feel as if some of his symptoms might have been getting worse. Probably just enough that he began to worry the jab was a mistake, which produced his initial ambivalent, quasi-walk-back on it. People however pounced on him, as he was a convenient outlet for their rage at all the other people knowingly lying to them, and because he has a very defensive reflex, he began fighting. Now he is getting frustrated, because his health may be fucked, which means his life may be fucked, it may be getting worse and he is suffering mentally and physically, and on the other side are people who he feels in conflict with, who will “win” if his body begins failing – and in his head they want to win.</p></blockquote><p>On last night’s Darkstream 803, I went through and examined Adams’s <a href=\"https://scottadams.locals.com/post/1509747/my-pandemic-prediction-audit\">Pandemic Prediction Audit</a>, in which the self-appointed “best predictor of the pandemic, at least among public figures” attempted to fold, spindle, and mutilate his past statements in order to make them less obviously wrong to the casual observer. Here is a brief summary of my point-by-point review of his nominal predictions.</p><p>CLOSING TRAVEL WITH CHINA</p><p>Not exactly much of a prediction, and ultimately irrelevant, but we’ll give it to him. 1/1.</p><p>FAUCI AND FACEMASKS</p><p>Adams called out Fauci for lying when he said masks would NOT help the general public.  Masks didn’t stop or even slow down the spread of Covid. This was one of the few times when Fauci was actually telling the truth and the fact that Fauci later lied and supported face-masking doesn’t make Scott’s prediction “that masks probably work” correct. He was flat-out wrong. 1/2.</p><p>LEADERSHIP AS A SUCCESS VARIABLE</p><p>Adams predicted we would not see “leadership” as a variable that caused one country or state to do better than any other in terms of controlling Covid death rates. Whether one compares New York to Florida or the USA to Sweden, that was completely wrong. 1/3.</p><p>LAB LEAK THEORY</p><p>This wasn’t really a prediction, but because Adams did not toe the official line and endorse the media narrative that merely discussing the possibility of the virus being engineered was conspiracy theory, we’ll give him half a point. 1.5/4.</p><p>VACCINE “SUCCESS”</p><p>He predicted Project Warp speed would NOT succeed in creating a vaccine in time. He was not only wrong, he was foolish enough to take one of the vaccines that was created twice. And to say that he “never trusted Big Pharma” when he is literally trusting it with his life and his health is simply bizarre and potentially indicative of cognitive vaccine damage. 1.5/5.</p><p>HCQ</p><p>Adams attempted to have it both ways with HCQ. But he was open to it, and it wasn’t the gamechanger that Ivermectin turned out to be. So, another half-point. 2/6.</p><p>IVERMECTIN</p><p>Ivermectin has turned out to be as effective as advertised despite the entire media-medical complex attempting to turn public opinion against it, and vastly more effective than the vaccines. A comparable government effort based on Ivermectin rather than the fraudulent vaccines would have crushed the pandemic, instead, pharmacies, doctors, and hospitals have been actively preventing patients from being treated with it. Adams was flat-out wrong. 2/7.</p><p>BIG PHARMA CONTROL</p><p>Adams doesn’t entirey reject “the hypothesis that big Pharma can control the entire world’s medical opinions on HCQ and Ivermectin by buying off a handful of experts in America” but then turns around and says some politician would have exposed it if there was. But his prediction – and his choice to get vaccinated twice – make it clear that he didn’t believe in or predict the actual Big Pharma conspiracy or the level of control of the global media it demonstrated over the last two years. 2/8.</p><p>VACCINE RISKS AND BENEFITS</p><p>Adams incorrectly stated we didn’t know enough — and couldn’t know enough in time — about the confirmed risks or benefits of the vaccines. He got vaccinated in order to travel, then vacillated on the booster shot before finally rejecting it. He was obviously wrong. 2/9.</p><p>THE TWEET THAT TRIGGERED MY CRITICS</p><p>I’ll present this in its entirety, because it is a beautiful example of the Secret King at his most triumphant in complete defeat. He was totally wrong, and yet, still insists that he was phenomenonically correct inside his skull. 2/10</p><p><em>I colorfully tweeted after my vaccinations in the summer of 2021 that for the vaccinated, the pandemic was over, but not so much for the unvaccinated. That tweet was based on my personal feelings which I often proclaim to have no basis in fact. I include this example for completeness, but it wasn’t a prediction. It was a psychological phenomenon inside my skull. You don’t need to fact-check it. And for me, it’s still true, subjectively speaking.</em></p><p>DEATH PREDICTION</p><p>He predicted that lockdowns would save substantial lives and that only 5,000 people would die. 2/11.</p><p>ROGUE DOCTORS PREDICTION</p><p>I predicted the “rogue doctors” were not credible and notes that “most of the rogues have been banned by social media for spreading obvious false information”. By rights, he should get minus two points for this, because the rogue doctors’ various predictions about the vaccines have been generally correct and because he’s dumb enough to assume that social media is a reasonable arbiter of false information. But we’ll just count it as one prediction. 2/12.</p><p>MANDATES</p><p>He has never favored mandates. Which is good. But this is also not a prediction. 2/12.</p><p>SOCIAL AND HEALTH IMPACT OF THE LOCKDOWNS</p><p>He correctly notes that everyone knew the lockdowns would be hard on people. Not a prediction. 2/12.</p><p>WEIGHT, FITNESS, AND VITAMIN D</p><p>He did advise people to get fit, lose weight, and take Vitamin D. Not exactly a prediction, but since Vitamin D supplementation has turned out to be so important in helping people fight off Covid and other diseases, we’ll be generous and give him a full point. 3/13.</p><p>CDC QUARANTINE GUIDELINES</p><p>He never made any prediction about quarantines beginning or ending. Not a prediction. 3/13.</p><p>WHY “ONE SIDE” GETS BANNED FROM SOCIAL MEDIA</p><p>He claims to have predicted Twitter and YouTube would not ban him for “violating the narrative” on vaccination safety. He didn’t ever violate the narrative, and he clearly doesn’t understand what the vaccine narrative or “false information” are. 3/14.</p><p>VAERS DATABASE</p><p>He expected the vaccine side effects were overreported by VAERS. He’s wrong. 3/15.</p><p>MASS FORMATION PSYCHOSIS</p><p>He thinks the massive global propaganda we have all endured is “a diversion tactic so we stop looking at fake news and social media as the cause of our problems.” This is wrong, stupid, and ignorant. But it’s not a prediction. 3/15</p><p><strong>AUDIT TOTAL:</strong> 3 of 15</p><p>Not a very impressive performance by Mr. Adams, especially when compared to the likes of Karl Denninger, who has been very, very good with his predictions ever since observing that 80 percent of the passengers on the <em>Diamond Princess </em>cruise ship never came down with Covid in early 2020.</p><p><em><a href=\"https://social.infogalactic.com/micropost/7a6e6fec-21e1-4fa2-bba0-e56a4382b1b0\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "Scott Adams goes full Gamma\nand it is glorious\n.\nCompare my actual Covid prediction record (the best in the nation): http://shorturl.at/dotC3 with the interpretation below and spot the cognitive dissonance tells.\nIt’s weirdly fascinating to see how easily people hallucinate entirely different lives for me.\nNot only does his “actual Covid prediction record” not come anywhere close to Karl Denninger’s, but he was actually dumb enough to get injected with a substance that was already known to be unsafe and ineffective at both times he submitted to the vaccine regime. According to AC and others who watch his streams,\nhe’s psychologically breaking down\nover the cognitive dissonance of a) needing to believe that he is a Very Smart Boy and b) knowing that he was dumb enough to voluntarily take the killshot when tens of millions of Americans were smart enough to avoid following the health care recommendations of global depopulationists.\nThis\nvulgar, eye-twitching rant\nin response to a viewer telling him that he should simply admit that he was wrong tells you everything you need to know about the man’s mental state.\nScott Adams is freaking out. The eye blinking in the video is the tell. Here is one decent probability, in the range of possibilities in the probability matrix of what is going on with him. Scott has some inflammatory issues, mostly producing nerve dysfunction, and those things are impacting his ability to draw and do the things he wants to do, according to some accounts. It is a shame, and people should feel bad about that, as little is as irritating as the spirit having the drive and the body breaking down and holding it back. I think the jab increases the probabilities of those issues getting worse, and he may have begun to feel as if some of his symptoms might have been getting worse. Probably just enough that he began to worry the jab was a mistake, which produced his initial ambivalent, quasi-walk-back on it. People however pounced on him, as he was a convenient outlet for their rage at all the other people knowingly lying to them, and because he has a very defensive reflex, he began fighting. Now he is getting frustrated, because his health may be fucked, which means his life may be fucked, it may be getting worse and he is suffering mentally and physically, and on the other side are people who he feels in conflict with, who will “win” if his body begins failing – and in his head they want to win.\nOn last night’s Darkstream 803, I went through and examined Adams’s\nPandemic Prediction Audit\n, in which the self-appointed “best predictor of the pandemic, at least among public figures” attempted to fold, spindle, and mutilate his past statements in order to make them less obviously wrong to the casual observer. Here is a brief summary of my point-by-point review of his nominal predictions.\nCLOSING TRAVEL WITH CHINA\nNot exactly much of a prediction, and ultimately irrelevant, but we’ll give it to him. 1/1.\nFAUCI AND FACEMASKS\nAdams called out Fauci for lying when he said masks would NOT help the general public.  Masks didn’t stop or even slow down the spread of Covid. This was one of the few times when Fauci was actually telling the truth and the fact that Fauci later lied and supported face-masking doesn’t make Scott’s prediction “that masks probably work” correct. He was flat-out wrong. 1/2.\nLEADERSHIP AS A SUCCESS VARIABLE\nAdams predicted we would not see “leadership” as a variable that caused one country or state to do better than any other in terms of controlling Covid death rates. Whether one compares New York to Florida or the USA to Sweden, that was completely wrong. 1/3.\nLAB LEAK THEORY\nThis wasn’t really a prediction, but because Adams did not toe the official line and endorse the media narrative that merely discussing the possibility of the virus being engineered was conspiracy theory, we’ll give him half a point. 1.5/4.\nVACCINE “SUCCESS”\nHe predicted Project Warp speed would NOT succeed in creating a vaccine in time. He was not only wrong, he was foolish enough to take one of the vaccines that was created twice. And to say that he “never trusted Big Pharma” when he is literally trusting it with his life and his health is simply bizarre and potentially indicative of cognitive vaccine damage. 1.5/5.\nHCQ\nAdams attempted to have it both ways with HCQ. But he was open to it, and it wasn’t the gamechanger that Ivermectin turned out to be. So, another half-point. 2/6.\nIVERMECTIN\nIvermectin has turned out to be as effective as advertised despite the entire media-medical complex attempting to turn public opinion against it, and vastly more effective than the vaccines. A comparable government effort based on Ivermectin rather than the fraudulent vaccines would have crushed the pandemic, instead, pharmacies, doctors, and hospitals have been actively preventing patients from being treated with it. Adams was flat-out wrong. 2/7.\nBIG PHARMA CONTROL\nAdams doesn’t entirey reject “the hypothesis that big Pharma can control the entire world’s medical opinions on HCQ and Ivermectin by buying off a handful of experts in America” but then turns around and says some politician would have exposed it if there was. But his prediction – and his choice to get vaccinated twice – make it clear that he didn’t believe in or predict the actual Big Pharma conspiracy or the level of control of the global media it demonstrated over the last two years. 2/8.\nVACCINE RISKS AND BENEFITS\nAdams incorrectly stated we didn’t know enough — and couldn’t know enough in time — about the confirmed risks or benefits of the vaccines. He got vaccinated in order to travel, then vacillated on the booster shot before finally rejecting it. He was obviously wrong. 2/9.\nTHE TWEET THAT TRIGGERED MY CRITICS\nI’ll present this in its entirety, because it is a beautiful example of the Secret King at his most triumphant in complete defeat. He was totally wrong, and yet, still insists that he was phenomenonically correct inside his skull. 2/10\nI colorfully tweeted after my vaccinations in the summer of 2021 that for the vaccinated, the pandemic was over, but not so much for the unvaccinated. That tweet was based on my personal feelings which I often proclaim to have no basis in fact. I include this example for completeness, but it wasn’t a prediction. It was a psychological phenomenon inside my skull. You don’t need to fact-check it. And for me, it’s still true, subjectively speaking.\nDEATH PREDICTION\nHe predicted that lockdowns would save substantial lives and that only 5,000 people would die. 2/11.\nROGUE DOCTORS PREDICTION\nI predicted the “rogue doctors” were not credible and notes that “most of the rogues have been banned by social media for spreading obvious false information”. By rights, he should get minus two points for this, because the rogue doctors’ various predictions about the vaccines have been generally correct and because he’s dumb enough to assume that social media is a reasonable arbiter of false information. But we’ll just count it as one prediction. 2/12.\nMANDATES\nHe has never favored mandates. Which is good. But this is also not a prediction. 2/12.\nSOCIAL AND HEALTH IMPACT OF THE LOCKDOWNS\nHe correctly notes that everyone knew the lockdowns would be hard on people. Not a prediction. 2/12.\nWEIGHT, FITNESS, AND VITAMIN D\nHe did advise people to get fit, lose weight, and take Vitamin D. Not exactly a prediction, but since Vitamin D supplementation has turned out to be so important in helping people fight off Covid and other diseases, we’ll be generous and give him a full point. 3/13.\nCDC QUARANTINE GUIDELINES\nHe never made any prediction about quarantines beginning or ending. Not a prediction. 3/13.\nWHY “ONE SIDE” GETS BANNED FROM SOCIAL MEDIA\nHe claims to have predicted Twitter and YouTube would not ban him for “violating the narrative” on vaccination safety. He didn’t ever violate the narrative, and he clearly doesn’t understand what the vaccine narrative or “false information” are. 3/14.\nVAERS DATABASE\nHe expected the vaccine side effects were overreported by VAERS. He’s wrong. 3/15.\nMASS FORMATION PSYCHOSIS\nHe thinks the massive global propaganda we have all endured is “a diversion tactic so we stop looking at fake news and social media as the cause of our problems.” This is wrong, stupid, and ignorant. But it’s not a prediction. 3/15\nAUDIT TOTAL:\n3 of 15\nNot a very impressive performance by Mr. Adams, especially when compared to the likes of Karl Denninger, who has been very, very good with his predictions ever since observing that 80 percent of the passengers on the\nDiamond Princess\ncruise ship never came down with Covid in early 2020.\nDISCUSS ON SG",
  "tags": [
    "Gamma",
    "SSH"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-01-12T13:43:28+00:00"
}