{
  "url": "https://voxday.net/2022/01/22/the-soviet-union-didnt-collapse/",
  "scraped_at": "2026-01-08T13:07:17.068729",
  "title": "The Soviet Union Didn’t Collapse",
  "date_display": "January 22, 2022",
  "date_iso": "2022-01-22T11:14:28+00:00",
  "date_from_url": "2022-01-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>E<a href=\"https://social.infogalactic.com/micropost/1b9f2880-b8f4-4007-8868-dd0cfb453fa0\">verything you know</a> about the end of the Cold War is wrong, as a U.S. ambassador who was witness to the events explains:</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p><strong>Octavian Report:</strong> To what extent were Reagan and Gorbachev as people essential to ending the Cold War?</p><p><strong>Ambassador Jack Matlock: </strong>I think only Reagan and Gorbachev would have been able to do what they did. You had to have the two of them in office at the same time. Now, the first George Bush finished it off. But essentially, the Cold War was over ideologically when Reagan left office. It was just up to Bush to continue the policies Reagan had set with Gorbachev in order to finish it peacefully. It was finished by negotiation so that both sides came out as winners. That’s why today, when we talk about winning the Cold War as if Russia was the loser, we’re not only distorting history, we’re making it much more difficult to build a peaceful world.</p><p><strong>OR:</strong> In what way do you think Russia won?</p><p><strong>Matlock:</strong> First of all, Russia was part of the Soviet Union. We ended the Cold War with the Soviet Union, not with Russia. We’ve got to stop talking about Russia as if it was the same entity, whether a Communist empire or whether the current Russian Federation. There are a few characteristics that they share, but these are entirely different political entities.</p><p>That’s one thing you have to understand. The Soviet Union won the Cold War — as did everybody else. Ending it saved them from the collapse that was going on internally. The arms race was killing them. Their ideology was killing them. Their foreign policy was not in their interest. Gorbachev saw that and Reagan saw that. We set terms to end the Cold War which were in the interest of the Soviet Union if they wanted to follow a peaceful policy towards the West, which they did.</p><p>Losing the Cold War would have been if it went hot. Everybody would have lost. We ended it without anyone losing anything. The Soviet Union lost nothing in ending the Cold War other than its control of Eastern Europe, which was not an advantage for it but a disadvantage. The idea that somehow controlling other countries that don’t want you to control them is an asset is absolutely wrong. Look at the problems we have in the Middle East today. It is a liability. It is not an asset. In giving up those liabilities, Gorbachev made it possible to try to reform the system.</p><p>He was unable to do so but the system broke up from the inside after the Cold War was over. Ending the Cold War, ending the arms race which literally was killing their economy, ending their attempt to project their power abroad which was creating liabilities, ending all of that was to the advantage of the Soviet Union. It gave the country the possibility of reforming and coming into the late 20th century. They couldn’t do so under the conditions of the Cold War.</p></blockquote><p>The seeds of future wars are often planted in the ends of the previous one. The neocons who used to control the Soviet Union now control only Ukraine and, to a lesser extent, the United States. That’s why they are now so eager for war with Russia, since the Russians managed to free themselves from neocon rule and the so-called neo-liberal world order with the collapse of the Yeltsin regime.</p><p>The events of the present make a lot more sense once one has a more accurate account of those of the past.</p><p><em><a href=\"https://social.infogalactic.com/micropost/1b9f2880-b8f4-4007-8868-dd0cfb453fa0\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "E\nverything you know\nabout the end of the Cold War is wrong, as a U.S. ambassador who was witness to the events explains:\nOctavian Report:\nTo what extent were Reagan and Gorbachev as people essential to ending the Cold War?\nAmbassador Jack Matlock:\nI think only Reagan and Gorbachev would have been able to do what they did. You had to have the two of them in office at the same time. Now, the first George Bush finished it off. But essentially, the Cold War was over ideologically when Reagan left office. It was just up to Bush to continue the policies Reagan had set with Gorbachev in order to finish it peacefully. It was finished by negotiation so that both sides came out as winners. That’s why today, when we talk about winning the Cold War as if Russia was the loser, we’re not only distorting history, we’re making it much more difficult to build a peaceful world.\nOR:\nIn what way do you think Russia won?\nMatlock:\nFirst of all, Russia was part of the Soviet Union. We ended the Cold War with the Soviet Union, not with Russia. We’ve got to stop talking about Russia as if it was the same entity, whether a Communist empire or whether the current Russian Federation. There are a few characteristics that they share, but these are entirely different political entities.\nThat’s one thing you have to understand. The Soviet Union won the Cold War — as did everybody else. Ending it saved them from the collapse that was going on internally. The arms race was killing them. Their ideology was killing them. Their foreign policy was not in their interest. Gorbachev saw that and Reagan saw that. We set terms to end the Cold War which were in the interest of the Soviet Union if they wanted to follow a peaceful policy towards the West, which they did.\nLosing the Cold War would have been if it went hot. Everybody would have lost. We ended it without anyone losing anything. The Soviet Union lost nothing in ending the Cold War other than its control of Eastern Europe, which was not an advantage for it but a disadvantage. The idea that somehow controlling other countries that don’t want you to control them is an asset is absolutely wrong. Look at the problems we have in the Middle East today. It is a liability. It is not an asset. In giving up those liabilities, Gorbachev made it possible to try to reform the system.\nHe was unable to do so but the system broke up from the inside after the Cold War was over. Ending the Cold War, ending the arms race which literally was killing their economy, ending their attempt to project their power abroad which was creating liabilities, ending all of that was to the advantage of the Soviet Union. It gave the country the possibility of reforming and coming into the late 20th century. They couldn’t do so under the conditions of the Cold War.\nThe seeds of future wars are often planted in the ends of the previous one. The neocons who used to control the Soviet Union now control only Ukraine and, to a lesser extent, the United States. That’s why they are now so eager for war with Russia, since the Russians managed to free themselves from neocon rule and the so-called neo-liberal world order with the collapse of the Yeltsin regime.\nThe events of the present make a lot more sense once one has a more accurate account of those of the past.\nDISCUSS ON SG",
  "tags": [
    "history",
    "Russia",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-01-22T11:14:31+00:00"
}