{
  "url": "https://voxday.net/2022/01/23/the-best-thing-that-ever-happened/",
  "scraped_at": "2026-01-08T13:07:22.211506",
  "title": "The Best Thing That Ever Happened",
  "date_display": "January 23, 2022",
  "date_iso": "2022-01-23T00:52:58+00:00",
  "date_from_url": "2022-01-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img alt=\"\" class=\"wp-image-52135\" decoding=\"async\" fetchpriority=\"high\" height=\"512\" sizes=\"(max-width: 512px) 100vw, 512px\" src=\"https://voxday.net/wp-content/uploads/2022/01/image-3.png\" srcset=\"https://voxday.net/wp-content/uploads/2022/01/image-3.png 512w, https://voxday.net/wp-content/uploads/2022/01/image-3-300x300.png 300w, https://voxday.net/wp-content/uploads/2022/01/image-3-150x150.png 150w\" width=\"512\"/></figure></div><p>The latest Vaxx Trax, <a href=\"https://soundcloud.com/john-bradley-298288478/best-thing-ever?in=john-bradley-298288478/sets/vaxx-trax\">THE BEST THING THAT EVER HAPPENED</a>, is now available for your listening pleasure. Lyrics by Vox Day with assistance from Scott Adams… or possibly the other way around. Scott once claimed that I am his mascot. Whether that is true or not, it is eminently clear that Scott Adams is my muse.</p><p>I hate the world tonight<br/>Shelley said that I was wrong, but I was right<br/>Tried to tell you but you seem to think that<br/>Maybe I said something incorrect<br/>I say you project</p><p>Don’t hallucinate<br/>If you think I’m wrong I’ll just equivocate<br/>I can understand how you’d be so confused<br/>I don’t envy you<br/>I’m a prophet and an oracle of perfect persuasion</p><p>You’re a bitch<br/>You’re a cunt<br/>You’re cognitive dissonant<br/>You’re a nasty human stain<br/>And you should be ashamed<br/>You’re a total narcissist<br/>You fucking piece of shit<br/>And so you’d better shut up, go the hell away</p><p>Don’t you know who I am?<br/>This may mean you’ll have to try to understand<br/>Rest assured that when you think I contradict<br/>Half the things that I predict<br/>Tomorrow they will change, yesterday’s won’t mean a thing</p><p>You’re a bitch<br/>You’re a cunt<br/>You’re a mental midget runt<br/>You’re disgusting you’re insane<br/>And you should be ashamed<br/>I’m a master hypnotist<br/>You fucking piece of shit<br/>And now you’re banned so you should go the hell away</p><p>Just when you think you got me figured out<br/>My reason’s already changing<br/>You should die and I’ll tell you why<br/>Don’t comment at me</p><p>You’re a bitch<br/>You’re a cunt<br/>You’re a sick and evil front<br/>You’re so stupid you’re so vain<br/>And you should be ashamed<br/>I’m a master hypnotist<br/>And you’re the narcissist<br/>So shut the fuck up Shelley, go the hell away</p><p>I’m a seer, I’m the law<br/>I’m perfect without a flaw<br/>The best thing that ever happened<br/>To you bitch you’re probably fat and<br/>I got you hypnotized<br/>Can’t say I ever lied<br/>You know I’m always right in every single way</p><p><em><a href=\"https://social.infogalactic.com/micropost/76fc1b7a-50e2-4682-8779-b7ecb07a715c\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "The latest Vaxx Trax,\nTHE BEST THING THAT EVER HAPPENED\n, is now available for your listening pleasure. Lyrics by Vox Day with assistance from Scott Adams… or possibly the other way around. Scott once claimed that I am his mascot. Whether that is true or not, it is eminently clear that Scott Adams is my muse.\nI hate the world tonight\nShelley said that I was wrong, but I was right\nTried to tell you but you seem to think that\nMaybe I said something incorrect\nI say you project\nDon’t hallucinate\nIf you think I’m wrong I’ll just equivocate\nI can understand how you’d be so confused\nI don’t envy you\nI’m a prophet and an oracle of perfect persuasion\nYou’re a bitch\nYou’re a cunt\nYou’re cognitive dissonant\nYou’re a nasty human stain\nAnd you should be ashamed\nYou’re a total narcissist\nYou fucking piece of shit\nAnd so you’d better shut up, go the hell away\nDon’t you know who I am?\nThis may mean you’ll have to try to understand\nRest assured that when you think I contradict\nHalf the things that I predict\nTomorrow they will change, yesterday’s won’t mean a thing\nYou’re a bitch\nYou’re a cunt\nYou’re a mental midget runt\nYou’re disgusting you’re insane\nAnd you should be ashamed\nI’m a master hypnotist\nYou fucking piece of shit\nAnd now you’re banned so you should go the hell away\nJust when you think you got me figured out\nMy reason’s already changing\nYou should die and I’ll tell you why\nDon’t comment at me\nYou’re a bitch\nYou’re a cunt\nYou’re a sick and evil front\nYou’re so stupid you’re so vain\nAnd you should be ashamed\nI’m a master hypnotist\nAnd you’re the narcissist\nSo shut the fuck up Shelley, go the hell away\nI’m a seer, I’m the law\nI’m perfect without a flaw\nThe best thing that ever happened\nTo you bitch you’re probably fat and\nI got you hypnotized\nCan’t say I ever lied\nYou know I’m always right in every single way\nDISCUSS ON SG",
  "tags": [
    "music",
    "rhetoric",
    "Vaxx Trax"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-01-23T13:10:10+00:00"
}