{
  "url": "https://voxday.net/2022/01/12/what-is-death/",
  "scraped_at": "2026-01-08T13:06:10.245655",
  "title": "What is Death?",
  "date_display": "January 12, 2022",
  "date_iso": "2022-01-12T13:00:00+00:00",
  "date_from_url": "2022-01-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which I answer Cicero.</p><p>Someone pointed out on last night’s Darkstream that they’d like to see more veriphysics, and as I just happened to be casually reading a little from <em>The Tusculan Disputations</em> after finishing Stanley Payne’s excellent biography of Francisco Paulino Hermenegildo Teódulo Franco Bahamonde, I thought some of you might be interested in my instinctive reaction to the following paragraphy.</p><p>And yes, I am aware of how lah-di-dah that sounded, but it happens to be the truth. If it makes you feel any better, that was probably just a subconscious response to a recent binge of the underrated Nancy Varian Berberick and her forays into <em>Dragonlance</em>.</p><blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\"><p>The first thing, then, is to inquire what death, which seems to be so well understood, really is; for some imagine death to be the departure of the soul from the body; others think that there is no such departure, but that soul and body perish together, and that, the soul is extinguished with the body. Of those who think that the soul does depart from the body, some believe in its immediate dissolution; others fancy that it continues to exist for a time; and others believe that it lasts for ever. There is great dispute even what the soul is, where it is, and whence it is derived: with some, the heart itself (<em>cor</em>) seems to be the soul, hence the expressions, <em>excordes, vecordes, concordes</em>; and that prudent Nasica, who was twice consul, was called Corculus, i.e. wise-heart; and Ælius Sextus is described as <em>Egregie cordatus homo, catus Æliu’ Sextus</em>—that great wise-hearted man, sage Ælius. Empedocles imagines the blood, which is suffused over the heart, to be the soul; to others, a certain part of the brain seems to be the throne of the soul; others neither allow the heart itself, nor any portion of the brain, to be the soul; but think either that the heart is the seat and abode of the soul; or else that the brain is so. Some would have the soul, or spirit, to be the <em>anima</em>, as our schools generally agree; and indeed the name signifies as much, for we use the expressions <em>animam agere</em>, to live; <em>animam efflare</em>, to expire; <em>animosi</em>, men of spirit; <em>bene animati</em>, men of right feeling; <em>exanimi sententia</em>, according to our real opinion—and the very word <em>animus </em>is derived from <em>anima</em>. Again, the soul seems to Zeno the Stoic to be fire.</p><cite><em>The Tusculan Disputations</em>, Marcus Tullius Cicero</cite></blockquote><p>It’s always both amusing and frustrating that the ancient philosophers so seldom managed to actually stay on their own stated topic for more than a sentence or two.</p><p>This is, in my opinion, what death observably and undeniably is:</p><p><em>A cessation of an intelligence’s interaction with a material plane of reality, as observed by intelligences still inhabiting that plane. This cessation of interaction occurs in company with various quantifiable changes in the physical body of the recently transformed intelligence and is subsequently followed by the decomposition of the body.</em></p><p>There is no need to delve into definitions of the soul, its purported existence, or its subsequent fate, in order to understand what death is. Indeed, before one delves into those complicated and potentially ineffable things, one would do well to first complete the original task one has set oneself.</p><p><em><a href=\"https://social.infogalactic.com/micropost/0ea9b5c5-7ab5-4943-9f26-ada20e5782c3\">DISCUSS ON SG</a></em></p></div>",
  "content_text": "In which I answer Cicero.\nSomeone pointed out on last night’s Darkstream that they’d like to see more veriphysics, and as I just happened to be casually reading a little from\nThe Tusculan Disputations\nafter finishing Stanley Payne’s excellent biography of Francisco Paulino Hermenegildo Teódulo Franco Bahamonde, I thought some of you might be interested in my instinctive reaction to the following paragraphy.\nAnd yes, I am aware of how lah-di-dah that sounded, but it happens to be the truth. If it makes you feel any better, that was probably just a subconscious response to a recent binge of the underrated Nancy Varian Berberick and her forays into\nDragonlance\n.\nThe first thing, then, is to inquire what death, which seems to be so well understood, really is; for some imagine death to be the departure of the soul from the body; others think that there is no such departure, but that soul and body perish together, and that, the soul is extinguished with the body. Of those who think that the soul does depart from the body, some believe in its immediate dissolution; others fancy that it continues to exist for a time; and others believe that it lasts for ever. There is great dispute even what the soul is, where it is, and whence it is derived: with some, the heart itself (\ncor\n) seems to be the soul, hence the expressions,\nexcordes, vecordes, concordes\n; and that prudent Nasica, who was twice consul, was called Corculus, i.e. wise-heart; and Ælius Sextus is described as\nEgregie cordatus homo, catus Æliu’ Sextus\n—that great wise-hearted man, sage Ælius. Empedocles imagines the blood, which is suffused over the heart, to be the soul; to others, a certain part of the brain seems to be the throne of the soul; others neither allow the heart itself, nor any portion of the brain, to be the soul; but think either that the heart is the seat and abode of the soul; or else that the brain is so. Some would have the soul, or spirit, to be the\nanima\n, as our schools generally agree; and indeed the name signifies as much, for we use the expressions\nanimam agere\n, to live;\nanimam efflare\n, to expire;\nanimosi\n, men of spirit;\nbene animati\n, men of right feeling;\nexanimi sententia\n, according to our real opinion—and the very word\nanimus\nis derived from\nanima\n. Again, the soul seems to Zeno the Stoic to be fire.\nThe Tusculan Disputations\n, Marcus Tullius Cicero\nIt’s always both amusing and frustrating that the ancient philosophers so seldom managed to actually stay on their own stated topic for more than a sentence or two.\nThis is, in my opinion, what death observably and undeniably is:\nA cessation of an intelligence’s interaction with a material plane of reality, as observed by intelligences still inhabiting that plane. This cessation of interaction occurs in company with various quantifiable changes in the physical body of the recently transformed intelligence and is subsequently followed by the decomposition of the body.\nThere is no need to delve into definitions of the soul, its purported existence, or its subsequent fate, in order to understand what death is. Indeed, before one delves into those complicated and potentially ineffable things, one would do well to first complete the original task one has set oneself.\nDISCUSS ON SG",
  "tags": [
    "philosophy",
    "Veriphysics"
  ],
  "categories": [],
  "sitemap_lastmod": "2022-01-12T13:58:08+00:00"
}