{
  "url": "https://voxday.net/2015/12/05/10-reasons-to-grow-or-die/",
  "scraped_at": "2025-12-17T17:36:28.959095",
  "title": "10 reasons to GROW OR DIE!",
  "date_display": "December 5, 2015",
  "date_iso": "2015-12-05T07:00:00+00:00",
  "date_from_url": "2015-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>All right, that was a little bit much. It’s actually <a href=\"http://growyourowngroceries.org/10-reasons-to-garden-now/\">10 reasons to garden at this particular point in the space-time continuum</a>.</p><blockquote class=\"tr_bq\"><p> Someone commented on one of my videos the other day that she was “a city girl” who didn’t know what she was doing in the garden… and that she was probably just going to give up.</p><p>I urged her to keep going. Now is a terrible time to quit gardening!</p><p>With the way the world is going, this is the time to garden like you’ve never gardened before. Here are just a few reasons.</p><p>1. GMOs<br>Do you really want to be part of a big science experiment, eating gene-spliced foods without knowing if they’re safe or not? Me either! Grow your own food with heirloom seeds and step away from the lab.</br></p><p>2. Economics<br>The economy is rotten and is likely to get worse. Runaway immigration, shaky banks, rising food costs, global unrest… all these have an impact on wages, investments and savings. Fortunately, a garden can save you some serious money.</br></p><p>3. Eating Local<br>Why count on food coming in from 1,000 miles away? Eating locally is a big deal right now – and you can’t get any more local than your own yard. Put in a garden and cut out the shipping!</br></p></blockquote><p>Read the rest of David the Good’s article <a href=\"http://growyourowngroceries.org/10-reasons-to-garden-now/\">there</a>.</p></div>",
  "content_text": "All right, that was a little bit much. It’s actually\n10 reasons to garden at this particular point in the space-time continuum\n.\nSomeone commented on one of my videos the other day that she was “a city girl” who didn’t know what she was doing in the garden… and that she was probably just going to give up.\nI urged her to keep going. Now is a terrible time to quit gardening!\nWith the way the world is going, this is the time to garden like you’ve never gardened before. Here are just a few reasons.\n1. GMOs\nDo you really want to be part of a big science experiment, eating gene-spliced foods without knowing if they’re safe or not? Me either! Grow your own food with heirloom seeds and step away from the lab.\n2. Economics\nThe economy is rotten and is likely to get worse. Runaway immigration, shaky banks, rising food costs, global unrest… all these have an impact on wages, investments and savings. Fortunately, a garden can save you some serious money.\n3. Eating Local\nWhy count on food coming in from 1,000 miles away? Eating locally is a big deal right now – and you can’t get any more local than your own yard. Put in a garden and cut out the shipping!\nRead the rest of David the Good’s article\nthere\n.",
  "tags": [
    "Castalia House",
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-05T07:00:00+00:00"
}