{
  "url": "https://voxday.net/2015/12/09/a-dialogue-with-scott-adams/",
  "scraped_at": "2025-12-17T17:36:59.601543",
  "title": "A dialogue with Scott Adams",
  "date_display": "December 9, 2015",
  "date_iso": "2015-12-09T09:44:00+00:00",
  "date_from_url": "2015-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>To put it into context, I was quoting <a href=\"http://blog.dilbert.com/post/134791529391/risk-management-trump-persuasion-series\">this piece</a> by Adams to which I had already linked:</p><blockquote class=\"tr_bq\"><p> Vox Day ‏@voxday<br> “I would accept up to 1,000 dead Americans, over a ten-year period, to allow Muslim non-citizens to enter this country.” @ScottAdamsSays</br></p><p>Scott Adams ‏@ScottAdamsSays<br> What’s your number?</br></p><p>Vox Day ‏@voxday<br> Mine is zero. False dilemma. Plenary power doctrine permits Muslim immigration ban. 124 years of precedent.</br></p><p>Scott Adams ‏@ScottAdamsSays<br> The legal question can be separated.</br></p><p>Vox Day ‏@voxday<br> It can be, but it shouldn’t be. That IS the context, after all. Look, it’s a good question. Just bad answer.</br></p><p>emilio rodriguez ‏@emiliorrubio<br> Mine is also 0. Seeing as we gain NOTHING from muslim immigration. It’s no benefit for a cost.</br></p><p>Scott Adams ‏@ScottAdamsSays<br> Nothing except respect for people of different religions (freedom). Do you value that at zero?</br></p><p>Vox Day ‏@voxday<br> Yes, because I know military history. Muslim immigration into Dar al-Harb means war. Always.</br></p><p>Scott Adams ‏@ScottAdamsSays<br> It’s a risk assessment about saving more than lives than you kill (in the long run).</br></p><p>Vox Day ‏@voxday<br> You need to reassess. Because the correct answer is definitely and absolutely zero.</br></p><p>Scott Adams ‏@ScottAdamsSays<br> Religious intolerance has bad history. Are you sure it always ends well?</br></p><p>Vox Day ‏@voxday<br> Not always, but sometimes. If there was no intolerance at Vienna, at Lepanto, and Tours, no Enlightenment.</br></p><p>Scott Adams ‏@ScottAdamsSays<br> Would you expel legal Muslim residents in the country under the same principle of safety over principle?</br></p><p>Vox Day ‏@voxday<br> Yes. And I predict that every single Western country will within three decades. Reconquesta 2.0.</br></p><p>Vox Day ‏@voxday <br> False dilemma, though. Your principle doesn’t exist legally, and it’s your principle, not mine.</br></p><p>Scott Adams ‏@ScottAdamsSays<br> Opinion noted. See my book, The Religion War (sequel to God’s Debris). Speaks to that scenario, in fiction.</br></p></blockquote><p>Now, if you wish to analyze this, what you’ll see is Adams engaging in pseudo-dialectic, while I am utilizing dialectic in a rhetorical manner. With its 140-character limit, Twitter is a very poor medium for complex communication, but it does have the benefit of stripping away the ability to engage easily in word games. The simplicity of the medium makes communication cruder, but more direct.</p><p>Adams is not an SJW, but here he argues in a similar manner, simply moving the goalposts each time his point is successfully dealt with. However, Adams is an intellectual in the true sense; he likes to play with ideas so one should never assume that what he is saying is necessarily what he genuinely believes.</p><p>Adams knows the choice he puts forth is a false dilemma; it is based on a false foundation of the United States being a polity that enforces complete religious freedom. This is nonsense, as the transmutation of “Congress shall make no law” into “a moment of silence in public schools is outlawed” suffices to demonstrate. And Muslims are <i>already </i>banned from immigrating as “people who practice polygamy” as per the 1891 statute.</p><p>That’s why Scott wants to leave the legal aspects out, because they also render his dilemma moot. He tries risk assessment, but that’s even worse ground for him both rhetorically and dialectically due to the 1,300-year history of Muslim violence. So he tries to go to the abstract, but as numerous people on Twitter pointed out, “respect” is not synonymous with “granting permanent residence rights and citizenship”.</p><p>In the end, he’s forced to argue from incredulity concerning an proposition that no one has even made yet, but even there, he’s on shaky ground because most Americans would happily repatriate every Muslim in America tomorrow. While he does do a good job maintaining frame, the problem with doing so as your argument keeps shifting is that you eventually wind up looking like one of those whom Aristotle described as being unable to learn from information.</p></div>",
  "content_text": "To put it into context, I was quoting\nthis piece\nby Adams to which I had already linked:\nVox Day ‏@voxday\n“I would accept up to 1,000 dead Americans, over a ten-year period, to allow Muslim non-citizens to enter this country.” @ScottAdamsSays\nScott Adams ‏@ScottAdamsSays\nWhat’s your number?\nVox Day ‏@voxday\nMine is zero. False dilemma. Plenary power doctrine permits Muslim immigration ban. 124 years of precedent.\nScott Adams ‏@ScottAdamsSays\nThe legal question can be separated.\nVox Day ‏@voxday\nIt can be, but it shouldn’t be. That IS the context, after all. Look, it’s a good question. Just bad answer.\nemilio rodriguez ‏@emiliorrubio\nMine is also 0. Seeing as we gain NOTHING from muslim immigration. It’s no benefit for a cost.\nScott Adams ‏@ScottAdamsSays\nNothing except respect for people of different religions (freedom). Do you value that at zero?\nVox Day ‏@voxday\nYes, because I know military history. Muslim immigration into Dar al-Harb means war. Always.\nScott Adams ‏@ScottAdamsSays\nIt’s a risk assessment about saving more than lives than you kill (in the long run).\nVox Day ‏@voxday\nYou need to reassess. Because the correct answer is definitely and absolutely zero.\nScott Adams ‏@ScottAdamsSays\nReligious intolerance has bad history. Are you sure it always ends well?\nVox Day ‏@voxday\nNot always, but sometimes. If there was no intolerance at Vienna, at Lepanto, and Tours, no Enlightenment.\nScott Adams ‏@ScottAdamsSays\nWould you expel legal Muslim residents in the country under the same principle of safety over principle?\nVox Day ‏@voxday\nYes. And I predict that every single Western country will within three decades. Reconquesta 2.0.\nVox Day ‏@voxday\nFalse dilemma, though. Your principle doesn’t exist legally, and it’s your principle, not mine.\nScott Adams ‏@ScottAdamsSays\nOpinion noted. See my book, The Religion War (sequel to God’s Debris). Speaks to that scenario, in fiction.\nNow, if you wish to analyze this, what you’ll see is Adams engaging in pseudo-dialectic, while I am utilizing dialectic in a rhetorical manner. With its 140-character limit, Twitter is a very poor medium for complex communication, but it does have the benefit of stripping away the ability to engage easily in word games. The simplicity of the medium makes communication cruder, but more direct.\nAdams is not an SJW, but here he argues in a similar manner, simply moving the goalposts each time his point is successfully dealt with. However, Adams is an intellectual in the true sense; he likes to play with ideas so one should never assume that what he is saying is necessarily what he genuinely believes.\nAdams knows the choice he puts forth is a false dilemma; it is based on a false foundation of the United States being a polity that enforces complete religious freedom. This is nonsense, as the transmutation of “Congress shall make no law” into “a moment of silence in public schools is outlawed” suffices to demonstrate. And Muslims are\nalready\nbanned from immigrating as “people who practice polygamy” as per the 1891 statute.\nThat’s why Scott wants to leave the legal aspects out, because they also render his dilemma moot. He tries risk assessment, but that’s even worse ground for him both rhetorically and dialectically due to the 1,300-year history of Muslim violence. So he tries to go to the abstract, but as numerous people on Twitter pointed out, “respect” is not synonymous with “granting permanent residence rights and citizenship”.\nIn the end, he’s forced to argue from incredulity concerning an proposition that no one has even made yet, but even there, he’s on shaky ground because most Americans would happily repatriate every Muslim in America tomorrow. While he does do a good job maintaining frame, the problem with doing so as your argument keeps shifting is that you eventually wind up looking like one of those whom Aristotle described as being unable to learn from information.",
  "tags": [
    "debate",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-09T09:44:00+00:00"
}