{
  "url": "https://voxday.net/2015/12/04/did-i-not-say-as-muc/",
  "scraped_at": "2025-12-17T17:36:25.302518",
  "title": "Did I not say as much?",
  "date_display": "December 4, 2015",
  "date_iso": "2015-12-04T18:00:00+00:00",
  "date_from_url": "2015-12-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have never claimed to be a conservative or a Republican. For some reason, a fair number of people seem to have trouble grasping this. But the real self-proclaimed conservatives don’t seem to have any trouble doing so, such as Mr. Marcus <a href=\"http://www.milobookclub.com/2015/12/03/portrait-of-cuckservative/\">from yesterday’s pos</a>t concerning his Federalist article.</p><blockquote class=\"tr_bq\"><p> David Marcus ‏@BlueBoxDave<br> So @voxday did a portrait of me, the good news is he disavows conservatism as there is no place in it for him.</br></p><p>Vox Day @voxday <br> You’re absolutely right. Unlike conservatives, I have principles beyond “don’t get called racist” and “incoming, surrender!”</br></p><p>David Marcus ‏@BlueBoxDave<br> Good luck with your American Nationalist movement. I can’t wait to see the outfits.</br></p><p>Vox Day @voxday <br> It’s fascinating to see conservatives devolve to imitating the left. You’ve got nothing they don’t do better<b>.</b> #cuckservative</br></p><p>David Marcus ‏@BlueBoxDave<br> Opposing racial discrimination is not a leftist position. It’s an American position.</br></p><p>Vox Day ‏@voxday<br> That’s absolute ahistorical bullshit. Anti-racism is anti-nationalism. Which, by definition, is anti-American. Your position is opposed to Franklin, Washington, Jefferson, and Hamilton, just for starters.</br></p></blockquote></div>",
  "content_text": "I have never claimed to be a conservative or a Republican. For some reason, a fair number of people seem to have trouble grasping this. But the real self-proclaimed conservatives don’t seem to have any trouble doing so, such as Mr. Marcus\nfrom yesterday’s pos\nt concerning his Federalist article.\nDavid Marcus ‏@BlueBoxDave\nSo @voxday did a portrait of me, the good news is he disavows conservatism as there is no place in it for him.\nVox Day @voxday\nYou’re absolutely right. Unlike conservatives, I have principles beyond “don’t get called racist” and “incoming, surrender!”\nDavid Marcus ‏@BlueBoxDave\nGood luck with your American Nationalist movement. I can’t wait to see the outfits.\nVox Day @voxday\nIt’s fascinating to see conservatives devolve to imitating the left. You’ve got nothing they don’t do better\n.\n#cuckservative\nDavid Marcus ‏@BlueBoxDave\nOpposing racial discrimination is not a leftist position. It’s an American position.\nVox Day ‏@voxday\nThat’s absolute ahistorical bullshit. Anti-racism is anti-nationalism. Which, by definition, is anti-American. Your position is opposed to Franklin, Washington, Jefferson, and Hamilton, just for starters.",
  "tags": [
    "cuckservative",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-04T18:00:00+00:00"
}