{
  "url": "https://voxday.net/2015/12/01/grow-up-or-get-ou/",
  "scraped_at": "2025-12-17T17:36:00.261340",
  "title": "Grow up or get out!",
  "date_display": "December 1, 2015",
  "date_iso": "2015-12-01T13:00:00+00:00",
  "date_from_url": "2015-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Christian university president’s <a href=\"http://www.okwu.edu/blog/2015/11/this-is-not-a-day-care-its-a-university/\">message to SJWs</a>:</p><blockquote class=\"tr_bq\"><p> This past week, I actually had a student come forward after a<br> university chapel service and complain because he felt “victimized” by a<br> sermon on the topic of 1 Corinthians 13. It appears that this young<br> scholar felt offended because a homily on love made him feel bad for not<br> showing love. In his mind, the speaker was wrong for making him, and<br> his peers, feel uncomfortable.</br></br></br></br></br></p><p>I’m not making this up. Our culture has actually taught our kids to<br> be this self-absorbed and narcissistic. Any time their feelings are<br> hurt, they are the victims. Anyone who dares challenge them and, thus,<br> makes them “feel bad” about themselves, is a “hater,” a “bigot,” an<br> “oppressor,” and a “victimizer.”</br></br></br></br></p><p>I have a message for this young man and all others who care to<br> listen. That feeling of discomfort you have after listening to a sermon<br> is called a conscience. An altar call is supposed to make you feel bad.<br> It is supposed to make you feel guilty. The goal of many a good sermon<br> is to get you to confess your sins—not coddle you in your selfishness.<br> The primary objective of the Church and the Christian faith is your<br> confession, not your self-actualization.</br></br></br></br></br></br></p><p>So here’s my advice:</p><p>If you want the chaplain to tell you you’re a victim rather than tell<br> you that you need virtue, this may not be the university you’re looking<br> for. If you want to complain about a sermon that makes you feel less<br> than loving for not showing love, this might be the wrong place.</br></br></br></p><p>If you’re more interested in playing the “hater” card than you are in<br> confessing your own hate; if you want to arrogantly lecture, rather<br> than humbly learn; if you don’t want to feel guilt in your soul when you<br> are guilty of sin; if you want to be enabled rather than confronted,<br> there are many universities across the land (in Missouri and elsewhere)<br> that will give you exactly what you want, but Oklahoma Wesleyan isn’t<br> one of them.</br></br></br></br></br></br></p></blockquote><p>You will notice that unlike Missouri president Tim Wolfe, who resigned in the face of SJW pressure, Mr. Piper will be keeping his job. About the only thing that could possibly have been better is if he announced that he had expelled the SJW student who complained. And talk about sticking the rhetorical landing!</p><p><i>“This is not a day care. This is a university!”</i></p><p>As the brand name universities succumb to social justice convergence, the Christian universities will rise in both educational value and social cachet. Which is why they need to set policies in place to defeat SJW entryism now. </p></div>",
  "content_text": "A Christian university president’s\nmessage to SJWs\n:\nThis past week, I actually had a student come forward after a\nuniversity chapel service and complain because he felt “victimized” by a\nsermon on the topic of 1 Corinthians 13. It appears that this young\nscholar felt offended because a homily on love made him feel bad for not\nshowing love. In his mind, the speaker was wrong for making him, and\nhis peers, feel uncomfortable.\nI’m not making this up. Our culture has actually taught our kids to\nbe this self-absorbed and narcissistic. Any time their feelings are\nhurt, they are the victims. Anyone who dares challenge them and, thus,\nmakes them “feel bad” about themselves, is a “hater,” a “bigot,” an\n“oppressor,” and a “victimizer.”\nI have a message for this young man and all others who care to\nlisten. That feeling of discomfort you have after listening to a sermon\nis called a conscience. An altar call is supposed to make you feel bad.\nIt is supposed to make you feel guilty. The goal of many a good sermon\nis to get you to confess your sins—not coddle you in your selfishness.\nThe primary objective of the Church and the Christian faith is your\nconfession, not your self-actualization.\nSo here’s my advice:\nIf you want the chaplain to tell you you’re a victim rather than tell\nyou that you need virtue, this may not be the university you’re looking\nfor. If you want to complain about a sermon that makes you feel less\nthan loving for not showing love, this might be the wrong place.\nIf you’re more interested in playing the “hater” card than you are in\nconfessing your own hate; if you want to arrogantly lecture, rather\nthan humbly learn; if you don’t want to feel guilt in your soul when you\nare guilty of sin; if you want to be enabled rather than confronted,\nthere are many universities across the land (in Missouri and elsewhere)\nthat will give you exactly what you want, but Oklahoma Wesleyan isn’t\none of them.\nYou will notice that unlike Missouri president Tim Wolfe, who resigned in the face of SJW pressure, Mr. Piper will be keeping his job. About the only thing that could possibly have been better is if he announced that he had expelled the SJW student who complained. And talk about sticking the rhetorical landing!\n“This is not a day care. This is a university!”\nAs the brand name universities succumb to social justice convergence, the Christian universities will rise in both educational value and social cachet. Which is why they need to set policies in place to defeat SJW entryism now.",
  "tags": [
    "education",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-01T13:00:00+00:00"
}