{
  "url": "https://voxday.net/2015/12/12/how-you-can-help/",
  "scraped_at": "2025-12-17T17:37:26.023205",
  "title": "How you can help",
  "date_display": "December 12, 2015",
  "date_iso": "2015-12-12T16:34:00+00:00",
  "date_from_url": "2015-12-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As you’ve probably noticed, I’ve added an Amazon banner ad on the right sidebar. For years, people have been telling me that I should get an affiliate program going, considering how many people have bought books there in support of me, in support of Castalia House, or as the result of a book review. I simply never got around to it, being busy with rather more hands-on priorities, but as part of my effort to better maintain focus (and some much-needed external encouragement), I finally took the time to set it up.</p><p>I’m sure you know how it works. Not only will VP get credit for direct sales of the product linked, but also for any items you go on to purchase in that session from that particular entrance into Amazon. So, start your Christmas shopping here! It doesn’t matter if you click on the banner ad or on one of the various book covers; the books under Castalia New Releases will always serve as a functional Amazon portal. Or you can click on the text link underneath them on the right: <a href=\"http://amzn.to/1QD1j2s\">Amazon VD Page</a>.</p><p>There have been a lot of changes in the last two years, but one thing that remains the same, and will always remain the same, is that the core blog content of multiple posts per day will remain free. Commenting will also remain as free and unmoderated as I can permit it to be without permitting the spammers, trolls, and monomaniacs to disrupt the discourse. You don’t have to support VP by utilizing the associate program in order for this to continue because it will continue as it has been regardless, but the more you do, the more we can do.</p></div>",
  "content_text": "As you’ve probably noticed, I’ve added an Amazon banner ad on the right sidebar. For years, people have been telling me that I should get an affiliate program going, considering how many people have bought books there in support of me, in support of Castalia House, or as the result of a book review. I simply never got around to it, being busy with rather more hands-on priorities, but as part of my effort to better maintain focus (and some much-needed external encouragement), I finally took the time to set it up.\nI’m sure you know how it works. Not only will VP get credit for direct sales of the product linked, but also for any items you go on to purchase in that session from that particular entrance into Amazon. So, start your Christmas shopping here! It doesn’t matter if you click on the banner ad or on one of the various book covers; the books under Castalia New Releases will always serve as a functional Amazon portal. Or you can click on the text link underneath them on the right:\nAmazon VD Page\n.\nThere have been a lot of changes in the last two years, but one thing that remains the same, and will always remain the same, is that the core blog content of multiple posts per day will remain free. Commenting will also remain as free and unmoderated as I can permit it to be without permitting the spammers, trolls, and monomaniacs to disrupt the discourse. You don’t have to support VP by utilizing the associate program in order for this to continue because it will continue as it has been regardless, but the more you do, the more we can do.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-12T16:34:00+00:00"
}