{
  "url": "https://voxday.net/2015/12/03/kindle-monthly-dea/",
  "scraped_at": "2025-12-17T17:36:14.288796",
  "title": "Kindle Monthly Deal",
  "date_display": "December 3, 2015",
  "date_iso": "2015-12-03T12:30:00+00:00",
  "date_from_url": "2015-12-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’d meant to mention this on Monday, but I was a little distracted by putting the final editing touches on <i>Cuckservative: How “Conservatives” Betrayed America</i>, then by the San Bernardino Climate Change Event that had absolutely nothing to do with Islam, which, by the way, means “peace”. I think we can all agree that the recent Climate Change Events in Paris and San Bernardino only demonstrate the vital importance of the global climate accords in Paris.</p><p>But before the focus shifts to <i>Cuckservative </i>– and I’m confident it will, one early reviewer says “You hit this one out of the park” – I would be remiss if I failed to mention that Amazon selected SJWAL “for a Kindle Monthly Deal on both Amazon.co.uk and Amazon.com.au, running 1-31 December.” So, if you’re in <a href=\"http://www.amazon.co.uk/gp/product/B014GMBUR4\">the UK</a> or <a href=\"http://www.amazon.com.au/gp/product/B014GMBUR4\">Australia</a>, the price of the Kindle version has been significantly discounted.</p><p>However, despite SJWAL being pushed by Amazon, there <i>may </i>be some hinky business taking place with regards to whoever is overseeing the reviews:</p><blockquote class=\"tr_bq\"><p> A while back I wrote a five-star review of your book on Amazon. They<br> still haven’t ‘approved’ it. As a test, I wrote new one tonight for [another Amazon product] I had bought. It was approved within minutes.</br></p><p>Regardless, you penned a wonderful book and I enjoyed it immensely. It<br> really opened my eyes and changed my attitude…which had largely been<br> defeatist toward the SJWs.</br></br></p></blockquote><p>Two other detailed reviews have been posted recently, one <a href=\"http://jdbentley.com/journal/sjws-always-lie-review\">by J.D. Bentley</a>:</p><blockquote class=\"tr_bq\"><p> I knew nothing about Vox Day a couple weeks ago when his book, <i>SJWs Always Lie: Taking Down the Thought Police</i>, was recommended to me by Amazon. The title of the book caught my attention, but the cover even more so: an innocent, amiable smiley face bearing a forked tongue, incredibly suitable symbolism for SJWs who bully with their venomous pseudo-compassion, and insatiable thirst for the glow of self-righteousness and moral superiority. </p></blockquote><p>It’s always good to know which covers are effective and which are not. And there is also a review <a href=\"http://www.deathmetal.org/books/vox-day-sjws-always-lie-taking-down-the-thought-police-2015/\">by Death Metal Underground</a>; apparently the metal scene is also undergoing an entryist attack by SJWs:</p><blockquote class=\"tr_bq\"><p> The information in this book will be useful to metal band members and concert organizers who are the targets of SJW attacks. Vox demonstrates, using numerous examples of attacks, that the worst thing these targets can do is apologise, as doing so simply hands the attackers “a confession to bolster their indictment.” In fact, if one learns only a single thing from this book, it should be that SJWs can’t be reasoned with at all: do not engage them in good faith, do not expect them to be honest in any way, and just plain do not take them seriously. This should come naturally to members of an artistic movement fascinated with aggression and violence. And yet, #metalgate has shown us that heavy metal is in the SJWs’ crosshairs.</p></blockquote><p>Both reviews demonstrate the importance of continuing to review, tweet, and talk about books like SJWAL and <i>Cuckservative</i>, because a) one never knows how the word is going to leap from one insular community to the next, and b) they have practical applications in those other communities that are beyond anyone’s ability to readily foresee. For example, it doesn’t surprise me that OSS leaders like Robert Rosario and esr would find SJWAL to be useful because I know the OSS communities are under attack. But heavy metal? North Heights Lutheran Church?</p><p>It’s one thing to say any community is potentially vulnerable to SJW entryism, and another to actually see the vast extent of it. In any event, the recent reappearance of more one-star fake reviews is a good sign that it is beginning to penetrate new circles.</p><p>Speaking of the upcoming new release, if you want in on the bonus books (one of which, I will warn you, is a spectacularly and hilariously vulgar anarcho-libertarian spin on the music industry), be sure to sign up for the mailing list on the left sidebar.</p></div>",
  "content_text": "I’d meant to mention this on Monday, but I was a little distracted by putting the final editing touches on\nCuckservative: How “Conservatives” Betrayed America\n, then by the San Bernardino Climate Change Event that had absolutely nothing to do with Islam, which, by the way, means “peace”. I think we can all agree that the recent Climate Change Events in Paris and San Bernardino only demonstrate the vital importance of the global climate accords in Paris.\nBut before the focus shifts to\nCuckservative\n– and I’m confident it will, one early reviewer says “You hit this one out of the park” – I would be remiss if I failed to mention that Amazon selected SJWAL “for a Kindle Monthly Deal on both Amazon.co.uk and Amazon.com.au, running 1-31 December.” So, if you’re in\nthe UK\nor\nAustralia\n, the price of the Kindle version has been significantly discounted.\nHowever, despite SJWAL being pushed by Amazon, there\nmay\nbe some hinky business taking place with regards to whoever is overseeing the reviews:\nA while back I wrote a five-star review of your book on Amazon. They\nstill haven’t ‘approved’ it. As a test, I wrote new one tonight for [another Amazon product] I had bought. It was approved within minutes.\nRegardless, you penned a wonderful book and I enjoyed it immensely. It\nreally opened my eyes and changed my attitude…which had largely been\ndefeatist toward the SJWs.\nTwo other detailed reviews have been posted recently, one\nby J.D. Bentley\n:\nI knew nothing about Vox Day a couple weeks ago when his book,\nSJWs Always Lie: Taking Down the Thought Police\n, was recommended to me by Amazon. The title of the book caught my attention, but the cover even more so: an innocent, amiable smiley face bearing a forked tongue, incredibly suitable symbolism for SJWs who bully with their venomous pseudo-compassion, and insatiable thirst for the glow of self-righteousness and moral superiority.\nIt’s always good to know which covers are effective and which are not. And there is also a review\nby Death Metal Underground\n; apparently the metal scene is also undergoing an entryist attack by SJWs:\nThe information in this book will be useful to metal band members and concert organizers who are the targets of SJW attacks. Vox demonstrates, using numerous examples of attacks, that the worst thing these targets can do is apologise, as doing so simply hands the attackers “a confession to bolster their indictment.” In fact, if one learns only a single thing from this book, it should be that SJWs can’t be reasoned with at all: do not engage them in good faith, do not expect them to be honest in any way, and just plain do not take them seriously. This should come naturally to members of an artistic movement fascinated with aggression and violence. And yet, #metalgate has shown us that heavy metal is in the SJWs’ crosshairs.\nBoth reviews demonstrate the importance of continuing to review, tweet, and talk about books like SJWAL and\nCuckservative\n, because a) one never knows how the word is going to leap from one insular community to the next, and b) they have practical applications in those other communities that are beyond anyone’s ability to readily foresee. For example, it doesn’t surprise me that OSS leaders like Robert Rosario and esr would find SJWAL to be useful because I know the OSS communities are under attack. But heavy metal? North Heights Lutheran Church?\nIt’s one thing to say any community is potentially vulnerable to SJW entryism, and another to actually see the vast extent of it. In any event, the recent reappearance of more one-star fake reviews is a good sign that it is beginning to penetrate new circles.\nSpeaking of the upcoming new release, if you want in on the bonus books (one of which, I will warn you, is a spectacularly and hilariously vulgar anarcho-libertarian spin on the music industry), be sure to sign up for the mailing list on the left sidebar.",
  "tags": [
    "Book Review"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-03T12:30:00+00:00"
}