{
  "url": "https://voxday.net/2015/12/28/mailvox-where-are-connections/",
  "scraped_at": "2025-12-17T17:39:27.034991",
  "title": "Clarke and the criminal connections",
  "date_display": "December 28, 2015",
  "date_iso": "2015-12-28T21:52:00+00:00",
  "date_from_url": "2015-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Leo is rather dubious about the evidence concerning certain of Arthur C. Clarke’s supposed idiosyncracies:</p><blockquote class=\"tr_bq\"><p> Still, a lack of accusations gives us nothing but rumors to work with. Did he associate with anyone later credibly so accused? That would be evidence for me.</p></blockquote><p>Fair enough. It’s not like I know anything about it, although the false claims of his being cleared by the Sri Lankan authorities do tend to make me a little suspicious. Let’s see what is out there. Here is what there is from the 1998 <i>Mirror </i>piece based on the reporter who was sent from the UK to Sri Lanka to interview Clarke.</p><blockquote class=\"tr_bq\"><p> Sitting in a room he calls his Ego Chamber, Arthur C. Clarke  finally admitted his lifelong secret – not only is he gay but he prefers sex with beach boys. Clarke gives the name Ego Chamber to the study in his Colombo home because the walls are lined with his books and framed photos of himself with celebrities from the Pope to Princess Diana. The room has state-of-the-art computers, satellite TV, video recorders and other hi-tech gadgets which Clarke boasts he uses to communicate with pals at the Pentagon.</p><p>When we asked Clarke about suggestions that he may have been one of the original pioneers of sex tourism in Sri Lanka he gave a wry smile and said: “I am more amused than disgusted that anyone should think that. I am all in favour of efforts to stop it. But how do we stop it without interfering with the rights of responsible adults.”</p><p>Then he repeated a phrase often used by paedophiles: “I think most of the damage comes from the fuss made by hysterical parents afterwards. If the kids don’t mind, fair enough.”</p><p>In recent years Clarke’s name has been linked with two notorious paedophiles, one of whom – a Swiss millionaire – was kicked out of Sri Lanka on the orders of the president for abusing impoverished beach boys. He is now awaiting trial in Zurich accused of sexually abusing up to 1,500 young boys and like Clarke was friends with a lot of Sri Lanka’s top politicians, senior policemen and influential government figures.</p><p>Clarke is said to have attended parties at the tycoon’s home. When asked if he had, Clarke replied:</p><p>“I may well have done. I mean the very first man I met here in 1954 was a paedophile and made no bones about it. He was in intelligence in the army, a fantastic guy.”</p><p>Clarke said of his sexual preferences:</p><p>“Here it would embarrass everyone right up to the president. I mean, I am chancellor of the university, a public figure, that is the problem so I would be swallowed alive. I would probably be outed, you see.”</p><p>These days the frail, white-haired old man gets around with the aid of a wheelchair and crutches following a polio attack 15 years ago.</p><p>But Clarke’s fading health does not stop him enjoying his favourite pastime – playing table tennis with schoolboys at a notorious pick-up haunt for perverts called the Otters Aquatic Club. Crumbling and in need of a coat of paint, the Otters is a meeting point for Westerners who lust after young boys. Those who hang around its games room, pool and tennis courts are perfect prey and are easily persuaded to sell themselves for 1,000 rupees (pounds 10) – a small fortune to them.</p><p>Clarke goes there regularly in the afternoon, hobbling on a walking stick, to challenge boys – some as young as 12 – to a game of ping pong.</p><p>Asked what his definition for paedophilia was Clarke said:</p><p>“There are two different definitions, anyone who interferes with young boys who are not old enough to know their own minds and that’s my definition. It varies for me.”</p><p>Asked how he knew whether the boys really did know their own minds as he had not known them for long, he said:</p><p>“Because pure and simply they looked reasonably mature. Mature enough for me.”</p><p>Told one of them was just 13, he said: “If he really was 13 he will be a very mature 13.”</p><p>Asked if he thought that was morally wrong he replied: “No.”</p><p>Told that some of the boys had told us they would not have had sex if he had not given them money he said: “I’m sure. But I didn’t make anyone do anything they didn’t enjoy doing.”</p></blockquote><p>Of course, one has to ask why a reporter would fly from the UK to Sri Lanka to interview an old man about his predilections unless he already knew what he would find. There is also more highly specific information from what appears to be a British conspiracy site: <br> <a name=\"more\"></a></br></p><blockquote class=\"tr_bq\"><p> US detectives, who arrested leaders of NAMBLA 10 years ago, say Clarke was named by other paedophiles they quizzed during an FBI investigation. The perverts had set up children’s homes in Thailand as fronts for their sick activities.</p><p>One of its leaders was Jonathan Tampico, 48, a top nuclear scientist who worked for the American Government. He served two-and-a- half years in jail for molesting a boy of 12 and is now on the run with a million-dollar warrant on his head for further porn offences. He told detectives he had stayed at Clarke’s home in Colombo and had swapped letters with the author.</p><p>Another known paedophile, former church minister John Wakefield Cummings, 56, is serving a 24-years-to-life sentence after admitting molesting 17 boys in his care.</p><p>He told police in Sacramento, California, that Clarke had been contacted at his Sri Lankan home by a paedophile who was on the run from the American authorities.</p><p>In a sworn statement made to an investigator for Sacremento’s district attorney, Wakefield Cummings told how the pervert fled to Sri Lanka where he was able to contact the paedophile community through Clarke. He then fled from Sri Lanka to Indonesia.</p><p>Detectives contacted a child welfare group to warn them about Clarke’s activities.</p><p>A senior Sacramento detective said: “We never had any reason to take action against Arthur C. Clarke because he was outside our jurisdiction.</p><p>“But Clarke’s name did keep coming up. We were looking into members of The Boy Lovers Association who all seemed to know or be aware of him. He ended up connecting to a lot of people we were investigating. Tampico was one of those who said he went to Sri Lanka. I have seen letters between him and Arthur C. Clarke. There was nothing overtly sexual in them but they were clearly corresponding.”</p><p>He added: “Cummings told us in the course of interviews that Arthur C. Clarke is a paedophile. He said Sri Lanka used to be a popular destination for the paedophiles. But then the government changed and they were all thrown out. He said Clarke was one of the few they didn’t expel because of his status.”</p><p>Ron O’Grady, of ECPAT confirmed he had been warned about Clarke by police in Sacramento.</p></blockquote><p>Now, I know nothing about any of this so I can’t vouch for any of it, but it’s easy enough to confirm that at least the names are real. Here are public court documents relating to the arrest of the aforementioned <a href=\"http://documents.latimes.com/jonathan-tampico/\">Jonathan Tampico</a>. Notice that he and his three fellow defendants are members of NAMBLA, the organization that published the newsletter to which Samuel Delaney admits subscribing. And <a href=\"http://www.homefacts.com/offender-detail/CA17101114F0001/John-Wakefield-Cummings.html\">John Wakefield Cummings</a> is on the registered sex offender list in Clovis, California. <a href=\"https://www.oikoumene.org/en/press-centre/news/wcc-expresses-condolences-on-the-death-of-ron-o2019grady\">Ron O’Grady</a>, who died last year, was a New Zealand minister who founded EPCAT.</p><p>Perhaps Mr. Cummings was lying about Mr. Clarke. Perhaps Mr. Tampico was lying about Mr. Clarke. Perhaps Rev. O’Grady was lying about Mr. Clarke. Perhaps all these people from around the world were lying about Mr. Clarke in their discussions with the Sacramento police. But why? Why would his name even come up in the first place?</p><p>The Otter Aquatic Club also exists and you can even visit <a href=\"http://www.otter.lk/?page_id=19\">its website</a>. <i>Otter Aquatic Club is one of leading sport promoting club has been in<br> existence for the past 78 years and it is one of the largest and most<br> patronized clubs in Sri Lanka. </br></br></i><i><br/></i><br> And then consider how many obvious signs there were about Clarke compared to how much evidence there was about Marion Zimmer Bradley prior to the revelations of last year. A lot of these people are still alive; some of the detectives involved may even still be on the Sacramento police force.</br></p><p>I have absolutely nothing against Arthur C. Clarke. I enjoyed several of his novels. I was delighted to republish the excellent story he wrote for There Will Be War Volume II, “Superiority”. But the truth is what it is. History is what it is. This world is fallen and Clarke would hardly be the first brilliant man of talent to hide a terrible secret.</p><p>The question is, will the science fiction world investigate the matter and face the truth, whatever it might be, or will it continue to avert its eyes and permit the monsters in its midst to operate with impunity? Remember, this is a community that awarded Samuel Delaney its highest honor just last year.</p></div>",
  "content_text": "Leo is rather dubious about the evidence concerning certain of Arthur C. Clarke’s supposed idiosyncracies:\nStill, a lack of accusations gives us nothing but rumors to work with. Did he associate with anyone later credibly so accused? That would be evidence for me.\nFair enough. It’s not like I know anything about it, although the false claims of his being cleared by the Sri Lankan authorities do tend to make me a little suspicious. Let’s see what is out there. Here is what there is from the 1998\nMirror\npiece based on the reporter who was sent from the UK to Sri Lanka to interview Clarke.\nSitting in a room he calls his Ego Chamber, Arthur C. Clarke  finally admitted his lifelong secret – not only is he gay but he prefers sex with beach boys. Clarke gives the name Ego Chamber to the study in his Colombo home because the walls are lined with his books and framed photos of himself with celebrities from the Pope to Princess Diana. The room has state-of-the-art computers, satellite TV, video recorders and other hi-tech gadgets which Clarke boasts he uses to communicate with pals at the Pentagon.\nWhen we asked Clarke about suggestions that he may have been one of the original pioneers of sex tourism in Sri Lanka he gave a wry smile and said: “I am more amused than disgusted that anyone should think that. I am all in favour of efforts to stop it. But how do we stop it without interfering with the rights of responsible adults.”\nThen he repeated a phrase often used by paedophiles: “I think most of the damage comes from the fuss made by hysterical parents afterwards. If the kids don’t mind, fair enough.”\nIn recent years Clarke’s name has been linked with two notorious paedophiles, one of whom – a Swiss millionaire – was kicked out of Sri Lanka on the orders of the president for abusing impoverished beach boys. He is now awaiting trial in Zurich accused of sexually abusing up to 1,500 young boys and like Clarke was friends with a lot of Sri Lanka’s top politicians, senior policemen and influential government figures.\nClarke is said to have attended parties at the tycoon’s home. When asked if he had, Clarke replied:\n“I may well have done. I mean the very first man I met here in 1954 was a paedophile and made no bones about it. He was in intelligence in the army, a fantastic guy.”\nClarke said of his sexual preferences:\n“Here it would embarrass everyone right up to the president. I mean, I am chancellor of the university, a public figure, that is the problem so I would be swallowed alive. I would probably be outed, you see.”\nThese days the frail, white-haired old man gets around with the aid of a wheelchair and crutches following a polio attack 15 years ago.\nBut Clarke’s fading health does not stop him enjoying his favourite pastime – playing table tennis with schoolboys at a notorious pick-up haunt for perverts called the Otters Aquatic Club. Crumbling and in need of a coat of paint, the Otters is a meeting point for Westerners who lust after young boys. Those who hang around its games room, pool and tennis courts are perfect prey and are easily persuaded to sell themselves for 1,000 rupees (pounds 10) – a small fortune to them.\nClarke goes there regularly in the afternoon, hobbling on a walking stick, to challenge boys – some as young as 12 – to a game of ping pong.\nAsked what his definition for paedophilia was Clarke said:\n“There are two different definitions, anyone who interferes with young boys who are not old enough to know their own minds and that’s my definition. It varies for me.”\nAsked how he knew whether the boys really did know their own minds as he had not known them for long, he said:\n“Because pure and simply they looked reasonably mature. Mature enough for me.”\nTold one of them was just 13, he said: “If he really was 13 he will be a very mature 13.”\nAsked if he thought that was morally wrong he replied: “No.”\nTold that some of the boys had told us they would not have had sex if he had not given them money he said: “I’m sure. But I didn’t make anyone do anything they didn’t enjoy doing.”\nOf course, one has to ask why a reporter would fly from the UK to Sri Lanka to interview an old man about his predilections unless he already knew what he would find. There is also more highly specific information from what appears to be a British conspiracy site:\nUS detectives, who arrested leaders of NAMBLA 10 years ago, say Clarke was named by other paedophiles they quizzed during an FBI investigation. The perverts had set up children’s homes in Thailand as fronts for their sick activities.\nOne of its leaders was Jonathan Tampico, 48, a top nuclear scientist who worked for the American Government. He served two-and-a- half years in jail for molesting a boy of 12 and is now on the run with a million-dollar warrant on his head for further porn offences. He told detectives he had stayed at Clarke’s home in Colombo and had swapped letters with the author.\nAnother known paedophile, former church minister John Wakefield Cummings, 56, is serving a 24-years-to-life sentence after admitting molesting 17 boys in his care.\nHe told police in Sacramento, California, that Clarke had been contacted at his Sri Lankan home by a paedophile who was on the run from the American authorities.\nIn a sworn statement made to an investigator for Sacremento’s district attorney, Wakefield Cummings told how the pervert fled to Sri Lanka where he was able to contact the paedophile community through Clarke. He then fled from Sri Lanka to Indonesia.\nDetectives contacted a child welfare group to warn them about Clarke’s activities.\nA senior Sacramento detective said: “We never had any reason to take action against Arthur C. Clarke because he was outside our jurisdiction.\n“But Clarke’s name did keep coming up. We were looking into members of The Boy Lovers Association who all seemed to know or be aware of him. He ended up connecting to a lot of people we were investigating. Tampico was one of those who said he went to Sri Lanka. I have seen letters between him and Arthur C. Clarke. There was nothing overtly sexual in them but they were clearly corresponding.”\nHe added: “Cummings told us in the course of interviews that Arthur C. Clarke is a paedophile. He said Sri Lanka used to be a popular destination for the paedophiles. But then the government changed and they were all thrown out. He said Clarke was one of the few they didn’t expel because of his status.”\nRon O’Grady, of ECPAT confirmed he had been warned about Clarke by police in Sacramento.\nNow, I know nothing about any of this so I can’t vouch for any of it, but it’s easy enough to confirm that at least the names are real. Here are public court documents relating to the arrest of the aforementioned\nJonathan Tampico\n. Notice that he and his three fellow defendants are members of NAMBLA, the organization that published the newsletter to which Samuel Delaney admits subscribing. And\nJohn Wakefield Cummings\nis on the registered sex offender list in Clovis, California.\nRon O’Grady\n, who died last year, was a New Zealand minister who founded EPCAT.\nPerhaps Mr. Cummings was lying about Mr. Clarke. Perhaps Mr. Tampico was lying about Mr. Clarke. Perhaps Rev. O’Grady was lying about Mr. Clarke. Perhaps all these people from around the world were lying about Mr. Clarke in their discussions with the Sacramento police. But why? Why would his name even come up in the first place?\nThe Otter Aquatic Club also exists and you can even visit\nits website\n.\nOtter Aquatic Club is one of leading sport promoting club has been in\nexistence for the past 78 years and it is one of the largest and most\npatronized clubs in Sri Lanka.\nAnd then consider how many obvious signs there were about Clarke compared to how much evidence there was about Marion Zimmer Bradley prior to the revelations of last year. A lot of these people are still alive; some of the detectives involved may even still be on the Sacramento police force.\nI have absolutely nothing against Arthur C. Clarke. I enjoyed several of his novels. I was delighted to republish the excellent story he wrote for There Will Be War Volume II, “Superiority”. But the truth is what it is. History is what it is. This world is fallen and Clarke would hardly be the first brilliant man of talent to hide a terrible secret.\nThe question is, will the science fiction world investigate the matter and face the truth, whatever it might be, or will it continue to avert its eyes and permit the monsters in its midst to operate with impunity? Remember, this is a community that awarded Samuel Delaney its highest honor just last year.",
  "tags": [
    "conspiracy",
    "mailvox",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-28T21:52:00+00:00"
}