{
  "url": "https://voxday.net/2015/12/26/mailvox-interviews-and-granting-thereof/",
  "scraped_at": "2025-12-17T17:39:04.748076",
  "title": "Mailvox: interviews and the granting thereof",
  "date_display": "December 26, 2015",
  "date_iso": "2015-12-26T07:00:00+00:00",
  "date_from_url": "2015-12-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>HS objects to my permitting Greg Johnson to ask me questions about my latest book, <i>Cuckservative: How “Conservatives” Betrayed America</i>.</p><blockquote class=\"tr_bq\"><p> I am a born again Christian. I believe you profess the same. Therefore, why would you grant interviews with someone so warped as Johnson on every level. He not only is a sodomite but an atheist, paganism-pusher, and sodomite-hostile to Christianity and Christians. Perhaps you are not a regenerate man nor do you possess much in the way of principles. This would then, of course, explain the matter. Johnson even says you “honored” him in your recent book. This is a disgrace, disgusting. Perhaps you will deign to reply to me and explain. But probably not. I think you have something of a duty as a professing Christian to explain yourself. Since I as a fellow believer have asked and being as that the question is biblically legitimate I think you are so obligated.</p></blockquote><p>First, HS should get off his ridiculous high horse. It is neither polite nor Christian to demand an answer and offer a justification for doing so before one has even given the person one is asking the chance to respond.</p><p>Second, HS is wrong. I am happy to answer his question.</p><p>Third, since I first became a public figure in 2001, I have made a regular practice of answering anyone who wishes to ask me questions. Including HS, even though he is an impolite boor, and Mr. Johnson, even though he does not share my views on a wide variety of subjects.</p><p>Would HIS similarly criticize Jesus Christ for not only speaking with, but actually <i>dining with</i>, prostitutes and tax collectors?</p><p>HS responded in what can only be described as <i>textbook </i>Gamma style:</p><blockquote class=\"tr_bq\"><p> First, let me say I appreciate your prompt reply. Though I was surprised at its jejune and unsophisticated nature. My email was direct, even demanding and legitimately so. That is, if my charges were accurate. You deny nothing of what I have charged save an unimportant suggestion that you may not care to respond, which I initially addressed. Thus you tacitly acknowledge said accuracy. You are indeed accountable for unbiblical public behavior. And it is reasonable for me or any Christian to expect such from you or any other public figure also professing a Christian faith –  in some venue or other.  Your appearance of being in league with a patent enemy of the Gospel is scandalous. For you to argue this is plain contumacy. Further, your cliché reflex in bringing up the Lord in his ministry shows only hack disingenuousness. It is precarious ground to draw conclusions from Jesus’ ministry for general behavior on our part in any instance but you are clearly badly mistaken in this particular offering. Our Lord NEVER socialized with people who were decidedly hostile to Himself and hateful to his disciples. And this is precisely what you do vis a vis Johnson. In mere personal terms, as a Christian, how can you not be repelled by this individual on a number of levels? Forgive the digression. I notice that you didn’t trouble yourself to even identify as a Christian in your email. But then you may feel my impolite tone preempts this. Which brings me to a conclusion. That you are concerned with impoliteness and boorishness (complete nonsense – remember? You run a rough-and-tumble blog – “boor?” – lol) rather than the obviously important substance of my email further discredits you. Why do I not expect a reply that will be other than pure defensive/self-centeredness?</p></blockquote><p>I have to admit, I really, really struggle to not hate Gammas. Literally everything they do is almost breathtakingly annoying; no wonder they get bullied and abused so often when they are young. I expect this is the kind of guy who tweets his breakfasts and genuinely believes his bowel movements are “obviously important” to everyone. Now, here is <a href=\"http://www.counter-currents.com/2015/12/greg-johnson-interviews-vox-day-transcript/\">the interview with the pagan</a> to which HS importantly objected so vociferously.</p><blockquote class=\"tr_bq\"><p> GJ: Seriously, the thing that gets me about what you call Churchianity, which is a good term, the Churchians today is they seem to want to deny that it’s moral and right to have any preference for your own children over strangers, for your own country over neighbors, for your own race over other races, and yet you zero in on that in the New Testament indicating that no, those sorts of preferences were regarded as natural.</p><p>Looking at Aquinas, for instance. Aquinas in his Questions on Charity basically he says, “Yes, God’s love flows through all of creation, but creation consists of hierarchies and concentric circles of relationships, and so you have a natural preference for your own over strangers, and that structure of preferences doesn’t impede the grace of God, and it’s not something that needs to be fought against or disdained.” And yet what you’ve got with Christians today is this pure xenophilia, this perverse attitude that your neighbor is not your neighbor. No, the neighbor is someone who is far more foreign than your neighbor, and in fact your preference for these foreigners often turns your neighbor’s life in to a living hell.</p><p>VD: Right, but again, these are people who call themselves Christians, but when they’re preaching immigration from the Gospel, they’re doing exactly what the Apostle Paul warned about, which is the whole wolf in sheep’s clothing. These are not Christians.</p><p>I’m not playing no true Scotsman here. I’m saying these are not people for the most part… And I’m talking about the leaders, I’m not talking about the average church members.</p><p>GJ: Right.</p><p>VD: These are people who worship at the Temple of Babel.</p><p>GJ: Right.</p><p>VD: I would not be surprised at all if many of them actually served some other god. I actually got the concept of SJW entryism from being told about a church that had been basically invaded by people who had managed to take it over and the crazy thing is, I mention this in the book, the same thing happened 20 years later at one of the churches that my parents attended. I actually know one of the pastors involved and my uncle was on the board of the church. They ended up getting invaded by these SJWs, who promptly announced that they had a vision for combining Christianity with Islam and wanted to call it Chrislam.</p><p>Now, you cannot possibly hold Christianity responsible for that, because that is anti-Christianity of a sort that Richard Dawkins never dreamed of.</p><p>GJ: Oh God, yes! The core issue is really the idea of charity and loving your neighbor and being kind to strangers and so forth, and that notion carries a great deal of moral weight even in the minds of non-Christians. It’s been perverted into an attitude where you measure your virtue by the degree to which you betray the people close to you and side with people far away. It overturns families, it overturns communities, and it overturns societies. It’s just a kind of moralistic absurdity that is an agent of chaos and destruction.</p><p>VD: And you’ve seen <i>The Lord of the Rings</i>. What do we usually call a good that is perverted into something else other than its purpose?</p><p>GJ: Well, you tell me.</p><p>VD: We usually call that evil.</p><p>GJ: Evil. Yeah.</p><p>VD: I think this Churchianity is absolutely evil. I think it is absolutely of the devil. I don’t think you even need to be Christian to pick up the scent of brimstone from it. I realize for your secular viewers that may sound nuts, and that’s fine, but my point is that the good news for the secular and the pagan Right is that true Christianity, the Christianity that exploded across the world, and the Christianity that caused the lands of Europe to become Christendom, is ultimately on your side in that regard.</p><p>There’s no question about that. Even someone like Anders Breivik recognized it. Breivik is not a Christian. He does not worship Jesus Christ, but he described himself as a cultural Christian because he understood that connection.</p><p>GJ: Right.</p><p>VD: In Europe, that’s going to be the big factor of change. It’s not an accident that Putin often speaks in religious terms. It’s not an accident that the forces that are rising in Poland and Hungary . . . Even Hungary, like you said, is fairly secular, but when you listen to the nationalists speak they often speak about the <i>Christian </i>heroes, the <i>Christian </i>kings.</p><p>GJ: Oh yeah.</p><p>VD: But the most important thing to keep in mind, and I think it’s something that can inspire seculars and pagans as well, and it’s something that I always enjoy telling atheists, because they say there are fewer Christians now in America than there were before and I always say, “Hey, we only need 11.”</p></blockquote><p>How terrible, that a Christian should speak of Aquinas, and Christian theology, and of the words of Jesus Christ himself, with an unbeliever!</p></div>",
  "content_text": "HS objects to my permitting Greg Johnson to ask me questions about my latest book,\nCuckservative: How “Conservatives” Betrayed America\n.\nI am a born again Christian. I believe you profess the same. Therefore, why would you grant interviews with someone so warped as Johnson on every level. He not only is a sodomite but an atheist, paganism-pusher, and sodomite-hostile to Christianity and Christians. Perhaps you are not a regenerate man nor do you possess much in the way of principles. This would then, of course, explain the matter. Johnson even says you “honored” him in your recent book. This is a disgrace, disgusting. Perhaps you will deign to reply to me and explain. But probably not. I think you have something of a duty as a professing Christian to explain yourself. Since I as a fellow believer have asked and being as that the question is biblically legitimate I think you are so obligated.\nFirst, HS should get off his ridiculous high horse. It is neither polite nor Christian to demand an answer and offer a justification for doing so before one has even given the person one is asking the chance to respond.\nSecond, HS is wrong. I am happy to answer his question.\nThird, since I first became a public figure in 2001, I have made a regular practice of answering anyone who wishes to ask me questions. Including HS, even though he is an impolite boor, and Mr. Johnson, even though he does not share my views on a wide variety of subjects.\nWould HIS similarly criticize Jesus Christ for not only speaking with, but actually\ndining with\n, prostitutes and tax collectors?\nHS responded in what can only be described as\ntextbook\nGamma style:\nFirst, let me say I appreciate your prompt reply. Though I was surprised at its jejune and unsophisticated nature. My email was direct, even demanding and legitimately so. That is, if my charges were accurate. You deny nothing of what I have charged save an unimportant suggestion that you may not care to respond, which I initially addressed. Thus you tacitly acknowledge said accuracy. You are indeed accountable for unbiblical public behavior. And it is reasonable for me or any Christian to expect such from you or any other public figure also professing a Christian faith –  in some venue or other.  Your appearance of being in league with a patent enemy of the Gospel is scandalous. For you to argue this is plain contumacy. Further, your cliché reflex in bringing up the Lord in his ministry shows only hack disingenuousness. It is precarious ground to draw conclusions from Jesus’ ministry for general behavior on our part in any instance but you are clearly badly mistaken in this particular offering. Our Lord NEVER socialized with people who were decidedly hostile to Himself and hateful to his disciples. And this is precisely what you do vis a vis Johnson. In mere personal terms, as a Christian, how can you not be repelled by this individual on a number of levels? Forgive the digression. I notice that you didn’t trouble yourself to even identify as a Christian in your email. But then you may feel my impolite tone preempts this. Which brings me to a conclusion. That you are concerned with impoliteness and boorishness (complete nonsense – remember? You run a rough-and-tumble blog – “boor?” – lol) rather than the obviously important substance of my email further discredits you. Why do I not expect a reply that will be other than pure defensive/self-centeredness?\nI have to admit, I really, really struggle to not hate Gammas. Literally everything they do is almost breathtakingly annoying; no wonder they get bullied and abused so often when they are young. I expect this is the kind of guy who tweets his breakfasts and genuinely believes his bowel movements are “obviously important” to everyone. Now, here is\nthe interview with the pagan\nto which HS importantly objected so vociferously.\nGJ: Seriously, the thing that gets me about what you call Churchianity, which is a good term, the Churchians today is they seem to want to deny that it’s moral and right to have any preference for your own children over strangers, for your own country over neighbors, for your own race over other races, and yet you zero in on that in the New Testament indicating that no, those sorts of preferences were regarded as natural.\nLooking at Aquinas, for instance. Aquinas in his Questions on Charity basically he says, “Yes, God’s love flows through all of creation, but creation consists of hierarchies and concentric circles of relationships, and so you have a natural preference for your own over strangers, and that structure of preferences doesn’t impede the grace of God, and it’s not something that needs to be fought against or disdained.” And yet what you’ve got with Christians today is this pure xenophilia, this perverse attitude that your neighbor is not your neighbor. No, the neighbor is someone who is far more foreign than your neighbor, and in fact your preference for these foreigners often turns your neighbor’s life in to a living hell.\nVD: Right, but again, these are people who call themselves Christians, but when they’re preaching immigration from the Gospel, they’re doing exactly what the Apostle Paul warned about, which is the whole wolf in sheep’s clothing. These are not Christians.\nI’m not playing no true Scotsman here. I’m saying these are not people for the most part… And I’m talking about the leaders, I’m not talking about the average church members.\nGJ: Right.\nVD: These are people who worship at the Temple of Babel.\nGJ: Right.\nVD: I would not be surprised at all if many of them actually served some other god. I actually got the concept of SJW entryism from being told about a church that had been basically invaded by people who had managed to take it over and the crazy thing is, I mention this in the book, the same thing happened 20 years later at one of the churches that my parents attended. I actually know one of the pastors involved and my uncle was on the board of the church. They ended up getting invaded by these SJWs, who promptly announced that they had a vision for combining Christianity with Islam and wanted to call it Chrislam.\nNow, you cannot possibly hold Christianity responsible for that, because that is anti-Christianity of a sort that Richard Dawkins never dreamed of.\nGJ: Oh God, yes! The core issue is really the idea of charity and loving your neighbor and being kind to strangers and so forth, and that notion carries a great deal of moral weight even in the minds of non-Christians. It’s been perverted into an attitude where you measure your virtue by the degree to which you betray the people close to you and side with people far away. It overturns families, it overturns communities, and it overturns societies. It’s just a kind of moralistic absurdity that is an agent of chaos and destruction.\nVD: And you’ve seen\nThe Lord of the Rings\n. What do we usually call a good that is perverted into something else other than its purpose?\nGJ: Well, you tell me.\nVD: We usually call that evil.\nGJ: Evil. Yeah.\nVD: I think this Churchianity is absolutely evil. I think it is absolutely of the devil. I don’t think you even need to be Christian to pick up the scent of brimstone from it. I realize for your secular viewers that may sound nuts, and that’s fine, but my point is that the good news for the secular and the pagan Right is that true Christianity, the Christianity that exploded across the world, and the Christianity that caused the lands of Europe to become Christendom, is ultimately on your side in that regard.\nThere’s no question about that. Even someone like Anders Breivik recognized it. Breivik is not a Christian. He does not worship Jesus Christ, but he described himself as a cultural Christian because he understood that connection.\nGJ: Right.\nVD: In Europe, that’s going to be the big factor of change. It’s not an accident that Putin often speaks in religious terms. It’s not an accident that the forces that are rising in Poland and Hungary . . . Even Hungary, like you said, is fairly secular, but when you listen to the nationalists speak they often speak about the\nChristian\nheroes, the\nChristian\nkings.\nGJ: Oh yeah.\nVD: But the most important thing to keep in mind, and I think it’s something that can inspire seculars and pagans as well, and it’s something that I always enjoy telling atheists, because they say there are fewer Christians now in America than there were before and I always say, “Hey, we only need 11.”\nHow terrible, that a Christian should speak of Aquinas, and Christian theology, and of the words of Jesus Christ himself, with an unbeliever!",
  "tags": [
    "Christianity",
    "cuckservative",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-26T07:00:00+00:00"
}