{
  "url": "https://voxday.net/2015/12/28/mailvox-safe-space-as-rape-roo/",
  "scraped_at": "2025-12-17T17:39:22.028997",
  "title": "Mailvox: Safe Space as Rape Room",
  "date_display": "December 28, 2015",
  "date_iso": "2015-12-28T13:26:00+00:00",
  "date_from_url": "2015-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Reactions to the fourth installment of Daniel Enness’s <i>Safe Space as Rape Room: Science Fiction Culture and Childhood’s End</i> at Castalia House.</p><p><i>I just wanted to thank you guys for talking about this. I myself am a<br> survivor and have no Earthly idea why this stuff isn’t talked about by<br> the other “side” in this. It makes me a bit sick to talk about it or<br> read about it, but given the kind of fiction I enjoy reading it always<br> sort of worms its way back into my attention. I also get a sort of<br> garbage feeling if I say nothing or at least don’t voice my support for<br> people speaking out.</br></br></br></br></br></br></i><br> <i><br> </br></i><i>Granted, I disagree with a lot of what you guys have to say a lot of<br> the time, but bless you for saying this and I happily defend and support<br> your right to say the rest. I’m very sad of late to see that ideas are<br> now held as either dangerous or above reproach. As if we are all not<br> made poorer by the silence of a refusal to debate. I hold your<br> willingness to talk about this as proof absolute of the necessity of<br> maintaining diversity of ideas so that there are always people around to<br> call out other people for doing horrible things. The other “side”<br> deserves to be called out on this and I thank you for continuing to do<br> so.</br></br></br></br></br></br></br></br></br></i><br> – Andrew</br></br></p><p><i>This article in general – and Dozois’ comments in specific –  helps me<br> understand why I no longer purchase modern SF:  perverts and enablers<br> have gained publishing power, and have turned the genre into their<br> personal playground.  When I tried to get back into SF in the mid-2000s,<br> I started off with Dozois’ yearly collection … and was promptly annoyed<br> at how the pacing of stories would be ruined by the seemingly<br> obligatory insertion of  “non prudish” (to paraphrase Dozois) elements<br> that were irrelevant to plot or character development.  These<br> distractions make the collection as a whole read as amateurish with a<br> light creepy undertone.  I shifted over to Hartwell’s yearly collection<br> and found the selection a bit less annoying, but the overall quality of<br> both of those collections remained poor.  Hartwell’s collection is<br> apparently no more, and I couldn’t care less if Dozois goes away.</br></br></br></br></br></br></br></br></br></br></br></br></i></p><p>If<br> there is going to be a renaissance of quality SF, it will have to come<br> from publishers with a mindset that the sort of writing represented by<br> Delany’s doesn’t have any sort of merit other than that of studying a<br> deranged mind.  It is beyond me how anybody can read his work and not<br> get creeped out and repulsed; to praise such an author’s works makes me<br> seriously question the mental health of the persons quoted above.   The<br> overall trend of SF sales now makes sense:  most readers don’t want our<br> SF with a serving of creepy pervert.<br> – Hohokam</br></br></br></br></br></br></br></br></br></p><p>WARNING: The linked post deals seriously with child sexual abuse  in<br> science fiction and extensively quotes from the work of a science<br> fiction author who endorses, and is believed to have engaged in,<br> criminally abusive sexual behavior. Not for the faint of heart; contains<br> vulgarities, obscenities, and descriptions of extraordinarily deviant and<br> disgusting behavior. It is a grim, but factual description of the<br> depravity that is not only tolerated, but <i>actively celebrated</i> in the science fiction world.</br></br></br></br></br></br></p><p>Readers under the age of 18 should not, under any circumstances, read <a href=\"http://www.castaliahouse.com/safe-space-as-rape-room-science-fiction-culture-and-childhoods-end-part-4-of-5\">the linked post</a> as it juxtaposes various comments about the SFWA Grand master and suspected homosexual child molester Samuel Delany with quotes from Delany’s own work, which is considerably more depraved than the average individual is likely able to imagine. This warning is not a joke. You won’t enjoy it. You won’t find it titillating. It will simply sicken you and hurt your soul. This is something you need to leave to the adults.</p><p>And yet, the adults must deal with it. The rock must be overturned. The evil must be exposed and the rot must be excised. The science fiction world has continued to avert its eyes from Delany’s behavior for decades, just as it previously averted its eyes from the behavior of known child molesters in their midst, such as SFWA members Marion Zimmer Bradley and Ed Kramer, until well after they were safely dead or imprisoned.</p><p>As for the SJWs and fandom, while you may not like the source, the fact of the matter is that because we are the outsiders, we are the only ones with the courage to confront the evil that lurks among you. Even if you hate us, even if you hate what we stand for, you should hate what the monsters in your midst are doing to your children and to your community even more. If you can’t find common ground with us in actively opposing the molestation of children, how on Earth can you expect us to be interested in finding any common ground with you at all?</p><p>George Martin loftily announced the following in reference to the Sad Puppies: <i>“When people behave badly (in fandom or out of it), or do things that I<br> find immoral or unethical, I reserve the right to speak out about it, as<br> I did about Sad Puppies 3 last year.”</br></br></i></p><p>So, what are we to make of the obvious fact that he has been in fandom for literal decades, but has never found any of the behavior of the various child molesters of his acquaintance to be worth speaking out about?</p></div>",
  "content_text": "Reactions to the fourth installment of Daniel Enness’s\nSafe Space as Rape Room: Science Fiction Culture and Childhood’s End\nat Castalia House.\nI just wanted to thank you guys for talking about this. I myself am a\nsurvivor and have no Earthly idea why this stuff isn’t talked about by\nthe other “side” in this. It makes me a bit sick to talk about it or\nread about it, but given the kind of fiction I enjoy reading it always\nsort of worms its way back into my attention. I also get a sort of\ngarbage feeling if I say nothing or at least don’t voice my support for\npeople speaking out.\nGranted, I disagree with a lot of what you guys have to say a lot of\nthe time, but bless you for saying this and I happily defend and support\nyour right to say the rest. I’m very sad of late to see that ideas are\nnow held as either dangerous or above reproach. As if we are all not\nmade poorer by the silence of a refusal to debate. I hold your\nwillingness to talk about this as proof absolute of the necessity of\nmaintaining diversity of ideas so that there are always people around to\ncall out other people for doing horrible things. The other “side”\ndeserves to be called out on this and I thank you for continuing to do\nso.\n– Andrew\nThis article in general – and Dozois’ comments in specific –  helps me\nunderstand why I no longer purchase modern SF:  perverts and enablers\nhave gained publishing power, and have turned the genre into their\npersonal playground.  When I tried to get back into SF in the mid-2000s,\nI started off with Dozois’ yearly collection … and was promptly annoyed\nat how the pacing of stories would be ruined by the seemingly\nobligatory insertion of  “non prudish” (to paraphrase Dozois) elements\nthat were irrelevant to plot or character development.  These\ndistractions make the collection as a whole read as amateurish with a\nlight creepy undertone.  I shifted over to Hartwell’s yearly collection\nand found the selection a bit less annoying, but the overall quality of\nboth of those collections remained poor.  Hartwell’s collection is\napparently no more, and I couldn’t care less if Dozois goes away.\nIf\nthere is going to be a renaissance of quality SF, it will have to come\nfrom publishers with a mindset that the sort of writing represented by\nDelany’s doesn’t have any sort of merit other than that of studying a\nderanged mind.  It is beyond me how anybody can read his work and not\nget creeped out and repulsed; to praise such an author’s works makes me\nseriously question the mental health of the persons quoted above.   The\noverall trend of SF sales now makes sense:  most readers don’t want our\nSF with a serving of creepy pervert.\n– Hohokam\nWARNING: The linked post deals seriously with child sexual abuse  in\nscience fiction and extensively quotes from the work of a science\nfiction author who endorses, and is believed to have engaged in,\ncriminally abusive sexual behavior. Not for the faint of heart; contains\nvulgarities, obscenities, and descriptions of extraordinarily deviant and\ndisgusting behavior. It is a grim, but factual description of the\ndepravity that is not only tolerated, but\nactively celebrated\nin the science fiction world.\nReaders under the age of 18 should not, under any circumstances, read\nthe linked post\nas it juxtaposes various comments about the SFWA Grand master and suspected homosexual child molester Samuel Delany with quotes from Delany’s own work, which is considerably more depraved than the average individual is likely able to imagine. This warning is not a joke. You won’t enjoy it. You won’t find it titillating. It will simply sicken you and hurt your soul. This is something you need to leave to the adults.\nAnd yet, the adults must deal with it. The rock must be overturned. The evil must be exposed and the rot must be excised. The science fiction world has continued to avert its eyes from Delany’s behavior for decades, just as it previously averted its eyes from the behavior of known child molesters in their midst, such as SFWA members Marion Zimmer Bradley and Ed Kramer, until well after they were safely dead or imprisoned.\nAs for the SJWs and fandom, while you may not like the source, the fact of the matter is that because we are the outsiders, we are the only ones with the courage to confront the evil that lurks among you. Even if you hate us, even if you hate what we stand for, you should hate what the monsters in your midst are doing to your children and to your community even more. If you can’t find common ground with us in actively opposing the molestation of children, how on Earth can you expect us to be interested in finding any common ground with you at all?\nGeorge Martin loftily announced the following in reference to the Sad Puppies:\n“When people behave badly (in fandom or out of it), or do things that I\nfind immoral or unethical, I reserve the right to speak out about it, as\nI did about Sad Puppies 3 last year.”\nSo, what are we to make of the obvious fact that he has been in fandom for literal decades, but has never found any of the behavior of the various child molesters of his acquaintance to be worth speaking out about?",
  "tags": [
    "mailvox",
    "SFWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-28T13:26:00+00:00"
}