{
  "url": "https://voxday.net/2015/12/26/mailvox-burning-shame/",
  "scraped_at": "2025-12-17T17:39:12.093926",
  "title": "Mailvox: the burning shame",
  "date_display": "December 26, 2015",
  "date_iso": "2015-12-26T23:53:00+00:00",
  "date_from_url": "2015-12-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Gammas never know when to stop. They always think that if they can just figure out the perfect thing to say, if they can somehow formulate the ideal insult and drop it at just the right time, they can completely flip the situation around and triumph like the secret kings they believe themselves to be.</p><p>By which I mean HS, or “Harry Savannah” as he calls himself, couldn’t<br> even flounce away properly. After loftily announcing that he<br> would let me “take the last word… like an obnoxious child demands,” he couldn’t quite manage to do so and emailed me a <i>sixth </i>time.<i><br/></i></br></br></p><blockquote class=\"tr_bq\"><p> <i>Did I say 16 yrs. old? Overestimated. Make that 13…Gamma.</i></p><p>I figured you’d be back again. You are such a Gamma that you can’t even flounce away properly. You see, when you talked about what an obnoxious child demands, that was a psychological tell. You were emotionally projecting. That’s why you’re trying to use my terms now, because you think they will hurt me the way they hurt you. But they won’t. They don’t apply.</p><p>I understand that it stings to know thousands of people are laughing at you. But that’s what happens when you are foolish enough to take on your intellectual and social superiors. Now, you can either learn your lesson and stop here, or you can keep digging yourself in deeper.</p><p>Your behavior is not Christian in the slightest, in fact, it makes Christians look more than a little bit crazy. You really should stop this now.</p></blockquote><p>This is where the similarity between the SJW mindset and the Gamma mindset can be seen; both SJWs and Gammas believe that if they fake it long enough, their declarations will somehow magically come alive. It’s a sort of intellectual cargo cult; it certainly involves magical thinking.</p><p>UPDATE: Harry just. keeps. going.</p><blockquote class=\"tr_bq\"><p> You are a study, Junior, in adolescent tub-thumping. You know nothing about me but offer this blunderbuss: “…your intellectual and social superiors.” Are you for real? Can you actually be this intellectually pubescent? Also this teenage piece of work: “…that was a psychological tell.” Riiiiiiiight, Junior, that’s EXACTLY what it was…a “psychological tell”. Now I’m actually curious – how old are you?</p><p>Just a little piece of advice, lad, because I’m beginning to feel embarrassed FOR you. And it is just that. You seem to be without a capacity to feel embarrassment. Call it extreme adolescent hubris. Call it moronic, but for heaven’s sake take some adult advice at long last. Am I asking too much here?</p></blockquote><p>I have warned Harry that if he persists in attempting to harass me, his email address is going on the blog. I don’t think it’s necessary to turn him over to the VFM, as he’s just an annoying Gamma male, not an SJW in attack mode. I get the feeling that he is an older individual who doesn’t really understand how social media works.</p><blockquote class=\"tr_bq\"><p> Just like a control-obsessed overweening bully – you make a threat. Very<br> good, the mask comes off. You persist in asking why I don’t stop<br> emailing you. Yet you do not seem to see that you do exactly the same.<br> Remarkable obtuseness. This could have stopped several steps ago in this<br> exchange. But, of course, you must have the last word – only to make a<br> threat after you’re wearied with it. But it is true that I offered to<br> give you that last word. So I am obligated to do so.  Let me finally say<br> that it is my judgment that you are a fraud as a professing Christian, a<br> disgrace – not even identifying as a believer a single time in this<br> exchange and engaging in a thoughtful manner anything of the substance<br> of my initial query, but preferred to petulantly complain about my being<br> “impolite.” Which, considering all the badinage in this tennis<br> exercise, seems down-right ridiculous in the end, no?</br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>This is the second time he has implied he would stop. We’ll see. It’s really remarkable the way Gammas always seem to want to jump in, lecture you, and then have you obediently accept their very important message without saying anything.</p></div>",
  "content_text": "Gammas never know when to stop. They always think that if they can just figure out the perfect thing to say, if they can somehow formulate the ideal insult and drop it at just the right time, they can completely flip the situation around and triumph like the secret kings they believe themselves to be.\nBy which I mean HS, or “Harry Savannah” as he calls himself, couldn’t\neven flounce away properly. After loftily announcing that he\nwould let me “take the last word… like an obnoxious child demands,” he couldn’t quite manage to do so and emailed me a\nsixth\ntime.\nDid I say 16 yrs. old? Overestimated. Make that 13…Gamma.\nI figured you’d be back again. You are such a Gamma that you can’t even flounce away properly. You see, when you talked about what an obnoxious child demands, that was a psychological tell. You were emotionally projecting. That’s why you’re trying to use my terms now, because you think they will hurt me the way they hurt you. But they won’t. They don’t apply.\nI understand that it stings to know thousands of people are laughing at you. But that’s what happens when you are foolish enough to take on your intellectual and social superiors. Now, you can either learn your lesson and stop here, or you can keep digging yourself in deeper.\nYour behavior is not Christian in the slightest, in fact, it makes Christians look more than a little bit crazy. You really should stop this now.\nThis is where the similarity between the SJW mindset and the Gamma mindset can be seen; both SJWs and Gammas believe that if they fake it long enough, their declarations will somehow magically come alive. It’s a sort of intellectual cargo cult; it certainly involves magical thinking.\nUPDATE: Harry just. keeps. going.\nYou are a study, Junior, in adolescent tub-thumping. You know nothing about me but offer this blunderbuss: “…your intellectual and social superiors.” Are you for real? Can you actually be this intellectually pubescent? Also this teenage piece of work: “…that was a psychological tell.” Riiiiiiiight, Junior, that’s EXACTLY what it was…a “psychological tell”. Now I’m actually curious – how old are you?\nJust a little piece of advice, lad, because I’m beginning to feel embarrassed FOR you. And it is just that. You seem to be without a capacity to feel embarrassment. Call it extreme adolescent hubris. Call it moronic, but for heaven’s sake take some adult advice at long last. Am I asking too much here?\nI have warned Harry that if he persists in attempting to harass me, his email address is going on the blog. I don’t think it’s necessary to turn him over to the VFM, as he’s just an annoying Gamma male, not an SJW in attack mode. I get the feeling that he is an older individual who doesn’t really understand how social media works.\nJust like a control-obsessed overweening bully – you make a threat. Very\ngood, the mask comes off. You persist in asking why I don’t stop\nemailing you. Yet you do not seem to see that you do exactly the same.\nRemarkable obtuseness. This could have stopped several steps ago in this\nexchange. But, of course, you must have the last word – only to make a\nthreat after you’re wearied with it. But it is true that I offered to\ngive you that last word. So I am obligated to do so.  Let me finally say\nthat it is my judgment that you are a fraud as a professing Christian, a\ndisgrace – not even identifying as a believer a single time in this\nexchange and engaging in a thoughtful manner anything of the substance\nof my initial query, but preferred to petulantly complain about my being\n“impolite.” Which, considering all the badinage in this tennis\nexercise, seems down-right ridiculous in the end, no?\nThis is the second time he has implied he would stop. We’ll see. It’s really remarkable the way Gammas always seem to want to jump in, lecture you, and then have you obediently accept their very important message without saying anything.",
  "tags": [
    "mailvox",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-26T23:53:00+00:00"
}