{
  "url": "https://voxday.net/2015/12/09/mailvox-change-is-inevitable/",
  "scraped_at": "2025-12-17T17:37:01.074538",
  "title": "Mailvox: change is inevitable",
  "date_display": "December 9, 2015",
  "date_iso": "2015-12-09T13:01:00+00:00",
  "date_from_url": "2015-12-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Farmer Tom doesn’t like it and he is seriously thinking about taking his tractor and going home:</p><blockquote class=\"tr_bq\"><p> This place is really going down hill in a hurry.</p><p>The host is now full on Trump supporter.</p><p>The vast majority of the guests seem to be so uninformed as to not know who Nate is?</p><p>I guess it’s time to find somewhere else to hang out.</p><p>I liked the place when “The Yellow Bus” was new.</p><p>Some things have changed, and not for the better.</p></blockquote><p>Translation: <i>I’m a Christian conservative and I don’t like it if things aren’t going in the way that I approve at all times.</i> If anyone feels this way, then don’t comment here. Stick to reading and stay out of the discourse. I have never been concerned with the opinion of those who prefer to stomp off in a huff or retreat to snarky sniping than to offer substantive criticism and to articulate their positions, no matter who they might happen to be.</p><p>Of course, it may be nothing more than FT not wishing to stick around to defend his self-assured Iowa prediction, as the most recent RCP average has: Trump 25.7, Cruz 22.3, Carson 15.7, and Paul behind !Jeb!.</p><blockquote class=\"tr_bq\"><p> I’m personal friends with the Iowa campaign managers for Trump and Cruz. I know Carson’s Iowa guy, Huckebee’s guy, hate the a-hole who was Perry’s guy. Met several times Rubio’ s guy, once in his Senate office.</p><p>I know these people and the insides of the system.</p><p>I can tell you right now that Trump will not win Iowa, he will get second or third.</p><p>1. Carson<br> 2. Trump<br> 3. Cruz<br> 4. Probably Rand because the RP people will hang to the end.</br></br></br></p></blockquote><p>Maybe he is right. Maybe he is not. I have no idea; I don’t do political predictions anymore. Regardless, the fact that you’ve been here for years means that I will occasionally cut you some slack, not that I will overlook it when you’re behaving like a run-of-the-mill anklebiter or a prima donna. I find it somewhat frustrating when Ilk demonstrate that, despite years of reading here, they still can’t manage to control their emotions, construct proper syllogisms, or gracefully accept being shown to be wrong.</p><p>As I told FT in the comments: This place has not changed, but the world has. In this electoral campaign cycle, Trump is the only candidate who matters, and it is not because of who he is or what he might do if he wins.</p><p>This is basic game theory. As I have said repeatedly in the past, there are only three issues that matter today. In their <i>current </i>order of importance, they are:</p><ul><li>Immigration</li><li>Gun Control</li><li>Federal Reserve</li></ul><p>We can ignore the latter. None of the candidates even understand the issue and none of them are likely to do anything about it. Trump, being a maverick, is the only one who might even look at the issue, but that’s totally speculative and therefore irrelevant.</p><p>On guns, Clinton and Sanders are terrible, Ben Carson is bad, and most of the Republicans, including Trump, are both good and reliable. I’m not at all concerned about Trump saying he would take a serious look at the no-fly list, that was in response to a question about Islamic terrorism and in no way indicates that he has any interest whatsoever in sailing against the populist pro-gun position.</p><p>Nate said that we would have come down hard on another candidate who said the same, which is true, because unlike all the other candidates, Trump speaks off the cuff and without having his statement massaged by fifty consultants. If Bush said it, you can bet he’s looking to push anti-gun. In the context that Trump did, he’s wondering why known terrorists are permitted to arm themselves; he’s more likely to jail or deport them than attack gun rights.</p><p>More importantly, <i>no one is going to do anything about gun control</i>. Obama has been calling for it non-stop, they’ve been staging multiple false flags to try to drum up popular support – yes, they have, there is no question about it – and yet people are gunning up like never before. Gun control is the most important issue, but it is not one that is any more relevant in this particular election than is the Federal Reserve. I trust every single Republican candidate in this regard, including Ben Carson, who has completely changed his rhetoric on the subject once being confronted with the American public’s cast-iron will on the topic.</p><p>That leaves immigration. And here, Trump is the only candidate who is even beginning to address the scope of the existential problem. All the Democrats, and more than half of the Republicans, actually want to make it worse. Even if you don’t support him, or trust him, the mere fact that he is in the race has changed the debate on the subject more than the combined efforts of every anti-immigrationist, every open-borders skeptic, and every anti-free trade economist. He has been a literal <i>Godsend </i>in this regard, no matter what happens in the end.</p><p>In short, Donald Trump has radically changed the culture, and culture always trumps politics. And that is why petty sniping about the usual politics is not only pointless, it demonstrates that you are too stuck in an intellectual rut to even understand what the rest of us are discussing.</p></div>",
  "content_text": "Farmer Tom doesn’t like it and he is seriously thinking about taking his tractor and going home:\nThis place is really going down hill in a hurry.\nThe host is now full on Trump supporter.\nThe vast majority of the guests seem to be so uninformed as to not know who Nate is?\nI guess it’s time to find somewhere else to hang out.\nI liked the place when “The Yellow Bus” was new.\nSome things have changed, and not for the better.\nTranslation:\nI’m a Christian conservative and I don’t like it if things aren’t going in the way that I approve at all times.\nIf anyone feels this way, then don’t comment here. Stick to reading and stay out of the discourse. I have never been concerned with the opinion of those who prefer to stomp off in a huff or retreat to snarky sniping than to offer substantive criticism and to articulate their positions, no matter who they might happen to be.\nOf course, it may be nothing more than FT not wishing to stick around to defend his self-assured Iowa prediction, as the most recent RCP average has: Trump 25.7, Cruz 22.3, Carson 15.7, and Paul behind !Jeb!.\nI’m personal friends with the Iowa campaign managers for Trump and Cruz. I know Carson’s Iowa guy, Huckebee’s guy, hate the a-hole who was Perry’s guy. Met several times Rubio’ s guy, once in his Senate office.\nI know these people and the insides of the system.\nI can tell you right now that Trump will not win Iowa, he will get second or third.\n1. Carson\n2. Trump\n3. Cruz\n4. Probably Rand because the RP people will hang to the end.\nMaybe he is right. Maybe he is not. I have no idea; I don’t do political predictions anymore. Regardless, the fact that you’ve been here for years means that I will occasionally cut you some slack, not that I will overlook it when you’re behaving like a run-of-the-mill anklebiter or a prima donna. I find it somewhat frustrating when Ilk demonstrate that, despite years of reading here, they still can’t manage to control their emotions, construct proper syllogisms, or gracefully accept being shown to be wrong.\nAs I told FT in the comments: This place has not changed, but the world has. In this electoral campaign cycle, Trump is the only candidate who matters, and it is not because of who he is or what he might do if he wins.\nThis is basic game theory. As I have said repeatedly in the past, there are only three issues that matter today. In their\ncurrent\norder of importance, they are:\nImmigration\nGun Control\nFederal Reserve\nWe can ignore the latter. None of the candidates even understand the issue and none of them are likely to do anything about it. Trump, being a maverick, is the only one who might even look at the issue, but that’s totally speculative and therefore irrelevant.\nOn guns, Clinton and Sanders are terrible, Ben Carson is bad, and most of the Republicans, including Trump, are both good and reliable. I’m not at all concerned about Trump saying he would take a serious look at the no-fly list, that was in response to a question about Islamic terrorism and in no way indicates that he has any interest whatsoever in sailing against the populist pro-gun position.\nNate said that we would have come down hard on another candidate who said the same, which is true, because unlike all the other candidates, Trump speaks off the cuff and without having his statement massaged by fifty consultants. If Bush said it, you can bet he’s looking to push anti-gun. In the context that Trump did, he’s wondering why known terrorists are permitted to arm themselves; he’s more likely to jail or deport them than attack gun rights.\nMore importantly,\nno one is going to do anything about gun control\n. Obama has been calling for it non-stop, they’ve been staging multiple false flags to try to drum up popular support – yes, they have, there is no question about it – and yet people are gunning up like never before. Gun control is the most important issue, but it is not one that is any more relevant in this particular election than is the Federal Reserve. I trust every single Republican candidate in this regard, including Ben Carson, who has completely changed his rhetoric on the subject once being confronted with the American public’s cast-iron will on the topic.\nThat leaves immigration. And here, Trump is the only candidate who is even beginning to address the scope of the existential problem. All the Democrats, and more than half of the Republicans, actually want to make it worse. Even if you don’t support him, or trust him, the mere fact that he is in the race has changed the debate on the subject more than the combined efforts of every anti-immigrationist, every open-borders skeptic, and every anti-free trade economist. He has been a literal\nGodsend\nin this regard, no matter what happens in the end.\nIn short, Donald Trump has radically changed the culture, and culture always trumps politics. And that is why petty sniping about the usual politics is not only pointless, it demonstrates that you are too stuck in an intellectual rut to even understand what the rest of us are discussing.",
  "tags": [
    "mailvox",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-09T13:01:00+00:00"
}