{
  "url": "https://voxday.net/2015/12/05/monday/",
  "scraped_at": "2025-12-17T17:36:30.784715",
  "title": "Monday",
  "date_display": "December 5, 2015",
  "date_iso": "2015-12-05T14:05:00+00:00",
  "date_from_url": "2015-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://4.bp.blogspot.com/-YVj3YGYT_Gg/Vkp2gvArHuI/AAAAAAAABlI/J95G0Vo60EU/s1600/cuck_480.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/12/cuck_480-2.jpg\" width=\"200\"/></a></div><p>Somehow, between Red Eagle, Mike Cernovich, Red Meat, Automatthew, myself, Castalia House’s star proofreader, and the self-appointed religious conscience of the blog, we have managed to complete <i>Cuckservative </i>in time to ensure its Amazon release on Monday. I also just received the second of the two bonus books; it is a complete riot, so if you haven’t signed up for the New Release mailing list, please note that this is your last chance to do so before the <i>Cuckservative </i>mailing goes out on Monday morning. You can sign up on the left sidebar. &lt;——- Look over there.</p><p>As one of the authors, my opinion is too close to have any perspective at all, for better or for worse, but two of the early reviewers have used some form of the phrase “hits it out of the park”. Red Eagle himself said after going over the completed manuscript, “this is a powerful book”.</p><p>It is going to be considerably more controversial than <i>SJWAL </i>was. I would be absolutely astonished if it was not vilified as being heartless and unapologetically racist, and I will be astounded if the words “vicious”, “hateful”, and “Nazi” do not appear in almost every critical review. It should have a real shot at the record for the most one-star reviews on Amazon. I wonder what the record is?</p><p>In the book’s defense, all I can say is that it is remorselessly true. We didn’t bother with footnotes or a lot of citations because we know how that game is played; this is not a dialectical book, it is weaponized rhetoric backed by solid dialectic. And, as we know, the best rhetoric always stands on a foundation of truth.</p><p>There will be many things about the book that will make you uncomfortable, things you will not like. Some of you will even be offended. But we cannot, and we will not, apologize for writing about the truth as best we see it. Reality is what it is. The facts are what they are. The future will be what it will be. I don’t like many aspects of what appears to be the most likely scenario any better than any other sane individual, but then, no one ever asked me to arrange matters.</p><p>A few people have questioned whether Red Eagle exists or if I invented him in order to deflect some of the inevitable criticism. All I can say is that a) he wrote more of it than I did, b) he’s a more engaging writer than I am, and, c) if you genuinely believe I wrote both <i>SJWAL </i>and <i>Cuckservative </i>by myself since June, you’re insane. Also, there will be no deflecting any criticism. The open borders crowd is going to view <i>Cuckservative </i>as something between the hateful bastard of <i>The Bell Curve</i> and <i>Mein Kampf</i>,<i> </i>and a set of blueprints for making a working nuclear bomb out of Legos printed on the back of a Cheerios box.</p><p>Translation: I don’t think <i>SJWAL</i>‘s reign as “the most dangerous book in America” is going to last beyond Monday. The goal is to hit 1k on Monday.</p></div>",
  "content_text": "Somehow, between Red Eagle, Mike Cernovich, Red Meat, Automatthew, myself, Castalia House’s star proofreader, and the self-appointed religious conscience of the blog, we have managed to complete\nCuckservative\nin time to ensure its Amazon release on Monday. I also just received the second of the two bonus books; it is a complete riot, so if you haven’t signed up for the New Release mailing list, please note that this is your last chance to do so before the\nCuckservative\nmailing goes out on Monday morning. You can sign up on the left sidebar. <——- Look over there.\nAs one of the authors, my opinion is too close to have any perspective at all, for better or for worse, but two of the early reviewers have used some form of the phrase “hits it out of the park”. Red Eagle himself said after going over the completed manuscript, “this is a powerful book”.\nIt is going to be considerably more controversial than\nSJWAL\nwas. I would be absolutely astonished if it was not vilified as being heartless and unapologetically racist, and I will be astounded if the words “vicious”, “hateful”, and “Nazi” do not appear in almost every critical review. It should have a real shot at the record for the most one-star reviews on Amazon. I wonder what the record is?\nIn the book’s defense, all I can say is that it is remorselessly true. We didn’t bother with footnotes or a lot of citations because we know how that game is played; this is not a dialectical book, it is weaponized rhetoric backed by solid dialectic. And, as we know, the best rhetoric always stands on a foundation of truth.\nThere will be many things about the book that will make you uncomfortable, things you will not like. Some of you will even be offended. But we cannot, and we will not, apologize for writing about the truth as best we see it. Reality is what it is. The facts are what they are. The future will be what it will be. I don’t like many aspects of what appears to be the most likely scenario any better than any other sane individual, but then, no one ever asked me to arrange matters.\nA few people have questioned whether Red Eagle exists or if I invented him in order to deflect some of the inevitable criticism. All I can say is that a) he wrote more of it than I did, b) he’s a more engaging writer than I am, and, c) if you genuinely believe I wrote both\nSJWAL\nand\nCuckservative\nby myself since June, you’re insane. Also, there will be no deflecting any criticism. The open borders crowd is going to view\nCuckservative\nas something between the hateful bastard of\nThe Bell Curve\nand\nMein Kampf\n,\nand a set of blueprints for making a working nuclear bomb out of Legos printed on the back of a Cheerios box.\nTranslation: I don’t think\nSJWAL\n‘s reign as “the most dangerous book in America” is going to last beyond Monday. The goal is to hit 1k on Monday.",
  "tags": [
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-05T14:05:00+00:00"
}