{
  "url": "https://voxday.net/2015/12/19/not-invasion/",
  "scraped_at": "2025-12-17T17:38:18.778953",
  "title": "Not an invasion?",
  "date_display": "December 19, 2015",
  "date_iso": "2015-12-19T13:00:00+00:00",
  "date_from_url": "2015-12-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The only reason the mass “immigration” is not seen as an invasion is because <a href=\"https://pjmedia.com/trending/2015/12/18/things-getting-ugly-at-the-chunnel-as-migrants-attack\">the West is not resisting it</a>:<br/></p><blockquote class=\"tr_bq\"><p> Some 800 to 1,000 migrants tried on Thursday to<br> break into the Channel Tunnel near the French port city of Calais in a<br> desperate bid to reach Britain, local officials said, triggering chaotic<br> scenes that saw traffic disrupted and security forces firing tear gas<br> to disperse the crowds.</br></br></br></br></p><p>“We<br> noted the presence of 800 to 1,000 migrants” near the tunnel, a<br> local official told AFP, as a police source described the numbers as<br> “unprecedented” for daytime. People normally try to cross over under<br> cover of darkness, often having paid exorbitant sums to smugglers to<br> make dangerous, even life-threatening bids to reach the other side of<br> the Channel. “As they approached the tunnel, several migrants tried hard<br> to slow down the flow of traffic so they could climb into the trucks,”<br> the source said.</br></br></br></br></br></br></br></br></p><p>An<br> AFP journalist saw young men climb on top of trucks heading<br> towards Britain, with some cutting through the tarpaulin covering the<br> vehicles to get inside. Others could be seen helping their friends climb<br> into the back of a white truck. Several people succeeded in their bid<br> to enter the Channel Tunnel site, the journalist said. “Security forces<br> were deployed… objects were being thrown at them, and they had to<br> resort to using tear gas,” police said in a statement.</br></br></br></br></br></br></br></p></blockquote><p>Obviously these totally non-invasive immigrants are perfectly willing to resort to force if it is required.</p></div>",
  "content_text": "The only reason the mass “immigration” is not seen as an invasion is because\nthe West is not resisting it\n:\nSome 800 to 1,000 migrants tried on Thursday to\nbreak into the Channel Tunnel near the French port city of Calais in a\ndesperate bid to reach Britain, local officials said, triggering chaotic\nscenes that saw traffic disrupted and security forces firing tear gas\nto disperse the crowds.\n“We\nnoted the presence of 800 to 1,000 migrants” near the tunnel, a\nlocal official told AFP, as a police source described the numbers as\n“unprecedented” for daytime. People normally try to cross over under\ncover of darkness, often having paid exorbitant sums to smugglers to\nmake dangerous, even life-threatening bids to reach the other side of\nthe Channel. “As they approached the tunnel, several migrants tried hard\nto slow down the flow of traffic so they could climb into the trucks,”\nthe source said.\nAn\nAFP journalist saw young men climb on top of trucks heading\ntowards Britain, with some cutting through the tarpaulin covering the\nvehicles to get inside. Others could be seen helping their friends climb\ninto the back of a white truck. Several people succeeded in their bid\nto enter the Channel Tunnel site, the journalist said. “Security forces\nwere deployed… objects were being thrown at them, and they had to\nresort to using tear gas,” police said in a statement.\nObviously these totally non-invasive immigrants are perfectly willing to resort to force if it is required.",
  "tags": [
    "immigration",
    "Invasion"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-19T13:00:00+00:00"
}