{
  "url": "https://voxday.net/2015/12/04/of-shopping-and-surviva/",
  "scraped_at": "2025-12-17T17:36:21.638345",
  "title": "Of shopping and survival",
  "date_display": "December 4, 2015",
  "date_iso": "2015-12-04T13:21:00+00:00",
  "date_from_url": "2015-12-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s rather remarkable that David Brooks is still regarded, by some, to be a serious and thoughtful public intellectual, when in reality he is about as deep and reflective as Britney Spears hopped up on anti-depressants. Here he explains, in the aftermath of the most recent Islamic immigrant massacre, why the appeal of Donald Trump <a href=\"http://www.nytimes.com/2015/12/04/opinion/no-donald-trump-wont-win.html\">is bound to fade</a>:</p><blockquote class=\"tr_bq\"><p> A little while ago I went rug shopping. Four rugs were laid out on the floor and among them was one with a pink motif that was dazzlingly beautiful. It was complex and sophisticated. If you had asked me at that moment which rug I wanted, I would have said the pink one.</p><p>This conviction lasted about five minutes. But then my mentality flipped and I started asking some questions. Would the furniture go with this rug? Would this rug clash with the wall hangings? Would I get tired of its electric vibrancy?</p><p>Suddenly a subtler and more prosaic blue rug grabbed center stage. The rugs had not changed, but suddenly I wanted the blue rug. The pink rug had done an excellent job of being eye-popping on its own. The blue rug was doing an excellent job of being a rug I could enjoy living with.</p></blockquote><p>That’s right. The analogy from which Brooks draws his political model is his own interior-decorating habits. If I was a similarly shallow thinker, I would argue that Marco Rubio is bound to win because I had a glass of Spanish Tempranillo with lunch today and he is the most obviously Spanish candidate in the mix.</p><p>I am not certain yet that Trump is capable of overcoming the all-out war that will be waged on him by both factions of the bi-factional ruling party. The Republican establishment already has its knives out for him, but the Democratic establishment has not yet begun to fight. But I would not count him out either, especially in an environment where Americans quite rightly feel threatened by the hostile invaders that the ruling party has established in their midst.</p><p>But speaking of politics, and political philosophy, I am pleased to be able to say that SJWs Always Lie is now #1 in Political Philosophy on Amazon UK and is <strike>in the top 1,000 overall on</strike>  #1 in Political Philosophy on Amazon Australia as well.</p></div>",
  "content_text": "It’s rather remarkable that David Brooks is still regarded, by some, to be a serious and thoughtful public intellectual, when in reality he is about as deep and reflective as Britney Spears hopped up on anti-depressants. Here he explains, in the aftermath of the most recent Islamic immigrant massacre, why the appeal of Donald Trump\nis bound to fade\n:\nA little while ago I went rug shopping. Four rugs were laid out on the floor and among them was one with a pink motif that was dazzlingly beautiful. It was complex and sophisticated. If you had asked me at that moment which rug I wanted, I would have said the pink one.\nThis conviction lasted about five minutes. But then my mentality flipped and I started asking some questions. Would the furniture go with this rug? Would this rug clash with the wall hangings? Would I get tired of its electric vibrancy?\nSuddenly a subtler and more prosaic blue rug grabbed center stage. The rugs had not changed, but suddenly I wanted the blue rug. The pink rug had done an excellent job of being eye-popping on its own. The blue rug was doing an excellent job of being a rug I could enjoy living with.\nThat’s right. The analogy from which Brooks draws his political model is his own interior-decorating habits. If I was a similarly shallow thinker, I would argue that Marco Rubio is bound to win because I had a glass of Spanish Tempranillo with lunch today and he is the most obviously Spanish candidate in the mix.\nI am not certain yet that Trump is capable of overcoming the all-out war that will be waged on him by both factions of the bi-factional ruling party. The Republican establishment already has its knives out for him, but the Democratic establishment has not yet begun to fight. But I would not count him out either, especially in an environment where Americans quite rightly feel threatened by the hostile invaders that the ruling party has established in their midst.\nBut speaking of politics, and political philosophy, I am pleased to be able to say that SJWs Always Lie is now #1 in Political Philosophy on Amazon UK and is\nin the top 1,000 overall on\n#1 in Political Philosophy on Amazon Australia as well.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-04T13:21:00+00:00"
}