{
  "url": "https://voxday.net/2015/12/27/science-fictions-smiling-sociopa/",
  "scraped_at": "2025-12-17T17:39:17.615393",
  "title": "Science fiction’s smiling sociopath",
  "date_display": "December 27, 2015",
  "date_iso": "2015-12-27T13:00:00+00:00",
  "date_from_url": "2015-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the things that has always bothered me about John Scalzi’s bizarre public confession concerning his sexual predilections is the same thing that has caused many people to ask the question: why on Earth would John Scalzi <a href=\"http://whatever.scalzi.com/2012/10/25/a-fan-letter-to-certain-conservative-politicians/\">openly confess to being a rapist</a> who enjoys sexually assaulting women?</p><p>On the one hand, if he was a genuine rapist, why would he ever publicly <i>admit </i>to it? On the other, if he was not, how could he seriously think women would find it funny to hear him declare, in his self-styled “satire”: <i>“I’m a rapist. I’m one of those men who likes to force myself on women without<br> their consent or desire and then batter them sexually.”</br></i></p><p>Who could possibly think that is either clever or funny? What sort of person <i>writes that in the first place</i>? Well, now we know, <a href=\"http://boingboing.net/2015/12/25/john-scalzis-empty-jar-of-fu.html\">thanks to Cory Doctorow</a>, who after 12 years of acquaintance with Scalzi has warned the public that the Tor Books author is very far from neurologically typical. Scalzi simply doesn’t <i>care </i>about anything; in Doctorow’s terms, he has absolutely “zero fucks to give”. John Scalzi <i>just doesn’t care</i> that you know that he’s a self-admitted rapist.</p><blockquote class=\"tr_bq\"><p> John is limbically atypical. Having watching him mix it up online and face-to-face, I think he’s just wired up different. I think that he really, actually, no-foolin’ gives no fucks at all. All our human traits are arrayed on a bell-curve, I think, from the length of your fingers to your autonomic nervous system’s response to jerks. John is a four- or five-sigma outlier.</p></blockquote><p>This explains a lot that is confusing about the man’s behavior. I’ve heard from numerous people who have encountered Scalzi about his tendency to engage in socially inappropriate behavior towards others in public, whether it is leaping into the arms of someone who barely knows him to playing “hail-fellow-well-met” with authors he has repeatedly and virulently attacked. I’ve also heard from reliable sources that he goes from overly warm to dead-eyed cold in an instant, depending on whether he believes the person to whom he is talking is of immediate use to him or not.</p><p>At various conferences, attendees have reported that Scalzi was “weird”, prone to laughing at his own jokes, and totally unable to talk about anything but himself, even when he was supposed to be discussing the work of others. This is five-sigma narcissism, not necessarily malignant narcissism, but certainly a pathological form. And there is a word to describe a narcissistic outlier who lacks empathy: sociopath.</p><p>A reporter from the <i>New York Times</i> appears to have subconsciously picked up some signs of this in his interview with Scalzi, as he delicately described the Tor Books author as being prone to smiling and giggling and “someone who is comfortable with the business of promotion”, even as Scalzi <a href=\"http://www.milobookclub.com/2014/11/02/50000-readers-day/\">blatantly lied about his site traffic</a> in the interview.</p><p><i>Psychology Today</i> lists the signs of a sociopath, and it’s quite clear that <i>even in the eyes of his friends</i>, Scalzi fits them like a glove, like a glove custom-made in Ohio from the tanned flesh of missing teenagers:</p><ul><li>Superficial charm and good intelligence</li><li>Unreliability</li><li>Untruthfulness and insincerity</li><li>Lack of remorse and shame</li><li>Inadequately motivated antisocial behavior</li><li>Poor judgment and failure to learn by experience</li><li>Pathologic egocentricity</li><li>General poverty in major affective reactions</li><li>Unresponsiveness in general interpersonal relations</li></ul><p>We already knew about the first seven traits. We knew that Scalzi is a habitual liar, that his egocentricity reaches pathological levels, and that he is unable to learn from experience. But we did not know about the two latter traits. And yet, what are “wired up different” and “five-sigma outlier” other than the layman’s way of describing “general poverty in major affective reactions” and “unresponsiveness in general interpersonal relations”?</p><p>It was clear that the time Scalzi spent in a wheelchair in his youth had a significant effect on his socio-sexual development, but now it is apparent that the wheelchair, plus the absent father, also affected the way in which he developed psychologically. The question now may not be whether science fiction’s smiling sociopath is another abusive sex criminal in the mode of Walter Breen, Ed Kramer, Marion Zimmer Bradley, Gian Gomeshi, and Samuel Delany, just to name five of whom we are already aware, but rather,<i> how many bodies are buried</i> somewhere underneath that broad expanse of Ohio lawn?</p><p>And the gift of an empty mason jar is particularly troubling, as it can only make the astute observer wonder what sort of ghastly little trophies are intended to go inside it.</p></div>",
  "content_text": "One of the things that has always bothered me about John Scalzi’s bizarre public confession concerning his sexual predilections is the same thing that has caused many people to ask the question: why on Earth would John Scalzi\nopenly confess to being a rapist\nwho enjoys sexually assaulting women?\nOn the one hand, if he was a genuine rapist, why would he ever publicly\nadmit\nto it? On the other, if he was not, how could he seriously think women would find it funny to hear him declare, in his self-styled “satire”:\n“I’m a rapist. I’m one of those men who likes to force myself on women without\ntheir consent or desire and then batter them sexually.”\nWho could possibly think that is either clever or funny? What sort of person\nwrites that in the first place\n? Well, now we know,\nthanks to Cory Doctorow\n, who after 12 years of acquaintance with Scalzi has warned the public that the Tor Books author is very far from neurologically typical. Scalzi simply doesn’t\ncare\nabout anything; in Doctorow’s terms, he has absolutely “zero fucks to give”. John Scalzi\njust doesn’t care\nthat you know that he’s a self-admitted rapist.\nJohn is limbically atypical. Having watching him mix it up online and face-to-face, I think he’s just wired up different. I think that he really, actually, no-foolin’ gives no fucks at all. All our human traits are arrayed on a bell-curve, I think, from the length of your fingers to your autonomic nervous system’s response to jerks. John is a four- or five-sigma outlier.\nThis explains a lot that is confusing about the man’s behavior. I’ve heard from numerous people who have encountered Scalzi about his tendency to engage in socially inappropriate behavior towards others in public, whether it is leaping into the arms of someone who barely knows him to playing “hail-fellow-well-met” with authors he has repeatedly and virulently attacked. I’ve also heard from reliable sources that he goes from overly warm to dead-eyed cold in an instant, depending on whether he believes the person to whom he is talking is of immediate use to him or not.\nAt various conferences, attendees have reported that Scalzi was “weird”, prone to laughing at his own jokes, and totally unable to talk about anything but himself, even when he was supposed to be discussing the work of others. This is five-sigma narcissism, not necessarily malignant narcissism, but certainly a pathological form. And there is a word to describe a narcissistic outlier who lacks empathy: sociopath.\nA reporter from the\nNew York Times\nappears to have subconsciously picked up some signs of this in his interview with Scalzi, as he delicately described the Tor Books author as being prone to smiling and giggling and “someone who is comfortable with the business of promotion”, even as Scalzi\nblatantly lied about his site traffic\nin the interview.\nPsychology Today\nlists the signs of a sociopath, and it’s quite clear that\neven in the eyes of his friends\n, Scalzi fits them like a glove, like a glove custom-made in Ohio from the tanned flesh of missing teenagers:\nSuperficial charm and good intelligence\nUnreliability\nUntruthfulness and insincerity\nLack of remorse and shame\nInadequately motivated antisocial behavior\nPoor judgment and failure to learn by experience\nPathologic egocentricity\nGeneral poverty in major affective reactions\nUnresponsiveness in general interpersonal relations\nWe already knew about the first seven traits. We knew that Scalzi is a habitual liar, that his egocentricity reaches pathological levels, and that he is unable to learn from experience. But we did not know about the two latter traits. And yet, what are “wired up different” and “five-sigma outlier” other than the layman’s way of describing “general poverty in major affective reactions” and “unresponsiveness in general interpersonal relations”?\nIt was clear that the time Scalzi spent in a wheelchair in his youth had a significant effect on his socio-sexual development, but now it is apparent that the wheelchair, plus the absent father, also affected the way in which he developed psychologically. The question now may not be whether science fiction’s smiling sociopath is another abusive sex criminal in the mode of Walter Breen, Ed Kramer, Marion Zimmer Bradley, Gian Gomeshi, and Samuel Delany, just to name five of whom we are already aware, but rather,\nhow many bodies are buried\nsomewhere underneath that broad expanse of Ohio lawn?\nAnd the gift of an empty mason jar is particularly troubling, as it can only make the astute observer wonder what sort of ghastly little trophies are intended to go inside it.",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-27T13:00:00+00:00"
}