{
  "url": "https://voxday.net/2015/12/23/settle-down-ladies/",
  "scraped_at": "2025-12-17T17:38:46.292005",
  "title": "Settle down, ladies",
  "date_display": "December 23, 2015",
  "date_iso": "2015-12-23T09:52:00+00:00",
  "date_from_url": "2015-12-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>La, such a catfight! It’s always a bit amusing to see when a disagreement here moves to rhetorical metargument, where instead of arguing about the actual point of disputation, the argument is transformed into who can generate more feelbads in the other side.</p><p>It is readily apparent that “you’re arguing like an SJW” has become the new “that’s a logical fallacy”, pseudo-dialectic that is both rhetorical and ineptly applied. It’s not quite as irritating, of course, as SJW is a more recent and less perfectly defined term; it used to make my teeth itch to see people use “logical fallacy” as a synonym for “statement with which I disagree”.</p><p>I stomped that inept rhetorical device out by the simple tactic of always asking the individual a single question: what was the logical fallacy? Was it the Undistributed Middle? Denying the Antecedent? <i>Ignoratio elenchi</i>? The fact that they could neither identify nor even describe the “fallacy” they had decried usually sufficed to teach them their error in a sufficiently embarrassing way to prevent them from again resorting to the rhetorical tactic.</p><p>Now, who is “arguing like an SJW?” Neither “the new Star Wars is a great movie everyone should see” nor “the new SJW Wars sucks and I wish I hadn’t seen it” crowd has, as far as I can tell, lied. Neither side has decried the other’s right to hold its opinion, or made any attempt to shun, discredit, or disemploy the other. Neither side has attempted to claim that the other side is intrinsically immoral, racist, sexist, homophobic, transphobic, or bigoted.</p><p>Both sides <i>have </i>indulged heavily in rhetoric, but while SJWs are limited to rhetorical communication, so are most non-SJWs.</p><p>So, it’s simply not true that anyone is “arguing like an SJW”. And the fact that someone could <i>imagine </i>the other side doing so is not reflective of anything but the individual’s own imagination. I could imagine that JJ Abrams might one day make a movie that I want to see, but that does not indicate that he has actually done so, or that he will do so in the future.</p><p>I knew I wouldn’t bother seeing the Disney movies as soon as I learned he was the director. Mr. Abrams has had a long, distinguished, and successful career in Hollywood, during which he has not made a single movie or television show that interested or entertained me in the slightest. Considering that I saw one of his Star Trek movies when it was on TV one night, I was not surprised to learn that he has delivered what is essentially an repetitive remake of one of its predecessors. He may be a master of lens flare, what he is is not is an original story teller.</p><p>And to turn the old saying on its head, while history rhymes, it does not repeat. The absurdity of what Abrams has produced, from a story perspective, can perhaps be best understood if one applied his storytelling technique to a hypothetical remake of Lord of the Rings.</p><p>Imagine the Shire. Imagine a party, not a birthday party, but a 50th wedding anniversary for Sam and Rosie Gamgee. In the midst of the party, they disappear, and leave behind them a mysterious piece of jewelry for their daughter, Frodette Gamgee. Then, one day, a grey-bearded, dark-skinned stranger appears; it is Gandhi the black dwarf, warning Frodette that it is a shard of Morgoth Bauglir’s iron crown, in which the fallen Ainur had imbued with his immortal essence. The shard had escaped notice in the War for the Ring, but now that Sauron and the One Ring are gone, it is the key to ruling Middle Earth.</p><p>A new power, an evil power, an <i>invisible </i>power has risen in the East, and the King of Gondor, Aragorn’s son Sarugorn, has been acting strangely of late. Frodette must bring the iron shard to Aglarond, where the King of the Glittering Caves will know what do… but beware, the Knight Riders of the Invisible Empire are hunting for it!</p><p>Personally, the only movie review in which I am genuinely interested in is Mr. John C. Wright’s. Those who have read <i><b><a href=\"http://www.amazon.com/gp/product/B00K4D7LO6/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B00K4D7LO6&amp;linkCode=as2&amp;tag=voxpop06-20&amp;linkId=ZHWNHI3KG6WBF5E7\" rel=\"nofollow\">Transhuman and Subhuman: Essays on Science Fiction and Awful Truth</a><noscript><img alt=\"\" border=\"0\" decoding=\"async\" height=\"1\" src=\"http://ir-na.amazon-adsystem.com/e/ir?t=voxpop06-20&amp;l=as2&amp;o=1&amp;a=B00K4D7LO6\" style=\"border: none !important; margin: 0px !important;\" width=\"1\"/></noscript><img alt=\"\" border=\"0\" class=\"lazyload\" data-src=\"http://ir-na.amazon-adsystem.com/e/ir?t=voxpop06-20&amp;l=as2&amp;o=1&amp;a=B00K4D7LO6\" decoding=\"async\" height=\"1\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%201%201%22%3E%3C/svg%3E\" style=\"border: none !important; margin: 0px !important;\" width=\"1\"/></b><br> </br></i> will understand why.</p></div>",
  "content_text": "La, such a catfight! It’s always a bit amusing to see when a disagreement here moves to rhetorical metargument, where instead of arguing about the actual point of disputation, the argument is transformed into who can generate more feelbads in the other side.\nIt is readily apparent that “you’re arguing like an SJW” has become the new “that’s a logical fallacy”, pseudo-dialectic that is both rhetorical and ineptly applied. It’s not quite as irritating, of course, as SJW is a more recent and less perfectly defined term; it used to make my teeth itch to see people use “logical fallacy” as a synonym for “statement with which I disagree”.\nI stomped that inept rhetorical device out by the simple tactic of always asking the individual a single question: what was the logical fallacy? Was it the Undistributed Middle? Denying the Antecedent?\nIgnoratio elenchi\n? The fact that they could neither identify nor even describe the “fallacy” they had decried usually sufficed to teach them their error in a sufficiently embarrassing way to prevent them from again resorting to the rhetorical tactic.\nNow, who is “arguing like an SJW?” Neither “the new Star Wars is a great movie everyone should see” nor “the new SJW Wars sucks and I wish I hadn’t seen it” crowd has, as far as I can tell, lied. Neither side has decried the other’s right to hold its opinion, or made any attempt to shun, discredit, or disemploy the other. Neither side has attempted to claim that the other side is intrinsically immoral, racist, sexist, homophobic, transphobic, or bigoted.\nBoth sides\nhave\nindulged heavily in rhetoric, but while SJWs are limited to rhetorical communication, so are most non-SJWs.\nSo, it’s simply not true that anyone is “arguing like an SJW”. And the fact that someone could\nimagine\nthe other side doing so is not reflective of anything but the individual’s own imagination. I could imagine that JJ Abrams might one day make a movie that I want to see, but that does not indicate that he has actually done so, or that he will do so in the future.\nI knew I wouldn’t bother seeing the Disney movies as soon as I learned he was the director. Mr. Abrams has had a long, distinguished, and successful career in Hollywood, during which he has not made a single movie or television show that interested or entertained me in the slightest. Considering that I saw one of his Star Trek movies when it was on TV one night, I was not surprised to learn that he has delivered what is essentially an repetitive remake of one of its predecessors. He may be a master of lens flare, what he is is not is an original story teller.\nAnd to turn the old saying on its head, while history rhymes, it does not repeat. The absurdity of what Abrams has produced, from a story perspective, can perhaps be best understood if one applied his storytelling technique to a hypothetical remake of Lord of the Rings.\nImagine the Shire. Imagine a party, not a birthday party, but a 50th wedding anniversary for Sam and Rosie Gamgee. In the midst of the party, they disappear, and leave behind them a mysterious piece of jewelry for their daughter, Frodette Gamgee. Then, one day, a grey-bearded, dark-skinned stranger appears; it is Gandhi the black dwarf, warning Frodette that it is a shard of Morgoth Bauglir’s iron crown, in which the fallen Ainur had imbued with his immortal essence. The shard had escaped notice in the War for the Ring, but now that Sauron and the One Ring are gone, it is the key to ruling Middle Earth.\nA new power, an evil power, an\ninvisible\npower has risen in the East, and the King of Gondor, Aragorn’s son Sarugorn, has been acting strangely of late. Frodette must bring the iron shard to Aglarond, where the King of the Glittering Caves will know what do… but beware, the Knight Riders of the Invisible Empire are hunting for it!\nPersonally, the only movie review in which I am genuinely interested in is Mr. John C. Wright’s. Those who have read\nTranshuman and Subhuman: Essays on Science Fiction and Awful Truth\nwill understand why.",
  "tags": [
    "movies",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-23T09:52:00+00:00"
}