{
  "url": "https://voxday.net/2015/12/25/sjws-disemploying-people/",
  "scraped_at": "2025-12-17T17:39:02.797221",
  "title": "SJWs disemploying people",
  "date_display": "December 25, 2015",
  "date_iso": "2015-12-25T22:17:00+00:00",
  "date_from_url": "2015-12-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Those who whine and cry about my responding to SJWs who place fake attack reviews on Amazon, among other things, like to pretend that I engage in unprovoked offensive tactics rather than in defensive deterrents.</p><p>But as we know, SJWs always lie. Consider <a href=\"https://twitter.com/margaretcho/status/680062270106243072\">this recent tweet</a> of SJW Margaret Cho:</p><blockquote class=\"tr_bq\"><p> Margaret Cho @margeretcho <br> http://racistsgettingfired.tumblr.com  is a great resource on what to do with racists on here.</br></p></blockquote><p>The site, RacistsGettingFired, even maintains a list of people who have lost their jobs as a result of their actions, such as <a href=\"http://racistsgettingfired.tumblr.com/tagged/GOTTEN\">this woman</a>.</p><p>SJWs always cry out in pain as they strike you. And the main reason they fear me now is because I pay no attention whatsoever to their cries of innocence and self-justification and being off-limits despite their aggressive tactics. They know, beyond any shadow of a doubt, that they cannot take a shot at me, my allies, my friends, or my supporters without taking a hit or three in return. Because we are disciplined, because we tell the truth, and because we only <i>respond </i>to their attacks by utilizing tactics <i>they have themselves introduced</i>, we are beating them at the moral level of cultural war.</p><p>It’s very simple. They act, I observe, I decide on the reprisal, and the VFM go into action. I know a lot of the VFM are feeling restless and underutilized, but the fact is that of the six successful actions in which they have engaged over the last two months, I have only required the participation of about eight percent of them. The goal is to achieve the objective, not to make a noise. When the objective is to make a noise, trust me, I’ll let you know.</p><p>The fact is that SJWs are out to disqualify, discredit, and disemploy everyone who does not share their dedication to social justice ideals. Everyone. Liberals. Insufficiently dedicated leftists. Conservatives. Cuckservatives. Cross them, even inadvertently, and <a href=\"http://www.powerlineblog.com/archives/2015/12/of-a-creepy-council-member-cano.php\">they will attempt to destroy you</a>, your career, and your family.</p><blockquote class=\"tr_bq\"><p> A Minneapolis City Council member is drawing criticism for what some see as an effort to publicly shame constituents who objected to her involvement in Wednesday’s Black Lives Matter rally at the Mall of America and the airport. Council Member Alondra Cano, who represents the Ninth Ward, has been accused of “doxing” — posting personal information about people who criticized her for supporting the Black Lives Matter events — on Twitter.</p></blockquote><p>Those protests shut down movement in and out of the Megamall and also interfered with airport traffic; she’s a City Councilwoman and she’s doxxing those who take the controversial position of preferring the international airport and the state’s largest retail outlet remain open for business.</p><p>That is the reality. So, the only question is, are you going to submit or are you going to resist?</p></div>",
  "content_text": "Those who whine and cry about my responding to SJWs who place fake attack reviews on Amazon, among other things, like to pretend that I engage in unprovoked offensive tactics rather than in defensive deterrents.\nBut as we know, SJWs always lie. Consider\nthis recent tweet\nof SJW Margaret Cho:\nMargaret Cho @margeretcho\nhttp://racistsgettingfired.tumblr.com  is a great resource on what to do with racists on here.\nThe site, RacistsGettingFired, even maintains a list of people who have lost their jobs as a result of their actions, such as\nthis woman\n.\nSJWs always cry out in pain as they strike you. And the main reason they fear me now is because I pay no attention whatsoever to their cries of innocence and self-justification and being off-limits despite their aggressive tactics. They know, beyond any shadow of a doubt, that they cannot take a shot at me, my allies, my friends, or my supporters without taking a hit or three in return. Because we are disciplined, because we tell the truth, and because we only\nrespond\nto their attacks by utilizing tactics\nthey have themselves introduced\n, we are beating them at the moral level of cultural war.\nIt’s very simple. They act, I observe, I decide on the reprisal, and the VFM go into action. I know a lot of the VFM are feeling restless and underutilized, but the fact is that of the six successful actions in which they have engaged over the last two months, I have only required the participation of about eight percent of them. The goal is to achieve the objective, not to make a noise. When the objective is to make a noise, trust me, I’ll let you know.\nThe fact is that SJWs are out to disqualify, discredit, and disemploy everyone who does not share their dedication to social justice ideals. Everyone. Liberals. Insufficiently dedicated leftists. Conservatives. Cuckservatives. Cross them, even inadvertently, and\nthey will attempt to destroy you\n, your career, and your family.\nA Minneapolis City Council member is drawing criticism for what some see as an effort to publicly shame constituents who objected to her involvement in Wednesday’s Black Lives Matter rally at the Mall of America and the airport. Council Member Alondra Cano, who represents the Ninth Ward, has been accused of “doxing” — posting personal information about people who criticized her for supporting the Black Lives Matter events — on Twitter.\nThose protests shut down movement in and out of the Megamall and also interfered with airport traffic; she’s a City Councilwoman and she’s doxxing those who take the controversial position of preferring the international airport and the state’s largest retail outlet remain open for business.\nThat is the reality. So, the only question is, are you going to submit or are you going to resist?",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-25T22:17:00+00:00"
}