{
  "url": "https://voxday.net/2015/12/17/so-brave-2/",
  "scraped_at": "2025-12-17T17:38:04.073471",
  "title": "So brave",
  "date_display": "December 17, 2015",
  "date_iso": "2015-12-17T14:30:00+00:00",
  "date_from_url": "2015-12-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And so very <i>clever</i>. John Scalzi reveals the secret to his mastery of online debate:</p><blockquote class=\"tr_bq\"><p> John Scalzi ‏@scalzi <br> I like to mute a troller, troll them back a few times, and let ’em know they’ve been muted the whole time so I didn’t see responses. PERFECT</br></p><p>Dave Pelna ‏@DavePelna<br> How courageous of you.</br></p><p>John Scalzi ‏@scalzi<br> This would be a devastating comment if I cared what you think. But I don’t! So.</br></p></blockquote><p>The thing is, it <i>is </i>a devastating comment because McRapey cares what <i>everybody </i>thinks. That’s why he has to hide from all the critical responses. If he didn’t care, he wouldn’t block them, mute them, or respond snarkily to them in the first place.</p><p>Remember, the Gamma male always has to win <i>in his own mind</i>. He can’t bear to admit failure or defeat to himself. This is why he never learns to stop making the same mistakes over and over again. And no matter what the outcome is, he will always find a way to somehow declare it to be a victory of some kind and thereby justify his course of action.</p><p>That’s why it is so important to be able to acknowledge that you got your ass kicked, or that you were wrong, or that you were bested by someone better. If you don’t, you will never learn to improve your game. And more importantly, you will never learn the self-respect that comes from the certain knowledge that you are one of those men who is always able to pick himself up, dust himself off, and return to the fray without fear.</p><p>UPDATE: Futhere evidence of McRapey’s fearless indifference to others:</p><blockquote class=\"tr_bq\"><p> John Scalzi ‏@scalzi<br> Honestly if all comment sections on the Internet disappeared tomorrow our world would be a vastly better place.</br></p></blockquote><p>Isn’t it awful that people are allowed to <i>talk back</i> at him? And in <i>public</i>, no less!</p></div>",
  "content_text": "And so very\nclever\n. John Scalzi reveals the secret to his mastery of online debate:\nJohn Scalzi ‏@scalzi\nI like to mute a troller, troll them back a few times, and let ’em know they’ve been muted the whole time so I didn’t see responses. PERFECT\nDave Pelna ‏@DavePelna\nHow courageous of you.\nJohn Scalzi ‏@scalzi\nThis would be a devastating comment if I cared what you think. But I don’t! So.\nThe thing is, it\nis\na devastating comment because McRapey cares what\neverybody\nthinks. That’s why he has to hide from all the critical responses. If he didn’t care, he wouldn’t block them, mute them, or respond snarkily to them in the first place.\nRemember, the Gamma male always has to win\nin his own mind\n. He can’t bear to admit failure or defeat to himself. This is why he never learns to stop making the same mistakes over and over again. And no matter what the outcome is, he will always find a way to somehow declare it to be a victory of some kind and thereby justify his course of action.\nThat’s why it is so important to be able to acknowledge that you got your ass kicked, or that you were wrong, or that you were bested by someone better. If you don’t, you will never learn to improve your game. And more importantly, you will never learn the self-respect that comes from the certain knowledge that you are one of those men who is always able to pick himself up, dust himself off, and return to the fray without fear.\nUPDATE: Futhere evidence of McRapey’s fearless indifference to others:\nJohn Scalzi ‏@scalzi\nHonestly if all comment sections on the Internet disappeared tomorrow our world would be a vastly better place.\nIsn’t it awful that people are allowed to\ntalk back\nat him? And in\npublic\n, no less!",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-17T14:30:00+00:00"
}