{
  "url": "https://voxday.net/2015/12/03/so-where-is-third-shooter/",
  "scraped_at": "2025-12-17T17:36:12.404666",
  "title": "So where is the third shooter?",
  "date_display": "December 3, 2015",
  "date_iso": "2015-12-03T09:35:00+00:00",
  "date_from_url": "2015-12-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>All the early reports talked about three shooters, the police scanner discussed one suspect being detained, and the two killed in the SUV have been identified as <a href=\"http://www.telegraph.co.uk/news/worldnews/northamerica/usa/12030481/Syed-Farook-what-we-know-about-the-San-Bernardino-gunman.html\">Syed Farook and Tashfeen Malik</a>. But there has been nothing more about the reports of the 28 year-old Qatari named “Tayyeep Bin Ardogan” who was also identified as a shooter, although the name seems more than a little dubious as it is very similar to the name of the Turkish prime minister and Ardogan/Erdogan sounds Turkish, not Qatari. And yet, it appears the age is right.</p><blockquote class=\"tr_bq\"><p> A man who identified himself as Farook’s father told The New York Daily News his son worked as a health technician inspecting restaurants and hotels.</p><p>“I haven’t heard anything. He worked in a county office,” he said. “He’s married and has a kid. We’re estranged because my wife got the divorce, and they are together. She doesn’t want to see me.”</p><p>He added that he had not seen his son for some time.</p><p>“He was very religious. He would go to work, come back, go to pray, come back. He’s Muslim.”</p><p>Farook’s name first emerged after the two masked shooters opened fire at the party. Over a radio transmission, an officer could be heard telling a dispatcher that Farook was “acting nervous” and had walked out of the party 20 minutes before the shooting began. Other reports suggested he had been asked to leave.</p><p>The attackers were armed with handguns and rifles, and were dressed in camouflage clothing.</p><p>Meredith Davis, a spokeswoman for the Bureau of Alcohol Tobacco and Firearms, told NBC News: “With my experience with other mass shootings, there are indicators that this was well planned out.</p><p>“It was to be violent in nature. They were in tactical gear, I don’t know if they had ballistic protection… And had several several magazines full of ammunition fashioned to their bodies. So they were ready for a gunfight should that occur.”</p><p>There is currently scant detail about Tashfeen Malik, the second shooter, but San Bernardino police chief Jarrod Burguan said she was 27 years old.</p><p>Mr Burguan said: “We’re pretty comfortable that the two shooters that went into the building are the two shooters deceased on San Bernardino Avenue.”</p><p>“The first one is Syed, Rizwan, last name Farook. He is 28 years old. I am told that he is US-born. The person that was with him is a female. Her name is Tashfeen, last name Malik. She is 27 years old.”</p><p>Malik and Farook were husband and wife, according to the Los Angeles Times newspaper, while the police would only say they were “in a relationship”.</p><p>However, Farook’s colleagues at the Inland Regional Centre – where 14 people were shot dead and another 17 were wounded – told the LA Times that he had gone to Saudi Arabia and returned with a new wife, whom he had met online. An unnamed family member identified the wife as Malik.</p></blockquote><p>One can’t help but notice there is a Saudi connection again. In any event, I’m sure we can all agree that Anthropogenic Global Warming/Climate Change is to blame and we all have a responsibility to ensure the Senate passes the Paris accords.</p></div>",
  "content_text": "All the early reports talked about three shooters, the police scanner discussed one suspect being detained, and the two killed in the SUV have been identified as\nSyed Farook and Tashfeen Malik\n. But there has been nothing more about the reports of the 28 year-old Qatari named “Tayyeep Bin Ardogan” who was also identified as a shooter, although the name seems more than a little dubious as it is very similar to the name of the Turkish prime minister and Ardogan/Erdogan sounds Turkish, not Qatari. And yet, it appears the age is right.\nA man who identified himself as Farook’s father told The New York Daily News his son worked as a health technician inspecting restaurants and hotels.\n“I haven’t heard anything. He worked in a county office,” he said. “He’s married and has a kid. We’re estranged because my wife got the divorce, and they are together. She doesn’t want to see me.”\nHe added that he had not seen his son for some time.\n“He was very religious. He would go to work, come back, go to pray, come back. He’s Muslim.”\nFarook’s name first emerged after the two masked shooters opened fire at the party. Over a radio transmission, an officer could be heard telling a dispatcher that Farook was “acting nervous” and had walked out of the party 20 minutes before the shooting began. Other reports suggested he had been asked to leave.\nThe attackers were armed with handguns and rifles, and were dressed in camouflage clothing.\nMeredith Davis, a spokeswoman for the Bureau of Alcohol Tobacco and Firearms, told NBC News: “With my experience with other mass shootings, there are indicators that this was well planned out.\n“It was to be violent in nature. They were in tactical gear, I don’t know if they had ballistic protection… And had several several magazines full of ammunition fashioned to their bodies. So they were ready for a gunfight should that occur.”\nThere is currently scant detail about Tashfeen Malik, the second shooter, but San Bernardino police chief Jarrod Burguan said she was 27 years old.\nMr Burguan said: “We’re pretty comfortable that the two shooters that went into the building are the two shooters deceased on San Bernardino Avenue.”\n“The first one is Syed, Rizwan, last name Farook. He is 28 years old. I am told that he is US-born. The person that was with him is a female. Her name is Tashfeen, last name Malik. She is 27 years old.”\nMalik and Farook were husband and wife, according to the Los Angeles Times newspaper, while the police would only say they were “in a relationship”.\nHowever, Farook’s colleagues at the Inland Regional Centre – where 14 people were shot dead and another 17 were wounded – told the LA Times that he had gone to Saudi Arabia and returned with a new wife, whom he had met online. An unnamed family member identified the wife as Malik.\nOne can’t help but notice there is a Saudi connection again. In any event, I’m sure we can all agree that Anthropogenic Global Warming/Climate Change is to blame and we all have a responsibility to ensure the Senate passes the Paris accords.",
  "tags": [
    "Vibrancy is our strength",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-03T09:35:00+00:00"
}