{
  "url": "https://voxday.net/2015/12/21/sociosexuality-and-candidates/",
  "scraped_at": "2025-12-17T17:38:37.625924",
  "title": "Sociosexuality and the candidates",
  "date_display": "December 21, 2015",
  "date_iso": "2015-12-21T23:30:00+00:00",
  "date_from_url": "2015-12-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Over at Alpha Game, a reader has analyzed all of the candidates <a href=\"http://alphagameplan.blogspot.ch/2015/12/alpha-mail-sociosexuality-and-candidates.html\">in terms of sociosexual rank</a>:<b> </b></p><blockquote class=\"tr_bq\"><p> <b>Donald Trump: Alpha.</b> His mug is featured on the dictionary<br> definition of the term. And whenever the media (or Jeb) try to make him<br> out as whiny or petulant, video footage of the events in question<br> invariably show him remaining calm and cool, every single time.</br></br></br></p><p><b>Ted Cruz: Beta, with a bit of Sigma.</b><br> Seems to be instinctively serving as a lieutenant to Trump in some<br> aspects, by cornering certain voters who won’t warm up to Trump, such as<br> the evangelicals. Has a Sigma streak with his willingness to offend the<br> Democrats and cuckservatives running the Senate, and which seems to<br> have inoculated him against being an Establishment sellout, or at least<br> less than Rubio or Rand Paul. Indeed, he seems to be rising above the<br> less-“offensive” Rubio and Paul, despite Rubio’s backers having spent<br> far more money than Cruz’s.</br></br></br></br></br></br></br></br></p></blockquote><p>It will be interesting to see if there is much in the way of predictive value here. Read the rest <a href=\"http://alphagameplan.blogspot.ch/2015/12/alpha-mail-sociosexuality-and-candidates.html\">there</a>.</p></div>",
  "content_text": "Over at Alpha Game, a reader has analyzed all of the candidates\nin terms of sociosexual rank\n:\nDonald Trump: Alpha.\nHis mug is featured on the dictionary\ndefinition of the term. And whenever the media (or Jeb) try to make him\nout as whiny or petulant, video footage of the events in question\ninvariably show him remaining calm and cool, every single time.\nTed Cruz: Beta, with a bit of Sigma.\nSeems to be instinctively serving as a lieutenant to Trump in some\naspects, by cornering certain voters who won’t warm up to Trump, such as\nthe evangelicals. Has a Sigma streak with his willingness to offend the\nDemocrats and cuckservatives running the Senate, and which seems to\nhave inoculated him against being an Establishment sellout, or at least\nless than Rubio or Rand Paul. Indeed, he seems to be rising above the\nless-“offensive” Rubio and Paul, despite Rubio’s backers having spent\nfar more money than Cruz’s.\nIt will be interesting to see if there is much in the way of predictive value here. Read the rest\nthere\n.",
  "tags": [
    "Alpha Game"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-21T23:30:00+00:00"
}