{
  "url": "https://voxday.net/2015/12/05/star-wars-justice-convergence/",
  "scraped_at": "2025-12-17T17:36:34.191171",
  "title": "Star Wars justice convergence",
  "date_display": "December 5, 2015",
  "date_iso": "2015-12-05T20:30:00+00:00",
  "date_from_url": "2015-12-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The LucasFilm president explains <a href=\"https://jeffro.wordpress.com/2015/12/05/lucasfilm-president-kathleen-kennedys-explains-her-entryist-strategy/\">her vision for Star Wars</a>:</p><blockquote class=\"tr_bq\"><p> They are really, really making a huge effort across the company to put more focus around casting women and putting women in positions of responsibility, with directing and various other positions inside, different lines of business in the company. It’s not just about casting female protagonists. It’s gotta be across the board throughout the industry.</p><p>I think Hasbro, who’s making toys for a while, they were perhaps a little reluctant to move too quickly with something that’s been such a successful boys line. I think they’re recognizing that selling to girls is just as effective as selling to boys. More and more the lines are being blurred as to deciding ahead of time that some things are for boys and some things are for girls. I think that’s a big part of the conversation. It’s all of these areas that are contributing to change really happening.</p><p>Over the last several years that I’ve been in the business it seems to me that this has been a topic of conversation every few years. Then everybody thinks it’s a trend or that it’s a significant change. And then it doesn’t really move the needle. I think that’s — hopefully— what’s going to begin to happen now. It’s going to be real change. And not just perceived change.</p></blockquote><p>Among those “real changes” are going to be declining sales, frantic PR spin to explain away the declining sales, and eventually some bitter diatribes about how the market is not worthy of their brilliant, progressive, and socially just products.</p><p>It’s at times like these that I am very, very happy that I was able to convince myself that Star Wars ended with <i>The Empire Strikes Back</i>. (I put <i>Return of the Jedi</i> in the same category as <i>The Star Wars Christmas Special</i>, which I also saw and was rather confused by, what with the Wookies living in trees and all. In retrospect, that should have been our first sign that George Lucas just go lucky, he didn’t actually know what he was doing.) I did give the <i>Phantom Menace</i> a go on opening night; I remember how we all felt almost as if we’d gone back in time, we were so excited that the future we’d imagined when we were kids was actually upon us!</p><p>And then, after about five minutes, we all realized that our imaginations were now rather preferable to George Lucas’s. I walked out of there and never again gave any subsequent Star Wars-named product another thought.</p><p>Anyhow, as Jeffro observes, this is classic SJW entryism at work. They’re essentially cargo cultists, they have no understanding of what made Star Wars valuable in the first place, and so they will further destroy what has already gone far, far past tragedy and is now well into self-parody.</p></div>",
  "content_text": "The LucasFilm president explains\nher vision for Star Wars\n:\nThey are really, really making a huge effort across the company to put more focus around casting women and putting women in positions of responsibility, with directing and various other positions inside, different lines of business in the company. It’s not just about casting female protagonists. It’s gotta be across the board throughout the industry.\nI think Hasbro, who’s making toys for a while, they were perhaps a little reluctant to move too quickly with something that’s been such a successful boys line. I think they’re recognizing that selling to girls is just as effective as selling to boys. More and more the lines are being blurred as to deciding ahead of time that some things are for boys and some things are for girls. I think that’s a big part of the conversation. It’s all of these areas that are contributing to change really happening.\nOver the last several years that I’ve been in the business it seems to me that this has been a topic of conversation every few years. Then everybody thinks it’s a trend or that it’s a significant change. And then it doesn’t really move the needle. I think that’s — hopefully— what’s going to begin to happen now. It’s going to be real change. And not just perceived change.\nAmong those “real changes” are going to be declining sales, frantic PR spin to explain away the declining sales, and eventually some bitter diatribes about how the market is not worthy of their brilliant, progressive, and socially just products.\nIt’s at times like these that I am very, very happy that I was able to convince myself that Star Wars ended with\nThe Empire Strikes Back\n. (I put\nReturn of the Jedi\nin the same category as\nThe Star Wars Christmas Special\n, which I also saw and was rather confused by, what with the Wookies living in trees and all. In retrospect, that should have been our first sign that George Lucas just go lucky, he didn’t actually know what he was doing.) I did give the\nPhantom Menace\na go on opening night; I remember how we all felt almost as if we’d gone back in time, we were so excited that the future we’d imagined when we were kids was actually upon us!\nAnd then, after about five minutes, we all realized that our imaginations were now rather preferable to George Lucas’s. I walked out of there and never again gave any subsequent Star Wars-named product another thought.\nAnyhow, as Jeffro observes, this is classic SJW entryism at work. They’re essentially cargo cultists, they have no understanding of what made Star Wars valuable in the first place, and so they will further destroy what has already gone far, far past tragedy and is now well into self-parody.",
  "tags": [
    "movies",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-05T20:30:00+00:00"
}