{
  "url": "https://voxday.net/2015/12/01/such-ingratitude/",
  "scraped_at": "2025-12-17T17:35:58.423949",
  "title": "Such ingratitude",
  "date_display": "December 1, 2015",
  "date_iso": "2015-12-01T09:14:00+00:00",
  "date_from_url": "2015-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here we hand the Hugo Award to Cixin Liu and <a href=\"http://www.globaltimes.cn/content/939761.shtml\">he is less grateful than Charles de Gaulle</a> after World War II.</p><blockquote class=\"tr_bq\"><p> GT: Some Chinese fans have said they want to band together to vote on the World Science Fiction website next year. What’s your opinion on this?</p><p>Liu: That’s the best way to destroy The Three-Body Trilogy. And not just this sci-fi work, but also the reputation of Chinese sci-fi fans. The entire number of voters for the Hugo Awards is only around 5,000. That means it is easily influenced by malicious voting. Organizing 2,000 people to each spend $14 is not hard, but I am strongly against such misbehavior. If that really does happen, I will follow the example of Marko Kloos, who withdrew from the shortlist after discovering the “Rabid Puppies” had asked voters to support him.</p><p>GT: Many fans believe that even if The Three-Body Problem had benefited from the “puppies,” it still was deserving of a Hugo Award. Do you agree?</p><p>Liu: Deserving is one thing, getting the award is another thing. Many votes went to The Three-Body Problem after Marko Kloos withdrew. That’s something I didn’t want to see. But The Three-Body Problem still would have had a chance to win by a slim margin of a few votes [without the “puppies”].</p><p>After the awards, some critics used this – the support right-wing organizations like the “puppies” gave The Three-Body Problem – as an excuse to criticize the win. That frustrated me. The “puppies” severely harmed the credibility of the Hugo Awards. I feel both happy and “unfortunate” to have won this year.</p></blockquote><p>You Rabid Puppies should all be ashamed of yourselves. Not only did you misbehave, but you “severely harmed the credibility of the Hugo Awards”. And here I simply thought the book was better than <i>Ancillary Tea Party with Pronouns</i>. In any event, it sounds to me as if we clearly have no choice but to join the Chinese fans in nominating <i>The Dark Forest</i>, which is the second book in The Three-Body Trilogy, and is even better than the first one.</p><p>However, this is the more interesting comment: “My American publisher estimates <i>The Three-Body Trilogy</i> will sell 20,000 copies.”</p><p>Now that’s interesting. In other words, <i>Gorilla Mindset</i> and <i>SJWAL </i>have already outsold the projected sales of the trilogy that has a good chance to collect three Hugo Best Novel awards. Castalia House may become the biggest publisher in science fiction and fantasy faster than we imagined.</p><p>In any event, Liu is smoking crack if he thinks <i>The Three-Body Problem </i>had any chance of winning without the support of the Puppies. He should follow John Scalzi’s lead and withdraw from consideration now if he doesn’t want to win without our help.</p></div>",
  "content_text": "Here we hand the Hugo Award to Cixin Liu and\nhe is less grateful than Charles de Gaulle\nafter World War II.\nGT: Some Chinese fans have said they want to band together to vote on the World Science Fiction website next year. What’s your opinion on this?\nLiu: That’s the best way to destroy The Three-Body Trilogy. And not just this sci-fi work, but also the reputation of Chinese sci-fi fans. The entire number of voters for the Hugo Awards is only around 5,000. That means it is easily influenced by malicious voting. Organizing 2,000 people to each spend $14 is not hard, but I am strongly against such misbehavior. If that really does happen, I will follow the example of Marko Kloos, who withdrew from the shortlist after discovering the “Rabid Puppies” had asked voters to support him.\nGT: Many fans believe that even if The Three-Body Problem had benefited from the “puppies,” it still was deserving of a Hugo Award. Do you agree?\nLiu: Deserving is one thing, getting the award is another thing. Many votes went to The Three-Body Problem after Marko Kloos withdrew. That’s something I didn’t want to see. But The Three-Body Problem still would have had a chance to win by a slim margin of a few votes [without the “puppies”].\nAfter the awards, some critics used this – the support right-wing organizations like the “puppies” gave The Three-Body Problem – as an excuse to criticize the win. That frustrated me. The “puppies” severely harmed the credibility of the Hugo Awards. I feel both happy and “unfortunate” to have won this year.\nYou Rabid Puppies should all be ashamed of yourselves. Not only did you misbehave, but you “severely harmed the credibility of the Hugo Awards”. And here I simply thought the book was better than\nAncillary Tea Party with Pronouns\n. In any event, it sounds to me as if we clearly have no choice but to join the Chinese fans in nominating\nThe Dark Forest\n, which is the second book in The Three-Body Trilogy, and is even better than the first one.\nHowever, this is the more interesting comment: “My American publisher estimates\nThe Three-Body Trilogy\nwill sell 20,000 copies.”\nNow that’s interesting. In other words,\nGorilla Mindset\nand\nSJWAL\nhave already outsold the projected sales of the trilogy that has a good chance to collect three Hugo Best Novel awards. Castalia House may become the biggest publisher in science fiction and fantasy faster than we imagined.\nIn any event, Liu is smoking crack if he thinks\nThe Three-Body Problem\nhad any chance of winning without the support of the Puppies. He should follow John Scalzi’s lead and withdraw from consideration now if he doesn’t want to win without our help.",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-01T09:14:00+00:00"
}