{
  "url": "https://voxday.net/2015/12/15/the-self-lobotomizing-of-sff/",
  "scraped_at": "2025-12-17T17:37:50.027835",
  "title": "The self-lobotomizing of SF/F",
  "date_display": "December 15, 2015",
  "date_iso": "2015-12-15T13:00:00+00:00",
  "date_from_url": "2015-12-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jeffro Johnson brings <a href=\"http://www.castaliahouse.com/appendix-n-matters\">his epic series on Chapter N to a close</a> with a sobering conclusion on the mental barriers being erected to separate entire generations of science fiction and fantasy readers from the genre’s history:</p><blockquote class=\"tr_bq\"><p> This estrangement between the generations… it isn’t normal. And it’s not just that people in the seventies would have read many of the same science fiction and fantasy authors that their parents and even grandparents did. The scope of things that fall within the black hole of the generation gap seems to be expanding almost exponentially now. Even things like Bugs Bunny and Tom &amp; Jerry– I would have watched the same stuff that my big brother watched when I was a kid… and we were familiar with the same classic cartoons that out parents and grandparents would have watched. But that’s changed now. And it goes beyond these things just sort of quitely dropping off the radar for the moment. Millennials that will admit to never seeing them still “know” somehow that these things were racist or something and deserve to be erased. It might seem silly, maybe, but that’s just the tip of the iceberg.</p><p>When it was announced that the World Fantasy Award was replacing its iconic Lovecraft bust, Joyce Carol Oates declared that the literary canon is “saturated with racism, sexism, anti-semitism, anti-democracy… and lunacy.” Graciously she allows that “tossing it all out is no solution.” But why wouldn’t you toss it out…? If it really was as bad as people say, you probably would do just that. I mean really, why would people read the works of such terrible people…? They don’t. And if by some chance they do, the reaction can be almost physical sometimes, as this woman describes it:</p><p><i>    I read a lot of Bradbury as a teen and thought his stories were wonderful. Rereading his stories now is actively painful to me. I’m a lot more able to pick up on those subtle cues, and less able to make excuses for them, that the author doesn’t really see his female characters as important, or real, or three dimensional, or people.</i></p><p>Are we really so advanced a civilization now that <i>The Martian Chronicles</i> necessarily should make us ill?</p><p>Older people steeped in the classics will dismiss that as an outlier, but it really is a sign of the times. This attitude certainly shows up in a great many of the reviews of old works of fantasy and science fiction that pepper the internet. It’s almost as if there is a barrier in these peoples’ minds. As soon as they get to something they been trained to think of as being “problematic”, they shut down. Very little in the way of any kind of analysis of the material can even be done, because calling out and reviling everything from Madonna/Whore complexes to “black and white morality” is the sort of thing that passes for deep or sophisticated thinking.</p><p>The retiring of Lovecraft’s bust from the World Fantasy Awards is therefore not so much reminiscent of statues of Stalin being pulled down in post-Soviet Russia. It’s more a reflection of the Berlin wall… <i>going up</i>.</p></blockquote><p>Social justice convergence destroys everything it touches and erases history because it can neither tolerate nor survive truth.</p></div>",
  "content_text": "Jeffro Johnson brings\nhis epic series on Chapter N to a close\nwith a sobering conclusion on the mental barriers being erected to separate entire generations of science fiction and fantasy readers from the genre’s history:\nThis estrangement between the generations… it isn’t normal. And it’s not just that people in the seventies would have read many of the same science fiction and fantasy authors that their parents and even grandparents did. The scope of things that fall within the black hole of the generation gap seems to be expanding almost exponentially now. Even things like Bugs Bunny and Tom & Jerry– I would have watched the same stuff that my big brother watched when I was a kid… and we were familiar with the same classic cartoons that out parents and grandparents would have watched. But that’s changed now. And it goes beyond these things just sort of quitely dropping off the radar for the moment. Millennials that will admit to never seeing them still “know” somehow that these things were racist or something and deserve to be erased. It might seem silly, maybe, but that’s just the tip of the iceberg.\nWhen it was announced that the World Fantasy Award was replacing its iconic Lovecraft bust, Joyce Carol Oates declared that the literary canon is “saturated with racism, sexism, anti-semitism, anti-democracy… and lunacy.” Graciously she allows that “tossing it all out is no solution.” But why wouldn’t you toss it out…? If it really was as bad as people say, you probably would do just that. I mean really, why would people read the works of such terrible people…? They don’t. And if by some chance they do, the reaction can be almost physical sometimes, as this woman describes it:\nI read a lot of Bradbury as a teen and thought his stories were wonderful. Rereading his stories now is actively painful to me. I’m a lot more able to pick up on those subtle cues, and less able to make excuses for them, that the author doesn’t really see his female characters as important, or real, or three dimensional, or people.\nAre we really so advanced a civilization now that\nThe Martian Chronicles\nnecessarily should make us ill?\nOlder people steeped in the classics will dismiss that as an outlier, but it really is a sign of the times. This attitude certainly shows up in a great many of the reviews of old works of fantasy and science fiction that pepper the internet. It’s almost as if there is a barrier in these peoples’ minds. As soon as they get to something they been trained to think of as being “problematic”, they shut down. Very little in the way of any kind of analysis of the material can even be done, because calling out and reviling everything from Madonna/Whore complexes to “black and white morality” is the sort of thing that passes for deep or sophisticated thinking.\nThe retiring of Lovecraft’s bust from the World Fantasy Awards is therefore not so much reminiscent of statues of Stalin being pulled down in post-Soviet Russia. It’s more a reflection of the Berlin wall…\ngoing up\n.\nSocial justice convergence destroys everything it touches and erases history because it can neither tolerate nor survive truth.",
  "tags": [
    "Pink SF",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-15T13:00:00+00:00"
}