{
  "url": "https://voxday.net/2015/12/26/the-disassociate-game/",
  "scraped_at": "2025-12-17T17:39:06.593681",
  "title": "The Disassociate game",
  "date_display": "December 26, 2015",
  "date_iso": "2015-12-26T12:49:00+00:00",
  "date_from_url": "2015-12-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This illustrates why you should never, ever, pay any attention to whatever concerns a moderate brings to your attention, whether he is of the ideological, political, or religious variety. At the same time one concerned Christian was urging me to disassociate from Greg Johnson, Dalrock was being urged <a href=\"https://dalrock.wordpress.com/2015/12/24/merry-christmas-3/#comment-197523\">to disassociate himself from me</a>:</p><blockquote class=\"tr_bq\"><p> Dalrock,</p><p>I have always wondered why you associate yourself with Vox Day. His brand of “Christianity” seems far from yours. You always seem bring the same message of God’s Truth and Justice tempered by His Mercy that we hear in the Gospels, Epistles and the writings of the Church Fathers. Vox seems to forget the Mercy part, fly through the Truth part, and screech headfirst into the Justice part. Every single time. That, and his ardent support for Norwegian mass-murderer Anders Breivik, make me wonder why you continue to link to him and his writings?</p><p>Have a blessed Christmas.</p><p>Jim Oglethorpe</p></blockquote><p>Moderates of the Christian variety love to play Christian Police of some sort or another. Sometimes it is Sin Police, sometimes it is Theology Police, sometimes it is Appearance Police. Regardless, their primary concern is looking inoffensive to the world and virtue-signaling their church associates. Any overlap with Christian theology and teachings is mostly coincidental.</p><p>And, of course, any failure to take their “obviously important” concerns seriously immediately results in a tantrum. HS has already sent <strike>two </strike>three more emails today:<i> </i></p><blockquote class=\"tr_bq\"><p> <i>No adult reply. No doubt you’re busy.  But…why would I try to fool the<br> unfoolable? Though it is always somewhat gratifying to see an<br> expectation fulfilled.</br></br></i></p><p>Oh, hey, the little Gamma keeps seeking attention. I’m shocked.</p><p><i>I have to admit, I am surprised at what a child you really are.</i></p><p>And here I’m not even the least bit surprised to see that you are a petty name-calling Gamma. Give it up, HS. You’re not the Christ Police.</p><p><i>Sorry Junior, I don’t play video games. Your juvenile name-calling (gamma?) is lost on me. But don’t bother informing me. It’s pathetic. All I need to know. I can see that I’ve gotten under your thin skin. But given that you’re laughably immature, I feel I’m engaging a 16 year old in this back and forth. And it’s gotten to be embarrassing. Take the last word Junior. You know, like an obnoxious child demands.</i></p><p>Why are you still emailing me? Is this some sort of Gamma fangirl thing? Run along now. </p></blockquote><p>No doubt the non-Christians of the world are awed by these tremendous testimonials for the faith. I would simply encourage them to keep in mind that it is a fundamental logical error to judge the verity of the ism by the idiosyncratic behavior of the individual ist. For many years, that was a real stumbling block for me.</p><p>This has nothing to do with HS being a Christian, and everything to do with him being a Gamma.</p></div>",
  "content_text": "This illustrates why you should never, ever, pay any attention to whatever concerns a moderate brings to your attention, whether he is of the ideological, political, or religious variety. At the same time one concerned Christian was urging me to disassociate from Greg Johnson, Dalrock was being urged\nto disassociate himself from me\n:\nDalrock,\nI have always wondered why you associate yourself with Vox Day. His brand of “Christianity” seems far from yours. You always seem bring the same message of God’s Truth and Justice tempered by His Mercy that we hear in the Gospels, Epistles and the writings of the Church Fathers. Vox seems to forget the Mercy part, fly through the Truth part, and screech headfirst into the Justice part. Every single time. That, and his ardent support for Norwegian mass-murderer Anders Breivik, make me wonder why you continue to link to him and his writings?\nHave a blessed Christmas.\nJim Oglethorpe\nModerates of the Christian variety love to play Christian Police of some sort or another. Sometimes it is Sin Police, sometimes it is Theology Police, sometimes it is Appearance Police. Regardless, their primary concern is looking inoffensive to the world and virtue-signaling their church associates. Any overlap with Christian theology and teachings is mostly coincidental.\nAnd, of course, any failure to take their “obviously important” concerns seriously immediately results in a tantrum. HS has already sent\ntwo\nthree more emails today:\nNo adult reply. No doubt you’re busy.  But…why would I try to fool the\nunfoolable? Though it is always somewhat gratifying to see an\nexpectation fulfilled.\nOh, hey, the little Gamma keeps seeking attention. I’m shocked.\nI have to admit, I am surprised at what a child you really are.\nAnd here I’m not even the least bit surprised to see that you are a petty name-calling Gamma. Give it up, HS. You’re not the Christ Police.\nSorry Junior, I don’t play video games. Your juvenile name-calling (gamma?) is lost on me. But don’t bother informing me. It’s pathetic. All I need to know. I can see that I’ve gotten under your thin skin. But given that you’re laughably immature, I feel I’m engaging a 16 year old in this back and forth. And it’s gotten to be embarrassing. Take the last word Junior. You know, like an obnoxious child demands.\nWhy are you still emailing me? Is this some sort of Gamma fangirl thing? Run along now.\nNo doubt the non-Christians of the world are awed by these tremendous testimonials for the faith. I would simply encourage them to keep in mind that it is a fundamental logical error to judge the verity of the ism by the idiosyncratic behavior of the individual ist. For many years, that was a real stumbling block for me.\nThis has nothing to do with HS being a Christian, and everything to do with him being a Gamma.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-26T12:49:00+00:00"
}