{
  "url": "https://voxday.net/2015/12/23/the-true-lesson-of-star-wars/",
  "scraped_at": "2025-12-17T17:38:52.822283",
  "title": "The true lesson of Star Wars",
  "date_display": "December 23, 2015",
  "date_iso": "2015-12-23T19:30:00+00:00",
  "date_from_url": "2015-12-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Markku helpfully summarizes the Star Wars Saga:</p><blockquote class=\"tr_bq\"><p> The plot so far:<br> -Empire builds a Death Star<br> -Empire builds a bigger Death Star<br> And now… Wait for it…<br> -Empire builds EVEN bigger Death Star</br></br></br></br></p><p>And<br> the movie knows how silly this is. When the rebels hear, they basically<br> go “Oh come on, not this shit again? *sigh* Ooooh-kay. Where’s the<br> shield generators? There. Where’s the weak spot? There. Ok, guys, let’s<br> go blow this up.</br></br></br></br></p><p>Now, it’s really nice that the movie is<br> forthright about how much the central plot element sucks, but I wonder<br> if the alternative occurred to anyone, to make it NOT suck and not have<br> to apologize for it.</br></br></br></p><p>That’s the real weakness of the movie.</p></blockquote><p>The third one burned down, fell over, then sank into the swamp. But the fourth one will stay up! And that’s the true lesson of Star Wars, kids, just keep building bigger and better Death Stars until one finally survives the arduous construction and beta testing process and you rule the galaxy.</p></div>",
  "content_text": "Markku helpfully summarizes the Star Wars Saga:\nThe plot so far:\n-Empire builds a Death Star\n-Empire builds a bigger Death Star\nAnd now… Wait for it…\n-Empire builds EVEN bigger Death Star\nAnd\nthe movie knows how silly this is. When the rebels hear, they basically\ngo “Oh come on, not this shit again? *sigh* Ooooh-kay. Where’s the\nshield generators? There. Where’s the weak spot? There. Ok, guys, let’s\ngo blow this up.\nNow, it’s really nice that the movie is\nforthright about how much the central plot element sucks, but I wonder\nif the alternative occurred to anyone, to make it NOT suck and not have\nto apologize for it.\nThat’s the real weakness of the movie.\nThe third one burned down, fell over, then sank into the swamp. But the fourth one will stay up! And that’s the true lesson of Star Wars, kids, just keep building bigger and better Death Stars until one finally survives the arduous construction and beta testing process and you rule the galaxy.",
  "tags": [
    "movies"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-23T19:30:00+00:00"
}