{
  "url": "https://voxday.net/2015/12/02/the-us-is-supporting-isis/",
  "scraped_at": "2025-12-17T17:36:07.620629",
  "title": "The US is supporting ISIS",
  "date_display": "December 2, 2015",
  "date_iso": "2015-12-02T13:00:00+00:00",
  "date_from_url": "2015-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The document trail, the lame explanations, the reports of CIA involvement, the behavior of allies, the declassified documents, and the eyewitness evidence in Iraq all <a href=\"https://www.washingtonpost.com/world/middle_east/iraqis-think-the-us-is-in-cahoots-with-isis-and-it-is-hurting-the-war/2015/12/01/d00968ec-9243-11e5-befa-99ceebcbb272_story.html\">tell the same story</a>:</p><blockquote class=\"tr_bq\"><p> On the front lines of the battle against the Islamic State, suspicion of the United States runs deep. Iraqi fighters say they have all seen the videos purportedly showing U.S. helicopters airdropping weapons to the militants, and many claim they have friends and relatives who have witnessed similar instances of collusion.</p><p>Ordinary people also have seen the videos, heard the stories and reached the same conclusion — one that might seem absurd to Americans but is widely believed among Iraqis — that the United States is supporting the Islamic State for a variety of pernicious reasons that have to do with asserting U.S. control over Iraq, the wider Middle East and, perhaps, its oil.</p><p>“It is not in doubt,” said Mustafa Saadi, who says his friend saw U.S. helicopters delivering bottled water to Islamic State positions. He is a commander in one of the Shiite militias that last month helped push the militants out of the oil refinery near Baiji in northern Iraq alongside the Iraqi army.</p><p>The Islamic State is “almost finished,” he said. “They are weak. If only America would stop supporting them, we could defeat them in days.”</p></blockquote><p>While U.S. military officials “say the charges are too far-fetched to merit a response”, what is much more far-fetched is the idea that they cannot bomb the Islamic State’s oil facilities for fear of endangering the Desert Snail Darter or <a href=\"http://www.zerohedge.com/news/2015-11-29/former-cia-deputy-director-gives-stunning-reason-why-obama-has-not-attacked-isis-oil\">whatever their lame excuses are</a>.</p><p>The US outrage over Russia’s intervention in Syria, as well as the Turkish ambush of the Russian plane, are clearly indicative of the fact that the Obama administration is allied with ISIS and wants it to succeed in taking out Assad. After all, we know US forces are not welcome there by either the Syrian government or <a href=\"http://www.zerohedge.com/news/2015-12-01/iraqi-pm-rejects-us-boots-ground-shiite-militias-pledge-kill-us-soldiers\">the Iraqi government</a>.</p><p>Before you dismiss the idea that the US is actually pro-ISIS out of hand, keep in mind that the US government also bombed the Serbs in order to keep them from defeating the Muslims in Bosnia. Or, you know, <a href=\"http://levantreport.com/2015/05/19/2012-defense-intelligence-agency-document-west-will-facilitate-rise-of-islamic-state-in-order-to-isolate-the-syrian-regime/\">read the relevant Defense Intelligence Agency document</a>.</p><blockquote class=\"tr_bq\"><p> “THE WEST, GULF COUNTRIES, AND TURKEY [WHO] SUPPORT THE [SYRIAN] OPPOSITION… THERE IS THE POSSIBILITY OF ESTABLISHING A DECLARED OR UNDECLARED SALAFIST PRINCIPALITY IN EASTERN SYRIA (HASAKA AND DER ZOR), AND THIS IS EXACTLY WHAT THE SUPPORTING POWERS TO THE OPPOSITION WANT, IN ORDER TO ISOLATE THE SYRIAN REGIME…”.</p><p>The DIA report, formerly classified “SECRET//NOFORN” and dated August 12, 2012, was circulated widely among various government agencies, including CENTCOM, the CIA, FBI, DHS, NGA, State Dept., and many others.</p><p>The document shows that as early as 2012, U.S. intelligence predicted the rise of the Islamic State in Iraq and the Levant (ISIL or ISIS), but instead of clearly delineating the group as an enemy, the report envisions the terror group as a U.S. strategic asset.</p></blockquote><p>Considering that the mujahideen in Afghanistan were originally envisioned and armed as a U.S. strategic asset against the Soviet Union, it should not be terribly surprising to learn that the Islamic State is a similar arrangement.</p></div>",
  "content_text": "The document trail, the lame explanations, the reports of CIA involvement, the behavior of allies, the declassified documents, and the eyewitness evidence in Iraq all\ntell the same story\n:\nOn the front lines of the battle against the Islamic State, suspicion of the United States runs deep. Iraqi fighters say they have all seen the videos purportedly showing U.S. helicopters airdropping weapons to the militants, and many claim they have friends and relatives who have witnessed similar instances of collusion.\nOrdinary people also have seen the videos, heard the stories and reached the same conclusion — one that might seem absurd to Americans but is widely believed among Iraqis — that the United States is supporting the Islamic State for a variety of pernicious reasons that have to do with asserting U.S. control over Iraq, the wider Middle East and, perhaps, its oil.\n“It is not in doubt,” said Mustafa Saadi, who says his friend saw U.S. helicopters delivering bottled water to Islamic State positions. He is a commander in one of the Shiite militias that last month helped push the militants out of the oil refinery near Baiji in northern Iraq alongside the Iraqi army.\nThe Islamic State is “almost finished,” he said. “They are weak. If only America would stop supporting them, we could defeat them in days.”\nWhile U.S. military officials “say the charges are too far-fetched to merit a response”, what is much more far-fetched is the idea that they cannot bomb the Islamic State’s oil facilities for fear of endangering the Desert Snail Darter or\nwhatever their lame excuses are\n.\nThe US outrage over Russia’s intervention in Syria, as well as the Turkish ambush of the Russian plane, are clearly indicative of the fact that the Obama administration is allied with ISIS and wants it to succeed in taking out Assad. After all, we know US forces are not welcome there by either the Syrian government or\nthe Iraqi government\n.\nBefore you dismiss the idea that the US is actually pro-ISIS out of hand, keep in mind that the US government also bombed the Serbs in order to keep them from defeating the Muslims in Bosnia. Or, you know,\nread the relevant Defense Intelligence Agency document\n.\n“THE WEST, GULF COUNTRIES, AND TURKEY [WHO] SUPPORT THE [SYRIAN] OPPOSITION… THERE IS THE POSSIBILITY OF ESTABLISHING A DECLARED OR UNDECLARED SALAFIST PRINCIPALITY IN EASTERN SYRIA (HASAKA AND DER ZOR), AND THIS IS EXACTLY WHAT THE SUPPORTING POWERS TO THE OPPOSITION WANT, IN ORDER TO ISOLATE THE SYRIAN REGIME…”.\nThe DIA report, formerly classified “SECRET//NOFORN” and dated August 12, 2012, was circulated widely among various government agencies, including CENTCOM, the CIA, FBI, DHS, NGA, State Dept., and many others.\nThe document shows that as early as 2012, U.S. intelligence predicted the rise of the Islamic State in Iraq and the Levant (ISIL or ISIS), but instead of clearly delineating the group as an enemy, the report envisions the terror group as a U.S. strategic asset.\nConsidering that the mujahideen in Afghanistan were originally envisioned and armed as a U.S. strategic asset against the Soviet Union, it should not be terribly surprising to learn that the Islamic State is a similar arrangement.",
  "tags": [
    "conspiracy",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-02T13:00:00+00:00"
}