{
  "url": "https://voxday.net/2015/12/28/the/",
  "scraped_at": "2025-12-17T17:39:20.564342",
  "title": "Epistemic closure at Tor",
  "date_display": "December 28, 2015",
  "date_iso": "2015-12-28T10:00:00+00:00",
  "date_from_url": "2015-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tor.com is now <a href=\"http://www.tor.com/2015/12/21/tor-com-is-closed-to-short-fiction-submissions/\">closed to the unelect</a>:</p><blockquote class=\"tr_bq\"><p> Since its inception, Tor.com has prided itself on the strength of its original short fiction. For a long time our unsolicited submissions formed the backbone of our catalog. We’ve found some of our favorite, most innovative, and most surprising stories through slush. However, in recent years we’ve found that more and more of our stories have been coming to us from different sources. As more of our stories are being brought in by consulting editors, fewer slots on our schedule can be filled by submitted stories. As such it’s time for a change.</p><p>On January 7th Tor.com will close its short fiction submissions system. Our dedicated editors and readers will read through and respond to everything that is submitted up to that point, but we do not plan to reopen in the foreseeable future. We are thankful to the authors who submitted stories to us, and to the readers who read those stories, always looking for the next great undiscovered work.</p></blockquote><p>Translation: the short fiction market is rapidly approaching the terminal point. It costs less to simply let the “consulting editors”, who are mostly Tor writers using Tor.com as a marketing platform, to bring in short stories from their friends and publish them there. Where else are they going to publish them, after all?</p><p>(And before anyone declares this is a great opportunity for Castalia, I reiterate: the short fiction market is dying. No one wants to pay for the required vehicles; even a phenomenal collection like <i>There Will Be War Volume X</i>, with rave reviews, superlative non-fiction pieces, and some of the biggest names of the last fifty years of science fiction on the cover, won’t sell one-twentieth as well as a Larry Correia novel. While both mil-SF anthologies do well enough to justify their existence, I don’t see any convincing rationale for developing a short fiction site at this time.)</p><p>This closure to the unsolicited means that Tor is, to a certain extent, doubling down on its commitment to Pink SF and the SJW vision of its inner circle, as without a sufficiently close relationship with a “consulting editor”, you’re not breaking in via that particular short fiction market anymore.</p><p>However, based on my experience with both RTRH and TWBW, this is unlikely to harm them much. The slush readers for the latter went over hundreds of submissions and found us precisely two new writers, Shao, and Newquist, while Cheah was the only new writer discovered in the process of producing RTRH. Now, the effort was worthwhile in the end, considering that two of the most popular stories in Volume X turned out to be the Cheah and the Shao – “Flashpoint: Titan” is easily my favorite in the anthology – but it was an awful lot of work for everyone involved.</p><p>(And Vol X slush readers, I have been remiss in not sending you your copies yet. If you already bought one, email me and I’ll send you your choice of an earlier volume or the forthcoming Volume IX.)</p><p>This change isn’t going to affect Tor much, nor does it indicate anything terribly important about Tor having to cut costs due to its declining sales. It’s not as if they actually paid their slush readers. Its significance is in the hardening of the battle lines that it represents, and the way in which the SJWs at Tor continue to gradually cut themselves off from the traditional science fiction that they’ve always hated anyhow.</p><p>So, in the end, this is just another example of social justice convergence in action. Boycott Tor Books!</p></div>",
  "content_text": "Tor.com is now\nclosed to the unelect\n:\nSince its inception, Tor.com has prided itself on the strength of its original short fiction. For a long time our unsolicited submissions formed the backbone of our catalog. We’ve found some of our favorite, most innovative, and most surprising stories through slush. However, in recent years we’ve found that more and more of our stories have been coming to us from different sources. As more of our stories are being brought in by consulting editors, fewer slots on our schedule can be filled by submitted stories. As such it’s time for a change.\nOn January 7th Tor.com will close its short fiction submissions system. Our dedicated editors and readers will read through and respond to everything that is submitted up to that point, but we do not plan to reopen in the foreseeable future. We are thankful to the authors who submitted stories to us, and to the readers who read those stories, always looking for the next great undiscovered work.\nTranslation: the short fiction market is rapidly approaching the terminal point. It costs less to simply let the “consulting editors”, who are mostly Tor writers using Tor.com as a marketing platform, to bring in short stories from their friends and publish them there. Where else are they going to publish them, after all?\n(And before anyone declares this is a great opportunity for Castalia, I reiterate: the short fiction market is dying. No one wants to pay for the required vehicles; even a phenomenal collection like\nThere Will Be War Volume X\n, with rave reviews, superlative non-fiction pieces, and some of the biggest names of the last fifty years of science fiction on the cover, won’t sell one-twentieth as well as a Larry Correia novel. While both mil-SF anthologies do well enough to justify their existence, I don’t see any convincing rationale for developing a short fiction site at this time.)\nThis closure to the unsolicited means that Tor is, to a certain extent, doubling down on its commitment to Pink SF and the SJW vision of its inner circle, as without a sufficiently close relationship with a “consulting editor”, you’re not breaking in via that particular short fiction market anymore.\nHowever, based on my experience with both RTRH and TWBW, this is unlikely to harm them much. The slush readers for the latter went over hundreds of submissions and found us precisely two new writers, Shao, and Newquist, while Cheah was the only new writer discovered in the process of producing RTRH. Now, the effort was worthwhile in the end, considering that two of the most popular stories in Volume X turned out to be the Cheah and the Shao – “Flashpoint: Titan” is easily my favorite in the anthology – but it was an awful lot of work for everyone involved.\n(And Vol X slush readers, I have been remiss in not sending you your copies yet. If you already bought one, email me and I’ll send you your choice of an earlier volume or the forthcoming Volume IX.)\nThis change isn’t going to affect Tor much, nor does it indicate anything terribly important about Tor having to cut costs due to its declining sales. It’s not as if they actually paid their slush readers. Its significance is in the hardening of the battle lines that it represents, and the way in which the SJWs at Tor continue to gradually cut themselves off from the traditional science fiction that they’ve always hated anyhow.\nSo, in the end, this is just another example of social justice convergence in action. Boycott Tor Books!",
  "tags": [
    "Pink SF"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-28T10:00:00+00:00"
}