{
  "url": "https://voxday.net/2015/12/21/volume-x-initial-reviews/",
  "scraped_at": "2025-12-17T17:38:33.917638",
  "title": "Volume X: initial reviews",
  "date_display": "December 21, 2015",
  "date_iso": "2015-12-21T17:48:00+00:00",
  "date_from_url": "2015-12-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The initial response to the return of <i>THERE WILL BE WAR</i> and the new <a href=\"http://www.amazon.com/gp/product/B019KYLOKQ/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B019KYLOKQ&amp;linkCode=as2&amp;tag=voxpop06-20&amp;linkId=BPLNER4ZM4VN2ZRL\"><i><b>Volume X</b></i></a> is extremely encouraging. Here are a few selections from the reviews and emails I’ve been receiving:</p><ul><li>This is one of the best collections of SF writing I have ever read…. What really gets me about the series is how pertinent they are to today’s geopolitical situation.</li><li> I want to emphasize how much <b><u>quality</u></b> the CH works have. What you are doing is important…. I’ll<br> definitely be following up by purchasing the other volumes and <i>Riding<br> the Red Horse</br></i>.</br></li><li>I’m delighted to see this<br> masterful series is back again, now addressing the issues of the 21st<br> century. Dr. Pournelle’s introductions alone are worth the price of the<br> book</br></br></br></li><li>This book is an absolute blast.  A collection of short stories all of<br> which have a military sci-fi theme, the stories themselves trend towards<br> the top in terms of writing and story telling.</br></br></li><li>This anthology is exactly what to<br> expect from serious men thinking and writing about war in the future and<br> the technology of war as applied to both future and contemporary<br> warfare. </br></br></br></li><li>This is a fine effort, very timely, certainly one worth the<br> investment of time and a few dollars for any person with an interest in<br> the subject of war.  It leaves me hoping that Volume XI finds us in<br> months instead of decades.</br></br></br></li><li> This is my first exposure to this<br> series, and I find this installment intriguing. I found the preface of<br> this book quite striking…. I am very much interested in reading the earlier volumes, and also look forward to future releases.</br></br></li><li>Well Worth the 25-Year Wait. This is an incredible book!</li><li>Volume 10, the latest <i>There Will Be War</i>, is worthy to stand with the best of that series. Mil-sf doesn’t get better than this.</li></ul><p>As I have previously stated, <i>Riding the Red Horse</i> was the best mil-SF anthology published in the last 20 years. And there is no question that <b><a href=\"http://www.amazon.com/gp/product/B019KYLOKQ/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B019KYLOKQ&amp;linkCode=as2&amp;tag=voxpop06-20&amp;linkId=BPLNER4ZM4VN2ZRL\"><i>There Will Be War Vol. X</i></a></b> is even better. If you have any interest in either science fiction or current events, it is a book that you simply must read.</p><p>This exchange was rather amusing:</p><blockquote class=\"tr_bq\"><p> <i>I want the paperback to match my 9-volume set, damn it!</i> <br>  <br>We’re going to sell you a<br> whole new set. The Volume I + Volume II omnibus in case hardcover will be<br> published next month. We’re going to release Volume IX in ebook next, so that we<br> can do a Vol IX + Vol X hardcover as the second in the print series. Then we’ll fill in the<br> blanks….</br></br></br></br></br></br></p><p><i>Those thrice-damned SJWs didn’t lie for once:  You ARE evil!</i></p><p>What part of “Supreme Dark Lord of the Evil Legion of Evil” gave it away?</p></blockquote><p> UPDATE: Not bad for Launch Day. Congratulations to Jerry Pournelle and all of the contributors.</p><p> Amazon Best Sellers Rank: <b>#276 Paid in Kindle Store </b><br>     #1 in Genre Fiction &gt; Historical &gt; Military<br>     #1 in Military &gt; Strategy<br>     #2 in Genre Fiction &gt; War</br></br></br></p></div>",
  "content_text": "The initial response to the return of\nTHERE WILL BE WAR\nand the new\nVolume X\nis extremely encouraging. Here are a few selections from the reviews and emails I’ve been receiving:\nThis is one of the best collections of SF writing I have ever read…. What really gets me about the series is how pertinent they are to today’s geopolitical situation.\nI want to emphasize how much\nquality\nthe CH works have. What you are doing is important…. I’ll\ndefinitely be following up by purchasing the other volumes and\nRiding\nthe Red Horse\n.\nI’m delighted to see this\nmasterful series is back again, now addressing the issues of the 21st\ncentury. Dr. Pournelle’s introductions alone are worth the price of the\nbook\nThis book is an absolute blast.  A collection of short stories all of\nwhich have a military sci-fi theme, the stories themselves trend towards\nthe top in terms of writing and story telling.\nThis anthology is exactly what to\nexpect from serious men thinking and writing about war in the future and\nthe technology of war as applied to both future and contemporary\nwarfare.\nThis is a fine effort, very timely, certainly one worth the\ninvestment of time and a few dollars for any person with an interest in\nthe subject of war.  It leaves me hoping that Volume XI finds us in\nmonths instead of decades.\nThis is my first exposure to this\nseries, and I find this installment intriguing. I found the preface of\nthis book quite striking…. I am very much interested in reading the earlier volumes, and also look forward to future releases.\nWell Worth the 25-Year Wait. This is an incredible book!\nVolume 10, the latest\nThere Will Be War\n, is worthy to stand with the best of that series. Mil-sf doesn’t get better than this.\nAs I have previously stated,\nRiding the Red Horse\nwas the best mil-SF anthology published in the last 20 years. And there is no question that\nThere Will Be War Vol. X\nis even better. If you have any interest in either science fiction or current events, it is a book that you simply must read.\nThis exchange was rather amusing:\nI want the paperback to match my 9-volume set, damn it!\nWe’re going to sell you a\nwhole new set. The Volume I + Volume II omnibus in case hardcover will be\npublished next month. We’re going to release Volume IX in ebook next, so that we\ncan do a Vol IX + Vol X hardcover as the second in the print series. Then we’ll fill in the\nblanks….\nThose thrice-damned SJWs didn’t lie for once:  You ARE evil!\nWhat part of “Supreme Dark Lord of the Evil Legion of Evil” gave it away?\nUPDATE: Not bad for Launch Day. Congratulations to Jerry Pournelle and all of the contributors.\nAmazon Best Sellers Rank:\n#276 Paid in Kindle Store\n#1 in Genre Fiction > Historical > Military\n#1 in Military > Strategy\n#2 in Genre Fiction > War",
  "tags": [
    "Castalia House",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-21T17:48:00+00:00"
}