{
  "url": "https://voxday.net/2015/12/25/when-man-forgets-his-creator/",
  "scraped_at": "2025-12-17T17:38:59.513647",
  "title": "When Man forgets his Creator",
  "date_display": "December 25, 2015",
  "date_iso": "2015-12-25T11:25:00+00:00",
  "date_from_url": "2015-12-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>He forgets how to create. Once you read this, you will know <a href=\"http://www.scifiwright.com/2015/12/the-force-awakens-and-hits-the-snooze-button\">why John C. Wright’s review</a> of <i>Star Wars: The Force Awakens</i> was the only one I was actually interested in reading. One should not read this being wary of spoilers, but rather of having one’s ability to mindlessly enjoy the cultural detritus of Western decline irretrievably hampered. As always, Mr. Wright cuts to the chase by stating an obvious fact that has nevertheless escaped most of the movie’s critics and fans alike:</p><blockquote class=\"tr_bq\"><p> How can this movie both at once be a really enjoyable return to a beloved childhood favorite, and be a bland and dull, and in places offensively stupid and politically correct, piece of trash?</p><p>Because it is a remake, not a sequel.</p><p>Oh, I know that technically it is a sequel, allegedly taking place decades after the close of TEDDY BEARS OF THE JEDI, but the story follows the same plotline, except that the roles of Han, Luke and Leia are all played by Junkyard Girl, since she is the cynical rogue, the innocent novice, and the girl with the McGuffin needing rescue all at once. Except she escapes on her own. The rollerball robot is not as cute and sassy as R2D2, because he is not given as much to do, and the Exhenchman and the Ace Pilot don’t actually do all that much.</p><p>There is a way cool scene when the X-wings come screaming across the lake to the rescue. The hollow star-eating weapon-planet with forests and snowy mountains and atmosphere above its hull was a convincingly impressive weapon, but, again, there was no moment where the impressiveness was played up, no moment when someone whispered, that’s no moon…</p><p>So it is a fairly good remake as remakes go, and it does what it sets out to do, and recapture some, or almost some, of the energy, cleverness, craft, excitement and innocence of the original.</p><p>So why is this not the review I wanted to write, with me dancing jigs on the steeple, painted with woad with bells on my toes, yodeling for joy? Because the jerkwads of Hollywood had to take a favorite movie and crap it up with political correctness. Because this film is critic-proof. No matter how bad it is, everyone and his brother will go see it.</p><p>And the political correctness is subtle. It has to be subtle, because if the poison tasted of poison, the victim would spit it out: so it is sugar coated to go down easy. Do you think controlling the myths and dreams of a generation has no effect on the generation? Story tellers are the secret legislators of mankind.</p><p>The scene where Luke tosses his lightsaber away rather than using it in righteous wrath to smite the evil Emperor may have only been a scene in a kid’s space opera flick: but the majority of the American public regards exactly that same maneuver, preemptive self-disarmament,  as the only moral and right thing to do in the face of the appalling evils of our present war, a war they dare not admit exist, lest they feel a split second of anger, and like a lightswitch being flipped, turn entirely evil themselves. That is what they think will happen if we fight back. If you smite a Sith, you become a Sith.</p><p>Why can’t the modern Leftist tell a decent story? Even when he is copying a good and healthy-minded original scene by scene in a paint-by-numbers fashion, it turns out sick-minded.</p><p>The answer is ultimately where all ultimate answers reside, in the deep places of the soul.</p><p>When we forget God, we forget how to tell tales. I submit that when a man forgets his Creator, he forgets how to create.</p></blockquote><p>It is rather remarkable, when you think about it. Abrams is no different than Brooks is no different than Scalzi. They are not only “creators” who cannot create, they are parasites who, regardless of their technical skills, cannot even successfully execute a paint-by-the-numbers imitation. Like a colorblind painter, their moral blindness renders them fundamentally incapable of utilizing a full moral palette.</p><p>This is, I think, the best realistic outcome for Star Wars fans, and one that is pretty close to what I assumed would be the case. Abrams is a technically competent remaker, and he was never likely to resist the conventional SJWisms. Better a competent and mildly poisonous remake than an incompetent or virulently poisonous one, but all the same, it is a remake, not a genuinely new story.</p><p>For that, you’ll have to turn to the Expanded Universe, or, later next year, to an entirely different science fiction universe entitled <i>Faraway Wars: Embers of Empire.</i></p><p>Merry Christmas….</p></div>",
  "content_text": "He forgets how to create. Once you read this, you will know\nwhy John C. Wright’s review\nof\nStar Wars: The Force Awakens\nwas the only one I was actually interested in reading. One should not read this being wary of spoilers, but rather of having one’s ability to mindlessly enjoy the cultural detritus of Western decline irretrievably hampered. As always, Mr. Wright cuts to the chase by stating an obvious fact that has nevertheless escaped most of the movie’s critics and fans alike:\nHow can this movie both at once be a really enjoyable return to a beloved childhood favorite, and be a bland and dull, and in places offensively stupid and politically correct, piece of trash?\nBecause it is a remake, not a sequel.\nOh, I know that technically it is a sequel, allegedly taking place decades after the close of TEDDY BEARS OF THE JEDI, but the story follows the same plotline, except that the roles of Han, Luke and Leia are all played by Junkyard Girl, since she is the cynical rogue, the innocent novice, and the girl with the McGuffin needing rescue all at once. Except she escapes on her own. The rollerball robot is not as cute and sassy as R2D2, because he is not given as much to do, and the Exhenchman and the Ace Pilot don’t actually do all that much.\nThere is a way cool scene when the X-wings come screaming across the lake to the rescue. The hollow star-eating weapon-planet with forests and snowy mountains and atmosphere above its hull was a convincingly impressive weapon, but, again, there was no moment where the impressiveness was played up, no moment when someone whispered, that’s no moon…\nSo it is a fairly good remake as remakes go, and it does what it sets out to do, and recapture some, or almost some, of the energy, cleverness, craft, excitement and innocence of the original.\nSo why is this not the review I wanted to write, with me dancing jigs on the steeple, painted with woad with bells on my toes, yodeling for joy? Because the jerkwads of Hollywood had to take a favorite movie and crap it up with political correctness. Because this film is critic-proof. No matter how bad it is, everyone and his brother will go see it.\nAnd the political correctness is subtle. It has to be subtle, because if the poison tasted of poison, the victim would spit it out: so it is sugar coated to go down easy. Do you think controlling the myths and dreams of a generation has no effect on the generation? Story tellers are the secret legislators of mankind.\nThe scene where Luke tosses his lightsaber away rather than using it in righteous wrath to smite the evil Emperor may have only been a scene in a kid’s space opera flick: but the majority of the American public regards exactly that same maneuver, preemptive self-disarmament,  as the only moral and right thing to do in the face of the appalling evils of our present war, a war they dare not admit exist, lest they feel a split second of anger, and like a lightswitch being flipped, turn entirely evil themselves. That is what they think will happen if we fight back. If you smite a Sith, you become a Sith.\nWhy can’t the modern Leftist tell a decent story? Even when he is copying a good and healthy-minded original scene by scene in a paint-by-numbers fashion, it turns out sick-minded.\nThe answer is ultimately where all ultimate answers reside, in the deep places of the soul.\nWhen we forget God, we forget how to tell tales. I submit that when a man forgets his Creator, he forgets how to create.\nIt is rather remarkable, when you think about it. Abrams is no different than Brooks is no different than Scalzi. They are not only “creators” who cannot create, they are parasites who, regardless of their technical skills, cannot even successfully execute a paint-by-the-numbers imitation. Like a colorblind painter, their moral blindness renders them fundamentally incapable of utilizing a full moral palette.\nThis is, I think, the best realistic outcome for Star Wars fans, and one that is pretty close to what I assumed would be the case. Abrams is a technically competent remaker, and he was never likely to resist the conventional SJWisms. Better a competent and mildly poisonous remake than an incompetent or virulently poisonous one, but all the same, it is a remake, not a genuinely new story.\nFor that, you’ll have to turn to the Expanded Universe, or, later next year, to an entirely different science fiction universe entitled\nFaraway Wars: Embers of Empire.\nMerry Christmas….",
  "tags": [
    "movies",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-25T11:25:00+00:00"
}