{
  "url": "https://voxday.net/2015/12/24/you-dont-say-2/",
  "scraped_at": "2025-12-17T17:38:54.294267",
  "title": "You don’t say",
  "date_display": "December 24, 2015",
  "date_iso": "2015-12-24T10:13:00+00:00",
  "date_from_url": "2015-12-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Chaos Horizon <a href=\"https://chaoshorizon.wordpress.com/2015/12/19/best-of-2015-tor-com-reviewers-choice/\">provides additional evidence</a> of how the SF-SJWs guide their bloc vote:</p><blockquote class=\"tr_bq\"><p> A few weeks ago, the 2015 Tor.com Reviewers’ Choice list came out. Over the past several years, this has been an important list to track for several reasons. First, it gathers recommendations from 11 Tor.com critics, making it a collated list of its own. Second, it has been fairly well synced up to the Hugos and Nebulas, at least before the campaigning of last year. In 2013, they recommended Ann Leckie’s Ancillary Justice three times; it swept the Hugo and Nebula. Last year, Goblin Emperor was recommended 3 times; it scores Hugo and Nebula noms and that could very well have won the Hugo if not for the Puppies.</p></blockquote><p>Tor Books has been an award-chasing publisher for decades. That fact that the Puppies have risen up to stop them from dominating the awards every year is why they changed the rules with E Pluribus Hugo. Patrick Nielsen Hayden and his little coterie calculated that as long as they can guarantee themselves a single nomination per category, they can muster enough muscle to win at the final round.</p><p>What Puppykickers quite willfully fail to understand is that in 2015, the Puppies, even the Rabid Puppies, engaged in less bloc-voting, in percentage terms, in 2015 than the SJWs did. In the past, the Tor-led SJWs didn’t need to publish public lists because it was all a whisper campaign among a few dozen people; you could see references to it in every “I haven’t read X yet, but I’m voting for it because I hear….” statement. You could also see the Nebula logrolling take place in <a href=\"https://chaoshorizon.wordpress.com/2015/11/21/sfwa-2015-nebula-recommended-reading-list-analyis-and-prediction/\">the SFWA NAR</a> every year, until it was hidden from the public; to Cat Rambo’s credit, she has apparently made public what, if I recall correctly, John Scalzi was responsible for hiding.</p><blockquote class=\"tr_bq\"><p> Table 1: Correlation Between Top 6 (and Ties) of the 2014 Nebula Suggested Reading List and the Eventual 2014 Nebula Nominees</p><p>Novel: 4 out of 6, 67.7%<br> Novella: 6 out of 6, 100%<br> Novelette: 5 out of 6, 83.3%<br> Short Story: 6 out of 7, 85.7%</br></br></br></p><p>Total: 21/25, 84%</p></blockquote><p>The Tor.com Reviewers’ Choice has reinforced, and to a certain extent supplanted, the Tor whispering campaign; based on the way in which reviewers tend to chase the crowd, we can anticipate that the novels the SJWs will be pushing for the award season include:</p><p><i>Uprooted </i>by Naomi Novik (Del Rey)<br> <i>Ancillary Mercy</i> by Anne Leckie (Orbit)<br> <i>Karen Memory</i> by Elizabeth Bear (Tor)<br> <i>The Fifth Season</i> by N.K. Jemisin (Orbit)</br></br></br></p><p>It’s all women, as one would expect, but surprisingly light on Tor-published books. One would assume the fifth book would be <i>The Dark Forest</i>, the sequel to <i>The Three Body Problem</i>, but there is very, very little SJW buzz about it. Perhaps the SJWs finally figured out that Cixin Liu is a man. Or perhaps it is perceived to have been tainted by the Puppies playing kingmaker last year. Who knows? These are not rational people.</p><p>We now also know why John Scalzi very publicly counted himself out in 2015; unlike last year, he is aware that neither Tor nor the SJWs are pushing his latest mediocrity for any awards. No doubt he’s waiting for EPH, when Tor can again guarantee him a spot to make up for his declining popular support.</p><p>Now let’s go and see what the top novels are in the 2015 SFWA Suggested Reading List. And note that I did not see these until AFTER reaching my conclusions based on the Tor.com reviewers’ choices.</p><blockquote class=\"tr_bq\"><p> 21     <i>Uprooted     </i>Novik, Naomi     Del Rey <br> 17     <i>The Grace of Kings</i>     Liu, Ken     Saga Press  <br> 16     <i>Karen Memory</i>     Bear, Elizabeth     Tor Books <br> 15     <i>Updraft     </i>Wilde, Fran     Tor Books    <br> 14     <i>The Traitor Baru Cormorant</i>   Dickinson, Seth  Tor Books<br> 12     <i>Ancillary Mercy </i>    Leckie, Ann     Orbit<br> 11     <i>The Fifth Season</i>     Jemisin, N. K.     Orbit   </br></br></br></br></br></br></p></blockquote><p>Interesting, is it not? All four novels identified are there. After looking into the three previously unmentioned novels, I think it’s likely that Seth Dickenson’s debut novel will turn out to be the book that Tor is pushing in 2015. They badly need a new star now that Scalzi is running out of steam and they lost the HALO books; based on this review, Dickenson certainly appears to understand the Tor Game: <i>“While I enjoyed The Traitor Baru Cormorant, and will read the second<br> book in the series when it arrives, I felt at times I was being giving a<br> sociology lecture by someone steeped in women’s and LBGT studies and<br> political economy.”</br></br></br></i></p><p>Seth Dickinson, we are told, “is the author of THE TRAITOR BARU CORMORANT and more than<br> a dozen short stories. During his time in the social sciences, he<br> worked on cocoa farming in Ghana, political rumor control, and<br> simulations built to study racial bias in police shootings. He wrote<br> much of the lore and flavor for Bungie Studios’ smash hit DESTINY. If he<br> were an animal, he would be a cockatoo.”</br></br></br></br></br></p><p>Yeah, about that… <i>“Destiny’s initial release was met with a chorus of ‘meh’.  It<br> wasn’t a bad game, but it was hampered by a damp squib of a main<br> storyline.” </br></br></i></p><p>In any event, Mr. Dickenson sounds like an ideal standard bearer for Tor Books for the next few years. Regardless, I won’t be reading <i>The Traitor Baru Cormorant</i>, because BOYCOTT TOR BOOKS.</p></div>",
  "content_text": "Chaos Horizon\nprovides additional evidence\nof how the SF-SJWs guide their bloc vote:\nA few weeks ago, the 2015 Tor.com Reviewers’ Choice list came out. Over the past several years, this has been an important list to track for several reasons. First, it gathers recommendations from 11 Tor.com critics, making it a collated list of its own. Second, it has been fairly well synced up to the Hugos and Nebulas, at least before the campaigning of last year. In 2013, they recommended Ann Leckie’s Ancillary Justice three times; it swept the Hugo and Nebula. Last year, Goblin Emperor was recommended 3 times; it scores Hugo and Nebula noms and that could very well have won the Hugo if not for the Puppies.\nTor Books has been an award-chasing publisher for decades. That fact that the Puppies have risen up to stop them from dominating the awards every year is why they changed the rules with E Pluribus Hugo. Patrick Nielsen Hayden and his little coterie calculated that as long as they can guarantee themselves a single nomination per category, they can muster enough muscle to win at the final round.\nWhat Puppykickers quite willfully fail to understand is that in 2015, the Puppies, even the Rabid Puppies, engaged in less bloc-voting, in percentage terms, in 2015 than the SJWs did. In the past, the Tor-led SJWs didn’t need to publish public lists because it was all a whisper campaign among a few dozen people; you could see references to it in every “I haven’t read X yet, but I’m voting for it because I hear….” statement. You could also see the Nebula logrolling take place in\nthe SFWA NAR\nevery year, until it was hidden from the public; to Cat Rambo’s credit, she has apparently made public what, if I recall correctly, John Scalzi was responsible for hiding.\nTable 1: Correlation Between Top 6 (and Ties) of the 2014 Nebula Suggested Reading List and the Eventual 2014 Nebula Nominees\nNovel: 4 out of 6, 67.7%\nNovella: 6 out of 6, 100%\nNovelette: 5 out of 6, 83.3%\nShort Story: 6 out of 7, 85.7%\nTotal: 21/25, 84%\nThe Tor.com Reviewers’ Choice has reinforced, and to a certain extent supplanted, the Tor whispering campaign; based on the way in which reviewers tend to chase the crowd, we can anticipate that the novels the SJWs will be pushing for the award season include:\nUprooted\nby Naomi Novik (Del Rey)\nAncillary Mercy\nby Anne Leckie (Orbit)\nKaren Memory\nby Elizabeth Bear (Tor)\nThe Fifth Season\nby N.K. Jemisin (Orbit)\nIt’s all women, as one would expect, but surprisingly light on Tor-published books. One would assume the fifth book would be\nThe Dark Forest\n, the sequel to\nThe Three Body Problem\n, but there is very, very little SJW buzz about it. Perhaps the SJWs finally figured out that Cixin Liu is a man. Or perhaps it is perceived to have been tainted by the Puppies playing kingmaker last year. Who knows? These are not rational people.\nWe now also know why John Scalzi very publicly counted himself out in 2015; unlike last year, he is aware that neither Tor nor the SJWs are pushing his latest mediocrity for any awards. No doubt he’s waiting for EPH, when Tor can again guarantee him a spot to make up for his declining popular support.\nNow let’s go and see what the top novels are in the 2015 SFWA Suggested Reading List. And note that I did not see these until AFTER reaching my conclusions based on the Tor.com reviewers’ choices.\n21\nUprooted\nNovik, Naomi     Del Rey\n17\nThe Grace of Kings\nLiu, Ken     Saga Press\n16\nKaren Memory\nBear, Elizabeth     Tor Books\n15\nUpdraft\nWilde, Fran     Tor Books\n14\nThe Traitor Baru Cormorant\nDickinson, Seth  Tor Books\n12\nAncillary Mercy\nLeckie, Ann     Orbit\n11\nThe Fifth Season\nJemisin, N. K.     Orbit\nInteresting, is it not? All four novels identified are there. After looking into the three previously unmentioned novels, I think it’s likely that Seth Dickenson’s debut novel will turn out to be the book that Tor is pushing in 2015. They badly need a new star now that Scalzi is running out of steam and they lost the HALO books; based on this review, Dickenson certainly appears to understand the Tor Game:\n“While I enjoyed The Traitor Baru Cormorant, and will read the second\nbook in the series when it arrives, I felt at times I was being giving a\nsociology lecture by someone steeped in women’s and LBGT studies and\npolitical economy.”\nSeth Dickinson, we are told, “is the author of THE TRAITOR BARU CORMORANT and more than\na dozen short stories. During his time in the social sciences, he\nworked on cocoa farming in Ghana, political rumor control, and\nsimulations built to study racial bias in police shootings. He wrote\nmuch of the lore and flavor for Bungie Studios’ smash hit DESTINY. If he\nwere an animal, he would be a cockatoo.”\nYeah, about that…\n“Destiny’s initial release was met with a chorus of ‘meh’.  It\nwasn’t a bad game, but it was hampered by a damp squib of a main\nstoryline.”\nIn any event, Mr. Dickenson sounds like an ideal standard bearer for Tor Books for the next few years. Regardless, I won’t be reading\nThe Traitor Baru Cormorant\n, because BOYCOTT TOR BOOKS.",
  "tags": [
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-12-24T10:13:00+00:00"
}