{
  "url": "https://voxday.net/2011/06/20/are-neocons-are-losing-red-faction/",
  "scraped_at": "2025-12-13T23:14:23.152156",
  "title": "Are the neocons losing Red Faction?",
  "date_display": "June 20, 2011",
  "date_iso": "2011-06-20T13:45:00+00:00",
  "date_from_url": "2011-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.nytimes.com/2011/06/20/opinion/20douthat.html?hp\">Ross Douthat defects</a> in the New York Times:</p><blockquote><p>Rubio is the great neoconservative hope, the champion of a foreign policy that boldly goes abroad in search of monsters to destroy. In the Senate, he’s constantly pressed for a more hawkish line against the Mideast’s bad actors. His maiden Senate speech was a paean to national greatness, whose peroration invoked John F. Kennedy and insisted that America remain the “watchman on the wall of world freedom.”</p><p>Paul, on the other hand, has smoothed the crankish edges off his famous father’s antiwar conservatism, reframing it in the language of constitutionalism, the national interest and the budget deficit. (As Matt Continetti noted in The Weekly Standard, “Whereas Ron Paul criticizes U.S. interventionism in tropes familiar to the left — anti-imperial blowback, manipulation by neocons, moral equivalence — Rand Paul merely says America doesn’t have the money.”)….</p><p>The country is weary of war, but the story Rubio tells, with eloquence and passion, is still tremendously appealing — the story of a great republic armed and righteous, with no limits on what it can accomplish in the world.</p><p>This is a story that many conservatives — and many Americans — want to believe. Once, I believed it myself.</p><p>But that was many years and many wars ago, and now I think Rand Paul is right.</p></blockquote><p>One unmentioned factor here is that Rand Paul is an native American.  Marco Rubio is not.  He may have grown up in the United States, but he is a Cuban raised in a community that has been agitating for the USA to overthrow the Castro regime for decades.  So, it should come as little surprise that Rubio is so content to ignore the American national interest in favor of the latest neocon cause <i>du jour</i>.  Because neocons, regardless of their background, have limited allegiance to the national interest, they see the nation primarily as a means rather than an end.</p><p>As I have pointed out in the past, it was always mistaken to conflate neoconservatism with Jews and the Israel First lobby.  They are merely the most obvious example of what would be more accurately be described as Neoconnery, (there is nothing conservative about it), and is a concept that is as old as the Roman Republic.  Back then, when Rome ruled over the Mediterranean just as America rules over the Atlantic and Pacific, foreign nobles would come to Rome and offer promises of allegiance, troops, and gold in return for a Rome-supported crown.  These Friends of Rome were the neocons of their day.</p><p>On the one hand, it is encouraging that even the moderate conservatives are beginning to respond to the geostrategic and financial realism of the Red Faction’s libertarians.  On the other, it is depressing that even bankruptcy isn’t enough to slow down those like Rubio, who talks a good game but appears to see America as little more than a tool to serve foreign interests.</p><p>Those who deny that transnational freedom of movement will tend to ultimately work against the interests of human liberty would do well to pay attention to the way in which the foreign policy positions of second- and third-generation immigrants tend to diverge from those leaders whose families are more rooted in the nation.  Consider: would any other British leader have intrigued so shamelessly to manipulate the USA into World War II as the half-American Winston Churchill?  All great powers are tempted by the neocons of their day.  And history indicates that most eventually succumb to the temptation, and as a result, follow the predictable trajectory of decline and fall.  It is far from the only factor in national decline, of course, but it is an easily recognized one.</p><p>On a stylistic note, full credit to Douthat for referencing John Quincy Adam’s 1821 Independence Day address.  Read it and mourn for an America that post-Americans like Marco Rubio have never known and would trample upon in their Wilsonian pursuit of “national greatness”.</p><p><i>America, in the assembly of nations, since her admission among them, has invariably, though often fruitlessly, held forth to them the hand of honest friendship, of equal freedom, of generous reciprocity….  Wherever the standard of freedom and Independence has been or shall be unfurled, there will her heart, her benedictions and her prayers be. But she goes not abroad, in search of monsters to destroy. She is the well-wisher to the freedom and independence of all. She is the champion and vindicator only of her own. She will commend the general cause by the countenance of her voice, and the benignant sympathy of her example. She well knows that by once enlisting under other banners than her own, were they even the banners of foreign independence, she would involve herself beyond the power of extrication, in all the wars of interest and intrigue, of individual avarice, envy, and ambition, which assume the colors and usurp the standard of freedom. The fundamental maxims of her policy would insensibly change from liberty to force.</i></p></div>",
  "content_text": "Ross Douthat defects\nin the New York Times:\nRubio is the great neoconservative hope, the champion of a foreign policy that boldly goes abroad in search of monsters to destroy. In the Senate, he’s constantly pressed for a more hawkish line against the Mideast’s bad actors. His maiden Senate speech was a paean to national greatness, whose peroration invoked John F. Kennedy and insisted that America remain the “watchman on the wall of world freedom.”\nPaul, on the other hand, has smoothed the crankish edges off his famous father’s antiwar conservatism, reframing it in the language of constitutionalism, the national interest and the budget deficit. (As Matt Continetti noted in The Weekly Standard, “Whereas Ron Paul criticizes U.S. interventionism in tropes familiar to the left — anti-imperial blowback, manipulation by neocons, moral equivalence — Rand Paul merely says America doesn’t have the money.”)….\nThe country is weary of war, but the story Rubio tells, with eloquence and passion, is still tremendously appealing — the story of a great republic armed and righteous, with no limits on what it can accomplish in the world.\nThis is a story that many conservatives — and many Americans — want to believe. Once, I believed it myself.\nBut that was many years and many wars ago, and now I think Rand Paul is right.\nOne unmentioned factor here is that Rand Paul is an native American.  Marco Rubio is not.  He may have grown up in the United States, but he is a Cuban raised in a community that has been agitating for the USA to overthrow the Castro regime for decades.  So, it should come as little surprise that Rubio is so content to ignore the American national interest in favor of the latest neocon cause\ndu jour\n.  Because neocons, regardless of their background, have limited allegiance to the national interest, they see the nation primarily as a means rather than an end.\nAs I have pointed out in the past, it was always mistaken to conflate neoconservatism with Jews and the Israel First lobby.  They are merely the most obvious example of what would be more accurately be described as Neoconnery, (there is nothing conservative about it), and is a concept that is as old as the Roman Republic.  Back then, when Rome ruled over the Mediterranean just as America rules over the Atlantic and Pacific, foreign nobles would come to Rome and offer promises of allegiance, troops, and gold in return for a Rome-supported crown.  These Friends of Rome were the neocons of their day.\nOn the one hand, it is encouraging that even the moderate conservatives are beginning to respond to the geostrategic and financial realism of the Red Faction’s libertarians.  On the other, it is depressing that even bankruptcy isn’t enough to slow down those like Rubio, who talks a good game but appears to see America as little more than a tool to serve foreign interests.\nThose who deny that transnational freedom of movement will tend to ultimately work against the interests of human liberty would do well to pay attention to the way in which the foreign policy positions of second- and third-generation immigrants tend to diverge from those leaders whose families are more rooted in the nation.  Consider: would any other British leader have intrigued so shamelessly to manipulate the USA into World War II as the half-American Winston Churchill?  All great powers are tempted by the neocons of their day.  And history indicates that most eventually succumb to the temptation, and as a result, follow the predictable trajectory of decline and fall.  It is far from the only factor in national decline, of course, but it is an easily recognized one.\nOn a stylistic note, full credit to Douthat for referencing John Quincy Adam’s 1821 Independence Day address.  Read it and mourn for an America that post-Americans like Marco Rubio have never known and would trample upon in their Wilsonian pursuit of “national greatness”.\nAmerica, in the assembly of nations, since her admission among them, has invariably, though often fruitlessly, held forth to them the hand of honest friendship, of equal freedom, of generous reciprocity….  Wherever the standard of freedom and Independence has been or shall be unfurled, there will her heart, her benedictions and her prayers be. But she goes not abroad, in search of monsters to destroy. She is the well-wisher to the freedom and independence of all. She is the champion and vindicator only of her own. She will commend the general cause by the countenance of her voice, and the benignant sympathy of her example. She well knows that by once enlisting under other banners than her own, were they even the banners of foreign independence, she would involve herself beyond the power of extrication, in all the wars of interest and intrigue, of individual avarice, envy, and ambition, which assume the colors and usurp the standard of freedom. The fundamental maxims of her policy would insensibly change from liberty to force.",
  "tags": [
    "decline and fall",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-20T12:45:00+00:00"
}