{
  "url": "https://voxday.net/2011/06/23/better-hope-for-breakup_23/",
  "scraped_at": "2025-12-13T23:14:41.422001",
  "title": "Better hope for a breakup",
  "date_display": "June 23, 2011",
  "date_iso": "2011-06-23T17:00:00+00:00",
  "date_from_url": "2011-06-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Because the USA as a whole is rapidly <a href=\"http://apnews.myway.com/article/20110623/D9O1HG5G0.html\">going the way of DC and Detroit</a>:</p><blockquote><p>For the first time, minorities make up a majority of babies in the U.S., part of a sweeping race change and growing age divide between mostly white, older Americans and predominantly minority youths that could reshape government policies.</p><p>Preliminary census estimates also show the share of African-American households headed by women – made up of mostly single mothers – now exceeds African-American households with married couples, a sign of declining U.S. marriages overall but also continuing challenges for black youths without involved fathers.</p><p>The findings, based on the latest government data, offer a preview of final 2010 census results being released this summer that provide detailed breakdowns by age, race and householder relationships such as same-sex couples.</p><p>Demographers say the numbers provide the clearest confirmation yet of a changing social order, one in which racial and ethnic minorities will become the U.S. majority by midcentury.</p></blockquote><p>I understand that a lot of people believe that this increasing vibrancy is a good thing for the nation because “diversity is strength”.  The fact that this charming equalitarian belief happens to fly in the face of every relevant historical example as well as the recent societal patterns doesn’t appear to bother them in the slightest.  One need only look at the governance of any non-white majority city to see what is in the cards for the USA as a whole; when Los Angeles or Mexico City are your rosy scenarios, well, you’re pretty much out of luck.</p><p>The thing that the multicultural and racial fantasists can’t seem to understand is that culture is malleable.  The non-European immigrants, forced and voluntary, are not going to be magically transmogrified by the laws and social mores they find, they are instead going to transform them to their liking.  Victor Davis Hanson describes, in ominous detail, precisely how that process has taken place in his California valley:</p><blockquote><p>Last week was another somewhat depressing chapter in a now long saga of living where I was born. I returned to the farm from leading a European military history tour, and experienced the following — mind you, after a number of thefts the month prior (barn, shop, etc.):</p><p>1) I left my chainsaw in the driveway to use the restroom inside the house. Someone driving buy saw it. He slammed on the brakes, stole it, and drove off. Neat, quick, easy. Mind you there was only a 5-minute hiatus in between my cutting. And the driver was a random passer-by. That suggests to me that a high number of rural Fresno County motorists can prove to be opportunistic thieves at any given moment. The saw was new; I liked it — an off-the-shelf $400 Echo that ran well. I assume it will be sold off at a rural intersection in these parts, or the nearby swap meet for about $60. I doubt the thief was a professional woodsman who needed a tool of the trade to survive.</p><p>2) On the next night, three 15-hp agriculture pumps on our farm were vandalized — all the copper wire was torn out of the electrical conduits. The repairs to each one might run $500; yet, the value of the wire could not be over $50. I was told by neighbors that reports and descriptions of the law-breakers focused on youthful thieves casing the countryside — in official parlance a “gang,” and in the neighborhood politically-incorrect patois “cholos” — like the fellow who recently drove in, in his new lowered shiny red pickup (hydraulic lifters are not cheap), inquiring about buying “scrap” and “just looking” before I ran him out….</p><p>I conclude that most Americans would agree that chain-sawing a peach tree or pumping irrigation water enriches the nation, while cruising around looking to destroy such activity does not. The latter represents the sort of social parasitism that I read about each Saturday night in our environs (and, in terms of illegal immigration, once wrote about in Mexifornia — a book I seem doomed to relive in Ground Hog fashion each day — nearly a decade ago): gangbanger A shoots up gangbanger B; B goes to emergency room for publicly funded $250,000 worth of surgery and post-op treatment by C, an MD, who otherwise would have been insulted and intimidated by A or B should he have met either earlier in the day. Indeed, C is more likely to be ridiculed or sued by B than thanked. And yet C does not need either A or B; both need the former in extremis.</p><p>Where does this all end — these open borders, unsustainable entitlements and public union benefits and salaries, these revolving door prisons and Al Gore-like energy fantasies?</p><p>We are left with a paradox. The taxpayer cannot indefinitely fund the emergency room treatment for the shooter and his victim on Saturday night if society cannot put a tool down for five minutes without a likely theft, or a farmer cannot turn on a 50-year old pump without expecting its electrical connections to have been ripped out. Civilization simply cannot function that way for either the productive citizen or the parasite, who still needs a live host.</p></blockquote><p>Where VDH and other nominal social conservatives go wrong is to imagine that this has anything to do with <i>illegal</i> immigration.  It has to do with the ethnic and racial makeup of the country.  As we have seen everywhere from Atlanta and Afghanistan to Zimbabwe, a society can not only survive, but thrive, with a small dash of vibrancy.  A country that is 90 European, 5 percent African, and 5 percent Hispanic might well benefit from the additional heterodoxy provided by the minorities, while a country that is 40 percent European, 20 percent African, and 40 percent Hispanic is going to be riven by a constant battle for government spoils of the sort that distracts the elites of most of the nations in the third world.</p><p>But it is obviously too late now to save the nation as a whole.  There is no coherent nation anymore.  Those who hope to save a vestige of what was once America would do well to ally themselves with the likes of La Raza, who will probably be one of the more important forces in ultimately ending the ill-starred Union.</p><p><i>“Throughout history, poverty is the normal condition of man. Advances which permit this norm to be exceeded- here and there, now and then- are the work of an extremely small minority, frequently despised, often condemned, and almost always opposed by all right-thinking people. Whenever this tiny minority is kept from creating, or (as sometimes happens) is driven out of a society, the people then slip back into abject poverty. This is known as “bad luck.””</i><br> — Robert A. Heinlein</br></p></div>",
  "content_text": "Because the USA as a whole is rapidly\ngoing the way of DC and Detroit\n:\nFor the first time, minorities make up a majority of babies in the U.S., part of a sweeping race change and growing age divide between mostly white, older Americans and predominantly minority youths that could reshape government policies.\nPreliminary census estimates also show the share of African-American households headed by women – made up of mostly single mothers – now exceeds African-American households with married couples, a sign of declining U.S. marriages overall but also continuing challenges for black youths without involved fathers.\nThe findings, based on the latest government data, offer a preview of final 2010 census results being released this summer that provide detailed breakdowns by age, race and householder relationships such as same-sex couples.\nDemographers say the numbers provide the clearest confirmation yet of a changing social order, one in which racial and ethnic minorities will become the U.S. majority by midcentury.\nI understand that a lot of people believe that this increasing vibrancy is a good thing for the nation because “diversity is strength”.  The fact that this charming equalitarian belief happens to fly in the face of every relevant historical example as well as the recent societal patterns doesn’t appear to bother them in the slightest.  One need only look at the governance of any non-white majority city to see what is in the cards for the USA as a whole; when Los Angeles or Mexico City are your rosy scenarios, well, you’re pretty much out of luck.\nThe thing that the multicultural and racial fantasists can’t seem to understand is that culture is malleable.  The non-European immigrants, forced and voluntary, are not going to be magically transmogrified by the laws and social mores they find, they are instead going to transform them to their liking.  Victor Davis Hanson describes, in ominous detail, precisely how that process has taken place in his California valley:\nLast week was another somewhat depressing chapter in a now long saga of living where I was born. I returned to the farm from leading a European military history tour, and experienced the following — mind you, after a number of thefts the month prior (barn, shop, etc.):\n1) I left my chainsaw in the driveway to use the restroom inside the house. Someone driving buy saw it. He slammed on the brakes, stole it, and drove off. Neat, quick, easy. Mind you there was only a 5-minute hiatus in between my cutting. And the driver was a random passer-by. That suggests to me that a high number of rural Fresno County motorists can prove to be opportunistic thieves at any given moment. The saw was new; I liked it — an off-the-shelf $400 Echo that ran well. I assume it will be sold off at a rural intersection in these parts, or the nearby swap meet for about $60. I doubt the thief was a professional woodsman who needed a tool of the trade to survive.\n2) On the next night, three 15-hp agriculture pumps on our farm were vandalized — all the copper wire was torn out of the electrical conduits. The repairs to each one might run $500; yet, the value of the wire could not be over $50. I was told by neighbors that reports and descriptions of the law-breakers focused on youthful thieves casing the countryside — in official parlance a “gang,” and in the neighborhood politically-incorrect patois “cholos” — like the fellow who recently drove in, in his new lowered shiny red pickup (hydraulic lifters are not cheap), inquiring about buying “scrap” and “just looking” before I ran him out….\nI conclude that most Americans would agree that chain-sawing a peach tree or pumping irrigation water enriches the nation, while cruising around looking to destroy such activity does not. The latter represents the sort of social parasitism that I read about each Saturday night in our environs (and, in terms of illegal immigration, once wrote about in Mexifornia — a book I seem doomed to relive in Ground Hog fashion each day — nearly a decade ago): gangbanger A shoots up gangbanger B; B goes to emergency room for publicly funded $250,000 worth of surgery and post-op treatment by C, an MD, who otherwise would have been insulted and intimidated by A or B should he have met either earlier in the day. Indeed, C is more likely to be ridiculed or sued by B than thanked. And yet C does not need either A or B; both need the former in extremis.\nWhere does this all end — these open borders, unsustainable entitlements and public union benefits and salaries, these revolving door prisons and Al Gore-like energy fantasies?\nWe are left with a paradox. The taxpayer cannot indefinitely fund the emergency room treatment for the shooter and his victim on Saturday night if society cannot put a tool down for five minutes without a likely theft, or a farmer cannot turn on a 50-year old pump without expecting its electrical connections to have been ripped out. Civilization simply cannot function that way for either the productive citizen or the parasite, who still needs a live host.\nWhere VDH and other nominal social conservatives go wrong is to imagine that this has anything to do with\nillegal\nimmigration.  It has to do with the ethnic and racial makeup of the country.  As we have seen everywhere from Atlanta and Afghanistan to Zimbabwe, a society can not only survive, but thrive, with a small dash of vibrancy.  A country that is 90 European, 5 percent African, and 5 percent Hispanic might well benefit from the additional heterodoxy provided by the minorities, while a country that is 40 percent European, 20 percent African, and 40 percent Hispanic is going to be riven by a constant battle for government spoils of the sort that distracts the elites of most of the nations in the third world.\nBut it is obviously too late now to save the nation as a whole.  There is no coherent nation anymore.  Those who hope to save a vestige of what was once America would do well to ally themselves with the likes of La Raza, who will probably be one of the more important forces in ultimately ending the ill-starred Union.\n“Throughout history, poverty is the normal condition of man. Advances which permit this norm to be exceeded- here and there, now and then- are the work of an extremely small minority, frequently despised, often condemned, and almost always opposed by all right-thinking people. Whenever this tiny minority is kept from creating, or (as sometimes happens) is driven out of a society, the people then slip back into abject poverty. This is known as “bad luck.””\n— Robert A. Heinlein",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-23T16:00:00+00:00"
}