{
  "url": "https://voxday.net/2011/06/24/conscious-womens-manifesto/",
  "scraped_at": "2025-12-13T23:14:47.699474",
  "title": "The Conscious Women’s Manifesto",
  "date_display": "June 24, 2011",
  "date_iso": "2011-06-24T20:23:00+00:00",
  "date_from_url": "2011-06-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now that <a href=\"http://lifecoachmary.com/blog/2011/06/manifesto-for-the-conscious-woman/\">the text is done</a>, where is the video?</p><blockquote><p>I appreciate the great gift men gave to women – civilization. I apologize for refusing to acknowledge just how nasty, brutish and short my life would be without this gift. I apologize for not acknowledging that men created civilization because women are incapable of doing so because of our limited capability for and general aversion to abstraction. I promise to remember that without men, civilization would grind to a halt in short order. I promise to remember that men build houses and women live in them.</p></blockquote><p>I’m not sure which I find more amusing, the Manifesto for Conscious Women or the fact that the Huffington Post was afraid to publish it: <i>“We submitted this to the Huffington Post in December 2010, but they felt it was too “edgy” and “not a fit” for their audience.”</i> Either way, it is as humorous as it is historically true, although it could never hope to reach the inadvertent heights provided by the <s>Gamma</s>Conscious Men video.</p><p>Naturally, it took a man to write the first draft….</p></div>",
  "content_text": "Now that\nthe text is done\n, where is the video?\nI appreciate the great gift men gave to women – civilization. I apologize for refusing to acknowledge just how nasty, brutish and short my life would be without this gift. I apologize for not acknowledging that men created civilization because women are incapable of doing so because of our limited capability for and general aversion to abstraction. I promise to remember that without men, civilization would grind to a halt in short order. I promise to remember that men build houses and women live in them.\nI’m not sure which I find more amusing, the Manifesto for Conscious Women or the fact that the Huffington Post was afraid to publish it:\n“We submitted this to the Huffington Post in December 2010, but they felt it was too “edgy” and “not a fit” for their audience.”\nEither way, it is as humorous as it is historically true, although it could never hope to reach the inadvertent heights provided by the\nGamma\nConscious Men video.\nNaturally, it took a man to write the first draft….",
  "tags": [
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-24T19:23:00+00:00"
}