{
  "url": "https://voxday.net/2011/06/30/costs-of-war/",
  "scraped_at": "2025-12-13T23:15:13.473482",
  "title": "The Costs of War",
  "date_display": "June 30, 2011",
  "date_iso": "2011-06-30T10:05:00+00:00",
  "date_from_url": "2011-06-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>All the clueless, self-styled “conservatives” who think they can simultaneously support small government and foreign wars need to have “<a href=\"http://www.msnbc.msn.com/id/43573008/ns/world_news-south_and_central_asia/\">$4 trillion</a>” stamped on their small, sloping foreheads.  No amount of militarily and historically illiterate blathering about how “we gots to kill dem ober deah so’s dey doan kills us heah” is going to change the fact that borrowing <i>trillions</i> of dollars in order to kill a few hapless goat humpers is demonstrably neither a sustainable nor an effective approach to war:</p><blockquote><p>Staggering as it is, that figure grossly underestimates the total cost of wars in Iraq, Afghanistan and Pakistan to the U.S. Treasury and ignores more imposing costs yet to come, according to a study released Wednesday.  The final bill will reach at least $3.7 trillion and could be as high as $4.4 trillion, according to the research project “Costs of War” by Brown University’s Watson Institute for International Studies.</p><p>In the 10 years since U.S. troops went into Afghanistan to root out the al-Qaida leaders behind the Sept. 11, 2001, attacks, spending on the conflicts totaled $2.3 trillion to $2.7 trillion.  Those numbers will continue to soar when considering often overlooked costs such as long-term obligations to wounded veterans and projected war spending from 2012 through 2020.</p><p>The estimates do not include at least $1 trillion more in interest payments coming due and many billions more in expenses that cannot be counted, according to the study.</p></blockquote><p>I’ve heard some say that the “isolationism” of Ron Paul and others is dangerous and crazy.  The fact is that if you do not subscribe to that “isolationism”, you are without question historically illiterate, militarily ignorant, and a complete, unmitigated financial moron.  That $4 trillion spent on the unnecessary Bush-Obama wars could have been used to <i>completely eliminate</i> all of the state and local government debt in the country while reducing outstanding federal debt by 16 percent.</p><p>What profit it a nation to guard the borders of Germany and South Korea while leaving its own unmanned?</p></div>",
  "content_text": "All the clueless, self-styled “conservatives” who think they can simultaneously support small government and foreign wars need to have “\n$4 trillion\n” stamped on their small, sloping foreheads.  No amount of militarily and historically illiterate blathering about how “we gots to kill dem ober deah so’s dey doan kills us heah” is going to change the fact that borrowing\ntrillions\nof dollars in order to kill a few hapless goat humpers is demonstrably neither a sustainable nor an effective approach to war:\nStaggering as it is, that figure grossly underestimates the total cost of wars in Iraq, Afghanistan and Pakistan to the U.S. Treasury and ignores more imposing costs yet to come, according to a study released Wednesday.  The final bill will reach at least $3.7 trillion and could be as high as $4.4 trillion, according to the research project “Costs of War” by Brown University’s Watson Institute for International Studies.\nIn the 10 years since U.S. troops went into Afghanistan to root out the al-Qaida leaders behind the Sept. 11, 2001, attacks, spending on the conflicts totaled $2.3 trillion to $2.7 trillion.  Those numbers will continue to soar when considering often overlooked costs such as long-term obligations to wounded veterans and projected war spending from 2012 through 2020.\nThe estimates do not include at least $1 trillion more in interest payments coming due and many billions more in expenses that cannot be counted, according to the study.\nI’ve heard some say that the “isolationism” of Ron Paul and others is dangerous and crazy.  The fact is that if you do not subscribe to that “isolationism”, you are without question historically illiterate, militarily ignorant, and a complete, unmitigated financial moron.  That $4 trillion spent on the unnecessary Bush-Obama wars could have been used to\ncompletely eliminate\nall of the state and local government debt in the country while reducing outstanding federal debt by 16 percent.\nWhat profit it a nation to guard the borders of Germany and South Korea while leaving its own unmanned?",
  "tags": [
    "trainwreck",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-30T09:05:00+00:00"
}