{
  "url": "https://voxday.net/2011/06/02/dont-worry-youre-not-too-pretty-for/",
  "scraped_at": "2025-12-13T23:12:43.679402",
  "title": "Don’t worry, you’re not too pretty for science",
  "date_display": "June 2, 2011",
  "date_iso": "2011-06-02T17:00:00+00:00",
  "date_from_url": "2011-06-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A female scientist desperately wants you to know that someone told her she was pretty, the bastard, and now she can’t wait to tell you <s>about it</s><a href=\"http://scienceblogs.com/aetiology/2011/05/youre_too_prettyyoungfemale_ta.php\">how angry that makes her</a>!</p><blockquote><p>I’m ticked off and venting via dashed-off blog rant….  I know Mr. Salesguy was trying to be nice and probably thought he was flattering me, but fer chrissakes, that is NOT the way to go about it. Women in science already frequently feel like “The Other,” that we’re “too XX” to be good at what we do, that our possession of breasts surely must mean that we’re too much of a fragile flower to be able to handle the “man’s work” involved in science and academia, and that we need to go above and beyond what our male colleagues do just to feel the same level of acceptance and appreciation. I’m sure Mr. Salesguy has never thought about the plight of women in science before tonight (and I doubt that my conversation really made him think about it for more than a few fleeting seconds), but it really dragged down what had otherwise been a very nice few days of unadulterated sciencey goodness.</p></blockquote><p>This is a beautiful example of what is one of my favorite female faux outrage poses.  Certain women, usually those of average appearance, love to pretend to be furious because someone <i>complimented</i> them, which they believe gives them an excuse to talk to everyone they can get their hands on about the fact that someone thinks they are pretty or whatever.  You’ll notice you never see any genuinely gorgeous girl getting her thong in a twist over someone happening to recognize the obvious; she knows she’s hot and it’s no big deal.</p><p>And the idea that one can be somehow damaged by one’s looks defying the expectations of one’s occupation is a ridiculous attempt to justify the “look at me, look at me” behavior.  At my second book signing, which was a large Barnes &amp; Noble event at which there were some 10 or 12 other much bigger-name SF/F authors, including Gordon R. Dickson, there must have been at least 10 people who told me I didn’t look like a SF writer.  I didn’t take any offense, of course, or agonize about how this made it terribly difficult to be taken <i>seriously</i> as a writer.  It was not exactly hard to ascertain what they meant by the comment given that in addition to being the youngest one there by a decade or more, I was also the only weightlifter in the bunch.  SF/F writers are often fascinating conversationalists and I quite enjoy spending time with them, but as a general rule they tend not to make for the most physically imposing specimens of humanity.</p><p>So, Ms Dr Smith needn’t worry.  As an expert observer of the opposite sex, I don’t think she’s too pretty for science.  I don’t think she’s pretty at all.  I’m confident she can rest assured that most men who aren’t of low sexual market value, like the scientists and atheists by whom she is customarily surrounded, will not take any notice of her unless she happens to perform some spectacular feats of science.  Which is probably unlikely, since she’s such a transparently superficial twit that she’ll find it hard to pull her narcissistic nose out of her navel long enough to observe anything scientific.</p></div>",
  "content_text": "A female scientist desperately wants you to know that someone told her she was pretty, the bastard, and now she can’t wait to tell you\nabout it\nhow angry that makes her\n!\nI’m ticked off and venting via dashed-off blog rant….  I know Mr. Salesguy was trying to be nice and probably thought he was flattering me, but fer chrissakes, that is NOT the way to go about it. Women in science already frequently feel like “The Other,” that we’re “too XX” to be good at what we do, that our possession of breasts surely must mean that we’re too much of a fragile flower to be able to handle the “man’s work” involved in science and academia, and that we need to go above and beyond what our male colleagues do just to feel the same level of acceptance and appreciation. I’m sure Mr. Salesguy has never thought about the plight of women in science before tonight (and I doubt that my conversation really made him think about it for more than a few fleeting seconds), but it really dragged down what had otherwise been a very nice few days of unadulterated sciencey goodness.\nThis is a beautiful example of what is one of my favorite female faux outrage poses.  Certain women, usually those of average appearance, love to pretend to be furious because someone\ncomplimented\nthem, which they believe gives them an excuse to talk to everyone they can get their hands on about the fact that someone thinks they are pretty or whatever.  You’ll notice you never see any genuinely gorgeous girl getting her thong in a twist over someone happening to recognize the obvious; she knows she’s hot and it’s no big deal.\nAnd the idea that one can be somehow damaged by one’s looks defying the expectations of one’s occupation is a ridiculous attempt to justify the “look at me, look at me” behavior.  At my second book signing, which was a large Barnes & Noble event at which there were some 10 or 12 other much bigger-name SF/F authors, including Gordon R. Dickson, there must have been at least 10 people who told me I didn’t look like a SF writer.  I didn’t take any offense, of course, or agonize about how this made it terribly difficult to be taken\nseriously\nas a writer.  It was not exactly hard to ascertain what they meant by the comment given that in addition to being the youngest one there by a decade or more, I was also the only weightlifter in the bunch.  SF/F writers are often fascinating conversationalists and I quite enjoy spending time with them, but as a general rule they tend not to make for the most physically imposing specimens of humanity.\nSo, Ms Dr Smith needn’t worry.  As an expert observer of the opposite sex, I don’t think she’s too pretty for science.  I don’t think she’s pretty at all.  I’m confident she can rest assured that most men who aren’t of low sexual market value, like the scientists and atheists by whom she is customarily surrounded, will not take any notice of her unless she happens to perform some spectacular feats of science.  Which is probably unlikely, since she’s such a transparently superficial twit that she’ll find it hard to pull her narcissistic nose out of her navel long enough to observe anything scientific.",
  "tags": [
    "science",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-02T16:00:00+00:00"
}