{
  "url": "https://voxday.net/2011/06/26/eco-on-hawking/",
  "scraped_at": "2025-12-13T23:14:55.087711",
  "title": "Umberto Eco on Stephen Hawking",
  "date_display": "June 26, 2011",
  "date_iso": "2011-06-26T16:15:00+00:00",
  "date_from_url": "2011-06-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was thinking about addressing Stephen Hawking’s absurd new book, but I couldn’t quite bring myself to bother even picking it up, let alone reading it.  Fortunately, Umberto Eco was willing to do the dirty work for us:</p><blockquote><p> <a href=\"http://espresso.repubblica.it/dettaglio/la-filosofia-non-e-star-trek/2149385/18\">Philosophy is not Star Trek</a></p><p>In “The Republic” of last April 6th, there appeared a preview of the book by Stephen Hawking and Leonard Mlodinow, <i>The Grand Design</i>, introduced with a subtitle that more or less reprised a passage from the text: “Philosophy is dead, only physics can explain the cosmos”.  The death of philosophy has been announced on various occasions and therefore the announcement made little impression, but it seemed to me it must be balderdash to have claimed that a genius like Hawking would say such a thing.  To be sure that “The Republic” had not erroneously summarized the book, I went and bought it, and the reading confirmed my suspicions.</p><p>The book appears to have been written by two hands, although in the case of Hawking the expression is sadly metaphorical  because, as we know, his limbs do not respond to the commands of his exceptional brain.  However, the book is fundamentally a work of the second author, whose qualifications are described on the cover as having written some episodes of “Star Trek”.  In the book, one can see the beautiful illustrations that appear to be conceived for a children’s encyclopedia from a bygone time; they are colorful and engaging, but do not actually explain anything about the complex physical, mathematical, and cosmological theorems they are supposed to illustrate.  Perhaps it is not prudent to trust one’s destiny to the philosophy of individuals with rabbit ears.(1)</p><p>The work begins with the fixed affirmation that philosophy no longer has anything to say and only physics can explain:</p><p>1)How we can comprehend the world in which we find ourselves.<br> 2)The nature of reality.<br> 3)If the universe had need of a creator.<br> 4)Why there is something instead of nothing.<br> 5)Why we exist.<br> 6)Why this particular set of laws exists instead of some other.</br></br></br></br></br></p><p>As you see these are typical philosophical questions, but it must be admitted that the book demonstrates how physics can, in some ways, serve to answer the last four, which appear to be the most philosophical of all.</p><p>The problem is that in order to attempt to answer the last four questions, it is necessary to have answered the first two.  It is those questions which, in a large way, are what one requires in order to say that something is real and if we know the real world as it is.  Perhaps you will recall from your philosophical studies at school that we understand by attribute what the intellect perceives of a substance,(2) it is something outside of ourselves.  (Woody Allen adds: and if so, why are they making all that noise?)  Either we are Berkeleyans(3) or, as Putnam said, brains in a vat.</p><p>Well then, the fundamental answers that this book puts forward are exquisitely philosophic and without these philosophical answers not even the physicist could say “because he knows” and “what he knows”.  In fact, the authors speak of “a realism dependent on the models”, that is, they assume that “other concepts of reality independent of description and theory do not exist”.   Therefore “other theories can satisfactorily describe the same phenomenon by means of different conceptual structures” and all that we can perceive, we know, and we say of reality depends on the interaction between our models and that thing which is outside but that we know only due to our perceptive organs and our brain.</p><p>The more suspicious among the readers will have already recognized a Kantian phantasm, but it is clear the two authors are proposing that which in philosophy is called “Holisticism” and by others “internal realism”.  As you see, it is not a treatise of physical discoveries, but of philosophical assumptions, that stand to sustain and legitimize the research of the physicist – those which, when he is a good physicist, can only address the problem of the philosophical foundations of his own methods.  We already knew, we were already familiar with these extraordinary revelations, (evidently due to Mlodinow and to the company of Star Trek), for “in antiquity there was an instinct to attribute the violent actions of nature to an Olympus of displeased or malevolent gods”.  By gosh, and then, by golly.(4)</p><p><i>(1) “Orecchie da leprotto”.  Literally, “the ears of the hare”.  I’m not familiar with this phrase, which could mean anything from implying that the two men are asses (think Pinocchio) to a leafy green vegetable found in salads.  Or it may simply be referring to Mlodinow’s background in television.  Seeing as it’s Eco, one hesitates to guess.  But one thing is certain; it’s not a compliment.<br> (2) I think this refers to Spinoza’s philosophy of mind.  Some school.  But do they know how to put condoms on bananas?<br> (3) Philosopher George Berkeley, who argued against rational materialism and considered the idea of “matter” to be unjustified and self-contradictory.<br> (4) “Perdinci e poi perbacco”.  It’s an Italian expression that doesn’t necessarily translate well, but indicates a lack of surprise.  The sense of dismissive sarcasm should be readily apparent.</br></br></br></i></p></blockquote><p>As my Italian is better described as “conversational” rather than “fluent”, don’t put too much confidence in my translation.  The four italicized notes are mine and therefore may be incorrect.  Regardless, it should be clear that Eco is describing a material example of how, once more, science has climbed to the summit of another intellectual mountain, only to find the philosophers already there.</p></div>",
  "content_text": "I was thinking about addressing Stephen Hawking’s absurd new book, but I couldn’t quite bring myself to bother even picking it up, let alone reading it.  Fortunately, Umberto Eco was willing to do the dirty work for us:\nPhilosophy is not Star Trek\nIn “The Republic” of last April 6th, there appeared a preview of the book by Stephen Hawking and Leonard Mlodinow,\nThe Grand Design\n, introduced with a subtitle that more or less reprised a passage from the text: “Philosophy is dead, only physics can explain the cosmos”.  The death of philosophy has been announced on various occasions and therefore the announcement made little impression, but it seemed to me it must be balderdash to have claimed that a genius like Hawking would say such a thing.  To be sure that “The Republic” had not erroneously summarized the book, I went and bought it, and the reading confirmed my suspicions.\nThe book appears to have been written by two hands, although in the case of Hawking the expression is sadly metaphorical  because, as we know, his limbs do not respond to the commands of his exceptional brain.  However, the book is fundamentally a work of the second author, whose qualifications are described on the cover as having written some episodes of “Star Trek”.  In the book, one can see the beautiful illustrations that appear to be conceived for a children’s encyclopedia from a bygone time; they are colorful and engaging, but do not actually explain anything about the complex physical, mathematical, and cosmological theorems they are supposed to illustrate.  Perhaps it is not prudent to trust one’s destiny to the philosophy of individuals with rabbit ears.(1)\nThe work begins with the fixed affirmation that philosophy no longer has anything to say and only physics can explain:\n1)How we can comprehend the world in which we find ourselves.\n2)The nature of reality.\n3)If the universe had need of a creator.\n4)Why there is something instead of nothing.\n5)Why we exist.\n6)Why this particular set of laws exists instead of some other.\nAs you see these are typical philosophical questions, but it must be admitted that the book demonstrates how physics can, in some ways, serve to answer the last four, which appear to be the most philosophical of all.\nThe problem is that in order to attempt to answer the last four questions, it is necessary to have answered the first two.  It is those questions which, in a large way, are what one requires in order to say that something is real and if we know the real world as it is.  Perhaps you will recall from your philosophical studies at school that we understand by attribute what the intellect perceives of a substance,(2) it is something outside of ourselves.  (Woody Allen adds: and if so, why are they making all that noise?)  Either we are Berkeleyans(3) or, as Putnam said, brains in a vat.\nWell then, the fundamental answers that this book puts forward are exquisitely philosophic and without these philosophical answers not even the physicist could say “because he knows” and “what he knows”.  In fact, the authors speak of “a realism dependent on the models”, that is, they assume that “other concepts of reality independent of description and theory do not exist”.   Therefore “other theories can satisfactorily describe the same phenomenon by means of different conceptual structures” and all that we can perceive, we know, and we say of reality depends on the interaction between our models and that thing which is outside but that we know only due to our perceptive organs and our brain.\nThe more suspicious among the readers will have already recognized a Kantian phantasm, but it is clear the two authors are proposing that which in philosophy is called “Holisticism” and by others “internal realism”.  As you see, it is not a treatise of physical discoveries, but of philosophical assumptions, that stand to sustain and legitimize the research of the physicist – those which, when he is a good physicist, can only address the problem of the philosophical foundations of his own methods.  We already knew, we were already familiar with these extraordinary revelations, (evidently due to Mlodinow and to the company of Star Trek), for “in antiquity there was an instinct to attribute the violent actions of nature to an Olympus of displeased or malevolent gods”.  By gosh, and then, by golly.(4)\n(1) “Orecchie da leprotto”.  Literally, “the ears of the hare”.  I’m not familiar with this phrase, which could mean anything from implying that the two men are asses (think Pinocchio) to a leafy green vegetable found in salads.  Or it may simply be referring to Mlodinow’s background in television.  Seeing as it’s Eco, one hesitates to guess.  But one thing is certain; it’s not a compliment.\n(2) I think this refers to Spinoza’s philosophy of mind.  Some school.  But do they know how to put condoms on bananas?\n(3) Philosopher George Berkeley, who argued against rational materialism and considered the idea of “matter” to be unjustified and self-contradictory.\n(4) “Perdinci e poi perbacco”.  It’s an Italian expression that doesn’t necessarily translate well, but indicates a lack of surprise.  The sense of dismissive sarcasm should be readily apparent.\nAs my Italian is better described as “conversational” rather than “fluent”, don’t put too much confidence in my translation.  The four italicized notes are mine and therefore may be incorrect.  Regardless, it should be clear that Eco is describing a material example of how, once more, science has climbed to the summit of another intellectual mountain, only to find the philosophers already there.",
  "tags": [
    "books",
    "Eco",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-26T15:15:00+00:00"
}