{
  "url": "https://voxday.net/2011/06/07/employment-and-depression/",
  "scraped_at": "2025-12-13T23:13:09.260816",
  "title": "Employment and depression",
  "date_display": "June 7, 2011",
  "date_iso": "2011-06-07T14:00:00+00:00",
  "date_from_url": "2011-06-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One thing that most people probably don’t realize is that in the pre-Samuelsonian era, depressions were generally viewed in terms of the supply and demand for labor rather than a via a money metric of consumption.  One of the more remarkable things for a young economics student reading Keynes’s <i>General Theory</i> today is discovering how it reads more like an Austrian logic-based text than a modern macroeconomics statistical digest.  Today, the employment level doesn’t even factor into the modern determination of whether the economy is growing or not.  Hence the new economic oxymoron of “a jobless recovery”.</p><p>But by the older perspective, it is obvious that the USA is still in the same depression that it was in 2008.  Consider <a href=\"http://www.milobookclub.com/2011/06/07/readership-and-other-trivialities/\">the following labor report</a>:</p><blockquote><p>About 6.2 million Americans, 45.1 percent of all unemployed workers in this country, have been jobless for more than six months – a higher percentage than during the Great Depression.</p></blockquote><p>Moreover, another little known fact is that the unemployment numbers provided for the Great Depression on an ex post facto basis by post-WWII economists <a href=\"http://www.zerohedge.com/article/unemployment-during-great-depression-has-been-overstated-and-current-unemployment-understate\">were overstated</a> because the BLS economist responsible, one Stanley Lebergott, counted many government workers as being unemployed.  Michael Darby corrected for this and came up with the following numbers:</p><p>Year  L  D<br> 1929  3.2%  3.2%<br> 1930  8.7%  8.7%<br> 1931  15.9%  15.3%<br> 1932  23.6%  22.9%<br> 1933  24.9%  20.6%<br> 1934  21.7%  16.0%<br> 1935  20.1%  14.2%<br> 1936  16.9%  9.9%<br> 1937  14.3%  9.1%<br> 1938  19.0%  12.5%<br> 1939  17.2%  11.3%<br> 1940  14.6%  9.5%</br></br></br></br></br></br></br></br></br></br></br></br></p><p>Note that by this corrected measure, even the woefully misleading U3 unemployment measure is presently at the same level as 1937, and worse than 1930.  At 15.8, the more relevant U6 measure is worse than 1931 and every year except 1932 and 1933, the absolute nadir of the Great Depression.  It may be worth noting that adding the current 20.3 million government workers to the ranks of the unemployed, as per Lebergott, would increase the current U3 rate to 22.3 percent and the U6 rate to 29 percent, which exceeds even Lebergott’s calculation for 1933.</p><p>Given the slide in housing prices, the unemployment rates, and the length of joblessness, two things should be readily apparent.  First, the economic contraction has not ended.  Second, the GDP figures notwithstanding, it is a larger scale event than the Great Depression.</p></div>",
  "content_text": "One thing that most people probably don’t realize is that in the pre-Samuelsonian era, depressions were generally viewed in terms of the supply and demand for labor rather than a via a money metric of consumption.  One of the more remarkable things for a young economics student reading Keynes’s\nGeneral Theory\ntoday is discovering how it reads more like an Austrian logic-based text than a modern macroeconomics statistical digest.  Today, the employment level doesn’t even factor into the modern determination of whether the economy is growing or not.  Hence the new economic oxymoron of “a jobless recovery”.\nBut by the older perspective, it is obvious that the USA is still in the same depression that it was in 2008.  Consider\nthe following labor report\n:\nAbout 6.2 million Americans, 45.1 percent of all unemployed workers in this country, have been jobless for more than six months – a higher percentage than during the Great Depression.\nMoreover, another little known fact is that the unemployment numbers provided for the Great Depression on an ex post facto basis by post-WWII economists\nwere overstated\nbecause the BLS economist responsible, one Stanley Lebergott, counted many government workers as being unemployed.  Michael Darby corrected for this and came up with the following numbers:\nYear  L  D\n1929  3.2%  3.2%\n1930  8.7%  8.7%\n1931  15.9%  15.3%\n1932  23.6%  22.9%\n1933  24.9%  20.6%\n1934  21.7%  16.0%\n1935  20.1%  14.2%\n1936  16.9%  9.9%\n1937  14.3%  9.1%\n1938  19.0%  12.5%\n1939  17.2%  11.3%\n1940  14.6%  9.5%\nNote that by this corrected measure, even the woefully misleading U3 unemployment measure is presently at the same level as 1937, and worse than 1930.  At 15.8, the more relevant U6 measure is worse than 1931 and every year except 1932 and 1933, the absolute nadir of the Great Depression.  It may be worth noting that adding the current 20.3 million government workers to the ranks of the unemployed, as per Lebergott, would increase the current U3 rate to 22.3 percent and the U6 rate to 29 percent, which exceeds even Lebergott’s calculation for 1933.\nGiven the slide in housing prices, the unemployment rates, and the length of joblessness, two things should be readily apparent.  First, the economic contraction has not ended.  Second, the GDP figures notwithstanding, it is a larger scale event than the Great Depression.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-07T13:00:00+00:00"
}