{
  "url": "https://voxday.net/2011/06/22/explosive-growth-of-atheism-in-prison/",
  "scraped_at": "2025-12-13T23:14:32.274677",
  "title": "The explosive growth of atheism… in prison",
  "date_display": "June 22, 2011",
  "date_iso": "2011-06-22T09:30:00+00:00",
  "date_from_url": "2011-06-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Atheists often like to erroneously claim that Christians are more likely to be imprisoned than atheists.  Both Sam Harris and Richard Dawkins have made this bizarre, and irrelevant, appeal to atheist “morality”.  But these arguments are inevitably based on nothing substantive, and more importantly, they are belied by actual prison statistics.  While the USA doesn’t keep comprehensive statistics related to religion, the UK does, and it’s here that we can see the actual facts of the matter.</p><p>What is interesting is that it appears atheists have become significantly more criminal since I found the 2002 statistics when writing TIA.  (Since then, the UK Ministry of Justice has gotten its online act together and it’s much easier to find <a href=\"http://www.justice.gov.uk/publications/docs/omcs-2009-complete-210710a.pdf\">the relevant annual statistics</a>.)  In the seven years between 2002 and 2009, the number of imprisoned High Church Atheists rose 475%, from 0.17% of the England and Wales prison population to 0.84%.  That’s still fairly small, of course, but it’s worth noting that it is a larger percentage of the prison population than is represented by any of the following religions and denominations:</p><p>Baptist, Congregational, Methodist, Pentecostal, Presbyterian, Episcopalian, Quaker, United Reformed Church, Hindu, Jewish, Sikh, Christian Scientist, Coptic Christian, Greek/Russian Orthodox, Mormon, Jehovah’s Witnesses, Seven Day Adventist, BaHai, Jain, Pagan, Rastafarian, Scientologist, Zoroastrian.</p><p>That’s only a partial list, as I left out about an equal number of more obscure denominations and religions.  It was also the second-fastest rate of growth, surpassed only by the agnostic population, which increased 812% to 0.64% of the total prison population.</p><p>However, as I pointed out in TIA, the correct comparison between Christians and atheists is not between all Christians and self-identified High Church Atheists, but rather between all Christians and all No Religion atheists, less agnostics.  It is easy to demonstrate why this is so, the inevitable Atheist Dance notwithstanding, given the correct definition of an atheist as “one who believes that God does not exist” rather than “one who calls himself an atheist”.  This assertion is supported by the action of the atheists at the British Humanist Association and their <a href=\"http://census-campaign.org.uk/what-is-happening/what-does-the-religion-question-really-measure/\">census campaign</a>, which asserts that is an individual’s identification with a religion – or presumably, identification with a specific appellation – irrespective of the extent of their religious belief or practice is not the appropriate concept to measure.  And while one could argue that “no religion” is not perfectly synonymous with “belief that God does not exist”, it is safe to assume that most, though not all, no religion individuals are practical atheists even if they are not inclined to call themselves atheists.  It is also in keeping with the practice of Richard Dawkins, the British Humanist Association, and many vocal atheists to consider “no religion” a form of atheism.</p><p>The reason this matters is that is the Low Church atheists of the No Religion variety who make up 33.1% of the prison population, more than twice the 15% of the general population.  (The 15.1% number is from 2001 and will likely be around 20% in the 2011 census; I will update the numbers accordingly when they become available.)  The statistical overrepresentation of no religion atheists in prison is surpassed only by Buddhists (0.3% general, 2.2% prison) and Muslims (2.8% general, 11.9% prison).</p><p>So, keep this in mind the next time that an atheist attempts to claim that atheists are more moral or less criminal than Christians.  All they are doing is cherry-picking the most intelligent subset of the atheist population and comparing it with the entire intelligence spectrum of the Christian population.  Since low IQ tends to correspond highly with criminal behavior and imprisonment, it should come as no surprise that self-styled Atheists are less likely to be found in prison than no religion atheists.</p></div>",
  "content_text": "Atheists often like to erroneously claim that Christians are more likely to be imprisoned than atheists.  Both Sam Harris and Richard Dawkins have made this bizarre, and irrelevant, appeal to atheist “morality”.  But these arguments are inevitably based on nothing substantive, and more importantly, they are belied by actual prison statistics.  While the USA doesn’t keep comprehensive statistics related to religion, the UK does, and it’s here that we can see the actual facts of the matter.\nWhat is interesting is that it appears atheists have become significantly more criminal since I found the 2002 statistics when writing TIA.  (Since then, the UK Ministry of Justice has gotten its online act together and it’s much easier to find\nthe relevant annual statistics\n.)  In the seven years between 2002 and 2009, the number of imprisoned High Church Atheists rose 475%, from 0.17% of the England and Wales prison population to 0.84%.  That’s still fairly small, of course, but it’s worth noting that it is a larger percentage of the prison population than is represented by any of the following religions and denominations:\nBaptist, Congregational, Methodist, Pentecostal, Presbyterian, Episcopalian, Quaker, United Reformed Church, Hindu, Jewish, Sikh, Christian Scientist, Coptic Christian, Greek/Russian Orthodox, Mormon, Jehovah’s Witnesses, Seven Day Adventist, BaHai, Jain, Pagan, Rastafarian, Scientologist, Zoroastrian.\nThat’s only a partial list, as I left out about an equal number of more obscure denominations and religions.  It was also the second-fastest rate of growth, surpassed only by the agnostic population, which increased 812% to 0.64% of the total prison population.\nHowever, as I pointed out in TIA, the correct comparison between Christians and atheists is not between all Christians and self-identified High Church Atheists, but rather between all Christians and all No Religion atheists, less agnostics.  It is easy to demonstrate why this is so, the inevitable Atheist Dance notwithstanding, given the correct definition of an atheist as “one who believes that God does not exist” rather than “one who calls himself an atheist”.  This assertion is supported by the action of the atheists at the British Humanist Association and their\ncensus campaign\n, which asserts that is an individual’s identification with a religion – or presumably, identification with a specific appellation – irrespective of the extent of their religious belief or practice is not the appropriate concept to measure.  And while one could argue that “no religion” is not perfectly synonymous with “belief that God does not exist”, it is safe to assume that most, though not all, no religion individuals are practical atheists even if they are not inclined to call themselves atheists.  It is also in keeping with the practice of Richard Dawkins, the British Humanist Association, and many vocal atheists to consider “no religion” a form of atheism.\nThe reason this matters is that is the Low Church atheists of the No Religion variety who make up 33.1% of the prison population, more than twice the 15% of the general population.  (The 15.1% number is from 2001 and will likely be around 20% in the 2011 census; I will update the numbers accordingly when they become available.)  The statistical overrepresentation of no religion atheists in prison is surpassed only by Buddhists (0.3% general, 2.2% prison) and Muslims (2.8% general, 11.9% prison).\nSo, keep this in mind the next time that an atheist attempts to claim that atheists are more moral or less criminal than Christians.  All they are doing is cherry-picking the most intelligent subset of the atheist population and comparing it with the entire intelligence spectrum of the Christian population.  Since low IQ tends to correspond highly with criminal behavior and imprisonment, it should come as no surprise that self-styled Atheists are less likely to be found in prison than no religion atheists.",
  "tags": [
    "atheism"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-22T08:30:00+00:00"
}