{
  "url": "https://voxday.net/2011/06/06/fallacious-free-trade-argumen/",
  "scraped_at": "2025-12-13T23:13:02.001726",
  "title": "A fallacious free trade argument",
  "date_display": "June 6, 2011",
  "date_iso": "2011-06-06T14:00:00+00:00",
  "date_from_url": "2011-06-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mark Perry <a href=\"http://mjperry.blogspot.com/2011/01/10-problems-with-free-trade-among-us.html\">omits a key factor</a> in attempting to defend international free trade:</p><blockquote><p>Bottom Line: To argue against free trade among countries, one would also have to object to free trade among American states, counties, cities and individuals, see my edits below of Fletcher’s article that hopefully make this point.</p></blockquote><p>That simply is not the case.  In fact, Perry misses a vital point, which is that in order to argue FOR free trade among countries, one has to accept a similar free flow of labor between countries as presently exists between American states, counties, and cities.  And how sizeable is that free flow?</p><p>In 2009, 4.7 million Americans moved from one state to another.  Keep in mind that the entire American employed labor force is only 140 million.  If we conservatively divide the number of domestic migrants by the average household size of 2.6, we’re looking at 1.8 million workers, 1.3 percent of all American workers, who moved intrastate.</p><p>This suggests that if the world were to adopt international free trade, more than a million Americans would need to move to China, Mexico, Japan, Germany, and Canada in order to find employment on an annual basis.  It would be necessary to know the amount of intrastate trade vesus international trade to provide a precise estimate of how many Americans would need to emigrate every year, (53% of them to China), under a free trade regime, but I find it unlikely that many Americans are likely to prove supportive of a trade system that would require them to move to places like India and Bangladesh as freely as it now forces residents of Detroit and Minneapolis to move to Scottsdale and Naples.</p><p>Being an American expatriate myself, I know much better than most that it is possible to change one’s international residence.  And due to my extensive, long-term international experience, I can say that I find this particular aspect of the free trade argument to be naive to the point of absurdity.  Most American expats to even first-world <i>European</i> countries don’t last two years due to the significant language and cultural differences.  The concept is a complete non-starter and therefore the equivalence is false.</p></div>",
  "content_text": "Mark Perry\nomits a key factor\nin attempting to defend international free trade:\nBottom Line: To argue against free trade among countries, one would also have to object to free trade among American states, counties, cities and individuals, see my edits below of Fletcher’s article that hopefully make this point.\nThat simply is not the case.  In fact, Perry misses a vital point, which is that in order to argue FOR free trade among countries, one has to accept a similar free flow of labor between countries as presently exists between American states, counties, and cities.  And how sizeable is that free flow?\nIn 2009, 4.7 million Americans moved from one state to another.  Keep in mind that the entire American employed labor force is only 140 million.  If we conservatively divide the number of domestic migrants by the average household size of 2.6, we’re looking at 1.8 million workers, 1.3 percent of all American workers, who moved intrastate.\nThis suggests that if the world were to adopt international free trade, more than a million Americans would need to move to China, Mexico, Japan, Germany, and Canada in order to find employment on an annual basis.  It would be necessary to know the amount of intrastate trade vesus international trade to provide a precise estimate of how many Americans would need to emigrate every year, (53% of them to China), under a free trade regime, but I find it unlikely that many Americans are likely to prove supportive of a trade system that would require them to move to places like India and Bangladesh as freely as it now forces residents of Detroit and Minneapolis to move to Scottsdale and Naples.\nBeing an American expatriate myself, I know much better than most that it is possible to change one’s international residence.  And due to my extensive, long-term international experience, I can say that I find this particular aspect of the free trade argument to be naive to the point of absurdity.  Most American expats to even first-world\nEuropean\ncountries don’t last two years due to the significant language and cultural differences.  The concept is a complete non-starter and therefore the equivalence is false.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-06T13:00:00+00:00"
}