{
  "url": "https://voxday.net/2011/06/10/george-will-fails-to-follow-logic/",
  "scraped_at": "2025-12-13T23:13:26.482452",
  "title": "George Will fails to follow the logic",
  "date_display": "June 10, 2011",
  "date_iso": "2011-06-10T16:13:00+00:00",
  "date_from_url": "2011-06-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is what happens when you mindlessly assume that free trade is <i>intrinsically</i> beneficial <a href=\"http://www.washingtonpost.com/opinions/obama-and-free-trade-appease-big-labor/2011/06/07/AGH7QXMH_story.html\">in all circumstances</a>:</p><blockquote><p>Since 1974, Trade Adjustment Assistance (TAA) has provided 104, and then 156, weeks of myriad financial aid, partly concurrent with the 99 weeks of unemployment compensation, to people, including farmers and government workers, and firms, even whole communities, that can more or less plausibly claim to have lost their jobs or been otherwise injured because of foreign competition. Even if the injury is just the loss of unfair advantages conferred, at the expense of other Americans, by government protectionism. And even if the injury results not from imports but from outsourcing jobs. TAA benefited 50,000 people at a cost of $500 million in 2002. In 2010, it cost $975 million for 234,000 people. Its purpose is to purchase support for free-trade policies that allow Americans to benefit from foreign goods and services, and from domestic goods and services with lower prices because of competition from imports….  It is unjust to treat some workers as more entitled than others to protection from the vicissitudes of economic dynamism.</p><p>Consider a hypothetical Ralph, who operated Ralph’s Diner until Applebee’s and Olive Garden opened competitors in the neighborhood. With economies of scale and national advertising budgets, those two franchises could offer more choices at better prices, so Ralph’s Diner went out of business. Should he and his employees be entitled to extra taxpayer subventions because they are casualties of competition?</p><p>Why should someone be entitled to such welfare just because he or she is affected negatively by competition that comes from abroad rather than down the street? Because national trade policy permits foreign competition? But national economic policy permits — indeed encourages, even enforces — domestic competition.</p><p>In 2001, when approximately 80,000 people worked in 7,500 music stores, the iPod was invented. Largely because of that and other technological changes, today only about 20,000 people work in 2,500 music stores. Should those 60,000 people be entitled to extra welfare because they are “victims” of technology? Does it matter if the 60,000 have found work in new jobs — perhaps making or selling electronic devices?</p><p>In 2008, Americans bought 1.4 billion books made of paper and 200 million e-books. Soon they will buy more e-books than paper books, and half the nation’s bookstores will be gone. Should the stores’ former employees be entitled to special assistance beyond unemployment compensation?</p></blockquote><p>Will has omitted to take three salient facts into account.  First, he fails to note that 234,000 people receiving benefits from the program – up from only 50,000 – do not have <i>any</i> jobs.  Therefore, it makes no sense to ask if the 60,000 people who no longer work in music stores have now found work in making or selling electronic devices, especially when none of those electronic devices are made in the USA.  It’s a bizarre and uncharacteristically inept attempt at a rhetorical point.</p><p>Second, the reason that one could make a case for compensating those who lose their jobs to foreign competition rather than to domestic competition is because a) the former is a direct result of federal trade policy whereas the latter is not, and, b) whereas the worker who loses a job to a domestic competitor can reasonably move elsewhere domestically to find another job, potentially with that very competitor, the worker who loses a job to an overseas competitor cannot.</p><p>Third, the advance of technology tends to create new jobs even as it destroys old ones.  (This is not always true, an assumption that needs to be examined at some other time.)  So the loss of a job in one sector is counterbalanced by the addition of a job in another.  However, the loss of a job to overseas competition is a net loss for the national economy and it is not counterbalanced by the addition of a job.</p><p>The oxymoronic aspect of free trade in a modern economic system is this.  It makes no sense to even attempt managing <i>any</i> aspect of a national economy if national employment is to be left to the vagaries of international competition.  This is why “free trade” is not, as many on the right believe it to be, a step towards freedom, it is rather an significant step towards global tyranny and the destruction of the United States Constitution.</p><p>Now, I am <u>not</u> defending the Trade Adjustment Assistance program or any other form of welfare or government income redistribution plan.  I am simply pointing out that it is totally absurd for George Will and other free traders to complain about the cost of free trade-related welfare to a nation rendered bankrupt, at least in part, by the government’s international free trade policies.</p><p>Given that the federal government used to fund itself through the use of tariffs on international trade, it is most strange to argue that direct income taxes and payroll taxes on its citizens are either more liberating or more to the material benefit of those very citizens.</p></div>",
  "content_text": "This is what happens when you mindlessly assume that free trade is\nintrinsically\nbeneficial\nin all circumstances\n:\nSince 1974, Trade Adjustment Assistance (TAA) has provided 104, and then 156, weeks of myriad financial aid, partly concurrent with the 99 weeks of unemployment compensation, to people, including farmers and government workers, and firms, even whole communities, that can more or less plausibly claim to have lost their jobs or been otherwise injured because of foreign competition. Even if the injury is just the loss of unfair advantages conferred, at the expense of other Americans, by government protectionism. And even if the injury results not from imports but from outsourcing jobs. TAA benefited 50,000 people at a cost of $500 million in 2002. In 2010, it cost $975 million for 234,000 people. Its purpose is to purchase support for free-trade policies that allow Americans to benefit from foreign goods and services, and from domestic goods and services with lower prices because of competition from imports….  It is unjust to treat some workers as more entitled than others to protection from the vicissitudes of economic dynamism.\nConsider a hypothetical Ralph, who operated Ralph’s Diner until Applebee’s and Olive Garden opened competitors in the neighborhood. With economies of scale and national advertising budgets, those two franchises could offer more choices at better prices, so Ralph’s Diner went out of business. Should he and his employees be entitled to extra taxpayer subventions because they are casualties of competition?\nWhy should someone be entitled to such welfare just because he or she is affected negatively by competition that comes from abroad rather than down the street? Because national trade policy permits foreign competition? But national economic policy permits — indeed encourages, even enforces — domestic competition.\nIn 2001, when approximately 80,000 people worked in 7,500 music stores, the iPod was invented. Largely because of that and other technological changes, today only about 20,000 people work in 2,500 music stores. Should those 60,000 people be entitled to extra welfare because they are “victims” of technology? Does it matter if the 60,000 have found work in new jobs — perhaps making or selling electronic devices?\nIn 2008, Americans bought 1.4 billion books made of paper and 200 million e-books. Soon they will buy more e-books than paper books, and half the nation’s bookstores will be gone. Should the stores’ former employees be entitled to special assistance beyond unemployment compensation?\nWill has omitted to take three salient facts into account.  First, he fails to note that 234,000 people receiving benefits from the program – up from only 50,000 – do not have\nany\njobs.  Therefore, it makes no sense to ask if the 60,000 people who no longer work in music stores have now found work in making or selling electronic devices, especially when none of those electronic devices are made in the USA.  It’s a bizarre and uncharacteristically inept attempt at a rhetorical point.\nSecond, the reason that one could make a case for compensating those who lose their jobs to foreign competition rather than to domestic competition is because a) the former is a direct result of federal trade policy whereas the latter is not, and, b) whereas the worker who loses a job to a domestic competitor can reasonably move elsewhere domestically to find another job, potentially with that very competitor, the worker who loses a job to an overseas competitor cannot.\nThird, the advance of technology tends to create new jobs even as it destroys old ones.  (This is not always true, an assumption that needs to be examined at some other time.)  So the loss of a job in one sector is counterbalanced by the addition of a job in another.  However, the loss of a job to overseas competition is a net loss for the national economy and it is not counterbalanced by the addition of a job.\nThe oxymoronic aspect of free trade in a modern economic system is this.  It makes no sense to even attempt managing\nany\naspect of a national economy if national employment is to be left to the vagaries of international competition.  This is why “free trade” is not, as many on the right believe it to be, a step towards freedom, it is rather an significant step towards global tyranny and the destruction of the United States Constitution.\nNow, I am\nnot\ndefending the Trade Adjustment Assistance program or any other form of welfare or government income redistribution plan.  I am simply pointing out that it is totally absurd for George Will and other free traders to complain about the cost of free trade-related welfare to a nation rendered bankrupt, at least in part, by the government’s international free trade policies.\nGiven that the federal government used to fund itself through the use of tariffs on international trade, it is most strange to argue that direct income taxes and payroll taxes on its citizens are either more liberating or more to the material benefit of those very citizens.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-10T15:13:00+00:00"
}