{
  "url": "https://voxday.net/2011/06/05/lady-protests-too-muc/",
  "scraped_at": "2025-12-13T23:12:58.333247",
  "title": "The lady postures too much",
  "date_display": "June 5, 2011",
  "date_iso": "2011-06-05T16:58:00+00:00",
  "date_from_url": "2011-06-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Naomi Wolf explains that she likes herself better and is actually more attractive now that she’s in her late 40s and no one wants to have sex with her.  Unsurprisingly, now that she’s gotten older, she has concluded that <a href=\"http://www.washingtonpost.com/lifestyle/magazine/a-wrinkle-in-time-twenty-years-after-the-beauty-myth-naomi-wolf-addresses-the-aging-myth/2011/05/11/AGiEhvCH_story.html\">age, like beauty, is also a myth</a>:</p><blockquote><p>Recently, I was at a party, and a man who, like myself, was in his late 40s, arrived with a woman 20 years younger. It took only a few moments of conversation before the rest of the group realized that the two had very little in common. And yet I did not feel the frisson of envy among the men present, nor did I see a bristle of jealousy from any of the stylish, accomplished women in their 40s. In fact, the mood of both genders was tender, almost pitying. The man may have imagined that he was showing off the youth of his date the way he might show off a new Maserati; but parading her around like an acquisition seemed only to make his friends feel sorry for him….</p><p>There are many other delightful surprises about being at this stage on the journey. I don’t miss the brutal sexual harassment that young women receive from men — and I love the far gentler flirtation or civil compliments from cab drivers and park chess players my own age or older. On the street, young women are told: Give me some. Older women hear: I love your eyes.</p></blockquote><p>It is certainly amusing to see a woman <i>whose entire literary career</i> was based on her attractive-by-New-York-writer standards try to rationalize away the fact that she is past her sell-by date.  It’s also remarkable that she managed to write about the changes in women’s attitudes and bodies over the last two decades without once seeing fit to mention the enfattening of America; Naomi has clearly packed on more than a few pounds herself.</p><p>Any time you see a woman describe “magnetic and dynamic women my own age” you know perfectly well she is referring to childless women fast approaching menopause who are filled with boundless hate for the young women their male peers are dating.  Wolf’s attempt at a bemused zen-like pose is about as convincing as unemployed female college graduates babbling about how “strong and independent” they are as they move home to spend a year deciding what graduate schools Daddy is going to pay for.</p><p>The punchline which reveals the entire point of the article is this pathetic attempt at a neg: “[I]n my own circles, at least, it is considered more macho for a man to have an accomplished woman his own age on his arm. His ego, it is understood, can take it.”</p><p>Right, because men pursue beautiful young women in order to be <i>macho</i>.  It’s not sex and beauty that interests them, but <i>female approval</i>.  This woman clearly doesn’t know the first thing about men.  One of these days, someone is going to have to inform women that their endless shaming tactics only work on other women and gamma males they don’t want to have sex with in the first place.</p></div>",
  "content_text": "Naomi Wolf explains that she likes herself better and is actually more attractive now that she’s in her late 40s and no one wants to have sex with her.  Unsurprisingly, now that she’s gotten older, she has concluded that\nage, like beauty, is also a myth\n:\nRecently, I was at a party, and a man who, like myself, was in his late 40s, arrived with a woman 20 years younger. It took only a few moments of conversation before the rest of the group realized that the two had very little in common. And yet I did not feel the frisson of envy among the men present, nor did I see a bristle of jealousy from any of the stylish, accomplished women in their 40s. In fact, the mood of both genders was tender, almost pitying. The man may have imagined that he was showing off the youth of his date the way he might show off a new Maserati; but parading her around like an acquisition seemed only to make his friends feel sorry for him….\nThere are many other delightful surprises about being at this stage on the journey. I don’t miss the brutal sexual harassment that young women receive from men — and I love the far gentler flirtation or civil compliments from cab drivers and park chess players my own age or older. On the street, young women are told: Give me some. Older women hear: I love your eyes.\nIt is certainly amusing to see a woman\nwhose entire literary career\nwas based on her attractive-by-New-York-writer standards try to rationalize away the fact that she is past her sell-by date.  It’s also remarkable that she managed to write about the changes in women’s attitudes and bodies over the last two decades without once seeing fit to mention the enfattening of America; Naomi has clearly packed on more than a few pounds herself.\nAny time you see a woman describe “magnetic and dynamic women my own age” you know perfectly well she is referring to childless women fast approaching menopause who are filled with boundless hate for the young women their male peers are dating.  Wolf’s attempt at a bemused zen-like pose is about as convincing as unemployed female college graduates babbling about how “strong and independent” they are as they move home to spend a year deciding what graduate schools Daddy is going to pay for.\nThe punchline which reveals the entire point of the article is this pathetic attempt at a neg: “[I]n my own circles, at least, it is considered more macho for a man to have an accomplished woman his own age on his arm. His ego, it is understood, can take it.”\nRight, because men pursue beautiful young women in order to be\nmacho\n.  It’s not sex and beauty that interests them, but\nfemale approval\n.  This woman clearly doesn’t know the first thing about men.  One of these days, someone is going to have to inform women that their endless shaming tactics only work on other women and gamma males they don’t want to have sex with in the first place.",
  "tags": [
    "freakshow",
    "women"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-05T15:58:00+00:00"
}