{
  "url": "https://voxday.net/2011/06/18/mailvox-hazlitt-international-trade_18/",
  "scraped_at": "2025-12-13T23:14:15.729925",
  "title": "Mailvox: the Hazlitt international trade challenge II",
  "date_display": "June 18, 2011",
  "date_iso": "2011-06-18T20:30:00+00:00",
  "date_from_url": "2011-06-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is the second part of what I expect will be a three-part critique of Chapter 11 of Henry Hazlitt’s <i>Economics in One Lesson</i>. <a href=\"http://www.milobookclub.com/2011/06/14/mailvox-hazlitt-international-trade-2/\">The first part</a> was posted on June 14th in response to Ampontan’s request.  While it appears everyone was convinced by my initial rebuttal that Hazlitt’s particular case for free trade is incorrect, (though not that there is <i>no</i> case for free trade), I should fail to live up to my reputation if I did not continue to keep pounding upon the quivering mass of his argument until the critique is not only conclusive, but comprehensive.</p><p><i>Now let us look at the matter the other way round, and see the effect of imposing a tariff in the first place. Suppose that there had been no tariff on foreign knit goods, that Americans were accustomed to buying foreign sweaters without duty, and that the argument were then put forward that we could bring a sweater industry into existence by imposing a duty of $5 on sweaters.</i></p><p>There would be nothing logically wrong with this argument so far as it went. The cost of British sweaters to the American consumer might thereby be forced so high that American manufacturers would find it profitable to enter the sweater business. But American consumers would be forced to subsidize this industry. On every American sweater they bought they would be forced in effect to pay a tax of $5 which would be collected from them in a higher price by the new sweater industry.</p><p>Americans would be employed in a sweater industry who had not previously been employed in a sweater industry. That much is true. But there would be no net addition to the country’s industry or the country’s employment. Because the American consumer had to pay $5 more for the same quality of sweater he would have just that much less left over to buy anything else. He would have to reduce his expenditures by $5 somewhere else. In order that one industry might grow or come into existence, a hundred other industries would have to shrink. In order that 50,000 persons might be employed in a woolen sweater industry, 50,000 fewer persons would be employed elsewhere.</p><p>But the new industry would be visible. The number of its employees, the capital invested in it, the market value of its product in terms of dollars, could be easily counted. The neighbors could see the sweater workers going to and from the factory every day. The results would be palpable and direct. But the shrinkage of a hundred other industries, the loss of 50,000 other jobs somewhere else, would not be so easily noticed. it would be impossible for even the cleverest statistician to know precisely what the incidence of the loss of other jobs had been—precisely how many men and women had been laid off from each particular industry, precisely how much business each particular industry had lost—because consumers had to pay more for their sweaters. For a loss spread among all the other productive activities of the country would be comparatively minute for each. It would be impossible for anyone to know precisely how each consumer would have spent his extra $5 if he had been allowed to retain it. The overwhelming majority of the people, therefore, would probably suffer from the illusion that the new industry had cost us nothing.</p><p>It is important to notice that the new tariff on sweaters would not raise American wages. To be sure, it would enable Americans to work in the sweater industry at approximately the average level of American wages (for workers of their skill), instead of having to compete in that industry at the British level of wages. But there would be no increase of American wages in general as a result of the duty; for as we have seen, there would be no net increase in the number of jobs provided, no net increase in the demand for goods, and no increase in labor productivity. Labor productivity would, in fact, be reduced as a result of the tariff.</p><p>And this brings us to the real effect of a tariff wall. It is not merely that all its visible gains are offset by less obvious but no less real losses. It results, in fact, in a net loss to the country. For contrary to centuries of interested propaganda and disinterested confusion, the tariff reduces the American level of wages.</p><p>Let us observe more clearly how it does this. We have seen that the added amount which consumers pay for a tariff-protected article leaves them just that much less with which to buy all other articles. There is here no net gain to industry as a whole. But as a result of the artificial barrier erected against foreign goods, American labor, capital and land are deflected from what they can do more efficiently to what they do less efficiently. Therefore, as a result of the tariff wall the average productivity of American labor and capital is reduced.</p><p>If we look at it now from the consumer’s point of view, we find that he can buy less with his money. Because he has to pay more for sweaters and other protected goods, he can buy less of everything else. The general purchasing power of his income has therefore been reduced. Whether the net effect of the tariff is to lower money wages or to raise money prices will depend upon the monetary policies that are followed. But what is clear is that the tariff—though it may increase wages above what they would have been in the protected industries—must on net balance, when all occupations are considered, reduce real wages—-reduce them, that is to say, compared with what they otherwise would have been.</p><p>Only minds corrupted by generations of misleading propaganda can regard this conclusion as paradoxical. What other result could we expect from a policy of deliberately using our resources of capital and manpower in less efficient ways than we know how to use them? What other result could we expect from deliberately erecting artificial obstacles to trade and transportation?</p><p>Hazlitt does a little better in this second section than he did in the first one, but only a little better.  This time, I count six distinct mistakes in his secondary case for free trade.</p><p>1.  Hazlitt makes the mistake of assuming that only domestic goods are being consumed.  As a result, he neglects to recognize that the additional $5 going towards the tariff might not necessarily be spent on domestic products.  On current statistical average, about $0.75 would be spent on imports.  This means the tariff grants $5 in domestic benefit for a domestic cost of $4.25.</p><p>2.  By positing a 50,000 loss of jobs in other industries, Hazlitt is assuming that labor productivity is the same in all domestic industries.  However, this is unlikely, since the new sweater industry would presumably be more productive on a per-unit basis due to its more recent capital investment and therefore newer technology.  And more importantly, there is no reason to assume that the loss of domestic consumption could not be replaced with foreign consumption.  As one who subscribes to Say’s Law, (which states that supply creates its own demand), Hazlitt cannot claim that existing production in other industries will disappear simply because people are spending 20 percent more money on sweaters.</p><p>3.  It is incorrect to state that “the new tariff on sweaters would not raise American wages”.  First, no one is going to leave their job for a new job in the sweater industry unless they get paid more and the new jobs in sweater production obviously have to precede any negative effect that eventually stems from sweater buying.  Second, the new industry will require building a large amount of new infrastructure, so there additional demand for labor outside of the industry proper will be created, thereby increasing wages outside of it as well.</p><p>4.  It is simply false to claim that “tariffs reduce wages”.  Since there is an increased demand for labor both in and out of the sweater industry and no concomitant reduction in other industries, there is no rational basis for Hazlitt’s groundless assertion.  Even if he was correct and 50,000 jobs in the sweater industry were exchanged for 50,000 jobs outside it, the order in which those jobs would necessarily be gained and lost means that wages would go up.</p><p>5.  Hazlitt claims that “American labor, capital and land are deflected from what they can do more efficiently to what they do less efficiently as a result of the artificial barrier erected against foreign goods”.  But this is a false assumption because it is a binary one.  The fact that American sweater manufacturing is less efficient than English sweater manufacturing does not mean that it is less efficient than any other American industry.  Especially given that in this case, we are dealing with a brand new industry with new capital investment, it will almost surely be more efficient than existing domestic industries.  It is therefore totally false to say “the average productivity of American labor and capital is reduced”.</p><p>6.  There is no paradox.  Hazlitt’s assertion that a tariff “must” reduce real wages is simply incorrect and he repeats his error about assuming that production in the sweater industry will be less efficient than in other domestic industries on the basis of its inefficiency in comparison with English sweater manufacturing.</p><p>I’m a little embarrassed to have to note that I missed the errors that Giraffe caught in his first comment.  He is correct to point out that Hazlitt was only looking at the $5 of domestic spending that the tariff redirects and not at the $25 that now remains in the American economy instead of leaving it and entering the English economy.</p></div>",
  "content_text": "This is the second part of what I expect will be a three-part critique of Chapter 11 of Henry Hazlitt’s\nEconomics in One Lesson\n.\nThe first part\nwas posted on June 14th in response to Ampontan’s request.  While it appears everyone was convinced by my initial rebuttal that Hazlitt’s particular case for free trade is incorrect, (though not that there is\nno\ncase for free trade), I should fail to live up to my reputation if I did not continue to keep pounding upon the quivering mass of his argument until the critique is not only conclusive, but comprehensive.\nNow let us look at the matter the other way round, and see the effect of imposing a tariff in the first place. Suppose that there had been no tariff on foreign knit goods, that Americans were accustomed to buying foreign sweaters without duty, and that the argument were then put forward that we could bring a sweater industry into existence by imposing a duty of $5 on sweaters.\nThere would be nothing logically wrong with this argument so far as it went. The cost of British sweaters to the American consumer might thereby be forced so high that American manufacturers would find it profitable to enter the sweater business. But American consumers would be forced to subsidize this industry. On every American sweater they bought they would be forced in effect to pay a tax of $5 which would be collected from them in a higher price by the new sweater industry.\nAmericans would be employed in a sweater industry who had not previously been employed in a sweater industry. That much is true. But there would be no net addition to the country’s industry or the country’s employment. Because the American consumer had to pay $5 more for the same quality of sweater he would have just that much less left over to buy anything else. He would have to reduce his expenditures by $5 somewhere else. In order that one industry might grow or come into existence, a hundred other industries would have to shrink. In order that 50,000 persons might be employed in a woolen sweater industry, 50,000 fewer persons would be employed elsewhere.\nBut the new industry would be visible. The number of its employees, the capital invested in it, the market value of its product in terms of dollars, could be easily counted. The neighbors could see the sweater workers going to and from the factory every day. The results would be palpable and direct. But the shrinkage of a hundred other industries, the loss of 50,000 other jobs somewhere else, would not be so easily noticed. it would be impossible for even the cleverest statistician to know precisely what the incidence of the loss of other jobs had been—precisely how many men and women had been laid off from each particular industry, precisely how much business each particular industry had lost—because consumers had to pay more for their sweaters. For a loss spread among all the other productive activities of the country would be comparatively minute for each. It would be impossible for anyone to know precisely how each consumer would have spent his extra $5 if he had been allowed to retain it. The overwhelming majority of the people, therefore, would probably suffer from the illusion that the new industry had cost us nothing.\nIt is important to notice that the new tariff on sweaters would not raise American wages. To be sure, it would enable Americans to work in the sweater industry at approximately the average level of American wages (for workers of their skill), instead of having to compete in that industry at the British level of wages. But there would be no increase of American wages in general as a result of the duty; for as we have seen, there would be no net increase in the number of jobs provided, no net increase in the demand for goods, and no increase in labor productivity. Labor productivity would, in fact, be reduced as a result of the tariff.\nAnd this brings us to the real effect of a tariff wall. It is not merely that all its visible gains are offset by less obvious but no less real losses. It results, in fact, in a net loss to the country. For contrary to centuries of interested propaganda and disinterested confusion, the tariff reduces the American level of wages.\nLet us observe more clearly how it does this. We have seen that the added amount which consumers pay for a tariff-protected article leaves them just that much less with which to buy all other articles. There is here no net gain to industry as a whole. But as a result of the artificial barrier erected against foreign goods, American labor, capital and land are deflected from what they can do more efficiently to what they do less efficiently. Therefore, as a result of the tariff wall the average productivity of American labor and capital is reduced.\nIf we look at it now from the consumer’s point of view, we find that he can buy less with his money. Because he has to pay more for sweaters and other protected goods, he can buy less of everything else. The general purchasing power of his income has therefore been reduced. Whether the net effect of the tariff is to lower money wages or to raise money prices will depend upon the monetary policies that are followed. But what is clear is that the tariff—though it may increase wages above what they would have been in the protected industries—must on net balance, when all occupations are considered, reduce real wages—-reduce them, that is to say, compared with what they otherwise would have been.\nOnly minds corrupted by generations of misleading propaganda can regard this conclusion as paradoxical. What other result could we expect from a policy of deliberately using our resources of capital and manpower in less efficient ways than we know how to use them? What other result could we expect from deliberately erecting artificial obstacles to trade and transportation?\nHazlitt does a little better in this second section than he did in the first one, but only a little better.  This time, I count six distinct mistakes in his secondary case for free trade.\n1.  Hazlitt makes the mistake of assuming that only domestic goods are being consumed.  As a result, he neglects to recognize that the additional $5 going towards the tariff might not necessarily be spent on domestic products.  On current statistical average, about $0.75 would be spent on imports.  This means the tariff grants $5 in domestic benefit for a domestic cost of $4.25.\n2.  By positing a 50,000 loss of jobs in other industries, Hazlitt is assuming that labor productivity is the same in all domestic industries.  However, this is unlikely, since the new sweater industry would presumably be more productive on a per-unit basis due to its more recent capital investment and therefore newer technology.  And more importantly, there is no reason to assume that the loss of domestic consumption could not be replaced with foreign consumption.  As one who subscribes to Say’s Law, (which states that supply creates its own demand), Hazlitt cannot claim that existing production in other industries will disappear simply because people are spending 20 percent more money on sweaters.\n3.  It is incorrect to state that “the new tariff on sweaters would not raise American wages”.  First, no one is going to leave their job for a new job in the sweater industry unless they get paid more and the new jobs in sweater production obviously have to precede any negative effect that eventually stems from sweater buying.  Second, the new industry will require building a large amount of new infrastructure, so there additional demand for labor outside of the industry proper will be created, thereby increasing wages outside of it as well.\n4.  It is simply false to claim that “tariffs reduce wages”.  Since there is an increased demand for labor both in and out of the sweater industry and no concomitant reduction in other industries, there is no rational basis for Hazlitt’s groundless assertion.  Even if he was correct and 50,000 jobs in the sweater industry were exchanged for 50,000 jobs outside it, the order in which those jobs would necessarily be gained and lost means that wages would go up.\n5.  Hazlitt claims that “American labor, capital and land are deflected from what they can do more efficiently to what they do less efficiently as a result of the artificial barrier erected against foreign goods”.  But this is a false assumption because it is a binary one.  The fact that American sweater manufacturing is less efficient than English sweater manufacturing does not mean that it is less efficient than any other American industry.  Especially given that in this case, we are dealing with a brand new industry with new capital investment, it will almost surely be more efficient than existing domestic industries.  It is therefore totally false to say “the average productivity of American labor and capital is reduced”.\n6.  There is no paradox.  Hazlitt’s assertion that a tariff “must” reduce real wages is simply incorrect and he repeats his error about assuming that production in the sweater industry will be less efficient than in other domestic industries on the basis of its inefficiency in comparison with English sweater manufacturing.\nI’m a little embarrassed to have to note that I missed the errors that Giraffe caught in his first comment.  He is correct to point out that Hazlitt was only looking at the $5 of domestic spending that the tariff redirects and not at the $25 that now remains in the American economy instead of leaving it and entering the English economy.",
  "tags": [
    "economics",
    "free trade",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-18T19:30:00+00:00"
}