{
  "url": "https://voxday.net/2011/06/22/mailvox-in-defense-of-ann-coulter/",
  "scraped_at": "2025-12-13T23:14:34.093714",
  "title": "Mailvox: in defense of Ann Coulter",
  "date_display": "June 22, 2011",
  "date_iso": "2011-06-22T13:30:00+00:00",
  "date_from_url": "2011-06-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>RC still believes Miss Coulter was correct to attack libertarians as “cowardly frauds”:</p><blockquote><p>Your article was interesting, but never addressed the substance of Ms. Coulter’s presentation.  You offer several examples that purport to contradict her statements.</p><p>Let’s look at one:</p><p>“It is worth noting that in some states, such as Washington, all marriage-related information was kept at the county level until 1968. And yet, civil society somehow managed to settle these issues without devolving into total chaos.”</p><p>What’s missing?  The fact that there was never previously a major societal push by homosexuals to attack the millenia-long history of traditional marriage.  Somehow you fail to identify and address that significant departure from world and US history that you purport to address.</p><p>What else is missing?  Never have historically bedrock institutions of morality like mainline religious denominations been so tolerant – nay supportive – of aberrant social behavior such as homosexuality.</p><p>There are a plethora of arguments and examples that could be given along these lines, all having to do with the current breakdown of societal mores and values at a level unprecendented since perhaps Roman times.</p><p>Don’t you see the difference?  I think Ms. Coulter was completey correct in her wry observations concerning Libertarians.  Hopefully you will, too.</p></blockquote><p>Do I see the difference?  No, I see a conservative who didn’t acknowledge a single one of the errors in Miss Coulter’s article that I pointed out.  Of course, RC is clearly a historical illiterate with no clue what he’s talking about, given his assertion that “the current breakdown of societal mores and values” is unprecedented since Roman times.  He should read Boccaccio, Solzhenitsyn, or the history of the Spanish Civil War if he wants to see what a real breakdown of societal mores and values looks like.</p><p>American culture is filth, but it is a mistake to confuse the media’s Hollywood version of it, very much skewed by its gay Jewish perspective, for the reality.  In the real world, the quarterback didn’t dump the pretty blonde cheerleader at prom in favor of the ugly Barbara Streisand wannabee, every school bully isn’t a self-hating homosexual, everyone doesn’t want to move to New York City*, and a crack team of Jewish commandos didn’t win the war in Europe.</p><p>In any event, the column sufficiently demonstrated that Coulter is very poorly situated to be labeling anyone, let alone libertarians, as “cowardly frauds”.  As Paul Gottfried noted in “<a href=\"http://takimag.com/article/the_mainstreaming_of_michelle_malkin/print\">The Mainstreaming of Michelle Malkin</a>“, it’s only a matter of time before a fame-driven media whore learns to dance to the crack of the party establishment’s whip.  No doubt Dana Loesch will be the next to look beautiful in chains.</p><p><i>“A recent syndicated column by Michelle Malkin indicates what happens to interesting conservative commentators when they sign on as GOP flacks: They become predictable Republican mouthpieces and attack dogs against the Dems….  As a Republican journalist and media entertainer, Michelle is following in the well-trod path of others such as Ann Coulter. Like Michelle, Ann started out as a very feisty rightwing news commentator, but unlike Michelle, Ann could be devastatingly witty as well as edgy. But she, too, succumbed to various pressures and became a sharp-tongued version of Sean Hannity rather than remaining a figure of the traditional right.”</i></p></div>",
  "content_text": "RC still believes Miss Coulter was correct to attack libertarians as “cowardly frauds”:\nYour article was interesting, but never addressed the substance of Ms. Coulter’s presentation.  You offer several examples that purport to contradict her statements.\nLet’s look at one:\n“It is worth noting that in some states, such as Washington, all marriage-related information was kept at the county level until 1968. And yet, civil society somehow managed to settle these issues without devolving into total chaos.”\nWhat’s missing?  The fact that there was never previously a major societal push by homosexuals to attack the millenia-long history of traditional marriage.  Somehow you fail to identify and address that significant departure from world and US history that you purport to address.\nWhat else is missing?  Never have historically bedrock institutions of morality like mainline religious denominations been so tolerant – nay supportive – of aberrant social behavior such as homosexuality.\nThere are a plethora of arguments and examples that could be given along these lines, all having to do with the current breakdown of societal mores and values at a level unprecendented since perhaps Roman times.\nDon’t you see the difference?  I think Ms. Coulter was completey correct in her wry observations concerning Libertarians.  Hopefully you will, too.\nDo I see the difference?  No, I see a conservative who didn’t acknowledge a single one of the errors in Miss Coulter’s article that I pointed out.  Of course, RC is clearly a historical illiterate with no clue what he’s talking about, given his assertion that “the current breakdown of societal mores and values” is unprecedented since Roman times.  He should read Boccaccio, Solzhenitsyn, or the history of the Spanish Civil War if he wants to see what a real breakdown of societal mores and values looks like.\nAmerican culture is filth, but it is a mistake to confuse the media’s Hollywood version of it, very much skewed by its gay Jewish perspective, for the reality.  In the real world, the quarterback didn’t dump the pretty blonde cheerleader at prom in favor of the ugly Barbara Streisand wannabee, every school bully isn’t a self-hating homosexual, everyone doesn’t want to move to New York City*, and a crack team of Jewish commandos didn’t win the war in Europe.\nIn any event, the column sufficiently demonstrated that Coulter is very poorly situated to be labeling anyone, let alone libertarians, as “cowardly frauds”.  As Paul Gottfried noted in “\nThe Mainstreaming of Michelle Malkin\n“, it’s only a matter of time before a fame-driven media whore learns to dance to the crack of the party establishment’s whip.  No doubt Dana Loesch will be the next to look beautiful in chains.\n“A recent syndicated column by Michelle Malkin indicates what happens to interesting conservative commentators when they sign on as GOP flacks: They become predictable Republican mouthpieces and attack dogs against the Dems….  As a Republican journalist and media entertainer, Michelle is following in the well-trod path of others such as Ann Coulter. Like Michelle, Ann started out as a very feisty rightwing news commentator, but unlike Michelle, Ann could be devastatingly witty as well as edgy. But she, too, succumbed to various pressures and became a sharp-tongued version of Sean Hannity rather than remaining a figure of the traditional right.”",
  "tags": [
    "mailvox",
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-22T12:30:00+00:00"
}