{
  "url": "https://voxday.net/2011/06/12/mailvox-double-whammy/",
  "scraped_at": "2025-12-13T23:13:33.901267",
  "title": "Mailvox: the double whammy",
  "date_display": "June 12, 2011",
  "date_iso": "2011-06-12T10:50:00+00:00",
  "date_from_url": "2011-06-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This may be well be my favorite critical email ever received, as KW manages to not only highlight several of my assertions about the more militant atheists, but to underline, italicize, and bold them as well:</p><blockquote><p>I have been reading assorted texts on the internet and I came across a post that you made a long while back entitled “The socially autistic atheist”. I was particularly interested in your articles because I happen to be both an atheist and an aspie.</p><p>It seems to me that the purpose of these articles is to use an ad hominem attack against atheists by calling them “socially autistic” or saying that they have “autistic psychopathy”. You never refute or even address the arguments that these “socially autistic atheists” have in regard to religion or god. In essence, I believe that you are just being a giant asshat troll.</p><p>In a previous article you wrote this: <i>Here’s an object lesson that perhaps might be capable of penetrating the skulls of even the most autistically psychopathic. (1) Do you dislike being described as a socially autistic asshole? (2) Would you like it any more if that description was scientifically proven to describe you accurately? (3) Would you consider it polite and/or socially acceptable for me to insist on always describing you to others as an autistic psychopath were this proven to be an accurate description of you?</i></p><p>I assume that this was a reaction to certain aspie atheists spreading the idea that belief in god is a delusion, or that people who believe in god are deluded.  well to answer your questions: <br> 1. No of course not. I think that an important distinction to make is that it is an attack on WHO I AM rather than an attack on WHAT I BELIEVE.<br> 2. You are asking a question about a hypothetical scientific description where that hypothetical scientific description would not be scientific. It would however be a logical fallacy (an appeal to authority in this case).I’ll go ahead and say no.<br> 3. No, and I would likely react violently to such discrimination.</br></br></br></p><p>Whenever an atheist says that god is a delusion, that is not an attack on any person. It is an attack on an idea. Unlike when you call me a “autistic psychopath”, which is very clearly an attack on who I am as a person. There is no moral equivalence for these statements.  TL;DR you are a despicable person who resorts to fighting your intellectual opponents with ad hominem attacks.</p><p>I would have expected that you would have already been shamed into making an apology about statements such as this. You are not an expert on autism and you should shut your stupid fucking mouth in my opinion.</p><p>With disgust and contempt,<br> [KW]</br></p></blockquote><p>Naturally, I replied with all the kindness and moderation for which I am so justly known, considering that the poor lad has about the same chance of ever landing a girlfriend that I have of being named the premier of China.  Let’s face it, I couldn’t not respond.  I mean, how could I possibly resist the irony of being lectured on the niceties of correct social conventions by an atheist… an atheist <i>with Asperger’s</i>.</p><p><i>My dear boy,</i></p><p>I absolutely believe your claim to be both an atheist and an aspie.  Only someone so intellectually handicapped would be so spectacularly stupid as to claim “You never refute or even address the arguments that these “socially autistic atheists” have in regard to religion or god.”</p><p>The fact that I have written and published an entire book on the subject that does precisely what you claim I have never done would appear to be sufficient to invalidate your assertion.  You can even download a powerpoint slideshow that summarizes some of the more commonly heard arguments from the likes of Richard Dawkins and Sam Harris should you be so inclined.  So, congratulations.  In ten years of writing controversial op/ed columns and being the recipient of the most vehement forms of criticism from the Council on American-Islamic Relations to godless Sciencebloggers, you have managed to write the single most ignorant email I have ever received.  You do Asperger proud.</p><p>In respect of your handicap, I shall refrain from pointing out the additional errors you have committed in your response to my questions, although I do invite you to contemplate the moral basis for what you claim is a lack of moral equivalence between the various statements.</p><p>With no little amusement,<br> Vox</br></p><p>And now it’s time for the moral of the story.  If you happen to suffer from atheism, Asperger’s Syndrome, or autism, the chances are exceedingly high that your ideas concerning what is and what is not socially acceptable behavior are not going to be in accordance with the societal norms of the neurotypical majority.  Therefore, your offers to help others better understand proper social etiquette, however kindly intended they might be, are virtually guaranteed to go badly awry.</p></div>",
  "content_text": "This may be well be my favorite critical email ever received, as KW manages to not only highlight several of my assertions about the more militant atheists, but to underline, italicize, and bold them as well:\nI have been reading assorted texts on the internet and I came across a post that you made a long while back entitled “The socially autistic atheist”. I was particularly interested in your articles because I happen to be both an atheist and an aspie.\nIt seems to me that the purpose of these articles is to use an ad hominem attack against atheists by calling them “socially autistic” or saying that they have “autistic psychopathy”. You never refute or even address the arguments that these “socially autistic atheists” have in regard to religion or god. In essence, I believe that you are just being a giant asshat troll.\nIn a previous article you wrote this:\nHere’s an object lesson that perhaps might be capable of penetrating the skulls of even the most autistically psychopathic. (1) Do you dislike being described as a socially autistic asshole? (2) Would you like it any more if that description was scientifically proven to describe you accurately? (3) Would you consider it polite and/or socially acceptable for me to insist on always describing you to others as an autistic psychopath were this proven to be an accurate description of you?\nI assume that this was a reaction to certain aspie atheists spreading the idea that belief in god is a delusion, or that people who believe in god are deluded.  well to answer your questions:\n1. No of course not. I think that an important distinction to make is that it is an attack on WHO I AM rather than an attack on WHAT I BELIEVE.\n2. You are asking a question about a hypothetical scientific description where that hypothetical scientific description would not be scientific. It would however be a logical fallacy (an appeal to authority in this case).I’ll go ahead and say no.\n3. No, and I would likely react violently to such discrimination.\nWhenever an atheist says that god is a delusion, that is not an attack on any person. It is an attack on an idea. Unlike when you call me a “autistic psychopath”, which is very clearly an attack on who I am as a person. There is no moral equivalence for these statements.  TL;DR you are a despicable person who resorts to fighting your intellectual opponents with ad hominem attacks.\nI would have expected that you would have already been shamed into making an apology about statements such as this. You are not an expert on autism and you should shut your stupid fucking mouth in my opinion.\nWith disgust and contempt,\n[KW]\nNaturally, I replied with all the kindness and moderation for which I am so justly known, considering that the poor lad has about the same chance of ever landing a girlfriend that I have of being named the premier of China.  Let’s face it, I couldn’t not respond.  I mean, how could I possibly resist the irony of being lectured on the niceties of correct social conventions by an atheist… an atheist\nwith Asperger’s\n.\nMy dear boy,\nI absolutely believe your claim to be both an atheist and an aspie.  Only someone so intellectually handicapped would be so spectacularly stupid as to claim “You never refute or even address the arguments that these “socially autistic atheists” have in regard to religion or god.”\nThe fact that I have written and published an entire book on the subject that does precisely what you claim I have never done would appear to be sufficient to invalidate your assertion.  You can even download a powerpoint slideshow that summarizes some of the more commonly heard arguments from the likes of Richard Dawkins and Sam Harris should you be so inclined.  So, congratulations.  In ten years of writing controversial op/ed columns and being the recipient of the most vehement forms of criticism from the Council on American-Islamic Relations to godless Sciencebloggers, you have managed to write the single most ignorant email I have ever received.  You do Asperger proud.\nIn respect of your handicap, I shall refrain from pointing out the additional errors you have committed in your response to my questions, although I do invite you to contemplate the moral basis for what you claim is a lack of moral equivalence between the various statements.\nWith no little amusement,\nVox\nAnd now it’s time for the moral of the story.  If you happen to suffer from atheism, Asperger’s Syndrome, or autism, the chances are exceedingly high that your ideas concerning what is and what is not socially acceptable behavior are not going to be in accordance with the societal norms of the neurotypical majority.  Therefore, your offers to help others better understand proper social etiquette, however kindly intended they might be, are virtually guaranteed to go badly awry.",
  "tags": [
    "atheism",
    "mailvox",
    "W:AWCAAWA"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-12T09:50:00+00:00"
}