{
  "url": "https://voxday.net/2011/06/19/mailvox-free-trader-defends-hazli/",
  "scraped_at": "2025-12-13T23:14:19.512026",
  "title": "Mailvox: a free trader defends Hazlitt",
  "date_display": "June 19, 2011",
  "date_iso": "2011-06-19T13:30:00+00:00",
  "date_from_url": "2011-06-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Much to his credit, Jake sets aside his “nations don’t exist” position long enough to attempt a courageous defense of <a href=\"http://www.milobookclub.com/2011/06/18/mailvox-hazlitt-international-trade_18/\">the second aspect of Hazlitt’s case for free trade</a>, which consists of an argument against using a tariff to establish a new industry.  I have to commend Jake for taking the time to put in this effort, as I vastly prefer to see those who disagree with me honestly attempt straightforward defenses of their positions than to watch them skulk away in stubborn silence.  Quotes from my post are in bold while Jake’s words are italicized.</p><p>1. <b>The tariff grants $5 in domestic benefit for a domestic cost of $4.25.</b></p><p><i>It’s all the same. The $0.75 spent abroad is going to wind up buying American exports sooner or later. The only alternative is that they take the $0.75 and bury it, burn it, or otherwise not “cash in” their claim on American goods or resources. This “worse case” scenario amounts essentially to our trade partner “giving” the USA sweaters for nothing but green pieces of paper. Hardly a calamity for the US. I think this is what is happening to account for the oft-mentioned “trade deficit”, basically we’re importing cars, electronics, oil, food, etc and paying nothing but paper money for them. We’ve gotten away with this for a long time because of the Dollar’s status as the world’s reserve currency, foreign nations want dollars not only, or even primarily, for the American goods they can buy, but because every dollar they hold is a base on which they could pyramid more fiat money of their own. I agree this is a bad thing (long-term) and represents a serious disadvantage to domestic manufacturers, but the problem is the monetary policy, not trade. And cutting foreign trade won’t fix our problem or raise our living standards.</i></p><p>It’s not all the same.  Jake has made the same error here that Hazlitt made in his primary argument, specifically <a href=\"http://www.milobookclub.com/2011/06/14/mailvox-hazlitt-international-trade-2/\">errors #3 and 4</a>.  It’s not just a long-term issue, it is an immediate and more pressing short-term issue as well.  Since it is a fact that the money may not come back to the United States for at least 35 years, the purported exports simply do not exist and their benefits cannot be assumed during the expected career of the average worker.  And frankly, it should be deeply embarrassing for anyone with Austrian pretensions (referring to Hazlitt here, not Jake), to fail to recognize the massive importance of the TIME ELEMENT in economic transactions.</p><p>2. <b>By positing a 50,000 loss of jobs in other industries, Hazlitt is assuming that labor productivity is the same in all domestic industries…. And more importantly, there is no reason to assume that the loss of domestic consumption could not be replaced with foreign consumption.</b></p><p><i>If exports are going to increase to offset the reduction in domestic demand brought about by a tariff increasing prices then we’re still going to be importing something in exchange the exports. We have to remember that a tariff on imports also harms exporting industries as they find it harder to sell their goods abroad. Also, even if domestic industries can find new markets abroad to offset reduced domestic consumption it will obviously be at a lower profit (else why wouldn’t have have already been exporting in larger quantities?).</i></p><p>Jake repeats his first error here and compounds it by committing new ones.  It is totally incorrect to assume that all import tariffs are met with an immediate and equal response with tariffs on exports from other nations.  The USA is not about to slap a tariff on Saudi oil simply because the Saudis decide to tax the import of American automobiles.  This is the result of either willful theoretical blindness or complete ignorance of the existing and easily verified difference in tariff rates that now exist between countries.  Nor must the exports necessarily be at a lower profit, for as Adam Smith pointed out, manufacturers first attempt to sell domestically because it is easier, not because it is more profitable.</p><p>3. <b>It is incorrect to state that “the new tariff on sweaters would not raise American wages”</b></p><p><i>Well it’ll certainly raise wages in the sweater industry, but I don’t think that’s what Hazlitt is getting at here. Rather, he’s saying it will also lower wages in other industries that are harmed by the tariff either through reduced domestic demand for their products or reduced international demand caused by the reduction in trade a tariff brings. My reading of Hazlitt was that wages in the protected sector would rise (obviously) at the expense of wages in all other areas and general living standards. All we can say about the impact of the tariff on net is that because we’re reducing the division of labor and specialization we’d expect a negative net result.</i></p><p>Of course that’s what Hazlitt is saying.  But both Jake and Hazlitt are incorrect, because the domestic division of labor is not being reduced, it is being expanded.  Jake didn’t even address the point I made about higher wages in the new industry necessarily driving average wages higher.  Even if we accept Hazlitt’s incorrect assumptions about jobs being lost, he is simply incoherent on the issue.  If 50k sweater jobs replace 50k non-sweater jobs and the new sweater jobs have higher wages than the jobs they replace, average wages will obviously rise.</p><p>4. <b>It is simply false to claim that “tariffs reduce wages”….  Even if he was correct and 50,000 jobs in the sweater industry were exchanged for 50,000 jobs outside it, the order in which those jobs would necessarily be gained and lost means that wages would go up.</b></p><p><i>But I think there would be a reduction in other industries as I discuss above. As well as a increase in the cost of living, which translates into a reduction in real wages.</i></p><p>Jake thinks wrong, as I show above.  Moreover, he erroneously concludes that a second order effect must outweigh a first order effect.</p><p>5. <b>The fact that American sweater manufacturing is less efficient than English sweater manufacturing does not mean that it is less efficient than any other American industry.</b></p><p><i>If it were true that American sweater manufacturing could be more efficient than alternative uses of capital within the US (even given still more efficient international production) then why would the tariff be needed? Wouldn’t entrepreneurs freely choose to divert capital from the less efficient US industries into sweater manufacturing if this were the case?</i></p><p>Because the relevant comparison is between the various efficiencies between the sweater-making industries and not between the efficiencies of the various domestic industries.  It’s also useful to remember that entrepreneurs seldom operate outside their areas of expertise.  It doesn’t matter how much more profitable it might be to make wireless tablets than tablecloths, as the average textile manufacturer is not going to start trying to compete with Apple simply because the profit margin is better in the tablet industry.</p><p>6. <b>There is no paradox. Hazlitt’s assertion that a tariff “must” reduce real wages is simply incorrect and he repeats his error about assuming that production in the sweater industry will be less efficient than in other domestic industries on the basis of its inefficiency in comparison with English sweater manufacturing.”</b></p><p><i>Hazltt doesn’t say there’s a paradox, he says:  “Only minds corrupted by generations of misleading propaganda can regard this conclusion as paradoxical.”</i></p><p>He DOES say that the tariff will divert resources into less productive ends and there I think he is right regardless of your assertion to the contrary. As I said in response to 5. If more efficient/productive uses of capital were available we wouldn’t need a tariff to get capital moving towards those uses, it’d happen spontaneously. This is (obviously) not to say that conditions under a free-market represent the perfect allocation of resources, but that it does continuously trend in that direction and that there is no alternative source of information on which one can argue that the market outcome is, in fact, sub optimal. In other words, if the market says the best use of resources is to import British sweaters and export grains, cars and technology then that may not be the absolute optimum perfect approach, but it is the best approach anyone has at that point been able to find, and those who say they know a better way, but require coercion and taxation to get there, are probably self-serving.</p><p>Very well, I accept that I should have simply pointed out that there is no paradox and no one actually believes there is a paradox.  Hazlitt has erected a straw man.  But Jake is still wrong as the spontaneous movement of capital he posits isn’t going to happen because the fact that American sweater-making might be more efficient than American widget-assembling is irrelevant so long as American sweaters can’t effectively compete on price with imported English sweaters.  He is merely repeating his earlier error in point 5.  Moreover, he doesn’t even attempt to defend Hazlitt’s erroneous statement that a tariff must reduce real wages.</p><p>As for the accusation that anyone who doubts that the international free market is the best approach anyone has been able to find is “probably self-serving”, that is simply an invalid <i>ad hominem</i> argument that is irrelevant, and in my case, incorrect.  I absolutely benefit from the present US free trade regime and am nevertheless presenting an intellectual case that would be to my material detriment if it were to be adopted as US trade policy.  As always, the facts are what they are and the truth is what it is regardless of whatever anyone happens to believe them to be.  While there are many genuine reasons to be deeply concerned about the ability of any government to implement restrictions on free trade in a manner that is a net benefit to the entire nation, this does not change the fact that the foundations of international free trade ideology are riddled with flawed assumptions and false logic.</p></div>",
  "content_text": "Much to his credit, Jake sets aside his “nations don’t exist” position long enough to attempt a courageous defense of\nthe second aspect of Hazlitt’s case for free trade\n, which consists of an argument against using a tariff to establish a new industry.  I have to commend Jake for taking the time to put in this effort, as I vastly prefer to see those who disagree with me honestly attempt straightforward defenses of their positions than to watch them skulk away in stubborn silence.  Quotes from my post are in bold while Jake’s words are italicized.\n1.\nThe tariff grants $5 in domestic benefit for a domestic cost of $4.25.\nIt’s all the same. The $0.75 spent abroad is going to wind up buying American exports sooner or later. The only alternative is that they take the $0.75 and bury it, burn it, or otherwise not “cash in” their claim on American goods or resources. This “worse case” scenario amounts essentially to our trade partner “giving” the USA sweaters for nothing but green pieces of paper. Hardly a calamity for the US. I think this is what is happening to account for the oft-mentioned “trade deficit”, basically we’re importing cars, electronics, oil, food, etc and paying nothing but paper money for them. We’ve gotten away with this for a long time because of the Dollar’s status as the world’s reserve currency, foreign nations want dollars not only, or even primarily, for the American goods they can buy, but because every dollar they hold is a base on which they could pyramid more fiat money of their own. I agree this is a bad thing (long-term) and represents a serious disadvantage to domestic manufacturers, but the problem is the monetary policy, not trade. And cutting foreign trade won’t fix our problem or raise our living standards.\nIt’s not all the same.  Jake has made the same error here that Hazlitt made in his primary argument, specifically\nerrors #3 and 4\n.  It’s not just a long-term issue, it is an immediate and more pressing short-term issue as well.  Since it is a fact that the money may not come back to the United States for at least 35 years, the purported exports simply do not exist and their benefits cannot be assumed during the expected career of the average worker.  And frankly, it should be deeply embarrassing for anyone with Austrian pretensions (referring to Hazlitt here, not Jake), to fail to recognize the massive importance of the TIME ELEMENT in economic transactions.\n2.\nBy positing a 50,000 loss of jobs in other industries, Hazlitt is assuming that labor productivity is the same in all domestic industries…. And more importantly, there is no reason to assume that the loss of domestic consumption could not be replaced with foreign consumption.\nIf exports are going to increase to offset the reduction in domestic demand brought about by a tariff increasing prices then we’re still going to be importing something in exchange the exports. We have to remember that a tariff on imports also harms exporting industries as they find it harder to sell their goods abroad. Also, even if domestic industries can find new markets abroad to offset reduced domestic consumption it will obviously be at a lower profit (else why wouldn’t have have already been exporting in larger quantities?).\nJake repeats his first error here and compounds it by committing new ones.  It is totally incorrect to assume that all import tariffs are met with an immediate and equal response with tariffs on exports from other nations.  The USA is not about to slap a tariff on Saudi oil simply because the Saudis decide to tax the import of American automobiles.  This is the result of either willful theoretical blindness or complete ignorance of the existing and easily verified difference in tariff rates that now exist between countries.  Nor must the exports necessarily be at a lower profit, for as Adam Smith pointed out, manufacturers first attempt to sell domestically because it is easier, not because it is more profitable.\n3.\nIt is incorrect to state that “the new tariff on sweaters would not raise American wages”\nWell it’ll certainly raise wages in the sweater industry, but I don’t think that’s what Hazlitt is getting at here. Rather, he’s saying it will also lower wages in other industries that are harmed by the tariff either through reduced domestic demand for their products or reduced international demand caused by the reduction in trade a tariff brings. My reading of Hazlitt was that wages in the protected sector would rise (obviously) at the expense of wages in all other areas and general living standards. All we can say about the impact of the tariff on net is that because we’re reducing the division of labor and specialization we’d expect a negative net result.\nOf course that’s what Hazlitt is saying.  But both Jake and Hazlitt are incorrect, because the domestic division of labor is not being reduced, it is being expanded.  Jake didn’t even address the point I made about higher wages in the new industry necessarily driving average wages higher.  Even if we accept Hazlitt’s incorrect assumptions about jobs being lost, he is simply incoherent on the issue.  If 50k sweater jobs replace 50k non-sweater jobs and the new sweater jobs have higher wages than the jobs they replace, average wages will obviously rise.\n4.\nIt is simply false to claim that “tariffs reduce wages”….  Even if he was correct and 50,000 jobs in the sweater industry were exchanged for 50,000 jobs outside it, the order in which those jobs would necessarily be gained and lost means that wages would go up.\nBut I think there would be a reduction in other industries as I discuss above. As well as a increase in the cost of living, which translates into a reduction in real wages.\nJake thinks wrong, as I show above.  Moreover, he erroneously concludes that a second order effect must outweigh a first order effect.\n5.\nThe fact that American sweater manufacturing is less efficient than English sweater manufacturing does not mean that it is less efficient than any other American industry.\nIf it were true that American sweater manufacturing could be more efficient than alternative uses of capital within the US (even given still more efficient international production) then why would the tariff be needed? Wouldn’t entrepreneurs freely choose to divert capital from the less efficient US industries into sweater manufacturing if this were the case?\nBecause the relevant comparison is between the various efficiencies between the sweater-making industries and not between the efficiencies of the various domestic industries.  It’s also useful to remember that entrepreneurs seldom operate outside their areas of expertise.  It doesn’t matter how much more profitable it might be to make wireless tablets than tablecloths, as the average textile manufacturer is not going to start trying to compete with Apple simply because the profit margin is better in the tablet industry.\n6.\nThere is no paradox. Hazlitt’s assertion that a tariff “must” reduce real wages is simply incorrect and he repeats his error about assuming that production in the sweater industry will be less efficient than in other domestic industries on the basis of its inefficiency in comparison with English sweater manufacturing.”\nHazltt doesn’t say there’s a paradox, he says:  “Only minds corrupted by generations of misleading propaganda can regard this conclusion as paradoxical.”\nHe DOES say that the tariff will divert resources into less productive ends and there I think he is right regardless of your assertion to the contrary. As I said in response to 5. If more efficient/productive uses of capital were available we wouldn’t need a tariff to get capital moving towards those uses, it’d happen spontaneously. This is (obviously) not to say that conditions under a free-market represent the perfect allocation of resources, but that it does continuously trend in that direction and that there is no alternative source of information on which one can argue that the market outcome is, in fact, sub optimal. In other words, if the market says the best use of resources is to import British sweaters and export grains, cars and technology then that may not be the absolute optimum perfect approach, but it is the best approach anyone has at that point been able to find, and those who say they know a better way, but require coercion and taxation to get there, are probably self-serving.\nVery well, I accept that I should have simply pointed out that there is no paradox and no one actually believes there is a paradox.  Hazlitt has erected a straw man.  But Jake is still wrong as the spontaneous movement of capital he posits isn’t going to happen because the fact that American sweater-making might be more efficient than American widget-assembling is irrelevant so long as American sweaters can’t effectively compete on price with imported English sweaters.  He is merely repeating his earlier error in point 5.  Moreover, he doesn’t even attempt to defend Hazlitt’s erroneous statement that a tariff must reduce real wages.\nAs for the accusation that anyone who doubts that the international free market is the best approach anyone has been able to find is “probably self-serving”, that is simply an invalid\nad hominem\nargument that is irrelevant, and in my case, incorrect.  I absolutely benefit from the present US free trade regime and am nevertheless presenting an intellectual case that would be to my material detriment if it were to be adopted as US trade policy.  As always, the facts are what they are and the truth is what it is regardless of whatever anyone happens to believe them to be.  While there are many genuine reasons to be deeply concerned about the ability of any government to implement restrictions on free trade in a manner that is a net benefit to the entire nation, this does not change the fact that the foundations of international free trade ideology are riddled with flawed assumptions and false logic.",
  "tags": [
    "economics",
    "free trade",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-19T12:30:00+00:00"
}