{
  "url": "https://voxday.net/2011/06/14/mailvox-hazlitt-international-trade-2/",
  "scraped_at": "2025-12-13T23:13:43.141805",
  "title": "Mailvox: The Hazlitt international trade challenge",
  "date_display": "June 14, 2011",
  "date_iso": "2011-06-14T08:00:00+00:00",
  "date_from_url": "2011-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ampontan posed a free trade-related challenge:</p><blockquote><p>When you can offer a serious critique of Chapter 11 of Hazlitt’s Economics in One Easy Lesson without using buzzwords like “bizarre”, I might begin to take this argument seriously.</p></blockquote><p>I find it rather difficult to resist a direct and substantive intellectual challenge, particularly when it stems from an intelligent and knowledgeable source.  Throw in the fact that Hazlitt is an economist for whom I have a good deal of respect – his demolition of Keynes’s General Theory is still one of the most thorough available – so this was practically perfect Voxbait.  After reading the chapter through twice, I’ve decided that I’m not going to address the entirety of it in a single post, but will instead address Hazlitt’s core argument in a detailed manner which will not necessarily conclude the case, but should suffice to convince doubters that the anti-free trade argument at least merits being taken seriously by libertarians and Austrians alike.</p><p>(Note to self: do not use “bizarre” or other buzzwords in the process.)</p><p>Hazlitt writes: <i>An American manufacturer of woolen sweaters goes to Congress or to the State Department and tells the committee or officials concerned that it would be a national disaster for them to remove or reduce the tariff on British sweaters. He now sells his sweaters for $30 each, but English manufacturers could sell their sweaters of the same quality for $25. A duty of $5, therefore, is needed to keep him in business. He is not thinking of himself, of course, but of the thousand men and women he employs, and of the people to whom their spending in turn gives employment. Throw them out of work, and you create unemployment and a fall in purchasing power, which would spread in ever-widening circles. And if he can prove that he really would be forced out of business if the tariff were removed or reduced, his argument against that action is regarded by Congress as conclusive.</i></p><p>But the fallacy comes from looking merely at this manufacturer and his employees, or merely at the American sweater industry. It comes from noticing only the results that are immediately seen, and neglecting the results that are not seen because they are prevented from coming into existence.</p><p>The lobbyists for tariff protection are continually putting forward arguments that are not factually correct. But let us assume that the facts in this case are precisely as the sweater manufacturer has stated them. Let us assume that a tariff of $5 a sweater is necessary for him to stay in business and provide employment at sweater-making for his workers.</p><p>We have deliberately chosen the most unfavorable example of any for the removal of a tariff. We have not taken an argument for the imposition of a new tariff in order to bring a new industry into existence, but an argument for the retention of a tariff that has already brought an industry into existence, and cannot be repealed without hurting somebody.</p><p>The tariff is repealed; the manufacturer goes out of business; a thousand workers are laid off; the particular tradesmen whom they patronized are hurt. This is the immediate result that is seen. But there are also results which, while much more difficult to trace, are no less immediate and no less real. For now sweaters that formerly cost retail $30 apiece can be bought for $25. Consumers can now buy the same quality of sweater for less money, or a much better one for the same money. If they buy the same quality of sweater, they not only get the sweater, but they have $5 left over, which they would not have had under the previous conditions, to buy something else. With the $25 that they pay for the imported sweater they help employment—as the American manufacturer no doubt predicted — in the sweater industry in England. With the $5 left over they help employment in any number of other industries in the United States.</p><p>But the results do not end there. By buying English sweaters they furnish the English with dollars to buy American goods here. This, in fact (if I may here disregard such complications as fluctuating exchange rates, loans, credits, etc.) is the only way in which the British can eventually make use of these dollars. Because we have permitted the British to sell more to us, they are now able to buy more from us. They are, in fact, eventually forced to buy more from us if their dollar balances are not to remain perpetually unused. So as a result of letting in more British goods, we must export more American goods. And though fewer people are now employed in the American sweater industry, more people are employed—and much more efficiently employed—in, say, the American washing-machine or aircraft-building business. American employment on net balance has not gone down, but American and British production on net balance has gone up. Labor in each country is more fully employed in doing just those things that it does best, instead of being forced to do things that it does inefficiently or badly. Consumers in both countries are better off. They are able to buy what they want where they can get it cheapest. American consumers are better provided with sweaters, and British consumers are better provided with washing machines and aircraft.</p><p>I count seven unwarranted assumptions on Hazlitt’s part that render his primary argument in support of free trade incorrect and therefore invalid.  They are as follows:</p><p>1.  Hazlitt assumes that manufacturers are the primary beneficiaries from barriers to trade and therefore the leading advocates of them.  This may have once been true, but it is clearly no longer the case. <i>Economics in One Lesson</i> was published in 1946, when the U.S. balance of trade ran a 35 percent surplus and trade amounted to 6.8 percent of GDP.  Free trade was operating to the benefit of most American manufacturers and workers alike; since the industrial infrastructures of Europe and Asia were in ruins, few American sectors were at a competitive disadvantage.  Like Ricardo, Hazlitt clearly never imagined a scenario when jobs would not be lost to foreign manufacturing competitors, but to the new foreign factories established by the former domestic manufacturers.  The additional profit provided by a $5 tariff is now of less interest to the domestic manufacturer than the opportunity to set up a factory in Bangladesh, make the sweater at a lower cost, then import it and sell it for $25.  If we leave out the distribution channel which is the same for both foreign and domestic manufacturers and assume a profit margin of 50 percent, we can compare the profit margins of the various alternatives.  At the 50 percent profit margin, we know that the manufacturer’s domestic costs were $15 and his profit was $15 with the protection of the $5 tariff.  But Bangladesh has a wage rate that is one-thirtieth that of the USA, so if labor is one-third the cost of production and international shipping is 10 percent of the manufacturing cost, his new production and delivery cost will be $11.17.  This reduction of $3.83 in costs means the offshored manufacturer can now afford to sell the imported sweater for 22.34 and still make the same 50 percent profit margin he did before; without tariffs he can compete on price with the $25 English sweaters and actually increase his profit margin by nearly six percent.  At the old $30 price, his profit margin has risen to 63 percent, thereby creating a serious incentive to move production to Bangladesh <i>even in the absence of any price pressure from the English sweater makers</i>.  Either way, the consumers benefit, the manufacturer benefits, and only the thousands of workers, who lost their $5/sweater jobs, suffer.</p><p>So, the $5 tariff not only protects the domestic manufacturer from the English competitor, but more importantly, protects the worker from the domestic manufacturer as it would reduce his potential profit margin from 63 percent to 46 percent.  With the tariff in place, the domestic manufacturer has no reason to go to all the trouble and expense to relocate his factory to Bangladesh simply to lose four percent from his profit margin.  It is also worth nothing that since Hazlitt was implying a profit margin much lower than the 50 percent I utilized for the purposes of comparison, the difference between going offshore and not going offshore might not be an additional 13 percent profit, but the difference between the survival of the business and its failure.  Hazlitt’s error here is the result of the failure of the theory of comparative advantage to account for the international mobility of capital.</p><p>2.  Hazlitt asserts that the $5 left over from the reduced import price of the sweater will go to help employment in any number of other industries in the United States.  It may.  Or it may not.  Again, Hazlitt was writing when imports accounted for a trivial 2.9 percent of GDP.  They now account for 15.8 percent, so that $5 is five times more likely to go towards helping employment in industries outside the United States than it was in 1946.  Statistically speaking, what would be $5 of the tariff going towards U.S. employment must be reduced to $4.25.  This error can also be traced back to Ricardo’s assumptions, although it is not one of the seven that Fletcher lists.</p><p>3.  Hazlitt erroneously assumes that the British will buy more from the USA because they will be forced to buy more American goods due to their possession of dollars.  This is untrue because the dollar is the world’s reserve currency and is often utilized for trade between foreign countries; the British are no more forced to buy American goods due to their possession of dollars than the Thebans were forced to buy from Athenian goods due to their possession of silver talents.</p><p>4.  Hazlitt assumes that foreign dollar balances cannot remain perpetually unused.  (By “unused” he means unspent in the USA).  But there are $610 billion in Eurodollars in foreign banks that will never be used, which <i>is more than the entire amount of annual U.S. exports</i> as recently as 1990!  Furthermore, the U.S. has been running a continuous and growing balance of trade deficit in goods since 1976.  The $9 billion that went overseas has not only not returned to be spent here, but has increased to $646 billion.</p><p>35 years and counting is a long time to wait for this postulated inevitable return, and is unlikely to do any good for the worker who lost his job more than three decades ago.</p><p>5.  Hazlitt assumes that an American worker who loses his job in one sector will automatically find it in another sector.  This is Ricardo’s sixth false assumption identified by Fletcher: “Production factors move easily between domestic industries.”  There is no reason to assume that the loss of a job in one sector will create any additional demand in another sector, indeed, to the extent there is worker mobility between industries, all the loss of the job in the one sector will do is create downward pressure on wages in the other sector.  There is a hidden and implicit appeal to James Mill here, (or alternatively, to Keynes’s critical formulation of Say’s Law), in the idea that supply somehow magically creates demand.  While this <i>can</i> be true in a technological sense, as there was no demand for CD players prior to their invention, it is not an economic law as the excess supply of U.S. housing or the dead inventory stock of any business will demonstrate.</p><p>6.  Hazlitt assumes that American employment on net balance will not go down and that American and British production on net balance will go up.  This is not necessrily true, being an erroneous conclusion based on the previous false assumption.  The American worker may well remain unemployed on a permanent basis, as have one-quarter of the once-employed male workers since 1948.</p><p>7.  Hazlitt assumes that consumers in both countries are better off because they are able to buy what they want where they can get it cheapest.  But this is a false assumption because most consumers are also workers or are dependent upon workers.  The consumer who is employed can better afford the $30 sweater than the unemployed consumer can the $25 one.  Free trade does work to the minor advantage of some Americans as well as to its foreign beneficiaries, but at an inordinately heavy short-term cost to around 25 percent of Americans and a severe long-term cost to the entire American economy.</p><p>I shall leave it to Ampontan to determine whether this response justifies taking the argument seriously in the future.  I freely admit that I have not yet addressed the entire chapter, only one-third of it, but I expect to do so in another post or two in the reasonably near future.</p></div>",
  "content_text": "Ampontan posed a free trade-related challenge:\nWhen you can offer a serious critique of Chapter 11 of Hazlitt’s Economics in One Easy Lesson without using buzzwords like “bizarre”, I might begin to take this argument seriously.\nI find it rather difficult to resist a direct and substantive intellectual challenge, particularly when it stems from an intelligent and knowledgeable source.  Throw in the fact that Hazlitt is an economist for whom I have a good deal of respect – his demolition of Keynes’s General Theory is still one of the most thorough available – so this was practically perfect Voxbait.  After reading the chapter through twice, I’ve decided that I’m not going to address the entirety of it in a single post, but will instead address Hazlitt’s core argument in a detailed manner which will not necessarily conclude the case, but should suffice to convince doubters that the anti-free trade argument at least merits being taken seriously by libertarians and Austrians alike.\n(Note to self: do not use “bizarre” or other buzzwords in the process.)\nHazlitt writes:\nAn American manufacturer of woolen sweaters goes to Congress or to the State Department and tells the committee or officials concerned that it would be a national disaster for them to remove or reduce the tariff on British sweaters. He now sells his sweaters for $30 each, but English manufacturers could sell their sweaters of the same quality for $25. A duty of $5, therefore, is needed to keep him in business. He is not thinking of himself, of course, but of the thousand men and women he employs, and of the people to whom their spending in turn gives employment. Throw them out of work, and you create unemployment and a fall in purchasing power, which would spread in ever-widening circles. And if he can prove that he really would be forced out of business if the tariff were removed or reduced, his argument against that action is regarded by Congress as conclusive.\nBut the fallacy comes from looking merely at this manufacturer and his employees, or merely at the American sweater industry. It comes from noticing only the results that are immediately seen, and neglecting the results that are not seen because they are prevented from coming into existence.\nThe lobbyists for tariff protection are continually putting forward arguments that are not factually correct. But let us assume that the facts in this case are precisely as the sweater manufacturer has stated them. Let us assume that a tariff of $5 a sweater is necessary for him to stay in business and provide employment at sweater-making for his workers.\nWe have deliberately chosen the most unfavorable example of any for the removal of a tariff. We have not taken an argument for the imposition of a new tariff in order to bring a new industry into existence, but an argument for the retention of a tariff that has already brought an industry into existence, and cannot be repealed without hurting somebody.\nThe tariff is repealed; the manufacturer goes out of business; a thousand workers are laid off; the particular tradesmen whom they patronized are hurt. This is the immediate result that is seen. But there are also results which, while much more difficult to trace, are no less immediate and no less real. For now sweaters that formerly cost retail $30 apiece can be bought for $25. Consumers can now buy the same quality of sweater for less money, or a much better one for the same money. If they buy the same quality of sweater, they not only get the sweater, but they have $5 left over, which they would not have had under the previous conditions, to buy something else. With the $25 that they pay for the imported sweater they help employment—as the American manufacturer no doubt predicted — in the sweater industry in England. With the $5 left over they help employment in any number of other industries in the United States.\nBut the results do not end there. By buying English sweaters they furnish the English with dollars to buy American goods here. This, in fact (if I may here disregard such complications as fluctuating exchange rates, loans, credits, etc.) is the only way in which the British can eventually make use of these dollars. Because we have permitted the British to sell more to us, they are now able to buy more from us. They are, in fact, eventually forced to buy more from us if their dollar balances are not to remain perpetually unused. So as a result of letting in more British goods, we must export more American goods. And though fewer people are now employed in the American sweater industry, more people are employed—and much more efficiently employed—in, say, the American washing-machine or aircraft-building business. American employment on net balance has not gone down, but American and British production on net balance has gone up. Labor in each country is more fully employed in doing just those things that it does best, instead of being forced to do things that it does inefficiently or badly. Consumers in both countries are better off. They are able to buy what they want where they can get it cheapest. American consumers are better provided with sweaters, and British consumers are better provided with washing machines and aircraft.\nI count seven unwarranted assumptions on Hazlitt’s part that render his primary argument in support of free trade incorrect and therefore invalid.  They are as follows:\n1.  Hazlitt assumes that manufacturers are the primary beneficiaries from barriers to trade and therefore the leading advocates of them.  This may have once been true, but it is clearly no longer the case.\nEconomics in One Lesson\nwas published in 1946, when the U.S. balance of trade ran a 35 percent surplus and trade amounted to 6.8 percent of GDP.  Free trade was operating to the benefit of most American manufacturers and workers alike; since the industrial infrastructures of Europe and Asia were in ruins, few American sectors were at a competitive disadvantage.  Like Ricardo, Hazlitt clearly never imagined a scenario when jobs would not be lost to foreign manufacturing competitors, but to the new foreign factories established by the former domestic manufacturers.  The additional profit provided by a $5 tariff is now of less interest to the domestic manufacturer than the opportunity to set up a factory in Bangladesh, make the sweater at a lower cost, then import it and sell it for $25.  If we leave out the distribution channel which is the same for both foreign and domestic manufacturers and assume a profit margin of 50 percent, we can compare the profit margins of the various alternatives.  At the 50 percent profit margin, we know that the manufacturer’s domestic costs were $15 and his profit was $15 with the protection of the $5 tariff.  But Bangladesh has a wage rate that is one-thirtieth that of the USA, so if labor is one-third the cost of production and international shipping is 10 percent of the manufacturing cost, his new production and delivery cost will be $11.17.  This reduction of $3.83 in costs means the offshored manufacturer can now afford to sell the imported sweater for 22.34 and still make the same 50 percent profit margin he did before; without tariffs he can compete on price with the $25 English sweaters and actually increase his profit margin by nearly six percent.  At the old $30 price, his profit margin has risen to 63 percent, thereby creating a serious incentive to move production to Bangladesh\neven in the absence of any price pressure from the English sweater makers\n.  Either way, the consumers benefit, the manufacturer benefits, and only the thousands of workers, who lost their $5/sweater jobs, suffer.\nSo, the $5 tariff not only protects the domestic manufacturer from the English competitor, but more importantly, protects the worker from the domestic manufacturer as it would reduce his potential profit margin from 63 percent to 46 percent.  With the tariff in place, the domestic manufacturer has no reason to go to all the trouble and expense to relocate his factory to Bangladesh simply to lose four percent from his profit margin.  It is also worth nothing that since Hazlitt was implying a profit margin much lower than the 50 percent I utilized for the purposes of comparison, the difference between going offshore and not going offshore might not be an additional 13 percent profit, but the difference between the survival of the business and its failure.  Hazlitt’s error here is the result of the failure of the theory of comparative advantage to account for the international mobility of capital.\n2.  Hazlitt asserts that the $5 left over from the reduced import price of the sweater will go to help employment in any number of other industries in the United States.  It may.  Or it may not.  Again, Hazlitt was writing when imports accounted for a trivial 2.9 percent of GDP.  They now account for 15.8 percent, so that $5 is five times more likely to go towards helping employment in industries outside the United States than it was in 1946.  Statistically speaking, what would be $5 of the tariff going towards U.S. employment must be reduced to $4.25.  This error can also be traced back to Ricardo’s assumptions, although it is not one of the seven that Fletcher lists.\n3.  Hazlitt erroneously assumes that the British will buy more from the USA because they will be forced to buy more American goods due to their possession of dollars.  This is untrue because the dollar is the world’s reserve currency and is often utilized for trade between foreign countries; the British are no more forced to buy American goods due to their possession of dollars than the Thebans were forced to buy from Athenian goods due to their possession of silver talents.\n4.  Hazlitt assumes that foreign dollar balances cannot remain perpetually unused.  (By “unused” he means unspent in the USA).  But there are $610 billion in Eurodollars in foreign banks that will never be used, which\nis more than the entire amount of annual U.S. exports\nas recently as 1990!  Furthermore, the U.S. has been running a continuous and growing balance of trade deficit in goods since 1976.  The $9 billion that went overseas has not only not returned to be spent here, but has increased to $646 billion.\n35 years and counting is a long time to wait for this postulated inevitable return, and is unlikely to do any good for the worker who lost his job more than three decades ago.\n5.  Hazlitt assumes that an American worker who loses his job in one sector will automatically find it in another sector.  This is Ricardo’s sixth false assumption identified by Fletcher: “Production factors move easily between domestic industries.”  There is no reason to assume that the loss of a job in one sector will create any additional demand in another sector, indeed, to the extent there is worker mobility between industries, all the loss of the job in the one sector will do is create downward pressure on wages in the other sector.  There is a hidden and implicit appeal to James Mill here, (or alternatively, to Keynes’s critical formulation of Say’s Law), in the idea that supply somehow magically creates demand.  While this\ncan\nbe true in a technological sense, as there was no demand for CD players prior to their invention, it is not an economic law as the excess supply of U.S. housing or the dead inventory stock of any business will demonstrate.\n6.  Hazlitt assumes that American employment on net balance will not go down and that American and British production on net balance will go up.  This is not necessrily true, being an erroneous conclusion based on the previous false assumption.  The American worker may well remain unemployed on a permanent basis, as have one-quarter of the once-employed male workers since 1948.\n7.  Hazlitt assumes that consumers in both countries are better off because they are able to buy what they want where they can get it cheapest.  But this is a false assumption because most consumers are also workers or are dependent upon workers.  The consumer who is employed can better afford the $30 sweater than the unemployed consumer can the $25 one.  Free trade does work to the minor advantage of some Americans as well as to its foreign beneficiaries, but at an inordinately heavy short-term cost to around 25 percent of Americans and a severe long-term cost to the entire American economy.\nI shall leave it to Ampontan to determine whether this response justifies taking the argument seriously in the future.  I freely admit that I have not yet addressed the entire chapter, only one-third of it, but I expect to do so in another post or two in the reasonably near future.",
  "tags": [
    "economics",
    "free trade",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-14T07:00:00+00:00"
}