{
  "url": "https://voxday.net/2011/06/02/on-podcasting/",
  "scraped_at": "2025-12-13T23:12:38.153209",
  "title": "On podcasting",
  "date_display": "June 2, 2011",
  "date_iso": "2011-06-02T00:31:00+00:00",
  "date_from_url": "2011-06-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I get a lot of requests to do more podcasts on a regular basis, and while I’m amenable with regards to the necessary talking, interviewing, and so forth, I’ve finally concluded that I’m simply not at all interested in doing the necessary editing and studio tinkering.  So, if there is anyone who is interested in that side of it, let me know.  I don’t have any grand ideas about going full media, but given how most of the world seems to be astonished that the global economy is <s>headed back to</s>still experiencing economic contraction, I figure that there may be a need for more of the sort of thing I started with the Voxonomics podcasts.</p><p>Basically, I’d like to be able to record an MP3, upload it to a server, and have a reasonably edited podcast magically appear within a day or two.  If that’s not possible because no one is interested, it’s completely fine, but I thought I should at least throw this out there for any audiophiles with some time on their hands.</p></div>",
  "content_text": "I get a lot of requests to do more podcasts on a regular basis, and while I’m amenable with regards to the necessary talking, interviewing, and so forth, I’ve finally concluded that I’m simply not at all interested in doing the necessary editing and studio tinkering.  So, if there is anyone who is interested in that side of it, let me know.  I don’t have any grand ideas about going full media, but given how most of the world seems to be astonished that the global economy is\nheaded back to\nstill experiencing economic contraction, I figure that there may be a need for more of the sort of thing I started with the Voxonomics podcasts.\nBasically, I’d like to be able to record an MP3, upload it to a server, and have a reasonably edited podcast magically appear within a day or two.  If that’s not possible because no one is interested, it’s completely fine, but I thought I should at least throw this out there for any audiophiles with some time on their hands.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-01T23:31:00+00:00"
}