{
  "url": "https://voxday.net/2011/06/07/readership-and-other-trivialities/",
  "scraped_at": "2025-12-13T23:13:07.415458",
  "title": "Readership and other trivialities",
  "date_display": "June 7, 2011",
  "date_iso": "2011-06-07T09:29:00+00:00",
  "date_from_url": "2011-06-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Being an armchair economist, I often find it interesting to look beyond the obvious numbers given the way they are so often misleading.  For example, a few years ago, I used to be the third most-read WND columnist behind Ann Coulter and Pat Buchanan.  Ann was head-and-torso beyond everyone else, and while I occasionally gave Pat a run for his money, his readership was usually ahead of mine by a decent margin.  It’s been a while since I last looked into the matter, and since I no longer have direct access to their servers – I prefer to email my columns in so I didn’t bother to ask for it after one of the occasional structural reconfigurations – I began by looking at the Facebook Likes that are now attached to each column.</p><p>Unsurprisingly, by this metric, Ann Coulter is still the queen of WND.  Here are the Likes for her last four columns compared to a few other selected writers, in order of average Likes.</p><p>232.0: Ann Coulter (253, 75, 243, 357)<br> 75.5: Chuck Norris (39, 169, 60, 34)<br> 41.5: Vox Day (60, 40, 40, 26)<br> 35.0: Thomas Sowell (34, 36, 52, 18)<br> 22.0: Ilana Mercer (15, 11, 56, 6)<br> 13.5: John Stossel (19, 5, 19, 11)<br> 10.0: Chrissy Satterfield (29, 11, 0, 0)<br> 9.8: Pat Buchanan (18, 9, 1, 11)</br></br></br></br></br></br></br></p><p>From this, one would quite reasonably conclude that Ann’s columns are much more read than anyone else’s, something on the order of five times more than mine.  Chuck’s average is high, but it’s bumped up significantly by one outlier of a column entitled “The Self-Destructing Republican Party”, which went over extremely well with Republicans terrified that their leadership is going to blow their opportunity to knock off Obama.  In looking at the actual readers of those same columns for Buchanan, Coulter, and Day – which I requested and cannot directly divulge, but suffice it to say they are in excess of my blog numbers – my WND readership is now 60.7 percent of Miss Coulter’s, which is up more than 10 percentage points from several years ago if I recall correctly.</p><p>What I found both interesting and slightly depressing is the fact that Chatterfield’s columns are now more liked, on average, than Pat Buchanan’s.  This tends to suggest that WND readers have become more partisan and less partial to intellectual weight as their numbers have grown.  While Mr. Buchanan’s readership numbers have not actually declined over time, they have declined in a relative manner as my WND readership is now 122.9 percent larger than his.  Of course, it must be kept in mind that although his columns were available elsewhere before, it is entirely possible that many of his biggest fans do not read him at WND, but prefer to read him at <i>The American Conservative</i> instead.</p><p>It’s also worth noting that the difference in the size of the Like gap and the readership gap between Coulter and myself tends to indicate that while many WND readers are willing to read my column, they don’t like them all that much.  Which makes an amount of sense, given that WND’s conservative Republican readership are likely to hold opinions that are more in line with hers than with my radical libertarian iconoclasm.</p><p>Regardless, because I am unwilling to cede primacy of position to Miss Coulter, however much she merits it, (or however little she values it), I intend to resort to <s>cheating</s>new tactics.  Now, I like to think that I am unusually good at interviews because I am apparently one of the very few interviewers who makes a habit of a) reading the book or the relevant information beforehand and b) letting the interviewee talk as much as he likes in answer to my questions.  However, I have done very few interviews in the last year because it is a tedious and lengthy task to transcribe them.</p><p>The solution being entirely obvious, I’m pleased to say there will soon be a second weekly Vox Day contribution appearing on WorldNetDaily.  The initial subjects will include economist Ian Fletcher, Karl Denninger of the Market Ticker, and the eminent historian John Julius Norwich, among others.  I am also in the process of putting together a Joel Rosenberg retrospective which will feature several notable science fiction and fantasy authors.</p></div>",
  "content_text": "Being an armchair economist, I often find it interesting to look beyond the obvious numbers given the way they are so often misleading.  For example, a few years ago, I used to be the third most-read WND columnist behind Ann Coulter and Pat Buchanan.  Ann was head-and-torso beyond everyone else, and while I occasionally gave Pat a run for his money, his readership was usually ahead of mine by a decent margin.  It’s been a while since I last looked into the matter, and since I no longer have direct access to their servers – I prefer to email my columns in so I didn’t bother to ask for it after one of the occasional structural reconfigurations – I began by looking at the Facebook Likes that are now attached to each column.\nUnsurprisingly, by this metric, Ann Coulter is still the queen of WND.  Here are the Likes for her last four columns compared to a few other selected writers, in order of average Likes.\n232.0: Ann Coulter (253, 75, 243, 357)\n75.5: Chuck Norris (39, 169, 60, 34)\n41.5: Vox Day (60, 40, 40, 26)\n35.0: Thomas Sowell (34, 36, 52, 18)\n22.0: Ilana Mercer (15, 11, 56, 6)\n13.5: John Stossel (19, 5, 19, 11)\n10.0: Chrissy Satterfield (29, 11, 0, 0)\n9.8: Pat Buchanan (18, 9, 1, 11)\nFrom this, one would quite reasonably conclude that Ann’s columns are much more read than anyone else’s, something on the order of five times more than mine.  Chuck’s average is high, but it’s bumped up significantly by one outlier of a column entitled “The Self-Destructing Republican Party”, which went over extremely well with Republicans terrified that their leadership is going to blow their opportunity to knock off Obama.  In looking at the actual readers of those same columns for Buchanan, Coulter, and Day – which I requested and cannot directly divulge, but suffice it to say they are in excess of my blog numbers – my WND readership is now 60.7 percent of Miss Coulter’s, which is up more than 10 percentage points from several years ago if I recall correctly.\nWhat I found both interesting and slightly depressing is the fact that Chatterfield’s columns are now more liked, on average, than Pat Buchanan’s.  This tends to suggest that WND readers have become more partisan and less partial to intellectual weight as their numbers have grown.  While Mr. Buchanan’s readership numbers have not actually declined over time, they have declined in a relative manner as my WND readership is now 122.9 percent larger than his.  Of course, it must be kept in mind that although his columns were available elsewhere before, it is entirely possible that many of his biggest fans do not read him at WND, but prefer to read him at\nThe American Conservative\ninstead.\nIt’s also worth noting that the difference in the size of the Like gap and the readership gap between Coulter and myself tends to indicate that while many WND readers are willing to read my column, they don’t like them all that much.  Which makes an amount of sense, given that WND’s conservative Republican readership are likely to hold opinions that are more in line with hers than with my radical libertarian iconoclasm.\nRegardless, because I am unwilling to cede primacy of position to Miss Coulter, however much she merits it, (or however little she values it), I intend to resort to\ncheating\nnew tactics.  Now, I like to think that I am unusually good at interviews because I am apparently one of the very few interviewers who makes a habit of a) reading the book or the relevant information beforehand and b) letting the interviewee talk as much as he likes in answer to my questions.  However, I have done very few interviews in the last year because it is a tedious and lengthy task to transcribe them.\nThe solution being entirely obvious, I’m pleased to say there will soon be a second weekly Vox Day contribution appearing on WorldNetDaily.  The initial subjects will include economist Ian Fletcher, Karl Denninger of the Market Ticker, and the eminent historian John Julius Norwich, among others.  I am also in the process of putting together a Joel Rosenberg retrospective which will feature several notable science fiction and fantasy authors.",
  "tags": [
    "WND"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-07T08:29:00+00:00"
}