{
  "url": "https://voxday.net/2011/06/27/socialist-end-game/",
  "scraped_at": "2025-12-13T23:15:00.576984",
  "title": "Thesocialisthistorical end game",
  "date_display": "June 27, 2011",
  "date_iso": "2011-06-27T15:33:00+00:00",
  "date_from_url": "2011-06-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>VDH notes <a href=\"http://pajamasmedia.com/victordavishanson/there-are-no-socialists/?singlepage=true\">the historical pattern</a> of corrosive parasitism:</p><blockquote><p>History is not kind to such collective states of mind. Pay an Athenian in the fifth century BC a subsidy to go to the theater; and in the fourth century BC he is demanding such pay to vote in the assembly as well — and there is not to be a third century free democratic polis. Extend to a Roman in the first century BC a small grain dole, and by the late first century AD he cannot live without a big dole, free entertainment in a huge new Coliseum, and disbursements of free coined money. Let the emperor Justinian try cutting back the bloated bureaucracy in sixth century AD Constantinople and he wins the Nika riots that almost destroy a civilization from within even as it is beset by hosts of foreign enemies.</p><p>Social Security started out as a few dollars a month to the elderly, in their last two or three years of life, to ensure that they could feed themselves without the indignity of borrowing from their children. It has morphed into someone living well for twenty years on far more money taken than was put in — or a young family with a dyslexic child on “disability” for life. To cut any for the latter would cause far more riot and mayhem than not to have given the former anything in the first place — despite the fact that the 21st century recipient was far less needy and got far more than the early 20th century recipient who needed more and got less.</p></blockquote><p>VDH points out that there isn’t actually anything properly socialist about the nominal socialists who build their careers on transferring wealth from one party to another.  And as we’ve seen demonstrated very clearly since 2008, the banks and large corporations are every bit as willing to play the “socialist” game as any labor union.  It’s all about utilizing government power to forcibly redistribute tax income, and this is an old, old game that long precedes Marxism or any other form of socialism.</p><p>In the end, it is merely a rancid form of political corruption, and one that Aristotle would recognize as readily as Julius Caesar.  In fact, Caesar may well have been the original Too Big To Fail, as one technique he used to guarantee continued support from the moneyed class was the gargantuan debts he incurred as he worked his way up the <i>cursus honorum</i>.  His creditors knew that if he did not succeed to the Praetorship or the Consulship, they would never see their loans repaid, and so they were forced to remain solidly behind him.</p><p>Societies have a life cycle that is as obvious to the educated observer as the difference between a young Sports Illustrated model and a decrepit Social Security recipient.  What we’re seeing in the USA and other Western countries isn’t progress, it is straightforward and unmistakable decline.</p></div>",
  "content_text": "VDH notes\nthe historical pattern\nof corrosive parasitism:\nHistory is not kind to such collective states of mind. Pay an Athenian in the fifth century BC a subsidy to go to the theater; and in the fourth century BC he is demanding such pay to vote in the assembly as well — and there is not to be a third century free democratic polis. Extend to a Roman in the first century BC a small grain dole, and by the late first century AD he cannot live without a big dole, free entertainment in a huge new Coliseum, and disbursements of free coined money. Let the emperor Justinian try cutting back the bloated bureaucracy in sixth century AD Constantinople and he wins the Nika riots that almost destroy a civilization from within even as it is beset by hosts of foreign enemies.\nSocial Security started out as a few dollars a month to the elderly, in their last two or three years of life, to ensure that they could feed themselves without the indignity of borrowing from their children. It has morphed into someone living well for twenty years on far more money taken than was put in — or a young family with a dyslexic child on “disability” for life. To cut any for the latter would cause far more riot and mayhem than not to have given the former anything in the first place — despite the fact that the 21st century recipient was far less needy and got far more than the early 20th century recipient who needed more and got less.\nVDH points out that there isn’t actually anything properly socialist about the nominal socialists who build their careers on transferring wealth from one party to another.  And as we’ve seen demonstrated very clearly since 2008, the banks and large corporations are every bit as willing to play the “socialist” game as any labor union.  It’s all about utilizing government power to forcibly redistribute tax income, and this is an old, old game that long precedes Marxism or any other form of socialism.\nIn the end, it is merely a rancid form of political corruption, and one that Aristotle would recognize as readily as Julius Caesar.  In fact, Caesar may well have been the original Too Big To Fail, as one technique he used to guarantee continued support from the moneyed class was the gargantuan debts he incurred as he worked his way up the\ncursus honorum\n.  His creditors knew that if he did not succeed to the Praetorship or the Consulship, they would never see their loans repaid, and so they were forced to remain solidly behind him.\nSocieties have a life cycle that is as obvious to the educated observer as the difference between a young Sports Illustrated model and a decrepit Social Security recipient.  What we’re seeing in the USA and other Western countries isn’t progress, it is straightforward and unmistakable decline.",
  "tags": [
    "decline and fall",
    "history"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-27T14:33:00+00:00"
}