{
  "url": "https://voxday.net/2011/06/03/statistical-shenanigans-u3/",
  "scraped_at": "2025-12-13T23:12:47.376586",
  "title": "Statistical shenanigans: U3",
  "date_display": "June 3, 2011",
  "date_iso": "2011-06-03T09:35:00+00:00",
  "date_from_url": "2011-06-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You may recall that my prediction that the U3 unemployment would exceed 11 percent in 2010 was “incorrect”.  The BLS reported U3 at only 9.8 percent even though fewer people were working due to a concomitant increase in the number of people who had mysteriously decided to exit the labor force in the midst of the “recovery”  That’s why I revised my 2011 prediction as follows: <i>“U-3 unemployment will climb above 10 percent. The real unemployment rate will be much higher, but it will be masked by a decline in the Labor Force Participation rate below 64 percent. The employment-population ratio will fall below 58 percent for the first time since 1984.</i></p><p>Needless to say, I didn’t find it quite as inexplicable as some economists have to see that the current employment trend is <a href=\"http://news.yahoo.com/s/ap/20110602/ap_on_bi_ge/us_economy_missing_workers\">defying “the rules of a normal economic recovery</a>.”:</p><blockquote><p>The labor force — those who have a job or are looking for one — is getting smaller, even though the economy is growing and steadily adding jobs. That trend defies the rules of a normal economic recovery….  The percentage of adults in the labor force is a figure that economists call the participation rate. It is 64.2 percent, the smallest since 1984. And that’s become a mystery to economists. Normally after a recession, an improving economy lures job seekers back into the labor market. This time, many are staying on the sidelines.</p><p>Their decision not to seek work means the drop in unemployment from 9.8 percent in November to 9 percent in April isn’t as good as it looks.  If the 529,000 missing workers had been out scavenging for a job without success, the unemployment rate would have been 9.3 percent in April, not the reported rate of 9 percent. And if the participation rate were as high as it was when the recession began, 66 percent, in December 2007, the unemployment rate could have been as high as 11.5 percent.</p></blockquote><p>Translation: the real U3 unemployment rate has been over 11 percent since 2010, as I originally predicted.  However, the BLS has concealed this very high rate of unemployment by the simple tactic of reducing the size of the labor force despite the growing population of the country.  This is only one of the many reasons that Mises was correct to condemn the use of statistical empiricism in economics; the statistics are neither reliable nor represent a consistent metric.</p><p>There is no mystery and it is not true that “nobody is sure why it’s happening.”  The reason it is happening is completely obvious: there is no economic recovery.  The Bureau of Labor Statistics is playing games, just like the Federal Reserve and most of the other Federal agencies, to conceal the observable fact that the Great Depression 2.0 has been underway for 30 months already.  And their ability to hide it is gradually crumbling.</p><p>UPDATE: BLS report today: U3=9.1%, LFP=64.2%, E/PR=58.4%.</p></div>",
  "content_text": "You may recall that my prediction that the U3 unemployment would exceed 11 percent in 2010 was “incorrect”.  The BLS reported U3 at only 9.8 percent even though fewer people were working due to a concomitant increase in the number of people who had mysteriously decided to exit the labor force in the midst of the “recovery”  That’s why I revised my 2011 prediction as follows:\n“U-3 unemployment will climb above 10 percent. The real unemployment rate will be much higher, but it will be masked by a decline in the Labor Force Participation rate below 64 percent. The employment-population ratio will fall below 58 percent for the first time since 1984.\nNeedless to say, I didn’t find it quite as inexplicable as some economists have to see that the current employment trend is\ndefying “the rules of a normal economic recovery\n.”:\nThe labor force — those who have a job or are looking for one — is getting smaller, even though the economy is growing and steadily adding jobs. That trend defies the rules of a normal economic recovery….  The percentage of adults in the labor force is a figure that economists call the participation rate. It is 64.2 percent, the smallest since 1984. And that’s become a mystery to economists. Normally after a recession, an improving economy lures job seekers back into the labor market. This time, many are staying on the sidelines.\nTheir decision not to seek work means the drop in unemployment from 9.8 percent in November to 9 percent in April isn’t as good as it looks.  If the 529,000 missing workers had been out scavenging for a job without success, the unemployment rate would have been 9.3 percent in April, not the reported rate of 9 percent. And if the participation rate were as high as it was when the recession began, 66 percent, in December 2007, the unemployment rate could have been as high as 11.5 percent.\nTranslation: the real U3 unemployment rate has been over 11 percent since 2010, as I originally predicted.  However, the BLS has concealed this very high rate of unemployment by the simple tactic of reducing the size of the labor force despite the growing population of the country.  This is only one of the many reasons that Mises was correct to condemn the use of statistical empiricism in economics; the statistics are neither reliable nor represent a consistent metric.\nThere is no mystery and it is not true that “nobody is sure why it’s happening.”  The reason it is happening is completely obvious: there is no economic recovery.  The Bureau of Labor Statistics is playing games, just like the Federal Reserve and most of the other Federal agencies, to conceal the observable fact that the Great Depression 2.0 has been underway for 30 months already.  And their ability to hide it is gradually crumbling.\nUPDATE: BLS report today: U3=9.1%, LFP=64.2%, E/PR=58.4%.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-03T08:35:00+00:00"
}