{
  "url": "https://voxday.net/2011/06/11/there-is-no-god-particle/",
  "scraped_at": "2025-12-13T23:13:30.194570",
  "title": "There is no God particle",
  "date_display": "June 11, 2011",
  "date_iso": "2011-06-11T13:50:00+00:00",
  "date_from_url": "2011-06-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I am not exactly surprised to learn that the optimistic rumors out of Switzerland <a href=\"http://www.foxnews.com/scitech/2011/06/10/heartbreaker-major-setback-in-quest-for-god-particle/\">were unwarranted</a>:</p><blockquote><p>The quest for the elusive Higgs boson seemed over in April, when an unexpected result from an atom smasher seemed to herald the discovery of the famous particle — the last unproven piece of the physics puzzle and one of the great mysteries scientists face today.  Researchers were cautious, however, warning that it would take months to verify the finding. Their caution was wise.</p><p>Scientists with the Tevatron particle accelerator at Chicago’s Fermilab facility just released the results of a months-long effort by the lab’s brightest minds to confirm the finding. What did they find? Nothing.  “We do not see the signal,” Dmitri Denisov, staff scientist at Fermilab, told FoxNews.com. “If it existed, we would see it. But when we look at our data, we basically see nothing.”</p></blockquote><p>As a general scientific rule, if you have a reasonable model that doesn’t <i>quite</i> fit the data and are forced to concoct epicycles and hypothetical substances or particles in order to properly align the model with the observable data, you can pretty much count on eventually having to junk the model.  This is why I suspect that the Higgs boson will not be found, the reports that dark matter has finally been found will turn out to be false, and the theory of evolution by natural selection will eventually be abandoned in despair.</p><p>Of course, as we’ve seen in economics, Max Planck was an optimist.  It will take at least two generations of dead scientists before the scientific mainstream will be ready to admit what has been obvious for years to those whose careers don’t depend upon the survival of the model.  Look how long it has taken science to discover that it is carbohydrates, not fat, that makes you gain weight, even though anyone can discern those results by simply paying attention to what happens when they vary their diet for a month.</p></div>",
  "content_text": "I am not exactly surprised to learn that the optimistic rumors out of Switzerland\nwere unwarranted\n:\nThe quest for the elusive Higgs boson seemed over in April, when an unexpected result from an atom smasher seemed to herald the discovery of the famous particle — the last unproven piece of the physics puzzle and one of the great mysteries scientists face today.  Researchers were cautious, however, warning that it would take months to verify the finding. Their caution was wise.\nScientists with the Tevatron particle accelerator at Chicago’s Fermilab facility just released the results of a months-long effort by the lab’s brightest minds to confirm the finding. What did they find? Nothing.  “We do not see the signal,” Dmitri Denisov, staff scientist at Fermilab, told FoxNews.com. “If it existed, we would see it. But when we look at our data, we basically see nothing.”\nAs a general scientific rule, if you have a reasonable model that doesn’t\nquite\nfit the data and are forced to concoct epicycles and hypothetical substances or particles in order to properly align the model with the observable data, you can pretty much count on eventually having to junk the model.  This is why I suspect that the Higgs boson will not be found, the reports that dark matter has finally been found will turn out to be false, and the theory of evolution by natural selection will eventually be abandoned in despair.\nOf course, as we’ve seen in economics, Max Planck was an optimist.  It will take at least two generations of dead scientists before the scientific mainstream will be ready to admit what has been obvious for years to those whose careers don’t depend upon the survival of the model.  Look how long it has taken science to discover that it is carbohydrates, not fat, that makes you gain weight, even though anyone can discern those results by simply paying attention to what happens when they vary their diet for a month.",
  "tags": [
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-11T12:50:00+00:00"
}