{
  "url": "https://voxday.net/2011/06/16/trade-and-libertarians/",
  "scraped_at": "2025-12-13T23:13:59.964714",
  "title": "Trade and the Libertarians",
  "date_display": "June 16, 2011",
  "date_iso": "2011-06-16T13:30:00+00:00",
  "date_from_url": "2011-06-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ian Fletcher <a href=\"http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=311501\">takes on the free trade Libertarians</a> at WND:</p><blockquote><p>I recently gave a podcast interview to Vox Day, a prominent Christian libertarian, explaining why free trade is bad for America.  He followed it up with an article making many of the same points.</p><p>Finally, a libertarian gets it.</p><p>This did not go over well with some of his followers.</p><p>I’m not qualified to speak to the “Christian” aspects of free trade – whatever those are – beyond observing that globalism, of which free trade is a part, certainly looks like the Tower of Babel. But as one prominent libertarian has now seen through the free trade delusion that generally grips his fellow libertarians, this is probably a good time to explain what he got and they didn’t.</p></blockquote><p>Followers?  I have followers?  And here I thought I merely had Ilk.  Anyhow, Fletcher’s casual observation connecting Babel and globalism is one that should give any Christian, libertarian or not, food for thought.</p><p>What Fletcher is saying without specifically articulating it is a variant on a point I have previously made with regards to abortion and immigration.  There is a difference between liberty of <i>opportunity</i> and liberty of <i>result</i>.  But liberty, unlike equality, is a desired <i>net outcome</i>.  It is not desirable that everyone be the same, whereas it is desirable that everyone have the maximal amount of personal freedom.  This means that contrary to the way in which equality of opportunity is to be preferred to equality of result, liberty of result is to be preferred to liberty of opportunity.</p><p>Furthermore, it is no more intrinsically unjust that foreign corporations are forced to pay a tariff in order to sell their wares – or even not be permitted to sell them at all – than foreigners who are not resident in the USA are not permitted to vote for the U.S. president or collect <s>AFDC</s>TANF payments.  The so-called moral argument for free trade to which many Libertarians appeal is not only unjust, overtly anti-American, and anti-Constitutional, it is an important tool in the service of one of the most fundamentally evil concepts in the history of humanity, a centralized international government with global authority.</p></div>",
  "content_text": "Ian Fletcher\ntakes on the free trade Libertarians\nat WND:\nI recently gave a podcast interview to Vox Day, a prominent Christian libertarian, explaining why free trade is bad for America.  He followed it up with an article making many of the same points.\nFinally, a libertarian gets it.\nThis did not go over well with some of his followers.\nI’m not qualified to speak to the “Christian” aspects of free trade – whatever those are – beyond observing that globalism, of which free trade is a part, certainly looks like the Tower of Babel. But as one prominent libertarian has now seen through the free trade delusion that generally grips his fellow libertarians, this is probably a good time to explain what he got and they didn’t.\nFollowers?  I have followers?  And here I thought I merely had Ilk.  Anyhow, Fletcher’s casual observation connecting Babel and globalism is one that should give any Christian, libertarian or not, food for thought.\nWhat Fletcher is saying without specifically articulating it is a variant on a point I have previously made with regards to abortion and immigration.  There is a difference between liberty of\nopportunity\nand liberty of\nresult\n.  But liberty, unlike equality, is a desired\nnet outcome\n.  It is not desirable that everyone be the same, whereas it is desirable that everyone have the maximal amount of personal freedom.  This means that contrary to the way in which equality of opportunity is to be preferred to equality of result, liberty of result is to be preferred to liberty of opportunity.\nFurthermore, it is no more intrinsically unjust that foreign corporations are forced to pay a tariff in order to sell their wares – or even not be permitted to sell them at all – than foreigners who are not resident in the USA are not permitted to vote for the U.S. president or collect\nAFDC\nTANF payments.  The so-called moral argument for free trade to which many Libertarians appeal is not only unjust, overtly anti-American, and anti-Constitutional, it is an important tool in the service of one of the most fundamentally evil concepts in the history of humanity, a centralized international government with global authority.",
  "tags": [
    "economics",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-16T12:30:00+00:00"
}