{
  "url": "https://voxday.net/2011/06/20/unpossible/",
  "scraped_at": "2025-12-13T23:14:24.956938",
  "title": "Unpossible!",
  "date_display": "June 20, 2011",
  "date_iso": "2011-06-20T17:00:00+00:00",
  "date_from_url": "2011-06-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This would appear to be a timely article.  However, <a href=\"http://www.nytimes.com/2011/03/25/business/economy/25tax.html?ref=business\">this piece on prospective profit repatriation</a> in the NYT must be a shameless lie.  It’s simply not possible for there to be vast dollar balances sitting there in overseas accounts, remaining unused.  After all, as we learned from Henry Hazlitt, <i>“Because we have permitted the British to sell more to us, they are now able to buy more from us. They are, in fact, eventually forced to buy more from us if their dollar balances are not to remain perpetually unused. So as a result of letting in more British goods, we must export more American goods.”</i></p><blockquote><p>Some of the nation’s largest corporations have amassed vast profits outside the country and are pressing Congress and the Obama administration for a tax break to bring the money home. Apple has $12 billion waiting offshore, Google has $17 billion and Microsoft, $29 billion…. “For every billion dollars that we invest, that creates 15,000 to 20,000 jobs either directly or indirectly,” Jim Rogers, the chief of Duke Energy, said at the conference. Duke has $1.3 billion in profits overseas.</p></blockquote><p>We must, must we?  Note that these are nominally <i>American</i> organizations that are doing precisely what the free trade champion claims that the <i>British</i> ones could not do.  Furthermore, note that these offshore funds are not the result of imports, but rather <i>exports</i>.  So, in addition to the loss of jobs due to imports, we’re actually seeing them lost – or at least delayed – due to supposedly beneficial <i>exports</i>.</p><p>This is a negative aspect of free trade that I do not believe was ever anticipated by either its historical advocates or its critics.  And it underlines Ian Fletcher’s point that there are problems with free trade that go very far beyond simple matters of conventional protectionism and tariffs.</p><p>It is remarkable to see the likes of Rogers claim that each billion brought back would create 15,000 jobs, given his apparent failure to notice that if that were true, exporting that billion must have already cost a similar number of jobs.  Of course, he’s incorrect about the relationship between repatriated profits and jobs, since the 2005 tax incentive that brought $312 billion back into the USA did not generate between 4,680,000 and 6,420,000 new jobs.  What actually happened is that total employment increased to 2,383,000 in 2006, just barely more than the 2,268,000 increase in the year that preceded the repatriation program.</p><p>Note to the intrepid free trade advocates:  This is the sort of post where it is perfectly appropriate for you to trot out your boilerplate arguments in support of free trade as if no one who studies economics has ever heard them before.  They’re not necessarily going to be any more convincing than they were when you were erroneously presenting them as if they had anything at all to do with the arguments that Henry Hazlitt made in Chapter 11 of <i>Economics in One Lesson</i>, but they will at least be potentially relevant here.</p><p>This should not, however, be interpreted as an indication that I am inclined to pay any more attention to them now than I did previously.</p></div>",
  "content_text": "This would appear to be a timely article.  However,\nthis piece on prospective profit repatriation\nin the NYT must be a shameless lie.  It’s simply not possible for there to be vast dollar balances sitting there in overseas accounts, remaining unused.  After all, as we learned from Henry Hazlitt,\n“Because we have permitted the British to sell more to us, they are now able to buy more from us. They are, in fact, eventually forced to buy more from us if their dollar balances are not to remain perpetually unused. So as a result of letting in more British goods, we must export more American goods.”\nSome of the nation’s largest corporations have amassed vast profits outside the country and are pressing Congress and the Obama administration for a tax break to bring the money home. Apple has $12 billion waiting offshore, Google has $17 billion and Microsoft, $29 billion…. “For every billion dollars that we invest, that creates 15,000 to 20,000 jobs either directly or indirectly,” Jim Rogers, the chief of Duke Energy, said at the conference. Duke has $1.3 billion in profits overseas.\nWe must, must we?  Note that these are nominally\nAmerican\norganizations that are doing precisely what the free trade champion claims that the\nBritish\nones could not do.  Furthermore, note that these offshore funds are not the result of imports, but rather\nexports\n.  So, in addition to the loss of jobs due to imports, we’re actually seeing them lost – or at least delayed – due to supposedly beneficial\nexports\n.\nThis is a negative aspect of free trade that I do not believe was ever anticipated by either its historical advocates or its critics.  And it underlines Ian Fletcher’s point that there are problems with free trade that go very far beyond simple matters of conventional protectionism and tariffs.\nIt is remarkable to see the likes of Rogers claim that each billion brought back would create 15,000 jobs, given his apparent failure to notice that if that were true, exporting that billion must have already cost a similar number of jobs.  Of course, he’s incorrect about the relationship between repatriated profits and jobs, since the 2005 tax incentive that brought $312 billion back into the USA did not generate between 4,680,000 and 6,420,000 new jobs.  What actually happened is that total employment increased to 2,383,000 in 2006, just barely more than the 2,268,000 increase in the year that preceded the repatriation program.\nNote to the intrepid free trade advocates:  This is the sort of post where it is perfectly appropriate for you to trot out your boilerplate arguments in support of free trade as if no one who studies economics has ever heard them before.  They’re not necessarily going to be any more convincing than they were when you were erroneously presenting them as if they had anything at all to do with the arguments that Henry Hazlitt made in Chapter 11 of\nEconomics in One Lesson\n, but they will at least be potentially relevant here.\nThis should not, however, be interpreted as an indication that I am inclined to pay any more attention to them now than I did previously.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-20T16:00:00+00:00"
}