{
  "url": "https://voxday.net/2011/06/12/warrior-lives-recalling-rosenberg/",
  "scraped_at": "2025-12-13T23:13:35.746684",
  "title": "The Warrior Lives: Remembering Rosenberg",
  "date_display": "June 12, 2011",
  "date_iso": "2011-06-12T22:47:00+00:00",
  "date_from_url": "2011-06-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was a fan of Joel Rosenberg’s work long before I ever met him, but I eventually came to admire him more as a man than as an author.  I wasn’t a close friend of his, more the friend of a friend, but I did have the good fortune to get to know him over the last 15 years.  It was a privilege for an SF/F fan, but more than that, it was a genuine pleasure.  Growing up in Minnesota, which at the time felt rather like the cold side of the back of beyond, I had no idea that there were Real Live Writers living there, never being much inclined to read the author bios at the back.  Like many a teenage boy in the Eighties, I had dabbled in role-playing games such as <em>AD&amp;D</em>, <em>Gamma World</em>, and <em>Traveller </em>in the Time Before Girls, and so <em>The Guardians of the Flame</em> were a real revelation to me.  Rosenberg’s novels were gritty long before grit became fashionable; he made a distinct impression on a young reader by killing off a major character practically at the beginning of the first novel, then went himself one better by killing off the lead character in only the fourth book in the series.  I can’t recall being more shocked while reading fiction any time before or since.  Karl Cullinane is dead?  But… but what about the series?</p><p>Continued <a href=\"http://www.blackgate.com/2011/06/12/the-warrior-lives-remembering-rosenberg/\">at The Black Gate</a></p></div>",
  "content_text": "I was a fan of Joel Rosenberg’s work long before I ever met him, but I eventually came to admire him more as a man than as an author.  I wasn’t a close friend of his, more the friend of a friend, but I did have the good fortune to get to know him over the last 15 years.  It was a privilege for an SF/F fan, but more than that, it was a genuine pleasure.  Growing up in Minnesota, which at the time felt rather like the cold side of the back of beyond, I had no idea that there were Real Live Writers living there, never being much inclined to read the author bios at the back.  Like many a teenage boy in the Eighties, I had dabbled in role-playing games such as\nAD&D\n,\nGamma World\n, and\nTraveller\nin the Time Before Girls, and so\nThe Guardians of the Flame\nwere a real revelation to me.  Rosenberg’s novels were gritty long before grit became fashionable; he made a distinct impression on a young reader by killing off a major character practically at the beginning of the first novel, then went himself one better by killing off the lead character in only the fourth book in the series.  I can’t recall being more shocked while reading fiction any time before or since.  Karl Cullinane is dead?  But… but what about the series?\nContinued\nat The Black Gate",
  "tags": [
    "Black Gate",
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-12T21:47:00+00:00"
}