{
  "url": "https://voxday.net/2011/06/22/wsj-salutes-keynes/",
  "scraped_at": "2025-12-13T23:14:35.941562",
  "title": "The WSJ salutes Keynes",
  "date_display": "June 22, 2011",
  "date_iso": "2011-06-22T17:00:00+00:00",
  "date_from_url": "2011-06-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There was a time, as a boy, that I read the Wall Street Journal and marveled at its apparent erudition.  Now, I can seldom read a single article without rolling my eyes.  But <a href=\"http://online.wsj.com/article/SB10001424052702303635604576392023187860688.html\">this pro-Keynesian article by Alan Blinder</a> is remarkable for its cluelessness.</p><blockquote><p>The generic conservative view that government is “too big” in some abstract sense leads to a strong predisposition against spending. OK. But the question remains: How can the government destroy jobs by either hiring people directly or buying things from private companies? For example, how is it that public purchases of computers destroy jobs but private purchases of computers create them?</p><p>One possible answer is that the taxes necessary to pay for the government spending destroy more jobs than the spending creates. That’s a logical possibility, although it would require extremely inept choices of how to spend the money and how to raise the revenue. But tax-financed spending is not what’s at issue today. The current debate is about deficit spending: raising spending without raising taxes.</p><p>For example, the large fiscal stimulus enacted in 2009 was not “paid for.” Yet it has been claimed that it created essentially no jobs. Really? With spending under the Recovery Act exceeding $600 billion (and tax cuts exceeding $200 billion), that would be quite a trick. How in the world could all that spending, accompanied by tax cuts, fail to raise employment? In fact, according to Congressional Budget Office estimates, the stimulus’s effect on employment in 2010 was at least 1.3 million net new jobs, and perhaps as many as 3.3 million.</p><p>A second job-destroying mechanism operates through higher interest rates. When the government borrows to finance spending, that pushes interest rates up, which dissuades some businesses from investing. Thus falling private investment destroys jobs just as rising government spending is creating them.</p><p>There are times when this “crowding-out” argument is relevant. But not today. The Federal Reserve has been holding interest rates at ultra-low levels for several years, and will continue to do so. If interest rates don’t rise, you don’t get crowding out.</p></blockquote><p>I’m not in the mood to rip Blinder’s article apart; I’ve still got the third section of Hazlitt’s Chapter 11 to complete.  But a one word rebuttal should suffice: malinvestment.  My main object with regards to this post is to point out the sheer chicanery Blinder uses in making one of his points.  He claims that there can be no “crowding out” if interest rates don’t rise; since the Fed has kept interest rates low, then government borrowing must not be having any effect on private borrowing.</p><p>But don’t you think it’s just a little strange to appeal to a supposedly causal factor rather than simply looking at the relevant metric?  Which is to say, the amount of government borrowing compared to private borrowing.  As it happens the Q1-11 Z1 report on total debt was released two weeks ago and the chart below shows exactly what has happened since 2005.</p><p><a href=\"http://2.bp.blogspot.com/-ko5XngbsUQY/TgIFAA3dNLI/AAAAAAAAAPI/jXSi5WGFjjA/s1600/SectorDebt05-11.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"400\" src=\"http://www.milobookclub.com/wp-content/uploads/2011/06/SectorDebt05-11.jpg\" width=\"337\"/></a>In 2005, government debt accounted for 16% of all debt, (11.6% Federal).  In 2011, it accounts for 23% of total credit market debt, which has declined about $280 billion since its peak of Q3-08.  In that time, household sector debt has fallen from 28% to 25% and the financial sector has reduced its debt from 32% to 27%.  This would <i>appear</i> to show the very “crowding out” that Blinder claims cannot be possible due to the low interest rates.</p><p>But the key word is “appear”.  It doesn’t actually show any crowding out, because Blinder’s <i>entire economic model</i> is incorrect.  What it actually shows is the expected contraction of the private sector due to the ongoing economic depression as well as the utterly futile attempt of the Federal Reserve and the federal government to do exactly what Blinder wants them to do more of, which is to fill in the gap created by the private contraction.  This is why the GDP numbers have held up despite all of the obvious signs of severe economic contraction; it is also why the Congress is going to raise the debt ceiling no matter what the Red Faction members say.</p><p>The problem is that it only digs the hole deeper.  What we are seeing is the transformation of a mixed economy into a fully centralized command economy, where all of the economic production and consumption is directed by the State.  The good news, or at least what will have to pass for the good news, is that the system will collapse of its own weight long before the red line reaches 100.  But there is almost no chance that the economic interventionists will succeed and that yellow and blue lines will reverse course.  They are unlikely to do anything but head downward at a faster weight, since they have already realized significant losses that have not yet been accounted for.</p><p>Just based on a very rough off-the-top-of-my-head calculation, both the blue and yellow lines would be down around 20% already if the housing market debacle was being realistically reported.  To put it in perspective, if total credit market debt had been expanding at the rate it was expanding from 2005 to 2009, it would stand at $62.6 trillion, $10 trillion more than it is today.  This indicates a total private debt-demand shortfall of around $14 trillion – or an entire year’s worth of GDP consumption.</p></div>",
  "content_text": "There was a time, as a boy, that I read the Wall Street Journal and marveled at its apparent erudition.  Now, I can seldom read a single article without rolling my eyes.  But\nthis pro-Keynesian article by Alan Blinder\nis remarkable for its cluelessness.\nThe generic conservative view that government is “too big” in some abstract sense leads to a strong predisposition against spending. OK. But the question remains: How can the government destroy jobs by either hiring people directly or buying things from private companies? For example, how is it that public purchases of computers destroy jobs but private purchases of computers create them?\nOne possible answer is that the taxes necessary to pay for the government spending destroy more jobs than the spending creates. That’s a logical possibility, although it would require extremely inept choices of how to spend the money and how to raise the revenue. But tax-financed spending is not what’s at issue today. The current debate is about deficit spending: raising spending without raising taxes.\nFor example, the large fiscal stimulus enacted in 2009 was not “paid for.” Yet it has been claimed that it created essentially no jobs. Really? With spending under the Recovery Act exceeding $600 billion (and tax cuts exceeding $200 billion), that would be quite a trick. How in the world could all that spending, accompanied by tax cuts, fail to raise employment? In fact, according to Congressional Budget Office estimates, the stimulus’s effect on employment in 2010 was at least 1.3 million net new jobs, and perhaps as many as 3.3 million.\nA second job-destroying mechanism operates through higher interest rates. When the government borrows to finance spending, that pushes interest rates up, which dissuades some businesses from investing. Thus falling private investment destroys jobs just as rising government spending is creating them.\nThere are times when this “crowding-out” argument is relevant. But not today. The Federal Reserve has been holding interest rates at ultra-low levels for several years, and will continue to do so. If interest rates don’t rise, you don’t get crowding out.\nI’m not in the mood to rip Blinder’s article apart; I’ve still got the third section of Hazlitt’s Chapter 11 to complete.  But a one word rebuttal should suffice: malinvestment.  My main object with regards to this post is to point out the sheer chicanery Blinder uses in making one of his points.  He claims that there can be no “crowding out” if interest rates don’t rise; since the Fed has kept interest rates low, then government borrowing must not be having any effect on private borrowing.\nBut don’t you think it’s just a little strange to appeal to a supposedly causal factor rather than simply looking at the relevant metric?  Which is to say, the amount of government borrowing compared to private borrowing.  As it happens the Q1-11 Z1 report on total debt was released two weeks ago and the chart below shows exactly what has happened since 2005.\nIn 2005, government debt accounted for 16% of all debt, (11.6% Federal).  In 2011, it accounts for 23% of total credit market debt, which has declined about $280 billion since its peak of Q3-08.  In that time, household sector debt has fallen from 28% to 25% and the financial sector has reduced its debt from 32% to 27%.  This would\nappear\nto show the very “crowding out” that Blinder claims cannot be possible due to the low interest rates.\nBut the key word is “appear”.  It doesn’t actually show any crowding out, because Blinder’s\nentire economic model\nis incorrect.  What it actually shows is the expected contraction of the private sector due to the ongoing economic depression as well as the utterly futile attempt of the Federal Reserve and the federal government to do exactly what Blinder wants them to do more of, which is to fill in the gap created by the private contraction.  This is why the GDP numbers have held up despite all of the obvious signs of severe economic contraction; it is also why the Congress is going to raise the debt ceiling no matter what the Red Faction members say.\nThe problem is that it only digs the hole deeper.  What we are seeing is the transformation of a mixed economy into a fully centralized command economy, where all of the economic production and consumption is directed by the State.  The good news, or at least what will have to pass for the good news, is that the system will collapse of its own weight long before the red line reaches 100.  But there is almost no chance that the economic interventionists will succeed and that yellow and blue lines will reverse course.  They are unlikely to do anything but head downward at a faster weight, since they have already realized significant losses that have not yet been accounted for.\nJust based on a very rough off-the-top-of-my-head calculation, both the blue and yellow lines would be down around 20% already if the housing market debacle was being realistically reported.  To put it in perspective, if total credit market debt had been expanding at the rate it was expanding from 2005 to 2009, it would stand at $62.6 trillion, $10 trillion more than it is today.  This indicates a total private debt-demand shortfall of around $14 trillion – or an entire year’s worth of GDP consumption.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-06-22T16:00:00+00:00"
}