{
  "url": "https://voxday.net/2004/04/09/arrow-odd-and-mighty-vikes/",
  "scraped_at": "2025-12-13T15:59:11.521966",
  "title": "Arrow-Odd and the mighty Vikes",
  "date_display": "April 9, 2004",
  "date_iso": "2004-04-09T12:27:00+00:00",
  "date_from_url": "2004-04-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Nate writes of the death-embracing Shiites: <em>I think people confuse this mindset, with that of the great warriors of the past like the Vikings and the Samari.  Blowing one’s self up on a passenger bus would hardly qualify you for Valhalla.  The Viking Warriors didn’t need to be brainwashed for three days before battle in order to welcome death. It was simply who they were. Courage was simply their way. Much in the way that cowardice is the way of the people we are dealing with now.</em></p><p>I’m not sure about that, but Nate’s comment reminds me of something.  Years ago, I was flying out to New York with my band to meet with TVT, and I happened to be reading a collection of old Viking legends.  The tale of Arrow-Odd has stuck in my mind, as I kept cracking up while reading it, and one of my bandmates asked me what was so funny.  So, I read a little bit of it and looked up to see everyone in the near vicinity staring at me with horrified faces, which, of course, only made me laugh again.</p><p>What I found amusing was one part of the tale, when Arrow-odd’s best friend is given a mortal blow while they are out a-viking.  The friend has been secretly in love with a Viking princess, who happens to return his affections.  Arrow-odd avenges his friend’s death, naturally, being the hero and all, then returns to his friend and listens to his final words, which are not quite as immortal as Mercutio’s, but nevertheless striking as he removes his armband and asks Arrow-odd to give it to the princess along with his death-greeting.  Upon his return, Arrow-odd hands her the armband, as directed, at which point she recognizes it and immediately collapses at his feet, dead of heartbreak.  The very next line, which I still remember clearly, was what amused me so:</p><p>“Arrow-odd threw back his head and laughed.”  Now, that’s a warrior ethic!  Death, be not proud.</p></div>",
  "content_text": "Nate writes of the death-embracing Shiites:\nI think people confuse this mindset, with that of the great warriors of the past like the Vikings and the Samari.  Blowing one’s self up on a passenger bus would hardly qualify you for Valhalla.  The Viking Warriors didn’t need to be brainwashed for three days before battle in order to welcome death. It was simply who they were. Courage was simply their way. Much in the way that cowardice is the way of the people we are dealing with now.\nI’m not sure about that, but Nate’s comment reminds me of something.  Years ago, I was flying out to New York with my band to meet with TVT, and I happened to be reading a collection of old Viking legends.  The tale of Arrow-Odd has stuck in my mind, as I kept cracking up while reading it, and one of my bandmates asked me what was so funny.  So, I read a little bit of it and looked up to see everyone in the near vicinity staring at me with horrified faces, which, of course, only made me laugh again.\nWhat I found amusing was one part of the tale, when Arrow-odd’s best friend is given a mortal blow while they are out a-viking.  The friend has been secretly in love with a Viking princess, who happens to return his affections.  Arrow-odd avenges his friend’s death, naturally, being the hero and all, then returns to his friend and listens to his final words, which are not quite as immortal as Mercutio’s, but nevertheless striking as he removes his armband and asks Arrow-odd to give it to the princess along with his death-greeting.  Upon his return, Arrow-odd hands her the armband, as directed, at which point she recognizes it and immediately collapses at his feet, dead of heartbreak.  The very next line, which I still remember clearly, was what amused me so:\n“Arrow-odd threw back his head and laughed.”  Now, that’s a warrior ethic!  Death, be not proud.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-09T11:27:00+00:00"
}