{
  "url": "https://voxday.net/2004/04/15/bad-cartoons-gamma-males-and-arts/",
  "scraped_at": "2025-12-19T10:47:35.487635",
  "title": "Bad cartoons, gamma males and the arts",
  "date_display": "April 15, 2004",
  "date_iso": "2004-04-15T11:47:00+00:00",
  "date_from_url": "2004-04-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Evangelical Outpost travels to the strange, strange world of <a href=\"http://www.evangelicaloutpost.com/archives/000578.html\">Boondocks creator Aaron McGruder</a>: <em>…the last straw came when he “dropped the N-word,” as one amused observer recalled. He said—bragged, even—that he’d voted for Nader in 2000. At that point, according to Hamilton Fish, the host of the party, “it got interactive.”  Eric Alterman, a columnist for The Nation, was sitting in the back of the room, next to Joe Wilson, the Ambassador. He shouted out, “Thanks for Bush!” Exactly what happened next is unclear. Alterman recalls that McGruder responded by grabbing his crotch and saying, “Try these nuts.” Jack Newfield, the longtime Village Voice writer, says that McGruder simply dared Alterman to remove him from the podium. When asked about this incident later, McGruder said, “I ain’t no punk. I ain’t gonna let someone shout and not go back at him.” Alterman walked out. “I turned to Joe and said, ‘I can’t listen to this crap anymore,’” he remembers. “I went out into the Metropolitan Club lobby—it’s a nice lobby—and I worked on my manuscript.”</em></p><p>Sometimes I really feel as if I’m missing out by not living my life in the incestuous little media fish bowl.  All of these little dust-ups that never amount to anything, posturing between gamma males who only talk smack because they know no one is ever going to actually do anything about it.  So, what do we learn from this?</p><p>1.  McGruder not only isn’t funny, he’s pathetic.  Like most lefties, he can’t take any heat.<br> <br>2.  Alterman is not only an intellectual coward, it sounds as if he might be a physical one as well.  I note in passing that he subscribes to the same pragmatic voting philosophy as our friendly lesser-of-two-evils gang here.<br> <br>3.  Left-liberal gatherings have the same high-strung bitchy vibe as sorority meetings at elite colleges.</br></br></br></br></p><p>Reading this, it makes me feel a little bit like one of my friends in the dojo, one of our most lethal fighters.  He was looking rather wistful as we watched a fight getting broken up one evening out at the clubs.  “Thirteen years I’ve trained, and no one ever even takes a swing at me,” he said, more than a little sadly.  I pointed out that it would probably help if he would stop wearing Dragon accoutrements and generally looking as if he was just itching for the opportunity to go Bruce Lee on someone.  When even the gangstas are looking at you, raising their eyebrows and looking quickly away, you might want to consider bringing it down a few notches if you want to get your bang on.</p><p>This reminds me – it isn’t related – but if you’re interested in martial arts, one of the instructors I trained under for a few months <a href=\"http://www.keepkickin.net/whitdef.htm\"> apparently has a video series out</a>.  Karl’s a nice guy and great fighter, but he could be a little touchy at times.  After Big Chilly trophied at Diamond Nationals and Karl failed to defend his title there, he was still pissed-off to such an extent that he ended up cracking Big Chilly’s ribs with a sidekick the next time they sparred.  I drove by the building where Karate Junction was the other day; it’s been demolished and a new building is going up.  No great architectural loss to the world, but it made me feel sentimental, for a moment, anyhow.</p><p>You may recall that I estimated that I’d been pounded several hundred times in the past.  Karl is responsible for about 10 or 12 of those poundings.  He knows what he’s doing.</p></div>",
  "content_text": "The Evangelical Outpost travels to the strange, strange world of\nBoondocks creator Aaron McGruder\n:\n…the last straw came when he “dropped the N-word,” as one amused observer recalled. He said—bragged, even—that he’d voted for Nader in 2000. At that point, according to Hamilton Fish, the host of the party, “it got interactive.”  Eric Alterman, a columnist for The Nation, was sitting in the back of the room, next to Joe Wilson, the Ambassador. He shouted out, “Thanks for Bush!” Exactly what happened next is unclear. Alterman recalls that McGruder responded by grabbing his crotch and saying, “Try these nuts.” Jack Newfield, the longtime Village Voice writer, says that McGruder simply dared Alterman to remove him from the podium. When asked about this incident later, McGruder said, “I ain’t no punk. I ain’t gonna let someone shout and not go back at him.” Alterman walked out. “I turned to Joe and said, ‘I can’t listen to this crap anymore,’” he remembers. “I went out into the Metropolitan Club lobby—it’s a nice lobby—and I worked on my manuscript.”\nSometimes I really feel as if I’m missing out by not living my life in the incestuous little media fish bowl.  All of these little dust-ups that never amount to anything, posturing between gamma males who only talk smack because they know no one is ever going to actually do anything about it.  So, what do we learn from this?\n1.  McGruder not only isn’t funny, he’s pathetic.  Like most lefties, he can’t take any heat.\n2.  Alterman is not only an intellectual coward, it sounds as if he might be a physical one as well.  I note in passing that he subscribes to the same pragmatic voting philosophy as our friendly lesser-of-two-evils gang here.\n3.  Left-liberal gatherings have the same high-strung bitchy vibe as sorority meetings at elite colleges.\nReading this, it makes me feel a little bit like one of my friends in the dojo, one of our most lethal fighters.  He was looking rather wistful as we watched a fight getting broken up one evening out at the clubs.  “Thirteen years I’ve trained, and no one ever even takes a swing at me,” he said, more than a little sadly.  I pointed out that it would probably help if he would stop wearing Dragon accoutrements and generally looking as if he was just itching for the opportunity to go Bruce Lee on someone.  When even the gangstas are looking at you, raising their eyebrows and looking quickly away, you might want to consider bringing it down a few notches if you want to get your bang on.\nThis reminds me – it isn’t related – but if you’re interested in martial arts, one of the instructors I trained under for a few months\napparently has a video series out\n.  Karl’s a nice guy and great fighter, but he could be a little touchy at times.  After Big Chilly trophied at Diamond Nationals and Karl failed to defend his title there, he was still pissed-off to such an extent that he ended up cracking Big Chilly’s ribs with a sidekick the next time they sparred.  I drove by the building where Karate Junction was the other day; it’s been demolished and a new building is going up.  No great architectural loss to the world, but it made me feel sentimental, for a moment, anyhow.\nYou may recall that I estimated that I’d been pounded several hundred times in the past.  Karl is responsible for about 10 or 12 of those poundings.  He knows what he’s doing.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-15T10:47:00+00:00"
}