{
  "url": "https://voxday.net/2004/04/01/because-its-most-important-thing-ever/",
  "scraped_at": "2025-12-13T15:57:48.869371",
  "title": "Because it’s the most important thing ever!",
  "date_display": "April 1, 2004",
  "date_iso": "2004-04-01T14:40:00+00:00",
  "date_from_url": "2004-04-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Derb writes on NRO’s Corner: <em>The Washington Post also signals its liberal bias by putting Al Franken on the front page AGAIN. Howard Kurtz reports from the battle front: “the signal was elusive in Los Angeles, its San Francisco station didn’t materialize, and its Internet feed kept breaking off.” So how on Earth is this front-page news? (Maybe it’s because this tinhorn network with next to no affiliates has “less than 100 employees.” Losing money hand over fist, eh?) Tom Brokaw did a whole story on his show last night, saying talk radio “of course, is dominated by conservatives.”</em></p><p>I’d be more annoyed about this bent to publicize every liberal effort in order to make them successful, except that it will make the inevitable crash-and-burn that much more enjoyable.  Several front page stories in the Post and the NBC Nightly News?  Are you kidding me?  And as for the “less than 100” employees, I don’t know if WND even has ten.  If conservatives are supposed to have all the money, how come all the big businesses seem to line up with the liberals?</p><p>Oh wait, but we’ve got Fox, sort of….</p></div>",
  "content_text": "Derb writes on NRO’s Corner:\nThe Washington Post also signals its liberal bias by putting Al Franken on the front page AGAIN. Howard Kurtz reports from the battle front: “the signal was elusive in Los Angeles, its San Francisco station didn’t materialize, and its Internet feed kept breaking off.” So how on Earth is this front-page news? (Maybe it’s because this tinhorn network with next to no affiliates has “less than 100 employees.” Losing money hand over fist, eh?) Tom Brokaw did a whole story on his show last night, saying talk radio “of course, is dominated by conservatives.”\nI’d be more annoyed about this bent to publicize every liberal effort in order to make them successful, except that it will make the inevitable crash-and-burn that much more enjoyable.  Several front page stories in the Post and the NBC Nightly News?  Are you kidding me?  And as for the “less than 100” employees, I don’t know if WND even has ten.  If conservatives are supposed to have all the money, how come all the big businesses seem to line up with the liberals?\nOh wait, but we’ve got Fox, sort of….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-01T13:40:00+00:00"
}