{
  "url": "https://voxday.net/2004/04/26/bullet-proof-bus/",
  "scraped_at": "2025-12-19T10:49:49.597988",
  "title": "Bullet-proof Bush",
  "date_display": "April 26, 2004",
  "date_iso": "2004-04-26T14:13:00+00:00",
  "date_from_url": "2004-04-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s hardly a secret that I’m tremendously disappointed, though not surprised, with the left-liberal governance of George Bush and the Republican Congress over the last three years.  The Republican Supreme Court too, but that’s another matter.  While Joseph Farah is rather less sanguine on the matter, I see no reason to change my assertion that George Bush will thump Jean-Francois Kerry in November.</p><p>First, even if the market tanks, it’s done well enough since October 2002 that he’s got enough cushion to make it through the election.  Second, no matter how badly the war on method goes, it’s unlikely to have a serious effect one way or the other.  Third, a terrorist event will actually drive people towards Bush, not away from him.  Fourth, homogamy has normal people increasingly leery of the social left.</p><p>Fifth, and most important, Jean-Francois is going to be forced to repeatedly open his mouth in public, on television.  If <a href=\"http://www.drudgereport.com/flash5.htm\">his performance on Good Morning America</a> is even close to typical, he’ll make the Dukakis drubbing look respectable.  Karl Rove and company must be drooling like starving coyotes eyeing a fat, legless chicken when they think about the upcoming debates.</p></div>",
  "content_text": "It’s hardly a secret that I’m tremendously disappointed, though not surprised, with the left-liberal governance of George Bush and the Republican Congress over the last three years.  The Republican Supreme Court too, but that’s another matter.  While Joseph Farah is rather less sanguine on the matter, I see no reason to change my assertion that George Bush will thump Jean-Francois Kerry in November.\nFirst, even if the market tanks, it’s done well enough since October 2002 that he’s got enough cushion to make it through the election.  Second, no matter how badly the war on method goes, it’s unlikely to have a serious effect one way or the other.  Third, a terrorist event will actually drive people towards Bush, not away from him.  Fourth, homogamy has normal people increasingly leery of the social left.\nFifth, and most important, Jean-Francois is going to be forced to repeatedly open his mouth in public, on television.  If\nhis performance on Good Morning America\nis even close to typical, he’ll make the Dukakis drubbing look respectable.  Karl Rove and company must be drooling like starving coyotes eyeing a fat, legless chicken when they think about the upcoming debates.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-26T13:13:00+00:00"
}