{
  "url": "https://voxday.net/2004/04/09/cognitive-dissonance-of-mora/",
  "scraped_at": "2025-12-13T15:59:09.696680",
  "title": "The Cognitive Dissonance of the Moral Supremacist",
  "date_display": "April 9, 2004",
  "date_iso": "2004-04-09T12:00:00+00:00",
  "date_from_url": "2004-04-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Margot Miflin discovers intellectual diversity on Salon: <em>I was sitting in therapy describing an in-law I like, and quickly heading for a “but.”  “He’s a loving, caring, selfless man — but his politics are all about hatred,” I said. “He’s not educated, and more significant, he’s ignorant — he actually listens to Rush Limbaugh.” I waited for a “Whoo boy!” or a sympathetic smile, but my shrink just stared at me, expressionless.</em></p><p>“I assume you’re not a Limbaugh fan,” I ventured, assured that this woman, so nuanced in her thinking, couldn’t possibly be a Dittohead. She was so reasonable that I couldn’t imagine her getting off on Rush’s demented tirades. She didn’t seem square enough for his politics, and I was certain no hate radio fan was capable of her intellectual sophistication. Besides, she was an educated urban Jewish professional, and Rush’s audience consisted largely of white suburban males.</p><p>She held my gaze a few excruciating seconds longer. “Actually, I am,” she said. My moral compass began spinning wildly. I was suddenly sitting with someone new. The levelheaded sage in whom I’d confided for nearly a year had been replaced by an off-the-rack ideologue. </p><p>There’s a few interesting revelations here.  Beyond the usual left-liberal nonsense about hate = not liberal, the idea that listening to Rush Limbaugh makes one ignorant is truly bizarre.  Ignorance is a state of knowledge.  There are surely many, many ignorant Limbaugh fans, just as there are indubitably ignorant Frankenfans.  Indeed, Al Franken himself is a shockingly ignorant man, as he required 14 researchers just to come up with numerous assertions that I was able to refute off the top of my head.  But ignorance and Rush Limbaugh listening can at most  have a parallel relationship, not a causal one, and one might easily build a case for precisely the opposite position, as any Limbaugh listener would probably far exceed the average American’s knowledge of the current dramatis personae politiche.</p><p>Second, and more significant, is the unconscious confession of the belief that an ideological difference of opinion is fundamentally moral.  This is why I regularly mock American liberals as moral supremacists, who despite their moral relativism will often assert that they are morally superior beings due solely to their ideological identification.  It is a literally nonsensical point of view – and admittedly one that not all American liberals are foolish enough to share – but as most left-liberals will be quick to inform you, consistency is the hobgoblin of small minds like yours.</p><p>But as this therapist no doubt thought secretly to herself, it’s always most amusing to watch the cognitive dissonance explode inside the dysfunctional mind of the liberal moral supremacist, who cannot abide the notion of a smarter, better-educated individual who subscribes to an ideology of the right.</p><p>UPDATE: Nate points out: <em>Note the begining of the piece. It’s the key to the humor of it all…  You have a woman who clearly views herself as in control, intellegent, articulate, educated, and in all aspects superior to the man* she is talking about…  And she begins the piece with the statement:  “I was in therapy”</em></p><p>Good point, Nate.  While I have a reasonable amount of left-liberal friends, most of my immediate social circle is conservative or libertarian.  I think one of them was in a bit of therapy a few years back, and she’s one of the only left-liberals in the bunch.  I think that would make for an interesting scientific study.  What percentage of Democrats, Republicans and Libertarians have been in therapy*<br> <br><em><br> <br>* Actually, it was another woman, but you couldn’t tell from the bit I quoted.<br> <br>** Rehab doesn’t count.</br></br></br></br></em></br></br></p></div>",
  "content_text": "Margot Miflin discovers intellectual diversity on Salon:\nI was sitting in therapy describing an in-law I like, and quickly heading for a “but.”  “He’s a loving, caring, selfless man — but his politics are all about hatred,” I said. “He’s not educated, and more significant, he’s ignorant — he actually listens to Rush Limbaugh.” I waited for a “Whoo boy!” or a sympathetic smile, but my shrink just stared at me, expressionless.\n“I assume you’re not a Limbaugh fan,” I ventured, assured that this woman, so nuanced in her thinking, couldn’t possibly be a Dittohead. She was so reasonable that I couldn’t imagine her getting off on Rush’s demented tirades. She didn’t seem square enough for his politics, and I was certain no hate radio fan was capable of her intellectual sophistication. Besides, she was an educated urban Jewish professional, and Rush’s audience consisted largely of white suburban males.\nShe held my gaze a few excruciating seconds longer. “Actually, I am,” she said. My moral compass began spinning wildly. I was suddenly sitting with someone new. The levelheaded sage in whom I’d confided for nearly a year had been replaced by an off-the-rack ideologue.\nThere’s a few interesting revelations here.  Beyond the usual left-liberal nonsense about hate = not liberal, the idea that listening to Rush Limbaugh makes one ignorant is truly bizarre.  Ignorance is a state of knowledge.  There are surely many, many ignorant Limbaugh fans, just as there are indubitably ignorant Frankenfans.  Indeed, Al Franken himself is a shockingly ignorant man, as he required 14 researchers just to come up with numerous assertions that I was able to refute off the top of my head.  But ignorance and Rush Limbaugh listening can at most  have a parallel relationship, not a causal one, and one might easily build a case for precisely the opposite position, as any Limbaugh listener would probably far exceed the average American’s knowledge of the current dramatis personae politiche.\nSecond, and more significant, is the unconscious confession of the belief that an ideological difference of opinion is fundamentally moral.  This is why I regularly mock American liberals as moral supremacists, who despite their moral relativism will often assert that they are morally superior beings due solely to their ideological identification.  It is a literally nonsensical point of view – and admittedly one that not all American liberals are foolish enough to share – but as most left-liberals will be quick to inform you, consistency is the hobgoblin of small minds like yours.\nBut as this therapist no doubt thought secretly to herself, it’s always most amusing to watch the cognitive dissonance explode inside the dysfunctional mind of the liberal moral supremacist, who cannot abide the notion of a smarter, better-educated individual who subscribes to an ideology of the right.\nUPDATE: Nate points out:\nNote the begining of the piece. It’s the key to the humor of it all…  You have a woman who clearly views herself as in control, intellegent, articulate, educated, and in all aspects superior to the man* she is talking about…  And she begins the piece with the statement:  “I was in therapy”\nGood point, Nate.  While I have a reasonable amount of left-liberal friends, most of my immediate social circle is conservative or libertarian.  I think one of them was in a bit of therapy a few years back, and she’s one of the only left-liberals in the bunch.  I think that would make for an interesting scientific study.  What percentage of Democrats, Republicans and Libertarians have been in therapy*\n* Actually, it was another woman, but you couldn’t tell from the bit I quoted.\n** Rehab doesn’t count.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-09T11:00:00+00:00"
}