{
  "url": "https://voxday.net/2004/04/13/conservative-delusions/",
  "scraped_at": "2025-12-19T10:47:10.213319",
  "title": "Conservative delusions",
  "date_display": "April 13, 2004",
  "date_iso": "2004-04-13T07:07:00+00:00",
  "date_from_url": "2004-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Let’s get one thing straight.  I consider the Democrats to be the party of lies.  They have to lie, because no one who is both sane and self-responsible is ever going to vote for a program of total socialist distribution unless they are on welfare or a government employee.  But Republicans have clearly begun to learn from their counterparts, not only the politicians but the commentators too.</p><p>Witness the recent words of Mrs. Hagelin writing of Bill Bennet on WND: <em>Yes, the situation in Iraq is messy, Bennett said in a magnificent, powerful speech he gave in November to Heritage Foundation members. And yes, President Bush and his aides sometimes have seemed reluctant to defend their actions.  “But let’s be clear on this,” he said that day. “In the issue that matters most – our survival, the civilized world’s survival, the spread of democracy, the war against terrorism and radical Islam – the president is right and his critics wrong.”</em></p><p>Now remember, this is from a column claiming to set the record straight.  So, let’s review the assertions:</p><p>1.  The situation is messy, yes.<br> <br>2.  Bennett’s speech was magnificent and powerful.  I wasn’t there, but we’ll give him the benefit of the doubt.  2/2.<br> <br>3.  The issue that matters most is our survival.  Hmmm.  Well, I believe that history illustrates that Franklin was correct in saying those who value security over freedom will have neither.  The administration has argued that we must accept some sacrifice of liberty in order to ensure our security, which is a dubious argument that has been used since Marius and Sulla began the destruction of the Roman republic.  Strike one.<br> <br>4.  The president is defending the civilized world.  The three greatest threats to the civilized world at this time are the global ambitions of the United Nations, the coming breakdown of central banking and the global jihad.  President Bush is an advocate of the first two and refuses to address the third.  Strike two.<br> <br>5.  “the spread of democracy”  We don’t have a democracy, we have (or had) a republic.  We’re preventing democratic rule in Iraq.  Strike three.<br> <br>6.  The president is right about the war on terrorism.  And he’s guaranteeing Arafat’s survival?  Not really a strike, not really a hit.  Call it a ball.<br> <br>7.  The president is right about radical Islam.  Let’s see, everyone else and his brother knows that the difference between the global jihadists and the so-called moderates is mostly one of degree.  But the only problem is that “the religion of peace” has been “hijacked”.  Right, tell it to the Ummayids and the Abbasids, the caliphs and their names boasting of martial prowess.  Strike four.</br></br></br></br></br></br></br></br></br></br></br></br></p><p>Four and one-half incorrect assertions in seven is setting the record straight?  I suppose that depends upon what the meaning of is, is.  What with their rampant and unsupported assertions of secret second-term plans, secret war strategy and now a secret war against “radical Islam”, I’m beginning to wonder if conservative supporters of the current administration aren’t becoming entirely delusional.</p></div>",
  "content_text": "Let’s get one thing straight.  I consider the Democrats to be the party of lies.  They have to lie, because no one who is both sane and self-responsible is ever going to vote for a program of total socialist distribution unless they are on welfare or a government employee.  But Republicans have clearly begun to learn from their counterparts, not only the politicians but the commentators too.\nWitness the recent words of Mrs. Hagelin writing of Bill Bennet on WND:\nYes, the situation in Iraq is messy, Bennett said in a magnificent, powerful speech he gave in November to Heritage Foundation members. And yes, President Bush and his aides sometimes have seemed reluctant to defend their actions.  “But let’s be clear on this,” he said that day. “In the issue that matters most – our survival, the civilized world’s survival, the spread of democracy, the war against terrorism and radical Islam – the president is right and his critics wrong.”\nNow remember, this is from a column claiming to set the record straight.  So, let’s review the assertions:\n1.  The situation is messy, yes.\n2.  Bennett’s speech was magnificent and powerful.  I wasn’t there, but we’ll give him the benefit of the doubt.  2/2.\n3.  The issue that matters most is our survival.  Hmmm.  Well, I believe that history illustrates that Franklin was correct in saying those who value security over freedom will have neither.  The administration has argued that we must accept some sacrifice of liberty in order to ensure our security, which is a dubious argument that has been used since Marius and Sulla began the destruction of the Roman republic.  Strike one.\n4.  The president is defending the civilized world.  The three greatest threats to the civilized world at this time are the global ambitions of the United Nations, the coming breakdown of central banking and the global jihad.  President Bush is an advocate of the first two and refuses to address the third.  Strike two.\n5.  “the spread of democracy”  We don’t have a democracy, we have (or had) a republic.  We’re preventing democratic rule in Iraq.  Strike three.\n6.  The president is right about the war on terrorism.  And he’s guaranteeing Arafat’s survival?  Not really a strike, not really a hit.  Call it a ball.\n7.  The president is right about radical Islam.  Let’s see, everyone else and his brother knows that the difference between the global jihadists and the so-called moderates is mostly one of degree.  But the only problem is that “the religion of peace” has been “hijacked”.  Right, tell it to the Ummayids and the Abbasids, the caliphs and their names boasting of martial prowess.  Strike four.\nFour and one-half incorrect assertions in seven is setting the record straight?  I suppose that depends upon what the meaning of is, is.  What with their rampant and unsupported assertions of secret second-term plans, secret war strategy and now a secret war against “radical Islam”, I’m beginning to wonder if conservative supporters of the current administration aren’t becoming entirely delusional.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-13T06:07:00+00:00"
}