{
  "url": "https://voxday.net/2004/04/15/crocodile-tears-2/",
  "scraped_at": "2025-12-19T10:47:37.396360",
  "title": "Crocodile tears",
  "date_display": "April 15, 2004",
  "date_iso": "2004-04-15T14:41:00+00:00",
  "date_from_url": "2004-04-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The newspapers are crying crocodile tears about <a href=\"http://startribune.com/stories/1762/4723178.html\">the young woman soldier who died in Iraq</a> and her two sisters who are still on duty.  Keep in mind that these are, for the most part, the very individuals who have been arguing that women have an absolute right to serve in the military, not only in a support role but in the elite special forces as well.  They cheered the ludicrous notion of GI Jane, the Navy SEAL, (GI?) and then are horrified when these American Amazons experience what happens to a dependable percentage of soldiers in combat.</p><p>As I have written before, most women and the sort of men who don’t engage in any physical activity – such as the average left-oriented journalist – have simply no idea how great a divide separates the sexes.  I’m not a particularly big guy, but when I was in the weight room doing arms today, I curled Space Bunny’s weight five times.  Now, consider that she’s taller than average and extremely fit – scored 100 on the USMC’s fitness test when we took it for fun one day – but can’t even come close to benching her own bodyweight once.</p><p>There are those who think that modern combat doesn’t require physical strength, and it’s true, you’re not often carrying a sword and shield around these days.  But an M-16 and several hundred rounds of ammo aren’t exactly weightless, and in the field, it’s not always possible to have the cooking staff setting up a kitchen and serving you hot meals.  So, you’ll probably want to carry around a few MREs.  And then, you’re in the desert so water is a necessity, and water is surprisingly heavy.  Not to mention the GPS, grenades and ten other things that I’m forgetting.</p><p>I’m sorry for that girl, her sisters and her parents too.  But she should never have been there, in a combat zone, in the first place.</p></div>",
  "content_text": "The newspapers are crying crocodile tears about\nthe young woman soldier who died in Iraq\nand her two sisters who are still on duty.  Keep in mind that these are, for the most part, the very individuals who have been arguing that women have an absolute right to serve in the military, not only in a support role but in the elite special forces as well.  They cheered the ludicrous notion of GI Jane, the Navy SEAL, (GI?) and then are horrified when these American Amazons experience what happens to a dependable percentage of soldiers in combat.\nAs I have written before, most women and the sort of men who don’t engage in any physical activity – such as the average left-oriented journalist – have simply no idea how great a divide separates the sexes.  I’m not a particularly big guy, but when I was in the weight room doing arms today, I curled Space Bunny’s weight five times.  Now, consider that she’s taller than average and extremely fit – scored 100 on the USMC’s fitness test when we took it for fun one day – but can’t even come close to benching her own bodyweight once.\nThere are those who think that modern combat doesn’t require physical strength, and it’s true, you’re not often carrying a sword and shield around these days.  But an M-16 and several hundred rounds of ammo aren’t exactly weightless, and in the field, it’s not always possible to have the cooking staff setting up a kitchen and serving you hot meals.  So, you’ll probably want to carry around a few MREs.  And then, you’re in the desert so water is a necessity, and water is surprisingly heavy.  Not to mention the GPS, grenades and ten other things that I’m forgetting.\nI’m sorry for that girl, her sisters and her parents too.  But she should never have been there, in a combat zone, in the first place.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-15T13:41:00+00:00"
}