{
  "url": "https://voxday.net/2004/04/29/disgusted-with-republican-leadership/",
  "scraped_at": "2025-12-19T10:50:20.547737",
  "title": "Disgusted with the Republican leadership",
  "date_display": "April 29, 2004",
  "date_iso": "2004-04-29T11:42:00+00:00",
  "date_from_url": "2004-04-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Joseph Farah is disgusted with them over their support of Arlen Spector.  Adam McManus has an even better reason: in a more obscure race in Alabama for State Board of Education, the state Republican Party decided to disqualify Christian radio talk-show host Kelly McGinley from the ballot, indicating she was too disloyal. McGinley had written on her website that “maybe, if we practice tough love, the Republican Party will repent and come back to its platform.”  Thankfully, Montgomery County Circuit Judge William Shashy said in a recent ruling that while McGinley had made “strong criticisms” of the GOP, the party had not set any rules that would disqualify a candidate for such criticisms.</p><p>“Zere vill be no dissent!  You must adhere to zee Party!”  Maybe the Republican leadership is fascist after all.  Although you’d think calling for a strict adherence to the party platform would be considered desirable.  I have no doubt they’ll take care of that little rule next time around.  Obey or Else!</p><p>I’m not disgusted, however, I’m amused.  You get what you pay for and you get what you vote for.  If you’re dumb enough to support strong government “conservatives”, don’t be surprised when you get left-liberal leadership.  You cannot hope to see smaller government come from those dedicated to making it bigger.  I’d think this was <em>a priori</em> apparent, but it’s clear that a surprisingly large number of conservative Republicans need to hear it anyhow: some people don’t mean what they say.  This can even be true of politicians whose last name isn’t Clinton and who don’t have a (D) in front of their name.</p><p>I’m so tired of hearing “well, I think Bush is a good man and I believe he really wants to blah blah blah.”  You can think whatever you want, of course, but you’re obviously not paying very close attention.  So he led us into Afghanistan and Iraq – BFD!  Wilson got us into WWI, FDR led us into WWII, LBJ led us into Vietnam, did that make them all conservative champions of small government?</p></div>",
  "content_text": "Joseph Farah is disgusted with them over their support of Arlen Spector.  Adam McManus has an even better reason: in a more obscure race in Alabama for State Board of Education, the state Republican Party decided to disqualify Christian radio talk-show host Kelly McGinley from the ballot, indicating she was too disloyal. McGinley had written on her website that “maybe, if we practice tough love, the Republican Party will repent and come back to its platform.”  Thankfully, Montgomery County Circuit Judge William Shashy said in a recent ruling that while McGinley had made “strong criticisms” of the GOP, the party had not set any rules that would disqualify a candidate for such criticisms.\n“Zere vill be no dissent!  You must adhere to zee Party!”  Maybe the Republican leadership is fascist after all.  Although you’d think calling for a strict adherence to the party platform would be considered desirable.  I have no doubt they’ll take care of that little rule next time around.  Obey or Else!\nI’m not disgusted, however, I’m amused.  You get what you pay for and you get what you vote for.  If you’re dumb enough to support strong government “conservatives”, don’t be surprised when you get left-liberal leadership.  You cannot hope to see smaller government come from those dedicated to making it bigger.  I’d think this was\na priori\napparent, but it’s clear that a surprisingly large number of conservative Republicans need to hear it anyhow: some people don’t mean what they say.  This can even be true of politicians whose last name isn’t Clinton and who don’t have a (D) in front of their name.\nI’m so tired of hearing “well, I think Bush is a good man and I believe he really wants to blah blah blah.”  You can think whatever you want, of course, but you’re obviously not paying very close attention.  So he led us into Afghanistan and Iraq – BFD!  Wilson got us into WWI, FDR led us into WWII, LBJ led us into Vietnam, did that make them all conservative champions of small government?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-29T10:42:00+00:00"
}