{
  "url": "https://voxday.net/2004/04/07/enough-with-nazis/",
  "scraped_at": "2025-12-13T15:58:40.576577",
  "title": "Enough with the Nazis",
  "date_display": "April 7, 2004",
  "date_iso": "2004-04-07T08:47:00+00:00",
  "date_from_url": "2004-04-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Someone get all that stuff to the CAVE, will you?  Do we have one yet?  Anyhow, just copy all that stuff and throw it in there and I’ll clean it up later.  I’m not really in the mood to deal with it now, as I’ve got a car in the shop to repair the damage inflicted after getting hit while parked at the gas pump and Arsenal got knocked out of the Champions League by bloody Chelsea after losing in the FA Cup to United.</p><p>If they blow the Premiership now, I’m going to think about switching my allegiance to Scunthorpe or something.</p><p>Also, LD has something going at voxday.tribe.net.  Check it out, even <a href=\"http://www.tribe.net/tribe/servlet/template/pub%2Crss%2CTribe.vm?tribeid=b9df0e93-1b89-4254-ac5a-c363f40dcc47\">via RSS</a> if you like.  It should allow for more in depth conversation for those who wish it, although I rather like the Haloscan limits since it keeps things to the point.  If you want something to go further in depth, you can always email me and request it to be posted.  Except for Resispa, I’m a little frightened of what he might come up with if given half the chance.</p></div>",
  "content_text": "Someone get all that stuff to the CAVE, will you?  Do we have one yet?  Anyhow, just copy all that stuff and throw it in there and I’ll clean it up later.  I’m not really in the mood to deal with it now, as I’ve got a car in the shop to repair the damage inflicted after getting hit while parked at the gas pump and Arsenal got knocked out of the Champions League by bloody Chelsea after losing in the FA Cup to United.\nIf they blow the Premiership now, I’m going to think about switching my allegiance to Scunthorpe or something.\nAlso, LD has something going at voxday.tribe.net.  Check it out, even\nvia RSS\nif you like.  It should allow for more in depth conversation for those who wish it, although I rather like the Haloscan limits since it keeps things to the point.  If you want something to go further in depth, you can always email me and request it to be posted.  Except for Resispa, I’m a little frightened of what he might come up with if given half the chance.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-07T07:47:00+00:00"
}