{
  "url": "https://voxday.net/2004/04/07/fallujah-and-lessons-of-chechnya/",
  "scraped_at": "2025-12-13T15:58:42.042731",
  "title": "Fallujah and the lessons of Chechnya",
  "date_display": "April 7, 2004",
  "date_iso": "2004-04-07T09:48:00+00:00",
  "date_from_url": "2004-04-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here’s what I don’t understand about what I consider to be the horrendously bad idea to occupy Iraq.  Given the failed French colonization of Algeria, the failed Soviet occupation of Afghanistan and the failing Russian occupation of Chechnya, why does anyone believe that an American occupation of Iraq is likely to be any more successful?  Yes, I’m aware of the success of the Japanese and German occupations, but in case you hadn’t noticed, there are significant differences between those two cultures and Arabic culture.  We won the war – which I believe was justified by virtue of Hussein’s repeated violations of the 1991 ceasefire – but once Baghdad had fallen and Hussein was in our hands, our job was done.</p><p>In the last six years, the Russians have killed almost ten percent of the Chechnyan population, and yesterday they still lost almost as many troops as we did in fighting the bloodiest battle of the Iraqi occupation to date.  Does anyone seriously think that the USA is going to be willing wipe out 2.2 million Iraqis in an attempt to pacify the country?  I don’t believe that for a second, and yet the Chechnyan example indicates that even that might not be enough.  Iraq is not exactly a country unaccustomed to suffering savage butchery.</p><p>It is a foolish, foolish thing to stake national prestige on changing the hearts and minds of another culture.  In order to successfully extricate our forces without creating significant doubts about our military power, it will now probably be necessary to topple another regime before declaring victory and bringing our troops home as we should have done once Baghdad had fallen and Hussein was in our hands.  I imagine Iran is the next target, since Israel is going to hit them soon before their nuclear production facilities go online if we don’t do anything first.</p><p>And before Bane, Rat Spleen and company start leaping all over me with unfounded accusations of martial cowardice and dovishness, I’d ask them to answer one question.  If we’re not as ruthless as the Russians and the French, and their greater ruthlessness did not suffice to pacify other Arab nations, how and why do you expect this occupation to end well?  And what is your metric, at what point would you be willing to admit that the occupation has failed and the troops should come home?</p><p>One of history’s most repetitive lessons is that there are limits to what can be accomplished through military power.  As governments since the days of Nero have learned time and time again, you cannot force people to think and behave as you wish if they prefer to die.  You can only kill them, and in doing so, you invariably sow the seeds of your own destruction.</p><p>The Romans maintained their dominance for so long by constantly sowing discord among their enemies, keeping them off-balance and invading primarily when a leader appeared and gathered enough power to pose a danger to the empire.  As <em>Roma moderna</em>, we would do well to imitate them in this regard.</p></div>",
  "content_text": "Here’s what I don’t understand about what I consider to be the horrendously bad idea to occupy Iraq.  Given the failed French colonization of Algeria, the failed Soviet occupation of Afghanistan and the failing Russian occupation of Chechnya, why does anyone believe that an American occupation of Iraq is likely to be any more successful?  Yes, I’m aware of the success of the Japanese and German occupations, but in case you hadn’t noticed, there are significant differences between those two cultures and Arabic culture.  We won the war – which I believe was justified by virtue of Hussein’s repeated violations of the 1991 ceasefire – but once Baghdad had fallen and Hussein was in our hands, our job was done.\nIn the last six years, the Russians have killed almost ten percent of the Chechnyan population, and yesterday they still lost almost as many troops as we did in fighting the bloodiest battle of the Iraqi occupation to date.  Does anyone seriously think that the USA is going to be willing wipe out 2.2 million Iraqis in an attempt to pacify the country?  I don’t believe that for a second, and yet the Chechnyan example indicates that even that might not be enough.  Iraq is not exactly a country unaccustomed to suffering savage butchery.\nIt is a foolish, foolish thing to stake national prestige on changing the hearts and minds of another culture.  In order to successfully extricate our forces without creating significant doubts about our military power, it will now probably be necessary to topple another regime before declaring victory and bringing our troops home as we should have done once Baghdad had fallen and Hussein was in our hands.  I imagine Iran is the next target, since Israel is going to hit them soon before their nuclear production facilities go online if we don’t do anything first.\nAnd before Bane, Rat Spleen and company start leaping all over me with unfounded accusations of martial cowardice and dovishness, I’d ask them to answer one question.  If we’re not as ruthless as the Russians and the French, and their greater ruthlessness did not suffice to pacify other Arab nations, how and why do you expect this occupation to end well?  And what is your metric, at what point would you be willing to admit that the occupation has failed and the troops should come home?\nOne of history’s most repetitive lessons is that there are limits to what can be accomplished through military power.  As governments since the days of Nero have learned time and time again, you cannot force people to think and behave as you wish if they prefer to die.  You can only kill them, and in doing so, you invariably sow the seeds of your own destruction.\nThe Romans maintained their dominance for so long by constantly sowing discord among their enemies, keeping them off-balance and invading primarily when a leader appeared and gathered enough power to pose a danger to the empire.  As\nRoma moderna\n, we would do well to imitate them in this regard.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-07T08:48:00+00:00"
}