{
  "url": "https://voxday.net/2004/04/22/god-wants-you-to-sell-your-sou/",
  "scraped_at": "2025-12-19T10:49:01.368500",
  "title": "God wants you to sell your soul",
  "date_display": "April 22, 2004",
  "date_iso": "2004-04-22T07:06:00+00:00",
  "date_from_url": "2004-04-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scott Breed writes to WND: <em>It is our obligation to vote and to vote prayerfully. If you think conceding the presidency of the United States — to a person who is as outside the will of God as John Kerry seems to be — is OK as long as you maintain the principles of your vote, you are making not only a grave political mistake, but possibly a grave spiritual sin.</em></p><p>This cretin attempts to argue that since no man is perfect, you must vote for the lesser of two evils.  What a load of literal non-sense.  There is a massive difference between voting for someone and refusing to vote for his opponent, and it is significant that he can’t even quite bring himself to utter the words that not supporting evil is “a grave spiritual sin.”</p><p>A general warning to Christians: if you feel the need to preface a statement with “possibly” or “could lead to” before a statement on sin, then stop and rethink what you’re about to say.   Nine times out of ten, you’d be much better off shutting your trap before you make an ass of yourself.</p><p>George Delano must be in trouble if his supporters are feeling the need to accuse others of grave sin for not supporting a man who repeatedly offends their conservative principles.  Now there’s a Christian notion if I’ve ever heard one – sell out your principles for worldly power.  This would be outrageous if it wasn’t so outrageously stupid.  President Bush made a calculated decision to move to the left.  Neither he nor his supporters should be surprised or upset that those of us on the right have no desire to see that he maintains his power.  If the Republican Party will not support individual freedom, Constitutional rights, national sovereignty and small government, it has no reason whatsoever to expect that those of us who do will continue to support it.</p><p>If you genuinely like George Bush and his performance in office, then vote for him, by all means.  But if your only reason for supporting Republicans is that Democrats are worse, you are politically rootless.  You have no principle except your misconceived pragmatism.  That argument will never change.  You will never leave the Republican Party, no matter what they do, because the Democrats will always be worse as the two parties drift slowly, but surely, towards their bipartisan destination of all-powerful state.</p></div>",
  "content_text": "Scott Breed writes to WND:\nIt is our obligation to vote and to vote prayerfully. If you think conceding the presidency of the United States — to a person who is as outside the will of God as John Kerry seems to be — is OK as long as you maintain the principles of your vote, you are making not only a grave political mistake, but possibly a grave spiritual sin.\nThis cretin attempts to argue that since no man is perfect, you must vote for the lesser of two evils.  What a load of literal non-sense.  There is a massive difference between voting for someone and refusing to vote for his opponent, and it is significant that he can’t even quite bring himself to utter the words that not supporting evil is “a grave spiritual sin.”\nA general warning to Christians: if you feel the need to preface a statement with “possibly” or “could lead to” before a statement on sin, then stop and rethink what you’re about to say.   Nine times out of ten, you’d be much better off shutting your trap before you make an ass of yourself.\nGeorge Delano must be in trouble if his supporters are feeling the need to accuse others of grave sin for not supporting a man who repeatedly offends their conservative principles.  Now there’s a Christian notion if I’ve ever heard one – sell out your principles for worldly power.  This would be outrageous if it wasn’t so outrageously stupid.  President Bush made a calculated decision to move to the left.  Neither he nor his supporters should be surprised or upset that those of us on the right have no desire to see that he maintains his power.  If the Republican Party will not support individual freedom, Constitutional rights, national sovereignty and small government, it has no reason whatsoever to expect that those of us who do will continue to support it.\nIf you genuinely like George Bush and his performance in office, then vote for him, by all means.  But if your only reason for supporting Republicans is that Democrats are worse, you are politically rootless.  You have no principle except your misconceived pragmatism.  That argument will never change.  You will never leave the Republican Party, no matter what they do, because the Democrats will always be worse as the two parties drift slowly, but surely, towards their bipartisan destination of all-powerful state.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-22T06:06:00+00:00"
}