{
  "url": "https://voxday.net/2004/04/17/good-luck-fixing-gop/",
  "scraped_at": "2025-12-19T10:48:05.088635",
  "title": "Good luck fixing the GOP",
  "date_display": "April 17, 2004",
  "date_iso": "2004-04-17T10:23:00+00:00",
  "date_from_url": "2004-04-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Robert Novak explains how it works: <em>Following her impressive performance on NBC’s “Meet the Press” April 4, Bush adviser Karen Hughes’s friends and supporters in both Washington and Texas started quietly boosting her for governor of Texas in 2006.  Gov. Rick Perry, who succeeded to the governorship in 2000 when Gov. George W. Bush became president, has indicated he will seek another term. But Perry has many enemies, and the word in Texas political circles is that Sen. Kay Bailey Hutchison could challenge him for the Republican nomination.   Conservative activists do not consider Hughes one of them and are not talking about her for governor. However, Republican insiders who are not fond of either Perry or Hutchison are starting to promote Hughes, a former television journalist who never has run for public office.</em></p><p>So, even if the party has someone in office, or an experienced conservative (ADA rating 0, ACU rating 88) interested in pursuing it – Perry has been hounded by <a href=\"http://www.txtriangle.com/archive/1221/news3.htm\">incessant rumors</a> that he’s gay, that is the elephant around which Novak is dancing – the wishes of the GOPolitburo must take precedence.  If a conservative senator can be passed over in favor of a rookie courtier, what does that tell you about your chances, as a complete outsider, of effecting any change at all?</p></div>",
  "content_text": "Robert Novak explains how it works:\nFollowing her impressive performance on NBC’s “Meet the Press” April 4, Bush adviser Karen Hughes’s friends and supporters in both Washington and Texas started quietly boosting her for governor of Texas in 2006.  Gov. Rick Perry, who succeeded to the governorship in 2000 when Gov. George W. Bush became president, has indicated he will seek another term. But Perry has many enemies, and the word in Texas political circles is that Sen. Kay Bailey Hutchison could challenge him for the Republican nomination.   Conservative activists do not consider Hughes one of them and are not talking about her for governor. However, Republican insiders who are not fond of either Perry or Hutchison are starting to promote Hughes, a former television journalist who never has run for public office.\nSo, even if the party has someone in office, or an experienced conservative (ADA rating 0, ACU rating 88) interested in pursuing it – Perry has been hounded by\nincessant rumors\nthat he’s gay, that is the elephant around which Novak is dancing – the wishes of the GOPolitburo must take precedence.  If a conservative senator can be passed over in favor of a rookie courtier, what does that tell you about your chances, as a complete outsider, of effecting any change at all?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-17T09:23:00+00:00"
}