{
  "url": "https://voxday.net/2004/04/26/good-riddance-6/",
  "scraped_at": "2025-12-19T10:49:42.260007",
  "title": "Good riddance",
  "date_display": "April 26, 2004",
  "date_iso": "2004-04-26T07:31:00+00:00",
  "date_from_url": "2004-04-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Pat Buchanan writes on WND: “If we have to make common cause with the more hawkish liberals and fight the conservatives, that is fine with me,” William Kristol has told the New York Times.  The Weekly Standard editor added that the neoconservatives <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=38206\">may just abandon the Right</a> altogether and convert to neoliberalism…. The day after Kristol said he preferred Kerry to conservatives skeptical of committing more troops to Iraq, this item appeared in the Wall Street Journal: “Mr. Kristol thinks Mr. Bush should use the revelations [from the Woodward book] to shake up his war cabinet by firing Mr. Powell … along with Defense Secretary Donald Rumsfeld, who has pushed for smaller deployments of U.S. forces than some critics, including Mr. Kristol, think wise.”</p><p>As regular readers know, I believe that it is either necessary to pull out of Iraq and focus on defending the borders or grasp the nettle and fight the war that has been declared on America for the last 20+ years.  However, the current crew is manifestly the wrong gang to fight either the war on method or the clash of civilizations war that will likely, in the end, prove unavoidable.  If you can’t even name your enemy, much less deal with its self-admitted fifth column, you’re the wrong man for the job.</p><p>Kristol’s statements has some interesting implications, however, for how one views Kerry.  They demonstrate a strong indication that the neocons believe Kerry will be even more enthusiastic about fighting wars abroad than Bush has proved himself to be.  I have never bought into the notion that a Democratic president will be hesitant to fight any war, because Democrats love the notion of expanding central power and using war as an excuse to do so.  There’s a reason why the term Isolationist Right exists, after all, while the idea of an Isolationist Left sounds like a contradiction in terms.</p><p>However this plays out, I won’t be sorry to see the neocons switch sides again.</p></div>",
  "content_text": "Pat Buchanan writes on WND: “If we have to make common cause with the more hawkish liberals and fight the conservatives, that is fine with me,” William Kristol has told the New York Times.  The Weekly Standard editor added that the neoconservatives\nmay just abandon the Right\naltogether and convert to neoliberalism…. The day after Kristol said he preferred Kerry to conservatives skeptical of committing more troops to Iraq, this item appeared in the Wall Street Journal: “Mr. Kristol thinks Mr. Bush should use the revelations [from the Woodward book] to shake up his war cabinet by firing Mr. Powell … along with Defense Secretary Donald Rumsfeld, who has pushed for smaller deployments of U.S. forces than some critics, including Mr. Kristol, think wise.”\nAs regular readers know, I believe that it is either necessary to pull out of Iraq and focus on defending the borders or grasp the nettle and fight the war that has been declared on America for the last 20+ years.  However, the current crew is manifestly the wrong gang to fight either the war on method or the clash of civilizations war that will likely, in the end, prove unavoidable.  If you can’t even name your enemy, much less deal with its self-admitted fifth column, you’re the wrong man for the job.\nKristol’s statements has some interesting implications, however, for how one views Kerry.  They demonstrate a strong indication that the neocons believe Kerry will be even more enthusiastic about fighting wars abroad than Bush has proved himself to be.  I have never bought into the notion that a Democratic president will be hesitant to fight any war, because Democrats love the notion of expanding central power and using war as an excuse to do so.  There’s a reason why the term Isolationist Right exists, after all, while the idea of an Isolationist Left sounds like a contradiction in terms.\nHowever this plays out, I won’t be sorry to see the neocons switch sides again.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-26T06:31:00+00:00"
}