{
  "url": "https://voxday.net/2004/04/09/harvards-always-been-full-of-i/",
  "scraped_at": "2025-12-13T15:59:04.202003",
  "title": "Harvard’s always been full of it",
  "date_display": "April 9, 2004",
  "date_iso": "2004-04-09T09:50:00+00:00",
  "date_from_url": "2004-04-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Evangelical Outpost <a href=\"http://www.evangelicaloutpost.com/archives/000570.html#more\">slams Harvard’s school of divinity</a> by using the cruel technique of quoting its professors: <em>When the faculty gathered recently to discuss Mel Gibson’s “The Passion”, the reaction was unanimous — they hated it. That in itself is probably to be expected since claiming an appreciation of the movie would have required taking a courageously contrarian stance. But the attitude toward the reference material is rather peculiar and disturbing:  “Although Gibson claimed “The Passion of the Christ” remains true to the history of the Gospels, [François] Bovon pointed out that this might be a hollow claim. “The Gospels are history and interpretation,” he said. “The Gospels are not our best sources to the history of the passion of Jesus.”</em></p><p>Someone should point out to Dr. Bovon that the Gospels are the only sources to the history of the passion event. You would expect that the former dean of the University of Geneva to have access to that type of knowledge. (John Calvin, who founded the school, must be spinning in his grave.)  Harvey Cox, who proudly wears the label of “heretic”, also weighs in:  “The problem is that much of this stuff in the movie is in the Gospels,” countered Cox. “It’s read every Good Friday in churches.” </p><p>This reminds me of my favorite, and only, experience at Harvard when I was up there for the weekend visiting a friend.  At a party that night, we were listening to a pretentious hockey player pontificate about how fabulous the school’s hockey team was, leaving everyone present with the distinct impression that he was a member of the team.  He was more than a little put out when I asked him why he was not in Minnesota, as the team was away playing the Gophers that weekend.  He finally admitted that he was just an intramural player, trying to impress the chickadees, of course.  From such nebulous stuff are our political leaders made.</p></div>",
  "content_text": "The Evangelical Outpost\nslams Harvard’s school of divinity\nby using the cruel technique of quoting its professors:\nWhen the faculty gathered recently to discuss Mel Gibson’s “The Passion”, the reaction was unanimous — they hated it. That in itself is probably to be expected since claiming an appreciation of the movie would have required taking a courageously contrarian stance. But the attitude toward the reference material is rather peculiar and disturbing:  “Although Gibson claimed “The Passion of the Christ” remains true to the history of the Gospels, [François] Bovon pointed out that this might be a hollow claim. “The Gospels are history and interpretation,” he said. “The Gospels are not our best sources to the history of the passion of Jesus.”\nSomeone should point out to Dr. Bovon that the Gospels are the only sources to the history of the passion event. You would expect that the former dean of the University of Geneva to have access to that type of knowledge. (John Calvin, who founded the school, must be spinning in his grave.)  Harvey Cox, who proudly wears the label of “heretic”, also weighs in:  “The problem is that much of this stuff in the movie is in the Gospels,” countered Cox. “It’s read every Good Friday in churches.”\nThis reminds me of my favorite, and only, experience at Harvard when I was up there for the weekend visiting a friend.  At a party that night, we were listening to a pretentious hockey player pontificate about how fabulous the school’s hockey team was, leaving everyone present with the distinct impression that he was a member of the team.  He was more than a little put out when I asked him why he was not in Minnesota, as the team was away playing the Gophers that weekend.  He finally admitted that he was just an intramural player, trying to impress the chickadees, of course.  From such nebulous stuff are our political leaders made.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-09T08:50:00+00:00"
}