{
  "url": "https://voxday.net/2004/04/05/holy-iron-crosses-kamerad/",
  "scraped_at": "2025-12-13T15:58:26.959974",
  "title": "Holy Iron Crosses, kamerad!",
  "date_display": "April 5, 2004",
  "date_iso": "2004-04-05T13:42:00+00:00",
  "date_from_url": "2004-04-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bastardsword <a href=\"http://armor.typepad.com/bastardsword/2004/04/a_troll_smackdo.html\">answers a typically silly leftist charge of Nazihood</a>: <em>In case you’ve been asleep since WW-II, the modern anti-war movement is an outgrowth of the Nazi Party, after undergoing a constant stream of communist revisions. The people in Berkeley who were protesting Lend-Lease and waving pro-Hitler banners were forced to decide between Hitler and Stalin when the Hitler-Stalin pact was broken. Since Hitler was the aggressor they decided to support Stalin. With America’s entry into WW-II they took conscientious objector status and sat out the war. After the war they founded the Pacifica Radio network, which they ran till the Trotskyites took it over. The Maoists ousted the Trotskyites from control of the network in the 1960’s, and have dominated it ever since, with the exception of constant purges and counter-takeovers. These are not right-wing accusations, this is what the various DJ’s and directors of Pacifica proudly proclaim in their retrospectives on the battles, posted on their own websites….</em></p><p>So to put it bluntly, you’re heir to the goals of the Nazi party, chief of which is the disarmament and defeat of the Anglo-American capitalists, which is requisite for the advancement of the glories of National Socialism, embodied so well in the rule of Saddam Hussein.</p><p>I knew that there were huge similarities between American leftists and the goals of the historical National Socialist German Worker’s Party.  And I also knew that there were Nazi sympathizers here in the United States as well as in the UK.  I did not realize, however, that the kinship was more than merely intellectual, that there was a direct line of descent from those pro-Nazi groups of the 1930s to the hard-left “anti-war” groups of today.</p><p>This sort of thing, assuming that Bastardsword has his history correct, demonstrates the absurdity of those who desperately attempt to postulate that Nazis and Communists are some kind of Manichean polar opposites.  They’re actually more like half-siblings than cousins, which is obvious to anyone who’s read the theoretical works of both.  What’s interesting is that Hitler is more insane and prone to complete fantasies than Marx, but both his analyses and policies are more firmly based in reality than those of his utopian German step-brother.</p></div>",
  "content_text": "Bastardsword\nanswers a typically silly leftist charge of Nazihood\n:\nIn case you’ve been asleep since WW-II, the modern anti-war movement is an outgrowth of the Nazi Party, after undergoing a constant stream of communist revisions. The people in Berkeley who were protesting Lend-Lease and waving pro-Hitler banners were forced to decide between Hitler and Stalin when the Hitler-Stalin pact was broken. Since Hitler was the aggressor they decided to support Stalin. With America’s entry into WW-II they took conscientious objector status and sat out the war. After the war they founded the Pacifica Radio network, which they ran till the Trotskyites took it over. The Maoists ousted the Trotskyites from control of the network in the 1960’s, and have dominated it ever since, with the exception of constant purges and counter-takeovers. These are not right-wing accusations, this is what the various DJ’s and directors of Pacifica proudly proclaim in their retrospectives on the battles, posted on their own websites….\nSo to put it bluntly, you’re heir to the goals of the Nazi party, chief of which is the disarmament and defeat of the Anglo-American capitalists, which is requisite for the advancement of the glories of National Socialism, embodied so well in the rule of Saddam Hussein.\nI knew that there were huge similarities between American leftists and the goals of the historical National Socialist German Worker’s Party.  And I also knew that there were Nazi sympathizers here in the United States as well as in the UK.  I did not realize, however, that the kinship was more than merely intellectual, that there was a direct line of descent from those pro-Nazi groups of the 1930s to the hard-left “anti-war” groups of today.\nThis sort of thing, assuming that Bastardsword has his history correct, demonstrates the absurdity of those who desperately attempt to postulate that Nazis and Communists are some kind of Manichean polar opposites.  They’re actually more like half-siblings than cousins, which is obvious to anyone who’s read the theoretical works of both.  What’s interesting is that Hitler is more insane and prone to complete fantasies than Marx, but both his analyses and policies are more firmly based in reality than those of his utopian German step-brother.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-05T12:42:00+00:00"
}