{
  "url": "https://voxday.net/2004/04/09/holy-to-you-sport-holy-to-you/",
  "scraped_at": "2025-12-13T15:59:06.060374",
  "title": "Holy to you, sport, holy to you",
  "date_display": "April 9, 2004",
  "date_iso": "2004-04-09T10:29:00+00:00",
  "date_from_url": "2004-04-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As everyone who visits here regularly is aware, I am highly critical of the Bush administration’s prosecution of this undeclared – on our part – war.  That being said, I’m pleased to give credit where credit is due, most especially when it is due the United States Marine Corps.  This is one of the <a href=\"http://www.coxandforkum.com/archives/000313.html\">first signs of good sense</a> I’ve seen since the brilliant execution of the capture of Baghdad in less than a month.<br> <br><em><br> <br>The head of the Marines First Division, General James Mattis, defended the attack, warning if rebels used places of worship in their war against US forces, his troops would not hesitate to strike them at sacred sites.  “If they barricade themselves inside a mosque, we are not going to care about the mosque anymore than they do,” Mattis said.</br></br></em></br></br></p><p>It’s still far too soon to see if the War on Global Jihad will end in victory, but at least there are early indications that this will not be another Vietnam, where the politicians tell the soldiers how to fight.</p></div>",
  "content_text": "As everyone who visits here regularly is aware, I am highly critical of the Bush administration’s prosecution of this undeclared – on our part – war.  That being said, I’m pleased to give credit where credit is due, most especially when it is due the United States Marine Corps.  This is one of the\nfirst signs of good sense\nI’ve seen since the brilliant execution of the capture of Baghdad in less than a month.\nThe head of the Marines First Division, General James Mattis, defended the attack, warning if rebels used places of worship in their war against US forces, his troops would not hesitate to strike them at sacred sites.  “If they barricade themselves inside a mosque, we are not going to care about the mosque anymore than they do,” Mattis said.\nIt’s still far too soon to see if the War on Global Jihad will end in victory, but at least there are early indications that this will not be another Vietnam, where the politicians tell the soldiers how to fight.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-09T09:29:00+00:00"
}