{
  "url": "https://voxday.net/2004/04/08/how-left-takes-over/",
  "scraped_at": "2025-12-13T15:58:56.031927",
  "title": "How the left takes over",
  "date_display": "April 8, 2004",
  "date_iso": "2004-04-08T11:19:00+00:00",
  "date_from_url": "2004-04-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ever wonder why every foundation set up by a wealthy conservative capitalist ends up donating millions of dollars to socialist causes?  Here, writ small, is a nice example of <a href=\"http://www.linuxmafia.com/bas/\">the basic process at work</a>.  The same concept holds true of investment vultures who feed off the creative genius of entrepeneurs.  I think the lesson is that, as with politicians, you should never allow anyone who is eager to seize influence over you to do so.  This is something that both bankers and the parasites of the Left have mastered.</p><p>O’Sullivan’s First Law: “All organizations that are not actually right-wing will over time become left-wing.” <a href=\"http://www.townhall.com/columnists/johnleo/jl20040405.shtml\">Leo’s amendment</a> to O’Sullivan’s First Law: any organization with “women” or “girls” in its title will tend to become part of the cultural left in general and the abortion lobby in particular.</p></div>",
  "content_text": "Ever wonder why every foundation set up by a wealthy conservative capitalist ends up donating millions of dollars to socialist causes?  Here, writ small, is a nice example of\nthe basic process at work\n.  The same concept holds true of investment vultures who feed off the creative genius of entrepeneurs.  I think the lesson is that, as with politicians, you should never allow anyone who is eager to seize influence over you to do so.  This is something that both bankers and the parasites of the Left have mastered.\nO’Sullivan’s First Law: “All organizations that are not actually right-wing will over time become left-wing.”\nLeo’s amendment\nto O’Sullivan’s First Law: any organization with “women” or “girls” in its title will tend to become part of the cultural left in general and the abortion lobby in particular.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-08T10:19:00+00:00"
}