{
  "url": "https://voxday.net/2004/04/30/how-they-dance/",
  "scraped_at": "2025-12-19T10:50:29.607468",
  "title": "How they dance",
  "date_display": "April 30, 2004",
  "date_iso": "2004-04-30T07:10:00+00:00",
  "date_from_url": "2004-04-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Star and Sickle: The anecdotal stories that crime was decreasing in downtown Minneapolis, St. Paul and at the Mall of America started soon after the Metro Transit strike began in early March.  Curious about what might be happening, police began discreetly monitoring crime figures and found some intriguing numbers.</p><p>• Police calls at the Mall of America, especially on weekends, were down by as much as 21 percent.<br> <br>• Arrests in downtown Minneapolis had dropped.<br> <br>• In St. Paul, police calls for so-called “quality of life” complaints, such as narcotics sales near bus stops, also had fallen.</br></br></br></br></p><p>After the metro area’s first transit strike in a decade, the possible relationship between the strike and crime has become a much-debated — and politically touchy — issue. Critics complain that the focus unnecessarily paints an unflattering portrait of bus riders. Police contend that the figures, while showing drops in possible criminal activity, may have uncertain meaning and caution against hasty conclusions.</p><p>Interestingly enough, and unsurprisingly, you won’t see a single mention of race <a href=\"http://startribune.com/stories/462/4751050.html\">in the entire article</a>.  But the nervous tone leads to the inescapable conclusion that it was members of a particular group favored by the left-liberal media wasn’t getting arrested as often during the bus strike.  I’m just curious to know what point is served by talking around easily established facts.</p><p>Lest you get the wrong impression, I should point out that I’m on the side of the narcotic sellers anyhow.  They’re just supplying an existing demand, they aren’t forcing their wares on little kids by means of their parents.  Oh, that’s right, I forgot.  If the government okays it, then it must be desirable.</p></div>",
  "content_text": "From the Star and Sickle: The anecdotal stories that crime was decreasing in downtown Minneapolis, St. Paul and at the Mall of America started soon after the Metro Transit strike began in early March.  Curious about what might be happening, police began discreetly monitoring crime figures and found some intriguing numbers.\n• Police calls at the Mall of America, especially on weekends, were down by as much as 21 percent.\n• Arrests in downtown Minneapolis had dropped.\n• In St. Paul, police calls for so-called “quality of life” complaints, such as narcotics sales near bus stops, also had fallen.\nAfter the metro area’s first transit strike in a decade, the possible relationship between the strike and crime has become a much-debated — and politically touchy — issue. Critics complain that the focus unnecessarily paints an unflattering portrait of bus riders. Police contend that the figures, while showing drops in possible criminal activity, may have uncertain meaning and caution against hasty conclusions.\nInterestingly enough, and unsurprisingly, you won’t see a single mention of race\nin the entire article\n.  But the nervous tone leads to the inescapable conclusion that it was members of a particular group favored by the left-liberal media wasn’t getting arrested as often during the bus strike.  I’m just curious to know what point is served by talking around easily established facts.\nLest you get the wrong impression, I should point out that I’m on the side of the narcotic sellers anyhow.  They’re just supplying an existing demand, they aren’t forcing their wares on little kids by means of their parents.  Oh, that’s right, I forgot.  If the government okays it, then it must be desirable.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-30T06:10:00+00:00"
}