{
  "url": "https://voxday.net/2004/04/09/if-poets-were-generals/",
  "scraped_at": "2025-12-13T15:59:02.600778",
  "title": "If poets were generals",
  "date_display": "April 9, 2004",
  "date_iso": "2004-04-09T07:51:00+00:00",
  "date_from_url": "2004-04-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Steven Vincent writes on NRO <a href=\"http://www.nationalreview.com/comment/vincent200404081542.asp\">of Shiite martyrdrama</a>: <em>Unless you have the instincts of a pre-Reformation Catholic peasant-or Mel Gibson — it is nearly impossible to grasp this appreciation of suffering and death. But here it is not death as a redemptive power, death as spectacle — a public expression that seeks the admiration of man as much as God. This is what, in my mind, separates Shia radicalism from its Sunni counterpart. Wahabbi and Palestinian suicide bombers seek honor and glorification by killing their enemies; the Shiites’ spiritual apotheosis, on the contrary, comes from having their enemies kill them — a kind of suicidal exhibitionism that fetishizes Hussein’s fate at Karbala. Early Christians felt that the blood of martyrs nourished the Church; Shiites believe that martyr blood will embellish their own holiness and that of their families for untold generations.</em></p><p>Seen in this light, it’s not surprising that the first eleven of Shia’s twelve sinless imams died by unnatural causes, their infallibility apparently unable to detect the poisons that dispatched each to Allah. (The 12th imam, Mohammad al-Mahdi, disappeared down a hole in Samarra and won’t be seen again until Judgment Day.) Contemporary imams have likewise met grisly fates. Last August, a car bomb killed Mohammad Baqr al-Hakim in Najaf. An interesting Shia poster depicts the slain cleric along with over 60 extended family members — all of whom were executed by Saddam Hussein — superimposed over a bleeding map of Iraq. More prevalent is a poster that shows a stunned Moqtada al-Sadr cradling his father, whom Saddam’s thugs murdered — along with Sadr’s two eldest brothers — in 1999. In 1980, Sadr’s uncle, Grand Ayatollah Mohammad Baqr al-Sadr, and his aunt, Bint Hoda, also met death at Baathist hands — a legacy of martyrdom that gives the 31-year-old cleric a spiritual authority his youth would not otherwise warrant among the age-revering Shiites. </p><p>I have no doubt that the Marines will give al-Sadr what he appears to be seeking, but this underlines the point that I was making about how “lowering the boom” is unlikely to have the effect that it would have in a less death-worshipping culture.  I don’t know precisely what the effect will be, nor do I fear the effects of “Shiite anger” – what does it matter if they’re angry when they hate you already – but I find it difficult to imagine that a people steeped in a mindset so alien and warped by decades of suffering are going to respond as we think they should.</p><p>I suspect it may be as Dobson writes of an abused child.  Whereas discipline corrects the behavior of a normal, loved child, it does not have the same salutary effect on an abused child that has been given reason to fear and hate the abuser.  And yet, it’s hard to even conceive the possibility of showing metaphorical love in this situation, particularly through the unlikely device of the USMC.  Well, it’s unwise to attempt to build a military strategy around a metaphor anyhow.</p></div>",
  "content_text": "Steven Vincent writes on NRO\nof Shiite martyrdrama\n:\nUnless you have the instincts of a pre-Reformation Catholic peasant-or Mel Gibson — it is nearly impossible to grasp this appreciation of suffering and death. But here it is not death as a redemptive power, death as spectacle — a public expression that seeks the admiration of man as much as God. This is what, in my mind, separates Shia radicalism from its Sunni counterpart. Wahabbi and Palestinian suicide bombers seek honor and glorification by killing their enemies; the Shiites’ spiritual apotheosis, on the contrary, comes from having their enemies kill them — a kind of suicidal exhibitionism that fetishizes Hussein’s fate at Karbala. Early Christians felt that the blood of martyrs nourished the Church; Shiites believe that martyr blood will embellish their own holiness and that of their families for untold generations.\nSeen in this light, it’s not surprising that the first eleven of Shia’s twelve sinless imams died by unnatural causes, their infallibility apparently unable to detect the poisons that dispatched each to Allah. (The 12th imam, Mohammad al-Mahdi, disappeared down a hole in Samarra and won’t be seen again until Judgment Day.) Contemporary imams have likewise met grisly fates. Last August, a car bomb killed Mohammad Baqr al-Hakim in Najaf. An interesting Shia poster depicts the slain cleric along with over 60 extended family members — all of whom were executed by Saddam Hussein — superimposed over a bleeding map of Iraq. More prevalent is a poster that shows a stunned Moqtada al-Sadr cradling his father, whom Saddam’s thugs murdered — along with Sadr’s two eldest brothers — in 1999. In 1980, Sadr’s uncle, Grand Ayatollah Mohammad Baqr al-Sadr, and his aunt, Bint Hoda, also met death at Baathist hands — a legacy of martyrdom that gives the 31-year-old cleric a spiritual authority his youth would not otherwise warrant among the age-revering Shiites.\nI have no doubt that the Marines will give al-Sadr what he appears to be seeking, but this underlines the point that I was making about how “lowering the boom” is unlikely to have the effect that it would have in a less death-worshipping culture.  I don’t know precisely what the effect will be, nor do I fear the effects of “Shiite anger” – what does it matter if they’re angry when they hate you already – but I find it difficult to imagine that a people steeped in a mindset so alien and warped by decades of suffering are going to respond as we think they should.\nI suspect it may be as Dobson writes of an abused child.  Whereas discipline corrects the behavior of a normal, loved child, it does not have the same salutary effect on an abused child that has been given reason to fear and hate the abuser.  And yet, it’s hard to even conceive the possibility of showing metaphorical love in this situation, particularly through the unlikely device of the USMC.  Well, it’s unwise to attempt to build a military strategy around a metaphor anyhow.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-09T06:51:00+00:00"
}