{
  "url": "https://voxday.net/2004/04/14/im-first-way-guy-myself/",
  "scraped_at": "2025-12-19T10:47:26.714891",
  "title": "I’m a First Way guy myself",
  "date_display": "April 14, 2004",
  "date_iso": "2004-04-14T15:50:00+00:00",
  "date_from_url": "2004-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>John Derbyshire <a href=\"http://www.nationalreview.com/derbyshire/derbyshire200404140854.asp\">concludes</a>, in his wisdom: <em>Thus we are unwilling to take either the First Way or the Second, to play either the Angel of Vengeance or the Great White Father Over the Sea. There is nothing for it but to seek a Third Way. Will the Third Way work? Personally, I doubt it. Given what we are, though — what we have become — I don’t see that we have any choice.</em></p><p>It is profoundly stupid to knowingly continue down a path that won’t take you where you need to go, but it is intriguing to watch.  I was always curious, when reading history, to know why intelligent men would do what, not only in hindsight but even at the time, were obviously stupid things.  The answer is that they felt they had to, whether it was to save face, honor or political standing.  Greatness requires surmounting at very least the latter, unfortunately neither George Bush nor John Kerry show the least little sign of being either interested or able to do so.</p><p>Many of the president’s defenders say: “he can’t do X because he’ll lose support.”  Yes, because often doing the right thing means upsetting the idiots who have no idea what is going on.  But you must do it, if it is the right thing.  George Bush is trying to do the minimal thing, to fight a war on method that will somehow – he has no idea how – keep the enemy at arms length without destabilizing the economy or turning the conflict into full-scale war.  I don’t think most people realize what a tightrope he is attempting to walk, nor how small his chances of success are.</p><p>Better to grasp the nettle and have done with it.</p></div>",
  "content_text": "John Derbyshire\nconcludes\n, in his wisdom:\nThus we are unwilling to take either the First Way or the Second, to play either the Angel of Vengeance or the Great White Father Over the Sea. There is nothing for it but to seek a Third Way. Will the Third Way work? Personally, I doubt it. Given what we are, though — what we have become — I don’t see that we have any choice.\nIt is profoundly stupid to knowingly continue down a path that won’t take you where you need to go, but it is intriguing to watch.  I was always curious, when reading history, to know why intelligent men would do what, not only in hindsight but even at the time, were obviously stupid things.  The answer is that they felt they had to, whether it was to save face, honor or political standing.  Greatness requires surmounting at very least the latter, unfortunately neither George Bush nor John Kerry show the least little sign of being either interested or able to do so.\nMany of the president’s defenders say: “he can’t do X because he’ll lose support.”  Yes, because often doing the right thing means upsetting the idiots who have no idea what is going on.  But you must do it, if it is the right thing.  George Bush is trying to do the minimal thing, to fight a war on method that will somehow – he has no idea how – keep the enemy at arms length without destabilizing the economy or turning the conflict into full-scale war.  I don’t think most people realize what a tightrope he is attempting to walk, nor how small his chances of success are.\nBetter to grasp the nettle and have done with it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-14T14:50:00+00:00"
}