{
  "url": "https://voxday.net/2004/04/11/incompetence-if-were-lucky/",
  "scraped_at": "2025-12-13T15:59:26.707676",
  "title": "Incompetence, if we’re lucky",
  "date_display": "April 11, 2004",
  "date_iso": "2004-04-11T11:21:00+00:00",
  "date_from_url": "2004-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>James Pinkerton writes: <em>If you knew that President Franklin D. Roosevelt had received a memo a month before Pearl Harbor entitled, “Japanese Determined to Attack the United States in the Pacific,” and that he had done nothing about that information, would that knowledge change your perception of FDR as a wise war leader?  Roosevelt received no such memo, of course, but President George W. Bush got a blunt warning five weeks before 9/11 and he did little or nothing. He even presided over a stand- down in preparations, concentrating on other concerns.</em></p><p>As tomorrow’s column will demonstrate, I have some serious doubts about the president’s abilities as a Commander-in-Chief.  While some commentators ignorant of military history think that the conquests of Afghanistan and Iraq prove his greatness – Peggy Noonan springs to mind – those of us who have at least made a hobby of the art of war tend to be significantly more dubious.  One has only to recall how many times those lands have changed hands to be skeptical of the likelihood, let alone the probability, of a successful long-term occupation in the German mode.  Germany, one might do well to remember, was considered one of the most culturally advanced societies in the world prior to World War II, and Japan the world’s most homogenous, while neither Iraq nor Afghanistan would tend to be described in either of those terms.</p><p>I don’t question that America must face up to the need to declare war against the global jihad, but given that George Bush has not: a) properly identified the enemy, b) united the nation against it or c) focused on the targets required for victory, I think that it is starting to look increasingly likely that he will come to be viewed as an ineffectual, if not incompetent, wartime president.</p><p>This is not necesarily the case, mind you, as my information is insufficient to make any such determination in a definitive manner.  But given that the current martial effort appears to be ignoring a number of basic strictums of military theory, I am less than entirely optimistic about the results.</p><p>The only good thing I see here is that it would seem almost oxymoronic  to allow 9/11 to take place in order to mount an incompetently managed war.  The government lied to the American people about Waco, TWA 800 and OK City, and I have no doubt they are lying, somehow, about 9/11.  But while I firmly believe that FDR allowed the attack on Pearl Harbor in order to force the nation into WWII, the seeming incompetence of the Bush administration would appear to argue its innocence in that regard.  Hopefully, the truth will eventually find its way out.</p><p>UPDATE – It wasn’t just Tom Clancy either.  From the Washington Post: <em>“I don’t think anybody could have predicted that these people . . . would try to use an airplane as a missile, a hijacked airplane as a missile,” Rice said Thursday.  But a 1999 report prepared for the National Intelligence Council, an affiliate of the CIA, warned that terrorists associated with bin Laden might hijack an airplane and crash it into the Pentagon, White House or CIA headquarters.  The report recounts well-known case studies of similar plots, including a 1995 plan by al Qaeda operatives to hijack and crash a dozen U.S. airliners in the South Pacific and pilot a light aircraft into Langley.</em></p><p>Condi is pretty good, but she’s as full of it as the rest of them.  Color me skeptical.</p></div>",
  "content_text": "James Pinkerton writes:\nIf you knew that President Franklin D. Roosevelt had received a memo a month before Pearl Harbor entitled, “Japanese Determined to Attack the United States in the Pacific,” and that he had done nothing about that information, would that knowledge change your perception of FDR as a wise war leader?  Roosevelt received no such memo, of course, but President George W. Bush got a blunt warning five weeks before 9/11 and he did little or nothing. He even presided over a stand- down in preparations, concentrating on other concerns.\nAs tomorrow’s column will demonstrate, I have some serious doubts about the president’s abilities as a Commander-in-Chief.  While some commentators ignorant of military history think that the conquests of Afghanistan and Iraq prove his greatness – Peggy Noonan springs to mind – those of us who have at least made a hobby of the art of war tend to be significantly more dubious.  One has only to recall how many times those lands have changed hands to be skeptical of the likelihood, let alone the probability, of a successful long-term occupation in the German mode.  Germany, one might do well to remember, was considered one of the most culturally advanced societies in the world prior to World War II, and Japan the world’s most homogenous, while neither Iraq nor Afghanistan would tend to be described in either of those terms.\nI don’t question that America must face up to the need to declare war against the global jihad, but given that George Bush has not: a) properly identified the enemy, b) united the nation against it or c) focused on the targets required for victory, I think that it is starting to look increasingly likely that he will come to be viewed as an ineffectual, if not incompetent, wartime president.\nThis is not necesarily the case, mind you, as my information is insufficient to make any such determination in a definitive manner.  But given that the current martial effort appears to be ignoring a number of basic strictums of military theory, I am less than entirely optimistic about the results.\nThe only good thing I see here is that it would seem almost oxymoronic  to allow 9/11 to take place in order to mount an incompetently managed war.  The government lied to the American people about Waco, TWA 800 and OK City, and I have no doubt they are lying, somehow, about 9/11.  But while I firmly believe that FDR allowed the attack on Pearl Harbor in order to force the nation into WWII, the seeming incompetence of the Bush administration would appear to argue its innocence in that regard.  Hopefully, the truth will eventually find its way out.\nUPDATE – It wasn’t just Tom Clancy either.  From the Washington Post:\n“I don’t think anybody could have predicted that these people . . . would try to use an airplane as a missile, a hijacked airplane as a missile,” Rice said Thursday.  But a 1999 report prepared for the National Intelligence Council, an affiliate of the CIA, warned that terrorists associated with bin Laden might hijack an airplane and crash it into the Pentagon, White House or CIA headquarters.  The report recounts well-known case studies of similar plots, including a 1995 plan by al Qaeda operatives to hijack and crash a dozen U.S. airliners in the South Pacific and pilot a light aircraft into Langley.\nCondi is pretty good, but she’s as full of it as the rest of them.  Color me skeptical.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-11T10:21:00+00:00"
}