{
  "url": "https://voxday.net/2004/04/30/inflation-in-revolutionary-france/",
  "scraped_at": "2025-12-19T10:50:31.443452",
  "title": "Inflation in Revolutionary France",
  "date_display": "April 30, 2004",
  "date_iso": "2004-04-30T14:20:00+00:00",
  "date_from_url": "2004-04-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Mises Institute: The revolutionary government first decided to cure the evils generated by inflation with more inflation. Instead of destroying assignats received for the national properties, they reissued them in the form of smaller notes. In June 1791, they issued another 600 million assignats (the previous promise not to issue more was conveniently and predictably forgotten), and in December an additional 300 million. By the end of the year, its market value had fallen to 66 percent of its face value. In 1792, they issued 600 million more. In April of the same year, they confiscated the estates of the émigrés (those who fled France to avoid being arrested or murdered) and added them to the national properties.</p><p>Then came 1793 Year One; the year of la Terreur. Having tried inflation and legal coercion, they would try terrorizing the population into accepting the plunging assignat at par, and producing and selling at a patriotic loss. In March, the National Convention created the Orwellian-named Committee of Public Safety (another unfortunate American precedent), which was a kind of committee of terror, dedicated to expropriating and murdering those deemed to be “traitors” to France or enemies of la Revolution. In May, they passed le Maximum, imposing price ceilings on grain. It worsened the grain shortage. In June, they passed the Forced Loan, a progressive income tax, whose progressivity was progressively lowered to reach more and more citizens. They also passed increasingly draconian and deadly laws designed to force people to accept the assignats at par and forbidding them from exchanging them for anything less than their face value. In July, the Convention repudiated the first issue of interest-bearing assignats. In August, trading (i.e. buying or selling) specie [gold] was prohibited. In September, the Convention passed the General Maximum, extending price ceilings to all foodstuffs, as well as firewood, coal, and other essentials. In that month, despite the deadly coercion, the assignat fell to 30 percent against gold. During 1793, the Convention issued 1,200 million assignats; in 1794, 3,000 million. Next came the deluge. In 1795, 33,000 million were printed, and in October, when a new government the Directory assumed power, the assignats’ purchasing power had fallen to almost nothing. On the black market, 600 francs of assignats traded for one gold franc.</p><p>The Directory was done with the assignat, but it was not done with inflation. In February 1796, it issued a new paper currency, the mandat, and made it exchangeable for assignats at the rate of 30 to 1. By August, after 2,500 million had been issued, the mandat had fallen to three percent of its face value. In 1796, the Directory had had enough, finally, and it withdrew the legal tender character of both the assignat and the mandat. Thereupon, their remaining meager exchangeable value disappeared altogether.</p><p>Interesting how modern it all sounds, doesn’t it.  Fiat money and socialism have gone hand-in-hand longer than socialism has been a recognizable philosophy.  Not that one can blame socialism for inflation, as it’s been around since the first king decided to spend a few extra <em>denari</em> by issuing adulterated coins.  If Prechter is not correct, and we are NOT heading for a deflationary Great Depression, we may be unfortunate enough to see what happens if the Fed tries to inflate us out from underneath the mountain of debt hanging overhead.  At least our monetary masters have been more circumspect.  It’s taken us 70 years for our dollar to lose 95 percent of its value; the French Directory managed to completely destroy the assignat in five.</p></div>",
  "content_text": "From the Mises Institute: The revolutionary government first decided to cure the evils generated by inflation with more inflation. Instead of destroying assignats received for the national properties, they reissued them in the form of smaller notes. In June 1791, they issued another 600 million assignats (the previous promise not to issue more was conveniently and predictably forgotten), and in December an additional 300 million. By the end of the year, its market value had fallen to 66 percent of its face value. In 1792, they issued 600 million more. In April of the same year, they confiscated the estates of the émigrés (those who fled France to avoid being arrested or murdered) and added them to the national properties.\nThen came 1793 Year One; the year of la Terreur. Having tried inflation and legal coercion, they would try terrorizing the population into accepting the plunging assignat at par, and producing and selling at a patriotic loss. In March, the National Convention created the Orwellian-named Committee of Public Safety (another unfortunate American precedent), which was a kind of committee of terror, dedicated to expropriating and murdering those deemed to be “traitors” to France or enemies of la Revolution. In May, they passed le Maximum, imposing price ceilings on grain. It worsened the grain shortage. In June, they passed the Forced Loan, a progressive income tax, whose progressivity was progressively lowered to reach more and more citizens. They also passed increasingly draconian and deadly laws designed to force people to accept the assignats at par and forbidding them from exchanging them for anything less than their face value. In July, the Convention repudiated the first issue of interest-bearing assignats. In August, trading (i.e. buying or selling) specie [gold] was prohibited. In September, the Convention passed the General Maximum, extending price ceilings to all foodstuffs, as well as firewood, coal, and other essentials. In that month, despite the deadly coercion, the assignat fell to 30 percent against gold. During 1793, the Convention issued 1,200 million assignats; in 1794, 3,000 million. Next came the deluge. In 1795, 33,000 million were printed, and in October, when a new government the Directory assumed power, the assignats’ purchasing power had fallen to almost nothing. On the black market, 600 francs of assignats traded for one gold franc.\nThe Directory was done with the assignat, but it was not done with inflation. In February 1796, it issued a new paper currency, the mandat, and made it exchangeable for assignats at the rate of 30 to 1. By August, after 2,500 million had been issued, the mandat had fallen to three percent of its face value. In 1796, the Directory had had enough, finally, and it withdrew the legal tender character of both the assignat and the mandat. Thereupon, their remaining meager exchangeable value disappeared altogether.\nInteresting how modern it all sounds, doesn’t it.  Fiat money and socialism have gone hand-in-hand longer than socialism has been a recognizable philosophy.  Not that one can blame socialism for inflation, as it’s been around since the first king decided to spend a few extra\ndenari\nby issuing adulterated coins.  If Prechter is not correct, and we are NOT heading for a deflationary Great Depression, we may be unfortunate enough to see what happens if the Fed tries to inflate us out from underneath the mountain of debt hanging overhead.  At least our monetary masters have been more circumspect.  It’s taken us 70 years for our dollar to lose 95 percent of its value; the French Directory managed to completely destroy the assignat in five.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-30T13:20:00+00:00"
}