{
  "url": "https://voxday.net/2004/04/01/it-must-have-blown-big-time/",
  "scraped_at": "2025-12-13T15:57:45.917455",
  "title": "It must have blown big-time",
  "date_display": "April 1, 2004",
  "date_iso": "2004-04-01T10:35:00+00:00",
  "date_from_url": "2004-04-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Star Tribune: <em>FRANKEN’S RADIO DEBUT SHY OF PERFECTION. Rush Limbaugh can sleep soundly. For now. Air America, the liberal radio network designed to disturb conservatives, had a shaky launch Wednesday as its flagship show, “The O’Franken Factor,” struggled to find the proper balance among comedy, interviews and political grandstanding.</em></p><p>“The O’Franken Factor” should be of particular interest to Twin Cities listeners because it is hosted by Minnesota native Al Franken and Katherine Lanpher, a former host on Minnesota Public Radio. Their presence is the primary reason WMNN (1330 AM) picked up their three-hour weekday show (11 a.m.-2 p.m.), but not the rest of the network’s 6 a.m.-to-11 p.m. programming.  There’s every reason to believe that the investment will eventually pay off. Franken is a well-read, prickly comic who rarely talks down to his audience and Lanpher is a sharp interviewer with a soothing voice, but the two of them together don’t have any immediate chemistry.  Lanpher is clearly not content just being Franken’s sidekick. Just throwing to commercial breaks and reminding people what’s coming up next is not her style; there may not be enough room in the booth for two captains.</p><p>If the Star and Sickle thought so poorly of Franken’s show – for which it has been cheerleading for months – it must really have been bad.  And it amuses me greatly to think that the first attempt at fixing it will probably involve kicking the pretentious air balloon that is Lanpher off the show.  This is one dirigible crash that will be rather enjoyable to watch.</p><p>Oh, and Alice… I’m waiting….</p></div>",
  "content_text": "From the Star Tribune:\nFRANKEN’S RADIO DEBUT SHY OF PERFECTION. Rush Limbaugh can sleep soundly. For now. Air America, the liberal radio network designed to disturb conservatives, had a shaky launch Wednesday as its flagship show, “The O’Franken Factor,” struggled to find the proper balance among comedy, interviews and political grandstanding.\n“The O’Franken Factor” should be of particular interest to Twin Cities listeners because it is hosted by Minnesota native Al Franken and Katherine Lanpher, a former host on Minnesota Public Radio. Their presence is the primary reason WMNN (1330 AM) picked up their three-hour weekday show (11 a.m.-2 p.m.), but not the rest of the network’s 6 a.m.-to-11 p.m. programming.  There’s every reason to believe that the investment will eventually pay off. Franken is a well-read, prickly comic who rarely talks down to his audience and Lanpher is a sharp interviewer with a soothing voice, but the two of them together don’t have any immediate chemistry.  Lanpher is clearly not content just being Franken’s sidekick. Just throwing to commercial breaks and reminding people what’s coming up next is not her style; there may not be enough room in the booth for two captains.\nIf the Star and Sickle thought so poorly of Franken’s show – for which it has been cheerleading for months – it must really have been bad.  And it amuses me greatly to think that the first attempt at fixing it will probably involve kicking the pretentious air balloon that is Lanpher off the show.  This is one dirigible crash that will be rather enjoyable to watch.\nOh, and Alice… I’m waiting….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-01T09:35:00+00:00"
}