{
  "url": "https://voxday.net/2004/04/19/its-just-another-partial-bir/",
  "scraped_at": "2025-12-19T10:48:25.369223",
  "title": "It’s just another partial-birth abortion, after all",
  "date_display": "April 19, 2004",
  "date_iso": "2004-04-19T10:40:00+00:00",
  "date_from_url": "2004-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><em><a href=\"http://www.townhall.com/columnists/jeffjacoby/jj20040419.shtml\">The order to kill</a> every pregnant Jewish woman had been issued that morning.  So when a Nazi guard patrolling the Jewish ghetto in Kovno noticed a pregnant Jew walking past the local hospital, he shot her at point-blank range. She died on the spot. Hoping to save the baby, some passersby rushed the dead woman into the hospital. An obstetrician determined that she had been in her last weeks of pregnancy, and said that if surgery were performed immediately, her baby might be rescued…. Then came a horrifying postscript.  “The cruel murderers . . . came into the hospital to write down the name of the murdered woman. . . . When they found the baby alive, their savage fury was unleashed.  One of the Germans grabbed the infant and cracked its skull against the wall of the hospital room.  Woe unto the eyes that saw this!”</em></p><p>Abortionettes, Nazis, they’re all the same to me, except I have slightly more respect for the historical NASDAP than NOW.  Calling a feminist a femi-Nazi is an insult to National Socialism.</p></div>",
  "content_text": "The order to kill\nevery pregnant Jewish woman had been issued that morning.  So when a Nazi guard patrolling the Jewish ghetto in Kovno noticed a pregnant Jew walking past the local hospital, he shot her at point-blank range. She died on the spot. Hoping to save the baby, some passersby rushed the dead woman into the hospital. An obstetrician determined that she had been in her last weeks of pregnancy, and said that if surgery were performed immediately, her baby might be rescued…. Then came a horrifying postscript.  “The cruel murderers . . . came into the hospital to write down the name of the murdered woman. . . . When they found the baby alive, their savage fury was unleashed.  One of the Germans grabbed the infant and cracked its skull against the wall of the hospital room.  Woe unto the eyes that saw this!”\nAbortionettes, Nazis, they’re all the same to me, except I have slightly more respect for the historical NASDAP than NOW.  Calling a feminist a femi-Nazi is an insult to National Socialism.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-19T09:40:00+00:00"
}