{
  "url": "https://voxday.net/2004/04/05/left-wing-nazi/",
  "scraped_at": "2025-12-13T15:58:28.435600",
  "title": "The Left-wing Nazi",
  "date_display": "April 5, 2004",
  "date_iso": "2004-04-05T20:43:00+00:00",
  "date_from_url": "2004-04-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Here we go again.  Leftists are always desperately trying to argue that Marx, Lenin, Stalin and Hitler did not belong to the Left.  Trotsky and the Fabians they’ll claim, for some reason, probably because no one knows who they are.  I imagine they’d get around to denying Mao and Pol Pot too, except that Leftists don’t care that much about dark-skinned people who don’t happen to live in America.  Today we’re only getting Hitler denial, as AbleArt states: <em>ideologically the Nazi party was more right-wing than left… The Nazi party did implement socialist programs, though many were gone by the end of the war because they didn’t have the money to keep them going. That doesn’t make them socialist, and the pluralism, egalitarianism, etc. that are central to the democratic party’s platform are hardly mirrored anywhere in the Nazi party’s platform. The opposite, right-wing alternatives are.</em></p><p>First, this is a profoundly stupid and ignorant statement about the right.  The Misean libertarian right is as hard core opposition to the Left as it gets, and there is probably less than a five percent overlap between the Libertarian party and the historical National Socialist party.  The same is clearly not true for the American Democratic party, or, for that matter, the American Republican Party.  Able cites 10 points of the 1920 Munich Manifesto, unsurprisingly, he is unable to find a correlation between the Nazi position on the Versailles Treaty and one in the 2000 Democratic Party platform.  You probably won’t find much about Versailles in any Republican, Libertarian or Constitution platforms either.</p><p>He thoughtfully leaves out 15 of the 25 points, 11 of which are intellectually akin to current Democratic Party positions, as are two of the points he did mention which referred to welfare and government control of the media.  13 of the 25, however narrow still the majority of the Nazi positions, are therefore held in common.  As I mentioned in my August, 2003 column entitled <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=34148\">Hitler and Hillary</a>, I pointed out “These supposedly right-wing extremists were calling for national health care, social security, state-run schools, communal land development and centralized government control. They were determined advocates of gun control. And if they did not believe it took a village to raise a child, they were certainly enthusiastic about public youth programs. And then there were the complaints about vast conspiracies in the private press. Sounds familiar, doesn’t it?”  And this does not even delve into the links, intellectual and direct, between <a href=\"http://www.lancasterlife.com/nazism_planned_parenthood.html\">Planned Parenthood and Nazi eugenicists</a>.</p><p>The National Socialists were distinctly to the Left of the Democratic Party, which is not yet calling for abolishing incomes unearned by work or nationalization of all corporations.  In another column <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=34468\">on the political spectrum</a>, I broke down five well-known strains of political thought according to what I consider to be the ten most important political issues as follows:</p><p>00 Communist<br> <br>15 National Socialist<br> <br>36 Democrat<br> <br>52 Republican<br> <br>85 Libertarian</br></br></br></br></br></br></br></br></p><p>The National Socialists not only belong on the Left, they are rightly to be considered  a radical philosophy of left-wing extremism.  The primary difference between Hitler and Marx was the idea of social classes, and whereas Marx saw no value in individuals, Hitler wished to direct individual achievement towards the interests of the State.  And for further edification, I recommend taking a test to see <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=34468\">if you is, or is you ain’t a Nazi</a>.  The Left is always trying to resort to generalizations in order to attempt to wipe the bloodstains off its shoes and blame it on the Right, but if you take the time to actually examine the particulars, the truth always comes out.</p><p>The truth is that there was one great foe of Nazi totalitarianism, who was forced to flee from it twice.  Ludwig von Mises, the most significant figure of the Libertarian Right, who published his landmark work <em>Socialism</em> in 1922, and his anti-Nazi <em>The Socialist Calumny Against the Jews</em> in 1944.  Those of us on the libertarian Right have nothing to apologize for, because we have always been anti-Nazis.  It is good to see that our Leftist friends now see the National Socialists as evil, here’s hoping that they’ll abjure their many Nazi social policies soon and join us in assigning the highest value to individual freedom and liberty in opposition to the State.</p></div>",
  "content_text": "Here we go again.  Leftists are always desperately trying to argue that Marx, Lenin, Stalin and Hitler did not belong to the Left.  Trotsky and the Fabians they’ll claim, for some reason, probably because no one knows who they are.  I imagine they’d get around to denying Mao and Pol Pot too, except that Leftists don’t care that much about dark-skinned people who don’t happen to live in America.  Today we’re only getting Hitler denial, as AbleArt states:\nideologically the Nazi party was more right-wing than left… The Nazi party did implement socialist programs, though many were gone by the end of the war because they didn’t have the money to keep them going. That doesn’t make them socialist, and the pluralism, egalitarianism, etc. that are central to the democratic party’s platform are hardly mirrored anywhere in the Nazi party’s platform. The opposite, right-wing alternatives are.\nFirst, this is a profoundly stupid and ignorant statement about the right.  The Misean libertarian right is as hard core opposition to the Left as it gets, and there is probably less than a five percent overlap between the Libertarian party and the historical National Socialist party.  The same is clearly not true for the American Democratic party, or, for that matter, the American Republican Party.  Able cites 10 points of the 1920 Munich Manifesto, unsurprisingly, he is unable to find a correlation between the Nazi position on the Versailles Treaty and one in the 2000 Democratic Party platform.  You probably won’t find much about Versailles in any Republican, Libertarian or Constitution platforms either.\nHe thoughtfully leaves out 15 of the 25 points, 11 of which are intellectually akin to current Democratic Party positions, as are two of the points he did mention which referred to welfare and government control of the media.  13 of the 25, however narrow still the majority of the Nazi positions, are therefore held in common.  As I mentioned in my August, 2003 column entitled\nHitler and Hillary\n, I pointed out “These supposedly right-wing extremists were calling for national health care, social security, state-run schools, communal land development and centralized government control. They were determined advocates of gun control. And if they did not believe it took a village to raise a child, they were certainly enthusiastic about public youth programs. And then there were the complaints about vast conspiracies in the private press. Sounds familiar, doesn’t it?”  And this does not even delve into the links, intellectual and direct, between\nPlanned Parenthood and Nazi eugenicists\n.\nThe National Socialists were distinctly to the Left of the Democratic Party, which is not yet calling for abolishing incomes unearned by work or nationalization of all corporations.  In another column\non the political spectrum\n, I broke down five well-known strains of political thought according to what I consider to be the ten most important political issues as follows:\n00 Communist\n15 National Socialist\n36 Democrat\n52 Republican\n85 Libertarian\nThe National Socialists not only belong on the Left, they are rightly to be considered  a radical philosophy of left-wing extremism.  The primary difference between Hitler and Marx was the idea of social classes, and whereas Marx saw no value in individuals, Hitler wished to direct individual achievement towards the interests of the State.  And for further edification, I recommend taking a test to see\nif you is, or is you ain’t a Nazi\n.  The Left is always trying to resort to generalizations in order to attempt to wipe the bloodstains off its shoes and blame it on the Right, but if you take the time to actually examine the particulars, the truth always comes out.\nThe truth is that there was one great foe of Nazi totalitarianism, who was forced to flee from it twice.  Ludwig von Mises, the most significant figure of the Libertarian Right, who published his landmark work\nSocialism\nin 1922, and his anti-Nazi\nThe Socialist Calumny Against the Jews\nin 1944.  Those of us on the libertarian Right have nothing to apologize for, because we have always been anti-Nazis.  It is good to see that our Leftist friends now see the National Socialists as evil, here’s hoping that they’ll abjure their many Nazi social policies soon and join us in assigning the highest value to individual freedom and liberty in opposition to the State.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-05T19:43:00+00:00"
}