{
  "url": "https://voxday.net/2004/04/21/mailvox-christian-extremists/",
  "scraped_at": "2025-12-19T10:48:59.560088",
  "title": "Mailvox: Christian extremists",
  "date_display": "April 21, 2004",
  "date_iso": "2004-04-21T18:53:00+00:00",
  "date_from_url": "2004-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Hank writes again: <em>I’m deeply troubled by the actions of the neo-cons and Christian extremists in the FCC and DOJ. I’m more appalled at the entire lack of reaction by the populace in general. Combine this with a total apathy about the removal of our rights by USA PATRIOT Act and the Bush administrations insistence on scaring people into believing they have to surrender their rights to have them protected, and I don’t see this country’s democracy lasting much longer.</em></p><p>There’s your answer, Hank.  What would possibly be the purpose behind an alliance between the secular Jewish neocons in the administration and their nonexistent Christian extremist colleagues?  So now the FCC is full of Christian extremists… really?  Did the fact that the secular Soviets had a far more rigorous policing of art than the FCC has ever envisioned escape your attention?  Or that the FCC was stricter 50 years ago?  How many of those seven words can’t we say now?</p><p>The truth is that what you rightly fear has nothing to do with Christianity or even religion at all.  Liberals, neo-cons and compassionate conservatives alike are uniting to destroy the remnants of the Constitutional republic that remain.  This Christian extremist loathes the Patriot Act, would ban the FCC outright and despises the Bush administration’s use of the oldest totalitarian canard in the book – put your faith in me and you will be safe.  And yet, as a liberal, would you turn to the central government to stop this?  Only the central government is the very instrument of all of this!</p><p>This country isn’t and never was a democracy.  If you want to defend your God-given (yes!) rights, then cast aside your emotional bond with big government and embrace the intellectual freedom of libertarianism.  The love of money may be the root of all evil, but government is evil’s strong arm.  Bush and Ashcroft are not right-wing, they are strong government advocates just like Hilary Clinton.  Their arguments may be different, but the results always point in the same direction: more central government power, less individual freedom.</p><p>Walk into the light….</p></div>",
  "content_text": "Hank writes again:\nI’m deeply troubled by the actions of the neo-cons and Christian extremists in the FCC and DOJ. I’m more appalled at the entire lack of reaction by the populace in general. Combine this with a total apathy about the removal of our rights by USA PATRIOT Act and the Bush administrations insistence on scaring people into believing they have to surrender their rights to have them protected, and I don’t see this country’s democracy lasting much longer.\nThere’s your answer, Hank.  What would possibly be the purpose behind an alliance between the secular Jewish neocons in the administration and their nonexistent Christian extremist colleagues?  So now the FCC is full of Christian extremists… really?  Did the fact that the secular Soviets had a far more rigorous policing of art than the FCC has ever envisioned escape your attention?  Or that the FCC was stricter 50 years ago?  How many of those seven words can’t we say now?\nThe truth is that what you rightly fear has nothing to do with Christianity or even religion at all.  Liberals, neo-cons and compassionate conservatives alike are uniting to destroy the remnants of the Constitutional republic that remain.  This Christian extremist loathes the Patriot Act, would ban the FCC outright and despises the Bush administration’s use of the oldest totalitarian canard in the book – put your faith in me and you will be safe.  And yet, as a liberal, would you turn to the central government to stop this?  Only the central government is the very instrument of all of this!\nThis country isn’t and never was a democracy.  If you want to defend your God-given (yes!) rights, then cast aside your emotional bond with big government and embrace the intellectual freedom of libertarianism.  The love of money may be the root of all evil, but government is evil’s strong arm.  Bush and Ashcroft are not right-wing, they are strong government advocates just like Hilary Clinton.  Their arguments may be different, but the results always point in the same direction: more central government power, less individual freedom.\nWalk into the light….",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-21T17:53:00+00:00"
}