{
  "url": "https://voxday.net/2004/04/12/mailvox-second-guessing/",
  "scraped_at": "2025-12-19T10:47:06.827779",
  "title": "Mailvox: second guessing?",
  "date_display": "April 12, 2004",
  "date_iso": "2004-04-12T19:16:00+00:00",
  "date_from_url": "2004-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JN writes: <em>The last time I checked, there has been no second attack on the US mainland.  Pres Bush must be doing something right, even Libya has turned in their nukes.  He is a believer, why do you dislike him so?  Would you prefer Hanoi John Kerry?  Patriotic men have always rallied around the president during war time, what your problem, Bub?  Don’t give me that Libertarian business either, we both know, there is not a libertarian candidate that is credible.  Swallow your pride, and get behind your President.  Pride was Satan’s problem, don’t let it get you!</em></p><p>I didn’t say the president was doing everything wrong, only that the jury is still out on whether he will be successful in confronting the current enemy, the global jihad.  I don’t personally dislike him, but I dislike his dishonesty, many of the people with whom he has surrounded himself as well as his ready willingness to embrace the new world order of the UN-supremacist movement.</p><p>I will not rally around any president who refuses to obey the Constitution, of any party.  The “patriot” argument has been used by every totalitarian leader since the dawn of recorded history; Americans are free and owe allegiance to no man.  And, as usual, the truth is inadvertantly revealed in the attack on exogenous credibility.  The pursuit of power trumps all.  Others can abandon their principles if they wish, I’ll stand by mine.</p><p>There would be very little change if those who refused to accept the status quo paid any attention to those who only think in terms of the pragmatic and the immediate.  The Republican Party, like every party in the history of politics, will eventually die.  Probably later than sooner, but to argue as if it is some eternal constant is to deny both logic and probability.  I don’t care who wins in 2004, I’m far more concerned about laying the groundwork for 2040.</p></div>",
  "content_text": "JN writes:\nThe last time I checked, there has been no second attack on the US mainland.  Pres Bush must be doing something right, even Libya has turned in their nukes.  He is a believer, why do you dislike him so?  Would you prefer Hanoi John Kerry?  Patriotic men have always rallied around the president during war time, what your problem, Bub?  Don’t give me that Libertarian business either, we both know, there is not a libertarian candidate that is credible.  Swallow your pride, and get behind your President.  Pride was Satan’s problem, don’t let it get you!\nI didn’t say the president was doing everything wrong, only that the jury is still out on whether he will be successful in confronting the current enemy, the global jihad.  I don’t personally dislike him, but I dislike his dishonesty, many of the people with whom he has surrounded himself as well as his ready willingness to embrace the new world order of the UN-supremacist movement.\nI will not rally around any president who refuses to obey the Constitution, of any party.  The “patriot” argument has been used by every totalitarian leader since the dawn of recorded history; Americans are free and owe allegiance to no man.  And, as usual, the truth is inadvertantly revealed in the attack on exogenous credibility.  The pursuit of power trumps all.  Others can abandon their principles if they wish, I’ll stand by mine.\nThere would be very little change if those who refused to accept the status quo paid any attention to those who only think in terms of the pragmatic and the immediate.  The Republican Party, like every party in the history of politics, will eventually die.  Probably later than sooner, but to argue as if it is some eternal constant is to deny both logic and probability.  I don’t care who wins in 2004, I’m far more concerned about laying the groundwork for 2040.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-12T18:16:00+00:00"
}