{
  "url": "https://voxday.net/2004/04/20/mailvox-in-defense-of-porn/",
  "scraped_at": "2025-12-19T10:48:41.164221",
  "title": "Mailvox: in defense of porn",
  "date_display": "April 20, 2004",
  "date_iso": "2004-04-20T10:48:00+00:00",
  "date_from_url": "2004-04-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A different JT writes to the WND editor this time: <em>Getting straight to the point.  I am appalled at Vox Day’s recommendation in the commentary “What Men Want,” that anyone should view Sports Illustrated”swimsuit” models to choose the prettiest.  The rest of the article was well thought out and offered sound edification for any adult.  The offer of advice to look at soft porn as a way to win favor with the “boys” is a stumbling block of the first order in a Christian’s life.  God has given Vox Day the talent to write and a clear mind to think straight. He should use them with responsibility.</em></p><p>While I’m most  appreciative of JT’s kind words as well as the fact that she is cognizant of the fact that there was more to the column than the one-half of one sentence which seems to have caught the attention of all the Christian women – other women seem to be so busy being appalled at the notion that I dared to suggest that female behavior in a relationship could possibly be sub-optimal that my shocking advocacy of pornography, adultery, necrophilia and tantric sex ritual in church appears to have escaped them.</p><p>What’s interesting to me is how flimsy my critics’ arguments are.  I break it down as follows:</p><p>1.  Having an opinion on which SI model is prettier requires one to have read the SI swimsuit edition.  (false)<br> <br>2.  Sports Illustrated is porn (dubious, but I’ll grant it), and all porn is equal (false – every argument makes the immediate bait-and-switch from SI to ponygirls.  If SI is your only “porn”, then you’re not much of an addict if you only see it once per year.)<br> <br>3.  Porn viewing is/leads to lusting after other women.  (true)<br> <br>4.  Porn viewing leads to adultery (false – baseless assertion) or increased likelihood of adultery.  (false – porn is a sex substitute).  I enjoy how people making this argument skip right over the verse about husbands and wives not denying themselves to each other.  Ever said, “not tonight?”  Poof, there goes your high ground.<br> <br>5.  Porn leads to broken marriages (false – anecdotal proof only and very little of that)<br> <br>5.  Porn is displeasing to God (true)</br></br></br></br></br></br></br></br></br></br></p><p>There’s not much of an argument if all you can come up with, really, is that God doesn’t like it so you shouldn’t do it.  Well, sure, definitely, but that doesn’t really explain the crusading mentality.  Lust is a deadly sin, along with Sloth, Greed and Gluttony and the other three sins.  There’s also a verse or two warning about what you look at.  Meanwhile, there’s practically an entire book in the New Testament, not to mention tons of Proverbs, devoted to warning about how loose and wicked tongues lead to Hell.  I would bet that not one one-hundredth the marriages that have failed have done so due to porn compared to how many have broken down thanks to wicked and untamed tongues.  For every Penthouse subscriber there are 100 fat greedy little women gossiping in the sanctuary about each other, each convinced of their righteousness vis-a-vis the fourteen year-old boy with acne and a Playboy collection.  It’s like a bad joke.  Perhaps I’m the only one who sees irony in the image of an obese lesbian pastor shrieking against the evils of pornography from the pulpit of her dying church.</p><p>But of course, sins like gossip, greed and gluttony have far more appeal to women than image-based lusting, so therefore the latter must be warred against as a cancer on the church and society, while all the former are quietly ignored.  I say that the bulk of these arguments and the crusading outrage have nothing to do with God at all, as substantially similar arguments are made by non-believing women with much the same frothing-at-the-mouth passion.  It’s about female insecurity, not hatred of sin.</p><p>Now, the title of this post is somewhat tongue-in-cheek.  I am not advocating pornography nor am I a fan of it.  I don’t even subscribe to Sports Illustrated, for that matter.  But I think the overweening obsession with it on the part of modern Christians is both indicative of <a href=\"http://www.townhall.com/columnists/douggiles/dg20040417.shtml\">the feminization of the church</a> as well as yet another example of mistaking a symptom of societal decline for a causal factor.  The magical elimination of all porn from society would not have even a small part of the positive impact on society of requiring churches to be led by men who actually believe in the Bible as God’s Word and are devoted to helping their congregations apply it to their lives.</p></div>",
  "content_text": "A different JT writes to the WND editor this time:\nGetting straight to the point.  I am appalled at Vox Day’s recommendation in the commentary “What Men Want,” that anyone should view Sports Illustrated”swimsuit” models to choose the prettiest.  The rest of the article was well thought out and offered sound edification for any adult.  The offer of advice to look at soft porn as a way to win favor with the “boys” is a stumbling block of the first order in a Christian’s life.  God has given Vox Day the talent to write and a clear mind to think straight. He should use them with responsibility.\nWhile I’m most  appreciative of JT’s kind words as well as the fact that she is cognizant of the fact that there was more to the column than the one-half of one sentence which seems to have caught the attention of all the Christian women – other women seem to be so busy being appalled at the notion that I dared to suggest that female behavior in a relationship could possibly be sub-optimal that my shocking advocacy of pornography, adultery, necrophilia and tantric sex ritual in church appears to have escaped them.\nWhat’s interesting to me is how flimsy my critics’ arguments are.  I break it down as follows:\n1.  Having an opinion on which SI model is prettier requires one to have read the SI swimsuit edition.  (false)\n2.  Sports Illustrated is porn (dubious, but I’ll grant it), and all porn is equal (false – every argument makes the immediate bait-and-switch from SI to ponygirls.  If SI is your only “porn”, then you’re not much of an addict if you only see it once per year.)\n3.  Porn viewing is/leads to lusting after other women.  (true)\n4.  Porn viewing leads to adultery (false – baseless assertion) or increased likelihood of adultery.  (false – porn is a sex substitute).  I enjoy how people making this argument skip right over the verse about husbands and wives not denying themselves to each other.  Ever said, “not tonight?”  Poof, there goes your high ground.\n5.  Porn leads to broken marriages (false – anecdotal proof only and very little of that)\n5.  Porn is displeasing to God (true)\nThere’s not much of an argument if all you can come up with, really, is that God doesn’t like it so you shouldn’t do it.  Well, sure, definitely, but that doesn’t really explain the crusading mentality.  Lust is a deadly sin, along with Sloth, Greed and Gluttony and the other three sins.  There’s also a verse or two warning about what you look at.  Meanwhile, there’s practically an entire book in the New Testament, not to mention tons of Proverbs, devoted to warning about how loose and wicked tongues lead to Hell.  I would bet that not one one-hundredth the marriages that have failed have done so due to porn compared to how many have broken down thanks to wicked and untamed tongues.  For every Penthouse subscriber there are 100 fat greedy little women gossiping in the sanctuary about each other, each convinced of their righteousness vis-a-vis the fourteen year-old boy with acne and a Playboy collection.  It’s like a bad joke.  Perhaps I’m the only one who sees irony in the image of an obese lesbian pastor shrieking against the evils of pornography from the pulpit of her dying church.\nBut of course, sins like gossip, greed and gluttony have far more appeal to women than image-based lusting, so therefore the latter must be warred against as a cancer on the church and society, while all the former are quietly ignored.  I say that the bulk of these arguments and the crusading outrage have nothing to do with God at all, as substantially similar arguments are made by non-believing women with much the same frothing-at-the-mouth passion.  It’s about female insecurity, not hatred of sin.\nNow, the title of this post is somewhat tongue-in-cheek.  I am not advocating pornography nor am I a fan of it.  I don’t even subscribe to Sports Illustrated, for that matter.  But I think the overweening obsession with it on the part of modern Christians is both indicative of\nthe feminization of the church\nas well as yet another example of mistaking a symptom of societal decline for a causal factor.  The magical elimination of all porn from society would not have even a small part of the positive impact on society of requiring churches to be led by men who actually believe in the Bible as God’s Word and are devoted to helping their congregations apply it to their lives.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-20T09:48:00+00:00"
}