{
  "url": "https://voxday.net/2004/04/19/mailvox-bill-ponders-why-hes-here/",
  "scraped_at": "2025-12-19T10:48:35.654254",
  "title": "Mailvox: Bill ponders why he’s here",
  "date_display": "April 19, 2004",
  "date_iso": "2004-04-19T16:59:00+00:00",
  "date_from_url": "2004-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bill comments: <em>I hang around because the conversation is interesting, not because I agree with it. Vox and I seem to share enough of a world-view to talk, but we’re still pretty far apart on many issues of substance. I often get the sense that our discussions range from talking past each other to violently agreeing.</em></p><p>I couldn’t bear to do this if everyone agreed with me all the time.  I have zero interest in preaching to the choir, I’m far more interested in having my premises challenged and tested – by sane people capable of rational thought, that is.  Not that the occasional hate mail isn’t a blast, or a sober attempt at a substantive critique as we’ve seen from folks like Strange, Able and others.  I’d hardly be recommending the fiction of an EU-loving pagan socialist if I didn’t believe that exposing oneself to intellectual diversity is not only healthy, but vital for sharpening one’s own mind.</p><p>The only thing that’s been disappointing about this blog is seeing how the volume of hate mail I used to receive from the column so rapidly dwindled to a tiny trickle, as people became less and less sanguine about entering the ring.  I hope the syndicate will add some papers in the next six months or so and then we’ll get a new supple of fresh meat, er, that is to say, amusingly disrespectful missives of disagreement.</p></div>",
  "content_text": "Bill comments:\nI hang around because the conversation is interesting, not because I agree with it. Vox and I seem to share enough of a world-view to talk, but we’re still pretty far apart on many issues of substance. I often get the sense that our discussions range from talking past each other to violently agreeing.\nI couldn’t bear to do this if everyone agreed with me all the time.  I have zero interest in preaching to the choir, I’m far more interested in having my premises challenged and tested – by sane people capable of rational thought, that is.  Not that the occasional hate mail isn’t a blast, or a sober attempt at a substantive critique as we’ve seen from folks like Strange, Able and others.  I’d hardly be recommending the fiction of an EU-loving pagan socialist if I didn’t believe that exposing oneself to intellectual diversity is not only healthy, but vital for sharpening one’s own mind.\nThe only thing that’s been disappointing about this blog is seeing how the volume of hate mail I used to receive from the column so rapidly dwindled to a tiny trickle, as people became less and less sanguine about entering the ring.  I hope the syndicate will add some papers in the next six months or so and then we’ll get a new supple of fresh meat, er, that is to say, amusingly disrespectful missives of disagreement.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-19T15:59:00+00:00"
}