{
  "url": "https://voxday.net/2004/04/13/mailvox-possible-firs/",
  "scraped_at": "2025-12-19T10:47:13.503058",
  "title": "Mailvox: a possible first",
  "date_display": "April 13, 2004",
  "date_iso": "2004-04-13T17:19:00+00:00",
  "date_from_url": "2004-04-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jamsco asks: <em>Hey Vox, I have a polite question.  What is your definition of Socialist as in “total socialist distribution” with regards to the policies of the democrats?  I assume that you aren’t against all taxation (perhaps I’m wrong.) However, It seems like you and other commenters here use socialist to mean “those who believe in more taxation than me.”  As you know, I’ve been called a socialist here because I don’t think that requiring that people be taxed for public school funds is wrong. At the very least, I don’t think that most (95%?) Americans would consider me to be socialist based on this fact.</em></p><p>A socialist is one who believes that the collective society, through the mechanism of the government, has a fundamental underlying claim on all private property that supersedes the rights of the nominal owner.  I am not against all taxation, although I am against all income taxation for Constitutional, legal, historical and economic reasons.</p><p>Now, there are a variety of socialists.  A Marxian socialist believes that society hold the underlying right to property on the basis of prior expropriation of stored labor, a Christian socialist believes that society holds it because only the government can achieve equitable distribution of societal wealth.  But the reasons why are irrelevant to me as all of them are, in my view, anathema.  Most modern Democrats are what I personally consider to be Santa Socialists, because they have no idea why government holds this underlying right, nor do they necessarily even understand that it is required to by their lights, all they care about is that property is taken from one party and distributed to another.  In short, if you are a forced distributionist, you are some variant of socialist.</p><p>What makes you a socialist, even if a very weak one, is that you fail to understand that the reason does not matter.  If the government has the right to seize private property, be it 1 percent or 100 percent, at will, then the justification is irrelevant.  Whether it is for schools or personal prostitutes, all that matters is that government rights trump private property rights.</p><p>A pure socialist, of course, would require that 100 percent of all private property be confiscated, then distributed according to the judgment of those charged with managing the central distribution.  The reason one seldom sees pure socialism at work is because it tends to fail very, very quickly.  But whether you believe in 100 percent confiscation or ten percent, you’re simply quibbling about the degree.</p><p>It’s rather like the old joke.  A man offers a woman one million dollars to have sex with him.  She accepts.  He then offers her a dollar, to which she reacts angrily.  “What kind of woman do you think I am!”  “We’ve already established that,” he replies.  “Now we’re just negotiating over the price.”  Most Americans today are weak socialists at a minimum, simply because they cannot imagine a truly free market society, with free association and voluntary government.</p></div>",
  "content_text": "Jamsco asks:\nHey Vox, I have a polite question.  What is your definition of Socialist as in “total socialist distribution” with regards to the policies of the democrats?  I assume that you aren’t against all taxation (perhaps I’m wrong.) However, It seems like you and other commenters here use socialist to mean “those who believe in more taxation than me.”  As you know, I’ve been called a socialist here because I don’t think that requiring that people be taxed for public school funds is wrong. At the very least, I don’t think that most (95%?) Americans would consider me to be socialist based on this fact.\nA socialist is one who believes that the collective society, through the mechanism of the government, has a fundamental underlying claim on all private property that supersedes the rights of the nominal owner.  I am not against all taxation, although I am against all income taxation for Constitutional, legal, historical and economic reasons.\nNow, there are a variety of socialists.  A Marxian socialist believes that society hold the underlying right to property on the basis of prior expropriation of stored labor, a Christian socialist believes that society holds it because only the government can achieve equitable distribution of societal wealth.  But the reasons why are irrelevant to me as all of them are, in my view, anathema.  Most modern Democrats are what I personally consider to be Santa Socialists, because they have no idea why government holds this underlying right, nor do they necessarily even understand that it is required to by their lights, all they care about is that property is taken from one party and distributed to another.  In short, if you are a forced distributionist, you are some variant of socialist.\nWhat makes you a socialist, even if a very weak one, is that you fail to understand that the reason does not matter.  If the government has the right to seize private property, be it 1 percent or 100 percent, at will, then the justification is irrelevant.  Whether it is for schools or personal prostitutes, all that matters is that government rights trump private property rights.\nA pure socialist, of course, would require that 100 percent of all private property be confiscated, then distributed according to the judgment of those charged with managing the central distribution.  The reason one seldom sees pure socialism at work is because it tends to fail very, very quickly.  But whether you believe in 100 percent confiscation or ten percent, you’re simply quibbling about the degree.\nIt’s rather like the old joke.  A man offers a woman one million dollars to have sex with him.  She accepts.  He then offers her a dollar, to which she reacts angrily.  “What kind of woman do you think I am!”  “We’ve already established that,” he replies.  “Now we’re just negotiating over the price.”  Most Americans today are weak socialists at a minimum, simply because they cannot imagine a truly free market society, with free association and voluntary government.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-13T16:19:00+00:00"
}