{
  "url": "https://voxday.net/2004/04/19/mailvox-useless-tsa/",
  "scraped_at": "2025-12-19T10:48:27.195246",
  "title": "Mailvox: useless TSA",
  "date_display": "April 19, 2004",
  "date_iso": "2004-04-19T11:04:00+00:00",
  "date_from_url": "2004-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Scott comments: <em>As an American who has lived in Israel for over 10 years, I consider myself very sensitive to the assault on American liberties. I got a firsthand look at the new reality in my short trip to Los Angeles last May. The TSA, at the very least, irked me. Everything they were doing was wrong. It’s like they stole the “form” of security, as done correctly by El Al, without adopting the “substance.</em></p><p>I experienced the uselessness of the TSA myself a few weeks ago.  I was dropped off at the door with far more luggage than I could possibly carry by myself, while there was a huge line to check in.  I flagged down a passing man in a TSA uniform and asked him if he could help me move the luggage to the back of the line, some 50 yards away, from where I could move things along, piece by piece.  He said, no, he couldn’t, and was unmoved by my warning that I was just going to leave it there and get in line – I knew the line would eventually take me where the luggage was.</p><p>Now, I could see this big pile of baggage from my spot in the line 50 yards away, but the rest of the TSA people didn’t know that.  And in the 20 minutes it took for the rest of the party to join me and collect the luggage, not a single passing TSA employee bothered to check out this big pile of anonymous suitcases.  What a joke.</p></div>",
  "content_text": "Scott comments:\nAs an American who has lived in Israel for over 10 years, I consider myself very sensitive to the assault on American liberties. I got a firsthand look at the new reality in my short trip to Los Angeles last May. The TSA, at the very least, irked me. Everything they were doing was wrong. It’s like they stole the “form” of security, as done correctly by El Al, without adopting the “substance.\nI experienced the uselessness of the TSA myself a few weeks ago.  I was dropped off at the door with far more luggage than I could possibly carry by myself, while there was a huge line to check in.  I flagged down a passing man in a TSA uniform and asked him if he could help me move the luggage to the back of the line, some 50 yards away, from where I could move things along, piece by piece.  He said, no, he couldn’t, and was unmoved by my warning that I was just going to leave it there and get in line – I knew the line would eventually take me where the luggage was.\nNow, I could see this big pile of baggage from my spot in the line 50 yards away, but the rest of the TSA people didn’t know that.  And in the 20 minutes it took for the rest of the party to join me and collect the luggage, not a single passing TSA employee bothered to check out this big pile of anonymous suitcases.  What a joke.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-19T10:04:00+00:00"
}