{
  "url": "https://voxday.net/2004/04/12/mailvox-word-from-soldiers/",
  "scraped_at": "2025-12-19T10:47:03.093979",
  "title": "Mailvox: word from the soldiers",
  "date_display": "April 12, 2004",
  "date_iso": "2004-04-12T14:32:00+00:00",
  "date_from_url": "2004-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A captain writes: <em>Great article!  What you described in the Clausewitz quote what we in the military call the “decisive point”.  Not sure if we have one.  Hmmmpf.  I think somebody forgot about that.</em></p><p>And the Original Cyberpunk recommends <a href=\"http://www.nypost.com/postopinion/opedcolumnists/22552.htm\">a Ralph Peters article</a> which tends to support my statement about Iran as the operations center of the global jihad against the West: <em>ON Saturday, Iranian agents ambushed an American convoy on the road between Mosul and Akre in Iraq. The attack did not go as planned: Our troops responded sharply, killing two Iranians, wounding a third and capturing two more.</em></p><p>They were carrying their identity documents.  And you haven’t heard a word about it. The administration doesn’t want to admit how much American blood Teheran has on its hands.</p><p>I would say that sounds rather like an administration that is not paying any attention to the military dictum I cited this morning, wouldn’t you?</p></div>",
  "content_text": "A captain writes:\nGreat article!  What you described in the Clausewitz quote what we in the military call the “decisive point”.  Not sure if we have one.  Hmmmpf.  I think somebody forgot about that.\nAnd the Original Cyberpunk recommends\na Ralph Peters article\nwhich tends to support my statement about Iran as the operations center of the global jihad against the West:\nON Saturday, Iranian agents ambushed an American convoy on the road between Mosul and Akre in Iraq. The attack did not go as planned: Our troops responded sharply, killing two Iranians, wounding a third and capturing two more.\nThey were carrying their identity documents.  And you haven’t heard a word about it. The administration doesn’t want to admit how much American blood Teheran has on its hands.\nI would say that sounds rather like an administration that is not paying any attention to the military dictum I cited this morning, wouldn’t you?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-12T13:32:00+00:00"
}