{
  "url": "https://voxday.net/2004/04/08/mailvox-problems-with-plan/",
  "scraped_at": "2025-12-13T15:58:47.564287",
  "title": "Mailvox: The problems with The Plan",
  "date_display": "April 8, 2004",
  "date_iso": "2004-04-08T07:21:00+00:00",
  "date_from_url": "2004-04-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bill writes: <em>The proposal for Iraq (per every administration official that’s written about it) is to instill order under some kind of responsible government with the goal that they will trade peacefully and begin working in their own best interest – with the ultimate goal of inculcating a sense of ownership of individual destiny. This should drain the swamps of terrorism in the mideast as people take responsibility for their actions, and see that they have a hand in their future. This is The Plan.</em></p><p>That may be so, Bill, although I’d remind you that the propaganda arm brings up the word “democracy” every time it mentions our presence in Iraq.  Except, of course, we’re not only not bringing democracy there, we’re actively working to suppress the free determination of the Kurds, who would prefer a Kurdish state to being forced to live in a country that has murdered and savagely oppressed them.  But we say we love freedom, so it must be so.</p><p>And, of course, everyone knows that ordered government is the best way to force individuals to take responsibility for their actions.  After all, government has proved to be such a wonderful tool for encouraging individual responsibility here.  And you wonder why I’m skeptical that this is going to work out well?  Government is ultimately a reflection of the people, even, to some extent, in a totalitarian society.  If the Bush administration truly wants to try to aid the cause of peace in the region, it would create numerous decentralized governments and let the people begin to figure out for themselves where they would like to live.</p><p>A strong central government structure only brings all the bad guys together in one place to compete for control of it and ensures that the worst and most ruthless will eventually have it at their disposal.  This is why the UN is the most dangerous idea in human history.</p><p>I also wonder if the administration officials realize how ridiculous they must sound when they intone these pompous statements about how men like this Iranian puppet will be arrested and brought to face justice and whatnot.  Sure, it sounds good to American ears, but who do they think they’re threatening?  These are people who are used to being tortured and slaughtered in a hundred sadistic  ways, so they probably laugh out loud when a military bureacrat threatens them with a fair trial and jail.  Not to mention that jailing a terrorist usually accomplishes little more than determine what the demands of the next terrorist will be.</p></div>",
  "content_text": "Bill writes:\nThe proposal for Iraq (per every administration official that’s written about it) is to instill order under some kind of responsible government with the goal that they will trade peacefully and begin working in their own best interest – with the ultimate goal of inculcating a sense of ownership of individual destiny. This should drain the swamps of terrorism in the mideast as people take responsibility for their actions, and see that they have a hand in their future. This is The Plan.\nThat may be so, Bill, although I’d remind you that the propaganda arm brings up the word “democracy” every time it mentions our presence in Iraq.  Except, of course, we’re not only not bringing democracy there, we’re actively working to suppress the free determination of the Kurds, who would prefer a Kurdish state to being forced to live in a country that has murdered and savagely oppressed them.  But we say we love freedom, so it must be so.\nAnd, of course, everyone knows that ordered government is the best way to force individuals to take responsibility for their actions.  After all, government has proved to be such a wonderful tool for encouraging individual responsibility here.  And you wonder why I’m skeptical that this is going to work out well?  Government is ultimately a reflection of the people, even, to some extent, in a totalitarian society.  If the Bush administration truly wants to try to aid the cause of peace in the region, it would create numerous decentralized governments and let the people begin to figure out for themselves where they would like to live.\nA strong central government structure only brings all the bad guys together in one place to compete for control of it and ensures that the worst and most ruthless will eventually have it at their disposal.  This is why the UN is the most dangerous idea in human history.\nI also wonder if the administration officials realize how ridiculous they must sound when they intone these pompous statements about how men like this Iranian puppet will be arrested and brought to face justice and whatnot.  Sure, it sounds good to American ears, but who do they think they’re threatening?  These are people who are used to being tortured and slaughtered in a hundred sadistic  ways, so they probably laugh out loud when a military bureacrat threatens them with a fair trial and jail.  Not to mention that jailing a terrorist usually accomplishes little more than determine what the demands of the next terrorist will be.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-08T06:21:00+00:00"
}