{
  "url": "https://voxday.net/2004/04/06/mailvox-are-you-even-listening/",
  "scraped_at": "2025-12-13T15:58:29.890925",
  "title": "Mailvox: are you even listening",
  "date_display": "April 6, 2004",
  "date_iso": "2004-04-06T00:16:00+00:00",
  "date_from_url": "2004-04-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AA takes the time to go through the Munich Manifesto and characterize each of the 25 points, stating along the way: <em>15. This is Social Security, something both Democrats and Republicans support.  16. Not at all Democratic, and not really Socialist, either. This was basically a way of redistributing the company’s wealth to citizens.</em></p><p>AA, by your own – inaccurate – count, you’ve got four things assigned to Republicans/right wing alone.  You’ve got seven assigned to Socialists/extreme Communists/Democrats alone. And this does not even involve putting Social Security on the left – which it is, as the historical Republicans and modern libertarians oppose it – and includes accepting your bizarre notion that forced distribution of corporate wealth to labor is not socialist.</p><p>By your own freaking count the Nazis are left-wing!  I am forced to ask the question, are you even listening to yourself?</p></div>",
  "content_text": "AA takes the time to go through the Munich Manifesto and characterize each of the 25 points, stating along the way:\n15. This is Social Security, something both Democrats and Republicans support.  16. Not at all Democratic, and not really Socialist, either. This was basically a way of redistributing the company’s wealth to citizens.\nAA, by your own – inaccurate – count, you’ve got four things assigned to Republicans/right wing alone.  You’ve got seven assigned to Socialists/extreme Communists/Democrats alone. And this does not even involve putting Social Security on the left – which it is, as the historical Republicans and modern libertarians oppose it – and includes accepting your bizarre notion that forced distribution of corporate wealth to labor is not socialist.\nBy your own freaking count the Nazis are left-wing!  I am forced to ask the question, are you even listening to yourself?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-05T23:16:00+00:00"
}