{
  "url": "https://voxday.net/2004/04/20/mailvox-two-way-stree/",
  "scraped_at": "2025-12-19T10:48:44.852633",
  "title": "Mailvox: A two-way street",
  "date_display": "April 20, 2004",
  "date_iso": "2004-04-20T14:53:00+00:00",
  "date_from_url": "2004-04-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Jennifer writes: <em>After a whole article about how women need to respect men (which I agree with) and how women should help boost a man’s confidence, not tear it down — doesn’t it make sense that a man should respect a women’s insecurites and build her up, too? If it is a confidence killer to her for him to be looking at the pictures can’t he just for her sake put it down?</em></p><p>Absolutely.  But that’s NEVER going to happen if she’s not showing any interest in meeting his needs or even in his feelings.  Why would a woman expect him to show any concern about her desires or insecurities if she shows none about his.  I think it is impotant for women to understand that sexual rejection is probably the biggest cause of male insecurity there is, not just for eight-grade boys but adult men as well.  There’s a reason that all the super-studs are irritatingly confident, it stems primarily from their knowledge that they can get what they want in the arena that matters most to men.</p></div>",
  "content_text": "Jennifer writes:\nAfter a whole article about how women need to respect men (which I agree with) and how women should help boost a man’s confidence, not tear it down — doesn’t it make sense that a man should respect a women’s insecurites and build her up, too? If it is a confidence killer to her for him to be looking at the pictures can’t he just for her sake put it down?\nAbsolutely.  But that’s NEVER going to happen if she’s not showing any interest in meeting his needs or even in his feelings.  Why would a woman expect him to show any concern about her desires or insecurities if she shows none about his.  I think it is impotant for women to understand that sexual rejection is probably the biggest cause of male insecurity there is, not just for eight-grade boys but adult men as well.  There’s a reason that all the super-studs are irritatingly confident, it stems primarily from their knowledge that they can get what they want in the arena that matters most to men.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-20T13:53:00+00:00"
}