{
  "url": "https://voxday.net/2004/04/02/mailvox-vox-gung-agley/",
  "scraped_at": "2025-12-13T15:57:57.004799",
  "title": "Mailvox: Vox gung agley",
  "date_display": "April 2, 2004",
  "date_iso": "2004-04-02T11:22:00+00:00",
  "date_from_url": "2004-04-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>PM writes: <em>Vox, if I remember correctly, Chuck D. mentioned that “rhetoric” as referring to the idea that Americans have a sense of superiority (which is confused with patriotism) and that they travel all over the world with complete disregard for anybody they meet. This wasn’t mentioned in a collective sense. He then immediately discussed how he goes all over the world with his music and finds that the people he meets are just as much people as Americans.</em></p><p>No, in that context, I quite agree with you.  And had I understood that was the context, which was not clear from the Atlanta newspaper account, I would not have written that post in that manner.  I’m quite pleased to know that the Rhyme Animal is not an <em>ein Welt, ein Reich</em> globalist.  As you may recall, I was so disturbed by the notion that I was forced to turn to quoting <em>Les Miserables</em> to express the depth of my shock, horror and dismay.</p><p>It just goes to show that it’s a mistake to comment on things known secondhand, which is why I’ve just been recalculating my own debt-to-GDP numbers for next week’s column.  It turns out Mogambo was off by half a percent, but then, he always says he’s bad with a calculator.  Unbelievably, he turns out to be too optimistic for a change!  I guess I’ll go back to ignoring Alice’s show; I’m certainly not going to bother listening to it.</p><p>However, I think it would be difficult to deny that the mindset I described is rather common among the globalist set, which equates both charity and loving one’s neighbor with extortion, fraud and judicial force.  I still stand by my statements, although I am happy to retract them where Chuck D, and apparently PM are concerned.  My apologies.  As far as the points about arguing like a libertarian goes, I’ll confess to being guilty of going off half-cocked in openly stated ignorance, but I don’t see that any of the rest of it applies to me.</p><p>I have not traveled as extensively as the Time-Bomb Ticking, but I speak more languages than he does and have probably immersed myself more thoroughly in at least two more cultures than he has.  Because of this, I would disagree slightly with the notion that people are just people everywhere you go.  They are all human beings, all children of God, to be sure, but I can state with some authority that different cultures do, indeed, cause noticeable and significant differences in the way individuals raised in them think, act and behave.</p></div>",
  "content_text": "PM writes:\nVox, if I remember correctly, Chuck D. mentioned that “rhetoric” as referring to the idea that Americans have a sense of superiority (which is confused with patriotism) and that they travel all over the world with complete disregard for anybody they meet. This wasn’t mentioned in a collective sense. He then immediately discussed how he goes all over the world with his music and finds that the people he meets are just as much people as Americans.\nNo, in that context, I quite agree with you.  And had I understood that was the context, which was not clear from the Atlanta newspaper account, I would not have written that post in that manner.  I’m quite pleased to know that the Rhyme Animal is not an\nein Welt, ein Reich\nglobalist.  As you may recall, I was so disturbed by the notion that I was forced to turn to quoting\nLes Miserables\nto express the depth of my shock, horror and dismay.\nIt just goes to show that it’s a mistake to comment on things known secondhand, which is why I’ve just been recalculating my own debt-to-GDP numbers for next week’s column.  It turns out Mogambo was off by half a percent, but then, he always says he’s bad with a calculator.  Unbelievably, he turns out to be too optimistic for a change!  I guess I’ll go back to ignoring Alice’s show; I’m certainly not going to bother listening to it.\nHowever, I think it would be difficult to deny that the mindset I described is rather common among the globalist set, which equates both charity and loving one’s neighbor with extortion, fraud and judicial force.  I still stand by my statements, although I am happy to retract them where Chuck D, and apparently PM are concerned.  My apologies.  As far as the points about arguing like a libertarian goes, I’ll confess to being guilty of going off half-cocked in openly stated ignorance, but I don’t see that any of the rest of it applies to me.\nI have not traveled as extensively as the Time-Bomb Ticking, but I speak more languages than he does and have probably immersed myself more thoroughly in at least two more cultures than he has.  Because of this, I would disagree slightly with the notion that people are just people everywhere you go.  They are all human beings, all children of God, to be sure, but I can state with some authority that different cultures do, indeed, cause noticeable and significant differences in the way individuals raised in them think, act and behave.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-02T10:22:00+00:00"
}