{
  "url": "https://voxday.net/2004/04/21/mailvox-sinking-to-new-lows/",
  "scraped_at": "2025-12-19T10:48:54.088124",
  "title": "Mailvox: sinking to new lows",
  "date_display": "April 21, 2004",
  "date_iso": "2004-04-21T11:33:00+00:00",
  "date_from_url": "2004-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>DS writes of Air America: <em>Decided to listen while driving around the last two days. I get the Portland station. Could not believe the low life attempt at humor. VP Cheney and Justice Scalia being gang sodomized? Saying Bush likes seeing people on fire jumping out of buildings! Not only is it not funny; it is totally disgusting. Even though I think they are helping the Republican cause it’s embarrassing to listen to. The laugh track is worse than Gilligan’s Island. I wonder what they plan to do to sink to new lows. </em></p><p>Go off the air.  That’s my guess.  Speaking of radio, I’ve been digging up some information on Pirate Radio, Icecast and other Internet radio options.  What’s the general preference – and I’m promising nothing – downloadable MP3’s from a web site or streaming from a server?  Given that you won’t be able to tune in on your radio anyhow, I don’t see any real benefit to the latter, but lots of additional expense and operating issues.  Then again, perhaps I’m missing something.  Anyone have any thoughts?</p></div>",
  "content_text": "DS writes of Air America:\nDecided to listen while driving around the last two days. I get the Portland station. Could not believe the low life attempt at humor. VP Cheney and Justice Scalia being gang sodomized? Saying Bush likes seeing people on fire jumping out of buildings! Not only is it not funny; it is totally disgusting. Even though I think they are helping the Republican cause it’s embarrassing to listen to. The laugh track is worse than Gilligan’s Island. I wonder what they plan to do to sink to new lows.\nGo off the air.  That’s my guess.  Speaking of radio, I’ve been digging up some information on Pirate Radio, Icecast and other Internet radio options.  What’s the general preference – and I’m promising nothing – downloadable MP3’s from a web site or streaming from a server?  Given that you won’t be able to tune in on your radio anyhow, I don’t see any real benefit to the latter, but lots of additional expense and operating issues.  Then again, perhaps I’m missing something.  Anyone have any thoughts?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-21T10:33:00+00:00"
}