{
  "url": "https://voxday.net/2004/04/21/mailvox-crash-and-burn/",
  "scraped_at": "2025-12-19T10:48:57.734908",
  "title": "Mailvox: crash and burn",
  "date_display": "April 21, 2004",
  "date_iso": "2004-04-21T14:59:00+00:00",
  "date_from_url": "2004-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Hank writes: <em>Those Christian extremists also have the most powerful organization in the world under their direction. That includes multi-trillion dollar power to cripple economies, a defense budget larger than the rest of the world’s combined as well as the ability to annihalate any country they see fit. That’s just what they can do to foreign peoples they don’t like. This says nothing for what they have in store for those of us here.  Forgive me if I’m more threatened by the fundamentalists running our govermnent more every day rather than a bunch of penniless Muslims half a world away.</em></p><p>This is stunningly and uncharacteristically poor thinking by Hank.  The only way it can possibly be considered even vaguely valid is to define all Christians as extremists.  George Bush is a Methodist, which is a liberal mainstream Christian denomination.  His administration is full of non-practicing Jews, so much so that its defenders claim that simply to criticize the neocon influence on the administration is tantamount to anti-Semitism.  Unless Hank is referring to Focus on the Family, which is much more of a Christian fundamentalist organization than the Bush coterie, he’s simply making statements that would sound more appropriate coming out of the humorless and factually challenged morass that is Air America.</p><p>Ironically, one could almost make a better case for the Clinton administration being full of Christian extremists, being that Bill Clinton is a nominal Southern Baptist and his administration was less populated by obviously non-Christian Jews.</p><p>Finally, our government isn’t the one with the power to cripple economies.  Its part is done.  Thanks to years of bipartisan mismanagement and the disastrous leadership of the Federal Reserve, that power now lies with the Chinese and Japanese governments.</p></div>",
  "content_text": "Hank writes:\nThose Christian extremists also have the most powerful organization in the world under their direction. That includes multi-trillion dollar power to cripple economies, a defense budget larger than the rest of the world’s combined as well as the ability to annihalate any country they see fit. That’s just what they can do to foreign peoples they don’t like. This says nothing for what they have in store for those of us here.  Forgive me if I’m more threatened by the fundamentalists running our govermnent more every day rather than a bunch of penniless Muslims half a world away.\nThis is stunningly and uncharacteristically poor thinking by Hank.  The only way it can possibly be considered even vaguely valid is to define all Christians as extremists.  George Bush is a Methodist, which is a liberal mainstream Christian denomination.  His administration is full of non-practicing Jews, so much so that its defenders claim that simply to criticize the neocon influence on the administration is tantamount to anti-Semitism.  Unless Hank is referring to Focus on the Family, which is much more of a Christian fundamentalist organization than the Bush coterie, he’s simply making statements that would sound more appropriate coming out of the humorless and factually challenged morass that is Air America.\nIronically, one could almost make a better case for the Clinton administration being full of Christian extremists, being that Bill Clinton is a nominal Southern Baptist and his administration was less populated by obviously non-Christian Jews.\nFinally, our government isn’t the one with the power to cripple economies.  Its part is done.  Thanks to years of bipartisan mismanagement and the disastrous leadership of the Federal Reserve, that power now lies with the Chinese and Japanese governments.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-21T13:59:00+00:00"
}