{
  "url": "https://voxday.net/2004/04/08/mailvox-pax-principle/",
  "scraped_at": "2025-12-13T15:58:53.086920",
  "title": "Mailvox: the pax principle",
  "date_display": "April 8, 2004",
  "date_iso": "2004-04-08T08:45:00+00:00",
  "date_from_url": "2004-04-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>EN writes: <em>You’re a smart lad. You should be advising GW and the neoconidiots who thought they could translate their academic and historical shortsightedness into military victory. Of course they wouldn’t listen but at least they couldn’t act shocked and scream about being undercut by the Democrats when this doesn’t turn out well.  BTW, you’ve got to hand it to the Founding Fathers. They made it almost impossible to fight any wars without the gravest threat to the nation uniting us. Unless a war is quick and bloodless then the coming election cycle will make it impossible to continue fighting. Our system is not meant for fighting wars as much as not fighting them. Always a wise choice unless backed into a corner.</em></p><p>You wrote: “The Romans maintained their dominance for so long by constantly sowing discord among their enemies.”  Yes, but there’s also that little business of killing all the men, raping all the women and sending the survivors into slavery once you got on the Roman bad side. The Romans make the Russians seem grandfatherly.</p><p>It’s hard to argue with that.  After his legions killed 4,000 Aduatuci, a Belgic tribe, in a battle following a false surrender, Julius Caesar rounded up 53,000 men, women and children and sold them into slavery.  This was after slaughtering the Nervii to such an extent that he claimed the tribe was virtually eradicated and the name Nervii disappeared from the tongues of men.  Rome plundered the Celts so thoroughly that after three years of Caesar’s campaigns in Gaul, the price of gold bullion dropped by a third.  America, for all its great power, is unlikely to establish a <em>Pax Americana</em> unless it is willing to resort to like measures.  One hopes we are not, but nevertheless, considering the conceptual gap between “Islam is a religion of peace” and “<em>carthago delenda est</em>“, one would tend to expect widely divergent results.</p></div>",
  "content_text": "EN writes:\nYou’re a smart lad. You should be advising GW and the neoconidiots who thought they could translate their academic and historical shortsightedness into military victory. Of course they wouldn’t listen but at least they couldn’t act shocked and scream about being undercut by the Democrats when this doesn’t turn out well.  BTW, you’ve got to hand it to the Founding Fathers. They made it almost impossible to fight any wars without the gravest threat to the nation uniting us. Unless a war is quick and bloodless then the coming election cycle will make it impossible to continue fighting. Our system is not meant for fighting wars as much as not fighting them. Always a wise choice unless backed into a corner.\nYou wrote: “The Romans maintained their dominance for so long by constantly sowing discord among their enemies.”  Yes, but there’s also that little business of killing all the men, raping all the women and sending the survivors into slavery once you got on the Roman bad side. The Romans make the Russians seem grandfatherly.\nIt’s hard to argue with that.  After his legions killed 4,000 Aduatuci, a Belgic tribe, in a battle following a false surrender, Julius Caesar rounded up 53,000 men, women and children and sold them into slavery.  This was after slaughtering the Nervii to such an extent that he claimed the tribe was virtually eradicated and the name Nervii disappeared from the tongues of men.  Rome plundered the Celts so thoroughly that after three years of Caesar’s campaigns in Gaul, the price of gold bullion dropped by a third.  America, for all its great power, is unlikely to establish a\nPax Americana\nunless it is willing to resort to like measures.  One hopes we are not, but nevertheless, considering the conceptual gap between “Islam is a religion of peace” and “\ncarthago delenda est\n“, one would tend to expect widely divergent results.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-08T07:45:00+00:00"
}