{
  "url": "https://voxday.net/2004/04/19/mailvox-harsh-reality-of-relationships/",
  "scraped_at": "2025-12-19T10:48:23.545901",
  "title": "Mailvox: the harsh reality of relationships",
  "date_display": "April 19, 2004",
  "date_iso": "2004-04-19T10:18:00+00:00",
  "date_from_url": "2004-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>LL writes:<em> What a wonderful article. For the women who read, and heed this article life will be better.  Many men stay in painful relationships for years, until their children are grown.  Once their children are grown, it is not uncommon for them to leave their wives of many years.  The pure and simple fact is: women control relationships from the ages of 6-45, they decide who they will date, they decide how serious the relationship will become, and in most cases they decide who they will marry.   After the age of 45 there is a complete role reversal, women control almost nothing.  The sex-induced fog of youth is mastered, and the simple fact of life is that there are far more available over-45 women than there are available over 45 men.</em></p><p>Yet when men leave wives of many years the wife is stunned.  The only thing that the wife can come up with is that they have been left for a younger woman.  They look for the “easy” answer, they are being left for youth.  In actuality the husband decided years before to leave when the time was appropriate.  The reality is that the husband is not leaving for a younger woman, but rather, is leaving for a more loving, more civil, caring partner who just happens to be younger.  What also happens frequently is that many of these middle aged women go through menopause and lose all sexual interest in their husbands.  Their rationalization is: “oh well, I don’t need it, so he will just have to do without.”  Sorry…nope, nope, nope, nope…no only means no for as long as the receiving  partner decides that he will accept no.  Once “no” is no longer the acceptable answer he looks elsewhere, and if sex is of interest he passes right by the post menopausal set, on this way to the younger crowd.</p><p>I think the significant insight there is that “the husband decided years before to leave when the time was appropriate.”  On occasions I’ve spoken with older, divorced men whose children are grown, I’m often struck by how happy many of them are.  “The best money I ever spent” is a commonly heard theme.  This is why I think that it is absolutely necessary for men to marry a Christian woman who embraces the notion of duty and responsibility within marriage, as opposed to a woman who views a relationship solely in terms of rights and happiness.  A man should no more marry such a woman than a woman should marry a man who beats her, cheats on her or treats her disrespectfully.</p></div>",
  "content_text": "LL writes:\nWhat a wonderful article. For the women who read, and heed this article life will be better.  Many men stay in painful relationships for years, until their children are grown.  Once their children are grown, it is not uncommon for them to leave their wives of many years.  The pure and simple fact is: women control relationships from the ages of 6-45, they decide who they will date, they decide how serious the relationship will become, and in most cases they decide who they will marry.   After the age of 45 there is a complete role reversal, women control almost nothing.  The sex-induced fog of youth is mastered, and the simple fact of life is that there are far more available over-45 women than there are available over 45 men.\nYet when men leave wives of many years the wife is stunned.  The only thing that the wife can come up with is that they have been left for a younger woman.  They look for the “easy” answer, they are being left for youth.  In actuality the husband decided years before to leave when the time was appropriate.  The reality is that the husband is not leaving for a younger woman, but rather, is leaving for a more loving, more civil, caring partner who just happens to be younger.  What also happens frequently is that many of these middle aged women go through menopause and lose all sexual interest in their husbands.  Their rationalization is: “oh well, I don’t need it, so he will just have to do without.”  Sorry…nope, nope, nope, nope…no only means no for as long as the receiving  partner decides that he will accept no.  Once “no” is no longer the acceptable answer he looks elsewhere, and if sex is of interest he passes right by the post menopausal set, on this way to the younger crowd.\nI think the significant insight there is that “the husband decided years before to leave when the time was appropriate.”  On occasions I’ve spoken with older, divorced men whose children are grown, I’m often struck by how happy many of them are.  “The best money I ever spent” is a commonly heard theme.  This is why I think that it is absolutely necessary for men to marry a Christian woman who embraces the notion of duty and responsibility within marriage, as opposed to a woman who views a relationship solely in terms of rights and happiness.  A man should no more marry such a woman than a woman should marry a man who beats her, cheats on her or treats her disrespectfully.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-19T09:18:00+00:00"
}