{
  "url": "https://voxday.net/2004/04/19/mailvox-oh-you-bad-boy/",
  "scraped_at": "2025-12-19T10:48:30.158679",
  "title": "Mailvox: oh you bad boy!",
  "date_display": "April 19, 2004",
  "date_iso": "2004-04-19T13:52:00+00:00",
  "date_from_url": "2004-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>JT, a self-proclaimed widow, writes: <em>I always thought a misogynist little boy lurked under your skin, and I now I know you are a misogynist little boy masquerading as a man.  You aren’t even married; you are like a priest trying to tell a married couple how they should respond to each other….  I have no idea on what you are basing your ideas, but it seems to me that you need to have your ego stroked all the time.  For instance sports–you need to have your sports time and would like to have a woman sitting by your side whether or not she is bored to death (sort of like a dog) so that you can reach over and touch her just to make sure you are not alone.  You sound like a guy who just can’t be alone and who is not happy with the kind of person he is.  I am 54 years old, so it may be that the years separate our opinions, but you really need to find yourself-really find yourself.  Do people your age actually walk around thinking about their relationships all the time? </em></p><p>As usual, write something a woman doesn’t like, and immediately she resorts to accusations of mysogyny.  It’s really sad when even the hate mail is tedious.  So, where did I go wrong?  What, exactly, is she asserting, that women should be disrespectful and uncivil to their husbands?  That a woman should behave like a unhappy harpy and still expect a man to stick around?  That a man is responsible for her feelings and that her time is well spent in trying to bring him down?  That she should try to prevent him from hanging out with friends, and if they do happen to be around, she should insert herself into the gathering and play topic police?  JT, do you even have a point?</p><p>I always find it amusing when people make staggeringly inaccurate assertions about me.  As anyone whose ever spent 30 minutes with me can probably tell, I’m not all that keen on spending the bulk of my time around other people.  The five books I’ve written would tend to be a bit of a clue that I enjoy my solitude.  But it’s true, I do spend 24-7 thinking about relationships, watching Oprah and reading women’s magazines.</p></div>",
  "content_text": "JT, a self-proclaimed widow, writes:\nI always thought a misogynist little boy lurked under your skin, and I now I know you are a misogynist little boy masquerading as a man.  You aren’t even married; you are like a priest trying to tell a married couple how they should respond to each other….  I have no idea on what you are basing your ideas, but it seems to me that you need to have your ego stroked all the time.  For instance sports–you need to have your sports time and would like to have a woman sitting by your side whether or not she is bored to death (sort of like a dog) so that you can reach over and touch her just to make sure you are not alone.  You sound like a guy who just can’t be alone and who is not happy with the kind of person he is.  I am 54 years old, so it may be that the years separate our opinions, but you really need to find yourself-really find yourself.  Do people your age actually walk around thinking about their relationships all the time?\nAs usual, write something a woman doesn’t like, and immediately she resorts to accusations of mysogyny.  It’s really sad when even the hate mail is tedious.  So, where did I go wrong?  What, exactly, is she asserting, that women should be disrespectful and uncivil to their husbands?  That a woman should behave like a unhappy harpy and still expect a man to stick around?  That a man is responsible for her feelings and that her time is well spent in trying to bring him down?  That she should try to prevent him from hanging out with friends, and if they do happen to be around, she should insert herself into the gathering and play topic police?  JT, do you even have a point?\nI always find it amusing when people make staggeringly inaccurate assertions about me.  As anyone whose ever spent 30 minutes with me can probably tell, I’m not all that keen on spending the bulk of my time around other people.  The five books I’ve written would tend to be a bit of a clue that I enjoy my solitude.  But it’s true, I do spend 24-7 thinking about relationships, watching Oprah and reading women’s magazines.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-19T12:52:00+00:00"
}