{
  "url": "https://voxday.net/2004/04/16/mirage-not-miracle/",
  "scraped_at": "2025-12-19T10:47:45.016763",
  "title": "Mirage, not miracle",
  "date_display": "April 16, 2004",
  "date_iso": "2004-04-16T07:24:00+00:00",
  "date_from_url": "2004-04-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Asia Times <a href=\"http://www.atimes.com/atimes/China/FD16Ad03.html\">covers the Chinese economy</a>:  So, all hunky-dory in the Middle Kingdom? Maybe. In the past decade, and certainly since the Asian crisis, warnings by some contrarian analysts of a rapidly overheating Chinese economy cranked up a few more notches. That didn’t faze foreign investors and Chinese policymakers, who scoff at the babble as banal – the same way Asia ignored, then lampooned, similar talk in the mid- to late 1990s. Then, wham! Asia’s economic castles were found to be built on sand. Their miracles were almost entirely debt-financed. And still other analysts fervently describe Chinese economic development as a miracle par excellence. Some are already saying this century is China’s.  The zeal and eulogies are all too familiar. But the contrarian chatter is fast catching up to China, with stronger tones – not something Chinese policymakers can afford to ignore anymore.</p><p>“The miracles were almost entirely debt-financed.”  Why does that remind me of something?</p><p>Oh yeah, Mogambo was going off as if he had a cell phone attached to him: <em>as a case in point, I take the $21 billion weekly issuance of debt, multiply it times fifty-two weeks, and compare that annual debt issuance to, oh, let’s say, income. Oh, not YOUR income of course, because you are so smart and handsome and you make the big bucks. No, I’m talking about the national Personal Income, which is listed as $9,364 billion, a figure that includes the pathetic contribution of us ugly little trolls out here slaving away at our pathetic little low-paying, dead-end jobs, and then coming home at night to listen to someone else whine about THEIR pathetic little low-paying dead-end job, although we have no interest in her damn day, and I think I speak for all us trolls when I say that we seethe with envy at your good fortune.  Anyway, so when I calculate all that out that, I find that the federal government, our lackluster elected officials, are putting us in more debt, to the tune of 11.5% of our income</em></p><p>Right, there’s your white-hot 8.2 percent growth.  The triple-D economy.  Debt + Debt+Debt = short-term growth, long-term bust.  Not good times.</p></div>",
  "content_text": "The Asia Times\ncovers the Chinese economy\n:  So, all hunky-dory in the Middle Kingdom? Maybe. In the past decade, and certainly since the Asian crisis, warnings by some contrarian analysts of a rapidly overheating Chinese economy cranked up a few more notches. That didn’t faze foreign investors and Chinese policymakers, who scoff at the babble as banal – the same way Asia ignored, then lampooned, similar talk in the mid- to late 1990s. Then, wham! Asia’s economic castles were found to be built on sand. Their miracles were almost entirely debt-financed. And still other analysts fervently describe Chinese economic development as a miracle par excellence. Some are already saying this century is China’s.  The zeal and eulogies are all too familiar. But the contrarian chatter is fast catching up to China, with stronger tones – not something Chinese policymakers can afford to ignore anymore.\n“The miracles were almost entirely debt-financed.”  Why does that remind me of something?\nOh yeah, Mogambo was going off as if he had a cell phone attached to him:\nas a case in point, I take the $21 billion weekly issuance of debt, multiply it times fifty-two weeks, and compare that annual debt issuance to, oh, let’s say, income. Oh, not YOUR income of course, because you are so smart and handsome and you make the big bucks. No, I’m talking about the national Personal Income, which is listed as $9,364 billion, a figure that includes the pathetic contribution of us ugly little trolls out here slaving away at our pathetic little low-paying, dead-end jobs, and then coming home at night to listen to someone else whine about THEIR pathetic little low-paying dead-end job, although we have no interest in her damn day, and I think I speak for all us trolls when I say that we seethe with envy at your good fortune.  Anyway, so when I calculate all that out that, I find that the federal government, our lackluster elected officials, are putting us in more debt, to the tune of 11.5% of our income\nRight, there’s your white-hot 8.2 percent growth.  The triple-D economy.  Debt + Debt+Debt = short-term growth, long-term bust.  Not good times.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-16T06:24:00+00:00"
}