{
  "url": "https://voxday.net/2004/04/28/nate-you-ignorant-slu/",
  "scraped_at": "2025-12-19T10:50:09.422633",
  "title": "Nate, you ignorant slut",
  "date_display": "April 28, 2004",
  "date_iso": "2004-04-28T09:22:00+00:00",
  "date_from_url": "2004-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Pan-Gargler <a href=\"http://bloggerblaster.blogspot.com/\">writes on his blog</a>: The problem with any IQ test is that it identifies not intelligence, but a pre-determined thought process, a way of thinking and working out puzzles. Taking a measure of one’s ability to perform the card trick of finding patterns in colors and shapes, to one’s ability to learn is just shamefully ignorant. The IQ tests have a great deal like the Austrian Economics Quiz. It can’t tell you what economics is right or wrong, but it can tell you who you agree with.</p><p>Oh dear.  It looks as if Nate took my advice on arguing like a liberal too seriously.  He begins, as recommended, with step 1 – make an absurd statement, preferably about something of which you know nothing.  It’s clear that either he’s writing tongue-in-cheek or he’s never read THE BELL CURVE, which delves into the statistical analysis of a number of different concepts using intelligence as measured on IQ tests as the variable.</p><p>The results are quite striking.  Low-IQ is the best predictor of criminality, better than poverty, illegitimacy or other popularly ascribed root causes.  High-IQ is also one of the best predictors of success, whether one is engaged in a job that is considered to be one that requires intelligence or not.  This is why the SAT, which until 10 or 12 years ago was an IQ test, was used to determine the likelihood of success – graduation – in college, and did so admirably until the PC forces demanded its modification.</p><p>Most people have a very poor understanding of what intelligence is.  Intelligence is not some kind of grand, multi-faceted mystery, the EQ BS notwithstanding.  Intelligence is nothing more than intellectual firepower, the ability to engage in abstract thought.  This does not mean it is necessarily well-directed, well-prepared or even used at all; a loaded M-16 in the hands of someone trained to use it is far more lethal than an empty 152mm artillery piece that is rusted-out from lack of care and use.  A wise and well-trained mediocre mind will always argue circles around the brainwashed, ill-trained brilliant mind, but that says nothing about the base intelligence of either.</p><p>Furthermore, positing that other well-known personal attributes are actually alternative forms of intelligence does nothing more than pollute the language.  There are plenty of low-IQ, high-EQ individuals out there; claiming that social butterflies are just differently intelligenced is as silly as the notion of the handicapable.  But the best way to dismiss Nate’s assertion is to point out that it ignores the fact that a person who scores highly on a general intelligence test will almost always score highly on ANY test that is based on anything but direct personal experience or memorized knowledge.  This is because the test merely reveals inherent cognitive ability, it does not create it.  As THE BELL CURVE showed, this “test-taking ability” has wide and effective real-world application.</p><p>This doesn’t mean that the high-IQ are necessarily successful, as judged by third parties.  However, one judges another’s notion of success at one’s peril.  As Mises writes, an individual’s actions can only be judged by the parameters assigned by the acting individual.</p><p>I may be a member of MENSA, but I, too, scoff at those who are excessively proud of it.  To me, it is nothing more than a recognizable warning to my critics.  If I was particularly proud of such things, I’d join those intelligence societies that actually are exclusive.  One in fifty isn’t much of an elite, after all.  In the USA alone, there are six million potential members.  I rather doubt those six million think very much alike, either.</p></div>",
  "content_text": "The Pan-Gargler\nwrites on his blog\n: The problem with any IQ test is that it identifies not intelligence, but a pre-determined thought process, a way of thinking and working out puzzles. Taking a measure of one’s ability to perform the card trick of finding patterns in colors and shapes, to one’s ability to learn is just shamefully ignorant. The IQ tests have a great deal like the Austrian Economics Quiz. It can’t tell you what economics is right or wrong, but it can tell you who you agree with.\nOh dear.  It looks as if Nate took my advice on arguing like a liberal too seriously.  He begins, as recommended, with step 1 – make an absurd statement, preferably about something of which you know nothing.  It’s clear that either he’s writing tongue-in-cheek or he’s never read THE BELL CURVE, which delves into the statistical analysis of a number of different concepts using intelligence as measured on IQ tests as the variable.\nThe results are quite striking.  Low-IQ is the best predictor of criminality, better than poverty, illegitimacy or other popularly ascribed root causes.  High-IQ is also one of the best predictors of success, whether one is engaged in a job that is considered to be one that requires intelligence or not.  This is why the SAT, which until 10 or 12 years ago was an IQ test, was used to determine the likelihood of success – graduation – in college, and did so admirably until the PC forces demanded its modification.\nMost people have a very poor understanding of what intelligence is.  Intelligence is not some kind of grand, multi-faceted mystery, the EQ BS notwithstanding.  Intelligence is nothing more than intellectual firepower, the ability to engage in abstract thought.  This does not mean it is necessarily well-directed, well-prepared or even used at all; a loaded M-16 in the hands of someone trained to use it is far more lethal than an empty 152mm artillery piece that is rusted-out from lack of care and use.  A wise and well-trained mediocre mind will always argue circles around the brainwashed, ill-trained brilliant mind, but that says nothing about the base intelligence of either.\nFurthermore, positing that other well-known personal attributes are actually alternative forms of intelligence does nothing more than pollute the language.  There are plenty of low-IQ, high-EQ individuals out there; claiming that social butterflies are just differently intelligenced is as silly as the notion of the handicapable.  But the best way to dismiss Nate’s assertion is to point out that it ignores the fact that a person who scores highly on a general intelligence test will almost always score highly on ANY test that is based on anything but direct personal experience or memorized knowledge.  This is because the test merely reveals inherent cognitive ability, it does not create it.  As THE BELL CURVE showed, this “test-taking ability” has wide and effective real-world application.\nThis doesn’t mean that the high-IQ are necessarily successful, as judged by third parties.  However, one judges another’s notion of success at one’s peril.  As Mises writes, an individual’s actions can only be judged by the parameters assigned by the acting individual.\nI may be a member of MENSA, but I, too, scoff at those who are excessively proud of it.  To me, it is nothing more than a recognizable warning to my critics.  If I was particularly proud of such things, I’d join those intelligence societies that actually are exclusive.  One in fifty isn’t much of an elite, after all.  In the USA alone, there are six million potential members.  I rather doubt those six million think very much alike, either.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-28T08:22:00+00:00"
}