{
  "url": "https://voxday.net/2004/04/15/never-going-to-happen/",
  "scraped_at": "2025-12-19T10:47:39.252874",
  "title": "Never going to happen",
  "date_display": "April 15, 2004",
  "date_iso": "2004-04-15T17:45:00+00:00",
  "date_from_url": "2004-04-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If I had just one wish this Christmas season, it’s that all the children of the world would join hands and sing together a song of peace in perfect harmony.  If I had two wishes this Christmas season, it would be to hold a heavily short position on the QQQs the day before Congress forces Wall Street to expense employee options.  NRO’s Ramesh Ponnuru was wondering why there’s such a big fuss about expensing options, and <a href=\"http://www.spartacus.ws/001076.html\">this little pair of charts</a> should help explain why:</p><p><em>It is unlikely, however, that the average private investor is aware of how significant options accounting is for the earnings of tech companies…. As you can see, excluding employee options as a cost of doing business increased reported net income per share by an average of 77% in 2001, 61% in 2002 and 34% last year.   For some companies, like Cisco and Ebay, for example, earnings per share were doubled or tripled due to the accounting fiction that the cost of employee options grants should not be considered an ordinary cost of doing business.</em></p><p>Yeah, get rid of half or two-thirds of their earnings, since the shareholders will never see them, and I imagine that their share prices will tend to sink a bit.  I imagine the Wrinkled Whores will have a little something to say about ever allowing that to happen, though.</p></div>",
  "content_text": "If I had just one wish this Christmas season, it’s that all the children of the world would join hands and sing together a song of peace in perfect harmony.  If I had two wishes this Christmas season, it would be to hold a heavily short position on the QQQs the day before Congress forces Wall Street to expense employee options.  NRO’s Ramesh Ponnuru was wondering why there’s such a big fuss about expensing options, and\nthis little pair of charts\nshould help explain why:\nIt is unlikely, however, that the average private investor is aware of how significant options accounting is for the earnings of tech companies…. As you can see, excluding employee options as a cost of doing business increased reported net income per share by an average of 77% in 2001, 61% in 2002 and 34% last year.   For some companies, like Cisco and Ebay, for example, earnings per share were doubled or tripled due to the accounting fiction that the cost of employee options grants should not be considered an ordinary cost of doing business.\nYeah, get rid of half or two-thirds of their earnings, since the shareholders will never see them, and I imagine that their share prices will tend to sink a bit.  I imagine the Wrinkled Whores will have a little something to say about ever allowing that to happen, though.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-15T16:45:00+00:00"
}