{
  "url": "https://voxday.net/2004/04/25/nice-try-leonard/",
  "scraped_at": "2025-12-19T10:49:33.149870",
  "title": "Nice try, Leonard",
  "date_display": "April 25, 2004",
  "date_iso": "2004-04-25T16:00:00+00:00",
  "date_from_url": "2004-04-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Leonard Pitts writes: It’s been nearly four months since the scandal broke. Four months since Jack Kelley, star foreign correspondent for USA Today, was found to have lied his way through his professional life for the last 13 years. He lied about where he had been, what he had seen, whom he had talked to, what they had said. He lied so much I’m only half convinced “Jack Kelley’ is his real name.  Yet you, my colleagues, have not asked <a href=\"http://www.pasadenastarnews.com/Stories/0,1413,206~11851~2104373,00.html\">the most important question</a>:</p><p>What does this mean for the future of white journalism…. Did USA Today advance a moderately capable journalist because he was white? Did some white editor mentor him out of racial solidarity even though Kelley was unqualified? In light of this fiasco, should we re- examine the de facto affirmative action that gives white men preferential treatment in our newsrooms?</p><p>Ha very ha.  But Jayson Blair was obviously a marginal case from the beginning, even while he was still in college at Maryland.  He was an affirmative-action baby, and he was quick to play the race card as soon as he was fired.  It was clear that he was being protected because he was black, whereas Kelly was a bona fide star for USA Today.  Blair’s book has a racially-focused title.  So, his failure is rightfully considered to have negative implications for the practice of affirmative action.</p><p>Every black individual must make up his mind for himself..  Does he want affirmative action or does he want respect?  You can’t have both.  Even a black who makes it on his own is always going to be suspected of being the beneficiary of this racist policy that assumes blacks are less capable.  The fact that there are white failures says nothing about the rightful suspicion that many blacks really don’t deserve to be where they are.  There’s a reason that no one doubts whether KG belongs in the NBA or not.  He earned his respect.  Don’t be surprised when people aren’t respectful of those who haven’t done likewise.</p></div>",
  "content_text": "Leonard Pitts writes: It’s been nearly four months since the scandal broke. Four months since Jack Kelley, star foreign correspondent for USA Today, was found to have lied his way through his professional life for the last 13 years. He lied about where he had been, what he had seen, whom he had talked to, what they had said. He lied so much I’m only half convinced “Jack Kelley’ is his real name.  Yet you, my colleagues, have not asked\nthe most important question\n:\nWhat does this mean for the future of white journalism…. Did USA Today advance a moderately capable journalist because he was white? Did some white editor mentor him out of racial solidarity even though Kelley was unqualified? In light of this fiasco, should we re- examine the de facto affirmative action that gives white men preferential treatment in our newsrooms?\nHa very ha.  But Jayson Blair was obviously a marginal case from the beginning, even while he was still in college at Maryland.  He was an affirmative-action baby, and he was quick to play the race card as soon as he was fired.  It was clear that he was being protected because he was black, whereas Kelly was a bona fide star for USA Today.  Blair’s book has a racially-focused title.  So, his failure is rightfully considered to have negative implications for the practice of affirmative action.\nEvery black individual must make up his mind for himself..  Does he want affirmative action or does he want respect?  You can’t have both.  Even a black who makes it on his own is always going to be suspected of being the beneficiary of this racist policy that assumes blacks are less capable.  The fact that there are white failures says nothing about the rightful suspicion that many blacks really don’t deserve to be where they are.  There’s a reason that no one doubts whether KG belongs in the NBA or not.  He earned his respect.  Don’t be surprised when people aren’t respectful of those who haven’t done likewise.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-25T15:00:00+00:00"
}