{
  "url": "https://voxday.net/2004/04/04/no-wonder-they-cant-be-held/",
  "scraped_at": "2025-12-13T15:58:21.756878",
  "title": "No wonder they can’t be held responsible",
  "date_display": "April 4, 2004",
  "date_iso": "2004-04-04T18:42:00+00:00",
  "date_from_url": "2004-04-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Washington Times: <em>A review of state police monitoring of sexually violent predators under Megan’s Law found that community notification about these felons is often “incorrect, late and ineffective,” Pennsylvania’s chief auditor says.  The head of the state police says the agency is making efforts to improve the administration of the Megan’s Law registry.  Convicted sex offenders classified as sexually violent predators are considered to have a mental abnormality or personality disorder that makes them likely to reoffend. They are subject to more stringent monitoring than the wider class of 6,210 sex offenders in Pennsylvania.  The review identified shortcomings in notifying the public on the whereabouts of 13 out of 17 sexually violent predators who had home addresses in the state during a nine-month period that ended in January, state Auditor General Robert P. Casey Jr. said Friday. Currently, Pennsylvania has 31 sexually violent predators, but 12 of them are in state prisons.</em></p><p>In seven of the 17 cases, the study found that schools and child care centers had not been told a violent predator was living nearby. One predator came to the attention of police only when he contacted them. In another instance, state police told local police about a violent predator only after he had left the area. </p><p>So, the Pennsylvania police can’t manage to keep track of only 17 of the worst criminals in the state, but anti-gun liberals believe that everyone should give up their Second Amendment rights because they are so sure that the police will be there to take defend them whenever a criminal decides to go for their life or property.  Maybe liberals really are too stupid to be responsible for themselves.</p><p>You’d think that with only 17 predators to track, Pennsylvania police would have more than enough manpower to have someone literally holding the bad guys’ hands 24-7.  But they’re probably too busy doing important things like sending 12 troopers bursting into the homes of people with suspiciously high electric bills.</p></div>",
  "content_text": "From the Washington Times:\nA review of state police monitoring of sexually violent predators under Megan’s Law found that community notification about these felons is often “incorrect, late and ineffective,” Pennsylvania’s chief auditor says.  The head of the state police says the agency is making efforts to improve the administration of the Megan’s Law registry.  Convicted sex offenders classified as sexually violent predators are considered to have a mental abnormality or personality disorder that makes them likely to reoffend. They are subject to more stringent monitoring than the wider class of 6,210 sex offenders in Pennsylvania.  The review identified shortcomings in notifying the public on the whereabouts of 13 out of 17 sexually violent predators who had home addresses in the state during a nine-month period that ended in January, state Auditor General Robert P. Casey Jr. said Friday. Currently, Pennsylvania has 31 sexually violent predators, but 12 of them are in state prisons.\nIn seven of the 17 cases, the study found that schools and child care centers had not been told a violent predator was living nearby. One predator came to the attention of police only when he contacted them. In another instance, state police told local police about a violent predator only after he had left the area.\nSo, the Pennsylvania police can’t manage to keep track of only 17 of the worst criminals in the state, but anti-gun liberals believe that everyone should give up their Second Amendment rights because they are so sure that the police will be there to take defend them whenever a criminal decides to go for their life or property.  Maybe liberals really are too stupid to be responsible for themselves.\nYou’d think that with only 17 predators to track, Pennsylvania police would have more than enough manpower to have someone literally holding the bad guys’ hands 24-7.  But they’re probably too busy doing important things like sending 12 troopers bursting into the homes of people with suspiciously high electric bills.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-04T17:42:00+00:00"
}