{
  "url": "https://voxday.net/2004/04/21/not-chastened-enoug/",
  "scraped_at": "2025-12-19T10:48:55.909586",
  "title": "Not chastened enough",
  "date_display": "April 21, 2004",
  "date_iso": "2004-04-21T14:25:00+00:00",
  "date_from_url": "2004-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Rich Lowry writes on NRO: <em>By my count, the ranks of chastened hawks -chastened in their own differing ways, of course-now includes Charles Krauthammer, David Brooks, and Francis Fukuyama. It’s possible to be sadder, wiser, and still resolved to see this thing through. That’s where NR is, and where, I suspect, a lot of supporters of this war are.<br> <br/></br></em><br> <br>Nation-building is not an appropriate enterprise for a free society.  It was a bad idea in Woodrow Wilson’s time and it is a bad idea now.  All that we are likely to accomplish in Iraq, I fear, is to enhance the power and ambition of the United Nations.  After all, if we turn primary responsibility over to them, who could argue that the organization needs military capability of its own as well as a means of funding it?</br></br></p><p>As for the chastened hawks, how much longer will it take for them to take the next step and conclude that American troops should not be there, not to mention Bosnia or any of the 100 other countries in which our troops are stationed as they attempt to maintain Pax Americana.  The romantic irony of bringing “democracy” to these foreign lands aside, it simply isn’t going to work.  The projected stay has now reached 10 years.  No doubt it will soon be longer than that.</p></div>",
  "content_text": "Rich Lowry writes on NRO:\nBy my count, the ranks of chastened hawks -chastened in their own differing ways, of course-now includes Charles Krauthammer, David Brooks, and Francis Fukuyama. It’s possible to be sadder, wiser, and still resolved to see this thing through. That’s where NR is, and where, I suspect, a lot of supporters of this war are.\nNation-building is not an appropriate enterprise for a free society.  It was a bad idea in Woodrow Wilson’s time and it is a bad idea now.  All that we are likely to accomplish in Iraq, I fear, is to enhance the power and ambition of the United Nations.  After all, if we turn primary responsibility over to them, who could argue that the organization needs military capability of its own as well as a means of funding it?\nAs for the chastened hawks, how much longer will it take for them to take the next step and conclude that American troops should not be there, not to mention Bosnia or any of the 100 other countries in which our troops are stationed as they attempt to maintain Pax Americana.  The romantic irony of bringing “democracy” to these foreign lands aside, it simply isn’t going to work.  The projected stay has now reached 10 years.  No doubt it will soon be longer than that.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-21T13:25:00+00:00"
}