{
  "url": "https://voxday.net/2004/04/16/on-b-52s/",
  "scraped_at": "2025-12-19T10:47:57.634001",
  "title": "On B-52s",
  "date_display": "April 16, 2004",
  "date_iso": "2004-04-16T19:00:00+00:00",
  "date_from_url": "2004-04-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Okay, I’m actually thinking about the band.  I happened to pop Cosmic Thing into the CD for the first time in about ten years and realized that I’d completely forgotten what a good CD it is.  Junebug is just impressively strange: “Let’s get in the mud!  Go!  Go! Go Junebug!”  I’m not much of a concert guy, but they’re one of the few bands I regret not ever seeing live.  Freaks.</p><p>But as to the other sort of B-52 I had to laugh when I was reading about how some US troops were saying that it’s just a few bad apples causing most of the trouble over in Iraq.  This is surely true, but as PJ O’Rourke pointed out years ago in <em>All the Trouble in the World</em> after a trip to Northern Ireland, that’s what the occupying soldiers always say.  And while it may be true, that doesn’t mean that you’re not going to be there for 30 years dealing with the trouble caused by those comparatively few troublemakers.</p><p>I also thought it was interesting that the fatality rates seem to be generally running around 10-1.  That’s precisely where the Israeli-Palestinian rate was until the suicide bombing campaign dropped it down to 3-1 for a while.  This might explain why no one is in a hurry to take away America’s guns.  Even allowing for the many advantages of a professional army, there’s simply too many guns in the hands of too many people for anyone to even think about it, unless you managed to import the troops from China.  Then again, on second thought, that’s assuming a desire to avoid civilian casualties.</p><p>I don’t actually have a coherent point here, I’m just thinking out loud.</p></div>",
  "content_text": "Okay, I’m actually thinking about the band.  I happened to pop Cosmic Thing into the CD for the first time in about ten years and realized that I’d completely forgotten what a good CD it is.  Junebug is just impressively strange: “Let’s get in the mud!  Go!  Go! Go Junebug!”  I’m not much of a concert guy, but they’re one of the few bands I regret not ever seeing live.  Freaks.\nBut as to the other sort of B-52 I had to laugh when I was reading about how some US troops were saying that it’s just a few bad apples causing most of the trouble over in Iraq.  This is surely true, but as PJ O’Rourke pointed out years ago in\nAll the Trouble in the World\nafter a trip to Northern Ireland, that’s what the occupying soldiers always say.  And while it may be true, that doesn’t mean that you’re not going to be there for 30 years dealing with the trouble caused by those comparatively few troublemakers.\nI also thought it was interesting that the fatality rates seem to be generally running around 10-1.  That’s precisely where the Israeli-Palestinian rate was until the suicide bombing campaign dropped it down to 3-1 for a while.  This might explain why no one is in a hurry to take away America’s guns.  Even allowing for the many advantages of a professional army, there’s simply too many guns in the hands of too many people for anyone to even think about it, unless you managed to import the troops from China.  Then again, on second thought, that’s assuming a desire to avoid civilian casualties.\nI don’t actually have a coherent point here, I’m just thinking out loud.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-16T18:00:00+00:00"
}