{
  "url": "https://voxday.net/2004/04/23/pages-paris-to-moon/",
  "scraped_at": "2025-12-19T10:49:20.319635",
  "title": "Pages: PARIS TO THE MOON",
  "date_display": "April 23, 2004",
  "date_iso": "2004-04-23T11:08:00+00:00",
  "date_from_url": "2004-04-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is a book of non-fiction written by a liberal Jewish New Yorker who decides to go expat for a few years with his wife and newborn son.  Possessed of a romantic childhood vision of Paris, reinforced by an actual visit as a teenager, the little family takes an apartment in Paris and experiences the pedestrian joys and petty tribulations of living amidst Old Europe’s last natural aristocracy, the Parisians.</p><p>It’s a delightful book.  Adam Gopnik has a wry sense of humor and a keen eye for not only the small details that paint a vivid picture of his experience there, but also the broader generalizations that, taken in the collective, define the French character.  It is well-written too, for who could fail to be amused by the following passage:</p><p>“Like all ambitious French politicians, Juppe chooses to present himself as a literary man.  He has actually written a book of reflections titled <em>La Tentation de Venise</em> – The Venetian Temptation.  Juppe’s Venetian temptation was to retire to a house there, where he could escape from political life, admire Giorgione’s <em>Tempesta</em>, drink Bellinis in the twilight, and think long deep thoughts. <em>La Tentation</em> was regarded as a fighting campaign manifesto, since it is as necessary for an ambitious French politician to write a book explaining why he never likes to think of politics as it is for an ambitious American politician to write a book explaining why he never thinks of anything else.  Juppe, ahead of the pack, had written a book asserting not only that he would rather be doing something else but that he would like to be doing it in a completely different country.”</p><p>I enjoyed the book and found myself laughing out loud on more than one occasion.  This is a warm book, a gentle and humane book, full of a man’s affection for a city and his great love for his son, through whose eyes we see the vast chasm between the expat and one who has never known another home.  If the book will do little to change one’s view of the French as arrogant curs with a penchant for socialism and boot-licking, it nevertheless will provide one with the ability to smile when next encountering the inevitable Gallic intransigence.  A book well worth reading.</p></div>",
  "content_text": "This is a book of non-fiction written by a liberal Jewish New Yorker who decides to go expat for a few years with his wife and newborn son.  Possessed of a romantic childhood vision of Paris, reinforced by an actual visit as a teenager, the little family takes an apartment in Paris and experiences the pedestrian joys and petty tribulations of living amidst Old Europe’s last natural aristocracy, the Parisians.\nIt’s a delightful book.  Adam Gopnik has a wry sense of humor and a keen eye for not only the small details that paint a vivid picture of his experience there, but also the broader generalizations that, taken in the collective, define the French character.  It is well-written too, for who could fail to be amused by the following passage:\n“Like all ambitious French politicians, Juppe chooses to present himself as a literary man.  He has actually written a book of reflections titled\nLa Tentation de Venise\n– The Venetian Temptation.  Juppe’s Venetian temptation was to retire to a house there, where he could escape from political life, admire Giorgione’s\nTempesta\n, drink Bellinis in the twilight, and think long deep thoughts.\nLa Tentation\nwas regarded as a fighting campaign manifesto, since it is as necessary for an ambitious French politician to write a book explaining why he never likes to think of politics as it is for an ambitious American politician to write a book explaining why he never thinks of anything else.  Juppe, ahead of the pack, had written a book asserting not only that he would rather be doing something else but that he would like to be doing it in a completely different country.”\nI enjoyed the book and found myself laughing out loud on more than one occasion.  This is a warm book, a gentle and humane book, full of a man’s affection for a city and his great love for his son, through whose eyes we see the vast chasm between the expat and one who has never known another home.  If the book will do little to change one’s view of the French as arrogant curs with a penchant for socialism and boot-licking, it nevertheless will provide one with the ability to smile when next encountering the inevitable Gallic intransigence.  A book well worth reading.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-23T10:08:00+00:00"
}