{
  "url": "https://voxday.net/2004/04/02/pecker-dont-know-no-color/",
  "scraped_at": "2025-12-13T15:57:58.481122",
  "title": "The pecker don’t know no color",
  "date_display": "April 2, 2004",
  "date_iso": "2004-04-02T12:26:00+00:00",
  "date_from_url": "2004-04-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A quartet of Minnesota men with a radio show of their own, the Fraters Libertas, <a href=\"http://www.fraterslibertas.com/2004_04_01_archive.html#108084435841757026\">pronounce Alice’s show “an unqualified disaster</a>: <em>As an example, take the Strom Thurmond impression Franken did about 30 minutes ago. After taking about 5 minutes to outline the premise with his side kick (Cacklin’ Katherine Lanpher), it consisted of these words, in a gravel voiced, LOUD, angry, southern drawl:</em></p><p><strong>“I screwed colored girls! I screwed Puerto Rican girls! I screwed them all! The pecker don’t know no color!”</strong></p><p>And he said it over and over and over again. I actually had a shudder of embarrassment run down my spine and I considered crawling under the car seat to somehow distance myself from what was coming out of my speakers. The bit didn’t contain even a rumor of humor, just a guy shouting hateful nonsense in an attempt to be irreverent and edgy. Even Cacklin’ Katherine could only manage a few bursts of uncomfortable, embarrassed courtesy laughter. Which is more than she wanted to give, I’m sure. Can you imagine her reaction to someone saying those words on her old MPR program? Or imagine her and Franken’s reaction if Rush Limbaugh had said those words (even under the guise of it being satire)?</p><p>I think we need a new Toxic Pool, only this one measuring the lifespan of Alice’s show.  I’m just not sure if we should do it in days or weeks.  I expected a disaster, but not one of dinosaur-eradicating proportions.  “The pecker don’t know no color!”  That should serve nicely for Alice’s epitaph.  I was going to ignore the show, honestly I was, but holy cats!  This is like trying to ignore a semi colliding head-on with bus one lane over.</p><p>UPDATE: Even worse, that was planned and prescripted.  According to Saint Paul of the Fraters, that hysterical little bit was <a href=\"http://www.fraterslibertas.com/2004_04_01_archive.html#108085032662076660\">in the works</a> two weeks ago: <em>[Franken] and his team of writers have been compiling files on a range of topics that is utterly Frankenesque. The Bush tax policy will be ”a huge story for us,” says Ben Wikler, Franken’s producer. Then, too, Franken unleashes a hilarious, X-rated Strom Thurmond impersonation that has been playing in his head and that he desperately wants to make work….</em></p><p>I’m not sure dinosaur-eradicating will suffice.  Alice, you might want to stop listening to the voices in your head.  They aren’t funny.</p></div>",
  "content_text": "A quartet of Minnesota men with a radio show of their own, the Fraters Libertas,\npronounce Alice’s show “an unqualified disaster\n:\nAs an example, take the Strom Thurmond impression Franken did about 30 minutes ago. After taking about 5 minutes to outline the premise with his side kick (Cacklin’ Katherine Lanpher), it consisted of these words, in a gravel voiced, LOUD, angry, southern drawl:\n“I screwed colored girls! I screwed Puerto Rican girls! I screwed them all! The pecker don’t know no color!”\nAnd he said it over and over and over again. I actually had a shudder of embarrassment run down my spine and I considered crawling under the car seat to somehow distance myself from what was coming out of my speakers. The bit didn’t contain even a rumor of humor, just a guy shouting hateful nonsense in an attempt to be irreverent and edgy. Even Cacklin’ Katherine could only manage a few bursts of uncomfortable, embarrassed courtesy laughter. Which is more than she wanted to give, I’m sure. Can you imagine her reaction to someone saying those words on her old MPR program? Or imagine her and Franken’s reaction if Rush Limbaugh had said those words (even under the guise of it being satire)?\nI think we need a new Toxic Pool, only this one measuring the lifespan of Alice’s show.  I’m just not sure if we should do it in days or weeks.  I expected a disaster, but not one of dinosaur-eradicating proportions.  “The pecker don’t know no color!”  That should serve nicely for Alice’s epitaph.  I was going to ignore the show, honestly I was, but holy cats!  This is like trying to ignore a semi colliding head-on with bus one lane over.\nUPDATE: Even worse, that was planned and prescripted.  According to Saint Paul of the Fraters, that hysterical little bit was\nin the works\ntwo weeks ago:\n[Franken] and his team of writers have been compiling files on a range of topics that is utterly Frankenesque. The Bush tax policy will be ”a huge story for us,” says Ben Wikler, Franken’s producer. Then, too, Franken unleashes a hilarious, X-rated Strom Thurmond impersonation that has been playing in his head and that he desperately wants to make work….\nI’m not sure dinosaur-eradicating will suffice.  Alice, you might want to stop listening to the voices in your head.  They aren’t funny.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-02T11:26:00+00:00"
}