{
  "url": "https://voxday.net/2004/04/27/perfidious-gau/",
  "scraped_at": "2025-12-19T10:49:56.985311",
  "title": "Perfidious Gaul",
  "date_display": "April 27, 2004",
  "date_iso": "2004-04-27T07:30:00+00:00",
  "date_from_url": "2004-04-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One of the most important elections of our time will be approaching soon, and it is not taking place in the United States.  Tony Blair has finally, reluctantly, decided that the British people, who have not been conquered since 1066, will be allowed to have a voice in handing over their national sovereignty to the fascist Franco-German cabal in Brussels.  There’s <a href=\"http://www.uncommonknowledge.org/800/812.html\">a fascinating interview</a> on Uncommon Knowledge featuring the historian Paul Johnson, who says of the EU:</p><p> I would personally prefer it if Dutch lawyers and German lawyers had played a greater part in the thinking behind all this because they’ve both got good traditions. If you look at the tradition of constitution-making in France, of course, it’s one lurching from one disaster to another and that is true of most Latin countries. But the Germans created Teutonic law before anyone else, certainly Northern Europe. And that is the basis of the English legal system. And that, of course, was a common law system and the English system underlay the American Constitution. So you can trace all back to German. But this is a constitution done by Latins and I think Tim made very shrewd and true remark which I entirely endorse, which is the French and Europe–the moment the French lose control of Europe, they will smash it to bits. They haven’t yet lost control of it by no means, I don’t agree with Tim there.</p><p>But sooner or later, they are bound to lose control of Europe and it’s going to cease to be an instrument of French domestic and foreign policy. The moment they are satisfied that they have lost on a major battle, they will withdraw from Europe and smash it up. So Europe is not something you can take for granted because it cannot exist without France, geographically and in lots of other ways, it’s too near the center. Europe is a provisional creation just as those Napoleonic states were of the French. And when it ceases to be useful to the French, they will smash it up.</p><p>I’m not entirely sure that Johnson is completely correct on this, as I suspect that an important element of the EU is to serve as a modern secular Holy League against the Turk.  The mandarins of Europe can read demographics studies as well as anyone, and whereas no single European nation has the ability to do much about what is beginning to be viewed as the Islamic problem, the EU would provide both the scope of power and territory to do so.  As Johnson says: “Europe defined itself for most of its history against Islam, against the Muslim world. So it’s a huge leap for us and for them to accept the idea that you can be a Muslim European. You know, in the Middle Ages, people would have thought that was like saying you can be a male woman.”</p><p>Then again, in Johnson’s defense, it’s impossible to deny that the French <a href=\"http://www.eubusiness.com/afp/030910175802.mrxmxieg\">broke the Stability and Growth Pact</a> without even blinking the moment that they found it obstructing their domestic policy.  So, in any case, here’s hoping the Brits have the wits to reject the EU’s so-called constitution and go it alone again.</p></div>",
  "content_text": "One of the most important elections of our time will be approaching soon, and it is not taking place in the United States.  Tony Blair has finally, reluctantly, decided that the British people, who have not been conquered since 1066, will be allowed to have a voice in handing over their national sovereignty to the fascist Franco-German cabal in Brussels.  There’s\na fascinating interview\non Uncommon Knowledge featuring the historian Paul Johnson, who says of the EU:\nI would personally prefer it if Dutch lawyers and German lawyers had played a greater part in the thinking behind all this because they’ve both got good traditions. If you look at the tradition of constitution-making in France, of course, it’s one lurching from one disaster to another and that is true of most Latin countries. But the Germans created Teutonic law before anyone else, certainly Northern Europe. And that is the basis of the English legal system. And that, of course, was a common law system and the English system underlay the American Constitution. So you can trace all back to German. But this is a constitution done by Latins and I think Tim made very shrewd and true remark which I entirely endorse, which is the French and Europe–the moment the French lose control of Europe, they will smash it to bits. They haven’t yet lost control of it by no means, I don’t agree with Tim there.\nBut sooner or later, they are bound to lose control of Europe and it’s going to cease to be an instrument of French domestic and foreign policy. The moment they are satisfied that they have lost on a major battle, they will withdraw from Europe and smash it up. So Europe is not something you can take for granted because it cannot exist without France, geographically and in lots of other ways, it’s too near the center. Europe is a provisional creation just as those Napoleonic states were of the French. And when it ceases to be useful to the French, they will smash it up.\nI’m not entirely sure that Johnson is completely correct on this, as I suspect that an important element of the EU is to serve as a modern secular Holy League against the Turk.  The mandarins of Europe can read demographics studies as well as anyone, and whereas no single European nation has the ability to do much about what is beginning to be viewed as the Islamic problem, the EU would provide both the scope of power and territory to do so.  As Johnson says: “Europe defined itself for most of its history against Islam, against the Muslim world. So it’s a huge leap for us and for them to accept the idea that you can be a Muslim European. You know, in the Middle Ages, people would have thought that was like saying you can be a male woman.”\nThen again, in Johnson’s defense, it’s impossible to deny that the French\nbroke the Stability and Growth Pact\nwithout even blinking the moment that they found it obstructing their domestic policy.  So, in any case, here’s hoping the Brits have the wits to reject the EU’s so-called constitution and go it alone again.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-27T06:30:00+00:00"
}