{
  "url": "https://voxday.net/2004/04/30/reading-assignment-for-gargler/",
  "scraped_at": "2025-12-19T10:50:33.268496",
  "title": "A reading assignment for the Gargler",
  "date_display": "April 30, 2004",
  "date_iso": "2004-04-30T14:34:00+00:00",
  "date_from_url": "2004-04-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Fred Reed writes: <em>The Bell Curve</em>, an excellent book more maligned than read, pointed out a trend seldom noticed. The authors called it “cognitive stratification,” not a phrase Byron would have chosen but serviceable enough. It means the concentration of the intelligent.  In 1850 people of high intelligence were dispersed through the population. If the child of a cowboy had an IQ of 160, he would probably remain in the geographical region with cowboys. He might be more successful than most, and might choose as friends the quicker wits thereabouts. Yet he would be part of the community….  In 1850 there were few jobs requiring the very bright. Today they abound. Universities began to scour the country for the highly intelligent. These, once found, met each other at elite universities or, later, in the places where the bright concentrated to work: Laboratories, software houses, hospitals, magazine journalism, and occasionally law firms. They married each other. Their children tended to be bright. The result has been that the bright tend to live, play, work, and sleep almost entirely with each other.</p><p>It is true that the bright and educated are almost shockingly insulated.  I once had an argument with a woman who insisted that everyone went to college – she defied me to name one person in our social circle who hadn’t.  I couldn’t do that, so I was forced to make do with demonstrating that around 50 percent of the populace goes to college at all, and a significant percentage of those who do never graduate.  My father used to get on my case for being contemptuous of other people’s intelligence, but he finally stopped when I illustrated how many of my problems in the corporate world stemmed directly from <em>overestimating</em> others.  Contempt may not be nice, but it is nevertheless wise to temper your expectations of the capabilities of others on whom you are relying.</p><p>The most significant thing in this regard has little to do with intelligence.  Possibly the great lie of the last 250 years is that man is rational.  Our market theories depend on it, often our business activities postulate it, and it simply isn’t true.  Man is inherently irrational, and this is supported day in and day out by watching the actions and decisions of those around you.  Much of the time, intelligence simply helps one do a more convicing job of rationalizing one’s stupid decision to follow one’s desires.</p></div>",
  "content_text": "Fred Reed writes:\nThe Bell Curve\n, an excellent book more maligned than read, pointed out a trend seldom noticed. The authors called it “cognitive stratification,” not a phrase Byron would have chosen but serviceable enough. It means the concentration of the intelligent.  In 1850 people of high intelligence were dispersed through the population. If the child of a cowboy had an IQ of 160, he would probably remain in the geographical region with cowboys. He might be more successful than most, and might choose as friends the quicker wits thereabouts. Yet he would be part of the community….  In 1850 there were few jobs requiring the very bright. Today they abound. Universities began to scour the country for the highly intelligent. These, once found, met each other at elite universities or, later, in the places where the bright concentrated to work: Laboratories, software houses, hospitals, magazine journalism, and occasionally law firms. They married each other. Their children tended to be bright. The result has been that the bright tend to live, play, work, and sleep almost entirely with each other.\nIt is true that the bright and educated are almost shockingly insulated.  I once had an argument with a woman who insisted that everyone went to college – she defied me to name one person in our social circle who hadn’t.  I couldn’t do that, so I was forced to make do with demonstrating that around 50 percent of the populace goes to college at all, and a significant percentage of those who do never graduate.  My father used to get on my case for being contemptuous of other people’s intelligence, but he finally stopped when I illustrated how many of my problems in the corporate world stemmed directly from\noverestimating\nothers.  Contempt may not be nice, but it is nevertheless wise to temper your expectations of the capabilities of others on whom you are relying.\nThe most significant thing in this regard has little to do with intelligence.  Possibly the great lie of the last 250 years is that man is rational.  Our market theories depend on it, often our business activities postulate it, and it simply isn’t true.  Man is inherently irrational, and this is supported day in and day out by watching the actions and decisions of those around you.  Much of the time, intelligence simply helps one do a more convicing job of rationalizing one’s stupid decision to follow one’s desires.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-30T13:34:00+00:00"
}