{
  "url": "https://voxday.net/2004/04/22/remind-you-of-anyone/",
  "scraped_at": "2025-12-19T10:49:04.662484",
  "title": "Remind you of anyone?",
  "date_display": "April 22, 2004",
  "date_iso": "2004-04-22T08:02:00+00:00",
  "date_from_url": "2004-04-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From Slate on Eric Harris of Columbine infamy: <em>These are not the rantings of an angry young man, picked on by jocks until he’s not going to take it anymore. These are the rantings of someone with a messianic-grade superiority complex, out to punish the entire human race for its appalling inferiority. It may look like hate, but “It’s more about demeaning other people,” says Hare.</em></p><p>A second confirmation of the diagnosis [of psychopathy] was Harris’ perpetual deceitfulness…. Harris claimed to lie to protect himself, but that appears to be something of a lie as well. He lied for pleasure, Fuselier says. “Duping delight”—psychologist Paul Ekman’s term—represents a key characteristic of the psychopathic profile.</p><p>Messianism.  Superiority complex.  Pleasure in deceit.  I don’t know why, but a vision of the Clintons just popped into my head.</p></div>",
  "content_text": "From Slate on Eric Harris of Columbine infamy:\nThese are not the rantings of an angry young man, picked on by jocks until he’s not going to take it anymore. These are the rantings of someone with a messianic-grade superiority complex, out to punish the entire human race for its appalling inferiority. It may look like hate, but “It’s more about demeaning other people,” says Hare.\nA second confirmation of the diagnosis [of psychopathy] was Harris’ perpetual deceitfulness…. Harris claimed to lie to protect himself, but that appears to be something of a lie as well. He lied for pleasure, Fuselier says. “Duping delight”—psychologist Paul Ekman’s term—represents a key characteristic of the psychopathic profile.\nMessianism.  Superiority complex.  Pleasure in deceit.  I don’t know why, but a vision of the Clintons just popped into my head.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-22T07:02:00+00:00"
}