{
  "url": "https://voxday.net/2004/04/17/same-planet-different-worlds-2/",
  "scraped_at": "2025-12-19T10:48:01.341097",
  "title": "Same planet, different worlds",
  "date_display": "April 17, 2004",
  "date_iso": "2004-04-17T09:16:00+00:00",
  "date_from_url": "2004-04-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Strange Semantics <a href=\"http://strangesemantics.blogspot.com/2004_04_01_strangesemantics_archive.html#108216173097275220\">writes on his blog</a>: <em>There’s also an air of Fascist-like propaganda that wafts through the current right-wing zeitgeist. Notice Bush’s constant assertions that you are either for or against him, and Carl Rove’s acknowledgement that he can spin (read propagandize) anything his opponents might say so that it harms them, rather than his team. There’s the misuse of pre-war Iraqi intelligence, and the spinning of the post-war reality in Iraq, to say nothing of the constant reference to a connection between Iraq and Al Qaeda, which we know never existed in any meaningful sense. So, the commission, because it dissents from the President’s message, which is simply “I am infallible; follow me,”  is decried as partisan (it’s a bipartisan commission!) at best, and a complete complete joke at worst.</em></p><p>This is fascinating.  It came to my attention through <a href=\"http://www.technorati.com/cosmos/links.html?PHPSESSID=78d14e417b32086cbacf1d8dd826aa64&amp;rank=&amp;url=http%3A%2F%2Fvoxday.blogspot.com&amp;sub=Get+Link+Cosmos\">Technorati</a>, which lets you see who is linking to you, as the “complete joke” was a link to my recent post.  But, as is his wont, Strange cocks it up entirely since the notion that I am dismissive of the 9/11 commission because it is insufficiently pro-Bush is utterly nonsensical to anyone who is a regular reader of this blog.</p><p>First, one of the commission’s members is hopelessly conflicted, given that she was directly involved in the events leading up to 9/11.  Second, they aren’t asking any of the significant questions about 9/11.  Where is the wreckage of the plane that supposedly hit the Pentagon?  Oh, right, it liquified after making a hole far too small for a Boeing, and yet there’s plenty of items from the two planes that hit the Twin Towers.  Why did the FAA fail to respond to the hijackings for 45 minutes?  Is it true that some of the supposed hijackers are alive and giving interviews in European newspapers, and how were they identified so quickly given that none of their names appear on the passenger manifests?  Why was gravel and dirt dumped over the pristine lawn that went right up to the Pentagon while the firefighters were still putting out the fire?  How is it that the same names keep cropping up in the TWA 800, OK City and 9/11 investigations?</p><p>Those are the questions I’m interested in hearing the Commission ask.  But they won’t.  And that’s why the Commission is a joke.  As usual, the partisan uproar is merely noise to keep everyone, in both parties, looking in one direction.  Bush and Kerry are identical, again, in this regard.</p><p>And, for the x-millionth time, the fascists are left-wing.  They always were left-wing big government lovers, they always will be left-wing big government lovers, and the Bush administration has at times looked increasingly fascistic AS IT MOVES TO THE LEFT and disregards individual rights in favor of increasing central government power.  In any case, Jonah Goldberg’s forthcoming book should be the final word necessary on the subject.</p></div>",
  "content_text": "Strange Semantics\nwrites on his blog\n:\nThere’s also an air of Fascist-like propaganda that wafts through the current right-wing zeitgeist. Notice Bush’s constant assertions that you are either for or against him, and Carl Rove’s acknowledgement that he can spin (read propagandize) anything his opponents might say so that it harms them, rather than his team. There’s the misuse of pre-war Iraqi intelligence, and the spinning of the post-war reality in Iraq, to say nothing of the constant reference to a connection between Iraq and Al Qaeda, which we know never existed in any meaningful sense. So, the commission, because it dissents from the President’s message, which is simply “I am infallible; follow me,”  is decried as partisan (it’s a bipartisan commission!) at best, and a complete complete joke at worst.\nThis is fascinating.  It came to my attention through\nTechnorati\n, which lets you see who is linking to you, as the “complete joke” was a link to my recent post.  But, as is his wont, Strange cocks it up entirely since the notion that I am dismissive of the 9/11 commission because it is insufficiently pro-Bush is utterly nonsensical to anyone who is a regular reader of this blog.\nFirst, one of the commission’s members is hopelessly conflicted, given that she was directly involved in the events leading up to 9/11.  Second, they aren’t asking any of the significant questions about 9/11.  Where is the wreckage of the plane that supposedly hit the Pentagon?  Oh, right, it liquified after making a hole far too small for a Boeing, and yet there’s plenty of items from the two planes that hit the Twin Towers.  Why did the FAA fail to respond to the hijackings for 45 minutes?  Is it true that some of the supposed hijackers are alive and giving interviews in European newspapers, and how were they identified so quickly given that none of their names appear on the passenger manifests?  Why was gravel and dirt dumped over the pristine lawn that went right up to the Pentagon while the firefighters were still putting out the fire?  How is it that the same names keep cropping up in the TWA 800, OK City and 9/11 investigations?\nThose are the questions I’m interested in hearing the Commission ask.  But they won’t.  And that’s why the Commission is a joke.  As usual, the partisan uproar is merely noise to keep everyone, in both parties, looking in one direction.  Bush and Kerry are identical, again, in this regard.\nAnd, for the x-millionth time, the fascists are left-wing.  They always were left-wing big government lovers, they always will be left-wing big government lovers, and the Bush administration has at times looked increasingly fascistic AS IT MOVES TO THE LEFT and disregards individual rights in favor of increasing central government power.  In any case, Jonah Goldberg’s forthcoming book should be the final word necessary on the subject.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-17T08:16:00+00:00"
}