{
  "url": "https://voxday.net/2004/04/07/shifting-sands/",
  "scraped_at": "2025-12-13T15:58:38.761564",
  "title": "Shifting Sands",
  "date_display": "April 7, 2004",
  "date_iso": "2004-04-07T08:37:00+00:00",
  "date_from_url": "2004-04-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>AA began: <em>ideologically the Nazi party was more right-wing than left…. The Nazi party did implement socialist programs, though many were gone by the end of the war because they didn’t have the money to keep them going. That doesn’t make them socialist, and the pluralism, egalitarianism, etc. that are central to the democratic party’s platform are hardly mirrored anywhere in the Nazi party’s platform. The opposite, right-wing alternatives are.</em></p><p>After this thesis came under severe pressure, he subsequently wrote: <em>…covering them all, we see that there are some specific similiarities with Republicans, some vague similarities to democrats and socialists, and some things that don’t resemble either side of the political spectrum in America today</em>.   And: <em>I cited all 25 and went through them. Since few of the 25 were even associated with the Democratic party, and those that were, were vague, this whole post baffles me.</em></p><p>Meanwhile, I had written “Over a third of the 1920 Munich Manifesto precisely matched goals put forth by the American Democratic party, and that percentage more than doubled if one eliminates the historical aspects of the Nazi platform that simply have no application today.”</p><p>This prompted him to assert: <em>The American Left is not mirrored in the Nazi manifesto, and neither is the Left, even if they both share qualities and aims with it. In fact, many of the aims are consumate with our Constitution. Actually, I think the Democratic party shared fewer than 7 (of the 25)  by itself… Final tallies: Democrats: 7 Socialists: 14 Communists: 14 Republicans: 17 Libertarians: 6</em></p><p>At which point, I went through, point by point, and assessed where the various ideologies stood with relation to the National Socialist program.  Which prompted him to reassess again and write: <em>Doing percentages here is strange, but if we make these into percentages, Republicans are half Nazi, Communists 2/3, Libertarians less than 1/3, Democrats a little less than 1/2, and Socialists a little more than 1/2. Of course, in reality, none of these ideologies share the nastiness of Nazism, the total disregard for life, the all-encompassing power of the state, etc.</em></p><p>Care to tell us again how your views aren’t changing, how you’re boldly standing your ground?  The only significant difference now between your latest assessment and mine is that you’re still trying to disguise the Democrats’ Nazi tendencies despite having to double your original count.  I, too, had the Communists most similar and the Republicans at almost 50 percent.  But not only are a number of your mutating assessments still incorrect – the idea that Democrats, (not to mention Socialists), don’t support government-controlled media is risible, I’ll take that seriously when they get rid of NPR, the NEA and “campaign-finance reform” – but your original assertion that the National Socialists were right-wing is again blown away by your own calculations.</p><p>Furthermore, the National Socialist <a href=\"http://www.hawaii.edu/powerkills/SOD.TAB16A.1.GIF\">annual percentage rate of domestic democide</a> was .138, which is much lower than the AVERAGE annual rate of Communist domestic democides at .769, which not only includes famous killing fields such as the People’s Democratic Republic of Kampuchea and the People’s Republic of China, but also post-WWII Poland and Czechoslovakia.  You’re right, they didn’t share the Nazi disregard for life, they far exceeded it.* But why let small things like historical facts get in the way of your baseless assertions?</p><p>AA is beginning to remind me of the guy who refuses to believe that his girlfriend is having an affair with another man.  “But, she said she loves me,” he argues, with a heartbreakingly serious expression.  “Democrats say they believe in individual freedom, ergo it must be true!  Socialists say they only want to help everyone, therefore it’s got to be true!”  And I’m forced to try to keep from rolling my eyes in disbelief as I tell him – just as I told a too-innocent friend of mine a few months ago – that sometimes people say things that simply are not true.</p><p>*true, the Nazis had a vicious 1.59 percentage rate of foreign democide, but this is not easily compared with the Communist and other Socialist regimes, since those bloodstained governments are usually too busy killing their own people to conquer foreign lands  And even that rate pales before the 4.131 foreign democidal rate achieved by Indonesia for a much longer period of time in the murderous years between 1965 and 1987.<br/></p></div>",
  "content_text": "AA began:\nideologically the Nazi party was more right-wing than left…. The Nazi party did implement socialist programs, though many were gone by the end of the war because they didn’t have the money to keep them going. That doesn’t make them socialist, and the pluralism, egalitarianism, etc. that are central to the democratic party’s platform are hardly mirrored anywhere in the Nazi party’s platform. The opposite, right-wing alternatives are.\nAfter this thesis came under severe pressure, he subsequently wrote:\n…covering them all, we see that there are some specific similiarities with Republicans, some vague similarities to democrats and socialists, and some things that don’t resemble either side of the political spectrum in America today\n.   And:\nI cited all 25 and went through them. Since few of the 25 were even associated with the Democratic party, and those that were, were vague, this whole post baffles me.\nMeanwhile, I had written “Over a third of the 1920 Munich Manifesto precisely matched goals put forth by the American Democratic party, and that percentage more than doubled if one eliminates the historical aspects of the Nazi platform that simply have no application today.”\nThis prompted him to assert:\nThe American Left is not mirrored in the Nazi manifesto, and neither is the Left, even if they both share qualities and aims with it. In fact, many of the aims are consumate with our Constitution. Actually, I think the Democratic party shared fewer than 7 (of the 25)  by itself… Final tallies: Democrats: 7 Socialists: 14 Communists: 14 Republicans: 17 Libertarians: 6\nAt which point, I went through, point by point, and assessed where the various ideologies stood with relation to the National Socialist program.  Which prompted him to reassess again and write:\nDoing percentages here is strange, but if we make these into percentages, Republicans are half Nazi, Communists 2/3, Libertarians less than 1/3, Democrats a little less than 1/2, and Socialists a little more than 1/2. Of course, in reality, none of these ideologies share the nastiness of Nazism, the total disregard for life, the all-encompassing power of the state, etc.\nCare to tell us again how your views aren’t changing, how you’re boldly standing your ground?  The only significant difference now between your latest assessment and mine is that you’re still trying to disguise the Democrats’ Nazi tendencies despite having to double your original count.  I, too, had the Communists most similar and the Republicans at almost 50 percent.  But not only are a number of your mutating assessments still incorrect – the idea that Democrats, (not to mention Socialists), don’t support government-controlled media is risible, I’ll take that seriously when they get rid of NPR, the NEA and “campaign-finance reform” – but your original assertion that the National Socialists were right-wing is again blown away by your own calculations.\nFurthermore, the National Socialist\nannual percentage rate of domestic democide\nwas .138, which is much lower than the AVERAGE annual rate of Communist domestic democides at .769, which not only includes famous killing fields such as the People’s Democratic Republic of Kampuchea and the People’s Republic of China, but also post-WWII Poland and Czechoslovakia.  You’re right, they didn’t share the Nazi disregard for life, they far exceeded it.* But why let small things like historical facts get in the way of your baseless assertions?\nAA is beginning to remind me of the guy who refuses to believe that his girlfriend is having an affair with another man.  “But, she said she loves me,” he argues, with a heartbreakingly serious expression.  “Democrats say they believe in individual freedom, ergo it must be true!  Socialists say they only want to help everyone, therefore it’s got to be true!”  And I’m forced to try to keep from rolling my eyes in disbelief as I tell him – just as I told a too-innocent friend of mine a few months ago – that sometimes people say things that simply are not true.\n*true, the Nazis had a vicious 1.59 percentage rate of foreign democide, but this is not easily compared with the Communist and other Socialist regimes, since those bloodstained governments are usually too busy killing their own people to conquer foreign lands  And even that rate pales before the 4.131 foreign democidal rate achieved by Indonesia for a much longer period of time in the murderous years between 1965 and 1987.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-07T07:37:00+00:00"
}