{
  "url": "https://voxday.net/2004/04/14/shrinking-america-goes-insane/",
  "scraped_at": "2025-12-19T10:47:21.592044",
  "title": "Shrinking America goes insane",
  "date_display": "April 14, 2004",
  "date_iso": "2004-04-14T08:21:00+00:00",
  "date_from_url": "2004-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the London Telegraph: <em>The New World has lost its superiority over the Old – at least in terms of physical stature – and John Komlos has the evidence to prove it. His records, including files on “runaway slaves”, “indentured servants” and “West Point graduates”, bear testament to the American decline.  Prof Komlos’s research over more than 20 years has documented the heights of almost a quarter of a million people from the 1700s to today. The findings, he says, provide the most accurate gauge to date with which to measure the development of the human physique. “Americans have stopped growing while Europeans are increasing in height at quite a pace,” says Prof Komlos, 50, a leading “anthropometric historian” who studies such development.</em></p><p>Meanwhile, a study appearing in Pediatrics magazine states of children on Ritalin: <em>“I don’t think this is necessarily a cause for great alarm in parents. The effect was rather modest, only about a centimeter less over a year.”  Children on medication also grew slightly less than their non-medicated peers. Children on medication alone gained 4.85 centimeters, while those on combination therapy grew 4.25 centimeters. Kids receiving behavioral therapy grew an average of 6.19 centimeters, while a “control” group of children grew 5.68 centimeters.</em></p><p>I’m a pro-legalization libertarian.  I have no intellectual problem with people deciding to spend their lives in search of the eternal buzz.  That being said, ARE THESE PARENTS COMPLETELY FREAKING INSANE OR WHAT?  You don’t inject your child with heroin, you don’t cut them a line or two before sending them off to school and you don’t have them popping speed like vitamins either!  And anti-depressants?  If your kid is depressed about school, then pull him out of the public schools, don’t turn him into a creepily smiling medi-zombie!</p><p>At least this puts the lie to the drug war.  There’s absolutely no case for banning social pharmaceuticals when much stronger drugs are being prescribed by non-medical personnel to four year-olds.  Maybe the realization they risk turning their children into physical midgets as well as mental ones might wake a few parents up, but I’m not optimistic.</p></div>",
  "content_text": "From the London Telegraph:\nThe New World has lost its superiority over the Old – at least in terms of physical stature – and John Komlos has the evidence to prove it. His records, including files on “runaway slaves”, “indentured servants” and “West Point graduates”, bear testament to the American decline.  Prof Komlos’s research over more than 20 years has documented the heights of almost a quarter of a million people from the 1700s to today. The findings, he says, provide the most accurate gauge to date with which to measure the development of the human physique. “Americans have stopped growing while Europeans are increasing in height at quite a pace,” says Prof Komlos, 50, a leading “anthropometric historian” who studies such development.\nMeanwhile, a study appearing in Pediatrics magazine states of children on Ritalin:\n“I don’t think this is necessarily a cause for great alarm in parents. The effect was rather modest, only about a centimeter less over a year.”  Children on medication also grew slightly less than their non-medicated peers. Children on medication alone gained 4.85 centimeters, while those on combination therapy grew 4.25 centimeters. Kids receiving behavioral therapy grew an average of 6.19 centimeters, while a “control” group of children grew 5.68 centimeters.\nI’m a pro-legalization libertarian.  I have no intellectual problem with people deciding to spend their lives in search of the eternal buzz.  That being said, ARE THESE PARENTS COMPLETELY FREAKING INSANE OR WHAT?  You don’t inject your child with heroin, you don’t cut them a line or two before sending them off to school and you don’t have them popping speed like vitamins either!  And anti-depressants?  If your kid is depressed about school, then pull him out of the public schools, don’t turn him into a creepily smiling medi-zombie!\nAt least this puts the lie to the drug war.  There’s absolutely no case for banning social pharmaceuticals when much stronger drugs are being prescribed by non-medical personnel to four year-olds.  Maybe the realization they risk turning their children into physical midgets as well as mental ones might wake a few parents up, but I’m not optimistic.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-14T07:21:00+00:00"
}