{
  "url": "https://voxday.net/2004/04/28/sowell-on-media-scu/",
  "scraped_at": "2025-12-19T10:50:14.927756",
  "title": "Sowell on media scum",
  "date_display": "April 28, 2004",
  "date_iso": "2004-04-28T16:28:00+00:00",
  "date_from_url": "2004-04-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Thomas Sowell <a href=\"http://www.townhall.com/columnists/thomassowell/ts20040428.shtml\">plays the players</a>: Readers sometimes ask why I am seldom seen or heard on television or radio. Mainly it is because I turn down 90 percent of the invitations I get. A recent radio interview shows why.  I was invited on as a guest to talk about my new book, “Affirmative Action Around the World.” But when I phoned in for the interview while the program was on the air, I discovered that another guest was already waiting in ambush, talking about a wholly different topic, minimum wage laws.  When I asked the hostess whether I was on the program to discuss minimum wage laws and she said that I was, I knew that this was the old bait-and-switch game that I had encountered many times over the years….  So I hung up the phone.  Apparently the people who run the program became angry that I would not play along with their game. They phoned me. They phoned the Hoover Institution, where I work, demanding to speak to the director. But the Hoover Institution includes people who know what the media are like, so this ploy didn’t get very far.</p><p>Sowell has the right of it.  I’d blow them off in a heartbeat too.  If nothing else, you have to establish that you are not to be messed with in the future.  I figure radio’s safer for me than television.  There are a few TV types that the urge to Frankenize would be too overwhelming.  I don’t know if I could even formulate complete sentences, as I’d be sitting there silently debating whether a few weeks in jail and the inevitable lawsuit would be worth it.</p><p>Doesn’t turning the other cheek mean that it’s okay to pop them one first?</p></div>",
  "content_text": "Thomas Sowell\nplays the players\n: Readers sometimes ask why I am seldom seen or heard on television or radio. Mainly it is because I turn down 90 percent of the invitations I get. A recent radio interview shows why.  I was invited on as a guest to talk about my new book, “Affirmative Action Around the World.” But when I phoned in for the interview while the program was on the air, I discovered that another guest was already waiting in ambush, talking about a wholly different topic, minimum wage laws.  When I asked the hostess whether I was on the program to discuss minimum wage laws and she said that I was, I knew that this was the old bait-and-switch game that I had encountered many times over the years….  So I hung up the phone.  Apparently the people who run the program became angry that I would not play along with their game. They phoned me. They phoned the Hoover Institution, where I work, demanding to speak to the director. But the Hoover Institution includes people who know what the media are like, so this ploy didn’t get very far.\nSowell has the right of it.  I’d blow them off in a heartbeat too.  If nothing else, you have to establish that you are not to be messed with in the future.  I figure radio’s safer for me than television.  There are a few TV types that the urge to Frankenize would be too overwhelming.  I don’t know if I could even formulate complete sentences, as I’d be sitting there silently debating whether a few weeks in jail and the inevitable lawsuit would be worth it.\nDoesn’t turning the other cheek mean that it’s okay to pop them one first?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-28T15:28:00+00:00"
}