{
  "url": "https://voxday.net/2004/04/16/spinning-surviva/",
  "scraped_at": "2025-12-19T10:47:46.889311",
  "title": "Spinning survival",
  "date_display": "April 16, 2004",
  "date_iso": "2004-04-16T09:36:00+00:00",
  "date_from_url": "2004-04-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Dark Prince of politics, Robert Novak, writes: <em>When George W. Bush faced the nation in a rare prime time press conference, he was responding to a crisis of confidence among his Republican supporters. His recent difficulties in dealing with adversity had planted serious doubts among party leaders. The president’s performance Tuesday night eased their anxiety about an imminent loss of support by his base, but worriers were not completely reassured.  Considering how he has handled the first three months of this election year, President Bush’s press conference was indeed a welcome relief. Republicans had feared another public relations disaster following twin failures in his State of the Union address and his appearance on NBC’s “Meet the Press.” While he dodged a third bullet Tuesday night, Republicans concede Bush was less than triumphant.</em></p><p>Funny, I don’t remember either the State of the Union address or Meet the Press being mentioned as disasters at the time.  I do remember some breathless color commentary on NRO’s Corner, generally more positive than Jonah Goldberg’s laconic review this time around: “I thought Bush was fine though. At first I thought the prepared remarks were a bit too down-tempo. But it became clear his comments were building on each other. I think he set the right tone and said the right things.”</p><p>No doubt we’ll be hearing about how the next one was satisfactory, in contrast to the previous three disasters.  In any case, Churchill he ain’t.</p></div>",
  "content_text": "The Dark Prince of politics, Robert Novak, writes:\nWhen George W. Bush faced the nation in a rare prime time press conference, he was responding to a crisis of confidence among his Republican supporters. His recent difficulties in dealing with adversity had planted serious doubts among party leaders. The president’s performance Tuesday night eased their anxiety about an imminent loss of support by his base, but worriers were not completely reassured.  Considering how he has handled the first three months of this election year, President Bush’s press conference was indeed a welcome relief. Republicans had feared another public relations disaster following twin failures in his State of the Union address and his appearance on NBC’s “Meet the Press.” While he dodged a third bullet Tuesday night, Republicans concede Bush was less than triumphant.\nFunny, I don’t remember either the State of the Union address or Meet the Press being mentioned as disasters at the time.  I do remember some breathless color commentary on NRO’s Corner, generally more positive than Jonah Goldberg’s laconic review this time around: “I thought Bush was fine though. At first I thought the prepared remarks were a bit too down-tempo. But it became clear his comments were building on each other. I think he set the right tone and said the right things.”\nNo doubt we’ll be hearing about how the next one was satisfactory, in contrast to the previous three disasters.  In any case, Churchill he ain’t.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-16T08:36:00+00:00"
}