{
  "url": "https://voxday.net/2004/04/14/still-talking-nonsense/",
  "scraped_at": "2025-12-19T10:47:19.766733",
  "title": "Still talking nonsense",
  "date_display": "April 14, 2004",
  "date_iso": "2004-04-14T07:30:00+00:00",
  "date_from_url": "2004-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From My Way News: <em>Bush said the United States was demanding the arrest or capture of Muqtada al-Sadr, a radical Shiite cleric whose illegal militias have fought U.S. forces in southern Iraq. He said he had instructed the military to use decisive force if necessary to crush the insurgency. He compared insurgents taking hostages in Iraq to radical Islamic fanatics around the world, saying they are “serving the same ideology of murder” of those who blow up trains in Madrid, Spain, bomb buses in Israel – or inflicted the worst attack in American history.</em></p><p>“None of these acts is the work of a religion,” Bush said. “All are the work of a fanatical political ideology.” The legacy that our troops are going to leave behind is a legacy of lasting importance, as far as I’m concerned. It’s a legacy that really is based upon our deep belief that people want to be free and that free societies are peaceful societies.” “Some of the debate really centers around the fact that people don’t believe Iraq can be free; that if you’re Muslim, or perhaps brown-skinned, you can’t be self-governing or free. I’d strongly disagree with that,” the president said.</p><p>Color me unimpressed.  Not only the expected stay-the-course speech, but he even managed to work in a suggestion that criticism is treasonous: “I think that analogy is false.  I also happen to think that analogy sends the wrong message to our troops and sends the wrong message to the enemy.”  Because, of course, the notion of a war by proxy fought against an external nation supplying an internal militia with men and munitions bears no similarity to Vietnam at all.  After all, the one is in the desert, the other is in the jungle.</p><p>And what is that fanatical political ideology?  Is it Communist?  Is it Libertarian?  Let’s see, their primary desire is to establish global Sharia.  That sure sounds religious to me.  Meanwhile, if a Christian shoots a doctor to stop abortion – a profoundly political goal – that’s an example of religious extremism.  Furthermore, history ablsolutely suggests that Muslims cannot be self-governing or free.  Indonesia and Turkey are the only two modern Islamic states.  Both have committed terrible religious-based genocide, and Turkey’s constiution requires the military to act preemptively to prevent the major religious parties from taking control of the country.  In Algeria, the first elections were canceled by the military when the jihadist one-vote one-time party was about to win.</p><p>Finally, I’ve heard numerous Republican commentators getting all over Clinton for wanting to capture or arrest bin Laden.  I find it interesting that Bush is doing exactly the same thing with this Iranian puppet.</p><p>UPDATE: NRO manages to refrain from entirely sounding like Tiger Beat covering its favorite pop star in discussing the speech, but just barely.  Unfortunately, Ramesh Ponnuru, who is normally one of the most reliably sane NROniks, writes: <em>Like Vienam, except that we’ve captured Ho Chi Minh, we’ve taken Hanoi, there’s no draft, and the boat people have mostly come back.</em></p><p>This only goes to show that he missed the analogy.  Let me make it simple.  North Vietnam = Iran.  South Vietnam = Iraq.  Mahdi Militia = Viet Cong.  Tehran = Hanoi.  Baghdad = Saigon.  Saudi Arabia = Soviet Union/China.  And one might want to have a look at what Congress is up to before one speaks too soon on the absence of a future draft.</p></div>",
  "content_text": "From My Way News:\nBush said the United States was demanding the arrest or capture of Muqtada al-Sadr, a radical Shiite cleric whose illegal militias have fought U.S. forces in southern Iraq. He said he had instructed the military to use decisive force if necessary to crush the insurgency. He compared insurgents taking hostages in Iraq to radical Islamic fanatics around the world, saying they are “serving the same ideology of murder” of those who blow up trains in Madrid, Spain, bomb buses in Israel – or inflicted the worst attack in American history.\n“None of these acts is the work of a religion,” Bush said. “All are the work of a fanatical political ideology.” The legacy that our troops are going to leave behind is a legacy of lasting importance, as far as I’m concerned. It’s a legacy that really is based upon our deep belief that people want to be free and that free societies are peaceful societies.” “Some of the debate really centers around the fact that people don’t believe Iraq can be free; that if you’re Muslim, or perhaps brown-skinned, you can’t be self-governing or free. I’d strongly disagree with that,” the president said.\nColor me unimpressed.  Not only the expected stay-the-course speech, but he even managed to work in a suggestion that criticism is treasonous: “I think that analogy is false.  I also happen to think that analogy sends the wrong message to our troops and sends the wrong message to the enemy.”  Because, of course, the notion of a war by proxy fought against an external nation supplying an internal militia with men and munitions bears no similarity to Vietnam at all.  After all, the one is in the desert, the other is in the jungle.\nAnd what is that fanatical political ideology?  Is it Communist?  Is it Libertarian?  Let’s see, their primary desire is to establish global Sharia.  That sure sounds religious to me.  Meanwhile, if a Christian shoots a doctor to stop abortion – a profoundly political goal – that’s an example of religious extremism.  Furthermore, history ablsolutely suggests that Muslims cannot be self-governing or free.  Indonesia and Turkey are the only two modern Islamic states.  Both have committed terrible religious-based genocide, and Turkey’s constiution requires the military to act preemptively to prevent the major religious parties from taking control of the country.  In Algeria, the first elections were canceled by the military when the jihadist one-vote one-time party was about to win.\nFinally, I’ve heard numerous Republican commentators getting all over Clinton for wanting to capture or arrest bin Laden.  I find it interesting that Bush is doing exactly the same thing with this Iranian puppet.\nUPDATE: NRO manages to refrain from entirely sounding like Tiger Beat covering its favorite pop star in discussing the speech, but just barely.  Unfortunately, Ramesh Ponnuru, who is normally one of the most reliably sane NROniks, writes:\nLike Vienam, except that we’ve captured Ho Chi Minh, we’ve taken Hanoi, there’s no draft, and the boat people have mostly come back.\nThis only goes to show that he missed the analogy.  Let me make it simple.  North Vietnam = Iran.  South Vietnam = Iraq.  Mahdi Militia = Viet Cong.  Tehran = Hanoi.  Baghdad = Saigon.  Saudi Arabia = Soviet Union/China.  And one might want to have a look at what Congress is up to before one speaks too soon on the absence of a future draft.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-14T06:30:00+00:00"
}