{
  "url": "https://voxday.net/2004/04/16/super-secret-strategy/",
  "scraped_at": "2025-12-19T10:47:52.383162",
  "title": "The super-secret strategy",
  "date_display": "April 16, 2004",
  "date_iso": "2004-04-16T15:43:00+00:00",
  "date_from_url": "2004-04-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Washington Times: <em>The number of illegal aliens being apprehended on the southwestern border <a href=\"http://www.washingtontimes.com/national/20040416-120211-3587r.htm\">has jumped 25 percent</a> in the first three months of 2004 compared with last year, and some are blaming President Bush’s immigration proposal in January for enticing immigrants across the border.  “It doesn’t take a rocket scientist to tell you the president’s speech was the catalyst for lots of folks to make their way north and try to get into this country in order to get what they accurately believe to be amnesty,” said Rep. Tom Tancredo, Colorado Republican and chairman of the House Immigration Reform Caucus.  The increase in apprehensions was driven by a spike within the two Arizona sectors, Yuma and Tucson, which saw increases of 60 percent and 51 percent, respectively.</em></p><p>Since our Republican friends are chock-full of secret Bush strategies, maybe this is his secret libertarian plan to destroy the Welfare State by flooding it with folks on the dole.  This is in obvious cooperation with secret libertarian Alan Greenspan’s plan to bring back the gold standard by destroying the debt-backed dollar.  The plan, it’s working, it’s working!  Mwuh-ha-ha-ha-haaaa!</p></div>",
  "content_text": "From the Washington Times:\nThe number of illegal aliens being apprehended on the southwestern border\nhas jumped 25 percent\nin the first three months of 2004 compared with last year, and some are blaming President Bush’s immigration proposal in January for enticing immigrants across the border.  “It doesn’t take a rocket scientist to tell you the president’s speech was the catalyst for lots of folks to make their way north and try to get into this country in order to get what they accurately believe to be amnesty,” said Rep. Tom Tancredo, Colorado Republican and chairman of the House Immigration Reform Caucus.  The increase in apprehensions was driven by a spike within the two Arizona sectors, Yuma and Tucson, which saw increases of 60 percent and 51 percent, respectively.\nSince our Republican friends are chock-full of secret Bush strategies, maybe this is his secret libertarian plan to destroy the Welfare State by flooding it with folks on the dole.  This is in obvious cooperation with secret libertarian Alan Greenspan’s plan to bring back the gold standard by destroying the debt-backed dollar.  The plan, it’s working, it’s working!  Mwuh-ha-ha-ha-haaaa!",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-16T14:43:00+00:00"
}