{
  "url": "https://voxday.net/2004/04/20/thats-one-down-two-to-go/",
  "scraped_at": "2025-12-19T10:48:43.013810",
  "title": "That’s one down, two to go",
  "date_display": "April 20, 2004",
  "date_iso": "2004-04-20T11:54:00+00:00",
  "date_from_url": "2004-04-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Independent: <em>Shell was embroiled yesterday in <a href=\"http://news.independent.co.uk/business/news/story.jsp?story=513226\">Britain’s biggest corporate scandal</a> for almost 20 years after it admitted a three-year plan to deceive its shareholders.  The City reacted with astonishment after the crisis-stricken multinational released details from an internal report that exposed how the company had deliberately overstated its oil and gas reserves for several years.  Judy Boynton, the finance chief, became the third boardroom casualty of the furore that followed the shock 20 per cent downgrade in reserves three months ago. The Shell affair, the most damaging scandal in the UK since the Guinness debacle 18 years ago, has already led to the departure of the chairman, Sir Philip Watts, and the head of exploration and production, Walter van de Vijver.</em></p><p>Take that, White Buffalo.  A fig for your improved corporate behavior and governance.  And yes, <a href=\"http://finance.yahoo.com/q?s=SC&amp;d=t\">it counts</a>.</p></div>",
  "content_text": "From the Independent:\nShell was embroiled yesterday in\nBritain’s biggest corporate scandal\nfor almost 20 years after it admitted a three-year plan to deceive its shareholders.  The City reacted with astonishment after the crisis-stricken multinational released details from an internal report that exposed how the company had deliberately overstated its oil and gas reserves for several years.  Judy Boynton, the finance chief, became the third boardroom casualty of the furore that followed the shock 20 per cent downgrade in reserves three months ago. The Shell affair, the most damaging scandal in the UK since the Guinness debacle 18 years ago, has already led to the departure of the chairman, Sir Philip Watts, and the head of exploration and production, Walter van de Vijver.\nTake that, White Buffalo.  A fig for your improved corporate behavior and governance.  And yes,\nit counts\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-20T10:54:00+00:00"
}