{
  "url": "https://voxday.net/2004/04/18/that-sounds-familiar/",
  "scraped_at": "2025-12-19T10:48:14.346030",
  "title": "That sounds familiar",
  "date_display": "April 18, 2004",
  "date_iso": "2004-04-18T11:41:00+00:00",
  "date_from_url": "2004-04-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From the Washington Times: <em>Two of Fox News Channel’s most ubiquitous military analysts, retired Air Force Lt. Gen. Thomas G. McInerney and retired Army Maj. Gen. Paul E. Vallely, are out with a new book on how to win the global war against al Qaeda and other terror groups.  In “Endgame: The Blueprint for Victory in the War on Terror,” the two Vietnam combat veterans call for ratcheting up the global conflict by taking on Iran, North Korea and Syria — now. </em></p><p>It has to be Saudi Arabia, not North Korea, and the enemy needs to be identified specifically in order to rally the nation, but I note that I am not alone in failing to be terribly sanguine about the current conduct of the war on method.  And for those Bush defenders who argue that this has really been the secret plan all along, well, any commander-in-chief whose strategy is escalation by inevitability should be removed for incompetence.  Not to mention violating the Constitution, the oath of office and the right of the American people to decide if and when they will go to war, and with whom.  I don’t believe George Bush lied the nation into Iraq – the many violations of the 1991 peace treaty were sufficient justification to invade and unseat Hussein long before Bush was even elected – but at this point it remains possible that he is lying the nation into a far more serious conflict.</p><p>The problem that libertarians and conservatives have in looking at this conflict is that both tend to look at Iran, Iraq and the other Arab nations as being distinct countries equivalent to the USA, UK and France.  They aren’t, they are more properly viewed like Texas, Oklahoma and Arkansas in the loosely federated Islamic nation.  On the libertarian side, for all that war is the health of the state – and the present administration is certainly attempting to use its war-on-method to ratchet up central federal power – war has been declared on the USA by the Dar-al-Islam for the last 20+ years.  That is the well-established fact, and it must be recognized that the war does not persist because of the noxious global American troop presence, but because the Dar-al-Islam seeks global sharia.  A global American troop presence did not cause Northern Africa, Egypt, Spain, Hungary, Romania, Southern Italy and parts of Austria to be overrun 1200 years ago and it is not causing the global jihad now.  As was the case in 1940, the real war lies below the Phony one.</p><p>Conservatives, on the other hand, must recognize that the Bush administration is as power-hungry as its predecessor, and if it is to be trusted to fight this war, it must significantly change its ways.  One reason that the present administration pretends to be so focused on terror – even as it protects Arafat and warns Israel about killing terrorist leaders – is that it can eliminate the rights and liberties of its citizens, whereas these things aren’t necessary in fighting a proper, Constitutional war against the jihad.  It is wrong, both historically and morally, to give the administration a pass simply because there is a war to be fought.  FDR and LBJ are anathema to conservatives for the many evils they committed during WWII and Vietnam, no more should George Bush or any Republican be excused for similar unconstitutional excesses under the aegis of war-fighting.</p><p>The lessons of history are clear.  If a free people do not go willingly and knowingly into battle, they will lose.  Attempts to manipulate them are not only wrong, they are likely to lead to failure.</p></div>",
  "content_text": "From the Washington Times:\nTwo of Fox News Channel’s most ubiquitous military analysts, retired Air Force Lt. Gen. Thomas G. McInerney and retired Army Maj. Gen. Paul E. Vallely, are out with a new book on how to win the global war against al Qaeda and other terror groups.  In “Endgame: The Blueprint for Victory in the War on Terror,” the two Vietnam combat veterans call for ratcheting up the global conflict by taking on Iran, North Korea and Syria — now.\nIt has to be Saudi Arabia, not North Korea, and the enemy needs to be identified specifically in order to rally the nation, but I note that I am not alone in failing to be terribly sanguine about the current conduct of the war on method.  And for those Bush defenders who argue that this has really been the secret plan all along, well, any commander-in-chief whose strategy is escalation by inevitability should be removed for incompetence.  Not to mention violating the Constitution, the oath of office and the right of the American people to decide if and when they will go to war, and with whom.  I don’t believe George Bush lied the nation into Iraq – the many violations of the 1991 peace treaty were sufficient justification to invade and unseat Hussein long before Bush was even elected – but at this point it remains possible that he is lying the nation into a far more serious conflict.\nThe problem that libertarians and conservatives have in looking at this conflict is that both tend to look at Iran, Iraq and the other Arab nations as being distinct countries equivalent to the USA, UK and France.  They aren’t, they are more properly viewed like Texas, Oklahoma and Arkansas in the loosely federated Islamic nation.  On the libertarian side, for all that war is the health of the state – and the present administration is certainly attempting to use its war-on-method to ratchet up central federal power – war has been declared on the USA by the Dar-al-Islam for the last 20+ years.  That is the well-established fact, and it must be recognized that the war does not persist because of the noxious global American troop presence, but because the Dar-al-Islam seeks global sharia.  A global American troop presence did not cause Northern Africa, Egypt, Spain, Hungary, Romania, Southern Italy and parts of Austria to be overrun 1200 years ago and it is not causing the global jihad now.  As was the case in 1940, the real war lies below the Phony one.\nConservatives, on the other hand, must recognize that the Bush administration is as power-hungry as its predecessor, and if it is to be trusted to fight this war, it must significantly change its ways.  One reason that the present administration pretends to be so focused on terror – even as it protects Arafat and warns Israel about killing terrorist leaders – is that it can eliminate the rights and liberties of its citizens, whereas these things aren’t necessary in fighting a proper, Constitutional war against the jihad.  It is wrong, both historically and morally, to give the administration a pass simply because there is a war to be fought.  FDR and LBJ are anathema to conservatives for the many evils they committed during WWII and Vietnam, no more should George Bush or any Republican be excused for similar unconstitutional excesses under the aegis of war-fighting.\nThe lessons of history are clear.  If a free people do not go willingly and knowingly into battle, they will lose.  Attempts to manipulate them are not only wrong, they are likely to lead to failure.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-18T10:41:00+00:00"
}