{
  "url": "https://voxday.net/2004/04/19/thinking-differently/",
  "scraped_at": "2025-12-19T10:48:19.854212",
  "title": "Thinking differently",
  "date_display": "April 19, 2004",
  "date_iso": "2004-04-19T08:33:00+00:00",
  "date_from_url": "2004-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Pat Buchanan thinks about an unthinkable that is a little less unthinkable than mine: <em>The president calls failure in Iraq unthinkable. But the alternative may be an open-ended war the American people never signed on to, and, if present polls are any indication, may not be willing to support indefinitely. Iraq is not Vietnam, but, for President Bush, there are troubling similarities to other unhappy moments in American history. Truman’s presidency was broken by the “no-win war” in Korea. LBJ’s presidency was broken by his failure to “win or get out” of Vietnam.</em></p><p>What does a president do if he believes a war is just and necessary, but the people come to believe it is the wrong war, in the wrong place, at the wrong time, with the wrong enemy?  We are not at that point yet, but we are getting there. And President Bush had best begin to think the unthinkable.</p><p>Bringing the troops out of Iraq and taking a step backward after several steps forward in the war against the global jihad isn’t really all that unthinkable in my book.  The unthinkable that concerns me far more is how elements within the federal government are using the conflict to war on American liberties and take a few quiet steps forward towards selling out national sovereignty to the United Nations.  The problem is that whether we fight the war that’s been declared against us or not, the sell-out continues apace.  President Clinton turned over the rivers and parks, President Bush is in the process of turning over the seas and possibly the Internet, and neither of these things required a war to excuse them.</p><p>You may see this as paranoia; I don’t care.  The head-in-the-sand brigade has already been proven wrong about the EU (“it’s just a trade zone, it’ll never be a political entity”) and will be proven wrong over time about the UN as well.  Whatever we do with regards to Iraq, turning an oil-producing country over to the United Nations in any way should not be one of the options.  The UN is desperate to achieve an independent source of revenue; once it succeeds in that, it will begin asserting its self-proclaimed right to govern.</p><p>This isn’t rocket science, people, just an ability to think in terms of decades instead of election cycles.  When power is centralized, it attracts those who wish to rule over others like a bitch in heat attracts male dogs.</p></div>",
  "content_text": "Pat Buchanan thinks about an unthinkable that is a little less unthinkable than mine:\nThe president calls failure in Iraq unthinkable. But the alternative may be an open-ended war the American people never signed on to, and, if present polls are any indication, may not be willing to support indefinitely. Iraq is not Vietnam, but, for President Bush, there are troubling similarities to other unhappy moments in American history. Truman’s presidency was broken by the “no-win war” in Korea. LBJ’s presidency was broken by his failure to “win or get out” of Vietnam.\nWhat does a president do if he believes a war is just and necessary, but the people come to believe it is the wrong war, in the wrong place, at the wrong time, with the wrong enemy?  We are not at that point yet, but we are getting there. And President Bush had best begin to think the unthinkable.\nBringing the troops out of Iraq and taking a step backward after several steps forward in the war against the global jihad isn’t really all that unthinkable in my book.  The unthinkable that concerns me far more is how elements within the federal government are using the conflict to war on American liberties and take a few quiet steps forward towards selling out national sovereignty to the United Nations.  The problem is that whether we fight the war that’s been declared against us or not, the sell-out continues apace.  President Clinton turned over the rivers and parks, President Bush is in the process of turning over the seas and possibly the Internet, and neither of these things required a war to excuse them.\nYou may see this as paranoia; I don’t care.  The head-in-the-sand brigade has already been proven wrong about the EU (“it’s just a trade zone, it’ll never be a political entity”) and will be proven wrong over time about the UN as well.  Whatever we do with regards to Iraq, turning an oil-producing country over to the United Nations in any way should not be one of the options.  The UN is desperate to achieve an independent source of revenue; once it succeeds in that, it will begin asserting its self-proclaimed right to govern.\nThis isn’t rocket science, people, just an ability to think in terms of decades instead of election cycles.  When power is centralized, it attracts those who wish to rule over others like a bitch in heat attracts male dogs.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-19T07:33:00+00:00"
}