{
  "url": "https://voxday.net/2004/04/14/thus-spake-islamic-exper/",
  "scraped_at": "2025-12-19T10:47:23.408496",
  "title": "Thus spake the Islamic expert",
  "date_display": "April 14, 2004",
  "date_iso": "2004-04-14T08:37:00+00:00",
  "date_from_url": "2004-04-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Daniel Pipes writes: <em>For Muslims, rule by non-Muslims is an abomination, a blasphemous inversion of God’s dispensation. This explains why one finds a consistently strong resistance to rule by non-Muslims through 14 centuries of Muslim history. Europeans recognized this resistance and in their post-crusades global expansion stayed largely away from majority-Muslim territories….  This history suggests that the coalition’s grand aspirations for Iraq will not succeed. However constructive its intentions to build democracy, the coalition cannot win the confidence of Muslim Iraq nor win acceptance as its overlord….. I therefore counsel the occupying forces quickly to leave Iraqi cities and then, when feasible, to leave Iraq as a whole. </em></p><p>In other words, the administration is not only ignoring sound military strategy, but the history of past occupations in the region as well.  If the war on global jihad is not on – and from the President’s speech, it’s clear that he has no stomach for either declaring it or waging it – we must bring the troops home now.</p></div>",
  "content_text": "Daniel Pipes writes:\nFor Muslims, rule by non-Muslims is an abomination, a blasphemous inversion of God’s dispensation. This explains why one finds a consistently strong resistance to rule by non-Muslims through 14 centuries of Muslim history. Europeans recognized this resistance and in their post-crusades global expansion stayed largely away from majority-Muslim territories….  This history suggests that the coalition’s grand aspirations for Iraq will not succeed. However constructive its intentions to build democracy, the coalition cannot win the confidence of Muslim Iraq nor win acceptance as its overlord….. I therefore counsel the occupying forces quickly to leave Iraqi cities and then, when feasible, to leave Iraq as a whole.\nIn other words, the administration is not only ignoring sound military strategy, but the history of past occupations in the region as well.  If the war on global jihad is not on – and from the President’s speech, it’s clear that he has no stomach for either declaring it or waging it – we must bring the troops home now.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-14T07:37:00+00:00"
}