{
  "url": "https://voxday.net/2004/04/10/time-to-pay-attention/",
  "scraped_at": "2025-12-13T15:59:18.561460",
  "title": "Time to pay attention",
  "date_display": "April 10, 2004",
  "date_iso": "2004-04-10T08:19:00+00:00",
  "date_from_url": "2004-04-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From <a href=\"http://205.232.90.194/editorials/kern/current.html\">SKI</a>: <em>The SKI indices have the gold stocks by the “pants.” A drop on Monday of 1% (the gold mutual fund USERX falling below 8.44) will cause a sell. A drop of 5% by Tuesday’s close will generate a terribly bearish triple sell. But the buy signal remains intact and USERX (the gold mutual fund) closed on Friday one penny over the critical point of 8.50! Furthermore, gold stocks need to rise 5% next week to avoid a sell signal. I expect the rise, remaining long from 8.36, but am ready to sell if so required…. In the bigger picture, gold stocks have declined and gone sideways for more than 4 months, as I sold near both the December and January highs. The next few days will end the critical period and establish the trend for months if not years to come (looks like years to me).</em></p><p>I haven’t previously followed SKI’s gold stock system, but I’ve been keeping an eye on it recently as a possible means of distinguishing between gold bulls like Adam Hamilton, who are expecting massive inflation in the coming years, and bears such as Robert Prechter, who is expecting deflation based on the Elliott Wave patterns.  I tend to fall in with Hamilton, as the Elliott Wave patterns do not account for inflation, an omission that, in my opinion, has wrongly led Prechter to predict every market for everything to go down.  He’s surely right about some of them, but it’s hard to credit ALL of them going in the same direction.</p><p>In any event, it can’t hurt to keep an eye on <a href=\"http://finance.yahoo.com/q/bc?s=USERX&amp;t=3m&amp;c=\">USERX</a> at 8.51, which means that anyone in gold will be concerned about a drop to 8.08 by Tuesday’s close.  Then again, to mix a few systems, if not metaphors, it’s interesting to see that as near as I can tell, the Elliott Waves for USERX look rather like a wave 5 of 3 up is about to take off, thus offering some support for SKI’s notion that USERX will rise to 8.93 by week’s end to avoid sending any clear signals.</p><p>If the gold stocks movement was echoed in bullion, this would have some interesting implicatons for Hamilton’s <a href=\"http://205.232.90.194/editorials/hamilton/hamilton040804.html\">R/DMA system</a>.  A five percent rise by Friday would take us to a reasonable sell at $442 with an R/DMA of 1.132.  A five percent drop by Tuesday would indicate a definite buy at $399 with an R/DMA of 1.025.  That would take guts, and as usual, the more you know, the more you’re sure you don’t know anything.  Since the last R/DMA signal was the 1.023 on March 3rd, I think the rise is more likely, probably to around $450 and a definite trader’s sell of 1.152.</p></div>",
  "content_text": "From\nSKI\n:\nThe SKI indices have the gold stocks by the “pants.” A drop on Monday of 1% (the gold mutual fund USERX falling below 8.44) will cause a sell. A drop of 5% by Tuesday’s close will generate a terribly bearish triple sell. But the buy signal remains intact and USERX (the gold mutual fund) closed on Friday one penny over the critical point of 8.50! Furthermore, gold stocks need to rise 5% next week to avoid a sell signal. I expect the rise, remaining long from 8.36, but am ready to sell if so required…. In the bigger picture, gold stocks have declined and gone sideways for more than 4 months, as I sold near both the December and January highs. The next few days will end the critical period and establish the trend for months if not years to come (looks like years to me).\nI haven’t previously followed SKI’s gold stock system, but I’ve been keeping an eye on it recently as a possible means of distinguishing between gold bulls like Adam Hamilton, who are expecting massive inflation in the coming years, and bears such as Robert Prechter, who is expecting deflation based on the Elliott Wave patterns.  I tend to fall in with Hamilton, as the Elliott Wave patterns do not account for inflation, an omission that, in my opinion, has wrongly led Prechter to predict every market for everything to go down.  He’s surely right about some of them, but it’s hard to credit ALL of them going in the same direction.\nIn any event, it can’t hurt to keep an eye on\nUSERX\nat 8.51, which means that anyone in gold will be concerned about a drop to 8.08 by Tuesday’s close.  Then again, to mix a few systems, if not metaphors, it’s interesting to see that as near as I can tell, the Elliott Waves for USERX look rather like a wave 5 of 3 up is about to take off, thus offering some support for SKI’s notion that USERX will rise to 8.93 by week’s end to avoid sending any clear signals.\nIf the gold stocks movement was echoed in bullion, this would have some interesting implicatons for Hamilton’s\nR/DMA system\n.  A five percent rise by Friday would take us to a reasonable sell at $442 with an R/DMA of 1.132.  A five percent drop by Tuesday would indicate a definite buy at $399 with an R/DMA of 1.025.  That would take guts, and as usual, the more you know, the more you’re sure you don’t know anything.  Since the last R/DMA signal was the 1.023 on March 3rd, I think the rise is more likely, probably to around $450 and a definite trader’s sell of 1.152.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-10T07:19:00+00:00"
}