{
  "url": "https://voxday.net/2004/04/06/walking-planks/",
  "scraped_at": "2025-12-13T15:58:35.063898",
  "title": "Walking the planks",
  "date_display": "April 6, 2004",
  "date_iso": "2004-04-06T14:49:00+00:00",
  "date_from_url": "2004-04-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have analyzed the foundational platform of the historical National Socialist German Workers Party and characterize how each of the following four political ideologies can be compared to it: Communist, Democratic, Republican and Libertarian.  I have assigned a value from zero to four to each of the 25 points, depending on how closely the position of the ideology parallels that of the Nazi program.  In cases where a point had multiple aspects, I simply attempted to look at each aspect separately, then add the total.</p><p>This analysis does not attempt to account for motivations.  In a Senate of 100 senators, each may have a different reason for voting for a specific bill, but in determining a senator’s ideological rating, one does not speculate as to why he voted for the bill, all that matters is his vote.  Specific actions always take precedence over general pretensions.</p><p><em>1. We demand the union of all Germans, on the basis of the right of the self-determination of peoples, to form a Great Germany.</em></p><p>The key words here are forced union and right of self-determination of PEOPLES, plural, as well as a nationalist concept.  Communists support forced union and collective group identification, but not self-determination.  Democrats support forced union, collective group identification and self-determination.  Republicans support forced union and self-determination, but not collective group identification.  There is, however, a nationalist flavor that modern Democrats and Communists abjure and Republicans tend to favor.  Libertarians support none of the above, favoring free association.</p><p>3 (3) Democrats<br> <br>3 (3) Republicans<br> <br>2 (2) Communists<br> <br>0 (0) Libertarians</br></br></br></br></br></br></p><p><em>2. We demand equality of rights for the German people in its dealings with other nations, and abolition of the Peace Treaties of Versailles and St. Germain.</em></p><p>The second half is irrelevant to all four ideologies, but there is both a notion of collective rights as well as same strong sense of involuntary national identity mentioned above.</p><p>2 (5) Democrats<br> <br>2 (4) Communists<br> <br>1 (4) Republicans<br> <br>0 (0) Libertarians</br></br></br></br></br></br></p><p><em>3. We demand land and territoryfor the nourishment of our people and for settling our surplus population.</em></p><p>Democrats and Republicans alike support military intervention on behalf of national economic self-interest, Republicans a little more strongly.  Communists favor world revolution by conquest if necessary; the rationale is different but the policy is the same.  Libertarians do not support this.</p><p>3 (8) Democrats<br> <br>4 (8) Communists<br> <br>4 (8) Republicans<br> <br>0 (0) Libertarians</br></br></br></br></br></br></p><p><em>4. None but members of the nation may be citizens of the State. None but those of German blood, whatever their creed, may be members of the nation. No Jew, therefore, may be a member of the nation.</em></p><p>Neither Democrats nor Republicans seek any serious limitations on citizenship or immigration although a branch of the Republicans would support some.  Both parties strongly support Israel and the Jewish people.  Communist nations are viciously opposed to Israel and have historically targeted Jews, though without the single-minded ferocity of the Nazis.  Communists have never suggested limiting citizenship.  There is a collective race consciousness here that is shared by Democrats.</p><p>2 (10) Communists<br> <br>1 (09) Democrats<br> <br>1 (09) Republicans<br> <br>0 (00) Libertarians</br></br></br></br></br></br></p><p><em>5. Anyone who is not a citizen of the State may live in Germany only as a guest and must be regarded as being subject to the Alien Laws.</em></p><p>This is pretty standard for both major American ideologies, although I must recognize the love Democrats harbor for illegal immigrants.  Libertarians tend to favor open door policies, although not as strongly as other philosophical tenets.</p><p>4 (14) Communists<br> <br>4 (13) Republicans<br> <br>3 (12) Democrats<br> <br>1 (01) Libertarians</br></br></br></br></br></br></p><p><em>6. The right of voting on the leadership and laws of the State is to be enjoyed by the citizens of the State alone. We demand, therefore, that all official positions, of whatever kind, whether in the Reich, the provinces, or the small communities, shall be held by citizens of the State alone. We oppose the corrupt parliamentary custom of filling posts merely with a view to party considerations, and without reference to character or ability.</em></p><p>I don’t know of any ideology that seriously argues for the right of non-citizens to vote; this is irrelevant for comparative purposes.  Communists, Republicans and Democrats all strongly favor filling posts with views to party considerations, albeit the American parties do so far less stringently than do the one-party Communists, nor do they apply them to the mass of the bureacracy.  Libertarians would fire everyone and abolish the posts, regardless of party.</p><p>4 (18) Communists<br> <br>2 (15) Republicans<br> <br>2 (14) Democrats<br> <br>0 (01) Libertarians</br></br></br></br></br></br></p><p><em>7. We demand that the State shall make it its first duty to promote the industry and livelihood of the citizens of the State. If it is not possible to nourish the entire population of the State, foreign nationals must be excluded from the Reich.</em></p><p>Democrats strongly support both government management of the economy as well as individual welfare, but not corporate welfare.  Republicans strongly support government management of the economy and corporate welfare, but not individual welfare.  One could make a deeply cynical comment about the Communist position here, but we’ll resist the temptation.  The latter half is massively irrelevant to the United States of Adiposity.</p><p>4 (22) Communists<br> <br>3 (18) Republicans<br> <br>3 (17) Democrats<br> <br>0 (01) Libertarians</br></br></br></br></br></br></p><p><em>8. All further non-German immigration must be prevented. We demand that all non-Germans who entered Germany subsequently to August 2, 1914, shall be required forthwith to depart from the Reich.</em></p><p>Neither Republicans nor Democrats support racial-based immigration laws, but Democrats are more strongly against them.  However, there is again the collective race consciousness shared by modern Democrats.  The strong government control of immigration is shared by Communists, but not the racial flavor.</p><p>3 (25) Communists<br> <br>1 (19) Republicans<br> <br>1 (18) Democrats<br> <br>0 (01) Libertarians</br></br></br></br></br></br></p><p><em>9. All citizens of the State shall possess equal rights and duties.</em></p><p>All four strains believe in equal rights, but it is the duty towards the state aspect that is the salient point here, indicating that the State’s rights supersede those of the individuals living in it.  Democrats believe this more strongly than Republicans, who are often accused of being indifferent to their social responsibilities.  Duties to the State is, of course, central to Communist ideology.</p><p>4 (29) Communists<br> <br>4 (22) Democrats<br> <br>2 (21) Republicans<br> <br>2 (03) Libertarians</br></br></br></br></br></br></p><p><em>10. It must be the first duty of every citizen of the State to perform mental or physical work. The activities of the individual must not clash with the interests of the whole, but must proceed within the framework of the community and must be for the general good.</em></p><p>Again, the State and the collective are elevated over the individual.  However, citizens are required to work, which Democrats do not support despite the Clinton-era reforms.</p><p>4 (33) Communists<br> <br>3 (25) Democrats<br> <br>1 (22) Republicans<br> <br>0 (03) Libertarians</br></br></br></br></br></br></p><p><em>11. Abolition of incomes unearned by work. BREAKING OF THE THRALDOM OF INTEREST.</em></p><p>Democrats regularly decry those who “unfairly” prosper, supposedly at the expense of others.  They have not yet begun to propose legislation to abolish such incomes, however.  Republicans and Libertarians alike oppose this vehemently, while Communists agree completely.</p><p>4 (37) Communists<br> <br>2 (27) Democrats<br> <br>0 (22) Republicans<br> <br/>0 (03) Libertarians</br></br></br></br></br></p><p><em>12. In view of the enormous sacrifice of life and property demanded of a nation by every war, personal enrichment through war must be regarded as a crime against the nation. We demand, therefore, the total confiscation of all war profits.</em></p><p>Communists don’t support profit of any kind.  Democrats don’t like “excess” profits of any kind, and also call regularly for legislation against arms dealers.  Republicans and Libertarians are both generally opposed to confiscation of profit.</p><p>4 (41) Communists<br/> <br/>2 (29) Democrats<br/> <br/>0 (22) Republicans<br/> <br/>0 (03) Libertarians</p><p><em>13. We demand the nationalization of all businesses which have been amalgamated.</em></p><p>Democrats do not support nationalization of all businesses, only some.  Republicans continue to support existing national monopolies such as the Post Office.  Communists wish to nationalize everything, whereas Libertarians would privatize the Marines.</p><p>4 (45) Communists<br/> <br/>2 (31) Democrats<br/> <br/>1 (23) Republicans<br/> <br/>0 (03) Libertarians<br/> <br/><em><br/> <br/>14. We demand that there shall be profit sharing in the great industries.</em></p><p>Democrats support the minimum wage, require steep social security and health care contributions from the employer and are favorable towards forced distribution of private property.  Republicans likewise, but less enthusiastically.  Communists want to share out not only the profit, but the entire industry.  Libertarians, as usual, oppose completely.</p><p>4 (49) Communists<br/> <br/>4 (35) Democrats<br/> <br/>2 (25) Republicans<br/> <br/>0 (03) Libertarians</p><p><em>15. We demand a generous development of provision for old age.</em></p><p>Democrats and Republicans alike support Social Security, but it was a Democratic entitlement passed over Republican opposition.  Furthermore, it is Democrats who oppose Republican attempts to modify it in any way and are constantly telling the elderly that Republicans want to slash their benefits.  Communists support, Libertarians oppose.</p><p>4 (53) Communists<br/> <br/>4 (39) Democrats<br/> <br/>2 (27) Republicans<br/> <br/>0 (03) Libertarians</p><p><em>16. We demand the creation and maintenance of a healthy middle class, immediate communalization of the large department stores and their lease at a low rate to small traders, and that the most careful consideration shall be shown to all small traders in purveying to the State, the provinces, or smaller communities.</em></p><p>The notion that the state is even capable of creating and maintaining a social class is a fundamentally socialist notion on several levels.  This also smacks not only of the Keynesianism of both American parties, but also of the Democratic hatred for Walmart.  Communists believe that the bourgeiosie should be executed; they have as little in common with the Nazi concept here as do the Libertarians.</p><p>0 (53) Communists<br/> <br/>3 (42) Democrats<br/> <br/>2 (29) Republicans<br/> <br/>0 (03) Libertarians</p><p><em>17. We demand a land reform suitable to our national requirements, the passing of a law for the confiscation without compensation of land for communal purposes, the abolition of interest on land mortgages, and prohibition of all speculation in land.</em></p><p>Republicans,  Democrats and Communists alike support the confiscation of land for communal purposes, although their level of enthusiasm varies.  Only Communists would abolish interest – although Greenspan appears to be trying – and Democrats are far more supportive of zoning and government management of land than are Republicans.</p><p>4 (57) Communists<br/> <br/>2 (44) Democrats<br/> <br/>1 (30) Republicans<br/> <br/>0 (03) Libertarians</p><p><em>18. We demand ruthless war upon all those whose activities are injurious to the common interest. Sordid criminals against the nation, usurers, profiteers, etc., must be punished with death, whatever their creed or race.</em></p><p>Far too extreme for any American philosophy, although Democrats buy into the notion of a common interest that supercedes individual rights.  Republicans favor the death penalty, Democrats largely don’t.  Communists support, Libertarians oppose.</p><p>4 (61) Communists<br/> <br/>2 (46) Democrats<br/> <br/>1 (31) Republicans<br/> <br/>0 (03) Libertarians<br/> <br/><em><br/> <br/>19. We demand that the Roman law, which serves the materialistic world order, shall be replaced by a German common law.</em></p><p>The Libertarians score some Nazi points!  Both Republicans and Democrats favor admiralty law, which is the equivalent of Roman law here, and have actively worked to remove the English common law from the US legal system.  The Communists are violently opposed to common law, while the Libertarians support it strongly.</p><p>0 (61) Communists<br/> <br/>0 (46) Democrats<br/> <br/>0 (31) Republicans<br/> <br/>4 (07) Libertarians</p><p><em>20. With the aim of opening to every capable and industrious German the possibility of higher education and consequent advancement to leading positions, the State must consider a thorough reconstruction of our national system of education. The curriculum of all educational establishments must be brought into line with the requirements of practical life. Directly the mind begins to develop the schools must aim at teaching the pupil to understand the idea of the State. We demand the education of specially gifted children of poor parents, whatever their class or occupation, at the expense of the State. </em></p><p>Ah, yes, the public schools.  Both Republicans and Democrats are actually more extreme than the Nazi platform, which only called for the education of elite children at state expense.  Communists support, Libertarians oppose.</p><p>4 (65) Communists<br/> <br/>4 (50) Democrats<br/> <br/>4 (35) Republicans<br/> <br/>0 (07) Libertarians</p><p><em>21. The State must apply itself to raising the standard of health in the nation by protecting mothers and infants, prohibiting child labor, and increasing bodily efficiency by legally obligatory gymnastics and sports, and by extensive support of clubs engaged in the physical training of the young.</em></p><p>Democrats believe that the State is responsible for individual health, Republicans have lately begun to embrace this concept with the Medicare entitlement.  Democrats are enthusiastic about government youth programs, while only the Communists make sports obligatory.</p><p>4 (69) Communists<br/> <br/>3 (53) Democrats<br/> <br/>2 (37) Republicans<br/> <br/>0 (07) Libertarians</p><p><em>22. We demand the abolition of mercenary troops and the formation of a national army.</em></p><p>Regardless of the question of mercenary troops meaning militia, (I believe it does), only the Libertarians are opposed, at all, to a national standing army, but even they are open to a small defensively oriented professional army augmented by a large national militia as in the case of Switzerland.</p><p>4 (73) Communists<br/> <br/>4 (57) Democrats<br/> <br/>4 (41) Republicans<br/> <br/>2 (09) Libertarians</p><p><em>23. We demand legal warfare against conscious political lies and their dissemination in the press. In order to facilitate the creation of a German national press we demand that: (a) all editors, and their co-workers, of newspapers employing the German language must be members of the nation; (b) special permission from the State shall be necessary before non-German newspapers may appear (these need not necessarily be printed in the German language); ( c ) non-Germans shall be prohibited by law from participating financially in or influencing German newspapers, and the penalty for contravention of the shall be suppression of any such newspaper, and immediate deportation of the non-German involved It must be forbidden to publish newspapers which are damaging to the national welfare. We demand the legal prosecution of all tendencies in art and literature which exert a destructive influence on our national life and the closing of institutions which militate against the above-mentioned requirements.</em></p><p>Democrats strongly support government-funded media as well as government limitations on the media.  See the Equal Time bills and McCain-Feingold for details.  Republicans support the latter to a lesser extent.  Except for flag-burning, Republicans do not support government censorship, they support the ending of government funding, which is not at all the same thing, but Democrats support legal prosecution and closing of institutions which offend those groups they wish to protect.  Communists support, Libertarians oppose.</p><p>4 (77) Communists<br/> <br/>3 (60) Democrats<br/> <br/>1 (42) Republicans<br/> <br/>0 (09) Libertarians<br/> <br/><em><br/> <br/>24. We demand liberty for all religious denominations in the State, so far as they are not a danger to it and do not militate against the moral and ethical feelings of the German race. The Party, as such, stands for positive Christianity, but does not bind itself in the matter of creed to any particular confession. It combats the Jewish-materialist spirit within and without us, and is convinced that our nation can achieve permanent recovery from within only on the principle: THE COMMON INTEREST BEFORE SELF-INTEREST</em></p><p>This is qualified religious liberty, with the State elevated over the Church.  There is a mention of Christianity, but also a strongly worded repetition of the theme that the common interest supercedes all.  Democrats very much support this qualified religious liberty as well as the common interest, and at least when running for office, claim to be Christian.  Republicans are less supportive of such qualifications and the notion of common interest, Libertarians reject both that as well as the State’s right to interfere with private religion at all.  Communists do not recognize religious liberty, but very much agree on the common interest front.</p><p>2 (79) Communists<br/> <br/>4 (64) Democrats<br/> <br/>2 (44) Republicans<br/> <br/>0 (09) Libertarians</p><p><em>25. That all the foregoing requirements may be realized we demand the creation of a strong, central national authority; unconditional authority of the central legislative body over the entire Reich and its organizations in general; and the formation of diets and vocational chambers for the purpose of executing the general laws promulgated by the Reich in the various States of the Confederation. The leaders of the Party swear to proceed regardless of consequences – if necessary at the sacrifice of their lives – toward the fulfillment of the foregoing Points.</em></p><p>That’s easy enough.  Strong, central national authority.  Deified by Communists, yearned for by Democrats, supported by modern Republicans and hated by Libertarians.</p><p>4 (83) Communists<br/> <br/>4 (68) Democrats<br/> <br/>3 (47) Republicans<br/> <br/>0 (09) Libertarians</p><p>In conclusion, I believe the facts support my assertion that the Communists and National Socialists were very closely akin philosophically, that the policies and platform of the modern Democratic party are ideological cousins to the historical National Socialist program, that the Republican party has more in common with the National Socialists than many of its members would like to think, and that Libertarian ideology is the only political philosophy in direct and consistent intellectual opposition to Communism and National Socialism.</p><p>I certainly welcome any comments or logical criticisms of my analysis, however, I wish to see firm and articulated reasoning with factual support, not nebulous assertions that fail to directly address the relevant issues.  Violators will not be prosecuted, however, they will be mercilessly mocked.</p></div>",
  "content_text": "I have analyzed the foundational platform of the historical National Socialist German Workers Party and characterize how each of the following four political ideologies can be compared to it: Communist, Democratic, Republican and Libertarian.  I have assigned a value from zero to four to each of the 25 points, depending on how closely the position of the ideology parallels that of the Nazi program.  In cases where a point had multiple aspects, I simply attempted to look at each aspect separately, then add the total.\nThis analysis does not attempt to account for motivations.  In a Senate of 100 senators, each may have a different reason for voting for a specific bill, but in determining a senator’s ideological rating, one does not speculate as to why he voted for the bill, all that matters is his vote.  Specific actions always take precedence over general pretensions.\n1. We demand the union of all Germans, on the basis of the right of the self-determination of peoples, to form a Great Germany.\nThe key words here are forced union and right of self-determination of PEOPLES, plural, as well as a nationalist concept.  Communists support forced union and collective group identification, but not self-determination.  Democrats support forced union, collective group identification and self-determination.  Republicans support forced union and self-determination, but not collective group identification.  There is, however, a nationalist flavor that modern Democrats and Communists abjure and Republicans tend to favor.  Libertarians support none of the above, favoring free association.\n3 (3) Democrats\n3 (3) Republicans\n2 (2) Communists\n0 (0) Libertarians\n2. We demand equality of rights for the German people in its dealings with other nations, and abolition of the Peace Treaties of Versailles and St. Germain.\nThe second half is irrelevant to all four ideologies, but there is both a notion of collective rights as well as same strong sense of involuntary national identity mentioned above.\n2 (5) Democrats\n2 (4) Communists\n1 (4) Republicans\n0 (0) Libertarians\n3. We demand land and territoryfor the nourishment of our people and for settling our surplus population.\nDemocrats and Republicans alike support military intervention on behalf of national economic self-interest, Republicans a little more strongly.  Communists favor world revolution by conquest if necessary; the rationale is different but the policy is the same.  Libertarians do not support this.\n3 (8) Democrats\n4 (8) Communists\n4 (8) Republicans\n0 (0) Libertarians\n4. None but members of the nation may be citizens of the State. None but those of German blood, whatever their creed, may be members of the nation. No Jew, therefore, may be a member of the nation.\nNeither Democrats nor Republicans seek any serious limitations on citizenship or immigration although a branch of the Republicans would support some.  Both parties strongly support Israel and the Jewish people.  Communist nations are viciously opposed to Israel and have historically targeted Jews, though without the single-minded ferocity of the Nazis.  Communists have never suggested limiting citizenship.  There is a collective race consciousness here that is shared by Democrats.\n2 (10) Communists\n1 (09) Democrats\n1 (09) Republicans\n0 (00) Libertarians\n5. Anyone who is not a citizen of the State may live in Germany only as a guest and must be regarded as being subject to the Alien Laws.\nThis is pretty standard for both major American ideologies, although I must recognize the love Democrats harbor for illegal immigrants.  Libertarians tend to favor open door policies, although not as strongly as other philosophical tenets.\n4 (14) Communists\n4 (13) Republicans\n3 (12) Democrats\n1 (01) Libertarians\n6. The right of voting on the leadership and laws of the State is to be enjoyed by the citizens of the State alone. We demand, therefore, that all official positions, of whatever kind, whether in the Reich, the provinces, or the small communities, shall be held by citizens of the State alone. We oppose the corrupt parliamentary custom of filling posts merely with a view to party considerations, and without reference to character or ability.\nI don’t know of any ideology that seriously argues for the right of non-citizens to vote; this is irrelevant for comparative purposes.  Communists, Republicans and Democrats all strongly favor filling posts with views to party considerations, albeit the American parties do so far less stringently than do the one-party Communists, nor do they apply them to the mass of the bureacracy.  Libertarians would fire everyone and abolish the posts, regardless of party.\n4 (18) Communists\n2 (15) Republicans\n2 (14) Democrats\n0 (01) Libertarians\n7. We demand that the State shall make it its first duty to promote the industry and livelihood of the citizens of the State. If it is not possible to nourish the entire population of the State, foreign nationals must be excluded from the Reich.\nDemocrats strongly support both government management of the economy as well as individual welfare, but not corporate welfare.  Republicans strongly support government management of the economy and corporate welfare, but not individual welfare.  One could make a deeply cynical comment about the Communist position here, but we’ll resist the temptation.  The latter half is massively irrelevant to the United States of Adiposity.\n4 (22) Communists\n3 (18) Republicans\n3 (17) Democrats\n0 (01) Libertarians\n8. All further non-German immigration must be prevented. We demand that all non-Germans who entered Germany subsequently to August 2, 1914, shall be required forthwith to depart from the Reich.\nNeither Republicans nor Democrats support racial-based immigration laws, but Democrats are more strongly against them.  However, there is again the collective race consciousness shared by modern Democrats.  The strong government control of immigration is shared by Communists, but not the racial flavor.\n3 (25) Communists\n1 (19) Republicans\n1 (18) Democrats\n0 (01) Libertarians\n9. All citizens of the State shall possess equal rights and duties.\nAll four strains believe in equal rights, but it is the duty towards the state aspect that is the salient point here, indicating that the State’s rights supersede those of the individuals living in it.  Democrats believe this more strongly than Republicans, who are often accused of being indifferent to their social responsibilities.  Duties to the State is, of course, central to Communist ideology.\n4 (29) Communists\n4 (22) Democrats\n2 (21) Republicans\n2 (03) Libertarians\n10. It must be the first duty of every citizen of the State to perform mental or physical work. The activities of the individual must not clash with the interests of the whole, but must proceed within the framework of the community and must be for the general good.\nAgain, the State and the collective are elevated over the individual.  However, citizens are required to work, which Democrats do not support despite the Clinton-era reforms.\n4 (33) Communists\n3 (25) Democrats\n1 (22) Republicans\n0 (03) Libertarians\n11. Abolition of incomes unearned by work. BREAKING OF THE THRALDOM OF INTEREST.\nDemocrats regularly decry those who “unfairly” prosper, supposedly at the expense of others.  They have not yet begun to propose legislation to abolish such incomes, however.  Republicans and Libertarians alike oppose this vehemently, while Communists agree completely.\n4 (37) Communists\n2 (27) Democrats\n0 (22) Republicans\n0 (03) Libertarians\n12. In view of the enormous sacrifice of life and property demanded of a nation by every war, personal enrichment through war must be regarded as a crime against the nation. We demand, therefore, the total confiscation of all war profits.\nCommunists don’t support profit of any kind.  Democrats don’t like “excess” profits of any kind, and also call regularly for legislation against arms dealers.  Republicans and Libertarians are both generally opposed to confiscation of profit.\n4 (41) Communists\n2 (29) Democrats\n0 (22) Republicans\n0 (03) Libertarians\n13. We demand the nationalization of all businesses which have been amalgamated.\nDemocrats do not support nationalization of all businesses, only some.  Republicans continue to support existing national monopolies such as the Post Office.  Communists wish to nationalize everything, whereas Libertarians would privatize the Marines.\n4 (45) Communists\n2 (31) Democrats\n1 (23) Republicans\n0 (03) Libertarians\n14. We demand that there shall be profit sharing in the great industries.\nDemocrats support the minimum wage, require steep social security and health care contributions from the employer and are favorable towards forced distribution of private property.  Republicans likewise, but less enthusiastically.  Communists want to share out not only the profit, but the entire industry.  Libertarians, as usual, oppose completely.\n4 (49) Communists\n4 (35) Democrats\n2 (25) Republicans\n0 (03) Libertarians\n15. We demand a generous development of provision for old age.\nDemocrats and Republicans alike support Social Security, but it was a Democratic entitlement passed over Republican opposition.  Furthermore, it is Democrats who oppose Republican attempts to modify it in any way and are constantly telling the elderly that Republicans want to slash their benefits.  Communists support, Libertarians oppose.\n4 (53) Communists\n4 (39) Democrats\n2 (27) Republicans\n0 (03) Libertarians\n16. We demand the creation and maintenance of a healthy middle class, immediate communalization of the large department stores and their lease at a low rate to small traders, and that the most careful consideration shall be shown to all small traders in purveying to the State, the provinces, or smaller communities.\nThe notion that the state is even capable of creating and maintaining a social class is a fundamentally socialist notion on several levels.  This also smacks not only of the Keynesianism of both American parties, but also of the Democratic hatred for Walmart.  Communists believe that the bourgeiosie should be executed; they have as little in common with the Nazi concept here as do the Libertarians.\n0 (53) Communists\n3 (42) Democrats\n2 (29) Republicans\n0 (03) Libertarians\n17. We demand a land reform suitable to our national requirements, the passing of a law for the confiscation without compensation of land for communal purposes, the abolition of interest on land mortgages, and prohibition of all speculation in land.\nRepublicans,  Democrats and Communists alike support the confiscation of land for communal purposes, although their level of enthusiasm varies.  Only Communists would abolish interest – although Greenspan appears to be trying – and Democrats are far more supportive of zoning and government management of land than are Republicans.\n4 (57) Communists\n2 (44) Democrats\n1 (30) Republicans\n0 (03) Libertarians\n18. We demand ruthless war upon all those whose activities are injurious to the common interest. Sordid criminals against the nation, usurers, profiteers, etc., must be punished with death, whatever their creed or race.\nFar too extreme for any American philosophy, although Democrats buy into the notion of a common interest that supercedes individual rights.  Republicans favor the death penalty, Democrats largely don’t.  Communists support, Libertarians oppose.\n4 (61) Communists\n2 (46) Democrats\n1 (31) Republicans\n0 (03) Libertarians\n19. We demand that the Roman law, which serves the materialistic world order, shall be replaced by a German common law.\nThe Libertarians score some Nazi points!  Both Republicans and Democrats favor admiralty law, which is the equivalent of Roman law here, and have actively worked to remove the English common law from the US legal system.  The Communists are violently opposed to common law, while the Libertarians support it strongly.\n0 (61) Communists\n0 (46) Democrats\n0 (31) Republicans\n4 (07) Libertarians\n20. With the aim of opening to every capable and industrious German the possibility of higher education and consequent advancement to leading positions, the State must consider a thorough reconstruction of our national system of education. The curriculum of all educational establishments must be brought into line with the requirements of practical life. Directly the mind begins to develop the schools must aim at teaching the pupil to understand the idea of the State. We demand the education of specially gifted children of poor parents, whatever their class or occupation, at the expense of the State.\nAh, yes, the public schools.  Both Republicans and Democrats are actually more extreme than the Nazi platform, which only called for the education of elite children at state expense.  Communists support, Libertarians oppose.\n4 (65) Communists\n4 (50) Democrats\n4 (35) Republicans\n0 (07) Libertarians\n21. The State must apply itself to raising the standard of health in the nation by protecting mothers and infants, prohibiting child labor, and increasing bodily efficiency by legally obligatory gymnastics and sports, and by extensive support of clubs engaged in the physical training of the young.\nDemocrats believe that the State is responsible for individual health, Republicans have lately begun to embrace this concept with the Medicare entitlement.  Democrats are enthusiastic about government youth programs, while only the Communists make sports obligatory.\n4 (69) Communists\n3 (53) Democrats\n2 (37) Republicans\n0 (07) Libertarians\n22. We demand the abolition of mercenary troops and the formation of a national army.\nRegardless of the question of mercenary troops meaning militia, (I believe it does), only the Libertarians are opposed, at all, to a national standing army, but even they are open to a small defensively oriented professional army augmented by a large national militia as in the case of Switzerland.\n4 (73) Communists\n4 (57) Democrats\n4 (41) Republicans\n2 (09) Libertarians\n23. We demand legal warfare against conscious political lies and their dissemination in the press. In order to facilitate the creation of a German national press we demand that: (a) all editors, and their co-workers, of newspapers employing the German language must be members of the nation; (b) special permission from the State shall be necessary before non-German newspapers may appear (these need not necessarily be printed in the German language); ( c ) non-Germans shall be prohibited by law from participating financially in or influencing German newspapers, and the penalty for contravention of the shall be suppression of any such newspaper, and immediate deportation of the non-German involved It must be forbidden to publish newspapers which are damaging to the national welfare. We demand the legal prosecution of all tendencies in art and literature which exert a destructive influence on our national life and the closing of institutions which militate against the above-mentioned requirements.\nDemocrats strongly support government-funded media as well as government limitations on the media.  See the Equal Time bills and McCain-Feingold for details.  Republicans support the latter to a lesser extent.  Except for flag-burning, Republicans do not support government censorship, they support the ending of government funding, which is not at all the same thing, but Democrats support legal prosecution and closing of institutions which offend those groups they wish to protect.  Communists support, Libertarians oppose.\n4 (77) Communists\n3 (60) Democrats\n1 (42) Republicans\n0 (09) Libertarians\n24. We demand liberty for all religious denominations in the State, so far as they are not a danger to it and do not militate against the moral and ethical feelings of the German race. The Party, as such, stands for positive Christianity, but does not bind itself in the matter of creed to any particular confession. It combats the Jewish-materialist spirit within and without us, and is convinced that our nation can achieve permanent recovery from within only on the principle: THE COMMON INTEREST BEFORE SELF-INTEREST\nThis is qualified religious liberty, with the State elevated over the Church.  There is a mention of Christianity, but also a strongly worded repetition of the theme that the common interest supercedes all.  Democrats very much support this qualified religious liberty as well as the common interest, and at least when running for office, claim to be Christian.  Republicans are less supportive of such qualifications and the notion of common interest, Libertarians reject both that as well as the State’s right to interfere with private religion at all.  Communists do not recognize religious liberty, but very much agree on the common interest front.\n2 (79) Communists\n4 (64) Democrats\n2 (44) Republicans\n0 (09) Libertarians\n25. That all the foregoing requirements may be realized we demand the creation of a strong, central national authority; unconditional authority of the central legislative body over the entire Reich and its organizations in general; and the formation of diets and vocational chambers for the purpose of executing the general laws promulgated by the Reich in the various States of the Confederation. The leaders of the Party swear to proceed regardless of consequences – if necessary at the sacrifice of their lives – toward the fulfillment of the foregoing Points.\nThat’s easy enough.  Strong, central national authority.  Deified by Communists, yearned for by Democrats, supported by modern Republicans and hated by Libertarians.\n4 (83) Communists\n4 (68) Democrats\n3 (47) Republicans\n0 (09) Libertarians\nIn conclusion, I believe the facts support my assertion that the Communists and National Socialists were very closely akin philosophically, that the policies and platform of the modern Democratic party are ideological cousins to the historical National Socialist program, that the Republican party has more in common with the National Socialists than many of its members would like to think, and that Libertarian ideology is the only political philosophy in direct and consistent intellectual opposition to Communism and National Socialism.\nI certainly welcome any comments or logical criticisms of my analysis, however, I wish to see firm and articulated reasoning with factual support, not nebulous assertions that fail to directly address the relevant issues.  Violators will not be prosecuted, however, they will be mercilessly mocked.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-06T13:49:00+00:00"
}