{
  "url": "https://voxday.net/2004/04/25/we-are-free-individuals-not-herd/",
  "scraped_at": "2025-12-19T10:49:38.614854",
  "title": "We are free individuals, not herd animals",
  "date_display": "April 25, 2004",
  "date_iso": "2004-04-25T21:27:00+00:00",
  "date_from_url": "2004-04-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A juror later told the St. Petersburg Times he did not really think <a href=\"http://www.reason.com/sullum/042304.shtml\">Paey was guilty of trafficking</a>, since the prosecution made it clear from the outset that he didn’t sell any pills. The juror said he voted guilty to avoid being the lone holdout. He suggested that other jurors might have voted differently if the foreman had not assured them Paey would get probation.   The prosecutors, who finally obtained the draconian sentence that even they concede Paey does not deserve, say it’s his fault for insisting on his innocence. “It’s unfortunate that anyone has to go to prison, but he’s got no one to blame but Richard Paey,” Assistant State Attorney Mike Halkitis told the St. Petersburg Times. “All we wanted to do was get him help.”</p><p>Two lessons.  One: the jury foreman doesn’t have any say in the sentencing.  Two: If you’re on a jury, be the lone holdout.  Do what you believe to be right and stand by it, even if a bunch of ignorant would-be herd animals say otherwise.  A little short-term conflict is a lot better than a lifetime of sleepless nights, knowing you did the wrong thing.</p></div>",
  "content_text": "A juror later told the St. Petersburg Times he did not really think\nPaey was guilty of trafficking\n, since the prosecution made it clear from the outset that he didn’t sell any pills. The juror said he voted guilty to avoid being the lone holdout. He suggested that other jurors might have voted differently if the foreman had not assured them Paey would get probation.   The prosecutors, who finally obtained the draconian sentence that even they concede Paey does not deserve, say it’s his fault for insisting on his innocence. “It’s unfortunate that anyone has to go to prison, but he’s got no one to blame but Richard Paey,” Assistant State Attorney Mike Halkitis told the St. Petersburg Times. “All we wanted to do was get him help.”\nTwo lessons.  One: the jury foreman doesn’t have any say in the sentencing.  Two: If you’re on a jury, be the lone holdout.  Do what you believe to be right and stand by it, even if a bunch of ignorant would-be herd animals say otherwise.  A little short-term conflict is a lot better than a lifetime of sleepless nights, knowing you did the wrong thing.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-25T20:27:00+00:00"
}