{
  "url": "https://voxday.net/2004/04/21/we-know-where-he-stands/",
  "scraped_at": "2025-12-19T10:48:52.241522",
  "title": "We know where he stands",
  "date_display": "April 21, 2004",
  "date_iso": "2004-04-21T08:01:00+00:00",
  "date_from_url": "2004-04-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Dr. Kern, of the SKI gold stock analysis system, writes: <em>The great crash of the century has been initiated.  Liquidate all assets that can decline in net asset value (stocks, bonds, real estate, gold, but not EE, I Savings Bonds, or cash).  As I stated on the triple buy in 12/02, but this time in reverse, all traditional technical indicators of oversold conditions will prove to be wrong.  The gold stocks declined today through all stops and although the panic selling is usually indicative of a low, I’ll pick the needle out of the century’s haystack, and indicate SELL EVERYTHING (due to the greatest and truest triple sell [signal] in history).  I understand that you will view this communication as being the rantings of a lunatic and a contrary indicator.  Do not fight the SKI indices.  Please remain out of everything until the patterns indicate that a great bottom has occurred.  IT has happened and the indices have spoken. </em></p><p>This is certainly in line with what Bob Prechter said when I spoke to him yesterday.  He felt the top of a Cycle, Supercycle and Grand Supercycle Wave 2 was in very recently.  I note, on the other hand, that the R/DMA-200 barely been punctured yet, which is my usual buy signal.  I won’t get concerned until the R/DMAs drop below .90, which has not happened in this ongoing bull market for metals.</p><p>One thing that makes me at least pay attention here, however, is that Kern has been an unrepentant gold bull – he still is, actually, in terms of his logic, he’s just sticking manfully by his system – so this is not someone who is simply a bear by temperament.</p></div>",
  "content_text": "Dr. Kern, of the SKI gold stock analysis system, writes:\nThe great crash of the century has been initiated.  Liquidate all assets that can decline in net asset value (stocks, bonds, real estate, gold, but not EE, I Savings Bonds, or cash).  As I stated on the triple buy in 12/02, but this time in reverse, all traditional technical indicators of oversold conditions will prove to be wrong.  The gold stocks declined today through all stops and although the panic selling is usually indicative of a low, I’ll pick the needle out of the century’s haystack, and indicate SELL EVERYTHING (due to the greatest and truest triple sell [signal] in history).  I understand that you will view this communication as being the rantings of a lunatic and a contrary indicator.  Do not fight the SKI indices.  Please remain out of everything until the patterns indicate that a great bottom has occurred.  IT has happened and the indices have spoken.\nThis is certainly in line with what Bob Prechter said when I spoke to him yesterday.  He felt the top of a Cycle, Supercycle and Grand Supercycle Wave 2 was in very recently.  I note, on the other hand, that the R/DMA-200 barely been punctured yet, which is my usual buy signal.  I won’t get concerned until the R/DMAs drop below .90, which has not happened in this ongoing bull market for metals.\nOne thing that makes me at least pay attention here, however, is that Kern has been an unrepentant gold bull – he still is, actually, in terms of his logic, he’s just sticking manfully by his system – so this is not someone who is simply a bear by temperament.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-21T07:01:00+00:00"
}