{
  "url": "https://voxday.net/2004/04/19/whats-prob/",
  "scraped_at": "2025-12-19T10:48:31.976819",
  "title": "What’s the prob?",
  "date_display": "April 19, 2004",
  "date_iso": "2004-04-19T14:47:00+00:00",
  "date_from_url": "2004-04-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Michael Graham writes on NRO’s Corner: <em>Jeff Greenfield of CNN says the most disturbing revelation on “60 Minutes” last night was Bob Woodward’s claim that the Saudis plan to flood the international market with oil to bring down gas prices in time for the American election. To which I say “Great!” Why shouldn’t the Saudis help out the president who’s bravely led a coalition against an enemy on their own border, an enemy who has repeatedly threatened to invade Saudi Arabia?  If the Democrats want to argue that having President Bush in office means oil-rich nations will try to help out the American economy, go right ahead. If these nations were driving gas prices up in order to punish Bush, you can bet Teresa Heinz Kerry’s dead husband’s last dollar that the Democrats would be holding Bush responsible.  Instead, they’re helping a brother out. What’s the prob? </em></p><p>I’m not even sure where to begin teeing off on this one.  If George Bush is “a brother” of the House of Saud, well, we’ve got some serious problems considering that it is the Wahhabist Saudis who have revived the long slumbering war on the Dar-al-Harb in the interest of establishing global sharia.  But it would certainly go a long way in explaining why, after a Saudi-financed attack by Saudis at the behest of a Saudi expat cheered on by Saudi government clerics, the President decided to wage an undeclared war on Iraq.  Michael Moore is a borderline insane, dishonest lump of lunacy, but I don’t know if even he’s gone so far in saying that the President is not only in bed with House of Saud, but is downright akin to them.</p></div>",
  "content_text": "Michael Graham writes on NRO’s Corner:\nJeff Greenfield of CNN says the most disturbing revelation on “60 Minutes” last night was Bob Woodward’s claim that the Saudis plan to flood the international market with oil to bring down gas prices in time for the American election. To which I say “Great!” Why shouldn’t the Saudis help out the president who’s bravely led a coalition against an enemy on their own border, an enemy who has repeatedly threatened to invade Saudi Arabia?  If the Democrats want to argue that having President Bush in office means oil-rich nations will try to help out the American economy, go right ahead. If these nations were driving gas prices up in order to punish Bush, you can bet Teresa Heinz Kerry’s dead husband’s last dollar that the Democrats would be holding Bush responsible.  Instead, they’re helping a brother out. What’s the prob?\nI’m not even sure where to begin teeing off on this one.  If George Bush is “a brother” of the House of Saud, well, we’ve got some serious problems considering that it is the Wahhabist Saudis who have revived the long slumbering war on the Dar-al-Harb in the interest of establishing global sharia.  But it would certainly go a long way in explaining why, after a Saudi-financed attack by Saudis at the behest of a Saudi expat cheered on by Saudi government clerics, the President decided to wage an undeclared war on Iraq.  Michael Moore is a borderline insane, dishonest lump of lunacy, but I don’t know if even he’s gone so far in saying that the President is not only in bed with House of Saud, but is downright akin to them.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-19T13:47:00+00:00"
}