{
  "url": "https://voxday.net/2004/04/10/what-anti-tax-republicans/",
  "scraped_at": "2025-12-13T15:59:20.051597",
  "title": "What anti-tax Republicans?",
  "date_display": "April 10, 2004",
  "date_iso": "2004-04-10T08:37:00+00:00",
  "date_from_url": "2004-04-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I think small government Republicans are fast approaching the plight of the heterosexual Episcopalian.  Jonathan Adler points out on NRO’s Corner: <em>Republicans hold every statewide office in Ohio, and dominate the state legislature. So how is it that Ohio now has the third-highest state and local tax burden of any state in the nation?  Only Maine and New York impose higher taxes on their citizens. Yet Ohio politicians wonder why the state remains in an economic slump.</em></p><p>Republican Toad Swallowers are hiking up Virginia’s taxes in the largest rise in state history.  Governor Pawlenty has – shockers –  changed his mind now that he’s in office and decided that public-funded stadiums are necessary to the well-being of the Minnesota citizenry.</p><p>Vote third party.  Wouldn’t you like to be a Libertarian too?</p></div>",
  "content_text": "I think small government Republicans are fast approaching the plight of the heterosexual Episcopalian.  Jonathan Adler points out on NRO’s Corner:\nRepublicans hold every statewide office in Ohio, and dominate the state legislature. So how is it that Ohio now has the third-highest state and local tax burden of any state in the nation?  Only Maine and New York impose higher taxes on their citizens. Yet Ohio politicians wonder why the state remains in an economic slump.\nRepublican Toad Swallowers are hiking up Virginia’s taxes in the largest rise in state history.  Governor Pawlenty has – shockers –  changed his mind now that he’s in office and decided that public-funded stadiums are necessary to the well-being of the Minnesota citizenry.\nVote third party.  Wouldn’t you like to be a Libertarian too?",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-10T07:37:00+00:00"
}