{
  "url": "https://voxday.net/2004/04/12/who-else-is-at-war-with-us/",
  "scraped_at": "2025-12-19T10:46:57.510710",
  "title": "Who else is at war with us",
  "date_display": "April 12, 2004",
  "date_iso": "2004-04-12T11:01:00+00:00",
  "date_from_url": "2004-04-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Condoleeza Rice said: <em>“The terrorists were at war with us, but we were not yet at war with them. For more than 20 years, the terrorist threat gathered, and America’s response across several administrations of both parties was insufficient.”</em></p><p>Let’s see.  We’re still not at war with the terrorists – not having declared war against them – and we’re not even pretending to be at war with the non-terrorist wing of the global jihad that also considers itself at war with us.  And if you’re going to argue that the Constitution doesn’t really matter and it’s just a dead document that can be ignored at will, well, I’d consider that a sad and shocking position for any Republican to take.  But if that’s where the Republican Party truly stands now, I’d very much like to see it in writing.</p></div>",
  "content_text": "Condoleeza Rice said:\n“The terrorists were at war with us, but we were not yet at war with them. For more than 20 years, the terrorist threat gathered, and America’s response across several administrations of both parties was insufficient.”\nLet’s see.  We’re still not at war with the terrorists – not having declared war against them – and we’re not even pretending to be at war with the non-terrorist wing of the global jihad that also considers itself at war with us.  And if you’re going to argue that the Constitution doesn’t really matter and it’s just a dead document that can be ignored at will, well, I’d consider that a sad and shocking position for any Republican to take.  But if that’s where the Republican Party truly stands now, I’d very much like to see it in writing.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-12T10:01:00+00:00"
}