{
  "url": "https://voxday.net/2004/04/08/why-you-cant-get-date/",
  "scraped_at": "2025-12-13T15:58:57.485745",
  "title": "Why you can’t get a date",
  "date_display": "April 8, 2004",
  "date_iso": "2004-04-08T11:40:00+00:00",
  "date_from_url": "2004-04-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>You may remember a post a little while ago about the romantic travails of a Pioneer Press reporter who was attending a speed-dating event.  Here’s the summary: <em>…let’s <a href=\"http://www.twincities.com/mld/twincities/living/special_packages/single_in_the_cities/8362400.htm\">start with the results</a> of my recent speed-dating experience. As I mentioned in my last column, the event itself was a lot of fun, and I especially was looking forward to learning if any of the three guys I was interested in felt any sparks for me. About 72 hours later, I received my answer in a short and formatted email from the dating service.  Not one. Not a single one. Not the first, second or third guy. A complete strikeout. I felt like a pedestrian who had gotten splashed by a passing car hitting a puddle — embarrassed, clammy and cold. Also like Martha Stewart after a group shower.  The e-mail also informed me that I had 13 “missed opportunities” — men who had circled “yes” for me, but not I for them. </em></p><p>I’d say this is Nature’s way of telling you that you have an unrealistic attitude about how attractive you are.  The woman doesn’t have to be alone, but she’s choosing that over dating men who are actually in her league.  Remember that she thought that the women were higher caliber, despite the fact that many of them booked out of there as quickly as they could afterward.  She might have learned her lesson, as she says that she’ll try a different strategy in the future.  Then again, she might be considering ways to try to make herself more attractive to the three guys aren’t interested instead of giving the other 13 a chance.</p><p>Men as well as women need to get a grip on where they stand.  If you’re old and weird-looking like Donald Trump but rich and famous, you can date spectacular women such as Melania Knauss.  You can date lesser beauties if you’re poor, but young and handsome.  Sadly, these things can change over time, so a man can’t depend on his high-school jock status counting for much post-collega and a woman can’t rely on the fact that all the boys thought she was a babe in eighth grade.  Furthermore, and I can’t emphasize this enough, most men don’t care IN THE LEAST that a woman happens to have a college degree or a good job.  Not only does it not make a career woman more attractive than the aerobics instructor in the hotpants, but it often raises serious questions in many men’s minds about her commitment to being a mother.  That’s the truth.  That’s the reality.</p></div>",
  "content_text": "You may remember a post a little while ago about the romantic travails of a Pioneer Press reporter who was attending a speed-dating event.  Here’s the summary:\n…let’s\nstart with the results\nof my recent speed-dating experience. As I mentioned in my last column, the event itself was a lot of fun, and I especially was looking forward to learning if any of the three guys I was interested in felt any sparks for me. About 72 hours later, I received my answer in a short and formatted email from the dating service.  Not one. Not a single one. Not the first, second or third guy. A complete strikeout. I felt like a pedestrian who had gotten splashed by a passing car hitting a puddle — embarrassed, clammy and cold. Also like Martha Stewart after a group shower.  The e-mail also informed me that I had 13 “missed opportunities” — men who had circled “yes” for me, but not I for them.\nI’d say this is Nature’s way of telling you that you have an unrealistic attitude about how attractive you are.  The woman doesn’t have to be alone, but she’s choosing that over dating men who are actually in her league.  Remember that she thought that the women were higher caliber, despite the fact that many of them booked out of there as quickly as they could afterward.  She might have learned her lesson, as she says that she’ll try a different strategy in the future.  Then again, she might be considering ways to try to make herself more attractive to the three guys aren’t interested instead of giving the other 13 a chance.\nMen as well as women need to get a grip on where they stand.  If you’re old and weird-looking like Donald Trump but rich and famous, you can date spectacular women such as Melania Knauss.  You can date lesser beauties if you’re poor, but young and handsome.  Sadly, these things can change over time, so a man can’t depend on his high-school jock status counting for much post-collega and a woman can’t rely on the fact that all the boys thought she was a babe in eighth grade.  Furthermore, and I can’t emphasize this enough, most men don’t care IN THE LEAST that a woman happens to have a college degree or a good job.  Not only does it not make a career woman more attractive than the aerobics instructor in the hotpants, but it often raises serious questions in many men’s minds about her commitment to being a mother.  That’s the truth.  That’s the reality.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-08T10:40:00+00:00"
}