{
  "url": "https://voxday.net/2004/04/11/worst-ad-campaign-ever/",
  "scraped_at": "2025-12-13T15:59:30.006017",
  "title": "Worst ad campaign ever",
  "date_display": "April 11, 2004",
  "date_iso": "2004-04-11T15:00:00+00:00",
  "date_from_url": "2004-04-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Sports Guy rants: <em>Those “<a href=\"http://sports.espn.go.com/espn/page2/story?page=simmons/040409\">Whatever happens in Vegas</a> stays in Vegas” ads, maybe the biggest head-scratcher in advertising history. Why would anyone ever inflict that much needless tension on their demographic? Were they appealing to adulterers? Druggies? Strip joint stalkers? Snuff film producers? Were we supposed to think to ourselves, “You know, I wasn’t gonna go, but I didn’t realize I could do morally destructive things with no repercussions — book me a plane ticket!”   And don’t get me started on the ramifications of these ads with wives and girlfriends across the country, many of whom were already insane to begin with. For instance, right as I was leaving for my latest trip — staying at the Hard Rock this time, on the way to the airport, plane ticket in my hands — the Sports Gal smiled and told me, “And don’t think I don’t know that the Paradise (a strip club) is right across the street from the Hard Rock.”</em></p><p>She slipped that sucker in like a Tommy Hearns right cross. And while I was hemming and hawing, she followed with this uppercut: “Hey, whatever happens in Vegas stays in Vegas, right?”</p><p>Great ad campaign. Thanks, guys.</p></div>",
  "content_text": "The Sports Guy rants:\nThose “\nWhatever happens in Vegas\nstays in Vegas” ads, maybe the biggest head-scratcher in advertising history. Why would anyone ever inflict that much needless tension on their demographic? Were they appealing to adulterers? Druggies? Strip joint stalkers? Snuff film producers? Were we supposed to think to ourselves, “You know, I wasn’t gonna go, but I didn’t realize I could do morally destructive things with no repercussions — book me a plane ticket!”   And don’t get me started on the ramifications of these ads with wives and girlfriends across the country, many of whom were already insane to begin with. For instance, right as I was leaving for my latest trip — staying at the Hard Rock this time, on the way to the airport, plane ticket in my hands — the Sports Gal smiled and told me, “And don’t think I don’t know that the Paradise (a strip club) is right across the street from the Hard Rock.”\nShe slipped that sucker in like a Tommy Hearns right cross. And while I was hemming and hawing, she followed with this uppercut: “Hey, whatever happens in Vegas stays in Vegas, right?”\nGreat ad campaign. Thanks, guys.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-04-11T14:00:00+00:00"
}