{
  "url": "https://voxday.net/2009/05/26/affirmative-action-judge/",
  "scraped_at": "2026-01-08T22:57:08.080566",
  "title": "An affirmative-action judge",
  "date_display": "May 26, 2009",
  "date_iso": "2009-05-26T18:00:00+00:00",
  "date_from_url": "2009-05-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Obama nominates <a href=\"http://www.tnr.com/politics/story.html?id=45d56e6f-f497-4b19-9c63-04e10199a085\">a not-very-bright divorced Hispanic woman with personality issues</a> to the Supreme Court.  I know, I’m shocked too:</p><blockquote><p>Over the past few weeks, I’ve been talking to a range of people who have worked with her, nearly all of them former law clerks for other judges on the Second Circuit or former federal prosecutors in New York. Most are Democrats and all of them want President Obama to appoint a judicial star of the highest intellectual caliber who has the potential to change the direction of the court. Nearly all of them acknowledged that Sotomayor is a presumptive front-runner, but nearly none of them raved about her. They expressed questions about her temperament, her judicial craftsmanship, and most of all, her ability to provide an intellectual counterweight to the conservative justices, as well as a clear liberal alternative.</p><p>The most consistent concern was that Sotomayor, although an able lawyer, was “not that smart and kind of a bully on the bench,” as one former Second Circuit clerk for another judge put it. “She has an inflated opinion of herself, and is domineering during oral arguments, but her questions aren’t penetrating and don’t get to the heart of the issue.”</p></blockquote><p>It never ceases to amaze me how once a society enters the decline phase, it’s the mediocrities who rise increasingly to the top of government circles.  I can’t imagine Scalia having too much trouble slapping this third-rater around.  In other judicial news, the California Supreme Court apparently decided that the electorate was in no mood to be ignored after seeing the results of the recent referendums and <a href=\"http://www.breitbart.com/article.php?id=D98E2DO00&amp;show_article=1\">upheld Proposition 8</a> while throwing a bone to the rush crowd:</p><p><i>In summary, we conclude that Proposition 8 constitutes a permissible constitutional amendment (rather than an impermissible constitutional revision), does not violate the separation of powers doctrine, and is not invalid under the “inalienable rights” theory proffered by the Attorney General. We further conclude that Proposition 8 does not apply retroactively and therefore that the marriages of same-sex couples performed prior to the effective date of Proposition 8 remain valid. Having determined that none of the constitutional challenges to the adoption of Proposition 8 have merit, we observe that if there is to be a change to the state constitutional rule embodied in that measure, it must “find its expression at the ballot box.” (In re Marriage Cases, supra, 43 Cal.4th 757, 884 (conc. &amp; dis. opn. of Corrigan, J.); see also id. at pp. 861, 878 (conc. &amp; dis. opn. of Baxter, J.).)</i></p></div>",
  "content_text": "Obama nominates\na not-very-bright divorced Hispanic woman with personality issues\nto the Supreme Court.  I know, I’m shocked too:\nOver the past few weeks, I’ve been talking to a range of people who have worked with her, nearly all of them former law clerks for other judges on the Second Circuit or former federal prosecutors in New York. Most are Democrats and all of them want President Obama to appoint a judicial star of the highest intellectual caliber who has the potential to change the direction of the court. Nearly all of them acknowledged that Sotomayor is a presumptive front-runner, but nearly none of them raved about her. They expressed questions about her temperament, her judicial craftsmanship, and most of all, her ability to provide an intellectual counterweight to the conservative justices, as well as a clear liberal alternative.\nThe most consistent concern was that Sotomayor, although an able lawyer, was “not that smart and kind of a bully on the bench,” as one former Second Circuit clerk for another judge put it. “She has an inflated opinion of herself, and is domineering during oral arguments, but her questions aren’t penetrating and don’t get to the heart of the issue.”\nIt never ceases to amaze me how once a society enters the decline phase, it’s the mediocrities who rise increasingly to the top of government circles.  I can’t imagine Scalia having too much trouble slapping this third-rater around.  In other judicial news, the California Supreme Court apparently decided that the electorate was in no mood to be ignored after seeing the results of the recent referendums and\nupheld Proposition 8\nwhile throwing a bone to the rush crowd:\nIn summary, we conclude that Proposition 8 constitutes a permissible constitutional amendment (rather than an impermissible constitutional revision), does not violate the separation of powers doctrine, and is not invalid under the “inalienable rights” theory proffered by the Attorney General. We further conclude that Proposition 8 does not apply retroactively and therefore that the marriages of same-sex couples performed prior to the effective date of Proposition 8 remain valid. Having determined that none of the constitutional challenges to the adoption of Proposition 8 have merit, we observe that if there is to be a change to the state constitutional rule embodied in that measure, it must “find its expression at the ballot box.” (In re Marriage Cases, supra, 43 Cal.4th 757, 884 (conc. & dis. opn. of Corrigan, J.); see also id. at pp. 861, 878 (conc. & dis. opn. of Baxter, J.).)",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-26T17:00:00+00:00"
}