{
  "url": "https://voxday.net/2009/05/17/at-black-gate_17/",
  "scraped_at": "2026-01-08T22:56:25.793596",
  "title": "At the Black Gate",
  "date_display": "May 17, 2009",
  "date_iso": "2009-05-17T17:00:00+00:00",
  "date_from_url": "2009-05-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which I consider the possibility of <a href=\"http://www.blackgate.com/2009/05/17/on-rebooting/\">extending the reboot concept</a> to SF/F literature:</p><blockquote><p>There has been a lot of discussion, understandably, about the new <em>Star Trek</em> movie.  Let me admit, first off, that I have seen very little <em>Star Trek</em> and what little I have seen I pretty much loathed and despised.  (NB: I’m neither judging nor prosecuting here, merely expressing a personal opinion.  Live long and prosper.)  That being said, the talk about the so-called “rebooting” has me wondering why television and film are so prone to remakes while there appears to be no similar practice in literature.</p></blockquote><p>I should be glad to hear of your candidates for rebooting.  As for why I loathe Star Trek, it’s hard to know where to start.  But I suppose the smug incoherence of a saga about a warship charged with peacefully enforcing the supremacy of its “tolerant” culture at laser point would be as good a place to start as any.  I used to watch re-runs of the original series as a kid, but was deeply disappointed with TNG when it was launched.</p></div>",
  "content_text": "In which I consider the possibility of\nextending the reboot concept\nto SF/F literature:\nThere has been a lot of discussion, understandably, about the new\nStar Trek\nmovie.  Let me admit, first off, that I have seen very little\nStar Trek\nand what little I have seen I pretty much loathed and despised.  (NB: I’m neither judging nor prosecuting here, merely expressing a personal opinion.  Live long and prosper.)  That being said, the talk about the so-called “rebooting” has me wondering why television and film are so prone to remakes while there appears to be no similar practice in literature.\nI should be glad to hear of your candidates for rebooting.  As for why I loathe Star Trek, it’s hard to know where to start.  But I suppose the smug incoherence of a saga about a warship charged with peacefully enforcing the supremacy of its “tolerant” culture at laser point would be as good a place to start as any.  I used to watch re-runs of the original series as a kid, but was deeply disappointed with TNG when it was launched.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-17T16:00:00+00:00"
}