{
  "url": "https://voxday.net/2009/05/14/bilderberg-decides/",
  "scraped_at": "2026-01-08T22:56:07.387286",
  "title": "Bilderberg decides",
  "date_display": "May 14, 2009",
  "date_iso": "2009-05-14T14:32:00+00:00",
  "date_from_url": "2009-05-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>How would you like <a href=\"http://pensionpulse.blogspot.com/2009/05/will-bilderberg-sink-global-economy.html\">your Depression served</a>?</p><blockquote><p>Bilderberg is divided on whether to put into motion, “Either a prolonged, agonizing depression that dooms the world to decades of stagnation, decline and poverty … or an intense-but-shorter depression that paves the way for a new sustainable economic world order, with less sovereignty but more efficiency.”</p><p>The information takes on added weight when one considers the fact that Estulin’s previous economic forecasts, which were based on leaks from the same sources, have proven deadly accurate. Estulin correctly predicted the housing crash and the 2008 financial meltdown as a result of what his sources inside Bilderberg told him the elite were planning based on what was said at their 2006 meeting in Canada and the 2007 conference in Turkey.  Details of the economic agenda were contained in a pre-meeting booklet being handed out to Bilderberg members. On a more specific note, Estulin warns that Bilderberg are fostering a false picture of economic recovery, suckering investors into ploughing their money back into the stock market again only to later unleash another massive downturn which will create “massive losses and searing financial pain in the months ahead,” according to a Canada Free Press report.</p><p>According to Estulin, Bilderberg is assuming that U.S. unemployment figures will reach around 14% by the end of the year, almost doubling the current official figure of 8.1 per cent.</p></blockquote><p>I vote for short and intense, myself.  It’s what the Austrians recommend, albeit without the new world order component.  Obama and company are clearly pushing hard for prolonged and agonizing, though, with their mad Japanese scientist efforts to create zombie banks and corporations.  But at least we’ve got an interesting prediction from Mr. Estulin regarding 14 percent official unemployment by December.  That’s a bit less than I was expecting actually.  I can’t say that predicting a push for enactment of the <s>EU Constitution</s>Lisbon Treaty is exactly stunning, as it’s been obvious that the Irish would be forced to vote again since the day they voted no.</p></div>",
  "content_text": "How would you like\nyour Depression served\n?\nBilderberg is divided on whether to put into motion, “Either a prolonged, agonizing depression that dooms the world to decades of stagnation, decline and poverty … or an intense-but-shorter depression that paves the way for a new sustainable economic world order, with less sovereignty but more efficiency.”\nThe information takes on added weight when one considers the fact that Estulin’s previous economic forecasts, which were based on leaks from the same sources, have proven deadly accurate. Estulin correctly predicted the housing crash and the 2008 financial meltdown as a result of what his sources inside Bilderberg told him the elite were planning based on what was said at their 2006 meeting in Canada and the 2007 conference in Turkey.  Details of the economic agenda were contained in a pre-meeting booklet being handed out to Bilderberg members. On a more specific note, Estulin warns that Bilderberg are fostering a false picture of economic recovery, suckering investors into ploughing their money back into the stock market again only to later unleash another massive downturn which will create “massive losses and searing financial pain in the months ahead,” according to a Canada Free Press report.\nAccording to Estulin, Bilderberg is assuming that U.S. unemployment figures will reach around 14% by the end of the year, almost doubling the current official figure of 8.1 per cent.\nI vote for short and intense, myself.  It’s what the Austrians recommend, albeit without the new world order component.  Obama and company are clearly pushing hard for prolonged and agonizing, though, with their mad Japanese scientist efforts to create zombie banks and corporations.  But at least we’ve got an interesting prediction from Mr. Estulin regarding 14 percent official unemployment by December.  That’s a bit less than I was expecting actually.  I can’t say that predicting a push for enactment of the\nEU Constitution\nLisbon Treaty is exactly stunning, as it’s been obvious that the Irish would be forced to vote again since the day they voted no.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-14T13:32:00+00:00"
}