{
  "url": "https://voxday.net/2009/05/15/censorship-in-uk/",
  "scraped_at": "2026-01-08T22:56:12.861635",
  "title": "Censorship in the UK",
  "date_display": "May 15, 2009",
  "date_iso": "2009-05-15T12:39:00+00:00",
  "date_from_url": "2009-05-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Yet another argument for <a href=\"http://www.timesonline.co.uk/tol/news/\">breaking the government monopoly</a> on delivering the mail:</p><blockquote><p>Postal workers are refusing to deliver British National Party election leaflets because they object to its “right-wing rubbish”.  About 100 workers in the West Country have told union leaders that they will not carry the leaflets, which bear an anti-immigration message.</p></blockquote><p>These postal workers should be fired immediately for attempting to exert political control over the mail.  First, the idea of a “conscience clause” when it comes to mail delivery is absurd.  They’re being asked to <i>deliver the freaking mail</i>, not commit murder.  If they don’t deliver the mail, they are without value and merit no pay.  This is political correctness run completely amok; if permitted it could completely destroy the remnants of the British parliamentary system.  What are they doing reading the bloody mail in the first place anyhow?  Should prudish postal employees also have the right to refuse to deliver love letters of which they don’t approve?</p><p>Also, as Daniel Hannan and others have pointed out, the British National Party cannot reasonably be describe as right-wing rubbish.  Its sensible attitude towards immigration and the EU notwithstanding, its platform is mostly LEFT-WING rubbish.</p></div>",
  "content_text": "Yet another argument for\nbreaking the government monopoly\non delivering the mail:\nPostal workers are refusing to deliver British National Party election leaflets because they object to its “right-wing rubbish”.  About 100 workers in the West Country have told union leaders that they will not carry the leaflets, which bear an anti-immigration message.\nThese postal workers should be fired immediately for attempting to exert political control over the mail.  First, the idea of a “conscience clause” when it comes to mail delivery is absurd.  They’re being asked to\ndeliver the freaking mail\n, not commit murder.  If they don’t deliver the mail, they are without value and merit no pay.  This is political correctness run completely amok; if permitted it could completely destroy the remnants of the British parliamentary system.  What are they doing reading the bloody mail in the first place anyhow?  Should prudish postal employees also have the right to refuse to deliver love letters of which they don’t approve?\nAlso, as Daniel Hannan and others have pointed out, the British National Party cannot reasonably be describe as right-wing rubbish.  Its sensible attitude towards immigration and the EU notwithstanding, its platform is mostly LEFT-WING rubbish.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-15T11:39:00+00:00"
}