{
  "url": "https://voxday.net/2009/05/02/crash-barely-begins-to-describe-i/",
  "scraped_at": "2026-01-08T22:55:03.395287",
  "title": "“Crash” doesn’t quite suffice",
  "date_display": "May 2, 2009",
  "date_iso": "2009-05-02T15:12:00+00:00",
  "date_from_url": "2009-05-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>While many are starting to believe that the worst is past, I wouldn’t put any stock in all the prognostications of recovery later in the year.  I recently met a European executive and we spent some time talking economics over several espressos.  He told me that steel shipments have come to an almost complete halt around the world.  In Germany, for example, the export market has collapsed so completely that not only have orders dropped to 10 percent of previous levels, but their inventories haven’t changed much since January.</p><p>And this is subsequent to the <a href=\"http://news.thomasnet.com/IMT/archives/2009/03/steel-shipments-output-continue-slide-as-customers-stop-buying-surplus-of-steel-aluminum.html\">previous reports</a> of huge declines: <i>“In the European Union, there were production drops of 31.6 percent in Germany, 35.7 percent in France, 35.7 percent in Spain and 39.9 percent in Italy. Brazilian steel production decreased by 39 percent last month from February 2008 totals, and both Russia and Ukraine saw steel output fall by 32.1 percent and 33.6 percent respectively.”</i></p><p>Since steel is a leading economic indicator, this bodes very, very poorly indeed for the world economy.</p></div>",
  "content_text": "While many are starting to believe that the worst is past, I wouldn’t put any stock in all the prognostications of recovery later in the year.  I recently met a European executive and we spent some time talking economics over several espressos.  He told me that steel shipments have come to an almost complete halt around the world.  In Germany, for example, the export market has collapsed so completely that not only have orders dropped to 10 percent of previous levels, but their inventories haven’t changed much since January.\nAnd this is subsequent to the\nprevious reports\nof huge declines:\n“In the European Union, there were production drops of 31.6 percent in Germany, 35.7 percent in France, 35.7 percent in Spain and 39.9 percent in Italy. Brazilian steel production decreased by 39 percent last month from February 2008 totals, and both Russia and Ukraine saw steel output fall by 32.1 percent and 33.6 percent respectively.”\nSince steel is a leading economic indicator, this bodes very, very poorly indeed for the world economy.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-02T14:12:00+00:00"
}