{
  "url": "https://voxday.net/2009/05/11/dijongate-drama/",
  "scraped_at": "2026-01-08T22:55:49.057414",
  "title": "The Dijongate Drama",
  "date_display": "May 11, 2009",
  "date_iso": "2009-05-11T07:57:00+00:00",
  "date_from_url": "2009-05-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Legal Insurrection on <a href=\"http://legalinsurrection.blogspot.com/2009/05/reaction-to-dijongate.html\">the conspiracy of culinary silence</a>:</p><blockquote><p>My two posts on the televised Obama/Biden burger joint visit and Obama’s request for Dijon mustard, <a href=\"http://legalinsurrection.blogspot.com/2009/05/msnbc-hides-obamas-dijon-mustard.html\">MSNBC Hides Obama’s Dijon Mustard</a> (aka Dijongate) and <a href=\"http://legalinsurrection.blogspot.com/2009/05/thou-shall-not-mock-obamas-mustard.html\">Thou Shall Not Mock Obama’s Mustard</a>, generated enormous reaction.  Neither of these posts was about mustard as such, but rather, the absurd extent to which the Obama administration went to create a “real guy kind of quality” image of Obama/Biden eating “Hell Burgers,” and how MSNBC played along like a loyal worshipper through its coverage and editing….  But there was a serious overall point, being the absurd image control and media fawning. Needless to say, the nutroots portrayed the posts as being a complaint about the type of mustard Obama used. A useful device of distortion straight from the Media Matters playbook.</p><p>Seeing how my posts were distorted was not terribly surprising; that is how things go on the internet. The level of vitriol was something I knew existed, but had never personally experienced. As crazed as the published comments were, there were others I didn’t publish telling me to kill myself and do other things, and plenty of bizarre e-mails. All of these people made fools of themselves.</p><p>The reaction proved one thing I already knew: The cult of personality surrounding Obama is real. And many of the cultists are demented, dangerous or both.</p></blockquote><p>As the professor says, it’s not exactly news that Obama has an insane cult of personality.  As <a href=\"http://rsmccain.blogspot.com/2009/05/dijongate-what-have-we-learned.html\">the Other McCain points out</a>, this is just more evidence that “MSNBC and other major media are… doing public relations for the Obama administration and the Democratic Party.”  What I find much more interesting is that MSNBC apparently believes it is somehow possible to hide the fact that Obama is an effete elitist from the American public.  It’s like trying to conceal Barney Frank’s homosexuality or Tommy Lee’s affinity for strippers.</p><p>If you think that little of your potential audience’s intelligence, you shouldn’t be surprised that no one watches you; they clearly aren’t capable of finding the on-switch.  Most people are idiots, not algae.</p></div>",
  "content_text": "Legal Insurrection on\nthe conspiracy of culinary silence\n:\nMy two posts on the televised Obama/Biden burger joint visit and Obama’s request for Dijon mustard,\nMSNBC Hides Obama’s Dijon Mustard\n(aka Dijongate) and\nThou Shall Not Mock Obama’s Mustard\n, generated enormous reaction.  Neither of these posts was about mustard as such, but rather, the absurd extent to which the Obama administration went to create a “real guy kind of quality” image of Obama/Biden eating “Hell Burgers,” and how MSNBC played along like a loyal worshipper through its coverage and editing….  But there was a serious overall point, being the absurd image control and media fawning. Needless to say, the nutroots portrayed the posts as being a complaint about the type of mustard Obama used. A useful device of distortion straight from the Media Matters playbook.\nSeeing how my posts were distorted was not terribly surprising; that is how things go on the internet. The level of vitriol was something I knew existed, but had never personally experienced. As crazed as the published comments were, there were others I didn’t publish telling me to kill myself and do other things, and plenty of bizarre e-mails. All of these people made fools of themselves.\nThe reaction proved one thing I already knew: The cult of personality surrounding Obama is real. And many of the cultists are demented, dangerous or both.\nAs the professor says, it’s not exactly news that Obama has an insane cult of personality.  As\nthe Other McCain points out\n, this is just more evidence that “MSNBC and other major media are… doing public relations for the Obama administration and the Democratic Party.”  What I find much more interesting is that MSNBC apparently believes it is somehow possible to hide the fact that Obama is an effete elitist from the American public.  It’s like trying to conceal Barney Frank’s homosexuality or Tommy Lee’s affinity for strippers.\nIf you think that little of your potential audience’s intelligence, you shouldn’t be surprised that no one watches you; they clearly aren’t capable of finding the on-switch.  Most people are idiots, not algae.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-11T06:57:00+00:00"
}