{
  "url": "https://voxday.net/2009/05/18/filet-de-neandertha/",
  "scraped_at": "2026-01-08T22:56:29.489808",
  "title": "Filet de Neanderthal",
  "date_display": "May 18, 2009",
  "date_iso": "2009-05-18T14:15:00+00:00",
  "date_from_url": "2009-05-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t know why this amuses me so much, <a href=\"http://www.guardian.co.uk/science/2009/may/17/neanderthals-cannibalism-anthropological-sciences-journal\">but it does</a>:</p><blockquote><p>One of science’s most puzzling mysteries – the disappearance of the Neanderthals – may have been solved. Modern humans ate them, says a leading fossil expert.  The controversial suggestion follows publication of a study in the Journal of Anthropological Sciences about a Neanderthal jawbone apparently butchered by modern humans. Now the leader of the research team says he believes the flesh had been eaten by humans, while its teeth may have been used to make a necklace.</p></blockquote><p>Now that I think about it, it’s probably because it tends to destroy Rousseau’s concept of the Noble Savage while simultaneously illustrating the way scientists are reluctant to follow the evidence when it doesn’t support their preconceived notions.  I rather enjoyed the one scientist’s theory that maybe someone just found the jawbone and turned it into jewelry for some inexplicable reason, although it would have been much more amusing if he’d theorized a series of shaving accidents instead.  Neanderthals <i>were</i> rather hairy, after all.</p><p>It strikes me that I really do rather better science than the average scientist.  After all, how many scientists can claim to be as demonstrably multi-disciplined as the Japanese scientist who developed <a href=\"http://www.milobookclub.com/2008/03/13/triumph-of-science-skeptic/\">Dark Vapor Theory</a> in astrophysics while concocting <a href=\"http://www.milobookclub.com/2007/07/10/evolution-is-easy/\">Evolutionary Stable Strategies in biology</a> in the same year?  When you’re an Internet Superintelligence, every year is an Anno Mirabilis.</p></div>",
  "content_text": "I don’t know why this amuses me so much,\nbut it does\n:\nOne of science’s most puzzling mysteries – the disappearance of the Neanderthals – may have been solved. Modern humans ate them, says a leading fossil expert.  The controversial suggestion follows publication of a study in the Journal of Anthropological Sciences about a Neanderthal jawbone apparently butchered by modern humans. Now the leader of the research team says he believes the flesh had been eaten by humans, while its teeth may have been used to make a necklace.\nNow that I think about it, it’s probably because it tends to destroy Rousseau’s concept of the Noble Savage while simultaneously illustrating the way scientists are reluctant to follow the evidence when it doesn’t support their preconceived notions.  I rather enjoyed the one scientist’s theory that maybe someone just found the jawbone and turned it into jewelry for some inexplicable reason, although it would have been much more amusing if he’d theorized a series of shaving accidents instead.  Neanderthals\nwere\nrather hairy, after all.\nIt strikes me that I really do rather better science than the average scientist.  After all, how many scientists can claim to be as demonstrably multi-disciplined as the Japanese scientist who developed\nDark Vapor Theory\nin astrophysics while concocting\nEvolutionary Stable Strategies in biology\nin the same year?  When you’re an Internet Superintelligence, every year is an Anno Mirabilis.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-18T13:15:00+00:00"
}