{
  "url": "https://voxday.net/2009/05/31/good-riddance_31/",
  "scraped_at": "2026-01-08T22:57:32.401292",
  "title": "Good riddance",
  "date_display": "May 31, 2009",
  "date_iso": "2009-05-31T18:04:00+00:00",
  "date_from_url": "2009-05-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p>Media outlets are reporting that late-term abortion doctor <a href=\"http://www.kake.com/home/headlines/46575872.html\">George Tiller has been shot and killed</a> at his church in Wichita, Kan.</p></blockquote><p>Tiller should have been jailed and had his license revoked for the abortion-related midemeanors he blatantly committed; had justice been done then perhaps he would still be alive.  Not that I care, as I wouldn’t shed any more tears for dead abortionists than I would for murdered concentration camp guards.  And <i>at his church</i>?  What sort of church that calls itself Christian allows a totally unrepentant man with the blood of many children on his hands to attend it?</p><p>It should be amusing to watch the pro-abortion camp go hysterical with fear over this, as they still hadn’t gotten over the previous round of abortionist shootings that ended over a decade ago.  They know at heart that the issue will never be settled; the murder of unborn children will never, ever be acceptable to decent men and women.  Abortionists have killed more Americans than every American military foe in history combined, so based on the body count alone, the post-natal termination of an abortionist is more rationally justifiable than the killing of a jihadist in Iraq or Afghanistan.</p><p>UPDATE: <a href=\"http://corner.nationalreview.com/post/?q=NWVlNGI0NGQxMmJkY2Q3MWQwYjUyMGVhZWNlYTcyNTU=\">National Review</a>: <i>“It’s hard to be anything but sick over the news.”</i></p><p>Yeah, it’s really not.  And so-called “conservatives” are sick indeed if they can shrug off the death of innocent Iraqis and Afghans as collateral damage, call for military action that spells the certain death of innocent Iranians, and then be genuinely upset over the fittingly violent end of one serial child-killer.</p></div>",
  "content_text": "Media outlets are reporting that late-term abortion doctor\nGeorge Tiller has been shot and killed\nat his church in Wichita, Kan.\nTiller should have been jailed and had his license revoked for the abortion-related midemeanors he blatantly committed; had justice been done then perhaps he would still be alive.  Not that I care, as I wouldn’t shed any more tears for dead abortionists than I would for murdered concentration camp guards.  And\nat his church\n?  What sort of church that calls itself Christian allows a totally unrepentant man with the blood of many children on his hands to attend it?\nIt should be amusing to watch the pro-abortion camp go hysterical with fear over this, as they still hadn’t gotten over the previous round of abortionist shootings that ended over a decade ago.  They know at heart that the issue will never be settled; the murder of unborn children will never, ever be acceptable to decent men and women.  Abortionists have killed more Americans than every American military foe in history combined, so based on the body count alone, the post-natal termination of an abortionist is more rationally justifiable than the killing of a jihadist in Iraq or Afghanistan.\nUPDATE:\nNational Review\n:\n“It’s hard to be anything but sick over the news.”\nYeah, it’s really not.  And so-called “conservatives” are sick indeed if they can shrug off the death of innocent Iraqis and Afghans as collateral damage, call for military action that spells the certain death of innocent Iranians, and then be genuinely upset over the fittingly violent end of one serial child-killer.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-31T17:04:00+00:00"
}