{
  "url": "https://voxday.net/2009/05/26/great-papal-smear/",
  "scraped_at": "2026-01-08T22:57:10.087593",
  "title": "The great Papal smear",
  "date_display": "May 26, 2009",
  "date_iso": "2009-05-26T20:16:00+00:00",
  "date_from_url": "2009-05-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Cisbio echoes French atheologist Michel Onfray by repeating a discredited and shabby historical canard as part of a misplaced attempt to criticize <i>The Irrational Atheist</i>:</p><blockquote><p>Vox defends the Catholic Church from Onfray’s charge of complicity in the Holocaust, which, says Vox, “is entirely based upon what [Onfray] considers to be the Church’s silence during and after World War Two.” (p.202)</p><p>Notice the inference that Papal silence during WW2 is a perception peculiar to Onfray, rather than an uncontroversial fact known to all.</p><p>But Vox does not deny Papal complicity in the Holocaust so much as sympathise with it, albeit indirectly: ‘How can the Catholic Church be held responsible for failing to defend those [i.e. communists] who reject its authority over them.” He re-iterates his bemusement – and slyly widens his absolution of the Vatican’s inaction -in a footnote:</p><p><i>“I am a Christian, not a Catholic. The Pope has no authority over me, nor does he have any responsibility to defend me. Why Pope Pius XII should be criticised for defending his flock and not defending others who refuse to acknowledge him (he actually was a well-known defender of Jews) has never made any sense to me. The fact that the Vatican signed treaties with the Fascists and Nazis in 1929 and 1933 is proof of their astute and early recognition of two dangerous enemies, not a propensity for trans-ideological partnerships (the 1929 treaty established the Vatican as an independent state).”</i></p><p>Essentially, V is saying that Hitler could have slaughtered every Jew, protestant, Slav and communist from the Downs to the Urals, and the Holy Father’s conscience might have been soothed, rather than provoked, by the safety of the Catholics.</p><p>That’s Christianity for you.</p><p>First, one wonders if Vox isn’t thinking of Pius XI rather than Pius XII. To say that Pius XII was ‘a well-known defender of Jews’ is more than a little generous, given he did not once utter the word ‘Jew’ in public throughout the years of WW2. On the other hand, it was Pius XI who issued the Mit Brennender Sorge encyclical in 1937.</p><p>This encyclical, condemning the ‘fundamental hostility to Christ and His church’, has been taken by apologists to evince the Church’s concern for all faiths, including that of the Jews, despite the fact it doesn’t mention them by name. Pius XI did, in fact, publicly condemn Nazi anti-Semitism as un-Christian, repeatedly, and complain about the west’s conspiracy of silence (He also railed against capitalist greed.) But by the time war had started, Pius XI was dead and the cardinal who had negotiated the 1933 treaty with Berlin had succeeded him as Pius XII. Given the circumstances, is it a surprise that Pius XII proved more compliant?</p><p>That Vox seems unaware of the 1937 encyclical is not surprising, given the command he has displayed thus far, but one can’t help thinking he’s missed a trick. (admittedly, the future Pius XII had a hand in its composition) Of course, the fact of the encyclical proves the Vatican felt able to confront the Nazi’s when so moved, which only serves to highlight its silence regarding the Holocaust.</p><p>All the while, the reader is wondering why this in a footnote. Perhaps because it culminates with the startling assertion that the 1929 and 1933 treaties were ‘proof of [the Vatican’s] astute and early recognition of two dangerous enemies’. Perhaps Vox feels that, by placing such a statement in a footnote, he is absolved from backing it up with, say, an argument. (Not that he’s displayed such temerity before.)</p></blockquote><p>First, let me say that I absolutely deny any Papal complicity in the Holocaust and reject the charge of “silence” as well.  While it’s now clear that I shall have to do so in the next edition of TIA, I did not bother to dismantle Onfray’s argument on factual grounds because it is devoid of any supporting evidence whatsoever.  Therefore, I saw no need to address the factual claims and chose to focus on the flaws in his logic instead.  I should have addressed both.  Second, it is always risky to make assumptions about what another person knows or does not know, but I note that if we are to apply Cisbio’s past recommendations to his own writing, we must conclude that neither 20th century history nor the history of the Catholic Church is his style and strongly suggest he drop them.  For it was Pius XII, not the deceased Pius XI, <a href=\"http://www.ewtn.com/library/CHISTORY/zpi12eic.htm\">who protested the October 1943 order</a> from Berlin to arrest the 8,000 Jews in Rome.  In a letter given to Obersturmbannführer Herbert Kappler, the SS Commander in Rome, the Vatican warned that the Pope would publicly denounce the planned arrests of all Jews of Italian citizenship if the Germans followed through with them.   Adolf Eichman later wrote: <i>“The objections given and the excessive delay in the steps necessary to complete the implementation of the operation, resulted in a great part of Italian Jews being able to hide and escape capture.”</i></p><p>Pius XII also attacked the Nazi persecution of the Jews on the largest possible stage available to him.  Although he followed his predecessor’s lead in not mentioning them by name, the world understood precisely to whom he was referring when, in his <a href=\"http://www.ewtn.com/library/PAPALDOC/P12CH42.HTM\">Christmas message of 1942</a>, he declared: <i>“Mankind owes that vow to the hundreds of thousands of persons who, without any fault on their part, sometimes only because of their nationality or race, have been consigned to death or to a slow decline.”</i></p><p>Certainly the New York Times understood: <i>“This Christmas more than ever Pope Pius XII is a lonely voice crying out in the silence of a continent. The pulpit whence he speaks is more than ever like the Rock in which the Church was founded, a tiny island lashed and surrounded by a sea of war… When a leader bound impartially to nations on both sides condemns as heresy the new form of national state which subordinates everything to itself; when he declares that whoever wants peace must protect against ‘arbitrary attacks’ the ‘juridical safety of individual’; when he assails violent occupation of territory, the exile and persecution of human beings for no reason other than race or political opinion; when he says that people must fight for a just and decent peace, a ‘total peace’–the ‘impartial’ judgment is like a verdict in our high court of justice.”</i></p><p>The National Socialists understood too, as evidenced by a Gestapo report that summarized the Christmas address: <i>“[T]he Pope has rejected the new National Socialist European Order. He has not attacked National Socialism directly, but he has severely criticized everything we believe…. He has spoken clearly in favor of the Jews.”</i></p><p>The fact that Pius XII didn’t refer to the Jews by name in his public statements is totally irrelevant given the wide scope of his activities and statements in their defense.  Moreover, as everyone understood at the time, his ability to speak out in public was limited by the large numbers of Catholics and Jews subject to the German occupations.  Pius XII had initially instructed the European bishops to speak out against Nazi persecutions of the Jews and others upon learning about the outrages committed by the Nazis in Poland.  But the severe reprisals that came in response to the Dutch bishops’ letter of July 1942, which denounced “the unmerciful and unjust treatment meted out to Jews by those in power in our country” in every Catholic Church across Holland, taught the Pope that he had to be more circumspect if he did not wish to make matters worse for those he was attempting to help.  The dearth of direct refences to the Jews during the war years was not indicative of silent complicity with Nazi policy, but rather a staunch but discreet resistance to it.  It is worth noting that the Pope was himself subject to German occu<br> pation from September 1943 to June 1944.</br></p><p>Pius XII can also be confirmed to have vigorously and repeatedly protested the National Socialist actions through direct communications with the German government.  The Foreign Minister, Joachim von Ribbentrop, testified at the Nuremburg Trials: <i>“I do not recollect at the moment, but I know we had a whole deskful of protests from the Vatican. There were very many we did not even read or reply to.”</i></p><p>Israeli sources report that papal relief programs saved more Jews than any other, an estimated 860,000.  It is not an accident that 80 percent of Italy’s Jews survived the war despite the German occupation, about four times more than survived the war in other occupied countries.   Many important Jewish leaders of the era, including Israel’s first president, first foreign minister, and chief rabbi were explicit in their gratitude towards Pius XII and the Catholic Church for <a href=\"http://www.catholicleague.org/pius/dalinframe.htm\">their defense of the Jewish people</a>.  Time Magazine printed <a href=\"http://www.time.com/time/magazine/article/0,9171,765103,00.html\">a letter from Albert Einstein</a> in 1940:</p><p><i>“Being a lover of freedom, when the revolution came in Germany, I looked to the universities to defend it, knowing that they had always boasted of their devotion to the cause of truth; but, no, the universities immediately were silenced. Then I looked to the great editors of the newspapers whose flaming editorials in days gone by had proclaimed their love of freedom; but they, like the universities, were silenced in a few short weeks. . . .  Only the Church stood squarely across the path of Hitler’s campaign for suppressing truth. I never had any special interest in the Church before, but now I feel a great affection and admiration because the Church alone has had the courage and persistence to stand for intellectual truth and moral freedom. I am forced thus to confess that what I once despised I now praise unreservedly.”</i></p><p>But as for the man Pius XII himself, let Golda Meir pronounce the final judgment.  After his death in 1958, she delivered the Israeli government’s official condolences to the Vatican:</p><p><b><i>“We share in the grief of humanity…  When fearful martyrdom came to our people in the decade of Nazi terror, the voice of the pope was raised for the victims. The life of our times was enriched by a voice speaking out on the great moral truths above the tumult of daily conflict. We mourn a great servant of peace.”</i></b></p><p>Michel Onfray’s ahistorical slander of one of the few world leaders brave enough to staunchly oppose Hitler and the National Socialists in both public and private is contemptible.  And to accuse the man of complicity in the very atrocities he was rightly praised for resisting at great personal risk to himself and to those for whom he was responsible is either indicative of near-complete factual ignorance of the matter or blatant intellectual dishonesty.</p><p>UPDATE – There simply cannot be any doubt that Cardinal Eugenio Pacelli was <a href=\"http://rabbimichaelsamuel.com/archives/117\">an outright enemy of the Nazis</a> both before and after his elevation to the papacy.  Consider his words from a public speech in France, covered by the New York Times, given two years AFTER the treaty cited above as evidence of his compliance with the National Socialists:</p><p><i>“[The Nazis] are in reality only miserable plagiarists who dress up old errors with new tinsel. It does not make any difference whether they flock to the banners of social revolution, whether they are guided by a false concept of the world and of life, or whether they are possessed by the superstition of a race and blood cult.”</i></p></div>",
  "content_text": "Cisbio echoes French atheologist Michel Onfray by repeating a discredited and shabby historical canard as part of a misplaced attempt to criticize\nThe Irrational Atheist\n:\nVox defends the Catholic Church from Onfray’s charge of complicity in the Holocaust, which, says Vox, “is entirely based upon what [Onfray] considers to be the Church’s silence during and after World War Two.” (p.202)\nNotice the inference that Papal silence during WW2 is a perception peculiar to Onfray, rather than an uncontroversial fact known to all.\nBut Vox does not deny Papal complicity in the Holocaust so much as sympathise with it, albeit indirectly: ‘How can the Catholic Church be held responsible for failing to defend those [i.e. communists] who reject its authority over them.” He re-iterates his bemusement – and slyly widens his absolution of the Vatican’s inaction -in a footnote:\n“I am a Christian, not a Catholic. The Pope has no authority over me, nor does he have any responsibility to defend me. Why Pope Pius XII should be criticised for defending his flock and not defending others who refuse to acknowledge him (he actually was a well-known defender of Jews) has never made any sense to me. The fact that the Vatican signed treaties with the Fascists and Nazis in 1929 and 1933 is proof of their astute and early recognition of two dangerous enemies, not a propensity for trans-ideological partnerships (the 1929 treaty established the Vatican as an independent state).”\nEssentially, V is saying that Hitler could have slaughtered every Jew, protestant, Slav and communist from the Downs to the Urals, and the Holy Father’s conscience might have been soothed, rather than provoked, by the safety of the Catholics.\nThat’s Christianity for you.\nFirst, one wonders if Vox isn’t thinking of Pius XI rather than Pius XII. To say that Pius XII was ‘a well-known defender of Jews’ is more than a little generous, given he did not once utter the word ‘Jew’ in public throughout the years of WW2. On the other hand, it was Pius XI who issued the Mit Brennender Sorge encyclical in 1937.\nThis encyclical, condemning the ‘fundamental hostility to Christ and His church’, has been taken by apologists to evince the Church’s concern for all faiths, including that of the Jews, despite the fact it doesn’t mention them by name. Pius XI did, in fact, publicly condemn Nazi anti-Semitism as un-Christian, repeatedly, and complain about the west’s conspiracy of silence (He also railed against capitalist greed.) But by the time war had started, Pius XI was dead and the cardinal who had negotiated the 1933 treaty with Berlin had succeeded him as Pius XII. Given the circumstances, is it a surprise that Pius XII proved more compliant?\nThat Vox seems unaware of the 1937 encyclical is not surprising, given the command he has displayed thus far, but one can’t help thinking he’s missed a trick. (admittedly, the future Pius XII had a hand in its composition) Of course, the fact of the encyclical proves the Vatican felt able to confront the Nazi’s when so moved, which only serves to highlight its silence regarding the Holocaust.\nAll the while, the reader is wondering why this in a footnote. Perhaps because it culminates with the startling assertion that the 1929 and 1933 treaties were ‘proof of [the Vatican’s] astute and early recognition of two dangerous enemies’. Perhaps Vox feels that, by placing such a statement in a footnote, he is absolved from backing it up with, say, an argument. (Not that he’s displayed such temerity before.)\nFirst, let me say that I absolutely deny any Papal complicity in the Holocaust and reject the charge of “silence” as well.  While it’s now clear that I shall have to do so in the next edition of TIA, I did not bother to dismantle Onfray’s argument on factual grounds because it is devoid of any supporting evidence whatsoever.  Therefore, I saw no need to address the factual claims and chose to focus on the flaws in his logic instead.  I should have addressed both.  Second, it is always risky to make assumptions about what another person knows or does not know, but I note that if we are to apply Cisbio’s past recommendations to his own writing, we must conclude that neither 20th century history nor the history of the Catholic Church is his style and strongly suggest he drop them.  For it was Pius XII, not the deceased Pius XI,\nwho protested the October 1943 order\nfrom Berlin to arrest the 8,000 Jews in Rome.  In a letter given to Obersturmbannführer Herbert Kappler, the SS Commander in Rome, the Vatican warned that the Pope would publicly denounce the planned arrests of all Jews of Italian citizenship if the Germans followed through with them.   Adolf Eichman later wrote:\n“The objections given and the excessive delay in the steps necessary to complete the implementation of the operation, resulted in a great part of Italian Jews being able to hide and escape capture.”\nPius XII also attacked the Nazi persecution of the Jews on the largest possible stage available to him.  Although he followed his predecessor’s lead in not mentioning them by name, the world understood precisely to whom he was referring when, in his\nChristmas message of 1942\n, he declared:\n“Mankind owes that vow to the hundreds of thousands of persons who, without any fault on their part, sometimes only because of their nationality or race, have been consigned to death or to a slow decline.”\nCertainly the New York Times understood:\n“This Christmas more than ever Pope Pius XII is a lonely voice crying out in the silence of a continent. The pulpit whence he speaks is more than ever like the Rock in which the Church was founded, a tiny island lashed and surrounded by a sea of war… When a leader bound impartially to nations on both sides condemns as heresy the new form of national state which subordinates everything to itself; when he declares that whoever wants peace must protect against ‘arbitrary attacks’ the ‘juridical safety of individual’; when he assails violent occupation of territory, the exile and persecution of human beings for no reason other than race or political opinion; when he says that people must fight for a just and decent peace, a ‘total peace’–the ‘impartial’ judgment is like a verdict in our high court of justice.”\nThe National Socialists understood too, as evidenced by a Gestapo report that summarized the Christmas address:\n“[T]he Pope has rejected the new National Socialist European Order. He has not attacked National Socialism directly, but he has severely criticized everything we believe…. He has spoken clearly in favor of the Jews.”\nThe fact that Pius XII didn’t refer to the Jews by name in his public statements is totally irrelevant given the wide scope of his activities and statements in their defense.  Moreover, as everyone understood at the time, his ability to speak out in public was limited by the large numbers of Catholics and Jews subject to the German occupations.  Pius XII had initially instructed the European bishops to speak out against Nazi persecutions of the Jews and others upon learning about the outrages committed by the Nazis in Poland.  But the severe reprisals that came in response to the Dutch bishops’ letter of July 1942, which denounced “the unmerciful and unjust treatment meted out to Jews by those in power in our country” in every Catholic Church across Holland, taught the Pope that he had to be more circumspect if he did not wish to make matters worse for those he was attempting to help.  The dearth of direct refences to the Jews during the war years was not indicative of silent complicity with Nazi policy, but rather a staunch but discreet resistance to it.  It is worth noting that the Pope was himself subject to German occu\npation from September 1943 to June 1944.\nPius XII can also be confirmed to have vigorously and repeatedly protested the National Socialist actions through direct communications with the German government.  The Foreign Minister, Joachim von Ribbentrop, testified at the Nuremburg Trials:\n“I do not recollect at the moment, but I know we had a whole deskful of protests from the Vatican. There were very many we did not even read or reply to.”\nIsraeli sources report that papal relief programs saved more Jews than any other, an estimated 860,000.  It is not an accident that 80 percent of Italy’s Jews survived the war despite the German occupation, about four times more than survived the war in other occupied countries.   Many important Jewish leaders of the era, including Israel’s first president, first foreign minister, and chief rabbi were explicit in their gratitude towards Pius XII and the Catholic Church for\ntheir defense of the Jewish people\n.  Time Magazine printed\na letter from Albert Einstein\nin 1940:\n“Being a lover of freedom, when the revolution came in Germany, I looked to the universities to defend it, knowing that they had always boasted of their devotion to the cause of truth; but, no, the universities immediately were silenced. Then I looked to the great editors of the newspapers whose flaming editorials in days gone by had proclaimed their love of freedom; but they, like the universities, were silenced in a few short weeks. . . .  Only the Church stood squarely across the path of Hitler’s campaign for suppressing truth. I never had any special interest in the Church before, but now I feel a great affection and admiration because the Church alone has had the courage and persistence to stand for intellectual truth and moral freedom. I am forced thus to confess that what I once despised I now praise unreservedly.”\nBut as for the man Pius XII himself, let Golda Meir pronounce the final judgment.  After his death in 1958, she delivered the Israeli government’s official condolences to the Vatican:\n“We share in the grief of humanity…  When fearful martyrdom came to our people in the decade of Nazi terror, the voice of the pope was raised for the victims. The life of our times was enriched by a voice speaking out on the great moral truths above the tumult of daily conflict. We mourn a great servant of peace.”\nMichel Onfray’s ahistorical slander of one of the few world leaders brave enough to staunchly oppose Hitler and the National Socialists in both public and private is contemptible.  And to accuse the man of complicity in the very atrocities he was rightly praised for resisting at great personal risk to himself and to those for whom he was responsible is either indicative of near-complete factual ignorance of the matter or blatant intellectual dishonesty.\nUPDATE – There simply cannot be any doubt that Cardinal Eugenio Pacelli was\nan outright enemy of the Nazis\nboth before and after his elevation to the papacy.  Consider his words from a public speech in France, covered by the New York Times, given two years AFTER the treaty cited above as evidence of his compliance with the National Socialists:\n“[The Nazis] are in reality only miserable plagiarists who dress up old errors with new tinsel. It does not make any difference whether they flock to the banners of social revolution, whether they are guided by a false concept of the world and of life, or whether they are possessed by the superstition of a race and blood cult.”",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-26T19:16:00+00:00"
}