{
  "url": "https://voxday.net/2009/05/07/harry-truman-was-war-crimina/",
  "scraped_at": "2026-01-08T22:55:28.831154",
  "title": "Harry Trumanwasa war criminal",
  "date_display": "May 7, 2009",
  "date_iso": "2009-05-07T10:30:00+00:00",
  "date_from_url": "2009-05-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And John Stewart was correct to say so, his subsequent retreat notwithstanding.  It’s no surprise that those attempting to make a national interest case for defending torture should bend the truth so radically <a href=\"http://www.washingtonexaminer.com/opinion/columns/NoemieEmery/Lefts-torture-logic-could-kill-you-44445707.html\">in defense of the intentional mass murder of Japanese civilians</a>:</p><blockquote><p>We can all thank Clifford May for having gotten Jon Stewart to say (at least for a while) that President Harry S. Truman was a “war criminal” for, among other things, the two atom bombs that he ordered dropped on Japan….  This began to emerge even before Iraq, George W. Bush, and the issue of “torture,” in the late 1990’s, when the Smithsonian mounted a display of the Enola Gay suggesting the bombing was a matter of race-induced genocide, and forgetting to mention such things as a) the fact that Japan started the war with the surprise attack on Pearl Harbor, b) the Japanese atrocities against helpless civilians, and c) the thousands and thousands of Allied and American servicemen whose lives had been saved by the end of the war.</p></blockquote><p>Both (a) and (b) are true.  They are both also irrelevant.  And (c) is simply incorrect. Japan is an island nation and in the summer of 1945 it was completely surrounded by the U.S. Navy, which had roundly defeated the Imperial Japanese Navy and left Japan without any means of obtaining the oil which was required for it to continue the war.  There was no need for a costly invasion of the home islands; in fact, there was no need for most of the island hopping that cost so many American lives.  And it is not true that the atomic bombings caused Japan to surrender:</p><p><i>“There is little point in attempting precisely to impute Japan’s unconditional surrender to any one of the numerous causes which jointly and cumulatively were responsible for Japan’s disaster. The time lapse between military impotence and political acceptance of the inevitable might have been shorter had the political structure of Japan permitted a more rapid and decisive determination of national policies. Nevertheless, it seems clear that, even without the atomic bombing attacks, air supremacy over Japan could have exerted sufficient pressure to bring about unconditional surrender and obviate the need for invasion.  Based on a detailed investigation of all the facts, and supported by the testimony of the surviving Japanese leaders involved, it is the Survey’s opinion that certainly prior to 31 December 1945, and in all probability prior to 1 November 1945, Japan would have surrendered even if the atomic bombs had not been dropped, even if Russia had not entered the war, and even if no invasion had been planned or contemplated. “</i><br>– The <a href=\"http://www.anesi.com/ussbs01.htm#jstetw\">United States Strategic Bombing Survey</a>, July 1, 1946</br></p><p>More importantly, it is also not true that Japan had been unwilling to surrender prior to the atomic bombings, because it is an established and readily verifiable historical fact that <a href=\"http://www.ihr.org/jhr/v16/v16n3p-4_Weber.html\">the Japanese had offered to surrender</a> on almost exactly the same terms that were subsequently accepted months before the bombs were dropped.</p><p><i>“In an article that finally appeared August 19, 1945, on the front pages of the Chicago Tribune and the Washington Times-Herald, Trohan revealed that on January 20, 1945, two days prior to his departure for the Yalta meeting with Stalin and Churchill, President Roosevelt received a 40-page memorandum from General Douglas MacArthur outlining five separate surrender overtures from high-level Japanese officials.  This memo showed that the Japanese were offering surrender terms virtually identical to the ones ultimately accepted by the Americans at the formal surrender ceremony on September 2 — that is, complete surrender of everything but the person of the Emperor. Specifically, the terms of these peace overtures included:</i></p><p> * Complete surrender of all Japanese forces and arms, at home, on island possessions, and in occupied countries.<br> * Occupation of Japan and its possessions by Allied troops under American direction.<br> * Japanese relinquishment of all territory seized during the war, as well as Manchuria, Korea and Taiwan.<br> * Regulation of Japanese industry to halt production of any weapons and other tools of war.<br> * Release of all prisoners of war and internees.<br> * Surrender of designated war criminals. “</br></br></br></br></br></p><p>There is simply no room for debate on this.  The historical facts are documented and indisputable.  There is no honest, informed defense of the Truman administration’s actions.  The atomic bombings of Hiroshima and Nagasaki were completely unnecessary war crimes worthy of being ranked with the Holocaust and other great historical atrocities.</p><p>UPDATE: Nathan asked about the contrary “historical evidence” presented by <a href=\"http://www.pjtv.com/video/Afterburner_/Jon_Stewart%2C_War_Criminals_%26_The_True_Story_of_the_Atomic_Bombs/1808/;jsessionid=abclTePrM5J-5_H_xD9ds\">Bill Whittle</a>.  The problem with Whittle’s attempted rebuttal is that he compounds historical ignorance with illogic, then throws in a substantial amount of irrelevance for good measure.  For example, Whittle ludicrously cites the battle for Okinawa and quotes a Japanese military figure in an attempt to prove what a deadly threat that 20 million kamikazes would have posed to the U.S. Navy.  He does so in obvious ignorance of the fact that Japan only produced a grand total of 11,100 planes in 1945, 2,000 of which had already been destroyed in the battle he references.  Moreover, they had no experienced pilots and no fuel with which to fly their few remaining planes.</p><p>The “official policy” quote from the God-Emperor Hirohito was obviously just rhetoric for public consumption since Hirohito had never set military or any other official policy for Japan. <i>“Japan’s governmental structure was such that in practice the Emperor merely approved the decisions of his advisers. A consensus among the oligarchy of ruling factions at the top was required before any major question of national policy could be decided.”</i> – US Strategic Bombing Survey.</p><p>So, Bill Whittle clearly knows nothing of the historical US military reports, the post-war interviews of Japanese government figures, or the MacArthur memorandum.  He may be a fine guy – I know Rachel Lucas likes him, but on this subject he is just a talking head with no credibility whatsoever.  I suspect he obtained much of his information from <a href=\"http://home.att.net/~sallyann4/invasion2.html\">this document</a> or its equivalent.</p></div>",
  "content_text": "And John Stewart was correct to say so, his subsequent retreat notwithstanding.  It’s no surprise that those attempting to make a national interest case for defending torture should bend the truth so radically\nin defense of the intentional mass murder of Japanese civilians\n:\nWe can all thank Clifford May for having gotten Jon Stewart to say (at least for a while) that President Harry S. Truman was a “war criminal” for, among other things, the two atom bombs that he ordered dropped on Japan….  This began to emerge even before Iraq, George W. Bush, and the issue of “torture,” in the late 1990’s, when the Smithsonian mounted a display of the Enola Gay suggesting the bombing was a matter of race-induced genocide, and forgetting to mention such things as a) the fact that Japan started the war with the surprise attack on Pearl Harbor, b) the Japanese atrocities against helpless civilians, and c) the thousands and thousands of Allied and American servicemen whose lives had been saved by the end of the war.\nBoth (a) and (b) are true.  They are both also irrelevant.  And (c) is simply incorrect. Japan is an island nation and in the summer of 1945 it was completely surrounded by the U.S. Navy, which had roundly defeated the Imperial Japanese Navy and left Japan without any means of obtaining the oil which was required for it to continue the war.  There was no need for a costly invasion of the home islands; in fact, there was no need for most of the island hopping that cost so many American lives.  And it is not true that the atomic bombings caused Japan to surrender:\n“There is little point in attempting precisely to impute Japan’s unconditional surrender to any one of the numerous causes which jointly and cumulatively were responsible for Japan’s disaster. The time lapse between military impotence and political acceptance of the inevitable might have been shorter had the political structure of Japan permitted a more rapid and decisive determination of national policies. Nevertheless, it seems clear that, even without the atomic bombing attacks, air supremacy over Japan could have exerted sufficient pressure to bring about unconditional surrender and obviate the need for invasion.  Based on a detailed investigation of all the facts, and supported by the testimony of the surviving Japanese leaders involved, it is the Survey’s opinion that certainly prior to 31 December 1945, and in all probability prior to 1 November 1945, Japan would have surrendered even if the atomic bombs had not been dropped, even if Russia had not entered the war, and even if no invasion had been planned or contemplated. “\n– The\nUnited States Strategic Bombing Survey\n, July 1, 1946\nMore importantly, it is also not true that Japan had been unwilling to surrender prior to the atomic bombings, because it is an established and readily verifiable historical fact that\nthe Japanese had offered to surrender\non almost exactly the same terms that were subsequently accepted months before the bombs were dropped.\n“In an article that finally appeared August 19, 1945, on the front pages of the Chicago Tribune and the Washington Times-Herald, Trohan revealed that on January 20, 1945, two days prior to his departure for the Yalta meeting with Stalin and Churchill, President Roosevelt received a 40-page memorandum from General Douglas MacArthur outlining five separate surrender overtures from high-level Japanese officials.  This memo showed that the Japanese were offering surrender terms virtually identical to the ones ultimately accepted by the Americans at the formal surrender ceremony on September 2 — that is, complete surrender of everything but the person of the Emperor. Specifically, the terms of these peace overtures included:\n* Complete surrender of all Japanese forces and arms, at home, on island possessions, and in occupied countries.\n* Occupation of Japan and its possessions by Allied troops under American direction.\n* Japanese relinquishment of all territory seized during the war, as well as Manchuria, Korea and Taiwan.\n* Regulation of Japanese industry to halt production of any weapons and other tools of war.\n* Release of all prisoners of war and internees.\n* Surrender of designated war criminals. “\nThere is simply no room for debate on this.  The historical facts are documented and indisputable.  There is no honest, informed defense of the Truman administration’s actions.  The atomic bombings of Hiroshima and Nagasaki were completely unnecessary war crimes worthy of being ranked with the Holocaust and other great historical atrocities.\nUPDATE: Nathan asked about the contrary “historical evidence” presented by\nBill Whittle\n.  The problem with Whittle’s attempted rebuttal is that he compounds historical ignorance with illogic, then throws in a substantial amount of irrelevance for good measure.  For example, Whittle ludicrously cites the battle for Okinawa and quotes a Japanese military figure in an attempt to prove what a deadly threat that 20 million kamikazes would have posed to the U.S. Navy.  He does so in obvious ignorance of the fact that Japan only produced a grand total of 11,100 planes in 1945, 2,000 of which had already been destroyed in the battle he references.  Moreover, they had no experienced pilots and no fuel with which to fly their few remaining planes.\nThe “official policy” quote from the God-Emperor Hirohito was obviously just rhetoric for public consumption since Hirohito had never set military or any other official policy for Japan.\n“Japan’s governmental structure was such that in practice the Emperor merely approved the decisions of his advisers. A consensus among the oligarchy of ruling factions at the top was required before any major question of national policy could be decided.”\n– US Strategic Bombing Survey.\nSo, Bill Whittle clearly knows nothing of the historical US military reports, the post-war interviews of Japanese government figures, or the MacArthur memorandum.  He may be a fine guy – I know Rachel Lucas likes him, but on this subject he is just a talking head with no credibility whatsoever.  I suspect he obtained much of his information from\nthis document\nor its equivalent.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-07T09:30:00+00:00"
}