{
  "url": "https://voxday.net/2009/05/20/idiots-at-chalkboard/",
  "scraped_at": "2026-01-08T22:56:38.783485",
  "title": "Idiots at the chalkboard",
  "date_display": "May 20, 2009",
  "date_iso": "2009-05-20T07:35:00+00:00",
  "date_from_url": "2009-05-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I may have been too generous when I calculated that the average school teacher’s IQ to be <a href=\"http://www.wnd.com/news/article.asp?ARTICLE_ID=42742\">around 91</a>:</p><blockquote><p>According to state education officials, nearly three-quarters of the people who took the state elementary school teacher’s licensing exam this year <a href=\"http://www.wpri.com/dpp/news/local_news/local_wpri_massachusetts_aspiring_school_teachers_fail_in_math20090519\">failed the new math section</a>.  The Massachusetts Department of Elementary and Secondary Education released the results Tuesday. They say that only 27 percent of the more than 600 candidates who took the test passed.</p></blockquote><p>Remember this the next time someone asks you about your credentials to homeschool your children.  In my opinion, the mere fact of not being mentally sub-normal trumps a degree from a paper-selling institution that hands them out to everyone with a pulse and the requisite cash.</p></div>",
  "content_text": "I may have been too generous when I calculated that the average school teacher’s IQ to be\naround 91\n:\nAccording to state education officials, nearly three-quarters of the people who took the state elementary school teacher’s licensing exam this year\nfailed the new math section\n.  The Massachusetts Department of Elementary and Secondary Education released the results Tuesday. They say that only 27 percent of the more than 600 candidates who took the test passed.\nRemember this the next time someone asks you about your credentials to homeschool your children.  In my opinion, the mere fact of not being mentally sub-normal trumps a degree from a paper-selling institution that hands them out to everyone with a pulse and the requisite cash.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-20T06:35:00+00:00"
}