{
  "url": "https://voxday.net/2009/05/22/interpretive-hoax/",
  "scraped_at": "2026-01-08T22:56:49.726990",
  "title": "An interpretive hoax",
  "date_display": "May 22, 2009",
  "date_iso": "2009-05-22T06:55:00+00:00",
  "date_from_url": "2009-05-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m only surprised at the speed with which <a href=\"http://sciencenow.sciencemag.org/cgi/content/full/2009/519/1?rss=1/\">the grandiose initial claims are being disavowed</a> by those who profess belief in evolution:</p><blockquote><p>Many paleontologists are unconvinced. They point out that Hurum and Gingerich’s analysis compared 30 traits in the new fossil with primitive and higher primates when standard practice is to analyze 200 to 400 traits and to include anthropoids from Egypt and the newer fossils of Eosimias from Asia, both of which were missing from the analysis in the paper. “There is no phylogenetic analysis to support the claims, and the data is cherry-picked,” says paleontologist Richard Kay, also of Duke University. Callum Ross, a paleontologist at the University of Chicago in Illinois agrees: “Their claim that this specimen should be classified as haplorhine is unsupportable in light of modern methods of classification.”</p></blockquote><p>So, it’s clear that what passes for the science isn’t there.  Not yet, and probably not ever.  One gets the impression that many serious scientists would really prefer to avoid having Ida thrown in their faces for the indefinite future the way they already have to answer for Piltdown Man and all the other evolutionist hoaxes.  Seriously, is there any other so-called “science” with a more gruesome record of outright fraud?  And somehow, I doubt that scientists <a href=\"http://scienceblogs.com/laelaps/2009/05/poor_poor_ida_or_overselling_a.php\">putting their efforts into marketing spin</a> is going to do much for their credibility.</p><p><i>“Any pop band is doing the same thing,” said Jorn H. Hurum, a scientist at the University of Oslo who acquired the fossil and assembled the team of scientists that studied it. “Any athlete is doing the same thing. We have to start thinking the same way in science.”</i></p><p>Science: as credible as bad music.  Well, if that’s their goal, I have no doubt they’ll manage to achieve it.</p></div>",
  "content_text": "I’m only surprised at the speed with which\nthe grandiose initial claims are being disavowed\nby those who profess belief in evolution:\nMany paleontologists are unconvinced. They point out that Hurum and Gingerich’s analysis compared 30 traits in the new fossil with primitive and higher primates when standard practice is to analyze 200 to 400 traits and to include anthropoids from Egypt and the newer fossils of Eosimias from Asia, both of which were missing from the analysis in the paper. “There is no phylogenetic analysis to support the claims, and the data is cherry-picked,” says paleontologist Richard Kay, also of Duke University. Callum Ross, a paleontologist at the University of Chicago in Illinois agrees: “Their claim that this specimen should be classified as haplorhine is unsupportable in light of modern methods of classification.”\nSo, it’s clear that what passes for the science isn’t there.  Not yet, and probably not ever.  One gets the impression that many serious scientists would really prefer to avoid having Ida thrown in their faces for the indefinite future the way they already have to answer for Piltdown Man and all the other evolutionist hoaxes.  Seriously, is there any other so-called “science” with a more gruesome record of outright fraud?  And somehow, I doubt that scientists\nputting their efforts into marketing spin\nis going to do much for their credibility.\n“Any pop band is doing the same thing,” said Jorn H. Hurum, a scientist at the University of Oslo who acquired the fossil and assembled the team of scientists that studied it. “Any athlete is doing the same thing. We have to start thinking the same way in science.”\nScience: as credible as bad music.  Well, if that’s their goal, I have no doubt they’ll manage to achieve it.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-22T05:55:00+00:00"
}