{
  "url": "https://voxday.net/2009/05/10/mailvox-yep-this-is-my-hate-mai/",
  "scraped_at": "2026-01-08T22:55:43.533920",
  "title": "Mailvox: Yep, these are my hate mailers",
  "date_display": "May 10, 2009",
  "date_iso": "2009-05-10T06:25:00+00:00",
  "date_from_url": "2009-05-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Derek proves to be a gift that keeps on giving.  I can understand why some cynics might believe that I invent these critics, note how his attempts at criticism, as hapless as they may be, are actually more substantive and relevant than the sort usually provided by the likes of PZ, Orac, and the Sciencebloggers.</p><blockquote><p>I can’t complain about a quick response.  A personal insult immediately in your response, how very… expected.  Anyway, maybe my stupid mind can accept aspects of science being dangerous to humanity.   I have seen the terminator and matrix movies, so you actually make a valid point.  However, from your writing, you have no where near the science and math education that I have.  Your writing shows a complete misunderstanding of the scientific method.</p><p>I know some about Feynman, but he was a scientist.  Not knowing his entire history, I plead ignorance, but if he did not follow the scientific method, then he would have been discredited quickly, because that is how the scientific method works, as opposed to blind faith in what is comfortable.  The scientific method is simply observing reality and not clinging to silly stories.  It is not religious, yet religious types should not be so fearful.  They have been used for many years by very greedy criminals that represent less than 1% of the population.  I prefer democracy and science, because it represents what a vast majority want, and that includes me.</p></blockquote><p>Let me get this straight.  The guy emails to declare one of my columns “the most idiotic thing he has ever read” then complains about getting personally insulted when he is described – accurately, I think – as stupid for failing to comprehend that science is merely a tool that can be either harmful or beneficial depending upon how it is used?  Fortunately, however, he has seen <i>The Terminator</i>, so he now admits my point to be valid, despite his previous dismissal of the case as idiotic.  As for his definition of science, I shall simply note that it differs significantly from mine, Karl Popper’s, and every English language dictionary.</p><blockquote><p>What is a science fetishist?  Would such a person worship a physics textbook written in 1983, or make offerings to a pendulum?  Naked assertions?  The emperor has no clothes, but I will maintain some coverage.  That is some bad writing, even to respond to even worse writing.</p></blockquote><p>A science fetishist is someone who regards the current state of scientage as definitive and elevates the pronouncement of scientists – particularly in the form of scientific consensus – to the level of a static and quasi-sacred scripture.  Fetish, in this sense, does not imply religious worship, only the doxastic division of labor that Daniel Dennett decries in <i>Breaking the Spell</i>.</p><blockquote><p><i>‘No one, least of all me, gives a damn about what you have read or what you might happen to think’</i></p><p>Damn, so much hospitality, I might have to wear a Kevlar vest!   I was just trying to have a discussion of logic and humor.  Your writing is so ironically humorous that I felt compelled to respond.</p></blockquote><p>Guests who manage to avoid pissing on the Persians are treated with considerably more hospitality than those who enter uninvited and promptly exhibit all the continence of an elderly dog with a bladder infection.</p><blockquote><p><i>‘Your childish advice to ignore the benefits of health care due to legitimate concerns about bioweapons is totally illogical, as is your ridiculous notion that I don’t understand something as simple as the scientific method.’</i></p><p>Bioweapons? Where did that come from?  Again, Wow!  That is what you wrote.  Bioweapons, becomes an excuse?  From your own writings, it would seem that modern hospitals are places of danger (due to that menace, science), so again, I recommend that you set up more bible appropriate hospital.</p></blockquote><p>Bioweapons, along with numerous other potentially lethal threats to Mankind, are the products of science, specifically, the result of scientistry utilizing scientody.  Since Derek is attempting to criticize my case against science, bioweapons are not only every bit as pertinent to the discussion as modern hospitals, they are actually more relevant due to the many non-scientific factors that contributed to the development of modern hospitals and medical care.  Derek is apparently unaware that religious hospitals are the fastest growing hospitals in the United States; religious hospitals provide at least 20 percent of the total beds.</p><blockquote><p>Much of what I have seen, regarding evangelicals and fundamentalists, is all about forcing some very restrictive and superstitious type of life on everyone in this country that was founded on freedom from a king and religious freedom.  So, I am bothered by those that push their religion in my face and try to legislate my obedience to it.  Whatever, happened to choice?  I can appreciate your response and your conviction, but it seems so silly to me and it is a beautiful spring day, so I will go out and enjoy it.  I will be riding a vintage schwinn with such things as brazing, gear ratios and other science things.</p></blockquote><p>It was Derek’s choice to read my column, I did not push it in his face.  Moreover, I am a libertarian and I have never called for legislative restrictions on science, in fact, I have even warned of the negative consequences for science that will likely stem from the Title IX legislation that is in the process of being applied to science departments across the nation.</p></div>",
  "content_text": "Derek proves to be a gift that keeps on giving.  I can understand why some cynics might believe that I invent these critics, note how his attempts at criticism, as hapless as they may be, are actually more substantive and relevant than the sort usually provided by the likes of PZ, Orac, and the Sciencebloggers.\nI can’t complain about a quick response.  A personal insult immediately in your response, how very… expected.  Anyway, maybe my stupid mind can accept aspects of science being dangerous to humanity.   I have seen the terminator and matrix movies, so you actually make a valid point.  However, from your writing, you have no where near the science and math education that I have.  Your writing shows a complete misunderstanding of the scientific method.\nI know some about Feynman, but he was a scientist.  Not knowing his entire history, I plead ignorance, but if he did not follow the scientific method, then he would have been discredited quickly, because that is how the scientific method works, as opposed to blind faith in what is comfortable.  The scientific method is simply observing reality and not clinging to silly stories.  It is not religious, yet religious types should not be so fearful.  They have been used for many years by very greedy criminals that represent less than 1% of the population.  I prefer democracy and science, because it represents what a vast majority want, and that includes me.\nLet me get this straight.  The guy emails to declare one of my columns “the most idiotic thing he has ever read” then complains about getting personally insulted when he is described – accurately, I think – as stupid for failing to comprehend that science is merely a tool that can be either harmful or beneficial depending upon how it is used?  Fortunately, however, he has seen\nThe Terminator\n, so he now admits my point to be valid, despite his previous dismissal of the case as idiotic.  As for his definition of science, I shall simply note that it differs significantly from mine, Karl Popper’s, and every English language dictionary.\nWhat is a science fetishist?  Would such a person worship a physics textbook written in 1983, or make offerings to a pendulum?  Naked assertions?  The emperor has no clothes, but I will maintain some coverage.  That is some bad writing, even to respond to even worse writing.\nA science fetishist is someone who regards the current state of scientage as definitive and elevates the pronouncement of scientists – particularly in the form of scientific consensus – to the level of a static and quasi-sacred scripture.  Fetish, in this sense, does not imply religious worship, only the doxastic division of labor that Daniel Dennett decries in\nBreaking the Spell\n.\n‘No one, least of all me, gives a damn about what you have read or what you might happen to think’\nDamn, so much hospitality, I might have to wear a Kevlar vest!   I was just trying to have a discussion of logic and humor.  Your writing is so ironically humorous that I felt compelled to respond.\nGuests who manage to avoid pissing on the Persians are treated with considerably more hospitality than those who enter uninvited and promptly exhibit all the continence of an elderly dog with a bladder infection.\n‘Your childish advice to ignore the benefits of health care due to legitimate concerns about bioweapons is totally illogical, as is your ridiculous notion that I don’t understand something as simple as the scientific method.’\nBioweapons? Where did that come from?  Again, Wow!  That is what you wrote.  Bioweapons, becomes an excuse?  From your own writings, it would seem that modern hospitals are places of danger (due to that menace, science), so again, I recommend that you set up more bible appropriate hospital.\nBioweapons, along with numerous other potentially lethal threats to Mankind, are the products of science, specifically, the result of scientistry utilizing scientody.  Since Derek is attempting to criticize my case against science, bioweapons are not only every bit as pertinent to the discussion as modern hospitals, they are actually more relevant due to the many non-scientific factors that contributed to the development of modern hospitals and medical care.  Derek is apparently unaware that religious hospitals are the fastest growing hospitals in the United States; religious hospitals provide at least 20 percent of the total beds.\nMuch of what I have seen, regarding evangelicals and fundamentalists, is all about forcing some very restrictive and superstitious type of life on everyone in this country that was founded on freedom from a king and religious freedom.  So, I am bothered by those that push their religion in my face and try to legislate my obedience to it.  Whatever, happened to choice?  I can appreciate your response and your conviction, but it seems so silly to me and it is a beautiful spring day, so I will go out and enjoy it.  I will be riding a vintage schwinn with such things as brazing, gear ratios and other science things.\nIt was Derek’s choice to read my column, I did not push it in his face.  Moreover, I am a libertarian and I have never called for legislative restrictions on science, in fact, I have even warned of the negative consequences for science that will likely stem from the Title IX legislation that is in the process of being applied to science departments across the nation.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-10T05:25:00+00:00"
}