{
  "url": "https://voxday.net/2009/05/29/only-good-police-shooting/",
  "scraped_at": "2026-01-08T22:57:24.980863",
  "title": "The only good police shooting",
  "date_display": "May 29, 2009",
  "date_iso": "2009-05-29T17:06:00+00:00",
  "date_from_url": "2009-05-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Is a police-on-police shooting.*  But they’re the good guys?  Right, only good guys would ever occupy themselves with <a href=\"http://www.break.com/index/highway-patrol-gets-in-fight-withemt.html\">pulling over and attacking EMTs</a> and <a href=\"http://www.nytimes.com/2009/05/30/nyregion/30cop.html?hp\">shooting their fellow officers</a>.</p><p>Here’s a simple lesson, Mr. Policeman.  If the guy is driving an ambulance, he’s the good guy.  Not you.  See, he’s the guy actually saving lives, he’s not the guy with the gun and the badge pretending to enforce the law so long as it doesn’t conflict with what the politicians expect. <i>And don’t shoot someone just because he has a gun!  If he’s pointing it at you and he’s not in his own house, fine, blast away.  But if he’s not aiming or shooting at you, master your adrenaline and hold your damn fire!</i></p><p>Of course, as we all know, the fatal shooting will be investigated and the policeman who pulled the trigger will be exonerated, because no police killing is ever unjustified.  The only possible conclusion is that Officer Edwards was up to no good and merited killing.  It’s a pity police-on-police killings don’t happen more often.  If they did, the trigger-happy morons with badges wouldn’t be so quick to draw and fire in the knowledge that they’ll get away with murder.</p><p>*<i>Okay, police have the same right to self-defense that anyone else does.  But they don’t have any more right to self defense than anyone else either.</i></p></div>",
  "content_text": "Is a police-on-police shooting.*  But they’re the good guys?  Right, only good guys would ever occupy themselves with\npulling over and attacking EMTs\nand\nshooting their fellow officers\n.\nHere’s a simple lesson, Mr. Policeman.  If the guy is driving an ambulance, he’s the good guy.  Not you.  See, he’s the guy actually saving lives, he’s not the guy with the gun and the badge pretending to enforce the law so long as it doesn’t conflict with what the politicians expect.\nAnd don’t shoot someone just because he has a gun!  If he’s pointing it at you and he’s not in his own house, fine, blast away.  But if he’s not aiming or shooting at you, master your adrenaline and hold your damn fire!\nOf course, as we all know, the fatal shooting will be investigated and the policeman who pulled the trigger will be exonerated, because no police killing is ever unjustified.  The only possible conclusion is that Officer Edwards was up to no good and merited killing.  It’s a pity police-on-police killings don’t happen more often.  If they did, the trigger-happy morons with badges wouldn’t be so quick to draw and fire in the knowledge that they’ll get away with murder.\n*\nOkay, police have the same right to self-defense that anyone else does.  But they don’t have any more right to self defense than anyone else either.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-29T16:06:00+00:00"
}