{
  "url": "https://voxday.net/2009/05/29/reliability-of-government-statistics/",
  "scraped_at": "2026-01-08T22:57:21.289210",
  "title": "The reliability of government statistics",
  "date_display": "May 29, 2009",
  "date_iso": "2009-05-29T09:19:00+00:00",
  "date_from_url": "2009-05-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It seems that Shadowstats’s <a href=\"http://www.shadowstats.com/article/consumer_price_index\">criticism of the Consumer Price Indices</a> produced by the Bureau of Labor Statistics sufficiently annoyed the BLS economists enough that they produced a 17-page rebuttal entitled “<a href=\"http://www.bls.gov/opub/mlr/2008/08/art1full.pdf\">Addressing misconceptions about the Consumer Price Index</a>“.  In that report, the BLS attempted to prove that the Shadowstats SGS-1980 adjustments significantly overestimate cumulative inflation, which from April 1998 to April 2008 was reported at 32 percent according to the BLS’s own CPI-U.  However, when reading the report, I couldn’t help but notice two things.  First, they didn’t include another, more conservative Shadowstats adjustment, SGS-1990.  Second, in the table that compared the estimated SGS-1980 projections to actual price changes, they didn’t include what the CPI-U projected.  Should one trouble to run the numbers, it’s not hard to see why they elected to omit that rather pertinent information.</p><p><a href=\"http://3.bp.blogspot.com/_3UXl0oMYPLs/Sh-quCNhX4I/AAAAAAAAAH0/lOeH5WZxQUc/s1600-h/SGSvCPI.jpg\" onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\"><noscript><img alt=\"\" border=\"0\" decoding=\"async\" id=\"BLOGGER_PHOTO_ID_5341175390928985986\" src=\"http://www.milobookclub.com/wp-content/uploads/2009/05/SGSvCPI.jpg\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;width: 400px; height: 234px;\"/></noscript><img alt=\"\" border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2009/05/SGSvCPI.jpg\" decoding=\"async\" id=\"BLOGGER_PHOTO_ID_5341175390928985986\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" style=\"display:block; margin:0px auto 10px; text-align:center;cursor:pointer; cursor:hand;width: 400px; height: 234px;\"/></a><br>In order to demonstrate that Williams’s figures are wrong, the BLS showed that the average delta in the prices of goods they selected was 81.7 percent over the specified ten-year period  (They actually cheated and included two income-related figures that are not included in the CPI for the obvious reason that wages and income are not consumer goods; even so, that only reduced the average to 71.7 percent.)  This is certainly an interesting way to attempt defending the credibility of a reporting methodology that provides a figure of 32 percent, but it is not a very effective means of doing so.  In case the obvious conclusion has escaped the attention of the mathematically challenged, let me hasten to point out that 32 does not equal 81.7.</br></p><p>The BLS economists argue in their rebuttal that if it weren’t for that pesky increase in energy prices, the performance of the CPI-U would have been pretty good, of course, that defense would be far more meaningful if we were still living in a society that depended upon horse-drawn carriages for transportation and firewood for heating.  Moreover, even if the three energy-related prices are excluded, CPI-U still comes in on the low side of the actual prices reported two-thirds of the time, 4.5 percent on average.  On an annual basis, that would indicate an additional half-percent of inflation per year that is not included in the official BLS statistic.</p></div>",
  "content_text": "It seems that Shadowstats’s\ncriticism of the Consumer Price Indices\nproduced by the Bureau of Labor Statistics sufficiently annoyed the BLS economists enough that they produced a 17-page rebuttal entitled “\nAddressing misconceptions about the Consumer Price Index\n“.  In that report, the BLS attempted to prove that the Shadowstats SGS-1980 adjustments significantly overestimate cumulative inflation, which from April 1998 to April 2008 was reported at 32 percent according to the BLS’s own CPI-U.  However, when reading the report, I couldn’t help but notice two things.  First, they didn’t include another, more conservative Shadowstats adjustment, SGS-1990.  Second, in the table that compared the estimated SGS-1980 projections to actual price changes, they didn’t include what the CPI-U projected.  Should one trouble to run the numbers, it’s not hard to see why they elected to omit that rather pertinent information.\nIn order to demonstrate that Williams’s figures are wrong, the BLS showed that the average delta in the prices of goods they selected was 81.7 percent over the specified ten-year period  (They actually cheated and included two income-related figures that are not included in the CPI for the obvious reason that wages and income are not consumer goods; even so, that only reduced the average to 71.7 percent.)  This is certainly an interesting way to attempt defending the credibility of a reporting methodology that provides a figure of 32 percent, but it is not a very effective means of doing so.  In case the obvious conclusion has escaped the attention of the mathematically challenged, let me hasten to point out that 32 does not equal 81.7.\nThe BLS economists argue in their rebuttal that if it weren’t for that pesky increase in energy prices, the performance of the CPI-U would have been pretty good, of course, that defense would be far more meaningful if we were still living in a society that depended upon horse-drawn carriages for transportation and firewood for heating.  Moreover, even if the three energy-related prices are excluded, CPI-U still comes in on the low side of the actual prices reported two-thirds of the time, 4.5 percent on average.  On an annual basis, that would indicate an additional half-percent of inflation per year that is not included in the official BLS statistic.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-29T08:19:00+00:00"
}