{
  "url": "https://voxday.net/2009/05/22/science-and-science-blogger/",
  "scraped_at": "2026-01-08T22:56:51.581411",
  "title": "Science and the science blogger",
  "date_display": "May 22, 2009",
  "date_iso": "2009-05-22T14:15:00+00:00",
  "date_from_url": "2009-05-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>Mirabile dictu</i>, but a ScienceBlogs blogger actually manages to read and <a href=\"http://scienceblogs.com/builtonfacts/2009/05/physics_cookbooks_and_vox_day.php\">correctly comprehend one of my posts</a> about science:</p><blockquote><p> I own well over two dozen physics textbooks, and on a little thinking and poking, I note that as far as I know not a single one of them tries to define science. I’m pretty sure none of them even try to define physics. Even the freshman intro text only makes passing comment about how physics requires measurement before launching into a discussion of the SI units….  I know science isn’t all that hard to get a handle on, but of course there’s intrinsically some fuzziness or else that whole “philosophy of science” thing would have been put to bed a long time ago.</p></blockquote><p>It is one of the great ironies of the day that the very foundation of materialist philosophy should be so utterly nebulous as “science”.  For all that the basic method of science is quite simple to understand, nearly everyone seems to have a different definition of it, as was shown in <a href=\"http://www.milobookclub.com/2009/05/12/science-by-book/\">the various quotations</a> from different science textbooks.  I ran into yet another one just two days ago, when I began reading Michael Shermer’s intriguing <i>The Mind of the Market</i>.  (About which I will write more in the near future, those who think my contempt for the New Atheists applies indiscriminately to all atheists will probably be confounded by my forthcoming review of the book; as if I’m likely to be prejudiced <i>against</i> an author who kicks things off with a quote from <i>Human Action</i>.)</p><p>Shermer writes: <i>“Darwin’s Dictum encodes the philosophy of science of this book: if observations are to be of any use they must be tested against some view—a thesis, model, hypothesis, theory, or paradigm. Since the facts never just speak for themselves, they must be interpreted through the colored lenses of ideas—percepts need concepts. Science is an exquisite blend of data and theory—percepts and concepts—that together form the bedrock for the foundation of science, the greatest tool ever devised for understanding how the world works.”</i></p><p>Shermer derived his dictum from an 1861 letter from Charles Darwin to an economist named Henry Fawcett, in which Darwin wrote: <i>“[A]ll observation must be for or against some view if it is to be of any service!”</i></p><p>Needless to say, Darwin’s Dictum is far from the impartial, objective, and imperial image of science that is put about by propagandists such as Richard Dawkins and echoed by the science fetish freaks.  The gap between science as it is actually practiced and the myth of science is largely the result of efforts of some – not all – secular humanists to coopt science in defense of their philosophical, political, and ideological ends.  A real scientist wouldn’t get his knickers in a twist over evolution, creationism, or even the Hindu creation account being taught to fifth-graders, as he would realize:</p><p>1) Very, very few of these kids will ever become scientists in a field that involves a related science.</p><p>2) The current system of science education is producing too many grad students and PhDs already.</p><p>3) The schools are already struggling to teach children basic reading and arithmetic and don’t even attempt to try teaching them skills that most of them will actually need, such as how to fill out a tax form or apply for a loan.</p><p>Defending the objective purity of science never been the noble question of “truth” that the science fetishists often pretend it to be; the same ignoramuses who fret continually about children being exposed to anti-Darwinian ideas actively push economic and political concepts that have been far more conclusively demolished, in some cases, for centuries.  The historically established conclusion that there never were any “Dark Ages” has been in the encyclopedias for more than seventy years, and yet many of those who worry about science education frame it as their fear of a second “dark age”.</p><p>As has proven to be the case with journalism, the notion of objective science is little more than a modern charade.  Shermer is right; interpretation is a significant part of the process and therefore science must be more open and open-minded if it is to prosper.  If, on the other hand, it follows the rigid and dogmatic path of its purported defenders such as Richard Dawkins and many of the writers at ScienceBlogs, it will continue to ossify and become less relevant.  In fact, if the would-be secular priesthood gets its way, science will not only become a less useful tool to understand how the world works, it will become an important means of inhibiting an understanding of how the world works.</p><p>And in answer to Built on Facts’s ruminations, I would say that the reason that biology textbooks appear to be more concerned with definitions than physics textbooks is because the textbook writers know their claim to the mantle of falsfiable objectivity and scientody is tenuous and also because they are attempting to artificially restrict the bounds of what is deemed to be legitimate scientific inquiry.</p></div>",
  "content_text": "Mirabile dictu\n, but a ScienceBlogs blogger actually manages to read and\ncorrectly comprehend one of my posts\nabout science:\nI own well over two dozen physics textbooks, and on a little thinking and poking, I note that as far as I know not a single one of them tries to define science. I’m pretty sure none of them even try to define physics. Even the freshman intro text only makes passing comment about how physics requires measurement before launching into a discussion of the SI units….  I know science isn’t all that hard to get a handle on, but of course there’s intrinsically some fuzziness or else that whole “philosophy of science” thing would have been put to bed a long time ago.\nIt is one of the great ironies of the day that the very foundation of materialist philosophy should be so utterly nebulous as “science”.  For all that the basic method of science is quite simple to understand, nearly everyone seems to have a different definition of it, as was shown in\nthe various quotations\nfrom different science textbooks.  I ran into yet another one just two days ago, when I began reading Michael Shermer’s intriguing\nThe Mind of the Market\n.  (About which I will write more in the near future, those who think my contempt for the New Atheists applies indiscriminately to all atheists will probably be confounded by my forthcoming review of the book; as if I’m likely to be prejudiced\nagainst\nan author who kicks things off with a quote from\nHuman Action\n.)\nShermer writes:\n“Darwin’s Dictum encodes the philosophy of science of this book: if observations are to be of any use they must be tested against some view—a thesis, model, hypothesis, theory, or paradigm. Since the facts never just speak for themselves, they must be interpreted through the colored lenses of ideas—percepts need concepts. Science is an exquisite blend of data and theory—percepts and concepts—that together form the bedrock for the foundation of science, the greatest tool ever devised for understanding how the world works.”\nShermer derived his dictum from an 1861 letter from Charles Darwin to an economist named Henry Fawcett, in which Darwin wrote:\n“[A]ll observation must be for or against some view if it is to be of any service!”\nNeedless to say, Darwin’s Dictum is far from the impartial, objective, and imperial image of science that is put about by propagandists such as Richard Dawkins and echoed by the science fetish freaks.  The gap between science as it is actually practiced and the myth of science is largely the result of efforts of some – not all – secular humanists to coopt science in defense of their philosophical, political, and ideological ends.  A real scientist wouldn’t get his knickers in a twist over evolution, creationism, or even the Hindu creation account being taught to fifth-graders, as he would realize:\n1) Very, very few of these kids will ever become scientists in a field that involves a related science.\n2) The current system of science education is producing too many grad students and PhDs already.\n3) The schools are already struggling to teach children basic reading and arithmetic and don’t even attempt to try teaching them skills that most of them will actually need, such as how to fill out a tax form or apply for a loan.\nDefending the objective purity of science never been the noble question of “truth” that the science fetishists often pretend it to be; the same ignoramuses who fret continually about children being exposed to anti-Darwinian ideas actively push economic and political concepts that have been far more conclusively demolished, in some cases, for centuries.  The historically established conclusion that there never were any “Dark Ages” has been in the encyclopedias for more than seventy years, and yet many of those who worry about science education frame it as their fear of a second “dark age”.\nAs has proven to be the case with journalism, the notion of objective science is little more than a modern charade.  Shermer is right; interpretation is a significant part of the process and therefore science must be more open and open-minded if it is to prosper.  If, on the other hand, it follows the rigid and dogmatic path of its purported defenders such as Richard Dawkins and many of the writers at ScienceBlogs, it will continue to ossify and become less relevant.  In fact, if the would-be secular priesthood gets its way, science will not only become a less useful tool to understand how the world works, it will become an important means of inhibiting an understanding of how the world works.\nAnd in answer to Built on Facts’s ruminations, I would say that the reason that biology textbooks appear to be more concerned with definitions than physics textbooks is because the textbook writers know their claim to the mantle of falsfiable objectivity and scientody is tenuous and also because they are attempting to artificially restrict the bounds of what is deemed to be legitimate scientific inquiry.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-22T13:15:00+00:00"
}