{
  "url": "https://voxday.net/2009/05/12/science-by-book/",
  "scraped_at": "2026-01-08T22:55:56.395893",
  "title": "Science, by the book",
  "date_display": "May 12, 2009",
  "date_iso": "2009-05-12T18:22:00+00:00",
  "date_from_url": "2009-05-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Perhaps those who believe I do not understand science could inform me which of these textbook definitions – helpfully provided by NS – is the correct one.  Because after reading all of these competing definitions, I have to admit, maybe I don’t understand it.  It’s rather strange, isn’t it, that the very method science fetishists inform us is the only means of precisely determining the truth should be so… nebulous.  It’s no wonder biologists are so hopelessly imprecise about everything, considering their textbooks.*</p><p><i>Living Enviroment</i> by Ratzh and Colvert: Scientific inquiry includes questions, observations and inference, experimentation, collecting and organizing data, repeating experiments, and peer review.</p><p><i>Biology, The Study of Life</i> by Sachraer and Stolzte: The scientific method consists of defining the problem, formulating a hypothesis, testing the hypothesis, observing and measuring, analyzing and drawing conclusions, and reporting observations.</p><p><i>Biology” by Mills and Levine</i>: Science involves evidence based on observation, interpreting the evidence, and explaining the evidence.  Scientists work by studying the evidence, forming a hypothesis, setting up a controlled experiment, recoding and analyzing the results, drawing conclusions, publishing and repeating the investigation.  If a controlled experiment isn’t possible, then they substitute field work.</p><p><i>Evironmental Science</i> by Karen Arms: There is more then one scientific method. These can include observing, hypothesizing and predicting, experimenting, organizing and interpreting information, using graphs, sharing information, and communicating results.  [I hope it’s this one… I totally drew a graph yesterday! – VD]</p><p><i>Modern Earth Science</i> by Sager, Rancey, Phillips and Watenpaugh: Scientific methods include stating the problem, gathering information, forming a hypothesis, testing the hypothesis by experiment, and stating a conclusion.</p><p><i>Earth Science</i> by Spaulding and Namowitz: Scientific thinking includes observations, gathering evidence,  formulating a hypothesis, skeptical questioning, analyzing what is known, and using math and technology. The scientific methods of inquiry involve collecting data, analyzing the data, testing the hypothesis, and peer review in scientific journals.</p><p><i>Holt Science and Technology: Earth Science</i>: Scientific methods do not have a set procedure, but they can include some or all of the following, asking a question, forming a hypothesis, testing by controlled experiment, making observations, keeping records, analyzing results, drawing conclusions, and communicating results.</p><p><i>Nature Physics</i> by David Goodstein: Science is whatever scientists do.</p><p>*<i>In fairness, after reading the original 1948 text of Paul Samuelson’s seminal <b>Economics</b>, it’s not hard to discern why the nation is over its ears in debt.  Because, you see, for sixty years, economists have been taught that debt doesn’t count so long as it’s INTERNAL.</i></p></div>",
  "content_text": "Perhaps those who believe I do not understand science could inform me which of these textbook definitions – helpfully provided by NS – is the correct one.  Because after reading all of these competing definitions, I have to admit, maybe I don’t understand it.  It’s rather strange, isn’t it, that the very method science fetishists inform us is the only means of precisely determining the truth should be so… nebulous.  It’s no wonder biologists are so hopelessly imprecise about everything, considering their textbooks.*\nLiving Enviroment\nby Ratzh and Colvert: Scientific inquiry includes questions, observations and inference, experimentation, collecting and organizing data, repeating experiments, and peer review.\nBiology, The Study of Life\nby Sachraer and Stolzte: The scientific method consists of defining the problem, formulating a hypothesis, testing the hypothesis, observing and measuring, analyzing and drawing conclusions, and reporting observations.\nBiology” by Mills and Levine\n: Science involves evidence based on observation, interpreting the evidence, and explaining the evidence.  Scientists work by studying the evidence, forming a hypothesis, setting up a controlled experiment, recoding and analyzing the results, drawing conclusions, publishing and repeating the investigation.  If a controlled experiment isn’t possible, then they substitute field work.\nEvironmental Science\nby Karen Arms: There is more then one scientific method. These can include observing, hypothesizing and predicting, experimenting, organizing and interpreting information, using graphs, sharing information, and communicating results.  [I hope it’s this one… I totally drew a graph yesterday! – VD]\nModern Earth Science\nby Sager, Rancey, Phillips and Watenpaugh: Scientific methods include stating the problem, gathering information, forming a hypothesis, testing the hypothesis by experiment, and stating a conclusion.\nEarth Science\nby Spaulding and Namowitz: Scientific thinking includes observations, gathering evidence,  formulating a hypothesis, skeptical questioning, analyzing what is known, and using math and technology. The scientific methods of inquiry involve collecting data, analyzing the data, testing the hypothesis, and peer review in scientific journals.\nHolt Science and Technology: Earth Science\n: Scientific methods do not have a set procedure, but they can include some or all of the following, asking a question, forming a hypothesis, testing by controlled experiment, making observations, keeping records, analyzing results, drawing conclusions, and communicating results.\nNature Physics\nby David Goodstein: Science is whatever scientists do.\n*\nIn fairness, after reading the original 1948 text of Paul Samuelson’s seminal\nEconomics\n, it’s not hard to discern why the nation is over its ears in debt.  Because, you see, for sixty years, economists have been taught that debt doesn’t count so long as it’s INTERNAL.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-12T17:22:00+00:00"
}