{
  "url": "https://voxday.net/2009/05/08/snipe-and-scoo/",
  "scraped_at": "2026-01-08T22:55:32.607289",
  "title": "Snipe and scoot",
  "date_display": "May 8, 2009",
  "date_iso": "2009-05-08T07:46:00+00:00",
  "date_from_url": "2009-05-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Our favorite community college figure continues to <a href=\"http://scienceblogs.com/pharyngula/2009/05/thoughtcrime_does_not_entail_d.php\">snipe away safely from the sidelines</a>.  It’s a pity he’s still afraid to engage in any form of debate that threatens to <a href=\"http://www.milobookclub.com/2009/01/27/why-fowl-atheist-ran-away/\">unmask his intellectual inferiority</a> in front of his howling herd of scat-throwing science fetishists.  Yesterday, he posted about <a href=\"http://www.independent.ie/opinion/letters/label-atheism-a-thought-crime-1726762.html\">a letter to the editor</a> of the Independent from an Irish fan of TIA:</p><blockquote><p>Really, you can’t make this stuff up. An angry letter writer hates those atheists who are making all that racket, and believes that Vox Day’s awful little anti-atheist book refutes them all perfectly. You’re probably already questioning his sanity and intelligence, but then he takes one more step to impeach his own judgment.</p><p> <i>“This brilliant critique clearly demonstrates why a mere anti-blasphemy law is not sufficient. In the interests of rationality and common sense, the legislation should go further and label atheism a thought crime.”</i></p><p>Wait, what? Has he read 1984? Does he understand what a thought crime is? Does he understand that the book is a critique of totalitarianism?</p></blockquote><p>The Fowl Atheist is such a parochial little peasant sometimes.  He clearly has no idea that the European nations already possess a host of laws banning thought crimes; the Irish writer is merely suggesting that atheism merits being added to the long list of them.  The list already includes such crimes as “xenophobia against non-nationals, particularly migrants, refugees and asylum-seekers”, “aggressive nationalism”, and “denial of the Holocaust and crimes against humanity”.  And then, there is the notorious case of <a href=\"http://www.dailymail.co.uk/news/article-410150/Schoolgirl-arrested-refusing-study-non-English-pupils.html\">the English schoolgirl arrested for “racism”</a>.  The EU is actively attempting to standardize and codify these various thought crimes across Europe as per <a href=\"http://www.eurojewcong.org/ejc/DOC/Convention.pdf\">The European Framework Convention on Promoting Tolerance and Combating Intolerance</a>.  One would think that even a community college professor would have understood this context since that he is <a href=\"http://scienceblogs.com/pharyngula/2009/02/talk_fast_we_might_be_criminal.php\">clearly aware of the UN resolution</a> calling for all countries to alter their legal and constitutional systems in order to prevent “defamation of religions”.</p><p>Given the TIA reader’s reference to current European legal debate, it’s pretty obvious he was reasoning that because “denial of the Holocaust” is a crime, there is absolutely no logical reason why “denial of God” should not be as well.  There is no scientific evidence for either, after all, the only evidence for either is all that eyewitness testimony, archeological material, and historical documentation that atheists find so unreliable.  And one could quite legitimately argue that there is actually greater justification for banning the “denial of God” since it’s a well-documented fact that those guilty of denying the existence of God have committed far more, and far worse, material crimes in Europe than those those who have denied the existence of the Holocaust.</p><p>Moreover, if Myers had actually read <i>The Irrational Atheist</i> – by his own admission, he has not – he would know that I spend an entire section, entitled “Resurrecting the Red Hand of Reason”, showing how the secular Enlightenment humanism being pushed by the likes of Richard Dawkins and Daniel Dennett is directly connected to the increasingly totalitarian organization that is actually doing what PZ hypothetically fears, the European Union.  This philosophical blind spot is exactly why I wrote the following in TIA: <i>“The terrible tragedy of the New Atheists is that they are laboring to lay the foundation for yet another reprisal of the very horrors they think to permanently prevent in the name of Reason.”</i></p><p>Now, I can’t claim to know exactly what Mr. Conway was thinking when he wrote his letter, but given that he thinks so highly of a book written by an extreme libertarian that explicitly warns of the growing danger of European totalitarianism, I tend to suspect his call for making atheism a thought crime is more than a little tongue-in-cheek.  Since PZ has repeatedly shown himself to be incapable of either rational debate or substantive criticism, it should come as no surprise that he should also be unable to detect such sarcasm.</p><p>As for the comments, I merely note the irony inherent in fans of the New Atheists attempting to question the logical capacities of their critics.  Finally, since PZ so fears verbal debate, let him know that I am perfectly willing to engage him in a written debate concerning any argument I have made in the book that he describes as “awful”.  I’m sure many people on either side of the discourse would be interested to know which of the many refutations it contains are believed by PZ to be insufficient, especially since Sam Harris has openly conceded a number of them.  After all, if the book and the arguments it contains are actually as awful as he claims, he should have absolutely no problem demonstrating that in a format that does not require the mental quickness that he lacks.</p></div>",
  "content_text": "Our favorite community college figure continues to\nsnipe away safely from the sidelines\n.  It’s a pity he’s still afraid to engage in any form of debate that threatens to\nunmask his intellectual inferiority\nin front of his howling herd of scat-throwing science fetishists.  Yesterday, he posted about\na letter to the editor\nof the Independent from an Irish fan of TIA:\nReally, you can’t make this stuff up. An angry letter writer hates those atheists who are making all that racket, and believes that Vox Day’s awful little anti-atheist book refutes them all perfectly. You’re probably already questioning his sanity and intelligence, but then he takes one more step to impeach his own judgment.\n“This brilliant critique clearly demonstrates why a mere anti-blasphemy law is not sufficient. In the interests of rationality and common sense, the legislation should go further and label atheism a thought crime.”\nWait, what? Has he read 1984? Does he understand what a thought crime is? Does he understand that the book is a critique of totalitarianism?\nThe Fowl Atheist is such a parochial little peasant sometimes.  He clearly has no idea that the European nations already possess a host of laws banning thought crimes; the Irish writer is merely suggesting that atheism merits being added to the long list of them.  The list already includes such crimes as “xenophobia against non-nationals, particularly migrants, refugees and asylum-seekers”, “aggressive nationalism”, and “denial of the Holocaust and crimes against humanity”.  And then, there is the notorious case of\nthe English schoolgirl arrested for “racism”\n.  The EU is actively attempting to standardize and codify these various thought crimes across Europe as per\nThe European Framework Convention on Promoting Tolerance and Combating Intolerance\n.  One would think that even a community college professor would have understood this context since that he is\nclearly aware of the UN resolution\ncalling for all countries to alter their legal and constitutional systems in order to prevent “defamation of religions”.\nGiven the TIA reader’s reference to current European legal debate, it’s pretty obvious he was reasoning that because “denial of the Holocaust” is a crime, there is absolutely no logical reason why “denial of God” should not be as well.  There is no scientific evidence for either, after all, the only evidence for either is all that eyewitness testimony, archeological material, and historical documentation that atheists find so unreliable.  And one could quite legitimately argue that there is actually greater justification for banning the “denial of God” since it’s a well-documented fact that those guilty of denying the existence of God have committed far more, and far worse, material crimes in Europe than those those who have denied the existence of the Holocaust.\nMoreover, if Myers had actually read\nThe Irrational Atheist\n– by his own admission, he has not – he would know that I spend an entire section, entitled “Resurrecting the Red Hand of Reason”, showing how the secular Enlightenment humanism being pushed by the likes of Richard Dawkins and Daniel Dennett is directly connected to the increasingly totalitarian organization that is actually doing what PZ hypothetically fears, the European Union.  This philosophical blind spot is exactly why I wrote the following in TIA:\n“The terrible tragedy of the New Atheists is that they are laboring to lay the foundation for yet another reprisal of the very horrors they think to permanently prevent in the name of Reason.”\nNow, I can’t claim to know exactly what Mr. Conway was thinking when he wrote his letter, but given that he thinks so highly of a book written by an extreme libertarian that explicitly warns of the growing danger of European totalitarianism, I tend to suspect his call for making atheism a thought crime is more than a little tongue-in-cheek.  Since PZ has repeatedly shown himself to be incapable of either rational debate or substantive criticism, it should come as no surprise that he should also be unable to detect such sarcasm.\nAs for the comments, I merely note the irony inherent in fans of the New Atheists attempting to question the logical capacities of their critics.  Finally, since PZ so fears verbal debate, let him know that I am perfectly willing to engage him in a written debate concerning any argument I have made in the book that he describes as “awful”.  I’m sure many people on either side of the discourse would be interested to know which of the many refutations it contains are believed by PZ to be insufficient, especially since Sam Harris has openly conceded a number of them.  After all, if the book and the arguments it contains are actually as awful as he claims, he should have absolutely no problem demonstrating that in a format that does not require the mental quickness that he lacks.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-08T06:46:00+00:00"
}