{
  "url": "https://voxday.net/2009/05/06/vote-until-you-get-it-rig/",
  "scraped_at": "2026-01-08T22:55:25.160727",
  "title": "Vote until you get it right",
  "date_display": "May 6, 2009",
  "date_iso": "2009-05-06T19:16:00+00:00",
  "date_from_url": "2009-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Then there’s no need to vote <a href=\"http://www.irishtimes.com/newspaper/ireland/2009/0505/1224245942995.html\">ever again</a>:</p><blockquote><p>THE SECOND referendum on the Lisbon Treaty will be held in the autumn, Minister for European Affairs Dick Roche said yesterday.  He added that as part of the process of steering its way out of recession Ireland needed to secure its position within the European Union.</p><p>Speaking in Berlin to the German Council on Foreign Relations, the Minister said he wanted to deliver the message that Ireland was coming to grips with its problems and taking decisive action to bring the Government’s finances under control, ensure the health of the banking system and improve competitiveness.</p><p>“Part of this determined effort to steer Ireland out of recession involves securing our position within the European Union by dealing decisively with the implications of last year’s referendum result and drawing the necessary lessons from it,” said Mr Roche.</p></blockquote><p>The Irish would have to be insane to approve the <s>European Constitution</s>Lisbon Treaty in this second go-round.  The EU is the cause of their current difficulties; every boom has its bust.  One hopes that the Irish are smart enough to beware of Eurocrats waving financial incentives under their noses, but in hard times, desperate people often do foolish things.</p></div>",
  "content_text": "Then there’s no need to vote\never again\n:\nTHE SECOND referendum on the Lisbon Treaty will be held in the autumn, Minister for European Affairs Dick Roche said yesterday.  He added that as part of the process of steering its way out of recession Ireland needed to secure its position within the European Union.\nSpeaking in Berlin to the German Council on Foreign Relations, the Minister said he wanted to deliver the message that Ireland was coming to grips with its problems and taking decisive action to bring the Government’s finances under control, ensure the health of the banking system and improve competitiveness.\n“Part of this determined effort to steer Ireland out of recession involves securing our position within the European Union by dealing decisively with the implications of last year’s referendum result and drawing the necessary lessons from it,” said Mr Roche.\nThe Irish would have to be insane to approve the\nEuropean Constitution\nLisbon Treaty in this second go-round.  The EU is the cause of their current difficulties; every boom has its bust.  One hopes that the Irish are smart enough to beware of Eurocrats waving financial incentives under their noses, but in hard times, desperate people often do foolish things.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-06T18:16:00+00:00"
}