{
  "url": "https://voxday.net/2009/05/27/voxiversity-iii-liberal-fascis/",
  "scraped_at": "2026-01-08T22:57:11.890726",
  "title": "Voxiversity III:Liberal Fascismby Jonah Goldberg",
  "date_display": "May 27, 2009",
  "date_iso": "2009-05-27T07:54:00+00:00",
  "date_from_url": "2009-05-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://liberalfascism.nationalreview.com/\" onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\"><noscript><img alt=\"\" border=\"0\" decoding=\"async\" src=\"http://upload.wikimedia.org/wikipedia/en/thumb/0/0d/Liberal_Fascism_%28cover%29.jpg/200px-Liberal_Fascism_%28cover%29.jpg\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;width: 200px; height: 305px;\"/></noscript><img alt=\"\" border=\"0\" class=\"lazyload\" data-src=\"http://upload.wikimedia.org/wikipedia/en/thumb/0/0d/Liberal_Fascism_%28cover%29.jpg/200px-Liberal_Fascism_%28cover%29.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\" style=\"float:left; margin:0 10px 10px 0;cursor:pointer; cursor:hand;width: 200px; height: 305px;\"/></a>It will probably surprise few of you who are intending to participate in the third Voxiversity book study that the book I have selected is Jonah Goldberg’s excellent <i>Liberal Fascism</i>.  I put this off a few months because while I know that many of you already own a copy, I thought it would be beneficial for those who don’t if we waited until <a href=\"http://www.amazon.com/Liberal-Fascism-American-Mussolini-Politics/dp/0767917189/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1243411087&amp;sr=8-1\">the paperback edition was available</a>.  The paperback will be released on June 2nd, so if you’re interested in participating and don’t have the book yet, you should <a href=\"http://www.amazon.com/Liberal-Fascism-American-Mussolini-Politics/dp/0767917189/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1243411087&amp;sr=8-1\">order it now from Amazon</a> or put a copy on hold at your local bookstore.  The first quiz will be posted Saturday, June 13th on the 24-page introduction, <i>“Everything You Know About Fascism is Wrong”</i>.  I’ll post reminders on June 2nd and June 6th; those who are eager to leap into discussing the book are encouraged to do so if they wish.</p><p>I highly recommend taking part in UV-III because <i>Liberal Fascism</i> is not only an important book in understanding the true shape of the ideological spectrum and the history of early 20th century politics, it’s a very timely book that is likely to prove helpful in comprehending what will otherwise appear to be seemingly senseless actions of the current presidential administration.  It is a well-researched, intelligent book, and as an Italian speaker who has been privy to untranslated material that is unavailable to Jonah, I can testify that his assertions and conclusions about Italian Fascism are in line with those of mainstream Italian historians of the Left and Right.  As I wrote in <a href=\"http://www.wnd.com/news/article.asp?ARTICLE_ID=59446\">my review of the book</a> in 2007, it is well worth reading by anyone who has ever been called a fascist, has ever called anyone else a fascist, or simply wishes to understand the history of the ideologies that pervade modern American politics.</p><p>For those unfamiliar with the concept, a Voxiversity is designed to encourage you to not only read the book, but to nail down its details and grok its fullness.  The weekly quizzes are not tests of achievement, they are merely there to cement the information in your brain.  If you’re curious to know more about it, here’s <a href=\"http://www.milobookclub.com/2009/02/02/americas-great-depression-final-exa/\">a link to the final for UV-II</a> as well as comments from some of those who participated in it.  And this time, an added bonus, the author himself has said that he will stop by from time to time to take questions posed in the comments, and the five people who average the highest scores throughout the quizzes and final will win a signed paperback edition courtesy of Jonah and his publicist, Max.</p></div>",
  "content_text": "It will probably surprise few of you who are intending to participate in the third Voxiversity book study that the book I have selected is Jonah Goldberg’s excellent\nLiberal Fascism\n.  I put this off a few months because while I know that many of you already own a copy, I thought it would be beneficial for those who don’t if we waited until\nthe paperback edition was available\n.  The paperback will be released on June 2nd, so if you’re interested in participating and don’t have the book yet, you should\norder it now from Amazon\nor put a copy on hold at your local bookstore.  The first quiz will be posted Saturday, June 13th on the 24-page introduction,\n“Everything You Know About Fascism is Wrong”\n.  I’ll post reminders on June 2nd and June 6th; those who are eager to leap into discussing the book are encouraged to do so if they wish.\nI highly recommend taking part in UV-III because\nLiberal Fascism\nis not only an important book in understanding the true shape of the ideological spectrum and the history of early 20th century politics, it’s a very timely book that is likely to prove helpful in comprehending what will otherwise appear to be seemingly senseless actions of the current presidential administration.  It is a well-researched, intelligent book, and as an Italian speaker who has been privy to untranslated material that is unavailable to Jonah, I can testify that his assertions and conclusions about Italian Fascism are in line with those of mainstream Italian historians of the Left and Right.  As I wrote in\nmy review of the book\nin 2007, it is well worth reading by anyone who has ever been called a fascist, has ever called anyone else a fascist, or simply wishes to understand the history of the ideologies that pervade modern American politics.\nFor those unfamiliar with the concept, a Voxiversity is designed to encourage you to not only read the book, but to nail down its details and grok its fullness.  The weekly quizzes are not tests of achievement, they are merely there to cement the information in your brain.  If you’re curious to know more about it, here’s\na link to the final for UV-II\nas well as comments from some of those who participated in it.  And this time, an added bonus, the author himself has said that he will stop by from time to time to take questions posed in the comments, and the five people who average the highest scores throughout the quizzes and final will win a signed paperback edition courtesy of Jonah and his publicist, Max.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-27T06:54:00+00:00"
}