{
  "url": "https://voxday.net/2009/05/14/who-will-you-believe/",
  "scraped_at": "2026-01-08T22:56:09.238355",
  "title": "Who will you believe?",
  "date_display": "May 14, 2009",
  "date_iso": "2009-05-14T18:03:00+00:00",
  "date_from_url": "2009-05-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Maxim or <a href=\"http://news.yahoo.com/s/afp/20090514/en_afp/lifestyleuspoliticsobama\">your lying eyes</a>:</p><blockquote><p>For the first time the US First Lady has made Maxim magazine’s annual top 100 list of “hottest women in the world,” with Michelle Obama making the grade at number 93.</p></blockquote><p>Beauty is in the eye of the beholder, of course, but I tend to doubt that Michelle Obama would make the top 100 list of “hottest primates in the world” if she was the only human in the contest.  I think it’s probably going a bit too far to describe her as <a href=\"http://www.youtube.com/watch?v=If9KopxdA-I\">King Kong’s baby sister</a>, but let’s face it, if one were to choose an animal analogy for her features, “gorilla-like” would spring to mind a lot faster than “aquiline”, “doe-eyed”, “vulpine”, or even “porcine”.  When people write rapturously about the supposed beauty of the Obamas, it only makes me wonder where they live.  Do they dwell in some sort of dank cave or abandoned mine inhabited solely by orcs, trolls, and goblins?</p><p>If Maxim feels the need to kiss the posterior of a national leader’s wife, they’d do a lot better to begin with <a href=\"http://i.dailymail.co.uk/i/pix/2009/04/28/article-1173949-04B16849000005DC-72_468x704.jpg\">these two</a>.</p></div>",
  "content_text": "Maxim or\nyour lying eyes\n:\nFor the first time the US First Lady has made Maxim magazine’s annual top 100 list of “hottest women in the world,” with Michelle Obama making the grade at number 93.\nBeauty is in the eye of the beholder, of course, but I tend to doubt that Michelle Obama would make the top 100 list of “hottest primates in the world” if she was the only human in the contest.  I think it’s probably going a bit too far to describe her as\nKing Kong’s baby sister\n, but let’s face it, if one were to choose an animal analogy for her features, “gorilla-like” would spring to mind a lot faster than “aquiline”, “doe-eyed”, “vulpine”, or even “porcine”.  When people write rapturously about the supposed beauty of the Obamas, it only makes me wonder where they live.  Do they dwell in some sort of dank cave or abandoned mine inhabited solely by orcs, trolls, and goblins?\nIf Maxim feels the need to kiss the posterior of a national leader’s wife, they’d do a lot better to begin with\nthese two\n.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-14T17:03:00+00:00"
}