{
  "url": "https://voxday.net/2009/05/06/why-devil-has-all-good-music/",
  "scraped_at": "2026-01-08T22:55:23.323440",
  "title": "Why the Devil has all the good music",
  "date_display": "May 6, 2009",
  "date_iso": "2009-05-06T13:20:00+00:00",
  "date_from_url": "2009-05-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Contrary to the news announced on April 9, I was informed today that <i>The Irrational Atheist</i> will not be published in the UK after all.  I’m sure you will all be astonished to know that an individual on the pub board of the Christian publishing house concerned felt very strongly that my controversial views on equality rendered the book unpublishable.  Because, after all, it’s women’s rights that are really at the true heart of Christianity and only nice, polite people should disagree with Christopher Hitchens.  So long as, you know, he doesn’t mind.</p><p>Ironically, a very similar thing happened at the publishing house that first pursued and then rejected <i>Spiting Their Pretty Faces: Why No One Wants to Marry Thirty-Something Women</i> when a single, forty-something woman on the pub board took great exception to the subject matter. Can’t imagine why.  But that’s not ironic, you say?  Well, perhaps you might agree once you understand that this happened at the same publishing house that is publishing my forthcoming book this fall.  The commissar, she is gone.</p><p>I suppose I would probably be more disappointed if I hadn’t just signed a contract to write a screenplay yesterday.  I guess if you can’t make it in the hyper-competitive world of Christian publishing, there’s always Hollywood.</p></div>",
  "content_text": "Contrary to the news announced on April 9, I was informed today that\nThe Irrational Atheist\nwill not be published in the UK after all.  I’m sure you will all be astonished to know that an individual on the pub board of the Christian publishing house concerned felt very strongly that my controversial views on equality rendered the book unpublishable.  Because, after all, it’s women’s rights that are really at the true heart of Christianity and only nice, polite people should disagree with Christopher Hitchens.  So long as, you know, he doesn’t mind.\nIronically, a very similar thing happened at the publishing house that first pursued and then rejected\nSpiting Their Pretty Faces: Why No One Wants to Marry Thirty-Something Women\nwhen a single, forty-something woman on the pub board took great exception to the subject matter. Can’t imagine why.  But that’s not ironic, you say?  Well, perhaps you might agree once you understand that this happened at the same publishing house that is publishing my forthcoming book this fall.  The commissar, she is gone.\nI suppose I would probably be more disappointed if I hadn’t just signed a contract to write a screenplay yesterday.  I guess if you can’t make it in the hyper-competitive world of Christian publishing, there’s always Hollywood.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-06T12:20:00+00:00"
}