{
  "url": "https://voxday.net/2009/05/20/william-lane-craig-on-hitchens/",
  "scraped_at": "2026-01-08T22:56:42.430226",
  "title": "William Lane Craig on Hitchens",
  "date_display": "May 20, 2009",
  "date_iso": "2009-05-20T18:01:00+00:00",
  "date_from_url": "2009-05-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In the Fish piece the other day, one of the commenters wrote something about how he thought that debating Dawkins or Hitchens would put Fish in his place.  Which is somewhat amusing, considering that <a href=\"http://www.reasonablefaith.org/site/News2?page=NewsArticle&amp;id=7123\">the New Atheists keep getting their heads handed to them</a> whenever they dare debate anyone but decrepit Anglicans and lady journalists:</p><blockquote><p>Knowing Hitchens’ penchant for denouncing and ridiculing religion, I decided to approach the subject of God’s existence, not from the standpoint of religion, but from the standpoint of philosophy. Hitchens seems to have no appreciation at all of the fact that one of the central questions of philosophy is whether God exists and that, regardless of religion, there is a long history of arguments for/against God’s existence. As a professional philosopher, I said that in the debate I was going to focus on the arguments and leave other issues aside.</p><p>This strategy worked beautifully, as Hitchens showed himself utterly incapable of interacting with the arguments in a substantive way. By his third speech he had reverted to his usual railing against God as a North Korean dictator who robs us of our freedom. Hitchens actually forfeited his closing statement in favor of taking audience questions, so that I wound up having the last word in the debate.</p><p>The reaction in the blogosphere was immediate and unanimous. Hitchens was uniformly denounced for his empty rhetoric and posturing and his failure to interact with the arguments. One atheist blogger summed it up: “Hitchens was rambling and incoherent, with the occasional rhetorical jab. Frankly, Craig spanked Hitchens like a foolish child.” For my part, I’m gratified that one of the so-called four horsemen of the new atheism should be publicly exposed in this way.</p></blockquote><p>As I’ve pointed out in TIA, and as numerous individuals from D’Souza, Wilson, and Craig have demonstrated in their debates, neither Hitchens nor Dawkins actually have any effective arguments to offer.  What little they do have is nothing more than appeals to personal experience and ad hominem attacks on irrelevant strawmen; they have absolutely no capacity for defending either their atheism or their secular humanism.  The fact that the second-tier atheists are cowardly buffoons and overmatched strippers like PZ Myers and Kelly O’Conner tends to support my contention that the New Atheist moment has come and gone.</p></div>",
  "content_text": "In the Fish piece the other day, one of the commenters wrote something about how he thought that debating Dawkins or Hitchens would put Fish in his place.  Which is somewhat amusing, considering that\nthe New Atheists keep getting their heads handed to them\nwhenever they dare debate anyone but decrepit Anglicans and lady journalists:\nKnowing Hitchens’ penchant for denouncing and ridiculing religion, I decided to approach the subject of God’s existence, not from the standpoint of religion, but from the standpoint of philosophy. Hitchens seems to have no appreciation at all of the fact that one of the central questions of philosophy is whether God exists and that, regardless of religion, there is a long history of arguments for/against God’s existence. As a professional philosopher, I said that in the debate I was going to focus on the arguments and leave other issues aside.\nThis strategy worked beautifully, as Hitchens showed himself utterly incapable of interacting with the arguments in a substantive way. By his third speech he had reverted to his usual railing against God as a North Korean dictator who robs us of our freedom. Hitchens actually forfeited his closing statement in favor of taking audience questions, so that I wound up having the last word in the debate.\nThe reaction in the blogosphere was immediate and unanimous. Hitchens was uniformly denounced for his empty rhetoric and posturing and his failure to interact with the arguments. One atheist blogger summed it up: “Hitchens was rambling and incoherent, with the occasional rhetorical jab. Frankly, Craig spanked Hitchens like a foolish child.” For my part, I’m gratified that one of the so-called four horsemen of the new atheism should be publicly exposed in this way.\nAs I’ve pointed out in TIA, and as numerous individuals from D’Souza, Wilson, and Craig have demonstrated in their debates, neither Hitchens nor Dawkins actually have any effective arguments to offer.  What little they do have is nothing more than appeals to personal experience and ad hominem attacks on irrelevant strawmen; they have absolutely no capacity for defending either their atheism or their secular humanism.  The fact that the second-tier atheists are cowardly buffoons and overmatched strippers like PZ Myers and Kelly O’Conner tends to support my contention that the New Atheist moment has come and gone.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2009-05-20T17:01:00+00:00"
}