{
  "url": "https://voxday.net/2016/12/14/a-sea-of-skulls-lugbo/",
  "scraped_at": "2025-12-18T02:10:17.669695",
  "title": "A SEA OF SKULLS: Lugbol",
  "date_display": "December 14, 2016",
  "date_iso": "2016-12-14T01:00:00+00:00",
  "date_from_url": "2016-12-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>A text sample from the newly released Book Two in Arts of Dark and Light, <b><a href=\"http://amzn.to/2hgubn2\">A SEA OF SKULLS</a></b>, featuring one of the new perspective characters, Lugbol, the captain of a warband of orcs called the Black Fist. If you are new to the fictional world of Selenoth, pick up both Books One and Two, but start with <a href=\"http://amzn.to/1THmHo5\">A THRONE OF BONES</a> for a combined 1,303 pages of truly epic military fantasy.</i><br> <i><br/></i><br> <a href=\"https://www.amazon.com/dp/B01N2T8DHK/ref=as_li_ss_il?ie=UTF8&amp;qid=1481585047&amp;sr=8-1&amp;keywords=a+sea+of+skulls+vox+day&amp;linkCode=li3&amp;tag=voxpop06-20&amp;linkId=6cb73932fa456aaf9de4b4574e6b034a\" rel=\"noopener\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\" target=\"_blank\"><noscript><img border=\"0\" decoding=\"async\" src=\"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&amp;ASIN=B01N2T8DHK&amp;Format=_SL250_&amp;ID=AsinImage&amp;MarketPlace=US&amp;ServiceVersion=20070822&amp;WS=1&amp;tag=voxpop06-20\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&amp;ASIN=B01N2T8DHK&amp;Format=_SL250_&amp;ID=AsinImage&amp;MarketPlace=US&amp;ServiceVersion=20070822&amp;WS=1&amp;tag=voxpop06-20\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a>“I have tasted Manflesh! I have raped she-men! I have burned Man cities!”</br></br></p><p>Lugbol rolled his eyes. Who hadn’t? He was almost embarrassed for the big mountain orc, who was boasting of his accomplishments while stalking back and forth in a large circle of about fifty warband leaders listening to their warleader’s customary evening rant. As for the burned cities, most of them had held populations smaller than Lugbol’s own kai hari gungiyar. If they were the terrible Man cities of which Lugbol had been told frightening stories since he was a small orcling, then he was a one-armed goblin.</p><p>“Man-Zarki’agh shaking in their tents! Man-Kings on their thrones pissing themselves when they hear the name Zlatagh! Zlatagh Life-taker! Zlatagh Piss-maker! Zlatagh Man-eater!”</p><p>That was their cue. “Maneater! Maneater!” the shugaba’ugh obediently chanted, Lugbol among them. He knew that Zlatagh secretly hungered after the praise-name Mansbane, but even the giant warleader knew better than to risk stepping on the clawed toes of the Great Orc Azzakhar, whose claim to the title would certainly trump Zlatagh’s.</p><p>And Lugbol rather doubted any Man-King had ever heard the name Zlatagh, let alone pissed himself for fear of it.</p><p><a name=\"more\"></a>Zlatagh was an imposing brute, though, even for a mountain orc. He stood nearly a head taller than most of the shugaba’ugh gathered around him, with a thick chest and heavy muscles that belied his violent speed. A pair of captured iron Man plates covered each powerful shoulder; two cow’s horns had somehow been driven through the center of both breastplates, curving upward like two spare pairs of tusks. Zlatagh’s own tusks were nearly as large; they were thick, yellowed with maturity, and reached nearly to the tip of his nose. Almost unique among the orcs present, Zlatagh’s tusks were unsharpened and unadorned with any bone, paint, or metal.</p><p>But that didn’t mean they weren’t fearsome weapons. Lugbol had seen with his own eyes how the big orc once used them to disembowel a goblin. The goblin had been wearing leather armor too, which made the feat all the more impressive. After Azzakhar commanded Zlatagh to invade the Man lands two moons past, the Maneater had found himself facing three challenges to his leadership, two of them on the very first day. Zlatagh beheaded one with the monstrous cleaver he called Headchopper, blinded the second with his bare hands, and ripped the arm off the third before using it to bash in the skull of the overmatched orc. At this point, only a truly thick-skulled shugaba would dare to cross the giant orc, let alone challenge him.</p><p>Nor, beyond personal ambition, was there any reason for anyone to do so. Zlatagh was a good warleader, and the warbands over which he’d been given command had enjoyed an unbroken string of victories under his leadership. More than one hundred Man villages had been pillaged and burned, and the orc encampment was littered with the broken remnants of trophies taken throughout the spring campaign. None could complain that he had not passed the ultimate test of leadership; providing his followers with more food than they could eat and more booty than they could carry. Not a single orc’s belly didn’t bulge with fat of the last two moons’ devourings, and even the most cowardly goblin wolfrider wore decorative trophies of one sort or another by now.</p><p>That didn’t mean Lugbol was entirely confident in the big mountain orc. Smashing sparsely guarded hamlets and carrying off helpless herds and captives was one thing, defeating a large and well-armed army of the sort that waited for them at the northwestern edge of the Korokhurmagh was another. Zlatagh could boast that the Man chieftains were pissing themselves and afraid to take the field against him all he liked, but it hadn’t escaped Lugbol’s notice that it was their forces who avoided meeting the mounted patrols that chased them throughout the woods, and that Zlatagh hadn’t moved their encampment one step closer to the Man army ever since its presence had been reported by wolfriders fleeing from the metal-clad Mandokki warriors and the huge, fierce, four-legged beasts they rode.</p><p>“Who marches today! Who takes the fight to Man!”</p><p>“Lugbol!” Lugbol raised his fist and cried half-heartedly, quite happy to be outshouted by other shugaba’ugh more eager to demonstrate their enthusiasm to the big orc. “Lugbol!”</p><p>In truth, he was hoping to spend the next day or three in the camp, sleeping, squagging, and allowing four of his wounded warriors to recover from their injuries. One of his trophies was a large keg of yellow liquid that looked like piss, tasted like honey, and hit the skull harder than ale, wine, or club. He didn’t know what it was called, but he fully intended to drain it with the help of a few select companions this evening. It was a pity no females had been permitted; a few abokhi’agh would just about make for a perfect way to spend a lazy afternoon. There were a few she-men in the prisoner corral, but Lugbol was more in the mood for some relaxed and drunken squagging than having his ears assaulted by the piercing shrieks of a raped man. Rape was a fine thing when the dead enemy was strewn about, smoke was in one’s nostrils, and one’s blood was up, but for now it struck him as being more akin to work than pleasure. Especially considering how he only had one good arm at his disposal at the moment.</p><p>He watched the Maneater nod with satisfaction as the big orc looked over the shouting captains vying for his attention. Zlatagh laughed, a deep guttural sound, as he basked in the raw power of the moment. Two months of slaughter and victory had given him absolute control over the shugaba’ugh, and it was clear that he knew it.</p><p>“The auguries!” Zlatagh cried suddenly. “Bring forward the augurs! What say Gor-Gor?”</p><p>As the shouting dissolved into a general cheering, Lugbol saw a pair of heavily tattooed orcs with sharpened silver tusk-caps push into the center of the circle. They accompanied someone; at first Lugbol thought it might be a juvenile Man, but then he caught a sight of yellow-green skin and realized it was a goblin. Nearly half their troops were goblins; they had started out with ten thousand but thanks to the inevitable costs of the campaign, there were about fifteen hundred fewer of them now. The doomed creature looked wild with terror; he seemed to have a fair notion of his imminent fate. But he was silent and he did not struggle; there was literally nothing that a single goblin could do to save itself, not when surrounded by howling, blood-hungry orcs with arms twice the thickness of his legs.</p><p>The augury looked to be the usual entrail-reading. For some reason Lugbol had never quite grasped, Gor-Gor preferred to speak to his priests through the intestines of his lesser worshippers. Goblins were the preferred method of communication, though orcs, Men, and even large rats would do in a pinch. He noticed Gor-Gor never seemed to speak through either wolves or warboars, two martial commodities that were always in great demand.</p><p><a href=\"https://www.amazon.com/Throne-Bones-Arts-Dark-Light-ebook/dp/B00I6H0J7S/ref=as_li_ss_il?_encoding=UTF8&amp;qid=1481622272&amp;sr=1-1&amp;linkCode=li3&amp;tag=voxpop06-20&amp;linkId=a498d906a2251e1f5db0f3beccfa0452\" rel=\"noopener\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\" target=\"_blank\"><noscript><img border=\"0\" decoding=\"async\" src=\"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&amp;ASIN=B00I6H0J7S&amp;Format=_SL250_&amp;ID=AsinImage&amp;MarketPlace=US&amp;ServiceVersion=20070822&amp;WS=1&amp;tag=voxpop06-20\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&amp;ASIN=B00I6H0J7S&amp;Format=_SL250_&amp;ID=AsinImage&amp;MarketPlace=US&amp;ServiceVersion=20070822&amp;WS=1&amp;tag=voxpop06-20\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a>The goblin broke his silence when one shaman kneeled down before him, then ripped open his stomach with both silver-tipped tusks. As the other shaman held the victim, chanting all the while, the killer began calling out the haruspictic ritual and reached into the goblin with both hands. Then he began walking backwards, pulling the dying goblin’s innards out. After taking seven steps, he gave three firm tugs, then finally released the bloody, stinking offal and let it fall with a wet thud. The other shaman followed his example, stepping back and finally allowing the moaning goblin to collapse, dying, to the ground.</p><p>Lugbol saw the shaman raise his bloody hands and call out to Gor-Gor. The shaman’s eyes suddenly rolled back into his head and he swayed back and forth, as if drunk, while looking over the entrails spread out upon the ground. He took a step forward, then another, holding his palms toward the ground with his fingers spread wide. It was as if he was feeling his way through something rising up from the spilled innards. Several of the shaman’s tattoos flared into life; a rune on his shoulder blazed red and began to smoke as it burned away his skin, but the shaman didn’t seem to feel or notice anything was wrong. With nothing but the whites of his eyes showing, he began to grunt and growl. Gradually, the guttural noises became discernible as words.</p><p>“Fire,” he rumbled. “Fire burns. Demon wings of fire, burning, burning. Demons, iron demons, and death.”</p><p>The shugaba’ugh looked at each other, confused. This was not how the ritual usually proceeded. Zlatagh’s eyes narrowed and he made as if to step forward, then the big orc stopped himself. Even a warleader would not dare to lay claws upon a shaman in the holy grip of Gor-Gor.</p><p>“Death come, death come, on fire and iron, death come to all!” The shaman’s voice rose into a shriek and he thrust his bloody hands skyward. Then, he began to shake and shiver, as if Gor-Gor was attempting to rid himself of his puppet. Finally, the shaman collapsed face-first on the ground, where he lay motionless except for his labored breathing. Smoke, stinking of burned flesh, rose from three or four blackened tattoos on his back and shoulders.</p><p>“The Hell he say? What does that mean?” a furious Zlatagh demanded of the other shaman. One might have almost thought that he was alarmed. “What was the damn augury?”<br> Lugbol looked around at his fellow shugaba’ugh. They were agitated and alarmed, with one significant exception. Snaghak, alone among the warband captains, wore an expression that was full of fury. He no longer looked triumphant, he looked downright vengeful. And, for once, Lugbol thought, Snaghak’s hatred didn’t appear to be directed at him. He stifled a dismissive snort and returned his attention to Zlatagh, who had grabbed the smaller shaman by his tattooed shoulders and was shaking him while shouting in his face.</br></p><p>“I don’t know!” the smaller orc pleaded. “I swear, I swear by Gor-Gor’s tail, I don’t know what happened!”</p><p>Zlatagh snarled in disgust and shoved the tattooed orc away from him. Then a groan from the fallen shaman caught the big orc’s attention and he whirled around to see the shaman, his skin still smoking slightly, trying to push himself up from the ground. The injured shaman failed the first time with a barely muted cry, then his muscles bulged with effort as he succeeded in rising to his knees on his second attempt. He didn’t seem to have known what happened to him earlier, because he suddenly winced and looked down at the burns on his shoulders with an expression of pained surprise.</p><p>“You!” Zlatagh said, reaching out and pulling the shaman to his feet. “What did you do? What thing did you see in the guts there? What secrets did Gor-Gor tell you?”</p><p>The shaman rolled his eyes and slumped in the warleader’s grasp. His initial reply was a drawn-out groan, but when the warleader violently shook him, it seemed to pull him out of his swoon. “I saw death. Everywhere, death.”</p><p>“Whose death! The Man cities?”</p><p>“No,” the stricken shaman said. He stared intensely into Zlatagh’s face. “Ours. Everywhere, all throughout the woods, I saw orcs dead on the ground, murdered, all of them, by demons of fire and iron!”</p><p>“You lie!” Zlatagh shouted instinctively, before driving an oversized fist into the shaman’s tattooed face. There was a loud crunch and the shaman crumpled as if he’d been cloven through the head with a dwarven axe. Whether the shaman was dead or not, Lugbol couldn’t tell, but he wouldn’t be surprised either way.</p><p>Zlatagh pointed at the other shaman, who was cringing behind the corpse of the goblin. “You, read the bloody guts! And tell me the truth or I’ll rip your balls out of your sack and feed them to you!”</p></div>",
  "content_text": "A text sample from the newly released Book Two in Arts of Dark and Light,\nA SEA OF SKULLS\n, featuring one of the new perspective characters, Lugbol, the captain of a warband of orcs called the Black Fist. If you are new to the fictional world of Selenoth, pick up both Books One and Two, but start with\nA THRONE OF BONES\nfor a combined 1,303 pages of truly epic military fantasy.\n“I have tasted Manflesh! I have raped she-men! I have burned Man cities!”\nLugbol rolled his eyes. Who hadn’t? He was almost embarrassed for the big mountain orc, who was boasting of his accomplishments while stalking back and forth in a large circle of about fifty warband leaders listening to their warleader’s customary evening rant. As for the burned cities, most of them had held populations smaller than Lugbol’s own kai hari gungiyar. If they were the terrible Man cities of which Lugbol had been told frightening stories since he was a small orcling, then he was a one-armed goblin.\n“Man-Zarki’agh shaking in their tents! Man-Kings on their thrones pissing themselves when they hear the name Zlatagh! Zlatagh Life-taker! Zlatagh Piss-maker! Zlatagh Man-eater!”\nThat was their cue. “Maneater! Maneater!” the shugaba’ugh obediently chanted, Lugbol among them. He knew that Zlatagh secretly hungered after the praise-name Mansbane, but even the giant warleader knew better than to risk stepping on the clawed toes of the Great Orc Azzakhar, whose claim to the title would certainly trump Zlatagh’s.\nAnd Lugbol rather doubted any Man-King had ever heard the name Zlatagh, let alone pissed himself for fear of it.\nZlatagh was an imposing brute, though, even for a mountain orc. He stood nearly a head taller than most of the shugaba’ugh gathered around him, with a thick chest and heavy muscles that belied his violent speed. A pair of captured iron Man plates covered each powerful shoulder; two cow’s horns had somehow been driven through the center of both breastplates, curving upward like two spare pairs of tusks. Zlatagh’s own tusks were nearly as large; they were thick, yellowed with maturity, and reached nearly to the tip of his nose. Almost unique among the orcs present, Zlatagh’s tusks were unsharpened and unadorned with any bone, paint, or metal.\nBut that didn’t mean they weren’t fearsome weapons. Lugbol had seen with his own eyes how the big orc once used them to disembowel a goblin. The goblin had been wearing leather armor too, which made the feat all the more impressive. After Azzakhar commanded Zlatagh to invade the Man lands two moons past, the Maneater had found himself facing three challenges to his leadership, two of them on the very first day. Zlatagh beheaded one with the monstrous cleaver he called Headchopper, blinded the second with his bare hands, and ripped the arm off the third before using it to bash in the skull of the overmatched orc. At this point, only a truly thick-skulled shugaba would dare to cross the giant orc, let alone challenge him.\nNor, beyond personal ambition, was there any reason for anyone to do so. Zlatagh was a good warleader, and the warbands over which he’d been given command had enjoyed an unbroken string of victories under his leadership. More than one hundred Man villages had been pillaged and burned, and the orc encampment was littered with the broken remnants of trophies taken throughout the spring campaign. None could complain that he had not passed the ultimate test of leadership; providing his followers with more food than they could eat and more booty than they could carry. Not a single orc’s belly didn’t bulge with fat of the last two moons’ devourings, and even the most cowardly goblin wolfrider wore decorative trophies of one sort or another by now.\nThat didn’t mean Lugbol was entirely confident in the big mountain orc. Smashing sparsely guarded hamlets and carrying off helpless herds and captives was one thing, defeating a large and well-armed army of the sort that waited for them at the northwestern edge of the Korokhurmagh was another. Zlatagh could boast that the Man chieftains were pissing themselves and afraid to take the field against him all he liked, but it hadn’t escaped Lugbol’s notice that it was their forces who avoided meeting the mounted patrols that chased them throughout the woods, and that Zlatagh hadn’t moved their encampment one step closer to the Man army ever since its presence had been reported by wolfriders fleeing from the metal-clad Mandokki warriors and the huge, fierce, four-legged beasts they rode.\n“Who marches today! Who takes the fight to Man!”\n“Lugbol!” Lugbol raised his fist and cried half-heartedly, quite happy to be outshouted by other shugaba’ugh more eager to demonstrate their enthusiasm to the big orc. “Lugbol!”\nIn truth, he was hoping to spend the next day or three in the camp, sleeping, squagging, and allowing four of his wounded warriors to recover from their injuries. One of his trophies was a large keg of yellow liquid that looked like piss, tasted like honey, and hit the skull harder than ale, wine, or club. He didn’t know what it was called, but he fully intended to drain it with the help of a few select companions this evening. It was a pity no females had been permitted; a few abokhi’agh would just about make for a perfect way to spend a lazy afternoon. There were a few she-men in the prisoner corral, but Lugbol was more in the mood for some relaxed and drunken squagging than having his ears assaulted by the piercing shrieks of a raped man. Rape was a fine thing when the dead enemy was strewn about, smoke was in one’s nostrils, and one’s blood was up, but for now it struck him as being more akin to work than pleasure. Especially considering how he only had one good arm at his disposal at the moment.\nHe watched the Maneater nod with satisfaction as the big orc looked over the shouting captains vying for his attention. Zlatagh laughed, a deep guttural sound, as he basked in the raw power of the moment. Two months of slaughter and victory had given him absolute control over the shugaba’ugh, and it was clear that he knew it.\n“The auguries!” Zlatagh cried suddenly. “Bring forward the augurs! What say Gor-Gor?”\nAs the shouting dissolved into a general cheering, Lugbol saw a pair of heavily tattooed orcs with sharpened silver tusk-caps push into the center of the circle. They accompanied someone; at first Lugbol thought it might be a juvenile Man, but then he caught a sight of yellow-green skin and realized it was a goblin. Nearly half their troops were goblins; they had started out with ten thousand but thanks to the inevitable costs of the campaign, there were about fifteen hundred fewer of them now. The doomed creature looked wild with terror; he seemed to have a fair notion of his imminent fate. But he was silent and he did not struggle; there was literally nothing that a single goblin could do to save itself, not when surrounded by howling, blood-hungry orcs with arms twice the thickness of his legs.\nThe augury looked to be the usual entrail-reading. For some reason Lugbol had never quite grasped, Gor-Gor preferred to speak to his priests through the intestines of his lesser worshippers. Goblins were the preferred method of communication, though orcs, Men, and even large rats would do in a pinch. He noticed Gor-Gor never seemed to speak through either wolves or warboars, two martial commodities that were always in great demand.\nThe goblin broke his silence when one shaman kneeled down before him, then ripped open his stomach with both silver-tipped tusks. As the other shaman held the victim, chanting all the while, the killer began calling out the haruspictic ritual and reached into the goblin with both hands. Then he began walking backwards, pulling the dying goblin’s innards out. After taking seven steps, he gave three firm tugs, then finally released the bloody, stinking offal and let it fall with a wet thud. The other shaman followed his example, stepping back and finally allowing the moaning goblin to collapse, dying, to the ground.\nLugbol saw the shaman raise his bloody hands and call out to Gor-Gor. The shaman’s eyes suddenly rolled back into his head and he swayed back and forth, as if drunk, while looking over the entrails spread out upon the ground. He took a step forward, then another, holding his palms toward the ground with his fingers spread wide. It was as if he was feeling his way through something rising up from the spilled innards. Several of the shaman’s tattoos flared into life; a rune on his shoulder blazed red and began to smoke as it burned away his skin, but the shaman didn’t seem to feel or notice anything was wrong. With nothing but the whites of his eyes showing, he began to grunt and growl. Gradually, the guttural noises became discernible as words.\n“Fire,” he rumbled. “Fire burns. Demon wings of fire, burning, burning. Demons, iron demons, and death.”\nThe shugaba’ugh looked at each other, confused. This was not how the ritual usually proceeded. Zlatagh’s eyes narrowed and he made as if to step forward, then the big orc stopped himself. Even a warleader would not dare to lay claws upon a shaman in the holy grip of Gor-Gor.\n“Death come, death come, on fire and iron, death come to all!” The shaman’s voice rose into a shriek and he thrust his bloody hands skyward. Then, he began to shake and shiver, as if Gor-Gor was attempting to rid himself of his puppet. Finally, the shaman collapsed face-first on the ground, where he lay motionless except for his labored breathing. Smoke, stinking of burned flesh, rose from three or four blackened tattoos on his back and shoulders.\n“The Hell he say? What does that mean?” a furious Zlatagh demanded of the other shaman. One might have almost thought that he was alarmed. “What was the damn augury?”\nLugbol looked around at his fellow shugaba’ugh. They were agitated and alarmed, with one significant exception. Snaghak, alone among the warband captains, wore an expression that was full of fury. He no longer looked triumphant, he looked downright vengeful. And, for once, Lugbol thought, Snaghak’s hatred didn’t appear to be directed at him. He stifled a dismissive snort and returned his attention to Zlatagh, who had grabbed the smaller shaman by his tattooed shoulders and was shaking him while shouting in his face.\n“I don’t know!” the smaller orc pleaded. “I swear, I swear by Gor-Gor’s tail, I don’t know what happened!”\nZlatagh snarled in disgust and shoved the tattooed orc away from him. Then a groan from the fallen shaman caught the big orc’s attention and he whirled around to see the shaman, his skin still smoking slightly, trying to push himself up from the ground. The injured shaman failed the first time with a barely muted cry, then his muscles bulged with effort as he succeeded in rising to his knees on his second attempt. He didn’t seem to have known what happened to him earlier, because he suddenly winced and looked down at the burns on his shoulders with an expression of pained surprise.\n“You!” Zlatagh said, reaching out and pulling the shaman to his feet. “What did you do? What thing did you see in the guts there? What secrets did Gor-Gor tell you?”\nThe shaman rolled his eyes and slumped in the warleader’s grasp. His initial reply was a drawn-out groan, but when the warleader violently shook him, it seemed to pull him out of his swoon. “I saw death. Everywhere, death.”\n“Whose death! The Man cities?”\n“No,” the stricken shaman said. He stared intensely into Zlatagh’s face. “Ours. Everywhere, all throughout the woods, I saw orcs dead on the ground, murdered, all of them, by demons of fire and iron!”\n“You lie!” Zlatagh shouted instinctively, before driving an oversized fist into the shaman’s tattooed face. There was a loud crunch and the shaman crumpled as if he’d been cloven through the head with a dwarven axe. Whether the shaman was dead or not, Lugbol couldn’t tell, but he wouldn’t be surprised either way.\nZlatagh pointed at the other shaman, who was cringing behind the corpse of the goblin. “You, read the bloody guts! And tell me the truth or I’ll rip your balls out of your sack and feed them to you!”",
  "tags": [
    "Castalia House",
    "Selenoth"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-14T01:00:00+00:00"
}