{
  "url": "https://voxday.net/2016/12/02/a-tale-of-two-pizzagates/",
  "scraped_at": "2025-12-18T02:08:16.864754",
  "title": "A tale of two Pizzagates",
  "date_display": "December 2, 2016",
  "date_iso": "2016-12-02T13:00:00+00:00",
  "date_from_url": "2016-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In case you didn’t understand how important Infogalactic is already proving to be, given the online war to control the information you are permitted to access, this should suffice to demonstrate as much.</p><blockquote><p> <b>WIKIPEDIA:</b></p><p><a href=\"https://en.wikipedia.org/wiki/Pizzagate\">Pizzagate </a>may refer to:</p><p>Pizzagate, pizza thrown at former football manager and player Sir Alex Ferguson by an Arsenal Football Club player in the 2004 “Battle of the Buffet”<br> Pizzagate, a 2016 conspiracy theory falsely claiming the existence of a child trafficking ring involving the Washington, D.C. restaurant <a href=\"https://en.wikipedia.org/wiki/Comet_Ping_Pong\">Comet Ping Pong</a></br></p><p> <b>INFOGALACTIC:</b></p><p><a href=\"http://infogalactic.com/info/Pizzagate\">Pizzagate </a>is a crowdsourced investigation by citizen journalists into an alleged connection between child trafficking and people closely associated with Hillary Clinton. The investigation began in October 2016 after Wikileaks released the Podesta emails, which contain 58,660 emails[1] from the Gmail account of John Podesta, who was the chairman of Clinton’s 2016 U.S. presidential campaign. Investigators exchanged information online via Twitter, Gab, 4chan, Reddit, and Voat.[2][3]</p></blockquote><p>It’s not Infogalactic’s purpose to take sides on anything. Indeed, its objective is quite the opposite, which is to permit the user to dictate the perspective filter through which he wishes to view the known facts. Wikipedia, obviously, takes a very different stance.</p><p>Notice how Wikipedia’s 526 thought police are not providing accurate information relevant to the subject, but are instead aggressively acting as gatekeepers in precisely the same manner as the corrupt media they declare to be the only reliable sources acceptable. It’s a bit ironic, too, that it is the wealthy foundation with more than $70 million in annual revenue has a giant banner stretched across the page demanding more donations, not the shoe-string startup.</p><p>We’re getting close to addressing our primary issue as the initial round of speedups should be in place well before the end of the month. If you would like help us provide the world with a more accurate and less biased planetary knowledge core that is free of SJW corruption, you can join the Burn Unit or make a one-time donation towards the ongoing Phase Two development <a href=\"https://infogalactic.com/info/Infogalactic:Donations\">here</a>.</p></div>",
  "content_text": "In case you didn’t understand how important Infogalactic is already proving to be, given the online war to control the information you are permitted to access, this should suffice to demonstrate as much.\nWIKIPEDIA:\nPizzagate\nmay refer to:\nPizzagate, pizza thrown at former football manager and player Sir Alex Ferguson by an Arsenal Football Club player in the 2004 “Battle of the Buffet”\nPizzagate, a 2016 conspiracy theory falsely claiming the existence of a child trafficking ring involving the Washington, D.C. restaurant\nComet Ping Pong\nINFOGALACTIC:\nPizzagate\nis a crowdsourced investigation by citizen journalists into an alleged connection between child trafficking and people closely associated with Hillary Clinton. The investigation began in October 2016 after Wikileaks released the Podesta emails, which contain 58,660 emails[1] from the Gmail account of John Podesta, who was the chairman of Clinton’s 2016 U.S. presidential campaign. Investigators exchanged information online via Twitter, Gab, 4chan, Reddit, and Voat.[2][3]\nIt’s not Infogalactic’s purpose to take sides on anything. Indeed, its objective is quite the opposite, which is to permit the user to dictate the perspective filter through which he wishes to view the known facts. Wikipedia, obviously, takes a very different stance.\nNotice how Wikipedia’s 526 thought police are not providing accurate information relevant to the subject, but are instead aggressively acting as gatekeepers in precisely the same manner as the corrupt media they declare to be the only reliable sources acceptable. It’s a bit ironic, too, that it is the wealthy foundation with more than $70 million in annual revenue has a giant banner stretched across the page demanding more donations, not the shoe-string startup.\nWe’re getting close to addressing our primary issue as the initial round of speedups should be in place well before the end of the month. If you would like help us provide the world with a more accurate and less biased planetary knowledge core that is free of SJW corruption, you can join the Burn Unit or make a one-time donation towards the ongoing Phase Two development\nhere\n.",
  "tags": [
    "#AltTech",
    "Infogalactic",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-02T13:00:00+00:00"
}