{
  "url": "https://voxday.net/2016/12/29/by-any-means-necessary/",
  "scraped_at": "2025-12-18T02:12:29.426145",
  "title": "By any means necessary",
  "date_display": "December 29, 2016",
  "date_iso": "2016-12-29T12:39:00+00:00",
  "date_from_url": "2016-12-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>George Soros is pulling out all the stops to try to impede the God-Emperor’s rule while saving the EU from itself. But I find this article by the aged string-puller, entitled “<a href=\"https://www.project-syndicate.org/onpoint/open-society-needs-defending-by-george-soros-2016-12\">Open Society Needs Defending</a>“, to make for very satisfactory reading indeed.</p><blockquote><p> Well before Donald Trump was elected President of the United States, I sent a holiday greeting to my friends that read: “These times are not business as usual. Wishing you the best in a troubled world.” Now I feel the need to share this message with the rest of the world. But before I do, I must tell you who I am and what I stand for.</p><p>I am an 86-year-old Hungarian Jew who became a US citizen after the end of World War II. I learned at an early age how important it is what kind of political regime prevails. The formative experience of my life was the occupation of Hungary by Hitler’s Germany in 1944. I probably would have perished had my father not understood the gravity of the situation. He arranged false identities for his family and for many other Jews; with his help, most survived.</p><p>In 1947, I escaped from Hungary, by then under Communist rule, to England. As a student at the London School of Economics, I came under the influence of the philosopher Karl Popper, and I developed my own philosophy, built on the twin pillars of fallibility and reflexivity. I distinguished between two kinds of political regimes: those in which people elected their leaders, who were then supposed to look after the interests of the electorate, and others where the rulers sought to manipulate their subjects to serve the rulers’ interests. Under Popper’s influence, I called the first kind of society open, the second, closed.</p><p>The classification is too simplistic. There are many degrees and variations throughout history, from well-functioning models to failed states, and many different levels of government in any particular situation. Even so, I find the distinction between the two regime types useful. I became an active promoter of the former and opponent of the latter.</p><p>I find the current moment in history very painful. Open societies are in crisis, and various forms of closed societies – from fascist dictatorships to mafia states – are on the rise. How could this happen? The only explanation I can find is that elected leaders failed to meet voters’ legitimate expectations and aspirations and that this failure led electorates to become disenchanted with the prevailing versions of democracy and capitalism. Quite simply, many people felt that the elites had stolen their democracy.</p><p>After the collapse of the Soviet Union, the US emerged as the sole remaining superpower, equally committed to the principles of democracy and free markets. The major development since then has been the globalization of financial markets, spearheaded by advocates who argued that globalization increases total wealth. After all, if the winners compensated the losers, they would still have something left over.</p><p>The argument was misleading, because it ignored the fact that the winners seldom, if ever, compensate the losers. But the potential winners spent enough money promoting the argument that it prevailed. It was a victory for believers in untrammeled free enterprise, or “market fundamentalists,” as I call them. Because financial capital is an indispensable ingredient of economic development, and few countries in the developing world could generate enough capital on their own, globalization spread like wildfire. Financial capital could move around freely and avoid taxation and regulation.</p><p>Globalization has had far-reaching economic and political consequences. It has brought about some economic convergence between poor and rich countries; but it increased inequality within both poor and rich countries. In the developed world, the benefits accrued mainly to large owners of financial capital, who constitute less than 1% of the population. The lack of redistributive policies is the main source of the dissatisfaction that democracy’s opponents have exploited. But there were other contributing factors as well, particularly in Europe.</p><p>I was an avid supporter of the European Union from its inception. I regarded it as the embodiment of the idea of an open society: an association of democratic states willing to sacrifice part of their sovereignty for the common good. It started out at as a bold experiment in what Popper called “piecemeal social engineering.” The leaders set an attainable objective and a fixed timeline and mobilized the political will needed to meet it, knowing full well that each step would necessitate a further step forward. That is how the European Coal and Steel Community developed into the EU.</p><p>But then something went woefully wrong. After the Crash of 2008, a voluntary association of equals was transformed into a relationship between creditors and debtors, where the debtors had difficulties in meeting their obligations and the creditors set the conditions the debtors had to obey. That relationship has been neither voluntary nor equal.</p><p>Germany emerged as the hegemonic power in Europe, but it failed to live up to the obligations that successful hegemons must fulfill, namely looking beyond their narrow self-interest to the interests of the people who depend on them. Compare the behavior of the US after WWII with Germany’s behavior after the Crash of 2008: the US launched the Marshall Plan, which led to the development of the EU; Germany imposed an austerity program that served its narrow self-interest.</p><p>Before its reunification, Germany was the main force driving European integration: it was always willing to contribute a little bit extra to accommodate those putting up resistance. Remember Germany’s contribution to meeting Margaret Thatcher’s demands regarding the EU budget?</p><p>But reuniting Germany on a 1:1 basis turned out to be very expensive. When Lehman Brothers collapsed, Germany did not feel rich enough to take on any additional obligations. When European finance ministers declared that no other systemically important financial institution would be allowed to fail, German Chancellor Angela Merkel, correctly reading the wishes of her electorate, declared that each member state should look after its own institutions. That was the start of a process of disintegration.</p><p>After the Crash of 2008, the EU and the eurozone became increasingly dysfunctional. Prevailing conditions became far removed from those prescribed by the Maastricht Treaty, but treaty change became progressively more difficult, and eventually impossible, because it couldn’t be ratified. The eurozone became the victim of antiquated laws; much-needed reforms could be enacted only by finding loopholes in them. That is how institutions became increasingly complicated, and electorates became alienated.</p><p>The rise of anti-EU movements further impeded the functioning of institutions. And these forces of disintegration received a powerful boost in 2016, first from Brexit, then from the election of Trump in the US, and on December 4 from Italian voters’ rejection, by a wide margin, of constitutional reforms.</p><p>Democracy is now in crisis. Even the US, the world’s leading democracy, elected a con artist and would-be dictator as its president. Although Trump has toned down his rhetoric since he was elected, he has changed neither his behavior nor his advisers. His cabinet comprises incompetent extremists and retired generals.</p><p>What lies ahead?</p><p>I am confident that democracy will prove resilient in the US. Its Constitution and institutions, including the fourth estate, are strong enough to resist the excesses of the executive branch, thus preventing a would-be dictator from becoming an actual one.</p><p>But the US will be preoccupied with internal struggles in the near future, and targeted minorities will suffer. The US will be unable to protect and promote democracy in the rest of the world. On the contrary, Trump will have greater affinity with dictators. That will allow some of them to reach an accommodation with the US, and others to carry on without interference. Trump will prefer making deals to defending principles. Unfortunately, that will be popular with his core constituency.</p><p>I am particularly worried about the fate of the EU, which is in danger of coming under the influence of Russian President Vladimir Putin, whose concept of government is irreconcilable with that of open society. Putin is not a passive beneficiary of recent developments; he worked hard to bring them about. He recognized his regime’s weakness: it can exploit natural resources but cannot generate economic growth. He felt threatened by “color revolutions” in Georgia, Ukraine, and elsewhere. At first, he tried to control social media. Then, in a brilliant move, he exploited social media companies’ business model to spread misinformation and fake news, disorienting electorates and destabilizing democracies. That is how he helped Trump get elected.</p><p>The same is likely to happen in the European election season in 2017 in the Netherlands, Germany, and Italy. In France, the two leading contenders are close to Putin and eager to appease him. If either wins, Putin’s dominance of Europe will become a fait accompli.</p><p>I hope that Europe’s leaders and citizens alike will realize that this endangers their way of life and the values on which the EU was founded. The trouble is that the method Putin has used to destabilize democracy cannot be used to restore respect for facts and a balanced view of reality.</p><p>With economic growth lagging and the refugee crisis out of control, the EU is on the verge of breakdown and is set to undergo an experience similar to that of the Soviet Union in the early 1990s. Those who believe that the EU needs to be saved in order to be reinvented must do whatever they can to bring about a better outcome.</p></blockquote><p>The article is riddled with lies, but even so, it is clear that the globalists are getting increasingly worried. And well they should. The rising tide of nationalism is going to kill their evil utopian dreams as dead as the League of Nations. The European nations will be greatly blessed if they are so fortunate as to find leaders half as effective, and half as genuinely devoted to their nations, as the Russians are to have Vladimir Putin.</p><p>What Soros calls “the open society” is a fraud being marketed by the globalist elite to mask their true objectives of rule by an international aristocracy. There are few institutions more openly anti-democratic than the EU, which subverts even democracies that don’t belong to it. If the US was genuinely interested in spreading democracy abroad, its first order of business should be to invade Brussels.</p><p>History never ended. Liberal democracy – especially in its bizarrely contorted limited modern form – has completely failed.  The immigrant-riddled US political system is one financial failure away from collapse. How painful it must be to be reaching the end of one’s road in the knowledge that all of one’s works will be undone within a single generation.</p><p>The Saker has some relevant comments:</p><blockquote class=\"tr_bq\"><p> Poor “EUans” (my own word for the European zombies who believed in the Bilderberger’s European Union): they are now, how shall I put it politely, totally “frigged”? Not only did the British people defy the Empire and vote for a Brexit, but now the Imperial Homeland has “backstabbed” them by electing a patriot who is not interested in maintaining the global empire (or so he says, at least for the time being). At the same time, the so-called “refugee crisis” is bringing several crucial EU nations to the brink of a civil war (France for example) while all the efforts of the elites to blame Russia for it all end up in abject failures. Just check out this hilarious article in the British Sun which accuses Russia of, I kid you not, “organizing sex attacks in Germany“!! True, we already had the “Serbian Chetniks using rape as a weapon of ethnic cleansing” and “Gaddafi distributing Viagra to his soldiers to rape opposition supporters” but Putin ordering refugees to rape women in Germany is the best, so to speak. And just in case the unthinkable happens in Germany, the Germans have already warned that Russian hackers might steal the election in Germany. If this was not so utterly disgusting it would be hilarious. The bottom line is this: the entire EU project is morally completely bankrupt, each EU member state is now in a deep political crisis and the so-called “elites” are scrambling to find a response to what appears to be an inevitable collapse of the EU-order over Europe. </p></blockquote></div>",
  "content_text": "George Soros is pulling out all the stops to try to impede the God-Emperor’s rule while saving the EU from itself. But I find this article by the aged string-puller, entitled “\nOpen Society Needs Defending\n“, to make for very satisfactory reading indeed.\nWell before Donald Trump was elected President of the United States, I sent a holiday greeting to my friends that read: “These times are not business as usual. Wishing you the best in a troubled world.” Now I feel the need to share this message with the rest of the world. But before I do, I must tell you who I am and what I stand for.\nI am an 86-year-old Hungarian Jew who became a US citizen after the end of World War II. I learned at an early age how important it is what kind of political regime prevails. The formative experience of my life was the occupation of Hungary by Hitler’s Germany in 1944. I probably would have perished had my father not understood the gravity of the situation. He arranged false identities for his family and for many other Jews; with his help, most survived.\nIn 1947, I escaped from Hungary, by then under Communist rule, to England. As a student at the London School of Economics, I came under the influence of the philosopher Karl Popper, and I developed my own philosophy, built on the twin pillars of fallibility and reflexivity. I distinguished between two kinds of political regimes: those in which people elected their leaders, who were then supposed to look after the interests of the electorate, and others where the rulers sought to manipulate their subjects to serve the rulers’ interests. Under Popper’s influence, I called the first kind of society open, the second, closed.\nThe classification is too simplistic. There are many degrees and variations throughout history, from well-functioning models to failed states, and many different levels of government in any particular situation. Even so, I find the distinction between the two regime types useful. I became an active promoter of the former and opponent of the latter.\nI find the current moment in history very painful. Open societies are in crisis, and various forms of closed societies – from fascist dictatorships to mafia states – are on the rise. How could this happen? The only explanation I can find is that elected leaders failed to meet voters’ legitimate expectations and aspirations and that this failure led electorates to become disenchanted with the prevailing versions of democracy and capitalism. Quite simply, many people felt that the elites had stolen their democracy.\nAfter the collapse of the Soviet Union, the US emerged as the sole remaining superpower, equally committed to the principles of democracy and free markets. The major development since then has been the globalization of financial markets, spearheaded by advocates who argued that globalization increases total wealth. After all, if the winners compensated the losers, they would still have something left over.\nThe argument was misleading, because it ignored the fact that the winners seldom, if ever, compensate the losers. But the potential winners spent enough money promoting the argument that it prevailed. It was a victory for believers in untrammeled free enterprise, or “market fundamentalists,” as I call them. Because financial capital is an indispensable ingredient of economic development, and few countries in the developing world could generate enough capital on their own, globalization spread like wildfire. Financial capital could move around freely and avoid taxation and regulation.\nGlobalization has had far-reaching economic and political consequences. It has brought about some economic convergence between poor and rich countries; but it increased inequality within both poor and rich countries. In the developed world, the benefits accrued mainly to large owners of financial capital, who constitute less than 1% of the population. The lack of redistributive policies is the main source of the dissatisfaction that democracy’s opponents have exploited. But there were other contributing factors as well, particularly in Europe.\nI was an avid supporter of the European Union from its inception. I regarded it as the embodiment of the idea of an open society: an association of democratic states willing to sacrifice part of their sovereignty for the common good. It started out at as a bold experiment in what Popper called “piecemeal social engineering.” The leaders set an attainable objective and a fixed timeline and mobilized the political will needed to meet it, knowing full well that each step would necessitate a further step forward. That is how the European Coal and Steel Community developed into the EU.\nBut then something went woefully wrong. After the Crash of 2008, a voluntary association of equals was transformed into a relationship between creditors and debtors, where the debtors had difficulties in meeting their obligations and the creditors set the conditions the debtors had to obey. That relationship has been neither voluntary nor equal.\nGermany emerged as the hegemonic power in Europe, but it failed to live up to the obligations that successful hegemons must fulfill, namely looking beyond their narrow self-interest to the interests of the people who depend on them. Compare the behavior of the US after WWII with Germany’s behavior after the Crash of 2008: the US launched the Marshall Plan, which led to the development of the EU; Germany imposed an austerity program that served its narrow self-interest.\nBefore its reunification, Germany was the main force driving European integration: it was always willing to contribute a little bit extra to accommodate those putting up resistance. Remember Germany’s contribution to meeting Margaret Thatcher’s demands regarding the EU budget?\nBut reuniting Germany on a 1:1 basis turned out to be very expensive. When Lehman Brothers collapsed, Germany did not feel rich enough to take on any additional obligations. When European finance ministers declared that no other systemically important financial institution would be allowed to fail, German Chancellor Angela Merkel, correctly reading the wishes of her electorate, declared that each member state should look after its own institutions. That was the start of a process of disintegration.\nAfter the Crash of 2008, the EU and the eurozone became increasingly dysfunctional. Prevailing conditions became far removed from those prescribed by the Maastricht Treaty, but treaty change became progressively more difficult, and eventually impossible, because it couldn’t be ratified. The eurozone became the victim of antiquated laws; much-needed reforms could be enacted only by finding loopholes in them. That is how institutions became increasingly complicated, and electorates became alienated.\nThe rise of anti-EU movements further impeded the functioning of institutions. And these forces of disintegration received a powerful boost in 2016, first from Brexit, then from the election of Trump in the US, and on December 4 from Italian voters’ rejection, by a wide margin, of constitutional reforms.\nDemocracy is now in crisis. Even the US, the world’s leading democracy, elected a con artist and would-be dictator as its president. Although Trump has toned down his rhetoric since he was elected, he has changed neither his behavior nor his advisers. His cabinet comprises incompetent extremists and retired generals.\nWhat lies ahead?\nI am confident that democracy will prove resilient in the US. Its Constitution and institutions, including the fourth estate, are strong enough to resist the excesses of the executive branch, thus preventing a would-be dictator from becoming an actual one.\nBut the US will be preoccupied with internal struggles in the near future, and targeted minorities will suffer. The US will be unable to protect and promote democracy in the rest of the world. On the contrary, Trump will have greater affinity with dictators. That will allow some of them to reach an accommodation with the US, and others to carry on without interference. Trump will prefer making deals to defending principles. Unfortunately, that will be popular with his core constituency.\nI am particularly worried about the fate of the EU, which is in danger of coming under the influence of Russian President Vladimir Putin, whose concept of government is irreconcilable with that of open society. Putin is not a passive beneficiary of recent developments; he worked hard to bring them about. He recognized his regime’s weakness: it can exploit natural resources but cannot generate economic growth. He felt threatened by “color revolutions” in Georgia, Ukraine, and elsewhere. At first, he tried to control social media. Then, in a brilliant move, he exploited social media companies’ business model to spread misinformation and fake news, disorienting electorates and destabilizing democracies. That is how he helped Trump get elected.\nThe same is likely to happen in the European election season in 2017 in the Netherlands, Germany, and Italy. In France, the two leading contenders are close to Putin and eager to appease him. If either wins, Putin’s dominance of Europe will become a fait accompli.\nI hope that Europe’s leaders and citizens alike will realize that this endangers their way of life and the values on which the EU was founded. The trouble is that the method Putin has used to destabilize democracy cannot be used to restore respect for facts and a balanced view of reality.\nWith economic growth lagging and the refugee crisis out of control, the EU is on the verge of breakdown and is set to undergo an experience similar to that of the Soviet Union in the early 1990s. Those who believe that the EU needs to be saved in order to be reinvented must do whatever they can to bring about a better outcome.\nThe article is riddled with lies, but even so, it is clear that the globalists are getting increasingly worried. And well they should. The rising tide of nationalism is going to kill their evil utopian dreams as dead as the League of Nations. The European nations will be greatly blessed if they are so fortunate as to find leaders half as effective, and half as genuinely devoted to their nations, as the Russians are to have Vladimir Putin.\nWhat Soros calls “the open society” is a fraud being marketed by the globalist elite to mask their true objectives of rule by an international aristocracy. There are few institutions more openly anti-democratic than the EU, which subverts even democracies that don’t belong to it. If the US was genuinely interested in spreading democracy abroad, its first order of business should be to invade Brussels.\nHistory never ended. Liberal democracy – especially in its bizarrely contorted limited modern form – has completely failed.  The immigrant-riddled US political system is one financial failure away from collapse. How painful it must be to be reaching the end of one’s road in the knowledge that all of one’s works will be undone within a single generation.\nThe Saker has some relevant comments:\nPoor “EUans” (my own word for the European zombies who believed in the Bilderberger’s European Union): they are now, how shall I put it politely, totally “frigged”? Not only did the British people defy the Empire and vote for a Brexit, but now the Imperial Homeland has “backstabbed” them by electing a patriot who is not interested in maintaining the global empire (or so he says, at least for the time being). At the same time, the so-called “refugee crisis” is bringing several crucial EU nations to the brink of a civil war (France for example) while all the efforts of the elites to blame Russia for it all end up in abject failures. Just check out this hilarious article in the British Sun which accuses Russia of, I kid you not, “organizing sex attacks in Germany“!! True, we already had the “Serbian Chetniks using rape as a weapon of ethnic cleansing” and “Gaddafi distributing Viagra to his soldiers to rape opposition supporters” but Putin ordering refugees to rape women in Germany is the best, so to speak. And just in case the unthinkable happens in Germany, the Germans have already warned that Russian hackers might steal the election in Germany. If this was not so utterly disgusting it would be hilarious. The bottom line is this: the entire EU project is morally completely bankrupt, each EU member state is now in a deep political crisis and the so-called “elites” are scrambling to find a response to what appears to be an inevitable collapse of the EU-order over Europe.",
  "tags": [
    "conspiracy",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-29T12:39:00+00:00"
}