{
  "url": "https://voxday.net/2016/12/19/destruction-and-redirection/",
  "scraped_at": "2025-12-18T02:11:09.450385",
  "title": "Destruction and redirection",
  "date_display": "December 19, 2016",
  "date_iso": "2016-12-19T19:30:00+00:00",
  "date_from_url": "2016-12-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A new user is impressed with <a href=\"https://infogalactic.blogspot.com/2016/12/fan-mail.html\">what he finds at Infogalactic</a>:</p><blockquote><p> Today, I did a quick internet search (Google) for “Shiva” to verify a detail or two.  I clicked on the Wikipedia link.  By the end of the second brief paragraph, I was already informed of “the goddess tradition of Hinduism called Shaktism” and how it considers Parvati to be “the equal complementary partner” of Shiva.</p><p>Hmm.  Is Shaktism so prevalent or important that it must be introduced before we learn anything more of Shiva?  Also, I can understand how Parvati may be “complementary”, but the addition of “equal” smelled too SJWish.  I went to Infogalactic to see how its page differs.</p><p>On Infogalactic, the offending lines are absent, among other changes.</p><p>I am impressed.  I am also encouraged.</p></blockquote><p>This is a long marathon, not a sprint, but the Infogalactic team is gradually cleaning up one entry at a time, excising the ever-present SJW bias and transforming the narrative spin into subject-relevant facts. Compare the beginning of these two articles on Race and Intelligence.</p><p>Wikipedia, <a href=\"https://en.wikipedia.org/wiki/Race_and_intelligence\">Race and Intelligence</a>:</p><blockquote><ul><li>This article has multiple issues. Please help improve it or discuss these issues on the talk page.</li><li>The neutrality of this article is disputed. (October 2012)</li><li>This article may be unbalanced towards certain viewpoints. (October 2012)</li><li>This article’s factual accuracy is disputed. (October 2012)</li></ul><p>The connection between race and intelligence has been a subject of debate in both popular science and academic research since the inception of IQ testing in the early 20th century. The debate concerns the interpretation of research findings that test takers identifying as “White” tend on average to score higher than test takers of African ancestry on IQ tests, and subsequent findings that test takers of East Asian background tend to score higher than whites.</p></blockquote><p>Infogalactic, <a href=\"http://infogalactic.com/info/Race_and_intelligence\">Race and Intelligence</a>:</p><blockquote class=\"tr_bq\"><p> The existence of a link between race and intelligence has been repeatedly observed by scientists, but remains extremely controversial. Research suggests that the average IQ score of East Asians is higher than that of Europeans, and the average IQ score of Europeans is higher than that of Africans and African-Americans. Additional research has indicated that environmental factors such as socio-economic status and education can explain some, but not all, of these observed differences in IQ.</p></blockquote><p>The problem with the Wikipedia article is that it is not actually about the purported subject, which is the scientific research that has repeatedly indicated a connection between race and intelligence, but rather, the debate concerning the legitimacy of the observations of that connection. Can you imagine the Wikipedia admins accepting a similar framing of the page on evolution as a debate rather than as a topic in its own right? They would never accept this even though, from the very start, evolutionary theory has been considerably more debatable than the observations, scientific, mundane, and logical, that the people of one race will <i>always </i>be more, or less, intelligent on average than the people of another race.</p><p>It’s certainly proper to include criticism of the subject, of course, which Infogalactic contains in its Criticism section. But this practice is very different than the thought-police tactic often utilized on Wikipedia, which is to place the criticism in definitional sections, sometimes even in the very first paragraph. That tactic not only isn’t honest, it doesn’t even make sense. After all, the debate about evolution, and the various criticisms and doubts about the legitimacy of evolutionary theory, cannot <i>possibly </i>be intrinsic to the definition of what evolutionary theory is.</p><p>Also, Pale Moon users will be glad to know that an intrepid Pale Moon user has figured out how to redirect all Wikipedia links to Infogalactic. <a href=\"https://infogalactic.blogspot.com/2016/12/pale-moon-redirect.html\">Instructions here</a>. Also, expect some news on improved performance soon, possibly even this week.</p></div>",
  "content_text": "A new user is impressed with\nwhat he finds at Infogalactic\n:\nToday, I did a quick internet search (Google) for “Shiva” to verify a detail or two.  I clicked on the Wikipedia link.  By the end of the second brief paragraph, I was already informed of “the goddess tradition of Hinduism called Shaktism” and how it considers Parvati to be “the equal complementary partner” of Shiva.\nHmm.  Is Shaktism so prevalent or important that it must be introduced before we learn anything more of Shiva?  Also, I can understand how Parvati may be “complementary”, but the addition of “equal” smelled too SJWish.  I went to Infogalactic to see how its page differs.\nOn Infogalactic, the offending lines are absent, among other changes.\nI am impressed.  I am also encouraged.\nThis is a long marathon, not a sprint, but the Infogalactic team is gradually cleaning up one entry at a time, excising the ever-present SJW bias and transforming the narrative spin into subject-relevant facts. Compare the beginning of these two articles on Race and Intelligence.\nWikipedia,\nRace and Intelligence\n:\nThis article has multiple issues. Please help improve it or discuss these issues on the talk page.\nThe neutrality of this article is disputed. (October 2012)\nThis article may be unbalanced towards certain viewpoints. (October 2012)\nThis article’s factual accuracy is disputed. (October 2012)\nThe connection between race and intelligence has been a subject of debate in both popular science and academic research since the inception of IQ testing in the early 20th century. The debate concerns the interpretation of research findings that test takers identifying as “White” tend on average to score higher than test takers of African ancestry on IQ tests, and subsequent findings that test takers of East Asian background tend to score higher than whites.\nInfogalactic,\nRace and Intelligence\n:\nThe existence of a link between race and intelligence has been repeatedly observed by scientists, but remains extremely controversial. Research suggests that the average IQ score of East Asians is higher than that of Europeans, and the average IQ score of Europeans is higher than that of Africans and African-Americans. Additional research has indicated that environmental factors such as socio-economic status and education can explain some, but not all, of these observed differences in IQ.\nThe problem with the Wikipedia article is that it is not actually about the purported subject, which is the scientific research that has repeatedly indicated a connection between race and intelligence, but rather, the debate concerning the legitimacy of the observations of that connection. Can you imagine the Wikipedia admins accepting a similar framing of the page on evolution as a debate rather than as a topic in its own right? They would never accept this even though, from the very start, evolutionary theory has been considerably more debatable than the observations, scientific, mundane, and logical, that the people of one race will\nalways\nbe more, or less, intelligent on average than the people of another race.\nIt’s certainly proper to include criticism of the subject, of course, which Infogalactic contains in its Criticism section. But this practice is very different than the thought-police tactic often utilized on Wikipedia, which is to place the criticism in definitional sections, sometimes even in the very first paragraph. That tactic not only isn’t honest, it doesn’t even make sense. After all, the debate about evolution, and the various criticisms and doubts about the legitimacy of evolutionary theory, cannot\npossibly\nbe intrinsic to the definition of what evolutionary theory is.\nAlso, Pale Moon users will be glad to know that an intrepid Pale Moon user has figured out how to redirect all Wikipedia links to Infogalactic.\nInstructions here\n. Also, expect some news on improved performance soon, possibly even this week.",
  "tags": [
    "Infogalactic"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-19T19:30:00+00:00"
}