{
  "url": "https://voxday.net/2016/12/20/epic-success/",
  "scraped_at": "2025-12-18T02:11:18.565175",
  "title": "Epic success",
  "date_display": "December 20, 2016",
  "date_iso": "2016-12-20T16:00:00+00:00",
  "date_from_url": "2016-12-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The early reviews are in, and I’m pleased to see that the general verdict is that <b><i><a href=\"http://amzn.to/2hgubn2\">A SEA OF SKULLS</a></i></b> is an improvement on <a href=\"http://amzn.to/2h9Emd9\"><b><i>A THRONE OF BONES</i></b></a>. Success, for a writer of epic fantasy, is when one aims at George RR Martin, only to discover that with Book Two, reviewers are beginning to compare the work to that <a href=\"https://www.amazon.com/gp/customer-reviews/R182XBFHZ0JTUO/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&amp;ASIN=B01N2T8DHK\">of Tolkien rather than Martin</a>.</p><blockquote><p> Even better than the first. The perspectives were well written and differed entirely on the concepts of civilization and what it means for each to make war. Whether it is from an orc captain or an elven wing of flying calvary, a stranded Legion, a feudal kingdom of knights and let us not forget the Vikings. All unique with a current of practical realism in how strategy and tactics play out in total war including the inner turmoil of personal ideology of each main character. What is the right choice? What pieces make up the foundation of how to even begin to inform one of which choice is wisdom and which folly.</p><p>Epic on the level of Tolkien, but written in a totally different way, for a different generation of audience. Tolkien addressed good and evil of his generations struggle, while Day is focused on the heart of his own generation. Good and evil are timeless, but the battlefield shifts with the times and Day nails it.</p></blockquote><p>When I began writing <i>Arts of Dark and Light</i>, I believed that I could do better than Martin did in <i>A Dance With Dragons</i>, which I found extremely disappointing given the earlier books in the series. I was naively optimistic that the decline in quality I perceived in the fifth book of <i>ASOIAF </i>was more the result of a foolish decision on Martin’s part to fill in the blanks rather than skipping ahead to when the dragons were grown, as I understand was his original plan.</p><p>After all, even though <i>A Storm of Swords</i> was not quite as good as its two predecessors, the introduction of the Ironborn and their religion was a spectacular scene, and it was entirely possible that its deficiencies were more related to middle-book syndrome than any incapacity or lack of imagination on Martin’s part. And the problem with <i>A Feast for Crows</i> was obviously mere fat fantasy bloat, a problem easily resolved by stripping things down. But <i>A Dance With Dragons</i> was simply bad, with false characterizations and even the dread river journey; the surefire sign of an author who lacks for better ideas. Even given the signs that the decline was structural in nature, it never once occurred to me that I could write anything equal to the rest of the series.</p><p>However, as I struggled with the challenges of deciding how to proceed with all the various options presented by the perspective characters, and prospective new perspective characters in the second book, I began to realize how thoroughly Martin had ruined <i>A Song of Ice and Fire</i> when he expanded it from the original concept of a trilogy. What I realized was that as the story expanded, and as the characters separated, even more discipline and focus was required, not less. In other words, fewer perspective characters, but deeper engagement with their personal story, and therefore letting significant elements of the larger story go without more than tangential attention or description.</p><p>This is why it has taken me so much longer to write the second book. It was less about simply cranking out the story, and more about making good decisions about what not to write and what avenues to leave unexplored. Even a well-written and interesting scene is a problem if it requires going down a path that will ultimately prove an unnecessary distraction.</p><p>Martin’s error, as I see it, is that he tried to describe too much of the larger story while failing to understand which of his characters are necessary to the larger story. His books increasingly read as if Tolkien had decided to devote as much of <i>The Return of the King</i> to Elrond in Rivendell, and to introducing the travails of a new female character from Bree, as he does to Aragorn and Frodo. Martin’s error is compounded by his apparent compulsion to keep trying to shock the reader; the impact of the Red Wedding was considerably less than that of Ned’s execution despite the greater quantity of blood shed, because the sophisticated reader can’t help but see it coming. Moreover, Martin increasingly relies upon cheating the reader, engaging in increasingly transparent sleight-of-hand, and sabotaging his characters in order to try to achieve the effect he is foolishly seeking.</p><p>The idea that the Young Wolf, who has proven to be a brilliant strategist and tactician, is going to throw everything away for love in the middle of a war to avenge his father is so profoundly stupid, and so false to his character as established, that it actually made me angry at the time. And all so that Martin could have an excuse to “shock” the reader. That was the moment that I realized Martin was not necessarily the first-rate writer one might have believed on the basis of the first book, although I wrongly assumed at the time that it was a singular mistake.</p><p>I won’t give away any details, nor will I claim to be a better or more accomplished writer than Martin across the board, but I will note that in <i>ATOB</i>, I was capable of pulling off something that Martin proved unable to do without cheating, despite multiple attempts on his part to do so. What is intriguing about the recent reviews of <i>A SEA OF SKULLS</i> is that, unlike when I started writing <i>Arts of Light and Dark</i>, I now believe that the end result of what will be a five-book series has the <u>potential </u>to be considered by impartial readers of the future to be a better epic fantasy in the end than <i>A Song of Ice and Fire</i>.</p><p>I’m not saying that it will be, only that I now think it may be possible. There is still a long and arduous road ahead. It is possible that my writing has peaked, it is possible that Martin will somehow manage to pull a rabbit out of a hat and reverse his apparent decline. Only time will tell. But what I can say is that it is no longer my object to write an epic that will be seen as being worthy of comparison to Martin’s, but rather, one to which his series compares unfavorably. That may sound arrogant or it may sound insane. Nevertheless, that is my objective.</p><p>The good news, <a href=\"https://www.amazon.com/gp/customer-reviews/R24KUJBQXHUXMB/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&amp;ASIN=B00I6H0J7S\">for those who are just reading the first book now</a>, is that the second one is now available. And, of course, for those who have read both, there is <b><i><a href=\"http://amzn.to/20HuZhV\">Summa Elvetica</a></i></b> and the collection of short stories set in Selenoth, which will be available in hardcover and paperback editions next month.</p><blockquote class=\"tr_bq\"><p> A fabulous read, very entertaining. I was very sad to reach the end. Dammit, I want to know what happens next! The sequel cannot come quickly enough. Mr Day is a great new voice in fantasy. The story moves at a brisk pace, and is just a whole lot of fun. The world of Selenoth is imaginatively realised, and both more logical and intriguing than Westeros from Game of thrones. I was particularly impressed by the scenes featuring the Legions, which featured some incredible battles. Very well realised. Highly recommended for anybody who likes fantasy. Great characters. Shocking twists. And a story that continues to suprise right up to the end. Try it, and see for yourself just how quickly you go through its hundreds of pages.</p></blockquote></div>",
  "content_text": "The early reviews are in, and I’m pleased to see that the general verdict is that\nA SEA OF SKULLS\nis an improvement on\nA THRONE OF BONES\n. Success, for a writer of epic fantasy, is when one aims at George RR Martin, only to discover that with Book Two, reviewers are beginning to compare the work to that\nof Tolkien rather than Martin\n.\nEven better than the first. The perspectives were well written and differed entirely on the concepts of civilization and what it means for each to make war. Whether it is from an orc captain or an elven wing of flying calvary, a stranded Legion, a feudal kingdom of knights and let us not forget the Vikings. All unique with a current of practical realism in how strategy and tactics play out in total war including the inner turmoil of personal ideology of each main character. What is the right choice? What pieces make up the foundation of how to even begin to inform one of which choice is wisdom and which folly.\nEpic on the level of Tolkien, but written in a totally different way, for a different generation of audience. Tolkien addressed good and evil of his generations struggle, while Day is focused on the heart of his own generation. Good and evil are timeless, but the battlefield shifts with the times and Day nails it.\nWhen I began writing\nArts of Dark and Light\n, I believed that I could do better than Martin did in\nA Dance With Dragons\n, which I found extremely disappointing given the earlier books in the series. I was naively optimistic that the decline in quality I perceived in the fifth book of\nASOIAF\nwas more the result of a foolish decision on Martin’s part to fill in the blanks rather than skipping ahead to when the dragons were grown, as I understand was his original plan.\nAfter all, even though\nA Storm of Swords\nwas not quite as good as its two predecessors, the introduction of the Ironborn and their religion was a spectacular scene, and it was entirely possible that its deficiencies were more related to middle-book syndrome than any incapacity or lack of imagination on Martin’s part. And the problem with\nA Feast for Crows\nwas obviously mere fat fantasy bloat, a problem easily resolved by stripping things down. But\nA Dance With Dragons\nwas simply bad, with false characterizations and even the dread river journey; the surefire sign of an author who lacks for better ideas. Even given the signs that the decline was structural in nature, it never once occurred to me that I could write anything equal to the rest of the series.\nHowever, as I struggled with the challenges of deciding how to proceed with all the various options presented by the perspective characters, and prospective new perspective characters in the second book, I began to realize how thoroughly Martin had ruined\nA Song of Ice and Fire\nwhen he expanded it from the original concept of a trilogy. What I realized was that as the story expanded, and as the characters separated, even more discipline and focus was required, not less. In other words, fewer perspective characters, but deeper engagement with their personal story, and therefore letting significant elements of the larger story go without more than tangential attention or description.\nThis is why it has taken me so much longer to write the second book. It was less about simply cranking out the story, and more about making good decisions about what not to write and what avenues to leave unexplored. Even a well-written and interesting scene is a problem if it requires going down a path that will ultimately prove an unnecessary distraction.\nMartin’s error, as I see it, is that he tried to describe too much of the larger story while failing to understand which of his characters are necessary to the larger story. His books increasingly read as if Tolkien had decided to devote as much of\nThe Return of the King\nto Elrond in Rivendell, and to introducing the travails of a new female character from Bree, as he does to Aragorn and Frodo. Martin’s error is compounded by his apparent compulsion to keep trying to shock the reader; the impact of the Red Wedding was considerably less than that of Ned’s execution despite the greater quantity of blood shed, because the sophisticated reader can’t help but see it coming. Moreover, Martin increasingly relies upon cheating the reader, engaging in increasingly transparent sleight-of-hand, and sabotaging his characters in order to try to achieve the effect he is foolishly seeking.\nThe idea that the Young Wolf, who has proven to be a brilliant strategist and tactician, is going to throw everything away for love in the middle of a war to avenge his father is so profoundly stupid, and so false to his character as established, that it actually made me angry at the time. And all so that Martin could have an excuse to “shock” the reader. That was the moment that I realized Martin was not necessarily the first-rate writer one might have believed on the basis of the first book, although I wrongly assumed at the time that it was a singular mistake.\nI won’t give away any details, nor will I claim to be a better or more accomplished writer than Martin across the board, but I will note that in\nATOB\n, I was capable of pulling off something that Martin proved unable to do without cheating, despite multiple attempts on his part to do so. What is intriguing about the recent reviews of\nA SEA OF SKULLS\nis that, unlike when I started writing\nArts of Light and Dark\n, I now believe that the end result of what will be a five-book series has the\npotential\nto be considered by impartial readers of the future to be a better epic fantasy in the end than\nA Song of Ice and Fire\n.\nI’m not saying that it will be, only that I now think it may be possible. There is still a long and arduous road ahead. It is possible that my writing has peaked, it is possible that Martin will somehow manage to pull a rabbit out of a hat and reverse his apparent decline. Only time will tell. But what I can say is that it is no longer my object to write an epic that will be seen as being worthy of comparison to Martin’s, but rather, one to which his series compares unfavorably. That may sound arrogant or it may sound insane. Nevertheless, that is my objective.\nThe good news,\nfor those who are just reading the first book now\n, is that the second one is now available. And, of course, for those who have read both, there is\nSumma Elvetica\nand the collection of short stories set in Selenoth, which will be available in hardcover and paperback editions next month.\nA fabulous read, very entertaining. I was very sad to reach the end. Dammit, I want to know what happens next! The sequel cannot come quickly enough. Mr Day is a great new voice in fantasy. The story moves at a brisk pace, and is just a whole lot of fun. The world of Selenoth is imaginatively realised, and both more logical and intriguing than Westeros from Game of thrones. I was particularly impressed by the scenes featuring the Legions, which featured some incredible battles. Very well realised. Highly recommended for anybody who likes fantasy. Great characters. Shocking twists. And a story that continues to suprise right up to the end. Try it, and see for yourself just how quickly you go through its hundreds of pages.",
  "tags": [
    "Book Review",
    "Castalia House",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-20T16:00:00+00:00"
}