{
  "url": "https://voxday.net/2016/12/07/facts-are-fake-news/",
  "scraped_at": "2025-12-18T02:09:12.056983",
  "title": "Facts are “fake news”",
  "date_display": "December 7, 2016",
  "date_iso": "2016-12-07T16:00:00+00:00",
  "date_from_url": "2016-12-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The social media giants are increasingly demonstrating themselves to be the servitors of Big Brother. White is black, day is night, Islam means peace, and <a href=\"http://www.infowars.com/google-removes-fake-news-that-black-people-commit-more-crimes/\">real news is fake news</a>:</p><blockquote><p> Under the guise of tackling “fake news,” Google is removing search results that pertain to crime statistics that show black people commit more crimes, despite the fact that this is widely documented to be true. An article in the Guardian entitled Google ‘must review its search rankings because of rightwing manipulation’ details how “leading academics” are pressuring Google to artificially edit its search algorithm to prevent certain subjects from appearing at the top of its search rankings. In response, the piece notes that Google has removed search results that suggest “black people commit more crimes”. Negative results about the religion of Islam were also removed.<br> This is alarming given that virtually every metric proves that criminality is more prevalent in black communities compared to white and Hispanic communities in America. It’s an uncomfortable fact that black people commit more crimes than any other race in America, but it’s a fact nonetheless. Claiming that reality is actually “fake news” because it suits your political stance doesn’t change the nature of reality.</br></p><p>Despite making up just 13% of the population, blacks commit around half of homicides in the United States. DOJ statistics show that between 1980 and 2008, blacks committed 52% of homicides, compared to 45% of homicides committed by whites.</p><p>More up to date FBI statistics tell a similar story. In 2013, black criminals carried out 38% of murders, compared to 31.1% for whites, again despite the fact that there are five times more white people in the U.S. From 2011 to 2013, 38.5 per cent of people arrested for murder, manslaughter, rape, robbery, and aggravated assault were black. This figure is three times higher than the 13% black population figure. Black males aged 15-34, who account for around 3% of the population, are responsible for the vast majority of these crimes.</p><p>Despite being outnumbered by whites five to one, blacks commit eight times more crimes against whites than vice-versa, according to FBI statistics from 2007. A black male is 40 times as likely to assault a white person as the reverse.</p><p>While it is understandable that Google would want to prevent neo-nazi content from appearing at the top of its search rankings, the fact that the tech giant is now censoring objective facts under the justification of tackling “fake news” is chilling.</p><p>This indicates that Google, along with Facebook, Twitter, YouTube and other social media sites, are using the excuse of “fake news” to bury factual information that is inconvenient to leftist political narratives.</p></blockquote><p>This dedication to falsehood and deception will only make it all the easier to disrupt them when the time comes. Furthermore, the charges of “neo-nazi” are every bit as dubious as the charge of “fake news”.</p><p>Never forget the First Law of SJW: <a href=\"http://amzn.to/1tpCVKy\">SJWS ALWAYS LIE</a>.</p></div>",
  "content_text": "The social media giants are increasingly demonstrating themselves to be the servitors of Big Brother. White is black, day is night, Islam means peace, and\nreal news is fake news\n:\nUnder the guise of tackling “fake news,” Google is removing search results that pertain to crime statistics that show black people commit more crimes, despite the fact that this is widely documented to be true. An article in the Guardian entitled Google ‘must review its search rankings because of rightwing manipulation’ details how “leading academics” are pressuring Google to artificially edit its search algorithm to prevent certain subjects from appearing at the top of its search rankings. In response, the piece notes that Google has removed search results that suggest “black people commit more crimes”. Negative results about the religion of Islam were also removed.\nThis is alarming given that virtually every metric proves that criminality is more prevalent in black communities compared to white and Hispanic communities in America. It’s an uncomfortable fact that black people commit more crimes than any other race in America, but it’s a fact nonetheless. Claiming that reality is actually “fake news” because it suits your political stance doesn’t change the nature of reality.\nDespite making up just 13% of the population, blacks commit around half of homicides in the United States. DOJ statistics show that between 1980 and 2008, blacks committed 52% of homicides, compared to 45% of homicides committed by whites.\nMore up to date FBI statistics tell a similar story. In 2013, black criminals carried out 38% of murders, compared to 31.1% for whites, again despite the fact that there are five times more white people in the U.S. From 2011 to 2013, 38.5 per cent of people arrested for murder, manslaughter, rape, robbery, and aggravated assault were black. This figure is three times higher than the 13% black population figure. Black males aged 15-34, who account for around 3% of the population, are responsible for the vast majority of these crimes.\nDespite being outnumbered by whites five to one, blacks commit eight times more crimes against whites than vice-versa, according to FBI statistics from 2007. A black male is 40 times as likely to assault a white person as the reverse.\nWhile it is understandable that Google would want to prevent neo-nazi content from appearing at the top of its search rankings, the fact that the tech giant is now censoring objective facts under the justification of tackling “fake news” is chilling.\nThis indicates that Google, along with Facebook, Twitter, YouTube and other social media sites, are using the excuse of “fake news” to bury factual information that is inconvenient to leftist political narratives.\nThis dedication to falsehood and deception will only make it all the easier to disrupt them when the time comes. Furthermore, the charges of “neo-nazi” are every bit as dubious as the charge of “fake news”.\nNever forget the First Law of SJW:\nSJWS ALWAYS LIE\n.",
  "tags": [
    "#AltTech",
    "media",
    "SJW",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-07T16:00:00+00:00"
}