{
  "url": "https://voxday.net/2016/12/16/fighting-for-due-process/",
  "scraped_at": "2025-12-18T02:10:35.308574",
  "title": "Fighting for due process",
  "date_display": "December 16, 2016",
  "date_iso": "2016-12-16T10:22:00+00:00",
  "date_from_url": "2016-12-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Minnesota Golden Gophers take <a href=\"http://www.espn.com/college-football/story/_/id/18288753/minnesota-golden-gophers-players-boycotting-football-activities-suspensions-10-teammates\">a strong stand for due process</a> for college men:</p><blockquote><p> Minnesota football players announced Thursday night that they were boycotting all football activities in the wake of the suspensions this week of 10 teammates. The school did not specify the reasons for the suspensions in Tuesday’s announcement. Ray Buford Sr., the father of defensive back Ray Buford Jr., one of the suspended players, said Wednesday the suspensions resulted from a Title IX investigation conducted by the university into an alleged sexual assault, which was separate from a police investigation into the alleged assault in the early hours of Sept. 2.</p><p>The other suspended players are sophomore running back Carlton Djam; freshman quarterback Seth Green; sophomore defensive back KiAnte Hardin; redshirt freshman defensive back Dior Johnson; freshman defensive lineman Tamarion Johnson; junior running back Kobe McCrary; sophomore defensive back Antonio Shenault; freshman quarterback Mark Williams; and freshman defensive back Antoine Winfield Jr.</p><p>In a statement read by senior wide receiver Drew Wolitarsky, the players said: “The boycott will remain effective until due process is followed and suspensions for all 10 players involved are lifted.”</p><p>The statement said the players were forced to take action after an unsatisfactory meeting with athletic director Mark Coyle in which they “wanted answers but received misleading statements.”</p><p>Coyle and university president Eric W. Kaler released a joint statement after the players’ announcement that read: “We understand that a lot of confusion and frustration exists as a result of this week’s suspension of 10 Gopher Football players from all team activities. The reality is that not everyone can have all of the facts, and unfortunately the University cannot share more information due to federal laws regarding student privacy.</p><p>“We fully support our Gopher football players and all of our student-athletes. Situations like this are always difficult, and the decision was made in consultation with and has the full support of President Eric Kaler. The decision was based on facts and is reflective of the University’s values. We want to continue an open dialogue with our players and will work to do that over the coming days. It’s important that we continue to work together as we move through this difficult time.”</p><p>There has been some confusion about whether or not Gophers coach Tracy Claeys backed the decision to suspend the players. Coyle and Kaler said Claeys was consulted, but the players said Thursday night they did not believe their coach had a say in the matter.</p><p>Claeys spoke out in support of his players on Twitter after their decision to boycott. Former Minnesota Vikings star cornerback Antoine Winfield Sr. said his son did nothing wrong and blistered university leadership for what he said was a lack of communication.</p><p>“If the president and athletic director keep their jobs, my son, Antoine Winfield Jr., will not attend the University of Minnesota,” Winfield Sr. said.</p><p>The players are demanding a closed-door meeting with members of the board of regents without the presence of Coyle or Kaler.</p></blockquote><p>If other bowl-bound football teams join the Gopher protest against the complete lack of due process afforded young men in college who are accused of sexual misconduct, I suspect the extralegal nonsense of the last 30 years will be undone rather quickly.</p><p>No one is saying that football players, particularly black football players, don’t behave badly from time to time around women and break the law. I know a woman who was raped by a black football player at the University of Minnesota, and it wasn’t one of those next-day-regret “rapes” either. But that’s clearly not the situation here since the police have already investigated and the players were not even <i>arrested</i>, let alone charged with any crime. Moreover, only three players were investigated by the police, but ten are now suspended by the university at the behest of the Title IX investigation.</p><p>It would certainly make for an intriguing dilemma if the universities were forced to choose between their SJW-converged internal justice system-substitutes and the football-generated revenue produced by the players.</p></div>",
  "content_text": "The Minnesota Golden Gophers take\na strong stand for due process\nfor college men:\nMinnesota football players announced Thursday night that they were boycotting all football activities in the wake of the suspensions this week of 10 teammates. The school did not specify the reasons for the suspensions in Tuesday’s announcement. Ray Buford Sr., the father of defensive back Ray Buford Jr., one of the suspended players, said Wednesday the suspensions resulted from a Title IX investigation conducted by the university into an alleged sexual assault, which was separate from a police investigation into the alleged assault in the early hours of Sept. 2.\nThe other suspended players are sophomore running back Carlton Djam; freshman quarterback Seth Green; sophomore defensive back KiAnte Hardin; redshirt freshman defensive back Dior Johnson; freshman defensive lineman Tamarion Johnson; junior running back Kobe McCrary; sophomore defensive back Antonio Shenault; freshman quarterback Mark Williams; and freshman defensive back Antoine Winfield Jr.\nIn a statement read by senior wide receiver Drew Wolitarsky, the players said: “The boycott will remain effective until due process is followed and suspensions for all 10 players involved are lifted.”\nThe statement said the players were forced to take action after an unsatisfactory meeting with athletic director Mark Coyle in which they “wanted answers but received misleading statements.”\nCoyle and university president Eric W. Kaler released a joint statement after the players’ announcement that read: “We understand that a lot of confusion and frustration exists as a result of this week’s suspension of 10 Gopher Football players from all team activities. The reality is that not everyone can have all of the facts, and unfortunately the University cannot share more information due to federal laws regarding student privacy.\n“We fully support our Gopher football players and all of our student-athletes. Situations like this are always difficult, and the decision was made in consultation with and has the full support of President Eric Kaler. The decision was based on facts and is reflective of the University’s values. We want to continue an open dialogue with our players and will work to do that over the coming days. It’s important that we continue to work together as we move through this difficult time.”\nThere has been some confusion about whether or not Gophers coach Tracy Claeys backed the decision to suspend the players. Coyle and Kaler said Claeys was consulted, but the players said Thursday night they did not believe their coach had a say in the matter.\nClaeys spoke out in support of his players on Twitter after their decision to boycott. Former Minnesota Vikings star cornerback Antoine Winfield Sr. said his son did nothing wrong and blistered university leadership for what he said was a lack of communication.\n“If the president and athletic director keep their jobs, my son, Antoine Winfield Jr., will not attend the University of Minnesota,” Winfield Sr. said.\nThe players are demanding a closed-door meeting with members of the board of regents without the presence of Coyle or Kaler.\nIf other bowl-bound football teams join the Gopher protest against the complete lack of due process afforded young men in college who are accused of sexual misconduct, I suspect the extralegal nonsense of the last 30 years will be undone rather quickly.\nNo one is saying that football players, particularly black football players, don’t behave badly from time to time around women and break the law. I know a woman who was raped by a black football player at the University of Minnesota, and it wasn’t one of those next-day-regret “rapes” either. But that’s clearly not the situation here since the police have already investigated and the players were not even\narrested\n, let alone charged with any crime. Moreover, only three players were investigated by the police, but ten are now suspended by the university at the behest of the Title IX investigation.\nIt would certainly make for an intriguing dilemma if the universities were forced to choose between their SJW-converged internal justice system-substitutes and the football-generated revenue produced by the players.",
  "tags": [
    "law",
    "sports"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-16T10:22:00+00:00"
}