{
  "url": "https://voxday.net/2016/12/10/homeschool-or-else/",
  "scraped_at": "2025-12-18T02:09:36.065424",
  "title": "Homeschool or else",
  "date_display": "December 10, 2016",
  "date_iso": "2016-12-10T10:32:00+00:00",
  "date_from_url": "2016-12-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When they ask children who are abused why they didn’t tell anyone, <a href=\"http://thefreethoughtproject.com/school-cop-teacher-rape-student/\">this sort of thing</a> is probably why. Who are they supposed to trust?</p><blockquote><p> When a school police officer learned that a teacher was raping a 14-year-old sophomore, he did it too, the girl says in a civil lawsuit, and now the teacher is in prison and the cop is awaiting trial. In a federal lawsuit against the Edgewood Independent School District and Memorial High School, Jane Doe says both district employees used “hall passes” to pull her from class to sexually assault and sodomize her on school grounds.</p><p>Her chemistry teacher, Marcus Revilla, who impregnated her, pleaded guilty to sex crimes in state and federal courts, including sexual assault of a child and production of child pornography. He was sentenced to 13 years in state prison and a 17-year federal prison term.</p><p>Revilla filmed his sexual exploitation of the girl, and sexually assaulted and/or sodomized her “on at least 100 separate and distinct occasions,” according to her Dec. 5 lawsuit.</p><p>Former Edgewood ISD police Officer Manuel Hernandez is awaiting trial in Bexar County Court on charges of aggravated sexual assault.</p><p>She sued him too, and the school district’s police department.</p></blockquote><p>Now, Mr. Hernandez deserves his fair trial, but the fact that the teacher she accused has already been convicted tends to lend credence to her account of events. Also, there is the fact that Hispanics are disproportionately inclined towards committing sex crimes to bolster her story.</p><p>You can talk the “my kids go to a great school” talk all you like, but the fact is that predators <i>always </i>go where the prey is, and the statistics clearly indicate that <i>every </i>school, public or private, is concealing one or more sexual predators among its employees.</p></div>",
  "content_text": "When they ask children who are abused why they didn’t tell anyone,\nthis sort of thing\nis probably why. Who are they supposed to trust?\nWhen a school police officer learned that a teacher was raping a 14-year-old sophomore, he did it too, the girl says in a civil lawsuit, and now the teacher is in prison and the cop is awaiting trial. In a federal lawsuit against the Edgewood Independent School District and Memorial High School, Jane Doe says both district employees used “hall passes” to pull her from class to sexually assault and sodomize her on school grounds.\nHer chemistry teacher, Marcus Revilla, who impregnated her, pleaded guilty to sex crimes in state and federal courts, including sexual assault of a child and production of child pornography. He was sentenced to 13 years in state prison and a 17-year federal prison term.\nRevilla filmed his sexual exploitation of the girl, and sexually assaulted and/or sodomized her “on at least 100 separate and distinct occasions,” according to her Dec. 5 lawsuit.\nFormer Edgewood ISD police Officer Manuel Hernandez is awaiting trial in Bexar County Court on charges of aggravated sexual assault.\nShe sued him too, and the school district’s police department.\nNow, Mr. Hernandez deserves his fair trial, but the fact that the teacher she accused has already been convicted tends to lend credence to her account of events. Also, there is the fact that Hispanics are disproportionately inclined towards committing sex crimes to bolster her story.\nYou can talk the “my kids go to a great school” talk all you like, but the fact is that predators\nalways\ngo where the prey is, and the statistics clearly indicate that\nevery\nschool, public or private, is concealing one or more sexual predators among its employees.",
  "tags": [
    "education"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-10T10:32:00+00:00"
}