{
  "url": "https://voxday.net/2016/12/29/i-dont-care/",
  "scraped_at": "2025-12-18T02:12:27.561925",
  "title": "I don’t care",
  "date_display": "December 29, 2016",
  "date_iso": "2016-12-29T00:55:00+00:00",
  "date_from_url": "2016-12-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>For future reference, this will be my response to all future queries concerning whether I heard about X doing, or saying, anything, and what I think about X doing, or saying, Y, about Z.</p><p><i>I don’t care. I’m not interested.</i></p><p>My friends are my friends. Castalia authors are Castalia authors. I don’t give an airborne rodent’s posterior if they happen to do or say something that offends your ideological, religious, ethnic, national, or racial sensitivities.</p><p>I realize this won’t stop the occasional idiot running to me with “did you hear what X did” like a teenage girl who just heard the rumor that the head cheerleader cheated on her boyfriend with the math teacher, but for the record, that will be my response.</p><p><i>I don’t care. I’m not interested.</i></p><p>And if you have a problem with that, then please leave and find some other corner of the Internet in which to reside. It’s a big place. Take your crusade, whatever it might be, elsewhere. You’ve got no shortage of options. And I’m not interested in your opinion of me or anyone else. Talking about me, or about someone else, rather than the subject of the post, is an <i>excellent </i>way to get yourself banned here.</p><p>This is not, and has never been, a free speech zone. I’ll cheerfully ban you for annoying me or trying to waste my time. And I have a low tolerance for gammas, particularly gamma midwits.</p><p>I’m done trying to talk sense into the senseless, or to explain rationales to the irrational. You’d think I, of all people, would know better.</p></div>",
  "content_text": "For future reference, this will be my response to all future queries concerning whether I heard about X doing, or saying, anything, and what I think about X doing, or saying, Y, about Z.\nI don’t care. I’m not interested.\nMy friends are my friends. Castalia authors are Castalia authors. I don’t give an airborne rodent’s posterior if they happen to do or say something that offends your ideological, religious, ethnic, national, or racial sensitivities.\nI realize this won’t stop the occasional idiot running to me with “did you hear what X did” like a teenage girl who just heard the rumor that the head cheerleader cheated on her boyfriend with the math teacher, but for the record, that will be my response.\nI don’t care. I’m not interested.\nAnd if you have a problem with that, then please leave and find some other corner of the Internet in which to reside. It’s a big place. Take your crusade, whatever it might be, elsewhere. You’ve got no shortage of options. And I’m not interested in your opinion of me or anyone else. Talking about me, or about someone else, rather than the subject of the post, is an\nexcellent\nway to get yourself banned here.\nThis is not, and has never been, a free speech zone. I’ll cheerfully ban you for annoying me or trying to waste my time. And I have a low tolerance for gammas, particularly gamma midwits.\nI’m done trying to talk sense into the senseless, or to explain rationales to the irrational. You’d think I, of all people, would know better.",
  "tags": [
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-29T00:55:00+00:00"
}