{
  "url": "https://voxday.net/2016/12/16/initial-speedups/",
  "scraped_at": "2025-12-18T02:10:37.133358",
  "title": "Initial speedups",
  "date_display": "December 16, 2016",
  "date_iso": "2016-12-16T13:00:00+00:00",
  "date_from_url": "2016-12-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some recent posts at Gab concerning Infogalactic:</p><ul><li><i>The daily traffic at #Infogalactic is steadily growing. </i></li><ul><li>+34.4 % October to November </li><li>+43.5% November to December </li></ul><li><i>Jimmy e-mailed me many times pleading for me to donate again to Wiki. Wiki is compromised, infiltrated by underemployed SJWs w/ too much free time. Wiki is losing a donor. Out with Wiki. In with Infogalactic. Migrate over if you’re right of Karl Marx.</i></li></ul><p>If you’re using Infogalactic to replace Wikipedia – which you can now do as your <b>default search engine</b> in Brave, or by typing <b>:i</b> in the URL bar – you’ve probably noticed that it is considerably faster than it was a week ago. Click a few times on the <a href=\"https://infogalactic.com/info/Special:Random\">Random Page</a> link to see the initial improvements in page load times.</p><p>We’re still working on the Search and Image Fetch database functions; the latter is the primary culprit with regards to the persistent slowness of both, but we have made considerable progress there as well and expect to have those speedups implemented within a week. I’ll be sending out an update to both the Burn Unit and the Phase Two donors with an explanation of what IG’s Techstars have done, what they are doing, and what they’ll be working on next, as soon as this first round of speedups are in place. Please note that as a general rule, I try to avoid unnecessary communiques that contain no actual information.</p><p>If you haven’t joined the Burn Unit or jumped the donor ship from Wiki to IG yet, I would encourage you to <a href=\"http://infogalactic.com/info/Infogalactic:Donations\">do so now</a> for two reasons. First, the Alt-Tech revolution is the only way out of being permanently walled in by the converged technology giants, and second, the planetary knowledge core is only going to keep getting better from here.</p><p>As you may have heard, Apple is still playing politics with Gab, attempting to keep the Gab app out of the Apple Store on spurious and hypocritical grounds, and Twitter has banned API-related access by Gab, which tells you that Big Tech is already alarmed by the rapid rise of the Alt-Tech. We not only can win, <i>we will win</i>, but we do need those who are on our side to support us rather than continue to support those who hate them.</p></div>",
  "content_text": "Some recent posts at Gab concerning Infogalactic:\nThe daily traffic at #Infogalactic is steadily growing.\n+34.4 % October to November\n+43.5% November to December\nJimmy e-mailed me many times pleading for me to donate again to Wiki. Wiki is compromised, infiltrated by underemployed SJWs w/ too much free time. Wiki is losing a donor. Out with Wiki. In with Infogalactic. Migrate over if you’re right of Karl Marx.\nIf you’re using Infogalactic to replace Wikipedia – which you can now do as your\ndefault search engine\nin Brave, or by typing\n:i\nin the URL bar – you’ve probably noticed that it is considerably faster than it was a week ago. Click a few times on the\nRandom Page\nlink to see the initial improvements in page load times.\nWe’re still working on the Search and Image Fetch database functions; the latter is the primary culprit with regards to the persistent slowness of both, but we have made considerable progress there as well and expect to have those speedups implemented within a week. I’ll be sending out an update to both the Burn Unit and the Phase Two donors with an explanation of what IG’s Techstars have done, what they are doing, and what they’ll be working on next, as soon as this first round of speedups are in place. Please note that as a general rule, I try to avoid unnecessary communiques that contain no actual information.\nIf you haven’t joined the Burn Unit or jumped the donor ship from Wiki to IG yet, I would encourage you to\ndo so now\nfor two reasons. First, the Alt-Tech revolution is the only way out of being permanently walled in by the converged technology giants, and second, the planetary knowledge core is only going to keep getting better from here.\nAs you may have heard, Apple is still playing politics with Gab, attempting to keep the Gab app out of the Apple Store on spurious and hypocritical grounds, and Twitter has banned API-related access by Gab, which tells you that Big Tech is already alarmed by the rapid rise of the Alt-Tech. We not only can win,\nwe will win\n, but we do need those who are on our side to support us rather than continue to support those who hate them.",
  "tags": [
    "#AltTech",
    "Infogalactic"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-16T13:00:00+00:00"
}