{
  "url": "https://voxday.net/2016/12/19/interpreting-neocon-lunacy/",
  "scraped_at": "2025-12-18T02:11:00.294809",
  "title": "Interpreting neocon lunacy",
  "date_display": "December 19, 2016",
  "date_iso": "2016-12-19T00:59:00+00:00",
  "date_from_url": "2016-12-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Saker has a go at trying to figure out what in the world <a href=\"http://www.unz.com/tsaker/neocon-panic-and-agony/\">the twice-defeated neocons are attempting to accomplish</a> with their futile attempts to delegitimize the election and incipient ascendance of the God-Emperor:</p><blockquote><p> My guess is that first and foremost what is taking place now is what always happens when the Neocons run into major trouble: they double down, again. And again. And again. That is one of the key characteristics of their psychological make-up: they cannot accept defeat or, even less so, that they were wrong, so each time reality catches up to their ideological delusions, they automatically double-down. Still, they might rationalize this behavior by a combination of hope that maybe one of these tricks will work, with the strong urge to do as much damage to President-Elect Trump before he actually assumes his office. I would never underestimate the vicious vindictiveness of these people.</p><p>What is rather encouraging is Trump’s reaction to all this: after apparently long deliberations he decided to nominate Rex Tillerson as his Secretary of Defense. From a Neocon point of view, if General Michael Flynn was bad, then Tillerson was truly an apocalyptic abomination: the man actually had received the order of “Friend of Russia” from the hands of Vladimir Putin himself!</p><p>Did Trump not realize how provocative this nomination was and how it would be received by the Neocons? Of course he did! That was, on his part, a totally deliberate decision. If so, then this is a very, very good sign.</p><p>I might be mistaken, but I get the feeling that Trump is willing to accept the Neocon challenge and that he will fight back. For example, his reaction to the CIA accusations about Russian hackers was very telling: he reminded everybody that “these are the same people that said Saddam Hussein had weapons of mass destruction”.</p></blockquote><p>I suspect any inclination toward pity or remorse on the part of the God-Emperor Ascendant has been eradicated by the neocon and SJW antics. I have no doubt that Donald Trump Jr. smells heresy, and he does <i>not </i>enjoy it.</p></div>",
  "content_text": "The Saker has a go at trying to figure out what in the world\nthe twice-defeated neocons are attempting to accomplish\nwith their futile attempts to delegitimize the election and incipient ascendance of the God-Emperor:\nMy guess is that first and foremost what is taking place now is what always happens when the Neocons run into major trouble: they double down, again. And again. And again. That is one of the key characteristics of their psychological make-up: they cannot accept defeat or, even less so, that they were wrong, so each time reality catches up to their ideological delusions, they automatically double-down. Still, they might rationalize this behavior by a combination of hope that maybe one of these tricks will work, with the strong urge to do as much damage to President-Elect Trump before he actually assumes his office. I would never underestimate the vicious vindictiveness of these people.\nWhat is rather encouraging is Trump’s reaction to all this: after apparently long deliberations he decided to nominate Rex Tillerson as his Secretary of Defense. From a Neocon point of view, if General Michael Flynn was bad, then Tillerson was truly an apocalyptic abomination: the man actually had received the order of “Friend of Russia” from the hands of Vladimir Putin himself!\nDid Trump not realize how provocative this nomination was and how it would be received by the Neocons? Of course he did! That was, on his part, a totally deliberate decision. If so, then this is a very, very good sign.\nI might be mistaken, but I get the feeling that Trump is willing to accept the Neocon challenge and that he will fight back. For example, his reaction to the CIA accusations about Russian hackers was very telling: he reminded everybody that “these are the same people that said Saddam Hussein had weapons of mass destruction”.\nI suspect any inclination toward pity or remorse on the part of the God-Emperor Ascendant has been eradicated by the neocon and SJW antics. I have no doubt that Donald Trump Jr. smells heresy, and he does\nnot\nenjoy it.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-19T00:59:00+00:00"
}