{
  "url": "https://voxday.net/2016/12/27/mailvox-get-over-your-cognitive/",
  "scraped_at": "2025-12-18T02:12:17.132211",
  "title": "Mailvox: get over your cognitive capabilities",
  "date_display": "December 27, 2016",
  "date_iso": "2016-12-27T18:00:00+00:00",
  "date_from_url": "2016-12-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Some Guy is trying to learn how to stop thinking that being smart is somehow worthy of accolades:</p><blockquote><p> I am and have been in the VHIQ spectrum for the majority of my life. About 2 years ago a situation in my marriage sent me reeling into therapy and I have spent a little over a year in a special form of therapy.</p><p>The reason that I bring this up is that although I have a relatively high IQ, I naturally attach too much personal worth to my intelligence and the imagined respect that it brings to me. After having dealt with a few, but by no means all of the underlying issues, I am now at a place where (even though I still react the way a VHIQ would reflexively) I can at least back up and see the situation for what it is when I review new information.</p><p>In our therapy, we refer to these as “programs” that are installed at an early age, and that run without any cognitive thought occurring. These are mostly self-defeating tendencies that plague people like me our entire lives. It has indeed made a qualitative difference in my ability to understand information, because I am not emotionally invested in the outcome (although I have to try very hard for this to occur most of the time). Do you think this could account for some of the difference you are noticing between the two groups?</p></blockquote><p>Nearly everyone wants to be smarter, better-looking, wealthier, healthier, more athletic, more popular, and sexier. (Virtually no one is willing to actually do much about any of those things either, but that’s neither here nor there.) And yet, for some reason, smart people seem to have an incredible amount of trouble understanding that the “respect” they are due for being more intelligent is about as significant as the amount of respect they harbor for someone else being more attractive, more athletic, or more popular.</p><p>My first piece of advice for anyone who is intelligent is this: get over it.</p><p>Intelligence will get you nothing but a free ride at a US university if you’re sufficiently good at taking tests. That’s it. It means that you’ve got a larger caliber intellectual gun than most, but if your ammunition (education) is deficient, you don’t know how to aim it (discipline), where to aim it (wisdom), or you’re unwilling to pull the trigger (laziness or fear of failure), your intelligence means precisely nothing.</p><p>Part of the problem, I think, is that high intelligence manifests itself during the formative years, and therefore tends to become an intrinsic aspect of one’s self-identity in a way that pther characteristics that require more time to take shape do. I think of it in much the same context that the girls who are unusually pretty when they are little girls; they tend to still believe they are great beauties even when they are overweight or surpassed by later bloomers.</p><p>One of the most valuable things anyone ever told me wasn’t actually addressed to me, but to a smart girl I knew, who told another girl that she felt like she had all these great thoughts circling through her head, but she just couldn’t articulate them. The other girl told her that she didn’t have any great thoughts, she just had a feeling. One’s thoughts, such as they are, don’t mean anything and cannot be judged until they are articulated, preferably in writing.</p><p>So, no one should be enamored of one’s intelligence or proud of it. Be proud of what you have done with your intelligence, if you have actually accomplished anything, instead. That doesn’t mean one should engage in false modesty or hesitate to wield one’s intelligence as a weapon if the situation calls for it, only that one should be aware that it is nothing more than one of the many tools at one’s disposal.</p><p>As for programs, Mike Cernovich discusses this in <a href=\"http://amzn.to/2eaKrnE\">MAGA Mindset</a>. The self-narration with which provide commentary on our own thoughts and actions tend to have a powerful effect on the results we produce. Mike makes use of particular mantra he explains in the book; I don’t have a particular mantra, but I do have a set of phrases to which I turn from time to time when I need motivation. Mine probably would not work for most people, since I thrive on negative and competitive motivation, but they are a similar form of cognitive self-programming.</p><p>But no, these programs do not account, in any way, for the differences I have observed between the conventional high IQ mind and the unconventional high IQ mind. It’s akin to asking if someone who is color-blind can motivate himself into seeing green properly.</p></div>",
  "content_text": "Some Guy is trying to learn how to stop thinking that being smart is somehow worthy of accolades:\nI am and have been in the VHIQ spectrum for the majority of my life. About 2 years ago a situation in my marriage sent me reeling into therapy and I have spent a little over a year in a special form of therapy.\nThe reason that I bring this up is that although I have a relatively high IQ, I naturally attach too much personal worth to my intelligence and the imagined respect that it brings to me. After having dealt with a few, but by no means all of the underlying issues, I am now at a place where (even though I still react the way a VHIQ would reflexively) I can at least back up and see the situation for what it is when I review new information.\nIn our therapy, we refer to these as “programs” that are installed at an early age, and that run without any cognitive thought occurring. These are mostly self-defeating tendencies that plague people like me our entire lives. It has indeed made a qualitative difference in my ability to understand information, because I am not emotionally invested in the outcome (although I have to try very hard for this to occur most of the time). Do you think this could account for some of the difference you are noticing between the two groups?\nNearly everyone wants to be smarter, better-looking, wealthier, healthier, more athletic, more popular, and sexier. (Virtually no one is willing to actually do much about any of those things either, but that’s neither here nor there.) And yet, for some reason, smart people seem to have an incredible amount of trouble understanding that the “respect” they are due for being more intelligent is about as significant as the amount of respect they harbor for someone else being more attractive, more athletic, or more popular.\nMy first piece of advice for anyone who is intelligent is this: get over it.\nIntelligence will get you nothing but a free ride at a US university if you’re sufficiently good at taking tests. That’s it. It means that you’ve got a larger caliber intellectual gun than most, but if your ammunition (education) is deficient, you don’t know how to aim it (discipline), where to aim it (wisdom), or you’re unwilling to pull the trigger (laziness or fear of failure), your intelligence means precisely nothing.\nPart of the problem, I think, is that high intelligence manifests itself during the formative years, and therefore tends to become an intrinsic aspect of one’s self-identity in a way that pther characteristics that require more time to take shape do. I think of it in much the same context that the girls who are unusually pretty when they are little girls; they tend to still believe they are great beauties even when they are overweight or surpassed by later bloomers.\nOne of the most valuable things anyone ever told me wasn’t actually addressed to me, but to a smart girl I knew, who told another girl that she felt like she had all these great thoughts circling through her head, but she just couldn’t articulate them. The other girl told her that she didn’t have any great thoughts, she just had a feeling. One’s thoughts, such as they are, don’t mean anything and cannot be judged until they are articulated, preferably in writing.\nSo, no one should be enamored of one’s intelligence or proud of it. Be proud of what you have done with your intelligence, if you have actually accomplished anything, instead. That doesn’t mean one should engage in false modesty or hesitate to wield one’s intelligence as a weapon if the situation calls for it, only that one should be aware that it is nothing more than one of the many tools at one’s disposal.\nAs for programs, Mike Cernovich discusses this in\nMAGA Mindset\n. The self-narration with which provide commentary on our own thoughts and actions tend to have a powerful effect on the results we produce. Mike makes use of particular mantra he explains in the book; I don’t have a particular mantra, but I do have a set of phrases to which I turn from time to time when I need motivation. Mine probably would not work for most people, since I thrive on negative and competitive motivation, but they are a similar form of cognitive self-programming.\nBut no, these programs do not account, in any way, for the differences I have observed between the conventional high IQ mind and the unconventional high IQ mind. It’s akin to asking if someone who is color-blind can motivate himself into seeing green properly.",
  "tags": [
    "mailvox",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-27T18:00:00+00:00"
}