{
  "url": "https://voxday.net/2016/12/15/mailvox-here-is-how-youre-idio/",
  "scraped_at": "2025-12-18T02:10:28.346840",
  "title": "Mailvox: the ontology of existential idiocy",
  "date_display": "December 15, 2016",
  "date_iso": "2016-12-15T10:06:00+00:00",
  "date_from_url": "2016-12-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Wild Man keeps blithely repeating the same argumentative nonsense over and over again despite the fact that he can’t even construct a basic syllogism or correctly understand what Western civilization is.<br/></p><blockquote><p> VD – you said – “Give it up, Wild Man. I already told you that you’re full of it. You keep trying to work your false narrative of Western civilization being based on equality in there, which a) is not true, and, b) the Alt-Right openly opposes.”</p><p>VD – you also said – “You’re not (mystified). There are no deep contradictions, you’re simply either a) a liar, or b) a stubborn idiot.”</p><p>VD – In all fairness, I don’t think anything I said implies that I am lying and therefore trolling and baiting around supposed mystification. My mystification with regards to fully groking the alt-right (particularly your conception of it) is real – and I am making a real effort to try and understand your position on this – and by way of this effort I have observed some deep contradictions ….. and these are the source of my mystification (nothing weird going on here with me – just straight forward rational discussion is what I am hoping for).</p><p>I also think you are wrong about anything I said implying I’m a stubborn idiot (but they all say that – right?) – but I try to be open minded and we’ll see – I’m always hoping to learn something new, and maybe you will point me in that direction, but “idiot”! …. you know what they say about extraordinary claims …. but hey maybe you will show me something worthy of a face palm slap sufficient of the “idiot” voice-over. If so I will do my best to admit it!</p><p>Here are the reasons for my counter-claims:</p><p>1)Your claim that I keep trying to work in a particular narrative around western civilization, namely that it is partly based on some sense of equality, is true in general, with respect to many of the comments I have posted on previous threads – i.e. – I do believe that as per the 4 underlying precepts of the western egalitarian as I have defined, particularly as per precepts #1 + #2 ….. some sense of existential ontological equality does arise, by way of each man and woman enjoying, or perhaps suffering if you like, the same existential and ontological conditions around the operation of self-agency – namely the belief in the ever present power to choose, and the belief in the implied personal responsibilities that entails.</p></blockquote><p>It’s not a claim, it’s a straightforward observation that Wild Man keeps saying the same thing over and over, then asserting a nonexistent contradiction on my part on the basis of his own false narrative, which action, you will note, he has now admitted. It is apparent that he is a low midwit enchanted by the fact that he actually has an idea. This is exactly the sort of behavior <a href=\"https://www.dangerandplay.com/2016/12/11/how-to-let-go-of-bad-ideas/\">Mike Cernovich warned against</a>, and is an object lesson in the importance of jettisoning bad ideas.</p><p>Wild Man doesn’t realize that he’s defined 2+2 as being equal to 37, then attempted to criticize everyone else’s math on that basis. Worse, he’s attempting to claim everyone who is doing math correctly is contradicting themselves, which is not possible since no one accepts the idea that 2+2=37 or that there exists a sense of existential ontological equality intrinsic to the West.</p><p>What part of “equality does not exist in ANY meaningful and material sense” is hard for the moron to grasp? If he had the ability to construct, or deconstruct, a logical syllogism, he would attempt to demonstrate that a) equality does exist, and, b) this equality is integral to Western civilization. He would fail, of course, since both statements are false, but at least he would stop subjecting every reader of this blog, and worse, me, to this interminable, nonsensical salad of words he observably does not understand.</p><p>Note to the midwits: using big words that impress you when others use them does not make you correct, convincing, or intellectual, particularly when you use them incorrectly.</p><blockquote class=\"tr_bq\"><p> In a previous thread I have outlined these 4 underlying precepts of this conception of the western egalitarian, which I could copy and paste here again on this thread if you like. You say it is not true (you are contending that there is no such sense of human equality – I discern you judge this as a fallacy) but you have not yet engaged as to precisely why the common existential ontological conditions of personhood do not support some sense of equality, so …. how can I possibly know your mind on this, if you don’t engage on this topic and tell me? I assume your judgment as to the fallacious nature of my contention also conditions your conception of the Alt-Right. As such I trust you now see that this absolves me of the charge of lying about my mystification about your conception of the alt-right ….. now implying perhaps, that the charge, by default, is instead one of “stubborn idiot”.</p></blockquote><p>Oh Sweet Darwin, no, you’ve already done enough copy and pasting here. And no, you clearly understand perfectly well what the 16 Points mean, you’re just too determined to cling to your egalitarian nonsense to accept them. This mewling “I’m so mystified, please prove the obvious to me or I’ll post another thousand-word screed that says the same damn thing” is contemptible. So, I have concluded that the dichotomy was false and you happen to be both a) a liar, and b) a stubborn idiot.</p><p>The conditions of personhood are too trivial to support any sense of equality that is relevant to Western civilization, and moreover, have never served as a basis for any form of observable scientific, legal, material, intellectual, sexual, or spiritual equality in the West, or anywhere else. The fact that corporations are legal persons in the West should alone suffice to demonstrate the fact that Wild Man’s “common existential ontological conditions of personhood” argument is a complete non-starter.</p><blockquote class=\"tr_bq\"><p> OK – You think I am a stubborn idiot for reasons that I am apparently too dense to see, I guess you are implying. Well humor an implied underling (by intellectual brilliance standards) then, good sir. Please now address my quandary. My prior discussion with respect to the underlying precepts #1 + #2 of the western egalitarian, as defined, implies some sense of existential ontological equality does arise by way of the condition of personhood. People are the same in some sense. The necessary conditions of personhood implies a sense of categorical equality. What are the necessary conditions of personhood? We all are going to die. Well prior to adulthood we all come to know this existential fact. We all are faced with the same challenge ….. as to grok the best way to conduct one’s life. We each sense and undertake this challenge because of our common human belief in self-agency and the personal responsibility so implied. Where is this conception of the categorical equality of the existential ontological nature of personhood fallacious?</p></blockquote><p>This is false on its face, and contains several false foundations as well. Corporations don’t die, and yet they are legally recognized persons. Human embryos and fetuses do die, and they are not. Dogs and pigs and monkeys and plants are all going to die too, and they are not considered persons either. Many humans do not believe in self-agency or in a subsequent implication of personal responsibility; the current state of cognitive science specifically denies even the theoretical possibility of conscious self-agency. The conception of the categorical equality of the existential ontological nature of personhood is observably fallacious from start to finish, which is one reason why it is not, and has never been, recognized in any legal system in the history of the West.</p><blockquote class=\"tr_bq\"><p> Your more direct claim, that the particular narrative around western civilization that I have implied, namely that it is partly based on some sense of equality (as discussed in #2 above), is actually OPENLY opposed by the Alt-Right, is also, more directly, mystifying, given #(15) of your outline of the Alt-Right principles (i.e. – The Alt Right does not believe in the general supremacy of any race, nation, people, or sub-species. Every race, nation, people, and human sub-species has its own unique strengths and weaknesses, and possesses the sovereign right to dwell unmolested in the native culture it prefers.) Well what is the negation of supremacy so implied? Given that you stated principle #(15) in terms of racial/national existential preservation – does it not imply the negation of supremacy so implied, is some sense of equality (given what we know about the operation of darwinian evolution)?, and furthermore via the paraphrase of the embrace of the scientodific (alt-right principle #8) I provided in comment #72 above, the racial/national cultural profile is obviously contingent on the the make-up of the in-group individuals ….. and as such, the sense of darwinian existential equality implied by the principle of racial/national existential preservation as implied by Alt-Right principle #(15), is contingent on the make-up of the individuals ……. now what precise qualities expressed at the individual level might well account for said cultural darwinian existential equality implied by the principle of racial/national existential preservation? – well the categorical equality of the existential ontological nature of personhood is certainly a good candidate to account for that – is it not? Or, more succinctly ……the spirit of which can be summed up as “all men are created equal in the eyes of God”, or the spirit of which could also be summed as “perhaps even God knows not (and certainly no man can know) the future existential conditions of nations and races”. So VD – please tell me precisely how I am a stubborn idiot by way of being too dense to see how your conception of the Alt-Right is OPENLY opposed to some sense of human equality?</p></blockquote><p>Wild Man is an idiot because a declaration of an absence of belief in SUPREMACY is not synonymous with a declaration of any sense of SAMENESS or EQUALITY. Quite the contrary, in fact, as the further from sameness one goes, the harder it is to even compare two things. What is supreme, a penguin or a satellite? It’s a category error to even ask the question! Now consider the intrinsic dishonesty of the language to which he is forced to resort to even begin to try making his idiotic case.</p><ul><li>“does it not imply” (no)</li><li>“the sense of darwinian existential equality implied” (there is no such thing, ergo it cannot imply anything)</li><li>“might well account for” (and yet does not)</li><li>“is certainly a good candidate” (it can’t be, since it doesn’t exist)</li><li>“could also be summed as” (no, it can’t, and it isn’t)</li></ul><p>Very well, Wild Man. You are a stubborn idiot who is too dense to see that you have constructed a false narrative, claimed that because that false narrative can be imagined, it actually exists and thereby negates a vast range of material observations which have led me, and many others, to conclude that equality is an abstract concept which does not exist in any observable scientific, legal, material, intellectual, sexual, or spiritual form.</p><p>That being said, I will grant you that the common existential ontological conditions of personhood support equality in an imaginary sense. In your head, if nowhere else.<br/></p><blockquote class=\"tr_bq\"><p> Now …… if you happen to now agree with the conceptions around some sense of human equality that I have now repeatedly outlined, here and in prior threads, (which aren’t my original conceptions in any event – these are simply the western egalitarian principles of the enlightenment period – wasn’t it John Locke that fleshed out these ideas?) …… then ….VD some of your conclusions don’t follow.</p></blockquote><p>I don’t agree with any of the conceptions Wild Man has repeatedly outlined. And Western civilization long preceded the Enlightenment, nor does John Locke or any other Enlightenment philosopher define Western civilization, which is why the entire argument has been so prodigiously and obviously stupid from the start.</p><p>You had your shot, Wild Man. Now give it up and stop trying to argue your nonsensical point. If you are still mystified, then you will simply have to remain that way, because I have zero interest in continuing to explain the observable and the obvious to you.</p><p>I trust this explains why I am seldom inclined to do more than simply tell midwits and those of normal intelligence that they are wrong, and if egregiously so, stupid. My curt dismissals are not evidence that I cannot dismantle their arguments and demonstrate in detail why they are incorrect, they are instead an indication that doing so is so trivially obvious and easy that only long and painful experience of MPAI has made it possible for me to believe that it could ever be necessary.</p></div>",
  "content_text": "Wild Man keeps blithely repeating the same argumentative nonsense over and over again despite the fact that he can’t even construct a basic syllogism or correctly understand what Western civilization is.\nVD – you said – “Give it up, Wild Man. I already told you that you’re full of it. You keep trying to work your false narrative of Western civilization being based on equality in there, which a) is not true, and, b) the Alt-Right openly opposes.”\nVD – you also said – “You’re not (mystified). There are no deep contradictions, you’re simply either a) a liar, or b) a stubborn idiot.”\nVD – In all fairness, I don’t think anything I said implies that I am lying and therefore trolling and baiting around supposed mystification. My mystification with regards to fully groking the alt-right (particularly your conception of it) is real – and I am making a real effort to try and understand your position on this – and by way of this effort I have observed some deep contradictions ….. and these are the source of my mystification (nothing weird going on here with me – just straight forward rational discussion is what I am hoping for).\nI also think you are wrong about anything I said implying I’m a stubborn idiot (but they all say that – right?) – but I try to be open minded and we’ll see – I’m always hoping to learn something new, and maybe you will point me in that direction, but “idiot”! …. you know what they say about extraordinary claims …. but hey maybe you will show me something worthy of a face palm slap sufficient of the “idiot” voice-over. If so I will do my best to admit it!\nHere are the reasons for my counter-claims:\n1)Your claim that I keep trying to work in a particular narrative around western civilization, namely that it is partly based on some sense of equality, is true in general, with respect to many of the comments I have posted on previous threads – i.e. – I do believe that as per the 4 underlying precepts of the western egalitarian as I have defined, particularly as per precepts #1 + #2 ….. some sense of existential ontological equality does arise, by way of each man and woman enjoying, or perhaps suffering if you like, the same existential and ontological conditions around the operation of self-agency – namely the belief in the ever present power to choose, and the belief in the implied personal responsibilities that entails.\nIt’s not a claim, it’s a straightforward observation that Wild Man keeps saying the same thing over and over, then asserting a nonexistent contradiction on my part on the basis of his own false narrative, which action, you will note, he has now admitted. It is apparent that he is a low midwit enchanted by the fact that he actually has an idea. This is exactly the sort of behavior\nMike Cernovich warned against\n, and is an object lesson in the importance of jettisoning bad ideas.\nWild Man doesn’t realize that he’s defined 2+2 as being equal to 37, then attempted to criticize everyone else’s math on that basis. Worse, he’s attempting to claim everyone who is doing math correctly is contradicting themselves, which is not possible since no one accepts the idea that 2+2=37 or that there exists a sense of existential ontological equality intrinsic to the West.\nWhat part of “equality does not exist in ANY meaningful and material sense” is hard for the moron to grasp? If he had the ability to construct, or deconstruct, a logical syllogism, he would attempt to demonstrate that a) equality does exist, and, b) this equality is integral to Western civilization. He would fail, of course, since both statements are false, but at least he would stop subjecting every reader of this blog, and worse, me, to this interminable, nonsensical salad of words he observably does not understand.\nNote to the midwits: using big words that impress you when others use them does not make you correct, convincing, or intellectual, particularly when you use them incorrectly.\nIn a previous thread I have outlined these 4 underlying precepts of this conception of the western egalitarian, which I could copy and paste here again on this thread if you like. You say it is not true (you are contending that there is no such sense of human equality – I discern you judge this as a fallacy) but you have not yet engaged as to precisely why the common existential ontological conditions of personhood do not support some sense of equality, so …. how can I possibly know your mind on this, if you don’t engage on this topic and tell me? I assume your judgment as to the fallacious nature of my contention also conditions your conception of the Alt-Right. As such I trust you now see that this absolves me of the charge of lying about my mystification about your conception of the alt-right ….. now implying perhaps, that the charge, by default, is instead one of “stubborn idiot”.\nOh Sweet Darwin, no, you’ve already done enough copy and pasting here. And no, you clearly understand perfectly well what the 16 Points mean, you’re just too determined to cling to your egalitarian nonsense to accept them. This mewling “I’m so mystified, please prove the obvious to me or I’ll post another thousand-word screed that says the same damn thing” is contemptible. So, I have concluded that the dichotomy was false and you happen to be both a) a liar, and b) a stubborn idiot.\nThe conditions of personhood are too trivial to support any sense of equality that is relevant to Western civilization, and moreover, have never served as a basis for any form of observable scientific, legal, material, intellectual, sexual, or spiritual equality in the West, or anywhere else. The fact that corporations are legal persons in the West should alone suffice to demonstrate the fact that Wild Man’s “common existential ontological conditions of personhood” argument is a complete non-starter.\nOK – You think I am a stubborn idiot for reasons that I am apparently too dense to see, I guess you are implying. Well humor an implied underling (by intellectual brilliance standards) then, good sir. Please now address my quandary. My prior discussion with respect to the underlying precepts #1 + #2 of the western egalitarian, as defined, implies some sense of existential ontological equality does arise by way of the condition of personhood. People are the same in some sense. The necessary conditions of personhood implies a sense of categorical equality. What are the necessary conditions of personhood? We all are going to die. Well prior to adulthood we all come to know this existential fact. We all are faced with the same challenge ….. as to grok the best way to conduct one’s life. We each sense and undertake this challenge because of our common human belief in self-agency and the personal responsibility so implied. Where is this conception of the categorical equality of the existential ontological nature of personhood fallacious?\nThis is false on its face, and contains several false foundations as well. Corporations don’t die, and yet they are legally recognized persons. Human embryos and fetuses do die, and they are not. Dogs and pigs and monkeys and plants are all going to die too, and they are not considered persons either. Many humans do not believe in self-agency or in a subsequent implication of personal responsibility; the current state of cognitive science specifically denies even the theoretical possibility of conscious self-agency. The conception of the categorical equality of the existential ontological nature of personhood is observably fallacious from start to finish, which is one reason why it is not, and has never been, recognized in any legal system in the history of the West.\nYour more direct claim, that the particular narrative around western civilization that I have implied, namely that it is partly based on some sense of equality (as discussed in #2 above), is actually OPENLY opposed by the Alt-Right, is also, more directly, mystifying, given #(15) of your outline of the Alt-Right principles (i.e. – The Alt Right does not believe in the general supremacy of any race, nation, people, or sub-species. Every race, nation, people, and human sub-species has its own unique strengths and weaknesses, and possesses the sovereign right to dwell unmolested in the native culture it prefers.) Well what is the negation of supremacy so implied? Given that you stated principle #(15) in terms of racial/national existential preservation – does it not imply the negation of supremacy so implied, is some sense of equality (given what we know about the operation of darwinian evolution)?, and furthermore via the paraphrase of the embrace of the scientodific (alt-right principle #8) I provided in comment #72 above, the racial/national cultural profile is obviously contingent on the the make-up of the in-group individuals ….. and as such, the sense of darwinian existential equality implied by the principle of racial/national existential preservation as implied by Alt-Right principle #(15), is contingent on the make-up of the individuals ……. now what precise qualities expressed at the individual level might well account for said cultural darwinian existential equality implied by the principle of racial/national existential preservation? – well the categorical equality of the existential ontological nature of personhood is certainly a good candidate to account for that – is it not? Or, more succinctly ……the spirit of which can be summed up as “all men are created equal in the eyes of God”, or the spirit of which could also be summed as “perhaps even God knows not (and certainly no man can know) the future existential conditions of nations and races”. So VD – please tell me precisely how I am a stubborn idiot by way of being too dense to see how your conception of the Alt-Right is OPENLY opposed to some sense of human equality?\nWild Man is an idiot because a declaration of an absence of belief in SUPREMACY is not synonymous with a declaration of any sense of SAMENESS or EQUALITY. Quite the contrary, in fact, as the further from sameness one goes, the harder it is to even compare two things. What is supreme, a penguin or a satellite? It’s a category error to even ask the question! Now consider the intrinsic dishonesty of the language to which he is forced to resort to even begin to try making his idiotic case.\n“does it not imply” (no)\n“the sense of darwinian existential equality implied” (there is no such thing, ergo it cannot imply anything)\n“might well account for” (and yet does not)\n“is certainly a good candidate” (it can’t be, since it doesn’t exist)\n“could also be summed as” (no, it can’t, and it isn’t)\nVery well, Wild Man. You are a stubborn idiot who is too dense to see that you have constructed a false narrative, claimed that because that false narrative can be imagined, it actually exists and thereby negates a vast range of material observations which have led me, and many others, to conclude that equality is an abstract concept which does not exist in any observable scientific, legal, material, intellectual, sexual, or spiritual form.\nThat being said, I will grant you that the common existential ontological conditions of personhood support equality in an imaginary sense. In your head, if nowhere else.\nNow …… if you happen to now agree with the conceptions around some sense of human equality that I have now repeatedly outlined, here and in prior threads, (which aren’t my original conceptions in any event – these are simply the western egalitarian principles of the enlightenment period – wasn’t it John Locke that fleshed out these ideas?) …… then ….VD some of your conclusions don’t follow.\nI don’t agree with any of the conceptions Wild Man has repeatedly outlined. And Western civilization long preceded the Enlightenment, nor does John Locke or any other Enlightenment philosopher define Western civilization, which is why the entire argument has been so prodigiously and obviously stupid from the start.\nYou had your shot, Wild Man. Now give it up and stop trying to argue your nonsensical point. If you are still mystified, then you will simply have to remain that way, because I have zero interest in continuing to explain the observable and the obvious to you.\nI trust this explains why I am seldom inclined to do more than simply tell midwits and those of normal intelligence that they are wrong, and if egregiously so, stupid. My curt dismissals are not evidence that I cannot dismantle their arguments and demonstrate in detail why they are incorrect, they are instead an indication that doing so is so trivially obvious and easy that only long and painful experience of MPAI has made it possible for me to believe that it could ever be necessary.",
  "tags": [
    "mailvox",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-15T10:06:00+00:00"
}