{
  "url": "https://voxday.net/2016/12/28/moths-drawn-to-media-flame/",
  "scraped_at": "2025-12-18T02:12:20.932920",
  "title": "Moths drawn to the media flame",
  "date_display": "December 28, 2016",
  "date_iso": "2016-12-28T00:06:00+00:00",
  "date_from_url": "2016-12-28",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There has been a fair amount of drama of late surrounding the Deploraball, Mike, Milo, Baked Alaska, and perhaps a few others for all I know. I am not involved with it, I am not attending it, I know nothing about it, nor have I spoken to anyone about any of it. I haven’t even been on Twitter.</p><p>However, I suspect I may understand the core issues underlying whatever the various details might be. Basically, there are people who understand the difference between social media and mainstream media and there are people who don’t. There is also a fairly significant difference between those who seek to get any attention they can and those who are under incessant scrutiny by enemies looking to discredit and disqualify. Having been one of the latter for the last 15 years, I understand what many of those who have never been subjected to a media blitz simply can’t grasp until they experience it for themselves.</p><p>The fact is that if you run around using vulgar language, throwing Roman salutes, wearing bedsheets, denying the Holocaust, publicly soiling yourself, denigrating Christianity, declaring your intention of attacking an elected official, expressing your attraction to a minor, putting naked pictures of yourself online, or threatening to commit violence on another individual, you are not ready for prime time. It doesn’t matter who you are, or what else you might have to say, you have rendered yourself completely vulnerable to a public neutering courtesy of the media. Just ask Anthony Weiner… and he’s on their side.</p><p>Moreover, those who are dealing with a hostile mainstream media on a regular basis simply don’t have either the time or the inclination to defend your stupid, attention-seeking antics. If you don’t have enough respect for yourself or your public image to put on your big boy pants and play by the observable rules, there is no reason for anyone else with anything at stake to maintain a connection to you. You’re not worth it.</p><p>If you want to publicly neuter yourself, go ahead. If you want to defecate all over yourself in the name of principle, courage, the Third Reich, or sheer bloodymindedness, that is absolutely your prerogative. Do as you see fit. But you should not expect anyone else to stand passively by you and allow you to splatter your self-destructive shit all over them.</p><p>This isn’t about SJW attacks, where one minor violation of the Narrative results in a media-driven SJW witch hunt. This is about attention-seeking provocateurs failing to grasp the difference between social media memes and real-world public relations, and in doing so, creating both distractions and potential headaches for others.</p><p>Look at how the <i>New York Times</i> came to me, then vanished into thin air <a href=\"http://www.milobookclub.com/2016/12/11/the-fake-news-on-alt-rig/\">when I answered their questions</a> and pointed them to the 16 Points of the Alt-Right. They don’t want the public to see an intelligent and sophisticated political philosophy of nationalism that has ever-increasing global appeal, they want toothless hillbillies, psychotic racists, and retarded neo-Nazis to dance for them and bolster their false Narrative of “Hey Look, KKK Nazi Squirrel!”</p><p>Anyone who is determined to play dancing monkey for the mainstream media and provide support for the media’s false Narrative is of less than zero utility to the Alt-Right, to the Alt-Lite, and to the Trump administration, no matter who they are, no matter what they have done. So get serious and stop dancing.</p><p>It’s fair to criticize Mike, or Milo, or me for things we have done, for words we have written, and for public positions we have taken. It is fair to criticize those who are self-serving cowards and refuse to stand up for putative allies who are attacked unjustly. But it is simply stupid to expect us, or anyone else, to devote any time and effort to defending the willful stupidity of others. And to say that any of us are afraid of being attacked is even more ridiculous when a simple Google search will reveal hundreds of vituperative and defamatory attacks on any of us.</p><p>FFS, why play into the media’s default script for those they would dearly love to destroy?</p><p> UPDATE: Mike Cernovich has posted <a href=\"https://www.dangerandplay.com/anthime-gionet-aka-tim-treadstone-aka-baked-alaska-drama/\">his side of the story</a>.</p></div>",
  "content_text": "There has been a fair amount of drama of late surrounding the Deploraball, Mike, Milo, Baked Alaska, and perhaps a few others for all I know. I am not involved with it, I am not attending it, I know nothing about it, nor have I spoken to anyone about any of it. I haven’t even been on Twitter.\nHowever, I suspect I may understand the core issues underlying whatever the various details might be. Basically, there are people who understand the difference between social media and mainstream media and there are people who don’t. There is also a fairly significant difference between those who seek to get any attention they can and those who are under incessant scrutiny by enemies looking to discredit and disqualify. Having been one of the latter for the last 15 years, I understand what many of those who have never been subjected to a media blitz simply can’t grasp until they experience it for themselves.\nThe fact is that if you run around using vulgar language, throwing Roman salutes, wearing bedsheets, denying the Holocaust, publicly soiling yourself, denigrating Christianity, declaring your intention of attacking an elected official, expressing your attraction to a minor, putting naked pictures of yourself online, or threatening to commit violence on another individual, you are not ready for prime time. It doesn’t matter who you are, or what else you might have to say, you have rendered yourself completely vulnerable to a public neutering courtesy of the media. Just ask Anthony Weiner… and he’s on their side.\nMoreover, those who are dealing with a hostile mainstream media on a regular basis simply don’t have either the time or the inclination to defend your stupid, attention-seeking antics. If you don’t have enough respect for yourself or your public image to put on your big boy pants and play by the observable rules, there is no reason for anyone else with anything at stake to maintain a connection to you. You’re not worth it.\nIf you want to publicly neuter yourself, go ahead. If you want to defecate all over yourself in the name of principle, courage, the Third Reich, or sheer bloodymindedness, that is absolutely your prerogative. Do as you see fit. But you should not expect anyone else to stand passively by you and allow you to splatter your self-destructive shit all over them.\nThis isn’t about SJW attacks, where one minor violation of the Narrative results in a media-driven SJW witch hunt. This is about attention-seeking provocateurs failing to grasp the difference between social media memes and real-world public relations, and in doing so, creating both distractions and potential headaches for others.\nLook at how the\nNew York Times\ncame to me, then vanished into thin air\nwhen I answered their questions\nand pointed them to the 16 Points of the Alt-Right. They don’t want the public to see an intelligent and sophisticated political philosophy of nationalism that has ever-increasing global appeal, they want toothless hillbillies, psychotic racists, and retarded neo-Nazis to dance for them and bolster their false Narrative of “Hey Look, KKK Nazi Squirrel!”\nAnyone who is determined to play dancing monkey for the mainstream media and provide support for the media’s false Narrative is of less than zero utility to the Alt-Right, to the Alt-Lite, and to the Trump administration, no matter who they are, no matter what they have done. So get serious and stop dancing.\nIt’s fair to criticize Mike, or Milo, or me for things we have done, for words we have written, and for public positions we have taken. It is fair to criticize those who are self-serving cowards and refuse to stand up for putative allies who are attacked unjustly. But it is simply stupid to expect us, or anyone else, to devote any time and effort to defending the willful stupidity of others. And to say that any of us are afraid of being attacked is even more ridiculous when a simple Google search will reveal hundreds of vituperative and defamatory attacks on any of us.\nFFS, why play into the media’s default script for those they would dearly love to destroy?\nUPDATE: Mike Cernovich has posted\nhis side of the story\n.",
  "tags": [
    "media",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-28T00:06:00+00:00"
}