{
  "url": "https://voxday.net/2016/12/21/news/",
  "scraped_at": "2025-12-18T02:11:28.283598",
  "title": "News and your top sites",
  "date_display": "December 21, 2016",
  "date_iso": "2016-12-21T14:30:00+00:00",
  "date_from_url": "2016-12-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We’re going to be introducing a Daily News feature at Infogalactic before the end of the year, as a number of people have requested it. It’s going to be a Drudge Report-style affair, updated twice daily, with nothing but text and a link to a relevant Infogalactic page for each story. We’re going to limit it to 11 reports about international current events, so you’ll still need to go to Drudge for “<i>Body found behind WALMART missing head, genitals…</i>” and “<i>The Gender-Fluid Performer Who Changed Academy’s Mind…</i>“</p><p>This is another step towards breaking people’s dependence upon the Fake News. We’re also going to kick it off with 36 site links to the sites Infogalactic readers most often read. Obviously, VP will be one of them. AG will not. Instapundit and the Unz Review are obvious choices. I look on the list of Drudge columnists and I see precisely four names I’d even be willing to consider. What are your top ten personal candidates for the other 35 links?</p><p>If you’ve got an opinion, please provide your list of most-wanted sites in the comments. Keep in mind that they should be sites with daily, or near-daily, content. We will not include sites that post less frequently than 3-4 times per week. And if you’re a supporter or an OG, it should please you to note that Infogalactic has already passed up this blog in terms of daily pageviews.</p></div>",
  "content_text": "We’re going to be introducing a Daily News feature at Infogalactic before the end of the year, as a number of people have requested it. It’s going to be a Drudge Report-style affair, updated twice daily, with nothing but text and a link to a relevant Infogalactic page for each story. We’re going to limit it to 11 reports about international current events, so you’ll still need to go to Drudge for “\nBody found behind WALMART missing head, genitals…\n” and “\nThe Gender-Fluid Performer Who Changed Academy’s Mind…\n“\nThis is another step towards breaking people’s dependence upon the Fake News. We’re also going to kick it off with 36 site links to the sites Infogalactic readers most often read. Obviously, VP will be one of them. AG will not. Instapundit and the Unz Review are obvious choices. I look on the list of Drudge columnists and I see precisely four names I’d even be willing to consider. What are your top ten personal candidates for the other 35 links?\nIf you’ve got an opinion, please provide your list of most-wanted sites in the comments. Keep in mind that they should be sites with daily, or near-daily, content. We will not include sites that post less frequently than 3-4 times per week. And if you’re a supporter or an OG, it should please you to note that Infogalactic has already passed up this blog in terms of daily pageviews.",
  "tags": [
    "Infogalactic"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-21T14:30:00+00:00"
}