{
  "url": "https://voxday.net/2016/12/08/of-irony-and-libe/",
  "scraped_at": "2025-12-18T02:09:15.757831",
  "title": "Please to remove the libel",
  "date_display": "December 8, 2016",
  "date_iso": "2016-12-08T11:25:00+00:00",
  "date_from_url": "2016-12-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Foz Meadows clearly doesn’t understand irony even when she publicly displays it while in the process of <a href=\"https://www.blackgate.com/2016/12/07/unempathic-bipeds-of-failure-the-relationship-between-stories-and-politics/\">maliciously defaming a Hugo-nominated science fiction editor</a> at a leading independent publishing house:</p><blockquote><p> Stories reflect us, and we reflect them back at themselves, like one of Terry Pratchett’s witches standing at the heart of a room of mirrors: humanity all the way down. In the midst of real-world politics and their ever-evolving consequences, our narrow individual perspective is that of a character denied the author’s omniscience: we don’t know what to make of the pattern of things – if there even is a pattern – or where events are headed, and yet we still have to choose what to do in the moment. And so we look outside ourselves, to stories where we do really know what’s happening, to characters in whose hopes and fears we recognise our own. We might make jokes and memes about it, buy little rubber bracelets stamped with WWBD (What Would Buffy Do?) and laugh at our preoccupation with people who don’t really exist, but when the hammer falls and our own words fail us, theirs remain.</p><p><i>I must not tell lies.</i></p><p>We are not things.</p><p>If we burn, you burn with us.</p><p>Right now, we don’t need a Jedi Master to tell us that fear leads to anger, anger to hate, and hate to suffering: that’s not an abstract mystical tenet, but the bedrock of our current political reality. For the past few years, the Sad and Rabid Puppies – guided by an actual neo-Nazi – have campaigned against what they perceive as the recent politicization of SFF as a genre, as though it’s humanly possible to write a story involving people that doesn’t have a political dimension; as though “political narrative” means “I disagreed with the premise or content, which makes it Wrong” and not “a narrative which contains and was written by people.”</p></blockquote><p>Yes, Foz, you really must not tell lies. It’s rather egregious when you tell them right in the following paragraph.</p><p>I have written to John O’Neill, my former editor at Black Gate, asking him to remove this false, malicious, and materially damaging libel directed at me, and by extension, the Sad and Rabid Puppies. As I was a long-time contributor to <i>Black Gate</i>, Mr. O’Neill knows perfectly well that I am neither a neo-Nazi nor a National Socialist, I have never been a neo-Nazi or a National Socialist, I do not belong to, or subscribe to the tenets of, the German National Socialist Workers Party or any subsequent facsimile, and I do not appreciate the libelous attempts of Ms Meadows, to publicly and falsely assert that I am “an actual neo-Nazi”.</p><p>Moreover, the link which was provided to demonstrate that I am “an actual neo-Nazi” actually proves the precise opposite. Therefore, it is <a href=\"http://archive.is/pphJn\">a matter of public record</a> that the information was published, I was directly or indirectly identified, the remarks were defamatory towards my reputation, the published information is false, and both Foz Meadows and<i> Black Gate</i> are clearly at fault.</p><p>I have great respect for John O’Neill, I still enjoy reading <i>Black Gate</i> from time to time, and I very much hope that he did not know about this malicious libel at the time it was posted. Now that he has been made aware of it, I tend to expect he will see fit to do the right thing and remove it from the article rather than pursue the SJW strategy and double down.</p><p> UPDATE: Being an SJW, Foz <a href=\"http://archive.is/mGoyk\">is doubling down</a>. This should be educational.</p><blockquote class=\"tr_bq\"><p> Oh dear. Apparently VoxPox is wroth with me for calling him a neo-Nazi. If it supports eugenics, racism, misogyny and heils like a duck…</p></blockquote><p> UPDATE: We certainly won’t have any trouble <a href=\"http://archive.is/epHMm\">proving ill will</a>.</p><p>UPDATE: As I expected, John was very reasonable about it and the matter is being resolved. Thanks for your support, everyone.</p></div>",
  "content_text": "Foz Meadows clearly doesn’t understand irony even when she publicly displays it while in the process of\nmaliciously defaming a Hugo-nominated science fiction editor\nat a leading independent publishing house:\nStories reflect us, and we reflect them back at themselves, like one of Terry Pratchett’s witches standing at the heart of a room of mirrors: humanity all the way down. In the midst of real-world politics and their ever-evolving consequences, our narrow individual perspective is that of a character denied the author’s omniscience: we don’t know what to make of the pattern of things – if there even is a pattern – or where events are headed, and yet we still have to choose what to do in the moment. And so we look outside ourselves, to stories where we do really know what’s happening, to characters in whose hopes and fears we recognise our own. We might make jokes and memes about it, buy little rubber bracelets stamped with WWBD (What Would Buffy Do?) and laugh at our preoccupation with people who don’t really exist, but when the hammer falls and our own words fail us, theirs remain.\nI must not tell lies.\nWe are not things.\nIf we burn, you burn with us.\nRight now, we don’t need a Jedi Master to tell us that fear leads to anger, anger to hate, and hate to suffering: that’s not an abstract mystical tenet, but the bedrock of our current political reality. For the past few years, the Sad and Rabid Puppies – guided by an actual neo-Nazi – have campaigned against what they perceive as the recent politicization of SFF as a genre, as though it’s humanly possible to write a story involving people that doesn’t have a political dimension; as though “political narrative” means “I disagreed with the premise or content, which makes it Wrong” and not “a narrative which contains and was written by people.”\nYes, Foz, you really must not tell lies. It’s rather egregious when you tell them right in the following paragraph.\nI have written to John O’Neill, my former editor at Black Gate, asking him to remove this false, malicious, and materially damaging libel directed at me, and by extension, the Sad and Rabid Puppies. As I was a long-time contributor to\nBlack Gate\n, Mr. O’Neill knows perfectly well that I am neither a neo-Nazi nor a National Socialist, I have never been a neo-Nazi or a National Socialist, I do not belong to, or subscribe to the tenets of, the German National Socialist Workers Party or any subsequent facsimile, and I do not appreciate the libelous attempts of Ms Meadows, to publicly and falsely assert that I am “an actual neo-Nazi”.\nMoreover, the link which was provided to demonstrate that I am “an actual neo-Nazi” actually proves the precise opposite. Therefore, it is\na matter of public record\nthat the information was published, I was directly or indirectly identified, the remarks were defamatory towards my reputation, the published information is false, and both Foz Meadows and\nBlack Gate\nare clearly at fault.\nI have great respect for John O’Neill, I still enjoy reading\nBlack Gate\nfrom time to time, and I very much hope that he did not know about this malicious libel at the time it was posted. Now that he has been made aware of it, I tend to expect he will see fit to do the right thing and remove it from the article rather than pursue the SJW strategy and double down.\nUPDATE: Being an SJW, Foz\nis doubling down\n. This should be educational.\nOh dear. Apparently VoxPox is wroth with me for calling him a neo-Nazi. If it supports eugenics, racism, misogyny and heils like a duck…\nUPDATE: We certainly won’t have any trouble\nproving ill will\n.\nUPDATE: As I expected, John was very reasonable about it and the matter is being resolved. Thanks for your support, everyone.",
  "tags": [
    "Black Gate",
    "Puppies"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-08T11:25:00+00:00"
}