{
  "url": "https://voxday.net/2016/12/31/on-cherishing-extremists/",
  "scraped_at": "2025-12-18T02:12:51.435917",
  "title": "On cherishing extremists",
  "date_display": "December 31, 2016",
  "date_iso": "2016-12-31T13:00:00+00:00",
  "date_from_url": "2016-12-31",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>People have asked me, repeatedly, if I am not violating my stated tactic of “protect and cherish your extremists” when I criticize those on the right for doing what I consider to be objectively stupid things. The answer is both simple and obvious: no.</p><p>You protect an extremist by refusing to criticize him when he does something extreme <i>to the enemy in the interest of the cause</i>. You protect an extremist by refusing to criticize the excessive tactics he utilizes in taking the battle to the other side. You do not protect an idiot by refusing to criticize him when he a) acts like a moderate and attacks someone on your side, b) does something idiotic and irrelevant, c) serves the interests of the other side by dancing for the media.</p><p>The latter really isn’t that hard to understand. Look at how the media actually went so far as to <a href=\"http://variety.com/2016/tv/news/kkk-leaders-allege-producers-paid-them-to-fake-scenes-in-canceled-ae-documentary-exclusive-1201950078/\">pay for the KKK’s wood and fuel</a> just so they could create evidence to support their “stupid white people is raciss” narrative.</p><blockquote><p> TIJAT producers went so far as to orchestrate more than one cross-burning ceremony in Pulaski, though it is presented in the documentary as if the KKK is actually hosting the event. “We’ve been allowed special access to film this secret induction,” reads a title card that precedes one of the cross-burning scenes.</p><p>“It was the producers who told me they wanted a cross-lighting,” recounted Nichols. “In fact they made two cross-lightings cause they wanted to reshoot some scenes. They bought everything—the wood, the burlap to wrap around the wood, the diesel and kerosene for my cross lighting. They even brought all the food for everyone.”</p></blockquote><p>If you’re dressed in a monkey suit and dancing for the media, you’re not “playing 4d chess”, you’re not “mocking the media”, you’re not an extremist who merits defending, you’re just a dancing monkey being used by ruthless hypocrites on the other side.</p><blockquote class=\"tr_bq\"><p> “They kept asking me, wanting me, to use the word ‘nigger,’” said Nichols, who alleged he was paid $600 per day by producers to participate. “I was sitting down being filmed and interviewed with the lights and the backdrop set up, and I said something and used the word ‘blacks.’ Then the producer interrupted me and said ‘No, no, no. We want him to use the word “nigger!”’’’</p></blockquote><p>There is always demand for idiots who will play media patsy. And while there are people who can go boldly into the lion’s den and make the lions do tricks, if your name is not “Donald Trump” or “Milo Yiannopoulos”, you are not one of them. Trust me on this. I am smarter than you, I am better-educated than you, and as a three-time nationally syndicated columnist, I have<i> far more</i> media experience than you. And yet, even I can’t do it reliably. That’s why I limit my contact with the media to written questions, and that’s why they don’t run my answers when they interview me. I don’t serve their narrative.</p><p>Turn your guns on allies and sympathizers instead of the enemy, and you lose all right to any cover or assistance or regard. I don’t have much tolerance for idiots and I don’t have <i>any </i>for those who attack my friends and allies. If you’re going to attack Mike and Milo and Stefan and Roosh, you won’t do it here and you will go immediately on my “ignore that idiot” list.</p></div>",
  "content_text": "People have asked me, repeatedly, if I am not violating my stated tactic of “protect and cherish your extremists” when I criticize those on the right for doing what I consider to be objectively stupid things. The answer is both simple and obvious: no.\nYou protect an extremist by refusing to criticize him when he does something extreme\nto the enemy in the interest of the cause\n. You protect an extremist by refusing to criticize the excessive tactics he utilizes in taking the battle to the other side. You do not protect an idiot by refusing to criticize him when he a) acts like a moderate and attacks someone on your side, b) does something idiotic and irrelevant, c) serves the interests of the other side by dancing for the media.\nThe latter really isn’t that hard to understand. Look at how the media actually went so far as to\npay for the KKK’s wood and fuel\njust so they could create evidence to support their “stupid white people is raciss” narrative.\nTIJAT producers went so far as to orchestrate more than one cross-burning ceremony in Pulaski, though it is presented in the documentary as if the KKK is actually hosting the event. “We’ve been allowed special access to film this secret induction,” reads a title card that precedes one of the cross-burning scenes.\n“It was the producers who told me they wanted a cross-lighting,” recounted Nichols. “In fact they made two cross-lightings cause they wanted to reshoot some scenes. They bought everything—the wood, the burlap to wrap around the wood, the diesel and kerosene for my cross lighting. They even brought all the food for everyone.”\nIf you’re dressed in a monkey suit and dancing for the media, you’re not “playing 4d chess”, you’re not “mocking the media”, you’re not an extremist who merits defending, you’re just a dancing monkey being used by ruthless hypocrites on the other side.\n“They kept asking me, wanting me, to use the word ‘nigger,’” said Nichols, who alleged he was paid $600 per day by producers to participate. “I was sitting down being filmed and interviewed with the lights and the backdrop set up, and I said something and used the word ‘blacks.’ Then the producer interrupted me and said ‘No, no, no. We want him to use the word “nigger!”’’’\nThere is always demand for idiots who will play media patsy. And while there are people who can go boldly into the lion’s den and make the lions do tricks, if your name is not “Donald Trump” or “Milo Yiannopoulos”, you are not one of them. Trust me on this. I am smarter than you, I am better-educated than you, and as a three-time nationally syndicated columnist, I have\nfar more\nmedia experience than you. And yet, even I can’t do it reliably. That’s why I limit my contact with the media to written questions, and that’s why they don’t run my answers when they interview me. I don’t serve their narrative.\nTurn your guns on allies and sympathizers instead of the enemy, and you lose all right to any cover or assistance or regard. I don’t have much tolerance for idiots and I don’t have\nany\nfor those who attack my friends and allies. If you’re going to attack Mike and Milo and Stefan and Roosh, you won’t do it here and you will go immediately on my “ignore that idiot” list.",
  "tags": [
    "#AltRight",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-31T13:00:00+00:00"
}