{
  "url": "https://voxday.net/2016/12/03/qual-e-lalt-destra/",
  "scraped_at": "2025-12-18T02:08:28.919001",
  "title": "Cos’è l’Alt-Destra",
  "date_display": "December 3, 2016",
  "date_iso": "2016-12-03T12:35:00+00:00",
  "date_from_url": "2016-12-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><ol><li>L’Alt-Destra è<br> della destra politica nel senso Americano e Europeano. Socialisti non<br> sono Alt-Destra. Progressivisti non sono Alt-Destra. Liberali non sono<br> Alt-Destra. Communisti, Marxisti, Marxisti culturali, e neo-conservatori<br> non sono Alt-Destra.</br></br></br></br></li><li>L’Alt-Destra è<br> un ALTERNATIVA al conservatorismo tradizionale degli Stati Uniti<br> d’America nominalmente descritto dai 10 Principi Conservatori di Russel<br> Kirk, ma che in realtà si è trasformato nel progressivismo. L’Alt-Destra<br> è anche un alternativa al libertarianismo.</br></br></br></br></li><li>L’Alt-Destra non<br> è un atteggiamento difensivo e rigetta il concetto della sconfitta<br> nobile e di principio. È una filosofia anticipativa e offensiva in tutto<br> senso della parola. L’Alt-Destra creda nella vittoria attraverso la<br> perseveranza in armonia con la scienza, la realtà, la tradizione<br> culturale, e le lezioni del passato.</br></br></br></br></br></li><li>L’Alt-Destra<br> creda che l’Occidente esemplifica l’apice della realizzazione umana e<br> mantiene le sue colonne fondamentali: la Cristianità, le nazioni<br> Europee, e l’eredità Greco-Romana.</br></br></br></li><li>L’Alt-Destra è<br> apertamente e esplicitamente nazionalista. Sostiene tutti i nazionalismi<br> e il diritto di ogni nazione di esistere, omogeneo e incontaminato<br> dell’invasione straniera e dell’immigrazione.</br></br></br></li><li>L’Alt-Destra è anti-globalista. Si oppone a ogni gruppo che lavora per ideali o obiettivi globalisti.</li><li>L’Alt-Destra è<br> anti-uguaglianza. Rigetta l’esistenza dell’uguaglianza per la stessa<br> ragione che rigetta l’esistenza degli unicorni o dei folletti, facendo<br> nota del fatto che l’uguaglianza umana non esiste in qualsiasi forma<br> scientifica, legale, materiale, intellettuale, sessuale, o spirituale.</br></br></br></br></li><li>L’Alt-Destra è<br> scientodista. Accetta con presunzione le conclusioni correnti del metodo<br> scientifico (scientodia), tenendo conto che (a) queste conclusioni<br> potrebbero poi essere riviste, (b) gli scienziati sono suscettibili alla<br> corruzione, e (c) il cosiddetto consenso scientifico non è basato sulla<br> scientodia ma sulla democrazia, e quindi non è scientifica.</br></br></br></br></br></li><li>L’Alt-Destra creda che l’identita &gt; cultura &gt; politica</li><li>L’Alt-Destra si<br> oppone alla dominazione di un gruppo etnico indigeno da un altro,<br> particolarmente nelle patrie dei gruppi dominati. L’Alt-Destra si oppone<br> a qualsiasi gruppo etnico estraneo che ottiene un influenza eccessiva<br> in qualsiasi società, sia per il nepotismo sia per il tribalismo sia per<br> qualsiasi metodo.</br></br></br></br></br></li><li>L’Alt-Destra capisce che diversità + prossimità = guerra.</li><li>L’Alt-Destra non se ne frega di che ne pensi.</li><li>L’Alt-Destra<br> rigetta il liberoscambismo internazionale e il libero movimento della<br> gente che il liberoscambismo esige. I vantaggi del liberoscambismo<br> intranazionale non danno prova dei vantaggi del liberoscambismo<br> internazionale.</br></br></br></br></li><li>L’Alt-Destra creda che dobbiamo assicurare l’esistenza della razza bianca e un futuro per bambini bianchi.</li><li>L’Alt-Destra non<br> creda nella supremazia generale di qualsiasi razza, nazione, gente, o<br> sotto-specie. Ogni razza, nazione, gente, e sotto-specie umana ha i sui<br> propri vantaggi e le sue proprie debolezze, e possiede il diritto<br> assoluto di abitare indisturbata nella cultura nativa che preferisce.</br></br></br></br></li><li>L’Alt-Destra è<br> una filosofia che tiene in gran conto la pace fra le diverse nazioni del<br> mondo e oppone le guerre che servono solo a imporre i valori di una<br> nazione su un’altra. Si oppone anche gli sforzi per sterminare singole<br> nazioni con la guerra, il genocidio, l’immigrazione, o l’assimilazione<br> genetica.</br></br></br></br></br></li></ol></div>",
  "content_text": "L’Alt-Destra è\ndella destra politica nel senso Americano e Europeano. Socialisti non\nsono Alt-Destra. Progressivisti non sono Alt-Destra. Liberali non sono\nAlt-Destra. Communisti, Marxisti, Marxisti culturali, e neo-conservatori\nnon sono Alt-Destra.\nL’Alt-Destra è\nun ALTERNATIVA al conservatorismo tradizionale degli Stati Uniti\nd’America nominalmente descritto dai 10 Principi Conservatori di Russel\nKirk, ma che in realtà si è trasformato nel progressivismo. L’Alt-Destra\nè anche un alternativa al libertarianismo.\nL’Alt-Destra non\nè un atteggiamento difensivo e rigetta il concetto della sconfitta\nnobile e di principio. È una filosofia anticipativa e offensiva in tutto\nsenso della parola. L’Alt-Destra creda nella vittoria attraverso la\nperseveranza in armonia con la scienza, la realtà, la tradizione\nculturale, e le lezioni del passato.\nL’Alt-Destra\ncreda che l’Occidente esemplifica l’apice della realizzazione umana e\nmantiene le sue colonne fondamentali: la Cristianità, le nazioni\nEuropee, e l’eredità Greco-Romana.\nL’Alt-Destra è\napertamente e esplicitamente nazionalista. Sostiene tutti i nazionalismi\ne il diritto di ogni nazione di esistere, omogeneo e incontaminato\ndell’invasione straniera e dell’immigrazione.\nL’Alt-Destra è anti-globalista. Si oppone a ogni gruppo che lavora per ideali o obiettivi globalisti.\nL’Alt-Destra è\nanti-uguaglianza. Rigetta l’esistenza dell’uguaglianza per la stessa\nragione che rigetta l’esistenza degli unicorni o dei folletti, facendo\nnota del fatto che l’uguaglianza umana non esiste in qualsiasi forma\nscientifica, legale, materiale, intellettuale, sessuale, o spirituale.\nL’Alt-Destra è\nscientodista. Accetta con presunzione le conclusioni correnti del metodo\nscientifico (scientodia), tenendo conto che (a) queste conclusioni\npotrebbero poi essere riviste, (b) gli scienziati sono suscettibili alla\ncorruzione, e (c) il cosiddetto consenso scientifico non è basato sulla\nscientodia ma sulla democrazia, e quindi non è scientifica.\nL’Alt-Destra creda che l’identita > cultura > politica\nL’Alt-Destra si\noppone alla dominazione di un gruppo etnico indigeno da un altro,\nparticolarmente nelle patrie dei gruppi dominati. L’Alt-Destra si oppone\na qualsiasi gruppo etnico estraneo che ottiene un influenza eccessiva\nin qualsiasi società, sia per il nepotismo sia per il tribalismo sia per\nqualsiasi metodo.\nL’Alt-Destra capisce che diversità + prossimità = guerra.\nL’Alt-Destra non se ne frega di che ne pensi.\nL’Alt-Destra\nrigetta il liberoscambismo internazionale e il libero movimento della\ngente che il liberoscambismo esige. I vantaggi del liberoscambismo\nintranazionale non danno prova dei vantaggi del liberoscambismo\ninternazionale.\nL’Alt-Destra creda che dobbiamo assicurare l’esistenza della razza bianca e un futuro per bambini bianchi.\nL’Alt-Destra non\ncreda nella supremazia generale di qualsiasi razza, nazione, gente, o\nsotto-specie. Ogni razza, nazione, gente, e sotto-specie umana ha i sui\npropri vantaggi e le sue proprie debolezze, e possiede il diritto\nassoluto di abitare indisturbata nella cultura nativa che preferisce.\nL’Alt-Destra è\nuna filosofia che tiene in gran conto la pace fra le diverse nazioni del\nmondo e oppone le guerre che servono solo a imporre i valori di una\nnazione su un’altra. Si oppone anche gli sforzi per sterminare singole\nnazioni con la guerra, il genocidio, l’immigrazione, o l’assimilazione\ngenetica.",
  "tags": [
    "#AltRight"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-03T12:35:00+00:00"
}