{
  "url": "https://voxday.net/2016/12/14/shut-down-universities/",
  "scraped_at": "2025-12-18T02:10:19.497456",
  "title": "Shut down the universities",
  "date_display": "December 14, 2016",
  "date_iso": "2016-12-14T09:40:00+00:00",
  "date_from_url": "2016-12-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Being fully converged, <a href=\"http://eagnews.org/oxford-university-student-union-urges-gender-neutral-pronouns/\">they are no longer fit for their original purpose</a> of educating the sons of the elite.</p><blockquote><p> The prestigious University of Oxford wants students to replace “she” and “he” with the more gender-neutral pronoun “ze.”</p><p>The university’s behavior code states that using the wrong pronoun for a transgender person is considered an offense, and a new leaflet distributed by the student union supposedly aims to cut down on hurt feelings and discrimination by encouraging students to use “ze” instead, the Independent reports.oxford</p><p>British gay rights activist Peter Tatchell applauded the move.</p><p>“It is a positive thing to not always emphasize gender divisions and barriers,” he told the Daily Mail.</p><p>“It is good to have gender-neutral pronouns for those who want them but it shouldn’t be compulsory,” Tatchell said. “This issue isn’t about being politically correct or censoring anyone. It’s about acknowledging the fact of changing gender identities and respecting people’s right to not define themselves as male or female.”</p><p>“Giving people the ‘ze’ option is a thoughtful, considerate move,” he said.</p><p>The change suggested by the Oxford’s student union follows a trend of schools moving toward more “gender inclusive” language to describe students who don’t want to be labeled male or female.</p><p>The University of Tennessee’s Office for Diversity and Inclusion issued a list of suggested gender-neutral pronouns for students that included “ze,” as well as other terms like “xe,” “hir,” “zir,” “xem,” and “wyr” to identify transgender students that created a public firestorm, The Tennessean reports.</p><p>Officials later removed the guidance from the university’s website amid the backlash, according to EAGnews.</p><p>In England, Cambridge University is also moving toward more “inclusive” language, and student welfare officer Sophie Buck told The Sunday Times student union events there “start with a speaker introducing themselves using a gender neutral pronoun.</p><p>“It’s part of a drive to make the union intersectional,” she said.</p></blockquote><p>Remember, this is all entirely predictable. It is the Impossibility of Social Justice Convergence on display: No institution can effectively serve two different functions. The more an institution converges towards the highest abstract standard of social and distributive justice, the less it is able to perform its primary function.</p><p>From <a href=\"http://amzn.to/1tpCVKy\">SJWs Always Lie: Taking Down the Thought Police</a>:<br> <i><br/></i><br> <i>The public schools can no longer educate, so people are turning to homeschooling. The universities can no longer provide liberal arts educations, so people are becoming technology-assisted autodidacts. The banks no longer loan, the state and local governments no longer provide basic public services, the military does not defend the borders, the newspapers no longer provide news, the television networks no longer entertain, and the corporations are increasingly unable to provide employment.</i><br> <i><br/></i><br> <i>Even as the institutions have been invaded and coopted in the interests of social justice, they have been rendered unable to fulfill their primary functions. This is the great internal contradiction that the SJWs will never be able to positively resolve, just as the Soviet communists were never able to resolve the contradiction of socialist calculation that brought down their economy and their empire 69 years after Ludwig von Mises first pointed it out. One might call it the Impossibility of Social Justice Convergence; no man can serve two masters and no institution can effectively serve two different functions. <b>The more an institution converges towards the highest abstract standard of social and distributive justice, the less it is able to perform its primary function.</b></i><br> <i><b><br/></b></i><br> There is no point trying to debate about what the purpose of a university is any longer. The public should stop funding them, their assets should be seized and distributed to the public, and new institutions will rise up to take their place. Nothing of value will be lost in the process, because they’re already not educating anyone anyhow.</br></br></br></br></br></br></p><p>It’s fascinating to see how quickly allowing women to attend the elite universities destroyed an institution that was centuries old. One would think someone, somewhere, would eventually notice that the same pattern is playing out again, and again, and again in a wide variety of institutions, from the men’s clubs to the churches.</p><p>CORRECTION: Apparently the situation at Oxford is not QUITE as bad as the article makes it look. It’s only the Oxford Student Union that has adopted this policy, not the entire university. So, it’s about 3-5 years less converged than the article describes it.</p></div>",
  "content_text": "Being fully converged,\nthey are no longer fit for their original purpose\nof educating the sons of the elite.\nThe prestigious University of Oxford wants students to replace “she” and “he” with the more gender-neutral pronoun “ze.”\nThe university’s behavior code states that using the wrong pronoun for a transgender person is considered an offense, and a new leaflet distributed by the student union supposedly aims to cut down on hurt feelings and discrimination by encouraging students to use “ze” instead, the Independent reports.oxford\nBritish gay rights activist Peter Tatchell applauded the move.\n“It is a positive thing to not always emphasize gender divisions and barriers,” he told the Daily Mail.\n“It is good to have gender-neutral pronouns for those who want them but it shouldn’t be compulsory,” Tatchell said. “This issue isn’t about being politically correct or censoring anyone. It’s about acknowledging the fact of changing gender identities and respecting people’s right to not define themselves as male or female.”\n“Giving people the ‘ze’ option is a thoughtful, considerate move,” he said.\nThe change suggested by the Oxford’s student union follows a trend of schools moving toward more “gender inclusive” language to describe students who don’t want to be labeled male or female.\nThe University of Tennessee’s Office for Diversity and Inclusion issued a list of suggested gender-neutral pronouns for students that included “ze,” as well as other terms like “xe,” “hir,” “zir,” “xem,” and “wyr” to identify transgender students that created a public firestorm, The Tennessean reports.\nOfficials later removed the guidance from the university’s website amid the backlash, according to EAGnews.\nIn England, Cambridge University is also moving toward more “inclusive” language, and student welfare officer Sophie Buck told The Sunday Times student union events there “start with a speaker introducing themselves using a gender neutral pronoun.\n“It’s part of a drive to make the union intersectional,” she said.\nRemember, this is all entirely predictable. It is the Impossibility of Social Justice Convergence on display: No institution can effectively serve two different functions. The more an institution converges towards the highest abstract standard of social and distributive justice, the less it is able to perform its primary function.\nFrom\nSJWs Always Lie: Taking Down the Thought Police\n:\nThe public schools can no longer educate, so people are turning to homeschooling. The universities can no longer provide liberal arts educations, so people are becoming technology-assisted autodidacts. The banks no longer loan, the state and local governments no longer provide basic public services, the military does not defend the borders, the newspapers no longer provide news, the television networks no longer entertain, and the corporations are increasingly unable to provide employment.\nEven as the institutions have been invaded and coopted in the interests of social justice, they have been rendered unable to fulfill their primary functions. This is the great internal contradiction that the SJWs will never be able to positively resolve, just as the Soviet communists were never able to resolve the contradiction of socialist calculation that brought down their economy and their empire 69 years after Ludwig von Mises first pointed it out. One might call it the Impossibility of Social Justice Convergence; no man can serve two masters and no institution can effectively serve two different functions.\nThe more an institution converges towards the highest abstract standard of social and distributive justice, the less it is able to perform its primary function.\nThere is no point trying to debate about what the purpose of a university is any longer. The public should stop funding them, their assets should be seized and distributed to the public, and new institutions will rise up to take their place. Nothing of value will be lost in the process, because they’re already not educating anyone anyhow.\nIt’s fascinating to see how quickly allowing women to attend the elite universities destroyed an institution that was centuries old. One would think someone, somewhere, would eventually notice that the same pattern is playing out again, and again, and again in a wide variety of institutions, from the men’s clubs to the churches.\nCORRECTION: Apparently the situation at Oxford is not QUITE as bad as the article makes it look. It’s only the Oxford Student Union that has adopted this policy, not the entire university. So, it’s about 3-5 years less converged than the article describes it.",
  "tags": [
    "education",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-14T09:40:00+00:00"
}