{
  "url": "https://voxday.net/2016/12/06/talking-business-with-stefan/",
  "scraped_at": "2025-12-18T02:09:06.482430",
  "title": "Talking business with Stefan",
  "date_display": "December 6, 2016",
  "date_iso": "2016-12-06T23:39:00+00:00",
  "date_from_url": "2016-12-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div style=\"text-align: center;\"> <iframe allowfullscreen=\"\" frameborder=\"0\" height=\"284\" src=\"https://www.youtube.com/embed/SQ6DHBqxaoY\" width=\"512\"></iframe></div><div style=\"text-align: center;\"></div><p>It’s always interesting to speak with Stefan Molyneux; this time we were talking about business, work, and success. In my opinion, the important thing to accept about success is understanding that <i>it’s not you</i>. Sure, you have to work hard and do your part, but you are not the only factor. You are <i>FAR </i>from the only factor. There are a number of factors involved, and of them all, timing is almost certainly the most important. Sometimes you can recognize, but more often, it’s just a matter of luck.</p><p>Some say that luck is made, but I think it is more akin to something that you have to be already working to exploit for the moment it arrives. I think of it like a surfer and a big wave. If you haven’t taken the time to learn to surf, bought a surfboard, then swum out to sea, you’re not going to catch it. If you’re on land and you see it, it’s already too late.</p><p>Our big point of disagreement was about volunteers. I think they are crucial, so long as you’re willing to be ruthless about weeding out those who don’t make the grade for many, many different reasons. Stefan is dubious about them, but I can state for a fact that neither Castalia nor Infogalactic nor Gab would have gotten anywhere without a reliable core of dedicated, hard-working volunteers.</p></div>",
  "content_text": "It’s always interesting to speak with Stefan Molyneux; this time we were talking about business, work, and success. In my opinion, the important thing to accept about success is understanding that\nit’s not you\n. Sure, you have to work hard and do your part, but you are not the only factor. You are\nFAR\nfrom the only factor. There are a number of factors involved, and of them all, timing is almost certainly the most important. Sometimes you can recognize, but more often, it’s just a matter of luck.\nSome say that luck is made, but I think it is more akin to something that you have to be already working to exploit for the moment it arrives. I think of it like a surfer and a big wave. If you haven’t taken the time to learn to surf, bought a surfboard, then swum out to sea, you’re not going to catch it. If you’re on land and you see it, it’s already too late.\nOur big point of disagreement was about volunteers. I think they are crucial, so long as you’re willing to be ruthless about weeding out those who don’t make the grade for many, many different reasons. Stefan is dubious about them, but I can state for a fact that neither Castalia nor Infogalactic nor Gab would have gotten anywhere without a reliable core of dedicated, hard-working volunteers.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-06T23:39:00+00:00"
}