{
  "url": "https://voxday.net/2016/12/22/the-religion-of-diversity/",
  "scraped_at": "2025-12-18T02:11:31.948350",
  "title": "The false faith of diversity",
  "date_display": "December 22, 2016",
  "date_iso": "2016-12-22T10:01:00+00:00",
  "date_from_url": "2016-12-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It is not merely ironic, it is literally diabolical, that white Americans <a href=\"https://atlanticcenturion.wordpress.com/2016/12/18/planting-america-state-sponsored-demographic-change-and-the-precedent-of-ulster/\">celebrate their own population replacement by diversity</a> while decrying that of the Tibetans by the Chinese:</p><blockquote><p> The US government opposes the existence of a White majoritarian society, and it makes little effort to hide this. System sycophants can of course protest that this is not the case at all—that the government is just promoting equality and diversity, and that opponents of equality and diversity (and immigration, legal or illegal) are racists and bigots—but the result is still less White people. That’s what actually matters, the result. And if you care about that, you are treated like a two-headed person at best, or a terrorist at worst. If you want to save Tibet from population replacement by the Chinese though, then that’s very upright and good of you.</p><p>Framed in terms of genocide, replacement sounds conspiratorial because there is slim official acknowledgement of the desired impact for these policies to have on the European American population. Very, very few people in power go on the record explicitly calling for there to be less White people, and when they do it gets little coverage for obvious reasons. That Whites are becoming a minority is acknowledged as a fact and lauded as progress, but it is not overtly called for. President Barack Obama hasn’t said he wants to see less White people around; it is only noted that there will be less of them and that such an outcome would be good. But if we talk of demographic change in terms of holy diversity and sacrosanct equality, our greatest qualities as a nation of immigrants that is open to anyone who wants to come here and make a better life (especially those from the global south who outnumber Europeans by billions), suddenly things sound very different.</p><p>And familiar. Did any bells go off? If you’ve ever been through higher education, watched basic cable, joined the armed forces, had a white collar job, worked for a large corporation in any capacity, read an op-ed in major newspaper, or really interacted with any mainline institution in the United States, you’ve almost certainly been trained to celebrate diversity. Trained by those in power that to embrace and adhere to this belief system is the path to moral enlightenment and social mobility. This does not sound like a call for genocide at all but rather a religious vocation, a cause to be taken up.</p><p>Pursuing diversity is a righteous goal that only nasty and brutish people of rude inclinations oppose, such as rednecks, blue-collar Whites, or other lower-middle class people of European descent. The eloquent and charismatic Obama is a champion of diversity, is he not? Who in their right mind is opposed to there being less White people? And diversity is good for the economy too! You can actually sell Homo oeconomicus his own slaughter, for the last man has no ambitions beyond compliance.</p><p>Language has both the power to enlighten and obfuscate, but no matter what we call this, it means Whites becoming a minority. Academically this radical racial shift is referred to as the third demographic transition—the demographic cliff nearly all White countries have plunged off as their fertility rates sink below replacement levels (2.1 children per woman). At the same time, the share of foreign-born and non-European peoples in White countries is hitting record levels. What can be the end result of this if not a world where Europe and the Anglo countries become non-white, while Africa remains African and Asia remains Asian? This is an issue no government wants to formally address and something they won’t have a conversation about with their constituents. But it matters to these governments, as they’ve enacted policies that promote the third demographic transition. Therefore they must be held accountable for the consequences.</p><p>Maybe this still sounds crazy to you. What kind of government would go out of its way to replace its own native-born people with outsiders, and for what purpose? I would say any government that is motivated to and not prevented from doing so. In our case the motivation is the ideology of third worldism—the belief that people of color and their interests are morally superior to those of Whites. And there is no prevention, because outside of the government, all of its personnel feeders in the business, media, and academia spaces are on board with third worldism as well. Diversity is their credo, and celebrating diversity is their equivalent of going to church.</p></blockquote><p>Then again, the Tibetans are unlikely to be the last to be replaced; there is a reason why Congress passed the Chinese exclusion laws in the early 20th century. One of the more interesting science fiction possibilities I haven’t seen yet is the genetic recreation of the white race from diversity in a Han-dominated world. That particular homogenuity is the most likely end result of diversity; Europe has demonstrated that the (((anti-whites))) don’t think ahead much better than the short time-preferenced third worlders they celebrate, or anticipate the logical consequences of their actions. They are tacticians, not strategists.</p><p>Meanwhile, both liberals and conservatives fail to grasp that Asians in general and the Han in particular, are considerably more than generic not-whites. <a href=\"http://www.economist.com/news/briefing/21710264-worlds-rising-superpower-has-particular-vision-ethnicity-and-nationhood-has\">They have the most successful, proudest, and most ethnocentric culture on the planet</a>, and perhaps more importantly, they do not let ideologies sabotage their national self-interest for long.</p><blockquote><p> Ethnicity is central to China’s national identity. It is the Han, 1.2bn of them in mainland China alone, that most people refer to as “Chinese”, rather than the country’s minorities, numbering 110m people. Ethnicity and nationality have become almost interchangeable for China’s Han, says James Leibold of La Trobe University in Melbourne, Australia. That conflation is of fundamental importance. It defines the relations between the Han and other ethnic groups. By narrowing its legal labour market almost entirely to people of Han descent, ethnicity is shaping the country’s economy and development. And it strains foreign relations, too. Even ethnic Han whose families left for other countries generations ago are often regarded as part of a coherent national group, both by China’s government and people….</p><p>Race became a central organising principle in Republican China. Sun Yat-sen, who founded the Kuomintang, China’s nationalist party, and is widely seen as a “father” of the Chinese nation, promoted the idea of “common blood”. A century on President Xi Jinping continues to do so. One reason for his claim that Taiwan is part of China is that “blood is thicker than water”. In a speech in 2014 he set his sights even wider: “Generations of overseas Chinese never forget their home country, their origins or the blood of the Chinese nation flowing in their veins.”</p><p>Many Chinese today share the idea that a Chinese person is instantly recognisable—and that an ethnic Han must, in essence, be one of them. A young child in Beijing will openly point at someone with white or black skin and declare them a foreigner (or “person from outside country”, to translate literally). Foreign-born Han living in China are routinely told that their Mandarin should be better (in contrast to non-Han, who are praised even if they only mangle an occasional pleasantry). China today is extraordinarily homogenous. It sustains that by remaining almost entirely closed to new entrants except by birth.</p></blockquote><p>Moreover, having witnessed and become dominant through the diversity-assisted suicide of the European West, the Chinese of the future are unlikely to fall for the same conceptual bait as the foolish liberals and conservatives of the West. There is no equality, there never will be, and those who make it an article of faith will inevitably be conquered by those who wisely reject it in favor of reality.</p></div>",
  "content_text": "It is not merely ironic, it is literally diabolical, that white Americans\ncelebrate their own population replacement by diversity\nwhile decrying that of the Tibetans by the Chinese:\nThe US government opposes the existence of a White majoritarian society, and it makes little effort to hide this. System sycophants can of course protest that this is not the case at all—that the government is just promoting equality and diversity, and that opponents of equality and diversity (and immigration, legal or illegal) are racists and bigots—but the result is still less White people. That’s what actually matters, the result. And if you care about that, you are treated like a two-headed person at best, or a terrorist at worst. If you want to save Tibet from population replacement by the Chinese though, then that’s very upright and good of you.\nFramed in terms of genocide, replacement sounds conspiratorial because there is slim official acknowledgement of the desired impact for these policies to have on the European American population. Very, very few people in power go on the record explicitly calling for there to be less White people, and when they do it gets little coverage for obvious reasons. That Whites are becoming a minority is acknowledged as a fact and lauded as progress, but it is not overtly called for. President Barack Obama hasn’t said he wants to see less White people around; it is only noted that there will be less of them and that such an outcome would be good. But if we talk of demographic change in terms of holy diversity and sacrosanct equality, our greatest qualities as a nation of immigrants that is open to anyone who wants to come here and make a better life (especially those from the global south who outnumber Europeans by billions), suddenly things sound very different.\nAnd familiar. Did any bells go off? If you’ve ever been through higher education, watched basic cable, joined the armed forces, had a white collar job, worked for a large corporation in any capacity, read an op-ed in major newspaper, or really interacted with any mainline institution in the United States, you’ve almost certainly been trained to celebrate diversity. Trained by those in power that to embrace and adhere to this belief system is the path to moral enlightenment and social mobility. This does not sound like a call for genocide at all but rather a religious vocation, a cause to be taken up.\nPursuing diversity is a righteous goal that only nasty and brutish people of rude inclinations oppose, such as rednecks, blue-collar Whites, or other lower-middle class people of European descent. The eloquent and charismatic Obama is a champion of diversity, is he not? Who in their right mind is opposed to there being less White people? And diversity is good for the economy too! You can actually sell Homo oeconomicus his own slaughter, for the last man has no ambitions beyond compliance.\nLanguage has both the power to enlighten and obfuscate, but no matter what we call this, it means Whites becoming a minority. Academically this radical racial shift is referred to as the third demographic transition—the demographic cliff nearly all White countries have plunged off as their fertility rates sink below replacement levels (2.1 children per woman). At the same time, the share of foreign-born and non-European peoples in White countries is hitting record levels. What can be the end result of this if not a world where Europe and the Anglo countries become non-white, while Africa remains African and Asia remains Asian? This is an issue no government wants to formally address and something they won’t have a conversation about with their constituents. But it matters to these governments, as they’ve enacted policies that promote the third demographic transition. Therefore they must be held accountable for the consequences.\nMaybe this still sounds crazy to you. What kind of government would go out of its way to replace its own native-born people with outsiders, and for what purpose? I would say any government that is motivated to and not prevented from doing so. In our case the motivation is the ideology of third worldism—the belief that people of color and their interests are morally superior to those of Whites. And there is no prevention, because outside of the government, all of its personnel feeders in the business, media, and academia spaces are on board with third worldism as well. Diversity is their credo, and celebrating diversity is their equivalent of going to church.\nThen again, the Tibetans are unlikely to be the last to be replaced; there is a reason why Congress passed the Chinese exclusion laws in the early 20th century. One of the more interesting science fiction possibilities I haven’t seen yet is the genetic recreation of the white race from diversity in a Han-dominated world. That particular homogenuity is the most likely end result of diversity; Europe has demonstrated that the (((anti-whites))) don’t think ahead much better than the short time-preferenced third worlders they celebrate, or anticipate the logical consequences of their actions. They are tacticians, not strategists.\nMeanwhile, both liberals and conservatives fail to grasp that Asians in general and the Han in particular, are considerably more than generic not-whites.\nThey have the most successful, proudest, and most ethnocentric culture on the planet\n, and perhaps more importantly, they do not let ideologies sabotage their national self-interest for long.\nEthnicity is central to China’s national identity. It is the Han, 1.2bn of them in mainland China alone, that most people refer to as “Chinese”, rather than the country’s minorities, numbering 110m people. Ethnicity and nationality have become almost interchangeable for China’s Han, says James Leibold of La Trobe University in Melbourne, Australia. That conflation is of fundamental importance. It defines the relations between the Han and other ethnic groups. By narrowing its legal labour market almost entirely to people of Han descent, ethnicity is shaping the country’s economy and development. And it strains foreign relations, too. Even ethnic Han whose families left for other countries generations ago are often regarded as part of a coherent national group, both by China’s government and people….\nRace became a central organising principle in Republican China. Sun Yat-sen, who founded the Kuomintang, China’s nationalist party, and is widely seen as a “father” of the Chinese nation, promoted the idea of “common blood”. A century on President Xi Jinping continues to do so. One reason for his claim that Taiwan is part of China is that “blood is thicker than water”. In a speech in 2014 he set his sights even wider: “Generations of overseas Chinese never forget their home country, their origins or the blood of the Chinese nation flowing in their veins.”\nMany Chinese today share the idea that a Chinese person is instantly recognisable—and that an ethnic Han must, in essence, be one of them. A young child in Beijing will openly point at someone with white or black skin and declare them a foreigner (or “person from outside country”, to translate literally). Foreign-born Han living in China are routinely told that their Mandarin should be better (in contrast to non-Han, who are praised even if they only mangle an occasional pleasantry). China today is extraordinarily homogenous. It sustains that by remaining almost entirely closed to new entrants except by birth.\nMoreover, having witnessed and become dominant through the diversity-assisted suicide of the European West, the Chinese of the future are unlikely to fall for the same conceptual bait as the foolish liberals and conservatives of the West. There is no equality, there never will be, and those who make it an article of faith will inevitably be conquered by those who wisely reject it in favor of reality.",
  "tags": [
    "decline and fall",
    "immigration"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-22T10:01:00+00:00"
}