{
  "url": "https://voxday.net/2016/12/17/the-fox-guarding-chicken-coop/",
  "scraped_at": "2025-12-18T02:10:46.257035",
  "title": "The fox guarding the chicken coop",
  "date_display": "December 17, 2016",
  "date_iso": "2016-12-17T11:18:00+00:00",
  "date_from_url": "2016-12-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Facebook is arguably the very worst organization to lead the charge against “fake news” than any organization not called “The Onion”, <a href=\"https://www.techdirt.com/articles/20160413/05434934167/facebook-has-lost-war-it-declared-fake-news.shtml\">as Techdirt concluded</a> long before Mark Zuckerberg’s latest George Soros-funded crusade:</p><blockquote><p> Facebook is generally seen as a key multiplier in this false force of non-news, which is probably what led the social media giant to declare war on fake news sites a year or so back. So how’d that go? Well, the results as analyzed over at Buzzfeed seems to suggest that Facebook has either lost this war it declared or is losing it badly enough that it might as well give it up.</p><p><i>To gauge Facebook’s progress in its fight, BuzzFeed News examined data across thousands of posts published to the fake news sites’ Facebook pages, and found decidedly mixed results. While average engagements (likes + shares + comments) per post fell from 972.7 in January 2015 to 434.78 in December 2015, they jumped to 827.8 in January 2016 and a whopping 1,304.7 in February. </i><br> <i><br/></i><br> <i>Some of the posts on the fake news sites’ pages went extremely viral many months after Facebook announced its crackdown. In August, for instance, an Empire News story reporting that Boston Marathon bombing suspect Dzhokhar Tsarnaev sustained serious injuries in prison received more than 240,000 likes, 43,000 shares, and 28,000 comments on its Facebook page. The incident was pure fiction, but still spread like wildfire on the platform. An even less believable September post about a fatal gang war sparked by the “Blood” moon was shared over 22,000 times from the Facebook page of Huzlers, another fake news site.</i></br></br></p><p>So, how did this war go so wrong for Facebook? Well, to start, it relied heavily on user-submitted notifications that a link or site was a fake news site. Sounds great, as aggregating feedback has worked quite well in other arenas. For this, however, it was doomed from the start. The purpose of fake news sites is, after all, to fool people, and fooled people are obviously not reporting the links as fake. Even when a reader manages to determine eventually that a link was a fake news post at a later time, perhaps after sharing it and having comments proving it false, how many of those people then take steps to report the link? Not enough, clearly, as the fake news scourge marches on.<br> <i><br/></i><br> <i>Another layer of the problem appears to be the faith and trust the general public puts into some famous people they are following, who have also been fooled with startling regularity. </i><i>Take D.L. Hughley, for example. The comedian, whose page is liked by more than 1.7 million people, showed up twice in the Huzlers logs. One fictitious Huzlers story he posted, about Magic Johnson donating blood, garnered more than 10,000 shares from his page. Hughley, who did not respond to BuzzFeed News’ request for comment, also shared four National Report links in 2015. </i></br></br></p><p>Radio stations also frequently post fake news. The Florida-based 93XFM was one of a number of radio stations BuzzFeed News discovered sharing Huzlers posts in 2015. Asked about one April post linking to a Huzlers story about a woman smoking PCP and chewing off her boyfriend’s penis, a 93XFM DJ named Sadie explained that fact-checking Facebook posts isn’t exactly a high priority.</p></blockquote><p>So, it’s not the dark and ever-dangerous Alt-Right that is to blame for fake news, but celebrities and Facebook itself. Moreover, Facebook isn’t even reliable when it comes to reporting its own internal metrics to advertisers, as it has been <a href=\"https://www.bloomberg.com/news/articles/2016-12-17/facebook-measurement-mistakes-test-advertisers-ardor\">caught exaggerating its own traffic numbers</a> for the FOURTH time. Or, as Facebook would prefer you see it, accidentally making mistakes that just coincidentally happened to favor its own financial interests again for the fourth straight time.</p><blockquote><p> Facebook Inc. built a colossal business based on measuring something older advertising methods cannot: the granular details about people. Two months ago, the company copped to a flaw in that measurement. Then Facebook did it again. And again.</p><p>On Friday, Facebook revealed faulty metrics with Instant Articles, its mobile publishing system, the fourth disclosure of a measurement error since September. The admission sharpened calls for more independent organizations to monitor the performance of digital advertising. And some large firms that buy a lot of ads said they will more closely scrutinize their spending on the social networking giant and could shift marketing dollars elsewhere….</p><p>In September, Facebook shared its first measurement error: inflated viewership numbers for its video ads, a relatively new product. Two months later, the company disclosed additional metric errors along with new tools for third-party measurement companies, including ComScore and Nielsen, to track its system more closely.</p><p>Problems persisted. Earlier this month, a report in Marketing Land, an industry publication, spotted a discrepancy between Facebook’s internal metrics on how articles where shared and public measurements. Facebook confirmed the error. “That shouldn’t happen,” said Brian Wieser, senior analyst, Pivotal Research Group. “If anyone was concerned that Facebook’s self-audit was not sufficient enough, they just proved it.”</p></blockquote><p>I don’t know why anyone is surprised that Facebook is trafficking heavily in false information on every side. Look at who runs it. Once a con artist, always a con artist. That’s been Zuckerberg’s motif from the start.</p></div>",
  "content_text": "Facebook is arguably the very worst organization to lead the charge against “fake news” than any organization not called “The Onion”,\nas Techdirt concluded\nlong before Mark Zuckerberg’s latest George Soros-funded crusade:\nFacebook is generally seen as a key multiplier in this false force of non-news, which is probably what led the social media giant to declare war on fake news sites a year or so back. So how’d that go? Well, the results as analyzed over at Buzzfeed seems to suggest that Facebook has either lost this war it declared or is losing it badly enough that it might as well give it up.\nTo gauge Facebook’s progress in its fight, BuzzFeed News examined data across thousands of posts published to the fake news sites’ Facebook pages, and found decidedly mixed results. While average engagements (likes + shares + comments) per post fell from 972.7 in January 2015 to 434.78 in December 2015, they jumped to 827.8 in January 2016 and a whopping 1,304.7 in February.\nSome of the posts on the fake news sites’ pages went extremely viral many months after Facebook announced its crackdown. In August, for instance, an Empire News story reporting that Boston Marathon bombing suspect Dzhokhar Tsarnaev sustained serious injuries in prison received more than 240,000 likes, 43,000 shares, and 28,000 comments on its Facebook page. The incident was pure fiction, but still spread like wildfire on the platform. An even less believable September post about a fatal gang war sparked by the “Blood” moon was shared over 22,000 times from the Facebook page of Huzlers, another fake news site.\nSo, how did this war go so wrong for Facebook? Well, to start, it relied heavily on user-submitted notifications that a link or site was a fake news site. Sounds great, as aggregating feedback has worked quite well in other arenas. For this, however, it was doomed from the start. The purpose of fake news sites is, after all, to fool people, and fooled people are obviously not reporting the links as fake. Even when a reader manages to determine eventually that a link was a fake news post at a later time, perhaps after sharing it and having comments proving it false, how many of those people then take steps to report the link? Not enough, clearly, as the fake news scourge marches on.\nAnother layer of the problem appears to be the faith and trust the general public puts into some famous people they are following, who have also been fooled with startling regularity.\nTake D.L. Hughley, for example. The comedian, whose page is liked by more than 1.7 million people, showed up twice in the Huzlers logs. One fictitious Huzlers story he posted, about Magic Johnson donating blood, garnered more than 10,000 shares from his page. Hughley, who did not respond to BuzzFeed News’ request for comment, also shared four National Report links in 2015.\nRadio stations also frequently post fake news. The Florida-based 93XFM was one of a number of radio stations BuzzFeed News discovered sharing Huzlers posts in 2015. Asked about one April post linking to a Huzlers story about a woman smoking PCP and chewing off her boyfriend’s penis, a 93XFM DJ named Sadie explained that fact-checking Facebook posts isn’t exactly a high priority.\nSo, it’s not the dark and ever-dangerous Alt-Right that is to blame for fake news, but celebrities and Facebook itself. Moreover, Facebook isn’t even reliable when it comes to reporting its own internal metrics to advertisers, as it has been\ncaught exaggerating its own traffic numbers\nfor the FOURTH time. Or, as Facebook would prefer you see it, accidentally making mistakes that just coincidentally happened to favor its own financial interests again for the fourth straight time.\nFacebook Inc. built a colossal business based on measuring something older advertising methods cannot: the granular details about people. Two months ago, the company copped to a flaw in that measurement. Then Facebook did it again. And again.\nOn Friday, Facebook revealed faulty metrics with Instant Articles, its mobile publishing system, the fourth disclosure of a measurement error since September. The admission sharpened calls for more independent organizations to monitor the performance of digital advertising. And some large firms that buy a lot of ads said they will more closely scrutinize their spending on the social networking giant and could shift marketing dollars elsewhere….\nIn September, Facebook shared its first measurement error: inflated viewership numbers for its video ads, a relatively new product. Two months later, the company disclosed additional metric errors along with new tools for third-party measurement companies, including ComScore and Nielsen, to track its system more closely.\nProblems persisted. Earlier this month, a report in Marketing Land, an industry publication, spotted a discrepancy between Facebook’s internal metrics on how articles where shared and public measurements. Facebook confirmed the error. “That shouldn’t happen,” said Brian Wieser, senior analyst, Pivotal Research Group. “If anyone was concerned that Facebook’s self-audit was not sufficient enough, they just proved it.”\nI don’t know why anyone is surprised that Facebook is trafficking heavily in false information on every side. Look at who runs it. Once a con artist, always a con artist. That’s been Zuckerberg’s motif from the start.",
  "tags": [
    "media",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-17T11:18:00+00:00"
}