{
  "url": "https://voxday.net/2016/12/26/the-iq-delta/",
  "scraped_at": "2025-12-18T02:12:04.650107",
  "title": "The IQ delta",
  "date_display": "December 26, 2016",
  "date_iso": "2016-12-26T11:52:00+00:00",
  "date_from_url": "2016-12-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It has been observed that the exceptionally intelligent think differently than those with conventional minds, even those which most people would consider to be highly intelligent. The difference is qualitative, not merely quantitative, in nature, and is akin to the difference between the genuinely mathematical mind and the non-mathematical mind. It is, to use one acquaintance’s example, the difference between the minds that can ascend the mountain by the winding path or by climbing straight up, and the mind that takes a helicopter ride directly to the peak.</p><p>I have been asked on more than a few occasions to explain what the qualitative differences are and to provide some perspective on how the different thought processes work. Now, obviously I am somewhat handicapped in explaining this because I have never not thought the way that I do now, but I do have the advantage of observing considerably more conventional thinkers than any conventional thinker, no matter how intelligent, has been able to observe non-conventional thinkers. However, upon beginning to read Francis Fukuyama’s <i>The End of History and the Last Man</i>, I believe I may finally able to articulate a few of these differences.</p><p>There are a few observations I have made over the years that are of limited utility in differentiating between what I think of as “very smart” vs “brilliant”. The terms themselves are meaningless and entirely subjective here, to put it in terms the quantitatively minded can accept, let’s call them VHIQ vs UHIQ for the time being, with the understanding that what applies to the VHIQ also applies to midwits and average minds, whereas what applies to UHIQ does not.</p><p>And FFS, if you’re reading this and think something might apply to you, please understand that is not a signal to decide that you are an unconventional thinker or exceptionally intelligent and share that fascinating observation with everyone. That very reaction is a pretty reliable indicator that you’re not. If you can’t fathom that, go ask a very tall person how excited he was this morning about discovering that he was tall.</p><p>Keep in mind that these are tendencies, not iron-clad laws. If they don’t make sense to you, don’t worry about it. On average, the responses will fall into six categories:</p><ol><li>Huh?</li><li>Hmm.</li><li>Vox just wants to talk about how smart he is again.</li><li>Vox is right/wrong because [x].</li><li>OT: Something off-topic because IMPORTANT. Link goes to the Drudge Report, which no one reads.</li><li>Hey, I can use this as an excuse to talk about ME!</li></ol><p>Regardless:<br/></p><ul><li>VHIQ inclines towards binary either/or thinking and taking sides. UHIQ inclines towards probabilistic thinking and balancing between contradictory possibilities.</li><li>VHIQ seeks understanding towards application or justification, UHIQ seeks understanding towards holistic understanding.</li><li>VHIQ refines the original thought of others, UHIQ synthesizes multiple original thoughts.</li><li>VHIQ rationalizes logical conclusions, UHIQ accepts logical conclusions. This is ironic because VHIQ considers itself to be highly logical, UHIQ considers itself to be investigative.</li><li>VHIQ recognizes the truths in the works of the great thinkers of the past and applies them. UHIQ recognizes the flaws in the thinking of the great thinkers of the past and explores them.</li><li>VHIQ usually spots logical flaws in an argument. UHIQ usually senses them.</li><li>VHIQ enjoys pedantry. UHIQ hates it. Both are capable of utilizing it at will.</li><li>VHIQ is uncomfortable with chaos and seeks to impose order on it, even if none exists. UHIQ is comfortable with chaos and seeks to recognize patterns in it.</li><li>VHIQ is spergey and egocentric. UHIQ is holistic and solipsistic.</li><li>VHIQ will die on a conceptual hill. UHIQ surrenders at the first reasonable show of force.</li><li>VHIQ attempts to rationalize its errors. UHIQ sees no point in hesitating to admit them.</li><li>VHIQ seeks to prove the correctness of its case. UHIQ doesn’t believe in the legitimacy of the jury.</li><li>VHIQ believes in the unique power of SCIENCE. UHIQ sees science as a conceptual framework of limited utility.</li><li>VHIQ seeks to rank and order things. UHIQ seeks to recognize and articulate concepts.</li><li>VHIQ is competitive. UHIQ doesn’t keep score.</li><li>VHIQ asks “how can this be used?” UHIQ asks “what does this mean?”</li></ul><p>This obviously doesn’t explain how a UHIQ thinker thinks per se, but it might provide some perspective concerning the qualitative differences between conventional high IQ thinkers and unconventional high IQ thinkers previously observed by others. For example, when I read something, even something about which I am inherently dubious, I do so in what is essentially an intellectual clean room. I am not merely open to being persuaded, I am, in the moment, fully believing whatever the author is saying.</p><p>However, upon encountering an obvious falsehood, non sequitur, bait-and-switch, or erroneous leap of logic, the clean room is muddied. The more mud that accumulates, and the more rapidly it is accumulated, the more certain that I am of the text containing errors. I don’t know exactly what they are yet, because I’m not reading critically, and I don’t retain more than a general sense of where on the page the mud is, but I know where to go and look for it, and perhaps more importantly, I know with almost 100 percent certainty that I will find <i>something </i>there. Every now and then I pick up a false reading, but that doesn’t happen more than 2-3 times per year.</p><p>I’ll demonstrate this in action in a longer post about Fukuyama’s book, specifically, the introduction, in a few hours. In the meantime:</p><blockquote><p> <i>The topics of genius and degeneration are only special cases of the more general problem involved in the evaluation of human capacities, namely the quantitative versus qualitative. There are those who insist that all differences are qualitative, and those who with equal conviction maintain that they are exclusively quantitative. The true answer is that they are both. General intelligence, for example, is undoubtedly quantitative in the sense that it consists of varying amounts of the same basic stuff (e.g., mental energy) which can be expressed by continuous numerical measures like intelligence Quotients or Mental-Age scores, and these are as real as any physical measurements are. But it is equally certain that our description of the difference between a genius and an average person by a statement to the effect that he has an IQ greater by this or that amount, does not describe the difference between them as completely or in the same way as when we say that a mile is much longer than an inch. The genius (as regards intellectual ability) not only has an IQ of say 50 points more than the average person, but in virtue of this difference acquires seemingly new aspects (potentialities) or characteristics. These seemingly new aspects or characteristics, in their totality, are what go to make up the “qualitative” difference between them [9, p. 134]</i>.</p><p>Wechsler is saying quite plainly that those with IQs above 150 are different in kind from those below that level. He is saying that they are a different kind of mind, a different kind of human being.</p></blockquote></div>",
  "content_text": "It has been observed that the exceptionally intelligent think differently than those with conventional minds, even those which most people would consider to be highly intelligent. The difference is qualitative, not merely quantitative, in nature, and is akin to the difference between the genuinely mathematical mind and the non-mathematical mind. It is, to use one acquaintance’s example, the difference between the minds that can ascend the mountain by the winding path or by climbing straight up, and the mind that takes a helicopter ride directly to the peak.\nI have been asked on more than a few occasions to explain what the qualitative differences are and to provide some perspective on how the different thought processes work. Now, obviously I am somewhat handicapped in explaining this because I have never not thought the way that I do now, but I do have the advantage of observing considerably more conventional thinkers than any conventional thinker, no matter how intelligent, has been able to observe non-conventional thinkers. However, upon beginning to read Francis Fukuyama’s\nThe End of History and the Last Man\n, I believe I may finally able to articulate a few of these differences.\nThere are a few observations I have made over the years that are of limited utility in differentiating between what I think of as “very smart” vs “brilliant”. The terms themselves are meaningless and entirely subjective here, to put it in terms the quantitatively minded can accept, let’s call them VHIQ vs UHIQ for the time being, with the understanding that what applies to the VHIQ also applies to midwits and average minds, whereas what applies to UHIQ does not.\nAnd FFS, if you’re reading this and think something might apply to you, please understand that is not a signal to decide that you are an unconventional thinker or exceptionally intelligent and share that fascinating observation with everyone. That very reaction is a pretty reliable indicator that you’re not. If you can’t fathom that, go ask a very tall person how excited he was this morning about discovering that he was tall.\nKeep in mind that these are tendencies, not iron-clad laws. If they don’t make sense to you, don’t worry about it. On average, the responses will fall into six categories:\nHuh?\nHmm.\nVox just wants to talk about how smart he is again.\nVox is right/wrong because [x].\nOT: Something off-topic because IMPORTANT. Link goes to the Drudge Report, which no one reads.\nHey, I can use this as an excuse to talk about ME!\nRegardless:\nVHIQ inclines towards binary either/or thinking and taking sides. UHIQ inclines towards probabilistic thinking and balancing between contradictory possibilities.\nVHIQ seeks understanding towards application or justification, UHIQ seeks understanding towards holistic understanding.\nVHIQ refines the original thought of others, UHIQ synthesizes multiple original thoughts.\nVHIQ rationalizes logical conclusions, UHIQ accepts logical conclusions. This is ironic because VHIQ considers itself to be highly logical, UHIQ considers itself to be investigative.\nVHIQ recognizes the truths in the works of the great thinkers of the past and applies them. UHIQ recognizes the flaws in the thinking of the great thinkers of the past and explores them.\nVHIQ usually spots logical flaws in an argument. UHIQ usually senses them.\nVHIQ enjoys pedantry. UHIQ hates it. Both are capable of utilizing it at will.\nVHIQ is uncomfortable with chaos and seeks to impose order on it, even if none exists. UHIQ is comfortable with chaos and seeks to recognize patterns in it.\nVHIQ is spergey and egocentric. UHIQ is holistic and solipsistic.\nVHIQ will die on a conceptual hill. UHIQ surrenders at the first reasonable show of force.\nVHIQ attempts to rationalize its errors. UHIQ sees no point in hesitating to admit them.\nVHIQ seeks to prove the correctness of its case. UHIQ doesn’t believe in the legitimacy of the jury.\nVHIQ believes in the unique power of SCIENCE. UHIQ sees science as a conceptual framework of limited utility.\nVHIQ seeks to rank and order things. UHIQ seeks to recognize and articulate concepts.\nVHIQ is competitive. UHIQ doesn’t keep score.\nVHIQ asks “how can this be used?” UHIQ asks “what does this mean?”\nThis obviously doesn’t explain how a UHIQ thinker thinks per se, but it might provide some perspective concerning the qualitative differences between conventional high IQ thinkers and unconventional high IQ thinkers previously observed by others. For example, when I read something, even something about which I am inherently dubious, I do so in what is essentially an intellectual clean room. I am not merely open to being persuaded, I am, in the moment, fully believing whatever the author is saying.\nHowever, upon encountering an obvious falsehood, non sequitur, bait-and-switch, or erroneous leap of logic, the clean room is muddied. The more mud that accumulates, and the more rapidly it is accumulated, the more certain that I am of the text containing errors. I don’t know exactly what they are yet, because I’m not reading critically, and I don’t retain more than a general sense of where on the page the mud is, but I know where to go and look for it, and perhaps more importantly, I know with almost 100 percent certainty that I will find\nsomething\nthere. Every now and then I pick up a false reading, but that doesn’t happen more than 2-3 times per year.\nI’ll demonstrate this in action in a longer post about Fukuyama’s book, specifically, the introduction, in a few hours. In the meantime:\nThe topics of genius and degeneration are only special cases of the more general problem involved in the evaluation of human capacities, namely the quantitative versus qualitative. There are those who insist that all differences are qualitative, and those who with equal conviction maintain that they are exclusively quantitative. The true answer is that they are both. General intelligence, for example, is undoubtedly quantitative in the sense that it consists of varying amounts of the same basic stuff (e.g., mental energy) which can be expressed by continuous numerical measures like intelligence Quotients or Mental-Age scores, and these are as real as any physical measurements are. But it is equally certain that our description of the difference between a genius and an average person by a statement to the effect that he has an IQ greater by this or that amount, does not describe the difference between them as completely or in the same way as when we say that a mile is much longer than an inch. The genius (as regards intellectual ability) not only has an IQ of say 50 points more than the average person, but in virtue of this difference acquires seemingly new aspects (potentialities) or characteristics. These seemingly new aspects or characteristics, in their totality, are what go to make up the “qualitative” difference between them [9, p. 134]\n.\nWechsler is saying quite plainly that those with IQs above 150 are different in kind from those below that level. He is saying that they are a different kind of mind, a different kind of human being.",
  "tags": [
    "philosophy",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-26T11:52:00+00:00"
}