{
  "url": "https://voxday.net/2016/12/26/the-iq-delta-and-last-man/",
  "scraped_at": "2025-12-18T02:12:10.208760",
  "title": "The IQ delta and the Last Man",
  "date_display": "December 26, 2016",
  "date_iso": "2016-12-26T21:00:00+00:00",
  "date_from_url": "2016-12-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As I mentioned <a href=\"http://www.milobookclub.com/2016/12/26/the-iq-delta/\">in a previous post</a>, reading Francis Fukuyama’s <i>The End of History and the Last Man</i> helped me articulate the difference between the smart and the brilliant, or to use the terms that are less easily confused, the VHIQ and the UHIQ.</p><p>The Fukuyama text is in blockquotes, my observations are bullet-pointed.</p><p>From <i>By Way of an Introduction</i>:<br/></p><blockquote class=\"tr_bq\"><p> The distant origins of the present volume lie in an article entitled “The End of History?” which I wrote for the journal The National Interest in the summer of 1989. In it, I argued that a remarkable consensus concerning the legitimacy of liberal democracy as a system of government had emerged throughout the world over the past few years, as it conquered rival ideologies like hereditary monarchy, fascism, and most recently communism. More than that, however, I argued that liberal democracy may constitute the “end point of mankind’s ideological evolution” and the “final form of human government,” and as such constituted the “end of history.” That is, while earlier forms of government were characterized by grave defects and irrationalities that led to their eventual collapse, liberal democracy was arguably free from such fundamental internal contradictions. This was not to say that today’s stable democracies, like the United States, France, or Switzerland, were not without injustice or serious social problems. But these problems were ones of incomplete implementation of the twin principles of liberty and equality on which modern democracy is founded, rather than of ﬂaws in the principles themselves. While some present-day countries might fail to achieve stable liberal democracy, and others might lapse back into other, more primitive forms of rule like theocracy or military dictatorship, the ideal of liberal democracy could not be improved on.</p></blockquote><ul><li>Remarkable consensuses are reliably incorrect.</li><li>Liberal democracy absolutely does not constitute the end point of mankind’s ideological evolution or the final form of human government. </li><li>It would not be unreasonable to use “the end of history” to describe a genuine such end point and final form, given the Hegelian-Marxian context. Fukuyama is clearly using History in the progressive intellectual sense, not the prosaic sense. It’s actually a rather clever title in that regard.</li><li>It’s also a ludicrous and anti-historical idea, albeit one certain to prove seductive to men of influence for precisely the same reason that Keynesian economics and Ricardian trade theory have.</li></ul><p>After dealing with the midwit critics who have had trouble dealing with the idea of a History that is not wholly synonymous with history, he plants his flag; an act I suspect he has come to regret.</p><blockquote class=\"tr_bq\"><p> The present book is not a restatement of my original article, nor is it an effort to continue the discussion with that article’s many critics and commentators. Least of all is it an account of the end of the Cold War, or any other pressing topic in contemporary politics. While this book is informed by recent world events, its subject returns to a very old question: Whether, at the end of the twentieth century, it makes sense for us once again to speak of a coherent and directional History of mankind that will eventually lead the greater part of humanity to liberal democracy? The answer I arrive at is yes, for two separate reasons. One has to do with economics, and the other has to do with what is termed the “struggle for recognition.”</p></blockquote><ul><li>Fukuyama clearly declares that he believes in a specific, directional Marxian-style History which will eventually come to a predictable end. </li><li>Given the context of the article, Fukuyama is definitely declaring that liberal democracy constitutes the “end point of mankind’s ideological evolution” and the “final form of human government”.</li><li>He’s wrong. I don’t know his economic reasoning or his “struggle for recognition” yet, but I know that he is wrong and I know that I will be able to prove it. I can even disprove the first prt to my own satisfaction: given that he is not an economist, his economic argument must be entirely based on 1990s economic orthodoxy, which is already in tatters and was insufficient to support the philosophical case in the first place.</li></ul><p>And here is where the tendency towards binary, or at least limited, thinking on the part of the VHIQ betrays itself.</p><blockquote class=\"tr_bq\"><p> In the course of the original debate over the National Interest article, many people assumed that the possibility of the end of history revolved around the question of whether there were viable alternatives to liberal democracy visible in the world today. There was a great deal of controversy over such questions as whether communism was truly dead, whether religion or ultranationalism might make a comeback, and the like. But the deeper and more profound question concerns the goodness of liberal democracy itself, and not only whether it will succeed against its present-day rivals. Assuming that liberal democracy is, for the moment, safe from external enemies, could we assume that successful democratic societies could remain that way indefnitely? Or is liberal democracy prey to serious internal contradictions, contradictions so serious that they will eventually undermine it as a political system? There is no doubt that contemporary democracies face any number of serious problems, from drugs, homelessness, and crime to environmental damage and the frivolity of consumerism. But these problems are not obviously insoluble on the basis of liberal principles, nor so serious that they would necessarily lead to the collapse of society as a whole, as communism collapsed in the 1980s.</p></blockquote><ul><li>A prediction about the future obviously revolves around both currently viable alternatives as well as potentially viable alternatives that are not visible today.</li><li>The deeper and more profound question does not concern the goodness of liberal democracy, but rather the existence of self-destructive internal contradictions in liberal democracy. Systems fail due to their internal contradictions; communism failed because the impossibility of socialist calculation slowed economic growth vis-a-vis capitalism. SJWism always fails due to the impossibility of social justice convergence preventing the converged organization from performing its original function. Liberal democracy – or as it is more properly termed – limited democracy – fails for much the same reason that communism does; it creates perverse incentive systems.</li><li>No, we cannot assume that successful democratic societies could remain that way indefnitely.</li><li>Yes, liberal democracy is not only prey, it is prone to internal contradictions so serious that they will eventually undermine it as a political system. Forget eternity, this is <i>already </i>visible everywhere from California to Switzerland.</li><li>Yes, these problems these problems are obviously insoluble on the basis of liberal principles. Not only that, but they are so serious that they will necessarily either lead to the collapse of liberal democracy or the collapse of society as a whole.</li></ul><p>Keep in mind that these are my initial thoughts about the book by page xxi of the introduction. The clean room, as I have termed it, is already splattered with mud. Fukuyama is an erudite, thoughtful, intelligent and educated man. And yet, his enthusiasm for his potentially significant idea blinded him to its obvious flaws? This is the distinction between the VHIQ and the UHIQ. Compare this with SJWAL or Cuckservative, both of which are considerably more modest in scope.</p><p>How many <i>potential </i>errors can you find in either that even begin to compare with the obvious errors in this bestselling work of vast socio-political influence, which is so riddled with flaws that the author has, apparently, felt the need to blatantly lie about his original thesis?</p></div>",
  "content_text": "As I mentioned\nin a previous post\n, reading Francis Fukuyama’s\nThe End of History and the Last Man\nhelped me articulate the difference between the smart and the brilliant, or to use the terms that are less easily confused, the VHIQ and the UHIQ.\nThe Fukuyama text is in blockquotes, my observations are bullet-pointed.\nFrom\nBy Way of an Introduction\n:\nThe distant origins of the present volume lie in an article entitled “The End of History?” which I wrote for the journal The National Interest in the summer of 1989. In it, I argued that a remarkable consensus concerning the legitimacy of liberal democracy as a system of government had emerged throughout the world over the past few years, as it conquered rival ideologies like hereditary monarchy, fascism, and most recently communism. More than that, however, I argued that liberal democracy may constitute the “end point of mankind’s ideological evolution” and the “final form of human government,” and as such constituted the “end of history.” That is, while earlier forms of government were characterized by grave defects and irrationalities that led to their eventual collapse, liberal democracy was arguably free from such fundamental internal contradictions. This was not to say that today’s stable democracies, like the United States, France, or Switzerland, were not without injustice or serious social problems. But these problems were ones of incomplete implementation of the twin principles of liberty and equality on which modern democracy is founded, rather than of ﬂaws in the principles themselves. While some present-day countries might fail to achieve stable liberal democracy, and others might lapse back into other, more primitive forms of rule like theocracy or military dictatorship, the ideal of liberal democracy could not be improved on.\nRemarkable consensuses are reliably incorrect.\nLiberal democracy absolutely does not constitute the end point of mankind’s ideological evolution or the final form of human government.\nIt would not be unreasonable to use “the end of history” to describe a genuine such end point and final form, given the Hegelian-Marxian context. Fukuyama is clearly using History in the progressive intellectual sense, not the prosaic sense. It’s actually a rather clever title in that regard.\nIt’s also a ludicrous and anti-historical idea, albeit one certain to prove seductive to men of influence for precisely the same reason that Keynesian economics and Ricardian trade theory have.\nAfter dealing with the midwit critics who have had trouble dealing with the idea of a History that is not wholly synonymous with history, he plants his flag; an act I suspect he has come to regret.\nThe present book is not a restatement of my original article, nor is it an effort to continue the discussion with that article’s many critics and commentators. Least of all is it an account of the end of the Cold War, or any other pressing topic in contemporary politics. While this book is informed by recent world events, its subject returns to a very old question: Whether, at the end of the twentieth century, it makes sense for us once again to speak of a coherent and directional History of mankind that will eventually lead the greater part of humanity to liberal democracy? The answer I arrive at is yes, for two separate reasons. One has to do with economics, and the other has to do with what is termed the “struggle for recognition.”\nFukuyama clearly declares that he believes in a specific, directional Marxian-style History which will eventually come to a predictable end.\nGiven the context of the article, Fukuyama is definitely declaring that liberal democracy constitutes the “end point of mankind’s ideological evolution” and the “final form of human government”.\nHe’s wrong. I don’t know his economic reasoning or his “struggle for recognition” yet, but I know that he is wrong and I know that I will be able to prove it. I can even disprove the first prt to my own satisfaction: given that he is not an economist, his economic argument must be entirely based on 1990s economic orthodoxy, which is already in tatters and was insufficient to support the philosophical case in the first place.\nAnd here is where the tendency towards binary, or at least limited, thinking on the part of the VHIQ betrays itself.\nIn the course of the original debate over the National Interest article, many people assumed that the possibility of the end of history revolved around the question of whether there were viable alternatives to liberal democracy visible in the world today. There was a great deal of controversy over such questions as whether communism was truly dead, whether religion or ultranationalism might make a comeback, and the like. But the deeper and more profound question concerns the goodness of liberal democracy itself, and not only whether it will succeed against its present-day rivals. Assuming that liberal democracy is, for the moment, safe from external enemies, could we assume that successful democratic societies could remain that way indefnitely? Or is liberal democracy prey to serious internal contradictions, contradictions so serious that they will eventually undermine it as a political system? There is no doubt that contemporary democracies face any number of serious problems, from drugs, homelessness, and crime to environmental damage and the frivolity of consumerism. But these problems are not obviously insoluble on the basis of liberal principles, nor so serious that they would necessarily lead to the collapse of society as a whole, as communism collapsed in the 1980s.\nA prediction about the future obviously revolves around both currently viable alternatives as well as potentially viable alternatives that are not visible today.\nThe deeper and more profound question does not concern the goodness of liberal democracy, but rather the existence of self-destructive internal contradictions in liberal democracy. Systems fail due to their internal contradictions; communism failed because the impossibility of socialist calculation slowed economic growth vis-a-vis capitalism. SJWism always fails due to the impossibility of social justice convergence preventing the converged organization from performing its original function. Liberal democracy – or as it is more properly termed – limited democracy – fails for much the same reason that communism does; it creates perverse incentive systems.\nNo, we cannot assume that successful democratic societies could remain that way indefnitely.\nYes, liberal democracy is not only prey, it is prone to internal contradictions so serious that they will eventually undermine it as a political system. Forget eternity, this is\nalready\nvisible everywhere from California to Switzerland.\nYes, these problems these problems are obviously insoluble on the basis of liberal principles. Not only that, but they are so serious that they will necessarily either lead to the collapse of liberal democracy or the collapse of society as a whole.\nKeep in mind that these are my initial thoughts about the book by page xxi of the introduction. The clean room, as I have termed it, is already splattered with mud. Fukuyama is an erudite, thoughtful, intelligent and educated man. And yet, his enthusiasm for his potentially significant idea blinded him to its obvious flaws? This is the distinction between the VHIQ and the UHIQ. Compare this with SJWAL or Cuckservative, both of which are considerably more modest in scope.\nHow many\npotential\nerrors can you find in either that even begin to compare with the obvious errors in this bestselling work of vast socio-political influence, which is so riddled with flaws that the author has, apparently, felt the need to blatantly lie about his original thesis?",
  "tags": [
    "Book Review",
    "philosophy"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-26T21:00:00+00:00"
}