{
  "url": "https://voxday.net/2016/12/24/the-alt-right-is-future/",
  "scraped_at": "2025-12-18T02:11:55.840006",
  "title": "The Alt-Right is the future",
  "date_display": "December 24, 2016",
  "date_iso": "2016-12-24T23:27:00+00:00",
  "date_from_url": "2016-12-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>There is no hope in the Left. There is no hope in the conservative Right. <a href=\"http://www.nbcnews.com/news/world/france-s-national-front-finds-support-among-millennials-n697681\">There is only one place where there is genuine hope</a> for the future of the West, and that is by placing one’s trust in God first and Nation second:</p><blockquote><p> Sébastien Faustini’s decision to skip the firework display at the beach not only potentially saved his life — it steered his politics toward the far right. The soft-spoken 18-year-old stayed home with his cousin and watched the Bastille Day display on TV, instead of heading to the Nice promenade as they’d planned on July 14.</p><p>A truck was driven into the crowd that night, killing 86 people.</p><p>Sebastien Faustini at the National Front’s headquarters in Nice, France. Lauren Brigitte Chadwick<br> “We could have been there,” said Faustini, who is now forced to pass by the scene of attack daily on his way to university. “Every day that hits me.”</br></p><p>Three weeks ago, he joined France’s far-right National Front.</p><p>“Certain media organizations stigmatize members of the National Front calling them fascists, insults that have nothing to do with the party’s program,” Faustini told NBC News.</p><p>Faustini is far from alone. Many millennials are embracing the National Front — which boasts a founder who had been fined repeatedly for racism and anti-Semitism. They say recent terrorist attacks across Europe and high unemployment levels validate their personal views and the party’s anti-immigration stance.</p><p>“THE FAILURE OF THE RIGHT TO DO SOMETHING AND THE FAILURE OF THE LEFT TO CHANGE ANYTHING MAKES MARINE LE PEN THE PERSON WHO REPRESENTS CHANGE”</p><p>According to a report released by polling organization Odoxa on Dec. 16, the National Front is the political party with the most support among French people aged 18-34. Roughly one-in-five back it.</p></blockquote><p>Ignore the converged institutions and corrupt organizations. They are all irrelevant. Ignore those who falsely call themselves “Christians” and “Americans” and “Europeans”. They have no truth in them. God created the nations. He’s not going to allow them to be Babelized, no matter how determined the servants of the Prince of This World are to make themselves gods.</p><p>All we need is twelve. All we need is the Word.</p><p>When you are attacked and scorned and slandered for speaking the truth, by whom are you opposed? When you are hated by the world for speaking the truth, whom do you serve?</p></div>",
  "content_text": "There is no hope in the Left. There is no hope in the conservative Right.\nThere is only one place where there is genuine hope\nfor the future of the West, and that is by placing one’s trust in God first and Nation second:\nSébastien Faustini’s decision to skip the firework display at the beach not only potentially saved his life — it steered his politics toward the far right. The soft-spoken 18-year-old stayed home with his cousin and watched the Bastille Day display on TV, instead of heading to the Nice promenade as they’d planned on July 14.\nA truck was driven into the crowd that night, killing 86 people.\nSebastien Faustini at the National Front’s headquarters in Nice, France. Lauren Brigitte Chadwick\n“We could have been there,” said Faustini, who is now forced to pass by the scene of attack daily on his way to university. “Every day that hits me.”\nThree weeks ago, he joined France’s far-right National Front.\n“Certain media organizations stigmatize members of the National Front calling them fascists, insults that have nothing to do with the party’s program,” Faustini told NBC News.\nFaustini is far from alone. Many millennials are embracing the National Front — which boasts a founder who had been fined repeatedly for racism and anti-Semitism. They say recent terrorist attacks across Europe and high unemployment levels validate their personal views and the party’s anti-immigration stance.\n“THE FAILURE OF THE RIGHT TO DO SOMETHING AND THE FAILURE OF THE LEFT TO CHANGE ANYTHING MAKES MARINE LE PEN THE PERSON WHO REPRESENTS CHANGE”\nAccording to a report released by polling organization Odoxa on Dec. 16, the National Front is the political party with the most support among French people aged 18-34. Roughly one-in-five back it.\nIgnore the converged institutions and corrupt organizations. They are all irrelevant. Ignore those who falsely call themselves “Christians” and “Americans” and “Europeans”. They have no truth in them. God created the nations. He’s not going to allow them to be Babelized, no matter how determined the servants of the Prince of This World are to make themselves gods.\nAll we need is twelve. All we need is the Word.\nWhen you are attacked and scorned and slandered for speaking the truth, by whom are you opposed? When you are hated by the world for speaking the truth, whom do you serve?",
  "tags": [
    "#AltRight",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-24T23:27:00+00:00"
}