{
  "url": "https://voxday.net/2016/12/11/the-fake-news-on-alt-rig/",
  "scraped_at": "2025-12-18T02:09:47.086337",
  "title": "All the news that’s fit to fake",
  "date_display": "December 11, 2016",
  "date_iso": "2016-12-11T02:26:00+00:00",
  "date_from_url": "2016-12-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I was interviewed for <a href=\"http://archive.is/D1lf6\">this piece on the Alt-Right</a> that appeared in the <i>New York Times</i>, but none of the answers I provided to the reporter, who is referenced in the byline, were quoted in the article. Read it and you’ll probably be able to figure out why his questions and my answers were omitted easily enough.</p><p>As usual, I’m only posting my answers here, as I did not request permission to quote the reporter’s questions.</p><ul><li>The Alt-Right is the rational response to the failure of American conservatism to conserve anything and the inability of libertarianism to promote liberty, as well as the descent of American liberalism into multiculturalism, social justice, and diversity. What I like about the Alt-Right is that it offers Western civilization a chance of survival that it will otherwise lack.</li><li>The Alt-Right is important because it is the only current political philosophy that is in harmony with science, history, and reality as we currently observe it.</li><li>It is neither intrinsically racist nor intrinsically white. It’s certainly not white supremacist; the desire of the white Alt-Right to preserve their European nations is no more “supremacist” than the desire of Israelis to preserve their Jewish nation or the desire of the Japanese to preserve their Japanese nation. Regardless of what you think of nationalism, nationalism is neither racism nor white supremacy. The fact that there are Alt-Right supporters who speak 18 different languages, from Afrikaans to Hebrew, should suffice to demonstrate the absurdity of the Alt-Right being nothing more than racist white supremacists.</li><li>There are observably two different branches of the Alt-Right, plus a pool of Alt-Right-leaning conservatives. I describe these as the Alt-White, the Alt-West, and the Alt-Light. They all share the same goal of preserving Western Civilization and the European nations, but whereas the Alt-West tends to place more emphasis on Christianity and the Graeco-Roman legacy, the Alt-White tends to focus more on the European nations. The Alt-Light are those who are still in the process of making the transition from conservatism, libertarianism, and even liberalism to open support of the Alt-Right, as defined by the 16 Points. </li><li>I am of the Alt-West branch. I am neither a leader nor a figurehead of the Alt-Right, I’m merely an armchair commentator who happens to have made the philosophical transition from libertarianism to the Alt-Right.</li><li>Since I am an American Indian, this is obviously a false narrative. Nor do we merely <i>present </i>ourselves as more intellectual; one of the reasons our critics are so desperate to keep us out of the public discourse is because our ideas are more firmly grounded in science, logic, and history than theirs, and our intellectuals are observably more intelligent than theirs. To attempt to boil down the entire Alt-Right philosophy to nothing more than rebranded racism is ludicrously stupid. This should be obvious, since rebranded racism cannot explain why so many conservatives are gravitating towards the Alt-Right.</li><li>The Ku Klux Klan is an irrelevant and outdated American organization based on race. The Alt-Right is an increasingly popular, increasingly relevant global phenomenon based on nationalism.</li><li>Because the Alt-Right were among Donald Trump’s earliest and most enthusiastic supporters. Donald Trump was the only candidate, in either major party, whose policies were even relevant to the serious challenges now facing America and other Western nations. The fact that many Alt-Right individuals not only expected Donald Trump to win, but publicly predicted it very early on, is one of many indicators that the Alt-Right political philosophy is the only intellectually viable one in American politics today.</li></ul><div> It is informative that even the <i>New York Times</i> feels it is necessary to resort to quoting non-entities, extremists, and people who explicitly disavow the Alt-Right label rather than those who openly embrace it in order to make what passes for their case. They do so because they have no effective response to us. They have no ability, no capacity, to even begin to engage in discourse with the greater part of the Alt-Right, because their perspective has been rendered outdated and irrelevant by events.<p><b>The <i>New York Times</i>: All the news that’s fit to fake!</b></p><p>Even the subtitle contains an outright lie: <i>“A movement of many factions is trying to change its image now that its profile has risen, but its message — one of racial separation and supremacy — is unchanged.”</i></p><p>Racial separation is not supremacy. Are we Indians Red Supremacists because we insist on keeping our reservations? The constant conflation of separaration with supremacy by the Fake News is completely and shamelessly deceitful. That’s why they can’t quote me. To do so will explode their false narrative and demonstrate its intrinsic dishonesty.</p></div></div>",
  "content_text": "I was interviewed for\nthis piece on the Alt-Right\nthat appeared in the\nNew York Times\n, but none of the answers I provided to the reporter, who is referenced in the byline, were quoted in the article. Read it and you’ll probably be able to figure out why his questions and my answers were omitted easily enough.\nAs usual, I’m only posting my answers here, as I did not request permission to quote the reporter’s questions.\nThe Alt-Right is the rational response to the failure of American conservatism to conserve anything and the inability of libertarianism to promote liberty, as well as the descent of American liberalism into multiculturalism, social justice, and diversity. What I like about the Alt-Right is that it offers Western civilization a chance of survival that it will otherwise lack.\nThe Alt-Right is important because it is the only current political philosophy that is in harmony with science, history, and reality as we currently observe it.\nIt is neither intrinsically racist nor intrinsically white. It’s certainly not white supremacist; the desire of the white Alt-Right to preserve their European nations is no more “supremacist” than the desire of Israelis to preserve their Jewish nation or the desire of the Japanese to preserve their Japanese nation. Regardless of what you think of nationalism, nationalism is neither racism nor white supremacy. The fact that there are Alt-Right supporters who speak 18 different languages, from Afrikaans to Hebrew, should suffice to demonstrate the absurdity of the Alt-Right being nothing more than racist white supremacists.\nThere are observably two different branches of the Alt-Right, plus a pool of Alt-Right-leaning conservatives. I describe these as the Alt-White, the Alt-West, and the Alt-Light. They all share the same goal of preserving Western Civilization and the European nations, but whereas the Alt-West tends to place more emphasis on Christianity and the Graeco-Roman legacy, the Alt-White tends to focus more on the European nations. The Alt-Light are those who are still in the process of making the transition from conservatism, libertarianism, and even liberalism to open support of the Alt-Right, as defined by the 16 Points.\nI am of the Alt-West branch. I am neither a leader nor a figurehead of the Alt-Right, I’m merely an armchair commentator who happens to have made the philosophical transition from libertarianism to the Alt-Right.\nSince I am an American Indian, this is obviously a false narrative. Nor do we merely\npresent\nourselves as more intellectual; one of the reasons our critics are so desperate to keep us out of the public discourse is because our ideas are more firmly grounded in science, logic, and history than theirs, and our intellectuals are observably more intelligent than theirs. To attempt to boil down the entire Alt-Right philosophy to nothing more than rebranded racism is ludicrously stupid. This should be obvious, since rebranded racism cannot explain why so many conservatives are gravitating towards the Alt-Right.\nThe Ku Klux Klan is an irrelevant and outdated American organization based on race. The Alt-Right is an increasingly popular, increasingly relevant global phenomenon based on nationalism.\nBecause the Alt-Right were among Donald Trump’s earliest and most enthusiastic supporters. Donald Trump was the only candidate, in either major party, whose policies were even relevant to the serious challenges now facing America and other Western nations. The fact that many Alt-Right individuals not only expected Donald Trump to win, but publicly predicted it very early on, is one of many indicators that the Alt-Right political philosophy is the only intellectually viable one in American politics today.\nIt is informative that even the\nNew York Times\nfeels it is necessary to resort to quoting non-entities, extremists, and people who explicitly disavow the Alt-Right label rather than those who openly embrace it in order to make what passes for their case. They do so because they have no effective response to us. They have no ability, no capacity, to even begin to engage in discourse with the greater part of the Alt-Right, because their perspective has been rendered outdated and irrelevant by events.\nThe\nNew York Times\n: All the news that’s fit to fake!\nEven the subtitle contains an outright lie:\n“A movement of many factions is trying to change its image now that its profile has risen, but its message — one of racial separation and supremacy — is unchanged.”\nRacial separation is not supremacy. Are we Indians Red Supremacists because we insist on keeping our reservations? The constant conflation of separaration with supremacy by the Fake News is completely and shamelessly deceitful. That’s why they can’t quote me. To do so will explode their false narrative and demonstrate its intrinsic dishonesty.",
  "tags": [
    "#AltRight",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-11T02:26:00+00:00"
}