{
  "url": "https://voxday.net/2016/12/17/the-bright-side-of-narcissis/",
  "scraped_at": "2025-12-18T02:10:47.733267",
  "title": "The bright side of narcissism",
  "date_display": "December 17, 2016",
  "date_iso": "2016-12-17T13:00:00+00:00",
  "date_from_url": "2016-12-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Anonymous Conservative <a href=\"http://www.anonymousconservative.com/blog/book-review-the-nine-laws-by-ivan-throne/\">reviews <i>The Nine Laws</i></a> by Ivan Throne:</p><blockquote><p> I recently finished <i>The Nine Laws</i> by Ivan Throne of DarkTriadMan.com, the new Castalia House release. The book is basically like <i>A Book of Five Rings</i>, or perhaps more so, the <i>Art of War</i>, a little more organized and spread broadly to cover the way of approaching life in its entirety. It is also infused with Ninjutsu lessons in mindset, philosophy, and strategy which the author has acquired in his study of that art. That is all overlaid on an analysis of the Dark Triad Traits, and the specific advantages which aspects of those traits can contribute to success in endeavors, if used properly. In short, I think it is among the best mindset/strategy books out there, and I expect that there will be a lot of copies of <i>Art of War </i>and <i>Five Rings</i> throughout the world finding a bold new title sharing their space on the bookshelves of the world….</p><p>To be clear, the book is not advocating for the dark triads traits broadly. As an example, it encourages the aspects of narcissism which lead to success – the belief in self, the grand visions it produces, the fearlessly plunging into endeavors as if failure is impossible. Those are all traits of the narcissist which explain why you see so many narcissists attain high positions in life. They expect success, and plunge into ridiculous endeavors as if it is to be expected.</p><p>But not all narcissists succeed, and those who fail due to their malady fail badly. He examines why this is, and concludes correctly, in my opinion, that the reason is delusion. Narcissists, just as their malady drives them forward relentlessly, and fearlessly, also suffer from a detachment from reality which leads them to misjudge their abilities and expect success to just happen. He encourages you to develop the former traits of plunging forward fearlessly into grand visions, while maintaining a grasp of reality and an ability to see where failure may arise so you may enjoy the benefits of the narcissist’s grandiose vision, without the detriments of being unable to effectively plot courses.</p><p>Similarly, sociopaths enjoy freedom from the moral rules which constrain others. But their ignorance of them is reflex, and uncontrolled. That leads them to stumble as often as they ascend. He encourages a recognition of the fact that there are no rules, but tempers it with a recognition that ignorance of the rules may have consequences, and thus you must always be on the lookout for them.</p><p>Because the book is so deep, I cannot say how it will change your life. I’d need to post that review in a few years. But I can say there is a ton of wisdom in the book, and it is solid.</p></blockquote><p>This is an important review, because AC is the foremost observer of narcissism, sociopathy, and deranged minds in general on the Internet. <b><i><a href=\"http://amzn.to/2fwFlCH\">The Nine Laws</a></i></b> has been a surprisingly good seller for Castalia, and should easily break the 10,000-lifetime sales mark that serves as the unofficial “successful book” line in the mainstream publishing world now that the average U.S. nonfiction book is now selling less than 250 copies per year.</p><p>It may sound counterproductive to look to deranged minds for success strategies, but the fact of the matter is that those strategies are so effective that they allow even the delusional and the brain-damaged to succeed despite themselves. Therefore, it makes sense that a healthy mind utilizing the positive aspects of those strategies while rejecting the negative ones should be able to generate even more success for itself.</p></div>",
  "content_text": "Anonymous Conservative\nreviews\nThe Nine Laws\nby Ivan Throne:\nI recently finished\nThe Nine Laws\nby Ivan Throne of DarkTriadMan.com, the new Castalia House release. The book is basically like\nA Book of Five Rings\n, or perhaps more so, the\nArt of War\n, a little more organized and spread broadly to cover the way of approaching life in its entirety. It is also infused with Ninjutsu lessons in mindset, philosophy, and strategy which the author has acquired in his study of that art. That is all overlaid on an analysis of the Dark Triad Traits, and the specific advantages which aspects of those traits can contribute to success in endeavors, if used properly. In short, I think it is among the best mindset/strategy books out there, and I expect that there will be a lot of copies of\nArt of War\nand\nFive Rings\nthroughout the world finding a bold new title sharing their space on the bookshelves of the world….\nTo be clear, the book is not advocating for the dark triads traits broadly. As an example, it encourages the aspects of narcissism which lead to success – the belief in self, the grand visions it produces, the fearlessly plunging into endeavors as if failure is impossible. Those are all traits of the narcissist which explain why you see so many narcissists attain high positions in life. They expect success, and plunge into ridiculous endeavors as if it is to be expected.\nBut not all narcissists succeed, and those who fail due to their malady fail badly. He examines why this is, and concludes correctly, in my opinion, that the reason is delusion. Narcissists, just as their malady drives them forward relentlessly, and fearlessly, also suffer from a detachment from reality which leads them to misjudge their abilities and expect success to just happen. He encourages you to develop the former traits of plunging forward fearlessly into grand visions, while maintaining a grasp of reality and an ability to see where failure may arise so you may enjoy the benefits of the narcissist’s grandiose vision, without the detriments of being unable to effectively plot courses.\nSimilarly, sociopaths enjoy freedom from the moral rules which constrain others. But their ignorance of them is reflex, and uncontrolled. That leads them to stumble as often as they ascend. He encourages a recognition of the fact that there are no rules, but tempers it with a recognition that ignorance of the rules may have consequences, and thus you must always be on the lookout for them.\nBecause the book is so deep, I cannot say how it will change your life. I’d need to post that review in a few years. But I can say there is a ton of wisdom in the book, and it is solid.\nThis is an important review, because AC is the foremost observer of narcissism, sociopathy, and deranged minds in general on the Internet.\nThe Nine Laws\nhas been a surprisingly good seller for Castalia, and should easily break the 10,000-lifetime sales mark that serves as the unofficial “successful book” line in the mainstream publishing world now that the average U.S. nonfiction book is now selling less than 250 copies per year.\nIt may sound counterproductive to look to deranged minds for success strategies, but the fact of the matter is that those strategies are so effective that they allow even the delusional and the brain-damaged to succeed despite themselves. Therefore, it makes sense that a healthy mind utilizing the positive aspects of those strategies while rejecting the negative ones should be able to generate even more success for itself.",
  "tags": [
    "Book Review",
    "Castalia House"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-17T13:00:00+00:00"
}