{
  "url": "https://voxday.net/2016/12/02/this-guy-is-good/",
  "scraped_at": "2025-12-18T02:08:23.035441",
  "title": "This guy is GOOD",
  "date_display": "December 2, 2016",
  "date_iso": "2016-12-02T19:19:00+00:00",
  "date_from_url": "2016-12-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not hard to understand why the God-Emperor Ascendant was so impressed by Gen. Mattis. Speaking as a game designer, which involves thinking through things in a way few people ever have to do, I can say this is an indication of man who takes the time to be certain he really, really <i>knows </i>his stuff. The mind behind <a href=\"http://thefederalist.com/2016/12/02/served-james-mattis-heres-learned/\">this level of detailed preparation and coaching</a> can only be described in the vernacular as Belichickian:</p><blockquote><p> First Marine Division was holding their first ROC Drill, the rehearsal of concept of what we were about to do. I had never seen a walk-through like this before. Marines had spent days building an enormous reproduction of southern Iraq in a bowl formed by a huge, semicircular sand dune. Each road, each river, each canal, each oil field was built to scale and even in proper color (water was blue dye poured into a sand ditch, and so on.)</p><p>Each Marine unit wore football jerseys in different colors, and with proper numbers. First Battalion, Fifth Marines, known as one-fifth, wore blue jerseys with “15” on the back, and other units were similarly identified. Principal staff from those units stood on the “border” drawn in the sand. About 300 officers stood and sat on the dune above. It was the perfect way to visualize what was about to happen.</p><p>General Mattis stood up and took a handheld microphone. Without referencing a single piece of paper, he discussed what each unit would do and in what sequence, and outlined his end state for each phase of the early war. He spoke for nearly 30 minutes, and his complete mastery of every nuance of the battle forthcoming was truly impressive.</p><p>A narrator then took over and picked up the narrative, the rest of the first week of the early war in sequence. As he described each movement, the officers from that unit walked to the proper place on their terrain model, and by the end of an hour the colored jerseys were spread over nearly a football field’s worth of sand. What a show.</p><p>At the end of the drill, questions were answered and then Mattis dismissed everyone. No messing around with this guy. Mike Murdoch, one of the British company commanders, leaned over to me, his eyes wide. “Mate, are all your generals that good?”</p><p>I looked at him.</p><p>“No. He is the best we have.”</p></blockquote><p>As I’ve repeatedly observed about the God-Emperor Ascendant, when he says he is going to get the best people, he isn’t blowing smoke or pontificating. He’s simply expressing his intentions. And if those he hires subsequently demonstrate they can’t get it done, he doesn’t hesitate to eject them and replace them with someone who can.</p></div>",
  "content_text": "It’s not hard to understand why the God-Emperor Ascendant was so impressed by Gen. Mattis. Speaking as a game designer, which involves thinking through things in a way few people ever have to do, I can say this is an indication of man who takes the time to be certain he really, really\nknows\nhis stuff. The mind behind\nthis level of detailed preparation and coaching\ncan only be described in the vernacular as Belichickian:\nFirst Marine Division was holding their first ROC Drill, the rehearsal of concept of what we were about to do. I had never seen a walk-through like this before. Marines had spent days building an enormous reproduction of southern Iraq in a bowl formed by a huge, semicircular sand dune. Each road, each river, each canal, each oil field was built to scale and even in proper color (water was blue dye poured into a sand ditch, and so on.)\nEach Marine unit wore football jerseys in different colors, and with proper numbers. First Battalion, Fifth Marines, known as one-fifth, wore blue jerseys with “15” on the back, and other units were similarly identified. Principal staff from those units stood on the “border” drawn in the sand. About 300 officers stood and sat on the dune above. It was the perfect way to visualize what was about to happen.\nGeneral Mattis stood up and took a handheld microphone. Without referencing a single piece of paper, he discussed what each unit would do and in what sequence, and outlined his end state for each phase of the early war. He spoke for nearly 30 minutes, and his complete mastery of every nuance of the battle forthcoming was truly impressive.\nA narrator then took over and picked up the narrative, the rest of the first week of the early war in sequence. As he described each movement, the officers from that unit walked to the proper place on their terrain model, and by the end of an hour the colored jerseys were spread over nearly a football field’s worth of sand. What a show.\nAt the end of the drill, questions were answered and then Mattis dismissed everyone. No messing around with this guy. Mike Murdoch, one of the British company commanders, leaned over to me, his eyes wide. “Mate, are all your generals that good?”\nI looked at him.\n“No. He is the best we have.”\nAs I’ve repeatedly observed about the God-Emperor Ascendant, when he says he is going to get the best people, he isn’t blowing smoke or pontificating. He’s simply expressing his intentions. And if those he hires subsequently demonstrate they can’t get it done, he doesn’t hesitate to eject them and replace them with someone who can.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-02T19:19:00+00:00"
}