{
  "url": "https://voxday.net/2016/12/01/this-is-what-zero-fucks-looks-like-2/",
  "scraped_at": "2025-12-18T02:08:03.870573",
  "title": "This is what Zero Fucks looks like",
  "date_display": "December 1, 2016",
  "date_iso": "2016-12-01T10:13:00+00:00",
  "date_from_url": "2016-12-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>John Scalzi ‏@scalzi</i><br> <i>Pro tip: if you write me telling me you’re tired of me writing about politics, expect a response along the line of “I don’t fucking care.”</i><br> <i><br/></i><br> <i>John Scalzi ‏@scalzi</i><br> <i>Pointed out to me a certain racist failure is still desperately trying to prove he’s more popular than I am. Well, with assholes, certainly.</i><br> <i><br/></i><br> <i>James S.A. Corey ‏@JamesSACorey </i><br> <i>How come you get all the cool enemies?</i><br> <i><br/></i><br> <i>John Scalzi ‏@scalzi</i><br> <i>Well, if by “cool” you mean “sad little bigoted manchildren, wailing disconsolately at the indifference of others”: just luck.</i><br> <i><br/></i><br> <i>Edward Trimnell ‏@EdwardTrimnell</i><br> <i>John Scalzi, studiously ignoring Vox Day. Lol.</i></br></br></br></br></br></br></br></br></br></br></br></br></br></p><p><i>MAGA Thermite ‏@SirThermite</i><br> <i>It’s telling how Gamma 0 isn’t content anymore with calling @voxday a racist, has to lie about him being a failure</i><i></i></br></p><p>Just a reminder that John Scalzi is <i>so successful</i>, and cares <i>so little</i> about what other people think, that he told Lightspeed Magazine in 2010 that Whatever was getting more than 2 million pageviews per month when it was actually getting 409,745. As it is written, <a href=\"http://amzn.to/1sBYA10\">SJWs always lie</a>. The first funny thing – and I would have spotted this if I’d been paying attention at the time – is that later that year, he reported 5,131,194 pageviews for the entire year. Be it lying, political analysis, or writing science fiction, he is a mediocrity.</p><p>It’s true that McRapey gives zero fucks, but about the truth, not about what you think of him. He cares <i>very much indeed</i> about that. And if you’re here reading this, you are probably already aware that John Scalzi says you’re an asshole. See: Third Law of SJW.</p><p>Speaking of the Laws of SJW, the second funny thing is that McRapey is <i>still </i>trying to preserve his narrative about my being a failure when Castalia House now sells more books than he does and November’s VP-only traffic was 3,446,312 pageviews, which happens to be 3.3 times more than Whatever’s very best month ever back in May 2012. Scalzi has been in decline ever since, as his site traffic and Google Trends and flat number of Twitter followers all demonstrate.</p><p>I’m not <i>trying </i>to prove I’m more popular than he is. I am conclusively proving it, using the very metric that he dishonestly used to create a false media narrative of his own popularity. Far from being desperate, I am distinctly amused at his complete inability to admit the observable reality; Gamma pride is truly a thing to behold. And once his attempt to rip off Isaac Asimov fails to take him to the next level, again, it’s back to the coal mines of the midlist for poor McRapey. His readers know the truth, of course, even as they rush to smooth his ruffled feathers.</p><div></div><p><i>Fledgist ‏@Fledgist</i><br> <i>What matters is not the roar of the world but the love of your family &amp; the affection of your friends. You’ve got that in spades.</i></br></p><p>Or, you know, maybe not.<br> <i><br/></i><br> <i>John Scalzi ‏@scalzi</i><br> <i>When retweeting things, try to be better than your racist aunt forwarding bullshit she found on Facebook. It’s easier than you think.</i></br></br></br></p></div>",
  "content_text": "John Scalzi ‏@scalzi\nPro tip: if you write me telling me you’re tired of me writing about politics, expect a response along the line of “I don’t fucking care.”\nJohn Scalzi ‏@scalzi\nPointed out to me a certain racist failure is still desperately trying to prove he’s more popular than I am. Well, with assholes, certainly.\nJames S.A. Corey ‏@JamesSACorey\nHow come you get all the cool enemies?\nJohn Scalzi ‏@scalzi\nWell, if by “cool” you mean “sad little bigoted manchildren, wailing disconsolately at the indifference of others”: just luck.\nEdward Trimnell ‏@EdwardTrimnell\nJohn Scalzi, studiously ignoring Vox Day. Lol.\nMAGA Thermite ‏@SirThermite\nIt’s telling how Gamma 0 isn’t content anymore with calling @voxday a racist, has to lie about him being a failure\nJust a reminder that John Scalzi is\nso successful\n, and cares\nso little\nabout what other people think, that he told Lightspeed Magazine in 2010 that Whatever was getting more than 2 million pageviews per month when it was actually getting 409,745. As it is written,\nSJWs always lie\n. The first funny thing – and I would have spotted this if I’d been paying attention at the time – is that later that year, he reported 5,131,194 pageviews for the entire year. Be it lying, political analysis, or writing science fiction, he is a mediocrity.\nIt’s true that McRapey gives zero fucks, but about the truth, not about what you think of him. He cares\nvery much indeed\nabout that. And if you’re here reading this, you are probably already aware that John Scalzi says you’re an asshole. See: Third Law of SJW.\nSpeaking of the Laws of SJW, the second funny thing is that McRapey is\nstill\ntrying to preserve his narrative about my being a failure when Castalia House now sells more books than he does and November’s VP-only traffic was 3,446,312 pageviews, which happens to be 3.3 times more than Whatever’s very best month ever back in May 2012. Scalzi has been in decline ever since, as his site traffic and Google Trends and flat number of Twitter followers all demonstrate.\nI’m not\ntrying\nto prove I’m more popular than he is. I am conclusively proving it, using the very metric that he dishonestly used to create a false media narrative of his own popularity. Far from being desperate, I am distinctly amused at his complete inability to admit the observable reality; Gamma pride is truly a thing to behold. And once his attempt to rip off Isaac Asimov fails to take him to the next level, again, it’s back to the coal mines of the midlist for poor McRapey. His readers know the truth, of course, even as they rush to smooth his ruffled feathers.\nFledgist ‏@Fledgist\nWhat matters is not the roar of the world but the love of your family & the affection of your friends. You’ve got that in spades.\nOr, you know, maybe not.\nJohn Scalzi ‏@scalzi\nWhen retweeting things, try to be better than your racist aunt forwarding bullshit she found on Facebook. It’s easier than you think.",
  "tags": [
    "McRapey"
  ],
  "categories": [],
  "sitemap_lastmod": "2016-12-01T10:13:00+00:00"
}