{
  "url": "https://voxday.net/2020/11/08/1600-and-counting/",
  "scraped_at": "2025-12-21T13:14:56.615117",
  "title": "1600 and counting",
  "date_display": "November 8, 2020",
  "date_iso": "2020-11-08T23:51:09+00:00",
  "date_from_url": "2020-11-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: right;\"><a href=\"https://social.infogalactic.com/images/posts/2421b11e-8b99-47a5-a30d-fbe8fcb41544/original-d2431d2cf6c5951a2b992db0a766f6ac.jpg?v=63772066318\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" data-original-height=\"800\" data-original-width=\"323\" decoding=\"async\" height=\"400\" loading=\"lazy\" src=\"https://social.infogalactic.com/images/posts/2421b11e-8b99-47a5-a30d-fbe8fcb41544/original-d2431d2cf6c5951a2b992db0a766f6ac.jpg?v=63772066318\" width=\"161\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"800\" data-original-width=\"323\" data-src=\"https://social.infogalactic.com/images/posts/2421b11e-8b99-47a5-a30d-fbe8fcb41544/original-d2431d2cf6c5951a2b992db0a766f6ac.jpg?v=63772066318\" decoding=\"async\" height=\"400\" loading=\"lazy\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20323%20800%22%3E%3C/svg%3E\" width=\"161\"/></a></div><p>You’ve seen what’s happening at YouTube. You’ve seen BitChute get taken down. As of this morning, UATV now features 1,600 videos and 1,653 hours of original audio/video entertainment and education on its own entirely independent platform. We’re also in the process of adding a new set of servers and increasing our maximum bandwidth by 400 percent. If you haven’t subscribed yet, what is stopping you? We’re only 500 subscribers away from an important milestone, so perhaps consider <a href=\"https://subscribe.unauthorized.tv/join\" rel=\"noopener noreferrer\" target=\"_blank\">giving a subscription to someone</a> for Christmas and help us hit our goal by the new year.</p><p>In other development news, the first three volumes of the Junior Classics will be shipping before Christmas, most likely this month. We’d hoped to get them out in October, but that didn’t work out. We will send out the digital versions of those three volumes at the same time the hardcovers ship, but not the leather versions. The leather will ship as a 10-volume set when all ten volumes are ready next year. At the same time they are shipped to the campaign backers, the first three volumes will be made available for sale through our usual book-selling channels.</p><p>I also would be remiss if I failed to mention that Razorfist’s new book, <i>The Long Moonlight</i>, is now available in paperback and hardcover <a href=\"https://www.amazon.com/Long-Moonlight-Razor-Fist/dp/9527303109/\" rel=\"noopener noreferrer\" target=\"_blank\">at Amazon</a>, and <a href=\"https://arkhavencomics.com/product/the-long-moonlight-audiobook/\" rel=\"noopener noreferrer\" target=\"_blank\">in audiobook+</a> at Arkhaven. Ignore the out-of-print message on the paperback, as that merely indicates that the title was in revision at the printers. And for Castalia subscribers, the November book will be <i>Corrosion </i>by Johan Kalsi.</p><p>On the comics front, we are holding off on sending out new publications until our new platform is ready for release, at which point we plan to drop a near-tsunami of content on everyone. The reason we are doing so will become obvious in retrospect, but rest assured that production continues apace. In not-unrelated news, we recently acquired the <i>arkhaven.com</i> domain. And finally, <i>Rebel’s Run</i> is going well, the script is complete, the core production team is in place, and we even have a possible candidate for Rebel.</p></div>",
  "content_text": "You’ve seen what’s happening at YouTube. You’ve seen BitChute get taken down. As of this morning, UATV now features 1,600 videos and 1,653 hours of original audio/video entertainment and education on its own entirely independent platform. We’re also in the process of adding a new set of servers and increasing our maximum bandwidth by 400 percent. If you haven’t subscribed yet, what is stopping you? We’re only 500 subscribers away from an important milestone, so perhaps consider\ngiving a subscription to someone\nfor Christmas and help us hit our goal by the new year.\nIn other development news, the first three volumes of the Junior Classics will be shipping before Christmas, most likely this month. We’d hoped to get them out in October, but that didn’t work out. We will send out the digital versions of those three volumes at the same time the hardcovers ship, but not the leather versions. The leather will ship as a 10-volume set when all ten volumes are ready next year. At the same time they are shipped to the campaign backers, the first three volumes will be made available for sale through our usual book-selling channels.\nI also would be remiss if I failed to mention that Razorfist’s new book,\nThe Long Moonlight\n, is now available in paperback and hardcover\nat Amazon\n, and\nin audiobook+\nat Arkhaven. Ignore the out-of-print message on the paperback, as that merely indicates that the title was in revision at the printers. And for Castalia subscribers, the November book will be\nCorrosion\nby Johan Kalsi.\nOn the comics front, we are holding off on sending out new publications until our new platform is ready for release, at which point we plan to drop a near-tsunami of content on everyone. The reason we are doing so will become obvious in retrospect, but rest assured that production continues apace. In not-unrelated news, we recently acquired the\narkhaven.com\ndomain. And finally,\nRebel’s Run\nis going well, the script is complete, the core production team is in place, and we even have a possible candidate for Rebel.",
  "tags": [
    "Unauthorized"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-11-08T23:51:09+00:00"
}