{
  "url": "https://voxday.net/2020/11/13/adios-comic-book-stores/",
  "scraped_at": "2025-12-21T22:24:11.631462",
  "title": "Adios, comic book stores",
  "date_display": "November 13, 2020",
  "date_iso": "2020-11-13T23:15:12+00:00",
  "date_from_url": "2020-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When we started Arkhaven Comics, we initially thought we would be offering a new form of distribution to the comic book shops. And while the first shops we spoke to were interested, it rapidly became apparent to me that they were not a viable distribution channel, or at least, would not be for long. The Dark Herald observes that it appears <a href=\"https://arkhavencomics.com/2020/11/13/dc-to-pull-out-of-comic-shops/\" rel=\"noopener noreferrer\" target=\"_blank\">DC has now reached the same conclusion</a>:</p><blockquote><p>A new article has just been posted by Bleeding Cool, more or less confirming what I had posited in my Red Honeymoon peace. </p><p>That DC is Getting out of the monthly pamphlet business. And that means abandoning the comic shops. </p><p>“That the Warner Bros firings of yet more DC Comics senior staffers, and the subsequent fallout across the company is part of a series of measures that will include a switch away from month print comic books towards digital comic book serialization of stories, then collected in trade paperback sized volumes, or larger, thicker, anthologies aimed at a general mass market, a bookstore market, the bookfair market, the likes of Amazon – and then comic book stores and the direct market almost as an afterthought.</p></blockquote><p>DC is reportedly offering its characters and properties for license, but at exorbitant rates that don’t make sense for anyone. No worries, Arkhaven is going to be introducing a <i>considerable </i>amount of new content in the new year. And yes, a certain war is going to be a particular point of emphasis; you’re not going to believe what The Legend has planned.</p></div>",
  "content_text": "When we started Arkhaven Comics, we initially thought we would be offering a new form of distribution to the comic book shops. And while the first shops we spoke to were interested, it rapidly became apparent to me that they were not a viable distribution channel, or at least, would not be for long. The Dark Herald observes that it appears\nDC has now reached the same conclusion\n:\nA new article has just been posted by Bleeding Cool, more or less confirming what I had posited in my Red Honeymoon peace.\nThat DC is Getting out of the monthly pamphlet business. And that means abandoning the comic shops.\n“That the Warner Bros firings of yet more DC Comics senior staffers, and the subsequent fallout across the company is part of a series of measures that will include a switch away from month print comic books towards digital comic book serialization of stories, then collected in trade paperback sized volumes, or larger, thicker, anthologies aimed at a general mass market, a bookstore market, the bookfair market, the likes of Amazon – and then comic book stores and the direct market almost as an afterthought.\nDC is reportedly offering its characters and properties for license, but at exorbitant rates that don’t make sense for anyone. No worries, Arkhaven is going to be introducing a\nconsiderable\namount of new content in the new year. And yes, a certain war is going to be a particular point of emphasis; you’re not going to believe what The Legend has planned.",
  "tags": [
    "declineandfall"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-11-13T23:15:12+00:00"
}