{
  "url": "https://voxday.net/2020/11/20/at-the-rubicon/",
  "scraped_at": "2025-12-21T22:25:09.113579",
  "title": "At the Rubicon",
  "date_display": "November 20, 2020",
  "date_iso": "2020-11-20T13:00:01+00:00",
  "date_from_url": "2020-11-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> Alexander Macris contemplates the President <a href=\"https://macris.substack.com/p/trump-at-the-rubicon\" rel=\"noopener noreferrer\" target=\"_blank\">at the banks of a certain river</a> of historical fame:</p><blockquote><p>In the closing days of 50 BC, the Roman Senate declared that Julius Caesar’s term as a provincial governor was finished. Roman law afforded its magistrates immunity to prosecution, but this immunity would end with Caesar’s term. As the leader of the <i>populares </i>faction, Caesar had many enemies among the elite <i>optimates</i>, and as soon as he left office, these enemies planned to bury him in litigation. Caesar knew he would lose everything: property, liberty, even his life.</p><p>Caesar decided it was better to fight for victory than accept certain defeat. In January 49 BC, he crossed the Rubicon River with his army, in violation of sacred Roman law, and begin a civil war. “Alea iacta est,” said Caesar: The die is cast.</p><p>In the closing days of 2020 AD, the American media has declared that Donald Trump’s term as president is finished. As the leader of the deplorables faction, Trump has many enemies among the elite irates, and as soon as he leaves office, these enemies plan to bury him in litigation. Bill Pascrell, the Chairman of the House Ways &amp; Means Subcommittee on Oversight, has officially called for the prosecution of President Trump for “government crimes” following his term in office. In his thirst for vengeance, Pascrell has made it clear there will be no Nixonian escape by pardon:</p><p><i>Donald Trump, along with his worst enablers, must be tried for their crimes against our nation and Constitution. Any further abuse of the sacred pardon power to shield criminals would itself be obstruction of justice, and any self-pardons would be illegal.</i></p><p>Like Caesar, Trump now must fight for victory or lose everything. Come January 2021, will Donald Trump decide to cast the die and cross the Rubicon? He might.</p><p>The same people who warned us that Trump is worse than Hitler will now scoff: “Donald Trump is no Caesar!” That’s true. Trump is in a much better position than Caesar was.</p><p>Unlike Caesar, Trump can cross the Rubicon legally. He need violate no sacred law. He has all of the legal power he needs to act and win. Congress has given it to him. All he needs to do is invoke the Insurrection Act.</p></blockquote><p>Read the whole thing. It is time for the God-Emperor to cross the Rubicon and put an end the facade that has permitted demons and literal devil-worshippers to rule over the American people. <i>Iacta alea, et transire Rubiconem!</i></p></div>",
  "content_text": "Alexander Macris contemplates the President\nat the banks of a certain river\nof historical fame:\nIn the closing days of 50 BC, the Roman Senate declared that Julius Caesar’s term as a provincial governor was finished. Roman law afforded its magistrates immunity to prosecution, but this immunity would end with Caesar’s term. As the leader of the\npopulares\nfaction, Caesar had many enemies among the elite\noptimates\n, and as soon as he left office, these enemies planned to bury him in litigation. Caesar knew he would lose everything: property, liberty, even his life.\nCaesar decided it was better to fight for victory than accept certain defeat. In January 49 BC, he crossed the Rubicon River with his army, in violation of sacred Roman law, and begin a civil war. “Alea iacta est,” said Caesar: The die is cast.\nIn the closing days of 2020 AD, the American media has declared that Donald Trump’s term as president is finished. As the leader of the deplorables faction, Trump has many enemies among the elite irates, and as soon as he leaves office, these enemies plan to bury him in litigation. Bill Pascrell, the Chairman of the House Ways & Means Subcommittee on Oversight, has officially called for the prosecution of President Trump for “government crimes” following his term in office. In his thirst for vengeance, Pascrell has made it clear there will be no Nixonian escape by pardon:\nDonald Trump, along with his worst enablers, must be tried for their crimes against our nation and Constitution. Any further abuse of the sacred pardon power to shield criminals would itself be obstruction of justice, and any self-pardons would be illegal.\nLike Caesar, Trump now must fight for victory or lose everything. Come January 2021, will Donald Trump decide to cast the die and cross the Rubicon? He might.\nThe same people who warned us that Trump is worse than Hitler will now scoff: “Donald Trump is no Caesar!” That’s true. Trump is in a much better position than Caesar was.\nUnlike Caesar, Trump can cross the Rubicon legally. He need violate no sacred law. He has all of the legal power he needs to act and win. Congress has given it to him. All he needs to do is invoke the Insurrection Act.\nRead the whole thing. It is time for the God-Emperor to cross the Rubicon and put an end the facade that has permitted demons and literal devil-worshippers to rule over the American people.\nIacta alea, et transire Rubiconem!",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-11-20T13:00:01+00:00"
}