{
  "url": "https://voxday.net/2020/11/26/day-23-of-45/",
  "scraped_at": "2025-12-21T22:26:14.601121",
  "title": "Day 23 of 45",
  "date_display": "November 26, 2020",
  "date_iso": "2020-11-26T23:49:07+00:00",
  "date_from_url": "2020-11-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> Don’t forget that the Executive Order on Imposing Certain Sanctions in the Event of Foreign Interference in a United States Election <a href=\"https://www.whitehouse.gov/presidential-actions/executive-order-imposing-certain-sanctions-event-foreign-interference-united-states-election/\">is currently in play</a>:</p><blockquote><p>Section 1. (a) Not later than 45 days after the conclusion of a United States election, the Director of National Intelligence, in consultation with the heads of any other appropriate executive departments and agencies (agencies), shall conduct an assessment of any information indicating that a foreign government, or any person acting as an agent of or on behalf of a foreign government, has acted with the intent or purpose of interfering in that election. The assessment shall identify, to the maximum extent ascertainable, the nature of any foreign interference and any methods employed to execute it, the persons involved, and the foreign government or governments that authorized, directed, sponsored, or supported it. The Director of National Intelligence shall deliver this assessment and appropriate supporting information to the President, the Secretary of State, the Secretary of the Treasury, the Secretary of Defense, the Attorney General, and the Secretary of Homeland Security.</p></blockquote><p>Based on the evidence being presented in the two Powell filings, it appears that an assessment will be delivered that will require the block of certain interests in property presently possessed by various individuals. Meanwhile, one thing that has largely passed uncommented in light of last Friday’s canceled hearing in PA is that Dominion Voting Systems has publicly stated that <a href=\"https://www.wfmz.com/news/area/pennsylvania/pa-lawmakers-criticizing-dominion-voting-systems-after-it-backs-out-of-hearing/article_6020da90-2ba1-11eb-8420-534f51eeb494.html\" rel=\"noopener noreferrer\" target=\"_blank\">it is “under litigation</a>“.</p><blockquote><p>A roundtable discussion with Dominion Voting Systems was canceled overnight. Dominion says it is under litigation and can not answer questions at this time.</p></blockquote><p>Interesting. By whom are they being sued? </p><p><b>UPDATE: </b>The conclusion below is from <a href=\"https://www.courtlistener.com/recap/gov.uscourts.mied.350905/gov.uscourts.mied.350905.1.15.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">the exhibit supporting paragraph 14</a>. This exhibit, which is testimonial evidence in the form of an affadavit from an expert witness, proves a lot of the information released prior to the court filing was accurate, right down to the identities of the Serbian programmers working for Dominion.</p><blockquote><p>In my professional opinion, this affidavit presents unambiguous evidence that Dominion Voter Systems and Edison Research have been accessible and were certainly compromised by rogue actors, such as Iran and China. By using servers and employees connected with rogue actors and hostile foreign influences combined with numerous easily discoverable leaked credentials, these organizations neglectfully allowed foreign adversaries to access data and intentionally provided access to their infrastructure in order to monitor and manipulate elections, including the most recent one in 2020. This represents a complete failure of their duty to provide basic cyber security. This is not a technological issue, but rather a governance and basic security issue: if it is not corrected, future elections in the United States and beyond will not be secure and citizens will not have confidence in the results. </p></blockquote><p><b>UPDATE: </b>The President <a href=\"https://edition.cnn.com/2020/11/26/politics/trump-administration-defense-policy-board/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">is excising the Deep State</a> from defense policy:</p><blockquote><p>Several high profile members of the Defense Policy Board were removed on Wednesday by the Trump administration, in yet another purge of longstanding foreign policy experts and national security establishment figures in the final days of the Trump era, according to three defense officials.</p><p>Members who were suddenly removed include former Secretaries of State Madeleine Albright and Henry Kissinger, former ranking member of the House Intelligence committee Jane Harman and former House Majority Leader Eric Cantor, two of the officials said.</p><p>The Defense Policy Board is an outside advisory group of former high profile national security officials who “provide the Secretary of Defense and the Deputy Secretary of Defense, independent, informed advice and opinions concerning matters of defense policy in response to specific tasks from the Secretary of Defense, the Deputy Secretary of Defense,” according to their website.</p><p>“As part of long-considered changes, we can confirm that several members of the Department’s Defense Policy Board have been removed. We are extremely grateful for their dedicated service, commitment, and contributions to our national security. Future announcements for new members of the board will be made soon,” the third official said.</p><p>The first two officials said the members removed also included former Chief of Naval Operations, retired Adm. Gary Roughead, former chief operating officer at the Pentagon Rudy De Leon and former Bush deputy national security adviser J.D. Crouch II. </p></blockquote><p>However, these are not the final days of the Trump era. That’s why he’s making the changes. He should invite William S. Lind as one of the replacements.</p></div>",
  "content_text": "Don’t forget that the Executive Order on Imposing Certain Sanctions in the Event of Foreign Interference in a United States Election\nis currently in play\n:\nSection 1. (a) Not later than 45 days after the conclusion of a United States election, the Director of National Intelligence, in consultation with the heads of any other appropriate executive departments and agencies (agencies), shall conduct an assessment of any information indicating that a foreign government, or any person acting as an agent of or on behalf of a foreign government, has acted with the intent or purpose of interfering in that election. The assessment shall identify, to the maximum extent ascertainable, the nature of any foreign interference and any methods employed to execute it, the persons involved, and the foreign government or governments that authorized, directed, sponsored, or supported it. The Director of National Intelligence shall deliver this assessment and appropriate supporting information to the President, the Secretary of State, the Secretary of the Treasury, the Secretary of Defense, the Attorney General, and the Secretary of Homeland Security.\nBased on the evidence being presented in the two Powell filings, it appears that an assessment will be delivered that will require the block of certain interests in property presently possessed by various individuals. Meanwhile, one thing that has largely passed uncommented in light of last Friday’s canceled hearing in PA is that Dominion Voting Systems has publicly stated that\nit is “under litigation\n“.\nA roundtable discussion with Dominion Voting Systems was canceled overnight. Dominion says it is under litigation and can not answer questions at this time.\nInteresting. By whom are they being sued?\nUPDATE:\nThe conclusion below is from\nthe exhibit supporting paragraph 14\n. This exhibit, which is testimonial evidence in the form of an affadavit from an expert witness, proves a lot of the information released prior to the court filing was accurate, right down to the identities of the Serbian programmers working for Dominion.\nIn my professional opinion, this affidavit presents unambiguous evidence that Dominion Voter Systems and Edison Research have been accessible and were certainly compromised by rogue actors, such as Iran and China. By using servers and employees connected with rogue actors and hostile foreign influences combined with numerous easily discoverable leaked credentials, these organizations neglectfully allowed foreign adversaries to access data and intentionally provided access to their infrastructure in order to monitor and manipulate elections, including the most recent one in 2020. This represents a complete failure of their duty to provide basic cyber security. This is not a technological issue, but rather a governance and basic security issue: if it is not corrected, future elections in the United States and beyond will not be secure and citizens will not have confidence in the results.\nUPDATE:\nThe President\nis excising the Deep State\nfrom defense policy:\nSeveral high profile members of the Defense Policy Board were removed on Wednesday by the Trump administration, in yet another purge of longstanding foreign policy experts and national security establishment figures in the final days of the Trump era, according to three defense officials.\nMembers who were suddenly removed include former Secretaries of State Madeleine Albright and Henry Kissinger, former ranking member of the House Intelligence committee Jane Harman and former House Majority Leader Eric Cantor, two of the officials said.\nThe Defense Policy Board is an outside advisory group of former high profile national security officials who “provide the Secretary of Defense and the Deputy Secretary of Defense, independent, informed advice and opinions concerning matters of defense policy in response to specific tasks from the Secretary of Defense, the Deputy Secretary of Defense,” according to their website.\n“As part of long-considered changes, we can confirm that several members of the Department’s Defense Policy Board have been removed. We are extremely grateful for their dedicated service, commitment, and contributions to our national security. Future announcements for new members of the board will be made soon,” the third official said.\nThe first two officials said the members removed also included former Chief of Naval Operations, retired Adm. Gary Roughead, former chief operating officer at the Pentagon Rudy De Leon and former Bush deputy national security adviser J.D. Crouch II.\nHowever, these are not the final days of the Trump era. That’s why he’s making the changes. He should invite William S. Lind as one of the replacements.",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-11-26T23:49:07+00:00"
}