{
  "url": "https://voxday.net/2020/11/08/dont-get-too-excited/",
  "scraped_at": "2025-12-21T13:14:54.811685",
  "title": "Don’t get too excited",
  "date_display": "November 8, 2020",
  "date_iso": "2020-11-08T23:46:11+00:00",
  "date_from_url": "2020-11-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Take an anonymous email for what it is worth, which is to say, precisely nothing. But in the interests of sharing what may, or may not, be happening at levels well above our cognizance or the mainstream media coverage, I am providing an excerpt of an email that I received from a European reader today.</p><blockquote><p>I am not claiming to have truly inside information, only nearness to certain banking, business, and diplomatic circles. I also do not claim to share your political views entirely, but I am sympathetic and a long-time reader, and this can at this point be published hardly anywhere else.</p><p>In short, Trump outplayed the left, on a global scale: he absolutely will become President and there will be an unprecedented exposure of corruption throughout the US, EU, and Russia, and a massive wipeout procedure of it all – along with a reset of national debt, which amounts to wiping out the most criminal banks, institutions, and political parties across the world.</p><p>The key to this is what’s happening in Europe at this very moment: As of yesterday, all borders on the continent have been sealed; militaries are engaged for “contact tracing” in England, France, Germany, Austria, and Switzerland; a friend of mine with both Swiss and EU passports is now stranded in Berlin because they are not even allowing departures from EU nations. Hotels have been ordered “not to take new reservations” until November 30. (Note: not “to close.”) There are massive, spooky-as-hell, fully empty “apartment complexes” (i.e. prison complexes – literal bars over the windows) already built in remote places in Europe. But these are not for normal people: they are housing built by and for the elements of corruption in Europe, at least, that will be exposed. I expect something similar to follow in America.</p><p>The Great Reset is underway but not quite, or not entirely, what Archbishop Vigano thought it was in the open letter posted by Q on October 30.</p></blockquote><p>Now, the two things I can confirm or deny is one, that it is still possible to make reservations at hotels in Milano and Paris through online booking sites. However, I don’t think the reader was referring to ALL hotels, but rather certain specific hotels, so that’s probably not a reasonable metric. And two, the European militaries are engaged in contact tracing and absolutely no one is out and about. I went out to visit a friend last night and despite it being Saturday night, it was like <i>Night of the Comet</i> even in a city downtown. There was literally no one on the road.</p><p>While I am optimistic that President Trump will serve a second term, this sounds far too much like the groundless NESARA nonsense that has been floating around conspiracy circles since the Reagan administration. But, at this point, given the incessant drumbeat of DESPAIR-DESPAIR-DESPAIR being pounded home by the media, a little hope is not a bad thing. So, let’s hope that this anonymous reader is absolutely correct about what the next month has in store for us.</p><p><b>UPDATE: </b>more observations from Europe</p><blockquote><p>While looking at flights to Krakow over a period of time, one day I noticed Ryanair cancelled the rest of its flights to Krakow for November and maybe even December if memory serves correctly. There was only one week of flights left uncancelled, so I took the last flight out yesterday.</p><p>While I was at BCN, I looked at the departures board. There were only 3 flights for the next 4 hours at the terminal I was at. The entire terminal was a ghost town and I’m not sure if it looked incredibly dark because most of the ceiling lights were turned off or because the light from almost all the closed shops was now gone.</p></blockquote><p>I can also confirm that flights scheduled for the end of November are being cancelled on the continent and in the UK. That doesn’t mean anything, in and of itself, but it is consistent with the reader’s predictions.</p></div>",
  "content_text": "Take an anonymous email for what it is worth, which is to say, precisely nothing. But in the interests of sharing what may, or may not, be happening at levels well above our cognizance or the mainstream media coverage, I am providing an excerpt of an email that I received from a European reader today.\nI am not claiming to have truly inside information, only nearness to certain banking, business, and diplomatic circles. I also do not claim to share your political views entirely, but I am sympathetic and a long-time reader, and this can at this point be published hardly anywhere else.\nIn short, Trump outplayed the left, on a global scale: he absolutely will become President and there will be an unprecedented exposure of corruption throughout the US, EU, and Russia, and a massive wipeout procedure of it all – along with a reset of national debt, which amounts to wiping out the most criminal banks, institutions, and political parties across the world.\nThe key to this is what’s happening in Europe at this very moment: As of yesterday, all borders on the continent have been sealed; militaries are engaged for “contact tracing” in England, France, Germany, Austria, and Switzerland; a friend of mine with both Swiss and EU passports is now stranded in Berlin because they are not even allowing departures from EU nations. Hotels have been ordered “not to take new reservations” until November 30. (Note: not “to close.”) There are massive, spooky-as-hell, fully empty “apartment complexes” (i.e. prison complexes – literal bars over the windows) already built in remote places in Europe. But these are not for normal people: they are housing built by and for the elements of corruption in Europe, at least, that will be exposed. I expect something similar to follow in America.\nThe Great Reset is underway but not quite, or not entirely, what Archbishop Vigano thought it was in the open letter posted by Q on October 30.\nNow, the two things I can confirm or deny is one, that it is still possible to make reservations at hotels in Milano and Paris through online booking sites. However, I don’t think the reader was referring to ALL hotels, but rather certain specific hotels, so that’s probably not a reasonable metric. And two, the European militaries are engaged in contact tracing and absolutely no one is out and about. I went out to visit a friend last night and despite it being Saturday night, it was like\nNight of the Comet\neven in a city downtown. There was literally no one on the road.\nWhile I am optimistic that President Trump will serve a second term, this sounds far too much like the groundless NESARA nonsense that has been floating around conspiracy circles since the Reagan administration. But, at this point, given the incessant drumbeat of DESPAIR-DESPAIR-DESPAIR being pounded home by the media, a little hope is not a bad thing. So, let’s hope that this anonymous reader is absolutely correct about what the next month has in store for us.\nUPDATE:\nmore observations from Europe\nWhile looking at flights to Krakow over a period of time, one day I noticed Ryanair cancelled the rest of its flights to Krakow for November and maybe even December if memory serves correctly. There was only one week of flights left uncancelled, so I took the last flight out yesterday.\nWhile I was at BCN, I looked at the departures board. There were only 3 flights for the next 4 hours at the terminal I was at. The entire terminal was a ghost town and I’m not sure if it looked incredibly dark because most of the ceiling lights were turned off or because the light from almost all the closed shops was now gone.\nI can also confirm that flights scheduled for the end of November are being cancelled on the continent and in the UK. That doesn’t mean anything, in and of itself, but it is consistent with the reader’s predictions.",
  "tags": [
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-11-08T23:46:11+00:00"
}