{
  "url": "https://voxday.net/2020/11/01/endgame-approaches/",
  "scraped_at": "2025-12-21T13:13:53.345305",
  "title": "Endgame approaches",
  "date_display": "November 1, 2020",
  "date_iso": "2020-11-01T13:00:01+00:00",
  "date_from_url": "2020-11-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We’re rapidly approaching the mother of all Q-proof tests. If Joe Biden wins, as predicted by all the polls and all the mainstream media, we’ll have to conclude that Q was, at best, a morale-boosting LARP. If, on the other hand, Donald Trump wins, even the most dedicated Q skeptics will have to admit that Qanon was more reliable than the entire mainstream media.</p><p>And if The Storm begins, everyone will be forced to acknowledge that Q was the real thing from the start.</p><p><b>Item: </b>The National Guard has deployed across 12 states.</p><p><b>Item:</b> “Are you ready to finish what we started? <i>‘Nothing can stop what is coming’</i> is not just a catch-phrase.” – Q</p><p><b>Item: </b>A Q post from October 2017 contains some intriguing dates. People assumed at the time that the reference was to 11.4.2017. However, in retrospect, it is clear that the year was never specified and “the next several days” does not refer to the time of the post, but the time of the predicted events.</p><p><i>My fellow Americans, over the course of the next several days you will undoubtedly realize that we are taking back our great country (the land of the free) from the evil tyrants that wish to do us harm and destroy the last remaining refuge of shining light. On POTUS’ order, we have initiated certain fail-safes that shall safeguard the public from the primary fallout which is slated to occur 11.3 upon the arrest announcement of Mr. Podesta (actionable 11.4). Confirmation (to the public) of what is occurring will then be revealed and will not be openly accepted. Public riots are being organized in serious numbers in an effort to prevent the arrest and capture of more senior public officials. On POTUS’ order, a state of temporary military control will be actioned and special ops carried out. False leaks have been made to retain several within the confines of the United States to prevent extradition and special operator necessity. Rest assured, the safety and well-being of every man, woman, and child of this country is being exhausted in full. However, the atmosphere within the country will unfortunately be divided as so many have fallen for the corrupt and evil narrative that has long been broadcast. We will be initiating the Emergency Broadcast System (EMS) during this time in an effort to provide a direct message (avoiding the fake news) to all citizens. Organizations and/or people that wish to do us harm during this time will be met with swift fury – certain laws have been pre-lifted to provide our great military the necessary authority to handle and conduct these operations (at home and abroad).</i></p><p><b>Item: </b>Boris Johnson announces month-long national lockdown of England.</p><p><b>Item: </b>France is now in a new national lockdown that will last at least a month.</p><p><b>Item:</b> Swiss authorities suggested that another nationwide lockdown was an inevitability.</p><p>I strongly suspect that the new European lockdowns, which are being instituted despite the fact that there has not been a significant increase in the number of new cases, the hospitals are not overloaded, the number of deaths is not increasing rapidly, and the infected patients are observably less seriously ill than they were during the previous lockdowns, are related to the coming events rather than to a second wave of the coronavirus.</p></div>",
  "content_text": "We’re rapidly approaching the mother of all Q-proof tests. If Joe Biden wins, as predicted by all the polls and all the mainstream media, we’ll have to conclude that Q was, at best, a morale-boosting LARP. If, on the other hand, Donald Trump wins, even the most dedicated Q skeptics will have to admit that Qanon was more reliable than the entire mainstream media.\nAnd if The Storm begins, everyone will be forced to acknowledge that Q was the real thing from the start.\nItem:\nThe National Guard has deployed across 12 states.\nItem:\n“Are you ready to finish what we started?\n‘Nothing can stop what is coming’\nis not just a catch-phrase.” – Q\nItem:\nA Q post from October 2017 contains some intriguing dates. People assumed at the time that the reference was to 11.4.2017. However, in retrospect, it is clear that the year was never specified and “the next several days” does not refer to the time of the post, but the time of the predicted events.\nMy fellow Americans, over the course of the next several days you will undoubtedly realize that we are taking back our great country (the land of the free) from the evil tyrants that wish to do us harm and destroy the last remaining refuge of shining light. On POTUS’ order, we have initiated certain fail-safes that shall safeguard the public from the primary fallout which is slated to occur 11.3 upon the arrest announcement of Mr. Podesta (actionable 11.4). Confirmation (to the public) of what is occurring will then be revealed and will not be openly accepted. Public riots are being organized in serious numbers in an effort to prevent the arrest and capture of more senior public officials. On POTUS’ order, a state of temporary military control will be actioned and special ops carried out. False leaks have been made to retain several within the confines of the United States to prevent extradition and special operator necessity. Rest assured, the safety and well-being of every man, woman, and child of this country is being exhausted in full. However, the atmosphere within the country will unfortunately be divided as so many have fallen for the corrupt and evil narrative that has long been broadcast. We will be initiating the Emergency Broadcast System (EMS) during this time in an effort to provide a direct message (avoiding the fake news) to all citizens. Organizations and/or people that wish to do us harm during this time will be met with swift fury – certain laws have been pre-lifted to provide our great military the necessary authority to handle and conduct these operations (at home and abroad).\nItem:\nBoris Johnson announces month-long national lockdown of England.\nItem:\nFrance is now in a new national lockdown that will last at least a month.\nItem:\nSwiss authorities suggested that another nationwide lockdown was an inevitability.\nI strongly suspect that the new European lockdowns, which are being instituted despite the fact that there has not been a significant increase in the number of new cases, the hospitals are not overloaded, the number of deaths is not increasing rapidly, and the infected patients are observably less seriously ill than they were during the previous lockdowns, are related to the coming events rather than to a second wave of the coronavirus.",
  "tags": [
    "healthcare"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-11-01T13:00:01+00:00"
}