{
  "url": "https://voxday.net/2020/11/19/every-city-and-every-suburb/",
  "scraped_at": "2025-12-21T22:24:59.496763",
  "title": "Every city and every suburb",
  "date_display": "November 19, 2020",
  "date_iso": "2020-11-19T13:00:00+00:00",
  "date_from_url": "2020-11-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> The two Republican Wayne County canvassers <a href=\"https://justthenews.com/politics-policy/elections/wayne-county-election-board-republicans-say-they-were-bullied-rescind\" rel=\"noopener noreferrer\" target=\"_blank\">have rescinded their votes</a> to certify the county elections after Michigan officials failed to keep their side of the deal and audit the ballots.</p><blockquote><p>In an extraordinary turnabout that foreshadows possible legal action, the two GOP members of Wayne County’s election board signed affidavits Wednesday night alleging they were bullied and misled into approving election results in Michigan’s largest metropolis and do not believe the votes should be certified until serious irregularities in Detroit votes are resolved.</p><p>The statements by Wayne County Board of Canvassers Chairwoman Monica Palmer and fellow GOP member William C. Hartmann rescinding their votes from a day earlier threw into question anew whether Michigan’s presidential vote currently favoring Democrat Joe Biden will be certified. They also signaled a possible legal confrontation ahead.</p><p>“I voted not to certify, and I still believe this vote should not be certified,” Hartmann said in his affidavits. “Until these questions are addressed, I remain opposed to certification of the Wayne County results.”</p><p>Added Palmer in her affidavit: “I rescind my prior vote to certify Wayne County elections.”</p><p>Their pronouncements come just 24 hours after a chaotic meeting in which the county’s election board initially failed to certify the Nov. 3 election results during a 2-2 deadlocked vote when both Palmer and Hartmann voted against certification. But after hours of contentious public comment and criticism — including Democratic allegations of racism and threats against their safety — the two GOP members struck a deal to certify the elections in return for a promise of a thorough audit.</p><p>Palmer and Hartmann said Wednesday they learned that state officials had reneged or would not honor the audit, leaving them no recourse but to oppose certification until more investigation could be performed.</p><p>It was not immediately unclear whether the Tuesday night compromise was binding or could be changed, or whether the two members’ decision to announce their rescinded votes would stop Michigan state officials from proceeding to name electors.</p></blockquote><p>Proving, once more, that you should never, ever, strike a deal with parties you know to be untrustworthy without requiring them to deliver their side of it first. And a Trump Recount Committee staffer openly states that <a href=\"https://www.youtube.com/watch?reload=9&amp;v=BnZWfTVV4fY&amp;feature=youtu.be\" rel=\"noopener noreferrer\" target=\"_blank\">the raid in Germany was real</a>, the data is being analyzed, and that serious civil unrest is expected once it becomes clear that the globalist color revolution in the USA has failed.</p><blockquote><p>Now that we have seized the servers for Dominion that were over in Germany and we’re starting to get some raw data off of that, the things that are gonna come out are gonna shake the globalists to their very core when President Trump is declared the winner of this election. What you saw last weekend in the streets, Trump supporters getting attacked in DC, that’s nothing. These people are coming for every city and every suburb, so be prepared because this is happening.</p></blockquote><p>As far as the time frame goes, Steve Bannon says <a href=\"https://www.infowars.com/posts/biden-is-done-hes-finished-bannon-predicts-two-weeks-until-defeat-of-the-globalists/\" rel=\"noopener noreferrer\" target=\"_blank\">it will be in two weeks</a>, which means we should have a clear picture as to what is going on by the end of the first week of December. There will probably be an increase in rioting and Antifa/BLM moving into place before any conclusive announcements are made, so keep an eye out for that. And if Bannon is correct, this is probably your last chance to top off your supplies, so if you’re in an area that could get sporty, make your final preparations now.</p></div>",
  "content_text": "The two Republican Wayne County canvassers\nhave rescinded their votes\nto certify the county elections after Michigan officials failed to keep their side of the deal and audit the ballots.\nIn an extraordinary turnabout that foreshadows possible legal action, the two GOP members of Wayne County’s election board signed affidavits Wednesday night alleging they were bullied and misled into approving election results in Michigan’s largest metropolis and do not believe the votes should be certified until serious irregularities in Detroit votes are resolved.\nThe statements by Wayne County Board of Canvassers Chairwoman Monica Palmer and fellow GOP member William C. Hartmann rescinding their votes from a day earlier threw into question anew whether Michigan’s presidential vote currently favoring Democrat Joe Biden will be certified. They also signaled a possible legal confrontation ahead.\n“I voted not to certify, and I still believe this vote should not be certified,” Hartmann said in his affidavits. “Until these questions are addressed, I remain opposed to certification of the Wayne County results.”\nAdded Palmer in her affidavit: “I rescind my prior vote to certify Wayne County elections.”\nTheir pronouncements come just 24 hours after a chaotic meeting in which the county’s election board initially failed to certify the Nov. 3 election results during a 2-2 deadlocked vote when both Palmer and Hartmann voted against certification. But after hours of contentious public comment and criticism — including Democratic allegations of racism and threats against their safety — the two GOP members struck a deal to certify the elections in return for a promise of a thorough audit.\nPalmer and Hartmann said Wednesday they learned that state officials had reneged or would not honor the audit, leaving them no recourse but to oppose certification until more investigation could be performed.\nIt was not immediately unclear whether the Tuesday night compromise was binding or could be changed, or whether the two members’ decision to announce their rescinded votes would stop Michigan state officials from proceeding to name electors.\nProving, once more, that you should never, ever, strike a deal with parties you know to be untrustworthy without requiring them to deliver their side of it first. And a Trump Recount Committee staffer openly states that\nthe raid in Germany was real\n, the data is being analyzed, and that serious civil unrest is expected once it becomes clear that the globalist color revolution in the USA has failed.\nNow that we have seized the servers for Dominion that were over in Germany and we’re starting to get some raw data off of that, the things that are gonna come out are gonna shake the globalists to their very core when President Trump is declared the winner of this election. What you saw last weekend in the streets, Trump supporters getting attacked in DC, that’s nothing. These people are coming for every city and every suburb, so be prepared because this is happening.\nAs far as the time frame goes, Steve Bannon says\nit will be in two weeks\n, which means we should have a clear picture as to what is going on by the end of the first week of December. There will probably be an increase in rioting and Antifa/BLM moving into place before any conclusive announcements are made, so keep an eye out for that. And if Bannon is correct, this is probably your last chance to top off your supplies, so if you’re in an area that could get sporty, make your final preparations now.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-11-19T13:00:00+00:00"
}