{
  "url": "https://voxday.net/2020/11/06/fuckery-is-afoot/",
  "scraped_at": "2025-12-21T13:14:37.828850",
  "title": "Fuckery is afoot",
  "date_display": "November 6, 2020",
  "date_iso": "2020-11-06T12:01:02+00:00",
  "date_from_url": "2020-11-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Larry Correia, bestselling novelist and erstwhile auditor, <a href=\"https://monsterhunternation.com/2020/11/05/the-2020-election-fuckery-is-afoot/\" rel=\"noopener noreferrer\" target=\"_blank\">notes the panoply of red flags</a> surrounding the fraudulent 2020 presidential election:</p><blockquote><p>Before I became a novelist I was an accountant. In auditing you look for red flags. That’s weird bits in the data that suggest something shifty is going on. You flag those weird things so you can delve into them further. One flag doesn’t necessarily mean there’s fraud. Weird things happen. A few flags mean stupidity or dishonesty. But a giant pile of red flags means that there’s bad shit going on and people should be in jail.</p><p>Except for in politics, where apparently all you have to do to dismiss a bunch of red flag is be a democrat and mumble something about “fascist voter suppression” then you can do all sorts of blatant crime and get off.</p><p>I’ve been trying to keep up with the firehose of information about what’s going on during this clusterfuck of an election. Last night I was on Facebook talking about the crazy high, 3rd world dictatorship level voter turnout levels in the deep blue areas of these swing states was very suspicious. Somebody gas lighted me about how “I’d have to do better than that”, so this was my quick reply, listing off the questionable bullshit I could think of off the top of my head:</p><ul style=\"text-align: left;\"><li>The massive turn out alone is a red flag.</li><li>But as for doing better…</li><li>The late night spikes that were enough to close all the Trump leads are a red flag.</li><li>The statistically impossible breakdown of the ratios of these vote dumps is a red flag.</li><li>The ratios of these dumps being far better than the percentages in the bluest of blue cities, even though the historical data does not match, red flag.</li><li>The ratios of these vote dumps favoring Biden more in these few battlegrounds than the ratio for the rest of the country (even the bluest of the blue) red flag.</li><li>Biden outperforming Obama among these few urban vote dumps, even though Trump picked up points in every demographic group in the rest of the country, red flag.</li><li>The poll observers being removed. Red flag.</li><li>The counters cheering as GOP observers are removed, red flag.</li><li>The fact that the dem observers outnumber the GOP observers 3 to 1, red flag (and basis of the first lawsuit filed)</li><li>The electioneering at the polls (on video), red flag.</li><li>The willful violation of the court order requiring the separation of ballots by type, red flag.</li><li>USPS whistleblower reporting to the Inspector General that today they were ordered to backdate ballots to yesterday, red flag.</li><li>The video of 2 AM deliveries of what appear to be boxes of ballots with no chain of custody or other observers right before the late night miracle spikes, red flag.</li></ul><p>Any of those things would be enough to trigger an audit in the normal world. This many flags and I’d be giggling in anticipation of catching some thieves. And it isn’t that I have to do better. I’m just an gen pop observer who happens to be a retired auditor with a finely tuned bullshit detector. This is going to the courts.</p></blockquote><p>He goes into more detail on several of the specifics at Monster Hunter Nation. Read <a href=\"https://monsterhunternation.com/2020/11/05/the-2020-election-fuckery-is-afoot/\" rel=\"noopener noreferrer\" target=\"_blank\">the whole thing</a> there. And as to why this unprecedented level of fraud has taken place, the answer is that <i>because there was a Trumpslide</i>. Donald Trump is on track to receive 10 percent more votes than he did to win the Presidency in 2016. Barack Obama was re-elected in 2012 with 5.2 percent <i>fewer </i>votes than he received in 2008. Bill Clinton was reelected in 1996 with 5.5 percent more votes than he received in 1992. </p><p>Donald Trump’s reelection was shaping up to become the biggest landslide since Reagan… which is why millions of fraudulent ballots <a href=\"https://is2.4chan.org/pol/1604655729837.png\" rel=\"noopener noreferrer\" target=\"_blank\">were produced</a> to try to provide the media with a means of overturning the election results.</p></div>",
  "content_text": "Larry Correia, bestselling novelist and erstwhile auditor,\nnotes the panoply of red flags\nsurrounding the fraudulent 2020 presidential election:\nBefore I became a novelist I was an accountant. In auditing you look for red flags. That’s weird bits in the data that suggest something shifty is going on. You flag those weird things so you can delve into them further. One flag doesn’t necessarily mean there’s fraud. Weird things happen. A few flags mean stupidity or dishonesty. But a giant pile of red flags means that there’s bad shit going on and people should be in jail.\nExcept for in politics, where apparently all you have to do to dismiss a bunch of red flag is be a democrat and mumble something about “fascist voter suppression” then you can do all sorts of blatant crime and get off.\nI’ve been trying to keep up with the firehose of information about what’s going on during this clusterfuck of an election. Last night I was on Facebook talking about the crazy high, 3rd world dictatorship level voter turnout levels in the deep blue areas of these swing states was very suspicious. Somebody gas lighted me about how “I’d have to do better than that”, so this was my quick reply, listing off the questionable bullshit I could think of off the top of my head:\nThe massive turn out alone is a red flag.\nBut as for doing better…\nThe late night spikes that were enough to close all the Trump leads are a red flag.\nThe statistically impossible breakdown of the ratios of these vote dumps is a red flag.\nThe ratios of these dumps being far better than the percentages in the bluest of blue cities, even though the historical data does not match, red flag.\nThe ratios of these vote dumps favoring Biden more in these few battlegrounds than the ratio for the rest of the country (even the bluest of the blue) red flag.\nBiden outperforming Obama among these few urban vote dumps, even though Trump picked up points in every demographic group in the rest of the country, red flag.\nThe poll observers being removed. Red flag.\nThe counters cheering as GOP observers are removed, red flag.\nThe fact that the dem observers outnumber the GOP observers 3 to 1, red flag (and basis of the first lawsuit filed)\nThe electioneering at the polls (on video), red flag.\nThe willful violation of the court order requiring the separation of ballots by type, red flag.\nUSPS whistleblower reporting to the Inspector General that today they were ordered to backdate ballots to yesterday, red flag.\nThe video of 2 AM deliveries of what appear to be boxes of ballots with no chain of custody or other observers right before the late night miracle spikes, red flag.\nAny of those things would be enough to trigger an audit in the normal world. This many flags and I’d be giggling in anticipation of catching some thieves. And it isn’t that I have to do better. I’m just an gen pop observer who happens to be a retired auditor with a finely tuned bullshit detector. This is going to the courts.\nHe goes into more detail on several of the specifics at Monster Hunter Nation. Read\nthe whole thing\nthere. And as to why this unprecedented level of fraud has taken place, the answer is that\nbecause there was a Trumpslide\n. Donald Trump is on track to receive 10 percent more votes than he did to win the Presidency in 2016. Barack Obama was re-elected in 2012 with 5.2 percent\nfewer\nvotes than he received in 2008. Bill Clinton was reelected in 1996 with 5.5 percent more votes than he received in 1992.\nDonald Trump’s reelection was shaping up to become the biggest landslide since Reagan… which is why millions of fraudulent ballots\nwere produced\nto try to provide the media with a means of overturning the election results.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-11-06T12:01:02+00:00"
}