{
  "url": "https://voxday.net/2020/11/22/innocent-about-the-abroad/",
  "scraped_at": "2025-12-21T22:25:30.349798",
  "title": "Innocent about the abroad",
  "date_display": "November 22, 2020",
  "date_iso": "2020-11-22T19:00:02+00:00",
  "date_from_url": "2020-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> Cerno is dubious <a href=\"https://twitter.com/Cernovich/status/1330544354642046983\" rel=\"noopener noreferrer\" target=\"_blank\">about American activities abroad</a>:</p><blockquote><p>Don’t know what to tell you folks. If you think the “US military” seized servers in Germany, a NATO ally, in what would be an attack on their sovereignty and an international incident… I just got nothing for you.</p></blockquote><p>I would have thought Mike had better connections in the US military. Rest assured that this sort of thing not only happens, it isn’t even particularly uncommon. First, there is no sovereignty issue in Germany, which is still technically an occupied nation as it has been since the end of WWII. Second, sovereignty issues don’t even slow down US military operations anywhere there are US bases. If the local governments are informed, it is always after the fact. Third, I would recommend Mike look up <a href=\"https://infogalactic.com/info/Operation_Gladio\" rel=\"noopener noreferrer\" target=\"_blank\">Operation Gladio</a> if he wants to better understand the full extent of the US military’s freedom of operation throughout Western Europe.</p><p>US forces have done an awful lot more, and an awful lot worse, in Europe than seize a server or two without causing any international incidents.</p><p>That doesn’t mean that this particular raid took place. Perhaps it did, perhaps it didn’t. But it is hardly unthinkable, and doesn’t even begin to compare with, for example, lethal US military operations in Pakistan and the Philippines. There is even <a href=\"https://www.cbs.com/shows/seal-team/\" rel=\"noopener noreferrer\" target=\"_blank\">a television show</a> about this sort of thing.</p><p>All that being said, it appears that the operation took place <a href=\"https://jonsnewplace.wordpress.com/2020/11/15/secret-germany-raid-reveals-cia-ties-to-us-election-fraud/\" rel=\"noopener noreferrer\" target=\"_blank\">with the permission</a> of the German government anyhow.</p><blockquote><p>In order to get access to that server and have it available for use in a legal manner they had to have the State Department work in tandem with the Department of Justice. They had to request that the government of Germany cooperate in allowing this seizure of this server. The appropriate documents required to affect that kind of seizure were put in place, signed off on, and it appears there was also US military support in this operation. The US military was not in the lead.</p></blockquote></div>",
  "content_text": "Cerno is dubious\nabout American activities abroad\n:\nDon’t know what to tell you folks. If you think the “US military” seized servers in Germany, a NATO ally, in what would be an attack on their sovereignty and an international incident… I just got nothing for you.\nI would have thought Mike had better connections in the US military. Rest assured that this sort of thing not only happens, it isn’t even particularly uncommon. First, there is no sovereignty issue in Germany, which is still technically an occupied nation as it has been since the end of WWII. Second, sovereignty issues don’t even slow down US military operations anywhere there are US bases. If the local governments are informed, it is always after the fact. Third, I would recommend Mike look up\nOperation Gladio\nif he wants to better understand the full extent of the US military’s freedom of operation throughout Western Europe.\nUS forces have done an awful lot more, and an awful lot worse, in Europe than seize a server or two without causing any international incidents.\nThat doesn’t mean that this particular raid took place. Perhaps it did, perhaps it didn’t. But it is hardly unthinkable, and doesn’t even begin to compare with, for example, lethal US military operations in Pakistan and the Philippines. There is even\na television show\nabout this sort of thing.\nAll that being said, it appears that the operation took place\nwith the permission\nof the German government anyhow.\nIn order to get access to that server and have it available for use in a legal manner they had to have the State Department work in tandem with the Department of Justice. They had to request that the government of Germany cooperate in allowing this seizure of this server. The appropriate documents required to affect that kind of seizure were put in place, signed off on, and it appears there was also US military support in this operation. The US military was not in the lead.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-11-22T19:00:02+00:00"
}