{
  "url": "https://voxday.net/2020/11/15/junior-classics-vols-1-3-2/",
  "scraped_at": "2025-12-21T22:24:24.443987",
  "title": "Junior Classics Vols. 1-3",
  "date_display": "November 15, 2020",
  "date_iso": "2020-11-15T18:19:32+00:00",
  "date_from_url": "2020-11-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://social.infogalactic.com/images/posts/025328ac-9cdb-461e-b4b5-67857ce1f6d9/original-7cfcc91222d2016ad525fc2f2a4fd453.jpg?v=63772580519\" style=\"margin-left: 1em; margin-right: 1em; text-align: center;\"><noscript><img border=\"0\" data-original-height=\"800\" data-original-width=\"510\" decoding=\"async\" height=\"400\" loading=\"lazy\" src=\"https://social.infogalactic.com/images/posts/025328ac-9cdb-461e-b4b5-67857ce1f6d9/original-7cfcc91222d2016ad525fc2f2a4fd453.jpg?v=63772580519\" width=\"255\"/></noscript><img border=\"0\" class=\"lazyload\" data-original-height=\"800\" data-original-width=\"510\" data-src=\"https://social.infogalactic.com/images/posts/025328ac-9cdb-461e-b4b5-67857ce1f6d9/original-7cfcc91222d2016ad525fc2f2a4fd453.jpg?v=63772580519\" decoding=\"async\" height=\"400\" loading=\"lazy\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20510%20800%22%3E%3C/svg%3E\" width=\"255\"/></a></div><p>ATTENTION JUNIOR CLASSICS BACKERS</p><p>As Volumes 1, 2, and 3 are being prepared for shipment out to the hardcover and digital backers the final week of November, it is now time to confirm your current shipping address on Indiegogo. Please go to <a href=\"https://www.indiegogo.com/projects/the-junior-classics#/\" rel=\"noopener noreferrer\" target=\"_blank\">the project page on Indiegogo</a> and check to confirm that the shipping address you have provided is current. If you have not provided your current shipping address, this is the time to do it. </p><p>This is a draft image of the cover for <i>Volume 1: Fairy Tales and Fables</i>. Each volume features original cover and spine images, illustrated in a style that is an homage to the 1958 edition. For those who are not already backers, preorders for the first three royal octavo editions will be available at Arkhaven later this week.</p><p><b>UPDATE:</b> Please use the “contact information” on Indiegogo approach to provide your current address. Because no shipping address was required from the beginning, it is not possible for some backers to add one now. So, it will have to do be done manually. If you cannot change your shipping address in the Indiegogo system, then please send your current shipping address THROUGH INDIEGOGO by sending a message to the campaign owner so that your backer number will be attached to it. Do NOT send your address via email, or post it in the comments here, or post it in your Indiegogo profile, or through any other mechanism.</p><p>These are the correct steps to follow after logging into your Indiegogo account:</p><ol style=\"text-align: left;\"><li>Main Menu</li><li>My Contributions</li><li>Underneath ‘Perks’ select ‘View details’</li><li>Look under Campaigns on the right hand tab and select ‘Contact’</li><li>Fill out the message form</li><li>Include Contribution ID and current shipping address.</li></ol></div>",
  "content_text": "ATTENTION JUNIOR CLASSICS BACKERS\nAs Volumes 1, 2, and 3 are being prepared for shipment out to the hardcover and digital backers the final week of November, it is now time to confirm your current shipping address on Indiegogo. Please go to\nthe project page on Indiegogo\nand check to confirm that the shipping address you have provided is current. If you have not provided your current shipping address, this is the time to do it.\nThis is a draft image of the cover for\nVolume 1: Fairy Tales and Fables\n. Each volume features original cover and spine images, illustrated in a style that is an homage to the 1958 edition. For those who are not already backers, preorders for the first three royal octavo editions will be available at Arkhaven later this week.\nUPDATE:\nPlease use the “contact information” on Indiegogo approach to provide your current address. Because no shipping address was required from the beginning, it is not possible for some backers to add one now. So, it will have to do be done manually. If you cannot change your shipping address in the Indiegogo system, then please send your current shipping address THROUGH INDIEGOGO by sending a message to the campaign owner so that your backer number will be attached to it. Do NOT send your address via email, or post it in the comments here, or post it in your Indiegogo profile, or through any other mechanism.\nThese are the correct steps to follow after logging into your Indiegogo account:\nMain Menu\nMy Contributions\nUnderneath ‘Perks’ select ‘View details’\nLook under Campaigns on the right hand tab and select ‘Contact’\nFill out the message form\nInclude Contribution ID and current shipping address.",
  "tags": [
    "books"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-11-15T18:19:32+00:00"
}