{
  "url": "https://voxday.net/2020/11/26/mailvox-an-analysis-of-the-powell-filing-in-ga/",
  "scraped_at": "2025-12-21T22:26:05.317963",
  "title": "Mailvox: an analysis of the Powell filing in GA",
  "date_display": "November 26, 2020",
  "date_iso": "2020-11-26T11:59:50+00:00",
  "date_from_url": "2020-11-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>An experienced attorney analyzes Sidney Powell’s legal filing in GA concerning the electoral fraud aided and abetted by GA politicians and election officials. The 104-page PDF complaint <a href=\"https://defendingtherepublic.org/wp-content/uploads/2020/11/COMPLAINT-CJ-PEARSON-V.-KEMP-11.25.2020.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">can be found here</a>. Note that she also filed <a href=\"www.courtlistener.com/recap/gov.uscourts.mied.350905/gov.uscourts.mied.350905.1.0.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">a lawsuit in MI</a>, which is not analyzed here.</i></p><p>I have been a practicing attorney for 25+ years. The last 15 years I have spent mainly federal court representing persons accused of crimes, so I am quite familiar with federal court, federal procedure and other matters. Here is my take on Ms. Powell’s complaint. I aim to be dispassionate, not because I do not care but because we should be honest. I am not going to smooth over issues just because I hope Ms. Powell wins.</p><p>My point is to give background and overview and to advise on what to watch in the future. I have tried to make this post generally neutral and informative. I could not locate exhibits, which are crucial, but they are cited many times in the complaint. So, here are my few observations as an attorney with decades’ in federal court:</p><p>1. In early October, 2020, a federal district judge in this same district (Northern District of Georgia) ruled after several years of litigation that the Dominion software used to monitor this election has substantial issues and it will affect an election. The Plaintiffs were Democrats who filed suit in response to the 2016 election. They sought an order forcing Georgia to use different software. They conducted discovery and hearings over years, including 3 days of expert testimony about how these very voting machines work. The court ultimately denied the request because it was simply too late to change the voting machines since the election at that time was roughly a month away. New cases are supposed to be assigned to judges randomly but I would not be surprised if this case were given to that particular judge since she spent so much time reviewing the litigation and conducting evidentiary hearings. Her findings of fact could be incorporated into this hearing under the legal theory of res judicata.</p><p>2. The complaint was clearly rushed. At times it was rough and unpolished. There were numerous grammatical errors. But the gist is quite clear and it is clear that the lawyers drafting the complaint certainly knew what they were doing. They dotted the ‘I’s and crossed the ‘T’s so the complaint is not likely to be kicked on a procedural or jurisdictional claim such as standing (a legal doctrine that says that someone who brings a lawsuit must have skin in the game), but I would expect a more polished product if they had more time. However, the copy I have does not have the blue ECF ‘filed’ stamp, so this may not be the final complaint that gets filed. That becomes really important below.</p><p>3. The complaint makes good use of a wide variety of legal sources from both political parties (specifically naming a statement from Democratic Senators Warren, Klobuchar and Wyden from 2019) regarding Dominion software, including evidence from the previous litigation. Essentially the plaintiffs say, among other things, “Look, for the past 15+ years, Republicans, Democrats and a wide variety of international media groups have pointed out the problems with Dominion software so it shouldn’t be a surprise we are here. And the very problems they have pointed out are problems we see in this election.”</p><p>4. The complaint relies upon a variety of evidence to support its claim. One is an examination of the history of Dominion software. another is expert testimony regarding the voting patterns seen in this election. Another is eyewitness testimony of ballot switching. Another is evidence of votes being case by ineligible persons. Another is evidence of a pattern of similar conduct in several high population counties. Viewed together, Plaintiffs make a strong case. But it’s one thing to say something and another to prove it.</p><p>5. One area where plaintiffs do a good job is in pointing out the number of votes affected by the alleged fraud. One reason this is crucial is that Biden’s certified margin of victory in Georgia was only about 12,000 votes. And the complaint does a good job of laying out substantial procedural and constitutional irregularities with roughly 96,000 votes and further problems with additional votes. The problematic votes far outnumber Biden’s margin of victory, which is hugely significant. Put another way, if Biden wins by 500,000 and they claim that there are problems with 100,000 votes, even if those 100,000 votes are gone, Biden still wins. If the problem votes are gone, Biden’s victory may be gone as well. The complaint does a good job of pointing out not just the alleged problems but the number of votes affected by those problems.</p><p>6. What now? The plaintiffs are asking for an evidentiary hearing. That would allow them to present evidence in the form of witness testimony, expert testimony and exhibits that would support their claim. Because it is a civil case, they only have to prove their case by a preponderance of evidence, that is, they only have to prove that it was more likely than not that there was fraud and that the fraud influenced the election. They do not have to prove their case beyond a reasonable doubt. </p><p>The court may refuse an evidentiary hearing, in which case Plaintiffs would appeal and argue that they should be given hearing. Given the evidence laid out, I expect that the court will at least order an evidentiary hearing that will be conducted on an expedited scale. (it helps that there’s an evidentiary hearing set in Nevada). After the evidentiary hearing, the court can grant their request, which would be to de-certify the election and force a manual re-count/audit overseen by independent auditors to verify each vote. Or the court could deny it. Realistically this case is likely to be appealed, which is one reason that the District (trial) court is likely to hold an evidentiary hearing. Because an appeal is almost certain no matter who wins the case, the judge’s legal decision in this case is likely not nearly as important as the judge’s factual decisions. The judge’s factual decisions will likely be relied upon by appellate judges even if they disagree with the judge’s legal conclusions. If there is an evidentiary hearing, pay careful attention to the judge’s factual findings, especially as described below.</p><p>7. What to look for. There are a few things to watch for if there is a hearing. For one, federal (NOT state, and this is hugely important for federal jurisdiction) law requires that all records related to the election of a President, VP and senators be kept for at least 22 months after an election. If the court sets a hearing, watch for a request for that evidence. If the court orders an evidentiary hearing, I would expect the court would order that evidence provided to the Plaintiffs and to the court. If that evidence is not provided, that is, if the Georgia Division of Elections does not have the data that is required by the federal statutes, there will be hell to pay. I cannot imagine that anybody would be so monumentally stupid as to either erase such information or to not keep such information. However, Plaintiffs specifically allege that the voting machines do not keep copies of original paper ballots and are designed to avoid this audit trail. See ¶98 of the complaint. This is one area where the complaint’s rushed nature is an issue, although the complaint does not appear to be filed because it’s missing the blue ECF numbers showing it has been filed. Maybe the copy I got is just a leaked rough draft. </p><p>In making this allegation, the complaint quotes some findings and includes a footnote that should have the citation for what was quoted. That particular footnote, number 14, is missing. Having worked with Word to include footnotes, it would not surprise me if it were deleted accidentally during formatting. If this is the complaint that gets filed, I expect that given the time constraints Plaintiffs counsel will soon seek to file an amended complaint and include footnote 14. If that footnote is still missing, it looks really bad for Plaintiffs. If that footnote is included and their allegations about the lack of a paper trial in Dominion machines is true, that single factual finding alone is enough to derail any certified election results from states relying upon Dominion machine. I am not joking. The statute that requires election officials to keep records is a criminal statute, meaning that election officials who willfully do not keep such records can go to prison. Whether they will or not is not the issue. The issue is that this will be a crucial matter to look at because if nothing else, Plaintiffs can say, “Here are major voter irregularities and if the defendants had followed the law, this court would have had the evidence to determine whether these irregularities are just an odd statistical coincidence or based on fraud. But defendants deprived the court of the ability to do its job despite their clear legal obligation to do so.” That’s not really where the defendants want to be. </p><p>The plaintiffs will also seek to compare votes cast with voter registration, specifically people that have moved from Georgia and are no longer eligible to vote. Plaintiffs allege that over 20,000 votes were cast by people who had moved out of Georgia and were no longer eligible to vote. Strike those 20,000 votes as illegitimate and who knows what happens to Biden’s lead. These two issues are huge because they are black and white. There can be no reasonable dispute. Either they have the records or they don’t. Either 20,000 votes were cast by non-residents or they weren’t. If Plaintiffs can prove these two points, the court is likely to give them wider latitude about other matters. If they can’t prove these two points, Plaintiffs will find their case is much harder than anticipated.</p><p>8. After that, there are other evidentiary issues on which the court may or may not take evidence. Plaintiffs make a big deal about how the ‘water leak’ at election headquarters was fraudulent and resulted in only a few people being along with voting machines for several hours. I anticipate the court will take some evidence on that but it won’t be enough for Plaintiffs to prove that the voting machines were unsecured on election night through the defendants’ fraud. Plaintiffs will have to prove that during that time votes were actually altered in some way, that is, deleted or switched from one candidate to another or added or something and they must prove that the number of altered votes would be within the margin of error for the Biden victory margin. This ties in with the audit trail. Put another way, if Plaintiffs can show that: 1) the water leak was non-existent; 2) that as a result of the ‘water leak,’ the machines were in the hands of just a few people for several hours; 3) that in those hours the voting pattern changed dramatically and unpredictably, then Georgia better have those machines and those machines better have an audit trail or some judges are not going to be happy.</p><p>There are similar lawsuits pending in several other states and issues dovetail with this one. A judge in Nevada has ordered an evidentiary hearing on December 3. That hearing focuses upon fraud in mail-in ballots, which is not so much the focus here. The focus here is more on problems with Dominion software, which will be harder to prove, although the lack of an audit trail will be crucial for this issue. Plaintiffs will catch a big break if the judge who did the litigation on Dominion software gets this case because the judge will know the issues with Dominion and have the background to get up to speed quickly. If the judge who handled the Dominion litigation handles this one, she would be able to get an opinion out fairly quickly because she already wrote a 150 page opinion about the problems with Dominion. If she gets an opinion out while litigation about Dominion is pending in other states or appellate courts, look for Plaintiffs/Trump to use the decision to try to influence the other cases involving Dominion, especially if she makes a factual finding that the machines do not have an audit trail and this is by design.</p><p>I have no idea about the likelihood of success. Plaintiffs make an excellent argument. That is, what they allege is indeed serious. It’s not a complaint that you read and wonder “What the hell were these lawyers smoking when they filed this?” Maybe Plaintiffs are wrong. Maybe they can’t prove what they allege. But that is different than “what were they smoking?” If they can prove what they allege, the court has the power to grant their request to de-certify the election and audit the votes. But courts are generally loathe to overturn elections. If the Plaintiffs’ evidence (key word is evidence, not allegations) ultimately comes down to really improbable voting patterns, Plaintiffs are not likely to win. Plaintiffs need to be able to say, “Here is how voter fraud occurred and here are the number of fraudulent votes cast/changed/deleted/added because of that fraud.” If they can’t do both, or at least do both in sufficient numbers to cast Biden’s margin of victory into doubt in Georgia, they won’t win. If they can do both, this case will get real interesting real fast. If this court finds that Dominion voting machines do not keep records that allow an audit of votes in a Presidential election despite a clear federal statute to do so, then I truly have no idea where this ends up. In that case, I am truly glad that RBG is not on the court any longer.</p><p>On one last note in an already too-long email, it will be irony of ironies if the Dominion software litigation in Georgia turns out to be the key to this whole thing when it was Democrats themselves who started that litigation in response to the 2017 election. </p><p><b>UPDATE: </b>the shill response to the GA filing is “LOL, spelling errors!”</p><blockquote><p>The one things judges hate, even the most conservatives ones, is when you start making a mockery of the court. Going to court unprepared and will spelling errors is just going to get on the judges bad side.</p></blockquote><p>Oh, the irony…. The Dunning-Kruger is strong in this one. </p><p><b>UPDATE: </b>This subsequent post by the original poster, made prior to the Powell filing, appears to be accurate:</p><blockquote><p>We haven’t heard from the higher ups in hours. I haven’t been told to worry yet, but the shift around here is palpable. The suit is…comprehensive. A lot of it talks about the Dominion software and the pay-to-play implications of having it installed in Georgia, the modifications to the system and the alleged money that changed hands between officials at dominion and state officials in Georgia. There’s a lot of discussion about some executive for Dominion that made a bunch of red flag modifications to the system right before the election that were against protocols or something. Then there is a lot from whistleblowers who testify to taking part in vote switching and ballot adding.</p></blockquote><p>There are 8 references to Dominion CEO Eric Coomer across 4 pages of the filing. There is also an amount of testimony from whistleblowers.</p></div>",
  "content_text": "An experienced attorney analyzes Sidney Powell’s legal filing in GA concerning the electoral fraud aided and abetted by GA politicians and election officials. The 104-page PDF complaint\ncan be found here\n. Note that she also filed\na lawsuit in MI\n, which is not analyzed here.\nI have been a practicing attorney for 25+ years. The last 15 years I have spent mainly federal court representing persons accused of crimes, so I am quite familiar with federal court, federal procedure and other matters. Here is my take on Ms. Powell’s complaint. I aim to be dispassionate, not because I do not care but because we should be honest. I am not going to smooth over issues just because I hope Ms. Powell wins.\nMy point is to give background and overview and to advise on what to watch in the future. I have tried to make this post generally neutral and informative. I could not locate exhibits, which are crucial, but they are cited many times in the complaint. So, here are my few observations as an attorney with decades’ in federal court:\n1. In early October, 2020, a federal district judge in this same district (Northern District of Georgia) ruled after several years of litigation that the Dominion software used to monitor this election has substantial issues and it will affect an election. The Plaintiffs were Democrats who filed suit in response to the 2016 election. They sought an order forcing Georgia to use different software. They conducted discovery and hearings over years, including 3 days of expert testimony about how these very voting machines work. The court ultimately denied the request because it was simply too late to change the voting machines since the election at that time was roughly a month away. New cases are supposed to be assigned to judges randomly but I would not be surprised if this case were given to that particular judge since she spent so much time reviewing the litigation and conducting evidentiary hearings. Her findings of fact could be incorporated into this hearing under the legal theory of res judicata.\n2. The complaint was clearly rushed. At times it was rough and unpolished. There were numerous grammatical errors. But the gist is quite clear and it is clear that the lawyers drafting the complaint certainly knew what they were doing. They dotted the ‘I’s and crossed the ‘T’s so the complaint is not likely to be kicked on a procedural or jurisdictional claim such as standing (a legal doctrine that says that someone who brings a lawsuit must have skin in the game), but I would expect a more polished product if they had more time. However, the copy I have does not have the blue ECF ‘filed’ stamp, so this may not be the final complaint that gets filed. That becomes really important below.\n3. The complaint makes good use of a wide variety of legal sources from both political parties (specifically naming a statement from Democratic Senators Warren, Klobuchar and Wyden from 2019) regarding Dominion software, including evidence from the previous litigation. Essentially the plaintiffs say, among other things, “Look, for the past 15+ years, Republicans, Democrats and a wide variety of international media groups have pointed out the problems with Dominion software so it shouldn’t be a surprise we are here. And the very problems they have pointed out are problems we see in this election.”\n4. The complaint relies upon a variety of evidence to support its claim. One is an examination of the history of Dominion software. another is expert testimony regarding the voting patterns seen in this election. Another is eyewitness testimony of ballot switching. Another is evidence of votes being case by ineligible persons. Another is evidence of a pattern of similar conduct in several high population counties. Viewed together, Plaintiffs make a strong case. But it’s one thing to say something and another to prove it.\n5. One area where plaintiffs do a good job is in pointing out the number of votes affected by the alleged fraud. One reason this is crucial is that Biden’s certified margin of victory in Georgia was only about 12,000 votes. And the complaint does a good job of laying out substantial procedural and constitutional irregularities with roughly 96,000 votes and further problems with additional votes. The problematic votes far outnumber Biden’s margin of victory, which is hugely significant. Put another way, if Biden wins by 500,000 and they claim that there are problems with 100,000 votes, even if those 100,000 votes are gone, Biden still wins. If the problem votes are gone, Biden’s victory may be gone as well. The complaint does a good job of pointing out not just the alleged problems but the number of votes affected by those problems.\n6. What now? The plaintiffs are asking for an evidentiary hearing. That would allow them to present evidence in the form of witness testimony, expert testimony and exhibits that would support their claim. Because it is a civil case, they only have to prove their case by a preponderance of evidence, that is, they only have to prove that it was more likely than not that there was fraud and that the fraud influenced the election. They do not have to prove their case beyond a reasonable doubt.\nThe court may refuse an evidentiary hearing, in which case Plaintiffs would appeal and argue that they should be given hearing. Given the evidence laid out, I expect that the court will at least order an evidentiary hearing that will be conducted on an expedited scale. (it helps that there’s an evidentiary hearing set in Nevada). After the evidentiary hearing, the court can grant their request, which would be to de-certify the election and force a manual re-count/audit overseen by independent auditors to verify each vote. Or the court could deny it. Realistically this case is likely to be appealed, which is one reason that the District (trial) court is likely to hold an evidentiary hearing. Because an appeal is almost certain no matter who wins the case, the judge’s legal decision in this case is likely not nearly as important as the judge’s factual decisions. The judge’s factual decisions will likely be relied upon by appellate judges even if they disagree with the judge’s legal conclusions. If there is an evidentiary hearing, pay careful attention to the judge’s factual findings, especially as described below.\n7. What to look for. There are a few things to watch for if there is a hearing. For one, federal (NOT state, and this is hugely important for federal jurisdiction) law requires that all records related to the election of a President, VP and senators be kept for at least 22 months after an election. If the court sets a hearing, watch for a request for that evidence. If the court orders an evidentiary hearing, I would expect the court would order that evidence provided to the Plaintiffs and to the court. If that evidence is not provided, that is, if the Georgia Division of Elections does not have the data that is required by the federal statutes, there will be hell to pay. I cannot imagine that anybody would be so monumentally stupid as to either erase such information or to not keep such information. However, Plaintiffs specifically allege that the voting machines do not keep copies of original paper ballots and are designed to avoid this audit trail. See ¶98 of the complaint. This is one area where the complaint’s rushed nature is an issue, although the complaint does not appear to be filed because it’s missing the blue ECF numbers showing it has been filed. Maybe the copy I got is just a leaked rough draft.\nIn making this allegation, the complaint quotes some findings and includes a footnote that should have the citation for what was quoted. That particular footnote, number 14, is missing. Having worked with Word to include footnotes, it would not surprise me if it were deleted accidentally during formatting. If this is the complaint that gets filed, I expect that given the time constraints Plaintiffs counsel will soon seek to file an amended complaint and include footnote 14. If that footnote is still missing, it looks really bad for Plaintiffs. If that footnote is included and their allegations about the lack of a paper trial in Dominion machines is true, that single factual finding alone is enough to derail any certified election results from states relying upon Dominion machine. I am not joking. The statute that requires election officials to keep records is a criminal statute, meaning that election officials who willfully do not keep such records can go to prison. Whether they will or not is not the issue. The issue is that this will be a crucial matter to look at because if nothing else, Plaintiffs can say, “Here are major voter irregularities and if the defendants had followed the law, this court would have had the evidence to determine whether these irregularities are just an odd statistical coincidence or based on fraud. But defendants deprived the court of the ability to do its job despite their clear legal obligation to do so.” That’s not really where the defendants want to be.\nThe plaintiffs will also seek to compare votes cast with voter registration, specifically people that have moved from Georgia and are no longer eligible to vote. Plaintiffs allege that over 20,000 votes were cast by people who had moved out of Georgia and were no longer eligible to vote. Strike those 20,000 votes as illegitimate and who knows what happens to Biden’s lead. These two issues are huge because they are black and white. There can be no reasonable dispute. Either they have the records or they don’t. Either 20,000 votes were cast by non-residents or they weren’t. If Plaintiffs can prove these two points, the court is likely to give them wider latitude about other matters. If they can’t prove these two points, Plaintiffs will find their case is much harder than anticipated.\n8. After that, there are other evidentiary issues on which the court may or may not take evidence. Plaintiffs make a big deal about how the ‘water leak’ at election headquarters was fraudulent and resulted in only a few people being along with voting machines for several hours. I anticipate the court will take some evidence on that but it won’t be enough for Plaintiffs to prove that the voting machines were unsecured on election night through the defendants’ fraud. Plaintiffs will have to prove that during that time votes were actually altered in some way, that is, deleted or switched from one candidate to another or added or something and they must prove that the number of altered votes would be within the margin of error for the Biden victory margin. This ties in with the audit trail. Put another way, if Plaintiffs can show that: 1) the water leak was non-existent; 2) that as a result of the ‘water leak,’ the machines were in the hands of just a few people for several hours; 3) that in those hours the voting pattern changed dramatically and unpredictably, then Georgia better have those machines and those machines better have an audit trail or some judges are not going to be happy.\nThere are similar lawsuits pending in several other states and issues dovetail with this one. A judge in Nevada has ordered an evidentiary hearing on December 3. That hearing focuses upon fraud in mail-in ballots, which is not so much the focus here. The focus here is more on problems with Dominion software, which will be harder to prove, although the lack of an audit trail will be crucial for this issue. Plaintiffs will catch a big break if the judge who did the litigation on Dominion software gets this case because the judge will know the issues with Dominion and have the background to get up to speed quickly. If the judge who handled the Dominion litigation handles this one, she would be able to get an opinion out fairly quickly because she already wrote a 150 page opinion about the problems with Dominion. If she gets an opinion out while litigation about Dominion is pending in other states or appellate courts, look for Plaintiffs/Trump to use the decision to try to influence the other cases involving Dominion, especially if she makes a factual finding that the machines do not have an audit trail and this is by design.\nI have no idea about the likelihood of success. Plaintiffs make an excellent argument. That is, what they allege is indeed serious. It’s not a complaint that you read and wonder “What the hell were these lawyers smoking when they filed this?” Maybe Plaintiffs are wrong. Maybe they can’t prove what they allege. But that is different than “what were they smoking?” If they can prove what they allege, the court has the power to grant their request to de-certify the election and audit the votes. But courts are generally loathe to overturn elections. If the Plaintiffs’ evidence (key word is evidence, not allegations) ultimately comes down to really improbable voting patterns, Plaintiffs are not likely to win. Plaintiffs need to be able to say, “Here is how voter fraud occurred and here are the number of fraudulent votes cast/changed/deleted/added because of that fraud.” If they can’t do both, or at least do both in sufficient numbers to cast Biden’s margin of victory into doubt in Georgia, they won’t win. If they can do both, this case will get real interesting real fast. If this court finds that Dominion voting machines do not keep records that allow an audit of votes in a Presidential election despite a clear federal statute to do so, then I truly have no idea where this ends up. In that case, I am truly glad that RBG is not on the court any longer.\nOn one last note in an already too-long email, it will be irony of ironies if the Dominion software litigation in Georgia turns out to be the key to this whole thing when it was Democrats themselves who started that litigation in response to the 2017 election.\nUPDATE:\nthe shill response to the GA filing is “LOL, spelling errors!”\nThe one things judges hate, even the most conservatives ones, is when you start making a mockery of the court. Going to court unprepared and will spelling errors is just going to get on the judges bad side.\nOh, the irony…. The Dunning-Kruger is strong in this one.\nUPDATE:\nThis subsequent post by the original poster, made prior to the Powell filing, appears to be accurate:\nWe haven’t heard from the higher ups in hours. I haven’t been told to worry yet, but the shift around here is palpable. The suit is…comprehensive. A lot of it talks about the Dominion software and the pay-to-play implications of having it installed in Georgia, the modifications to the system and the alleged money that changed hands between officials at dominion and state officials in Georgia. There’s a lot of discussion about some executive for Dominion that made a bunch of red flag modifications to the system right before the election that were against protocols or something. Then there is a lot from whistleblowers who testify to taking part in vote switching and ballot adding.\nThere are 8 references to Dominion CEO Eric Coomer across 4 pages of the filing. There is also an amount of testimony from whistleblowers.",
  "tags": [
    "law"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-11-26T11:59:50+00:00"
}