{
  "url": "https://voxday.net/2020/11/04/nothing-is-over/",
  "scraped_at": "2025-12-21T13:14:27.108709",
  "title": "Nothing is over",
  "date_display": "November 4, 2020",
  "date_iso": "2020-11-04T23:09:40+00:00",
  "date_from_url": "2020-11-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>We have claimed, for Electoral Vote purposes, the Commonwealth of Pennsylvania (which won’t allow legal observers) the State of Georgia, and the State of North Carolina, each one of which has a BIG Trump lead. Additionally, we hereby claim the State of Michigan if, in fact, there was a large number of secretly dumped ballots as has been widely reported! </i></p><p>– Donald J. Trump @realDonaldTrump</p><p>This, and not the election, is the real test of President Trump. In his <i>Discourses</i>, Machiavelli lamented how societies fail because good men refuse to do what needs to be done in order to save them. But it appears that Donald Trump is not going to be a good Republican, sell out his supporters, look the other way, and pretend that a significant part of the vote for his opponent was not fraudulent.</p></div>",
  "content_text": "We have claimed, for Electoral Vote purposes, the Commonwealth of Pennsylvania (which won’t allow legal observers) the State of Georgia, and the State of North Carolina, each one of which has a BIG Trump lead. Additionally, we hereby claim the State of Michigan if, in fact, there was a large number of secretly dumped ballots as has been widely reported!\n– Donald J. Trump @realDonaldTrump\nThis, and not the election, is the real test of President Trump. In his\nDiscourses\n, Machiavelli lamented how societies fail because good men refuse to do what needs to be done in order to save them. But it appears that Donald Trump is not going to be a good Republican, sell out his supporters, look the other way, and pretend that a significant part of the vote for his opponent was not fraudulent.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-11-04T23:09:40+00:00"
}