{
  "url": "https://voxday.net/2020/11/12/russia-won-the-azeri-armenian-war/",
  "scraped_at": "2025-12-21T22:24:01.024047",
  "title": "Russia won the Azeri-Armenian war",
  "date_display": "November 12, 2020",
  "date_iso": "2020-11-12T20:30:01+00:00",
  "date_from_url": "2020-11-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>At least, according to the Saker’s analysis of the recent armistice between Azerbaijan and Armenia following the latest war for Nagorno-Karabakh.</p><blockquote><ul style=\"text-align: left;\"><li>The war which has just ended was a real bloodbath and it has seen more casualties (counting both sides) than what the Soviet Union lost in 10 years of warfare in Afghanistan</li><li>This war is now over, Russian peacekeepers have already been deployed along the line of contact. So far, neither side has dared to resume hostilities (more about that below).</li><li>There have been two days of celebrations in Baku where President Aliev has declared that the war was a triumph for Azeri forces and that Pashinian got nothing. He is right.</li><li>The Azeris are now declaring that they want compensation from Armenia.</li><li>There are now Turkish forces in Azerbaijan and Russian and Turkish forces have created a joint committee to coordinate actions.</li></ul><div><b>Armenia: </b>there is no doubt that Armenia is the biggest loser in this war. Pashinian and his gang of russophobic Sorosites has brought a real calamity upon his people. Since he came to power his anti-Russian actions included almost totally eliminating any Armenian participation on the CSTO, he completely ceased any collaboration with Russia (including in the intelligence and security domains), he purged the Armenian military and security forces from all the supposed “pro-Russian” elements, he banned Russian language schools. In contrast, Armenia has an absolutely huge US embassy with about 2000 personnel (as much as the entire Russian peacekeeping force!) and when the Azeris attacked, Pashinin refused to ask Russia for help for a full month. He did ask Trump, Merkel and Macron for help instead. Needless to say, they did exactly nothing once the crisis erupted.</div><div></div><div><b>Turkey:</b> the next big loser in this war is Turkey whose objectives of bringing all Turkic nations under one neo-Ottoman empire have, predictably, crashed. </div><div><b>Russia: </b>Russia is the only true winner of this war. I know, there is a powerful Armenian lobby in the USA, in Europe and in Russia, and they are trying to present their defeat as a defeat for Russia. Frankly, I understand their bitterness and I feel sorry for them, but they are absolutely wrong. Here is why: First, Russia has now established herself as the sole power in the Caucasus which can bring about peace. 2000 US personnel in Erevan did absolutely nothing for years to really help Armenia, all they did is force suicidal russophobic policies on Armenia, that’s about it…. Another sweet spot for Russia is that she can now (truthfully) declare that color revolutions inevitably result in territorial losses (the Ukraine, Georgie and now Armenia) and political chaos (everywhere).</div></blockquote><p>I can’t possibly say whether he is correct or not, but one thing is clear: the outcome of this latest conflict over Nagorno-Karabakh was considerably less successful for Armenia than the last one. It’s also rather sobering to be informed that the war was even more bloody than the much longer Soviet invasion and occupation of Afghanistan.</p><div></div></div>",
  "content_text": "At least, according to the Saker’s analysis of the recent armistice between Azerbaijan and Armenia following the latest war for Nagorno-Karabakh.\nThe war which has just ended was a real bloodbath and it has seen more casualties (counting both sides) than what the Soviet Union lost in 10 years of warfare in Afghanistan\nThis war is now over, Russian peacekeepers have already been deployed along the line of contact. So far, neither side has dared to resume hostilities (more about that below).\nThere have been two days of celebrations in Baku where President Aliev has declared that the war was a triumph for Azeri forces and that Pashinian got nothing. He is right.\nThe Azeris are now declaring that they want compensation from Armenia.\nThere are now Turkish forces in Azerbaijan and Russian and Turkish forces have created a joint committee to coordinate actions.\nArmenia:\nthere is no doubt that Armenia is the biggest loser in this war. Pashinian and his gang of russophobic Sorosites has brought a real calamity upon his people. Since he came to power his anti-Russian actions included almost totally eliminating any Armenian participation on the CSTO, he completely ceased any collaboration with Russia (including in the intelligence and security domains), he purged the Armenian military and security forces from all the supposed “pro-Russian” elements, he banned Russian language schools. In contrast, Armenia has an absolutely huge US embassy with about 2000 personnel (as much as the entire Russian peacekeeping force!) and when the Azeris attacked, Pashinin refused to ask Russia for help for a full month. He did ask Trump, Merkel and Macron for help instead. Needless to say, they did exactly nothing once the crisis erupted.\nTurkey:\nthe next big loser in this war is Turkey whose objectives of bringing all Turkic nations under one neo-Ottoman empire have, predictably, crashed.\nRussia:\nRussia is the only true winner of this war. I know, there is a powerful Armenian lobby in the USA, in Europe and in Russia, and they are trying to present their defeat as a defeat for Russia. Frankly, I understand their bitterness and I feel sorry for them, but they are absolutely wrong. Here is why: First, Russia has now established herself as the sole power in the Caucasus which can bring about peace. 2000 US personnel in Erevan did absolutely nothing for years to really help Armenia, all they did is force suicidal russophobic policies on Armenia, that’s about it…. Another sweet spot for Russia is that she can now (truthfully) declare that color revolutions inevitably result in territorial losses (the Ukraine, Georgie and now Armenia) and political chaos (everywhere).\nI can’t possibly say whether he is correct or not, but one thing is clear: the outcome of this latest conflict over Nagorno-Karabakh was considerably less successful for Armenia than the last one. It’s also rather sobering to be informed that the war was even more bloody than the much longer Soviet invasion and occupation of Afghanistan.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-11-12T20:30:01+00:00"
}