{
  "url": "https://voxday.net/2020/11/02/so-dumbledore-really-was-gay/",
  "scraped_at": "2025-12-21T13:14:01.244388",
  "title": "So Dumbledore really was gay",
  "date_display": "November 2, 2020",
  "date_iso": "2020-11-02T10:38:44+00:00",
  "date_from_url": "2020-11-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve always despised the Harry Potter books. I’ve only ever seen part of one movie, but I hated that too. Apparently one-third of the script was devoted to one actor or another saying “Harry!” It would appear that my instincts are still sound when it comes to the Hellmouth, if <a href=\"https://archive.is/IDBj2#selection-18271.1-18271.177\" rel=\"noopener noreferrer\" target=\"_blank\">this blind item from CDAN</a> about a famous film franchise is any guide.</p><blockquote><p>This actor was never higher than C+ list. Foreign born and mostly movies he has actually been in some of the biggest movies of all time. Speaking roles in most of them but just a minor character (although one all of you would know). He actually has a chance to be more famous outside of acting in his current career than he ever did acting, despite being in such a huge franchise. He was talking to an interviewer about his new profession and the interviewer asked the former actor why he chose the new profession. The former actor said it was because on the set of the franchise he was scared everyday of getting molested or raped by many of the older men that were on the set. He said this was especially true in the first few films where you learned really quickly not to walk around certain areas of a set or to wander too far away from other people. There were just too many men there who loved nothing more than dragging some 10 year old boy somewhere for 20 minutes and threatening to hit him or get him kicked off the movie if he told anyone. Our former actor said there were only a few older actors who took part, but they were some of the worst. An actor would tell a crew member and the crew member would grab the boy and hold him for the actor and then often the crew member would take a turn too. The former actor said some of the tween girls on the set were bothered, but as far as he knows, none were raped liked the boys. Once the actors got to be a certain age, they could fight or were big enough to get the men to back off, but with new young boys coming in for every film, it was a never ending cycle of sexual abuse and no one did anything to stop it.</p><p><i>Harry Potter</i></p></blockquote><p>The director of the first two films is “a Spielberg protege who also directed Macauley Culkin in the two “Home Alone” movies.” I am as <i>ashocked </i>as I am <i>sastonished</i>. It’s getting to the point where we require words to describe the exact opposite of being surprised.</p><p><i></i></p></div>",
  "content_text": "I’ve always despised the Harry Potter books. I’ve only ever seen part of one movie, but I hated that too. Apparently one-third of the script was devoted to one actor or another saying “Harry!” It would appear that my instincts are still sound when it comes to the Hellmouth, if\nthis blind item from CDAN\nabout a famous film franchise is any guide.\nThis actor was never higher than C+ list. Foreign born and mostly movies he has actually been in some of the biggest movies of all time. Speaking roles in most of them but just a minor character (although one all of you would know). He actually has a chance to be more famous outside of acting in his current career than he ever did acting, despite being in such a huge franchise. He was talking to an interviewer about his new profession and the interviewer asked the former actor why he chose the new profession. The former actor said it was because on the set of the franchise he was scared everyday of getting molested or raped by many of the older men that were on the set. He said this was especially true in the first few films where you learned really quickly not to walk around certain areas of a set or to wander too far away from other people. There were just too many men there who loved nothing more than dragging some 10 year old boy somewhere for 20 minutes and threatening to hit him or get him kicked off the movie if he told anyone. Our former actor said there were only a few older actors who took part, but they were some of the worst. An actor would tell a crew member and the crew member would grab the boy and hold him for the actor and then often the crew member would take a turn too. The former actor said some of the tween girls on the set were bothered, but as far as he knows, none were raped liked the boys. Once the actors got to be a certain age, they could fight or were big enough to get the men to back off, but with new young boys coming in for every film, it was a never ending cycle of sexual abuse and no one did anything to stop it.\nHarry Potter\nThe director of the first two films is “a Spielberg protege who also directed Macauley Culkin in the two “Home Alone” movies.” I am as\nashocked\nas I am\nsastonished\n. It’s getting to the point where we require words to describe the exact opposite of being surprised.",
  "tags": [
    "film"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-11-02T10:38:44+00:00"
}