{
  "url": "https://voxday.net/2020/11/23/there-is-nothing-wrong-with-neutrality/",
  "scraped_at": "2025-12-21T22:25:37.701660",
  "title": "There is nothing wrong with neutrality",
  "date_display": "November 23, 2020",
  "date_iso": "2020-11-23T15:13:52+00:00",
  "date_from_url": "2020-11-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>First, read this <a href=\"https://www.blackriflecoffee.com/pages/official-statement-kenosha\" rel=\"noopener noreferrer\" target=\"_blank\">statement from Black Rifle Coffee</a>:</p><blockquote><p>A Statement from CEO Evan Hafer on Black Rifle Coffee Company’s Mission</p><p>As a veteran-owned and operated coffee company, Black Rifle Coffee Company exists to serve premium coffee while supporting the veteran Community. At the core of Black Rifle Coffee’s values is to support and bring awareness to the millions of veterans who have proudly served our nation and we will not waver from that mission.</p><p>The Black Rifle brand is a symbol of service, of strength, and of goodness that has carried over from our military origins. It’s why we support active duty service members and veterans, prioritize veteran hiring, and advocate for individual liberty and personal responsibility.</p><p>We do not support legal advocacy efforts. We do not sponsor nor do we have a relationship with the 17-year-old facing charges in Kenosha, WI.</p><p>We believe in the integrity of the legal justice system, and support law enforcement officials.</p><p>We’re grateful for the continued support of the Black Rifle Coffee community and eager to continue serving those who serve.</p><p>-Evan Hafer, CEO/Founder</p></blockquote><p>Now, as you probably know, I absolutely support The Hero Kyle Rittenhouse. And I also consider this to be a missed opportunity here for Black Rifle Coffee to take a stand in support of one of its supporters that would go over very, very well with its customers. If he’d been wearing an Arkhaven shirt, I’d have sent him ten more plus a baseball cap. But there is literally nothing wrong for a corporation to decline to not only leap into the cultural wars, but put itself at the pointiest edge of the spear in those wars.</p><p>Black Rifle didn’t cuck, it didn’t throw The Hero Kyle Rittenhouse under the bus, it didn’t disavow him, and it didn’t rush to make a donation to BLM in order to purchase a hall pass from the enemy. It just pointed out, correctly, that it was being unfairly attacked for something it didn’t do that was unrelated to its mission. Save your rhetorical fire for enemies, deserters, cucks, and traitors, don’t waste it on neutrals. Ignore them, because there are no shortage of better targets out there.</p><p>TL,DR: If you like the coffee, then drink it. There is no reason to boycott them. But then, there is no reason to go out of your way to support them either. They’ve made it clear that they won’t stand up for anyone, so you don’t need to stand up for them.</p><p>As for me, I don’t drink Black Rifle Coffee and I don’t care about Black Rifle Coffee. Here is an idea: instead of getting all enthusiastic about individuals and institutions that you imagine might maybe perhaps be on your side and getting repeatedly disappointed when you learn otherwise, why not simply focus on supporting <i>those who actually are?</i></p><p>I truly do not understand this apparent desire to constantly hare off after everyone and everything that happens to make what might possibly be a sympathetic noise.</p><p><b><br/></b></p><p><b>UPDATE: </b>All right, if enough of you BRC supporters are genuinely pissed off about this, let me know and I’ll contact an Italian company I know. I wouldn’t mind having an excuse to produce a custom Italian coffee line, especially since Nespresso doesn’t seem inclined to bring back Canella anytime soon.</p><p><b>UPDATE: </b>Upon further review, I was wrong. Black Rifle Coffee is a false front, it is not politically neutral and its failure to back The Hero Kyle Rittenhouse cannot be reasonably ascribed to simple corporate neutrality. They appear to be parasites in patriot clothing successfully preying on the veteran community. The CEO is <a href=\"https://thedonald.win/p/11QRtcrEYi/brcc-ceo-evan-hafer-was-a-2a-lar/c/\" rel=\"noopener noreferrer\" target=\"_blank\">an Obama donor</a>. An <a href=\"https://parler.com/post/45cb745502114753ac1148010c5281f1\" rel=\"noopener noreferrer\" target=\"_blank\">ActBlue donor</a>. And <a href=\"https://www.cbsnews.com/news/black-rifle-coffee-company-veterans-culture-conservative-approach/\" rel=\"noopener noreferrer\" target=\"_blank\">it gets worse</a>, as demonstrated in this glowing profile by CBS News:</p><p><i>To Hafer and Best, honoring patriots means honoring immigrants….</i></p></div>",
  "content_text": "First, read this\nstatement from Black Rifle Coffee\n:\nA Statement from CEO Evan Hafer on Black Rifle Coffee Company’s Mission\nAs a veteran-owned and operated coffee company, Black Rifle Coffee Company exists to serve premium coffee while supporting the veteran Community. At the core of Black Rifle Coffee’s values is to support and bring awareness to the millions of veterans who have proudly served our nation and we will not waver from that mission.\nThe Black Rifle brand is a symbol of service, of strength, and of goodness that has carried over from our military origins. It’s why we support active duty service members and veterans, prioritize veteran hiring, and advocate for individual liberty and personal responsibility.\nWe do not support legal advocacy efforts. We do not sponsor nor do we have a relationship with the 17-year-old facing charges in Kenosha, WI.\nWe believe in the integrity of the legal justice system, and support law enforcement officials.\nWe’re grateful for the continued support of the Black Rifle Coffee community and eager to continue serving those who serve.\n-Evan Hafer, CEO/Founder\nNow, as you probably know, I absolutely support The Hero Kyle Rittenhouse. And I also consider this to be a missed opportunity here for Black Rifle Coffee to take a stand in support of one of its supporters that would go over very, very well with its customers. If he’d been wearing an Arkhaven shirt, I’d have sent him ten more plus a baseball cap. But there is literally nothing wrong for a corporation to decline to not only leap into the cultural wars, but put itself at the pointiest edge of the spear in those wars.\nBlack Rifle didn’t cuck, it didn’t throw The Hero Kyle Rittenhouse under the bus, it didn’t disavow him, and it didn’t rush to make a donation to BLM in order to purchase a hall pass from the enemy. It just pointed out, correctly, that it was being unfairly attacked for something it didn’t do that was unrelated to its mission. Save your rhetorical fire for enemies, deserters, cucks, and traitors, don’t waste it on neutrals. Ignore them, because there are no shortage of better targets out there.\nTL,DR: If you like the coffee, then drink it. There is no reason to boycott them. But then, there is no reason to go out of your way to support them either. They’ve made it clear that they won’t stand up for anyone, so you don’t need to stand up for them.\nAs for me, I don’t drink Black Rifle Coffee and I don’t care about Black Rifle Coffee. Here is an idea: instead of getting all enthusiastic about individuals and institutions that you imagine might maybe perhaps be on your side and getting repeatedly disappointed when you learn otherwise, why not simply focus on supporting\nthose who actually are?\nI truly do not understand this apparent desire to constantly hare off after everyone and everything that happens to make what might possibly be a sympathetic noise.\nUPDATE:\nAll right, if enough of you BRC supporters are genuinely pissed off about this, let me know and I’ll contact an Italian company I know. I wouldn’t mind having an excuse to produce a custom Italian coffee line, especially since Nespresso doesn’t seem inclined to bring back Canella anytime soon.\nUPDATE:\nUpon further review, I was wrong. Black Rifle Coffee is a false front, it is not politically neutral and its failure to back The Hero Kyle Rittenhouse cannot be reasonably ascribed to simple corporate neutrality. They appear to be parasites in patriot clothing successfully preying on the veteran community. The CEO is\nan Obama donor\n. An\nActBlue donor\n. And\nit gets worse\n, as demonstrated in this glowing profile by CBS News:\nTo Hafer and Best, honoring patriots means honoring immigrants….",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-11-23T15:13:52+00:00"
}