{
  "url": "https://voxday.net/2020/11/22/were-waiting-for-bidens-concession/",
  "scraped_at": "2025-12-21T22:25:28.491359",
  "title": "We’re waiting for BIDEN’s concession",
  "date_display": "November 22, 2020",
  "date_iso": "2020-11-22T16:16:58+00:00",
  "date_from_url": "2020-11-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>As Rex explains contra the media narrative, we’re not waiting for Trump’s concession. <a href=\"https://social.quodverum.com/@REX/105252539602745345\" rel=\"noopener noreferrer\" target=\"_blank\">We’re waiting to see if JOE BIDEN is going to concede</a> in order to reduce the amount of damage to the Republic and the risk of widespread violence or not. That’s the whole point of this drip-drip-drip of increasingly important information, and it explains why Trump has been remarkably constrained in his actions to date. It also explains why Biden has been hesitant to assert himself as the President-Elect and why Kamala Harris hasn’t resigned from the Senate yet. </p><p>It’s a waiting game for now. They’re waiting for the next shoe to drop while Trump patiently waits for them to concede. But we know the clock is running.</p><blockquote><p>Trump has known about the Democrats vote fraud schemes for YEARS. There are tweets as far back as 2012. Ergo, he would have known he was target #1 in 2016, 2018 and of course in 2020. And he was prepared. Trump’s 2018 EOs, CISA trap and infiltration into vote count centers is good evidence of that.</p><p>In my opinion, the Dems were lured onto their own killing field. Arrogant, drunk on power and poorly led, no one appears to have considered that Trump was onto them. On Nov 3, the one thing that they hadn’t considered happened. </p><p>A MASSIVE RED TSUNAMI.</p><p>The Dems panicked. The mail in ballots exposed them. And revealed to everything else they were up to, including the horrendous digital fraud. This narrative of a desperate Trump, losing legal cases while he sits in the Oval Office in denial, is exactly the opposite of what’s happening.</p><p>Think of a desperate and divided Democratic Party machine, TRAPPED. While Trump looks on in FURY. The Dems are in a terrible position. All they can do is to gaslight Biden to inauguration. But given Trump has them dead to rights, everything they do makes it worse for them.</p><p>Again, I doubt that Trump wants to plunge America into yet more division. I think he wants to put a final end to this assault on the Presidency, Constitution &amp; people as quickly as possible. The question is ‘HOW’?</p><p>Sure, a SCOTUS vindication may be the answer. We are seeing Obama judges blocking each Trump case. Doesn’t matter. Sooner or later one of those cases will likely go to SCOTUS. SCOTUS will rule one way or the other. If they decide in Trump’s favor, great. If not, that sucks. But it doesn’t change the outcome.</p><p>If Trump wants SCOTUS to be the vehicle, I think he will want to make sure that any decision will be easy for the judges. He wants to PROTECT SCOTUS, not make it a target. That means that the criminals will have to be exposed and Biden may even concede, BEFORE any SCOTUS hearing. </p><p>How does that happen? Again, let’s not be distracted by the public drama. Trump has a very powerful PRIVATE option that everyone seems to have forgotten about. What would that be? Our old friend, the Title 1 FISA warrant.</p><p>Consider. If what Sidney Powell is alleging is credible, this is one of the most serious national security situations America has ever faced. Foreign actors, working with American citizens, are trying to steal an American Presidential election. Unlike the Obama/Clinton Trump/Russia hoax, this one is REAL. It is therefore logical that each agent implicated in what’s gone on has been flagged with a ‘2 hop’ T1 FISA, for a long time. Or some other form of surveillance.</p><p>There is nothing controversial about that conclusion, BTW. In fact, that is EXACTLY what the FISC and National Security Letters are for. I would find it very difficult to believe that MULTIPLE T1 FISAs have not been issued against the crooks, for ages. If that’s happened and the allegations are true, evidence implicating everyone involved has almost certainly been hoovered up. </p><p>I note Powell has been referring to comms (eg a DoD officer instructing hundreds of Dem ops to sabotage their offices) that to me can only have come from surveillance. This means that Trump has likely amassed a MOUNTAIN of incriminating evidence, that he can use at will. A mountain that is growing, daily.</p><p>For some reason, leftists &amp; FakeNews  always overlook a critical fact. Trump is POTUS. The most powerful person on the planet. And he has ALL his ducks in a row.</p><p> I think Trump’s ideal solution would be for Biden to concede and then slither away (likely after selling out everyone else). That means that someone is going to knock on Biden’s door soon, to give him a dose of REALITY. One that makes it very clear that he and hundreds of others have been caught dead to rights. And that he MUST CONCEDE.</p><p>If Biden doesn’t concede, Trump has many options. EVERYONE involved is at risk. Biden will be reminded of that. Trump can turn up the heat, as he controls the temperature control. If Biden doesn’t concede, it will make him even more foolish and culpable as the crime is exposed.</p><p>If Biden concedes, game over. SCOTUS may not be required. Trump is inaugurated. The damage to the Republic will be contained.</p><p>But even if Biden does NOT concede, no biggie. Trump will use his evidence to expose the crime in a way that cannot be credibly explained away. And arrests will start shortly thereafter.</p></blockquote><p>Remember, politics is a form of warfare. And while the greatest generals are able to win without needing to go through the process of resolving the situation on the battlefield, that doesn’t mean they are incapable of winning on the battlefield. To the contrary, the reason they can win without battle is because their enemies know they are outmatched.</p><p>President Trump is patiently waiting to see if his enemies have the sense to surrender without making him resort to force. And since they disregarded his every previous warning, I doubt it will surprise him very much if they do not.</p></div>",
  "content_text": "As Rex explains contra the media narrative, we’re not waiting for Trump’s concession.\nWe’re waiting to see if JOE BIDEN is going to concede\nin order to reduce the amount of damage to the Republic and the risk of widespread violence or not. That’s the whole point of this drip-drip-drip of increasingly important information, and it explains why Trump has been remarkably constrained in his actions to date. It also explains why Biden has been hesitant to assert himself as the President-Elect and why Kamala Harris hasn’t resigned from the Senate yet.\nIt’s a waiting game for now. They’re waiting for the next shoe to drop while Trump patiently waits for them to concede. But we know the clock is running.\nTrump has known about the Democrats vote fraud schemes for YEARS. There are tweets as far back as 2012. Ergo, he would have known he was target #1 in 2016, 2018 and of course in 2020. And he was prepared. Trump’s 2018 EOs, CISA trap and infiltration into vote count centers is good evidence of that.\nIn my opinion, the Dems were lured onto their own killing field. Arrogant, drunk on power and poorly led, no one appears to have considered that Trump was onto them. On Nov 3, the one thing that they hadn’t considered happened.\nA MASSIVE RED TSUNAMI.\nThe Dems panicked. The mail in ballots exposed them. And revealed to everything else they were up to, including the horrendous digital fraud. This narrative of a desperate Trump, losing legal cases while he sits in the Oval Office in denial, is exactly the opposite of what’s happening.\nThink of a desperate and divided Democratic Party machine, TRAPPED. While Trump looks on in FURY. The Dems are in a terrible position. All they can do is to gaslight Biden to inauguration. But given Trump has them dead to rights, everything they do makes it worse for them.\nAgain, I doubt that Trump wants to plunge America into yet more division. I think he wants to put a final end to this assault on the Presidency, Constitution & people as quickly as possible. The question is ‘HOW’?\nSure, a SCOTUS vindication may be the answer. We are seeing Obama judges blocking each Trump case. Doesn’t matter. Sooner or later one of those cases will likely go to SCOTUS. SCOTUS will rule one way or the other. If they decide in Trump’s favor, great. If not, that sucks. But it doesn’t change the outcome.\nIf Trump wants SCOTUS to be the vehicle, I think he will want to make sure that any decision will be easy for the judges. He wants to PROTECT SCOTUS, not make it a target. That means that the criminals will have to be exposed and Biden may even concede, BEFORE any SCOTUS hearing.\nHow does that happen? Again, let’s not be distracted by the public drama. Trump has a very powerful PRIVATE option that everyone seems to have forgotten about. What would that be? Our old friend, the Title 1 FISA warrant.\nConsider. If what Sidney Powell is alleging is credible, this is one of the most serious national security situations America has ever faced. Foreign actors, working with American citizens, are trying to steal an American Presidential election. Unlike the Obama/Clinton Trump/Russia hoax, this one is REAL. It is therefore logical that each agent implicated in what’s gone on has been flagged with a ‘2 hop’ T1 FISA, for a long time. Or some other form of surveillance.\nThere is nothing controversial about that conclusion, BTW. In fact, that is EXACTLY what the FISC and National Security Letters are for. I would find it very difficult to believe that MULTIPLE T1 FISAs have not been issued against the crooks, for ages. If that’s happened and the allegations are true, evidence implicating everyone involved has almost certainly been hoovered up.\nI note Powell has been referring to comms (eg a DoD officer instructing hundreds of Dem ops to sabotage their offices) that to me can only have come from surveillance. This means that Trump has likely amassed a MOUNTAIN of incriminating evidence, that he can use at will. A mountain that is growing, daily.\nFor some reason, leftists & FakeNews  always overlook a critical fact. Trump is POTUS. The most powerful person on the planet. And he has ALL his ducks in a row.\nI think Trump’s ideal solution would be for Biden to concede and then slither away (likely after selling out everyone else). That means that someone is going to knock on Biden’s door soon, to give him a dose of REALITY. One that makes it very clear that he and hundreds of others have been caught dead to rights. And that he MUST CONCEDE.\nIf Biden doesn’t concede, Trump has many options. EVERYONE involved is at risk. Biden will be reminded of that. Trump can turn up the heat, as he controls the temperature control. If Biden doesn’t concede, it will make him even more foolish and culpable as the crime is exposed.\nIf Biden concedes, game over. SCOTUS may not be required. Trump is inaugurated. The damage to the Republic will be contained.\nBut even if Biden does NOT concede, no biggie. Trump will use his evidence to expose the crime in a way that cannot be credibly explained away. And arrests will start shortly thereafter.\nRemember, politics is a form of warfare. And while the greatest generals are able to win without needing to go through the process of resolving the situation on the battlefield, that doesn’t mean they are incapable of winning on the battlefield. To the contrary, the reason they can win without battle is because their enemies know they are outmatched.\nPresident Trump is patiently waiting to see if his enemies have the sense to surrender without making him resort to force. And since they disregarded his every previous warning, I doubt it will surprise him very much if they do not.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-11-22T16:16:58+00:00"
}