{
  "url": "https://voxday.net/2020/11/20/why-is-tucker-cucking/",
  "scraped_at": "2025-12-21T22:25:10.935859",
  "title": "Why is Tucker cucking?",
  "date_display": "November 20, 2020",
  "date_iso": "2020-11-20T16:18:24+00:00",
  "date_from_url": "2020-11-20",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tucker Carlson is not dumb enough to fail to understand <a href=\"https://www.washingtonexaminer.com/news/tucker-carlson-trump-attorney-sidney-powell-refused-invite-to-share-evidence-of-software-flipping-votes\" rel=\"noopener noreferrer\" target=\"_blank\">what “evidence” is</a> or how it is properly presented. Is he under pressure from his superiors at Fox News? Or is he simply afraid of being jettisoned in the event Biden is successful in his attempt to steal the election?</p><blockquote><p>“On Sunday night, we texted her after watching one of her segments. What Powell was describing would amount to the single greatest crime in American history, millions of votes stolen in a day. Democracy destroyed. The end of our centuries-old system of self-government — not a small thing,” Carlson said, noting he did not initially dismiss “any” of her claims.</p><p>He added that he believes his show was the most “open-minded show on television,” noting he’s covered evidence of UFOs.</p><p>“We took Sidney Powell seriously. We had no intention of fighting with her. We’ve always respected her work. We simply wanted to see the details. How could you not want to see them? So, we invited Sidney Powell on the show. We would’ve given her the whole hour. We would’ve given her the entire week, actually, and listened quietly the whole time at rapt attention. That’s a big story. But she never sent us any evidence, despite a lot of requests — polite requests. Not a page,” Carlson, whose program is regularly top-rated among prime-time shows, said.</p><p>“When we kept pressing, she got angry and told us to stop contacting her. When we checked with others around the Trump campaign, people in positions of authority, they told us Powell has never given them any evidence either. Nor did she provide any today at the press conference,” Carlson continued, though he agreed electronic voting was dangerous. “But she never demonstrated that a single actual vote was moved illegitimately by software from one candidate to another. Not one.”</p></blockquote><p>What is ridiculous about Carlson’s statements is that one cannot reasonably be expected to provide the sort of evidence that is required to be conclusive in a press conference in front of a bunch of journalists who are totally incapable of understanding it. As both Powell and Giuliani have stated, they have the evidence and will be providing it in the appropriate venues. They have even described, in some detail, what that evidence is.</p><p>The statistical evidence is literally right in front of everyone. FFS, I knew there was voter fraud in Hennepin County by simply looking at the documentary evidence of the vote totals; it is unlikely to the point of complete impossibility for Joe Biden to have won 25.2 percent more votes than the average of votes won by Barack Obama and Hilary Clinton in three elections at the same time Donald Trump won 13.6 percent more votes than the average won by himself, Mitt Romney, and John McCain.</p><p>Hey Tucker, <a href=\"https://hereistheevidence.com/\" rel=\"noopener noreferrer\" target=\"_blank\">here is the evidence</a>. Now, decide if you’re henceforth going to be known as Tucker Carlson or Tucker Cuckerson.</p><p>Meanwhile, Sidney Powell made much the same point I did above to Carlson. So perhaps he really isn’t smart enough to understand what evidence is and is not. Most people simply don’t understand what evidence actually is because they are not intelligent enough to understand it. What most people, especially the media, consider to be evidence is simply testimonial evidence offered by an authority about the actual evidence. But a fair amount of the statistical evidence <i>is already right in front of everyone</i>, they just don’t have the math to understand it or its significance.</p><blockquote><p>Maria Bartiromo: How did you respond to Tucker Carlson? Did you get angry with the show because they texted you and asked you to provide evidence of what you’re alleging?</p><p>Sidney Powell: No, I didn’t get angry with the request to provide evidence in fact I sent an affidavit to Tucker that I had not even attached to a pleading yet to help him understand the situation and I offered him another witness who could explain the mathematics of the statistical evidence far better than I can. I’m not really a numbers person. But he was very insulting, demanding and rude and I told him not to contact me again in those terms.</p></blockquote></div>",
  "content_text": "Tucker Carlson is not dumb enough to fail to understand\nwhat “evidence” is\nor how it is properly presented. Is he under pressure from his superiors at Fox News? Or is he simply afraid of being jettisoned in the event Biden is successful in his attempt to steal the election?\n“On Sunday night, we texted her after watching one of her segments. What Powell was describing would amount to the single greatest crime in American history, millions of votes stolen in a day. Democracy destroyed. The end of our centuries-old system of self-government — not a small thing,” Carlson said, noting he did not initially dismiss “any” of her claims.\nHe added that he believes his show was the most “open-minded show on television,” noting he’s covered evidence of UFOs.\n“We took Sidney Powell seriously. We had no intention of fighting with her. We’ve always respected her work. We simply wanted to see the details. How could you not want to see them? So, we invited Sidney Powell on the show. We would’ve given her the whole hour. We would’ve given her the entire week, actually, and listened quietly the whole time at rapt attention. That’s a big story. But she never sent us any evidence, despite a lot of requests — polite requests. Not a page,” Carlson, whose program is regularly top-rated among prime-time shows, said.\n“When we kept pressing, she got angry and told us to stop contacting her. When we checked with others around the Trump campaign, people in positions of authority, they told us Powell has never given them any evidence either. Nor did she provide any today at the press conference,” Carlson continued, though he agreed electronic voting was dangerous. “But she never demonstrated that a single actual vote was moved illegitimately by software from one candidate to another. Not one.”\nWhat is ridiculous about Carlson’s statements is that one cannot reasonably be expected to provide the sort of evidence that is required to be conclusive in a press conference in front of a bunch of journalists who are totally incapable of understanding it. As both Powell and Giuliani have stated, they have the evidence and will be providing it in the appropriate venues. They have even described, in some detail, what that evidence is.\nThe statistical evidence is literally right in front of everyone. FFS, I knew there was voter fraud in Hennepin County by simply looking at the documentary evidence of the vote totals; it is unlikely to the point of complete impossibility for Joe Biden to have won 25.2 percent more votes than the average of votes won by Barack Obama and Hilary Clinton in three elections at the same time Donald Trump won 13.6 percent more votes than the average won by himself, Mitt Romney, and John McCain.\nHey Tucker,\nhere is the evidence\n. Now, decide if you’re henceforth going to be known as Tucker Carlson or Tucker Cuckerson.\nMeanwhile, Sidney Powell made much the same point I did above to Carlson. So perhaps he really isn’t smart enough to understand what evidence is and is not. Most people simply don’t understand what evidence actually is because they are not intelligent enough to understand it. What most people, especially the media, consider to be evidence is simply testimonial evidence offered by an authority about the actual evidence. But a fair amount of the statistical evidence\nis already right in front of everyone\n, they just don’t have the math to understand it or its significance.\nMaria Bartiromo: How did you respond to Tucker Carlson? Did you get angry with the show because they texted you and asked you to provide evidence of what you’re alleging?\nSidney Powell: No, I didn’t get angry with the request to provide evidence in fact I sent an affidavit to Tucker that I had not even attached to a pleading yet to help him understand the situation and I offered him another witness who could explain the mathematics of the statistical evidence far better than I can. I’m not really a numbers person. But he was very insulting, demanding and rude and I told him not to contact me again in those terms.",
  "tags": [
    "cuckservative"
  ],
  "categories": [],
  "sitemap_lastmod": "2020-11-20T16:18:24+00:00"
}