{
  "url": "https://voxday.net/2004/10/06/because-they-have-to/",
  "scraped_at": "2025-12-19T20:48:35.222323",
  "title": "Because they have to",
  "date_display": "October 6, 2004",
  "date_iso": "2004-10-06T15:04:00+00:00",
  "date_from_url": "2004-10-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>…since Wife Swap and Trading Spouses focus on how each mom performs on the cooking/cleaning/childcare front, it’s no surprise the stay-at-home moms look like wizards, while the working (or shopping) moms bumble around like Abbott and Costello. This is, of course, hilarious, but it ignores the fact that most women work because they have to. Turning those women into villains <a href=\"http://slate.msn.com/id/2107510/\">moves the feminist debate sideways</a>, rather than forward.</br></p><p>The surprise in both shows is that some people actually do change. When Jodi simply offloads all the cleaning and cooking onto Lynn’s husband, Brad, he does it. And suddenly realizes what his wife has endured for years. He recognizes what a jerk he’s been in expecting either Jodi, or his wife, to do all the housework alone. Even Jodi has a tender moment with the Bradley girls and some cookie batter—generously recognizing that both cooking and children are not just for poor people anymore.</p><p>Steve Spolansky has no such revelation—not even when his young son’s face lights up like heartbreak in Yankee Stadium on learning his dad might actually be dining at home for a week. Steve dismisses Lynn and her values as “hillbilly.” He’s worked hard for the right to neglect his kids and disparage his bride. Confronted with a “good mom,” he writes her off as an anachronism. Steve’s failure to learn anything from the swap stands in stark contrast to Brad’s realization that he treated Lynn like a doormat, to Lynn’s realization that she allowed herself to be treated like a doormat, and to Jodi’s realization that her kids aren’t short houseplants.<br/></p></blockquote><p>This is all a vaguely interesting form of social experiment as long as I don’t have to watch any of it.  But what I found interesting about this article on Slate was the admission that “most women work because they have to.”  And why is that?</p><p>Because inflation and taxes have dramatically increased the family cost of living.  Why have inflation and taxes increased?</p><p>Because the government is creating and spending more money.  Why is the government creating and spending more money?</p><p>Because the voting populace demands it.  Why does the voting populace demand it?  I’ll answer in the form of a question.  What is the single greatest change in the voting populace in the time that <a href=\"http://www.voxday.net/archive/2003/082503.html\">government spending per capita has increased 250-fold</a> and the dollar has lost 95 percent of its value after remaining essentially stable over its first 120 years?</p><p>I leave it to you to figure it out.<br/></p></div>",
  "content_text": "…since Wife Swap and Trading Spouses focus on how each mom performs on the cooking/cleaning/childcare front, it’s no surprise the stay-at-home moms look like wizards, while the working (or shopping) moms bumble around like Abbott and Costello. This is, of course, hilarious, but it ignores the fact that most women work because they have to. Turning those women into villains\nmoves the feminist debate sideways\n, rather than forward.\nThe surprise in both shows is that some people actually do change. When Jodi simply offloads all the cleaning and cooking onto Lynn’s husband, Brad, he does it. And suddenly realizes what his wife has endured for years. He recognizes what a jerk he’s been in expecting either Jodi, or his wife, to do all the housework alone. Even Jodi has a tender moment with the Bradley girls and some cookie batter—generously recognizing that both cooking and children are not just for poor people anymore.\nSteve Spolansky has no such revelation—not even when his young son’s face lights up like heartbreak in Yankee Stadium on learning his dad might actually be dining at home for a week. Steve dismisses Lynn and her values as “hillbilly.” He’s worked hard for the right to neglect his kids and disparage his bride. Confronted with a “good mom,” he writes her off as an anachronism. Steve’s failure to learn anything from the swap stands in stark contrast to Brad’s realization that he treated Lynn like a doormat, to Lynn’s realization that she allowed herself to be treated like a doormat, and to Jodi’s realization that her kids aren’t short houseplants.\nThis is all a vaguely interesting form of social experiment as long as I don’t have to watch any of it.  But what I found interesting about this article on Slate was the admission that “most women work because they have to.”  And why is that?\nBecause inflation and taxes have dramatically increased the family cost of living.  Why have inflation and taxes increased?\nBecause the government is creating and spending more money.  Why is the government creating and spending more money?\nBecause the voting populace demands it.  Why does the voting populace demand it?  I’ll answer in the form of a question.  What is the single greatest change in the voting populace in the time that\ngovernment spending per capita has increased 250-fold\nand the dollar has lost 95 percent of its value after remaining essentially stable over its first 120 years?\nI leave it to you to figure it out.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-10-06T14:04:00+00:00"
}