{
  "url": "https://voxday.net/2004/10/29/court-reform-not-tort-refor/",
  "scraped_at": "2025-12-19T20:51:26.612529",
  "title": "Court reform, not tort reform",
  "date_display": "October 29, 2004",
  "date_iso": "2004-10-29T08:29:00+00:00",
  "date_from_url": "2004-10-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Double-M worries about the lawyers:<br/></p><blockquote><p> <br>God’s perfect government is a kingship and that king is perfectly righteous.  That will be Jesus, of course.  For now, we must attempt to limit the government that will be used to oppress us.  Not only the Christians in this land but all men will become victims.  I do agree with you on this completely.  I suppose that my issue is what place does law play in the Libertarian philosophy?</br></p><p>I think you may agree that those who say you cannot legislate morality are being foolish or just singling out one or two issues.  If you pass a law that says it is illegal to steal my hubcaps, then you are legislating morality.</p><p>What does the Libertarian Party say about tort reform?  what does it say that it will do with the hundreds of thousands of tax suckers that are government employees that should be fired and put back into the private sector?  Of course, lawyers must be brought under control to some extent.  This will clearly involve a major removal of corrupt judges from the Supreme Court and in the lower courts, as well.  How will this be done?  Our present legal and political systems are so corrupt that I do not see much hope for even gradual change in the right direction.  I do believe that it is heinous that the other party nominees were not allowed into the debate structure.  This is the problem, corrupt people, corrupt system.  Christians make the mistake of believing that a political party will somehow continue to make their lives comfortable.<br/></p></blockquote><p>What does the libertarian philosophy say?  For starters, it says can about 95 percent of the federal employees, including those working in the courts.  Fire the judicial employees at the state level too.  The court system is so utterly corrupt that even the lawyers have no idea how ubelievably bad it is.  Forget the lawyers, it’s the judges that are the real problem.  An acquaintance of mine went into court for a hearing recently and began by demanding to know whether constitutional law trumped statutory law in the judge’s court or not… the judge, of course, evaded like mad and finally declared that it wasn’t his job to answer the question.</p><p>Oh, really?  How very… educational.</p><p>The best way to sum it up is that what you hear from the seeming whackos bears far more resemblance to the truth than what you’ll hear from the lawyers, with one exception.  When a lawyer tells you that what the judge says in his court is the law, he is correct – but only in that court provided you have voluntarily submitted to the court’s jurisdiction.  What no lawyer will ever tell you is that most of the time, you don’t have to do so.  Of course, this is similar to how a common law libertarian system should work, except that the two parties would simply agree upon a judge instead of having the state assign one to them.</p><p>This is why it is usually a mistake to be represented by a lawyer.  Most of them have no idea what is really going on, they are fighting the wrong battles and they will not wage the proper ones because they’ll be disciplined by the bar if they open Pandora’s Box and inadvertantly let the truth out.  My best friend is a lawyer and he was shocked to learn how completely his legal training had failed him.  I haven’t read Judge Andrew Napolitano’s book yet – full disclosure: we will likely share a publisher soon – but <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=41118\">based on the description</a>, I suspect he’s discussing some of the more obvious and less egregious aspects of this cancerous court corruption.</p><p>With regards to tort reform, in my opinion the Republicans are doing little more than talking about spraying perfume on a rotted corpse.  It’s not a bad thing and it will help the room smell a little better, but it’s still beside the point.<br/></p></div>",
  "content_text": "Double-M worries about the lawyers:\nGod’s perfect government is a kingship and that king is perfectly righteous.  That will be Jesus, of course.  For now, we must attempt to limit the government that will be used to oppress us.  Not only the Christians in this land but all men will become victims.  I do agree with you on this completely.  I suppose that my issue is what place does law play in the Libertarian philosophy?\nI think you may agree that those who say you cannot legislate morality are being foolish or just singling out one or two issues.  If you pass a law that says it is illegal to steal my hubcaps, then you are legislating morality.\nWhat does the Libertarian Party say about tort reform?  what does it say that it will do with the hundreds of thousands of tax suckers that are government employees that should be fired and put back into the private sector?  Of course, lawyers must be brought under control to some extent.  This will clearly involve a major removal of corrupt judges from the Supreme Court and in the lower courts, as well.  How will this be done?  Our present legal and political systems are so corrupt that I do not see much hope for even gradual change in the right direction.  I do believe that it is heinous that the other party nominees were not allowed into the debate structure.  This is the problem, corrupt people, corrupt system.  Christians make the mistake of believing that a political party will somehow continue to make their lives comfortable.\nWhat does the libertarian philosophy say?  For starters, it says can about 95 percent of the federal employees, including those working in the courts.  Fire the judicial employees at the state level too.  The court system is so utterly corrupt that even the lawyers have no idea how ubelievably bad it is.  Forget the lawyers, it’s the judges that are the real problem.  An acquaintance of mine went into court for a hearing recently and began by demanding to know whether constitutional law trumped statutory law in the judge’s court or not… the judge, of course, evaded like mad and finally declared that it wasn’t his job to answer the question.\nOh, really?  How very… educational.\nThe best way to sum it up is that what you hear from the seeming whackos bears far more resemblance to the truth than what you’ll hear from the lawyers, with one exception.  When a lawyer tells you that what the judge says in his court is the law, he is correct – but only in that court provided you have voluntarily submitted to the court’s jurisdiction.  What no lawyer will ever tell you is that most of the time, you don’t have to do so.  Of course, this is similar to how a common law libertarian system should work, except that the two parties would simply agree upon a judge instead of having the state assign one to them.\nThis is why it is usually a mistake to be represented by a lawyer.  Most of them have no idea what is really going on, they are fighting the wrong battles and they will not wage the proper ones because they’ll be disciplined by the bar if they open Pandora’s Box and inadvertantly let the truth out.  My best friend is a lawyer and he was shocked to learn how completely his legal training had failed him.  I haven’t read Judge Andrew Napolitano’s book yet – full disclosure: we will likely share a publisher soon – but\nbased on the description\n, I suspect he’s discussing some of the more obvious and less egregious aspects of this cancerous court corruption.\nWith regards to tort reform, in my opinion the Republicans are doing little more than talking about spraying perfume on a rotted corpse.  It’s not a bad thing and it will help the room smell a little better, but it’s still beside the point.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-10-29T07:29:00+00:00"
}