{
  "url": "https://voxday.net/2004/10/04/evil-of-disney/",
  "scraped_at": "2025-12-19T20:48:20.443781",
  "title": "The evil of Disney",
  "date_display": "October 4, 2004",
  "date_iso": "2004-10-04T08:29:00+00:00",
  "date_from_url": "2004-10-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I loathe Disney.  I won’t go to Disneyworld, I have no trouble avoiding their increasingly awful children’s films and I think they are the poster child for the way in which corporate evil invades and destroys entrepeneurial creations like a cancer.  Harvey Weinstein is not someone I hold in high regard, but it’s interesting <a href=\"http://newyorkmetro.com/nymetro/news/people/features/9985/index1.html\">to catch a glimpse</a> into the deceitful operation of the most pernicious of the evil corporate empires.<br/></p><blockquote><p> <br>When came the epic dustup over Michael Moore’s Fahrenheit 9/11. On May 12, 2003, a Disney executive sent Harvey Wein-stein a letter saying, “You cannot release this movie.” Four days later, another letter was sent. This one outlined why Miramax would not be allowed to release the film—it was a “restrictive picture” under the Miramax-Disney contract, it was politically partisan, etc.—and instructed Miramax to divest itself of its interest in the project.</br></p><p>Weinstein, all sides agree, went ahead and funded the movie anyway. And, according to Disney, Weinstein hid the $6 million budget in other projects. In this version, Eisner found out about Miramax’s continued involvement only when Weinstein casually mentioned that he’d like his boss to take a look at the film as the two men were strolling toward an elevator bank in Disney’s California headquarters.</p><p>The problem is, it’s not true. Costs associated with the movie weren’t hidden; indeed, quarterly budget reports sent from Miramax to Disney in 2003 include a line item for “FAHRENHEIT 911” complete with a film code (“M1621”), a date of first cost (“FY03 Q3”), and a tentative release date (“Oct-04”). Moore even said publicly the checks came from Burbank. (Disney never produced for me the reports where Fahrenheit 9/11 supposedly should have appeared but didn’t; a spokeswoman told me I was “naïve” and “in the tank” when I explained I’d need to see the reports myself.)<br/></p></blockquote><p>I would have thought it was naive to take Disney’s word for it, in light of how it contradicts the evidence.  But Black is white in the new Disney.  Keep that in mind the next time your child wants to see the latest talking animal film.  They think of the children all the time, though not exactly in the manner in which a parent would wish.<br/></p></div>",
  "content_text": "I loathe Disney.  I won’t go to Disneyworld, I have no trouble avoiding their increasingly awful children’s films and I think they are the poster child for the way in which corporate evil invades and destroys entrepeneurial creations like a cancer.  Harvey Weinstein is not someone I hold in high regard, but it’s interesting\nto catch a glimpse\ninto the deceitful operation of the most pernicious of the evil corporate empires.\nWhen came the epic dustup over Michael Moore’s Fahrenheit 9/11. On May 12, 2003, a Disney executive sent Harvey Wein-stein a letter saying, “You cannot release this movie.” Four days later, another letter was sent. This one outlined why Miramax would not be allowed to release the film—it was a “restrictive picture” under the Miramax-Disney contract, it was politically partisan, etc.—and instructed Miramax to divest itself of its interest in the project.\nWeinstein, all sides agree, went ahead and funded the movie anyway. And, according to Disney, Weinstein hid the $6 million budget in other projects. In this version, Eisner found out about Miramax’s continued involvement only when Weinstein casually mentioned that he’d like his boss to take a look at the film as the two men were strolling toward an elevator bank in Disney’s California headquarters.\nThe problem is, it’s not true. Costs associated with the movie weren’t hidden; indeed, quarterly budget reports sent from Miramax to Disney in 2003 include a line item for “FAHRENHEIT 911” complete with a film code (“M1621”), a date of first cost (“FY03 Q3”), and a tentative release date (“Oct-04”). Moore even said publicly the checks came from Burbank. (Disney never produced for me the reports where Fahrenheit 9/11 supposedly should have appeared but didn’t; a spokeswoman told me I was “naïve” and “in the tank” when I explained I’d need to see the reports myself.)\nI would have thought it was naive to take Disney’s word for it, in light of how it contradicts the evidence.  But Black is white in the new Disney.  Keep that in mind the next time your child wants to see the latest talking animal film.  They think of the children all the time, though not exactly in the manner in which a parent would wish.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-10-04T07:29:00+00:00"
}