{
  "url": "https://voxday.net/2004/10/12/fred-on-therapy/",
  "scraped_at": "2025-12-19T20:49:23.468680",
  "title": "Fred on Therapy",
  "date_display": "October 12, 2004",
  "date_iso": "2004-10-12T11:21:00+00:00",
  "date_from_url": "2004-10-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>I have sat in on therapy. It is something to see. For starters, the whole routine is <a href=\"http://www.fredoneverything.net/UniversalTherapy.shtml\">a vaguely sadomasochistic power trip</a>. The Therapist is the domme, the patient a humble supplicant who must bare her soul, confess her psychic sins, embarrass herself, and obey. (A few New Age males go in for this stuff. It is overwhelmingly a woman’s racket.)</br></p><p>Therapy reminds me of nothing so much as a castrated religious order. There is the same proselytizing, the same zeal. Therapists see only two classes of people, those who are in therapy and those who ought to be. (“Are you saved?”) They exhibit the smug assurance of those who have seen the light, and have Truth in a half-Nelson. The difference is that, whereas religions usually say that you are responsible for your bad behavior and you ought to stop it, therapy tells you that you are never responsible for anything. No. It was your childhood. Or some chemical imbalance. The Church of Avoided Guilt.</p><p>The cult wants to get everybody. Repeatedly therapists assert that ninety-five percent of people suffer from “codependency,” and must go into counseling. See? We are all in a state of sin. The humiliation of baring one’s inmost thoughts to a condescending estrogenated Hitleress is a mix of self-flagellation and the rite of confession. It is the religious impulse de-Godded.<br/></p></blockquote><p>Therapy is nothing but a racket for the credulous.  It does no good for anyone.  Unlike medicine, one is never cured, but instead an addiction to being told that nothing is your fault is fostered.  I’m convinced that 99 percent of the quasi-lunatics in therapy would be better off either a) being sent on a missions trip to an impoverished land where people actually have problems or b) getting a dog.</p><p>The only benefit to therapy is in the case of couples, where a third party referee can be helpful.  But even then, you’d do just as well – better, probably – simply pulling in a stranger off the street.<br/></p></div>",
  "content_text": "I have sat in on therapy. It is something to see. For starters, the whole routine is\na vaguely sadomasochistic power trip\n. The Therapist is the domme, the patient a humble supplicant who must bare her soul, confess her psychic sins, embarrass herself, and obey. (A few New Age males go in for this stuff. It is overwhelmingly a woman’s racket.)\nTherapy reminds me of nothing so much as a castrated religious order. There is the same proselytizing, the same zeal. Therapists see only two classes of people, those who are in therapy and those who ought to be. (“Are you saved?”) They exhibit the smug assurance of those who have seen the light, and have Truth in a half-Nelson. The difference is that, whereas religions usually say that you are responsible for your bad behavior and you ought to stop it, therapy tells you that you are never responsible for anything. No. It was your childhood. Or some chemical imbalance. The Church of Avoided Guilt.\nThe cult wants to get everybody. Repeatedly therapists assert that ninety-five percent of people suffer from “codependency,” and must go into counseling. See? We are all in a state of sin. The humiliation of baring one’s inmost thoughts to a condescending estrogenated Hitleress is a mix of self-flagellation and the rite of confession. It is the religious impulse de-Godded.\nTherapy is nothing but a racket for the credulous.  It does no good for anyone.  Unlike medicine, one is never cured, but instead an addiction to being told that nothing is your fault is fostered.  I’m convinced that 99 percent of the quasi-lunatics in therapy would be better off either a) being sent on a missions trip to an impoverished land where people actually have problems or b) getting a dog.\nThe only benefit to therapy is in the case of couples, where a third party referee can be helpful.  But even then, you’d do just as well – better, probably – simply pulling in a stranger off the street.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-10-12T10:21:00+00:00"
}