{
  "url": "https://voxday.net/2004/10/05/george-lucas-hates-you/",
  "scraped_at": "2025-12-19T20:48:31.564218",
  "title": "George Lucas hates you",
  "date_display": "October 5, 2004",
  "date_iso": "2004-10-05T14:08:00+00:00",
  "date_from_url": "2004-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>THE 1997 SPECIAL EDITION release of Star Wars included a new scene where Han Solo encounters Jabba the Hut on Tatooine. Solo owes Jabba money, and has just killed a bounty hunter sent after him by the Hut. Running into one another in a hangar, Solo and Jabba banter and eventually reach an agreement whereby Jabba lets him go on the condition that Solo repay him with hefty interest.</br></p><p><a href=\"http://www.weeklystandard.com/Content/Public/Articles/000/000/004/704jyoti.asp?pg=2\">This seems like a small change</a>, but it sets off a chain reaction which undermines the basic arc of Han Solo’s character: Throughout the Star Wars series, Solo is on the run from an implacable gangster who wants him dead. This deathmark influences his decisions and is what makes him a skittish, mercenary scoundrel. Solo is the type of guy who has to look around every corner. But now that he has a deal with Jabba the Hut, none of that makes sense. Han isn’t being chased by bounty hunters and can go square with Jabba any time he likes. As a result, his character loses a good bit of danger and romance.</p><p>(As an aside, it’s worth noting that this new scene also manages to confuse the character of Jabba himself. When the great Hut made his first appearance in 1983 in Return of the Jedi, he<br> <br>is a crass, stupid bully. In the Special Edition scene grafted onto the original Star Wars, he’s a smooth-talking, genial Mafioso. Will the real Jabba please stand up?)</br></br></p><p>…it is a measure of the deleterious effects of Lucas’s tinkering (and the awfulness of the prequels) that it is difficult to care about Star Wars anymore.  Twenty years ago that would have sounded like heresy. People growing up in the 1970s and ’80s committed Star Wars to memory and developed a cult around the movies (for instance, the band which performs the theme song to Buffy the Vampire Slayer is called “Nerf Herder,” an epithet Leia uses to describe Han in Empire). Strangely enough, the cultural space Star Wars occupies has shrunk in recent years. People who were weaned on the originals have become disenchanted, and Lucas’s revised versions aren’t minting many new fans.<br/></p></blockquote><p>Count me as one of those burying their heads in the sand, pretending that the “prequels” never happened.  I loathed the first prequel and have so blocked it out of my memory that I can’t even tell you what it’s called off the top of my head.  I didn’t bother seeing the second one.  As a matter of fact, I thought that Jedi pretty much sucked when it came out too.  The Ewoks throwing rocks at Storm Troopers was just too stupid for words, even if the jet bikes were pretty cool.  (Perhaps a bigger problem was that I was old enough to realize that Princess Leia was not, in fact, attractive in any way, shape or form except perhaps to stocky female softball players.</p><p>I don’t think there’s any question that the faithfulness Peter Jackson showed to The Lord of the Rings – even his errors must be excused as the sort made in good faith – make the LOTR movies far superior to even the original Star Wars trilogy.  I will always love those first two movies, but it would have been better if Lucas had left us bereft and wishing for more instead of revealing that there was, after all, no magician behind the curtain.<br/></p></div>",
  "content_text": "THE 1997 SPECIAL EDITION release of Star Wars included a new scene where Han Solo encounters Jabba the Hut on Tatooine. Solo owes Jabba money, and has just killed a bounty hunter sent after him by the Hut. Running into one another in a hangar, Solo and Jabba banter and eventually reach an agreement whereby Jabba lets him go on the condition that Solo repay him with hefty interest.\nThis seems like a small change\n, but it sets off a chain reaction which undermines the basic arc of Han Solo’s character: Throughout the Star Wars series, Solo is on the run from an implacable gangster who wants him dead. This deathmark influences his decisions and is what makes him a skittish, mercenary scoundrel. Solo is the type of guy who has to look around every corner. But now that he has a deal with Jabba the Hut, none of that makes sense. Han isn’t being chased by bounty hunters and can go square with Jabba any time he likes. As a result, his character loses a good bit of danger and romance.\n(As an aside, it’s worth noting that this new scene also manages to confuse the character of Jabba himself. When the great Hut made his first appearance in 1983 in Return of the Jedi, he\nis a crass, stupid bully. In the Special Edition scene grafted onto the original Star Wars, he’s a smooth-talking, genial Mafioso. Will the real Jabba please stand up?)\n…it is a measure of the deleterious effects of Lucas’s tinkering (and the awfulness of the prequels) that it is difficult to care about Star Wars anymore.  Twenty years ago that would have sounded like heresy. People growing up in the 1970s and ’80s committed Star Wars to memory and developed a cult around the movies (for instance, the band which performs the theme song to Buffy the Vampire Slayer is called “Nerf Herder,” an epithet Leia uses to describe Han in Empire). Strangely enough, the cultural space Star Wars occupies has shrunk in recent years. People who were weaned on the originals have become disenchanted, and Lucas’s revised versions aren’t minting many new fans.\nCount me as one of those burying their heads in the sand, pretending that the “prequels” never happened.  I loathed the first prequel and have so blocked it out of my memory that I can’t even tell you what it’s called off the top of my head.  I didn’t bother seeing the second one.  As a matter of fact, I thought that Jedi pretty much sucked when it came out too.  The Ewoks throwing rocks at Storm Troopers was just too stupid for words, even if the jet bikes were pretty cool.  (Perhaps a bigger problem was that I was old enough to realize that Princess Leia was not, in fact, attractive in any way, shape or form except perhaps to stocky female softball players.\nI don’t think there’s any question that the faithfulness Peter Jackson showed to The Lord of the Rings – even his errors must be excused as the sort made in good faith – make the LOTR movies far superior to even the original Star Wars trilogy.  I will always love those first two movies, but it would have been better if Lucas had left us bereft and wishing for more instead of revealing that there was, after all, no magician behind the curtain.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-10-05T13:08:00+00:00"
}