{
  "url": "https://voxday.net/2004/10/05/hack-on-rumsfeld-and-coming-draf/",
  "scraped_at": "2025-12-19T20:48:29.675269",
  "title": "Hack on Rumsfeld and the coming draft",
  "date_display": "October 5, 2004",
  "date_iso": "2004-10-05T13:04:00+00:00",
  "date_from_url": "2004-10-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>Recently, when John Kerry brought up the possibility of a return to the draft, SecDef Donald Rumsfeld was quick to respond that Kerry was full of it. But <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=40770\">my take is that Kerry is right on the mark</a>. Not only because Rummy has been flat wrong on every major military call regarding Iraq, but because this is a war that won’t be won by smart weapons or the sledgehammer firepower we see every night on the tube….</br></p><p>Rumsfeld, in fact, has already kicked off the anti-draft campaign by denigrating the draftees who fought in Vietnam. The SecDef, who prefers sycophants who don’t ask questions, recently stated that Vietnam-era draftees added “No value, no advantage, really, to the United States armed services … because … it took an enormous amount of effort in terms of training, and then they were gone.”</p><p>Wrong once again. I led draftees for almost four years in Vietnam and for several years during the Korean War. If well-led, there are no finer soldiers. Ask the Nazis, the Japanese and the Reds in Korea and in Vietnam, where “no value” draftees cleaned their clocks in fight after fight.  Israel, a country that has lived under the barrel of the Islamic terrorist gun for decades, has the most combat-experienced counterinsurgent force in the world – and boy and girl draftees are its major resource.</p><p>Count on it. We will follow their lead.<br/></p></blockquote><p>I’ve already written volumes on internment, but a draft is an equally unconscionable violation of life and property rights.  If a society will not defend itself voluntarily, it deserves to fall.  I suspect that unless the “war” is dialed down, and soon, Hackworth’s logic will become undeniable.  But it’s not a Democrat vs Republican thing; both parties will join forces in declaring that it is necessary and cram it down America’s throat while the sheep on both sides bleat their approval because their masters have spoken.</p><p>By the way, I’ve noticed in the past that some knee-jerk Republicans who pride themselves on their “support for the troops” don’t hesitate to sully themselves by slinging mud at Hackworth for doing what he has always done, standing up for the enlisted whose lives are on the line, even in the face of the military and civilian leadership.  Take a good close look at his record and examine his well-documented expertise before embarrassing yourself by criticizing him rather than his arguments.<br/></p></div>",
  "content_text": "Recently, when John Kerry brought up the possibility of a return to the draft, SecDef Donald Rumsfeld was quick to respond that Kerry was full of it. But\nmy take is that Kerry is right on the mark\n. Not only because Rummy has been flat wrong on every major military call regarding Iraq, but because this is a war that won’t be won by smart weapons or the sledgehammer firepower we see every night on the tube….\nRumsfeld, in fact, has already kicked off the anti-draft campaign by denigrating the draftees who fought in Vietnam. The SecDef, who prefers sycophants who don’t ask questions, recently stated that Vietnam-era draftees added “No value, no advantage, really, to the United States armed services … because … it took an enormous amount of effort in terms of training, and then they were gone.”\nWrong once again. I led draftees for almost four years in Vietnam and for several years during the Korean War. If well-led, there are no finer soldiers. Ask the Nazis, the Japanese and the Reds in Korea and in Vietnam, where “no value” draftees cleaned their clocks in fight after fight.  Israel, a country that has lived under the barrel of the Islamic terrorist gun for decades, has the most combat-experienced counterinsurgent force in the world – and boy and girl draftees are its major resource.\nCount on it. We will follow their lead.\nI’ve already written volumes on internment, but a draft is an equally unconscionable violation of life and property rights.  If a society will not defend itself voluntarily, it deserves to fall.  I suspect that unless the “war” is dialed down, and soon, Hackworth’s logic will become undeniable.  But it’s not a Democrat vs Republican thing; both parties will join forces in declaring that it is necessary and cram it down America’s throat while the sheep on both sides bleat their approval because their masters have spoken.\nBy the way, I’ve noticed in the past that some knee-jerk Republicans who pride themselves on their “support for the troops” don’t hesitate to sully themselves by slinging mud at Hackworth for doing what he has always done, standing up for the enlisted whose lives are on the line, even in the face of the military and civilian leadership.  Take a good close look at his record and examine his well-documented expertise before embarrassing yourself by criticizing him rather than his arguments.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-10-05T12:04:00+00:00"
}