{
  "url": "https://voxday.net/2004/10/30/islamo-fascists/",
  "scraped_at": "2025-12-19T20:51:32.114554",
  "title": "Islamo-fascists",
  "date_display": "October 30, 2004",
  "date_iso": "2004-10-30T08:29:00+00:00",
  "date_from_url": "2004-10-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It occurred to me this morning what a stupid, stupid name this is for those against whom the administration is waging its so-called War on Terror.  For one thing, does this sound like part of the “islamo-fascist” platform to you?</p><p><em>a) Universal suffrage polled on a regional basis, with proportional representation and voting and electoral office eligibility for women.</em></p><p>Hmmmm, not exactly.  But that was the very first item in <a href=\"http://www.voxday.net/archive/2004/062804.html\">the Manifesto of the Fascist Struggle</a>.  Fascism was a populist demagogic industrial-age force which was very concerned with economic distribution and relied on targeting the easily manipulated, rather like today’s Democratic party.  The global jihad, on the other hand, is pre-industrial, has no concern with or concept of economics and relies on snuff videos for its appeal.</p><p><em>b) The seizure of all the possessions of the religious congregations and the abolition of all the bishoprics, which constitute an enormous liability on the Nation and on the privileges of the poor.</em></p><p>Here, too, is a massive difference.  Fascism was secular and anti-clerical, not a religious movement run by clerics.  In fact, when one examines the comparison, one realizes that there is almost nothing fascist about the jihadists, except that both are staunchly opposed to freedom and human liberty.   But then, one might as easily call them islamo-communists, islamo-democrats or islamo-republicans, and with as much accuracy.  Which is to say, none.  Or almost none, to be precise.  Iran is an Islamic Republic, after all.</p><p>The truth is that they are precisely what they claim to be, islamic jihadists.  Jihadist is what they call themselves and that is what they should be called by others.  “Islamo-fascist” is not only an unwieldy and inaccurate label it is a craven attempt to place the focus somewhere else than on the religious aspect of those who have declared war on the West.<br/></p></div>",
  "content_text": "It occurred to me this morning what a stupid, stupid name this is for those against whom the administration is waging its so-called War on Terror.  For one thing, does this sound like part of the “islamo-fascist” platform to you?\na) Universal suffrage polled on a regional basis, with proportional representation and voting and electoral office eligibility for women.\nHmmmm, not exactly.  But that was the very first item in\nthe Manifesto of the Fascist Struggle\n.  Fascism was a populist demagogic industrial-age force which was very concerned with economic distribution and relied on targeting the easily manipulated, rather like today’s Democratic party.  The global jihad, on the other hand, is pre-industrial, has no concern with or concept of economics and relies on snuff videos for its appeal.\nb) The seizure of all the possessions of the religious congregations and the abolition of all the bishoprics, which constitute an enormous liability on the Nation and on the privileges of the poor.\nHere, too, is a massive difference.  Fascism was secular and anti-clerical, not a religious movement run by clerics.  In fact, when one examines the comparison, one realizes that there is almost nothing fascist about the jihadists, except that both are staunchly opposed to freedom and human liberty.   But then, one might as easily call them islamo-communists, islamo-democrats or islamo-republicans, and with as much accuracy.  Which is to say, none.  Or almost none, to be precise.  Iran is an Islamic Republic, after all.\nThe truth is that they are precisely what they claim to be, islamic jihadists.  Jihadist is what they call themselves and that is what they should be called by others.  “Islamo-fascist” is not only an unwieldy and inaccurate label it is a craven attempt to place the focus somewhere else than on the religious aspect of those who have declared war on the West.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-10-30T07:29:00+00:00"
}