{
  "url": "https://voxday.net/2004/10/27/mailvox-america-is-not-primary-targe/",
  "scraped_at": "2025-12-19T20:51:13.756341",
  "title": "Mailvox: America is not the primary target",
  "date_display": "October 27, 2004",
  "date_iso": "2004-10-27T18:41:00+00:00",
  "date_from_url": "2004-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>bls has a question:<br/></p><blockquote><p> <br>“What is it about my support of Bush’s crusade against Islamic terror that renders me unable to be a conservative by any meaningful definition of the word?”<br/></br></p></blockquote><p>Utopian nation-building by force is inherently a progressive, totalitarian action.  There is nothing conservative about it.  It violates the Washingtonian principle of not getting involved in entangling alliances, the isolationist principle and the national sovereignty principle.  One will not find any support for it in conservative philosophers such as Burke, Kirk or Tocqueville.</p><p>In other words, you’re casting aside conservatism for progressive liberalism, albeit in the name of national security.  There’s nothing conservative about that, some variant of the “national security” argument has been used to justify otherwise unpopular political actions since the days of the Roman Republic.</p><p>Another problem with the self-defense justification is that the global jihad is not truly targeting America, like China, it primarily wants America out of the way in order to pursue its real goals.  In the case of the jihad, that goal is reclaiming the lost lands of Islam in a reverse reconquest of Europe.  Their communications are quite clear about this, as even Israel is secondary to that goal, which is very different than older terrorist organizations like the more provincial PLO and Hamas.  9/11 was nothing more than a shot across the bow and a flexing of muscle, much like Pearl Harbor was intended to be on the part of the Japanese.  The global jihadists would surely like to see the black flag of Islam raised over the entire Earth, but they are practical enough to be focused on lands where they have a sizeable minority, such as Nigeria.</p><p>I believe that’s why they haven’t bothered making any attacks in the USA for over three years now, because the US itself is a tertiary concern and the warning shot turned out to be at least somewhat counterproductive.  If/when the jihad perceives that the Bush administration is making a serious dent in their ability to strike where they want, that is the point at which they would likely turn their attention to the United States again.  Occam’s Razor strongly suggests this is the most logical explanation, as the almost complete absence of real arrests resulting in prosecutions inside the United States combined with de facto open borders means that concluding American counterterrorism agents are far more successful than their much more experienced Israeli counterparts is unlikely to be anything but wishful thinking.</p><p>To be honest, I think the entire American public debate on the subject is almost entirely worthless.  I mean, giving “they hate our freedom” as an explanation is so transparently stupid, and is almost completely contrary to the history of Islamic conquest.  Basically, it’s safe to assume that any explanation relying on the notion of human beings being completely insane is incorrect.</p><p>A minor tangent, sorry, but I think I answered your question somewhere in there….</p><p>UPDATE: for a good article touching on what conservatism was perceived by one who is strangely considered a hero by many of today’s conservatives, Hayek’s “<a href=\"http://www.fahayek.org/index.php?article=177\">Why I am not a Conservative</a>” is well worth reading.  I have no doubt that he’d be voting for Badnarik, were he alive today, as the Libertarians are the clear intellectual heirs to the Old Whigs of whom Hayek speaks so favorably.</p></div>",
  "content_text": "bls has a question:\n“What is it about my support of Bush’s crusade against Islamic terror that renders me unable to be a conservative by any meaningful definition of the word?”\nUtopian nation-building by force is inherently a progressive, totalitarian action.  There is nothing conservative about it.  It violates the Washingtonian principle of not getting involved in entangling alliances, the isolationist principle and the national sovereignty principle.  One will not find any support for it in conservative philosophers such as Burke, Kirk or Tocqueville.\nIn other words, you’re casting aside conservatism for progressive liberalism, albeit in the name of national security.  There’s nothing conservative about that, some variant of the “national security” argument has been used to justify otherwise unpopular political actions since the days of the Roman Republic.\nAnother problem with the self-defense justification is that the global jihad is not truly targeting America, like China, it primarily wants America out of the way in order to pursue its real goals.  In the case of the jihad, that goal is reclaiming the lost lands of Islam in a reverse reconquest of Europe.  Their communications are quite clear about this, as even Israel is secondary to that goal, which is very different than older terrorist organizations like the more provincial PLO and Hamas.  9/11 was nothing more than a shot across the bow and a flexing of muscle, much like Pearl Harbor was intended to be on the part of the Japanese.  The global jihadists would surely like to see the black flag of Islam raised over the entire Earth, but they are practical enough to be focused on lands where they have a sizeable minority, such as Nigeria.\nI believe that’s why they haven’t bothered making any attacks in the USA for over three years now, because the US itself is a tertiary concern and the warning shot turned out to be at least somewhat counterproductive.  If/when the jihad perceives that the Bush administration is making a serious dent in their ability to strike where they want, that is the point at which they would likely turn their attention to the United States again.  Occam’s Razor strongly suggests this is the most logical explanation, as the almost complete absence of real arrests resulting in prosecutions inside the United States combined with de facto open borders means that concluding American counterterrorism agents are far more successful than their much more experienced Israeli counterparts is unlikely to be anything but wishful thinking.\nTo be honest, I think the entire American public debate on the subject is almost entirely worthless.  I mean, giving “they hate our freedom” as an explanation is so transparently stupid, and is almost completely contrary to the history of Islamic conquest.  Basically, it’s safe to assume that any explanation relying on the notion of human beings being completely insane is incorrect.\nA minor tangent, sorry, but I think I answered your question somewhere in there….\nUPDATE: for a good article touching on what conservatism was perceived by one who is strangely considered a hero by many of today’s conservatives, Hayek’s “\nWhy I am not a Conservative\n” is well worth reading.  I have no doubt that he’d be voting for Badnarik, were he alive today, as the Libertarians are the clear intellectual heirs to the Old Whigs of whom Hayek speaks so favorably.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-10-27T17:41:00+00:00"
}