{
  "url": "https://voxday.net/2004/10/27/on-book-front_27/",
  "scraped_at": "2025-12-19T20:51:10.116075",
  "title": "On the book front",
  "date_display": "October 27, 2004",
  "date_iso": "2004-10-27T15:30:00+00:00",
  "date_from_url": "2004-10-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Things are looking pretty good for the political book.  It’s not definite yet, but we’re over the previous hurdle and it should be confirmed soon.  It is definite that my artillery will be, shall we say, <em>guided</em> in one direction, however, on this first book.  I don’t have a problem with that as it’s the publisher’s call and I’ll be perfectly content to save some of the material I’ve already written for book two, assuming that the first one is successful enough to justify it.  But as you see here, the sort of compromise about which I’ve written – and honestly, that I’m making here – is very real; I happen think it’s justified in this circumstance because the publisher has a right to publish what they want and the book makes absolutely no claim to be encyclopedic, but if you feel that I’m starting to make the same sort of compromises in my column or on this blog, don’t hesitate to call me on it.</p><p>As for the comic book, the first volume is out to the distributor already although it won’t be officially in stores until November 15.  If anyone has a sighting of Archangels: The Fall in a CBA bookstore, do let me know.  I believe it can also be ordered from christianbooks.com and I’ll try to put up a sample page or two at voxday.net soon.<br/></p></div>",
  "content_text": "Things are looking pretty good for the political book.  It’s not definite yet, but we’re over the previous hurdle and it should be confirmed soon.  It is definite that my artillery will be, shall we say,\nguided\nin one direction, however, on this first book.  I don’t have a problem with that as it’s the publisher’s call and I’ll be perfectly content to save some of the material I’ve already written for book two, assuming that the first one is successful enough to justify it.  But as you see here, the sort of compromise about which I’ve written – and honestly, that I’m making here – is very real; I happen think it’s justified in this circumstance because the publisher has a right to publish what they want and the book makes absolutely no claim to be encyclopedic, but if you feel that I’m starting to make the same sort of compromises in my column or on this blog, don’t hesitate to call me on it.\nAs for the comic book, the first volume is out to the distributor already although it won’t be officially in stores until November 15.  If anyone has a sighting of Archangels: The Fall in a CBA bookstore, do let me know.  I believe it can also be ordered from christianbooks.com and I’ll try to put up a sample page or two at voxday.net soon.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-10-27T14:30:00+00:00"
}