{
  "url": "https://voxday.net/2004/10/10/on-fantasy/",
  "scraped_at": "2025-12-19T20:49:04.635574",
  "title": "On fantasy",
  "date_display": "October 10, 2004",
  "date_iso": "2004-10-10T15:44:00+00:00",
  "date_from_url": "2004-10-10",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>This brings us to <a href=\"http://www.thealienonline.net/columns/goe_nov02.asp?tid=7&amp;scid=73&amp;iid=1229\">what we might consider modern literature</a> and two of the earliest exponents of early romance or fantasy are H. Rider Haggard and William Morris* who both developed the template for quest fantasy as we are familiar with it today. William Morris’ fantasies owe something to Malory and medieval romance and Lin Carter calls The Wood Beyond the World (1894) with its sea voyage to a magical kingdom “the first great fantasy novel ever written”. However, Morris’ magnum opus is The Well At the World’s End (1896), which clearly influenced Tolkien. This novel is set in a completely imaginary world and tells of a prince’s quest to find the fountain of youth.</br></p><p>Morris defined what we now know as genre fantasy. Edgar Rice Burroughs’ Barsoom sequence, begun in 1912, started the heroic fantasy genre that was continued by Robert E. Howard in Conan the Conqueror (1935) whose hero was violent and barbaric. Far more mannered was The King of Elfland’s Daughter by Lord Dunsany (1924) which was a direct descendent of William Morris and an inspiration to both E.R. Eddison and J.R.R. Tolkien.<br/></p></blockquote><p>One thing I always find interesting is how <a href=\"http://en.wikipedia.org/wiki/George_MacDonald\">George MacDonald</a> always goes unmentioned when it comes to discussions of modern fantasy literature.  His first fantasy novel, Phantastes, was published in 1858, long before William Morris or Lord Dunsany, and his work was a far greater influence on seminal fantasy writers CS Lewis and JRR Tolkein than either Morris or Dunsany.  In fact, the beginning of The Princess and the Goblin will be almost disturbingly familiar to anyone who has read The Lion, The Witch and The Wardrobe, as it involves a little girl wandering around a large house….</p><p>MacDonald clearly deserves far more credit than he is given, as he was publishing long before Jules Verne had first seen print and before HG Wells was even born.  The fact that he was a minister and a prolific author of sermons may be one reason that the notoriously secular writers of fantasy are somewhat reluctant to recognize that their genre was first created by Christians.</p><p>*<em>Morris was clearly familiar with MacDonald; he later acquired MacDonald’s house and lived there.</em><br/></p></div>",
  "content_text": "This brings us to\nwhat we might consider modern literature\nand two of the earliest exponents of early romance or fantasy are H. Rider Haggard and William Morris* who both developed the template for quest fantasy as we are familiar with it today. William Morris’ fantasies owe something to Malory and medieval romance and Lin Carter calls The Wood Beyond the World (1894) with its sea voyage to a magical kingdom “the first great fantasy novel ever written”. However, Morris’ magnum opus is The Well At the World’s End (1896), which clearly influenced Tolkien. This novel is set in a completely imaginary world and tells of a prince’s quest to find the fountain of youth.\nMorris defined what we now know as genre fantasy. Edgar Rice Burroughs’ Barsoom sequence, begun in 1912, started the heroic fantasy genre that was continued by Robert E. Howard in Conan the Conqueror (1935) whose hero was violent and barbaric. Far more mannered was The King of Elfland’s Daughter by Lord Dunsany (1924) which was a direct descendent of William Morris and an inspiration to both E.R. Eddison and J.R.R. Tolkien.\nOne thing I always find interesting is how\nGeorge MacDonald\nalways goes unmentioned when it comes to discussions of modern fantasy literature.  His first fantasy novel, Phantastes, was published in 1858, long before William Morris or Lord Dunsany, and his work was a far greater influence on seminal fantasy writers CS Lewis and JRR Tolkein than either Morris or Dunsany.  In fact, the beginning of The Princess and the Goblin will be almost disturbingly familiar to anyone who has read The Lion, The Witch and The Wardrobe, as it involves a little girl wandering around a large house….\nMacDonald clearly deserves far more credit than he is given, as he was publishing long before Jules Verne had first seen print and before HG Wells was even born.  The fact that he was a minister and a prolific author of sermons may be one reason that the notoriously secular writers of fantasy are somewhat reluctant to recognize that their genre was first created by Christians.\n*\nMorris was clearly familiar with MacDonald; he later acquired MacDonald’s house and lived there.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-10-10T14:44:00+00:00"
}