{
  "url": "https://voxday.net/2004/10/13/think-creatively-people/",
  "scraped_at": "2025-12-19T20:49:34.558226",
  "title": "Think creatively, people",
  "date_display": "October 13, 2004",
  "date_iso": "2004-10-13T13:41:00+00:00",
  "date_from_url": "2004-10-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote><p> <br>Ashley Fernandez, a 12-year-old, attends Morgan Village Middle School, in Camden, N.J., a predominantly black and Hispanic school that has been designated as failing under state and federal standards for more than three years. Rotten education is not Ashley’s only problem. When her gym teacher, exasperated by his unruly class, put all the girls in the boys’ locker room, Ashley was assaulted. Two boys dragged her into the shower, held her down and fondled her for 10 minutes.</br></p><p>The school principal refused to even acknowledge the assault and denied her mother’s request for a transfer to another school. Since the assault, Ashley has received numerous threats, and boys frequently grope her and run away. Put yourself in the place of Ashley’s mother. The school won’t protect her daughter from threats and assault. The school won’t permit a transfer. What would you do? Ashley’s mother began to keep her home. The response from officials: She received a court summons for allowing truancy.</p><p>Then there’s Carmen Santana’s grandson, Abraham, who attended Camden High School. After two boys hit him in the face, broke his nose and chipped his teeth, Abraham was afraid to go to school. Guess what. His grandmother was charged with allowing truancy when she kept him home while she tried to get permission for him to finish his senior-year studies at home. Lisa Snell reports that “more than 100 parents have removed their children from Camden schools because of safety concerns. <a href=\"http://www.worldnetdaily.com/news/article.asp?ARTICLE_ID=40901\">The school district’s response: a truancy crackdown</a>.”<br/></p></blockquote><p>This isn’t really that hard to handle.  Give the kid a kitchen knife, let him take it to school and quietly place it on his desk during his first-hour class.  Thanks to zero tolerance, he’ll be home by lunchtime with orders to stay out of school for the rest of the year.</p><p>Repeat as needed.<br/></p></div>",
  "content_text": "Ashley Fernandez, a 12-year-old, attends Morgan Village Middle School, in Camden, N.J., a predominantly black and Hispanic school that has been designated as failing under state and federal standards for more than three years. Rotten education is not Ashley’s only problem. When her gym teacher, exasperated by his unruly class, put all the girls in the boys’ locker room, Ashley was assaulted. Two boys dragged her into the shower, held her down and fondled her for 10 minutes.\nThe school principal refused to even acknowledge the assault and denied her mother’s request for a transfer to another school. Since the assault, Ashley has received numerous threats, and boys frequently grope her and run away. Put yourself in the place of Ashley’s mother. The school won’t protect her daughter from threats and assault. The school won’t permit a transfer. What would you do? Ashley’s mother began to keep her home. The response from officials: She received a court summons for allowing truancy.\nThen there’s Carmen Santana’s grandson, Abraham, who attended Camden High School. After two boys hit him in the face, broke his nose and chipped his teeth, Abraham was afraid to go to school. Guess what. His grandmother was charged with allowing truancy when she kept him home while she tried to get permission for him to finish his senior-year studies at home. Lisa Snell reports that “more than 100 parents have removed their children from Camden schools because of safety concerns.\nThe school district’s response: a truancy crackdown\n.”\nThis isn’t really that hard to handle.  Give the kid a kitchen knife, let him take it to school and quietly place it on his desk during his first-hour class.  Thanks to zero tolerance, he’ll be home by lunchtime with orders to stay out of school for the rest of the year.\nRepeat as needed.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-10-13T12:41:00+00:00"
}