{
  "url": "https://voxday.net/2004/10/22/two-non-geniuses/",
  "scraped_at": "2025-12-19T20:50:31.554064",
  "title": "Two non-geniuses",
  "date_display": "October 22, 2004",
  "date_iso": "2004-10-22T13:47:00+00:00",
  "date_from_url": "2004-10-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve never thought that Bush was stupid.  Nor am I surprised to hear that he is almost surely more intelligent than John Kerry, who strikes me as a very average mind.  According to a guy who has put far more effort into this than would ever occur to me, Bush probably has about a ten-point advantage on Johnny Clueless, <a href=\"http://www.vdare.com/sailer/kerry_iq_lower.htm\">125 to 115</a>.  Average, remember, is defined as 100.</p><p>Now, these are not exactly the most formidable intellects around, but then, intellectuals don’t have the best track record when it comes to governance either.  The problem is that no matter how brilliant you are, complexity will defeat you every single time.  It’s humbling and frustrating.  There are simply too many variables for which to account, which is why some of the brightest people are often able to reach incredibly stupid conclusions as they count out the wrong variables in a futile attempt to simplify that which cannot be simplified.<br/></p></div>",
  "content_text": "I’ve never thought that Bush was stupid.  Nor am I surprised to hear that he is almost surely more intelligent than John Kerry, who strikes me as a very average mind.  According to a guy who has put far more effort into this than would ever occur to me, Bush probably has about a ten-point advantage on Johnny Clueless,\n125 to 115\n.  Average, remember, is defined as 100.\nNow, these are not exactly the most formidable intellects around, but then, intellectuals don’t have the best track record when it comes to governance either.  The problem is that no matter how brilliant you are, complexity will defeat you every single time.  It’s humbling and frustrating.  There are simply too many variables for which to account, which is why some of the brightest people are often able to reach incredibly stupid conclusions as they count out the wrong variables in a futile attempt to simplify that which cannot be simplified.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2004-10-22T12:47:00+00:00"
}