{
  "url": "https://voxday.net/2015/06/05/a-juxstaposition/",
  "scraped_at": "2025-12-16T12:58:23.378162",
  "title": "A juxstaposition",
  "date_display": "June 5, 2015",
  "date_iso": "2015-06-05T12:00:00+00:00",
  "date_from_url": "2015-06-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If there is one lesson, just one, from all of Martin van Creveld’s books, it is that technology does not guarantee military victory. Here is a vivid comparison that shows why things are looking rather grim for the US military if it is ordered to intervene in the Middle East for a third time in three decades in order to take on the Islamic State there:</p><ol><li><a href=\"http://www.nytimes.com/2015/06/04/opinion/let-transgender-troops-serve-openly.html\">Let Transgender Troops Serve Openly</a> by THE EDITORIAL BOARD. The Pentagon’s ban on transgender troops is based on obsolete policies and must be rescinded.  The Williams Institute at the U.C.L.A. School of Law, which researches gender issues, estimates there are about 15,500 transgender troops serving in uniform.</li><li><a href=\"http://www.nytimes.com/2015/06/04/world/isis-making-political-gains.html\">Using Violence and Persuasion, ISIS Makes Political Gains</a>. Amid punishing American-backed airstrikes, the Islamic State militants have advanced in Iraq and Syria using a dual strategy of purporting to represent Sunni interests and attacking any group that vies to play the same role.</li></ol><p>Military history clearly demonstrates that the side that executes homosexuals, whether throwing them off buildings or having their fellow soldiers beat them to death, reliably defeats the side that allows its soldiers to dress up and pretend they are women.</p><p>Yes, wealth and technology are on the side of the crossdressing military. But attrition, geography, and history are on the side that does not tolerate effeminacy.</p><p>It’s true that the US military roundly defeated the Soviet-trained, Soviet-equipped Iraqi army twice, the second time largely without a fight. But then, the Islamic State has defeated the US-trained, US-equipped Iraqi army.</p></div>",
  "content_text": "If there is one lesson, just one, from all of Martin van Creveld’s books, it is that technology does not guarantee military victory. Here is a vivid comparison that shows why things are looking rather grim for the US military if it is ordered to intervene in the Middle East for a third time in three decades in order to take on the Islamic State there:\nLet Transgender Troops Serve Openly\nby THE EDITORIAL BOARD. The Pentagon’s ban on transgender troops is based on obsolete policies and must be rescinded.  The Williams Institute at the U.C.L.A. School of Law, which researches gender issues, estimates there are about 15,500 transgender troops serving in uniform.\nUsing Violence and Persuasion, ISIS Makes Political Gains\n. Amid punishing American-backed airstrikes, the Islamic State militants have advanced in Iraq and Syria using a dual strategy of purporting to represent Sunni interests and attacking any group that vies to play the same role.\nMilitary history clearly demonstrates that the side that executes homosexuals, whether throwing them off buildings or having their fellow soldiers beat them to death, reliably defeats the side that allows its soldiers to dress up and pretend they are women.\nYes, wealth and technology are on the side of the crossdressing military. But attrition, geography, and history are on the side that does not tolerate effeminacy.\nIt’s true that the US military roundly defeated the Soviet-trained, Soviet-equipped Iraqi army twice, the second time largely without a fight. But then, the Islamic State has defeated the US-trained, US-equipped Iraqi army.",
  "tags": [
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-05T11:00:00+00:00"
}