{
  "url": "https://voxday.net/2015/06/22/a-necessary-endorsemen/",
  "scraped_at": "2025-12-16T13:00:30.822600",
  "title": "A necessary endorsement",
  "date_display": "June 22, 2015",
  "date_iso": "2015-06-22T18:00:00+00:00",
  "date_from_url": "2015-06-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which I explain why Ed Trimnell <a href=\"http://onewordtrimnell.blogspot.com/2015/06/boycott-tor-books-you-ask.html\">should endorse the TOR boycott</a>:</p><blockquote class=\"tr_bq\"><p> First of all: I am on record as disagreeing with the positions of Patrick Nielsen Hayden and John Scalzi. (I’ve taken Mr. Scalzi to task on this blog many times.) I’m not as familiar with Moshe Feder and Irene Gallo. But what I have seen of them so far, I don’t evaluate favorably.</p><p>That said, I think the boycott is a bad idea. And here’s why:</p><p>I dislike the Internet mob—whether it is a rightwing mob, or a leftwing mob. I dislike the Internet’s hive mindset, which says:</p><p>“If you say something we don’t like, we’re going to whip up all of our minions into a frenzy, and then destroy your livelihood, or harass you into silence at the very least. Oh—and we’re going to do all of this anonymously, hiding behind bogus screen names, avatars, and IP addresses! And aren’t we courageous!”</p><p>That is, of course, exactly what the SJW crowd does. But I’m not one of them—and I’m not a joiner, either. Just because I disagree with John Scalzi &amp; Co. doesn’t mean that I’m eager to flock to the banner of Vox Day and others on the far right.</p><p>(In fact, I think you’ll find that those on the far right and the far left of these Internet debates have actually achieved a sort of symbiosis—they are each dependent on the outlandish statements of the opposite group. But that’s another post.)</p></blockquote><p>If Mr. Trimnell deplores the hive mindset and Internet mob tactics (and I see no reason not to take him at his word), then he should endorse the TOR boycott and join us. We are not a hive mind or a mob. We do not howl. We did not initiate the use of these mob tactics and we do not favor them as a first option. We prefer civil disagreement, dialectical discourse, and public debate, but as Mr. Trimnell knows very well, those are not credible options at the moment because the SJW crowd <a href=\"http://spjairplay.com/update4/\">refuses to engage with us</a> on such terms. They have left us literally no other choice except submitting to them, which will never happen.</p><p>Refusing to take a side and trying to remain above it all will no more bring an end to the tactics he dislikes than the League of Nations prevented World War II. Misbehaving bullies can only be stopped with superior force. To stop the lynch mobs, Mr. Trimnell should help us bring them to an end by multiplying our force. We will abandon the tactic as soon as the SJWs do… like Ronald Reagan with the Evil Empire, we will trust, but verify. But until the SJWs give up their rhetorical tactics of name-calling, marginalization, and disqualification, we will continue play by the Chicago Rules and exploit every mistake they make and every opening they give us. The TOR boycott is nothing more than holding TOR Books accountable for the wholly unprofessional behavior of its SJW employees, behavior that would have gotten a minimum-wage Walmart greeter fired on the spot.</p><p>Furthermore, there is no symbiosis. The SJWs are not dependent upon anyone’s outlandish statements; if an opponent has not said something objectionable, they will simply lie and claim he did, then run their usual insult-isolate-disqualify routine. We, on the other hand, have a rich and continuously replenished pool of outlandish statements from which to choose to use against them.</p><blockquote class=\"tr_bq\"><p> The second issue I have with the entire Tor kerfuffle (and similar online kerfuffles) is its evidence of the general decline in civility nowadays, and the unwillingness to engage in civil debate with those on the other side of an issue. The pattern on the Internet is for people to self-select into ideological echo chambers, usually centered around some charismatic blogger (such as a John Scalzi on the left, or a Vox Day on the right.)</p><p>This, admittedly, began with the so-called SJW (“social justice warrior”) faction, which achieved a podium on the Internet long before there were highly trafficked rightwing blogs (at least in the field of science fiction). John Scalzi loved having open comment threads for years, until his blog began to attract substantial numbers of people who failed to accept his received wisdom. Then he opted for his “mallet”, deleting comments en masse on the flimsiest of pretexts.</p></blockquote><p>Mr. Trimnell graciously offered to referee a debate between Mr. Scalzi and me. I accepted. Mr. Scalzi declined. So Mr. Trimnell knows that his favored option is simply not a viable one. What I am offering is a viable tactic intended to force the SJWs to abandon their incivility and return to the more civilized norms that he favors. Given that he has no other options, I encourage him to rethink his position, endorse the boycott, and hold us accountable to lay down our arms should the SJWs eventually realize that they cannot win this sort of conflict and lay down their own.</p></div>",
  "content_text": "In which I explain why Ed Trimnell\nshould endorse the TOR boycott\n:\nFirst of all: I am on record as disagreeing with the positions of Patrick Nielsen Hayden and John Scalzi. (I’ve taken Mr. Scalzi to task on this blog many times.) I’m not as familiar with Moshe Feder and Irene Gallo. But what I have seen of them so far, I don’t evaluate favorably.\nThat said, I think the boycott is a bad idea. And here’s why:\nI dislike the Internet mob—whether it is a rightwing mob, or a leftwing mob. I dislike the Internet’s hive mindset, which says:\n“If you say something we don’t like, we’re going to whip up all of our minions into a frenzy, and then destroy your livelihood, or harass you into silence at the very least. Oh—and we’re going to do all of this anonymously, hiding behind bogus screen names, avatars, and IP addresses! And aren’t we courageous!”\nThat is, of course, exactly what the SJW crowd does. But I’m not one of them—and I’m not a joiner, either. Just because I disagree with John Scalzi & Co. doesn’t mean that I’m eager to flock to the banner of Vox Day and others on the far right.\n(In fact, I think you’ll find that those on the far right and the far left of these Internet debates have actually achieved a sort of symbiosis—they are each dependent on the outlandish statements of the opposite group. But that’s another post.)\nIf Mr. Trimnell deplores the hive mindset and Internet mob tactics (and I see no reason not to take him at his word), then he should endorse the TOR boycott and join us. We are not a hive mind or a mob. We do not howl. We did not initiate the use of these mob tactics and we do not favor them as a first option. We prefer civil disagreement, dialectical discourse, and public debate, but as Mr. Trimnell knows very well, those are not credible options at the moment because the SJW crowd\nrefuses to engage with us\non such terms. They have left us literally no other choice except submitting to them, which will never happen.\nRefusing to take a side and trying to remain above it all will no more bring an end to the tactics he dislikes than the League of Nations prevented World War II. Misbehaving bullies can only be stopped with superior force. To stop the lynch mobs, Mr. Trimnell should help us bring them to an end by multiplying our force. We will abandon the tactic as soon as the SJWs do… like Ronald Reagan with the Evil Empire, we will trust, but verify. But until the SJWs give up their rhetorical tactics of name-calling, marginalization, and disqualification, we will continue play by the Chicago Rules and exploit every mistake they make and every opening they give us. The TOR boycott is nothing more than holding TOR Books accountable for the wholly unprofessional behavior of its SJW employees, behavior that would have gotten a minimum-wage Walmart greeter fired on the spot.\nFurthermore, there is no symbiosis. The SJWs are not dependent upon anyone’s outlandish statements; if an opponent has not said something objectionable, they will simply lie and claim he did, then run their usual insult-isolate-disqualify routine. We, on the other hand, have a rich and continuously replenished pool of outlandish statements from which to choose to use against them.\nThe second issue I have with the entire Tor kerfuffle (and similar online kerfuffles) is its evidence of the general decline in civility nowadays, and the unwillingness to engage in civil debate with those on the other side of an issue. The pattern on the Internet is for people to self-select into ideological echo chambers, usually centered around some charismatic blogger (such as a John Scalzi on the left, or a Vox Day on the right.)\nThis, admittedly, began with the so-called SJW (“social justice warrior”) faction, which achieved a podium on the Internet long before there were highly trafficked rightwing blogs (at least in the field of science fiction). John Scalzi loved having open comment threads for years, until his blog began to attract substantial numbers of people who failed to accept his received wisdom. Then he opted for his “mallet”, deleting comments en masse on the flimsiest of pretexts.\nMr. Trimnell graciously offered to referee a debate between Mr. Scalzi and me. I accepted. Mr. Scalzi declined. So Mr. Trimnell knows that his favored option is simply not a viable one. What I am offering is a viable tactic intended to force the SJWs to abandon their incivility and return to the more civilized norms that he favors. Given that he has no other options, I encourage him to rethink his position, endorse the boycott, and hold us accountable to lay down our arms should the SJWs eventually realize that they cannot win this sort of conflict and lay down their own.",
  "tags": [
    "debate",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-22T17:00:00+00:00"
}