{
  "url": "https://voxday.net/2015/06/30/an-early-sf-gatekeeper/",
  "scraped_at": "2025-12-16T13:01:28.824304",
  "title": "An early SF gatekeeper",
  "date_display": "June 30, 2015",
  "date_iso": "2015-06-30T10:34:00+00:00",
  "date_from_url": "2015-06-30",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One wonders how many more excellent SF juvenile novels Robert Heinlein might have written for Scribner had it not been for his editor Alice Dalgliesh’s determination to meddle, in true SJW fashion, with the political ideology expressed in <i>Red Planet</i>. This was the first serious crack in the relationship between Heinlein and Scribner’s, which eventually culminated in Scribner’s rejecting <i>Starship Troopers</i> for publication. From <i>Grumbles From the Grave</i>.</p><blockquote class=\"tr_bq\"><p> <b>April 19, 1949: Robert A. Heinlein to Alice Dalgliesh</b></p><p>The manuscript of <i>Red Planet</i> is being returned, through Mr. Blassingame.</p><p>You will find that I have meticulously followed all of your directions, from your letter, from your written notes, and from your notations on the manuscript, whether I agreed with them or not. I have made a wholehearted attempt to make the changes smoothly and acceptably and thereby to make the story hang together. I am not satisfied with the result, but you are free to make any additional changes you wish wherever you see an opportunity to accomplish your purposes more smoothly than I have been able to do.</p><p>Most of the changes have been made by excising what you objected to, or by minor inclusions and variations in dialog. However, on the matter of guns, I have written in a subscene in which the matter of gun licensing is referred to in sufficient explanatory detail to satisfy you, I think.</p><p>The balance of this letter is side discussion and is in no sense an attempt to get you to change your mind about any of your decisions concerning the book. I simply want to state my point of view on one matter and to correct a couple of points….</p><p>You and I have strongly different evaluations as to the best way in which to handle the problem of deadly weapons in a society. We do not seem to disagree in any important fashion as to the legitimate ways in which deadly weapons may be used, but we disagree strongly as to socially useful regulations concerning deadly weapons. I will first cite two points which sharply illustrate the disagreement. I have one of my characters say that the right to bear arms is the basis of all human freedom. I strongly believe that, but you required me to blue-pencil it. The second point concerns licensing guns. I had such licensing in the story, but I had one character strongly object to it as a piece of buttinsky bureaucracy, subversive of liberty—and I had no one defending it. You required me to remove the protest, then build up the licensing into a complicated ritual, involving codes, oaths, etc.—a complete reversal of evaluation. I have made great effort to remove my viewpoint from the book and to incorporate yours, convincingly—but in so doing I have been writing from reasons of economic necessity something that I do not believe. I do not like having to do that.</p><p>Let me say that your viewpoint and evaluation in this matter is quite orthodox; you will find many to agree with you. But there is another and older orthodoxy imbedded in the history of this country and to which I hold. I have no intention nor any expectation of changing your mind, but I do want to make you aware that there is another viewpoint that is held by a great many respectable people, and that it is quite old. It is summed up in the statement that I am opposed to all attempts to license or restrict the arming of individuals, such as the Sullivan Act of the State of New York. I consider such laws a violation of civil liberty, subversive of democratic political institutions, and self-defeating in their purpose. You will find that the American Rifle Association has the same policy and has had for many years.</p><p>France had Sullivan-type laws. When the Nazis came, the invaders had only to consult the registration lists at the local gendarmerie in order to round up all the weapons in a district. Whether the authorities be invaders or merely local tyrants, the effect of such laws is to place the individual at the mercy of the state, unable to resist. In the story Red Planet it would be all too easy for the type of licensing you insist on to make the revolution of the colonists not simply unsuccessful, but impossible.</p><p>As to such laws being self-defeating, the avowed purpose of such laws as the Sullivan Act is to keep weapons out of the hands of potential criminals. You are surely aware that the Sullivan Act and similar acts have never accomplished anything of the sort? That gangsterism ruled New York while this act was already in force? That Murder, Inc. flourished under this act? Criminals are never materially handicapped by such rules; the only effect is to disarm the peaceful citizen and put him fully at the mercy of the lawless. Such rules look very pretty on paper; in practice they are as foolish and footless as the attempt of the mice to bell the cat.</p><p>Such is my thesis, that the licensing of weapons is subversive of liberty and self-defeating in its pious purpose. I could elaborate the arguments suggested above at great length, but my intention is not to convince, but merely to show that there is another viewpoint. I am aware, too, that even if I did by some chance convince you, there remains the unanswerable argument that you have to sell to librarians and schoolteachers who believe the contrary.</p></blockquote><p>Heinlein knuckled under, but he was not happy about it. He was so unhappy about the forced change that he even tried to get Scribner’s to put Dalgliesh’s name on the cover as <i>Red Planet’s </i>co-author, but the publishing house refused, as they believed it would hurt sales.</p><blockquote class=\"tr_bq\"><p> <b>May 9, 1949: Robert A. Heinlein to Lurton Blassingame</b></p><p>As to the name on Red Planet ms., no, I’m not adamant; I’ll always listen to your advice and I’ll lose a lot of sleep before I will go directly against your advice. But I feel rather sticky about this point, as I hate like the deuce to see anything go out under my own name, without even sharing responsibility with Miss Dalgliesh, when said item includes propositions in which I do not believe. The matter of style, plot, and the effect on my literary reputation, if any, I am not adamant about, even though I am not happy about the changes—if you say to shut up and forget it, I’ll shut up. It’s the “Sullivan-Act-in-a-Martian-frontier-colony” feature that I find hard to swallow; from my point of view I am being required to support publicly a doctrine which I believe to be subversive of human liberty and political freedom.</p></blockquote><p>The whole situation bothered Heinlein so much that when Dalgliesh’s successor pitched Heinlein on returning to Scribner’s, Heinlein flat-out refused to work with them again. Which is not terribly surprising, considering how he took the rejection of <i>Starship Troopers</i>, which involved not only the entire editorial board, but Charles Scribner himself.</p><p><i>“I do not know as yet whether I will do another juvenile book or not. If I decide to do another one, I do not know that I wish it to be submitted to Scribner’s. I have taken great pride in being a Scribner’s author, but that pride is all gone now that I have discovered that they are not proud of me.”</i></p><p>Plus ça change, plus c’est la même chose.</p></div>",
  "content_text": "One wonders how many more excellent SF juvenile novels Robert Heinlein might have written for Scribner had it not been for his editor Alice Dalgliesh’s determination to meddle, in true SJW fashion, with the political ideology expressed in\nRed Planet\n. This was the first serious crack in the relationship between Heinlein and Scribner’s, which eventually culminated in Scribner’s rejecting\nStarship Troopers\nfor publication. From\nGrumbles From the Grave\n.\nApril 19, 1949: Robert A. Heinlein to Alice Dalgliesh\nThe manuscript of\nRed Planet\nis being returned, through Mr. Blassingame.\nYou will find that I have meticulously followed all of your directions, from your letter, from your written notes, and from your notations on the manuscript, whether I agreed with them or not. I have made a wholehearted attempt to make the changes smoothly and acceptably and thereby to make the story hang together. I am not satisfied with the result, but you are free to make any additional changes you wish wherever you see an opportunity to accomplish your purposes more smoothly than I have been able to do.\nMost of the changes have been made by excising what you objected to, or by minor inclusions and variations in dialog. However, on the matter of guns, I have written in a subscene in which the matter of gun licensing is referred to in sufficient explanatory detail to satisfy you, I think.\nThe balance of this letter is side discussion and is in no sense an attempt to get you to change your mind about any of your decisions concerning the book. I simply want to state my point of view on one matter and to correct a couple of points….\nYou and I have strongly different evaluations as to the best way in which to handle the problem of deadly weapons in a society. We do not seem to disagree in any important fashion as to the legitimate ways in which deadly weapons may be used, but we disagree strongly as to socially useful regulations concerning deadly weapons. I will first cite two points which sharply illustrate the disagreement. I have one of my characters say that the right to bear arms is the basis of all human freedom. I strongly believe that, but you required me to blue-pencil it. The second point concerns licensing guns. I had such licensing in the story, but I had one character strongly object to it as a piece of buttinsky bureaucracy, subversive of liberty—and I had no one defending it. You required me to remove the protest, then build up the licensing into a complicated ritual, involving codes, oaths, etc.—a complete reversal of evaluation. I have made great effort to remove my viewpoint from the book and to incorporate yours, convincingly—but in so doing I have been writing from reasons of economic necessity something that I do not believe. I do not like having to do that.\nLet me say that your viewpoint and evaluation in this matter is quite orthodox; you will find many to agree with you. But there is another and older orthodoxy imbedded in the history of this country and to which I hold. I have no intention nor any expectation of changing your mind, but I do want to make you aware that there is another viewpoint that is held by a great many respectable people, and that it is quite old. It is summed up in the statement that I am opposed to all attempts to license or restrict the arming of individuals, such as the Sullivan Act of the State of New York. I consider such laws a violation of civil liberty, subversive of democratic political institutions, and self-defeating in their purpose. You will find that the American Rifle Association has the same policy and has had for many years.\nFrance had Sullivan-type laws. When the Nazis came, the invaders had only to consult the registration lists at the local gendarmerie in order to round up all the weapons in a district. Whether the authorities be invaders or merely local tyrants, the effect of such laws is to place the individual at the mercy of the state, unable to resist. In the story Red Planet it would be all too easy for the type of licensing you insist on to make the revolution of the colonists not simply unsuccessful, but impossible.\nAs to such laws being self-defeating, the avowed purpose of such laws as the Sullivan Act is to keep weapons out of the hands of potential criminals. You are surely aware that the Sullivan Act and similar acts have never accomplished anything of the sort? That gangsterism ruled New York while this act was already in force? That Murder, Inc. flourished under this act? Criminals are never materially handicapped by such rules; the only effect is to disarm the peaceful citizen and put him fully at the mercy of the lawless. Such rules look very pretty on paper; in practice they are as foolish and footless as the attempt of the mice to bell the cat.\nSuch is my thesis, that the licensing of weapons is subversive of liberty and self-defeating in its pious purpose. I could elaborate the arguments suggested above at great length, but my intention is not to convince, but merely to show that there is another viewpoint. I am aware, too, that even if I did by some chance convince you, there remains the unanswerable argument that you have to sell to librarians and schoolteachers who believe the contrary.\nHeinlein knuckled under, but he was not happy about it. He was so unhappy about the forced change that he even tried to get Scribner’s to put Dalgliesh’s name on the cover as\nRed Planet’s\nco-author, but the publishing house refused, as they believed it would hurt sales.\nMay 9, 1949: Robert A. Heinlein to Lurton Blassingame\nAs to the name on Red Planet ms., no, I’m not adamant; I’ll always listen to your advice and I’ll lose a lot of sleep before I will go directly against your advice. But I feel rather sticky about this point, as I hate like the deuce to see anything go out under my own name, without even sharing responsibility with Miss Dalgliesh, when said item includes propositions in which I do not believe. The matter of style, plot, and the effect on my literary reputation, if any, I am not adamant about, even though I am not happy about the changes—if you say to shut up and forget it, I’ll shut up. It’s the “Sullivan-Act-in-a-Martian-frontier-colony” feature that I find hard to swallow; from my point of view I am being required to support publicly a doctrine which I believe to be subversive of human liberty and political freedom.\nThe whole situation bothered Heinlein so much that when Dalgliesh’s successor pitched Heinlein on returning to Scribner’s, Heinlein flat-out refused to work with them again. Which is not terribly surprising, considering how he took the rejection of\nStarship Troopers\n, which involved not only the entire editorial board, but Charles Scribner himself.\n“I do not know as yet whether I will do another juvenile book or not. If I decide to do another one, I do not know that I wish it to be submitted to Scribner’s. I have taken great pride in being a Scribner’s author, but that pride is all gone now that I have discovered that they are not proud of me.”\nPlus ça change, plus c’est la même chose.",
  "tags": [
    "SJW",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-30T09:34:00+00:00"
}