{
  "url": "https://voxday.net/2015/06/24/an-interesting-admission-and-ep/",
  "scraped_at": "2025-12-16T13:00:44.752721",
  "title": "An interesting admission and EPH analysis",
  "date_display": "June 24, 2015",
  "date_iso": "2015-06-24T18:30:00+00:00",
  "date_from_url": "2015-06-24",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have to admit, I’m a little surprised that the SJWs have been willing to be this blatant about their push to completely change the Hugo rules:</p><blockquote class=\"tr_bq\"><p> <b>Andrew Hickey on June 24, 2015 at 5:51 am said:</b><br> [T]he point of the rules change isn’t to force “Day” to nominate a quota of Tor novels, or to affect people’s nominations in any way. It’s only meant to stop him having disproportionate power.</br></p></blockquote><p>Oh, is that all? They were fine with Tor wielding disproportionate power with its little 40-bloc vote, and reasonably so because prior to Scalzi and his greedy “award pimpage”, Tor was always circumspect about quite literally letting other people win from time to time, but it’s when the Puppies show up with seven times that number, suddenly change is needed.</p><p>If I simply wanted to win a Hugo, I would have done what Jim Hines and Kameron Hurley did and picked off one or two of the easier ones like Fan Writer or Related Work by following the Scalzi model. Contra the constant SJW denials, people have been utilizing tightly focused bloc votes for decades, it’s just been hidden by the Worldcon counters. Note the Rosenberg votes <a href=\"http://nwhyte.livejournal.com/\">in the 1984 example</a>. I know of at least 12 other cases of focused bloc votes, in several cases directly from the Hugo nominee’s mouth who orchestrated the vote.</p><p><i>It’s not irrelevant to note that Joel Rosenberg had 19 bullet votes at<br> this stage (a few of whom had voted for other less popular candidates as<br> well), and that these included ten voters with consecutive membership<br> numbers who cast nominating votes identically for him in this category<br> and for a novel called <b>The Sleeping Dragon</b> and a short story called “The Emigrant”. You’ll never guess who those works were by.</br></br></br></br></i></p><p>Instead, I made about the biggest splash possible. Naturally, they conclude that this must mean that I want ALL THE HUGOS even though I didn’t nominate myself in numerous categories for which I was eligible. You would think that at some point, in the midst of all the angst and hysteria, they would stop and think for two seconds about what I meant by my statement that I will not destroy the Hugos, I will make them do it. Anyhow, we know better than to expect reason, coherence, or even the simple truth from SJWs</p><blockquote class=\"tr_bq\"><p> <b>JJ on June 24, 2015 at 6:22 am said:</b><br> Well, the Gallo thing has pretty much run its course now, and the “boycott” of Tor has turned out to be an utter dud, and all the commenters here at File770 are talking more and more about books and paying less and less attention to the Puppies.</br></p></blockquote><p>What is amusing is that this comment was immediately preceded by:</p><ul><li>28 comments about me and the Puppies</li><li>5 comments about books</li></ul><p>SJWs always lie.</p><p>One of the more amusing aspects of File 770 is the way that the commenters there are both a) absolutely obsessed with me and b) hell-bent on denying that I am of any import whatsoever. So they repeatedly claim that they just want to talk about books while mostly talking about the Puppies; in the meantime, nary a link in the round-up has anything to do with anything that isn’t related to me, the Puppies, or the Torlings dutifully doing exactly what I assumed they would do from the start, which is destroy the village in the name of saving it.</p><p>I find the EPH proposal to be very promising in this regard, as it is designed by the Torlings at Making Light to permit Tor Books to avoid being shut out in the future and ensure it at least one nomination per category every year. Of course, it will hand the Puppies the same fixed claim on the Hugos, which will gradually turn the award into a five-faction competition, perhaps four if we continue to build our numbers to the point where we can reliably lay claim to two nominations per category. It’s a very parliamentarian proposal.</p><p>It means that DAW and some of the other smaller publishers had better decide quickly whether they are better off fighting amongst themselves for the 2-3 open slots or fight the proposal, because if EPH passes, some of them will never see another Hugo nomination after 2017… unless the TORlings are willing to give up one of their own seats on what will effectively be the Hugo Security Council.</p><p>It’s telling that the Torlings would rather hand us the equivalent of a permanent nomination slot than compete directly with us. It demonstrates that for all of the bluster and splashing about of the small fry, the bigger fish in the little SF pond realize that the Puppies are a serious force with which they must expect to reckon indefinitely.</p><p>I am neither endorsing nor opposing EPH or any other rules changes this year. The reason is that when those rules changes implode the awards as I anticipate, I want all responsibility for the changes to be credited to those who proposed and voted for them.</p></div>",
  "content_text": "I have to admit, I’m a little surprised that the SJWs have been willing to be this blatant about their push to completely change the Hugo rules:\nAndrew Hickey on June 24, 2015 at 5:51 am said:\n[T]he point of the rules change isn’t to force “Day” to nominate a quota of Tor novels, or to affect people’s nominations in any way. It’s only meant to stop him having disproportionate power.\nOh, is that all? They were fine with Tor wielding disproportionate power with its little 40-bloc vote, and reasonably so because prior to Scalzi and his greedy “award pimpage”, Tor was always circumspect about quite literally letting other people win from time to time, but it’s when the Puppies show up with seven times that number, suddenly change is needed.\nIf I simply wanted to win a Hugo, I would have done what Jim Hines and Kameron Hurley did and picked off one or two of the easier ones like Fan Writer or Related Work by following the Scalzi model. Contra the constant SJW denials, people have been utilizing tightly focused bloc votes for decades, it’s just been hidden by the Worldcon counters. Note the Rosenberg votes\nin the 1984 example\n. I know of at least 12 other cases of focused bloc votes, in several cases directly from the Hugo nominee’s mouth who orchestrated the vote.\nIt’s not irrelevant to note that Joel Rosenberg had 19 bullet votes at\nthis stage (a few of whom had voted for other less popular candidates as\nwell), and that these included ten voters with consecutive membership\nnumbers who cast nominating votes identically for him in this category\nand for a novel called\nThe Sleeping Dragon\nand a short story called “The Emigrant”. You’ll never guess who those works were by.\nInstead, I made about the biggest splash possible. Naturally, they conclude that this must mean that I want ALL THE HUGOS even though I didn’t nominate myself in numerous categories for which I was eligible. You would think that at some point, in the midst of all the angst and hysteria, they would stop and think for two seconds about what I meant by my statement that I will not destroy the Hugos, I will make them do it. Anyhow, we know better than to expect reason, coherence, or even the simple truth from SJWs\nJJ on June 24, 2015 at 6:22 am said:\nWell, the Gallo thing has pretty much run its course now, and the “boycott” of Tor has turned out to be an utter dud, and all the commenters here at File770 are talking more and more about books and paying less and less attention to the Puppies.\nWhat is amusing is that this comment was immediately preceded by:\n28 comments about me and the Puppies\n5 comments about books\nSJWs always lie.\nOne of the more amusing aspects of File 770 is the way that the commenters there are both a) absolutely obsessed with me and b) hell-bent on denying that I am of any import whatsoever. So they repeatedly claim that they just want to talk about books while mostly talking about the Puppies; in the meantime, nary a link in the round-up has anything to do with anything that isn’t related to me, the Puppies, or the Torlings dutifully doing exactly what I assumed they would do from the start, which is destroy the village in the name of saving it.\nI find the EPH proposal to be very promising in this regard, as it is designed by the Torlings at Making Light to permit Tor Books to avoid being shut out in the future and ensure it at least one nomination per category every year. Of course, it will hand the Puppies the same fixed claim on the Hugos, which will gradually turn the award into a five-faction competition, perhaps four if we continue to build our numbers to the point where we can reliably lay claim to two nominations per category. It’s a very parliamentarian proposal.\nIt means that DAW and some of the other smaller publishers had better decide quickly whether they are better off fighting amongst themselves for the 2-3 open slots or fight the proposal, because if EPH passes, some of them will never see another Hugo nomination after 2017… unless the TORlings are willing to give up one of their own seats on what will effectively be the Hugo Security Council.\nIt’s telling that the Torlings would rather hand us the equivalent of a permanent nomination slot than compete directly with us. It demonstrates that for all of the bluster and splashing about of the small fry, the bigger fish in the little SF pond realize that the Puppies are a serious force with which they must expect to reckon indefinitely.\nI am neither endorsing nor opposing EPH or any other rules changes this year. The reason is that when those rules changes implode the awards as I anticipate, I want all responsibility for the changes to be credited to those who proposed and voted for them.",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-24T17:30:00+00:00"
}