{
  "url": "https://voxday.net/2015/06/17/bounced/",
  "scraped_at": "2025-12-16T12:59:51.516169",
  "title": "Updates",
  "date_display": "June 17, 2015",
  "date_iso": "2015-06-17T10:24:00+00:00",
  "date_from_url": "2015-06-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Since many of you have been asking, no, no one has received any response from anyone at Tor Books or Macmillan. We know at least some of the emails have been read by the recipients. Be patient, we have to give Macmillan time to investigate the situation and discover for themselves just how dysfunctional and unprofessional their U.S. subsidiary is. Remember that Julie Crisp, Editorial Director of Tor UK, left the company “following a review of the<br> company’s science fiction and fantasy publishing” in May, and her public behavior was unobjectionable in comparison with that of Irene Gallo, Moshe Feder, and Patrick Nielsen Hayden. </br></p><p>Also, Jagi has asked that when you send her <a href=\"http://www.ljagilamplighter.com/2015/06/15/i-am-not-a-robot-i-am-a-free-fan/\">your pictures of your Tor books</a>, please tell her what state or country you are from. She’s received them from 65 people to date.</p><p>And finally, TV invites those interested to <a href=\"https://www.facebook.com/groups/831172770295039/?ref=br_tf\">a new Facebook group</a>.</p><blockquote class=\"tr_bq\"><p> I would like to direct you and your commenters to a Facebook group I have started. There is a profound dearth of Facebook groups currently who support true open debate on the topic of “social justice” devoid of deletion happy moderators, and I intend to make this one the destination of choice among those who share the sentiments of the Ilk.</p></blockquote></div>",
  "content_text": "Since many of you have been asking, no, no one has received any response from anyone at Tor Books or Macmillan. We know at least some of the emails have been read by the recipients. Be patient, we have to give Macmillan time to investigate the situation and discover for themselves just how dysfunctional and unprofessional their U.S. subsidiary is. Remember that Julie Crisp, Editorial Director of Tor UK, left the company “following a review of the\ncompany’s science fiction and fantasy publishing” in May, and her public behavior was unobjectionable in comparison with that of Irene Gallo, Moshe Feder, and Patrick Nielsen Hayden.\nAlso, Jagi has asked that when you send her\nyour pictures of your Tor books\n, please tell her what state or country you are from. She’s received them from 65 people to date.\nAnd finally, TV invites those interested to\na new Facebook group\n.\nI would like to direct you and your commenters to a Facebook group I have started. There is a profound dearth of Facebook groups currently who support true open debate on the topic of “social justice” devoid of deletion happy moderators, and I intend to make this one the destination of choice among those who share the sentiments of the Ilk.",
  "tags": [
    "ELoE"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-17T09:24:00+00:00"
}