{
  "url": "https://voxday.net/2015/06/29/coming-to-nation-near-you/",
  "scraped_at": "2025-12-16T13:01:22.225871",
  "title": "Coming to a nation near you",
  "date_display": "June 29, 2015",
  "date_iso": "2015-06-29T08:30:00+00:00",
  "date_from_url": "2015-06-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Greek <a href=\"http://news.sky.com/story/1509799/greek-banks-and-stock-exchange-in-shutdown\">shuts down its banks</a>:</p><blockquote class=\"tr_bq\"><p> Banks in Greece and the country’s stock exchange will be shut all week in a sign of the deepening financial crisis. The drastic move comes after people rushed to withdraw their cash amid panic ahead of the referendum on bailout terms. Under the controls, there will be a daily €60 limit on withdrawals from cash machines, which will reopen on Tuesday.</p></blockquote><p>Any fractional-reserve system is doomed as soon as people realize that there are more claims on each piece of paper than can be exercised at any given time. As with everything they do, the banks took something that worked, more or less, and pushed it well beyond the breaking point.</p><p>It was eye-opening when I realized that the “ten-percent” reserve system about which we’d learned in college was actually a “less-than-one-percent” reserve system. That was the point when I realized that the global financial system was bound to fail eventually; it simply doesn’t have a sufficient margin of error for predictable events, such as the Greek inability to continue servicing their <i>external</i> debt, much less genuinely unexpected and exogenous shocks.</p><p>As awful as bail-ins sound, they are actually much more fair than bail-outs. After all, whether you realize it or not, your “deposits” are actually unsecured loans you have made to the bank. Why you would want to make such a high-risk loan to such an irresponsible borrower without collateral or much in the way of interest is, of course, your business.</p><p>UPDATE: It’s official. <a href=\"http://news.yahoo.com/greece-not-pay-imf-loan-due-tuesday-government-162215953--business.html\">Greek default tomorrow</a>:</p><blockquote class=\"tr_bq\"><p> Greece will not pay a 1.6 billon euro loan installment due to the<br> International Monetary Fund on Tuesday, a Greek government official<br> confirmed on Monday, highlighting the depth of the financial crisis<br> facing the country.</br></br></br></p></blockquote><p>This should help settle the debate. The answer is “deflation”.</p></div>",
  "content_text": "Greek\nshuts down its banks\n:\nBanks in Greece and the country’s stock exchange will be shut all week in a sign of the deepening financial crisis. The drastic move comes after people rushed to withdraw their cash amid panic ahead of the referendum on bailout terms. Under the controls, there will be a daily €60 limit on withdrawals from cash machines, which will reopen on Tuesday.\nAny fractional-reserve system is doomed as soon as people realize that there are more claims on each piece of paper than can be exercised at any given time. As with everything they do, the banks took something that worked, more or less, and pushed it well beyond the breaking point.\nIt was eye-opening when I realized that the “ten-percent” reserve system about which we’d learned in college was actually a “less-than-one-percent” reserve system. That was the point when I realized that the global financial system was bound to fail eventually; it simply doesn’t have a sufficient margin of error for predictable events, such as the Greek inability to continue servicing their\nexternal\ndebt, much less genuinely unexpected and exogenous shocks.\nAs awful as bail-ins sound, they are actually much more fair than bail-outs. After all, whether you realize it or not, your “deposits” are actually unsecured loans you have made to the bank. Why you would want to make such a high-risk loan to such an irresponsible borrower without collateral or much in the way of interest is, of course, your business.\nUPDATE: It’s official.\nGreek default tomorrow\n:\nGreece will not pay a 1.6 billon euro loan installment due to the\nInternational Monetary Fund on Tuesday, a Greek government official\nconfirmed on Monday, highlighting the depth of the financial crisis\nfacing the country.\nThis should help settle the debate. The answer is “deflation”.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-29T07:30:00+00:00"
}