{
  "url": "https://voxday.net/2015/06/11/day-vs-sandifier-transcrip/",
  "scraped_at": "2025-12-16T12:59:09.451588",
  "title": "Day vs Sandifier: the transcript",
  "date_display": "June 11, 2015",
  "date_iso": "2015-06-11T16:35:00+00:00",
  "date_from_url": "2015-06-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Upon reading this, I think I made a better case against THE WASP FACTORY than for ONE BRIGHT STAR TO GUIDE THEM, but on the whole, I’m content with <a href=\"http://www.philipsandifer.com/2015/06/the-vox-day-interview-transcript.html\">how the debate turned out</a>.</p><p>Day: And this also touches on my third part, which is: this is an idiot plot. I mean, this is what Roger Ebert described as – you know, he said that “the idiot plot is any plot that would be resolved in five minutes if everyone in the story were not an idiot.” So, you’ve got somebody who literally has never looked in her pants to discover that she’s got a vagina, you’ve got the father who is beyond idiocy with the whole story about the dog and the creation of the fake genitals just in case she ever asks, and then of course you’ve got Eric, who apparently never figured out that his sister was actually his sister either. I mean, this is an idiot plot. There’s no way around that.</p><p>Sandifer: <i>This is grotesque, it’s a grotesquery. I think that the ludicrousness of it is a joke in the same spirit as “killing three people was just a phase I was going through.” I don’t think it’s an idiot plot so much as it is a parody of rural grotesquery that is deliberately at the absolute limits of what is even remotely plausible.</i></p><p>Day: I personally think it’s well beyond those limits, and, you know, I’m not saying that there’s no humor to it, but, you know, I didn’t find it funny, for the most part. The occasional one-offs, like you mention, you know, those were mildly amusing, but just to wallow in that depth of depravity and violence and murder, you know, it’s literally disgusting, and I didn’t find it funny, I didn’t find it edifying. Like I said, the plot is a literal idiot plot. Whether you want to say it’s because it was parody or not, it’s still an idiot plot. I’m not one of those people who finds… What’s that show, the guy from The Office…</p><p>Sandifer: <i>U.S. or U.K.?</i></p><p>Day: Ricky Gervais.</p><p>Sandifer: <i>Yes.</i></p><p>Day: He has that television show where he pretends to be retarded or something, and every ad he’s gurning, you know what I mean? It’s a relatively new show. I don’t find that funny either. And so, maybe the fact that it’s got an idiot plot but it’s a parody, therefore it’s supposed to make it intelligent, but to me, the plot is still what the plot is, and so I found it very, very disappointing, because the whole plot is totally dependent on the three major characters being and behaving like complete idiots.</p><p>And the problem I have when you talk about the whole psychosocial aspect of Frank is Banks, in my opinion, gets the characters completely wrong. Frank is not convincing in any way, shape, or form as a girl who believes she’s a boy, and that sort of thing. I’m pretty sure that Iain Banks never had any daughters, because if you’re a parent, and you’ve got both boys and girls, there is not a chance in hell that a little girl, even if you raise her as a boy, is going to behave like a boy.  This is where I think it goes beyond parody and is a level of absurd that is not credible. I would have found it much more credible if Frank had some female attributes and characteristics in his thinking that he couldn’t explain. But instead, like you said, he’s more of a parody of a hyper-male, and that to me makes no sense whatsoever.</p><p>Sandifer: <i>I agree that there’s an element of extreme implausibility, obviously, to some of the plot elements. I do think, going through, I note that Banks takes care to find some explanation for pretty much all of the elements of it, so that he at least has a sort of nice Aristotelian unity, where everything is either made necessary or likely by some other event, even if the characters are certainly very extreme. But it seems to me like your objection is less that you don’t believe that Frank would have physically figured it out – because there is the explanation, for instance, of the male hormones enlarging the clitoris so that it looked like the stump of his penis.</i></p><p>Day: Yeah, I get that, but where did the vagina come from?</p><p>Sandifer: <i>I would assume that Frank just assumed it was the mutilated and tattered remnants of the wound.</i></p><p>Day: Well, except for the fact that the urine is not coming of the stump of the clitoris. And the fact that it kind of goes pretty deep. I mean, we’re dealing with somebody who is literally retarded, which we know from his behavior he’s not.</p></div>",
  "content_text": "Upon reading this, I think I made a better case against THE WASP FACTORY than for ONE BRIGHT STAR TO GUIDE THEM, but on the whole, I’m content with\nhow the debate turned out\n.\nDay: And this also touches on my third part, which is: this is an idiot plot. I mean, this is what Roger Ebert described as – you know, he said that “the idiot plot is any plot that would be resolved in five minutes if everyone in the story were not an idiot.” So, you’ve got somebody who literally has never looked in her pants to discover that she’s got a vagina, you’ve got the father who is beyond idiocy with the whole story about the dog and the creation of the fake genitals just in case she ever asks, and then of course you’ve got Eric, who apparently never figured out that his sister was actually his sister either. I mean, this is an idiot plot. There’s no way around that.\nSandifer:\nThis is grotesque, it’s a grotesquery. I think that the ludicrousness of it is a joke in the same spirit as “killing three people was just a phase I was going through.” I don’t think it’s an idiot plot so much as it is a parody of rural grotesquery that is deliberately at the absolute limits of what is even remotely plausible.\nDay: I personally think it’s well beyond those limits, and, you know, I’m not saying that there’s no humor to it, but, you know, I didn’t find it funny, for the most part. The occasional one-offs, like you mention, you know, those were mildly amusing, but just to wallow in that depth of depravity and violence and murder, you know, it’s literally disgusting, and I didn’t find it funny, I didn’t find it edifying. Like I said, the plot is a literal idiot plot. Whether you want to say it’s because it was parody or not, it’s still an idiot plot. I’m not one of those people who finds… What’s that show, the guy from The Office…\nSandifer:\nU.S. or U.K.?\nDay: Ricky Gervais.\nSandifer:\nYes.\nDay: He has that television show where he pretends to be retarded or something, and every ad he’s gurning, you know what I mean? It’s a relatively new show. I don’t find that funny either. And so, maybe the fact that it’s got an idiot plot but it’s a parody, therefore it’s supposed to make it intelligent, but to me, the plot is still what the plot is, and so I found it very, very disappointing, because the whole plot is totally dependent on the three major characters being and behaving like complete idiots.\nAnd the problem I have when you talk about the whole psychosocial aspect of Frank is Banks, in my opinion, gets the characters completely wrong. Frank is not convincing in any way, shape, or form as a girl who believes she’s a boy, and that sort of thing. I’m pretty sure that Iain Banks never had any daughters, because if you’re a parent, and you’ve got both boys and girls, there is not a chance in hell that a little girl, even if you raise her as a boy, is going to behave like a boy.  This is where I think it goes beyond parody and is a level of absurd that is not credible. I would have found it much more credible if Frank had some female attributes and characteristics in his thinking that he couldn’t explain. But instead, like you said, he’s more of a parody of a hyper-male, and that to me makes no sense whatsoever.\nSandifer:\nI agree that there’s an element of extreme implausibility, obviously, to some of the plot elements. I do think, going through, I note that Banks takes care to find some explanation for pretty much all of the elements of it, so that he at least has a sort of nice Aristotelian unity, where everything is either made necessary or likely by some other event, even if the characters are certainly very extreme. But it seems to me like your objection is less that you don’t believe that Frank would have physically figured it out – because there is the explanation, for instance, of the male hormones enlarging the clitoris so that it looked like the stump of his penis.\nDay: Yeah, I get that, but where did the vagina come from?\nSandifer:\nI would assume that Frank just assumed it was the mutilated and tattered remnants of the wound.\nDay: Well, except for the fact that the urine is not coming of the stump of the clitoris. And the fact that it kind of goes pretty deep. I mean, we’re dealing with somebody who is literally retarded, which we know from his behavior he’s not.",
  "tags": [
    "books",
    "debate"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-11T15:35:00+00:00"
}