{
  "url": "https://voxday.net/2015/06/21/delusion-and-deterrence/",
  "scraped_at": "2025-12-16T13:00:20.416624",
  "title": "Delusion and deterrence",
  "date_display": "June 21, 2015",
  "date_iso": "2015-06-21T09:41:00+00:00",
  "date_from_url": "2015-06-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Mr. Smith has a rather unusual theory about the Charleston church shootings:</p><blockquote class=\"tr_bq\"><p> Adam F. Smith ‏@Adampdx <a href=\"https://twitter.com/Adampdx/status/611601751070781440\">Jun 18</a><br> Haters like @castaliahouse  Theodore “Vox Day” Beale are the cause of massacre at SC AME church #SadPuppies #hugoawards</br></p></blockquote><p>I look forward to the SJWs at File 770 being as horrified and outraged by this ludicrous accusation as they pretended to be by Mike Z. Williamson’s “too soon” joke. It’s particularly bizarre since I am not Castalia House and @castaliahouse has never taken any position on any American racial or religious affairs.</p><p>It’s rather amusing to see the many attacks by their own side the SJWs resolutely ignore as they go about their daily posturing and strike their latest outrage poses. Tor employees attack Tor’s authors and customers alike, Castalia House has undergone six straight months of cracking attempts, Vox Popoli is now into its third straight day of a DDOS attack, hundreds of people emailing Tor Books have been accused of being bots by Tor employees even as as Tor supporters create fake tweets <a href=\"http://www.milobookclub.com/2015/06/19/the-first-law-in-action/\">to feign public support</a> for Tor, and yet science fiction’s SJWs still preen and posture as if they’re the good guys because a few hundred science fiction readers followed the rules and violated an unspoken gentlemen’s agreement to which we were not privy and to which we never agreed.</p><p>And yet, some of those on our side still want to pretend this decades-long cultural conflict is some sort of white-glove affair. There is a fundamental disagreement between the noble defeatists and those who are less willing to continue to submit to the SJWs attempt to claim cultural dominance at Sarah Hoyt’s post on <a href=\"http://accordingtohoyt.com/2015/06/19/the-marquess-de-queensbury-rules/\">The Marquess of Queensbury’s rules</a>:</p><blockquote class=\"tr_bq\"><p> <b>thewriterinblack   </b><br> Another observation I have made in the past is that our enemies often not only know that we don’t play by the same “rulebook” as they do, they count on it. Those among the Jihadis who have even a ghost of a clue know that if we were really as bad as they make out, well, it would be easier to pray toward Mecca–just face the blue glow.</br></p><p>Apropos of nothing, I am reminded of a scene in an old Fantastic Four comment. Sue Storm as the Invisible Girl (I think this was before she started calling herself the Invisible Woman) facing Dr. Doom. “Doom, do you have any idea how dangerous my force fields would be if I decided to play by your rules?”</p><p>That’s us all over.</p><p><b>Dorothy Grant</b><br> And this would be why they hate and fear Vox Day above all others: because he does play by their rules.</br></p><p><b>RES</b><br> If we played by their rules the earth would be scorched. But playing by the Devil’s rules would be to concede defeat — what we fight for is ordered liberty, constrained government, rational argument over insanity.</br></p><p>Batman does not become the Joker, Superman does not accept the values of Luthor, Spiderman does not become Doc Octopus.</p></blockquote><p>RES is completely wrong for the obvious reason that SJWs are not the Devil, they are merely his unhappy, not-very-bright children. And the vital point that RES completely misses is that you do not defend ordered liberty, constrained government, and rational argument over insanity with unconstrained liberty, government inaction, and talk. You defend it with force, and you defend it successfully with force that exceeds that of your opponent at the point of conflict.</p><p>The Romans did not become the Britons by defeating them with superior force. The USA did not become Nazi Germany by invading Normandy (although it may as a result of the 1965 Immigration Act). The Soviets did not become the Afghans and the Coalition of the Willing has not become the global jihad. Batman would not become the Joker even if he snapped the Joker’s neck, but he would certainly save the lives of all of those who would have been killed by the Joker in the future.</p><p>What frustrates me about the noble defeatists is that they are like a football team who refuses to accept the newfangled rules that permit the forward pass. They insist on playing the game in the outmoded way they believe to be the correct way, run the ball every down against a defense with 11 men stacked in the box, and inevitably lose when the other team passes for ten touchdowns and wins 70-0.</p><p>The problem is a conceptual one at heart. Even those whose devotion to free expression is unquestioned, such as Ken and Clarke of PopeHat, fail to understand that their efforts are doomed to failure so long as they confuse the <i>objective </i>with the <i>methods</i> used to defend it. This is not a “by any means” argument, it is a straightforward argument for Chicago Rules deterrence.</p><p>The best defense for free expression is not to permit the other side to freely libel and slander and calumniate and defame and lie while responding with few feeble protests that what they’re saying just ain’t so. The reason poison gas has made very few appearances on the battlefield since WWI is not because the French, English, and Americans set the Germans a good example, but because they promptly responded by manufacturing and using even more gas than the Germans did. The only reason the USA has not dropped an atomic bomb since 1945 is because the Soviet Union obtained their own in 1949.</p><p>Has the assault on free speech waxed or waned since Belgium introduced hate speech laws in 1981? The high-minded non-deterrent approach has failed, <i>continuously failed</i>, for the last three decades. The SJWs find speech-policing to be a useful weapon for marginalizing, disqualifying, and destroying their enemies and they are not going to give it up until they find themselves suffering from it to a greater extent than the free speech advocates do.</p><p>If you seek to defend free expression, you can do no better than to follow the lead of Lieutenant General Sir Charles Ferguson, who said of poison gas, which he deplored as a “cowardly” and un-English form of warfare:</p><p><i>“We cannot win this war unless we kill or incapacitate more of our enemies than they do of us, and if this can only be done by our copying the enemy in his choice of weapons, we must not refuse to do so.”</i></p><p>This does not mean we must blindly imitate the other side, particularly not in their instinctual resort to stupid and petty lies, transparent psychological projection, and a foolish insistence on defending the indefensible. Nor should we seek to be as blindly ignorant of them as they are of us. What it means is that we should adopt their more effective tactics, and, as the Allies did with gas in WWI, make even more effective and extensive use of those tactics until they agree to abandon them.<i></i></p></div>",
  "content_text": "Mr. Smith has a rather unusual theory about the Charleston church shootings:\nAdam F. Smith ‏@Adampdx\nJun 18\nHaters like @castaliahouse  Theodore “Vox Day” Beale are the cause of massacre at SC AME church #SadPuppies #hugoawards\nI look forward to the SJWs at File 770 being as horrified and outraged by this ludicrous accusation as they pretended to be by Mike Z. Williamson’s “too soon” joke. It’s particularly bizarre since I am not Castalia House and @castaliahouse has never taken any position on any American racial or religious affairs.\nIt’s rather amusing to see the many attacks by their own side the SJWs resolutely ignore as they go about their daily posturing and strike their latest outrage poses. Tor employees attack Tor’s authors and customers alike, Castalia House has undergone six straight months of cracking attempts, Vox Popoli is now into its third straight day of a DDOS attack, hundreds of people emailing Tor Books have been accused of being bots by Tor employees even as as Tor supporters create fake tweets\nto feign public support\nfor Tor, and yet science fiction’s SJWs still preen and posture as if they’re the good guys because a few hundred science fiction readers followed the rules and violated an unspoken gentlemen’s agreement to which we were not privy and to which we never agreed.\nAnd yet, some of those on our side still want to pretend this decades-long cultural conflict is some sort of white-glove affair. There is a fundamental disagreement between the noble defeatists and those who are less willing to continue to submit to the SJWs attempt to claim cultural dominance at Sarah Hoyt’s post on\nThe Marquess of Queensbury’s rules\n:\nthewriterinblack\nAnother observation I have made in the past is that our enemies often not only know that we don’t play by the same “rulebook” as they do, they count on it. Those among the Jihadis who have even a ghost of a clue know that if we were really as bad as they make out, well, it would be easier to pray toward Mecca–just face the blue glow.\nApropos of nothing, I am reminded of a scene in an old Fantastic Four comment. Sue Storm as the Invisible Girl (I think this was before she started calling herself the Invisible Woman) facing Dr. Doom. “Doom, do you have any idea how dangerous my force fields would be if I decided to play by your rules?”\nThat’s us all over.\nDorothy Grant\nAnd this would be why they hate and fear Vox Day above all others: because he does play by their rules.\nRES\nIf we played by their rules the earth would be scorched. But playing by the Devil’s rules would be to concede defeat — what we fight for is ordered liberty, constrained government, rational argument over insanity.\nBatman does not become the Joker, Superman does not accept the values of Luthor, Spiderman does not become Doc Octopus.\nRES is completely wrong for the obvious reason that SJWs are not the Devil, they are merely his unhappy, not-very-bright children. And the vital point that RES completely misses is that you do not defend ordered liberty, constrained government, and rational argument over insanity with unconstrained liberty, government inaction, and talk. You defend it with force, and you defend it successfully with force that exceeds that of your opponent at the point of conflict.\nThe Romans did not become the Britons by defeating them with superior force. The USA did not become Nazi Germany by invading Normandy (although it may as a result of the 1965 Immigration Act). The Soviets did not become the Afghans and the Coalition of the Willing has not become the global jihad. Batman would not become the Joker even if he snapped the Joker’s neck, but he would certainly save the lives of all of those who would have been killed by the Joker in the future.\nWhat frustrates me about the noble defeatists is that they are like a football team who refuses to accept the newfangled rules that permit the forward pass. They insist on playing the game in the outmoded way they believe to be the correct way, run the ball every down against a defense with 11 men stacked in the box, and inevitably lose when the other team passes for ten touchdowns and wins 70-0.\nThe problem is a conceptual one at heart. Even those whose devotion to free expression is unquestioned, such as Ken and Clarke of PopeHat, fail to understand that their efforts are doomed to failure so long as they confuse the\nobjective\nwith the\nmethods\nused to defend it. This is not a “by any means” argument, it is a straightforward argument for Chicago Rules deterrence.\nThe best defense for free expression is not to permit the other side to freely libel and slander and calumniate and defame and lie while responding with few feeble protests that what they’re saying just ain’t so. The reason poison gas has made very few appearances on the battlefield since WWI is not because the French, English, and Americans set the Germans a good example, but because they promptly responded by manufacturing and using even more gas than the Germans did. The only reason the USA has not dropped an atomic bomb since 1945 is because the Soviet Union obtained their own in 1949.\nHas the assault on free speech waxed or waned since Belgium introduced hate speech laws in 1981? The high-minded non-deterrent approach has failed,\ncontinuously failed\n, for the last three decades. The SJWs find speech-policing to be a useful weapon for marginalizing, disqualifying, and destroying their enemies and they are not going to give it up until they find themselves suffering from it to a greater extent than the free speech advocates do.\nIf you seek to defend free expression, you can do no better than to follow the lead of Lieutenant General Sir Charles Ferguson, who said of poison gas, which he deplored as a “cowardly” and un-English form of warfare:\n“We cannot win this war unless we kill or incapacitate more of our enemies than they do of us, and if this can only be done by our copying the enemy in his choice of weapons, we must not refuse to do so.”\nThis does not mean we must blindly imitate the other side, particularly not in their instinctual resort to stupid and petty lies, transparent psychological projection, and a foolish insistence on defending the indefensible. Nor should we seek to be as blindly ignorant of them as they are of us. What it means is that we should adopt their more effective tactics, and, as the Allies did with gas in WWI, make even more effective and extensive use of those tactics until they agree to abandon them.",
  "tags": [
    "history",
    "SJW",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-21T08:41:00+00:00"
}