{
  "url": "https://voxday.net/2015/06/09/descent-into-darkness/",
  "scraped_at": "2025-12-16T12:58:52.907433",
  "title": "Descent into darkness",
  "date_display": "June 9, 2015",
  "date_iso": "2015-06-09T13:11:00+00:00",
  "date_from_url": "2015-06-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p> VDH warns of <a href=\"http://pjmedia.com/victordavishanson/building-the-new-dark-age-mind/?singlepage=true\">the end of an age</a>:</p><blockquote class=\"tr_bq\"><p> History is not static and it does not progress linearly.  There was more free speech and unimpeded expression in 5th-century<br> Athens than in Western Europe between 1934-45, or in Eastern Europe<br> during 1946-1989. An American could speak his mind more freely in 1970<br> than now. Many in the United States had naively believed that the<br> Enlightenment, the U.S. Constitution, and over two centuries of American<br> customs and traditions had guaranteed that Americans could always take<br> for granted free speech and unfettered inquiry.</br></br></br></br></br></br></p><p>That is an ahistorical assumption. The wish to silence, censor, and<br> impede thought is just as strong a human emotion as the desire for free<br> expression — especially when censorship is cloaked in rhetoric about<br> fairness, equality, justice, and all the other euphemisms for not<br> allowing the free promulgation of ideas.</br></br></br></br></p><p>George Orwell devoted his later years to warning us that while the<br> fascist method of destroying free expression was easily identified<br> (albeit only with difficulty combatted), the leftwing totalitarian<br> impulse to squelch unpopular speech was far harder to resist — couched<br> as it was in sloganeering about the “people” and “social justice.” </br></br></br></br></p></blockquote><p>He’s right. The descent into the Dark Ages will not end well. It never has in the past. We must fight the barbarians at every step, within and without, because even though we will probably lose, we will preserve the seeds from which future civilizations will grow.</p></div>",
  "content_text": "VDH warns of\nthe end of an age\n:\nHistory is not static and it does not progress linearly.  There was more free speech and unimpeded expression in 5th-century\nAthens than in Western Europe between 1934-45, or in Eastern Europe\nduring 1946-1989. An American could speak his mind more freely in 1970\nthan now. Many in the United States had naively believed that the\nEnlightenment, the U.S. Constitution, and over two centuries of American\ncustoms and traditions had guaranteed that Americans could always take\nfor granted free speech and unfettered inquiry.\nThat is an ahistorical assumption. The wish to silence, censor, and\nimpede thought is just as strong a human emotion as the desire for free\nexpression — especially when censorship is cloaked in rhetoric about\nfairness, equality, justice, and all the other euphemisms for not\nallowing the free promulgation of ideas.\nGeorge Orwell devoted his later years to warning us that while the\nfascist method of destroying free expression was easily identified\n(albeit only with difficulty combatted), the leftwing totalitarian\nimpulse to squelch unpopular speech was far harder to resist — couched\nas it was in sloganeering about the “people” and “social justice.”\nHe’s right. The descent into the Dark Ages will not end well. It never has in the past. We must fight the barbarians at every step, within and without, because even though we will probably lose, we will preserve the seeds from which future civilizations will grow.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-09T12:11:00+00:00"
}