{
  "url": "https://voxday.net/2015/06/15/downfall-of-nobel-laureate/",
  "scraped_at": "2025-12-16T12:59:35.469336",
  "title": "Downfall of a Nobel Laureate",
  "date_display": "June 15, 2015",
  "date_iso": "2015-06-15T10:44:00+00:00",
  "date_from_url": "2015-06-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Sir Tim Hunt and his wife describe <a href=\"http://www.theguardian.com/science/2015/jun/13/tim-hunt-hung-out-to-dry-interview-mary-collins?CMP=share_btn_tw\">how the SJW witch patrol suckered and burned him</a>:</p><blockquote class=\"tr_bq\"><p> As jokes go, Sir Tim Hunt’s brief standup routine about women in science last week must rank as one of the worst acts of academic self-harm in history. As he reveals to the Observer, reaction to his remarks about the alleged lachrymose tendencies of female researchers has virtually finished off the 72-year-old Nobel laureate’s career as a senior scientific adviser.</p><p>What he said was wrong, he acknowledges, but the price he and his wife have had to pay for his mistakes has been extreme and unfair. “I have been hung out to dry,” says Hunt.</p><p>His wife, Professor Mary Collins, one of Britain’s most senior immunologists, is similarly indignant. She believes that University College London – where both scientists had posts – has acted in “an utterly unacceptable” way in pressuring both researchers and in failing to support their causes. Certainly the speed of the dispatch of Hunt – who won the 2001 Nobel<br> prize in physiology for his work on cell division – from his various<br> academic posts is startling….</br></br></p><p>“I was told by a senior that Tim had to resign immediately or be sacked – though I was told it would be treated as a low-key affair. Tim duly emailed his resignation when he got home. The university promptly announced his resignation on its website and started tweeting that they had got rid of him. Essentially, they had hung both of us out to dry. They certainly did not treat it as a low-key affair. I got no warning about the announcement and no offer of help, even though I have worked there for nearly 20 years. It has done me lasting damage. What they did was unacceptable.”</p><p>The story appeared in newspapers round the world under headlines that said that Hunt had been sacked by UCL for sexism. Worse was to follow. The European Research Council (ERC) – Hunt served on its science committee – decided to force him to stand down in view of his resignation from UCL….</p><p>Hunt is under no illusions about the consequences. “I am finished,” he<br> says. “I had hoped to do a lot more to help promote science in this<br> country and in Europe, but I cannot see how that can happen. I have<br> become toxic. I have been hung to dry by academic institutes who have<br> not even bothered to ask me for my side of affairs.”</br></br></br></br></p></blockquote><p>Hunt’s crime? He said this: <i>“Let me tell you about my trouble with girls. Three things happen when they are in the lab. You fall in love with them, they fall in love with you, and when you criticise them, they cry.”</i></p><p>I wonder what would have happened if he said the women who worked in his lab were racist neo-Nazis who produced bad-to-reprehensible work?</p><p>Of course, Hunt made two grievous errors. His first error: he apologized when he hadn’t actually done anything wrong. Unlike Irene Gallo, there was nothing wrong with what he said. It was a joke. And it was a joke based on the reality of his long experience. Sure, it was probably a foolish one to make in today’s hyperpoliticized environment, but Dr. Hunt presumably thought that his Nobel Prize and his standing in the field of science would be sufficient to protect him. He was wrong. His second error: he resigned. The university couldn’t possibly have fired him for what he said, but the SJWs lied to his wife and convinced her to convince him to make it easy for them.</p><p>Now contrast this incident with the Gallo affair. Irene Gallo neither apologized for her indefensible statements nor recanted them. She has not resigned. And, unlike the unfortunate Dr. Hunt, she has given her employer more than sufficient reason to fire her for cause.</p></div>",
  "content_text": "Sir Tim Hunt and his wife describe\nhow the SJW witch patrol suckered and burned him\n:\nAs jokes go, Sir Tim Hunt’s brief standup routine about women in science last week must rank as one of the worst acts of academic self-harm in history. As he reveals to the Observer, reaction to his remarks about the alleged lachrymose tendencies of female researchers has virtually finished off the 72-year-old Nobel laureate’s career as a senior scientific adviser.\nWhat he said was wrong, he acknowledges, but the price he and his wife have had to pay for his mistakes has been extreme and unfair. “I have been hung out to dry,” says Hunt.\nHis wife, Professor Mary Collins, one of Britain’s most senior immunologists, is similarly indignant. She believes that University College London – where both scientists had posts – has acted in “an utterly unacceptable” way in pressuring both researchers and in failing to support their causes. Certainly the speed of the dispatch of Hunt – who won the 2001 Nobel\nprize in physiology for his work on cell division – from his various\nacademic posts is startling….\n“I was told by a senior that Tim had to resign immediately or be sacked – though I was told it would be treated as a low-key affair. Tim duly emailed his resignation when he got home. The university promptly announced his resignation on its website and started tweeting that they had got rid of him. Essentially, they had hung both of us out to dry. They certainly did not treat it as a low-key affair. I got no warning about the announcement and no offer of help, even though I have worked there for nearly 20 years. It has done me lasting damage. What they did was unacceptable.”\nThe story appeared in newspapers round the world under headlines that said that Hunt had been sacked by UCL for sexism. Worse was to follow. The European Research Council (ERC) – Hunt served on its science committee – decided to force him to stand down in view of his resignation from UCL….\nHunt is under no illusions about the consequences. “I am finished,” he\nsays. “I had hoped to do a lot more to help promote science in this\ncountry and in Europe, but I cannot see how that can happen. I have\nbecome toxic. I have been hung to dry by academic institutes who have\nnot even bothered to ask me for my side of affairs.”\nHunt’s crime? He said this:\n“Let me tell you about my trouble with girls. Three things happen when they are in the lab. You fall in love with them, they fall in love with you, and when you criticise them, they cry.”\nI wonder what would have happened if he said the women who worked in his lab were racist neo-Nazis who produced bad-to-reprehensible work?\nOf course, Hunt made two grievous errors. His first error: he apologized when he hadn’t actually done anything wrong. Unlike Irene Gallo, there was nothing wrong with what he said. It was a joke. And it was a joke based on the reality of his long experience. Sure, it was probably a foolish one to make in today’s hyperpoliticized environment, but Dr. Hunt presumably thought that his Nobel Prize and his standing in the field of science would be sufficient to protect him. He was wrong. His second error: he resigned. The university couldn’t possibly have fired him for what he said, but the SJWs lied to his wife and convinced her to convince him to make it easy for them.\nNow contrast this incident with the Gallo affair. Irene Gallo neither apologized for her indefensible statements nor recanted them. She has not resigned. And, unlike the unfortunate Dr. Hunt, she has given her employer more than sufficient reason to fire her for cause.",
  "tags": [
    "media",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-15T09:44:00+00:00"
}