{
  "url": "https://voxday.net/2015/06/02/economics-102/",
  "scraped_at": "2025-12-16T12:57:57.471913",
  "title": "Economics 102 and remedial Theology",
  "date_display": "June 2, 2015",
  "date_iso": "2015-06-02T08:34:00+00:00",
  "date_from_url": "2015-06-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>We begin with explaining the economic concept of “opportunity cost” <a href=\"http://www.jimchines.com/2015/06/publishing-101/\">to Jim Hines</a>, John Scalzi, and Patrick Nielsen Hayden:</p><blockquote class=\"tr_bq\"><p> In the wake of Scalzi’s Big Book Deal, folks have been saying some rather ignorant or ill-informed stuff about how publishing works. I wanted to address a few of those points here.</p><p>Let’s start with the easiest, in which folks over on Theodore Beale’s blog claim that by Tor giving Scalzi a $3.4 million advance, they’re “squeezing out” approximately “523 initial advances to new science fiction authors.” In other words, Beale claims that “Patrick Nielsen Hayden and John Scalzi have combined to prevent more than 500 authors from getting published and receiving paid advances.”</p><p>This is a particularly egregious bit of ignorance coming from Mister Beale, who fancies himself a publisher.</p><p>Publishing is a business. As a business, Tor not only spends money on things like acquiring and publishing books, they also earn money by selling said books. Assuming Scalzi shut out 500 authors assumes that Tor is simply pissing away that $3.4 million. This is a rather asinine assumption. John Scalzi has repeatedly hit the NYT Bestseller list, earned a Best Novel Hugo, and has several TV/film deals in development for his work. Tor buys books from John Scalzi for the same reason they buy books from Orson Scott Card: those books sell a hell of a lot of copies, and earn Tor significant profits.</p><p>Very often it’s those profits — the income from reliable bestsellers like Card and Scalzi — that allow publishers to take a chance on new and unknown authors.</p></blockquote><p>Let’s count the errors:</p><ol><li>Scalzi and PNH <i>have </i>combined to render it impossible for 523 new science fiction authors to break into mainstream publishing through Tor Books. This is a simple fact so long as we know that Tor does not have an unlimited amount of money at its disposal. The fact that Pan Macmillan <a href=\"http://www.thebookseller.com/news/julie-crisp-departs-tor\">just canned PNH’s counterpart at Tor UK</a> “following a review of the company’s science fiction and fantasy publishing” should suffice to indicate that Tor’s advance budget is not limitless. The math is straightforward: PNH chose to give one author 13 advances of ~$250,000 per book rather than giving 523 authors $6,500 advances of the sort he gave John Scalzi for <i>Old Man’s War</i>. Any response that doesn’t take this into account is mere handwaving and evasion.</li><li>I don’t fancy myself a publisher. I am very pleased to have the privilege of publishing John C. Wright, Jerry Pournelle, Eric Raymond, Tom Kratman, Sarah Salviander, Jonathan Moeller, Rolf Nelson, Martin van Creveld, and William S. Lind, among others. And we expect to announce the publication of several big names from the game industry soon.</li><li>Observing that Scalzi financially shut out 500+ authors does not assume that Tor is simply pissing away that $3.4 million. Those authors are now shut out whether Scalzi sells millions of books or none at all. If Tor is pissing away that $3.4 million, it is the authors <i>now being published</i> by Tor who will be shut out in the future. Tor is literally betting their careers on Scalzi. I expect some will like that gamble, others not so much.</li><li>The opportunity cost of a choice is the value of the best alternative forgone, in a situation in which a choice needs to be made between several mutually exclusive alternatives given limited resources. We’ve already established that Tor’s resources are limited. So, the question is not whether John Scalzi’s next 13 books “sell a hell of a lot of copies, and earn Tor significant profits”, but if those 13 books will sell MORE copies, and earn Tor MORE significant profits, than the books from other authors Tor otherwise might have signed.</li><li>Tor bought Scalzi’s various one-and-done appearances on the oft-gamed NYT Bestseller list. The idea that <i>Fuzzy Nation</i> was ever more popular than <i>Old Man’s War</i><br> or sold more copies is downright risible. To cite Tor’s past<br> marketing efforts as justification for the new authors it has decided not to publish is a category error. It’s a sunk cost of trivial<br> benefit going forward, not that Hines likely knows what a “sunk cost” is. As for the appeal to the Hugo Award, I’m going to give McCreepy the benefit of the doubt and assume that’s sarcasm.</br></br></br></li></ol><p>Remember, each new author doesn’t have to outsell Scalzi to generate opportunity cost. The breakeven on units for each book is 2.5 percent of Scalzi’s individual book sales. Assuming the average new Tor writer sells 10,000 books, (and the biggest publisher in SF had better be able to sell that many) that means <i>each</i> of the 13 Scalzi books has to sell <i>at least 402,308 copies</i> for Tor to break even on the opportunity cost from a reasonable unit sales perspective. And each new author who proves capable of selling more than 10k copies only makes the decision that much worse for Tor. You will notice that none of the Scalzi allies attempting to defend the deal ever bother to work through the actual math of it, preferring to rely instead on general phrases like “a hell of a lot”.</p><p>However, there are two very real and even significant justifications for preferring 13 John Scalzi<br> books to 523 new author books even if the future sales estimates tend to favor the latter. Hines doesn’t bring them up, presumably  because they highlight my point<br> about how there are 3.4 million reasons the deal is shutting out new authors. It is more expensive, and<br> therefore less profitable, to edit, print, and distribute 523 different<br> authors than one. Even if we use the EFA’s very conservative guidelines and assume an unrealistically low production amount of $5,000 per book, those 523 authors would cost Tor at least $3 million more in production costs than producing John Scalzi’s 13 books will.</br></br></br></br></p><p>Furthermore, there are a limited number of available slots in the retail channels, even for Tor. Barnes &amp; Noble is not going to endcap 500 different Tor books; they probably don’t even carry that many in total. But again, this supports my larger point about how the increased centralization of traditional publishing tends to lock out new authors and midlist authors alike. That was why I stopped even talking to traditional publishers years ago; as a midlist author who sold 30k to 40k copies per book, I knew I was of little interest to them. These days, if you can’t at least threaten six digits in your two chances at publication, you will need to be a gatekeeper’s pet in order to stay in traditional print for long. The dirty little secret of traditional publishing is that its profits are no less dependent upon constant churn than the average stockbrokerage.</p><p>And this points to the best part of what increasingly looks like a pretty good deal for Scalzi: he is locking in Tor’s marketing focus on his behalf, although again, at the expense of its other authors. And that, combined with what we have learned about Pan Macmillan’s unhappiness with its editorial product in the UK, leads me to suspect that PNH is feeling the heat from above and has therefore thrown a bit of a Hail Mary in order to buy himself more time.</p><p>Since we’re on the subject of openly clueless statements about me at File 770, let’s address two of their creative takes on theology while we’re at it:</p><p><a name=\"more\"></a></p><blockquote><p> <b>CPaca on June 1, 2015 at 3:27 pm said:</b><br> VD isn’t a Christian, despite claiming he is. The belief that Satan rules the world instead of God is some form of Christian Gnostic heresy. One has to wonder if Wright is fully aware of who he’s hanging out with.</br></p></blockquote><p>If this were a science fiction novel, the dialogue would end here, with the Atheist Who Knows the Bible Better than the Bible-Thumping Bigot gloriously triumphing. Of course, this isn’t a science fiction novel, and in fact, their knowledge of Christianity literally doesn’t rise to the level of <i>Out of the Silent Planet</i>. Do they not even understand what “Silent Planet” means? Do they not truly not understand the entire purpose of the Word made flesh, much less the Crucifixion?</p><p>The belief that Satan rules the world is the very essence of Christianity!</p><p><i>Again, the devil took him to a very high mountain and showed him all the kingdoms of the world and their splendor. “All this I will give you,” he said, “if you will bow down and worship me.” Jesus said to him, “Away from me, Satan! For it is written: ‘Worship the Lord your God, and serve him only.’ </i><br> -Matthew 4:1-11<br> <i><br/></i><br> <i>But very truly I tell you, it is for your good that I am going away. Unless I go away, the Advocate will not come to you; but if I go, I will send him to you.  When he comes, he will prove the world to be in the wrong about sin and righteousness and judgment:  about sin, because people do not believe in me;  about righteousness, because I am going to the Father, where you can see me no longer;  and about judgment, because the prince of this world now stands condemned.</i><br> – John 16:7-11</br></br></br></br></p><p><i>The god of this age has blinded the minds of unbelievers, so that they cannot see the light of the gospel that displays the glory of Christ, who is the image of God.</i><br> – 2nd Corinthians 4:4</br></p><blockquote class=\"tr_bq\"><p> <b>Stevie on June 1, 2015 at 3:56 pm said:</b><br> I think we agree that VD is not a Christian; I think that VD would happily abandon his not very good grasp of Gnosticism on the grounds of ‘rhetoric’, or ‘Aristotle’, or whatever flavour of evasion he happens to feel like at any given time. Given his obsessive hatred of John Scalzi I suspect that VD cheers himself up by imagining him as ‘left behind’.</br></p><p>Sadly, Wright’s track record as a professed Christian suggests that he doesn’t understand Christianity either; his appalling outburst about Terry Pratchett is wholly incompatible with Christ’s commandment that we should love each other. Wright appears to be under the impression that Christ really didn’t understand being God, and that Wright has much better ideas as to what God actually wants than the reprobate who spent his time with the poor, the sick, the hungry, and consorted with dreadful people like tax collectors…</p></blockquote><p>I can’t abandon what I don’t have. And as for the idea that John Wright’s rejection of the late Pratchett’s euthanasia activism is somehow incompatible with Christianity, that is simply false. Terry Pratchett was not only, as Neil Gaiman described him, <a href=\"http://www.independent.co.uk/news/people/neil-gaiman-on-terry-pratchett-he-is-not-a-jolly-old-elf-at-all-9754917.html\">a very angry man</a>, he was a very <a href=\"http://www.milobookclub.com/2010/02/01/so-kill-yourself-already/\">wicked and cowardly man</a>.</p><p><i>You have loved righteousness and hated wickedness; therefore God, your God, has set you above your companions by anointing you with the oil of joy.</i><br> – Hebrews 1:9</br></p><p>But it is true that as a man outside the Church, we should not judge him; God will do that. In any event, the extent and intensity of their hatred for me should suffice to testify as to whether I am a Christian or not.</p><p><i>If the world hates you, keep in mind that it hated me first. If you belonged to the world, it would love you as its own. As it is, you do not belong to the world, but I have chosen you out of the world. That is why the world hates you. </i><br> –  John 15:17-19</br></p><p>Let them hate. I never forget who they hate first and foremost.</p></div>",
  "content_text": "We begin with explaining the economic concept of “opportunity cost”\nto Jim Hines\n, John Scalzi, and Patrick Nielsen Hayden:\nIn the wake of Scalzi’s Big Book Deal, folks have been saying some rather ignorant or ill-informed stuff about how publishing works. I wanted to address a few of those points here.\nLet’s start with the easiest, in which folks over on Theodore Beale’s blog claim that by Tor giving Scalzi a $3.4 million advance, they’re “squeezing out” approximately “523 initial advances to new science fiction authors.” In other words, Beale claims that “Patrick Nielsen Hayden and John Scalzi have combined to prevent more than 500 authors from getting published and receiving paid advances.”\nThis is a particularly egregious bit of ignorance coming from Mister Beale, who fancies himself a publisher.\nPublishing is a business. As a business, Tor not only spends money on things like acquiring and publishing books, they also earn money by selling said books. Assuming Scalzi shut out 500 authors assumes that Tor is simply pissing away that $3.4 million. This is a rather asinine assumption. John Scalzi has repeatedly hit the NYT Bestseller list, earned a Best Novel Hugo, and has several TV/film deals in development for his work. Tor buys books from John Scalzi for the same reason they buy books from Orson Scott Card: those books sell a hell of a lot of copies, and earn Tor significant profits.\nVery often it’s those profits — the income from reliable bestsellers like Card and Scalzi — that allow publishers to take a chance on new and unknown authors.\nLet’s count the errors:\nScalzi and PNH\nhave\ncombined to render it impossible for 523 new science fiction authors to break into mainstream publishing through Tor Books. This is a simple fact so long as we know that Tor does not have an unlimited amount of money at its disposal. The fact that Pan Macmillan\njust canned PNH’s counterpart at Tor UK\n“following a review of the company’s science fiction and fantasy publishing” should suffice to indicate that Tor’s advance budget is not limitless. The math is straightforward: PNH chose to give one author 13 advances of ~$250,000 per book rather than giving 523 authors $6,500 advances of the sort he gave John Scalzi for\nOld Man’s War\n. Any response that doesn’t take this into account is mere handwaving and evasion.\nI don’t fancy myself a publisher. I am very pleased to have the privilege of publishing John C. Wright, Jerry Pournelle, Eric Raymond, Tom Kratman, Sarah Salviander, Jonathan Moeller, Rolf Nelson, Martin van Creveld, and William S. Lind, among others. And we expect to announce the publication of several big names from the game industry soon.\nObserving that Scalzi financially shut out 500+ authors does not assume that Tor is simply pissing away that $3.4 million. Those authors are now shut out whether Scalzi sells millions of books or none at all. If Tor is pissing away that $3.4 million, it is the authors\nnow being published\nby Tor who will be shut out in the future. Tor is literally betting their careers on Scalzi. I expect some will like that gamble, others not so much.\nThe opportunity cost of a choice is the value of the best alternative forgone, in a situation in which a choice needs to be made between several mutually exclusive alternatives given limited resources. We’ve already established that Tor’s resources are limited. So, the question is not whether John Scalzi’s next 13 books “sell a hell of a lot of copies, and earn Tor significant profits”, but if those 13 books will sell MORE copies, and earn Tor MORE significant profits, than the books from other authors Tor otherwise might have signed.\nTor bought Scalzi’s various one-and-done appearances on the oft-gamed NYT Bestseller list. The idea that\nFuzzy Nation\nwas ever more popular than\nOld Man’s War\nor sold more copies is downright risible. To cite Tor’s past\nmarketing efforts as justification for the new authors it has decided not to publish is a category error. It’s a sunk cost of trivial\nbenefit going forward, not that Hines likely knows what a “sunk cost” is. As for the appeal to the Hugo Award, I’m going to give McCreepy the benefit of the doubt and assume that’s sarcasm.\nRemember, each new author doesn’t have to outsell Scalzi to generate opportunity cost. The breakeven on units for each book is 2.5 percent of Scalzi’s individual book sales. Assuming the average new Tor writer sells 10,000 books, (and the biggest publisher in SF had better be able to sell that many) that means\neach\nof the 13 Scalzi books has to sell\nat least 402,308 copies\nfor Tor to break even on the opportunity cost from a reasonable unit sales perspective. And each new author who proves capable of selling more than 10k copies only makes the decision that much worse for Tor. You will notice that none of the Scalzi allies attempting to defend the deal ever bother to work through the actual math of it, preferring to rely instead on general phrases like “a hell of a lot”.\nHowever, there are two very real and even significant justifications for preferring 13 John Scalzi\nbooks to 523 new author books even if the future sales estimates tend to favor the latter. Hines doesn’t bring them up, presumably  because they highlight my point\nabout how there are 3.4 million reasons the deal is shutting out new authors. It is more expensive, and\ntherefore less profitable, to edit, print, and distribute 523 different\nauthors than one. Even if we use the EFA’s very conservative guidelines and assume an unrealistically low production amount of $5,000 per book, those 523 authors would cost Tor at least $3 million more in production costs than producing John Scalzi’s 13 books will.\nFurthermore, there are a limited number of available slots in the retail channels, even for Tor. Barnes & Noble is not going to endcap 500 different Tor books; they probably don’t even carry that many in total. But again, this supports my larger point about how the increased centralization of traditional publishing tends to lock out new authors and midlist authors alike. That was why I stopped even talking to traditional publishers years ago; as a midlist author who sold 30k to 40k copies per book, I knew I was of little interest to them. These days, if you can’t at least threaten six digits in your two chances at publication, you will need to be a gatekeeper’s pet in order to stay in traditional print for long. The dirty little secret of traditional publishing is that its profits are no less dependent upon constant churn than the average stockbrokerage.\nAnd this points to the best part of what increasingly looks like a pretty good deal for Scalzi: he is locking in Tor’s marketing focus on his behalf, although again, at the expense of its other authors. And that, combined with what we have learned about Pan Macmillan’s unhappiness with its editorial product in the UK, leads me to suspect that PNH is feeling the heat from above and has therefore thrown a bit of a Hail Mary in order to buy himself more time.\nSince we’re on the subject of openly clueless statements about me at File 770, let’s address two of their creative takes on theology while we’re at it:\nCPaca on June 1, 2015 at 3:27 pm said:\nVD isn’t a Christian, despite claiming he is. The belief that Satan rules the world instead of God is some form of Christian Gnostic heresy. One has to wonder if Wright is fully aware of who he’s hanging out with.\nIf this were a science fiction novel, the dialogue would end here, with the Atheist Who Knows the Bible Better than the Bible-Thumping Bigot gloriously triumphing. Of course, this isn’t a science fiction novel, and in fact, their knowledge of Christianity literally doesn’t rise to the level of\nOut of the Silent Planet\n. Do they not even understand what “Silent Planet” means? Do they not truly not understand the entire purpose of the Word made flesh, much less the Crucifixion?\nThe belief that Satan rules the world is the very essence of Christianity!\nAgain, the devil took him to a very high mountain and showed him all the kingdoms of the world and their splendor. “All this I will give you,” he said, “if you will bow down and worship me.” Jesus said to him, “Away from me, Satan! For it is written: ‘Worship the Lord your God, and serve him only.’\n-Matthew 4:1-11\nBut very truly I tell you, it is for your good that I am going away. Unless I go away, the Advocate will not come to you; but if I go, I will send him to you.  When he comes, he will prove the world to be in the wrong about sin and righteousness and judgment:  about sin, because people do not believe in me;  about righteousness, because I am going to the Father, where you can see me no longer;  and about judgment, because the prince of this world now stands condemned.\n– John 16:7-11\nThe god of this age has blinded the minds of unbelievers, so that they cannot see the light of the gospel that displays the glory of Christ, who is the image of God.\n– 2nd Corinthians 4:4\nStevie on June 1, 2015 at 3:56 pm said:\nI think we agree that VD is not a Christian; I think that VD would happily abandon his not very good grasp of Gnosticism on the grounds of ‘rhetoric’, or ‘Aristotle’, or whatever flavour of evasion he happens to feel like at any given time. Given his obsessive hatred of John Scalzi I suspect that VD cheers himself up by imagining him as ‘left behind’.\nSadly, Wright’s track record as a professed Christian suggests that he doesn’t understand Christianity either; his appalling outburst about Terry Pratchett is wholly incompatible with Christ’s commandment that we should love each other. Wright appears to be under the impression that Christ really didn’t understand being God, and that Wright has much better ideas as to what God actually wants than the reprobate who spent his time with the poor, the sick, the hungry, and consorted with dreadful people like tax collectors…\nI can’t abandon what I don’t have. And as for the idea that John Wright’s rejection of the late Pratchett’s euthanasia activism is somehow incompatible with Christianity, that is simply false. Terry Pratchett was not only, as Neil Gaiman described him,\na very angry man\n, he was a very\nwicked and cowardly man\n.\nYou have loved righteousness and hated wickedness; therefore God, your God, has set you above your companions by anointing you with the oil of joy.\n– Hebrews 1:9\nBut it is true that as a man outside the Church, we should not judge him; God will do that. In any event, the extent and intensity of their hatred for me should suffice to testify as to whether I am a Christian or not.\nIf the world hates you, keep in mind that it hated me first. If you belonged to the world, it would love you as its own. As it is, you do not belong to the world, but I have chosen you out of the world. That is why the world hates you.\n–  John 15:17-19\nLet them hate. I never forget who they hate first and foremost.",
  "tags": [
    "Christianity",
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-02T07:34:00+00:00"
}