{
  "url": "https://voxday.net/2015/06/22/free-expression-and-cultural-war/",
  "scraped_at": "2025-12-16T13:00:27.103270",
  "title": "Free expression and cultural war",
  "date_display": "June 22, 2015",
  "date_iso": "2015-06-22T12:14:00+00:00",
  "date_from_url": "2015-06-22",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This seemed relevant in the present circumstances:</p><blockquote class=\"tr_bq\"><p> A lesson is learned most firmly when the application of what has been learned turns failure into success. The failure, in Clausewitz’s estimation, was the humiliating defeat suffered by Prussia in 1806. He attributes this failure to Prussia’s adherence to eighteenth-century methods of warfare against an opponent emancipated from the limitations of those methods. The success, as Clausewitz saw it, was the resurgence of Prussia as a military power and the victory over Napoleon in 1813-15. Clausewitz attributes this resurgence to the replacement of the small professional (eighteenth-century model) army by a mass (citizen) army; that is, by recourse to the weapon with which France dominated Europe for almost two decades. In other words, Prussia achieved full nationhood by accepting the principle of national war.<br> – <i>The Clausewitzian Century</i>, Anatol Rapoport</br></p></blockquote><p>In like manner, the SJWs have dominated the public discourse for almost two decades by assiduously targeting, attacking, and disqualifying those public figures they deem dangerous to their Narrative. In their foolish confusion of method with objective, conservatives, libertarians, and liberals have, like Prussia, insisted on adhering to outdated methods and gone from defeat to defeat as a result.</p><p>This is why the SJWs are so ferociously fighting against Irene Gallo’s well-deserved and overdue dismissal for cause by TOR Books. They know that the successful adoption and utilization of their own methods will lead to the freedom-loving right learning a very important lesson that will help bring about its resurgence at SJW expense.</p><p>We can beat them. We will beat them. The only way that we will fail is if we fail to emancipate ourselves from the limitations of outdated methods to which those who have been attacking us for over a decade do not subscribe.</p></div>",
  "content_text": "This seemed relevant in the present circumstances:\nA lesson is learned most firmly when the application of what has been learned turns failure into success. The failure, in Clausewitz’s estimation, was the humiliating defeat suffered by Prussia in 1806. He attributes this failure to Prussia’s adherence to eighteenth-century methods of warfare against an opponent emancipated from the limitations of those methods. The success, as Clausewitz saw it, was the resurgence of Prussia as a military power and the victory over Napoleon in 1813-15. Clausewitz attributes this resurgence to the replacement of the small professional (eighteenth-century model) army by a mass (citizen) army; that is, by recourse to the weapon with which France dominated Europe for almost two decades. In other words, Prussia achieved full nationhood by accepting the principle of national war.\n–\nThe Clausewitzian Century\n, Anatol Rapoport\nIn like manner, the SJWs have dominated the public discourse for almost two decades by assiduously targeting, attacking, and disqualifying those public figures they deem dangerous to their Narrative. In their foolish confusion of method with objective, conservatives, libertarians, and liberals have, like Prussia, insisted on adhering to outdated methods and gone from defeat to defeat as a result.\nThis is why the SJWs are so ferociously fighting against Irene Gallo’s well-deserved and overdue dismissal for cause by TOR Books. They know that the successful adoption and utilization of their own methods will lead to the freedom-loving right learning a very important lesson that will help bring about its resurgence at SJW expense.\nWe can beat them. We will beat them. The only way that we will fail is if we fail to emancipate ourselves from the limitations of outdated methods to which those who have been attacking us for over a decade do not subscribe.",
  "tags": [
    "Puppies",
    "SJW",
    "war"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-22T11:14:00+00:00"
}