{
  "url": "https://voxday.net/2015/06/03/hugo-recommendations-best-fan-writer/",
  "scraped_at": "2025-12-16T12:58:09.536831",
  "title": "Hugo Recommendations: Best Fan Writer",
  "date_display": "June 3, 2015",
  "date_iso": "2015-06-03T13:30:00+00:00",
  "date_from_url": "2015-06-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>This is how I am voting in the<br> Best Fan Writer category. Of course, I merely offer this information<br> regarding my individual ballot for no particular reason at all, and the<br> fact that I have done so should not be confused in any way, shape, or<br> form with a slate or a bloc vote, much less a direct order by the<br> Supreme Dark Lord of the Evil Legion of Evil to his 368 Vile Faceless<br> Minions or anyone else.</br></br></br></br></br></br></p><ol><li>Jeffro Johnson</li><li>Dave Freer</li><li>Amanda S. Green</li><li>Cedar Sanderson</li><li>Laura J. Mixon</li></ol><p>With regards to Mixon, I still don’t consider a professional writer with five novels published by Tor who also happens to be the current SFWA President’s wife to be anything remotely recognizable as a proper “Fan Writer”, but that ship sailed back when John Scalzi, Jim Hines, and Kameron Hurley waged their successful campaigns for it. No sense in fighting battles already lost.</p><p>The more relevant problem is that Best Related Work would be a more reasonable category for a single expose, and Deidre Saorse Moen’s expose of Marion Zimmer Bradley was a considerably more important work in that regard. That being said, I don’t regard the Hugo Awards as being the place to recognize investigative journalism, otherwise I would have nominated Saorse Moen’s stunning revelations about Marion Zimmer Bradley as a Best Related Work. But regardless, Mixon did publish a credible expose and she is a legitimate, if not necessarily compelling candidate.</p><p><a href=\"http://www.milobookclub.com/2015/05/23/hugo-awards-2015-best-nove/\">Best Novel</a><br> <a href=\"http://www.milobookclub.com/2015/05/27/hugo-awards-2015-best-novella/\">Best Novella </a></br></p><p>Now, what is interesting is that the very SJW who is leading the charge <a href=\"http://sasquan.org/business-meeting/agenda/\">to change the Hugo rules this year</a> has also declared that personal dislike and ideological opposition is sufficient cause to vote No Award.</p><blockquote class=\"tr_bq\"><p> <a href=\"http://chris-gerrib.livejournal.com/565632.html\">Best Fan Writer</a></p><p>Freer’s been an ass to me, and incoherent at length to pretty much everybody, so no rocket for him. Green and Sanderson seem to not like SJWs like me, so I’ll return the favor. I’m a bit reluctant to give Mixon the award for an expose. Johnson at least restricts himself to book reviews, so my ballot is Johnson and no award.</p></blockquote><p>Note the name on the B.1.1. proposals: “Proposed by: Chris Gerrib, Catherine Faber and Steven desJardins”.  This quite clearly demonstrates that the impetus to change the rules is, as we expected, being driven by SJW ideology and feelbads about the wrong people being nominated. So it is more than a little ironic that Chris Gerrib and I will nevertheless be voting for the same individual in the Best Fan Writer category, as Johnson’s work is excellent, well-researched, and resolutely apolitical.</p><p>But Gerrib shows the fundamental difference between the SJW and the Puppy. I put Marko Kloos on the Rabid Puppy slate in the full knowledge that he hates me. I have repeatedly nominated Charles Stross for the Nebula Award in the past; you can look up the old NAR records and see that I was, in fact, one of the only members of SFWA championing his work back then. I openly declare China Mieville to be one of the three best living SF writers despite the fact that his politics and his economics border on the brain-damaged. I wouldn’t hesitate to nominate Johnny Con himself if he ever wrote a novel that was legitimately worthy of a nomination.</p><p>The SJWs don’t do that. They are ruled by their feelings, and the mere semblance of ideological distaste for them is sufficient to render a writer’s work without merit and unworthy of any award.</p><p>And that, my dear SJWs, is one of the two reasons why we don’t believe you when you preen and posture and proclaim the works of the right to be unworthy. Because every time the mask slips, we see that the real reason behind the various rationales being given is the writer’s disapproval of your noxious ideology.</p><p>The other reason, of course, is that we have working memories. We are able to compare what we believe to be meritorious to what you have previously prized. You expect us to believe that “Turncoat” is a bad short story while “If You Gave a Dinosaur a Cookie, My Love” is among the very best the genre has to offer. You expect us to accept that the insightful essays of <i>Transhuman and Subhuman</i> and the impeccable science of “The Hot Equations” are totally unworthy of an award that has gone to a ridiculous and factually incorrect blog post, Chicks Dig Time Lords, and a collection of online blog snark in recent years.</p><p>In short, we do not believe a word you say about literary quality. After all, you say a man is actually a woman, you say evil is actually good, so it is hardly surprising that you also tell us good SF is actually terrible while declaring dreadful Pink SF to be superlative.</p><p>SJWs always lie.</p></div>",
  "content_text": "This is how I am voting in the\nBest Fan Writer category. Of course, I merely offer this information\nregarding my individual ballot for no particular reason at all, and the\nfact that I have done so should not be confused in any way, shape, or\nform with a slate or a bloc vote, much less a direct order by the\nSupreme Dark Lord of the Evil Legion of Evil to his 368 Vile Faceless\nMinions or anyone else.\nJeffro Johnson\nDave Freer\nAmanda S. Green\nCedar Sanderson\nLaura J. Mixon\nWith regards to Mixon, I still don’t consider a professional writer with five novels published by Tor who also happens to be the current SFWA President’s wife to be anything remotely recognizable as a proper “Fan Writer”, but that ship sailed back when John Scalzi, Jim Hines, and Kameron Hurley waged their successful campaigns for it. No sense in fighting battles already lost.\nThe more relevant problem is that Best Related Work would be a more reasonable category for a single expose, and Deidre Saorse Moen’s expose of Marion Zimmer Bradley was a considerably more important work in that regard. That being said, I don’t regard the Hugo Awards as being the place to recognize investigative journalism, otherwise I would have nominated Saorse Moen’s stunning revelations about Marion Zimmer Bradley as a Best Related Work. But regardless, Mixon did publish a credible expose and she is a legitimate, if not necessarily compelling candidate.\nBest Novel\nBest Novella\nNow, what is interesting is that the very SJW who is leading the charge\nto change the Hugo rules this year\nhas also declared that personal dislike and ideological opposition is sufficient cause to vote No Award.\nBest Fan Writer\nFreer’s been an ass to me, and incoherent at length to pretty much everybody, so no rocket for him. Green and Sanderson seem to not like SJWs like me, so I’ll return the favor. I’m a bit reluctant to give Mixon the award for an expose. Johnson at least restricts himself to book reviews, so my ballot is Johnson and no award.\nNote the name on the B.1.1. proposals: “Proposed by: Chris Gerrib, Catherine Faber and Steven desJardins”.  This quite clearly demonstrates that the impetus to change the rules is, as we expected, being driven by SJW ideology and feelbads about the wrong people being nominated. So it is more than a little ironic that Chris Gerrib and I will nevertheless be voting for the same individual in the Best Fan Writer category, as Johnson’s work is excellent, well-researched, and resolutely apolitical.\nBut Gerrib shows the fundamental difference between the SJW and the Puppy. I put Marko Kloos on the Rabid Puppy slate in the full knowledge that he hates me. I have repeatedly nominated Charles Stross for the Nebula Award in the past; you can look up the old NAR records and see that I was, in fact, one of the only members of SFWA championing his work back then. I openly declare China Mieville to be one of the three best living SF writers despite the fact that his politics and his economics border on the brain-damaged. I wouldn’t hesitate to nominate Johnny Con himself if he ever wrote a novel that was legitimately worthy of a nomination.\nThe SJWs don’t do that. They are ruled by their feelings, and the mere semblance of ideological distaste for them is sufficient to render a writer’s work without merit and unworthy of any award.\nAnd that, my dear SJWs, is one of the two reasons why we don’t believe you when you preen and posture and proclaim the works of the right to be unworthy. Because every time the mask slips, we see that the real reason behind the various rationales being given is the writer’s disapproval of your noxious ideology.\nThe other reason, of course, is that we have working memories. We are able to compare what we believe to be meritorious to what you have previously prized. You expect us to believe that “Turncoat” is a bad short story while “If You Gave a Dinosaur a Cookie, My Love” is among the very best the genre has to offer. You expect us to accept that the insightful essays of\nTranshuman and Subhuman\nand the impeccable science of “The Hot Equations” are totally unworthy of an award that has gone to a ridiculous and factually incorrect blog post, Chicks Dig Time Lords, and a collection of online blog snark in recent years.\nIn short, we do not believe a word you say about literary quality. After all, you say a man is actually a woman, you say evil is actually good, so it is hardly surprising that you also tell us good SF is actually terrible while declaring dreadful Pink SF to be superlative.\nSJWs always lie.",
  "tags": [
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-03T12:30:00+00:00"
}