{
  "url": "https://voxday.net/2015/06/03/in-sf-world-rages-war/",
  "scraped_at": "2025-12-16T12:58:12.481329",
  "title": "In the SF world rages a war",
  "date_display": "June 3, 2015",
  "date_iso": "2015-06-03T23:26:00+00:00",
  "date_from_url": "2015-06-03",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>A translation of <a href=\"http://nyt.fi/a1305959954351\">the article on Castalia House</a> in Finland’s largest newspaper. </i></p><p>IN THE SCI-FI WORLD OF USA RAGES A WAR, IN WHICH EVEN THE GAME OF THRONES AUTHOR IS ENTANGLED WITH – AND IN THE EPICENTER OF IT ALL IS THIS KOUVOLA MAN</p><p>Sci-fi literature enthusiasts in USA are in civil war. A conservative mutiny is trying to push out of bestseller lists and awards the mainstream, “tolerant” sci-fi. The battle is already being called culture wars – and one of the headquarters is located in Finland.</p><p>There is a man in Kouvola, and before the man, a computer.</p><p>Together, the man and the computer are in the front lines of a battle that is shaking the entire world of sci-fi literature.</p><p>The man and the computer were revealed to the world, spring this year.</p><p>At the time was published “the Oscars of sci-fi books” – Hugo-awards – nominees.</p><p>The entire sci-fi world roared: lists were full of works by religious extremists and ultraconservatives.</p><p>The surprise was so big that even The New York Times and Washington Post wrote about it.</p><p>And behind the entire surprise were a man and a computer in Kouvola.</p><p>The name of the man is Markku Koponen, and on the computer runs a company called Castalia House.</p><p>Koponen publishes conservative science fiction to everywhere in the world, mainly as e-books to the web store Amazon.</p><p>Who on earth is this man?`</p><p>“I suppose you could even call me ultraconservative”, Koponen says on the phone.</p><p>At least judging by his authors, the characterization rings true. On Koponen’s list are, among others, the authors at the center of the Hugo-brouhaha, John C. Wright and pen name Vox Day, who is Theodore Beale.</p><p>Both men are known for their extreme opinions: Wright’s comments have been characterized as anti-gay, and Beale’s racist and misogynist.</p><p>Koponen tells he has founded Castalia House due to having been fed up with contemporary science fiction.</p><p>He thought it too left wing, too tolerant and full of the preaching of such things – “message fiction”.</p><p>Koponen has never been much involved with Finland’s sci-fi scene. He has been in contact with them to the degree of breaking fellowship.</p><p>According to Koponen his name and address were mentioned in a sci-fi enthusiast mailing list – at which point he wrote to the members a response saying he indeed is in an opposite corner with them, and will walk his own path with his publishing house, apart from them.</p><p>So, in Finland Koponen is alone, but in the world out there he is part of an entire army.</p><p><a name=\"more\"></a></p><p>In the sci-fi and fantasy circles – fandom – in USA there is a controversy which is already being called a culture war.</p><p>Outside the mainstream of sci-fi there is a conservative cabal resisting the majority of fandom, which has assumed the name Sad Puppies. In spirit, Koponen is part of this group.</p><p>According to Sad Puppies, over-tolerating forces keep the entire fandom in their grip so tightly, that authors and fans who support conservative values are shut out of the circles.</p><p>This irritates Sad Puppies, who consider proper sci-fi and fantasy to be in the same vein as in, for example, the forties and fifties.</p><p>Such “proper sci-fi” is one where heroes are manly, white hetero men, women are victims to be rescued and enemies are disgusting aliens.</p><p>Black and white settings are not confused with deep moral considerations, and most assuredly not with leftist or feminist thoughts.</p><p>Koponen thinks fandom and mainstream sci-fi publishing is riddled, both in Finland and elsewhere in the world, a “tolerant consensus”. This leads to censorship of “proper sci-fi” and the dominance of preachy message fiction.</p><p>“They are quite like-minded folks. And it’s no conspiracy really, likeminded people simply easily flock together”, Koponen says.</p><p>“A common climate of opinion emerges naturally: just the way it happens on our side too.”</p><p>Examples of this “real sci-fi” that Koponen admires, were written in past decades for example by such authors as John W. Campbell and Robert A. Heinlein.</p><p>Many of their works are considered sci-fi classics these days, but also products of their era. For example, Campbell’s views are, according to modern standards, thoroughly racist and conservative.<br> Nowadays “traditional” sci-fi or fantasy is represented by such people as the American author Larry Correia and Brad R. Torgersen. Correia rose even to the New York Times best seller list with his Monster Hunter -series, but in his own opinion he has been discriminated against among fandom for his views.</br></p><p>Behind the entire rebellion, in a sense, is actually Correia.</p><p>You see, two years ago he started an internet campaign for his own Hugo-nomination.</p><p>In it, he blamed the usual Hugo-voters as arrogant elitists, who only value left-wing messagefiction and turn their noses at Correia’s Pulp-style entertainment books.</p><p>He amped up his appeal ironically with a picture of a sad dog puppy, from which the Sad Puppies name was born. Then along came Torgersen, the campaign got bigger, and the duo started putting together their slates on not just their own books, but others – all of them naturally works that they’d consider discriminated against by fandom elite.</p><p>Eventually Vox Day aka. Theodore Beale came to stir the soup.</p><p>Beale was an influential figure in the techno band Psykosonik, and video game company Fenris Wolf. At the beginning of 2000’s Beale started his writing career with his strongly religious War in Heaven -fantasy book and has since released dozens of works.</p><p>Beale has written, among other things, how women’s suffrage should be ended and called an African-American woman who criticized him a “half-savage”.</p><p>The radical Sad Puppies movement got even more radical Rabid Puppies -slate.</p><p>And then, in the Hugo-vote of this spring, the conservative sci-fi -people’s project brought returns. In nearly every category there was Sad- and Rabid Puppies’ favorites, and a central publisher among them was Koponen’s Castalia House.</p><p>There was an uproar.</p><p>Several Hugo-nominated authors gave up their nomination and well-known sci-fi and fantasy authors expressed their disappointment towards what happened. Among the latter were, for example, the Game of Thrones author George R. R. Martin, who opined that the rightist sci-fi -wing has destroyed the entire award. In his blog Martin ended up in a long debate with Larry Correia.</p><p>Many sci-fi fans expressed their protest by intending to vote, instead of the official nominees, “Noah Ward”. This is not a person, but a pun on “no award”.</p><p>Most of all, the roar happened in Finland: What on earth was the Finnish publishing house amidst it all, of which nearly no-one knew anything?</p><p>Until last year, Markku Koponen was quite the ordinary engineer.</p><p>He graduated from Tampere University of Technology and programmed code for industrial use. Koponen was writing actively on politics in the internet: he calls himself a social conservative. He also read lots of sci-fi.</p><p>Koponen became acquainted with Theodore Beale in the Internet, some years ago, when the ideologies of the two men “clicked”. As a result came mutual projects, latest of them being Castalia House.</p><p>In the partnership, Beale is the foaming-at-the-mouth spokesman, and Koponen handles the business in the background, and constructs technical architechtures. Koponen might be described as the weaponsmith of Sad Puppies, of a sort.</p><p>He says he is in agreement with Beale on the “general lines”, although there are some doctrinal disagreements on the matters of faith.</p><p>Koponen describes himself as a fundamentalist Christian, in the sense of agreeing with the document The Five Fundamentals, published by the American Presbyterian Church in 1910 about the mandatory, non-negotiable content of the Christian faith.</p><p>In any event, Koponen is in line with the Sad Puppies movement.</p><p>Foundational to Castalia House according to Koponen is to give a guarantee to the authors that their religious or political views will not be censored.</p><p>For example, John C. Wright, whom Koponen describes as a devoted Catholic, will be allowed to include his ideology in his books as much as he damn well pleases, and Castalia House will publish.</p><p>“With this promise it has been really easy to get authors onboard. Many are fed up with their books being censored for ideological content with quite the heavy hand.”</p><p>However, Koponen has not been involved in the Sad Puppies -campaigning, social media arguments nor otherwise – except by publishing books that the activists will enjoy.</p><p>He says that he would not have founded Castalia House either, had he not very early on realized the commercial potential in the conservative sci-fi, so loved by Sad Puppies.</p><p>This has also proven true: Koponen says he has only invested his own money the necessary 2 500 EUR required to start a Limited Liability Company, and now the firm produces a gross profit of about 30 000 EUR already.</p><p>Castalia House mostly sells e-books. According to Koponen, in good months a few thousand books get sold. Physical books get sold only some hundreds of units a month.</p><p>Castalia Housen books have been translated to other languages than English, among them Finnish, but Koponen says 99 percent of the market is currently in the United States.</p><p>To Finland, the Sad Puppies -movement and culture war – Koponen agrees with this word – has not spread yet in a large degree.</p><p>But it will in a few years, he believes.</p><p>“At least, if Worldcon is held in Finland in 2017, I expect some sort of a clash here too”</p><p>Indeed, the mainstream sci-fi circles in Finland are active, and are attempting to get the largest event of the sci-fi world to Finland: Worldcon. The annual, controversial Hugo-awards are handed out in it.</p><p>Finnish fandom has raised its flag for equality. Also in the “Worldcon to Helsinki” -project, this flag for open-mindedness is very visible – and it’s a flag against Sad Puppies’ values.</p><p>The chairman of the science fiction society in Helsinki who has been active in Finnish fandom for decades, is the reporter and author Vesa Sisättö. He doesn’t believe that the upheaval comes here.</p><p>Sisättö opines that in the American fandom, the debate that happened in Finland already in 1980’s is happening now.</p><p>“At the time there was a minor brawl in the fan circles when Johanna Sinisalo came and spoke on behalf of the status of women in Sci-fi. The contrarians came silent pretty fast, and in the nineties it was not an issue any longer.”</p><p>Sisättö considers Sad Puppies a backlash to the fact that old, traditional values no longer hold – quite the same phenomenon as with the Finns Party in Finnish politics, Sisättö mulls.</p><p>“What was mainstream in the past, is now minority. Culture changes, and when it happens, certain fellows wake up to it and start raising a ruckus.”</p><p>He doesn’t believe the movement is viable in the long run.</p><p>“The most active Sad Puppy -buzzers run out of steam, the followers get tired too, and eventually we reach a “is this worth the fight any more?” -phase.</p><p>Nor does the conservative Koponen wish to eradicate the mainstream sci-fi, but rather wants to raise his own genre to parity with it.</p><p>“At that point, we can live in as much peace as is possible.”</p><p>Also worthy of note is that in the spring, another Finnish Hugo-news turned up: First time ever, a Finnish candidate is on the shortlist: The illustrator Ninni Aalto, who competes in the best fan artist -category.</p><p>That category has no Sad Puppy nominees.</p></div>",
  "content_text": "A translation of\nthe article on Castalia House\nin Finland’s largest newspaper.\nIN THE SCI-FI WORLD OF USA RAGES A WAR, IN WHICH EVEN THE GAME OF THRONES AUTHOR IS ENTANGLED WITH – AND IN THE EPICENTER OF IT ALL IS THIS KOUVOLA MAN\nSci-fi literature enthusiasts in USA are in civil war. A conservative mutiny is trying to push out of bestseller lists and awards the mainstream, “tolerant” sci-fi. The battle is already being called culture wars – and one of the headquarters is located in Finland.\nThere is a man in Kouvola, and before the man, a computer.\nTogether, the man and the computer are in the front lines of a battle that is shaking the entire world of sci-fi literature.\nThe man and the computer were revealed to the world, spring this year.\nAt the time was published “the Oscars of sci-fi books” – Hugo-awards – nominees.\nThe entire sci-fi world roared: lists were full of works by religious extremists and ultraconservatives.\nThe surprise was so big that even The New York Times and Washington Post wrote about it.\nAnd behind the entire surprise were a man and a computer in Kouvola.\nThe name of the man is Markku Koponen, and on the computer runs a company called Castalia House.\nKoponen publishes conservative science fiction to everywhere in the world, mainly as e-books to the web store Amazon.\nWho on earth is this man?`\n“I suppose you could even call me ultraconservative”, Koponen says on the phone.\nAt least judging by his authors, the characterization rings true. On Koponen’s list are, among others, the authors at the center of the Hugo-brouhaha, John C. Wright and pen name Vox Day, who is Theodore Beale.\nBoth men are known for their extreme opinions: Wright’s comments have been characterized as anti-gay, and Beale’s racist and misogynist.\nKoponen tells he has founded Castalia House due to having been fed up with contemporary science fiction.\nHe thought it too left wing, too tolerant and full of the preaching of such things – “message fiction”.\nKoponen has never been much involved with Finland’s sci-fi scene. He has been in contact with them to the degree of breaking fellowship.\nAccording to Koponen his name and address were mentioned in a sci-fi enthusiast mailing list – at which point he wrote to the members a response saying he indeed is in an opposite corner with them, and will walk his own path with his publishing house, apart from them.\nSo, in Finland Koponen is alone, but in the world out there he is part of an entire army.\nIn the sci-fi and fantasy circles – fandom – in USA there is a controversy which is already being called a culture war.\nOutside the mainstream of sci-fi there is a conservative cabal resisting the majority of fandom, which has assumed the name Sad Puppies. In spirit, Koponen is part of this group.\nAccording to Sad Puppies, over-tolerating forces keep the entire fandom in their grip so tightly, that authors and fans who support conservative values are shut out of the circles.\nThis irritates Sad Puppies, who consider proper sci-fi and fantasy to be in the same vein as in, for example, the forties and fifties.\nSuch “proper sci-fi” is one where heroes are manly, white hetero men, women are victims to be rescued and enemies are disgusting aliens.\nBlack and white settings are not confused with deep moral considerations, and most assuredly not with leftist or feminist thoughts.\nKoponen thinks fandom and mainstream sci-fi publishing is riddled, both in Finland and elsewhere in the world, a “tolerant consensus”. This leads to censorship of “proper sci-fi” and the dominance of preachy message fiction.\n“They are quite like-minded folks. And it’s no conspiracy really, likeminded people simply easily flock together”, Koponen says.\n“A common climate of opinion emerges naturally: just the way it happens on our side too.”\nExamples of this “real sci-fi” that Koponen admires, were written in past decades for example by such authors as John W. Campbell and Robert A. Heinlein.\nMany of their works are considered sci-fi classics these days, but also products of their era. For example, Campbell’s views are, according to modern standards, thoroughly racist and conservative.\nNowadays “traditional” sci-fi or fantasy is represented by such people as the American author Larry Correia and Brad R. Torgersen. Correia rose even to the New York Times best seller list with his Monster Hunter -series, but in his own opinion he has been discriminated against among fandom for his views.\nBehind the entire rebellion, in a sense, is actually Correia.\nYou see, two years ago he started an internet campaign for his own Hugo-nomination.\nIn it, he blamed the usual Hugo-voters as arrogant elitists, who only value left-wing messagefiction and turn their noses at Correia’s Pulp-style entertainment books.\nHe amped up his appeal ironically with a picture of a sad dog puppy, from which the Sad Puppies name was born. Then along came Torgersen, the campaign got bigger, and the duo started putting together their slates on not just their own books, but others – all of them naturally works that they’d consider discriminated against by fandom elite.\nEventually Vox Day aka. Theodore Beale came to stir the soup.\nBeale was an influential figure in the techno band Psykosonik, and video game company Fenris Wolf. At the beginning of 2000’s Beale started his writing career with his strongly religious War in Heaven -fantasy book and has since released dozens of works.\nBeale has written, among other things, how women’s suffrage should be ended and called an African-American woman who criticized him a “half-savage”.\nThe radical Sad Puppies movement got even more radical Rabid Puppies -slate.\nAnd then, in the Hugo-vote of this spring, the conservative sci-fi -people’s project brought returns. In nearly every category there was Sad- and Rabid Puppies’ favorites, and a central publisher among them was Koponen’s Castalia House.\nThere was an uproar.\nSeveral Hugo-nominated authors gave up their nomination and well-known sci-fi and fantasy authors expressed their disappointment towards what happened. Among the latter were, for example, the Game of Thrones author George R. R. Martin, who opined that the rightist sci-fi -wing has destroyed the entire award. In his blog Martin ended up in a long debate with Larry Correia.\nMany sci-fi fans expressed their protest by intending to vote, instead of the official nominees, “Noah Ward”. This is not a person, but a pun on “no award”.\nMost of all, the roar happened in Finland: What on earth was the Finnish publishing house amidst it all, of which nearly no-one knew anything?\nUntil last year, Markku Koponen was quite the ordinary engineer.\nHe graduated from Tampere University of Technology and programmed code for industrial use. Koponen was writing actively on politics in the internet: he calls himself a social conservative. He also read lots of sci-fi.\nKoponen became acquainted with Theodore Beale in the Internet, some years ago, when the ideologies of the two men “clicked”. As a result came mutual projects, latest of them being Castalia House.\nIn the partnership, Beale is the foaming-at-the-mouth spokesman, and Koponen handles the business in the background, and constructs technical architechtures. Koponen might be described as the weaponsmith of Sad Puppies, of a sort.\nHe says he is in agreement with Beale on the “general lines”, although there are some doctrinal disagreements on the matters of faith.\nKoponen describes himself as a fundamentalist Christian, in the sense of agreeing with the document The Five Fundamentals, published by the American Presbyterian Church in 1910 about the mandatory, non-negotiable content of the Christian faith.\nIn any event, Koponen is in line with the Sad Puppies movement.\nFoundational to Castalia House according to Koponen is to give a guarantee to the authors that their religious or political views will not be censored.\nFor example, John C. Wright, whom Koponen describes as a devoted Catholic, will be allowed to include his ideology in his books as much as he damn well pleases, and Castalia House will publish.\n“With this promise it has been really easy to get authors onboard. Many are fed up with their books being censored for ideological content with quite the heavy hand.”\nHowever, Koponen has not been involved in the Sad Puppies -campaigning, social media arguments nor otherwise – except by publishing books that the activists will enjoy.\nHe says that he would not have founded Castalia House either, had he not very early on realized the commercial potential in the conservative sci-fi, so loved by Sad Puppies.\nThis has also proven true: Koponen says he has only invested his own money the necessary 2 500 EUR required to start a Limited Liability Company, and now the firm produces a gross profit of about 30 000 EUR already.\nCastalia House mostly sells e-books. According to Koponen, in good months a few thousand books get sold. Physical books get sold only some hundreds of units a month.\nCastalia Housen books have been translated to other languages than English, among them Finnish, but Koponen says 99 percent of the market is currently in the United States.\nTo Finland, the Sad Puppies -movement and culture war – Koponen agrees with this word – has not spread yet in a large degree.\nBut it will in a few years, he believes.\n“At least, if Worldcon is held in Finland in 2017, I expect some sort of a clash here too”\nIndeed, the mainstream sci-fi circles in Finland are active, and are attempting to get the largest event of the sci-fi world to Finland: Worldcon. The annual, controversial Hugo-awards are handed out in it.\nFinnish fandom has raised its flag for equality. Also in the “Worldcon to Helsinki” -project, this flag for open-mindedness is very visible – and it’s a flag against Sad Puppies’ values.\nThe chairman of the science fiction society in Helsinki who has been active in Finnish fandom for decades, is the reporter and author Vesa Sisättö. He doesn’t believe that the upheaval comes here.\nSisättö opines that in the American fandom, the debate that happened in Finland already in 1980’s is happening now.\n“At the time there was a minor brawl in the fan circles when Johanna Sinisalo came and spoke on behalf of the status of women in Sci-fi. The contrarians came silent pretty fast, and in the nineties it was not an issue any longer.”\nSisättö considers Sad Puppies a backlash to the fact that old, traditional values no longer hold – quite the same phenomenon as with the Finns Party in Finnish politics, Sisättö mulls.\n“What was mainstream in the past, is now minority. Culture changes, and when it happens, certain fellows wake up to it and start raising a ruckus.”\nHe doesn’t believe the movement is viable in the long run.\n“The most active Sad Puppy -buzzers run out of steam, the followers get tired too, and eventually we reach a “is this worth the fight any more?” -phase.\nNor does the conservative Koponen wish to eradicate the mainstream sci-fi, but rather wants to raise his own genre to parity with it.\n“At that point, we can live in as much peace as is possible.”\nAlso worthy of note is that in the spring, another Finnish Hugo-news turned up: First time ever, a Finnish candidate is on the shortlist: The illustrator Ninni Aalto, who competes in the best fan artist -category.\nThat category has no Sad Puppy nominees.",
  "tags": [
    "Castalia House",
    "Hugo Award",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-03T22:26:00+00:00"
}