{
  "url": "https://voxday.net/2015/06/29/irony/",
  "scraped_at": "2025-12-16T13:01:27.006175",
  "title": "Irony",
  "date_display": "June 29, 2015",
  "date_iso": "2015-06-29T18:00:00+00:00",
  "date_from_url": "2015-06-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ginger on <a href=\"http://file770.com/?p=23428&amp;cpage=5#comment-298275\">June 29, 2015 at 8:54 am</a> said:<br/></p><blockquote><p> With respect to controversy, need I<br> mention that people are still arguing over the Original Controversy? The<br> novella that is still published as “Genesis”, in which the main<br> characters are created from “earth” — clearly science fiction, come on —<br> and so on; the schisms created by the warring camps has only grown<br> greater with the centuries since its publication. In contrast, Gilgamesh<br> was completely overlooked, probably because it was mis-labeled a saga<br> and not best novel; there may also have been some anti-Ur sentiment<br> floating around. And what has ever been nominated out of the Aztec, or<br> Pueblo/Hopi/Zuni, or indeed, any of the native North American<br> traditions? They’ve clearly been completely blocked off by a shadowy<br> cabal.</br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>That made me laugh out loud. What has ever been nominated out of the Aztec, or<br> Pueblo/Hopi/Zuni, or indeed, any of the native North American<br> traditions?</br></br></p><p>The eminent Hugo Awards historian Mike Glyer <a href=\"http://file770.com/?p=23428&amp;cpage=6#comment-298331\">knows</a>: <i>“I have it on the highest authority that the answer is Vox Day.” </i></p><p>And speaking of shadowy cabals, I owe my record-setting two Editor nominations to the whining machinations <a href=\"http://nielsenhayden.com/makinglight/archives/007354.html#007354\">of one Patrick Nielsen Hayden</a>. After he was publicly crying about how he “acquired” not one, but THREE of 2006’s best novel nominees and still didn’t win Best Professional Editor, the Worldcon voters magically created a new award he could win.</p><blockquote class=\"tr_bq\"><p> In a post to his own weblog, Scalzi expresses regret that I personally didn’t make the “Best Professional Editor” ballot, despite the fact that I acquired three out of the five Best Novel nominees and personally shepherded two of them to publication. This is generous of John, and I wouldn’t have declined the nomination, but in fact as every book editor in our field knows, while the Best Professional Hugo is regularly awarded to high-profile magazine editors and anthologists, it only goes to book editors if we die. It’s for this reason that there’s a pending proposal to split the editorial award into “long form” and “short form” categories; whether this will be ratified by this year’s Worldcon Business Meeting is anyone’s guess. Personally, I note that David Hartwell has been a finalist for Best Professional Editor 15 times, leaving aside his 17 further nominations for the New York Review of Science Fiction, and that he’s never won a Hugo of any kind. Pretty shabby treatment for an individual who is by any measure one of the best and most influential editors in the eighty-year history of our field. Whether or not the World SF Convention decides to reform the editor award, it’s years past time one went to Hartwell. </p></blockquote><p>And the “reform” came to pass, the Best Tor Editor award was duly created, and the awards went to: Patrick Nielsen Hayden, David Hartwell, David Hartwell, and Patrick Nielsen Hayden for the first four years before the two of them took themselves out of the running long enough to let four-time second-place finisher Lou Anders win. But two wins in four years wasn’t enough for PNH, as he threw his hat back in the ring to collect a third one in 2013.</p><p>Clearly it’s just CRAZY to observe the existence of a Tor cabal. It’s entirely obvious that they won the Locus Award for Best Publisher for the last 27 straight years through nothing but hard work and consistently publishing bad-to-reprehensible books.</p></div>",
  "content_text": "Ginger on\nJune 29, 2015 at 8:54 am\nsaid:\nWith respect to controversy, need I\nmention that people are still arguing over the Original Controversy? The\nnovella that is still published as “Genesis”, in which the main\ncharacters are created from “earth” — clearly science fiction, come on —\nand so on; the schisms created by the warring camps has only grown\ngreater with the centuries since its publication. In contrast, Gilgamesh\nwas completely overlooked, probably because it was mis-labeled a saga\nand not best novel; there may also have been some anti-Ur sentiment\nfloating around. And what has ever been nominated out of the Aztec, or\nPueblo/Hopi/Zuni, or indeed, any of the native North American\ntraditions? They’ve clearly been completely blocked off by a shadowy\ncabal.\nThat made me laugh out loud. What has ever been nominated out of the Aztec, or\nPueblo/Hopi/Zuni, or indeed, any of the native North American\ntraditions?\nThe eminent Hugo Awards historian Mike Glyer\nknows\n:\n“I have it on the highest authority that the answer is Vox Day.”\nAnd speaking of shadowy cabals, I owe my record-setting two Editor nominations to the whining machinations\nof one Patrick Nielsen Hayden\n. After he was publicly crying about how he “acquired” not one, but THREE of 2006’s best novel nominees and still didn’t win Best Professional Editor, the Worldcon voters magically created a new award he could win.\nIn a post to his own weblog, Scalzi expresses regret that I personally didn’t make the “Best Professional Editor” ballot, despite the fact that I acquired three out of the five Best Novel nominees and personally shepherded two of them to publication. This is generous of John, and I wouldn’t have declined the nomination, but in fact as every book editor in our field knows, while the Best Professional Hugo is regularly awarded to high-profile magazine editors and anthologists, it only goes to book editors if we die. It’s for this reason that there’s a pending proposal to split the editorial award into “long form” and “short form” categories; whether this will be ratified by this year’s Worldcon Business Meeting is anyone’s guess. Personally, I note that David Hartwell has been a finalist for Best Professional Editor 15 times, leaving aside his 17 further nominations for the New York Review of Science Fiction, and that he’s never won a Hugo of any kind. Pretty shabby treatment for an individual who is by any measure one of the best and most influential editors in the eighty-year history of our field. Whether or not the World SF Convention decides to reform the editor award, it’s years past time one went to Hartwell.\nAnd the “reform” came to pass, the Best Tor Editor award was duly created, and the awards went to: Patrick Nielsen Hayden, David Hartwell, David Hartwell, and Patrick Nielsen Hayden for the first four years before the two of them took themselves out of the running long enough to let four-time second-place finisher Lou Anders win. But two wins in four years wasn’t enough for PNH, as he threw his hat back in the ring to collect a third one in 2013.\nClearly it’s just CRAZY to observe the existence of a Tor cabal. It’s entirely obvious that they won the Locus Award for Best Publisher for the last 27 straight years through nothing but hard work and consistently publishing bad-to-reprehensible books.",
  "tags": [
    "Hugo Award"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-29T17:00:00+00:00"
}