{
  "url": "https://voxday.net/2015/06/17/jeb/",
  "scraped_at": "2025-12-16T12:59:52.973106",
  "title": "¡Jeb!",
  "date_display": "June 17, 2015",
  "date_iso": "2015-06-17T12:30:00+00:00",
  "date_from_url": "2015-06-17",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><i>No, gracias.</i> I think we’ve had two too many Bushes <a href=\"http://edition.cnn.com/2015/06/15/politics/jeb-bush-2016-presidential-announcement/\">as president already</a>:</p><blockquote class=\"tr_bq\"><p> Jeb Bush, a scion of the most recognizable family in Republican politics who fashioned an image as a sober-minded conservative truth-teller while governor of Florida, is running for president.</p><p>Bush made his formal announcement Monday afternoon here in his adopted hometown during an appearance at Miami Dade College. His candidacy comes after a week-long European tour and months of intensive behind-the-scenes political maneuvering that erased long-standing doubts about his White House ambitions.</p><p>Arguing that the country is on “a very bad course,” Bush told supporters in Miami that the nation had a decision to make.</p><p>“The question for me is what am I going to do about it,” he said Monday afternoon. “And I’ve decided: I’m a candidate for president of the United States of America.”</p></blockquote><p><i> ¡Mierda!</i> Jeb Bush is not a candidate for president of the United States of America, he is running for the presidency of the United Nations of America and Mexico. I would vote for Michelle Obama, Donald Trump, Kim Kardashian, or the corpse of Josef Stalin before I would vote for a pan-NorteAmericanist like Jeb Bush.</p><p>And I’m the great-grandson of a Mexican revolutionary.</p></div>",
  "content_text": "No, gracias.\nI think we’ve had two too many Bushes\nas president already\n:\nJeb Bush, a scion of the most recognizable family in Republican politics who fashioned an image as a sober-minded conservative truth-teller while governor of Florida, is running for president.\nBush made his formal announcement Monday afternoon here in his adopted hometown during an appearance at Miami Dade College. His candidacy comes after a week-long European tour and months of intensive behind-the-scenes political maneuvering that erased long-standing doubts about his White House ambitions.\nArguing that the country is on “a very bad course,” Bush told supporters in Miami that the nation had a decision to make.\n“The question for me is what am I going to do about it,” he said Monday afternoon. “And I’ve decided: I’m a candidate for president of the United States of America.”\n¡Mierda!\nJeb Bush is not a candidate for president of the United States of America, he is running for the presidency of the United Nations of America and Mexico. I would vote for Michelle Obama, Donald Trump, Kim Kardashian, or the corpse of Josef Stalin before I would vote for a pan-NorteAmericanist like Jeb Bush.\nAnd I’m the great-grandson of a Mexican revolutionary.",
  "tags": [
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-17T11:30:00+00:00"
}