{
  "url": "https://voxday.net/2015/06/23/let-reason-be-silen/",
  "scraped_at": "2025-12-16T13:00:33.746868",
  "title": "Let reason be silent",
  "date_display": "June 23, 2015",
  "date_iso": "2015-06-23T08:54:00+00:00",
  "date_from_url": "2015-06-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>When experience gainsays its conclusions. Ed Trimnell <a href=\"http://onewordtrimnell.blogspot.com/2015/06/debating-tor-boycott.html\">argues against fighting fire with fire</a>:</p><blockquote class=\"tr_bq\"><p> I expressed my disagreement with Vox’s position on the Tor Books boycott…and Vox expressed his disagreement with my disagreement.</p><p>My dislike of boycotts remains.</p><p>I remember the mindless campaign orchestrated against Orson Scott Card a few years ago. Card’s sin was basically to express a view of marriage that was all but universal (including among liberals and Democrats) until ten years ago. Yet the SJW mobs did their best to silence Card, urging a nationwide boycott of the movie adaptation of Ender’s Game, and barraging the offices of DC Comics until Card was dropped from the company’s Superman project.</p><p>Ah, but that is exactly the point….say the forces behind the anti-Tor boycott. The SJWs do it.</p><p>I believe it is important to remember what separates the freethinkers from the SJWs. The freethinkers seek to outthink their opponents with a more persuasive argument in the marketplace of ideas.</p><p>The SJWs seek to silence their opponents through harassment and intimidation. (This should surprise no one, since the SJWs are almost all anti-market and anti-free speech.)</p><p>I can understand the sentiments of those who think it is best to fight fire with fire. This is not a frivolous position. Tor Books has allowed a handful of unprofessional, bigoted, and downright childish individuals to become associated with its brand.</p><p>It is right and fitting to speak out against John Scalzi, the Nielsen Haydens, Moshe Feder, and Irene Gallo.</p><p>And it should be understood from the outset that no argument will persuade these hardcore ideologues and their core supporters.</p><p>Nevertheless, the pro-freedom efforts should focus on defeating the arguments of the would-be thought police, not on silencing them.</p><p>And that’s the chief question: Are you going to out-argue them, or are you going to silence them?</p><p>In my estimation, out-arguing one’s opponents—rather than silencing them—is the course that will persuade the great mass of people on the fence.</p><p>And the great mass of people on the fence are the ones who will ultimately decide the outcome of this battle—both in science fiction and in the wider culture.</p></blockquote><p>Mr. Trimnell is conclusively incorrect for two reasons, one practical and one logical, that are related. First, he completely ignores the fact that the freethinkers have out-argued the thought police for thirty years and have nevertheless continued to be harried from their jobs and from the public discourse without ever losing an argument. It accomplishes nothing to win minor battles while losing wars; he is attempting to overcome superior strategy with better tactics, which is a recipe for certain failure. What he believes separates the two camps is not only not important, it is <i>totally irrelevant</i>. Tactics are not strategy. Means are not objectives.</p><p>He says that in his estimation, “out-arguing one’s opponents—rather than silencing<br> them—is the course that will persuade the great mass of people on the<br> fence”. This is flat-out wrong. Mr. Trimnell cites no evidence for this charming and attractive article of faith, he cites no logic supporting it, and he may as reasonably have stated that so long as we refrain from doing anything that will offend the magic garden fairies, they will magically grant us ultimate victory in the end.</br></br></p><p>How did Brandon Eich fail to out-argue his opponents? How did the Nobel Laureates Tim Hunt and James Watson fail to make their cases? The fact is that one cannot out-argue anyone in debates that do not take place, debates that Mr. Trimnell knows very well, from personal experience, will never take place. He can attempt to out-argue me because I am willing to engage with him, debate him, and discuss our differences in a civil manner rather than pointing, shrieking, and summoning an Internet mob to shout him down, disqualify, and disemploy him. He simply cannot do the same with the people at TOR Books, among others. He knows that.</p><p>Furthermore, Mr. Trimnell is ignoring the wise advice of Aristotle. He is appealing to dialectic in a rhetorical battle where the greater part of those on the other side are not even <i>capable </i>of understanding that dialectic. That is why following his advice is a surefire way to ensure defeat.</p><p>I am offering a proven way to win, one that is both historically and logically sound. Mr. Trimnell is offering nothing but certain defeat because <i>feels</i>. He doesn’t like not feeling morally superior to the other side, so much so that he would rather lose than give up that feeling of superiority in order to meet the enemy head-on. I dislike boycotts too, much as General Ferguson disliked poison gas. But I dislike being methodically mobbed, disqualified, and disemployed even more, I dislike being falsely accused and blatantly lied about even more, so I am utilizing certain SJW tactics even more efficiently and more effectively than the SJWs can. Everyone else of influence on the Right should be doing the same.</p><p>Mr. Trimnell is, ironically enough, justifying my course of action by his own example. Consider: I have offered him a logically superior argument that he has not been able to rebut, which should be sufficient to convince him to endorse the boycott. And yet, he is not convinced because his opposition to it is not rational, it is emotional. How then are we to convince him without using rhetoric, which you may recall is simply an articulated form of emotional pressure?</p><p>Now, I am certainly not suggesting that we should mob him, disqualify him, or disemploy him. How could I wish him to be silenced when he has <a href=\"http://onewordtrimnell.blogspot.com/2015/06/dont-generalize-said-scalzi.html\">so artfully highlighted</a> one TOR author’s preening hypocrisy? I am merely pointing out that in light of the failure of civility and rational argument to change his own mind, Mr. Trimnell cannot possibly expect the civility and rational argument he advocates to dissuade SJWs from utilizing their habitual and successful tactics.</p><p>When you cannot win by out-arguing, you must win by out-silencing. Or you will be silenced.</p></div>",
  "content_text": "When experience gainsays its conclusions. Ed Trimnell\nargues against fighting fire with fire\n:\nI expressed my disagreement with Vox’s position on the Tor Books boycott…and Vox expressed his disagreement with my disagreement.\nMy dislike of boycotts remains.\nI remember the mindless campaign orchestrated against Orson Scott Card a few years ago. Card’s sin was basically to express a view of marriage that was all but universal (including among liberals and Democrats) until ten years ago. Yet the SJW mobs did their best to silence Card, urging a nationwide boycott of the movie adaptation of Ender’s Game, and barraging the offices of DC Comics until Card was dropped from the company’s Superman project.\nAh, but that is exactly the point….say the forces behind the anti-Tor boycott. The SJWs do it.\nI believe it is important to remember what separates the freethinkers from the SJWs. The freethinkers seek to outthink their opponents with a more persuasive argument in the marketplace of ideas.\nThe SJWs seek to silence their opponents through harassment and intimidation. (This should surprise no one, since the SJWs are almost all anti-market and anti-free speech.)\nI can understand the sentiments of those who think it is best to fight fire with fire. This is not a frivolous position. Tor Books has allowed a handful of unprofessional, bigoted, and downright childish individuals to become associated with its brand.\nIt is right and fitting to speak out against John Scalzi, the Nielsen Haydens, Moshe Feder, and Irene Gallo.\nAnd it should be understood from the outset that no argument will persuade these hardcore ideologues and their core supporters.\nNevertheless, the pro-freedom efforts should focus on defeating the arguments of the would-be thought police, not on silencing them.\nAnd that’s the chief question: Are you going to out-argue them, or are you going to silence them?\nIn my estimation, out-arguing one’s opponents—rather than silencing them—is the course that will persuade the great mass of people on the fence.\nAnd the great mass of people on the fence are the ones who will ultimately decide the outcome of this battle—both in science fiction and in the wider culture.\nMr. Trimnell is conclusively incorrect for two reasons, one practical and one logical, that are related. First, he completely ignores the fact that the freethinkers have out-argued the thought police for thirty years and have nevertheless continued to be harried from their jobs and from the public discourse without ever losing an argument. It accomplishes nothing to win minor battles while losing wars; he is attempting to overcome superior strategy with better tactics, which is a recipe for certain failure. What he believes separates the two camps is not only not important, it is\ntotally irrelevant\n. Tactics are not strategy. Means are not objectives.\nHe says that in his estimation, “out-arguing one’s opponents—rather than silencing\nthem—is the course that will persuade the great mass of people on the\nfence”. This is flat-out wrong. Mr. Trimnell cites no evidence for this charming and attractive article of faith, he cites no logic supporting it, and he may as reasonably have stated that so long as we refrain from doing anything that will offend the magic garden fairies, they will magically grant us ultimate victory in the end.\nHow did Brandon Eich fail to out-argue his opponents? How did the Nobel Laureates Tim Hunt and James Watson fail to make their cases? The fact is that one cannot out-argue anyone in debates that do not take place, debates that Mr. Trimnell knows very well, from personal experience, will never take place. He can attempt to out-argue me because I am willing to engage with him, debate him, and discuss our differences in a civil manner rather than pointing, shrieking, and summoning an Internet mob to shout him down, disqualify, and disemploy him. He simply cannot do the same with the people at TOR Books, among others. He knows that.\nFurthermore, Mr. Trimnell is ignoring the wise advice of Aristotle. He is appealing to dialectic in a rhetorical battle where the greater part of those on the other side are not even\ncapable\nof understanding that dialectic. That is why following his advice is a surefire way to ensure defeat.\nI am offering a proven way to win, one that is both historically and logically sound. Mr. Trimnell is offering nothing but certain defeat because\nfeels\n. He doesn’t like not feeling morally superior to the other side, so much so that he would rather lose than give up that feeling of superiority in order to meet the enemy head-on. I dislike boycotts too, much as General Ferguson disliked poison gas. But I dislike being methodically mobbed, disqualified, and disemployed even more, I dislike being falsely accused and blatantly lied about even more, so I am utilizing certain SJW tactics even more efficiently and more effectively than the SJWs can. Everyone else of influence on the Right should be doing the same.\nMr. Trimnell is, ironically enough, justifying my course of action by his own example. Consider: I have offered him a logically superior argument that he has not been able to rebut, which should be sufficient to convince him to endorse the boycott. And yet, he is not convinced because his opposition to it is not rational, it is emotional. How then are we to convince him without using rhetoric, which you may recall is simply an articulated form of emotional pressure?\nNow, I am certainly not suggesting that we should mob him, disqualify him, or disemploy him. How could I wish him to be silenced when he has\nso artfully highlighted\none TOR author’s preening hypocrisy? I am merely pointing out that in light of the failure of civility and rational argument to change his own mind, Mr. Trimnell cannot possibly expect the civility and rational argument he advocates to dissuade SJWs from utilizing their habitual and successful tactics.\nWhen you cannot win by out-arguing, you must win by out-silencing. Or you will be silenced.",
  "tags": [
    "debate",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-23T07:54:00+00:00"
}