{
  "url": "https://voxday.net/2015/06/14/locking-and-loading/",
  "scraped_at": "2025-12-16T12:59:33.650915",
  "title": "Locking and loading",
  "date_display": "June 14, 2015",
  "date_iso": "2015-06-14T18:00:00+00:00",
  "date_from_url": "2015-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Given the false defense presently being offered by Tor’s senior executives, which is that they are not being contacted by large numbers of unhappy science fiction readers but are instead being spammed by a bot-net at my disposal, their response to a prospective boycott is entirely predictable. If Macmillan does not act on the basis of the considerable evidence it will have acquired by now and we find it necessary to proceed to the boycott that Peter Grant and others have contemplated, Tor’s senior executives will undoubtedly claim that those threatening a boycott are not customers of Tor Books.</p><p>There is, of course, an easy way to anticipate and disprove their expected lies.</p><div style=\"text-align: left;\"> <a href=\"http://1.bp.blogspot.com/-6xZjsihZSjg/VX2mzgCiyoI/AAAAAAAABTY/hLsslJwd8tA/s1600/My_Tor_books_800.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"237\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/06/My_Tor_books_800-2.jpg\" width=\"320\"/></a></div><p>As you can see in the photo to the left, I currently have 38 hardcovers and 15 paperbacks published by Tor Books that retail for a cumulative $1,019.64. Some of them were sent to me by Tor, many of them were bought by me. This does not count any of the Tor ebooks that I have purchased, or any of the many Tor paperbacks I got rid of in a move some years ago, which I recall included at least six <i>Wheel of Time</i> books and a number of Orson Scott Card novels, among others. I figure that I would be wise to not lay claim to have had any books that I cannot prove I presently possess, but I estimate that I have probably spent an additional $500 more on Tor books than I can demonstrate today. As it happens, I have been a Tor Books customer since 1986, when I was still in high school and I bought a copy of Isaac Asimov’s <i>The Edge of Tomorrow</i> from B. Dalton’s. I still have it; you can see it third from the bottom on the right.</p><p>I can’t pretend to be a Tor Books fanboy. In rooting through my collection, I learned that I appear to harbor a very strong predilection for Del Rey, as I have more than 1,000 Del Rey books. But I have probably bought more than 100 books from Tor Books over the years, which should suffice to demonstrate that something happened at some point in time to turn me against the organization. If you look closely at the titles, you will be able to discern that the newest copyright date on any of the books is 2005. I wonder <a href=\"https://archive.is/JdnZG\">what might have happened in 2005</a> to turn a loyal customer of 19 years standing against Tor Books and its editors?</p><p>If you happen to own any Tor books, I recommend that you gather them together and take a similar picture. Then add up their total retail value. Go through your Amazon account and list how many Tor ebooks you have purchased, calculate the total retail value, and then add the print and Kindle totals together. And do it now, so that you’ll have everything prepared to preemptively counteract the likely lies of Tor’s SJWs if events proceed in the way that some are anticipating.</p><p>UPDATE: Tor Books author Mary Robinette Kowal tempts fate on Twitter:</p><blockquote class=\"tr_bq\"><p> Mary Robinette Kowal<br> ‏ @RizziWorld @ClaireRousseau @jimchines @torbooks Fair enough. I do want to be fair here and say that I have inside info. She won’t be fired.<br> 5:20 PM – 10 Jun 2015</br></br></p><p>Mary Robinette Kowal<br> ‏ @RizziWorld How about this. If they fire Irene, I will return the advances on my next two books and pull them.<br> 7:23 AM – 14 Jun 2015</br></br></p></blockquote></div>",
  "content_text": "Given the false defense presently being offered by Tor’s senior executives, which is that they are not being contacted by large numbers of unhappy science fiction readers but are instead being spammed by a bot-net at my disposal, their response to a prospective boycott is entirely predictable. If Macmillan does not act on the basis of the considerable evidence it will have acquired by now and we find it necessary to proceed to the boycott that Peter Grant and others have contemplated, Tor’s senior executives will undoubtedly claim that those threatening a boycott are not customers of Tor Books.\nThere is, of course, an easy way to anticipate and disprove their expected lies.\nAs you can see in the photo to the left, I currently have 38 hardcovers and 15 paperbacks published by Tor Books that retail for a cumulative $1,019.64. Some of them were sent to me by Tor, many of them were bought by me. This does not count any of the Tor ebooks that I have purchased, or any of the many Tor paperbacks I got rid of in a move some years ago, which I recall included at least six\nWheel of Time\nbooks and a number of Orson Scott Card novels, among others. I figure that I would be wise to not lay claim to have had any books that I cannot prove I presently possess, but I estimate that I have probably spent an additional $500 more on Tor books than I can demonstrate today. As it happens, I have been a Tor Books customer since 1986, when I was still in high school and I bought a copy of Isaac Asimov’s\nThe Edge of Tomorrow\nfrom B. Dalton’s. I still have it; you can see it third from the bottom on the right.\nI can’t pretend to be a Tor Books fanboy. In rooting through my collection, I learned that I appear to harbor a very strong predilection for Del Rey, as I have more than 1,000 Del Rey books. But I have probably bought more than 100 books from Tor Books over the years, which should suffice to demonstrate that something happened at some point in time to turn me against the organization. If you look closely at the titles, you will be able to discern that the newest copyright date on any of the books is 2005. I wonder\nwhat might have happened in 2005\nto turn a loyal customer of 19 years standing against Tor Books and its editors?\nIf you happen to own any Tor books, I recommend that you gather them together and take a similar picture. Then add up their total retail value. Go through your Amazon account and list how many Tor ebooks you have purchased, calculate the total retail value, and then add the print and Kindle totals together. And do it now, so that you’ll have everything prepared to preemptively counteract the likely lies of Tor’s SJWs if events proceed in the way that some are anticipating.\nUPDATE: Tor Books author Mary Robinette Kowal tempts fate on Twitter:\nMary Robinette Kowal\n‏ @RizziWorld @ClaireRousseau @jimchines @torbooks Fair enough. I do want to be fair here and say that I have inside info. She won’t be fired.\n5:20 PM – 10 Jun 2015\nMary Robinette Kowal\n‏ @RizziWorld How about this. If they fire Irene, I will return the advances on my next two books and pull them.\n7:23 AM – 14 Jun 2015",
  "tags": [
    "books",
    "Puppies",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-14T17:00:00+00:00"
}