{
  "url": "https://voxday.net/2015/06/16/mailvox-sorry-state-of-sf/",
  "scraped_at": "2025-12-16T12:59:42.756270",
  "title": "Mailvox: the sorry state of SF",
  "date_display": "June 16, 2015",
  "date_iso": "2015-06-16T06:00:00+00:00",
  "date_from_url": "2015-06-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I thought this email from RC was interesting, as it demonstrates how Gresham’s Law applies to science fiction, with Pink SF tending to drive out Blue. Hey, even if Tor Books can’t be bothered to read your emails, at least I do:</p><blockquote class=\"tr_bq\"><p> I am writing to you today regarding the lack of professionalism of certain staff at Tor books.  I know others have contacted you regarding the contempt in which some staffers hold certain authors and a large part of your customer base.  What I wish to address is the editors’ contempt for the genre itself, and their incompetence at one of the essential tasks of producing SCIENCE fiction: getting the science right.  I am certain these are related.  The upshot is that Tor is printing a lot of stuff which ticks all the fashionable social and political check-boxes, but stinks on ice as SF.</p><p>An egregious example which I encountered recently is in the first of the <i>Ender’s Game</i> prequels, <i>Earth Unaware</i>.  There are a host of glaring faults in the orbital mechanics among other things, but they are too involved to detail in a short letter.  I will instead quote a concise example from page 261:</p><p><i>“The ship scoops up hydrogen atoms, which at near-lightspeed would be gamma radiation, then the rockets shoot this gamma plasma out the back for thrust.”</i></p><p>There is no such thing as a “gamma plasma”.  Gamma rays are photons, not atoms or parts of atoms.  Plasmas are a mixture of ionized matter and free electrons.  A high-energy proton is not a gamma ray; many cosmic rays are high-energy protons, but that does not make this phrase remotely acceptable in a science fiction book.  A well-read middle school science geek could have caught this error; I should know, I was one.</p><p>Shortly after this comes another one (p. 269):<br> <i><br>“If it’s sucking up hydrogen atoms at near-lightspeed and taking in all this radiation….”</br></i></br></p><p>This is part of a plotline that plays for weeks, between a mining ship plying the Kuiper belt and Earth.  The Kuiper belt extends from about 30 astronomical units to 55 AU from the Sun (earth orbits at 1 AU).  Light travels 1 AU in roughly 500 seconds, so an object travelling at “near-lightspeed” would cover 55 AU in not much more than 27,500 seconds; on the order of 8 hours.  Even if the initial speed of the object is reduced to 25% of c and it decelerates linearly, the transit time is less than 3 days.  The whole plotline is nonsense because the author (Johnston, I’m sure; Card does better work) couldn’t be bothered to read a basic science book.  This is lousy even for fan-fiction.  Why did this ever make it to print?  More to the point, why do the editors have such contempt for the genre and its fans as to allow it, to the point of commissioning a lightweight like Johnston to play in Card’s universe in the first place?</p><p>I could not but help but notice that <i>Earth Unaware</i> got all the “we are the world”, social justice, anti-corporate messages lined up front and center.  The priorities are literally that obvious.  That’s why I’ve not bothered to read the other two prequels.  I don’t waste my time on dreck. I spotted this trend quite some time ago, but it was only after the highly-publicized outbursts of certain senior Tor staff that I realized that it wasn’t due to the times, but was a matter of policy.</p></blockquote><p>Well, we all make mistakes from time to time, authors and editors alike (cough, <i>tunnel</i>), but it is pretty egregious to combine SJW message fiction with a major plot foul-up of the sort one RC describes. I haven’t read the book, so I can’t testify to the accuracy of his critique, but it does sound like a rather impressive howler.</p><p>As for the total number of emails sent, based on the CC’s Peter and I received, around 2,300 emails were sent by 765 different people that we know of. And there were others being sent as well, although we can’t possibly know how many. Regardless, I expect that enough were sent to make it clear to Macmillan that the excuses given by the senior Tor employees for the emails that they previously received was a false one.</p><p>Those senior employees have publicly attacked Tor-published authors, Tor published-works, and Tor customers. They have needlessly antagonized tens of thousands of book-buyers in pursuit of their ideological agenda. They’ve now been caught lying to their superiors about the extent of the consequences of their unprofessional behavior and violations of the Macmillan code of conduct. And that is why, at this point, I wouldn’t be surprised if Macmillan cleans house even more thoroughly than people have been demanding. I certainly would if I were in their shoes.</p><p><a href=\"http://3.bp.blogspot.com/-6xZjsihZSjg/VX2mzgCiyoI/AAAAAAAABTc/cp_fryUMZ2A/s1600/My_Tor_books_800.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"237\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/06/My_Tor_books_800-1.jpg\" width=\"320\"/></a>Then again, for all we know the Macmillan executives are fanatic SJWs whose instinct will be to dig in and defend the actions of Irene Gallo, Moshe Feder, and Patrick Nielsen Hayden. If that’s the case, Peter Grant has made it clear that the boycott, which <i>for no particular reason at all</i> may be christened TORDROP, <a href=\"http://bayourenaissanceman.blogspot.ch/2015/06/can-you-hear-us-now-another-open-letter.html\">will begin at noon on Friday, June 19th</a>. And since no one has received any sort of response at all from Macmillan or Tom Doherty as yet, this is a good time to take a picture of your books published by Tor Books and tally up the total of the books and ebooks you have purchased from them. The truth is that we’re not asking for much, only that the senior employees at Tor Books be held to the same professional standard expected of a retail sales clerk or a fry cook at McDonalds.</p></div>",
  "content_text": "I thought this email from RC was interesting, as it demonstrates how Gresham’s Law applies to science fiction, with Pink SF tending to drive out Blue. Hey, even if Tor Books can’t be bothered to read your emails, at least I do:\nI am writing to you today regarding the lack of professionalism of certain staff at Tor books.  I know others have contacted you regarding the contempt in which some staffers hold certain authors and a large part of your customer base.  What I wish to address is the editors’ contempt for the genre itself, and their incompetence at one of the essential tasks of producing SCIENCE fiction: getting the science right.  I am certain these are related.  The upshot is that Tor is printing a lot of stuff which ticks all the fashionable social and political check-boxes, but stinks on ice as SF.\nAn egregious example which I encountered recently is in the first of the\nEnder’s Game\nprequels,\nEarth Unaware\n.  There are a host of glaring faults in the orbital mechanics among other things, but they are too involved to detail in a short letter.  I will instead quote a concise example from page 261:\n“The ship scoops up hydrogen atoms, which at near-lightspeed would be gamma radiation, then the rockets shoot this gamma plasma out the back for thrust.”\nThere is no such thing as a “gamma plasma”.  Gamma rays are photons, not atoms or parts of atoms.  Plasmas are a mixture of ionized matter and free electrons.  A high-energy proton is not a gamma ray; many cosmic rays are high-energy protons, but that does not make this phrase remotely acceptable in a science fiction book.  A well-read middle school science geek could have caught this error; I should know, I was one.\nShortly after this comes another one (p. 269):\n“If it’s sucking up hydrogen atoms at near-lightspeed and taking in all this radiation….”\nThis is part of a plotline that plays for weeks, between a mining ship plying the Kuiper belt and Earth.  The Kuiper belt extends from about 30 astronomical units to 55 AU from the Sun (earth orbits at 1 AU).  Light travels 1 AU in roughly 500 seconds, so an object travelling at “near-lightspeed” would cover 55 AU in not much more than 27,500 seconds; on the order of 8 hours.  Even if the initial speed of the object is reduced to 25% of c and it decelerates linearly, the transit time is less than 3 days.  The whole plotline is nonsense because the author (Johnston, I’m sure; Card does better work) couldn’t be bothered to read a basic science book.  This is lousy even for fan-fiction.  Why did this ever make it to print?  More to the point, why do the editors have such contempt for the genre and its fans as to allow it, to the point of commissioning a lightweight like Johnston to play in Card’s universe in the first place?\nI could not but help but notice that\nEarth Unaware\ngot all the “we are the world”, social justice, anti-corporate messages lined up front and center.  The priorities are literally that obvious.  That’s why I’ve not bothered to read the other two prequels.  I don’t waste my time on dreck. I spotted this trend quite some time ago, but it was only after the highly-publicized outbursts of certain senior Tor staff that I realized that it wasn’t due to the times, but was a matter of policy.\nWell, we all make mistakes from time to time, authors and editors alike (cough,\ntunnel\n), but it is pretty egregious to combine SJW message fiction with a major plot foul-up of the sort one RC describes. I haven’t read the book, so I can’t testify to the accuracy of his critique, but it does sound like a rather impressive howler.\nAs for the total number of emails sent, based on the CC’s Peter and I received, around 2,300 emails were sent by 765 different people that we know of. And there were others being sent as well, although we can’t possibly know how many. Regardless, I expect that enough were sent to make it clear to Macmillan that the excuses given by the senior Tor employees for the emails that they previously received was a false one.\nThose senior employees have publicly attacked Tor-published authors, Tor published-works, and Tor customers. They have needlessly antagonized tens of thousands of book-buyers in pursuit of their ideological agenda. They’ve now been caught lying to their superiors about the extent of the consequences of their unprofessional behavior and violations of the Macmillan code of conduct. And that is why, at this point, I wouldn’t be surprised if Macmillan cleans house even more thoroughly than people have been demanding. I certainly would if I were in their shoes.\nThen again, for all we know the Macmillan executives are fanatic SJWs whose instinct will be to dig in and defend the actions of Irene Gallo, Moshe Feder, and Patrick Nielsen Hayden. If that’s the case, Peter Grant has made it clear that the boycott, which\nfor no particular reason at all\nmay be christened TORDROP,\nwill begin at noon on Friday, June 19th\n. And since no one has received any sort of response at all from Macmillan or Tom Doherty as yet, this is a good time to take a picture of your books published by Tor Books and tally up the total of the books and ebooks you have purchased from them. The truth is that we’re not asking for much, only that the senior employees at Tor Books be held to the same professional standard expected of a retail sales clerk or a fry cook at McDonalds.",
  "tags": [
    "mailvox",
    "Pink SF",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-16T05:00:00+00:00"
}