{
  "url": "https://voxday.net/2015/06/02/mailvox-bad-science-fiction/",
  "scraped_at": "2025-12-16T12:58:02.961142",
  "title": "Mailvox: bad science fiction",
  "date_display": "June 2, 2015",
  "date_iso": "2015-06-02T18:30:00+00:00",
  "date_from_url": "2015-06-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>In which examples are requested:</p><blockquote class=\"tr_bq\"><p> Normally I try to improve my writing by reading lots of good quality writing, hoping that will come out in my own. But I’m wondering if any sort of list of bad, “don’t do this” examples (I mean in terms of writing quality, not ideological leanings) would come easily to mind for you that would be instructive for those of us who want to improve our own writing.</p><p>It would be very helpful, for me at least, to then see if any of those bad writing habits or tendencies reveal themselves in my own work, and train myself out of them.</p></blockquote><p>I go back to the four elements of a book: CSSC. Characters, Story, Style, and Concepts. In decreasing order of importance, those are the most important elements.</p><p>Characters come first. The huge success of Rowling, Tolkien, Lewis, and Cooper stem from their heightened ability to create characters about whom we care. Therefore, the first example of what not to do should be those that suffer from poor characterization.</p><p>Go ahead, name three.</p><p>Story is the second most important element. You can have a pretty good book where the story makes no sense, so long as the characters are of sufficient interest. An even worse book would have poor characters and a generic or nonexistent story.</p><p>Name three more.</p><p>Style comes third. This is where we tend to most notably part company with the Pink SF crowd. They put style first, except when they put message above that. (Note: I did not say concept, but message. The latter is a subset of the former.)<br> But if you’ve got poor characters, a generic or nonexistent story, and bad style, now it’s getting pretty grim.</br></p><p>And three more.</p><p>Concept includes everything from Very Important Message to worldbuilding. And if you’ve got poor characters, a generic or nonexistent story, bad style, and a Very Important Message in a generic world, you’re approaching the nadir, which in my opinion is best represented by Mercedes Lackey.</p><p>Read <i>Arrows of the Queen</i> if you want to know how best not to do it.</p><p><i>Talia, a young runaway, is made a herald at the royal court after she<br> rescues one of the legendary Companions. When she uncovers a plot to<br> seize the throne, Talia must use her empathic powers to save the queen.</br></br></i></p></div>",
  "content_text": "In which examples are requested:\nNormally I try to improve my writing by reading lots of good quality writing, hoping that will come out in my own. But I’m wondering if any sort of list of bad, “don’t do this” examples (I mean in terms of writing quality, not ideological leanings) would come easily to mind for you that would be instructive for those of us who want to improve our own writing.\nIt would be very helpful, for me at least, to then see if any of those bad writing habits or tendencies reveal themselves in my own work, and train myself out of them.\nI go back to the four elements of a book: CSSC. Characters, Story, Style, and Concepts. In decreasing order of importance, those are the most important elements.\nCharacters come first. The huge success of Rowling, Tolkien, Lewis, and Cooper stem from their heightened ability to create characters about whom we care. Therefore, the first example of what not to do should be those that suffer from poor characterization.\nGo ahead, name three.\nStory is the second most important element. You can have a pretty good book where the story makes no sense, so long as the characters are of sufficient interest. An even worse book would have poor characters and a generic or nonexistent story.\nName three more.\nStyle comes third. This is where we tend to most notably part company with the Pink SF crowd. They put style first, except when they put message above that. (Note: I did not say concept, but message. The latter is a subset of the former.)\nBut if you’ve got poor characters, a generic or nonexistent story, and bad style, now it’s getting pretty grim.\nAnd three more.\nConcept includes everything from Very Important Message to worldbuilding. And if you’ve got poor characters, a generic or nonexistent story, bad style, and a Very Important Message in a generic world, you’re approaching the nadir, which in my opinion is best represented by Mercedes Lackey.\nRead\nArrows of the Queen\nif you want to know how best not to do it.\nTalia, a young runaway, is made a herald at the royal court after she\nrescues one of the legendary Companions. When she uncovers a plot to\nseize the throne, Talia must use her empathic powers to save the queen.",
  "tags": [
    "mailvox",
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-02T17:30:00+00:00"
}