{
  "url": "https://voxday.net/2015/06/01/mailvox-collection-of-questions/",
  "scraped_at": "2025-12-16T12:57:50.077702",
  "title": "Mailvox: a collection of questions",
  "date_display": "June 1, 2015",
  "date_iso": "2015-06-01T09:55:00+00:00",
  "date_from_url": "2015-06-01",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A new reader has a boatload of questions. This is merely the first half. I’ll address the other half later this week:</p><blockquote class=\"tr_bq\"><p> First time e-mail correspondent here, as well as a reader of your blog for about a month-and-a-half now. My religious beliefs could best be described as “conflicted”, or “confused”, or “I’m not even 100% sure what I believe but I’m trying to find out”. My political ideologies and other personal beliefs are in a similar state of flux, and thus, all four of my questions are asked mostly out of curiosity, partly because I know you’ll give a good answer (Should you choose to respond), and partly because you (unlike quite a few people) cite your sources.</p><p>Oh, and I read The Irrational Atheist from front to back. Twice. Once when I was 14, the old man gave me TIA to read, because that was when I was really asking the hard questions about my childhood faith and wondering whether or not the godless teenagers that went to high school with me had a point or not, but it was a bit intellectually above me and I didn’t really absorb the arguments presented all that well. Now, at the tender age of 20, having read the book a second time, I can say with absolute confidence: They really, really didn’t. And having seen what passes for the intellectual atheist, I can also say with the same confidence: Whatever my religious beliefs turn out to be in the future, I certainly never want to turn out like THAT.</p><p>1. Given the rather thorny issue of homosexuality, this isn’t really one question but several related ones. I’ve read your beliefs that homosexuality is an evil, but not really much beyond that. (Others have claimed that you said it’s a birth defect, but I’m aware that’s not the case. I recognize a media smear campaign when I see one) So, I have a few questions to pin down exactly what you think about it:</p><p>a) Do you believe all evils are inherently equal? b) Do you feel that homosexuality equals coveting your neighbor’s possessions equals adultery equals murder? c)Is there a set hierarchy? d)Or does God judge such things on a case by case basis, acting in the role of The Universal Judge?</p><p>e)Do you believe that homosexuality is a choice? The act itself clearly is, but the desire as well? Many gay people that I’ve personally spoken to claim they would have “opted out” if they had been given a choice in the matter, not necessarily out of any love for Jesus Christ (Although there are those that do), but a desire to be normal and get through the day unmolested. f) If the desire is not a choice, if it is something that is designated at birth, then how does this relate to the Christian view of homosexuality, which seems to view it as an active choice that the perpetrator can choose to stop doing at any time?</p><p>g) Do you know of any testimonial or historical evidence that indicates that a person who is gay can become straight by means of conversion, prayer, or worship of the Christian God? I am aware of testimony that such prayer and worship that has cured diseases, addictions, psychological issues, ended crippling pain, and even cured physical birth defects like limps or both legs being different lengths. Wouldn’t it then follow, that such a God would be capable of ending a homosexual desire to those who asked? Wouldn’t it then follow that such a God would WANT to do so, to remove evil desires from those who wish to have them removed?</p><p>h) Hypothetically speaking, if you had turned out to have a primarily (or even exclusive) male sexual preference, how do you believe this would have affected your belief and worship of Jesus Christ? i) Do you think you would attempt to be chaste? j) Would you still denounce the behavior as evil? k) Would you even renounce your worship of God altogether?</p></blockquote><p>I have no idea what the young man’s reason for asking these questions might be and I don’t see any need for anyone to play any guessing games in that regard. After all, it could be anything from an inexplicable craving for Erasure to an overreliance on the philosophy of Macklemore. I will admit that I found it rather amusing to see how some reacted so badly to the “birth defect” comment, considering that it is the preferred alternative explanation to abnormal sexual orientation being a matter of choice. Any abnormality that renders a living being considerably less fit by virtue of presenting a reproductive handicap, be it physical or psychological, must be regarded as a material defect by anyone who subscribes to TENS, and if we are to believe that homosexuality is determined in the prenatal state, then “birth defect” is exactly what gay activists have been proclaiming homosexuality to be for decades. By literal definition from Wikipedia: <i>“Congenital disorder, also known as congenital disease or birth defect, is a condition existing at or before birth regardless of cause.”</i></p><p>I’d think people would be more considerably concerned that one could also make an alarmingly strong case for high cognitive capacity being a congenital disorder in modern society on this basis, but then, we mustn’t deny the rainbow crowd their dramatics.</p><p>a) No. All evils are not equal, either in terms of their consequences or the way in which we are informed God regards them. b) No. In addition to the 10 Commandments being specified, Jesus explained that one Commandment was the most important one. c) There does not appear to be a strictly ordered A-Z hierarchy. d) Yes, as we are told God knows and judges what is in a man’s heart.</p><p>e) I believe all actions are choices, though not necessarily conscious and definitely not always rational. And I believe some inclinations are innate. But it’s not a binary situation, as our choices lead to consequential inclinations we would not possess had we made different choices. It’s quite clear, if you happen to know any homosexuals, that some come to their orientation very naturally, others choose it for a variety of reasons, and still others have it thrust upon them by others.</p><p>f) This is a misunderstanding of the Christian perspective. We all have evil inclinations. We all experience temptation. What tempts you does not tempt me, and vice-versa. But we are all responsible for resisting whatever temptations happen to call to us.</p><p>g) Yes, I have known people who no longer act on their homosexual inclinations and some who say they are no longer troubled by them. Not all of them are Christian, as it happens. I believe in a tantiscient God who can do whatever He decides to do. But we live on the Silent Planet, in a world that He does not rule, a world that is riddled with evil, and so it should be no surprise that evils and misfortunes continue to be inflicted upon us by its ruling power. That’s why we ask, why we pray, that His will be done, on Earth, as it is in Heaven, because for the most part it is not being done that way right now on Earth. (Note to Team Calvin: not now.) If it was, we wouldn’t need to ask for it.</p><p>h) Very little, considering that I was a hedonistic pagan agnostic with a Porsche and a record contract. Temptation is temptation. i) Yes. j) Yes. There are plenty of things that I would very much like to do that I have no problem describing as evil and rejecting on that basis. k) No chance.</p><p>There is a reason that Christianity is described as the hard and narrow path. It’s not easy. It’s not supposed to be easy. Don’t listen to the idiots who claim that Jesus Christ will solve all your problems and make you rich and cure your hangnails if you only say the magic words. They’re just scam artists trying to sell you something. Christianity isn’t Candyland, it is a very dark and terrible vision of a very scary place, of a universe that isn’t merely indifferent to you, but is actively seeking to destroy you, body and soul.</p><p>And if that doesn’t better reflect the reality we observe around us than every other philosophical and religious creed you’ve ever encountered, then I have to very seriously question whether you are paying attention to the world around you. To reject that reality because you really, really, really want to nail the hot little brunette in the miniskirt who is making eyes at you isn’t even wrong, it’s category error.</p><p>As for the issues of God’s inclination and ability to address orientational temptation, I think you would be much better off listening to this man on the subject than to me:</p><div style=\"text-align: center;\"></div><div style=\"text-align: center;\"> <iframe allowfullscreen=\"\" frameborder=\"0\" height=\"288\" src=\"https://www.youtube.com/embed/zuLI1c9VQ7c?feature=player_detailpage\" width=\"512\"></iframe></div></div>",
  "content_text": "A new reader has a boatload of questions. This is merely the first half. I’ll address the other half later this week:\nFirst time e-mail correspondent here, as well as a reader of your blog for about a month-and-a-half now. My religious beliefs could best be described as “conflicted”, or “confused”, or “I’m not even 100% sure what I believe but I’m trying to find out”. My political ideologies and other personal beliefs are in a similar state of flux, and thus, all four of my questions are asked mostly out of curiosity, partly because I know you’ll give a good answer (Should you choose to respond), and partly because you (unlike quite a few people) cite your sources.\nOh, and I read The Irrational Atheist from front to back. Twice. Once when I was 14, the old man gave me TIA to read, because that was when I was really asking the hard questions about my childhood faith and wondering whether or not the godless teenagers that went to high school with me had a point or not, but it was a bit intellectually above me and I didn’t really absorb the arguments presented all that well. Now, at the tender age of 20, having read the book a second time, I can say with absolute confidence: They really, really didn’t. And having seen what passes for the intellectual atheist, I can also say with the same confidence: Whatever my religious beliefs turn out to be in the future, I certainly never want to turn out like THAT.\n1. Given the rather thorny issue of homosexuality, this isn’t really one question but several related ones. I’ve read your beliefs that homosexuality is an evil, but not really much beyond that. (Others have claimed that you said it’s a birth defect, but I’m aware that’s not the case. I recognize a media smear campaign when I see one) So, I have a few questions to pin down exactly what you think about it:\na) Do you believe all evils are inherently equal? b) Do you feel that homosexuality equals coveting your neighbor’s possessions equals adultery equals murder? c)Is there a set hierarchy? d)Or does God judge such things on a case by case basis, acting in the role of The Universal Judge?\ne)Do you believe that homosexuality is a choice? The act itself clearly is, but the desire as well? Many gay people that I’ve personally spoken to claim they would have “opted out” if they had been given a choice in the matter, not necessarily out of any love for Jesus Christ (Although there are those that do), but a desire to be normal and get through the day unmolested. f) If the desire is not a choice, if it is something that is designated at birth, then how does this relate to the Christian view of homosexuality, which seems to view it as an active choice that the perpetrator can choose to stop doing at any time?\ng) Do you know of any testimonial or historical evidence that indicates that a person who is gay can become straight by means of conversion, prayer, or worship of the Christian God? I am aware of testimony that such prayer and worship that has cured diseases, addictions, psychological issues, ended crippling pain, and even cured physical birth defects like limps or both legs being different lengths. Wouldn’t it then follow, that such a God would be capable of ending a homosexual desire to those who asked? Wouldn’t it then follow that such a God would WANT to do so, to remove evil desires from those who wish to have them removed?\nh) Hypothetically speaking, if you had turned out to have a primarily (or even exclusive) male sexual preference, how do you believe this would have affected your belief and worship of Jesus Christ? i) Do you think you would attempt to be chaste? j) Would you still denounce the behavior as evil? k) Would you even renounce your worship of God altogether?\nI have no idea what the young man’s reason for asking these questions might be and I don’t see any need for anyone to play any guessing games in that regard. After all, it could be anything from an inexplicable craving for Erasure to an overreliance on the philosophy of Macklemore. I will admit that I found it rather amusing to see how some reacted so badly to the “birth defect” comment, considering that it is the preferred alternative explanation to abnormal sexual orientation being a matter of choice. Any abnormality that renders a living being considerably less fit by virtue of presenting a reproductive handicap, be it physical or psychological, must be regarded as a material defect by anyone who subscribes to TENS, and if we are to believe that homosexuality is determined in the prenatal state, then “birth defect” is exactly what gay activists have been proclaiming homosexuality to be for decades. By literal definition from Wikipedia:\n“Congenital disorder, also known as congenital disease or birth defect, is a condition existing at or before birth regardless of cause.”\nI’d think people would be more considerably concerned that one could also make an alarmingly strong case for high cognitive capacity being a congenital disorder in modern society on this basis, but then, we mustn’t deny the rainbow crowd their dramatics.\na) No. All evils are not equal, either in terms of their consequences or the way in which we are informed God regards them. b) No. In addition to the 10 Commandments being specified, Jesus explained that one Commandment was the most important one. c) There does not appear to be a strictly ordered A-Z hierarchy. d) Yes, as we are told God knows and judges what is in a man’s heart.\ne) I believe all actions are choices, though not necessarily conscious and definitely not always rational. And I believe some inclinations are innate. But it’s not a binary situation, as our choices lead to consequential inclinations we would not possess had we made different choices. It’s quite clear, if you happen to know any homosexuals, that some come to their orientation very naturally, others choose it for a variety of reasons, and still others have it thrust upon them by others.\nf) This is a misunderstanding of the Christian perspective. We all have evil inclinations. We all experience temptation. What tempts you does not tempt me, and vice-versa. But we are all responsible for resisting whatever temptations happen to call to us.\ng) Yes, I have known people who no longer act on their homosexual inclinations and some who say they are no longer troubled by them. Not all of them are Christian, as it happens. I believe in a tantiscient God who can do whatever He decides to do. But we live on the Silent Planet, in a world that He does not rule, a world that is riddled with evil, and so it should be no surprise that evils and misfortunes continue to be inflicted upon us by its ruling power. That’s why we ask, why we pray, that His will be done, on Earth, as it is in Heaven, because for the most part it is not being done that way right now on Earth. (Note to Team Calvin: not now.) If it was, we wouldn’t need to ask for it.\nh) Very little, considering that I was a hedonistic pagan agnostic with a Porsche and a record contract. Temptation is temptation. i) Yes. j) Yes. There are plenty of things that I would very much like to do that I have no problem describing as evil and rejecting on that basis. k) No chance.\nThere is a reason that Christianity is described as the hard and narrow path. It’s not easy. It’s not supposed to be easy. Don’t listen to the idiots who claim that Jesus Christ will solve all your problems and make you rich and cure your hangnails if you only say the magic words. They’re just scam artists trying to sell you something. Christianity isn’t Candyland, it is a very dark and terrible vision of a very scary place, of a universe that isn’t merely indifferent to you, but is actively seeking to destroy you, body and soul.\nAnd if that doesn’t better reflect the reality we observe around us than every other philosophical and religious creed you’ve ever encountered, then I have to very seriously question whether you are paying attention to the world around you. To reject that reality because you really, really, really want to nail the hot little brunette in the miniskirt who is making eyes at you isn’t even wrong, it’s category error.\nAs for the issues of God’s inclination and ability to address orientational temptation, I think you would be much better off listening to this man on the subject than to me:",
  "tags": [
    "Christianity",
    "mailvox"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-01T08:55:00+00:00"
}