{
  "url": "https://voxday.net/2015/06/26/more-emanations-and-penumbras/",
  "scraped_at": "2025-12-16T13:01:02.069064",
  "title": "More emanations and penumbras",
  "date_display": "June 26, 2015",
  "date_iso": "2015-06-26T14:10:00+00:00",
  "date_from_url": "2015-06-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>And thus <a href=\"http://hosted.ap.org/dynamic/stories/U/US_SUPREME_COURT_GAY_MARRIAGE?SITE=AP&amp;SECTION=HOME&amp;TEMPLATE=DEFAULT&amp;CTIME=2015-06-26-10-02-52\">ends the last pretense of democracy</a> in America:</p><blockquote class=\"tr_bq\"><p> The Supreme Court has declared that same-sex couples have a right to marry anywhere in the United States. Gay and lesbian couples already can marry in 36 states and the District of Columbia. The court’s ruling on Friday means the remaining 14 states, in the South and Midwest, will have to stop enforcing their bans on same-sex marriage.</p></blockquote><p>Five people can declare a fish to be a horse if they like, but that doesn’t make it so. What’s so tragic about the abandonment of both traditional morality and the last vestiges of democracy in America is that it was done for such a petty little cause.</p><p>I observed that America was dead 11 years ago in a column entitled <a href=\"http://www.wnd.com/2004/07/25518/\">“You Can’t Fix a Corpse”</a>. This is just the corpse beginning to stink.</p><p>It’s wryly amusing to recall all those Republicans who swore that the solution was to elect Republicans so they could nominate Supreme Court Justices. How did that work out for you, especially in light of what I predicted back in 2004.</p><p><i>Any last vestiges of hope in the Republican Party have been shattered by<br> the current regime, wherein a Republican President, Republican House,<br> Republican Senate and Republican-nominated Supreme Court have<br> demonstrated that they have zero interest in the timeless vision of<br> America’s founders.  Supporting them in the hopes that they will revive<br> American liberties is akin to hoping that shock paddles will suffice to<br> revive a month-old corpse.  American freedom is not only dead, it has<br> been rotting for some time. </br></br></br></br></br></br></br></i></p></div>",
  "content_text": "And thus\nends the last pretense of democracy\nin America:\nThe Supreme Court has declared that same-sex couples have a right to marry anywhere in the United States. Gay and lesbian couples already can marry in 36 states and the District of Columbia. The court’s ruling on Friday means the remaining 14 states, in the South and Midwest, will have to stop enforcing their bans on same-sex marriage.\nFive people can declare a fish to be a horse if they like, but that doesn’t make it so. What’s so tragic about the abandonment of both traditional morality and the last vestiges of democracy in America is that it was done for such a petty little cause.\nI observed that America was dead 11 years ago in a column entitled\n“You Can’t Fix a Corpse”\n. This is just the corpse beginning to stink.\nIt’s wryly amusing to recall all those Republicans who swore that the solution was to elect Republicans so they could nominate Supreme Court Justices. How did that work out for you, especially in light of what I predicted back in 2004.\nAny last vestiges of hope in the Republican Party have been shattered by\nthe current regime, wherein a Republican President, Republican House,\nRepublican Senate and Republican-nominated Supreme Court have\ndemonstrated that they have zero interest in the timeless vision of\nAmerica’s founders.  Supporting them in the hopes that they will revive\nAmerican liberties is akin to hoping that shock paddles will suffice to\nrevive a month-old corpse.  American freedom is not only dead, it has\nbeen rotting for some time.",
  "tags": [
    "decline and fall"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-26T13:10:00+00:00"
}