{
  "url": "https://voxday.net/2015/06/11/moshe-feder-doubles-down-twice/",
  "scraped_at": "2025-12-16T12:59:07.614230",
  "title": "Moshe Feder doubles down… twice",
  "date_display": "June 11, 2015",
  "date_iso": "2015-06-11T12:00:00+00:00",
  "date_from_url": "2015-06-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The Associate Editor of Tor Books <a href=\"https://pbs.twimg.com/media/CHLcqz_UIAADbLE.jpg\">doubled-down on Facebook</a>:</p><blockquote class=\"tr_bq\"><p> I’ll be happy to say right now, here on my _personal_ FB page, speaking for myself and not Tor, that I agree with Irene that Vox Day can be fairly described as a neo-Nazi. <br> – <b>Moshe Feder, Associate Editor, Tor Books</b></br></p></blockquote><p>It’s a very strange to accuse a self-declared Zionist who <a href=\"http://www.amazon.com/History-Strategy-Sun-William-Lind-ebook/dp/B00V94520E\">edits</a> and <a href=\"http://www.amazon.com/Equality-Impossible-Martin-van-Creveld-ebook/dp/B00UVLE20W/ref=pd_sim_351_2?ie=UTF8&amp;refRID=0ZKNAY14PSDEVP5AHP41\">publishes</a> Israeli authors of being a neo-Nazi, but then, these are the same people who insist that Brad Torgersen is racist despite his marriage to a black woman. Mr. Feder then proceeded <a href=\"https://www.facebook.com/feder/posts/10207035165541358?pnref=story\">to double down <i>again</i></a>:</p><blockquote class=\"tr_bq\"><p> The approval of Tom Doherty’s statement from those with Puppy sympathies or at least tolerance, and the disapproval of it by those — like most of my friends — whom the Puppies would dismiss as Social Justice Warriors or CHORFs, is hardly surprising. It must be accounted a tactical victory for those who chose Irene Gallo as a target and put Tor in the position of feeling it had to respond. This has gone well beyond the usual purely rhetorical combat of fan feuds to threatening someone’s career status because of their personal opinion. It’s dirty pool in my eyes and sets a terrible precedent.</p><p>There’s been plenty of heated commentary in the aftermath yesterday and today, often pretty wild-eyed, some condemning Irene and calling for her to be fired, others condemning Tom and Tor as sexist for singling her out while Patrick and I went unmentioned. In response, I’d like to suggest a calm consideration of proportionality and a return to the practical realities of this year’s Hugo Awards.</p><p>As far as I can tell, Irene didn’t start her personal blog page intending to malign any Puppies, either Sad or Rabid. Rather, she responded in a spontaneous, unpremeditated way to a request for an explanation about the Hugo controversy, in the process accurately describing Theodore Beale as a neo-Nazi. Since her answer to the query was so brief, the Sad Puppies were mentioned in close proximity to that description, which understandably left them very uncomfortable. (Eric Flint’s analysis concluding that this was all a deliberate subtle ploy on Irene’s part to use guilt by association against them gives her too much credit. Like many visual artists, she is a spontaneous writer and not a calculating one.)</p><p>Irene has never been known for her diplomacy — I say that as someone who’s knocked heads with her more than once on work-related matters — but I think the reaction to her off-the-cuff statement is more extreme and over-the-top than the statement itself. After all, in the end, it was just one person’s opinion, readily ignorable by those who differ with it. (In fact, it went unnoticed for _weeks_ until someone decided to weaponize it.) It’s _trivial_ compared to Brad and Larry’s premeditated, organized effort to violate a social compact of 60 years standing. If you want to express outrage, that’s where it should properly be applied.<br> – <b>Moshe Feder, Associate Editor, Tor Books</b></br></p></blockquote><p>We don’t approve of Mr. Doherty’s statement. We consider it to have been woefully insufficient. And Mr. Feder just happened to leave out the minor fact that Irene Gallo attacked Tor’s customers and described the works written by Tor authors as “bad-to-reprehensible”. The important thing to Mr. Feder, apparently, is repeating and trying to justify the “neo-Nazi” libel of a well-known libertarian.</p><p>As for setting a “terrible precedent”, that is downright absurd. Gallo’s firing will not be anything close to a precedent. The SJWs set these ground rules and we have already seen many examples of people losing their jobs for everything from a six-year-old political donation to a single Facebook comment, examples <a href=\"http://www.nbcmiami.com/news/local/North-Miami-Senior-High-School-Principal-Alberto-Iber-Loses-Job-Over-Post-on-Police-Incident-in-McKinney-Texas-306816711.html\">as recent as yesterday</a>.</p><blockquote class=\"tr_bq\"><p> The principal of North Miami Senior High School has lost his job over his Facebook comment defending the Texas police officer caught on video pushing a teen girl to the ground in an incident at a community pool.</p><p>“Miami-Dade County Public Schools employees are held to a higher standard, and by School Board policy, are required to conduct themselves, both personally and professionally, in a manner that represents the school district’s core values.”</p></blockquote><p>In light of these additional provocations by a Tor Books employee, I sent an email to Tom Doherty, Publisher at Tor Books, requesting that he deal directly with the public misbehavior of his Associate Publisher and his Associate Editor. I trust that he will address the situation in a professional and decisive manner.</p><p>It should be obvious, at this point, that I am far from the only individual being attacked by his employee,s and that the unpleasantries are not going to end until those employees are held fully accountable for their ludicrously unprofessional actions.</p><blockquote class=\"tr_bq\"><p> <b>Darrell Schweitzer </b><br> The Puppies are entitled to their literary opinions and tastes, but to my mind any of them who do not repudiate Vox Day are neo-Nazis by association. You are responsible for who you associate with or take as an ally.</br></p></blockquote><p>Guilt by association. That’s new. Given that precisely zero Sad Puppies and Rabid Puppies have repudiated me, apparently we’re supposed to believe that you’re all neo-Nazis too. Meanwhile, SJWs <a href=\"http://www.bbc.com/news/uk-33090022\">force a Nobel laureate to resign over a single comment</a>:</p><blockquote class=\"tr_bq\"><p>     A Nobel laureate has resigned from his position as honorary professor at a UK university after he made comments about the “trouble with girls” in science. University College London (UCL) said Sir Tim Hunt – a Royal Society fellow – had resigned from his position within its faculty of life sciences.</p><p>    He told a conference that women in labs “cry” when criticised and “fall in love” with male counterparts.</p><p>    He told the BBC he “did mean” the remarks but was “really sorry”.</p><p>    A statement from the university read: “UCL can confirm that Sir Tim Hunt FRS has resigned from his position as honorary professor with the UCL faculty of life sciences following comments he made about women in science at the World Conference of Science Journalists on 9 June.</p><p>    “UCL was the first university in England to admit women students on equal terms to men, and the university believes that this outcome is compatible with our commitment to gender equality.”  </p></blockquote></div>",
  "content_text": "The Associate Editor of Tor Books\ndoubled-down on Facebook\n:\nI’ll be happy to say right now, here on my _personal_ FB page, speaking for myself and not Tor, that I agree with Irene that Vox Day can be fairly described as a neo-Nazi.\n–\nMoshe Feder, Associate Editor, Tor Books\nIt’s a very strange to accuse a self-declared Zionist who\nedits\nand\npublishes\nIsraeli authors of being a neo-Nazi, but then, these are the same people who insist that Brad Torgersen is racist despite his marriage to a black woman. Mr. Feder then proceeded\nto double down\nagain\n:\nThe approval of Tom Doherty’s statement from those with Puppy sympathies or at least tolerance, and the disapproval of it by those — like most of my friends — whom the Puppies would dismiss as Social Justice Warriors or CHORFs, is hardly surprising. It must be accounted a tactical victory for those who chose Irene Gallo as a target and put Tor in the position of feeling it had to respond. This has gone well beyond the usual purely rhetorical combat of fan feuds to threatening someone’s career status because of their personal opinion. It’s dirty pool in my eyes and sets a terrible precedent.\nThere’s been plenty of heated commentary in the aftermath yesterday and today, often pretty wild-eyed, some condemning Irene and calling for her to be fired, others condemning Tom and Tor as sexist for singling her out while Patrick and I went unmentioned. In response, I’d like to suggest a calm consideration of proportionality and a return to the practical realities of this year’s Hugo Awards.\nAs far as I can tell, Irene didn’t start her personal blog page intending to malign any Puppies, either Sad or Rabid. Rather, she responded in a spontaneous, unpremeditated way to a request for an explanation about the Hugo controversy, in the process accurately describing Theodore Beale as a neo-Nazi. Since her answer to the query was so brief, the Sad Puppies were mentioned in close proximity to that description, which understandably left them very uncomfortable. (Eric Flint’s analysis concluding that this was all a deliberate subtle ploy on Irene’s part to use guilt by association against them gives her too much credit. Like many visual artists, she is a spontaneous writer and not a calculating one.)\nIrene has never been known for her diplomacy — I say that as someone who’s knocked heads with her more than once on work-related matters — but I think the reaction to her off-the-cuff statement is more extreme and over-the-top than the statement itself. After all, in the end, it was just one person’s opinion, readily ignorable by those who differ with it. (In fact, it went unnoticed for _weeks_ until someone decided to weaponize it.) It’s _trivial_ compared to Brad and Larry’s premeditated, organized effort to violate a social compact of 60 years standing. If you want to express outrage, that’s where it should properly be applied.\n–\nMoshe Feder, Associate Editor, Tor Books\nWe don’t approve of Mr. Doherty’s statement. We consider it to have been woefully insufficient. And Mr. Feder just happened to leave out the minor fact that Irene Gallo attacked Tor’s customers and described the works written by Tor authors as “bad-to-reprehensible”. The important thing to Mr. Feder, apparently, is repeating and trying to justify the “neo-Nazi” libel of a well-known libertarian.\nAs for setting a “terrible precedent”, that is downright absurd. Gallo’s firing will not be anything close to a precedent. The SJWs set these ground rules and we have already seen many examples of people losing their jobs for everything from a six-year-old political donation to a single Facebook comment, examples\nas recent as yesterday\n.\nThe principal of North Miami Senior High School has lost his job over his Facebook comment defending the Texas police officer caught on video pushing a teen girl to the ground in an incident at a community pool.\n“Miami-Dade County Public Schools employees are held to a higher standard, and by School Board policy, are required to conduct themselves, both personally and professionally, in a manner that represents the school district’s core values.”\nIn light of these additional provocations by a Tor Books employee, I sent an email to Tom Doherty, Publisher at Tor Books, requesting that he deal directly with the public misbehavior of his Associate Publisher and his Associate Editor. I trust that he will address the situation in a professional and decisive manner.\nIt should be obvious, at this point, that I am far from the only individual being attacked by his employee,s and that the unpleasantries are not going to end until those employees are held fully accountable for their ludicrously unprofessional actions.\nDarrell Schweitzer\nThe Puppies are entitled to their literary opinions and tastes, but to my mind any of them who do not repudiate Vox Day are neo-Nazis by association. You are responsible for who you associate with or take as an ally.\nGuilt by association. That’s new. Given that precisely zero Sad Puppies and Rabid Puppies have repudiated me, apparently we’re supposed to believe that you’re all neo-Nazis too. Meanwhile, SJWs\nforce a Nobel laureate to resign over a single comment\n:\nA Nobel laureate has resigned from his position as honorary professor at a UK university after he made comments about the “trouble with girls” in science. University College London (UCL) said Sir Tim Hunt – a Royal Society fellow – had resigned from his position within its faculty of life sciences.\nHe told a conference that women in labs “cry” when criticised and “fall in love” with male counterparts.\nHe told the BBC he “did mean” the remarks but was “really sorry”.\nA statement from the university read: “UCL can confirm that Sir Tim Hunt FRS has resigned from his position as honorary professor with the UCL faculty of life sciences following comments he made about women in science at the World Conference of Science Journalists on 9 June.\n“UCL was the first university in England to admit women students on equal terms to men, and the university believes that this outcome is compatible with our commitment to gender equality.”",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-11T11:00:00+00:00"
}