{
  "url": "https://voxday.net/2015/06/29/no-return/",
  "scraped_at": "2025-12-16T13:01:25.143816",
  "title": "No return",
  "date_display": "June 29, 2015",
  "date_iso": "2015-06-29T16:00:00+00:00",
  "date_from_url": "2015-06-29",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s no wonder conservatives are reliably losing when you consider how long they have enthusiastically <a href=\"http://www.independent.co.uk/news/world/americas/conservative-commentator-makes-emotional-plea-for-republican-party-to-accept-same-sex-marriage-10350909.html\">accepted their enemies</a> as their “opinion leaders”:</p><blockquote class=\"tr_bq\"><p> A Conservative commentator has tearfully urged the Republican Party to accept gay marriage to prevent the party becoming a “relic”. Speaking in an interview with CNN shortly after the historic Supreme Court decision to legalise same-sex marriage was handed down on Friday, S.E. Cupp was moved to tears as she explained gay people just wanted “the human dignity the rest of us have”.</p></blockquote><p>If you want to win, stop paying any attention whatsoever to ideological enemies simply because they put on your jersey and claim to be one of you while arguing the opposite of your opinions and rejecting your beliefs. </p><p>If people want “human dignity”, then they need to earn it by behaving in a dignified manner, not by throwing “pride” parades and behaving like pagans.</p><p>And as a general rule, don’t listen to anyone who substitutes tears for rational argument. That’s the lowest and least intelligent form of rhetoric. Accepting the gay agenda has already made relics of the Anglican and Episcopalian Churches. Following suit will do the same for the Republican Party. And it will do the same for the United States of America.</p><p><a href=\"http://assets-s3.usmagazine.com/uploads/assets/articles/88846-white-house-does-rainbow-colors-after-gay-marriage-ruling-stars-react/1435410503_white-house--rainbow-scotus-gay-marriage_1.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"217\" src=\"http://assets-s3.usmagazine.com/uploads/assets/articles/88846-white-house-does-rainbow-colors-after-gay-marriage-ruling-stars-react/1435410503_white-house--rainbow-scotus-gay-marriage_1.jpg\" width=\"320\"/></a>The USA has observably made its choice. It has abandoned faith in God for trust in the god of this world and prince of this age. And once faith has departed from a nation, it seldom returns, as Juan Donoso Cortés observed in his speech to the Spanish Parliament on January 4, 1849.</p><p><i>There are only two possible forms of repression: one internal and the other external; religious repression and political repression. They are of such a nature that when the religious thermometer is high, the thermometer of political repression is low; and, when the religious thermometer low, the political thermometer—political repression—tyranny is high. That is a law of humanity, a law of history. If you want proof, Gentlemen, look at the state of the world, look at the state of society in the ages before the Cross; tell me what happened when there was no internal repression, when there was no religious repression. That was a society of tyrants and slaves. Give me the name of a single people at this period which possessed no slaves and knew no tyrant. It is an incontrovertible and evident fact, which has never been questioned. Liberty, real liberty, the liberty of all and for all, only came into the world with the Savior of the world; that again is an incontrovertible fact, recognized even by the Socialists.</i></p><p>Gentlemen, I beg you to pay attention; I am going to present you with the most marvelous parallel which history can offer us. You have seen that in antiquity, when religious repression couldn’t go any lower because there was none, political repression rose until it couldn’t go any higher, because it went all the way up to tyranny. Very well then, with Jesus Christ, where religious repression is born, political repression completely disappears. This is so true, that when Jesus Christ founded a society with His disciples, that society was the only one which has ever existed without a government. Between Jesus Christ and His disciples there was no other government than the love of the Master for His disciples and the love of the disciples for their Master. That is, that when the internal repression was complete, liberty was absolute.</p><p><a name=\"more\"></a><i>Let us pursue the parallel. Now come the apostolic times, which I shall stretch from the time of the Apostles, properly speaking, to the period when Christianity mounted the Capitol in the reign of Constantine the Great. At this time, Gentlemen, the Christian religion, that is, the internal, religious repression, was at its zenith; but in spite of that, as always happens in human societies, a germ began to develop, a mere germ of license and religious liberty. So, Gentlemen, observe the parallel: with this beginning of a fall in the religious thermometer there corresponds the beginning of a rise in the political thermometer. There is still no government yet, for government is not yet necessary; but it is already necessary to have the germ of government. In point of fact, in the Christian society of the time, there were no real magistrates, but there were adjudicators and arbitrators who form the germ of government. There was really nothing more than that; the Christians of apostolic times engaged in no lawsuits and never appealed to the Courts: their disputes were settled by the arbitrators. Notice, Gentlemen, how the scope of government is enlarged with the growth of corruption.</i></p><p>Then came feudal times. Religion was still at its zenith during this period, but was vitiated up to a point by human passions. What happened in the political sphere? A real and effective government was already essential; but the weakest kind was good enough. As a result, feudal monarchy was established, the weakest of all kinds of monarchy.</p><p>Still pursuing our parallel, we come to the sixteenth century. Then, with the great Lutheran Reformation, with this great scandal which was at the same time political, social and religious, with this act of the intellectual and moral emancipation of the peoples, we see simultaneously the growth of the following institutions. In the first place, and immediately, the feudal monarchies became absolute. Gentlemen, you believe that a monarchy cannot go beyond absolutism: what can a government be beyond absolute? However, the thermometer of political repression had to rise even higher, because the religious thermometer continued to fall: and the political thermometer did in fact rise higher. What did they create then? Standing armies. Do you know what standing armies are? To answer that question, it is enough to know what a soldier is: a soldier is a slave in uniform. So you see once again, when religious repression falls, political repression rises, it rises as high as absolutism and even higher. It was not enough for governments to be absolute; they asked for and obtained the privilege of having a million arms.</p><p>In spite of this, Gentlemen, the political thermometer had to continue to rise because the religious thermometer kept falling; it rose still higher. What new institution was created then? The governments said: We have a million arms and it is not enough; we need something more, we need a million eyes: and they created the police, and with the police a million eyes. In spite of this, Gentlemen, the political thermometer and political repression had to rise to a higher pitch still, because in spite of everything, the religious thermometer kept falling; so they rose higher.</p><p>It was not enough for the governments to have a million arms and a million eyes; they wanted to have a million ears: and so they got them through administrative centralization, by means of which all claims and complaints finally reached the government.</p><p>Well, Gentlemen, that was not enough; the religious thermometer continued to fall and so the political thermometer had to rise higher. And it rose. Governments said: A million arms, a million eyes and a million ears are not sufficient to repress the people, we need something more; we must have the privilege of being simultaneously present everywhere. This privilege also they obtained: the telegraph was invented.</p><p>Such, Gentlemen, was the state of Europe and the world when the first rumblings of the most recent revolution told us all that there is still not enough despotism on the earth, since the religious thermometer remains below zero. And now the choice between two things lies before us.</p><p>I have promised to speak today with complete frankness and I shall keep my word.</p><p>Well then, it’s either one of these two: either a religious reaction will come, or it will not. If there is a religious reaction, you will soon see that as the religious thermometer rises, the political thermometer will begin to fall, naturally, spontaneously, without the slightest effort on the part of peoples, governments, or men, until the tranquil day comes when the peoples of the world are free. But if, on the contrary, and this is a serious matter (it is not customary to call the attention of Consultative Assemblies to questions of this nature; but the gravity of events today is my excuse and I think that your benevolence will also excuse me); I say again, Gentlemen, that if the religious thermometer continues to fall, I know not whither we are going. I do not know, Gentlemen, and I shiver when I think of it. Consider the analogies I have put before your eyes; if no government at all was necessary when religious repression was at its zenith; when religious repression is no more, no type of government will be enough—all despotisms will be insufficient.</p><p>This is putting one’s finger into the wound, Gentlemen—this is the problem which faces Spain, Europe, humanity, and the world.</p><p>Notice one thing, Gentlemen. In the ancient world, tyranny was fierce and devastating; and yet this tyranny was physically limited, since all States were small and international relations between them all were completely impossible; consequently tyranny on the grand scale was impossible in antiquity, with one exception: Rome. But today, how greatly are things changed! The way is prepared for a gigantic, colossal, universal, and immense tyrant; everything is ready for it. Gentlemen, observe that there are no physical or moral resistances anymore—there are no physical resistances anymore because with steamboats and railroads there are no borders any longer; there are no physical resistances anymore because with the electric telegraph there are no distances anymore; and there are no moral resistances because all wills are divided and all patriotisms are dead. Tell me, therefore, if I am right or wrong to be worried about the near future of the world; tell me whether, in dealing with this question, I am not touching upon the real problem.</p><p>There is only one thing that can avert the catastrophe—one and only one: we shall not avert it by granting more liberty, more guarantees and new constitutions; we shall avert it if all of us, according to our strength, do our utmost to stimulate a healthy reaction—a religious reaction. Now is this possible, Gentlemen? Yes, it is. But is it likely? I answer in deepest sorrow: I do not think it is likely. I have seen and known many men who returned to their faith after having separated themselves from it; unfortunately, I have never known any nation which returned to the Faith after having lost it.</p></div>",
  "content_text": "It’s no wonder conservatives are reliably losing when you consider how long they have enthusiastically\naccepted their enemies\nas their “opinion leaders”:\nA Conservative commentator has tearfully urged the Republican Party to accept gay marriage to prevent the party becoming a “relic”. Speaking in an interview with CNN shortly after the historic Supreme Court decision to legalise same-sex marriage was handed down on Friday, S.E. Cupp was moved to tears as she explained gay people just wanted “the human dignity the rest of us have”.\nIf you want to win, stop paying any attention whatsoever to ideological enemies simply because they put on your jersey and claim to be one of you while arguing the opposite of your opinions and rejecting your beliefs.\nIf people want “human dignity”, then they need to earn it by behaving in a dignified manner, not by throwing “pride” parades and behaving like pagans.\nAnd as a general rule, don’t listen to anyone who substitutes tears for rational argument. That’s the lowest and least intelligent form of rhetoric. Accepting the gay agenda has already made relics of the Anglican and Episcopalian Churches. Following suit will do the same for the Republican Party. And it will do the same for the United States of America.\nThe USA has observably made its choice. It has abandoned faith in God for trust in the god of this world and prince of this age. And once faith has departed from a nation, it seldom returns, as Juan Donoso Cortés observed in his speech to the Spanish Parliament on January 4, 1849.\nThere are only two possible forms of repression: one internal and the other external; religious repression and political repression. They are of such a nature that when the religious thermometer is high, the thermometer of political repression is low; and, when the religious thermometer low, the political thermometer—political repression—tyranny is high. That is a law of humanity, a law of history. If you want proof, Gentlemen, look at the state of the world, look at the state of society in the ages before the Cross; tell me what happened when there was no internal repression, when there was no religious repression. That was a society of tyrants and slaves. Give me the name of a single people at this period which possessed no slaves and knew no tyrant. It is an incontrovertible and evident fact, which has never been questioned. Liberty, real liberty, the liberty of all and for all, only came into the world with the Savior of the world; that again is an incontrovertible fact, recognized even by the Socialists.\nGentlemen, I beg you to pay attention; I am going to present you with the most marvelous parallel which history can offer us. You have seen that in antiquity, when religious repression couldn’t go any lower because there was none, political repression rose until it couldn’t go any higher, because it went all the way up to tyranny. Very well then, with Jesus Christ, where religious repression is born, political repression completely disappears. This is so true, that when Jesus Christ founded a society with His disciples, that society was the only one which has ever existed without a government. Between Jesus Christ and His disciples there was no other government than the love of the Master for His disciples and the love of the disciples for their Master. That is, that when the internal repression was complete, liberty was absolute.\nLet us pursue the parallel. Now come the apostolic times, which I shall stretch from the time of the Apostles, properly speaking, to the period when Christianity mounted the Capitol in the reign of Constantine the Great. At this time, Gentlemen, the Christian religion, that is, the internal, religious repression, was at its zenith; but in spite of that, as always happens in human societies, a germ began to develop, a mere germ of license and religious liberty. So, Gentlemen, observe the parallel: with this beginning of a fall in the religious thermometer there corresponds the beginning of a rise in the political thermometer. There is still no government yet, for government is not yet necessary; but it is already necessary to have the germ of government. In point of fact, in the Christian society of the time, there were no real magistrates, but there were adjudicators and arbitrators who form the germ of government. There was really nothing more than that; the Christians of apostolic times engaged in no lawsuits and never appealed to the Courts: their disputes were settled by the arbitrators. Notice, Gentlemen, how the scope of government is enlarged with the growth of corruption.\nThen came feudal times. Religion was still at its zenith during this period, but was vitiated up to a point by human passions. What happened in the political sphere? A real and effective government was already essential; but the weakest kind was good enough. As a result, feudal monarchy was established, the weakest of all kinds of monarchy.\nStill pursuing our parallel, we come to the sixteenth century. Then, with the great Lutheran Reformation, with this great scandal which was at the same time political, social and religious, with this act of the intellectual and moral emancipation of the peoples, we see simultaneously the growth of the following institutions. In the first place, and immediately, the feudal monarchies became absolute. Gentlemen, you believe that a monarchy cannot go beyond absolutism: what can a government be beyond absolute? However, the thermometer of political repression had to rise even higher, because the religious thermometer continued to fall: and the political thermometer did in fact rise higher. What did they create then? Standing armies. Do you know what standing armies are? To answer that question, it is enough to know what a soldier is: a soldier is a slave in uniform. So you see once again, when religious repression falls, political repression rises, it rises as high as absolutism and even higher. It was not enough for governments to be absolute; they asked for and obtained the privilege of having a million arms.\nIn spite of this, Gentlemen, the political thermometer had to continue to rise because the religious thermometer kept falling; it rose still higher. What new institution was created then? The governments said: We have a million arms and it is not enough; we need something more, we need a million eyes: and they created the police, and with the police a million eyes. In spite of this, Gentlemen, the political thermometer and political repression had to rise to a higher pitch still, because in spite of everything, the religious thermometer kept falling; so they rose higher.\nIt was not enough for the governments to have a million arms and a million eyes; they wanted to have a million ears: and so they got them through administrative centralization, by means of which all claims and complaints finally reached the government.\nWell, Gentlemen, that was not enough; the religious thermometer continued to fall and so the political thermometer had to rise higher. And it rose. Governments said: A million arms, a million eyes and a million ears are not sufficient to repress the people, we need something more; we must have the privilege of being simultaneously present everywhere. This privilege also they obtained: the telegraph was invented.\nSuch, Gentlemen, was the state of Europe and the world when the first rumblings of the most recent revolution told us all that there is still not enough despotism on the earth, since the religious thermometer remains below zero. And now the choice between two things lies before us.\nI have promised to speak today with complete frankness and I shall keep my word.\nWell then, it’s either one of these two: either a religious reaction will come, or it will not. If there is a religious reaction, you will soon see that as the religious thermometer rises, the political thermometer will begin to fall, naturally, spontaneously, without the slightest effort on the part of peoples, governments, or men, until the tranquil day comes when the peoples of the world are free. But if, on the contrary, and this is a serious matter (it is not customary to call the attention of Consultative Assemblies to questions of this nature; but the gravity of events today is my excuse and I think that your benevolence will also excuse me); I say again, Gentlemen, that if the religious thermometer continues to fall, I know not whither we are going. I do not know, Gentlemen, and I shiver when I think of it. Consider the analogies I have put before your eyes; if no government at all was necessary when religious repression was at its zenith; when religious repression is no more, no type of government will be enough—all despotisms will be insufficient.\nThis is putting one’s finger into the wound, Gentlemen—this is the problem which faces Spain, Europe, humanity, and the world.\nNotice one thing, Gentlemen. In the ancient world, tyranny was fierce and devastating; and yet this tyranny was physically limited, since all States were small and international relations between them all were completely impossible; consequently tyranny on the grand scale was impossible in antiquity, with one exception: Rome. But today, how greatly are things changed! The way is prepared for a gigantic, colossal, universal, and immense tyrant; everything is ready for it. Gentlemen, observe that there are no physical or moral resistances anymore—there are no physical resistances anymore because with steamboats and railroads there are no borders any longer; there are no physical resistances anymore because with the electric telegraph there are no distances anymore; and there are no moral resistances because all wills are divided and all patriotisms are dead. Tell me, therefore, if I am right or wrong to be worried about the near future of the world; tell me whether, in dealing with this question, I am not touching upon the real problem.\nThere is only one thing that can avert the catastrophe—one and only one: we shall not avert it by granting more liberty, more guarantees and new constitutions; we shall avert it if all of us, according to our strength, do our utmost to stimulate a healthy reaction—a religious reaction. Now is this possible, Gentlemen? Yes, it is. But is it likely? I answer in deepest sorrow: I do not think it is likely. I have seen and known many men who returned to their faith after having separated themselves from it; unfortunately, I have never known any nation which returned to the Faith after having lost it.",
  "tags": [
    "media",
    "politics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-29T15:00:00+00:00"
}