{
  "url": "https://voxday.net/2015/06/04/post-evolutionary-man/",
  "scraped_at": "2025-12-16T12:58:16.125467",
  "title": "Post-evolutionary Man",
  "date_display": "June 4, 2015",
  "date_iso": "2015-06-04T15:00:00+00:00",
  "date_from_url": "2015-06-04",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Roosh not only observes that <a href=\"http://www.rooshv.com/the-theory-of-evolution-does-not-apply-to-modern-human-beings?utm_source=dlvr.it&amp;utm_medium=twitter\">natural selection no longer applies</a> to human evolution, but concludes that this indicates the inapplicability of the evo psyche model to human behavior:</p><blockquote class=\"tr_bq\"><p> Anti-evolutionary behaviors should have been weeded out of the gene pool according to the idea of natural selection, but the more I looked around, the more I saw nothing but my own behavior, of people who were actually frightened to death about being a parent even though they were healthy and could afford to raise children. In fact, the sum of Western ideologies seem aimed to specifically halt human reproduction.</p><p>Western people are structuring their lives in deliberate ways to not reproduce at all and where their cherished hedonistic lifestyles would be greatly harmed if children entered the picture, and while it’s easy to use evolutionary theory in describing which man a woman chooses to have sex with, how can that possibly be correct if the man used condoms or the woman used birth control? Darwin’s theory refers to reproduction, not recreational sex and definitely not a prolonged period of sterile sport fucking, which has no benefit to the genes of the “athlete.” Having an explanation for why a girl on birth control went home with the “alpha male” after meeting him in the club has nothing to do with evolution or natural selection, since they both knew that no child would result and used the full force of their consciousness to prevent the creation of life. If reproduction was the purposefully blocked intent, evolution was not present during the sex event….</p><p>We must therefore conclude, with logic and rationale, that evolution is so flawed at explaining modern <i>human reproductive</i><br> behavior (and not merely casual sex where reproduction was never the<br> intent), that evolution is not an observable or correct principle for<br> human beings living in Westernized nations. We must discard evolutionary<br> theory as applying to all humans through the mechanism of natural<br> selection and begin a search for a new explanation that explains our<br> current biological behavior.</br></br></br></br></br></br></p><p>Evolution may have been the correct theory for a window of human<br> existence, but that window has now closed and theories for<br> post-evolutionary man, one in which there is no struggle for survival<br> and where the strongest of the species are not reproducing, must be<br> devised.</br></br></br></br></p><p>Even if we were to concede that we got here through the process of<br> evolution from a primordial soup, and that our brains are the result of<br> it, these brains are now in a modern environment which has tripwired,<br> hijacked, or corrupted any applicable evolutionary program. We have<br> become one with the plugged-in cosmopolitan borg, and that regardless of<br> the process that caused us to come about, that process is no longer in<br> effect and a new process, yet to be described or understood, is<br> manifesting itself throughout humanity and shattering Darwin’s “survive<br> and reproduce” model.</br></br></br></br></br></br></br></br></p></blockquote><p>I never bought into either the natural selection explanation for human evolution or the evo psych explanation for human behavior, but it is fascinating to see other high-caliber thinkers like Roosh who did beginning to reach similar conclusions.</p><p>Needless to say, this is one of the many topics we will be discussing at next week’s open Brainstorm event. There are <strike>500</strike> 290 seats left and seats can be reserved here: <a href=\"https://attendee.gotowebinar.com/register/5402452949014075905\">https://attendee.gotowebinar.com/register/5402452949014075905</a>. But whether you’re interested in the event or not, you should definitely read the piece linked above.</p><p>Western society is now dysgenic as well as dyscivic. This means it cannot survive in its current form. Regardless of how fervently you support concepts like women’s suffrage, equality, diversity, immigration and so forth, it is important to understand that, in the long term, you are choosing them over indoor plumbing, cheap and plentiful water, airplane travel, living wages, access to high-tech medical care, and reasonably full employment.</p><p>Believe or don’t believe that you are doing it, but that is exactly the choice you are making every single day. The fact that you can’t see the brick wall looming a few miles down the road does not mean it is not there.</p></div>",
  "content_text": "Roosh not only observes that\nnatural selection no longer applies\nto human evolution, but concludes that this indicates the inapplicability of the evo psyche model to human behavior:\nAnti-evolutionary behaviors should have been weeded out of the gene pool according to the idea of natural selection, but the more I looked around, the more I saw nothing but my own behavior, of people who were actually frightened to death about being a parent even though they were healthy and could afford to raise children. In fact, the sum of Western ideologies seem aimed to specifically halt human reproduction.\nWestern people are structuring their lives in deliberate ways to not reproduce at all and where their cherished hedonistic lifestyles would be greatly harmed if children entered the picture, and while it’s easy to use evolutionary theory in describing which man a woman chooses to have sex with, how can that possibly be correct if the man used condoms or the woman used birth control? Darwin’s theory refers to reproduction, not recreational sex and definitely not a prolonged period of sterile sport fucking, which has no benefit to the genes of the “athlete.” Having an explanation for why a girl on birth control went home with the “alpha male” after meeting him in the club has nothing to do with evolution or natural selection, since they both knew that no child would result and used the full force of their consciousness to prevent the creation of life. If reproduction was the purposefully blocked intent, evolution was not present during the sex event….\nWe must therefore conclude, with logic and rationale, that evolution is so flawed at explaining modern\nhuman reproductive\nbehavior (and not merely casual sex where reproduction was never the\nintent), that evolution is not an observable or correct principle for\nhuman beings living in Westernized nations. We must discard evolutionary\ntheory as applying to all humans through the mechanism of natural\nselection and begin a search for a new explanation that explains our\ncurrent biological behavior.\nEvolution may have been the correct theory for a window of human\nexistence, but that window has now closed and theories for\npost-evolutionary man, one in which there is no struggle for survival\nand where the strongest of the species are not reproducing, must be\ndevised.\nEven if we were to concede that we got here through the process of\nevolution from a primordial soup, and that our brains are the result of\nit, these brains are now in a modern environment which has tripwired,\nhijacked, or corrupted any applicable evolutionary program. We have\nbecome one with the plugged-in cosmopolitan borg, and that regardless of\nthe process that caused us to come about, that process is no longer in\neffect and a new process, yet to be described or understood, is\nmanifesting itself throughout humanity and shattering Darwin’s “survive\nand reproduce” model.\nI never bought into either the natural selection explanation for human evolution or the evo psych explanation for human behavior, but it is fascinating to see other high-caliber thinkers like Roosh who did beginning to reach similar conclusions.\nNeedless to say, this is one of the many topics we will be discussing at next week’s open Brainstorm event. There are\n500\n290 seats left and seats can be reserved here:\nhttps://attendee.gotowebinar.com/register/5402452949014075905\n. But whether you’re interested in the event or not, you should definitely read the piece linked above.\nWestern society is now dysgenic as well as dyscivic. This means it cannot survive in its current form. Regardless of how fervently you support concepts like women’s suffrage, equality, diversity, immigration and so forth, it is important to understand that, in the long term, you are choosing them over indoor plumbing, cheap and plentiful water, airplane travel, living wages, access to high-tech medical care, and reasonably full employment.\nBelieve or don’t believe that you are doing it, but that is exactly the choice you are making every single day. The fact that you can’t see the brick wall looming a few miles down the road does not mean it is not there.",
  "tags": [
    "decline and fall",
    "evolution"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-04T14:00:00+00:00"
}