{
  "url": "https://voxday.net/2015/06/18/sc-church-shootings/",
  "scraped_at": "2025-12-16T12:59:56.700382",
  "title": "SC church shootings",
  "date_display": "June 18, 2015",
  "date_iso": "2015-06-18T08:01:00+00:00",
  "date_from_url": "2015-06-18",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><blockquote class=\"tr_bq\"><p> Charleston Police Chief Greg Mullen says the FBI will be involved in<br> the investigation of a shooting at a historic black church that killed<br> nine and is being called a hate crime.</br></br></p><p>Mullen said the FBI would aid the investigation while speaking at a<br> news conference that was also attended by FBI Special Agent in Charge<br> David A. Thomas.House Minority Leader Todd Rutherford says that among those killed at<br> Emanuel AME Church was the church’s pastor, state Sen. Clementa<br> Pinckney.</br></br></br></br></p><p>Authorities are still searching for the shooter, who’s described as a white male in his early 20</p></blockquote><p>I wonder if it will still be called a hate crime if the shooter turns out to be a white atheist motivated by a hatred for Christianity or a Muslim bringing jihad to America? Then again, the fact that the shooter spared a woman and told her to “tell the world what happened” indicates that the police have additional information that has not been released to the public.</p><p>The reason I’m a little curious about the simple “white racist” theory is that as a general rule, most whites who hate blacks tend to prefer the gainfully employed, church-going blacks to the thugs and welfare queens, so these days, a church would seem to be a somewhat unusual target from that perspective.</p></div>",
  "content_text": "Charleston Police Chief Greg Mullen says the FBI will be involved in\nthe investigation of a shooting at a historic black church that killed\nnine and is being called a hate crime.\nMullen said the FBI would aid the investigation while speaking at a\nnews conference that was also attended by FBI Special Agent in Charge\nDavid A. Thomas.House Minority Leader Todd Rutherford says that among those killed at\nEmanuel AME Church was the church’s pastor, state Sen. Clementa\nPinckney.\nAuthorities are still searching for the shooter, who’s described as a white male in his early 20\nI wonder if it will still be called a hate crime if the shooter turns out to be a white atheist motivated by a hatred for Christianity or a Muslim bringing jihad to America? Then again, the fact that the shooter spared a woman and told her to “tell the world what happened” indicates that the police have additional information that has not been released to the public.\nThe reason I’m a little curious about the simple “white racist” theory is that as a general rule, most whites who hate blacks tend to prefer the gainfully employed, church-going blacks to the thugs and welfare queens, so these days, a church would seem to be a somewhat unusual target from that perspective.",
  "tags": [
    "Christianity",
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-18T07:01:00+00:00"
}