{
  "url": "https://voxday.net/2015/06/08/sf-war-to-knife/",
  "scraped_at": "2025-12-16T12:58:45.533998",
  "title": "SF war to the knife",
  "date_display": "June 8, 2015",
  "date_iso": "2015-06-08T15:50:00+00:00",
  "date_from_url": "2015-06-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>One would expect Peter Grant <a href=\"http://bayourenaissanceman.blogspot.com/2015/06/well-well-well.html\">to recognize one</a>:</p><blockquote class=\"tr_bq\"><p> I’ve had a couple of threatening e-mails from supporters of Ms. Gallo’s position, warning me that if I (and/or other indie authors) call for a boycott of Tor books, they’ll call for a boycott of my/our books in return.  This made me laugh out loud.  As those of you who’ve read my books will know, I don’t think I can be described as ‘progressive’ or ‘SJW’.  Heck, read the header of this blog – it’ll tell you in a nutshell my position on most things!  I have grave doubts whether readers of the progressive persuasion have ever bought my books – so why would a boycott from that part of the reading spectrum hold any fears for me?</p><p>No.  It’s becoming increasingly clear that the problem lies in the corporate culture that’s taken over at Tor Books and Tor.com.  Four individuals currently or previously associated with Tor’s management and publishing activities at a senior level have now made statements that I can only regard as biased beyond logical comprehension.  They are Patrick Nielsen Hayden (manager of science fiction books at Tor);  his wife Teresa Nielsen Hayden (listed by Wikipedia as a ‘consulting editor’ for Tor Books, and formerly a senior editor there – also the publisher of the well-known web log and forum ‘Making Light’);  Moshe Feder (also a consulting editor for Tor Books);  and Irene Gallo (Associate Publisher of Tor.com and Creative Director of Tor Books).  Certain Tor-published authors, primarily John Scalzi but also including others, have spouted the ‘party line’ in their support and/or on their own account as well.</p><p>There’s an old military saying when bad things happen:  “Once may be an accident.  Twice may be coincidence.  Three or more times is enemy action.”  In the same way, I could understand one senior Tor representative holding such views.  I might even accept two.  Four is too many.  This is not coincidence.  It’s concerted, organized, deliberate enemy action.  Tor as a publisher appears to either espouse, or tolerate (and actively encourage), views like this.  The utterances of these individuals appear to indicate that the company supports lies, slander, libel and viciousness as debating and/or promotional tactics.  I hope that the reality belies that appearance;  but that’s for Tor to say, not me – and back up their words with actions.  Weasel words will no longer be acceptable in any way, shape or form.</p><p>THIS CANNOT BE ALLOWED TO CONTINUE.</p></blockquote><p>It won’t be. Let them threaten. What are they going to do, continue to not buy books from Castalia House, from Baen, and from independents? Are they going to keep not reading what they repeatedly proclaim to be terribly written bad-to-reprehensible works without ever having read them? What are they going to do, have the Board vote me out of SFWA again? Are they going to continue not giving Nebulas to John Wright, and Sarah Hoyt, and Larry Correia, and Brad Torgersen? The reality is that we have the decisive advantage here because <i>we </i>have long supported <i>them</i>.</p><p>But we don’t have to.</p><p>I have can count dozens of Tor and Forge books on my bookshelves surrounding me, and that doesn’t count the bookshelves in the halls, in the bedrooms, and in the attic. But I don’t have to buy any more. Why should I, when the Senior Editor of Science Fiction at Tor has done nothing for me except insult and attack me <i>for ten years</i> now? <a href=\"http://cedarwrites.com/fear-and-loathing-at-tor/\">A lot of people are getting sick of their constant bullshit</a>, even people who have absolutely nothing to do with me in any way, shape, or form.</p><blockquote class=\"tr_bq\"><p> “I’m an author, involved with the publishing industry. Does that mean that I have the moral authority to point out to you that she is making actual, factually untrue statements here? She might be a really wonderful individual, in person, but her facts are dead wrong, bordering on libelous, and taking a position on a hotbutton issue really undercuts Tor’s credibility as a politically neutral, or even tolerant, business.”<br> – Jim Butcher, author, <i>The Dresden Files</i></br></p></blockquote><p>Apparently the bestselling and Hugo-nominated Mr. Butcher didn’t much appreciate being described as an author of “bad-to-reprehensible” books.</p><p>Back in April, Larry Correia and I, among others, encouraged everyone to leave Tor Books out of it. We made it clear that our problems were with certain individuals at Tor, not the organization itself. But as Peter Grant points out, Irene Gallo’s comments, to say nothing of Moshe Feder’s and John Scalzi’s (now that the organization has bet its future on him, Scalzi is relevant in this regard), appear to indicate that we were wrong and our problem is with the organization as it is presently comprised after all.</p><p>What do you think? I’m interested in hearing everyone’s arguments, pro and con.</p><p>UPDATE: I would certainly hope that they didn’t.</p><blockquote class=\"tr_bq\"><p> <a class=\"account-group js-account-group js-action-profile js-user-profile-link js-nav\" data-user-id=\"9340912\" href=\"https://twitter.com/torbooks\"><strong class=\"fullname js-action-profile-name show-popup-with-id\" data-aria-label-part=\"\">Tor Books</strong><br> ‏<s>@</s><b>torbooks</b><br> </br></br></a><br> <a class=\"tweet-timestamp js-permalink js-nav js-tooltip\" href=\"https://twitter.com/torbooks/status/607937578788986880\" title=\"1:49 PM - 8 Jun 2015\">2h2 hours ago</a><br/></br></p><div class=\"TweetTextSize TweetTextSize--16px js-tweet-text tweet-text\" data-aria-label-part=\"0\" lang=\"en\"> Happy Monday! We appreciate your comments &amp; would like to remind you that the views of our employees do not reflect those of the publisher.</div></blockquote><p></p></div>",
  "content_text": "One would expect Peter Grant\nto recognize one\n:\nI’ve had a couple of threatening e-mails from supporters of Ms. Gallo’s position, warning me that if I (and/or other indie authors) call for a boycott of Tor books, they’ll call for a boycott of my/our books in return.  This made me laugh out loud.  As those of you who’ve read my books will know, I don’t think I can be described as ‘progressive’ or ‘SJW’.  Heck, read the header of this blog – it’ll tell you in a nutshell my position on most things!  I have grave doubts whether readers of the progressive persuasion have ever bought my books – so why would a boycott from that part of the reading spectrum hold any fears for me?\nNo.  It’s becoming increasingly clear that the problem lies in the corporate culture that’s taken over at Tor Books and Tor.com.  Four individuals currently or previously associated with Tor’s management and publishing activities at a senior level have now made statements that I can only regard as biased beyond logical comprehension.  They are Patrick Nielsen Hayden (manager of science fiction books at Tor);  his wife Teresa Nielsen Hayden (listed by Wikipedia as a ‘consulting editor’ for Tor Books, and formerly a senior editor there – also the publisher of the well-known web log and forum ‘Making Light’);  Moshe Feder (also a consulting editor for Tor Books);  and Irene Gallo (Associate Publisher of Tor.com and Creative Director of Tor Books).  Certain Tor-published authors, primarily John Scalzi but also including others, have spouted the ‘party line’ in their support and/or on their own account as well.\nThere’s an old military saying when bad things happen:  “Once may be an accident.  Twice may be coincidence.  Three or more times is enemy action.”  In the same way, I could understand one senior Tor representative holding such views.  I might even accept two.  Four is too many.  This is not coincidence.  It’s concerted, organized, deliberate enemy action.  Tor as a publisher appears to either espouse, or tolerate (and actively encourage), views like this.  The utterances of these individuals appear to indicate that the company supports lies, slander, libel and viciousness as debating and/or promotional tactics.  I hope that the reality belies that appearance;  but that’s for Tor to say, not me – and back up their words with actions.  Weasel words will no longer be acceptable in any way, shape or form.\nTHIS CANNOT BE ALLOWED TO CONTINUE.\nIt won’t be. Let them threaten. What are they going to do, continue to not buy books from Castalia House, from Baen, and from independents? Are they going to keep not reading what they repeatedly proclaim to be terribly written bad-to-reprehensible works without ever having read them? What are they going to do, have the Board vote me out of SFWA again? Are they going to continue not giving Nebulas to John Wright, and Sarah Hoyt, and Larry Correia, and Brad Torgersen? The reality is that we have the decisive advantage here because\nwe\nhave long supported\nthem\n.\nBut we don’t have to.\nI have can count dozens of Tor and Forge books on my bookshelves surrounding me, and that doesn’t count the bookshelves in the halls, in the bedrooms, and in the attic. But I don’t have to buy any more. Why should I, when the Senior Editor of Science Fiction at Tor has done nothing for me except insult and attack me\nfor ten years\nnow?\nA lot of people are getting sick of their constant bullshit\n, even people who have absolutely nothing to do with me in any way, shape, or form.\n“I’m an author, involved with the publishing industry. Does that mean that I have the moral authority to point out to you that she is making actual, factually untrue statements here? She might be a really wonderful individual, in person, but her facts are dead wrong, bordering on libelous, and taking a position on a hotbutton issue really undercuts Tor’s credibility as a politically neutral, or even tolerant, business.”\n– Jim Butcher, author,\nThe Dresden Files\nApparently the bestselling and Hugo-nominated Mr. Butcher didn’t much appreciate being described as an author of “bad-to-reprehensible” books.\nBack in April, Larry Correia and I, among others, encouraged everyone to leave Tor Books out of it. We made it clear that our problems were with certain individuals at Tor, not the organization itself. But as Peter Grant points out, Irene Gallo’s comments, to say nothing of Moshe Feder’s and John Scalzi’s (now that the organization has bet its future on him, Scalzi is relevant in this regard), appear to indicate that we were wrong and our problem is with the organization as it is presently comprised after all.\nWhat do you think? I’m interested in hearing everyone’s arguments, pro and con.\nUPDATE: I would certainly hope that they didn’t.\nTor Books\n‏\n@\ntorbooks\n2h2 hours ago\nHappy Monday! We appreciate your comments & would like to remind you that the views of our employees do not reflect those of the publisher.",
  "tags": [
    "Hugo Award",
    "Pink SF"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-08T14:50:00+00:00"
}