{
  "url": "https://voxday.net/2015/06/05/shelving-aristotle/",
  "scraped_at": "2025-12-16T12:58:27.128024",
  "title": "Shelving Aristotle",
  "date_display": "June 5, 2015",
  "date_iso": "2015-06-05T19:00:00+00:00",
  "date_from_url": "2015-06-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Now the SJWs are openly <a href=\"http://file770.com/?p=22915&amp;cpage=8#comment-275497\">coming out against Aristotle’s logic</a> at File 770:</p><blockquote class=\"tr_bq\"><p> <b>Stevie on June 4, 2015 at 6:21 pm said:</b><br> Incidentally, had not Athens been Lords of the Sea then we not have their Golden Age. We would not have the works of Aristotle. For one brief moment I thought wistfully of what an improvement this would be, but came down on the side of sanity….</br></p><p><b>Chris Hensley on June 4, 2015 at 6:26 pm said:</b><br> The works of Aristotle are important. Much of it has been replaced by<br> better knowledge, but we wouldn’t have that knowledge was still built<br> upon Aristotle. It is time that his logic be put upon the shelf next to<br> his physics.</br></br></br></br></p></blockquote><p>One thing that is readily apparent is that they very much resent how we have correctly identified them as rhetoricals incapable of rational dialectic and ruled by their feelbads rather than reason. Consider exactly <a href=\"http://plato.stanford.edu/entries/aristotle-logic/\">what it is</a> that they are rejecting. They are rejecting logic for fantasy because they cannot be instructed by information, they are only guided by emotion.</p><p>They are, quite literally, irrational. And in the SJWs always lie department, there is this:</p><blockquote class=\"tr_bq\"><p> <b>Dex on June 5, 2015 at 6:20 am said:  </b><br> I think this, more than anything, is the accurate way to approach<br> characters like VD. The man is a grifter. For all the outrage he<br> manufactures, it appeals to a fringe group that flocks to him and is<br> happy to throw money his way so long as he seems to be fighting the good<br> fight. The entire Hugo situation is nothing but a scam for him to earn<br> the publicity that his talent can’t, and entice a small group of<br> hardcore followers to financially support him. It’s Alex Jones without<br> the audience. I have no doubt that within six months, his publishing<br> house will include links to buying gold coins, Prepper food packs and<br> herbal cures to diabetes.</br></br></br></br></br></br></br></br></br></br></p></blockquote><p>It’s interesting that he makes such claims, in light of the email I received just two hours ago from the company with whom I tried an advertising experiment about two years ago.</p><p><i>We’ve been working with you some time ago and I believe we can make a good partnership again. Since last time we worked we have grown up a lot and made a lot of improvements for our publishers. Get back to me if you are interested and I will help you to resume a campaign according to your needs.</i></p><p>Anyone want to see those ads for celebrity feet again? I certainly don’t, so I politely declined. It’s a strange sort of grifter who turns down over $1k in advertising money per month just because I prefer to not annoy my readers. And considering that I have written more than 500 columns and 15,000 blog posts, and Castalia has given away over 32,000 free books in the last 18 months, I daresay I’ve provided more free content than anyone else in the entire science fiction field in recent years. Even Brainstorm has a not insubstantial free component to it.</p><p>That being said, I very appreciate the willingness of my hardcore supporters to support me and Castalia House. And because I appreciate it, I try to make sure that every time anyone pays for anything, they feel they are receiving substantive subjective value.</p></div>",
  "content_text": "Now the SJWs are openly\ncoming out against Aristotle’s logic\nat File 770:\nStevie on June 4, 2015 at 6:21 pm said:\nIncidentally, had not Athens been Lords of the Sea then we not have their Golden Age. We would not have the works of Aristotle. For one brief moment I thought wistfully of what an improvement this would be, but came down on the side of sanity….\nChris Hensley on June 4, 2015 at 6:26 pm said:\nThe works of Aristotle are important. Much of it has been replaced by\nbetter knowledge, but we wouldn’t have that knowledge was still built\nupon Aristotle. It is time that his logic be put upon the shelf next to\nhis physics.\nOne thing that is readily apparent is that they very much resent how we have correctly identified them as rhetoricals incapable of rational dialectic and ruled by their feelbads rather than reason. Consider exactly\nwhat it is\nthat they are rejecting. They are rejecting logic for fantasy because they cannot be instructed by information, they are only guided by emotion.\nThey are, quite literally, irrational. And in the SJWs always lie department, there is this:\nDex on June 5, 2015 at 6:20 am said:\nI think this, more than anything, is the accurate way to approach\ncharacters like VD. The man is a grifter. For all the outrage he\nmanufactures, it appeals to a fringe group that flocks to him and is\nhappy to throw money his way so long as he seems to be fighting the good\nfight. The entire Hugo situation is nothing but a scam for him to earn\nthe publicity that his talent can’t, and entice a small group of\nhardcore followers to financially support him. It’s Alex Jones without\nthe audience. I have no doubt that within six months, his publishing\nhouse will include links to buying gold coins, Prepper food packs and\nherbal cures to diabetes.\nIt’s interesting that he makes such claims, in light of the email I received just two hours ago from the company with whom I tried an advertising experiment about two years ago.\nWe’ve been working with you some time ago and I believe we can make a good partnership again. Since last time we worked we have grown up a lot and made a lot of improvements for our publishers. Get back to me if you are interested and I will help you to resume a campaign according to your needs.\nAnyone want to see those ads for celebrity feet again? I certainly don’t, so I politely declined. It’s a strange sort of grifter who turns down over $1k in advertising money per month just because I prefer to not annoy my readers. And considering that I have written more than 500 columns and 15,000 blog posts, and Castalia has given away over 32,000 free books in the last 18 months, I daresay I’ve provided more free content than anyone else in the entire science fiction field in recent years. Even Brainstorm has a not insubstantial free component to it.\nThat being said, I very appreciate the willingness of my hardcore supporters to support me and Castalia House. And because I appreciate it, I try to make sure that every time anyone pays for anything, they feel they are receiving substantive subjective value.",
  "tags": [
    "philosophy",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-05T18:00:00+00:00"
}