{
  "url": "https://voxday.net/2015/06/15/sjws-respond/",
  "scraped_at": "2025-12-16T12:59:40.942394",
  "title": "SJWs respond",
  "date_display": "June 15, 2015",
  "date_iso": "2015-06-15T18:00:00+00:00",
  "date_from_url": "2015-06-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Chris S on June 15, 2015 at 6:42 am said:</p><blockquote class=\"tr_bq\"><p> I’ve emailed the poor sods over at Tor. Spoiler: it’s probably not what VD wanted me to say. I did ask them to reconsider their relationship with JCW when the current contract ends.</p><p> [18 minutes later, he added this.] <br> I did say Irene Gallo’s comments were intemperate, and the use of “neo-nazi” wasn’t justified. It was also in a comment to a Facebook post. But JCW’s continuous spewing of homophobia and misogyny is utterly beyond the pale. It’s not just an offhand comment, it is continuous, on his blog, in his writing, and in his interactions with, well, just about anyone. He also hasn’t apologized for anything he said.</br></p><p>The two are not remotely comparable, in my mind.</p></blockquote><p>In other words, he believes that Tor Books should police its various authors’ <i>opinions</i>, but should not hold its employees responsible for <i>direct attacks on the quality of its own books</i> and on the character of its customers. <a href=\"http://i.stack.imgur.com/jiFfM.jpg\">Fascinating</a>.</p><p>And George Rape Rape Martin is concerned, deeply concerned, about the wounds that are being inflicted in this, the most savage civil war in the history of science fiction. RapeSquared was so upset this morning that it put him off writing his daily rape scene, which was a pity as he had a real corker in mind involving Sansa Stark, Wun Wun the giant, four dire wolves, a Wildling wight, and Hodor being warged by Bran Stark.</p><blockquote class=\"tr_bq\"><p> By now, everyone has bruises. And I fear we will all have more by the time this is done. Did you really think fandom was going to lie back and thank you for gaming the Hugo awards and pissing on fifty years of tradition?</p><p>A writer of my acquaintance, older and wiser than myself, has told me that this is worst fight he has ever seen, the nastiest and most divisive war in the long history of our field. Worse than the Exclusion Act. Worse than the Cosmic Circle crap. Worse than the Breendoggle, than the Old Wave/ New Wave struggle, than the competing Vietnam War ads. The wounds will take a long time healing… if indeed they ever heal.</p></blockquote><p>Bruises? Healing? I expect a set of twelve silvered SJW skulls for my dinner table by the time this is over. My dear George, I have had Patrick Nielsen Hayden and the Toad of Tor taking shots at me for 10 years now. I put up with moronic SJWs telling lies about me for <i>years </i>before I finally bothered to do something about it. You think this is war? We’ve barely finished warming up. It’s only been three months since the Hugo shortlist was announced. It will be another 9 years and 9 months of <i>us </i>taking shots at <i>you </i>before we can even begin to consider calling it even.</p><p>That reminds me, I still haven’t seen a single person apologize for falsely accusing me of gaming the awards last year. I’m not holding my breath on that one.</p><p>Finally, Tintinaus demonstrates why the SJWs keep miscalculating in such an amusingly inept manner. I can’t decide if they are simply innumerate or if their devotion to The Narrative renders basic mathematics inoperative in the event of a contradiction.</p><blockquote class=\"tr_bq\"><p> From memory Beale said the reason why he was so late in reading TBP was publishers had stopped sending him review copies. He then went on to point out since his blog gets more traffic than Scalzi’s they were cutting their own throats. Of course he used his site figures for April where most of the traffic was people going to check out his slate post after the nominations announcement.</p></blockquote><p>Most of the traffic? Now it’s true, there was a nice traffic increase in April, from 1,583,104 in March to 1,907,664. It slipped back a bit to 1,737,320 in May, and should be right around there again in June. Meanwhile, Scalzi’s best-ever traffic month was 1,027,644 in May 2012, thanks to numerous sites linking his “Easiest Difficulty Setting” post. I’ve averaged more monthly traffic than Scalzi ever had for 26 straight months now. It’s not even close.</p><p>I find it amusing that the SJWs keep looking at #Gamergate, or bot-nets, or anything besides what Occam’s Razor dictates. But their problem is that it’s not just me that they’re facing, it’s the Dread Ilk, the Ilk, the Sad Puppies, the Rabid Puppies, and the Evil Legion of Evil. And, most terrible of all, the <i>Vile Faceless Minions</i>.</p></div>",
  "content_text": "Chris S on June 15, 2015 at 6:42 am said:\nI’ve emailed the poor sods over at Tor. Spoiler: it’s probably not what VD wanted me to say. I did ask them to reconsider their relationship with JCW when the current contract ends.\n[18 minutes later, he added this.]\nI did say Irene Gallo’s comments were intemperate, and the use of “neo-nazi” wasn’t justified. It was also in a comment to a Facebook post. But JCW’s continuous spewing of homophobia and misogyny is utterly beyond the pale. It’s not just an offhand comment, it is continuous, on his blog, in his writing, and in his interactions with, well, just about anyone. He also hasn’t apologized for anything he said.\nThe two are not remotely comparable, in my mind.\nIn other words, he believes that Tor Books should police its various authors’\nopinions\n, but should not hold its employees responsible for\ndirect attacks on the quality of its own books\nand on the character of its customers.\nFascinating\n.\nAnd George Rape Rape Martin is concerned, deeply concerned, about the wounds that are being inflicted in this, the most savage civil war in the history of science fiction. RapeSquared was so upset this morning that it put him off writing his daily rape scene, which was a pity as he had a real corker in mind involving Sansa Stark, Wun Wun the giant, four dire wolves, a Wildling wight, and Hodor being warged by Bran Stark.\nBy now, everyone has bruises. And I fear we will all have more by the time this is done. Did you really think fandom was going to lie back and thank you for gaming the Hugo awards and pissing on fifty years of tradition?\nA writer of my acquaintance, older and wiser than myself, has told me that this is worst fight he has ever seen, the nastiest and most divisive war in the long history of our field. Worse than the Exclusion Act. Worse than the Cosmic Circle crap. Worse than the Breendoggle, than the Old Wave/ New Wave struggle, than the competing Vietnam War ads. The wounds will take a long time healing… if indeed they ever heal.\nBruises? Healing? I expect a set of twelve silvered SJW skulls for my dinner table by the time this is over. My dear George, I have had Patrick Nielsen Hayden and the Toad of Tor taking shots at me for 10 years now. I put up with moronic SJWs telling lies about me for\nyears\nbefore I finally bothered to do something about it. You think this is war? We’ve barely finished warming up. It’s only been three months since the Hugo shortlist was announced. It will be another 9 years and 9 months of\nus\ntaking shots at\nyou\nbefore we can even begin to consider calling it even.\nThat reminds me, I still haven’t seen a single person apologize for falsely accusing me of gaming the awards last year. I’m not holding my breath on that one.\nFinally, Tintinaus demonstrates why the SJWs keep miscalculating in such an amusingly inept manner. I can’t decide if they are simply innumerate or if their devotion to The Narrative renders basic mathematics inoperative in the event of a contradiction.\nFrom memory Beale said the reason why he was so late in reading TBP was publishers had stopped sending him review copies. He then went on to point out since his blog gets more traffic than Scalzi’s they were cutting their own throats. Of course he used his site figures for April where most of the traffic was people going to check out his slate post after the nominations announcement.\nMost of the traffic? Now it’s true, there was a nice traffic increase in April, from 1,583,104 in March to 1,907,664. It slipped back a bit to 1,737,320 in May, and should be right around there again in June. Meanwhile, Scalzi’s best-ever traffic month was 1,027,644 in May 2012, thanks to numerous sites linking his “Easiest Difficulty Setting” post. I’ve averaged more monthly traffic than Scalzi ever had for 26 straight months now. It’s not even close.\nI find it amusing that the SJWs keep looking at #Gamergate, or bot-nets, or anything besides what Occam’s Razor dictates. But their problem is that it’s not just me that they’re facing, it’s the Dread Ilk, the Ilk, the Sad Puppies, the Rabid Puppies, and the Evil Legion of Evil. And, most terrible of all, the\nVile Faceless Minions\n.",
  "tags": [
    "Puppies",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-15T17:00:00+00:00"
}