{
  "url": "https://voxday.net/2015/06/19/so-very-unconcerned/",
  "scraped_at": "2025-12-16T13:00:07.588251",
  "title": "So very unconcerned",
  "date_display": "June 19, 2015",
  "date_iso": "2015-06-19T14:30:00+00:00",
  "date_from_url": "2015-06-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The First Law of the Social Justice Warrior: <i>SJWs always lie.</i></p><p>The Second Law of the Social Justice Warrior: <i>SJWs always double down. </i></p><p>As you’d expect, both of these things are seriously in effect in the Gallo affair. The latest SJW incoherence is this:</p><ol><li>Mocking the prospective boycott of Tor Books as being numerically trivial and ineffective.</li><li>Declaring that they are buying books published by Tor Books today in order to preemptively counteract the effects of that trivial and ineffective boycott.</li></ol><p>Based on their actions, the SJWs are just a little more concerned about it than they affect. <i>Quelle surprise.</i> The fact is that I don’t know how effective a boycott of Tor Books will be. I don’t know if it will inspire Macmillan to actually pay attention to the unprofessional behavior of the senior employees at their subsidiary. The point is that I am simply not going to support an organization that employs an individual who so openly hates me, my readers, and various authors that I support, and who publicly lies about us.</p><p>The organization is certainly free to ignore me and continue to not sell books to me. The organization is absolutely free to employ anyone they like, including ludicrously unprofessional people who can’t even bother to disguise their hatred for all of their customers to the right of Bernie Sanders. I can’t dictate anyone’s actions but my own.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://1.bp.blogspot.com/-hxCfc9TOlYo/VYU2eQFxn8I/AAAAAAAABUY/Msru2dLzCc0/s1600/VP_1M_views.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/06/VP_1M_views.jpg\" width=\"248\"/></a></div><p>Even so, it appears there are either an awful lot of people who are interested in my actions today or just a few SJWs who are concerned enough to launch a DDOS attack to try to disrupt the anticipated announcement this afternoon. This is a screen shot of the current Sitemeter traffic at VP as of 10:15 AM this morning. I suppose it could be a Sitemeter bug, but I find the timing rather suspicious, especially considering that AG’s sitemeter is operating normally and the Google traffic is indicating normal traffic of between 45-50k pageviews today. My guess is that it’s an attack being deflected by Google somewhere between Sitemeter picking it up and it interfering with Blogger’s operations. But regardless, UP TO ONE MILLION DAILY PAGEVIEWS isn’t bad.</p><p></p><div class=\"separator\" style=\"clear: both; text-align: center;\"></div></div>",
  "content_text": "The First Law of the Social Justice Warrior:\nSJWs always lie.\nThe Second Law of the Social Justice Warrior:\nSJWs always double down.\nAs you’d expect, both of these things are seriously in effect in the Gallo affair. The latest SJW incoherence is this:\nMocking the prospective boycott of Tor Books as being numerically trivial and ineffective.\nDeclaring that they are buying books published by Tor Books today in order to preemptively counteract the effects of that trivial and ineffective boycott.\nBased on their actions, the SJWs are just a little more concerned about it than they affect.\nQuelle surprise.\nThe fact is that I don’t know how effective a boycott of Tor Books will be. I don’t know if it will inspire Macmillan to actually pay attention to the unprofessional behavior of the senior employees at their subsidiary. The point is that I am simply not going to support an organization that employs an individual who so openly hates me, my readers, and various authors that I support, and who publicly lies about us.\nThe organization is certainly free to ignore me and continue to not sell books to me. The organization is absolutely free to employ anyone they like, including ludicrously unprofessional people who can’t even bother to disguise their hatred for all of their customers to the right of Bernie Sanders. I can’t dictate anyone’s actions but my own.\nEven so, it appears there are either an awful lot of people who are interested in my actions today or just a few SJWs who are concerned enough to launch a DDOS attack to try to disrupt the anticipated announcement this afternoon. This is a screen shot of the current Sitemeter traffic at VP as of 10:15 AM this morning. I suppose it could be a Sitemeter bug, but I find the timing rather suspicious, especially considering that AG’s sitemeter is operating normally and the Google traffic is indicating normal traffic of between 45-50k pageviews today. My guess is that it’s an attack being deflected by Google somewhere between Sitemeter picking it up and it interfering with Blogger’s operations. But regardless, UP TO ONE MILLION DAILY PAGEVIEWS isn’t bad.",
  "tags": [
    "Puppies",
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-19T13:30:00+00:00"
}