{
  "url": "https://voxday.net/2015/06/08/the-devils-own/",
  "scraped_at": "2025-12-16T12:58:41.872945",
  "title": "The Devil’s own",
  "date_display": "June 8, 2015",
  "date_iso": "2015-06-08T08:44:00+00:00",
  "date_from_url": "2015-06-08",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s not at all hard to understand why Phil Sandifer so dislikes “One Bright Star to Guide Them”. Indeed, the strength of his distaste for it is a testimony to its depth and power, to say nothing of its appeal to Friends of Narnia, as can be seen in this exchange that took place outside the actual literary debate.</p><blockquote class=\"tr_bq\"><p> PS: From my perspective, this is the most basic disagreement that exists between Vox and me. Both Vox and I look at the problem of the world being far more complex than even an extremely intelligent person like ourselves can hope to fully understand. Vox’s reaction is to give complete trust to an unknowable higher being with the capacity for full and total understanding of the world. Mine is to instead try to fully understand my experience of the world, a task that is still staggeringly difficult, but at least feels accomplishable within the scope of a human lifetime and intellect.</p><p>I view his approach as a horrifying act of submission to an authority that is at best imaginary and at worst illegitimate. He views mine as nihilistic solipsism.</p><p><b>VD: I think you need to revise that. At best imaginary, at worst legitimate. Your biggest concern isn’t that God exists and His authority is not legitimate. It’s that He exists and it is.</b></p><p>PS: That’s actually not a concern of mine, although we should be precise here and distinguish between his authority and his power. I am profoundly concerned that your god exists and wields the power you describe. It is literally my greatest existential fear; a terror that has genuinely kept me up at night, because in the event that it is true I am knowingly signing myself up for an eternity of torment that goes beyond anything I am capable of imagining.</p><p>I have no concern whatsoever that his authority is legitimate, however. It is not, at least over what I understand to be me, Philip Sandifer. The self that I am solipsistically invested in has an independent consciousness from your god. I am but a sinner, cast out into a material world and fundamentally separated from your god. But where you view my sin as my imprisonment in a lowly, materialist prison, I view it as my freedom from the tyrant you choose to serve.</p><p>To misquote Blake, I am of the devil’s party and know it.</p></blockquote><p>It is not uncommon for people to ask me why I treat atheists, particularly those of the militant or evangelical variety, with such open contempt. The reason is very simple. The only way they can be reached, the only way they can even <i>begin</i> thinking rationally about Christianity instead of thoughtlessly reacting to it, is for their pride to be broken first. Since their pride tends to revolve around their intelligence, it usually requires a higher intelligence to break it and I happen to be reasonably well-equipped in that regard.</p><p>It’s not knowledge that keeps men like Phil from submitting to the Most High, to the Creator God of the Universe, it is pride in the independent consciousness that they possess as a gift from the very tyrant they refuse to serve. As an arrogant man myself, I recognize that fierce and independent pride when I see it. I even admire it, to a certain extent. But I also know its futility, and worse, its sheer pointlessness.</p><p>Does the jar demand the potter admire its beauty? Is the jar foolish enough to be proud of its existence separate from the very mind that conceived it, the very hands that shaped it and brought it into being? Does the jar so lack perception that it fails to grasp it can be unmade as easily as it was made by its maker?</p><p>In what, O jar, is your petty pride?</p><p>How strange it is that those who refuse to grovel before God so readily bow before other men and genuflect before some of the most foolish ideas of Man ever conceived. And how pointless, when we know that one day every knee will bow, and every tongue will confess, that Jesus Christ is Lord. Serve freely or defy as you see fit, because every path leads to the same destination, submission before the Almighty.</p></div>",
  "content_text": "It’s not at all hard to understand why Phil Sandifer so dislikes “One Bright Star to Guide Them”. Indeed, the strength of his distaste for it is a testimony to its depth and power, to say nothing of its appeal to Friends of Narnia, as can be seen in this exchange that took place outside the actual literary debate.\nPS: From my perspective, this is the most basic disagreement that exists between Vox and me. Both Vox and I look at the problem of the world being far more complex than even an extremely intelligent person like ourselves can hope to fully understand. Vox’s reaction is to give complete trust to an unknowable higher being with the capacity for full and total understanding of the world. Mine is to instead try to fully understand my experience of the world, a task that is still staggeringly difficult, but at least feels accomplishable within the scope of a human lifetime and intellect.\nI view his approach as a horrifying act of submission to an authority that is at best imaginary and at worst illegitimate. He views mine as nihilistic solipsism.\nVD: I think you need to revise that. At best imaginary, at worst legitimate. Your biggest concern isn’t that God exists and His authority is not legitimate. It’s that He exists and it is.\nPS: That’s actually not a concern of mine, although we should be precise here and distinguish between his authority and his power. I am profoundly concerned that your god exists and wields the power you describe. It is literally my greatest existential fear; a terror that has genuinely kept me up at night, because in the event that it is true I am knowingly signing myself up for an eternity of torment that goes beyond anything I am capable of imagining.\nI have no concern whatsoever that his authority is legitimate, however. It is not, at least over what I understand to be me, Philip Sandifer. The self that I am solipsistically invested in has an independent consciousness from your god. I am but a sinner, cast out into a material world and fundamentally separated from your god. But where you view my sin as my imprisonment in a lowly, materialist prison, I view it as my freedom from the tyrant you choose to serve.\nTo misquote Blake, I am of the devil’s party and know it.\nIt is not uncommon for people to ask me why I treat atheists, particularly those of the militant or evangelical variety, with such open contempt. The reason is very simple. The only way they can be reached, the only way they can even\nbegin\nthinking rationally about Christianity instead of thoughtlessly reacting to it, is for their pride to be broken first. Since their pride tends to revolve around their intelligence, it usually requires a higher intelligence to break it and I happen to be reasonably well-equipped in that regard.\nIt’s not knowledge that keeps men like Phil from submitting to the Most High, to the Creator God of the Universe, it is pride in the independent consciousness that they possess as a gift from the very tyrant they refuse to serve. As an arrogant man myself, I recognize that fierce and independent pride when I see it. I even admire it, to a certain extent. But I also know its futility, and worse, its sheer pointlessness.\nDoes the jar demand the potter admire its beauty? Is the jar foolish enough to be proud of its existence separate from the very mind that conceived it, the very hands that shaped it and brought it into being? Does the jar so lack perception that it fails to grasp it can be unmade as easily as it was made by its maker?\nIn what, O jar, is your petty pride?\nHow strange it is that those who refuse to grovel before God so readily bow before other men and genuflect before some of the most foolish ideas of Man ever conceived. And how pointless, when we know that one day every knee will bow, and every tongue will confess, that Jesus Christ is Lord. Serve freely or defy as you see fit, because every path leads to the same destination, submission before the Almighty.",
  "tags": [
    "Christianity"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-08T07:44:00+00:00"
}