{
  "url": "https://voxday.net/2015/06/09/the-rules-of-game/",
  "scraped_at": "2025-12-16T12:58:51.088517",
  "title": "The rules of the game",
  "date_display": "June 9, 2015",
  "date_iso": "2015-06-09T11:18:00+00:00",
  "date_from_url": "2015-06-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>VFM 0007 illustrates why the Supreme Dark Lord does not leave the philosophizing to his minions:</p><blockquote class=\"tr_bq\"><p> I’m not entirely at ease with this. It doesn’t seem just to demand that she be fired for her personal opinions. Would someone explain how it is, please?</p></blockquote><p>The rules of the game of Cultural War, as defined by the SJWs, is that when a member of the other side is foolish enough to overstep the current PR bounds, their employment is a legitimate target. See: Brandon Eich. Or see: every attempt to DISQUALIFY and expel and blackball and disassociate me for the last ten years. Remember that a single tweeted link to a measured <i>response </i>to a vile personal attack was all it took justify the SFWA witch hunt against me, a witch hunt in which Tor Books Senior Editor and Manager of Science Fiction Patrick Nielsen Hayden not only participated, but <i>co-orchestrated</i>. Note the dates below.</p><p>John Scalzi @scalzi<br> I just renewed my @sfwa membership!<br> 2:18 PM – 14 Aug 2013</br></br></p><p>P Nielsen Hayden ‏@pnh Aug 14<br> @scalzi So did I! What a coincidence! @sfwa</br></p><p>If a CEO can lose his job for donating to a successful political campaign in the past, an Associate Publisher can, and should, lose her job for attacking her publishing house’s own authors and customers. That is not only just, it is entirely fair play. It doesn’t matter if Gallo apologizes or not. Eich apologized even though he did nothing wrong and he was still pressured into resigning.</p><p>Gallo issued an unapology under pressure from her employer and she will probably end up issuing another one before she eventually resigns. Unless, of course. Mr. Doherty or someone higher up the chain finally does what should have been done yesterday and fires her. If someone at Castalia House were ever to attack our authors or customers in that way, they wouldn’t even be given the chance to apologize. They would be fired on the spot. Do not pass go, do not collect $200, go directly out the door. The fact that neither Mr. Doherty nor Mr. Patrick Nielsen Hayden saw fit to fire Ms Gallo for cause speaks volumes about where their priorities are.</p><p>Those priorities, of course, are their prerogative. Unlike Tor Books, everyone at Castalia House, from our volunteers to our Publisher, respects and values our authors. We value every single one of them, even those with whom we inevitably disagree on one issue or another. We value our customers as well, and as those who have had the occasional problem with getting their books delivered know, we go out of our way to take care of them even if the problem is on their end.</p><p>The idea of actually <i>attacking </i>them is the polar opposite of our attitude towards our customers. Without our customers, we not only don’t exist, we have no <i>reason </i>to exist. Tor Books appears to have forgotten that.</p><p>Stephen Ashby is nevertheless dubious:</p><blockquote class=\"tr_bq\"><p> You expect a resignation? I can see why you want one, but I don’t see what would lead you to expect it. Personally I expect Tor will simply pretend the matter is dealt with, and if you don’t accept that then they will claim you’re the one being unreasonable.</p></blockquote><p>Absolutely. I expect one because I don’t believe Tom Doherty or Patrick Nielsen Hayden are entirely stupid. If they don’t accept her resignation soon, then I expect Macmillan, who I don’t believe to be stupid in any way, shape, or form, to not only fire Gallo but also remove those executives who have been derelict in their management duties.</p><p>The further away one is from the cultural battle in SF/F, the more totally inexcusable Gallo’s behavior appears. Especially from the purely corporate perspective. Not only was Ms Gallo’s attitude and statement in direct conflict with the Macmillan Code of Conduct, it is is direct conflict with one of the most basic rules of business: cherish your customers and treat them with care and respect.</p><p>Many of us are waiting to see how Tor is going to respond. If Mr. Doherty thinks his initial statement is sufficient to conclude the matter, <a href=\"http://bayourenaissanceman.blogspot.com/2015/06/an-open-letter-to-tom-doherty-of-tor.html\">he is woefully mistaken</a>. If no further action is forthcoming I expect that more than a few people, myself included, will be publicly endorsing the boycott for which some writers and SF readers have already called.</p><blockquote class=\"tr_bq\"><p> Mr. Doherty, with the greatest possible respect to you as an individual:  until Tor publicly dissociates itself from the outrageous positions taken by the individuals I have named (all of them), publicly rebukes those concerned, and takes steps to make sure that no such statements are ever again made by senior members of the company, I shall be unable to believe any assurances that their views are not those of Tor.  Actions speak louder than words – and so does the absence of actions.  All Tor has offered is words.  It’s time for actions.  What is Tor going to, not say, but DO about the situation? – because unless and until it does the right thing, others are going to do what they believe to be necessary and appropriate under the circumstances.</p><p>There is very little time left to address these issues before this situation gets out of control.  For the sake of all of us in the SF/F community, I hope Tor uses it wisely.</p></blockquote><p>You can leave your own comments on Mr. Doherty’s statement <a href=\"http://www.tor.com/2015/06/08/a-message-from-tom-doherty-to-our-readers-and-authors/\">at Tor.com</a>. And speaking of management duties… Malwyn? It appears #7 wants further instruction in the art of proper minionhood.</p></div>",
  "content_text": "VFM 0007 illustrates why the Supreme Dark Lord does not leave the philosophizing to his minions:\nI’m not entirely at ease with this. It doesn’t seem just to demand that she be fired for her personal opinions. Would someone explain how it is, please?\nThe rules of the game of Cultural War, as defined by the SJWs, is that when a member of the other side is foolish enough to overstep the current PR bounds, their employment is a legitimate target. See: Brandon Eich. Or see: every attempt to DISQUALIFY and expel and blackball and disassociate me for the last ten years. Remember that a single tweeted link to a measured\nresponse\nto a vile personal attack was all it took justify the SFWA witch hunt against me, a witch hunt in which Tor Books Senior Editor and Manager of Science Fiction Patrick Nielsen Hayden not only participated, but\nco-orchestrated\n. Note the dates below.\nJohn Scalzi @scalzi\nI just renewed my @sfwa membership!\n2:18 PM – 14 Aug 2013\nP Nielsen Hayden ‏@pnh Aug 14\n@scalzi So did I! What a coincidence! @sfwa\nIf a CEO can lose his job for donating to a successful political campaign in the past, an Associate Publisher can, and should, lose her job for attacking her publishing house’s own authors and customers. That is not only just, it is entirely fair play. It doesn’t matter if Gallo apologizes or not. Eich apologized even though he did nothing wrong and he was still pressured into resigning.\nGallo issued an unapology under pressure from her employer and she will probably end up issuing another one before she eventually resigns. Unless, of course. Mr. Doherty or someone higher up the chain finally does what should have been done yesterday and fires her. If someone at Castalia House were ever to attack our authors or customers in that way, they wouldn’t even be given the chance to apologize. They would be fired on the spot. Do not pass go, do not collect $200, go directly out the door. The fact that neither Mr. Doherty nor Mr. Patrick Nielsen Hayden saw fit to fire Ms Gallo for cause speaks volumes about where their priorities are.\nThose priorities, of course, are their prerogative. Unlike Tor Books, everyone at Castalia House, from our volunteers to our Publisher, respects and values our authors. We value every single one of them, even those with whom we inevitably disagree on one issue or another. We value our customers as well, and as those who have had the occasional problem with getting their books delivered know, we go out of our way to take care of them even if the problem is on their end.\nThe idea of actually\nattacking\nthem is the polar opposite of our attitude towards our customers. Without our customers, we not only don’t exist, we have no\nreason\nto exist. Tor Books appears to have forgotten that.\nStephen Ashby is nevertheless dubious:\nYou expect a resignation? I can see why you want one, but I don’t see what would lead you to expect it. Personally I expect Tor will simply pretend the matter is dealt with, and if you don’t accept that then they will claim you’re the one being unreasonable.\nAbsolutely. I expect one because I don’t believe Tom Doherty or Patrick Nielsen Hayden are entirely stupid. If they don’t accept her resignation soon, then I expect Macmillan, who I don’t believe to be stupid in any way, shape, or form, to not only fire Gallo but also remove those executives who have been derelict in their management duties.\nThe further away one is from the cultural battle in SF/F, the more totally inexcusable Gallo’s behavior appears. Especially from the purely corporate perspective. Not only was Ms Gallo’s attitude and statement in direct conflict with the Macmillan Code of Conduct, it is is direct conflict with one of the most basic rules of business: cherish your customers and treat them with care and respect.\nMany of us are waiting to see how Tor is going to respond. If Mr. Doherty thinks his initial statement is sufficient to conclude the matter,\nhe is woefully mistaken\n. If no further action is forthcoming I expect that more than a few people, myself included, will be publicly endorsing the boycott for which some writers and SF readers have already called.\nMr. Doherty, with the greatest possible respect to you as an individual:  until Tor publicly dissociates itself from the outrageous positions taken by the individuals I have named (all of them), publicly rebukes those concerned, and takes steps to make sure that no such statements are ever again made by senior members of the company, I shall be unable to believe any assurances that their views are not those of Tor.  Actions speak louder than words – and so does the absence of actions.  All Tor has offered is words.  It’s time for actions.  What is Tor going to, not say, but DO about the situation? – because unless and until it does the right thing, others are going to do what they believe to be necessary and appropriate under the circumstances.\nThere is very little time left to address these issues before this situation gets out of control.  For the sake of all of us in the SF/F community, I hope Tor uses it wisely.\nYou can leave your own comments on Mr. Doherty’s statement\nat Tor.com\n. And speaking of management duties… Malwyn? It appears #7 wants further instruction in the art of proper minionhood.",
  "tags": [
    "philosophy",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-09T10:18:00+00:00"
}