{
  "url": "https://voxday.net/2015/06/14/the-outrage-is-not-manufactured/",
  "scraped_at": "2025-12-16T12:59:29.971597",
  "title": "The outrage is not manufactured",
  "date_display": "June 14, 2015",
  "date_iso": "2015-06-14T08:55:00+00:00",
  "date_from_url": "2015-06-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Peter Grant hears from <a href=\"http://bayourenaissanceman.blogspot.com/2015/06/anger-doubt-and-confusion-at-tor.html\">a second Tor employee</a>:</p><blockquote class=\"tr_bq\"><p> It appears that there’s immense anger and bitterness among some senior personnel at Tor.  They reportedly believe the current backlash against that company is basically ‘manufactured outrage’, deliberately stirred up by Vox Day (whose name is allegedly an expletive there now).  Some have even asserted that the thousands of e-mails complaining about Irene Gallo’s statement aren’t genuine, but the product of a bot-net, a manufactured wave of pseudo-indignation that has no foundation in reality.  Apparently Macmillan and others involved aren’t so sure about that, but it’s a defense the SJW’s are using with might and main.  It’s also apparently why almost none of us have had any acknowledgment of our complaints, not even a notification that our e-mails have been received.  (Some correspondents who requested confirmation when their e-mails were opened have received it;  others have not.)</p><p>A major cause of the bitterness among the senior SJW’s at Tor is that Macmillan is allegedly taking a much greater role in formulating Tor’s policies and enforcing adherence to them.  The company is said to have a new social media policy that’s been described as ‘Draconian’, and individuals have allegedly been warned that any further violations will be a terminally bad idea, career-wise….</p><p>They’re worried about their own futures.  They say that any serious<br> boycott of Tor will have very damaging effects, very quickly, because<br> the company’s margins are not good.</br></br></p></blockquote><p>What the people at Tor don’t understand is that this is not merely a backlash of momentary outrage at a few recent actions by Tor’s senior SJWs. This is an expression of righteous fury for the way in which thousands of us have been routinely deprecated, insulted, denigrated, and marginalized by a very small group of individuals who believe they have the right and the duty to thought-police the world of science fiction and banish badthinkers from it.</p><p>They have been the gatekeepers and they have abused their positions in the most shameless and unprofessional of ways. I may have been the chief target of their leader, Patrick Nielsen Hayden, but only because I happened to be a) the most visible, being a nationally syndicated libertarian op/ed columnist, b) the most irritating, being a published science fiction novelist and professional SFWA colleague, and c) the most stubborn. They despised conservatives and Republicans who don’t publish science fiction novels every bit as much as they despised me.</p><p>But none of those people ever had a means of striking back at the people at Tor Books who were raining contempt on them at every given opportunity before. All I have done is provide tens of thousands of people with an opportunity to hit back at the very small number of individuals they know to hate and despise them. The outrage is not manufactured, it is merely directed. I can’t make people angry at Tor Books because they already are.</p><p>So, now it is time to demonstrate that <i>we are not bots</i>. Now it is time to let Macmillan know that we truly exist and we do NOT approve of the senior SJWs at Tor Books who have been publicly attacking us for more than a decade.</p><p>It is time to prove to Macmillan that the senior SJWs at Tor are lying to them by sending ONE email apiece to the following people on <b>MONDAY </b>morning. (Emphasis added as a result of already seeing emails in my inbox.) Send the emails separately, do not CC them or send out one email to the three email addresses at the same time. The point is to make it clear that you are NOT a bot, you are a human being, and therefore the people at Tor Books are lying to their superiors at Macmillan.</p><ol><li>tom.dohertyATtor.com</li><li>andrew.weberATmacmillan.com</li><li>rhonda.brownATmacmillan.com</li></ol><p>The three emails should be short, straightforward, polite, and respectful. It should have I AM A REAL PERSON in the subject, CC voxdayATgmail.com, and address the following points:</p><ul><li>I am a real person and not a bot.</li><li>I do not approve of the behavior of the senior people at Tor Books, specifically Patrick Nielsen Hayden, Moshe Feder, and Irene Gallo.</li><li>I am requesting you to require Irene Gallo to resign from her positions at Tor Books and Tor.com as a consequence of her egregiously unprofessional public attack on science fiction readers and writers.</li><li>I request a response to confirm that my email has been received and read.</li></ul><p>Something to that effect, anyway. There is no need to mention any possibility of a boycott, tell them how many books you buy in a year, or anything else. The people at Macmillan are smart, they are professional, and they know what is at stake. What they do not know is something we are going to have to demonstrate to them: <i>SJWs always lie.</i></p><p>There is no bot-net. No one is spamming them. The wave of indignation is not manufactured and the indignation is not pseudo<i>.</i> Patrick Nielsen Hayden and the others are lying to them. What I would encourage the executives at Macmillan to ask themselves are these two questions:</p><ol><li>WHY has Vox Day deliberately taken advantage of this mass hostility towards the senior people at Tor Books? </li><li>WHO has put Macmillan in this situation?</li></ol><p>Am I a complete lunatic who, after 19 years of being an unassuming customer of Tor Books, suddenly developed an irrational hatred for Tom Doherty, a man who is by all accounts a very nice and decent guy? Or is absolutely everything I have said completely true and readily verifiable, and I have been the subject of unprovoked, unprofessional, ideologically-driven public attacks by Tor’s senior employees <i>for more than ten years?</i></p><p>Why not talk to the people at Pocket Books, at Simon &amp; Schuster, at Random House, at Regnery, at BenBella Books, at Thomas Nelson, and at WND Books who know me? Ask them if they have ever had <i>any problem whatsoever</i> with me. Ask them if I have ever been less than entirely professional in my relations with them. And then ask yourselves why I am so uniquely and implacably hostile to a single publishing house with which I have never had any professional contact, to which I have never so much as submitted a single short story.</p><p>And then I would also encourage the executives at Macmillan to ask themselves why thousands of people are so ready and willing to be stirred up into action against Tor Books and not against DAW, Del Rey, Orbit, Gollancz, Pocket Books, Random House, Golden Gryphon, or any other publishing house in the genre. What is it about Tor Books that causes so many people to regard it as an enemy?</p><p>I’ll give them a hint. The answer starts with “P”.</p></div>",
  "content_text": "Peter Grant hears from\na second Tor employee\n:\nIt appears that there’s immense anger and bitterness among some senior personnel at Tor.  They reportedly believe the current backlash against that company is basically ‘manufactured outrage’, deliberately stirred up by Vox Day (whose name is allegedly an expletive there now).  Some have even asserted that the thousands of e-mails complaining about Irene Gallo’s statement aren’t genuine, but the product of a bot-net, a manufactured wave of pseudo-indignation that has no foundation in reality.  Apparently Macmillan and others involved aren’t so sure about that, but it’s a defense the SJW’s are using with might and main.  It’s also apparently why almost none of us have had any acknowledgment of our complaints, not even a notification that our e-mails have been received.  (Some correspondents who requested confirmation when their e-mails were opened have received it;  others have not.)\nA major cause of the bitterness among the senior SJW’s at Tor is that Macmillan is allegedly taking a much greater role in formulating Tor’s policies and enforcing adherence to them.  The company is said to have a new social media policy that’s been described as ‘Draconian’, and individuals have allegedly been warned that any further violations will be a terminally bad idea, career-wise….\nThey’re worried about their own futures.  They say that any serious\nboycott of Tor will have very damaging effects, very quickly, because\nthe company’s margins are not good.\nWhat the people at Tor don’t understand is that this is not merely a backlash of momentary outrage at a few recent actions by Tor’s senior SJWs. This is an expression of righteous fury for the way in which thousands of us have been routinely deprecated, insulted, denigrated, and marginalized by a very small group of individuals who believe they have the right and the duty to thought-police the world of science fiction and banish badthinkers from it.\nThey have been the gatekeepers and they have abused their positions in the most shameless and unprofessional of ways. I may have been the chief target of their leader, Patrick Nielsen Hayden, but only because I happened to be a) the most visible, being a nationally syndicated libertarian op/ed columnist, b) the most irritating, being a published science fiction novelist and professional SFWA colleague, and c) the most stubborn. They despised conservatives and Republicans who don’t publish science fiction novels every bit as much as they despised me.\nBut none of those people ever had a means of striking back at the people at Tor Books who were raining contempt on them at every given opportunity before. All I have done is provide tens of thousands of people with an opportunity to hit back at the very small number of individuals they know to hate and despise them. The outrage is not manufactured, it is merely directed. I can’t make people angry at Tor Books because they already are.\nSo, now it is time to demonstrate that\nwe are not bots\n. Now it is time to let Macmillan know that we truly exist and we do NOT approve of the senior SJWs at Tor Books who have been publicly attacking us for more than a decade.\nIt is time to prove to Macmillan that the senior SJWs at Tor are lying to them by sending ONE email apiece to the following people on\nMONDAY\nmorning. (Emphasis added as a result of already seeing emails in my inbox.) Send the emails separately, do not CC them or send out one email to the three email addresses at the same time. The point is to make it clear that you are NOT a bot, you are a human being, and therefore the people at Tor Books are lying to their superiors at Macmillan.\ntom.dohertyATtor.com\nandrew.weberATmacmillan.com\nrhonda.brownATmacmillan.com\nThe three emails should be short, straightforward, polite, and respectful. It should have I AM A REAL PERSON in the subject, CC voxdayATgmail.com, and address the following points:\nI am a real person and not a bot.\nI do not approve of the behavior of the senior people at Tor Books, specifically Patrick Nielsen Hayden, Moshe Feder, and Irene Gallo.\nI am requesting you to require Irene Gallo to resign from her positions at Tor Books and Tor.com as a consequence of her egregiously unprofessional public attack on science fiction readers and writers.\nI request a response to confirm that my email has been received and read.\nSomething to that effect, anyway. There is no need to mention any possibility of a boycott, tell them how many books you buy in a year, or anything else. The people at Macmillan are smart, they are professional, and they know what is at stake. What they do not know is something we are going to have to demonstrate to them:\nSJWs always lie.\nThere is no bot-net. No one is spamming them. The wave of indignation is not manufactured and the indignation is not pseudo\n.\nPatrick Nielsen Hayden and the others are lying to them. What I would encourage the executives at Macmillan to ask themselves are these two questions:\nWHY has Vox Day deliberately taken advantage of this mass hostility towards the senior people at Tor Books?\nWHO has put Macmillan in this situation?\nAm I a complete lunatic who, after 19 years of being an unassuming customer of Tor Books, suddenly developed an irrational hatred for Tom Doherty, a man who is by all accounts a very nice and decent guy? Or is absolutely everything I have said completely true and readily verifiable, and I have been the subject of unprovoked, unprofessional, ideologically-driven public attacks by Tor’s senior employees\nfor more than ten years?\nWhy not talk to the people at Pocket Books, at Simon & Schuster, at Random House, at Regnery, at BenBella Books, at Thomas Nelson, and at WND Books who know me? Ask them if they have ever had\nany problem whatsoever\nwith me. Ask them if I have ever been less than entirely professional in my relations with them. And then ask yourselves why I am so uniquely and implacably hostile to a single publishing house with which I have never had any professional contact, to which I have never so much as submitted a single short story.\nAnd then I would also encourage the executives at Macmillan to ask themselves why thousands of people are so ready and willing to be stirred up into action against Tor Books and not against DAW, Del Rey, Orbit, Gollancz, Pocket Books, Random House, Golden Gryphon, or any other publishing house in the genre. What is it about Tor Books that causes so many people to regard it as an enemy?\nI’ll give them a hint. The answer starts with “P”.",
  "tags": [
    "Puppies",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-14T07:55:00+00:00"
}