{
  "url": "https://voxday.net/2015/06/19/the-broad-spectrum-sjw-attack/",
  "scraped_at": "2025-12-16T13:00:03.983372",
  "title": "The broad-spectrum SJW attack",
  "date_display": "June 19, 2015",
  "date_iso": "2015-06-19T08:46:00+00:00",
  "date_from_url": "2015-06-19",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>If you think the SJWs will ever leave you alone anywhere, in any industry, you are wrong. Even if you volunteer and provide your time and skills somewhere for free, <a href=\"https://github.com/opal/opal/issues/941\">they will attack you and try to remove you</a>.</p><blockquote class=\"tr_bq\"><p> <b>CoralineAda commented Jun 18, 2015</b><br> Elia Schito is publicly calling trans people out for “not accepting reality” on Twitter. His Twitter profile mentions that he is a core contributor to opal. Is this what the other maintainers want to be reflected in the project? Will any transgender developers feel comfortable contributing?</br></p><p><b>meh commented Jun 18, 2015</b><br> If you want him removed, start working on Opal and contributing as much as him to everything he did for Opal so we have a replacement that’s more in orientation with your morals and views. Protip: you won’t because you can’t.</br></p><p><b>strand commented Jun 18, 2015</b><br> As a queer person this sort of argument from a maintainer makes me feel unwelcome. The ignorance which @elia shows by claiming that transfolk are “not accepting reality” is actively harmful. I will not contribute to this project or any other project which @elia maintains.</br></p><p><b>aredridel commented Jun 18, 2015</b><br> Damn. I found out about this project thanks to this issue, and it’s super relevant to my interests. But not going to come near it with a thousand foot pole if these are the people I’d have to interact with.</br></p><p><b>bhaibel commented Jun 18, 2015</b><br> @meh You’ve said that you’re committed to creating a welcoming environment for new contributors. Saying that is easy. Doing that is hard. You’re failing at it: right now, as a queer woman, I do not believe Opal would treat any contributions I might make fairly. I do not believe that I would be welcomed onto the project.</br></p></blockquote><p>Sounds familiar, doesn’t it. Notice that none of them actually use Opal or have contributed to it, they just want to execute a drive-by disqualification. This is why SJWs have to be methodically ignored when they run their usual game and removed as soon as they are identified in your organization. They don’t give a quantum of a damn about the project, the job, or the company, all of it is mere grist for their ideological mill.</p><p>Macmillan has learned that its SJWs are more concerned about denigrating those who won’t kowtow to their insane ideology than promoting authors or selling books. It would do well to jettison them in their own self-interest, regardless of what we do, because SJWs cannot be rehabilitated and <a href=\"http://www.tor.com/2015/06/09/special-edition-nyc-diversity-panels/\">are always focused on furthering their agenda</a> at the expense of their employers.</p><blockquote class=\"tr_bq\"><p> I was able to attend Representation Beyond Characters and Creating Comics. The former’s panelists were primarily people of color; the latter was all-female, including several women of color. Both talked about sneaking small but relatable details into worldbuilding, the difference between work-for-hire and creator-owned comics, and how publishers have responded to calls for greater diversity. Though the panels took place at different points during the con, they presented a refreshingly diverse lineup talking about real issues in modern storytelling.</p><p>However, Bennett cautions, while people are talking about how inclusive and wonderful it’s going to be in the future, they can’t take it as a given. “While I appreciate the optimism, that’s a trap I don’t want to fall into,” she said. “You have to remember that it takes active participation from every single person to make sure we keep this momentum going.”</p></blockquote><p>Read that part again: “active participation from every single person” is required. Translation: they regard totalitarian thought-policing as not only desirable, but <i>necessary</i>.</p></div>",
  "content_text": "If you think the SJWs will ever leave you alone anywhere, in any industry, you are wrong. Even if you volunteer and provide your time and skills somewhere for free,\nthey will attack you and try to remove you\n.\nCoralineAda commented Jun 18, 2015\nElia Schito is publicly calling trans people out for “not accepting reality” on Twitter. His Twitter profile mentions that he is a core contributor to opal. Is this what the other maintainers want to be reflected in the project? Will any transgender developers feel comfortable contributing?\nmeh commented Jun 18, 2015\nIf you want him removed, start working on Opal and contributing as much as him to everything he did for Opal so we have a replacement that’s more in orientation with your morals and views. Protip: you won’t because you can’t.\nstrand commented Jun 18, 2015\nAs a queer person this sort of argument from a maintainer makes me feel unwelcome. The ignorance which @elia shows by claiming that transfolk are “not accepting reality” is actively harmful. I will not contribute to this project or any other project which @elia maintains.\naredridel commented Jun 18, 2015\nDamn. I found out about this project thanks to this issue, and it’s super relevant to my interests. But not going to come near it with a thousand foot pole if these are the people I’d have to interact with.\nbhaibel commented Jun 18, 2015\n@meh You’ve said that you’re committed to creating a welcoming environment for new contributors. Saying that is easy. Doing that is hard. You’re failing at it: right now, as a queer woman, I do not believe Opal would treat any contributions I might make fairly. I do not believe that I would be welcomed onto the project.\nSounds familiar, doesn’t it. Notice that none of them actually use Opal or have contributed to it, they just want to execute a drive-by disqualification. This is why SJWs have to be methodically ignored when they run their usual game and removed as soon as they are identified in your organization. They don’t give a quantum of a damn about the project, the job, or the company, all of it is mere grist for their ideological mill.\nMacmillan has learned that its SJWs are more concerned about denigrating those who won’t kowtow to their insane ideology than promoting authors or selling books. It would do well to jettison them in their own self-interest, regardless of what we do, because SJWs cannot be rehabilitated and\nare always focused on furthering their agenda\nat the expense of their employers.\nI was able to attend Representation Beyond Characters and Creating Comics. The former’s panelists were primarily people of color; the latter was all-female, including several women of color. Both talked about sneaking small but relatable details into worldbuilding, the difference between work-for-hire and creator-owned comics, and how publishers have responded to calls for greater diversity. Though the panels took place at different points during the con, they presented a refreshingly diverse lineup talking about real issues in modern storytelling.\nHowever, Bennett cautions, while people are talking about how inclusive and wonderful it’s going to be in the future, they can’t take it as a given. “While I appreciate the optimism, that’s a trap I don’t want to fall into,” she said. “You have to remember that it takes active participation from every single person to make sure we keep this momentum going.”\nRead that part again: “active participation from every single person” is required. Translation: they regard totalitarian thought-policing as not only desirable, but\nnecessary\n.",
  "tags": [
    "SJW",
    "technology"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-19T07:46:00+00:00"
}