{
  "url": "https://voxday.net/2015/06/27/the-tale-of-herald/",
  "scraped_at": "2025-12-16T13:01:14.843179",
  "title": "The Tale of the Herald",
  "date_display": "June 27, 2015",
  "date_iso": "2015-06-27T19:11:00+00:00",
  "date_from_url": "2015-06-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>A Parable by Cataline Sergius</p><p><i>The vast fires of the besiegers blanketed the once-beautiful plains surrounding Tor Keep as far as the eye could see, glowing  a<br> hellish red-orange against a sky so dark from the smoke  that mid-day<br> appeared to be twilight.  The black legions of Evil<br> chanted, “he rises! he rises!” as the massive flaming boulders from<br> their gigantic trebuchets crashed into the Embarrassed-To-Be-So-White<br> walls of Tor Keep. Huge scorpios launched terrible bolts big enough to impale an elephant, or even a Swirsky.</br></br></br></br></br></i></p><p>The high walls of the keep, once thought to be completely<br> impenetrable, now showed massive cracks, They were the result of the thunderous<br> barrage of the mighty siege engines arrayed on every side, as well as the cunning mines dug  by the minions of the Supreme Dark Lord, which was totally unfair because they were so good at math.</br></br></p><p>The defenders of the<br> walls valiantly rained insults and condescension down upon their vile<br> faceless attackers, though despair now gripped every heart.  The Embarrassed-To-Be-So-White walls were crumbling despite the tireless efforts of<br> the Diversity Wizards to magically reinforce them.</br></br></br></p><p>Far back<br> from the fighting and deep within the bowels of The Tower That Jordan Built, two herald-minions of the<br> Dread Lord stood before the women of the All-White-But-Nevertheless-Incredibly-Inclusive-and-Diverse-Because-They-Have-One-Gay-Asian-Guy-From-Silicon-Valley Council.</br></br></p><p>Their beautiful-in-a-very-different-way queen, Toadina the Squat, rose slowly from her heavily reinforced<br> throne, prompting great waves of magnificently turbulent fat to roll back and forth across her massive belly like an indecisive tsunami. She delicately cleaned one squinting yellow eye<br> with an elegant stroke of her forked tongue before clearing her swollen throat.</br></br></p><p>She addressed<br> the heralds in an imperious manner. “Here are the merciful terms we offer for your<br> complete and unconditional surrender.  Behead your leaders. Kill one<br> in ten of the vile minions. Hand over two-thirds of your lands as well as all your present and future spawn. Admit your beliefs are sexist, racist, homophobic, and outdated, and renounce them. Then castrate yourselves.  In<br> exchange we promise… to like you. A little.”</br></br></br></br></p><p>Blinking in astonishment, the two heralds looked at each other. Their faces twitched, and they appeared to be restraining deep emotion, but was it futile defiance or humble gratitude? Finally, mastering himself, the one with the number 289 branded on his right cheek stepped forward.</p><p>“I am sorry, Madam, but you appear to have mistaken us for Republicans.”</p></div>",
  "content_text": "A Parable by Cataline Sergius\nThe vast fires of the besiegers blanketed the once-beautiful plains surrounding Tor Keep as far as the eye could see, glowing  a\nhellish red-orange against a sky so dark from the smoke  that mid-day\nappeared to be twilight.  The black legions of Evil\nchanted, “he rises! he rises!” as the massive flaming boulders from\ntheir gigantic trebuchets crashed into the Embarrassed-To-Be-So-White\nwalls of Tor Keep. Huge scorpios launched terrible bolts big enough to impale an elephant, or even a Swirsky.\nThe high walls of the keep, once thought to be completely\nimpenetrable, now showed massive cracks, They were the result of the thunderous\nbarrage of the mighty siege engines arrayed on every side, as well as the cunning mines dug  by the minions of the Supreme Dark Lord, which was totally unfair because they were so good at math.\nThe defenders of the\nwalls valiantly rained insults and condescension down upon their vile\nfaceless attackers, though despair now gripped every heart.  The Embarrassed-To-Be-So-White walls were crumbling despite the tireless efforts of\nthe Diversity Wizards to magically reinforce them.\nFar back\nfrom the fighting and deep within the bowels of The Tower That Jordan Built, two herald-minions of the\nDread Lord stood before the women of the All-White-But-Nevertheless-Incredibly-Inclusive-and-Diverse-Because-They-Have-One-Gay-Asian-Guy-From-Silicon-Valley Council.\nTheir beautiful-in-a-very-different-way queen, Toadina the Squat, rose slowly from her heavily reinforced\nthrone, prompting great waves of magnificently turbulent fat to roll back and forth across her massive belly like an indecisive tsunami. She delicately cleaned one squinting yellow eye\nwith an elegant stroke of her forked tongue before clearing her swollen throat.\nShe addressed\nthe heralds in an imperious manner. “Here are the merciful terms we offer for your\ncomplete and unconditional surrender.  Behead your leaders. Kill one\nin ten of the vile minions. Hand over two-thirds of your lands as well as all your present and future spawn. Admit your beliefs are sexist, racist, homophobic, and outdated, and renounce them. Then castrate yourselves.  In\nexchange we promise… to like you. A little.”\nBlinking in astonishment, the two heralds looked at each other. Their faces twitched, and they appeared to be restraining deep emotion, but was it futile defiance or humble gratitude? Finally, mastering himself, the one with the number 289 branded on his right cheek stepped forward.\n“I am sorry, Madam, but you appear to have mistaken us for Republicans.”",
  "tags": [
    "Puppies",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-27T18:11:00+00:00"
}