{
  "url": "https://voxday.net/2015/06/07/the-endless-temporary/",
  "scraped_at": "2025-12-16T12:58:38.187315",
  "title": "The endless “temporary”",
  "date_display": "June 7, 2015",
  "date_iso": "2015-06-07T12:00:00+00:00",
  "date_from_url": "2015-06-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Paul Krugman asks <a href=\"http://krugman.blogs.nytimes.com/2015/06/06/why-am-i-a-keynesian/\">why he is a Keynesian</a>:</p><blockquote><p> <a href=\"http://noahpinionblog.blogspot.com/2015/06/economic-arguments-as-stalking-horses.html\">Noah Smith</a><br> sort-of approvingly quotes Russ Roberts, who views all macroeconomic<br> positions as stalking horses for political goals, and declares in<br> particular that</br></br></br></p><p><i>Krugman is a Keynesian because he wants bigger government. I’m an anti-Keynesian because I want smaller government.</i></p><p>OK, I’m not going to<br> clutch my pearls and ask for the smelling salts. Politics can shape our<br> views, in ways we may not recognize. But I’m aware of that risk, and<br> make a regular practice of asking myself whether I’m letting that kind<br> of bias slip in. In fact, I lean against studies that seem too much in<br> tune with my political preferences. For example, I’ve been aggressively<br> skeptical of studies that seem to show a negative relationship between<br> inequality and growth, precisely because that result is so convenient<br> for my political tribe (which doesn’t mean that it’s wrong.)</br></br></br></br></br></br></br></br></p><p>So, am I a Keynesian<br> because I want bigger government? If I were, shouldn’t I be advocating<br> permanent expansion rather than temporary measures? Shouldn’t I be for<br> stimulus all the time, not only when we’re at the zero lower bound? When<br> I do call for bigger government — universal health care, higher Social<br> Security benefits — shouldn’t I be pushing these things as job-creation<br> measures? (I don’t think I ever have). I think if you look at the<br> record, I’ve always argued for temporary fiscal expansion, and only when<br> monetary policy is constrained. Meanwhile, my advocacy of an expanded<br> welfare state has always been made on its own grounds, not in terms of<br> alleged business cycle benefits.</br></br></br></br></br></br></br></br></br></br></p><p>In other words, I’ve<br> been making policy arguments the way one would if one sincerely believed<br> that fiscal policy helps fight unemployment under certain conditions,<br> and not at all in the way one would if trying to use the slump as an<br> excuse for permanently bigger government.</br></br></br></br></p></blockquote><p>This all sounds very well and good, except for one thing. Do you EVER recall Paul Krugman once calling for a REDUCTION in government spending at any point of the business cycle? Do you ever remember him recommending spending cuts or tighter monetary policy at all?</p><p>In 2013, Krugman wrote: “I’ve often argued on this blog and in the column that now is a particularly bad time to cut spending.” And this was four years into the Fed-reported economic recovery. Last year, he pointed out that “Prima facie, cutting spending depresses economies.” Even looking back to the heights of the 2007 and 1999 booms, I can’t find any evidence that Krugman called for fiscal contraction or anything but more spending and more taxes.</p><p>In any event, we already know why Krugman is a Keynesian. He read <i>Foundation</i>, he wants to be Hari Seldon, and Keynesianism permits him to wallow in the delusion of controlling future events.</p></div>",
  "content_text": "Paul Krugman asks\nwhy he is a Keynesian\n:\nNoah Smith\nsort-of approvingly quotes Russ Roberts, who views all macroeconomic\npositions as stalking horses for political goals, and declares in\nparticular that\nKrugman is a Keynesian because he wants bigger government. I’m an anti-Keynesian because I want smaller government.\nOK, I’m not going to\nclutch my pearls and ask for the smelling salts. Politics can shape our\nviews, in ways we may not recognize. But I’m aware of that risk, and\nmake a regular practice of asking myself whether I’m letting that kind\nof bias slip in. In fact, I lean against studies that seem too much in\ntune with my political preferences. For example, I’ve been aggressively\nskeptical of studies that seem to show a negative relationship between\ninequality and growth, precisely because that result is so convenient\nfor my political tribe (which doesn’t mean that it’s wrong.)\nSo, am I a Keynesian\nbecause I want bigger government? If I were, shouldn’t I be advocating\npermanent expansion rather than temporary measures? Shouldn’t I be for\nstimulus all the time, not only when we’re at the zero lower bound? When\nI do call for bigger government — universal health care, higher Social\nSecurity benefits — shouldn’t I be pushing these things as job-creation\nmeasures? (I don’t think I ever have). I think if you look at the\nrecord, I’ve always argued for temporary fiscal expansion, and only when\nmonetary policy is constrained. Meanwhile, my advocacy of an expanded\nwelfare state has always been made on its own grounds, not in terms of\nalleged business cycle benefits.\nIn other words, I’ve\nbeen making policy arguments the way one would if one sincerely believed\nthat fiscal policy helps fight unemployment under certain conditions,\nand not at all in the way one would if trying to use the slump as an\nexcuse for permanently bigger government.\nThis all sounds very well and good, except for one thing. Do you EVER recall Paul Krugman once calling for a REDUCTION in government spending at any point of the business cycle? Do you ever remember him recommending spending cuts or tighter monetary policy at all?\nIn 2013, Krugman wrote: “I’ve often argued on this blog and in the column that now is a particularly bad time to cut spending.” And this was four years into the Fed-reported economic recovery. Last year, he pointed out that “Prima facie, cutting spending depresses economies.” Even looking back to the heights of the 2007 and 1999 booms, I can’t find any evidence that Krugman called for fiscal contraction or anything but more spending and more taxes.\nIn any event, we already know why Krugman is a Keynesian. He read\nFoundation\n, he wants to be Hari Seldon, and Keynesianism permits him to wallow in the delusion of controlling future events.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-07T11:00:00+00:00"
}