{
  "url": "https://voxday.net/2015/06/21/the-third-law-in-action/",
  "scraped_at": "2025-12-16T13:00:23.377695",
  "title": "The Third Law in action",
  "date_display": "June 21, 2015",
  "date_iso": "2015-06-21T17:00:00+00:00",
  "date_from_url": "2015-06-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s so terribly frustrating to SJWs when they can’t find any scary threats to point-and-shriek about that they have to go and manufacture their own imaginary ones. Either these people are lying for effect or they are literally, clinically and medically insane.</p><blockquote class=\"tr_bq\"><p> <b>Ann Somerville on June 20, 2015 at 10:29 pm said:</b><br> I really fear for Irene Gallo and Moshe Feder. GGaters have no boundaries, and it’s beginning to look as if the Puppies of either kind don’t either.</br></p><p><b>Matt Y on June 20, 2015 at 10:59 pm said:</b><br> It’s not their jobs I’m worried about. It’s that small portion of the hyper-reactionary crowd that flock to some of these assholes get obsessed with trying to personally cause damage or harass people as if it’s some sort of game. Like GGs obsession with Quinn, Anita, and so on. I don’t know if that is what Anne is talking about but I’ve thought about that, which is really depressing that it’s even a potential concern.</br></p><p><b>Stevie on June 20, 2015 at 11:39 pm said:</b><br> Thank you, Anne and Matt. I was obviously being far too privileged to take on board the real physical dangers confronting them; I will try to do better.</br></p><p><b>Laura Resnick on June 21, 2015 at 1:02 am said:</b><br> I, too, have started wondering about Irene Gallo’s physical safety. Is she being cyberstalked or receiving threatening messages? Will the vitriolic rhetoric against her escalate to a level where she’s at risk from doxxing and physical stalking?</br></p><p>The apologies she and Tor issued should have resolved the matter. (And I assume Tor and Macmillan have remained silent since then because those apologies eliminated any legal exposure the corporation might have been concerned about.)</p><p>The bizarre, inexplicable ESCALATION we have seen over Gallo since then indicates that the Puppies and whoever else has joined this anti-Gallo hysteria are functioning so far outside the boundaries of rational behavior that their anger is self-feeding and could keep escalating, especially if the ringleaders keep feeding it. Which does lead me to wonder if unstable individuals in the group will harass and endanger Gallo, in the way that people like Anita Sarkeesian, Zoe Quinn, Briana Wu, and others have experienced in the past year or two.</p><p>I, too, have thought, oh, maybe I’m overreacting to what I’m seeing, maybe this is just Puppy Fatigue and not a realistic worry… But the very first person I mentioned this to, a few days ago, is probably my most level-headed anti-dramatic friend–and that person’s reaction was that this is a realistic concern and she’d been thinking about it, too. I see from the comments here that others were also thinking about it but thinking, “Oh, that’s probably just me.”</p><p>No, I guess it’s a bunch of people by now seeing some indicators in the Puppy mess of a pattern that we’ve already seen in GamerGate, and it’s alarming.</p><p>I’ve wondered much less about Moshe Feder, John Scalzi, or PNH’s safety than Gallo’s, partly because the angriest Puppies and boycotters seem so focused specifically on Gallo (and she’s the one whose apology, instead of being accepted by these people and ending the matter, has been reacted to with irrational escalations of rage), but also because they’re men. Yes, men also get doxxed, threatened, stalked, and harassed, of course, and these men could be in potential danger… but “movements” like this tend more toward stalking women than men. So I think that after Gallo, the next likeliest target is Teresa Nielsen Hayden. Plus, the Puppies have been heavily focused on her at times, and a number of them have already “unpersoned” her with nasty nicknames like the “Toad of Tor.”</p><p>Anyhow, nothing may come of it. But it seems like it’s something that probably many people are wondering about by now. Perhaps also at Tor.</p><p><b>Octavia on June 21, 2015 at 1:43 am said:</b><br> I agree. The vitriol of the puppies, especially against Irene Gallo seems to be spiraling completely out of control. Just like the narrative (comments instead of one comment with subsequent apology, attack against everyone and their dog, etc.).</br></p><p>Since some of the puppies/puppy-supporters own guns and a few have no problem with throwing all kinds of threats around, it does get really worrisome. Especially as none of the supposed “puppy-leaders” is even pretending to try and reign them in. Or call for some moderation. Instead they pour gasoline in the fire.</p><p>I hope Irene Gallo has a strong support network and people who can help her with the vitriol. I’m pretty sure that she’s receiving all kinds of threats at least on her work-email, maybe also on facebook.</p></blockquote><p>First, the only person who has been doing any cyberstalking <a href=\"http://www.milobookclub.com/2015/06/12/do-you-ever-have-that-feeling/\">is Irene Gallo</a>. She started following me on Twitter after this whole thing erupted and only stopped after I sent an email to the Compliance Officer at Macmillan informing them of her actions. And before anyone is stupid enough to point out the Facebook screenshot I posted, let me remind you that while I have a Facebook account, I have not utilized it in well over a year.</p><p>Second, Laura Resnick’s feigned concern over nonexistent violence is ridiculous given her own fantasies about sexually attractive men.</p><blockquote class=\"tr_bq\"><p> Laura Resnick says:<br> August 17, 2012 at 1:12 pm<br> Whever I think “alpha male”… my daydream quickly becomes a Sweeney Todd nightmare in which I’m serving the remains to my dinner guests, disguised as some sort of heavy-seasoned stew beneath puff pastry, because I wound up killing said Alpha Male in sheer exasperation before sundown and need to get rid of the body….</br></br></p></blockquote><p>Imagine her reaction if I said I daydreamed about killing and eating Tor employees. The fact is that no one in the Sad or Rabid Puppy camps wishes any physical harm to come to Irene Gallo, Moshe Feder, or Patrick Nielsen Hayden. No one has suggested or even hinted at the desirability of them being physically harmed in any way. We merely expect them to receive pink slips as a reasonable consequence of their unprofessional and abusive actions.</p><p>In any event, it should be obvious that it is not our side that contains the mentally unstable. Ergo the Third Law of the Social Justice Warrior: <i>SJWs always project</i></p><p>UPDATE: Sweet Mendel, but these people are stupid.<br/></p><blockquote class=\"tr_bq\"><p> <b>Jim Henley on June 21, 2015 at 9:23 am said:</b><br> I stand foursquare against taking a baseball bat to anyone. But when it comes to defending the honor of one’s spouse, I have been dwelling on this:</br></p><p>Brad Torgersen’s wife, as everyone keeps telling us, is black. In VD’s attack on NK Jemison, he asserted that “genetics tells us not all of us are equally homo sapiens.” This says “Brad Torgersen’s wife is not fully human according to Science!” far more explicitly than, for instance, anything Moshe Feder said about the Tor boycott applies to either Wright or Lamplighter. But other than saying, generally, “I’m not Vox Day,” Brad Torgersen refuses to repudiate VD or criticize him in specific. The guy who, not just by Puppy logic but any commonsense reading, called his wife subhuman.</p><p>I have a hard time squaring that with any concept of “personal honor” that means anything.</p></blockquote><p>He obviously hasn’t been dwelling anywhere nearly hard enough. Brad understands what Jim quite clearly does not, which is that pointing out the INCONTROVERTIBLE GENETIC FACT that all of us are not equally<i> Homo sapiens sapiens</i> is not tantamount to calling his wife subhuman.<i> </i>My statement is not controversial nor any more debatable than “2+2=4” or “a fish is not a tiger”. Nor does it say, “Brad Torgersen’s wife is not fully human according to Science!”</p><p>Anyone can be uninformed. But only an idiot attempts to inaccurately summarize things he does not understand rather than simply ask for clarification.<i> </i>Jim literally does not understand the plain English of what I wrote. And neither Brad Torgersen nor his wife are going to criticize me for that statement because they are not scientific ignoramuses.</p><p>You’d think the morons would learn to start looking before they leap. But they never do.</p><p>UPDATE 2: And even when they’re explicitly told they’re being morons, they STILL jump in:</p><blockquote class=\"tr_bq\"><p> <b>Paul Weimer (@princejvstin) on June 21, 2015 at 2:59 pm said:</b><br> My “translation of Beale” seems to be on the fritz. He updated his post with a reply to Jim with an explanation that I don’t grok. As far as I can make it (and that’s not far) means that Nora is subhuman, but Brad’s wife is not, because I said so that’s why.</br></p><p><b>FungiFromYuggoth on June 21, 2015 at 3:27 pm said:</b><br> You’re missing Beale’s dodge – he’s not arguing that black people are sub human, just that the people-he-likes are more evolved than baseline human. He thinks he’s being clever, and it speaks ill of the intellect and character of anyone who is impressed by that dodge. Especially if they’ve read his entire tirade. This is the essence of Beale – to weasel and imply while building a half-assed trick, and then to point and laugh at the people who understand what he’s actually saying, trying to claim that he’s the truly smart one.</br></p></blockquote><p>Keep in mind when reading this, that these are people who genuinely believe they are more intelligent and better educated than we are. Because science. Also, vaccines. I’m not claiming to be smarter than them, I’m publicly DEMONSTRATING it.</p></div>",
  "content_text": "It’s so terribly frustrating to SJWs when they can’t find any scary threats to point-and-shriek about that they have to go and manufacture their own imaginary ones. Either these people are lying for effect or they are literally, clinically and medically insane.\nAnn Somerville on June 20, 2015 at 10:29 pm said:\nI really fear for Irene Gallo and Moshe Feder. GGaters have no boundaries, and it’s beginning to look as if the Puppies of either kind don’t either.\nMatt Y on June 20, 2015 at 10:59 pm said:\nIt’s not their jobs I’m worried about. It’s that small portion of the hyper-reactionary crowd that flock to some of these assholes get obsessed with trying to personally cause damage or harass people as if it’s some sort of game. Like GGs obsession with Quinn, Anita, and so on. I don’t know if that is what Anne is talking about but I’ve thought about that, which is really depressing that it’s even a potential concern.\nStevie on June 20, 2015 at 11:39 pm said:\nThank you, Anne and Matt. I was obviously being far too privileged to take on board the real physical dangers confronting them; I will try to do better.\nLaura Resnick on June 21, 2015 at 1:02 am said:\nI, too, have started wondering about Irene Gallo’s physical safety. Is she being cyberstalked or receiving threatening messages? Will the vitriolic rhetoric against her escalate to a level where she’s at risk from doxxing and physical stalking?\nThe apologies she and Tor issued should have resolved the matter. (And I assume Tor and Macmillan have remained silent since then because those apologies eliminated any legal exposure the corporation might have been concerned about.)\nThe bizarre, inexplicable ESCALATION we have seen over Gallo since then indicates that the Puppies and whoever else has joined this anti-Gallo hysteria are functioning so far outside the boundaries of rational behavior that their anger is self-feeding and could keep escalating, especially if the ringleaders keep feeding it. Which does lead me to wonder if unstable individuals in the group will harass and endanger Gallo, in the way that people like Anita Sarkeesian, Zoe Quinn, Briana Wu, and others have experienced in the past year or two.\nI, too, have thought, oh, maybe I’m overreacting to what I’m seeing, maybe this is just Puppy Fatigue and not a realistic worry… But the very first person I mentioned this to, a few days ago, is probably my most level-headed anti-dramatic friend–and that person’s reaction was that this is a realistic concern and she’d been thinking about it, too. I see from the comments here that others were also thinking about it but thinking, “Oh, that’s probably just me.”\nNo, I guess it’s a bunch of people by now seeing some indicators in the Puppy mess of a pattern that we’ve already seen in GamerGate, and it’s alarming.\nI’ve wondered much less about Moshe Feder, John Scalzi, or PNH’s safety than Gallo’s, partly because the angriest Puppies and boycotters seem so focused specifically on Gallo (and she’s the one whose apology, instead of being accepted by these people and ending the matter, has been reacted to with irrational escalations of rage), but also because they’re men. Yes, men also get doxxed, threatened, stalked, and harassed, of course, and these men could be in potential danger… but “movements” like this tend more toward stalking women than men. So I think that after Gallo, the next likeliest target is Teresa Nielsen Hayden. Plus, the Puppies have been heavily focused on her at times, and a number of them have already “unpersoned” her with nasty nicknames like the “Toad of Tor.”\nAnyhow, nothing may come of it. But it seems like it’s something that probably many people are wondering about by now. Perhaps also at Tor.\nOctavia on June 21, 2015 at 1:43 am said:\nI agree. The vitriol of the puppies, especially against Irene Gallo seems to be spiraling completely out of control. Just like the narrative (comments instead of one comment with subsequent apology, attack against everyone and their dog, etc.).\nSince some of the puppies/puppy-supporters own guns and a few have no problem with throwing all kinds of threats around, it does get really worrisome. Especially as none of the supposed “puppy-leaders” is even pretending to try and reign them in. Or call for some moderation. Instead they pour gasoline in the fire.\nI hope Irene Gallo has a strong support network and people who can help her with the vitriol. I’m pretty sure that she’s receiving all kinds of threats at least on her work-email, maybe also on facebook.\nFirst, the only person who has been doing any cyberstalking\nis Irene Gallo\n. She started following me on Twitter after this whole thing erupted and only stopped after I sent an email to the Compliance Officer at Macmillan informing them of her actions. And before anyone is stupid enough to point out the Facebook screenshot I posted, let me remind you that while I have a Facebook account, I have not utilized it in well over a year.\nSecond, Laura Resnick’s feigned concern over nonexistent violence is ridiculous given her own fantasies about sexually attractive men.\nLaura Resnick says:\nAugust 17, 2012 at 1:12 pm\nWhever I think “alpha male”… my daydream quickly becomes a Sweeney Todd nightmare in which I’m serving the remains to my dinner guests, disguised as some sort of heavy-seasoned stew beneath puff pastry, because I wound up killing said Alpha Male in sheer exasperation before sundown and need to get rid of the body….\nImagine her reaction if I said I daydreamed about killing and eating Tor employees. The fact is that no one in the Sad or Rabid Puppy camps wishes any physical harm to come to Irene Gallo, Moshe Feder, or Patrick Nielsen Hayden. No one has suggested or even hinted at the desirability of them being physically harmed in any way. We merely expect them to receive pink slips as a reasonable consequence of their unprofessional and abusive actions.\nIn any event, it should be obvious that it is not our side that contains the mentally unstable. Ergo the Third Law of the Social Justice Warrior:\nSJWs always project\nUPDATE: Sweet Mendel, but these people are stupid.\nJim Henley on June 21, 2015 at 9:23 am said:\nI stand foursquare against taking a baseball bat to anyone. But when it comes to defending the honor of one’s spouse, I have been dwelling on this:\nBrad Torgersen’s wife, as everyone keeps telling us, is black. In VD’s attack on NK Jemison, he asserted that “genetics tells us not all of us are equally homo sapiens.” This says “Brad Torgersen’s wife is not fully human according to Science!” far more explicitly than, for instance, anything Moshe Feder said about the Tor boycott applies to either Wright or Lamplighter. But other than saying, generally, “I’m not Vox Day,” Brad Torgersen refuses to repudiate VD or criticize him in specific. The guy who, not just by Puppy logic but any commonsense reading, called his wife subhuman.\nI have a hard time squaring that with any concept of “personal honor” that means anything.\nHe obviously hasn’t been dwelling anywhere nearly hard enough. Brad understands what Jim quite clearly does not, which is that pointing out the INCONTROVERTIBLE GENETIC FACT that all of us are not equally\nHomo sapiens sapiens\nis not tantamount to calling his wife subhuman.\nMy statement is not controversial nor any more debatable than “2+2=4” or “a fish is not a tiger”. Nor does it say, “Brad Torgersen’s wife is not fully human according to Science!”\nAnyone can be uninformed. But only an idiot attempts to inaccurately summarize things he does not understand rather than simply ask for clarification.\nJim literally does not understand the plain English of what I wrote. And neither Brad Torgersen nor his wife are going to criticize me for that statement because they are not scientific ignoramuses.\nYou’d think the morons would learn to start looking before they leap. But they never do.\nUPDATE 2: And even when they’re explicitly told they’re being morons, they STILL jump in:\nPaul Weimer (@princejvstin) on June 21, 2015 at 2:59 pm said:\nMy “translation of Beale” seems to be on the fritz. He updated his post with a reply to Jim with an explanation that I don’t grok. As far as I can make it (and that’s not far) means that Nora is subhuman, but Brad’s wife is not, because I said so that’s why.\nFungiFromYuggoth on June 21, 2015 at 3:27 pm said:\nYou’re missing Beale’s dodge – he’s not arguing that black people are sub human, just that the people-he-likes are more evolved than baseline human. He thinks he’s being clever, and it speaks ill of the intellect and character of anyone who is impressed by that dodge. Especially if they’ve read his entire tirade. This is the essence of Beale – to weasel and imply while building a half-assed trick, and then to point and laugh at the people who understand what he’s actually saying, trying to claim that he’s the truly smart one.\nKeep in mind when reading this, that these are people who genuinely believe they are more intelligent and better educated than we are. Because science. Also, vaccines. I’m not claiming to be smarter than them, I’m publicly DEMONSTRATING it.",
  "tags": [
    "freakshow",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-21T16:00:00+00:00"
}