{
  "url": "https://voxday.net/2015/06/27/the-irrelevance-of-neville/",
  "scraped_at": "2025-12-16T13:01:09.308253",
  "title": "The irrelevance of the neville",
  "date_display": "June 27, 2015",
  "date_iso": "2015-06-27T06:00:00+00:00",
  "date_from_url": "2015-06-27",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Aaron attempts to rationalize his own uselessness in the cultural war:</p><blockquote class=\"tr_bq\"><p> Danby, you’re just a partisan, like everyone else – you recognize no objective standards of honesty, or morality, rationality and merely wish to use naked aggression to support your cause, whatever it may be, rationality be damned. If that means banning someone who politely, intelligently, and honestly disagrees with you using logic and evidence, then rationality and fairness be damned.</p><p>I can’t respect that, but its human nature. I hold myself to a different standard of conduct than you and I am willing – I even feel I owe it to myself as someone with courage, strength, and nobility – to fight my enemies under the same overarching code of rationality and honesty that I hold myself to.</p><p>I’m not saying treat an enemy who has shown himself to be weak, scummy, and dishonest with rationality and honesty. Roosh, for instance, who has shown himself to be weak and dishonest, would simply be ignored by me.</p><p>But when I ban people for politely disagreeing with me I show MYSELF to be weak and pathetic. But this is an older tradition of thinking and feeling that seems to be dying out in the world, to be replaced by a tradition better fit for emotional weaklings like Roosh and those incapable of self-discipline.</p></blockquote><p>It’s telling that Aaron thinks of himself as strong and noble when he is observably weak, self-centered, and feminine. This is what happens when white-knighting gammas venture forth from saving fair maidens from dragonish pick-up artists and enter the cultural wars.</p><p>What does a wartime general do when one of his soldiers doesn’t follow orders, but instead “politely, intelligently, and honestly disagrees using logic and evidence”? He has him shot for insubordination. Aaron is lucky this is only a cultural war at this point, and he’s only being banned by one of the leaders who is fighting it. To call someone like Roosh, who has taken more heat from the Left than anyone else I know, including me, an “emotional weakling”, is not only shamelessly dishonest, but downright laughable.</p><p>Aaron is a self-delusional liar. He wouldn’t ignore Roosh. In fact, he’s not ignoring him now, but repeatedly brought him up out of context here. Not only is Aaron projecting when he talks about Roosh being weak and dishonest, but his “overarching code of rationality and honesty” is obviously not something to which he actually holds himself.</p><p>We don’t need self-delusional nevilles on our side. They are literally <i>worse than useless</i>, always far more interested in trying to elevate their own relative stature by shooting at their own side instead of taking risks by taking on the other side. Roosh was obviously right to ban Aaron, and if he persists in attacking us rather than the SJWs, I won’t hesitate to do the same.</p><p>If Aaron genuinely wishes to be strong, rational, and self-disciplined, I would encourage him to revisit his assumptions in light of the way his behavior observably contradicts them. He should also recognize that focusing on the other side rather than tone-policing your own is not in any way tantamount to recognizing no “objective standards of honesty, or morality, rationality”.</p></div>",
  "content_text": "Aaron attempts to rationalize his own uselessness in the cultural war:\nDanby, you’re just a partisan, like everyone else – you recognize no objective standards of honesty, or morality, rationality and merely wish to use naked aggression to support your cause, whatever it may be, rationality be damned. If that means banning someone who politely, intelligently, and honestly disagrees with you using logic and evidence, then rationality and fairness be damned.\nI can’t respect that, but its human nature. I hold myself to a different standard of conduct than you and I am willing – I even feel I owe it to myself as someone with courage, strength, and nobility – to fight my enemies under the same overarching code of rationality and honesty that I hold myself to.\nI’m not saying treat an enemy who has shown himself to be weak, scummy, and dishonest with rationality and honesty. Roosh, for instance, who has shown himself to be weak and dishonest, would simply be ignored by me.\nBut when I ban people for politely disagreeing with me I show MYSELF to be weak and pathetic. But this is an older tradition of thinking and feeling that seems to be dying out in the world, to be replaced by a tradition better fit for emotional weaklings like Roosh and those incapable of self-discipline.\nIt’s telling that Aaron thinks of himself as strong and noble when he is observably weak, self-centered, and feminine. This is what happens when white-knighting gammas venture forth from saving fair maidens from dragonish pick-up artists and enter the cultural wars.\nWhat does a wartime general do when one of his soldiers doesn’t follow orders, but instead “politely, intelligently, and honestly disagrees using logic and evidence”? He has him shot for insubordination. Aaron is lucky this is only a cultural war at this point, and he’s only being banned by one of the leaders who is fighting it. To call someone like Roosh, who has taken more heat from the Left than anyone else I know, including me, an “emotional weakling”, is not only shamelessly dishonest, but downright laughable.\nAaron is a self-delusional liar. He wouldn’t ignore Roosh. In fact, he’s not ignoring him now, but repeatedly brought him up out of context here. Not only is Aaron projecting when he talks about Roosh being weak and dishonest, but his “overarching code of rationality and honesty” is obviously not something to which he actually holds himself.\nWe don’t need self-delusional nevilles on our side. They are literally\nworse than useless\n, always far more interested in trying to elevate their own relative stature by shooting at their own side instead of taking risks by taking on the other side. Roosh was obviously right to ban Aaron, and if he persists in attacking us rather than the SJWs, I won’t hesitate to do the same.\nIf Aaron genuinely wishes to be strong, rational, and self-disciplined, I would encourage him to revisit his assumptions in light of the way his behavior observably contradicts them. He should also recognize that focusing on the other side rather than tone-policing your own is not in any way tantamount to recognizing no “objective standards of honesty, or morality, rationality”.",
  "tags": [
    "debate",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-27T05:00:00+00:00"
}