{
  "url": "https://voxday.net/2015/06/06/the-end-of-diaspora/",
  "scraped_at": "2025-12-16T12:58:28.980488",
  "title": "The end of the Diaspora",
  "date_display": "June 6, 2015",
  "date_iso": "2015-06-06T10:01:00+00:00",
  "date_from_url": "2015-06-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Martin van Creveld anticipates it. The Learned Elders of Wye see it. David Goldberg sees it. <a href=\"http://tabletmag.com/jewish-news-and-politics/191087/ebb-tide-in-the-golden-country?utm_source=FB&amp;utm_medium=post&amp;utm_campaign=EbbTideInTheGoldenCountry\">As does Rich Cohen</a>:</p><blockquote class=\"tr_bq\"><p> The horror of the Holocaust purchased us a 70-year vacation from history, though we didn’t know it. We believed the world had changed, as had human nature. Jews remained distinct in the new dispensation, but in a good way—a near-at-hand exotic, a symbol of exile, which we were told was the natural state of modern man. For perhaps the only time in history, you might actually want to be a Jew. Because of the close families and good husbands and yada yada. Saul Bellow, Phillip Roth, Mel Brooks. To those of us who came of age in these years, the future seemed like it would be more of the same, the present carried on forever.</p><p>We were wrong.</p><p>If you go online and read the comments on any story about Israel or George Soros or search certain terms on Twitter, you begin to feel the golden age of the American Jews was just a moment in time. Perhaps the old paranoia stirs in me, but I see ominous signs everywhere:</p><p>What changed? Well, for starters, there are just<br> fewer of us in proportion to the whole. Whereas Jews once constituted<br> five percent of America, and as much as forty percent of New York, those<br> numbers have shrunk. We’re perhaps thirteen percent of New York and<br> around two percent of the nation. In this sense, American Jews are<br> living with the results of their success. This is indeed the promised<br> land. It’s where Jews fulfilled the dream which, for many, has been to<br> stop being Jews and become part of the imagined whole.  Like the caboose<br> of a train, we’re getting smaller as we go away.</br></br></br></br></br></br></br></br></p></blockquote><p>I think Cohen is leaving out three of the more important reasons for the Jewish decline. First, being the most left-leaning portion of the American electorate, Jews are disproportionately affected by the dyscivic and dysgenic consequences of their own social policies. In the traditional 1950s America they so hated, a Jewish man with abnormal inclinations would be heavily encouraged to resist them, get married, and have at least three Jewish children. In post-traditional America, such a man is encouraged to do anything from play house with another man to put on a dress, mutilate himself, and call himself Esther. But whatever non-traditional lifestyle he chooses, his line is going to end with him.</p><p>Second, as Cohen says himself, “Jews had re-imagined the nation.” Of course, they didn’t merely reimagine it, they helped remake it more to their liking out of the mistaken belief that a multi-ethnic America would be better and safer for them than an Anglo-Saxon America. This is turning out to be wildly untrue, as the genteel disdain they so resented on the part of the elite White Anglo-Saxon Episcopalians is considerably milder than the way in which they regarded by nearly every immigrant group that the Jews have sought to import, from Central Americans to Eastern Europeans to Asians.</p><p>(The same is true in England, for that matter; the rise in anti-semitism in the UK isn’t merely the result of Muslim immigration, but Polish immigration as well. Until I moved to Europe, I had no idea that Poles tend to dislike Jews even more than they dislike Russians and Communists. I’m not sure they entirely distinguish between the three.)</p><p>The third is that a number of elite Jews in America have increasingly attempted to use America’s military on behalf of Israel’s foreign policy. This is increasingly resented by Americans across the political spectrum; for example, neither Right nor Left is even remotely interested in invading Iran as the neocons have been demanding for the last 13 years. Their efforts have not yet boomeranged, as Dr. van Creveld fears, but at some point they most likely will if they do not cease.</p><p>I don’t see it getting as bad for American Jews as it will for their few remaining European cousins, mostly because Americans are much less ethno-nationalistic and there is considerably more space. But I do think Cohen is correct in anticipating the significant decline of Jewish influence in America. Because, at the end of the day, Israel is the Jewish nation and the idea of the functional multi-ethnic society is not long for this world.</p><p>Of course, the idea was always bound to fail. It was obvious, on the basis of the assumption on which the belief was founded: “We believed the world had changed, as had human nature.” The world may have changed, for a time, but it will always change again. Human nature, on the other hand, doesn’t. </p></div>",
  "content_text": "Martin van Creveld anticipates it. The Learned Elders of Wye see it. David Goldberg sees it.\nAs does Rich Cohen\n:\nThe horror of the Holocaust purchased us a 70-year vacation from history, though we didn’t know it. We believed the world had changed, as had human nature. Jews remained distinct in the new dispensation, but in a good way—a near-at-hand exotic, a symbol of exile, which we were told was the natural state of modern man. For perhaps the only time in history, you might actually want to be a Jew. Because of the close families and good husbands and yada yada. Saul Bellow, Phillip Roth, Mel Brooks. To those of us who came of age in these years, the future seemed like it would be more of the same, the present carried on forever.\nWe were wrong.\nIf you go online and read the comments on any story about Israel or George Soros or search certain terms on Twitter, you begin to feel the golden age of the American Jews was just a moment in time. Perhaps the old paranoia stirs in me, but I see ominous signs everywhere:\nWhat changed? Well, for starters, there are just\nfewer of us in proportion to the whole. Whereas Jews once constituted\nfive percent of America, and as much as forty percent of New York, those\nnumbers have shrunk. We’re perhaps thirteen percent of New York and\naround two percent of the nation. In this sense, American Jews are\nliving with the results of their success. This is indeed the promised\nland. It’s where Jews fulfilled the dream which, for many, has been to\nstop being Jews and become part of the imagined whole.  Like the caboose\nof a train, we’re getting smaller as we go away.\nI think Cohen is leaving out three of the more important reasons for the Jewish decline. First, being the most left-leaning portion of the American electorate, Jews are disproportionately affected by the dyscivic and dysgenic consequences of their own social policies. In the traditional 1950s America they so hated, a Jewish man with abnormal inclinations would be heavily encouraged to resist them, get married, and have at least three Jewish children. In post-traditional America, such a man is encouraged to do anything from play house with another man to put on a dress, mutilate himself, and call himself Esther. But whatever non-traditional lifestyle he chooses, his line is going to end with him.\nSecond, as Cohen says himself, “Jews had re-imagined the nation.” Of course, they didn’t merely reimagine it, they helped remake it more to their liking out of the mistaken belief that a multi-ethnic America would be better and safer for them than an Anglo-Saxon America. This is turning out to be wildly untrue, as the genteel disdain they so resented on the part of the elite White Anglo-Saxon Episcopalians is considerably milder than the way in which they regarded by nearly every immigrant group that the Jews have sought to import, from Central Americans to Eastern Europeans to Asians.\n(The same is true in England, for that matter; the rise in anti-semitism in the UK isn’t merely the result of Muslim immigration, but Polish immigration as well. Until I moved to Europe, I had no idea that Poles tend to dislike Jews even more than they dislike Russians and Communists. I’m not sure they entirely distinguish between the three.)\nThe third is that a number of elite Jews in America have increasingly attempted to use America’s military on behalf of Israel’s foreign policy. This is increasingly resented by Americans across the political spectrum; for example, neither Right nor Left is even remotely interested in invading Iran as the neocons have been demanding for the last 13 years. Their efforts have not yet boomeranged, as Dr. van Creveld fears, but at some point they most likely will if they do not cease.\nI don’t see it getting as bad for American Jews as it will for their few remaining European cousins, mostly because Americans are much less ethno-nationalistic and there is considerably more space. But I do think Cohen is correct in anticipating the significant decline of Jewish influence in America. Because, at the end of the day, Israel is the Jewish nation and the idea of the functional multi-ethnic society is not long for this world.\nOf course, the idea was always bound to fail. It was obvious, on the basis of the assumption on which the belief was founded: “We believed the world had changed, as had human nature.” The world may have changed, for a time, but it will always change again. Human nature, on the other hand, doesn’t.",
  "tags": [
    "decline and fall",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-06T09:01:00+00:00"
}