{
  "url": "https://voxday.net/2015/06/23/the-due/",
  "scraped_at": "2025-12-16T13:00:39.304189",
  "title": "The Duel",
  "date_display": "June 23, 2015",
  "date_iso": "2015-06-23T18:30:00+00:00",
  "date_from_url": "2015-06-23",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Bateful Higot explains moderates:</p><blockquote class=\"tr_bq\"><p> Moderate: Okay, gentlemen… take 5 paces, then turn and shoot. SJW has won the coin toss and will shoot first. Understood?<br> Conservative: Yes.<br> SJW: Whatever.<br> Moderate: One…<br> SJW: <i>turns and points pistol, hand trembling in terror</i><br> Moderate: <i>looks at SJW scornfully</i> Two…<br> SJW: CHECK YOUR PRIVILEGE! <i>shoots in Conservative’s general direction… misses horribly</i><br> Conservative: What the deuce? <i>turns around</i> You bastard!<br> SJW: How dare you turn around! You’re not a gentleman!<br> Moderate: Conservative! You must take three more paces before you may turn around!<br> Conservative: That coward shot at me after two!<br> Moderate: Do not lower yourself to his level! Death before dishonor!<br> Conservative: That doesn’t mean what you think it does! <i>aims at SJW</i><br> SJW: EEK! <i>cowers</i><br> Moderate:<br> How dare you! <i>draws pistol on Conservative</i> If you do not turn around<br> this instant, I shall shoot you myself, you dishonorable cur!</br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></br></p></blockquote><p>How can you identify a moderate? He is the man who only shoots at his own side, never the enemy. This isn’t to say that moderates can’t learn. I have known a few who have done so, gradually and over time, mostly by virtue of having their “friends” on the other side repay their steadfast good will with repeated betrayals and regular stabs in the back.</p><p>Moderates merit civility, but no respect. And above all, do NOT permit them any input into strategy and tactics. They are worse than useless in that regard.</p></div>",
  "content_text": "Bateful Higot explains moderates:\nModerate: Okay, gentlemen… take 5 paces, then turn and shoot. SJW has won the coin toss and will shoot first. Understood?\nConservative: Yes.\nSJW: Whatever.\nModerate: One…\nSJW:\nturns and points pistol, hand trembling in terror\nModerate:\nlooks at SJW scornfully\nTwo…\nSJW: CHECK YOUR PRIVILEGE!\nshoots in Conservative’s general direction… misses horribly\nConservative: What the deuce?\nturns around\nYou bastard!\nSJW: How dare you turn around! You’re not a gentleman!\nModerate: Conservative! You must take three more paces before you may turn around!\nConservative: That coward shot at me after two!\nModerate: Do not lower yourself to his level! Death before dishonor!\nConservative: That doesn’t mean what you think it does!\naims at SJW\nSJW: EEK!\ncowers\nModerate:\nHow dare you!\ndraws pistol on Conservative\nIf you do not turn around\nthis instant, I shall shoot you myself, you dishonorable cur!\nHow can you identify a moderate? He is the man who only shoots at his own side, never the enemy. This isn’t to say that moderates can’t learn. I have known a few who have done so, gradually and over time, mostly by virtue of having their “friends” on the other side repay their steadfast good will with repeated betrayals and regular stabs in the back.\nModerates merit civility, but no respect. And above all, do NOT permit them any input into strategy and tactics. They are worse than useless in that regard.",
  "tags": [
    "philosophy",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-23T17:30:00+00:00"
}