{
  "url": "https://voxday.net/2015/06/02/the-end-of-national-review/",
  "scraped_at": "2025-12-16T12:57:59.304509",
  "title": "The end of National Review",
  "date_display": "June 2, 2015",
  "date_iso": "2015-06-02T13:39:00+00:00",
  "date_from_url": "2015-06-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I quit reading National Review when they canned John Derbyshire for the crime of telling the truth about race. Now that it has <a href=\"http://www.nationalreview.com/article/418515/equal-chance-love-why-we-should-recognize-same-sex-marriage-jason-lee-steorts\">come out out of the marital closet</a>, I expect considerably more people on the Right to follow suit. It is readily apparent that the difference between the liberal media and the so-called conservative media is about 20 years. And, like all homogamists, he openly lies about the way in which it utterly destroys the institution of marriage:</p><blockquote class=\"tr_bq\"><p> Finally, a word on the oft-heard claim that if we recognize same-sex marriages we’ll also have to marry siblings, and groups of a hundred and three, and adults to children, and humans to invertebrates, and so on.</p><p>Members of group relationships, whatever we may think of them, manifestly have not made the same kind of choice as have those in exclusive commitments, and so there is no equal-treatment basis for their inclusion in marriage. Remember, the equal-treatment argument we outlined above does not assert that marriage is about any kind of romantic love. It asserts that marriage is about a particular form of such love — faithfulness and exclusivity subsequent to a vow of permanent commitment — that is already partially included under traditional marriage laws. (Let us note in passing the ridiculousness of speaking of an “orientation to polygamy,” as traditionalists sometimes do, unless this means trivially that anyone might feel more than one attraction at a time, in which case we are presumably all so oriented.)</p><p>There is a sense in which the other types of relationships traditionalists scare us with, even if they were exclusive, would also not involve the same kind of choice as does a romantic commitment of two unrelated adults: They would fall short, for one or both parties, of being chosen in full freedom. In the case of family members, for example, an irrevocable and unchosen bond between the two already exists, and in that sense they cannot really give themselves to each other. That is why we see incest as a perversion of a preexisting relationship. As for a child, it does not possess a sufficiently developed mind and will with which to give consent to a sexual relationship. That is why we think such a relationship is exploitative. The specific ways in which these relationships fall short of full freedom — along with the unique intensity of sexual intimacy — in turn explain the primary harms that they intrinsically risk causing (for example, by undermining impartiality and stability within families, or by psychologically damaging children).</p><p>In any case, if you want to account for the special opprobrium we reserve for such things, you will have to offer some explanation of what is specifically wrong with them.</p></blockquote><p>It’s bitterly amusing to see how a nation-in-decline congratulates itself with every step it descends into Hell and the inevitable dustbin of history. But those who refuse to learn from history are usually destined to repeat its more unpleasant lessons. Or rather, their children and grandchildren are.</p></div>",
  "content_text": "I quit reading National Review when they canned John Derbyshire for the crime of telling the truth about race. Now that it has\ncome out out of the marital closet\n, I expect considerably more people on the Right to follow suit. It is readily apparent that the difference between the liberal media and the so-called conservative media is about 20 years. And, like all homogamists, he openly lies about the way in which it utterly destroys the institution of marriage:\nFinally, a word on the oft-heard claim that if we recognize same-sex marriages we’ll also have to marry siblings, and groups of a hundred and three, and adults to children, and humans to invertebrates, and so on.\nMembers of group relationships, whatever we may think of them, manifestly have not made the same kind of choice as have those in exclusive commitments, and so there is no equal-treatment basis for their inclusion in marriage. Remember, the equal-treatment argument we outlined above does not assert that marriage is about any kind of romantic love. It asserts that marriage is about a particular form of such love — faithfulness and exclusivity subsequent to a vow of permanent commitment — that is already partially included under traditional marriage laws. (Let us note in passing the ridiculousness of speaking of an “orientation to polygamy,” as traditionalists sometimes do, unless this means trivially that anyone might feel more than one attraction at a time, in which case we are presumably all so oriented.)\nThere is a sense in which the other types of relationships traditionalists scare us with, even if they were exclusive, would also not involve the same kind of choice as does a romantic commitment of two unrelated adults: They would fall short, for one or both parties, of being chosen in full freedom. In the case of family members, for example, an irrevocable and unchosen bond between the two already exists, and in that sense they cannot really give themselves to each other. That is why we see incest as a perversion of a preexisting relationship. As for a child, it does not possess a sufficiently developed mind and will with which to give consent to a sexual relationship. That is why we think such a relationship is exploitative. The specific ways in which these relationships fall short of full freedom — along with the unique intensity of sexual intimacy — in turn explain the primary harms that they intrinsically risk causing (for example, by undermining impartiality and stability within families, or by psychologically damaging children).\nIn any case, if you want to account for the special opprobrium we reserve for such things, you will have to offer some explanation of what is specifically wrong with them.\nIt’s bitterly amusing to see how a nation-in-decline congratulates itself with every step it descends into Hell and the inevitable dustbin of history. But those who refuse to learn from history are usually destined to repeat its more unpleasant lessons. Or rather, their children and grandchildren are.",
  "tags": [
    "decline and fall",
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-02T12:39:00+00:00"
}