{
  "url": "https://voxday.net/2015/06/12/tor-books-stands-by-gallo/",
  "scraped_at": "2025-12-16T12:59:22.334089",
  "title": "Tor Books and the terror bots",
  "date_display": "June 12, 2015",
  "date_iso": "2015-06-12T20:07:00+00:00",
  "date_from_url": "2015-06-12",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I have no idea how legit this is, but it was <a href=\"http://www.reddit.com/r/scifi/comments/396l6g/i_stand_by_irene_gallo_terribleminds_chuck_wendig/cs47xdt\">posted on Reddit today</a> by someone claiming to be a Tor employee:</p><blockquote class=\"tr_bq\"><p> Tor<br> employee here: We stand by her too. Legal reacted to terrorist tactics<br> of the Puppies (who created bots and have sent thousands of threatening<br> emails to various people in the company) and, without stopping to speak<br> to anyone else in Tor who damn well better understood the Puppies and<br> the broader situation, made that statement from Tom go up. What people<br> read was a draft that hadn’t been vetted by anyone and Tom was horrified<br> when it went public. The internal handling of this situation has been<br> deplorable and the community should know that Tor employees are very,<br> VERY angry at how a respected coworker was publicly dressed down in this<br> manor.</br></br></br></br></br></br></br></br></br></br></p><p>Our reputation is heavily damaged and both sides<br> of the aisle have lost faith in us as a company. As for fallout within<br> the company? Other than a lot of upset employees, loss of faith in the<br> corporate culture, and a shiny new Social Media Policy; very little. No<br> one is going to get fired.</br></br></br></br></p></blockquote><p>Fascinating. So, let’s examine the claims to determine how credible this is:</p><ol><li>The Puppies are using “terroristic tactics”. That’s false.</li><li>The Puppies have created bots and sent “thousands of threatening emails”. That sounds like a variant of the old “#GamerGate is just 200 people” narrative that everyone in GG knows to be false. We’re expecting 100 for GGinParis alone. In any event, it means that if you have sent an email to Tor Books or Macmillan, you had better send another one with proof that you are not a bot. And “thousands” of emails? I know people are pissed off, but I find that hard to believe. Dozens, definitely. Hundreds, maybe. But thousands? No. And I very much doubt the emails were threatening anyone either.</li><li>Tom Doherty didn’t write the statement from Tom Doherty. That’s a <i>fascinating </i>claim. Doubtful. If he was angry about it, why did he leave it up?</li><li>Tor’s reputation is heavily damaged. All right, that’s true enough.</li><li>No one is going to get fired. If that’s true, then I will publicly endorse the boycott of Tor that many have been urging. However, given the nature of the previous statements, we should probably get confirmation before taking any such action.</li></ol><p>If Tor Books is foolish enough to follow the lead of its editors and double-down, I expect they will soon learn that is a tremendous mistake. If they thought their reputation was “heavily damaged” by Irene Gallo’s comments about Tor’s authors and customers, how much more will it be damaged by officially endorsing them through a refusal to hold her responsible for them? I suppose there is only one way to find out.</p><p>That being said, don’t forget, one very important thing: SJW’s always lie. This may not even be from a Tor employee. It could be nothing but fantasy. So take this supposed leak with a grain of salt and don’t overreact to it.</p><p>UPDATE: The purported Tor employee <a href=\"http://www.reddit.com/r/scifi/comments/396l6g/i_stand_by_irene_gallo_terribleminds_chuck_wendig/cs489br\">expands upon her statement</a>:</p><blockquote class=\"tr_bq\"><p> [Tom Doherty] is an 80 year old man who “doesn’t get social media” and responded to a carefully crafted attack by Vox Day who manipulated a situation that resulted in some of Tom’s oldest friends and most established authors calling him, personally enraged, by what “they saw on them there internets being said by one of his lady workers.” Tom responded exactly how Vox Day wanted him to because he made the bad decision to not pause for a moment and ask other members of his team for their advice. THAT was his error, rather than inherently being racist, homophobic, or greedy (he is none of those things, I know him personally). </p></blockquote><p>Except she previously said that Tom Doherty didn’t respond at all, that it was Legal that reacted. This description is incoherent and somewhat self-contradictory. If Doherty wrote the draft letter and he “doesn’t get social media”, how did it end up posted on Tor.com without being vetted by anyone? If Legal reacted, how were they not involved in the vetting? Does Doherty actually endorse Gallo’s opinions of Tor’s authors and customers despite having disavowed those opinions in the draft that he a) personally wrote or b) never saw?</p><p>This Tor employee makes Tor Books sound even less professional and more haplessly dysfunctional than I’d imagined. If I were the Macmillan CEO, I’d clean house. It sounds like Tor Books needs it even more than Tor UK did.</p><div class=\"usertext-body may-blank-within md-container\"><div class=\"md\"></div></div></div>",
  "content_text": "I have no idea how legit this is, but it was\nposted on Reddit today\nby someone claiming to be a Tor employee:\nTor\nemployee here: We stand by her too. Legal reacted to terrorist tactics\nof the Puppies (who created bots and have sent thousands of threatening\nemails to various people in the company) and, without stopping to speak\nto anyone else in Tor who damn well better understood the Puppies and\nthe broader situation, made that statement from Tom go up. What people\nread was a draft that hadn’t been vetted by anyone and Tom was horrified\nwhen it went public. The internal handling of this situation has been\ndeplorable and the community should know that Tor employees are very,\nVERY angry at how a respected coworker was publicly dressed down in this\nmanor.\nOur reputation is heavily damaged and both sides\nof the aisle have lost faith in us as a company. As for fallout within\nthe company? Other than a lot of upset employees, loss of faith in the\ncorporate culture, and a shiny new Social Media Policy; very little. No\none is going to get fired.\nFascinating. So, let’s examine the claims to determine how credible this is:\nThe Puppies are using “terroristic tactics”. That’s false.\nThe Puppies have created bots and sent “thousands of threatening emails”. That sounds like a variant of the old “#GamerGate is just 200 people” narrative that everyone in GG knows to be false. We’re expecting 100 for GGinParis alone. In any event, it means that if you have sent an email to Tor Books or Macmillan, you had better send another one with proof that you are not a bot. And “thousands” of emails? I know people are pissed off, but I find that hard to believe. Dozens, definitely. Hundreds, maybe. But thousands? No. And I very much doubt the emails were threatening anyone either.\nTom Doherty didn’t write the statement from Tom Doherty. That’s a\nfascinating\nclaim. Doubtful. If he was angry about it, why did he leave it up?\nTor’s reputation is heavily damaged. All right, that’s true enough.\nNo one is going to get fired. If that’s true, then I will publicly endorse the boycott of Tor that many have been urging. However, given the nature of the previous statements, we should probably get confirmation before taking any such action.\nIf Tor Books is foolish enough to follow the lead of its editors and double-down, I expect they will soon learn that is a tremendous mistake. If they thought their reputation was “heavily damaged” by Irene Gallo’s comments about Tor’s authors and customers, how much more will it be damaged by officially endorsing them through a refusal to hold her responsible for them? I suppose there is only one way to find out.\nThat being said, don’t forget, one very important thing: SJW’s always lie. This may not even be from a Tor employee. It could be nothing but fantasy. So take this supposed leak with a grain of salt and don’t overreact to it.\nUPDATE: The purported Tor employee\nexpands upon her statement\n:\n[Tom Doherty] is an 80 year old man who “doesn’t get social media” and responded to a carefully crafted attack by Vox Day who manipulated a situation that resulted in some of Tom’s oldest friends and most established authors calling him, personally enraged, by what “they saw on them there internets being said by one of his lady workers.” Tom responded exactly how Vox Day wanted him to because he made the bad decision to not pause for a moment and ask other members of his team for their advice. THAT was his error, rather than inherently being racist, homophobic, or greedy (he is none of those things, I know him personally).\nExcept she previously said that Tom Doherty didn’t respond at all, that it was Legal that reacted. This description is incoherent and somewhat self-contradictory. If Doherty wrote the draft letter and he “doesn’t get social media”, how did it end up posted on Tor.com without being vetted by anyone? If Legal reacted, how were they not involved in the vetting? Does Doherty actually endorse Gallo’s opinions of Tor’s authors and customers despite having disavowed those opinions in the draft that he a) personally wrote or b) never saw?\nThis Tor employee makes Tor Books sound even less professional and more haplessly dysfunctional than I’d imagined. If I were the Macmillan CEO, I’d clean house. It sounds like Tor Books needs it even more than Tor UK did.",
  "tags": [
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-12T19:07:00+00:00"
}