{
  "url": "https://voxday.net/2015/06/05/transcript-available/",
  "scraped_at": "2025-12-16T12:58:25.265245",
  "title": "Transcript available",
  "date_display": "June 5, 2015",
  "date_iso": "2015-06-05T14:28:00+00:00",
  "date_from_url": "2015-06-05",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>From last weekend’s Brainstorm event with Dr. Martin van Creveld, Israeli military historian and the author of <i>The Transformation of War</i> and <b><a href=\"http://www.amazon.com/History-Strategy-Sun-William-Lind/dp/9527065542/ref=tmm_hrd_swatch_0?_encoding=UTF8&amp;sr=1-1&amp;qid=1433513962\"><i>A History of Strategy: From Sun Tzu to William S. Lind</i></a></b>:</p><blockquote class=\"tr_bq\"><p> VOX: Speaking of the US, I am curious to know what the general opinion in Israel is of the American neocons who, like you said, have been trying to overthrow Assad. They have overturned the Ukrainian government, the Libyan government, the Iraqi government, etc. What is the general view of the neocons in Israel?</p><p>MVC: Oh, we love them. The Israelis are very happy to fight the Arabs and the Iranians with American blood. During the first Gulf War, Israel was then under Yitzhak Shamir and did whatever it could to encourage an American invasion of Iraq. I wouldn’t say that this was decisive but they tried. It was the same when the Americans invaded Iraq for the second time. It was the same when Americans clashed with Iran over nuclear weapons. Each time you can see this very consistently. You can see the Israeli Right and, to some extent, even the Left say okay, this is lovely, we are going to let the Americans put the chestnuts in the fire for us.</p><p>Myself, I must say, that I dislike this policy very much. But certainly most Israelis like it. They like to be on the side of the strong as I see it. They push America as much as they can into these ventures. Just today I saw a famous t-shirt that says “Don’t worry America, Israel is behind you.” I also know that some Americans, like Pat Buchanan, have been writing that these lousy Israelis have been trying to use American for their own purposes and have unfortunately they have succeeded. So, personally I am not happy about this policy. I think that it may well one day act as a boomerang.</p><p> VOX: Do you think it is bad for Israel to be dependent in that way?</p><p>MVC: Yes, because, as we say in Hebrew, “the one who’s got the money has the say.” It’s bad in several ways, it is bad in the sense that we are tilting too much in the Republican direction. That is a bad thing in my view. It’s not bipartisan. There is a danger that one day support for Israel will probably fade and people will say enough of this. They will say Israelis are exploiting us with American-Jewish help. They are exploiting us for their own purposes. Let them go and fight their own wars. I have been warned more than once by my American friends that this is one day going to happen. It hasn’t happened yet but it is going to happen one day and it worries me. Frankly, it worries me.</p><p>VOX: Yeah, you don’t want to use your allies on a war that you don’t need and then not have their support when you actually need it.</p><p>MVC: Exactly.</p></blockquote><p><a href=\"http://www.castaliahouse.com/downloads/brainstorm-may-2015-transcript/\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.castaliahouse.com/wp-content/uploads/2015/06/BS_May15_MVC_256.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.castaliahouse.com/wp-content/uploads/2015/06/BS_May15_MVC_256.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a>In the event you are not a Brainstorm member but happen to be interested in obtaining a transcript of the interview with Dr. Martin van Creveld, it is available in EPUB and MOBI format <a href=\"http://www.castaliahouse.com/downloads/brainstorm-may-2015-transcript/\">at Castalia House</a>.</p><p>We haven’t scheduled the times yet, but William S. Lind has agreed to do a future event, as has Dr. Helen Smith. I’ve also contacted Ann Coulter’s publisher and am expect to arrange an interview with her at some point about her new book, <i>Adios America</i>. If there are others you might be interested in seeing on Brainstorm, feel free to make suggestions here. The objective is to maintain a consistently high level of intellectual discourse for the open and closed events alike.</p><p>You can join Brainstorm as an <a href=\"http://www.castaliahouse.com/downloads/brainstorm-annual/\">Annual </a>or <a href=\"http://www.castaliahouse.com/downloads/brainstorm-monthly/\">Monthly </a>member<br> to receive free transcripts as well as taking part in the closed<br> events. Now that we have 500 seats in the virtual auditorium, there<br> isn’t much risk of not being able to attend the open ones. On which<br> note, I should mention that there are still <a href=\"https://attendee.gotowebinar.com/register/5402452949014075905\">240 seats left</a> for next week’s event with Roosh V.</br></br></br></br></p></div>",
  "content_text": "From last weekend’s Brainstorm event with Dr. Martin van Creveld, Israeli military historian and the author of\nThe Transformation of War\nand\nA History of Strategy: From Sun Tzu to William S. Lind\n:\nVOX: Speaking of the US, I am curious to know what the general opinion in Israel is of the American neocons who, like you said, have been trying to overthrow Assad. They have overturned the Ukrainian government, the Libyan government, the Iraqi government, etc. What is the general view of the neocons in Israel?\nMVC: Oh, we love them. The Israelis are very happy to fight the Arabs and the Iranians with American blood. During the first Gulf War, Israel was then under Yitzhak Shamir and did whatever it could to encourage an American invasion of Iraq. I wouldn’t say that this was decisive but they tried. It was the same when the Americans invaded Iraq for the second time. It was the same when Americans clashed with Iran over nuclear weapons. Each time you can see this very consistently. You can see the Israeli Right and, to some extent, even the Left say okay, this is lovely, we are going to let the Americans put the chestnuts in the fire for us.\nMyself, I must say, that I dislike this policy very much. But certainly most Israelis like it. They like to be on the side of the strong as I see it. They push America as much as they can into these ventures. Just today I saw a famous t-shirt that says “Don’t worry America, Israel is behind you.” I also know that some Americans, like Pat Buchanan, have been writing that these lousy Israelis have been trying to use American for their own purposes and have unfortunately they have succeeded. So, personally I am not happy about this policy. I think that it may well one day act as a boomerang.\nVOX: Do you think it is bad for Israel to be dependent in that way?\nMVC: Yes, because, as we say in Hebrew, “the one who’s got the money has the say.” It’s bad in several ways, it is bad in the sense that we are tilting too much in the Republican direction. That is a bad thing in my view. It’s not bipartisan. There is a danger that one day support for Israel will probably fade and people will say enough of this. They will say Israelis are exploiting us with American-Jewish help. They are exploiting us for their own purposes. Let them go and fight their own wars. I have been warned more than once by my American friends that this is one day going to happen. It hasn’t happened yet but it is going to happen one day and it worries me. Frankly, it worries me.\nVOX: Yeah, you don’t want to use your allies on a war that you don’t need and then not have their support when you actually need it.\nMVC: Exactly.\nIn the event you are not a Brainstorm member but happen to be interested in obtaining a transcript of the interview with Dr. Martin van Creveld, it is available in EPUB and MOBI format\nat Castalia House\n.\nWe haven’t scheduled the times yet, but William S. Lind has agreed to do a future event, as has Dr. Helen Smith. I’ve also contacted Ann Coulter’s publisher and am expect to arrange an interview with her at some point about her new book,\nAdios America\n. If there are others you might be interested in seeing on Brainstorm, feel free to make suggestions here. The objective is to maintain a consistently high level of intellectual discourse for the open and closed events alike.\nYou can join Brainstorm as an\nAnnual\nor\nMonthly\nmember\nto receive free transcripts as well as taking part in the closed\nevents. Now that we have 500 seats in the virtual auditorium, there\nisn’t much risk of not being able to attend the open ones. On which\nnote, I should mention that there are still\n240 seats left\nfor next week’s event with Roosh V.",
  "tags": [
    "Brainstorm",
    "war",
    "Zion"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-05T13:28:00+00:00"
}