{
  "url": "https://voxday.net/2015/06/06/turbo-charging-award-pimpage/",
  "scraped_at": "2025-12-16T12:58:32.625647",
  "title": "Turbo-charging the award pimpage",
  "date_display": "June 6, 2015",
  "date_iso": "2015-06-06T16:00:00+00:00",
  "date_from_url": "2015-06-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I find it amusing that the SJWs obviously know that no one outside their freaky little circles believes them anymore, so they keep repeating the same thing over and over and over and over in the hopes that someone, anyone, will fall for it. In fact, Dela is such a sensitive literateur that she is capable of preemptively judging the quality of science fiction and fantasy work in future years. Now that’s science fictional!</p><blockquote class=\"tr_bq\"><p> <b>Dela on June 5, 2015 at 3:55 pm said:</b><br> I find all–ALL–of the Castalia House publications on the ballot so badly written, I will never again subject myself to anything from that publisher. The putrid and mostly unprofessional quality of the work was so consistent across CH nominees, all future CH nominees will automatically go under “No Award” on my Hugo ballots, as will “editor” Vox Day. I will never again let him or the Puppies waste my time as it has been wasted on reading the sheer drek that comes out of that company.</br></p></blockquote><p>Strange, a lot of us reached a similar conclusion about reading books published by Tor Books some years ago. I still have literally piles of dreadful books they sent me when I was on the Nebula Best Novel jury. As it happens, I’d been contemplating following the International Lord of Hate’s lead and recusing myself from the ballot in the future, since I didn’t want to end up with more Hugo nominations than the likes of Heinlein, Clarke, and Asimov. That would be ridiculous. However, now that I know the SJWs are <i>preemptively </i>planning to No Award me, I think I would be remiss if I did not consider award pimpage for every single Hugo Award for which I am even remotely eligible for in 2016.</p><p>Let’s see. In addition to the professional categories, there is Best Fan Writer, Best Related Work, and perhaps I can throw a few doodles together for Best Fan Artist while I’m at it.</p><blockquote class=\"tr_bq\"><p> <b>Lori Coulson on June 5, 2015 at 9:45 pm said:</b><br> I have finished hacking my way through the puppy nominees, thank Ghu.<br> As I said about most of the puppy entries — there’s no there, there.</br></br></p><p>When the puppies can produce short stories better than “A Rose For Ecclesiastes” or “Nightfall” and when they can write something like MY type of MiLSF, i.e. Gordon Dickson’s “Tactics of Mistake,” or even an enjoyable potboiler like “The Hunt for Red October,” or a disaster tale like “Dies the Fire” — THEN I might trying reading their scribblings again. Given the current state of their art I consider this outcome highly unlikely.</p><p>Something else — merely competent prose is not Hugo Award worthy. If there’s ever a next time for those of you who have some grasp on the basics, I remind you that you must bring your A game. As of right now, I found nothing of theirs that was worth the paper it was printed on. So, I am voting accordingly.</p></blockquote><p>Isn’t it strange how suddenly a Hugo Award requires a work at the level of Zelazny’s or Asimov’s best to merit beating No Award? As I have repeatedly pointed out, <i>every single work</i> nominated this year is better than last year’s <i>winners</i>. The SJWs were the ones who declared that the likes of <i>Redshirts </i>and <i>Chicks Dig Time Lords</i> and “Equoid” and “If You Give A Dinosaur A Cookie” and “We Have Always Fought” were the very best in science fiction, and everything we have put forward are better than those utter mediocrities.</p><p>They made the bed. We’re simply stretching out in it. They have nothing about which to complain. But fortunately, one SJW has figured out the massive historical disparity in awards being given out to the /SF Left at the expense of the SF Right:</p><blockquote class=\"tr_bq\"><p> <b>nickpheas on June 6, 2015 at 5:48 am said:</b><br> I see that the Conservatives are bitter and angry and don’t really understand people. While the progressives are more likely to be witty and humane. Is it terribly surprising that the angry bitter writers are less likely to appeal to the general public?</br></p></blockquote><p>Right, that’s probably it. No doubt all that witty humanity being written about the Puppies has been extraordinarily convincing to third parties. Certainly it can’t have anything to do with the left-wingers running the biggest publisher in science fiction into the ground being insanely biased against everyone to the right of Chairman Mao.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"http://www.milobookclub.com/wp-content/uploads/2015/06/Tor_FB_Gallo.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/06/Tor_FB_Gallo.jpg\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"http://www.milobookclub.com/wp-content/uploads/2015/06/Tor_FB_Gallo.jpg\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p> Irene Gallo is the Creative Director at Tor Books. Needless to say, this is libelous behavior we will be obliged to bring to the attention of the management at Pan Macmillan.</p></div>",
  "content_text": "I find it amusing that the SJWs obviously know that no one outside their freaky little circles believes them anymore, so they keep repeating the same thing over and over and over and over in the hopes that someone, anyone, will fall for it. In fact, Dela is such a sensitive literateur that she is capable of preemptively judging the quality of science fiction and fantasy work in future years. Now that’s science fictional!\nDela on June 5, 2015 at 3:55 pm said:\nI find all–ALL–of the Castalia House publications on the ballot so badly written, I will never again subject myself to anything from that publisher. The putrid and mostly unprofessional quality of the work was so consistent across CH nominees, all future CH nominees will automatically go under “No Award” on my Hugo ballots, as will “editor” Vox Day. I will never again let him or the Puppies waste my time as it has been wasted on reading the sheer drek that comes out of that company.\nStrange, a lot of us reached a similar conclusion about reading books published by Tor Books some years ago. I still have literally piles of dreadful books they sent me when I was on the Nebula Best Novel jury. As it happens, I’d been contemplating following the International Lord of Hate’s lead and recusing myself from the ballot in the future, since I didn’t want to end up with more Hugo nominations than the likes of Heinlein, Clarke, and Asimov. That would be ridiculous. However, now that I know the SJWs are\npreemptively\nplanning to No Award me, I think I would be remiss if I did not consider award pimpage for every single Hugo Award for which I am even remotely eligible for in 2016.\nLet’s see. In addition to the professional categories, there is Best Fan Writer, Best Related Work, and perhaps I can throw a few doodles together for Best Fan Artist while I’m at it.\nLori Coulson on June 5, 2015 at 9:45 pm said:\nI have finished hacking my way through the puppy nominees, thank Ghu.\nAs I said about most of the puppy entries — there’s no there, there.\nWhen the puppies can produce short stories better than “A Rose For Ecclesiastes” or “Nightfall” and when they can write something like MY type of MiLSF, i.e. Gordon Dickson’s “Tactics of Mistake,” or even an enjoyable potboiler like “The Hunt for Red October,” or a disaster tale like “Dies the Fire” — THEN I might trying reading their scribblings again. Given the current state of their art I consider this outcome highly unlikely.\nSomething else — merely competent prose is not Hugo Award worthy. If there’s ever a next time for those of you who have some grasp on the basics, I remind you that you must bring your A game. As of right now, I found nothing of theirs that was worth the paper it was printed on. So, I am voting accordingly.\nIsn’t it strange how suddenly a Hugo Award requires a work at the level of Zelazny’s or Asimov’s best to merit beating No Award? As I have repeatedly pointed out,\nevery single work\nnominated this year is better than last year’s\nwinners\n. The SJWs were the ones who declared that the likes of\nRedshirts\nand\nChicks Dig Time Lords\nand “Equoid” and “If You Give A Dinosaur A Cookie” and “We Have Always Fought” were the very best in science fiction, and everything we have put forward are better than those utter mediocrities.\nThey made the bed. We’re simply stretching out in it. They have nothing about which to complain. But fortunately, one SJW has figured out the massive historical disparity in awards being given out to the /SF Left at the expense of the SF Right:\nnickpheas on June 6, 2015 at 5:48 am said:\nI see that the Conservatives are bitter and angry and don’t really understand people. While the progressives are more likely to be witty and humane. Is it terribly surprising that the angry bitter writers are less likely to appeal to the general public?\nRight, that’s probably it. No doubt all that witty humanity being written about the Puppies has been extraordinarily convincing to third parties. Certainly it can’t have anything to do with the left-wingers running the biggest publisher in science fiction into the ground being insanely biased against everyone to the right of Chairman Mao.\nIrene Gallo is the Creative Director at Tor Books. Needless to say, this is libelous behavior we will be obliged to bring to the attention of the management at Pan Macmillan.",
  "tags": [
    "Hugo Award",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-06T15:00:00+00:00"
}