{
  "url": "https://voxday.net/2015/06/09/unaccepted/",
  "scraped_at": "2025-12-16T12:58:49.270317",
  "title": "An unapology, unaccepted",
  "date_display": "June 9, 2015",
  "date_iso": "2015-06-09T00:01:00+00:00",
  "date_from_url": "2015-06-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tom Doherty, Publisher of Tor Books, <a href=\"http://www.tor.com/2015/06/08/a-message-from-tom-doherty-to-our-readers-and-authors/\">disavows Irene Gallo’s views</a>, but does absolutely nothing to resolve the situation.</p><blockquote class=\"tr_bq\"><p> Last month, Irene Gallo, a member of Tor’s staff, posted comments about<br> two groups of science fiction writers, Sad Puppies and Rabid Puppies,<br> and about the quality of some of the 2015 Hugo Award nominees, on her<br> personal Facebook page. Ms. Gallo is identified on her page as working<br> for Tor. She did not make it clear that her comments were hers alone.<br> They do not reflect Tor’s views or mine. She has since clarified that<br> her personal views are just that and apologized to anyone her comments<br> may have hurt or offended….</br></br></br></br></br></br></br></p><p>Tor employees, including Ms. Gallo, have been reminded that they are<br> required to clarify when they are speaking for Tor and when they are<br> speaking for themselves. We apologize for any confusion Ms. Gallo’s<br> comments may have caused. Let me reiterate: the views expressed by Ms.<br> Gallo are not those of Tor as an organization and are not my own views. <br> Rest assured, Tor remains committed to bringing readers the finest in<br> science fiction – on a broad range of topics, from a broad range of<br> authors.</br></br></br></br></br></br></br></p></blockquote><p>D. Jason Fleming points out that Irene Gallo, Associate Publisher of Tor.com and Creative Director of Tor Books, didn’t actually apologize and <a href=\"https://blindslapstick.wordpress.com/2015/06/08/irene-gallo-unrepentant-bigot/\">is clearly of the same mind still</a>.</p><blockquote class=\"tr_bq\"><p> She does<br> not apologize for impugning the characters of a very large number of<br> people. She does not apologize for impugning authors who work for her<br> employer, in particular. She does not apologize for her immaturity in<br> prancing about demonstrating that she’s not part of a tribe she hates.<br> She does not apologize for her bigotry in any way, shape, or form.</br></br></br></br></br></p><p>She only apologizes for the feelings of people who might have been hurt by what she said.</p><p>What she said, then, must still stand.</p></blockquote><p> So what did she actually say?</p><div class=\"separator\" style=\"clear: both; text-align: center;\"> <a href=\"https://i.imgur.com/wO5ewNl.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><noscript><img border=\"0\" decoding=\"async\" src=\"https://i.imgur.com/wO5ewNl.png\"/></noscript><img border=\"0\" class=\"lazyload\" data-src=\"https://i.imgur.com/wO5ewNl.png\" decoding=\"async\" src=\"data:image/svg+xml,%3Csvg%20xmlns=%22http://www.w3.org/2000/svg%22%20viewBox=%220%200%20210%20140%22%3E%3C/svg%3E\"/></a></div><p> I don’t know about the rest of the Sad Puppies and Rabid Puppies she called right-wing extremists and neo-nazis, or the authors she described as writing “bad-to-reprehensible works”, or everyone she called “unrepentantly racist, misogynist, and homophobic”, but as for me, I’m not hurt. So why is she apologizing for nonexistent events she hypothesizes rather than her rank unprofessionalism, her shameless bigotry, and her unprovoked attack on the right two-thirds of SF/Fdom? Especially when she still hasn’t informed us whose works are bad and whose are reprehensible.</p><p>I don’t want an apology. I don’t expect an apology.</p><p>I expect a resignation.</p></div>",
  "content_text": "Tom Doherty, Publisher of Tor Books,\ndisavows Irene Gallo’s views\n, but does absolutely nothing to resolve the situation.\nLast month, Irene Gallo, a member of Tor’s staff, posted comments about\ntwo groups of science fiction writers, Sad Puppies and Rabid Puppies,\nand about the quality of some of the 2015 Hugo Award nominees, on her\npersonal Facebook page. Ms. Gallo is identified on her page as working\nfor Tor. She did not make it clear that her comments were hers alone.\nThey do not reflect Tor’s views or mine. She has since clarified that\nher personal views are just that and apologized to anyone her comments\nmay have hurt or offended….\nTor employees, including Ms. Gallo, have been reminded that they are\nrequired to clarify when they are speaking for Tor and when they are\nspeaking for themselves. We apologize for any confusion Ms. Gallo’s\ncomments may have caused. Let me reiterate: the views expressed by Ms.\nGallo are not those of Tor as an organization and are not my own views.\nRest assured, Tor remains committed to bringing readers the finest in\nscience fiction – on a broad range of topics, from a broad range of\nauthors.\nD. Jason Fleming points out that Irene Gallo, Associate Publisher of Tor.com and Creative Director of Tor Books, didn’t actually apologize and\nis clearly of the same mind still\n.\nShe does\nnot apologize for impugning the characters of a very large number of\npeople. She does not apologize for impugning authors who work for her\nemployer, in particular. She does not apologize for her immaturity in\nprancing about demonstrating that she’s not part of a tribe she hates.\nShe does not apologize for her bigotry in any way, shape, or form.\nShe only apologizes for the feelings of people who might have been hurt by what she said.\nWhat she said, then, must still stand.\nSo what did she actually say?\nI don’t know about the rest of the Sad Puppies and Rabid Puppies she called right-wing extremists and neo-nazis, or the authors she described as writing “bad-to-reprehensible works”, or everyone she called “unrepentantly racist, misogynist, and homophobic”, but as for me, I’m not hurt. So why is she apologizing for nonexistent events she hypothesizes rather than her rank unprofessionalism, her shameless bigotry, and her unprovoked attack on the right two-thirds of SF/Fdom? Especially when she still hasn’t informed us whose works are bad and whose are reprehensible.\nI don’t want an apology. I don’t expect an apology.\nI expect a resignation.",
  "tags": [
    "SJW",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-08T23:01:00+00:00"
}