{
  "url": "https://voxday.net/2015/06/13/unequally-gifted/",
  "scraped_at": "2025-12-16T12:59:28.164468",
  "title": "Unequally gifted",
  "date_display": "June 13, 2015",
  "date_iso": "2015-06-13T18:00:00+00:00",
  "date_from_url": "2015-06-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p><a href=\"http://www.heraldtribune.com/article/20150609/ARTICLE/150609665/0/search\">It’s a real mystery</a>. What a shame that the teachers in Sarasota and Manatee Counties are so racist:</p><blockquote class=\"tr_bq\"><p> Only one in 50 black students and one in 15 Hispanic students are identified as gifted, compared with about one in seven white students. Overall, Sarasota County has the fourth-lowest rate of black students identified as gifted in the state, behind the less populated Martin, St. Johns and Wakulla counties.</p><p>The picture is similar in Manatee County, where about one in 12 white students are singled out as gifted, compared with one of every 42 black students and one in 32 Hispanic students.</p></blockquote><p>Perhaps they should consider taking <i>action </i>to <i>affirm </i>that black students and Hispanic students are every bit as gifted as white students. Surely assigning more black and Hispanic students to the gifted courses will prove that those students are every bit as capable of excelling in those courses as the white students who test into them.</p><p>I mean, there can’t possibly be any other explanation than teacher racism for this otherwise inexplicable racial gap.</p><p>Wait, I have a better idea! Why not quiz the gifted white students to determine how many of them are transracial. After all, we know that 10 percent of all people are transracial, so correcting for transrace should go a long way towards addressing this dreadful inequality.</p></div>",
  "content_text": "It’s a real mystery\n. What a shame that the teachers in Sarasota and Manatee Counties are so racist:\nOnly one in 50 black students and one in 15 Hispanic students are identified as gifted, compared with about one in seven white students. Overall, Sarasota County has the fourth-lowest rate of black students identified as gifted in the state, behind the less populated Martin, St. Johns and Wakulla counties.\nThe picture is similar in Manatee County, where about one in 12 white students are singled out as gifted, compared with one of every 42 black students and one in 32 Hispanic students.\nPerhaps they should consider taking\naction\nto\naffirm\nthat black students and Hispanic students are every bit as gifted as white students. Surely assigning more black and Hispanic students to the gifted courses will prove that those students are every bit as capable of excelling in those courses as the white students who test into them.\nI mean, there can’t possibly be any other explanation than teacher racism for this otherwise inexplicable racial gap.\nWait, I have a better idea! Why not quiz the gifted white students to determine how many of them are transracial. After all, we know that 10 percent of all people are transracial, so correcting for transrace should go a long way towards addressing this dreadful inequality.",
  "tags": [
    "Vibrancy is our strength"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-13T17:00:00+00:00"
}