{
  "url": "https://voxday.net/2015/06/15/waco-ii/",
  "scraped_at": "2025-12-16T12:59:39.114983",
  "title": "Waco II",
  "date_display": "June 15, 2015",
  "date_iso": "2015-06-15T15:42:00+00:00",
  "date_from_url": "2015-06-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It looks like something <a href=\"http://www.breitbart.com/texas/2015/06/14/four-weeks-later-waco-police-narrative-unravels/\">might be more than a little awry</a> in the investigation of the Waco shootings that took place last month:</p><blockquote class=\"tr_bq\"><p> Four weeks after the deadly May 17th shooting incident outside a Waco Twin Peaks restaurant, more details have come out concerning the incident, but significant questions still remain about the actions taken by law enforcement and the police’s account of what transpired.</p><p>Although the national mainstream media has largely moved on from the Waco story, if critics of the police are correct, the incident represents an unprecedented civil rights violation and media cover-up campaign by the Waco authorities.</p><p>Police in Waco still have yet to state how many bikers, if any, were killed by the police, or to explain why the police showed up in force at all prior to the meeting on May 17th.</p><p>In a statement on Friday, the police said that of 16 officers that were in the parking lot, only three fired a total of 12 shots.  However, the statement still didn’t clarify how many of the bikers were killed by police. Authorities say they have not recieved final autopsy results that would clarify ballistics….</p><p>The Morning News piece quotes friends of Kirschner who praise him as a<br> gentle family man, but also includes a quote from “Lori,” a friend of<br> Kirschner, who echoed some of the rumors swirling as more doubts are<br> raised about the police account of the Twin Peaks incident.</br></br></br></p><p><i>In fact, Lori said, the biker community is rife with<br> reports about witnesses who heard the discharge of lots of high-powered<br> weaponry after a few initial pop-pop sounds of handguns. The reports<br> sounded like they came from “muzzled or suppressed high-powered<br> weapons,” said Lori, though she wasn’t there. The theory is that the<br> heavy fire came from tactical police officers.</br></br></br></br></br></i></p></blockquote><p>I don’t believe the police version for one very simple reason: police are usually a) trigger-happy, and b) terrible shots. In one incident in Minneapolis, police fired 41 shots at a man in the skyway – which means absolutely no cover at all – and somehow managed to score zero hits.</p><p>The key is probably to be found in the statement “of 16 officers that were in the parking lot”. Fine, setting aside one’s skepticism that three police opening fire would only pull the trigger an average of four times each, there were a lot more than 16 police officers on the scene who were not in the parking lot. How many shots did the rest of them fire?</p></div>",
  "content_text": "It looks like something\nmight be more than a little awry\nin the investigation of the Waco shootings that took place last month:\nFour weeks after the deadly May 17th shooting incident outside a Waco Twin Peaks restaurant, more details have come out concerning the incident, but significant questions still remain about the actions taken by law enforcement and the police’s account of what transpired.\nAlthough the national mainstream media has largely moved on from the Waco story, if critics of the police are correct, the incident represents an unprecedented civil rights violation and media cover-up campaign by the Waco authorities.\nPolice in Waco still have yet to state how many bikers, if any, were killed by the police, or to explain why the police showed up in force at all prior to the meeting on May 17th.\nIn a statement on Friday, the police said that of 16 officers that were in the parking lot, only three fired a total of 12 shots.  However, the statement still didn’t clarify how many of the bikers were killed by police. Authorities say they have not recieved final autopsy results that would clarify ballistics….\nThe Morning News piece quotes friends of Kirschner who praise him as a\ngentle family man, but also includes a quote from “Lori,” a friend of\nKirschner, who echoed some of the rumors swirling as more doubts are\nraised about the police account of the Twin Peaks incident.\nIn fact, Lori said, the biker community is rife with\nreports about witnesses who heard the discharge of lots of high-powered\nweaponry after a few initial pop-pop sounds of handguns. The reports\nsounded like they came from “muzzled or suppressed high-powered\nweapons,” said Lori, though she wasn’t there. The theory is that the\nheavy fire came from tactical police officers.\nI don’t believe the police version for one very simple reason: police are usually a) trigger-happy, and b) terrible shots. In one incident in Minneapolis, police fired 41 shots at a man in the skyway – which means absolutely no cover at all – and somehow managed to score zero hits.\nThe key is probably to be found in the statement “of 16 officers that were in the parking lot”. Fine, setting aside one’s skepticism that three police opening fire would only pull the trigger an average of four times each, there were a lot more than 16 police officers on the scene who were not in the parking lot. How many shots did the rest of them fire?",
  "tags": [
    "NWA was right"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-15T14:42:00+00:00"
}