{
  "url": "https://voxday.net/2015/06/15/we-are-real-people/",
  "scraped_at": "2025-12-16T12:59:37.290525",
  "title": "We Are Real People",
  "date_display": "June 15, 2015",
  "date_iso": "2015-06-15T12:00:00+00:00",
  "date_from_url": "2015-06-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Tor Books author John Wright <a href=\"http://www.scifiwright.com/2015/06/i-am-a-real-person/\">repeats the call</a>:</p><blockquote class=\"tr_bq\"><p> I have received more messages, publicly and privately, from fans who<br> enjoy and buy my works but who, deeply offended at at least four,<br> perhaps more, of the ranking officers of my publisher, have told me they<br> can no longer buy my works.</br></br></br></p><p>This is unprecedented, or, I should<br> say, at least I have never heard of readers disavowing books based not<br> on the content or author, but the publisher. Some have likewise written to Tor books to express their displeasure at this high handed and unprofessional treatment.</br></br></p><p>However, the latest slander issued from the enemy is that these readers do not exist.</p><p>They<br> are trying to blank you out of their minds. You are unpersons. The<br> claim is that the emails and letters sent to Tor expressing the<br> displeasure of the customer are said to be faked, counterfeit, written<br> by robots.</br></br></br></br></p></blockquote><p>As <a href=\"http://bayourenaissanceman.blogspot.ch/2015/06/an-appeal-for-help-to-all-my-readers.html\">does Peter Grant</a>:</p><blockquote class=\"tr_bq\"><p> I’m sure you’ve been reading my posts about <a href=\"http://bayourenaissanceman.blogspot.com/search/label/Tor\">the Tor debacle</a> over the past days.  It’s time for action, and I’d be very grateful if each of you would please help by sending <u>one</u> e-mail separately to <u>three different addresses</u> tomorrow.</p><p>Vox Day came up with the idea.  Note that I’m not one of his ‘Rabid<br> Puppies’ or ‘minions’.  I’ll simply take allies where I can get them,<br> thank you very much!  I’m aware that some SJW’s regard him as being in<br> league with the Devil.  To that I can only make common cause with<br> Winston Churchill:  “<a href=\"https://www.brainyquote.com/quotes/quotes/w/winstonchu111298.html\">If Hitler invaded hell I would make at least a favourable reference to the devil in the House of Commons.</a>”  So, Vox, this is my best Churchillian imitation!</br></br></br></br></p></blockquote><p>As does <a href=\"http://www.ljagilamplighter.com/2015/06/15/tor-and-the-puppies-i-am-not-a-number/\">Tor Books author L. Jagi Lamplighter</a>:</p><blockquote class=\"tr_bq\"><p> Appalled to see posts suggesting that the emails to Tor—many of which, I am led to understand, are arriving with photos of the reader’s Tor book collections, in some cases, collections worth thousands of dollars—were not legitimate but were sent from automated bots.</p><p>Tor Folks:  You may disagree with the Sad/Rabid Puppies, or feel loyalty to your co-workers—but please! Don’t insult our readers by claiming they don’t exist!</p><p>Readers:  I realize that, in the age of electronics,this is an unprecedented request, but: if you have a strong opinion that you wish to be heard, it might help if you committed it to physical paper—perhaps along with a printout of your photo of your Tor book collection—and snail mailed it to Tor and Macmillan.</p></blockquote><p>Meanwhile, George Martin <a href=\"http://grrm.livejournal.com/429752.html?thread=21780664#t21780664\">demonstrates the truth of the aphorism</a>: “SJWs always lie”:</p><blockquote class=\"tr_bq\"><p> I have spoken out against name-calling from the first, Brad.  It is the<br> Puppies and their supporters who started it, and who keep dialing it up.<br> I will concede that you yourself have been mostly civil, but read the<br> comments in your own blog, or Correia’s, or even on FILE 770, and it is<br> all venom and epithets.</br></br></br></br></p></blockquote><p>No, Teresa Nielsen Hayden and Patrick Nielsen Hayden <a href=\"https://archive.is/JdnZG\">started the name-calling </a>back in March 2005. Martin then goes on to do more of what SJWs always do, which, of course, is lie:</p><blockquote class=\"tr_bq\"><p> The vast majority of customers have no idea about any of this. The<br> “unhappiness” here is a campaign orchestrated by the odious Mr. Beale,<br> and once again you Sad Puppies have lined up behind the Rabids. Early in<br> this debate, I heard a lot of stuff from your side about careers being<br> threatened and your opponents saying “you will never work in this town<br> again” and similar crap. Not one instance of that was ever<br> substantiated. But now we are seeing a deliberate internet campaign to<br> cost someone their career — and it is coming from VD, with the full<br> howling support of Puppies of all stripes. <b>No one on “my side” ever threatened anyone’s livelihood or career. </b>Your side is doing just that. In public.</br></br></br></br></br></br></br></br></p></blockquote><p>Emphasis added. That’s an absolutely absurd lie. Look at the post below for starters. Or look at <a href=\"https://handleshaus.wordpress.com/2013/12/26/bullied-and-badgered-pressured-and-purged/\">this list of victims</a> of the ongoing SJW witch patrol. And even if we limit Martin’s claim to the small world of science fiction publishing, Charles Stross warned me that I’d somehow managed to unwittingly make “a career-limiting move” by writing an opinion column as a nationally syndicated opinion columnist <i>ten years ago</i>. Martin is not telling the truth. Look, we all know that if Irene Gallo had called Tor’s customers “half-savages” or “hymies” or “faggots” instead of “racist, sexist, homophobic neo-Nazis”, she’d have been disappeared that same day. Are some customers less equal than others in the eyes of Tor Books? Are they less valued?</p><p>Note that we’ve seen a Nobel laureate and a principal in Florida banished from the commons in just the two weeks since Ms Gallo’s public attack on Tor customers and Tor authors was first brought to Mr. Doherty’s attention. George Martin’s side has been waging war against people’s livelihoods and careers for years, if not decades. And his side knows it. Hence this little warning ten years ago:</p><p><i>“The people who live and work and pitch their tents in this field have long memories. You’ll have to share the same field with them for a long time — decades, maybe — if you want to be in it at all. And you’ve just offended 75% of them? This is Not Clever. You may not need them now, but you have no idea what your circumstances will look like in ten years’ time…. In a corporate environment it’s sometimes termed a career-limiting move. I think you just made a career-limiting move.”</i><br> – Charles Stross, <a href=\"https://archive.is/o/JdnZG/http://nielsenhayden.com/electrolite/archives/006122.html%2375938\">March 5, 2005</a></br></p><p>In any event, the increased hysteria from the other side means that they know the pressure on Tor Books is growing, from above and from below. Their position is totally indefensible <i>and they know it</i>. So have you sent your three emails yet today? If not, why are you still reading this? If you oppose what you’ve been seeing, then it’s time to get out of the stands and get in the game. It’s time to tell Macmillan that you are a real person and your opinion counts.</p><ol><li>tom.dohertyATtor.com</li><li>andrew.weberATmacmillan.com</li><li>rhonda.brownATmacmillan.com </li></ol><p>So much for that theory that there is no other side. Not only has this nonexistent other side, as per Mr. Martin, never done nothing to nobody, but they’re <a href=\"http://skyseastone.net/jvstin/?p=4211\">emailing Tor Books and Macmillan too</a>. Because they are also real people who do “not want the community to<br> reflect the views of Theodore Beale and his rabid puppies.” Of course, they’re missing the central point, which is that it is <i>not the job of anyone at Tor Books</i> to play thought-police and eliminate those views from the community.</br></p><ol></ol><ol></ol></div>",
  "content_text": "Tor Books author John Wright\nrepeats the call\n:\nI have received more messages, publicly and privately, from fans who\nenjoy and buy my works but who, deeply offended at at least four,\nperhaps more, of the ranking officers of my publisher, have told me they\ncan no longer buy my works.\nThis is unprecedented, or, I should\nsay, at least I have never heard of readers disavowing books based not\non the content or author, but the publisher. Some have likewise written to Tor books to express their displeasure at this high handed and unprofessional treatment.\nHowever, the latest slander issued from the enemy is that these readers do not exist.\nThey\nare trying to blank you out of their minds. You are unpersons. The\nclaim is that the emails and letters sent to Tor expressing the\ndispleasure of the customer are said to be faked, counterfeit, written\nby robots.\nAs\ndoes Peter Grant\n:\nI’m sure you’ve been reading my posts about\nthe Tor debacle\nover the past days.  It’s time for action, and I’d be very grateful if each of you would please help by sending\none\ne-mail separately to\nthree different addresses\ntomorrow.\nVox Day came up with the idea.  Note that I’m not one of his ‘Rabid\nPuppies’ or ‘minions’.  I’ll simply take allies where I can get them,\nthank you very much!  I’m aware that some SJW’s regard him as being in\nleague with the Devil.  To that I can only make common cause with\nWinston Churchill:  “\nIf Hitler invaded hell I would make at least a favourable reference to the devil in the House of Commons.\n”  So, Vox, this is my best Churchillian imitation!\nAs does\nTor Books author L. Jagi Lamplighter\n:\nAppalled to see posts suggesting that the emails to Tor—many of which, I am led to understand, are arriving with photos of the reader’s Tor book collections, in some cases, collections worth thousands of dollars—were not legitimate but were sent from automated bots.\nTor Folks:  You may disagree with the Sad/Rabid Puppies, or feel loyalty to your co-workers—but please! Don’t insult our readers by claiming they don’t exist!\nReaders:  I realize that, in the age of electronics,this is an unprecedented request, but: if you have a strong opinion that you wish to be heard, it might help if you committed it to physical paper—perhaps along with a printout of your photo of your Tor book collection—and snail mailed it to Tor and Macmillan.\nMeanwhile, George Martin\ndemonstrates the truth of the aphorism\n: “SJWs always lie”:\nI have spoken out against name-calling from the first, Brad.  It is the\nPuppies and their supporters who started it, and who keep dialing it up.\nI will concede that you yourself have been mostly civil, but read the\ncomments in your own blog, or Correia’s, or even on FILE 770, and it is\nall venom and epithets.\nNo, Teresa Nielsen Hayden and Patrick Nielsen Hayden\nstarted the name-calling\nback in March 2005. Martin then goes on to do more of what SJWs always do, which, of course, is lie:\nThe vast majority of customers have no idea about any of this. The\n“unhappiness” here is a campaign orchestrated by the odious Mr. Beale,\nand once again you Sad Puppies have lined up behind the Rabids. Early in\nthis debate, I heard a lot of stuff from your side about careers being\nthreatened and your opponents saying “you will never work in this town\nagain” and similar crap. Not one instance of that was ever\nsubstantiated. But now we are seeing a deliberate internet campaign to\ncost someone their career — and it is coming from VD, with the full\nhowling support of Puppies of all stripes.\nNo one on “my side” ever threatened anyone’s livelihood or career.\nYour side is doing just that. In public.\nEmphasis added. That’s an absolutely absurd lie. Look at the post below for starters. Or look at\nthis list of victims\nof the ongoing SJW witch patrol. And even if we limit Martin’s claim to the small world of science fiction publishing, Charles Stross warned me that I’d somehow managed to unwittingly make “a career-limiting move” by writing an opinion column as a nationally syndicated opinion columnist\nten years ago\n. Martin is not telling the truth. Look, we all know that if Irene Gallo had called Tor’s customers “half-savages” or “hymies” or “faggots” instead of “racist, sexist, homophobic neo-Nazis”, she’d have been disappeared that same day. Are some customers less equal than others in the eyes of Tor Books? Are they less valued?\nNote that we’ve seen a Nobel laureate and a principal in Florida banished from the commons in just the two weeks since Ms Gallo’s public attack on Tor customers and Tor authors was first brought to Mr. Doherty’s attention. George Martin’s side has been waging war against people’s livelihoods and careers for years, if not decades. And his side knows it. Hence this little warning ten years ago:\n“The people who live and work and pitch their tents in this field have long memories. You’ll have to share the same field with them for a long time — decades, maybe — if you want to be in it at all. And you’ve just offended 75% of them? This is Not Clever. You may not need them now, but you have no idea what your circumstances will look like in ten years’ time…. In a corporate environment it’s sometimes termed a career-limiting move. I think you just made a career-limiting move.”\n– Charles Stross,\nMarch 5, 2005\nIn any event, the increased hysteria from the other side means that they know the pressure on Tor Books is growing, from above and from below. Their position is totally indefensible\nand they know it\n. So have you sent your three emails yet today? If not, why are you still reading this? If you oppose what you’ve been seeing, then it’s time to get out of the stands and get in the game. It’s time to tell Macmillan that you are a real person and your opinion counts.\ntom.dohertyATtor.com\nandrew.weberATmacmillan.com\nrhonda.brownATmacmillan.com\nSo much for that theory that there is no other side. Not only has this nonexistent other side, as per Mr. Martin, never done nothing to nobody, but they’re\nemailing Tor Books and Macmillan too\n. Because they are also real people who do “not want the community to\nreflect the views of Theodore Beale and his rabid puppies.” Of course, they’re missing the central point, which is that it is\nnot the job of anyone at Tor Books\nto play thought-police and eliminate those views from the community.",
  "tags": [
    "Puppies",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-15T11:00:00+00:00"
}