{
  "url": "https://voxday.net/2015/06/16/we-dont-care/",
  "scraped_at": "2025-12-16T12:59:44.601859",
  "title": "We DON’T care",
  "date_display": "June 16, 2015",
  "date_iso": "2015-06-16T12:00:00+00:00",
  "date_from_url": "2015-06-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>RapeSquared is still <a href=\"http://grrm.livejournal.com/429752.html?thread=21802680#t21802680\">crying about the Hugo Awards</a>:</p><blockquote class=\"tr_bq\"><p> What I saying is that you and your Puppies have dealt a terrible wound to a community that was very special to many of us. You’ve hurt people, and you go on hurting people, and you don’t seem to care… about the Hugos, about worldcon, about fandom, about any of it.</p></blockquote><p>Tell it to the VFM. We don’t <i>seem </i>to care? That hardly does our perspective justice. Seriously, what part of “we don’t care” is hard to understand? We don’t belong to your creepy rape-fetish kiddy-diddling community and we never wanted to belong to it. We just like reading good science fiction stories and your little community of freaks is standing squarely in the way of that these days. We’re not trying to destroy it, we’d just as soon go back to not really being aware that it existed, but we certainly don’t care if we happen to inadvertently bulldoze the freakshow in pursuit of our objectives.</p><p>If you want to blame someone for the current situation, GRRM, you should blame Patrick Nielsen Hayden. If he and the Toad of Tor hadn’t launched their unprovoked public attacks on me, if they had simply left a nationally syndicated opinion columnist alone to do his job writing opinion columns, and if the toadies and torlings hadn’t followed their lead and enthusiastically piled on, then I would have happily continued to ignore your very special collection of child molesters, shambling shoggoths, gamma males, and bearded weirdos of various sexes. And if you are foolish enough to continue attacking us for doing nothing more than defending ourselves and expressing our opinions, then we will certainly begin to care about your very special community.</p><p>But I don’t think you’re going to like it if we do.</p><p><a href=\"http://1.bp.blogspot.com/-tbc8YdVyXQ0/U2c9O9K6L-I/AAAAAAAAAzM/DJNWqJ7yFPo/s1600/transhuman_900.jpg\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" decoding=\"async\" fetchpriority=\"high\" height=\"320\" src=\"http://www.milobookclub.com/wp-content/uploads/2015/06/transhuman_900.jpg\" width=\"199\"/></a>On a tangential note, how can you not want to read John C. Wright’s Hugo-nominated <a href=\"http://www.amazon.com/Transhuman-Subhuman-Essays-Science-Fiction-ebook/dp/B00K4D7LO6\">TRANSHUMAN AND SUBHUMAN: Essays on Science Fiction and Awful Truth</a> with an unsolicited endorsement like this?</p><p><i>Then there were the “Transhuman and Subhuman” essays. Admittedly, they aren’t stories, but in that case, being “hit over the head” doesn’t properly describe the experience. Rather, reading the author’s extremely non-mainstream views felt like being at ground zero of a nuclear explosion after being dosed with anthrax and sprayed with nerve gas.</i></p><p>And here I thought science fiction was all about “dangerous visions” and unconventional thinking outside the mainstream. But needless to say, the last sentence is absolutely going on the back of the hardcover. So, what is your favorite essay from the collection? Mine is “The Big Three of Science Fiction”, with “John C. Wright’s Patented One-Session Lesson in the Mechanics of Fiction” being a close second.</p><p>And speaking of a desire for good stories, it’s good to learn that Terry Pratchett’s daughter has decided <a href=\"http://www.thebookseller.com/news/pratchetts-daughter-rules-out-discworld-follow-ons\">to prevent the further tarnishing</a> of her father’s literary legacy:</p><blockquote class=\"tr_bq\"><p> Terry Pratchett’s daughter has said she does not intend to write any Discworld novels, or give “anyone else permission to do so”. The legendary fantasy writer died in March this year at the age of 66. He had been suffering from Alzheimer’s.</p><p>Pratchett finished writing the 41st book of his hugely popular Discworld series in the summer of 2014: The Shepherd’s Crown will be released in the UK in August by Doubleday Children’s. Pratchett’s daughter Rhianna released a picture of the cover for The Shepherd’s Crown on Twitter, and in response to a fan who asked if it was the “final final” book by her father, confirmed that it would be.</p><p>She later added: “To reiterate – No I don’t intend on writing more Discworld novels, or giving anyone else permission to do so. They are sacred to dad.”</p></blockquote><p>In retrospect, I wish Pratchett had stopped with <i>Making Money</i>. The books that followed were noticeably inferior, although it wasn’t until <i>Snuff </i>that it became obvious that Pratchett simply wasn’t able to write anymore. It would be nice of <i>The Shepherd’s Crown</i> turns out to be one last hurrah for Discworld, but I’m not optimistic.</p></div>",
  "content_text": "RapeSquared is still\ncrying about the Hugo Awards\n:\nWhat I saying is that you and your Puppies have dealt a terrible wound to a community that was very special to many of us. You’ve hurt people, and you go on hurting people, and you don’t seem to care… about the Hugos, about worldcon, about fandom, about any of it.\nTell it to the VFM. We don’t\nseem\nto care? That hardly does our perspective justice. Seriously, what part of “we don’t care” is hard to understand? We don’t belong to your creepy rape-fetish kiddy-diddling community and we never wanted to belong to it. We just like reading good science fiction stories and your little community of freaks is standing squarely in the way of that these days. We’re not trying to destroy it, we’d just as soon go back to not really being aware that it existed, but we certainly don’t care if we happen to inadvertently bulldoze the freakshow in pursuit of our objectives.\nIf you want to blame someone for the current situation, GRRM, you should blame Patrick Nielsen Hayden. If he and the Toad of Tor hadn’t launched their unprovoked public attacks on me, if they had simply left a nationally syndicated opinion columnist alone to do his job writing opinion columns, and if the toadies and torlings hadn’t followed their lead and enthusiastically piled on, then I would have happily continued to ignore your very special collection of child molesters, shambling shoggoths, gamma males, and bearded weirdos of various sexes. And if you are foolish enough to continue attacking us for doing nothing more than defending ourselves and expressing our opinions, then we will certainly begin to care about your very special community.\nBut I don’t think you’re going to like it if we do.\nOn a tangential note, how can you not want to read John C. Wright’s Hugo-nominated\nTRANSHUMAN AND SUBHUMAN: Essays on Science Fiction and Awful Truth\nwith an unsolicited endorsement like this?\nThen there were the “Transhuman and Subhuman” essays. Admittedly, they aren’t stories, but in that case, being “hit over the head” doesn’t properly describe the experience. Rather, reading the author’s extremely non-mainstream views felt like being at ground zero of a nuclear explosion after being dosed with anthrax and sprayed with nerve gas.\nAnd here I thought science fiction was all about “dangerous visions” and unconventional thinking outside the mainstream. But needless to say, the last sentence is absolutely going on the back of the hardcover. So, what is your favorite essay from the collection? Mine is “The Big Three of Science Fiction”, with “John C. Wright’s Patented One-Session Lesson in the Mechanics of Fiction” being a close second.\nAnd speaking of a desire for good stories, it’s good to learn that Terry Pratchett’s daughter has decided\nto prevent the further tarnishing\nof her father’s literary legacy:\nTerry Pratchett’s daughter has said she does not intend to write any Discworld novels, or give “anyone else permission to do so”. The legendary fantasy writer died in March this year at the age of 66. He had been suffering from Alzheimer’s.\nPratchett finished writing the 41st book of his hugely popular Discworld series in the summer of 2014: The Shepherd’s Crown will be released in the UK in August by Doubleday Children’s. Pratchett’s daughter Rhianna released a picture of the cover for The Shepherd’s Crown on Twitter, and in response to a fan who asked if it was the “final final” book by her father, confirmed that it would be.\nShe later added: “To reiterate – No I don’t intend on writing more Discworld novels, or giving anyone else permission to do so. They are sacred to dad.”\nIn retrospect, I wish Pratchett had stopped with\nMaking Money\n. The books that followed were noticeably inferior, although it wasn’t until\nSnuff\nthat it became obvious that Pratchett simply wasn’t able to write anymore. It would be nice of\nThe Shepherd’s Crown\nturns out to be one last hurrah for Discworld, but I’m not optimistic.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2015-06-16T11:00:00+00:00"
}