{
  "url": "https://voxday.net/2015/06/26/wed-like-you-better-if-you-were-losing/",
  "scraped_at": "2025-12-16T13:00:58.418313",
  "title": "We’d like you better if you were losing",
  "date_display": "June 26, 2015",
  "date_iso": "2015-06-26T09:47:00+00:00",
  "date_from_url": "2015-06-26",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>The commenters at File 770 have some advice for the Puppies:</p><blockquote class=\"tr_bq\"><p> Shambles: <i>“I think a good thing for the puppies would be new leadership; an even better thing would be to walk away from Beale; and the best thing would be to realize each member is welcome as an individual and it’s not necessary to create voting blocks for individually nominated and voted upon awards.” </i></p><p>Bruce Baugh: All of this. Having a collaborative effort to assess and improve conservative fans’ and creators’ image within fandom seems well worthwhile, but it needs to come from someone who hasn’t glorified hate-mongering and vandalism and who actually does respect other fans and the volunteers who make this all happen.</p></blockquote><p>Ah, if only we were more like them and had new leadership who respected them and was more interested in improving our image in their eyes than in drinking wine from their silvered skulls. Although to be honest, the more I read what they write, the more I fear they won’t make for much more than shot glasses.</p><p>What do you say, Rabids? In the place of a Dark Lord shall there be a Bright and Obsequious Queen, who shall make it her top priority to seek favor in the eyes of science fiction’s SJWs?</p><p>Or shall we make ourselves thrones of their bones once the VFM are done chewing on them?</p></div>",
  "content_text": "The commenters at File 770 have some advice for the Puppies:\nShambles:\n“I think a good thing for the puppies would be new leadership; an even better thing would be to walk away from Beale; and the best thing would be to realize each member is welcome as an individual and it’s not necessary to create voting blocks for individually nominated and voted upon awards.”\nBruce Baugh: All of this. Having a collaborative effort to assess and improve conservative fans’ and creators’ image within fandom seems well worthwhile, but it needs to come from someone who hasn’t glorified hate-mongering and vandalism and who actually does respect other fans and the volunteers who make this all happen.\nAh, if only we were more like them and had new leadership who respected them and was more interested in improving our image in their eyes than in drinking wine from their silvered skulls. Although to be honest, the more I read what they write, the more I fear they won’t make for much more than shot glasses.\nWhat do you say, Rabids? In the place of a Dark Lord shall there be a Bright and Obsequious Queen, who shall make it her top priority to seek favor in the eyes of science fiction’s SJWs?\nOr shall we make ourselves thrones of their bones once the VFM are done chewing on them?",
  "tags": [
    "Puppies",
    "SJW"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-26T08:47:00+00:00"
}