{
  "url": "https://voxday.net/2015/06/06/wright-vs-banks/",
  "scraped_at": "2025-12-16T12:58:34.500216",
  "title": "Wright vs Banks",
  "date_display": "June 6, 2015",
  "date_iso": "2015-06-06T22:14:00+00:00",
  "date_from_url": "2015-06-06",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Or if you prefer, Hugo nominee vs PhD. A few weeks ago, Phil Sandifer challenged me to a literary debate. He suggested we each select a work we particularly disliked that the other individual favored and take turns criticizing and defending it.</p><p>He chose the Hugo-nominated “One Bright Star to Guide Them” by John C. Wright. I selected one of the BBC’s top 100 novels, <i>The Wasp Factory</i>, by Iain M. Banks, which in my opinion is one of the worst books I have ever read. We’re doing the debate tonight, it will be recorded and broadcast later on “a lefty sci-fi podcast called Pex Lives”.</p><p>Phil is not what you would call one <a href=\"http://www.philipsandifer.com/2015/04/guided-by-beauty-of-their-weapons.html\">of my biggest fans</a>, but he’s been here on and off of late and has comported himself impeccably, so it should be an interesting and civil discussion, if nothing else. We would appear to be rather more in his wheelhouse than mine, but it’s always interesting to venture out onto new ground.</p><p>Anyhow, I’ll let you know when the podcast is broadcast and will link to the transcript when it is available.</p><p>UPDATE: We went about 1:45 and while there was an amount of talking past each other, I think the discussion was fairly substantive on the whole. It definitely illustrated the size of the gap, or rather, massive chasm, that separates our opinions of what a good book is, but there was the occasional common ground to be found too.</p><p>I’ll leave it to the listeners to decide whose perspective was more compelling, but I was satisfied with both the case I made for “One Bright Star to Guide Them” as well as my case against <i>The Wasp Factory</i>. And while I don’t agree with either of Phil’s arguments, I now have a much better understanding of why he feels so differently about both works.</p><p>I will provide the links once Pex Lives provides them to me.</p></div>",
  "content_text": "Or if you prefer, Hugo nominee vs PhD. A few weeks ago, Phil Sandifer challenged me to a literary debate. He suggested we each select a work we particularly disliked that the other individual favored and take turns criticizing and defending it.\nHe chose the Hugo-nominated “One Bright Star to Guide Them” by John C. Wright. I selected one of the BBC’s top 100 novels,\nThe Wasp Factory\n, by Iain M. Banks, which in my opinion is one of the worst books I have ever read. We’re doing the debate tonight, it will be recorded and broadcast later on “a lefty sci-fi podcast called Pex Lives”.\nPhil is not what you would call one\nof my biggest fans\n, but he’s been here on and off of late and has comported himself impeccably, so it should be an interesting and civil discussion, if nothing else. We would appear to be rather more in his wheelhouse than mine, but it’s always interesting to venture out onto new ground.\nAnyhow, I’ll let you know when the podcast is broadcast and will link to the transcript when it is available.\nUPDATE: We went about 1:45 and while there was an amount of talking past each other, I think the discussion was fairly substantive on the whole. It definitely illustrated the size of the gap, or rather, massive chasm, that separates our opinions of what a good book is, but there was the occasional common ground to be found too.\nI’ll leave it to the listeners to decide whose perspective was more compelling, but I was satisfied with both the case I made for “One Bright Star to Guide Them” as well as my case against\nThe Wasp Factory\n. And while I don’t agree with either of Phil’s arguments, I now have a much better understanding of why he feels so differently about both works.\nI will provide the links once Pex Lives provides them to me.",
  "tags": [
    "debate"
  ],
  "categories": [],
  "sitemap_lastmod": "2015-06-06T21:14:00+00:00"
}