{
  "url": "https://voxday.net/2015/06/16/your-tor-books/",
  "scraped_at": "2025-12-16T12:59:47.888037",
  "title": "Your Tor books",
  "date_display": "June 16, 2015",
  "date_iso": "2015-06-16T18:30:00+00:00",
  "date_from_url": "2015-06-16",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>George Rape Rape Martin is on a roll. In addition to crying about his wounds, he has mocked Tor Books author Jagi Lamplighter’s attempt to show Tor Books that <a href=\"http://www.ljagilamplighter.com/2015/06/15/i-am-not-a-robot-i-am-a-free-fan/\">it is their longtime customers</a> who are being attacked by their senior employees and attempted to belittle the number of people wanting to see Irene Gallo held responsible for her public attacks on Tor books, Tor authors, and Tor customers.</p><blockquote class=\"tr_bq\"><p> Oh, wow.  How many pictures there?  Twenty? “Naked with a hat” day gets a hundred times as many….</p><p>You know, one thing I have learned about internet wars is that the mobs are seldom really as big as they appear. I wonder about this “heap-load” of readers. How big a heap? How many? When all is said and done, I think more readers will be rallying to the defense of Tor against the Puppy attacks than are presently attacking the company and calling for boycotts. Time will tell, I guess….</p><p>I have been doing what I can here to try and keep things civil and find<br> some common ground with the Sads, at least — I have nothing but<br> contempt for the Rabids — but it is becoming apparent that this is a<br> losing cause.</br></br></br></p></blockquote><p>I just sent Jagi the picture of my 53 books. Call RapeSquared’s bluff and send her yours at lampwrightATgmail.com. You’re going to need them for Friday anyhow.</p><p>Anyhow, I have no sympathy for the fat bastard. Not after they killed Myranda in the Season Five finale and ruined the only true love story on the show.</p></div>",
  "content_text": "George Rape Rape Martin is on a roll. In addition to crying about his wounds, he has mocked Tor Books author Jagi Lamplighter’s attempt to show Tor Books that\nit is their longtime customers\nwho are being attacked by their senior employees and attempted to belittle the number of people wanting to see Irene Gallo held responsible for her public attacks on Tor books, Tor authors, and Tor customers.\nOh, wow.  How many pictures there?  Twenty? “Naked with a hat” day gets a hundred times as many….\nYou know, one thing I have learned about internet wars is that the mobs are seldom really as big as they appear. I wonder about this “heap-load” of readers. How big a heap? How many? When all is said and done, I think more readers will be rallying to the defense of Tor against the Puppy attacks than are presently attacking the company and calling for boycotts. Time will tell, I guess….\nI have been doing what I can here to try and keep things civil and find\nsome common ground with the Sads, at least — I have nothing but\ncontempt for the Rabids — but it is becoming apparent that this is a\nlosing cause.\nI just sent Jagi the picture of my 53 books. Call RapeSquared’s bluff and send her yours at lampwrightATgmail.com. You’re going to need them for Friday anyhow.\nAnyhow, I have no sympathy for the fat bastard. Not after they killed Myranda in the Season Five finale and ruined the only true love story on the show.",
  "tags": [],
  "categories": [],
  "sitemap_lastmod": "2015-06-16T17:30:00+00:00"
}