{
  "url": "https://voxday.net/2011/11/25/destroying-currency-to-save-i/",
  "scraped_at": "2025-12-13T23:28:17.510936",
  "title": "Destroying the currency to save it",
  "date_display": "November 25, 2011",
  "date_iso": "2011-11-25T20:10:00+00:00",
  "date_from_url": "2011-11-25",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Apparently no one thought through <a href=\"http://www.telegraph.co.uk/finance/comment/jeremy-warner/8913884/Death-of-a-currency-as-eurogeddon-approaches.html\">the obvious implications</a> of refusing to recognize an obvious credit event:</p><blockquote><p>[P]erhaps the biggest sin of the lot was effectively to render all credit default swaps (a form of insurance against default) on sovereign debt essentially worthless, or void, by making the Greek default “voluntary”.</p><p>This has made it impossible to hedge against eurozone sovereign debt purchases, and thereby destroyed the market. Worse, it’s made investors believe that the euro cannot be trusted, that it’ll repeatedly find ways of reneging on contract. That’s the point of no return. This is no longer a serious currency.</p></blockquote><p>It’s really astonishing that the European Union has refused to recognize that Greece has gone bankrupt.  In trying to save the banks holding sovereign Greek debt, they went and destroyed the value of all the trillions in credit default swaps.  It’s like declaring that corpses aren’t really dead, so therefore the insurance companies don’t have to pay out on any life insurance policies.  That might save a company or two in the short term, but it destroys them all in the intermediate term for the obvious reason that <i>no one is ever going to waste their money on life insurance again</i>.</p></div>",
  "content_text": "Apparently no one thought through\nthe obvious implications\nof refusing to recognize an obvious credit event:\n[P]erhaps the biggest sin of the lot was effectively to render all credit default swaps (a form of insurance against default) on sovereign debt essentially worthless, or void, by making the Greek default “voluntary”.\nThis has made it impossible to hedge against eurozone sovereign debt purchases, and thereby destroyed the market. Worse, it’s made investors believe that the euro cannot be trusted, that it’ll repeatedly find ways of reneging on contract. That’s the point of no return. This is no longer a serious currency.\nIt’s really astonishing that the European Union has refused to recognize that Greece has gone bankrupt.  In trying to save the banks holding sovereign Greek debt, they went and destroyed the value of all the trillions in credit default swaps.  It’s like declaring that corpses aren’t really dead, so therefore the insurance companies don’t have to pay out on any life insurance policies.  That might save a company or two in the short term, but it destroys them all in the intermediate term for the obvious reason that\nno one is ever going to waste their money on life insurance again\n.",
  "tags": [
    "banks",
    "EU"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-25T20:10:00+00:00"
}