{
  "url": "https://voxday.net/2011/11/11/downside-of-meritocracy/",
  "scraped_at": "2025-12-13T23:27:02.513889",
  "title": "The downside of meritocracy",
  "date_display": "November 11, 2011",
  "date_iso": "2011-11-11T10:39:00+00:00",
  "date_from_url": "2011-11-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Ross Douthat explains <a href=\"http://www.nytimes.com/2011/11/06/opinion/sunday/douthat-our-reckless-meritocracy.html?_r=1&amp;ref=opinion\">the dangerous downside</a> to America’s experiment in meritocracy:</p><blockquote><p>For decades, the United States has been opening paths to privilege for its brightest and most determined young people, culling the best and the brightest from Illinois and Mississippi and Montana and placing them in positions of power in Manhattan and Washington. By elevating the children of farmers and janitors as well as lawyers and stockbrokers, we’ve created what seems like the most capable, hardworking, high-I.Q. elite in all of human history.</p><p>And for the last 10 years, we’ve watched this same elite lead us off a cliff — mostly by being too smart for its own good.</p><p>In hereditary aristocracies, debacles tend to flow from stupidity and pigheadedness: think of the Charge of the Light Brigade or the Battle of the Somme. In one-party states, they tend to flow from ideological mania: think of China’s Great Leap Forward, or Stalin’s experiment with “Lysenkoist” agriculture.</p><p>In meritocracies, though, it’s the very intelligence of our leaders that creates the worst disasters. Convinced that their own skills are equal to any task or challenge, meritocrats take risks that lower-wattage elites would never even contemplate, embark on more hubristic projects, and become infatuated with statistical models that hold out the promise of a perfectly rational and frictionless world. (Or as Calvin Trillin put it in these pages, quoting a tweedy WASP waxing nostalgic for the days when Wall Street was dominated by his fellow bluebloods: “Do you think our guys could have invented, say, credit default swaps? Give me a break! They couldn’t have done the math.”)</p></blockquote><p>Hubris on the part of the highly intelligent is particularly stupid because it reflects both ignorance and a lack of self-awareness.  For example, I am in the top one percent of the top one percent when it comes to intelligence, and yet I could provide you with an encyclopedia of my mistakes, failures, and errors in judgment.  I doubt that I have made any fewer of them than the average individual, but they do tend to be of a different order.</p><p>For example, was it the right thing to write <i>The War in Heaven</i> instead of Blizzard’s first <i>Starcraft </i>novel?  Almost surely not.  As it turns out, creating your own intellectual property from the start is less effective than riding someone else’s media tie-in wave, building a following from it, and then publishing your own material.  My decision certainly made sense and was intellectually defensible at the time, but in retrospect it was a serious blunder.</p><p>Douthat doesn’t have it quite right, however.  The problem with the mistakes of the meritocratic elite isn’t that they are too smart for their own good, it is that they are too smart for everyone else’s good.  This is why technocratic visions so often go so badly awry, and why the Socratic dream of a government of philosopher-kings has almost invariably proven to be worse than the variously flawed alternatives.  The worst aspect of a meritocracy is its lack of respect for tradition.  Meritocracy represents the ultimate triumph of theory and potential over experience and reliability, so it should come as little surprise that by historical standards, the new meritocratic societies appear to be destroying themselves in a remarkably short period of time.</p><p>In the end, however, Douthat misses the point.  A society will benefit most from being ruled by its best, not its brightest.  As one of this society’s brightest, I can attest that the members of a society’s intellectual elite are no more likely to merit being described as its best than the average individual and they possess no more intrinsic right to rule by virtue of their intelligence than the obese elite do by virtue of their weight.</p></div>",
  "content_text": "Ross Douthat explains\nthe dangerous downside\nto America’s experiment in meritocracy:\nFor decades, the United States has been opening paths to privilege for its brightest and most determined young people, culling the best and the brightest from Illinois and Mississippi and Montana and placing them in positions of power in Manhattan and Washington. By elevating the children of farmers and janitors as well as lawyers and stockbrokers, we’ve created what seems like the most capable, hardworking, high-I.Q. elite in all of human history.\nAnd for the last 10 years, we’ve watched this same elite lead us off a cliff — mostly by being too smart for its own good.\nIn hereditary aristocracies, debacles tend to flow from stupidity and pigheadedness: think of the Charge of the Light Brigade or the Battle of the Somme. In one-party states, they tend to flow from ideological mania: think of China’s Great Leap Forward, or Stalin’s experiment with “Lysenkoist” agriculture.\nIn meritocracies, though, it’s the very intelligence of our leaders that creates the worst disasters. Convinced that their own skills are equal to any task or challenge, meritocrats take risks that lower-wattage elites would never even contemplate, embark on more hubristic projects, and become infatuated with statistical models that hold out the promise of a perfectly rational and frictionless world. (Or as Calvin Trillin put it in these pages, quoting a tweedy WASP waxing nostalgic for the days when Wall Street was dominated by his fellow bluebloods: “Do you think our guys could have invented, say, credit default swaps? Give me a break! They couldn’t have done the math.”)\nHubris on the part of the highly intelligent is particularly stupid because it reflects both ignorance and a lack of self-awareness.  For example, I am in the top one percent of the top one percent when it comes to intelligence, and yet I could provide you with an encyclopedia of my mistakes, failures, and errors in judgment.  I doubt that I have made any fewer of them than the average individual, but they do tend to be of a different order.\nFor example, was it the right thing to write\nThe War in Heaven\ninstead of Blizzard’s first\nStarcraft\nnovel?  Almost surely not.  As it turns out, creating your own intellectual property from the start is less effective than riding someone else’s media tie-in wave, building a following from it, and then publishing your own material.  My decision certainly made sense and was intellectually defensible at the time, but in retrospect it was a serious blunder.\nDouthat doesn’t have it quite right, however.  The problem with the mistakes of the meritocratic elite isn’t that they are too smart for their own good, it is that they are too smart for everyone else’s good.  This is why technocratic visions so often go so badly awry, and why the Socratic dream of a government of philosopher-kings has almost invariably proven to be worse than the variously flawed alternatives.  The worst aspect of a meritocracy is its lack of respect for tradition.  Meritocracy represents the ultimate triumph of theory and potential over experience and reliability, so it should come as little surprise that by historical standards, the new meritocratic societies appear to be destroying themselves in a remarkably short period of time.\nIn the end, however, Douthat misses the point.  A society will benefit most from being ruled by its best, not its brightest.  As one of this society’s brightest, I can attest that the members of a society’s intellectual elite are no more likely to merit being described as its best than the average individual and they possess no more intrinsic right to rule by virtue of their intelligence than the obese elite do by virtue of their weight.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-11T10:39:00+00:00"
}