{
  "url": "https://voxday.net/2011/11/21/end-of-casino/",
  "scraped_at": "2025-12-13T23:27:59.164287",
  "title": "The end of the casino",
  "date_display": "November 21, 2011",
  "date_iso": "2011-11-21T18:00:00+00:00",
  "date_from_url": "2011-11-21",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I don’t think we’re actually quite there yet, but perhaps we can hope that <a href=\"http://market-ticker.org/akcs-www?post=197878\">the end is in sight</a>:</p><blockquote><p>CNBC is reporting that there are now clients running out of the markets entirely because they do not believe their customer funds are safe.</p><p>That’s the end of it.  The belief that there are more MF Globals has now taken hold.  The thieves have pushed it too far and now we’ve got the start of a global liquidity run, and with good reason.</p><p>The authorities both in the regulatory side and on the prosecutorial side have reufsed to put a stop to the thievery and now the risk factors have turned into realized risk.</p><p>The market is done folks.  You can be right but if you make your bet in the markets, are right, and then get screwed anyway when someone steals the money and nobody goes to jail there comes a time when people begin to understand that it can happen to them and will unless they depart the market.</p><p>We’re there folks.</p></blockquote><p>This accompanies news from ZeroHedge that Corzine and the banksters at MF Global <a href=\"http://www.zerohedge.com/news/mf-global-trustee-says-commingling-shortfall-may-be-double-previous-estimate-could-reach-12-bil\">legally stole more than $1.2 billion</a> of their clients’ money and “invested” it on MF Global’s behalf prior to losing it.  I’ve been saying Wall Street is a casino, not an investment market, for years and recommended staying away from it.  But if you’re putting money in the market now, with the knowledge that you can lose your money <i>even if you bet correctly</i>, you’re just stupid.</p><p>Ironically, small businesses will probably find it much easier to find investment once the casino is abandoned en masse, since investors will tend to go back to investing capital in actual companies instead of paper instruments leveraged to fictional paper assets.</p></div>",
  "content_text": "I don’t think we’re actually quite there yet, but perhaps we can hope that\nthe end is in sight\n:\nCNBC is reporting that there are now clients running out of the markets entirely because they do not believe their customer funds are safe.\nThat’s the end of it.  The belief that there are more MF Globals has now taken hold.  The thieves have pushed it too far and now we’ve got the start of a global liquidity run, and with good reason.\nThe authorities both in the regulatory side and on the prosecutorial side have reufsed to put a stop to the thievery and now the risk factors have turned into realized risk.\nThe market is done folks.  You can be right but if you make your bet in the markets, are right, and then get screwed anyway when someone steals the money and nobody goes to jail there comes a time when people begin to understand that it can happen to them and will unless they depart the market.\nWe’re there folks.\nThis accompanies news from ZeroHedge that Corzine and the banksters at MF Global\nlegally stole more than $1.2 billion\nof their clients’ money and “invested” it on MF Global’s behalf prior to losing it.  I’ve been saying Wall Street is a casino, not an investment market, for years and recommended staying away from it.  But if you’re putting money in the market now, with the knowledge that you can lose your money\neven if you bet correctly\n, you’re just stupid.\nIronically, small businesses will probably find it much easier to find investment once the casino is abandoned en masse, since investors will tend to go back to investing capital in actual companies instead of paper instruments leveraged to fictional paper assets.",
  "tags": [
    "banks"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-21T18:00:00+00:00"
}