{
  "url": "https://voxday.net/2011/11/14/epic-come/",
  "scraped_at": "2025-12-13T23:27:20.698490",
  "title": "The epic cometh",
  "date_display": "November 14, 2011",
  "date_iso": "2011-11-14T14:30:00+00:00",
  "date_from_url": "2011-11-14",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’m pleased to let those who are interested know that Marcher Lord and I have agreed upon terms for the publication of the first book in the forthcoming <i>Arts of Dark and Light</i> series.  I won’t say much about it now except to mention that it is set in the world of <i>Summa Elvetica</i>, Marcus Valerius is one of the protagonists, and it is going to be one big fat fantasy novel of more than 700 pages.  It will be available in print and ebook format, and I think I can just about guarantee that the cover art will be even more spectacular than SE’s.  We anticipate its release in October next year.</p><p>We’re also looking at a re-release of <i>Summa Elvetica</i> with the inclusion of an additional novella which concerns Lodi and one of the protagonists of the aforementioned novel.</p></div>",
  "content_text": "I’m pleased to let those who are interested know that Marcher Lord and I have agreed upon terms for the publication of the first book in the forthcoming\nArts of Dark and Light\nseries.  I won’t say much about it now except to mention that it is set in the world of\nSumma Elvetica\n, Marcus Valerius is one of the protagonists, and it is going to be one big fat fantasy novel of more than 700 pages.  It will be available in print and ebook format, and I think I can just about guarantee that the cover art will be even more spectacular than SE’s.  We anticipate its release in October next year.\nWe’re also looking at a re-release of\nSumma Elvetica\nwith the inclusion of an additional novella which concerns Lodi and one of the protagonists of the aforementioned novel.",
  "tags": [
    "writing"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-14T14:30:00+00:00"
}