{
  "url": "https://voxday.net/2011/11/09/fearful-foundations-of-fourth-reic/",
  "scraped_at": "2025-12-13T23:26:51.510448",
  "title": "The fearful foundations of the Fourth Reich",
  "date_display": "November 9, 2011",
  "date_iso": "2011-11-09T12:28:00+00:00",
  "date_from_url": "2011-11-09",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I wrote that a few years ago in a column about TARP.  But things are arguably even worse in Europe, where the bankers have forced two non-democratic changes in government in Greece and Italy.  But don’t think things can’t go from bad to worse; the normally sane Ambrose Evans-Pritchard is freaked out to the point that <a href=\"http://blogs.telegraph.co.uk/finance/ambroseevans-pritchard/100013198/america-and-china-must-crush-germany-into-submission/\">he is calling for diplomatic and economic war</a> rather than simply allowing the whole debacle to collapse under its own weight.</p><blockquote><p>In Italy they have already made matters worse. I doubt that much will change with “technocratic governments” in either Greece and Italy, yet immense damage has been done to democratic accountability.  The EU Project has become both dangerous and insane….</p><p>You cannot allow the biggest bankruptcy in history to run its course – with calamitous domino implications – before all options have been exhausted.</p><p>One can only guess what is happening in the great global centres of power, but it would not surprise me if US President Barack Obama and China’s Hu Jintao start to intervene very soon, in unison and with massive diplomatic force.  One can imagine joint telephone calls to Chancellor Angela Merkel more or less ordering her country to face up to the implications of the monetary union that Germany itself created and ran (badly).</p><p>Yes, this means mobilizing the full-firepower of the ECB – with a pledge to change EU Treaty law and the bank’s mandate – and perhaps some form of quantum leap towards a fiscal and debt union.</p></blockquote><p>In other words, because the EU is an evil financial empire on the verge of collapse, the US and China should intervene, prop it up, and help it transform itself into the literal Fourth Reich.  Since Evans-Pritchard has generally been an intelligent and reasonable observer of past EU antics, the hysterical nature of this column should suffice to demonstrate the extraordinarily dangerous nature of the situation.</p><p>And he’s wrong.  The bankruptcy is going to happen no matter what measures are taken.  The financial media has learned nothing from 2008.  Desperately delaying the necessary surgery is not going to improve the chances that the patient will survive.</p></div>",
  "content_text": "I wrote that a few years ago in a column about TARP.  But things are arguably even worse in Europe, where the bankers have forced two non-democratic changes in government in Greece and Italy.  But don’t think things can’t go from bad to worse; the normally sane Ambrose Evans-Pritchard is freaked out to the point that\nhe is calling for diplomatic and economic war\nrather than simply allowing the whole debacle to collapse under its own weight.\nIn Italy they have already made matters worse. I doubt that much will change with “technocratic governments” in either Greece and Italy, yet immense damage has been done to democratic accountability.  The EU Project has become both dangerous and insane….\nYou cannot allow the biggest bankruptcy in history to run its course – with calamitous domino implications – before all options have been exhausted.\nOne can only guess what is happening in the great global centres of power, but it would not surprise me if US President Barack Obama and China’s Hu Jintao start to intervene very soon, in unison and with massive diplomatic force.  One can imagine joint telephone calls to Chancellor Angela Merkel more or less ordering her country to face up to the implications of the monetary union that Germany itself created and ran (badly).\nYes, this means mobilizing the full-firepower of the ECB – with a pledge to change EU Treaty law and the bank’s mandate – and perhaps some form of quantum leap towards a fiscal and debt union.\nIn other words, because the EU is an evil financial empire on the verge of collapse, the US and China should intervene, prop it up, and help it transform itself into the literal Fourth Reich.  Since Evans-Pritchard has generally been an intelligent and reasonable observer of past EU antics, the hysterical nature of this column should suffice to demonstrate the extraordinarily dangerous nature of the situation.\nAnd he’s wrong.  The bankruptcy is going to happen no matter what measures are taken.  The financial media has learned nothing from 2008.  Desperately delaying the necessary surgery is not going to improve the chances that the patient will survive.",
  "tags": [
    "banks",
    "EU",
    "trainwreck"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-09T12:28:00+00:00"
}