{
  "url": "https://voxday.net/2011/11/07/gauging-interes/",
  "scraped_at": "2025-12-13T23:26:42.322740",
  "title": "Gauging interest",
  "date_display": "November 7, 2011",
  "date_iso": "2011-11-07T15:00:00+00:00",
  "date_from_url": "2011-11-07",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I’ve been hearing from a few people here and there that they would be interested in seeing me write a basic economics textbook that could be used as a homeschooling resource.  I have to admit that while the idea is of some interest to me, it isn’t something that I’ve ever contemplated too seriously in the past because most textbooks are written by academics with PhDs who sell them to captive college audiences.  And, of course, there is no shortage of them, so why would the world need another one?</p><p>On the other hand, a look at Greg Mankiw’s textbook, which is used at Harvard where he teaches, offers a very strong counterpoint to that argument.  Consider what he declares to be the Ten Principles of Economics in his textbook entitled <i>Principles of Economics</i>:</p><p><i>1.  People Face Tradeoffs.<br> 2.  The Cost of Something Is What You Give Up to Get It<br> 3.  Rational People Think at the Margin<br> 4.  People Respond to Incentives<br> 5.  Trade Can Make Everyone Better Off<br> 6.  Markets Are Usually a Good Way to Organize Economic Activity<br> 7.  Governments Can Sometimes Improve Market Outcomes<br> 8.  A Country’s Standard of Living Depends on Its Ability to Produce Goods and Services<br> 9.  Prices Rise When the Government Prints Too Much Money<br> 10. Society Faces a Short-Run Trade-off between Inflation and Unemployment</br></br></br></br></br></br></br></br></br></i></p><p>Reading this, my first thought is that it is no wonder some of his students walked out of his class.  My second one is that it is no mystery why Mankiw failed to see the 2008 crisis developing and still fails to recognize the current economic depression.  My third thought is that perhaps a text on basic economic principles and history is in order after all.</p><p>When I look at Mankiw’s principles, I see two reasonably solid ones, (1,2), four that are obviously incorrect or incomplete to the point of being misleading, (3,5,7,10), and four that are merely irrelevant due to being incomplete. (4,6,8,9).</p><p>Anyhow, I have to finish the current novel first, which will be sometime next summer, but it’s not too early to start taking notes and looking at the deficiencies of current textbooks.  So, the two things I’d be interested in knowing is how many people might be interested in an electronic econ textbook priced around $4.99 and what areas merit being covered.  For example, Felsenburgh suggested that a proper economics education should begin with the School of Salamanca, but that is obviously insane to anyone who has actually read Rothbard’s <i>History of Economic Thought</i>.  I don’t think even homeschooled students would be able to stay focused on an economics course that begins with a diverse group of people predominantly grouped together on the basis of their arguments for the legitimacy of usury.</p><p>This isn’t to say that the Salamancans aren’t important or denigrate their contributions to economic thought, only that they are not exactly the ideal point of entry to the field.</p></div>",
  "content_text": "I’ve been hearing from a few people here and there that they would be interested in seeing me write a basic economics textbook that could be used as a homeschooling resource.  I have to admit that while the idea is of some interest to me, it isn’t something that I’ve ever contemplated too seriously in the past because most textbooks are written by academics with PhDs who sell them to captive college audiences.  And, of course, there is no shortage of them, so why would the world need another one?\nOn the other hand, a look at Greg Mankiw’s textbook, which is used at Harvard where he teaches, offers a very strong counterpoint to that argument.  Consider what he declares to be the Ten Principles of Economics in his textbook entitled\nPrinciples of Economics\n:\n1.  People Face Tradeoffs.\n2.  The Cost of Something Is What You Give Up to Get It\n3.  Rational People Think at the Margin\n4.  People Respond to Incentives\n5.  Trade Can Make Everyone Better Off\n6.  Markets Are Usually a Good Way to Organize Economic Activity\n7.  Governments Can Sometimes Improve Market Outcomes\n8.  A Country’s Standard of Living Depends on Its Ability to Produce Goods and Services\n9.  Prices Rise When the Government Prints Too Much Money\n10. Society Faces a Short-Run Trade-off between Inflation and Unemployment\nReading this, my first thought is that it is no wonder some of his students walked out of his class.  My second one is that it is no mystery why Mankiw failed to see the 2008 crisis developing and still fails to recognize the current economic depression.  My third thought is that perhaps a text on basic economic principles and history is in order after all.\nWhen I look at Mankiw’s principles, I see two reasonably solid ones, (1,2), four that are obviously incorrect or incomplete to the point of being misleading, (3,5,7,10), and four that are merely irrelevant due to being incomplete. (4,6,8,9).\nAnyhow, I have to finish the current novel first, which will be sometime next summer, but it’s not too early to start taking notes and looking at the deficiencies of current textbooks.  So, the two things I’d be interested in knowing is how many people might be interested in an electronic econ textbook priced around $4.99 and what areas merit being covered.  For example, Felsenburgh suggested that a proper economics education should begin with the School of Salamanca, but that is obviously insane to anyone who has actually read Rothbard’s\nHistory of Economic Thought\n.  I don’t think even homeschooled students would be able to stay focused on an economics course that begins with a diverse group of people predominantly grouped together on the basis of their arguments for the legitimacy of usury.\nThis isn’t to say that the Salamancans aren’t important or denigrate their contributions to economic thought, only that they are not exactly the ideal point of entry to the field.",
  "tags": [
    "economics"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-07T15:00:00+00:00"
}