{
  "url": "https://voxday.net/2011/11/02/hiding-decline-again/",
  "scraped_at": "2025-12-13T23:26:11.788845",
  "title": "Hiding the decline again",
  "date_display": "November 2, 2011",
  "date_iso": "2011-11-02T11:31:00+00:00",
  "date_from_url": "2011-11-02",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Richard Muller is the latest “scientist” to attempt to pass off <a href=\"http://hotair.com/archives/2011/10/30/surprise-no-warming-in-last-11-years/\">another an AGW/CC fraud</a>:</p><blockquote><p>Last week, a research team at Berkeley led by a former climate change skeptic released a study of global temperatures that intended to set the record straight on controversial data collected by the East Anglia Project, NASA, and other organizations that have acted as advocates for action based on anthropogenic global warming.  Professor Richard Muller put together a graph of the data that supposedly showed warming from 1800 (roughly the beginning of the Industrial Era in Europe) through 1975, and then a steeper rise in temperatures that appears unstopped.  When this data was released, newspapers and other media proclaimed it the end of AGW skepticism and demanded capitulation from the “deniers.”…</p><p>A closer look at the data and a Daily Mail interview with one of Muller’s team shows that the chart hides the fact that no warming has occurred in the last 11 years, as has been repeatedly pointed out:</p><p><i>Prof Judith Curry, who chairs the Department of Earth and Atmospheric Sciences at America’s prestigious Georgia Institute of Technology, said that Prof Muller’s claim that he has proven global warming sceptics wrong was also a ‘huge mistake’, with no  scientific basis.  Prof Curry is a distinguished climate researcher with more than 30 years experience and the second named co-author of the BEST project’s four research papers.</i></p><p>Her comments, in an exclusive interview with The Mail on Sunday, seem certain to ignite a furious academic row. She said this affair had to be compared to the notorious ‘Climategate’ scandal two years ago. …</p><p>In fact, Prof Curry said, the project’s research data show there has been no increase in world temperatures since the end of the Nineties – a fact confirmed by a new analysis that The Mail on Sunday has obtained.  ‘There is no scientific basis for saying that warming hasn’t stopped,’ she said. ‘To say that there is detracts from the credibility of the data, which is very unfortunate.’</p><p>Let’s take a look at Muller’s chart, and then compare it to the chart for the last 13 years — which the Daily Mail labels an “inconvenient truth”:</p><p>First, let’s look at the top chart.  A closer reading of the top chart shows that, relative to the 1950-1980 average baseline BEST uses, temperatures didn’t actually warm at all until sometime during the Great Depression, so the entire first century of the Industrial Era apparently had no impact — in a period where the dirtiest of mass energy production processes was in widest use (coal).  Temperatures then started to slowly rise during an era of significantly reduced industrial output, thanks to a lengthy economic depression that gripped the entire world.    What we end up with is a 30-year spike that also includes a few years of reduced industrial output, starting in the stagnating 1970s where oil production also got restricted thanks to onerous government policies and trade wars.</p><p>In climate terms, a 30-year spike is as significant as a surprisingly warm afternoon in late October.  Man, I wish we were going to have one of those today.</p><p>But then look what happens in the past 11 years in the bottom chart.  Despite the fact that the world’s nations continue to spew CO2 with no significant decline (except perhaps in the Great Recession period of 2008-9), the temperature record is remarkably stable.  In fact, it looks similar to the period between 1945 and 1970 on the top chart.  If global temperature increases really correlated directly to CO2 emissions, we wouldn’t see this at all; we’d see ever-escalating rates of increase in global temperatures, which is exactly what the AGW climate models predicted at the turn of the century.  They were proven wrong.</p><p>And in fact, Curry explains that the failure of those models finally has some scientists going back to the drawing board….</p><p>And what of Muller?  When confronted by the Daily Mail about the data from the past 11 years, he denied that temperatures had plateaued, and then admitted that the data shows exactly that.</p></blockquote><p>And yet the unthinking, unquestioning science fetishists still wonder why rational observers are deeply skeptical when scientists seeking huge quantities of money and global fame, and demanding massive societal change on the basis of what provides them with the aforementioned money and fame, are repeatedly caught out faking and misrepresenting the data.</p><p>The CO2 model is obviously wrong.  It has completely failed as a predictive model.  And, as I have been saying for years, global warming isn’t even taking place <i>and hasn’t been for longer than I have been posting on this blog.</i></p><p>Richard Muller may have once been a climate skeptic, (his biography suggests he is either lying or being misrepresented by others), but if so, the evidence suggests that he was not so much convinced by the data as corrupted by the benefits of jumping aboard the AGW/CC gravy train.  The increasingly inescapable conclusion, based on this and the increasing reports of scientific fraud, is that science should be considered intrinsically unreliable until it is successfully applied and is considered <i>engineering</i>.</p><p>And speaking of hiding the decline, Muller’s fellow-in-fraud, Michael “hockey stick” Mann <a href=\"http://www.omsj.org/corruption/michael-%E2%80%98climategate%E2%80%99-mann-suffers-three-legal-blows-in-court-escapade\">appears to be losing his battle </a>to hide the data:</p><p><i>“Discredited global warming scientist, Michael Mann, sees his last-ditch efforts to hide data fall apart as legal experts reveal a mountain of legal precedents against him.  In his recent papers (filed on September 2, 2011) Mann claims ‘academic freedom’ and ‘proprietary materials’ as his defense.  But legal experts who have since reviewed Mann’s submission to the Circuit Court of Prince William County, Va., say they are so full of holes they are doomed to fail.”</i></p><p>These “scientists” are all about the science and expanding human knowledge, aren’t they!  Let’s revisit a few of my favorite global warming quotes, shall we?</p><p>1. <i>According to Dr David Viner, a senior research scientist at the climatic research unit (CRU) of the University of East Anglia,within a few years winter snowfall will become “a very rare and exciting event.  Children just aren’t going to know what snow is,” he said.</i></p><p>2. <i>“Yes, it is quite probable that global warming has a significant anthropogenic component. About as probable as the idea that HIV causes AIDS, species diversity is driven by evolutionary processes, and that the world is round.”</i> – PZ Myers</p><p>3. <i>RT: Is global warming a threat to the human species?</i></p><p>Richard Dawkins: Yes.</p><p>4. <i>“The evidence is incontrovertible: Global warming is occurring.</i> – American Physical Society</p><p>5. <i>“The scientific evidence is clear: global climate change caused by human activities is occurring now, and it is a growing threat to society.”</i> – American Association for the Advancement of Science</p><p>6. <i>The Geological Society of America (GSA) supports the scientific conclusions that Earth’s climate is changing; the climate changes are due in part to human activities; and the probable consequences of the climate changes will be significant and blind to geopolitical boundaries.</i> – The Geological Society of America</p><p>7. <i>“The scientific understanding of climate change is now sufficiently clear to justify taking steps to reduce the amount of greenhouse gases in the atmosphere.” </i> – U.S. National Academy of Sciences</p><p>8. <i>Do you consider teaching someone about global warming, ozone holes, or ongoing extinctions, all established facts about our natural world, to be indoctrination?”</i> – PZ Myers</p><p>Established facts… established <i>scientific</i> facts are indeed indoctrination.  This means that we have no choice but to conclude that the definition of “established scientific fact” is sufficiently broad to include outright fiction and that appeals to “scientific consensus” possess no more legitimacy than appeals to reality TV.</p></div>",
  "content_text": "Richard Muller is the latest “scientist” to attempt to pass off\nanother an AGW/CC fraud\n:\nLast week, a research team at Berkeley led by a former climate change skeptic released a study of global temperatures that intended to set the record straight on controversial data collected by the East Anglia Project, NASA, and other organizations that have acted as advocates for action based on anthropogenic global warming.  Professor Richard Muller put together a graph of the data that supposedly showed warming from 1800 (roughly the beginning of the Industrial Era in Europe) through 1975, and then a steeper rise in temperatures that appears unstopped.  When this data was released, newspapers and other media proclaimed it the end of AGW skepticism and demanded capitulation from the “deniers.”…\nA closer look at the data and a Daily Mail interview with one of Muller’s team shows that the chart hides the fact that no warming has occurred in the last 11 years, as has been repeatedly pointed out:\nProf Judith Curry, who chairs the Department of Earth and Atmospheric Sciences at America’s prestigious Georgia Institute of Technology, said that Prof Muller’s claim that he has proven global warming sceptics wrong was also a ‘huge mistake’, with no  scientific basis.  Prof Curry is a distinguished climate researcher with more than 30 years experience and the second named co-author of the BEST project’s four research papers.\nHer comments, in an exclusive interview with The Mail on Sunday, seem certain to ignite a furious academic row. She said this affair had to be compared to the notorious ‘Climategate’ scandal two years ago. …\nIn fact, Prof Curry said, the project’s research data show there has been no increase in world temperatures since the end of the Nineties – a fact confirmed by a new analysis that The Mail on Sunday has obtained.  ‘There is no scientific basis for saying that warming hasn’t stopped,’ she said. ‘To say that there is detracts from the credibility of the data, which is very unfortunate.’\nLet’s take a look at Muller’s chart, and then compare it to the chart for the last 13 years — which the Daily Mail labels an “inconvenient truth”:\nFirst, let’s look at the top chart.  A closer reading of the top chart shows that, relative to the 1950-1980 average baseline BEST uses, temperatures didn’t actually warm at all until sometime during the Great Depression, so the entire first century of the Industrial Era apparently had no impact — in a period where the dirtiest of mass energy production processes was in widest use (coal).  Temperatures then started to slowly rise during an era of significantly reduced industrial output, thanks to a lengthy economic depression that gripped the entire world.    What we end up with is a 30-year spike that also includes a few years of reduced industrial output, starting in the stagnating 1970s where oil production also got restricted thanks to onerous government policies and trade wars.\nIn climate terms, a 30-year spike is as significant as a surprisingly warm afternoon in late October.  Man, I wish we were going to have one of those today.\nBut then look what happens in the past 11 years in the bottom chart.  Despite the fact that the world’s nations continue to spew CO2 with no significant decline (except perhaps in the Great Recession period of 2008-9), the temperature record is remarkably stable.  In fact, it looks similar to the period between 1945 and 1970 on the top chart.  If global temperature increases really correlated directly to CO2 emissions, we wouldn’t see this at all; we’d see ever-escalating rates of increase in global temperatures, which is exactly what the AGW climate models predicted at the turn of the century.  They were proven wrong.\nAnd in fact, Curry explains that the failure of those models finally has some scientists going back to the drawing board….\nAnd what of Muller?  When confronted by the Daily Mail about the data from the past 11 years, he denied that temperatures had plateaued, and then admitted that the data shows exactly that.\nAnd yet the unthinking, unquestioning science fetishists still wonder why rational observers are deeply skeptical when scientists seeking huge quantities of money and global fame, and demanding massive societal change on the basis of what provides them with the aforementioned money and fame, are repeatedly caught out faking and misrepresenting the data.\nThe CO2 model is obviously wrong.  It has completely failed as a predictive model.  And, as I have been saying for years, global warming isn’t even taking place\nand hasn’t been for longer than I have been posting on this blog.\nRichard Muller may have once been a climate skeptic, (his biography suggests he is either lying or being misrepresented by others), but if so, the evidence suggests that he was not so much convinced by the data as corrupted by the benefits of jumping aboard the AGW/CC gravy train.  The increasingly inescapable conclusion, based on this and the increasing reports of scientific fraud, is that science should be considered intrinsically unreliable until it is successfully applied and is considered\nengineering\n.\nAnd speaking of hiding the decline, Muller’s fellow-in-fraud, Michael “hockey stick” Mann\nappears to be losing his battle\nto hide the data:\n“Discredited global warming scientist, Michael Mann, sees his last-ditch efforts to hide data fall apart as legal experts reveal a mountain of legal precedents against him.  In his recent papers (filed on September 2, 2011) Mann claims ‘academic freedom’ and ‘proprietary materials’ as his defense.  But legal experts who have since reviewed Mann’s submission to the Circuit Court of Prince William County, Va., say they are so full of holes they are doomed to fail.”\nThese “scientists” are all about the science and expanding human knowledge, aren’t they!  Let’s revisit a few of my favorite global warming quotes, shall we?\n1.\nAccording to Dr David Viner, a senior research scientist at the climatic research unit (CRU) of the University of East Anglia,within a few years winter snowfall will become “a very rare and exciting event.  Children just aren’t going to know what snow is,” he said.\n2.\n“Yes, it is quite probable that global warming has a significant anthropogenic component. About as probable as the idea that HIV causes AIDS, species diversity is driven by evolutionary processes, and that the world is round.”\n– PZ Myers\n3.\nRT: Is global warming a threat to the human species?\nRichard Dawkins: Yes.\n4.\n“The evidence is incontrovertible: Global warming is occurring.\n– American Physical Society\n5.\n“The scientific evidence is clear: global climate change caused by human activities is occurring now, and it is a growing threat to society.”\n– American Association for the Advancement of Science\n6.\nThe Geological Society of America (GSA) supports the scientific conclusions that Earth’s climate is changing; the climate changes are due in part to human activities; and the probable consequences of the climate changes will be significant and blind to geopolitical boundaries.\n– The Geological Society of America\n7.\n“The scientific understanding of climate change is now sufficiently clear to justify taking steps to reduce the amount of greenhouse gases in the atmosphere.”\n– U.S. National Academy of Sciences\n8.\nDo you consider teaching someone about global warming, ozone holes, or ongoing extinctions, all established facts about our natural world, to be indoctrination?”\n– PZ Myers\nEstablished facts… established\nscientific\nfacts are indeed indoctrination.  This means that we have no choice but to conclude that the definition of “established scientific fact” is sufficiently broad to include outright fiction and that appeals to “scientific consensus” possess no more legitimacy than appeals to reality TV.",
  "tags": [
    "AGW/CC",
    "science"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-02T11:31:00+00:00"
}