{
  "url": "https://voxday.net/2011/11/11/hiding-depravity/",
  "scraped_at": "2025-12-13T23:27:04.370733",
  "title": "Hiding the depravity",
  "date_display": "November 11, 2011",
  "date_iso": "2011-11-11T14:30:00+00:00",
  "date_from_url": "2011-11-11",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>It’s always interesting to see precisely what people are attempting to hide or avoid when they utilize false equivalences or incorrect definitions:</p><blockquote><p>JT:  Was this man sexually attracted to boys?  Was he male also?  Yeah… That’s the very definition of homo-sexual.</p><p>Evil Kirk: By that logic, a man who molests a girl is a heterosexual, presumably the sexuality you identify with. So are you agreeing that molesting girls is part of your sexuality?</p></blockquote><p>First, I note that Evil Kirk doesn’t understand that JT is not relying on logic, but on a <i>definition</i>.  Resorting to the dictionary is not resorting to logic.  Second, his own attempt at logic suggests an inability to distinguish between the set and the sub-set.  Molesting girls cannot be an intrinsic aspect of heterosexuality because girls are also molested by women.  But molesting girls is certainly an intrinsically heterosexual act if perpetrated by a member of the opposite sex, just as molesting boys is an intrinsically homosexual act if perpetrated by a member of the same sex.</p><p>What Evil Kirk is attempting to avoid through his linguistic contortions is the fact that homosexual men are disproportionately likely to molest children.  Although they make up around 1.5% of the male population, they are responsible for approximately one-third of all child molestations.  This is why homosexuals try very hard to falsely impute a nonexistent aspect of age to both “homosexuality” and “heterosexuality”; they are seeking to conceal the fact that a statistically significant percentage of them are inclined to prey upon children.</p><p>My question to Evil Kirk is this: Were you intentionally attempting to hide the fact that homosexual men are around 20 times more likely to molest children than heterosexual men when you took exception to JT’s statement that a man who rapes a boy is, by definition, homosexual?  If not, what was the basis for your objection to JT’s statement?</p></div>",
  "content_text": "It’s always interesting to see precisely what people are attempting to hide or avoid when they utilize false equivalences or incorrect definitions:\nJT:  Was this man sexually attracted to boys?  Was he male also?  Yeah… That’s the very definition of homo-sexual.\nEvil Kirk: By that logic, a man who molests a girl is a heterosexual, presumably the sexuality you identify with. So are you agreeing that molesting girls is part of your sexuality?\nFirst, I note that Evil Kirk doesn’t understand that JT is not relying on logic, but on a\ndefinition\n.  Resorting to the dictionary is not resorting to logic.  Second, his own attempt at logic suggests an inability to distinguish between the set and the sub-set.  Molesting girls cannot be an intrinsic aspect of heterosexuality because girls are also molested by women.  But molesting girls is certainly an intrinsically heterosexual act if perpetrated by a member of the opposite sex, just as molesting boys is an intrinsically homosexual act if perpetrated by a member of the same sex.\nWhat Evil Kirk is attempting to avoid through his linguistic contortions is the fact that homosexual men are disproportionately likely to molest children.  Although they make up around 1.5% of the male population, they are responsible for approximately one-third of all child molestations.  This is why homosexuals try very hard to falsely impute a nonexistent aspect of age to both “homosexuality” and “heterosexuality”; they are seeking to conceal the fact that a statistically significant percentage of them are inclined to prey upon children.\nMy question to Evil Kirk is this: Were you intentionally attempting to hide the fact that homosexual men are around 20 times more likely to molest children than heterosexual men when you took exception to JT’s statement that a man who rapes a boy is, by definition, homosexual?  If not, what was the basis for your objection to JT’s statement?",
  "tags": [
    "anklebiters"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-11T14:30:00+00:00"
}