{
  "url": "https://voxday.net/2011/11/13/introverted-and-extroverted-blogs/",
  "scraped_at": "2025-12-13T23:27:13.376100",
  "title": "Introverted and Extroverted blogs",
  "date_display": "November 13, 2011",
  "date_iso": "2011-11-13T10:08:00+00:00",
  "date_from_url": "2011-11-13",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>I hadn’t previously read Jonathan Rauch’s <a href=\"http://www.theatlantic.com/magazine/archive/2003/03/caring-for-your-introvert/2696/\">popular article on introversion</a> in <i>The Atlantic</i>.  It’s simple, but pretty good, although I shudder to think that many people actually regarded this as containing much in the way of new information.</p><blockquote><p>Introverts are not necessarily shy. Shy people are anxious or frightened or self-excoriating in social settings; introverts generally are not. Introverts are also not misanthropic, though some of us do go along with Sartre as far as to say “Hell is other people at breakfast.” Rather, introverts are people who find other people tiring.</p><p>Extroverts are energized by people, and wilt or fade when alone. They often seem bored by themselves, in both senses of the expression. Leave an extrovert alone for two minutes and he will reach for his cell phone. In contrast, after an hour or two of being socially “on,” we introverts need to turn off and recharge. My own formula is roughly two hours alone for every hour of socializing. This isn’t antisocial. It isn’t a sign of depression. It does not call for medication. For introverts, to be alone with our thoughts is as restorative as sleeping, as nourishing as eating. Our motto: “I’m okay, you’re okay—in small doses.”</p></blockquote><p>One thing I’ve noticed is that this blog appears to be a stronghold of introversion, which may help explain why it has such a hard core, but relatively small readership.  For example, I actively dissuade what could be considered extrovert-style commenting – generally described in these parts as comment diarrhea – in which the commenter leaves many multiple one-line comments as they occur to him.  And I’ve also noted that many of the blogs with bigger traffic tend to have more and shorter posts.</p><p>It has never bothered me that more people might prefer other blogs to this one, nor did I ever wish to imitate them, but I did find it puzzling that so many people like to regularly read blogs that essentially say nothing, and say nothing so succinctly.  I’m not talking about aggregators like Drudge and Instapundit, you understand, but the sort of blogs where the commentary on the Republican debate is four lines or the contents of their meals is a frequent topic of conversation.  I’ve tried reading several very popular blogs on occasion, and to be honest, I not only could not read them regularly, I couldn’t even figure out why anyone was reading them.  Ever.</p><p>It couldn’t be described as an intelligence thing either.  Some of these bloggers were quite smart and very successful, others perhaps not quite so much, but the one thing they had in common is that a) their average post length is very short, both in terms of the selections from the links provided and their own writing, and b) their readers’ average time on site is measured in single-digit seconds.  That latter fact has always puzzled me too.  Who reads anything except Twitter or market prices in less than 10 seconds?  How is that even possible?  I understand that those who are checking back to see if there is a new post or not will tend to drive down the average, but why would there be so many multiples of post-checking in comparison with incidence of readers actually reading the posts?</p><p>If it is true that extroversion and introversion have fundamentally different styles of communication, then these differences should translate to blog writing, blog commenting, and even blog readerships as well.  This may also explain why most of the early big bloggers completely failed as book authors… authors tend to be introverts, for obvious reasons, whereas the more visible bloggers who attracted mainstream media attention are more likely to be extroverts and extroverts are seldom able to focus long enough to complete a <s>coherent thought</s>complete book.  SFWA President-For-Life John Scalzi of Whatever is an interesting case; is he an extroverted geek who is able to focus himself long enough to complete his books or an introvert who enjoys performing in public on occasion?  Since I find tend to find his approach to both his blog and his books rather scattershot, I suspect the former, but I wouldn’t bet much on it.  The Prince of Wängst strikes me as extremely introverted, as does Roissy.  Ann Althouse’s blog, on the other hand, appears to be of the extroverted variety.</p><p>To what extent the blog matches the blogger, or the readership, for that matter, I don’t know.  It’s more of an impression than an observation and I’d be interested in hearing your opinions about what blogs fit which category.  As should be obvious, like most of the readership, I am rather strongly introverted myself, which is why I always find it both bizarre and amusing when I am accused of writing things solely in order to attract attention.  That is the classic extrovert’s projection at work; they simply cannot imagine that anyone would not want to be on stage or appear on TV.</p><p>As for Rauch’s article, the best part of it is where he describes the concept of social fatigue.  At every social gathering, there is the inevitable moment when the mundane chatter surrounding me like an aural miasma appears to crescendo, grow ever more incoherent and frenetic, until it finally all fades away into the blessed silence inside my mind.</p><p>Occasionally someone will notice that I am paying absolutely no attention to the conversation and ask me what I am thinking.  This is a mistake.  But because I am sufficiently civilized, I never answer truthfully.  There is no benefit to sharing the dark thoughts inspired by an overdose of social exposure, and anyway, it’s nothing that a little time alone won’t cure.</p></div>",
  "content_text": "I hadn’t previously read Jonathan Rauch’s\npopular article on introversion\nin\nThe Atlantic\n.  It’s simple, but pretty good, although I shudder to think that many people actually regarded this as containing much in the way of new information.\nIntroverts are not necessarily shy. Shy people are anxious or frightened or self-excoriating in social settings; introverts generally are not. Introverts are also not misanthropic, though some of us do go along with Sartre as far as to say “Hell is other people at breakfast.” Rather, introverts are people who find other people tiring.\nExtroverts are energized by people, and wilt or fade when alone. They often seem bored by themselves, in both senses of the expression. Leave an extrovert alone for two minutes and he will reach for his cell phone. In contrast, after an hour or two of being socially “on,” we introverts need to turn off and recharge. My own formula is roughly two hours alone for every hour of socializing. This isn’t antisocial. It isn’t a sign of depression. It does not call for medication. For introverts, to be alone with our thoughts is as restorative as sleeping, as nourishing as eating. Our motto: “I’m okay, you’re okay—in small doses.”\nOne thing I’ve noticed is that this blog appears to be a stronghold of introversion, which may help explain why it has such a hard core, but relatively small readership.  For example, I actively dissuade what could be considered extrovert-style commenting – generally described in these parts as comment diarrhea – in which the commenter leaves many multiple one-line comments as they occur to him.  And I’ve also noted that many of the blogs with bigger traffic tend to have more and shorter posts.\nIt has never bothered me that more people might prefer other blogs to this one, nor did I ever wish to imitate them, but I did find it puzzling that so many people like to regularly read blogs that essentially say nothing, and say nothing so succinctly.  I’m not talking about aggregators like Drudge and Instapundit, you understand, but the sort of blogs where the commentary on the Republican debate is four lines or the contents of their meals is a frequent topic of conversation.  I’ve tried reading several very popular blogs on occasion, and to be honest, I not only could not read them regularly, I couldn’t even figure out why anyone was reading them.  Ever.\nIt couldn’t be described as an intelligence thing either.  Some of these bloggers were quite smart and very successful, others perhaps not quite so much, but the one thing they had in common is that a) their average post length is very short, both in terms of the selections from the links provided and their own writing, and b) their readers’ average time on site is measured in single-digit seconds.  That latter fact has always puzzled me too.  Who reads anything except Twitter or market prices in less than 10 seconds?  How is that even possible?  I understand that those who are checking back to see if there is a new post or not will tend to drive down the average, but why would there be so many multiples of post-checking in comparison with incidence of readers actually reading the posts?\nIf it is true that extroversion and introversion have fundamentally different styles of communication, then these differences should translate to blog writing, blog commenting, and even blog readerships as well.  This may also explain why most of the early big bloggers completely failed as book authors… authors tend to be introverts, for obvious reasons, whereas the more visible bloggers who attracted mainstream media attention are more likely to be extroverts and extroverts are seldom able to focus long enough to complete a\ncoherent thought\ncomplete book.  SFWA President-For-Life John Scalzi of Whatever is an interesting case; is he an extroverted geek who is able to focus himself long enough to complete his books or an introvert who enjoys performing in public on occasion?  Since I find tend to find his approach to both his blog and his books rather scattershot, I suspect the former, but I wouldn’t bet much on it.  The Prince of Wängst strikes me as extremely introverted, as does Roissy.  Ann Althouse’s blog, on the other hand, appears to be of the extroverted variety.\nTo what extent the blog matches the blogger, or the readership, for that matter, I don’t know.  It’s more of an impression than an observation and I’d be interested in hearing your opinions about what blogs fit which category.  As should be obvious, like most of the readership, I am rather strongly introverted myself, which is why I always find it both bizarre and amusing when I am accused of writing things solely in order to attract attention.  That is the classic extrovert’s projection at work; they simply cannot imagine that anyone would not want to be on stage or appear on TV.\nAs for Rauch’s article, the best part of it is where he describes the concept of social fatigue.  At every social gathering, there is the inevitable moment when the mundane chatter surrounding me like an aural miasma appears to crescendo, grow ever more incoherent and frenetic, until it finally all fades away into the blessed silence inside my mind.\nOccasionally someone will notice that I am paying absolutely no attention to the conversation and ask me what I am thinking.  This is a mistake.  But because I am sufficiently civilized, I never answer truthfully.  There is no benefit to sharing the dark thoughts inspired by an overdose of social exposure, and anyway, it’s nothing that a little time alone won’t cure.",
  "tags": [
    "media"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-13T10:08:00+00:00"
}