{
  "url": "https://voxday.net/2011/11/15/irony-3/",
  "scraped_at": "2025-12-13T23:27:27.986680",
  "title": "The irony",
  "date_display": "November 15, 2011",
  "date_iso": "2011-11-15T18:30:00+00:00",
  "date_from_url": "2011-11-15",
  "author": "VD",
  "content_html": "<div class=\"entry-content\"><p>Why should one assume that homosexuals know anything more about science <a href=\"http://www.dailymail.co.uk/news/article-2061734/Frontline-Church-publishes-Homosexuality-Fact-Sheet-convert-gay-people.html\">than they do about history</a>?</p><blockquote><p>Frontline, which is based in a former Army barracks in Wavertree, has been condemned by gay rights campaigners as trying to ‘repress’ people’s sexuality with ‘Dark Ages’ views.</p><p>The national Lesbian and Gay Foundation’s Andrew Gilliver said: ‘The issues about “childhood pain” are nonsense.  The pain is often caused by people who don’t understand what they’re going through.  We are born gay, but we learn prejudice. This is Dark Ages stuff.’</p></blockquote><p>In response to which I quote the 1929 Encyclopedia Britannica: <i>“[T]he contrast, once so fashionable, between the ages of darkness and the ages of light have no more truth in it than have the idealistic fancies which underlie attempts at mediaeval revivalism.”</i></p><p>Roissy has an article today about the way in which feminists are increasingly <a href=\"http://heartiste.wordpress.com/2011/11/15/feminists-are-afraid-of-evolutionary-psychology-and-with-good-reason\">caught with their pants down by science</a>.  It’s a cogent point, even if his definition of science includes things that are definitely non-science, such as evo psych.  The same is true of the homosexual community.  The “born gay” hypothesis has already been heavily damaged by genetic science and the more malleable human sexuality is determined to be, the more it becomes clear that even if initial sexual orientation is not a conscious choice, dynamic abnormalities are at least partially susceptible to normalization as various ex-gay ministries have claimed.</p><p>And even pride paraders should be entirely supportive of the idea that homosexuality can be cured.  Because the rapidly declining number of girls being born in China and India indicates that if the “born gay” hypothesis was correct, there will soon be very, very few homosexual individuals permitted to live once a method for prenatal orientation screening is developed.</p></div>",
  "content_text": "Why should one assume that homosexuals know anything more about science\nthan they do about history\n?\nFrontline, which is based in a former Army barracks in Wavertree, has been condemned by gay rights campaigners as trying to ‘repress’ people’s sexuality with ‘Dark Ages’ views.\nThe national Lesbian and Gay Foundation’s Andrew Gilliver said: ‘The issues about “childhood pain” are nonsense.  The pain is often caused by people who don’t understand what they’re going through.  We are born gay, but we learn prejudice. This is Dark Ages stuff.’\nIn response to which I quote the 1929 Encyclopedia Britannica:\n“[T]he contrast, once so fashionable, between the ages of darkness and the ages of light have no more truth in it than have the idealistic fancies which underlie attempts at mediaeval revivalism.”\nRoissy has an article today about the way in which feminists are increasingly\ncaught with their pants down by science\n.  It’s a cogent point, even if his definition of science includes things that are definitely non-science, such as evo psych.  The same is true of the homosexual community.  The “born gay” hypothesis has already been heavily damaged by genetic science and the more malleable human sexuality is determined to be, the more it becomes clear that even if initial sexual orientation is not a conscious choice, dynamic abnormalities are at least partially susceptible to normalization as various ex-gay ministries have claimed.\nAnd even pride paraders should be entirely supportive of the idea that homosexuality can be cured.  Because the rapidly declining number of girls being born in China and India indicates that if the “born gay” hypothesis was correct, there will soon be very, very few homosexual individuals permitted to live once a method for prenatal orientation screening is developed.",
  "tags": [
    "society"
  ],
  "categories": [],
  "sitemap_lastmod": "2011-11-15T18:30:00+00:00"
}